{"organizations": [], "uuid": "0b9d4a24166631e758429f4a50ce38a6e9b669c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225502700&w=1200&r=LYNXMPEE0P0XA", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/us-economy/u-s-economic-growth-slows-in-fourth-quarter-on-surging-imports-idINKBN1FF1WZ", "country": "US", "domain_rank": 408, "title": "U.S. economic growth slows in fourth-quarter on surging imports", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T16:25:00.000+02:00", "replies_count": 0, "uuid": "0b9d4a24166631e758429f4a50ce38a6e9b669c4"}, "author": "", "url": "https://in.reuters.com/article/us-economy/u-s-economic-growth-slows-in-fourth-quarter-on-surging-imports-idINKBN1FF1WZ", "ord_in_thread": 0, "title": "U.S. economic growth slows in fourth-quarter on surging imports", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "commerce department", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - U.S. economic growth unexpectedly slowed in the fourth quarter as the strongest pace of consumer spending in three years resulted in a surge in imports.\nGross domestic product expanded at a 2.6 percent annual rate in the fourth quarter, compared to 3.2 percent in the third quarter, restrained by a widening trade deficit and only modest inventory accumulation, the Commerce Department said on Friday.\nPresident Donald Trump’s goal is for U.S. economic growth of 3.0 percent annually and the Republican-controlled Congress in December pushed through a $1.5 trillion package of tax cuts in the largest overhaul of the tax code in 30 years in an attempt to boost growth.\nThe economy grew 2.3 percent in 2017, an acceleration from the 1.5 percent logged in 2016.\nImports, which subtract from GDP growth, increased at their fastest rate in more than seven years. Rising imports underscore the challenges that the Trump administration faces in its quest to boost annual GDP growth to 3.0 percent. They indicate that U.S. companies lack the capacity to meet buoyant domestic demand.\n“Domestic demand is strong, really strong, and perhaps beginning to push against the capacity constraints of the economy,” said Paul Mortimer-Lee, chief market economist at BNP Paribas in New York. “And this precedes effects from tax cuts.”\nA measure of domestic demand expanded at its quickest since the third quarter of 2014, highlighting the economy’s strength.\nStrong domestic demand is part of a synchronized global rebound that includes the euro zone and Asia.\nEconomists polled by Reuters had forecast the economy growing at a 3.0 percent pace in the final three months of 2017.\nThey expect annual GDP growth will hit the government’s 3.0 percent target this year, spurred in part by the tax cuts, a weak U.S. dollar, rising oil prices and a strengthening global economy.\nGrowth, economists believe, will slow in 2019, with a recession likely in 2020, given low savings.\n“Once the temporary boost from the tax cuts has faded, households’ disposable income gains won’t be strong enough to sustain similarly large increases in consumer spending that we have seen over the past several years,” said Harm Bandholz, chief U.S. economist at UniCredit Research in New York.\n“And with the savings rate close to a record-low, the ammunition from that side has gotten limited as well.”\nThe dollar fell against a basket of currencies and prices for U.S. Treasuries were trading lower after the GDP report. Stocks on Wall Street rose, with the Dow Jones Industrial Average hitting a record high.\nFILE PHOTO: People shop in Macy's Herald Square during early opening for the Black Friday sales in Manhattan, New York, U.S., November 23, 2017. REUTERS/Andrew Kelly/File Photo HOT CONSUMER SPENDING Consumer spending, which accounts for more than two-thirds of U.S. economic activity, increased at a 3.8 percent rate in the fourth quarter. That was the quickest pace since the fourth quarter of 2014. It followed a 2.2 percent rate of growth in the July-September quarter.\nThe surge, however, came at the expense of savings, which fell to $384.4 billion from $478.3 billion in the third quarter. The saving rate dropped to 2.6 percent from 3.3 percent in the prior period.\nCompanies failed to produce enough to meet demand last quarter, boosting imports, which grew at a 13.9 percent pace. That was fastest pace since the third quarter of 2010 and offset a rise in exports, which is being driven by dollar weakness.\nInternational trade sliced off 1.13 percentage points from GDP growth last quarter, the most in a year, after adding 0.36 percentage point in the third quarter.\n“The capacity to meet sharply rising demand is just not there,” said Joel Naroff, chief economist at Naroff Economic Advisors in Holland Pennsylvania.\n“Yes, industrial production should strengthen, but we will also have to get a lot of the rising demand from the rest of the world. So, expect imports to grow rapidly and the trade deficit to widen.”\nRobust consumer spending also limited the accumulation of inventories, which subtracted 0.67 percentage point from GDP growth after adding 0.79 percentage point in the prior period.\nThe acceleration in consumer spending raised inflation. The Federal Reserve’s preferred inflation gauge, the personal consumption expenditures (PCE) price index excluding food and energy, rose at a 1.9 percent rate. That was the quickest pace in more than a year and followed a 1.3 percent pace of increase in the third quarter.\nSigns of rising inflation together with a tightening labor market could put the Fed on a more aggressive path of interest rate increases than is currently being anticipated, economists say. The unemployment rate dropped seven-tenths of percentage point last year to a 17-year low of 4.1 percent.\nThe U.S. central bank has forecast three interest rate hikes this year, the same number as in 2017.\nBusiness investment in equipment grew at its quickest pace since the third quarter of 2014. While spending on equipment is likely to be underpinned in 2018 by the corporate income tax cuts and rising crude oil prices, there are signs that the momentum is slowing.\nA second report from the Commerce Department on Friday showed orders for non-defense capital goods excluding aircraft, a closely watched proxy for business spending plans, fell in December for the first time in six months.\nInvestment in homebuilding rebounded after contracting for two straight quarters. Government spending notched its fastest pace since the second quarter of 2015.\nOur ", "external_links": [], "published": "2018-01-26T16:25:00.000+02:00", "crawled": "2018-01-26T16:53:52.001+02:00", "highlightTitle": ""}