{"organizations": [], "uuid": "f2b7ac93800aa19eaae30870a79ffeb14add6bbf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-allot-expands-security-offering-with-acquisition-of-netonomy.html", "country": "US", "domain_rank": 767, "title": "Allot Expands Security Offering With Acquisition of Netonomy", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T14:00:00.000+02:00", "replies_count": 0, "uuid": "f2b7ac93800aa19eaae30870a79ffeb14add6bbf"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-allot-expands-security-offering-with-acquisition-of-netonomy.html", "ord_in_thread": 0, "title": "Allot Expands Security Offering With Acquisition of Netonomy", "locations": [], "entities": {"persons": [{"name": "netonomy", "sentiment": "none"}], "locations": [{"name": "netonomy hod hasharon", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}], "organizations": [{"name": "tase", "sentiment": "negative"}, {"name": "allot communications ltd.", "sentiment": "negative"}, {"name": "netonomy ltd.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOD HASHARON, Israel, January 16, 2018 /PRNewswire/ --\nAllot Communications Ltd. (NASDAQ: ALLT, TASE: ALLT), a provider of leading innovative network intelligence and security solutions for service providers worldwide, announced today that it has signed a definitive agreement to acquire Netonomy Ltd. , a developer of software-based cyber security for the connected home, with closing anticipated to occur in a very short period.\nThe acquisition is in line with Allot's strategy of providing Communications Service Providers (CSPs) with comprehensive security solutions for their customers. As the adoption of IoT and connected devices at home continues to grow rapidly, it is becoming increasingly difficult to manage and prevent security breaches on these devices. Netonomy's technology integrates a unique software component onto existing routers, enabling device management as well as a variety of protective security functionality on those devices.\nAllot's leading mobile protection solutions are already deployed widely by CSPs to protect their mobile customers. Leveraging Netonomy's technology in concert with Allot's solutions will provide CSPs the ability to offer comprehensive and seamless security to the consumer anywhere, anytime.\n\"Allot continues to invest in leading network-based security capabilities to empower CSPs to offer value added security services to consumers and businesses,\" said Erez Antebi, President and CEO at Allot. \"This acquisition complements our developments in Security by adding advanced home router protection capabilities, which are critical in the IoT Security value chain.\"\nThe consideration to be paid will not have a material impact on Allot's financial situation.\nAbout Allot Communications\nAllot Communications Ltd. (NASDAQ: ALLT, TASE: ALLT), is a provider of leading innovative network intelligence and security solutions for service providers worldwide, enhancing value to their customers. Our solutions are deployed globally for network and application analytics, traffic control and shaping, network-based security services, and more. Allot's multi-service platforms are deployed by over 500 mobile, fixed and cloud service providers and over 1000 enterprises. Our industry leading network-based security as a service solution has achieved over 50% penetration with some service providers and is already used by over 18 million subscribers in Europe. Allot. See. Control. Secure. For more information, visit http://www.allot.com .\nPublic Relations Contact:\nSigalit Orr\nDirector Corporate Communications\nInternational dialing +972-9-761-9171\nsorr@allot.com\nInvestor Relations Contact:\nGK Investor Relations\nEhud Helft/Gavriel Frohwein\n+1-646-688-3559\nallot@gkir.com\nSOURCE Allot Communications Ltd.", "external_links": [], "published": "2018-01-16T14:00:00.000+02:00", "crawled": "2018-01-16T17:05:34.002+02:00", "highlightTitle": ""}