{"organizations": [], "uuid": "0b7c13800b89f6ebe191330e707742a2d63cc5e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-valent-u-s-a-new-general-manager-of-valent-de-mexico.html", "country": "US", "domain_rank": 767, "title": "Valent U.S.A. New General Manager of Valent de Mexico", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-16T21:00:00.000+02:00", "replies_count": 0, "uuid": "0b7c13800b89f6ebe191330e707742a2d63cc5e3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-valent-u-s-a-new-general-manager-of-valent-de-mexico.html", "ord_in_thread": 0, "title": "Valent U.S.A. New General Manager of Valent de Mexico", "locations": [], "entities": {"persons": [{"name": "julian mo", "sentiment": "negative"}, {"name": "valent", "sentiment": "negative"}, {"name": "ricardo munoz", "sentiment": "none"}, {"name": "munoz", "sentiment": "none"}, {"name": "montes", "sentiment": "none"}, {"name": "matt plitt", "sentiment": "none"}], "locations": [{"name": "valent de mexico walnut creek", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "arysta lifescience", "sentiment": "none"}, {"name": "valent u.s.a. montes", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "guadalajara", "sentiment": "none"}, {"name": "jalisco", "sentiment": "none"}], "organizations": [{"name": "valent u.s.a. llc", "sentiment": "negative"}, {"name": "valent de mexico", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WALNUT CREEK, Calif., Jan. 16, 2018 /PRNewswire/ -- Valent U.S.A. LLC announced today that Julian Montes has been named the new general manager of Valent de Mexico (VdM), reporting directly to Matt Plitt, executive vice president and COO of Valent U.S.A. Montes succeeds Ricardo Munoz, general director, VdM, who has announced he will retire. Under Munoz' leadership, VdM was established in 1994 and is now a recognized industry leader in agriculture innovation, crop protection tools and customer service in the Mexico market.\nMontes will assume leadership of the VdM team on January 19, 2018, and oversee the sales and marketing of Valent's broad portfolio of products and technologies to help growers in the Mexico market meet their crop protection needs. He will be based at VdM headquarters in Guadalajara, Jalisco, Mexico.\nMontes comes to Valent with more than 20 years of experience, including 10 years of progressive management in the crop protection industry. He was most recently with Arysta LifeScience in Mexico, where he served as the head of Marketing since 2013. He previously held management positions with DuPont across major business units, including Agriculture, Packaging Solutions, and Biotech-based Materials.\n\"Valent has had a continued presence in Mexico for nearly 25 years,\" said Plitt. \"Julian's deep experience in integrated crop protection solutions, and proven business leadership makes him a great fit for this important role as we continue to invest for long-term growth through partnerships, segment expansion and innovation.\"\nMontes holds an MBA from Duke University's Fuqua School of Business, and a BE in Industrial Engineering from Universidad de Los Andes. He recently completed an executive education program titled \"Improvement of Management\" at the IPADE Business School in Mexico.\nAbout Valent de Mexico\nValent de Mexico is a subsidiary of Valent U.S.A., a Sumitomo Chemical Company. With more than 20 years in the market, Valent de Mexico was the first company within the Mexican Crop Protection Industry to incorporate conventional and biorational proprietary products into their own portfolio. Valent de Mexico is well recognized for working closely with end users and distribution, offering integrated solutions as specialized products with strong field support for Crop Protection and Crop Production needs by growers in Mexico. VdM is headquartered in Guadalajara, Jalisco, Mexico and have Sales and Technical service personnel nationwide. The company web site is www.valent.mx .\nAbout Valent U.S.A. LLC\nValent U.S.A. LLC, headquartered in Walnut Creek, Calif., develops and markets products in the United States, Canada and Mexico that protect agricultural crops, enhance crop yields, improve food quality, beautify the environment and safeguard public health. Valent products include a well-known line of quality herbicide, insecticide, fungicide and crop enhancement products for agricultural, seed protection and professional use. Valent is a leader in marketing and sales of both traditional chemical products and also biorational products developed by its affiliate, Valent BioSciences LLC. For more information about Valent or our full product line, please call 800-6-VALENT (682-5368) or visit valent.com .\nAbout Sumitomo Chemical Company, Limited\nHeadquartered in Tokyo, Japan, Sumitomo Chemical is one of Japan's leading chemical companies, offering a diverse range of products globally in the fields of petrochemicals, energy and functional materials, IT-related chemicals and materials, health and crop science products, and pharmaceuticals. The company's consolidated net sales for fiscal year 2016 were JPY 2.0 trillion. For additional information, visit the company's website at www.sumitomo-chem.co.jp/english/ .\nView original content: http://www.prnewswire.com/news-releases/valent-usa-new-general-manager-of-valent-de-mexico-300583160.html\nSOURCE Valent U.S.A. LLC", "external_links": ["http://www.prnewswire.com/news-releases/valent-usa-new-general-manager-of-valent-de-mexico-300583160.html", "http://www.sumitomo-chem.co.jp/english/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.valent.mx&esheet=50824358&newsitemid=20140313005810&lan=en-US&anchor=www.valent.mx&index=1&md5=23d8d147cb2b023486bf965d1cdc754f"], "published": "2018-01-16T21:00:00.000+02:00", "crawled": "2018-01-16T21:01:54.010+02:00", "highlightTitle": ""}