{"organizations": [], "uuid": "74ee29c4810f5112def29857589b173527a54552", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-costa-rica-election/evangelical-candidate-now-front-runner-in-costa-rica-presidential-race-idUSKBN1FC2XB", "country": "US", "domain_rank": 408, "title": "Evangelical candidate now front-runner in Costa Rica presidential race", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T22:35:00.000+02:00", "replies_count": 0, "uuid": "74ee29c4810f5112def29857589b173527a54552"}, "author": "", "url": "https://www.reuters.com/article/us-costa-rica-election/evangelical-candidate-now-front-runner-in-costa-rica-presidential-race-idUSKBN1FC2XB", "ord_in_thread": 0, "title": "Evangelical candidate now front-runner in Costa Rica presidential race", "locations": [], "entities": {"persons": [{"name": "fabricio alvarado", "sentiment": "none"}, {"name": "antonio alvarez desanti", "sentiment": "none"}, {"name": "juan diego castro", "sentiment": "none"}], "locations": [{"name": "costa rica", "sentiment": "none"}, {"name": "san jose", "sentiment": "none"}, {"name": "central america", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "center for research and political studies", "sentiment": "none"}, {"name": "university of costa rica", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "national restoration party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 8:36 PM / in 10 minutes Evangelical candidate now front-runner in Costa Rica presidential race Reuters Staff 3 Min Read \nSAN JOSE (Reuters) - A conservative Christian evangelical has jumped to the front of the race in the first round of Costa Rica’s presidential election next month, boosted by his opposition to gay marriage, according to an opinion poll published on Tuesday. \nFabricio Alvarado, a 43-year-old journalist and the only lawmaker from the evangelical National Restoration party, led the survey by the Center for Research and Political Studies (CIEP) at the University of Costa Rica with 17 percent support. \nGiven the margin of error, he was virtually tied with conservative lawyer Juan Diego Castro, who had the backing of 16 percent of respondents ahead of the Feb. 4 vote. \nCoffee-producing Costa Rica, one of the more prosperous and stable countries in Central America, had been ruled by a two-party dynasty until an upset in the 2014 vote that brought to power a center-left academic who had never held elected office. \nAntonio Alvarez Desanti, from the traditionally powerful National Liberation Party (PLN), dropped to third with 11 percent support, according to the CIEP study. The poll was based on 1,013 telephone interviews carried out from Jan. 15 to 17 and had a margin of error of 3.1 percentage points. \nSome 27 percent of voters were undecided and all 13 candidates were far from the 40 percent minimum needed to win outright in the first round. \nWithout an outright winner, the two best-placed candidates would head to a runoff in early April. \nCastro, who served as security minister in the 1990s, led during the first months of the campaign by promising to tackle corruption and crime. He is running for the small National Integration Party (PIN). \nBut Alvarado’s opposition to a January ruling by the Inter-American Court of Human Rights, which called for the legalization of same-sex marriage, helped him to climb 14 percentage points in one month, according to the survey. \nUnder Costa Rican law, incumbent President Luis Guillermo Solis cannot seek immediate re-election. \nCarlos Alvarado, the candidate from Solis’ Citizens’ Action Party (PAC), had only 6 percent support amid allegations of corruption against the Solis administration. Reporting by Enrique Andres Pretel; Editing by Peter Cooney", "external_links": [], "published": "2018-01-23T22:35:00.000+02:00", "crawled": "2018-01-23T22:49:05.014+02:00", "highlightTitle": ""}