{"organizations": [], "uuid": "a2251143aa935efebecf7939392e2718750c2ad6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220241884&w=1200&r=LYNXMPEE070M6", "site_section": "https://www.reuters.com/finance/commodities", "section_title": "Commodities News, Commodity Trading Prices &amp; Data | Reuters.com", "url": "https://www.reuters.com/article/us-china-steel-capacity/china-issues-stricter-rules-on-building-new-steel-capacity-industry-ministry-idUSKBN1EX0NU", "country": "US", "domain_rank": 408, "title": "China issues stricter rules on building new steel capacity: industry ministry", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T16:48:00.000+02:00", "replies_count": 0, "uuid": "a2251143aa935efebecf7939392e2718750c2ad6"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-china-steel-capacity/china-issues-stricter-rules-on-building-new-steel-capacity-industry-ministry-idUSKBN1EX0NU", "ord_in_thread": 0, "title": "China issues stricter rules on building new steel capacity: industry ministry", "locations": [], "entities": {"persons": [], "locations": [{"name": "shanghai", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "hangzhou", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "ministry of industry and information technology", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHANGHAI (Reuters) - China has issued stricter rules on building new steel production capacity to replace obsolete facilities, the Ministry of Industry and Information Technology said on Monday.\nThe move has underscored China’s determination to ban growth in its massive steel sector and turned steel prices to positive from negative as investors expected China’s steel capacity will continue falling this year.\nChina, the world’s top steel producer, will allow one ton of new capacity to be built for a minimum of 1.25 tonnes of old capacity closed in environmentally sensitive regions, effective this year, the ministry said in a statement.\nThe statement, long-awaited by market players, offered clearer details on closing capacities to build new plants, based on the size of blast furnace, converters and other facilities to be shut down.\nThe strict standard on capacities swaps has eased market worries that China will not loosen its restrictions on building new projects, a manager with a trading firm in Hangzhou said, declining to be named as he is not authorized to speak to media.\nThe most-traded rebar futures on the Shanghai Futures Exchange spiked in the last trading hour, lifted by the statement, even as demand remained tepid. It rose 0.7 percent to 3,818 yuan a ton by the close. [IRONORE/]\nThe new rules are a sign China will continue to deepen its efforts to push supply-side reform and reduce overcapacity in the sector. China is aiming to cut steel capacity by 100 million to 150 million tonnes over the 2016-2020 period, the country’s State Council said in early 2016 as part of a five-year plan.\nThe new guidelines include clearer details on closing capacities to build new plants, based on the size of blast furnace, converters and other facilities to be shut down.\nTop steelmaking provinces Hebei and Jiangsu are among the environmentally sensitive regions named in the document.\nSteelmakers that plan to build new capacities will have to shut a certain number of existing ones first, according to the statement. Mills that have closed illegal capacities or obtained financial and policy assistance to help shut plants will not be allowed to build new ones.\nReporting by Ruby Lian and Tom Daly; Editing by Tom Hogue and Louise Heavens\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-08T16:48:00.000+02:00", "crawled": "2018-01-08T13:59:25.009+02:00", "highlightTitle": ""}