{"organizations": [], "uuid": "5d16b03215980f5b65ec711940fae5f2d8fe3aa9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-health-heart-cardiac-arrest/hospital-patients-less-likely-to-survive-off-hours-cardiac-arrest-idUKKBN1FB2Q5", "country": "US", "domain_rank": 408, "title": "Hospital patients less likely to survive 'off-hours' cardiac arrest", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T21:30:00.000+02:00", "replies_count": 0, "uuid": "5d16b03215980f5b65ec711940fae5f2d8fe3aa9"}, "author": "", "url": "https://uk.reuters.com/article/us-health-heart-cardiac-arrest/hospital-patients-less-likely-to-survive-off-hours-cardiac-arrest-idUKKBN1FB2Q5", "ord_in_thread": 0, "title": "Hospital patients less likely to survive 'off-hours' cardiac arrest", "locations": [], "entities": {"persons": [{"name": "lisa rapaport", "sentiment": "none"}, {"name": "uchenna ofoma", "sentiment": "none"}], "locations": [{"name": "danville", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}, {"name": "temple university", "sentiment": "none"}, {"name": "geisinger health system", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 7:33 PM / Updated 2 hours ago Hospital patients less likely to survive 'off-hours' cardiac arrest Lisa Rapaport 4 Min Read \n(Reuters Health) - Hospital patients who have a cardiac arrest may be more likely to die if it happens in the middle of the night or on a weekend than if it occurs on a weekday, a U.S. study suggests. \nResearchers examined data on more than 151,000 adults who had a cardiac arrest at 470 U.S. hospitals between 2000 and 2014. \nFor people who had a cardiac arrest during the “off-hours” on weekends and from 11 p.m. to 7 a.m. during the week, survival odds improved from about 12 percent at the start of the study to about 22 percent by the end. Patients who experienced a cardiac arrest during weekday “on-hours” from 7 a.m. to 11 p.m. fared better, and their survival odds climbed from 16 percent to 25 percent by the end of the study. \n“Survival to hospital discharge has improved over time in both groups of patients, on-hours and off-hours,” said lead study author Dr. Uchenna Ofoma of Temple University and Geisinger Health System in Danville, Pennsylvania. \n“However, the persistent survival disparities between on-hours and off-hours arrest remains concerning,” Ofoma said by email. \nIt’s unclear why this is happening, or to what extent it might be due to reduced staffing, less availability of specialists or fewer people around to notice and respond to problems during the off-hours, Ofoma added. \n“This is the million-dollar question,” Ofoma said. “Survival from in-hospital cardiac arrest is integrally dependent on early recognition and prompt initiation of high-quality resuscitation, coupled with high-quality post-resuscitation care for those who survive initial resuscitation.” \nCardiac arrest involves the abrupt loss of heart function, breathing and consciousness. Unlike a heart attack, which happens when blood flow to a portion of the heart is blocked, cardiac arrest occurs when the heart’s electrical system malfunctions, often due to irregular heart rhythms. \nThese events are often fatal, although survival odds are typically much better when a cardiac arrest happens inside a hospital than when it occurs elsewhere. \nIn the current study, roughly 79,000 patients, or 52 percent, had a cardiac arrest during off-hours in the hospital. The rest of the patients had an event during on-hours. \nAmong all the patients in the study, about 94,000, or 62 percent, survived the initial resuscitation efforts that happened right after they went into cardiac arrest. \nOnly about 28,000 people, or 19 percent, survived until they could be sent home from the hospital. \nWith the on-hours cardiac arrest patients, 21 percent survived until discharge, compared with 17 percent of the patients who had an off-hours cardiac arrest. \nPatients who have off-hours cardiac arrest might be sicker than other people in ways that weren’t measured in the study, researchers note in a report scheduled for publication in the Journal of the American College of Cardiology. Researchers also lacked data on physician and nurse staffing levels. \n“The availability of advanced forms of care varies by time of day,” said Dr. Julia Indik, author of an accompanying editorial and a professor at the Sarver Heart Center at the University of Arizona in Tucson. \n“Certain types of procedures that can be life-saving require highly trained sub-specialists and highly trained teams that are not on the premises of a hospital 24-7,” Indik said by email. \nWhile patients and families can’t control when a cardiac arrest might happen, they can help survival odds by making sure hospital staff have as much information as possible about the patient,” Indik said. \n“The staff needs to know as much as they can about their patients, what medications they were taking before they came to the hospital, and what other substances may have been used such as illicit drugs or alcohol, as this is critical information for the health care team,” Indik advised. \nSOURCE: bit.ly/2mYrsAI Journal of the American College of Cardiology, released January 22, 2018.", "external_links": [], "published": "2018-01-22T21:30:00.000+02:00", "crawled": "2018-01-22T22:13:03.000+02:00", "highlightTitle": ""}