{"organizations": [], "uuid": "71cf77b4eb71d838c690b845944c5d507921c786", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/business-wire-radian-provides-update-on-capital-actions-comments-on-proposed-changes-to-pmiers-and-sets-fourth-quarter-2017-conference.html", "country": "US", "domain_rank": 767, "title": "Radian Provides Update on Capital Actions, Comments on Proposed Changes to PMIERs and Sets Fourth Quarter 2017 Conference Call for February 1, 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.035, "site_type": "news", "published": "2018-01-18T00:30:00.000+02:00", "replies_count": 0, "uuid": "71cf77b4eb71d838c690b845944c5d507921c786"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/business-wire-radian-provides-update-on-capital-actions-comments-on-proposed-changes-to-pmiers-and-sets-fourth-quarter-2017-conference.html", "ord_in_thread": 0, "title": "Radian Provides Update on Capital Actions, Comments on Proposed Changes to PMIERs and Sets Fourth Quarter 2017 Conference Call for February 1, 2018", "locations": [], "entities": {"persons": [{"name": "fannie", "sentiment": "none"}], "locations": [{"name": "philadelphia", "sentiment": "none"}], "organizations": [{"name": "mi reinsurance program radian guaranty", "sentiment": "none"}, {"name": "radian group inc.", "sentiment": "none"}, {"name": "radian guaranty inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "-- Leverages financial flexibility and strengthens PMIERs financial position at low cost by expanding existing reinsurance program and issuing intercompany surplus note --\n-- Expects to comply with the proposed PMIERs by the effective date without a need to take further actions --\nPHILADELPHIA--(BUSINESS WIRE)-- Radian Group Inc. today announced that it has taken the following actions in order to leverage its financial flexibility and cost-effectively strengthen the financial position of Radian Guaranty Inc., its principal mortgage insurance (MI) subsidiary, under the Private Mortgage Insurer Eligibility Requirements (PMIERs):\nEnhancements to Single-Premium MI Reinsurance Program\nRadian Guaranty has agreed with its reinsurance providers to increase the cession of business for its first single-premium MI quota share reinsurance arrangement, which was entered into in 2016. The cession of business increased from 35 to 65 percent for single-premium policies with effective dates in 2015 through 2017. This increased cession, which is effective December 31, 2017, has been approved by Fannie Mae and Freddie Mac (the GSEs). As previously announced, the company entered into a second single-premium MI quota share reinsurance arrangement in October 2017, with 65 percent cession on single-premium policies with effective dates in 2018 and 2019. This reinsurance arrangement has also been approved by the GSEs. These actions are consistent with the company’s continued focus on effectively managing its capital position in a cost-efficient manner, improving its return on capital and proactively managing the retained mix of single-premium business in its total MI portfolio. Issuance of Intercompany Surplus Note\nOn December 28, 2017, Radian Group transferred $100 million of cash and marketable securities to Radian Guaranty in exchange for a surplus note. The intercompany surplus note has a 0 percent interest rate and a stated maturity date of December 31, 2027. The surplus note may be redeemed at any time upon 30 days prior notice, subject to the approval of the Pennsylvania Insurance Department. Any redemption of the surplus note increases holding company liquidity by the corresponding amount of the redemption.\nAs a result of these capital actions, at December 31, 2017, Radian Guaranty’s “Available Assets” under the PMIERs were approximately $3.7 billion and its “Minimum Required Assets” under the PMIERs were approximately $3.2 billion, resulting in an excess of approximately $450 million, or 14 percent. This compares to an excess of approximately $237 million, or 7 percent, at September 30, 2017. In addition, Radian Group maintained approximately $200 million of available liquidity as of December 31, 2017. Total available liquidity, which includes the company’s $225 million unsecured revolving credit facility entered into in October 2017, was approximately $425 million as of December 31, 2017.\nAs expected, Radian Guaranty experienced a recent increase in reported delinquencies in hurricane-affected areas. Given that the PMIERs require Radian to maintain significantly more Minimum Required Assets for delinquent loans than for performing loans, the company’s Minimum Required Assets from FEMA-designated areas increased by approximately $100 million as of December 31, 2017, as compared to September 30, 2017. The company believes that these hurricane-related delinquencies have reached their peak and, based on past experience, continues to expect that these delinquencies will not result in a material number of new paid claims.\nProposed Changes to PMIERs\nOn December 18, 2017, Radian Guaranty received a summary of proposed changes to the PMIERs that are being recommended to the Federal Housing Finance Agency (FHFA) by the GSEs. Based on this initial summary, which remains subject to comment by the private mortgage insurance industry, Radian expects to be able to fully comply with the proposed PMIERs and to maintain an excess of Available Assets over Minimum Required Assets under the PMIERs as of the expected effective date in late 2018, without a need to take further actions to do so. The company’s expectation is not dependent upon the existing surplus note and is based on its projections for positive operating results in 2018, its strong capital position, and the benefits of its reinsurance programs.\nIn response to the GSEs’ request, Radian expects to provide initial comments on the proposed PMIERs to the GSEs and the FHFA, which will include the company’s suggested modifications. Once the proposed PMIERs are finalized, the company anticipates a six-month implementation period before they are effective, which is expected to be no earlier than the fourth quarter of 2018. Radian is subject to non-disclosure agreements with each of the GSEs covering the specific provisions of the GSE-recommended changes.\n“Our ongoing compliance with PMIERs allows us to continue to support our customers with the products and services they need, and helps create sustainable homeownership opportunities for more families,” said Radian Chief Executive Officer Rick Thornberry. “I am pleased with our financial strength and flexibility, which allow us to effectively manage our capital position today and are expected to enable us to comply with the proposed changes to PMIERs.”\nFourth Quarter and Year-end 2017 Conference Call\nRadian will hold a conference call on Thursday, February 1, 2018, at 10:00 a.m. Eastern time to discuss the company’s fourth quarter and year-end 2017 results, which will be announced prior to the market open on the same day.\nThe conference call will be broadcast live over the Internet at http://www.radian.biz/page?name=Webcasts or at www.radian.biz . The call may also be accessed by dialing 800.230.1093 inside the U.S., or 612.332.0226 for international callers, using passcode 443361 or by referencing Radian.\nA replay of the webcast will be available on the Radian website approximately two hours after the live broadcast ends for a period of one year. A replay of the conference call will be available approximately two and a half hours after the call ends for a period of two weeks, using the following dial-in numbers and passcode: 800.475.6701 inside the U.S., or 320.365.3844 for international callers, passcode 443361.\nIn addition to the information provided in the company's earnings news release, other statistical and financial information, which is expected to be referred to during the conference call, will be available on Radian's website under Investors >Quarterly Results, or by clicking on http://www.radian.biz/page?name=QuarterlyResults .\nAbout Radian\nRadian Group Inc. (NYSE: RDN), headquartered in Philadelphia, provides private mortgage insurance, risk management products and real estate services to financial institutions. Radian offers products and services through two business segments:\nMortgage Insurance , through its principal mortgage insurance subsidiary Radian Guaranty Inc. This private mortgage insurance helps protect lenders from default-related losses, facilitates the sale of low-downpayment mortgages in the secondary market and enables homebuyers to purchase homes more quickly with downpayments less than 20%. Mortgage and Real Estate Services , through its principal services subsidiary Clayton, as well as", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.radian.biz%2F&esheet=51744908&newsitemid=20180117006439&lan=en-US&anchor=www.radian.biz&index=4&md5=85252da3ec9c83195a25071859da5df1", "http://www.radian.biz/page?name=QuarterlyResults", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.radian.biz%2Fpage%3Fname%3DQuarterlyResults&esheet=51744908&newsitemid=20180117006439&lan=en-US&anchor=http%3A%2F%2Fwww.radian.biz%2Fpage%3Fname%3DQuarterlyResults&index=3&md5=8918f7c9ce9b0802d877b9584a3105cb", "http://www.radian.biz/page?name=Webcasts", "http://www.businesswire.com/news/home/20180117006439/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.radian.biz&esheet=51744908&newsitemid=20180117006439&lan=en-US&anchor=www.radian.biz&index=2&md5=431b8bdf78e7b7ef53f5dabfbfccde6b", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.radian.biz%2Fpage%3Fname%3DWebcasts&esheet=51744908&newsitemid=20180117006439&lan=en-US&anchor=http%3A%2F%2Fwww.radian.biz%2Fpage%3Fname%3DWebcasts&index=1&md5=79414465484764a1779f51915289962f"], "published": "2018-01-18T00:30:00.000+02:00", "crawled": "2018-01-18T00:29:39.032+02:00", "highlightTitle": ""}