{"organizations": [], "uuid": "b941b383e794f752a59f25ff3923f8cc9fcc7bf8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 99}, "facebook": {"likes": 32, "shares": 32, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-912288278.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/30/bitcoin-cryptocurrency-blockchain-technology-price-falling-crashing/", "country": "US", "domain_rank": 1196, "title": "Commentary: The Crypto Community Is Dividing—And That’s Good | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.101, "site_type": "news", "published": "2018-01-30T02:00:00.000+02:00", "replies_count": 0, "uuid": "b941b383e794f752a59f25ff3923f8cc9fcc7bf8"}, "author": "Daniel J. Arbess", "url": "http://fortune.com/2018/01/30/bitcoin-cryptocurrency-blockchain-technology-price-falling-crashing/", "ord_in_thread": 0, "title": "Commentary: The Crypto Community Is Dividing—And That’s Good | Fortune", "locations": [], "entities": {"persons": [{"name": "daniel j. arbess", "sentiment": "negative"}], "locations": [{"name": "davos", "sentiment": "none"}], "organizations": [{"name": "wef", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Daniel J. Arbess January 30, 2018 \nIf the discussions outside the meetings of the World Economic Forum (WEF) at Davos last week were any indication, the recent crypto-chaos may finally be subsiding. The fog of frenzied cryptocurrency trading looks like it may soon dissipate, leaving markets and society with more of the good that’s resulted from its foundational technology—frictionless, secure, and efficient virtualized transaction settlements—and less of the bad—highly speculative cryptocurrency trading. \nThere were two tribes of passionate cryptonistas on the Davos Promenade: the monetary renegades and the transaction settlers. These tribes represent the two dominant species of the cryptocurrency ecosystem: the blockchain (the most prominent secure distributed ledger, or public transaction database) and Bitcoin (the most prominent virtual currency). Fortunately, based on my experience at Davos, it appears that the settlers are gaining the upper hand. \nThe renegades, inspired by 2007–08 financial crisis, don’t trust central banks and fiat money; they want a new global currency with limited supply. They want to settle all kinds of transactions denominated in their favorite cryptocurrencies on secure distributed ledgers (DL). The settlers, by contrast, are prioritizing the speed, reliability, and security of cloud-based, virtual ledgers. They generally don’t have a preference on whether transactions use fiat or crypto money. \nSatoshi Nakamoto, the unknown creator (or creators) of Bitcoin and blockchain, would probably be classified as a renegade. But even Nakamoto realized that their bitcoin would be worthless funny money unless it could be used to buy goods and services in the real economy, so they created the blockchain as a secure way to transact. Nakamoto brilliantly crowd-sourced the massive computing power needed to mine bitcoin, which are required to pay for transaction settlement blocks on the blockchain. \nThe renegades want to see the price of Bitcoin and other cryptocurrencies continue rising. But unfortunately, producers and consumers haven’t rushed (at least yet) to accept Bitcoin, and the daily proliferation of hundreds of other forms of cryptocurrency like Ethereum and Ripple (with their own corresponding specialized DLs) is only adding to the confusion. So people are mostly buying all these cyrptocurrencies because other people are buying them first. That’s driving the price up and fueling the recent investor frenzy. \nSure, one bitcoin could be worth $12,000—or even $20,000—if price were the same thing as value. But it isn’t. Value is anchored by exchanges of goods and services in the real world. Until one or more cryptocurrencies are accepted as legal and practical tender, cryptocurrency is no medium of exchange; it’s a classic object of speculation. \nIt’s hard to predict whether cryptocurrency will eventually become an accepted medium of exchange here on Earth. But it’s easy to see why settlers think DLs will stick around, as they’re simply an updated and improved way of settling old-fashioned business in our daily lives. DLs have an obvious benefit; they reduce friction in digital transactions and improve settlement accuracy and reliability. The settlers are hard at work, enthusiastically building DLs that are more energy efficient, more tailored to specific transaction types, and easier to use than Satoshi’s blockchain. The settlers don’t necessarily care about cryptocurrencies; they’ll work with whatever coin their ledger users prefer. \nThe renegades were a scarce breed at Davos relative to their recent obsessively high profile in the financial press, while the settlers were out in force. That’s great news, because the settlers are the ones building robust systems that will eventually bring horse-and-buggy-era settlements out of the back office and securely onto the cloud, where they’ll be executed with less waste, more speed, and precision. \nSettlers are deploying technology for real productive purposes, as opposed to dystopian fantasies of monetary anarchy. Technology is constantly improving the human condition in many areas, including education, social participation, health. I’ll take evolution over revolution any day. \nDaniel J. Arbess is an investor and policy analyst, the CEO of Xerion Investments, and a co-founder of No Labels . SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-30T02:00:00.000+02:00", "crawled": "2018-01-31T15:02:08.091+02:00", "highlightTitle": ""}