{"organizations": [], "uuid": "b1cbf948c6fb8e6972c6f59971c1c59f28742bf8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-keycorp-names-kim-manigault-as-chief-diversity-inclusion-officer.html", "country": "US", "domain_rank": 767, "title": "KeyCorp Names Kim Manigault As Chief Diversity & Inclusion Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T18:00:00.000+02:00", "replies_count": 0, "uuid": "b1cbf948c6fb8e6972c6f59971c1c59f28742bf8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-keycorp-names-kim-manigault-as-chief-diversity-inclusion-officer.html", "ord_in_thread": 0, "title": "KeyCorp Names Kim Manigault As Chief Diversity & Inclusion Officer", "locations": [], "entities": {"persons": [{"name": "kim manigault", "sentiment": "negative"}, {"name": "beth mooney", "sentiment": "none"}, {"name": "kim", "sentiment": "none"}, {"name": "manigault", "sentiment": "none"}, {"name": "trina evans", "sentiment": "none"}], "locations": [{"name": "cleveland", "sentiment": "none"}], "organizations": [{"name": "keycorp", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "poppie parish", "sentiment": "none"}, {"name": "diversity & inclusion", "sentiment": "none"}, {"name": "keybank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CLEVELAND, Jan. 25, 2018 /PRNewswire/ -- KeyCorp (NYSE: KEY) today announced that Kim Manigault has been named as Chief Diversity & Inclusion Officer for the company. In this role, Manigault will be responsible for championing a diverse workforce and leading the long-term planning and execution of related initiatives across the organization. Manigault replaces Poppie Parish who retired from Key at the end of 2017.\n\"KeyBank has long been recognized as a leader in workplace and supplier diversity for our industry,\" said Beth Mooney, Chairman and CEO, KeyCorp. \"From the Boardroom to the backroom, I am proud of the culture we have at Key. Kim is the perfect leader to build on this record. She will work with our business leaders to accelerate performance by championing diversity and inclusion throughout our workforce, in our workplace and in the marketplace.\"\nIn her new role, Manigault will join the Diversity & Inclusion team, which is part of Key's Corporate Center. She will report to Trina Evans, Director of Corporate Center.\nManigault steps into the Chief Diversity & Inclusion Officer role after serving as Chief Financial Officer for Key's Technology and Operations organization. In this role, Manigault implemented technology business management processes which provided transparency into the cost to operate Key's technology programs. She also led the engagement and diversity and inclusion efforts throughout the Finance Department. In addition to her contributions to Finance, she has been involved in many of Key's enterprise-wide diversity and inclusion initiatives and recently served as President of the Cleveland Chapter of the African American Key Business Networking Group.\nManigault has deep experience in the financial services industry, serving in roles for Bank of America, Deutsche Bank and J.P Morgan. She is an active member of the Board of Directors of the Greater Cleveland YMCA, serving as the Board Treasurer and the Chairperson of the Finance Committee. She is also a member of the Board of Trustees of the Urban League of Greater Cleveland, where she serves as Co-Chair of the Audit Committee. Manigault has a BS from Rutgers University, is a CPA and is Six Sigma certified.\nAbout KeyCorp\nKeyCorp's roots trace back 190 years to Albany, New York. Headquartered in Cleveland, Ohio, Key is one of the nation's largest bank-based financial services companies, with assets of approximately $137.7 billion at December 31, 2017. Key provides deposit, lending, cash management, insurance, and investment services to individuals and businesses in 15 states under the name KeyBank National Association through a network of approximately 1,200 branches and more than 1,500 ATMs. Key also provides a broad range of sophisticated corporate and investment banking products, such as merger and acquisition advice, public and private debt and equity, syndications and derivatives to middle market companies in selected industries throughout the United States under the KeyBanc Capital Markets trade name. For more information, visit https://www.key.com/ . KeyBank is Member FDIC.\nView original content with multimedia: http://www.prnewswire.com/news-releases/keycorp-names-kim-manigault-as-chief-diversity--inclusion-officer-300588113.html\nSOURCE KeyCorp", "external_links": ["http://www.prnewswire.com/news-releases/keycorp-names-kim-manigault-as-chief-diversity--inclusion-officer-300588113.html", "https://www.key.com/"], "published": "2018-01-25T18:00:00.000+02:00", "crawled": "2018-01-25T20:48:45.000+02:00", "highlightTitle": ""}