{"organizations": [], "uuid": "b4c7fe4b65e9118bd6c8115c7596f91cc6c2a256", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/814284108.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/15/airbus-boeing-orders-2017/", "country": "US", "domain_rank": 1196, "title": "Airbus Beats Boeing in 2017 Orders With Late Selling Spree | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.222, "site_type": "news", "published": "2018-01-08T02:00:00.000+02:00", "replies_count": 0, "uuid": "b4c7fe4b65e9118bd6c8115c7596f91cc6c2a256"}, "author": "Reuters", "url": "http://fortune.com/2018/01/15/airbus-boeing-orders-2017/", "ord_in_thread": 0, "title": "Airbus Beats Boeing in 2017 Orders With Late Selling Spree | Fortune", "locations": [], "entities": {"persons": [{"name": "fabrice bregier", "sentiment": "none"}], "locations": [], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "airbus", "sentiment": "negative"}, {"name": "airbus beats boeing", "sentiment": "negative"}, {"name": "boeing", "sentiment": "negative"}, {"name": "pratt & whitney", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Reuters 4:49 AM EST \nFrenetic selling in the closing weeks of 2017 saw Airbus overhaul Boeing’s recent lead in the global jet market to win their annual order contest for the fifth year running, but doubts remain over the future of its flagship A380. \nThe European planemaker said on Monday net orders after cancellations rose 52% to 1,109 aircraft in 2017, placing it ahead of Boeing’s 912 net orders. Airbus posted 1,229 gross or unadjusted orders compared with Boeing’s 1,053. \nAirbus confirmed it had met its core 2017 target of more than 700 deliveries by releasing 718 jets to customers in 2017, up 4% from the previous year despite industrial delays. \nBoeing remained the world’s largest jetmaker for the sixth year running with a record total of 763 deliveries. \nPlanemaking chief Fabrice Bregier said engine supplier Pratt & Whitney had turned the corner on delays that had disrupted single-aisle aircraft output, and predicted close to 800 deliveries in 2017. \nHe predicted that a record backlog of more than 7,000 aircraft, now on order and waiting to be built, would allow Airbus to lift deliveries beyond those of Boeing in 2020. \nBoeing has questioned whether all of the airplanes sold by its competitor will be delivered due to speculative business. \nDecember’s sales breakthrough focused mainly on the bread and butter of Airbus’s portfolio, the medium-haul A320 family, which competes with Boeing’s best-selling 737 series. \nSome industry sources have questioned whether Airbus was forced to slash prices in order to bring in the record harvest of more than 800 orders in December, which included the sale of 430 jets via one U.S. investor. \nHowever, sales chief John Leahy said the surge reflected stronger than expected demand, after airlines closed the year with robust traffic data, amid rising stock markets and economic growth. \n“The market is just stronger everywhere,” Leahy told reporters on a conference call. \nIn the wide-body or long-haul segment, by contrast, Airbus saw its market share against Boeing slump to 25% from 51% the year before. \nThat included no new orders and two cancellations for the A380 superjumbo, whose future is under threat due to low sales. Boeing also suffered cancellations for its competing 747. \nBregier confirmed plans, first reported by Reuters, to reduce A380 production to as few as six aircraft per year, compared with 15 deliveries last year. \nAirbus currently plans to lower output to eight a year. \nAirbus is talking to the main A380 customer Emirates about buying about three dozen more of the planes in order to secure future production. \nBut Leahy confirmed a Reuters report that Airbus was looking at shutting the A380 if the Emirates deal—already postponed at last November’s Dubai Airshow—fell through. In that case, Airbus would have “no choice” but to close production, he said. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-08T02:00:00.000+02:00", "crawled": "2018-01-15T11:58:14.010+02:00", "highlightTitle": ""}