{"organizations": [], "uuid": "e3cd728a895eb5a28717938101af0abcb3ff0c05", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/usa-ethanol/more-cold-weather-poses-challenges-to-u-s-corn-ethanol-makers-idUSL1N1P601X", "country": "US", "domain_rank": 408, "title": "More cold weather poses challenges to U.S. corn ethanol makers", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T08:00:00.000+02:00", "replies_count": 0, "uuid": "e3cd728a895eb5a28717938101af0abcb3ff0c05"}, "author": "", "url": "https://www.reuters.com/article/usa-ethanol/more-cold-weather-poses-challenges-to-u-s-corn-ethanol-makers-idUSL1N1P601X", "ord_in_thread": 0, "title": "More cold weather poses challenges to U.S. corn ethanol makers", "locations": [], "entities": {"persons": [{"name": "michael hirtzer", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "midwest", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "commodity weather group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 6:00 AM / Updated 39 minutes ago More cold weather poses challenges to U.S. corn ethanol makers Michael Hirtzer 3 Min Read \nCHICAGO, Jan 11 (Reuters) - Another cold snap in the United States is set to eat into profits for U.S. ethanol makers after output of the corn-based biofuel fell sharply for a second straight week. \nHigher natural gas prices amid some of the coldest temperatures in the Midwest in years have raised costs for ethanol makers who use it to operate their plants. \nSlower turnaround on rail tanker cars, due in part to the weather, also limited where producers could load out their fuel for shipment to domestic gasoline-blending terminals and export ports. \nBitterly cold temperatures were forecast to return early next week in the Midwest region where most U.S. ethanol plants are located, after a brief warmup this week, according to the Commodity Weather Group. \n“A lot of people are questioning how much this cold will temper run rates next week,” said a U.S. ethanol trader. “There’s no (rail) cars and there’s no place to put ethanol.” \nEthanol output in the week ended Jan. 5 averaged 996,000 barrels per day (bpd), down 36,000 bpd from the prior week, the U.S. Energy Information Administration said on Wednesday. \nIt was the first time since October that output dipped below 1 million bpd, and the cumulative drop of 94,000 bpd during the past two weeks was the largest such decline since EIA began tracking the data in 2010. \nProduction had hit record-high rates of 1.108 million bpd in early December. \nEthanol futures on the Chicago Board of Trade rallied to a one-month high at $1.349 per gallon after the EIA data was released, before settling 0.002 cent lower at $1.326. \n“Cold weather just prompted some of these plants to either slow down for maintenance or scale back,” said Futures International analyst Terry Reilly. \nU.S. ethanol stockpiles still increased by 100,000 barrels to 22.72 million barrels - the most since May. \nDemand for ethanol and gasoline may not rise significantly until the spring or summer, when more drivers take to the roads. About a third of the U.S. corn harvest is processed into ethanol, which is then mixed into nearly every gallon of gasoline sold in the country. \nSome analysts expect the U.S. Department of Agriculture in a monthly supply and demand report on Friday to raise its forecast for corn use in ethanol production, but the drop in output could give the agency pause. \n“The recent slowdown decreases the chances for the government to raise that number in this report,” Dan Cekander, analyst at DC Analysis, said of USDA’s corn-for-ethanol figure. (Reporting by Michael Hirtzer, editing by G Crosse)", "external_links": [], "published": "2018-01-11T08:00:00.000+02:00", "crawled": "2018-01-11T08:23:40.017+02:00", "highlightTitle": ""}