{"organizations": [], "uuid": "d039e0fbd576cebeb17c0b2a75f6e409d631fb60", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-urogen-pharma-announces-pricing-of-public-offering-of-ordinary-shares.html", "country": "US", "domain_rank": 767, "title": "UroGen Pharma Announces Pricing of Public Offering of Ordinary Shares", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T03:10:00.000+02:00", "replies_count": 0, "uuid": "d039e0fbd576cebeb17c0b2a75f6e409d631fb60"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-urogen-pharma-announces-pricing-of-public-offering-of-ordinary-shares.html", "ord_in_thread": 0, "title": "UroGen Pharma Announces Pricing of Public Offering of Ordinary Shares", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}], "organizations": [{"name": "urogen pharma announces pricing of public offering of ordinary shares ra'anana", "sentiment": "negative"}, {"name": "urogen pharma ltd.", "sentiment": "negative"}, {"name": "globe newswire", "sentiment": "negative"}, {"name": "llc", "sentiment": "none"}, {"name": "inc.", "sentiment": "none"}, {"name": "cowen and company", "sentiment": "none"}, {"name": "oppenheimer & co", "sentiment": "none"}, {"name": "jefferies llc", "sentiment": "none"}, {"name": "ladenburg thalmann & co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "RA'ANANA, Israel and NEW YORK, Jan. 18, 2018 (GLOBE NEWSWIRE) -- UroGen Pharma Ltd. (Nasdaq:URGN), a clinical-stage biopharmaceutical company developing treatments to address unmet needs in the field of urology, with a focus on uro-oncology, today announced the pricing of its public offering of 1,463,414 ordinary shares, at a public offering price of $41.00 per share for gross proceeds of approximately $60.0 million, before deducting underwriting discounts and commissions and estimated offering expenses. In addition, the Company has granted the underwriters a 30-day option to purchase up to an additional 219,512 ordinary shares at the public offering price, less the underwriting discounts and commissions. All ordinary shares sold in this offering are being offered by the Company. The offering is expected to close on January 23, 2018, subject to customary closing conditions.\nJefferies LLC and Cowen and Company, LLC are acting as joint book-running managers for the offering. Oppenheimer & Co. Inc. is acting as lead manager for the offering. Ladenburg Thalmann & Co. Inc. and National Securities Corporation are acting as co-managers for the offering.\nA registration statement relating to these securities has been filed with the Securities and Exchange Commission, or the SEC, and was declared effective by the SEC on January 18, 2018. The offering will be made only by means of a prospectus, which is part of the effective registration statement. When available, copies of the final prospectus may be obtained from Jefferies LLC, Attention: Equity Syndicate Prospectus Department, 520 Madison Avenue, 2nd Floor, New York, NY 10022, telephone: (877) 547-6340, e-mail: Prospectus_Department@Jefferies.com , or from Cowen and Company, LLC, c/o Broadridge Financial Services, 1155 Long Island Avenue, Edgewood, NY 11717, Attn: Prospectus Department, by telephone at (631) 274-2806 or by fax at (631) 254-7140.\nThis press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities in any state or other jurisdiction in which such an offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or other jurisdiction.\nAbout UroGen Pharma Ltd.\nUroGen Pharma Ltd. (Nasdaq:URGN) is a clinical-stage biopharmaceutical company developing advanced non-surgical treatments to address unmet needs in the field of urology, with a focus on uro-oncology. The Company has developed RTGel™, a proprietary sustained release, hydrogel-based formulation for potentially improving therapeutic profiles of existing drugs. UroGen Pharma's sustained release technology is designed to enable longer exposure of the urinary tract tissue to medications, making local therapy a potentially more effective treatment option. UroGen Pharma's lead product candidates, MitoGel™ and VesiGel™, are designed to potentially remove tumors by non-surgical means and to treat several forms of non-muscle invasive urothelial cancer, including low-grade upper tract urothelial carcinoma and bladder cancer. UroGen Pharma is headquartered in Ra’anana, Israel and maintains a corporate office in New York City.\nForward Looking Statements\nThis press release contains forward-looking statements as that term is defined in the Private Securities Litigation Reform Act of 1995, including with respect to the closing of the public offering, anticipated use of proceeds, the clinical development and commercial prospects of the product candidates in UroGen Pharma’s pipeline and the scope and development of UroGen Pharma’s product candidate pipeline, which statements are subject to a number of risks, uncertainties and assumptions. In light of these risks and uncertainties, and other risks and uncertainties that are described in the Risk Factors section of the preliminary prospectus for this offering filed with the SEC on January 16, 2018 and other filings that UroGen Pharma makes with the SEC from time to time (which are available at www.sec.gov ), the events and circumstances discussed in such forward-looking statements may not occur, and UroGen Pharma’s actual results could differ materially and adversely from those anticipated or implied thereby. Any forward-looking statements speak only as of the date of this press release and are based on information available to UroGen Pharma as of the date of this release.\nUROGEN CONTACTS:\nChristine Cassiano\nCorporate Affairs Officer\nChristineC@urogen.com\n714-552-0326\nOr\nKate Bechtold\nDirector, Corporate Communications & Investor Relations\nKateB@urogen.com\n914-552-0456\nSource:UroGen Pharma Ltd.", "external_links": ["https://www.globenewswire.com/Tracker?data=-QXzP6RKzhqca5JvxuzOXZjjAse4s2VbLFjQQvMjnXtPBdOV1eZ2bgL83VOZhkcvr4NV-NvI5YUDtgeugXJ07w==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/daacff39-7b16-44f1-95c4-c22b7970bff1", "https://www.globenewswire.com/Tracker?data=R0jNriNGeCYfcQ_CF1u9z7TeX27uMA2XSeNhq7KzbS-2c4NKFblGgRm71YEjc9ftdDksZXqgRU7H6twJX0Nzrs-JMUk0D18Vxc89GIyrc3vhA_qpiI0YTBj1atLPLG4CM9PcoYRqDNTceOb5VaDn6A==", "https://www.globenewswire.com/Tracker?data=V93vElVokdK2Y7aPW6FalEUigjrXmW3WciC6rHpF33-PRyVtKFFpR5NgHHi4YN2oHPub6zL81GCVkjzh5nbfCY75S2I1LcmZwoZIRJakWXI=", "https://www.globenewswire.com/Tracker?data=F29uWHz5vKDhwJnNfWtvXLl5JqTUpUI8LlCdIGT8MmFBuKJr8pOkP7NO2gJeS6QTz7qYf_n8uQn3O6iUza_CCA=="], "published": "2018-01-19T03:10:00.000+02:00", "crawled": "2018-01-19T05:16:38.010+02:00", "highlightTitle": ""}