{"organizations": [], "uuid": "56a07e47ced77cb177c3e1c5ea40bcbade41e0ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180130.html", "section_title": "Archive News &amp; Video for Tuesday, 30 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/philippines-sugar/philippines-drinks-makers-shun-china-corn-syrup-imports-to-avoid-tax-idUSL4N1PP1TW", "country": "US", "domain_rank": 408, "title": "Philippines drinks makers shun China corn syrup imports to avoid tax", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.996, "site_type": "news", "published": "2018-01-30T17:04:00.000+02:00", "replies_count": 0, "uuid": "56a07e47ced77cb177c3e1c5ea40bcbade41e0ab"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/philippines-sugar/philippines-drinks-makers-shun-china-corn-syrup-imports-to-avoid-tax-idUSL4N1PP1TW", "ord_in_thread": 0, "title": "Philippines drinks makers shun China corn syrup imports to avoid tax", "locations": [], "entities": {"persons": [{"name": "manolo serapio jr", "sentiment": "none"}, {"name": "enrico dela cruz", "sentiment": "none"}], "locations": [{"name": "philippines", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "manila", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "hfcs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* HFCS importers to re-export cargoes as they shift to sugar\n* Philippines was China’s top market for HFCS last year\n* New tax on HFCS use in beverages double vs sugar\n* Losing Philippine market may lead to China oversupply -analyst\nBy Manolo Serapio Jr and Enrico Dela Cruz\nMANILA, Jan 30 (Reuters) - Philippine beverage producers are swapping their imports of high-fructose corn syrup (HFCS) for domestic sugar to avoid higher taxes on the alternative sweetener, industry and government officials said, limiting exports from top supplier China.\nLosing the Philippine market, or bulk of it, could lead to an oversupply of HFCS in China at a time when Chinese producers are expanding output of the sweetener from huge domestic corn stocks.\nThe Philippines was the biggest market last year for China’s corn syrup, buying 290,080 tonnes, or half of China’s exports.\nThe Southeast Asian nation on Jan. 1 imposed a tax of 6 pesos ($0.12) a litre on drinks using sugar and other sweeteners versus a tax of 12 pesos on HFCS. The levies, part of a broader tax reform package, will be used to fund a countrywide infrastructure plan.\n“Starting Jan. 1, 2018, we have shifted away from the use of HFCS,” Juan Lorenzo Tañada, director for legal and corporate affairs at Coca-Cola Philippines, the country’s top HFCS importer, told Reuters in a text message.\nTañada said the move would reduce the impact of the higher tax on its customers, adding the company will “re-export the HFCS that we are no longer going to use due to our shift to sugar.”\nSweetened beverage producers are the biggest HFCS buyers in the Philippines.\nPepsi Cola Philippines, another major HFCS importer, is disposing its HFCS supplies “by selling them abroad little by little, whatever we can sell,” according to a company official who declined to be named because he was not authorised to speak to the media.\nChina’s HFCS producers may end up flooding their domestic market if they lose their market in the Philippines, said Meng Jinhui, an analyst with Shengda Futures in Beijing.\n“If the Philippines does not import any from China, it will add huge pressure on the domestic industry. That part of output would have to be diverted back to the domestic market, further causing oversupply,” said Meng.\nPhilippine HFCS buyers will re-export about 20,000 tonnes of previously imported supplies of the sweetener, the country’s Sugar Regulatory Administration (SRA) said on Tuesday.\nThe Southeast Asian nation, which is forecast to produce 2.27 million tonnes of raw sugar in the crop year ending August, said there is enough local supply to serve the beverage sector, but it would have to curb exports.\nThe SRA last week raised the domestic allocation of locally produced sugar to 93 percent from 80 percent to meet the expected higher demand.\nThe export allocation for the United States was cut to 6 percent from 10 percent and for other countries to 1 percent from 10 percent.\nBeverage makers used to buy around 250,000 tonnes of local sugar before making a switch to lower-priced HFCS in 2011, said Jesus Barrera, deputy director of the Philippine Sugar Millers Association.\nBarrera said the higher demand could be met through 2018 production and by drawing from 300,000 tonnes of sugar left from the last crop year.\n($1 = 51.4490 Philippine pesos)\nReporting by Manolo Serapio Jr. and Enrico dela Cruz; Additional reporting by Hallie Gu in BEIJING; Editing by Christian Schmollinger\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T17:04:00.000+02:00", "crawled": "2018-01-31T16:17:25.000+02:00", "highlightTitle": ""}