{"organizations": [], "uuid": "58bed184050e4ed9afab4c22ac103301d93b6f2f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/11/28/104132444-GettyImages-596815105.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/bunching-charitable-donations-could-help-you-save-on-taxes-this-year.html", "country": "US", "domain_rank": 767, "title": "Bunching charitable donations could help you save on taxes this year", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.155, "site_type": "news", "published": "2018-01-04T15:30:00.000+02:00", "replies_count": 0, "uuid": "58bed184050e4ed9afab4c22ac103301d93b6f2f"}, "author": "Darla Mercado", "url": "https://www.cnbc.com/2018/01/04/bunching-charitable-donations-could-help-you-save-on-taxes-this-year.html", "ord_in_thread": 0, "title": "Bunching charitable donations could help you save on taxes this year", "locations": [], "entities": {"persons": [{"name": "camille tokerud", "sentiment": "negative"}, {"name": "charlie douglas", "sentiment": "none"}], "locations": [], "organizations": [{"name": "irs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "This year, if you want to boost your tax savings beyond the new standard deduction, consider giving away some of your wealth.\nThe Tax Cuts and Jobs Act went into effect on Monday, bringing with it a slate of changes to the code. Those include an increase to the standard deduction (which nearly doubles to $12,000 for singles and $24,000 for married couples who file jointly), as well as the elimination of personal exemptions.\nAbout 49 million taxpayers, or 28 percent, currently itemize, according to the Urban-Brookings Tax Policy Center . Due to the higher standard deduction, fewer filers are expected to do so in the future.\nMore than 36 million filers claimed the charitable-giving deduction on their 2015 taxes, according to the IRS.\nHowever, filers who plan their charitable gifts may be able to get themselves over the new standard deduction and itemize — if they use a strategy called \"bunching.\"\n\"You would give the same amount of dollars that you would over a two-year period, but you bunch them into one year,\" said Charlie Douglas, partner and director of wealth planning at Cedar Rowe Partners in Atlanta.\n\"Bunching in one year will help you itemize deductions where you couldn't,\" he said.\nHere's what you should know about bunching your charitable gifts.\nAccelerated giving The tax overhaul took away many of the levers taxpayers could use to ramp up their deductions so that they could itemize on their taxes.\nFor instance, filers could previously take an unlimited deduction every year for property and state income taxes. Now, they are only allowed to claim up to $10,000 in these expenses each year.\nWATCH: How to give the most this holiday season\nshow chapters How to give the most this holiday season 3:47 PM ET Mon, 4 Dec 2017 | 01:41 The charitable giving deduction remains for taxpayers who itemize. Under the new law, this break is limited to 60 percent of adjusted gross income for cash gifts, but you can carry forward by up to five years any amount that exceeds that.\nSingle donors who fall short of the $12,000 threshold ($24,000 if married) can itemize on their taxes if they supercharge their giving in one year.\nEvery other year Consider that a married couple is claiming the maximum property and state income tax deduction of $10,000. This couple also paid $6,000 in mortgage interest in a year.\nThey will need at least $8,000 of charitable gifts in order to hit — and surpass — the $24,000 standard deduction threshold.\nIf this couple normally gives $4,000 to charity annually, they can accelerate the gift by cramming in two years of donations into one tax year. This way, they itemize on their taxes one year and take the standard deduction the next.\nMike Kemp | Getty Images \"You could do three years of gifts, even two years of gifts to get over the standard deduction,\" said Tim Steffen, director of advanced planning for Baird's private wealth management group.\n\"Bunching deductions sounds great, but it'll probably be talked about more than it's implemented because of the cash commitment it will take to get over the standard deduction,\" said Steffen.\nMore from Your Money, Your Future\n10 moves to boost your wealth in 2018\nThis rollover mistake can sink your retirement savings\nIf you're tired of Medicare Advantage, now is the time to bail\nNew year, new tax brackets: Here's where you stand", "external_links": [], "published": "2018-01-04T15:30:00.000+02:00", "crawled": "2018-01-04T15:43:01.011+02:00", "highlightTitle": ""}