{"organizations": [], "uuid": "9d8ac38e1f8eb313a9ad1375a62665eef173a4b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180113&t=2&i=1221652478&w=1200&r=LYNXMPEE0C03X", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/myanmar-rohingya-arsa/rohingya-insurgents-say-10-found-in-myanmar-grave-innocent-civilians-idINKBN1F206F", "country": "US", "domain_rank": 408, "title": "Rohingya insurgents say 10 found in Myanmar grave 'innocent civilians'", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T09:05:00.000+02:00", "replies_count": 0, "uuid": "9d8ac38e1f8eb313a9ad1375a62665eef173a4b2"}, "author": "", "url": "https://in.reuters.com/article/myanmar-rohingya-arsa/rohingya-insurgents-say-10-found-in-myanmar-grave-innocent-civilians-idINKBN1F206F", "ord_in_thread": 0, "title": "Rohingya insurgents say 10 found in Myanmar grave 'innocent civilians'", "locations": [], "entities": {"persons": [{"name": "muslim", "sentiment": "none"}], "locations": [{"name": "myanmar", "sentiment": "none"}, {"name": "bangladesh", "sentiment": "none"}, {"name": "cox's bazar", "sentiment": "none"}, {"name": "siu  myanmar", "sentiment": "none"}, {"name": "unchiparang", "sentiment": "none"}, {"name": "rakhine", "sentiment": "none"}, {"name": "muslim-majority", "sentiment": "none"}], "organizations": [{"name": "rohingya", "sentiment": "negative"}, {"name": "arsa", "sentiment": "none"}, {"name": "arakan rohingya salvation army", "sentiment": "none"}, {"name": "min read  yangon", "sentiment": "none"}, {"name": "buddhist", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "rohingya muslim", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "YANGON (Reuters) - Rohingya Muslim insurgents said on Saturday that 10 Rohingya found in a mass grave in Myanmar’s troubled Rakhine state last month were “innocent civilians”, and not members of their group.\nSmoke rises from shelter as Rohingya refugee cook their dinner at Unchiparang refugee camp, near Cox's Bazar, Bangladesh January 11, 2018. REUTERS/Tyrone Siu Myanmar’s military said earlier this week its soldiers had killed 10 captured Muslim “terrorists” during insurgent attacks at the beginning of September, after Buddhist villagers had forced the captured men into a grave the villagers had dug.\nIt was a rare acknowledgment of wrongdoing by the Myanmar military during its operations in the western state of Rakhine.\nThe Arakan Rohingya Salvation Army (ARSA), whose raids against security posts starting last August sparked sweeping military operations in the Muslim-majority northern part of Rakhine, said it “whole-heartedly welcomes the admission” of “war crimes” by the “Burmese terrorist army”.\n“We hereby declare that these ten innocent Rohingya civilians found in the said mass grave in Inn Din Village Tract were neither ARSA nor had any association with ARSA”, the group said in a statement on Twitter.\nA Myanmar government spokesman said in response to ARSA’s statement that sometimes ”terrorists and villagers were allied“ in attacks” against security forces.\n“We have already said it is very difficult to segregate who is a terrorist and who are innocent villagers,” spokesman Zaw Htay said. “There will be an ongoing investigating process whether they are members of ARSA or not.”\nThe Myanmar military did not immediately respond to requests for comment.\n‘NEW STEP’\nMyanmar’s civilian leader Aung San Suu Kyi said on Friday it was “positive” that the country’s military was taking responsibility for the actions of troops.\n“It is a new step for our country,” she told a joint news conference with Japanese Foreign Minister Taro Kono in Myanmar’s capital of Naypyitaw.\n“I see it that way because a country needs to take responsibility for the rule of law in the country, and this is the first step on the road of taking responsibility and it is a positive thing,” She said, according to a transcript of the news conference posted on her Facebook page.\nOn Dec. 18, the military announced a mass grave containing 10 bodies had been found at the coastal village of Inn Din, about 50 km (30 miles) north of the state capital Sittwe. The army appointed a senior officer to investigate.\nA statement from the military on Wednesday said its investigation had found that members of the security forces had taken part in the killings and action would be taken against them.\nSome civilians wanted to kill the 10 men to avenge the death of an ethnic Rakhine Buddhist man in Inn Dinn village named Maung Ni and would face punishment, the military said.\nOn Saturday, a lawyer for one of Maung Ni’s sons said police were seeking murder charges against the son, named Tun Aye,\nfor taking part in the killings. Lawyer Khin Win said a murder complaint against the son was filed with local prosecutors last week in Maungdaw, the nearest town to Inn Din.\nTun Aye was one of four Inn Din villagers detained by police on Dec. 15, said Khin Win. The other three had been released, he said.\nNational police spokesman Thet Naing said he was not aware of the murder complaint.\nThe Rohingya crisis erupted after Rohingya insurgent attacks on security posts on Aug. 25 in Rakhine triggered a fierce military response that the United Nations denounced as ethnic cleansing.\nMyanmar denies ethnic cleansing, saying its security forces had mounted legitimate counter-insurgency clearance operations.\nReporting by Thu Thu Aung; Editing by Bill Tarrant\n ", "external_links": [], "published": "2018-01-13T09:05:00.000+02:00", "crawled": "2018-01-13T09:45:53.002+02:00", "highlightTitle": ""}