{"organizations": [], "uuid": "1d9f0647b0ccd360dd1abe5a2ac2f2019bee30db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226802628&w=1200&r=LYNXMPEE0U05M", "site_section": "http://www.reuters.com/resources/archive/us/20180130.html", "section_title": "Archive News &amp; Video for Tuesday, 30 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-funds-poll-japan/japan-fund-managers-trim-stocks-exposure-in-january-still-above-average-levels-reuters-poll-idUSKBN1FK0C9", "country": "US", "domain_rank": 408, "title": "Japan fund managers trim stocks exposure in January, still above average levels: Reuters poll", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T11:40:00.000+02:00", "replies_count": 0, "uuid": "1d9f0647b0ccd360dd1abe5a2ac2f2019bee30db"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-funds-poll-japan/japan-fund-managers-trim-stocks-exposure-in-january-still-above-average-levels-reuters-poll-idUSKBN1FK0C9", "ord_in_thread": 0, "title": "Japan fund managers trim stocks exposure in January, still above average levels: Reuters poll", "locations": [], "entities": {"persons": [], "locations": [{"name": "tokyo", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TOKYO (Reuters) - Japanese fund managers trimmed their overall exposure to stocks in January from the previous month but still kept a significantly higher than average level of holdings, a Reuters poll showed.\nRespondents on average allocated 43.7 percent of their model portfolios to equities in January from 49.7 percent in December.\nThe 43.7 percent allocated to equities in January was still higher than the 2017 average of 38.9 percent and the 2016 average of 39.7 percent, reflecting the recent broad surge in risk asset markets.\nGlobal equity markets have rallied over the past year, with bourses across the world reaching record highs, buoyed by a synchronized uptick in global economic growth in a boon to corporate profits and stock valuations.\nWithin equities, the respondents reduced North American exposure to 30.3 percent in January from 35.5 percent in December and also cut Japanese stock holdings to 41.5 percent from 48.8 percent.\nThey increased euro zone equity exposure to 10.8 percent from 0.8 percent. The region’s equity performance improved this month, with the pan-European STOXX 600 poised to gain 2.6 percent in January after slipping 1.2 percent in December.\nThe fund managers lifted their overall bond exposure to 48.3 percent in January from 42.9 percent in December.\nThey increased North American bond exposure to 32.0 percent in January from 19.7 percent in December, bringing it back in line with the 2017 average of 32.3 percent.\nThe benchmark 10-year U.S. Treasury yield rose to a 3-1/2-year high near 2.7 percent in January after hardly rising in December.\nThe respondents raised Japanese bond holdings to 33.2 percent in January from 26.6 percent in December. They upped euro zone debt exposure to 22.1 percent from 13.8 percent.\nAmid expectations that the European Central Bank is nearing an exit from ultra-loose monetary policy the German 10-year bund yield reached a six-month high of 0.579 percent in January, rebounding from the multi-month low of 0.275 percent plumbed in December.\n“Monetary policy normalization by central banks other than the Federal Reserve is a theme gathering attention in the market with focus on the ECB’s exit strategy and the Bank of Japan’s market operations,” said Yuichi Kodama, chief economist at Meiji Yasuda Insurance.\nThe survey of five Japan-based fund managers was conducted between Jan. 15 and 26.\nReporting by the Tokyo markets team; Editing by Eric Meijer\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-31T11:40:00.000+02:00", "crawled": "2018-01-31T16:47:56.000+02:00", "highlightTitle": ""}