{"organizations": [], "uuid": "74d897c8b9da8c3b20cfebf4eae521153259c733", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-cno-financial-announces-two-bankers-life-appointments.html", "country": "US", "domain_rank": 767, "title": "CNO Financial Announces Two Bankers Life Appointments", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.025, "site_type": "news", "published": "2018-01-18T18:00:00.000+02:00", "replies_count": 0, "uuid": "74d897c8b9da8c3b20cfebf4eae521153259c733"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-cno-financial-announces-two-bankers-life-appointments.html", "ord_in_thread": 0, "title": "CNO Financial Announces Two Bankers Life Appointments", "locations": [], "entities": {"persons": [{"name": "richardson", "sentiment": "none"}, {"name": "brian wilson", "sentiment": "none"}, {"name": "wilson", "sentiment": "none"}, {"name": "nathan richardson", "sentiment": "none"}], "locations": [{"name": "ind.", "sentiment": "none"}, {"name": "carmel", "sentiment": "none"}, {"name": "milwaukee", "sentiment": "none"}, {"name": "south central", "sentiment": "none"}], "organizations": [{"name": "cno financial announces two bankers life appointments", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "cno financial group, inc.", "sentiment": "neutral"}, {"name": "northwestern mutual life insurance", "sentiment": "none"}, {"name": "bankers life", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CARMEL, Ind., Jan. 18, 2018 /PRNewswire/ -- CNO Financial Group, Inc. (NYSE: CNO) announced today that Nathan Richardson has been promoted to senior vice president of sales and distribution, and Brian Wilson has been appointed vice president of field development, both at its Bankers Life business segment.\nAs senior vice president of sales and distribution, Richardson is responsible for leading the segment's nationwide sales organization, comprising more than 4,500 agents and 250 branch offices. A 26-year veteran of Bankers Life, he joined the company in 1992, holding a variety of sales leadership positions throughout his tenure, most recently as South Central territory vice president since 2013.\nAs vice president of field development, Wilson is responsible for field manager and agent training, support and development. He joins Bankers Life after 16 years at Northwestern Mutual Life Insurance in Milwaukee, where he served in several sales and business development capacities and most recently held the position of vice president of national sales. Wilson has held previous roles at Royal Bank of Canada and U.S. Bancorp, and has a Master's of Business Administration in international studies from Marquette University and a bachelor's in business administration and marketing from University of North Dakota.\nWilson replaces Peter Wilkins, who will retire from Bankers Life after a 15-year tenure with the company as of March 1, 2018. Wilkins joined Bankers Life in 2003 as expansion vice president and subsequently held a variety of leadership roles including territory vice president for both the Central and South Central territories, and finally as vice president of field development, focusing on field training innovation.\n\"Nate has consistently proven himself to be a leader in our organization, with a deep understanding of the middle-income insurance market and a commitment to helping our customers plan for retirement,\" said Scott Goldberg, president of Bankers Life. \"Brian brings a wealth of industry knowledge and valuable insight to his new role, and we look forward to welcoming him to the leadership team.\" Regarding the retirement of Peter Wilkins, Goldberg said, \"We celebrate Peter's many accomplishments over the past 15 years with Bankers Life and throughout his career. We are grateful for his innumerable contributions to the business, and wish him the very best in his retirement.\"\nAbout CNO Financial Group\nCNO Financial Group, Inc. (NYSE: CNO) is a holding company. Our insurance subsidiaries – principally Bankers Life and Casualty Company, Colonial Penn Life Insurance Company and Washington National Insurance Company – primarily serve middle-income pre-retiree and retired Americans by helping them protect against financial adversity and provide for a more secure retirement. For more information, visit CNO online at www.CNOinc.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/cno-financial-announces-two-bankers-life-appointments-300584292.html\nSOURCE CNO Financial Group, Inc.", "external_links": ["http://www.cnoinc.com/", "http://www.prnewswire.com/news-releases/cno-financial-announces-two-bankers-life-appointments-300584292.html"], "published": "2018-01-18T18:00:00.000+02:00", "crawled": "2018-01-18T20:11:35.018+02:00", "highlightTitle": ""}