{"organizations": [], "uuid": "2f37d421373cd2fba46d23dab7a5abb1909633f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/goldman-sachs-earnings-stock-price-falls.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/30/stocks-are-dropping-for-a-second-day-after-rising-for-so-long-what-you-need-to-know/", "country": "US", "domain_rank": 1196, "title": "Stocks Drop for a Second Day After Rising for So Long | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.072, "site_type": "news", "published": "2018-01-30T09:41:00.000+02:00", "replies_count": 0, "uuid": "2f37d421373cd2fba46d23dab7a5abb1909633f4"}, "author": "Reuters", "url": "http://fortune.com/2018/01/30/stocks-are-dropping-for-a-second-day-after-rising-for-so-long-what-you-need-to-know/", "ord_in_thread": 0, "title": "Stocks Drop for a Second Day After Rising for So Long | Fortune", "locations": [], "entities": {"persons": [{"name": "alvin tan", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "reuters 7:41 am est  world", "sentiment": "neutral"}, {"name": "apple", "sentiment": "none"}, {"name": "societe generale", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Reuters 7:41 AM EST \nWorld stocks were in their biggest two-day dive in six months on Tuesday and commodities were also jammed in reverse, as rising U.S. borrowing costs cooled financial markets’ euphoric start to the year . \nThe move above 2.7% by U.S. Treasury yields — the benchmark for world lending rates — helped the dollar off the canvas though that was part of the issue. \nOil slid back below $70, metals buckled and Asian stocks saw their biggest fall since early December after Wall Street had suffered its largest drop in five months after worries about Apple’s iPhone sales. \nDespite an easing of yields in Europe its stocks duly followed. The pan-regional STOXX 600 dropped 0.5% as traders took aim at cyclical sectors like mining and financials after their strong run this month. \n“The big picture view is that the rising U.S. yields have finally come to the dollar’s rescue,” said Societe Generale strategist Alvin Tan. “It didn’t respond for weeks but as yields have broken above 2.7%, it finally has.” \nRead: Here’s The Dow Jones Stocks You Should’ve Invested In After Trump’s Election \nThe rise in Treasury yields leaves them at the highest since mid-2014 though the move had been paused in Europe as lower-than-forecast early German inflation numbers had nudged its borrowing costs lower. \nMoreover, the bond market braced for potentially hawkish language from the Federal Reserve, which will begin its two-day policy meeting on Tuesday. \nFocus was also on U.S. President Donald Trump’s State of the Union address scheduled later in the global day, with attention on his views on an infrastructure overhaul and trade. \nThe dollar’s rebound meant the euro fell for a second day. It eased 0.3% to $1.2373 having hit three-year high of $1.2538 last week. Data was still upbeat though with France’s economy rounding off its strongest year since 2011. \nBritain’s pound also came under renewed pressure, falling back to $1.40 again, as Brexit tensions continued to hound the UK government and its leader Theresa May. \nBritain’s housing market continued to lose momentum data showed too, with mortgage approvals at their weakest in nearly three years following the Bank of England’s first interest rate hike in a decade. \nGrowth in consumer lending, something the BoE has said it is watching closely, picked up speed for the first time in four months. Russia Shrugs \nRussian stocks edged higher as they shrugged off the risk of possible new sanctions from a newly published U.S. list of oligarchs close to the Kremlin. \nThe list, drawn up as part of a sanctions package signed into law in August last year, does not mean those included will be subject to sanctions. \nIt does includes a wide circle of wealthy Russians though that run some of the country’s biggest companies, including the heads of Russia’s two biggest banks Sberbank and VTB , metals magnates and the boss of state gas monopoly Gazprom. \nVTB Capital analysts said the list was “simply a mechanical listing” of prominent Russian politicians and business leaders which would not automatically lead to any immediate sanctions. \n“Therefore, we do not expect any market reaction,” they said in a note. \nMost Asian currencies had fallen overnight as the rise in bond yields lifted the dollar. \nMSCI’s broadest index of Asia-Pacific shares outside Japan fell 1.1% too, but after a string of all-time highs, it was still on track for a 6.5% monthly gain. \nAustralian stocks shed 0.9%, South Korea’s KOSPI lost 1%, Hong Kong’s Hang Seng 0.9% and Shanghai 0.8%. Japan’s Nikkei was the stand-out as it dropped 1.4%. \nThe bearish sentiment in Asia followed a softer lead from Wall Street, which has led a global equities rally over the past year thanks to strong world growth fueling higher corporate earnings and stock valuations. \nOn Monday, U.S. stocks pulled back from record highs, with the Dow and the S&P 500 indexes marking their biggest one-day percentage declines in about five months, weighed down by a slide in Apple shares on reports of poor iPhone X demand. \nAmong commodities, oil prices extended losses after being pressured by the dollar’s bounce and rising U.S. crude output. \nU.S. crude futures were down 0.9% at $64.97 per barrel. Underpinned by the dollar’s recent slide, prices had risen to $66.66 per barrel on Thursday, the highest since December 2014. \nBrent crude fell 0.5% to $69.10 per barrel. \nSpot gold slipped to $1,334.10 an ounce, the lowest since Jan. 23, also weighed by the stronger U.S. currency, while a 2.2% drop by nickel led a broad-based sell-off in industrial metals. \n“Markets remain fragile to the downside,” said Stephen Innes, head of trading for Asia-Pacific at futures brokerage Oanda in Singapore. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-30T09:41:00.000+02:00", "crawled": "2018-01-30T15:21:02.045+02:00", "highlightTitle": ""}