{"organizations": [], "uuid": "68cfc249bfa78bf57e9d81009f1eb913f60b3000", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.feedburner.com/google/rJLX", "section_title": "ATTACK - Google News", "url": "https://www.reuters.com/article/us-nigeria-security/suspected-boko-haram-attack-in-niger-kills-at-least-four-soldiers-idUSKBN1F726X", "country": "US", "domain_rank": 408, "title": "Suspected Boko Haram attack in Niger kills at least four soldiers - Reuters", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T17:55:00.000+02:00", "replies_count": 0, "uuid": "68cfc249bfa78bf57e9d81009f1eb913f60b3000"}, "author": "", "url": "https://www.reuters.com/article/us-nigeria-security/suspected-boko-haram-attack-in-niger-kills-at-least-four-soldiers-idUSKBN1F726X", "ord_in_thread": 0, "title": "Suspected Boko Haram attack in Niger kills at least four soldiers - Reuters", "locations": [], "entities": {"persons": [{"name": "boko haram", "sentiment": "negative"}, {"name": "moussa aksar", "sentiment": "none"}], "locations": [{"name": "niger", "sentiment": "none"}, {"name": "toumour", "sentiment": "none"}, {"name": "diffa", "sentiment": "none"}, {"name": "lake chad", "sentiment": "none"}, {"name": "niamey", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 3:53 PM / Updated 5 hours ago Suspected Boko Haram attack in Niger kills at least four soldiers Moussa Aksar 2 Min Read \nNIAMEY (Reuters) - Suspected Boko Haram fighters have killed at least four soldiers and a civilian in an attack on a military post in Niger’s southeastern Diffa region, local officials and two security sources said on Thursday. \nThe attack took place on Wednesday evening in the village of Toumour, near Lake Chad and the Nigerian border, in an area plagued by attacks by the Islamist militant group during its eight-year-old bid to create a caliphate in and around its Nigerian base. \nA hospital official said eight soldiers were injured in the ambush, which security officials said bore the hallmarks of past Boko Haram attacks. Four others are missing, said a security source, who also said the bodies of four suspected Boko Haram militants were found at the scene. \nA government spokesman was not immediately available for comment. \nA local police source said heavily-armed assailants entered the village on motorcycles and other vehicles, one of which was painted in the colors of Niger’s army. Fighters had stripped villagers of their mobile phones hours before to prevent them from alerting the authorities, residents said. \nTroops were taken by surprise and abandoned their position, allowing the militants to confiscate 10 armored vehicles before retreating to their stronghold in neighboring Nigeria, the security sources said. \nAir force and other troops have since reached the area and allowed soldiers to regain control of the position, they said. \nBoko Haram has been trying since 2009 to establish an Islamic state in northeast Nigeria, from where it has launched attacks and suicide bombings in Niger, Chad and Cameroon. Over 15,000 people have been killed and millions displaced. \nAn assault on the nearby town of Bosso in June 2016 killed 32 soldiers, prompting Chad to send 2,000 troops to help Niger counter the militants. \nThose troops were withdrawn in October last year, raising renewed concern about security in the Diffa region. Reporting by Moussa Aksar and Boureima Balima; Writing by Sofia Christensen; Editing by Edward McAllister and Andrew Roche", "external_links": [], "published": "2018-01-18T17:55:00.000+02:00", "crawled": "2018-01-18T23:13:58.037+02:00", "highlightTitle": ""}