{"organizations": [], "uuid": "916b4af2b5ee1881cedc9a1d2e6a31bd2e9ec2c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223849269&w=1200&r=LYNXMPEE0K0C2", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/us-backstory-davos/my-davos-the-most-efficient-reporting-trip-of-the-year-idINKBN1FA0G2", "country": "US", "domain_rank": 408, "title": "My Davos: the most efficient reporting trip of the year", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T13:02:00.000+02:00", "replies_count": 0, "uuid": "916b4af2b5ee1881cedc9a1d2e6a31bd2e9ec2c3"}, "author": "", "url": "https://in.reuters.com/article/us-backstory-davos/my-davos-the-most-efficient-reporting-trip-of-the-year-idINKBN1FA0G2", "ord_in_thread": 0, "title": "My Davos: the most efficient reporting trip of the year", "locations": [], "entities": {"persons": [{"name": "davos", "sentiment": "positive"}, {"name": "steve bannon", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "saudi arabia", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "finland", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "positive"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DAVOS, Switzerland (Reuters) - Davos is the conference everyone loves to hate.\nNot me.\nAs a financial columnist with an unabashedly globalist remit (sorry Steve Bannon) the annual World Economic Forum in Switzerland is the most efficient few days of my entire year.\nStarting in December, I line up meetings with sources, some of whom I have known for years and others that are totally new to me, from all parts of the world.\nWithout exaggeration, a typical three hours in Davos for me will include off-the-record chats with the head of a large Spanish bank, a senior official from Saudi Arabia’s government, a cosmetics entrepreneur from Mexico, the CEO of a Japanese food company and the founder of yet-another fintech startup from Finland.\nSince I am based in New York, I tend to concentrate on international contacts and people from places that are a bit more difficult to get to like Africa and the Middle East.\nThis is no substitute for getting on a plane, visiting these countries regularly and meeting folks on the ground. So getting together in Davos helps me to prioritize coverage for our three-dozen columnists at Reuters Breakingviews who are tasked every day with making sense of global markets, economies and corporate finance for financial professionals from Toronto to Timbuktu.\nWhile it may sound as if I spend lots of time in bilateral discussions outside the Congress Centre in Davos, the WEF’s programming is essential to bringing the right mix of people up to the mountains and helps to shape the tenor of every background interview in my diary. I certainly go into the meetings with an agenda, but invariably some topic curated by the forum’s organizers finds its way into the discussion.\nLooking at this year’s schedule, for example, I have no doubt that many people will want to discuss the extraordinary reforms taking place in India, where I was fortunate to spend two weeks in December.\nIndian Prime Minister Narendra Modi’s keynote address will be must-see Davos programming for every CEO, banker or policymaker on the ground. Similarly, the arrival of U.S. President Donald Trump will be on everyone’s minds, no matter how polarizing a figure he has been on the world stage.\nOf course, it would be disingenuous of me to omit the softer side of Davos. The parties in the evenings are a fantastic way to catch up less formally with existing contacts and make new ones. While this sounds plutocratic to the uninitiated, and it is indeed ironic to chat with billionaires about income inequality over canapés, for a journalist dependent on gathering perspectives, it’s nothing but helpful.\nAnd when the whole week is done, I try to carve a few turns on the ski slopes before heading home.\nRob Cox is the global editor of Reuters Breakingviews. Sign up for a free trial of the full service at www.breakingviews.com/trial and follow on Twitter @Breakingviews and at www.breakingviews.com.\n ", "external_links": [], "published": "2018-01-21T13:02:00.000+02:00", "crawled": "2018-01-21T13:42:02.001+02:00", "highlightTitle": ""}