{"organizations": [], "uuid": "c259d9a82cfae0a712b464aea14f5f8ac553f4cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/business-wire-correcting-and-replacing-avtex-acquires-qos-telesys-genesys-business.html", "country": "US", "domain_rank": 767, "title": "CORRECTING and REPLACING Avtex Acquires QoS Telesys Genesys Business", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.446, "site_type": "news", "published": "2018-01-12T22:59:00.000+02:00", "replies_count": 0, "uuid": "c259d9a82cfae0a712b464aea14f5f8ac553f4cb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/business-wire-correcting-and-replacing-avtex-acquires-qos-telesys-genesys-business.html", "ord_in_thread": 0, "title": "CORRECTING and REPLACING Avtex Acquires QoS Telesys Genesys Business", "locations": [], "entities": {"persons": [{"name": "george demou", "sentiment": "none"}], "locations": [{"name": "minneapolis", "sentiment": "none"}], "organizations": [{"name": "organization", "sentiment": "negative"}, {"name": "leading contact center deployment and optimization partner avtex", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Acquisition Further Cements the Organization’s Foothold as a Leading Contact Center Deployment and Optimization Partner\nMINNEAPOLIS--(BUSINESS WIRE)-- Headline of release should read: Avtex Acquires QoS Telesys Genesys Business (instead of Avtex Acquires QoS Telesys).\nThe corrected release reads:\nAVTEX ACQUIRES QOS TELESYS GENESYS BUSINESS\nAcquisition Further Cements the Organization’s Foothold as a Leading Contact Center Deployment and Optimization Partner\nAvtex, a provider of integrated interaction solutions, announced today the acquisition of QoS Telesys, a California-based contact center consulting firm. QoS Telesys focuses on designing and implementing contact center technologies that help clients more engage customers and enhance experiences. Leveraging the Genesys contact center technology portfolio, QoS Telesys creates customized contact center solutions that meet the unique needs of each and every client.\n“Customers of the Genesys platform have relied on QoS technical expertise and innovation for 15 years,” said George Demou, Avtex President and CEO. “We are pleased to bring this talent to Avtex and continue to build our presence in the West.”\nAdding the QoS brand to the Avtex family allows both organizations to continue to provide industry-leading contact center consulting and technology services to clients.\n“When we looked at the ever-changing landscape within our industry it was clear that in order for us to continue providing customer experience solutions we needed to evolve,” said Jeff DeVries of QoS Telesys. “Avtex was a natural partnership that enables us to provide our customers with a level of service and support unmatched in the industry while continuing to evangelize Genesys technology solutions.”\n“I am excited to join Avtex to help move the company into a more CX-centered environment and help clients better understand and utilize the Genesys technologies,” said Robert Wakefield-Carl, of QoS. “With the additional resources our team brings to Avtex, we have a team in place to move customers into the next generation of customer service and understanding technologies like AI, Self-Service, and Mobility Omnichannel to better serve their customers.”\nQoS Telesys is the third acquisition Avtex has made in California recently as they continue to expand and bring their full suite of CX consulting and technology solutions into the western region of the United States.\nAbout Avtex\nAvtex is a full-service Customer Experience (CX) consultancy focused on helping organizations build trust with their customers. As a peer-recognized consulting firm, Avtex guides organizations through the process of creating or improving CX strategies, platforms and policies. Avtex offers a wide range of services to support CX, including CX Consulting, Technology Optimization, Technology Innovation and Systems Management. The company’s long-standing partnerships with industry leading vendors allows it to provide a wide range of technology solutions, including Contact Center, Customer Intelligence, Business Productivity, App Development and more. For more information, visit www.avtex.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180112005597/en/\nAvtex\nBeth Ingebretson, 952-646-0780\nbingebretson@avtex.com\nSource: Avtex", "external_links": ["http://www.businesswire.com/news/home/20180112005597/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.avtex.com%2F&esheet=51742618&newsitemid=20180112005597&lan=en-US&anchor=www.avtex.com&index=1&md5=aa4e85b160170b310104435997bae08e"], "published": "2018-01-12T22:59:00.000+02:00", "crawled": "2018-01-13T01:17:56.009+02:00", "highlightTitle": ""}