{"organizations": [], "uuid": "5cd1afab37b13c98a1d44282a8ae4d59ccea65c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221155157&w=1200&r=LYNXMPEE0A12K", "site_section": "https://www.goldreview.com/?feed=linkfeed", "section_title": "Gold Review » Gold Review", "url": "https://uk.reuters.com/article/us-usa-economy-inflation/u-s-producer-prices-post-first-decline-in-nearly-one-and-a-half-years-idUKKBN1F01S5", "country": "US", "domain_rank": 408, "title": "Cheaper services weigh on U.S. wholesale prices; jobless claims up", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T21:00:00.000+02:00", "replies_count": 0, "uuid": "5cd1afab37b13c98a1d44282a8ae4d59ccea65c3"}, "author": "cmullen", "url": "https://uk.reuters.com/article/us-usa-economy-inflation/u-s-producer-prices-post-first-decline-in-nearly-one-and-a-half-years-idUKKBN1F01S5", "ord_in_thread": 0, "title": "Cheaper services weigh on U.S. wholesale prices; jobless claims up", "locations": [], "entities": {"persons": [{"name": "lucia mutikani", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}], "organizations": [{"name": "federal reserve", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 1:54 PM / Updated 5 hours ago Cheaper services weigh on U.S. wholesale prices; jobless claims up Lucia Mutikani 5 Min Read \nWASHINGTON (Reuters) - U.S. producer prices fell for the first time in nearly 1-1/2 years in December amid declining costs for services, which could temper expectations that inflation will accelerate in 2018. FILE PHOTO: A woman shops for produce inside a Whole Foods Market in the Manhattan borough of New York City, New York, U.S. June 16, 2017. REUTERS/Carlo Allegri/File Photo \nOther data on Thursday showed initial claims for unemployment benefits increasing for the fourth straight week to more than a three-month high. That probably does not signal weakness in the labor market as the number of Americans receiving jobless benefits is at levels last seen in 1973. \nBitter cold and snow in parts of the country likely kept some workers at home, accounting for last week’s jump in jobless claims. \nWeak wholesale prices could stoke fears that the causes of weak inflation will become more persistent and prompt the Federal Reserve to be more cautious about raising interest rates this year. \n“Factories aren’t producing as much inflation, which is sure to bedevil the doves at the Fed who are worried about too low inflation,” said Chris Rupkey, chief economist at MUFG in New York. “Today’s data strike at the heart of the argument over whether Fed officials should let the economy run hot for a while longer with a shallower path of rate hikes.” \nThe U.S. central bank is forecasting three rate hikes for 2018. It raised rates three times last year. \nThe Labor Department said its producer price index for final demand slipped 0.1 percent last month. That was the first drop in the PPI since August 2016 and followed two straight monthly increases of 0.4 percent. \nIn the 12 months through December, the PPI rose 2.6 percent after accelerating 3.1 percent in November. Economists polled by Reuters had forecast the PPI rising 0.2 percent last month and increasing 3.0 percent from a year ago. \nA key gauge of underlying producer price pressures that excludes food, energy and trade services edged up 0.1 percent last month. The so-called core PPI increased 0.4 percent in November. It rose 2.3 percent in the 12 months through December after increasing 2.4 percent in November. \nThe PPI data came on the heels of a report on Wednesday showing a sharp moderation in import prices in December. While the correlation between those two reports and the consumer price index is weak, they underscore the challenge for the Fed to achieve its 2 percent inflation target. \nEconomists are hoping that a tightening labor market and recent weakness in the dollar will boost price pressures this year. The Fed’s preferred inflation measure, the personal consumption expenditures (PCE) price index excluding food and energy, has undershot its target since May 2012. \nThe dollar .DXY fell against a basket of currencies on the wholesale inflation data and expectations that the European Central Bank was preparing to reduce its monetary stimulus program. \nPrices of U.S. Treasuries fell, while stocks on Wall Street rose broadly. SOLID LABOR MARKET \nThe price of services fell 0.2 percent in December after nine straight monthly rises. The decline reflected a 10.7 percent drop in margins for automotive fuels and lubricants retailing. \nWholesale food prices recorded their biggest drop since May, while energy prices were unchanged. The cost of healthcare services increased 0.2 percent last month after being unchanged in November. Those costs feed into the core PCE price index. \nIn a second report on Thursday, the Labor Department said initial claims for state unemployment benefits increased 11,000 to a seasonally adjusted 261,000 for the week ended Jan. 6, the highest level since late September. Economists had forecast claims falling to 245,000 in the latest week. \nA large part of the country faced frigid temperatures and snow during the first week of 2018, likely making it hard for some people to report for work. Unadjusted claims for New York rose by 27,170 last week, more than half of the national total. \nClaims have risen since mid-December, though the data tend to be volatile during year-end holidays. \n“We advise against extrapolating unless the rise is sustained in coming weeks,” said Jim O‘Sullivan, chief U.S. economist at High Frequency Economics in Valhalla, New York. \nLast week marked the 149th straight week that claims remained below the 300,000 threshold, which is associated with a strong labor market. That is the longest such stretch since 1970, when the labor market was much smaller. \nThe labor market is near full employment, with the jobless rate at a 17-year low of 4.1 percent. The number of people receiving benefits after an initial week of aid dropped 35,000 to 1.87 million in the week ended Dec. 30, the lowest level since December 1973. Reporting by Lucia Mutikani; Editing by Paul Simao", "external_links": [], "published": "2018-01-11T21:00:00.000+02:00", "crawled": "2018-01-11T23:14:47.019+02:00", "highlightTitle": ""}