{"organizations": [], "uuid": "6bab3c8816c55a7c0418a05d0dc49028140efd84", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/30/104976594-Fuze_Tea.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/heres-how-coca-cola-is-tackling-the-uks-735-million-sugar-tax.html", "country": "US", "domain_rank": 767, "title": "Here’s how Coca-Cola is tackling the UK’s $735 million sugar tax", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.23, "site_type": "news", "published": "2018-01-30T17:02:00.000+02:00", "replies_count": 0, "uuid": "6bab3c8816c55a7c0418a05d0dc49028140efd84"}, "author": "Lucy Handley", "url": "https://www.cnbc.com/2018/01/30/heres-how-coca-cola-is-tackling-the-uks-735-million-sugar-tax.html", "ord_in_thread": 0, "title": "Here’s how Coca-Cola is tackling the UK’s $735 million sugar tax", "locations": [], "entities": {"persons": [], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}], "organizations": [{"name": "coca-cola", "sentiment": "negative"}, {"name": "coke", "sentiment": "none"}, {"name": "coca-cola company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coca-Cola is bringing three new drinks to the U.K. ahead of a £520 million ($735 million) tax on sugary beverages that will start in April.\nThe company will launch non-dairy drinks brand AdeZ in May and cold drink Honest Coffee in September. Fuze Tea, its iced tea drink, is already available.\nCoke wants to double sales of still drinks by in the U.K. by 2020 and said that 50 percent of revenue growth will come from innovation or new products by the same year, according to an emailed statement.\nFuze Tea is available in the U.K. in two variants in 400ml bottles, and each contain 4.3 grams of sugar per 100ml. The drink will not be subject to the forthcoming sugar levy, which will add 24 pence per liter to drinks with 8 grams per 100 milliliters and 18 pence per liter for those with five grams of sugar per 100 milliliters.\nshow chapters Diet Coke's redesign to attract a new generation 12:57 PM ET Fri, 26 Jan 2018 | 01:46 The Coca-Cola Company is pushing the fact that it sells more than its best-known brand Coke, as part of a \"total beverage\" strategy. In November 2017, it advertised its portfolio of drinks on its Times Square billboard in New York City with the line \"We are Coca-Cola and so much more.\"\nObesity is rising in England with 58 percent of women and 68 percent of men classed as overweight or obese in 2015, according to official statistics. Government body Public Health England welcomed the tax on sodas when it was announced in 2016 in the light of the risks of \"obesity, tooth decay and other life-threatening diseases.\"\nIn November, Coca-Cola CEO James Quincey told CNBC that sugar taxes, which are in place in Mexico, Thailand and a handful of U.S. regions, aren't the whole solution to obesity.\n\"When we can take action, we absolutely have the responsibility to do so, but we believe that solving the obesity crisis, which does need to be solved, will require a much broader response from private companies and the government rather than thinking a narrow tax is going to solve it,\" he said.\nJon Woods, general manager of Coca-Cola in the U.K. told The Daily Telegraph : \"These launches have moved much quicker through the business than before. This is a sign of things to come.\"", "external_links": [], "published": "2018-01-30T17:02:00.000+02:00", "crawled": "2018-01-30T17:02:16.001+02:00", "highlightTitle": ""}