{"organizations": [], "uuid": "7f8be5923c04c12251f55f13df77d897779ad5cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/business-wire-enduro-royalty-trust-announces-monthly-cash-distribution.html", "country": "US", "domain_rank": 767, "title": "Enduro Royalty Trust Announces Monthly Cash Distribution", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.172, "site_type": "news", "published": "2018-01-19T17:15:00.000+02:00", "replies_count": 0, "uuid": "7f8be5923c04c12251f55f13df77d897779ad5cb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/business-wire-enduro-royalty-trust-announces-monthly-cash-distribution.html", "ord_in_thread": 0, "title": "Enduro Royalty Trust Announces Monthly Cash Distribution", "locations": [], "entities": {"persons": [], "locations": [{"name": "houston", "sentiment": "none"}], "organizations": [{"name": "enduro royalty trust", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON--(BUSINESS WIRE)-- Enduro Royalty Trust (NYSE: NDRO) (the “Trust”) today announced a cash distribution to the holders of its units of beneficial interest of $0.018433 per unit, payable on February 14, 2018 to unitholders of record on January 31, 2018. The distribution primarily represents oil production during the month of October 2017 and natural gas production during September 2017.\nThe following table displays underlying oil and natural gas sales volumes and average received wellhead prices attributable to the current and prior month net profits interest calculations.\nUnderlying Sales Volumes Average Price Oil Natural Gas Oil Natural Gas Bbls Bbls/D Mcf Mcf/D (per Bbl) (per Mcf) Current Month 52,890 1,706 353,764 11,792 $ 47.83 $ 2.87 Prior Month 59,411 1,980 308,694 9,958 $ 46.84 $ 2.88 Oil cash receipts for the properties underlying the Trust totaled $2.5 million for the current month, a decrease of $0.3 million from the prior month calculation as a result of a reduction in sales volumes compared to the prior month, due to payment timing differences as well as adjustments related to prior periods. Included in the current month distribution calculation is an adjustment by an operator in the Permian Basin reflecting an adjusted working interest in a well, which resulted in a reduction of 2,814 Bbls related to prior production periods. The reduction in oil revenues due to the decrease in sales volumes was offset by an increase in the realized wellhead price as a result of a 4.1% increase in the NYMEX price to $51.58.\nNatural gas cash receipts increased from $0.9 million in the prior distribution period to $1.0 million in the current month due to increases in natural gas volumes. Natural gas volumes increased primarily due to production volumes from four gross (0.45 net) wells in the Haynesville, which began production in September 2017. These wells contributed 19% and 21% of the current month’s natural gas revenues and volumes, respectively. As these wells began producing in September, the current month's volumes represent production for a partial month. Sales volumes related to these wells included in the current month distribution calculation were 2,477 Mcf/D.\nTotal direct operating expenses, including lease operating expenses, production and ad valorem taxes, and gathering and transportation expenses, increased $0.3 million to $2.7 million due to an increase in lease operating expenses. Capital expenditures for the current month distribution calculation were minimal at $20,000. Total direct operating expenses and capital expenditures relate to expenses incurred in November 2017.\nAbout Enduro Royalty Trust\nEnduro Royalty Trust is a Delaware statutory trust formed by Enduro Resource Partners to own a net profits interest representing the right to receive 80% of the net profits from the sale of oil and natural gas production from certain of Enduro Resource Partners’ properties in the states of Texas, Louisiana and New Mexico. As described in the Trust’s filings with the Securities and Exchange Commission, the amount of the periodic distributions is expected to fluctuate, depending on the proceeds received by the Trust as a result of actual production volumes, oil and gas prices, the amount and timing of capital expenditures, and the Trust’s administrative expenses, among other factors. Future distributions are expected to be made on a monthly basis. For additional information on the Trust, please visit www.enduroroyaltytrust.com .\nForward-Looking Statements and Cautionary Statements\nThis press release contains statements that are “forward-looking statements” within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended. All statements contained in this press release, other than statements of historical facts, are “forward-looking statements” for purposes of these provisions. These forward-looking statements include the amount and date of any anticipated distribution to unitholders and expected expenses, including capital expenditures. The anticipated distribution is based, in large part, on the amount of cash received or expected to be received by the Trust from Enduro Resource Partners with respect to the relevant period. The amount of such cash received or expected to be received by the Trust (and its ability to pay distributions) has been and will be significantly and negatively affected by prevailing low commodity prices, which have declined significantly, could decline further and could remain low for an extended period of time. Other important factors that could cause actual results to differ materially include expenses of the Trust and reserves for anticipated future expenses. Statements made in this press release are qualified by the cautionary statements made in this press release. Neither Enduro Resource Partners nor the Trustee intends, and neither assumes any obligation, to update any of the statements included in this press release. An investment in units issued by Enduro Royalty Trust is subject to the risks described in the Trust’s filings with the SEC, including the risks described in the Trust’s Annual Report on Form 10-K for the year ended December 31, 2016, filed with the SEC on March 15, 2017. The Trust’s quarterly and other filed reports are or will be available over the Internet at the SEC’s website at http://www.sec.gov .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180119005093/en/\nEnduro Royalty Trust\nThe Bank of New York Mellon Trust Company, N.A., as Trustee\nSarah Newell, 1-512-236-6555\nSource: Enduro Royalty Trust", "external_links": ["http://www.businesswire.com/news/home/20180119005093/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51745537&newsitemid=20180119005093&lan=en-US&anchor=http%3A%2F%2Fwww.sec.gov&index=2&md5=c805e65c21e930cb6e36b95a891a6071", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.enduroroyaltytrust.com&esheet=51745537&newsitemid=20180119005093&lan=en-US&anchor=www.enduroroyaltytrust.com&index=1&md5=a1974078c720c7add171f940a80e1a38"], "published": "2018-01-19T17:15:00.000+02:00", "crawled": "2018-01-19T21:06:40.002+02:00", "highlightTitle": ""}