{"organizations": [], "uuid": "d9d616182a5d31c3098b622f690a86bf90434d8d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews/", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-usa-immigration-protections-jobs/strangers-at-home-salvadoran-deportees-welcomed-at-call-centres-idUKKBN1F12HX", "country": "US", "domain_rank": 408, "title": "Strangers at home, Salvadoran deportees welcomed at call centres", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T21:44:00.000+02:00", "replies_count": 0, "uuid": "d9d616182a5d31c3098b622f690a86bf90434d8d"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-immigration-protections-jobs/strangers-at-home-salvadoran-deportees-welcomed-at-call-centres-idUKKBN1F12HX", "ord_in_thread": 0, "title": "Strangers at home, Salvadoran deportees welcomed at call centres", "locations": [], "entities": {"persons": [{"name": "nelson renteria meza", "sentiment": "none"}, {"name": "alexander ramos", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "el salvador", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "san salvador", "sentiment": "none"}, {"name": "san salvador", "sentiment": "none"}], "organizations": [{"name": "mcdonald", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 7:45 PM / Updated an hour ago Strangers at home, Salvadoran deportees welcomed at call centres Nelson Renteria Meza 5 Min Read \nSAN SALVADOR (Reuters) - Alexander Ramos was deported to El Salvador from the United States seven years ago, forced to leave jobs as a gardener and at McDonald’s after getting caught driving without a license. \nBack in his native San Salvador, the 31-year-old brushed up on his English and landed a job at one of the nation’s 70 call centres. \nThe industry, which employs 47 percent more people than two years ago based on government data, is now eyeing a growth spurt after the Trump administration said it would end immigration protection for more than 200,000 Salvadorans. \nThe decision has alarmed Salvadoran immigrants, many of whom have lived for years in the United States and fear returning to a homeland that frequently features among the world’s most violent nations. \nThey dread the prospect of seeking jobs in a country where the minimum wage is less than $10 per day and two out of three people work in the informal economy. \nThe call centres, some run by foreign firms including Tampa-based Convergys Corp and Paris’ Teleperformance SE, could help soften their return with higher paying work making calls and answering customer enquiries. \nNeither company said in recent public filings which customers are serviced from El Salvador, but Convergys counts AT&T as its biggest client. Teleperformance has worked with Apple Inc, and said on its website that its El Salvador location serves seven international clients, mainly from the United States. \nRamos, whose misdemeanour offence in the United States fell short of the kind of crimes that disqualify some potential call centre employees, earns $600 a month. That is just over half of what he made in the United States but double El Salvador’s minimum wage. \nHe said he felt safe working in an office rather than a street environment. Tattoos he wore openly in California could be misinterpreted as gang-related in El Salvador and make him a target for attack, he said. \n“The economic situation is a bit better than what you can make anywhere else, and the environment is safe,” he said. \n“FAST GROWTH” \nSome Salvadorans fled to the United States during its 1980s civil war. Others came later, feeling violence, poverty and natural disasters. Many gained temporary protected status (TPS) following destructive earthquakes in 2001, allowing them to live and work legally in the United States. \nIt is unknown how many Salvadorans will return home after U.S. President Donald Trump’s decision to cancel TPS from September 2019 gave them 18 months to leave or seek lawful residency. \nSome call centre executives foresee a larger pool of talent as a consequence of the move. \n“There is certainly going to be enough momentum that there is going to be very fast growth,” said Jorge Orellana, who oversees Contacto Tu Call Center in San Salvador where 250 employees service U.S. insurance, emergency and finance firms. \nBoth local and foreign companies have taken advantage of El Salvador’s English-speaking workers, proximity to the United States and low labour and operational costs, he added. \nFor U.S. clients the location has been an attractive option compared with more distant outsourcing hubs like India and the Philippines. \nThe industry has also landed in Costa Rica, Guatemala, Honduras, Mexico, Nicaragua and Panama. \n“This happened in Mexico when young people who had grown up in the U.S. started coming back to Mexico, and it would be surprising if something similar doesn’t happen in El Salvador,” said Andrew Selee, president of the Migration Policy Institute in Washington. \nFor some deportees, the call centre industry, which El Salvador’s investment promotion agency (PROESA) says employs 25,000 people, is not an option because their U.S. police records raise security concerns with clients. \nWilliam Lopez, 51, was deported just over a year ago from California, where he lived for four decades until being convicted of domestic violence. He denies the charge. \nThe stain on his record has stopped Lopez securing call centre jobs but the father of two now works with a non-profit training other deportees for such work. \n“We’re expecting many people with the suspension of TPS... I think some of the best jobs that exist here are call centres. It’s clean work, well organised and the salary isn’t bad for pay in this country,” he said.   Enrique Andres Pretel in San Jose; Writing by Daina Beth Solomon in Mexico City; Editing by Frank Jack Daniel, Christian Plumb and Andrew Hay", "external_links": [], "published": "2018-01-12T21:44:00.000+02:00", "crawled": "2018-01-12T22:07:46.008+02:00", "highlightTitle": ""}