{"organizations": [], "uuid": "7266c5128c70dd1648a027d01cae2fbd875892d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221434651&w=1200&r=LYNXMPEE0B0SL", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-russia-election-communists/in-rut-russian-communists-register-surprise-candidate-to-challenge-putin-idUSKBN1F11FN", "country": "US", "domain_rank": 408, "title": "In rut, Russian communists register surprise candidate to challenge Putin", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T14:30:00.000+02:00", "replies_count": 0, "uuid": "7266c5128c70dd1648a027d01cae2fbd875892d4"}, "author": "", "url": "https://www.reuters.com/article/us-russia-election-communists/in-rut-russian-communists-register-surprise-candidate-to-challenge-putin-idUSKBN1F11FN", "ord_in_thread": 0, "title": "In rut, Russian communists register surprise candidate to challenge Putin", "locations": [], "entities": {"persons": [{"name": "putin", "sentiment": "negative"}, {"name": "vladimir putin", "sentiment": "none"}, {"name": "pavel grudinin", "sentiment": "none"}, {"name": "grudinin", "sentiment": "none"}, {"name": "andrew osborn", "sentiment": "none"}, {"name": "gennady zyuganov", "sentiment": "none"}], "locations": [{"name": "united russia", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "communist party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MOSCOW (Reuters) - The Russian Communist Party moved to overhaul its geriatric image on Friday, registering a wealthy 57-year-old farm boss to challenge incumbent Vladimir Putin for the presidency in a gamble it hopes will revive its electoral fortunes.\nRussia’s central election commission on Friday said it had registered Pavel Grudinin, who runs a farm business on the edge of Moscow, as the party’s candidate for the March 18 election after the communists unexpectedly decided against putting up their veteran 73-year-old leader Gennady Zyuganov.\nBacked by state TV, the ruling United Russia party, and many voters who live outside big cities, polls show 65-year-old Putin, who has dominated Russian politics for the last 18 years, is on track to comfortably win a fourth presidential term.\nGrudinin, a fresh face in an otherwise stale political line-up that has hardly changed in the last two decades, could indirectly help Putin by boosting turnout amid signs of apathy among some voters who assume Putin will win however they vote.\nThough a shadow of itself in the Soviet era when it enjoyed a monopoly on power, the Communist Party is also hoping a younger less orthodox contender may be able to revive its fortunes and appeal to younger voters.\nThe party has seen its share of the vote in post-Soviet presidential elections more than halve from a high of almost 41 percent or around 30 million votes in 1996. In the last election, in 2012, it won just over 12 million votes.\nYet it remains popular with millions of Russians, particularly older people who live in rural communities, retains a nationwide network, and regularly comes second to the ruling party in elections.\nUNORTHODOX COMMUNIST Leader of the Russian Communist Party Gennady Zyuganov (R) stands next to his fellow party member Pavel Grudinin, who was registered as a candidate in the upcoming presidential election, at the Central Election Commission headquarters in Moscow, Russia January 12, 2018. REUTERS/Sergei Karpukhin Grudinin is not a typical communist candidate.\nZyuganov, who the party has fielded unsuccessfully in four presidential elections, is known for hard line communist views, his frequent quoting of Soviet revolutionary Vladimir Lenin, and once called for the re-Stalinisation of society.\nSlideshow (4 Images) Grudinin, a former Putin supporter, makes jokes, is open about the fact that he earns 20 million rubles ($353,773.17) a year, says modern communists should learn from the USSR’s mistakes, and advocates Russia borrowing some aspects of Chinese-style communism.\nObservers have noticed another big difference.\nWhile Zyuganov in recent years would criticize the ruling United Russia party, he was careful, in the tightly-controlled political system, not to harshly criticize Putin.\nGrudinin has been less coy, accusing Putin of making empty promises and suggesting he has been in power too long, even comparing him to veteran Soviet leader Leonid Brezhnev whose lengthy rule became synonymous with decay.\n“When General Secretary Brezhnev sat in his post (for too long) it was bad,” Grudinin told a state TV talk show last month. “Why are we repeating the same mistake?”\n($1 = 56.5334 rubles)\nReporting by Andrew Osborn; Editing by Richard Balmforth\n ", "external_links": [], "published": "2018-01-12T14:30:00.000+02:00", "crawled": "2018-01-12T14:37:56.006+02:00", "highlightTitle": ""}