{"organizations": [], "uuid": "aadda17cf4721a03ce0757ce31ae2b386b370569", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/italy-factors-jan-19/italy-factors-to-watch-on-jan-19-idUSL8N1PA3QI", "country": "US", "domain_rank": 408, "title": "Italy - Factors to watch on Jan. 19", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-19T13:02:00.000+02:00", "replies_count": 0, "uuid": "aadda17cf4721a03ce0757ce31ae2b386b370569"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/italy-factors-jan-19/italy-factors-to-watch-on-jan-19-idUSL8N1PA3QI", "ord_in_thread": 0, "title": "Italy - Factors to watch on Jan. 19", "locations": [], "entities": {"persons": [{"name": "jean pierre mustier", "sentiment": "none"}, {"name": "vivendi", "sentiment": "none"}, {"name": "gregorio borgo", "sentiment": "none"}, {"name": "matteo mascazzini", "sentiment": "none"}, {"name": "mustier", "sentiment": "none"}], "locations": [{"name": "italy", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "vivendi", "sentiment": "none"}, {"name": "gucci", "sentiment": "none"}, {"name": "geox", "sentiment": "none"}, {"name": "telecom italia", "sentiment": "none"}, {"name": "mediaset", "sentiment": "none"}, {"name": "deutsche bank", "sentiment": "none"}, {"name": "unicredit", "sentiment": "none"}, {"name": "mediaset", "sentiment": "none"}, {"name": "unicredit", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The following factors could affect Italian markets on Friday.\nReuters has not verified the newspaper reports, and cannot vouch for their accuracy. New items are marked with (*).\nFor a complete list of diary events in Italy please click on .\nCOMPANIES UNICREDIT CEO Jean Pierre Mustier told Reuters he had a long-term commitment to the bank when asked about a report that he was the preferred candidate for the top job at Deutsche Bank.\nAsked about consolidation in the banking industry, Mustier said a merger risked hindering a bank’s transformation and reiterated that UniCredit’s business plan is based on organic growth.\nMEDIASET The decision to restart talks on the joint venture between Telecom Italia and Vivendi’s Canal Plus has put back a solution to the dispute between Mediaset and Vivendi over the failed deal to sell the French giant pay TV unit Premium, Il Sole 24 Ore said.\nGEOX The Italian shoemaker said on Thursday it was set to appoint senior Gucci manager Matteo Mascazzini as its new chief executive from next month, replacing Gregorio Borgo.\nPOSTE ITALIANE Italy’s post office said on Thursday it aimed to reap at least 1.8 billion euros ($2.2 billion) in fees this year from selling postal bonds and certificates on behalf of state lender CDP.\nBANCO BPM France’s BNP Paribas BNPP.PA is the frontrunner to buy the depositary banking business of Italy’s Banco BPM, which could be worth around 200 million euros ($245 million), two sources close to the matter said.\n(*) CREVAL The bank’s 700 million euro capital increase should kick off on February 19, Il Messaggero said. Mediobanca and Citi are readying to pick three more lenders for the banking consortium, it said.\nCARRARO The Italian group said on Thursday it had approved issuing a bond for up to 180 million euros.\nIn an interview in Il Corriere della Sera the company’s chairman Enrico Carraro said the bond would help support the business plan, adding the company would try to beat the plan’s targets in less than five years.\n(*) MONDADORI MF says the publisher could sell its TU Style publication, adding this might not be the only disposal.\nIPO, ITALY RAILWAYS The plan to list Italy’s high-speed train service will have to wait the outcome of the general elections in March, the CEO of Italian railways Renato Mazzoncini said on Thursday, as cited by Il Sole 24 Ore. The CEO told the paper if the aim of any IPO was to fund the acquisition of new trains, the green bond it had issued at record low interest rates in December was a better option than a listing.\n(*) ALITALIA Air France-KLM have asked for access to the data room in the process to sell Alitalia, Il Sole 24 Ore said.\nBB BIOTECH Board meeting on preliminary FY results.\nIMA Bondholders’ meeting.\nLUCISANO MEDIA GROUP Ordinary and extraordinary shareholders’ meetings.\nFor Italian market data and news, click on codes in brackets:\n20 biggest gainers (in percentage)\n20 biggest losers (in percentage)\nFTSE IT allshare index\nFTSE Mib index\nFTSE Allstars index...\nFTSE Mid Cap index....\nBlock trades\nStories on Italy IT-LEN\nFor pan-European market data and news, click on codes in brackets: European Equities speed guide FTSEurofirst 300 index DJ STOXX index Top 10 STOXX sectors Top 10 EUROSTOXX sectors Top 10 Eurofirst 300 sectors Top 25 European pct gainers Top 25 European pct losers Main stock markets: Dow Jones Wall Street report Nikkei 225 Tokyo report FTSE 100 London report Xetra DAX Frankfurt market stories CAC-40 Paris market stories... World Indices Reuters survey of world bourse outlook Western European IPO diary European Asset Allocation Reuters News at a Glance: Equities Main currency report:\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T13:02:00.000+02:00", "crawled": "2018-01-20T17:26:32.001+02:00", "highlightTitle": ""}