{"organizations": [], "uuid": "7dfc00934ae2e5a4fc4a9e999acdf99199b456aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-union-bank-trust-announces-acquisition-of-dixon-hubard-feinour-brown-inc.html", "country": "US", "domain_rank": 767, "title": "Union Bank & Trust Announces Acquisition of Dixon, Hubard, Feinour, & Brown, Inc.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.036, "site_type": "news", "published": "2018-01-29T16:30:00.000+02:00", "replies_count": 0, "uuid": "7dfc00934ae2e5a4fc4a9e999acdf99199b456aa"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-union-bank-trust-announces-acquisition-of-dixon-hubard-feinour-brown-inc.html", "ord_in_thread": 0, "title": "Union Bank & Trust Announces Acquisition of Dixon, Hubard, Feinour, & Brown, Inc.", "locations": [], "entities": {"persons": [{"name": "hubard", "sentiment": "none"}, {"name": "dixon", "sentiment": "none"}, {"name": "robert p. martin", "sentiment": "none"}], "locations": [{"name": "richmond", "sentiment": "none"}, {"name": "va.", "sentiment": "none"}, {"name": "feinour", "sentiment": "none"}, {"name": "roanoke", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}], "organizations": [{"name": "union bank & trust", "sentiment": "negative"}, {"name": "union bank & trust announces acquisition of dixon, hubard, feinour, & brown, inc", "sentiment": "neutral"}, {"name": "& brown, inc.", "sentiment": "none"}, {"name": "union wealth management president for union bank & trust", "sentiment": "none"}, {"name": "dixon, hubard, feinour, & brown, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "RICHMOND, Va., Jan. 29, 2018 (GLOBE NEWSWIRE) -- Union Bank & Trust (“Union”) today announced that it has entered into an agreement to acquire Dixon, Hubard, Feinour, & Brown, Inc., a Roanoke, Virginia based registered investment advisory firm with approximately $600 million in assets under management and advisement.\nFounded in 1981, Dixon, Hubard, Feinour, & Brown, Inc., will operate as a stand-alone subsidiary of Union Bank & Trust. The current principals and current employees will stay with the firm, which will continue to operate from its current offices in Roanoke. The acquisition, which is subject to certain closing conditions and approvals, is scheduled to close during the second quarter.\n“We are very pleased to bring Dixon, Hubard, Feinour, & Brown, Inc. under the Union umbrella while retaining the core leadership team that helped build the firm,” said Robert P. Martin, Union Wealth Management President for Union Bank & Trust. “We want to expand the reach and capabilities of our wealth management team by adding investment strategies, core competencies and advisory talent in key markets. Dixon Hubard, Feinour, & Brown, Inc. is one of the preeminent registered investment advisors in Virginia and adds a strong team that will complement our ability to offer broad financial solutions to our clients.”\n“We’ve built our business by taking care of clients and delivering investment results,” said C. Whitney Brown, Jr., President of Dixon, Hubard, Feinour, & Brown. “Partnering with Union will keep us doing what we do best while gaining access to the resources of Virginia’s only homegrown regional bank. Union’s roots in our area and their community-based approach to doing business make this a great fit.”\nUnion’s Wealth Management offers comprehensive wealth management services including asset management, trust, estate planning, private banking, brokerage and financial planning. With Dixon, Hubard, Feinour & Brown, it will have more than $3.2 billion in assets under management and advisement with advisors throughout the Commonwealth of Virginia.\nABOUT UNION BANKSHARES CORPORATION\nHeadquartered in Richmond, Virginia, Union Bankshares Corporation (NASDAQ:UBSH) is the holding company for Union Bank & Trust, which has 150 banking offices, 39 of which are operated as Xenith Bank, a division of Union Bank & Trust of Richmond, Virginia, and approximately 220 ATMs located throughout Virginia and in portions of Maryland and North Carolina. Union Bank & Trust also operates Shore Premier Finance, a specialty marine lender. Non-bank affiliates of the holding company include: Union Mortgage Group, Inc., which provides a full line of mortgage products, Old Dominion Capital Management, Inc., which provides investment advisory services, and Union Insurance Group, LLC, which offers various lines of insurance products.\nFORWARD-LOOKING STATEMENTS\nCertain statements in this report may constitute “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements are statements that include projections, predictions, expectations, or beliefs about future events or results or otherwise and are not statements of historical fact. Such statements are often characterized by the use of qualified words (and their derivatives) such as “expect,” “believe,” “estimate,” “plan,” “project,” “anticipate,” “intend,” “will,” or words of similar meaning or other statements concerning opinions or judgment of the Company and its management about future events. Although the Company believes that its expectations with respect to forward-looking statements are based upon reasonable assumptions within the bounds of its existing knowledge of its business and operations, there can be no assurance that actual results, performance, or achievements of the Company will not differ materially from any future results, performance, or achievements expressed or implied by such forward-looking statements. Actual future results and trends may differ materially from historical results or those anticipated depending on a variety of factors, including, but not limited to, the effects of and changes in: general economic and bank industry conditions, the interest rate environment, legislative and regulatory requirements, competitive pressures, new products and delivery systems, inflation, changes in the stock and bond markets, accounting standards or interpretations of existing standards, mergers and acquisitions, technology, and consumer spending and savings habits. More information is available on the Company’s website, http://investors.bankatunion.com and on the Securities and Exchange Commission’s website, www.sec.gov . The information on the Company’s website is not a part of this release. The Company does not intend or assume any obligation to update or revise any forward-looking statements that may be made from time to time by or on behalf of the Company.\nContact: Bill Cimino (804) 448-0937, VP and Director of Investor Relations\nSource:Union Bankshares Corporation", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/f4e4a377-7518-492b-b259-993f661f5b36"], "published": "2018-01-29T16:30:00.000+02:00", "crawled": "2018-01-29T19:26:28.004+02:00", "highlightTitle": ""}