{"organizations": [], "uuid": "d9388639d003c1dfb813ecc4f46cce39deb472d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226958027&w=1200&r=LYNXMPEE0U0TF", "site_section": "http://feeds.reuters.com/reuters/UKFundsNews/", "section_title": "Reuters: Funds News", "url": "https://uk.reuters.com/article/uk-funds-poll-europe/european-funds-cut-bonds-to-one-year-low-see-bears-approaching-reuters-poll-idUKKBN1FK1NO", "country": "US", "domain_rank": 408, "title": "European funds cut bonds to one-year low, see bears approaching - Reuters poll", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T15:48:00.000+02:00", "replies_count": 0, "uuid": "d9388639d003c1dfb813ecc4f46cce39deb472d1"}, "author": "", "url": "https://uk.reuters.com/article/uk-funds-poll-europe/european-funds-cut-bonds-to-one-year-low-see-bears-approaching-reuters-poll-idUKKBN1FK1NO", "ord_in_thread": 0, "title": "European funds cut bonds to one-year low, see bears approaching - Reuters poll", "locations": [], "entities": {"persons": [{"name": "thomas", "sentiment": "none"}, {"name": "sujata rao", "sentiment": "none"}], "locations": [], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "u.s. federal reserve", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 12:17 PM / Updated 21 minutes ago European funds cut bonds to one-year low, see bears approaching - Reuters poll Sujata Rao 4 Min   The share of bonds in European fund managers’ portfolios has dropped to its lowest in a year, with many investors coming round to the view that a bear market in debt is underway, Reuters’ latest monthly poll has found. \nThe survey of 18 European asset managers was   coinciding with U.S. Treasury yields racing to their highest in more than three years and German five-year yields rising into positive territory briefly for the first time since 2015. \nWith some now predicting the U.S. Federal Reserve will raise rates as many as four times this year and the European Central Bank apparently preparing to end its money printing as the euro economy rebounds, there seems to be no way for bond yields to go but up. \nEuropean funds cut bond allocations by 2.6 percentage points over January to 38.7 percent of global portfolios. Government bond exposure was at the lowest since October 2017. \n“The times of juicy returns on bonds are over,” said Thomas   Investments. \n“Global economic growth has picked up to near 4 percent, inflation is starting to recover, and central banks are (rightly) gradually removing their extraordinary accommodation. All those factors support a rise in bond yields.” \nOf those who answered a special question on the subject, 60 percent said they believed a bond bear market had begun. \nHowever, some dissented, and even the pessimists saw interest rates remaining low for the foreseeable future and inflation staying contained. \n“The catalyst for a bear market has to be a sustained inflationary shock. At present, it’s more a marginal fear than a reality,” said Colin Harte, a portfolio manager at BNP Paribas Asset Management. \nJan Bopp, asset allocation strategist at J Safra Sarasin said it was too early to say if a bear market had set in, but he added: “I am sure that we have seen the lows in yields and that we will see higher yields in the coming years. But central banks will make sure that this rise will be gradual.” \nRising yields have knocked world stocks off record highs in recent days, even if MSCI’s all-country index is   a record 15th straight month of gains and emerging equities have enjoyed their best January since 2012. \nInvestors remain keen on stocks, betting bond markets will not derail the rally. With the world economy expected to expand 3.9 percent, according to International Monetary Fund forecasts, global commerce is growing even faster and company profits are strong. \nEquity allocations rose to 46 percent, the highest since October. Within equity portfolios, investors preferred Europe, raising exposure to four-month highs of 30.7 percent. \nUK equity holdings rose to 6.4 percent, the highest since June. Japanese equities were 10.2 percent, the highest since May 2015, the poll showed. \nRobeco strategist Peter van der Welle said he took some profit on equity holdings but remains overweight, especially in Japan where authorities have downplayed any near-term changes to stimulus policies. \nInvestors were almost equally divided on risks from Italy’s March 4 election, which is expected to end in a hung parliament. While the eurosceptic 5-Star is the most popular party, it is not expected to win enough seats to form a government alone, and has also steadily moved away from unorthodox economic positions. \n“The risk slightly decreased, as a government led by anti-establishment parties seems a remote possibility,” said Pascal Blanque,   of Amundi. Reporting by Sujata Rao,   Claire Milhench and Maria Pia Quaglia, editing by Larry King", "external_links": [], "published": "2018-01-31T15:48:00.000+02:00", "crawled": "2018-01-31T16:11:53.018+02:00", "highlightTitle": ""}