{"organizations": [], "uuid": "d2d53e5f9532a9044a119e39741bb1af8a65852b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/eurozone-bonds/german-bond-yields-set-for-sixth-straight-week-of-rises-idUSL8N1PL1LQ", "country": "US", "domain_rank": 408, "title": "German bond yields set for sixth straight week of rises", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T10:53:00.000+02:00", "replies_count": 0, "uuid": "d2d53e5f9532a9044a119e39741bb1af8a65852b"}, "author": "", "url": "https://www.reuters.com/article/eurozone-bonds/german-bond-yields-set-for-sixth-straight-week-of-rises-idUSL8N1PL1LQ", "ord_in_thread": 0, "title": "German bond yields set for sixth straight week of rises", "locations": [], "entities": {"persons": [{"name": "fanny potkin", "sentiment": "none"}, {"name": "draghi", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "european central bank", "sentiment": "none"}, {"name": "reuters ecb", "sentiment": "none"}, {"name": "ing", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 8:56 AM / Updated 21 minutes ago German bond yields set for sixth straight week of rises Reuters Staff \n* German bond yields nudge away from 6 months highs \n* Most euro zone bond yields down 1-2 bps \n* Sources tell Reuters ECB policymakers split on euro \nBy Fanny Potkin \nLONDON, Jan 26 (Reuters) - German bond yields edged off six-month lows on Friday but were set for their sixth straight week of rises, a day after the European Central Bank surprised markets by striking a modestly dovish tone in the face of a robust euro. \nWhile a degree of calm returned to markets after a heavy selloff on Thursday, sentiment remained defensive. \nGerman 10-year bond yields were set for their six straight week of rises, their longest run of weekly rises since 2010. , according to Reuters data. \n“President Draghi clearly failed to live up to the market’s dovish expectations yesterday,” ING strategists said in a note. \n“The communication on the exchange rate fell short of market expectations for a stronger stance ahead of the meeting...with the only real dovish element was that he saw few chances for a rate hike already this year.” \nThe euro, which soared above $1.25 to a three-year high on Thursday, was 0.5 percent higher on Friday at $1.2460. \nSources told Reuters on Thursday that ECB policymakers were split on their next policy move as a stronger-than-expected rise in the euro gets in the way of their careful exit from years of aggressive stimulus. \nRate setters had been working on the assumption of making a change to their policy message in March to signal that they were preparing to phase out their 2.55 trillion euro ($3.18 trillion) money-printing programme later in the year. \nBut the euro’s strength threatens to curb the recovery in inflation. Some policymakers still want to discuss dropping in March a pledge to ramp up their bond purchases if needed, the three sources on or close to the Governing Council told Reuters. \nGoverning Council member Francois Villeroy de Galhau said on Friday the ECB must keep a close eye on the impact that swings in the exchange rates have on the inflation outlook. \nMost euro zone bond yields were down 1-2 basis points on the day. \nGermany’s 10-year bond yield fell 2 bps to 0.543 percent, having hit a six-month high at 0.579 percent on Thursday after Draghi said euro zone inflation should rise in the medium term. \nGermany was also in focus on Friday, as a new round of negotiations for a coalition government began, which could contribute to added demand for safe haven assets. \nGerman Chancellor Angela Merkel said she was optimistic about the outcome as she headed into coalition talks with the Social Democrats (SPD) and added that the two parties would negotiate swiftly as they seek to end the political impasse in Europe’s largest economy. \nItaly is expected to sell up to 1.75 billion euros of bonds later in the day. Reporting by Fanny Potkin; Graphic by Dhara Ranasinghe; Editing by Ralph Boulton", "external_links": [], "published": "2018-01-26T10:53:00.000+02:00", "crawled": "2018-01-26T11:27:20.026+02:00", "highlightTitle": ""}