{"organizations": [], "uuid": "3f8c369d00a0a42201898770a89a28d4e874d2bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-colony-bankcorp-inc-announces-fourth-quarter-results.html", "country": "US", "domain_rank": 767, "title": "Colony Bankcorp, Inc. Fourth Quarter Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T16:00:00.000+02:00", "replies_count": 0, "uuid": "3f8c369d00a0a42201898770a89a28d4e874d2bc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-colony-bankcorp-inc-announces-fourth-quarter-results.html", "ord_in_thread": 0, "title": "Colony Bankcorp, Inc. Fourth Quarter Results", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "none"}], "locations": [{"name": "ga.", "sentiment": "none"}], "organizations": [{"name": "colony bankcorp, inc", "sentiment": "neutral"}, {"name": "colony bankcorp, inc.", "sentiment": "neutral"}, {"name": "fasb", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FITZGERALD, Ga., Jan. 26, 2018 (GLOBE NEWSWIRE) -- Colony Bankcorp, Inc. (Nasdaq:CBAN), today reported net income available to shareholders of $579,000, or $0.07 per diluted share for the fourth quarter of 2017 compared to $1,883,000, or $0.22 per diluted share for the comparable 2016 period, while net income available to shareholders for the twelve month period ended December 31, 2017 was $7,540,000, or $0.87 per diluted share compared to $7,180,000, or $0.84 per share for the comparable 2016 period. During the quarter earnings were negatively impacted $2,041,000, or $0.24 per share due to additional income tax expense resulting from a one-time write down of deferred assets. As a result of the Tax Reform Act signed by President Trump on December 22, 2017, FASB accounting standards required public companies to write down deferred tax assets to the new tax rate of 21% compared to the old rate of 35%. Excluding the one-time tax adjustment, earnings for the quarter would have been $2,620,000, or $0.30 per share, while year to date earnings would have been $9,581,000 or $1.11 per share. Though we were impacted this quarter by the one-time expense to earnings, the lower tax rates will be very positive for future earnings. Earnings were positively impacted by an increase in net interest income and noninterest income and a reduction in preferred stock dividends and loan loss provision. “We are pleased to report an outstanding year for Colony, said Ed Loomis, President and Chief Executive Officer. Excluding the one-time tax adjustment, earnings was 33.44 percent over the prior year, capital remains well-capitalized with all regulatory requirements and asset quality reflects continued improvement from a year ago. As we look forward to 2018, the new tax reform will result in improved earnings due to the lower tax rate. We continue to explore options to improve operating efficiencies and to increase loan growth, which in turn will further enhance shareholder value.”\nCapital\nColony continues to maintain a strong regulatory capital position to be categorized as “well-capitalized” by regulatory benchmarks. At December 31, 2017, the Company’s tier one leverage ratio, tier one ratio, total risk-based capital ratio and common equity tier one capital ratio were 9.89 percent, 14.64 percent,15.56 percent and 11.78 percent, respectively, compared to 10.29 percent, 15.50 percent, 16.64 percent and 11.32 percent, respectively, at December 31, 2016. The Company’s capital ratios were all in excess of regulatory minimums required to be classified as “well-capitalized.”\nNet Interest Margin\nDuring the fourth quarter of 2017, the Company reported net interest income of $9.92 million and a net interest margin of 3.50 percent compared to $9.57 million and 3.48 percent, respectively, for fourth quarter 2016, while net interest income YTD 2017 was $39.04 million and a net interest margin of 3.46 percent compared to $38.11 million and 3.51 percent, respectively, for the same comparable period in 2016. As we shift more dollars out of lower yielding investments into higher yielding loans, we should realize net interest margin improvement. Our focus in 2018 will be on loan and deposit pricing along with loan growth to maintain or improve its’ net interest margin.\nAsset Quality\nAsset quality remains solid with marked improvement from a year ago. Substandard assets that include non-performing assets totaled $26.19 million at December 31, 2017 compared to $33.23 million at December 31, 2016. Substandard assets adjusted for SBA guarantees to tier one capital plus loan loss reserve ratio was 20.18 percent at December 31,2017compared to 25.67 percent a year ago. Non-performing assets decreased significantly from the year ago period to $11.76 million or 1.53 percent of total loans and other real estate owned as of December 31, 2017. This compares to $18.79 million or 2.47 percent at December 31, 2016.\nOther real estate (“OREO”) totaled $4.26 million at December 31, 2017 compared to $6.44 million at December 31, 2016. Though these levels remain slightly elevated, we continue to work diligently to dispose these properties at fair value. There are several pending transactions that we anticipate closing in the near future to further reduce our OREO holdings.\nIn the fourth quarter of 2017 net charge-offs were $525 thousand, or 0.07 percent of average loans as compared to net charge-offs of $280 thousand, or 0.04 percent of average loans in fourth quarter 2016, while YTD 2017 net charge-offs were $1,806 thousand, or 0.24 percent of average loans compared to $743 thousand, or 0.10 percent of average loans for the comparable 2016 period. The loan loss reserve was $7.51 million or 0.98 percent of total loans on December 31, 2017 compared to $8.92 million or 1.18 percent at December 31, 2016. Loan loss reserve methodology resulted in $55 thousand loan loss provision for three months ended December 31, 2017 compared to no provision for the comparable 2016 period, while YTD 2017 provision for loan losses was $390 thousand compared to $1,062 thousand for the comparable 2016 period.\nNoninterest Income\nTotal noninterest income increased in the comparable periods as noninterest income for twelve months ended December 31, 2017 was $9.73 million compared to $9.55 million in the comparable 2016 period, or an increase of 1.89 percent. Secondary mortgage fee income increased $177 thousand or 25.95 percent, service charges on deposits increased $160 thousand or 3.71 percent and debit card interchange fees increased $179 thousand or 7.41 percent to primarily account for the increase. Offset to these increases was gains on the sale of securities in 2016 of $385 thousand compared to no gains in 2017.\nNoninterest Expense\nTotal noninterest expense decreased in the comparable periods as noninterest expense for twelve months ended December 31, 2017 was $33.86 million compared to $34.07 million for the comparable 2016 period, or an decrease of 0.63 percent. Salaries and employee benefit expenses increased 4.00 percent, occupancy expense remained flat and other noninterest expense decreased 8.01 percent for the comparable periods. The efficiency ratio improved to 69.19 percent for twelve months ended December 31, 2017 compared to 71.81 percent for the comparable 2016 period. The company continues to explore opportunities to improve its’ operating efficiency.\nColony Bankcorp, Inc. is a bank holding company headquartered in Fitzgerald, Georgia that consists of one operating subsidiary, Colony Bank. Colony Bank conducts a general full service commercial, consumer and mortgage banking business through twenty-seven offices located in the central, southern and coastal Georgia cities of Albany, Ashburn, Broxton, Centerville, Columbus, Cordele, Douglas, Eastman,\nFitzgerald, Leesburg, Moultrie, Quitman, Rochelle, Savannah, Soperton, Statesboro, Sylvester, Thomaston, Tifton, Valdosta and Warner Robins, Georgia.\nColony Bankcorp, Inc. Common Stock is Quote: d on the Nasdaq Global Market under the symbol “CBAN”.\nCertain statements contained in the preceding release that are not statements of historical fact constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 (the “Act”), notwithstanding that such statements are not specifically identified. In addition, certain statements may be contained in the Company’s future filings with the SEC, in press releases, and in oral and written statements made by or with the approval of the Company that are not statements of historical fact and constitute forward-looking statements within the meaning of the Act. Examples of forward-looking statements include, but are not limited to: (i) projections of revenues, income or loss, earnings or loss per share, the payment or nonpayment of dividends, capital structure and other financial items; (ii) statement of plans and objectives of Colony Bankcorp, Inc. or its management or Board of Directors, including those relating to products or services; (iii) statements of future economic performance; and (iv) statements of assumptions underlying such statements. Words such as “believes,” “anticipates,” “expects,” “intends,” “targeted” and similar expressions are intended to identify forward-looking statements but are not the exclusive means of identifying such statements.\nForward-looking statements involve risks and uncertainties that may cause actual results to differ materially from those in such statements. Forward-looking statements speak only as of the date on which such statements are made. The Company undertakes no obligation to update any forward-looking statement to reflect events or circumstances after the date on which such statement is made, or to reflect the occurrence of unanticipated events. Readers are cautioned not to place undue reliance on these forward-looking statements.\nConsolidated Balance Sheets Colony Bankcorp, Inc. (in thousands) December 31, 2017 December 31, 2016 December 31, 2015 (unaudited) (audited) (audited) ASSETS Cash and Cash Equivalents Cash and Due from Banks $ 23,145 $ 28,822 $ 22,257 Interest-Bearing Deposits 34,668 46,345 38,615 Investment Securities Available for Sale, at Fair Value 354,247 323,658 296,149 Federal Home Loan Bank Stock, at Cost 3,043 3,010 2,731 Loans 765,284 754,283 758,636 Allowance for Loan Losses (7,507 ) (8,923 ) (8,604 ) Unearned Interest and Fees (495 ) (361 ) (357 ) 757,282 744,999 749,675 Premises and Equipment 27,639 27,969 26,454 Other Real Estate 4,256 6,439 8,839 Other Intangible Assets 45 81 116 Other Assets 28,430 29,119 29,313 Total Assets $ 1,232,755 $ 1,210,442 $ 1,174,149 LIABILITIES AND STOCKHOLDERS' EQUITY Deposits Noninterest-Bearing $ 190,929 $ 159,059 $ 133,886 Interest-Bearing 877,057 885,298 877,668 1,067,986 1,044,357 1,011,554 Borrowed Money Subordinated Debentures 24,229 24,229 24,229 Other Borrowed Money 47,500 46,000 40,000 71,729 70,229 64,229 Other Liabilities 2,717 2,468 2,909 Stockholders' Equity Preferred Stock, Stated Value $1,000 a Share; Authorized 10,000,000 Shares, Issued 0 Shares as of Dec. 31, 2017, 9,360 as of Dec. 31, 2016 and 18,021 as of Dec. 31, 2015, Respectively - 9,360 18,021 Common Stock, Par Value $1 a share; Authorized 20,000,000 Shares, Issued 8,439,258 Shares as of Dec. 31, 2017, Dec. 31, 2016 and Dec. 31, 2015 Respectively 8,439 8,439 8,439 Paid in Capital 29,145 29,145 29,145 Retained Earnings 59,231 51,466 44,286 Accumulated Other Comprehensive Loss, Net of Tax (6,492 ) (5,022 ) (4,434 ) 90,323 93,388 95,457 Total Liabilities and Stockholders' Equity $ 1,232,755 $ 1,210,442 $ 1,174,149\nConsolidated Statements of Income Colony Bankcorp, Inc. (in thousands except per share data) Quarter Year-to-Date Three Months Ended Twelve Months Ended 12/31/2017 12/31/2016 12/31/2017 12/31/2016 (unaudited) (audited) (unaudited) (audited) Interest Income Loans, Including Fees $ 9,730 $ 9,808 $ 38,614 $ 38,943 Deposits with Other Banks 66 45 232 124 Investment Securities U.S. Government Agencies 1,786 1,286 6,718 5,264 State, County and Municipal 28 30 115 127 Corporate Debt 29 - 88 - Dividends on Other Investments 41 34 150 131 11,680 11,203 45,917 44,589 Interest Expense Deposits 1,199 1,201 4,758 4,781 Federal Funds Purchased - 1 3 1 Borrowed Money 558 432 2,112 1,701 1,757 1,634 6,873 6,483 Net Interest Income 9,923 9,569 39,044 38,106 Provision for Loan Losses 55 - 390 1,062 Net Interest Income After Provision for Loan Losses 9,868 9,569 38,654 37,044 Noninterest Income Service Charges on Deposits 1,152 1,122 4,467 4,307 Other Service Charges, Commissions and Fees 740 698 3,040 2,802 Mortgage Fee Income 230 175 859 682 Securities Gains (Losses) - - - 385 Other 394 397 1,368 1,377 2,516 2,392 9,734 9,553 Noninterest Expense Salaries and Employee Benefits 4,756 4,658 19,223 18,483 Occupancy and Equipment 983 1,003 3,948 3,970 Other 2,713 3,169 10,689 11,620 8,452 8,830 33,860 34,073 Income Before Income Taxes 3,932 3,131 14,528 12,524 Income Taxes 3,353 944 6,777 3,851 Net Income 579 2,187 7,751 8,673 Preferred Stock Dividends - 304 211 1,493 Net Income Available to Common Shareholders (1) $ 579 $ 1,883 $ 7,540 $ 7,180 Net Income Per Share of Common Stock Basic $ 0.07 $ 0.22 $ 0.89 $ 0.85 Diluted $ 0.07 $ 0.22 $ 0.87 $ 0.84 Cash Dividends Declared Per Share $ 0.025 $ - $ 0.100 - Weighted Average Basic Shares Outstanding 8,439,258 8,439,258 8,439,258 8,439,258 Weighted Average Diluted Shares Outstanding 8,639,258 8,553,937 8,633,581 8,513,295 (1) Excluding one-time tax adjustment for deferred taxes, net income would have been $2,620, or $0.30 per share and\n$9,581, or $1.11 per share, respectively, for fourth quarter 2017 and YTD 2017.\nCOLONY BANKCORP, INC FINANCIAL HIGHLIGHTS (UNAUDITED) DOLLARS IN THOUSANDS, EXCEPT PER SHARE DATA QUARTER ENDED YEAR-TO-DATE EARNINGS SUMMARY 12/31/2017 12/31/2016 12/31/2017 12/31/2016 Net Interest Income $ 9,923 $ 9,569 $ 39,044 $ 38,106 Provision for Loan Losses 55 - 390 1,062 Non-interest Income 2,516 2,392 9,734 9,553 Non-interest Expense 8,452 8,830 33,860 34,073 Income Taxes 3,353 944 6,777 3,851 Net Income 579 2,187 7,751 8,673 Preferred Stock Dividend - 304 211 1,493 Net Income Available to Common Shareholders ** 579 1,883 7,540 7,180 ** Excluding one-time tax adjustment for deferred taxes, net income would have been $2,620 and $9,581, respectively, for fourth quarter 2017 and YTD 2017. QUARTER ENDED YEAR-TO-DATE PER COMMON SHARE SUMMARY 12/31/2017 12/31/2016 12/31/2017 12/31/2016 Common Shares Outstanding 8,439,258 8,439,258 8,439,258 8,439,258 Weighted Average Basic Shares 8,439,258 8,439,258 8,439,258 8,439,258 Weighted Average Diluted Shares 8,639,258 8,553,937 8,633,581 8,513,295 Earnings Per Basic Share (b) $0.07 $0.22 $0.89 $0.85 Earnings Per Diluted Share (b)** $0.07 $0.22 $0.87 $0.84 Cash Dividends Declared Per Share $0.025 - $0.100 - Common Book Value Per Share $10.70 $9.96 $10.70 $9.96 Tangible Common Book Value Per Share $10.70 $9.95 $10.70 $9.95 ** Excluding one-time tax adjustment for deferred taxes, earnings per diluted share would have been $0.30 and $1.11, respectively, for fourth quarter 2017 and YTD 2017.\nQUARTER ENDED YEAR-TO-DATE OPERATING RATIOS (1) 12/31/2017 12/31/2016 12/31/2017 12/31/2016 Net Interest Margin (a) 3.50% 3.48% 3.46% 3.51% Return on Average Assets (b)** 0.19% 0.64% 0.63% 0.62% Return on Average Total Equity (b)** 2.52% 7.60% 8.28% 7.17% Efficiency (c) 67.71% 73.57% 69.19% 71.81% **Excluding one-time tax adjustment for deferred taxes, return on average assets would have been 0.87% and 0.80%, respectively for fourth quarter 2017 and YTD 2017. Return on average total equity would have been 11.41% and 10.52%, respectively, for fourth quarter 2017 and YTD 2017.\n(1) Annualized\n(a) Computed using fully taxable-equivalent net income\n(b) Computed using net income available to shareholders\n(c ) Computed by dividing non-interest expense by the sum of fully taxable-\nequivalent net interest income and non-interest income and excluding\nsecurity gains/losses.\nQUARTER ENDED ENDING BALANCES 12/31/2017 12/31/2016 Total Assets $ 1,232,755 $ 1,210,442 Loans, Net of Reserves 757,281 744,999 Allowance for Loan Losses 7,507 8,923 Intangible Assets 45 81 Deposits 1,067,986 1,044,357 Common Shareholders' Equity 90,323 84,028 Common Equity to Total Assets 7.33% 6.94% Total Equity 90,323 93,388 Total Equity to Total Assets 7.33% 7.71%\nQUARTER ENDED YEAR-TO-DATE AVERAGE BALANCES 12/31/2017 12/31/2016 12/31/2017 12/31/2016 Total Assets $ 1,211,440 $ 1,182,003 $ 1,200,631 $ 1,163,863 Loans, Net of Reserves 760,830 760,170 754,112 751,778 Deposits 1,040,208 1,009,258 1,030,485 993,705 Common Shareholders' Equity 91,884 85,787 91,045 83,579 Total Equity 91,884 99,169 91,045 100,114 QUARTER ENDED YEAR-TO-DATE ASSET QUALITY 12/31/2017 12/31/2016 12/31/2017 12/31/2016 Nonperforming Loans $ 7,503 $ 12,350 $ 7,503 $ 12,350 Nonperforming Assets 11,759 18,789 11,759 18,789 Substandard Assets 26,189 33,227 26,189 33,227 Net Loan Chg-offs (Recoveries) 525 280 1,806 743 Reserve for Loan Loss to Total Loans 0.98% 1.18% 0.98% 1.18% Reserve for Loan Loss to Non- performing Loans 100.07% 72.25% 100.07% 72.25% Reserve for Loan Loss to Non-performing Assets 63.85% 47.49% 63.85% 47.49% Net Loan Chg-offs (Recoveries) to Avg. Total Loans 0.07% 0.04% 0.24% 0.10% Nonperforming Loans to Total Loans 0.98% 1.64% 0.98% 1.64% Nonperforming Assets to Total Assets 0.95% 1.55% 0.95% 1.55% Nonperforming Assets to Total Loans And Other Real Estate 1.53% 2.47% 1.53% 2.47% Substandard Assets to Tier One Capital and Allowance for Loan Losses 20.18% 25.67% 20.18% 25.67%\nQuarterly Comparative Data (in thousands, except per share data) 4Q2017 3Q2017 2Q2017 1Q2017 4Q2016 Assets $ 1,232,755 $ 1,195,393 $ 1,198,449 $ 1,208,765 $ 1,210,442 Loans 757,281 761,639 767,069 751,056 744,999 Deposits 1,067,986 1,020,263 1,026,538 1,044,231 1,044,357 Common Shareholders’ Equity 90,323 91,602 88,992 85,861 84,028 Total Equity 90,323 91,602 88,992 85,861 93,388 Net Income 579 2,622 2,433 2,117 2,187 Net Income Available to Common Shareholders** 579 2,622 2,433 1,906 1,883 Net Income Per Basic Share** 0.07 0.31 0.29 0.23 0.22 Key Performance Ratios 4Q2017 3Q2017 2Q2017 1Q2017 4Q2016 Return on Average Assets (1) 0.19% 0.88% 0.81% 0.63% 0.64% Return on Average Total Equity (1) 2.52% 11.57% 11.10% 8.11% 7.60% Common Equity to Total Assets 7.33% 7.66% 7.43% 7.10% 6.94% Total Equity to Total Assets 7.33% 7.66% 7.43% 7.10% 7.71% Net Interest Margin 3.50% 3.50% 3.49% 3.35% 3.48% (1) Computed using net income available to shareholders **Excluding one-time tax adjustment for deferred taxes, net income available to shareholders would be $2,620, or $0.31 per basic share. Contact: Terry L. Hester\nChief Financial Officer\n(229) 426-6000 (Ext 6002)\nSource:Colony Bankcorp, Inc.", "external_links": [], "published": "2018-01-26T16:00:00.000+02:00", "crawled": "2018-01-26T18:10:29.008+02:00", "highlightTitle": ""}