{"organizations": [], "uuid": "57fcb7a748c447c54fbe0ae2a43572f65ecbbc97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/pr-newswire-carbo-schedules-fourth-quarter-and-full-year-2017-earnings-call-for-january-25-2018.html", "country": "US", "domain_rank": 767, "title": "CARBO Schedules Fourth Quarter and Full Year 2017 Earnings Call for January 25, 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-13T00:05:00.000+02:00", "replies_count": 0, "uuid": "57fcb7a748c447c54fbe0ae2a43572f65ecbbc97"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/pr-newswire-carbo-schedules-fourth-quarter-and-full-year-2017-earnings-call-for-january-25-2018.html", "ord_in_thread": 0, "title": "CARBO Schedules Fourth Quarter and Full Year 2017 Earnings Call for January 25, 2018", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON, CARBO Ceramics Inc. (NYSE: CRR) announced today that it plans to release earnings results for the fourth quarter and full year 2017 on January 25, 2018, and will host a conference call at 10:30 a.m. Central Time (11:30 a.m. Eastern) that day. Gary Kolstad, President and CEO, and Ernesto Bautista, III, Vice President and CFO, will host the call.\nLogo - http://photos.prnewswire.com/prnh/20120503/MM00528LOGO\nDue to historical high call volume, the company is offering participants the opportunity to register in advance for the conference through the following link: http://dpregister.com/10115898\nRegistered participants will immediately receive an email with a calendar reminder and a dial-in number and PIN that will allow them immediate access to the call on January 25, 2018.\nParticipants who do not wish to pre-register for the call may dial in using (877) 232-2832 (for U.S. callers), (855) 669-9657 (for Canadian callers) or (412) 542-4138 (for International callers) and ask for the \"CARBO Ceramics\" call. The conference call can also be accessed through the company's website, www.carboceramics.com .\nA telephonic replay of the earnings conference call will be available until February 1, 2018 at 9:00 a.m. Eastern Time. To access the replay from the U.S., please dial (877) 344-7529 and Canada 855-669-9658; international callers outside North America should dial (412) 317-0088. Please reference conference number 10115898. Interested parties may also access the archived webcast of the earnings teleconference through the company's website approximately two hours after the end of the call.\nAbout CARBO\nCARBO (NYSE: CRR ) is a global technology company that provides products and services to the oil and gas and industrial markets to enhance value for its clients.\nCARBO Oilfield Technologies - is a global leader that provides engineered solutions in its Design, Build, and Optimize the Frac® technology businesses, delivering important value to E&P operators by increasing well production and EUR. Oilfield Technologies is the world's largest producer of high quality ceramic proppant, provides one of the industry's most widely used fracture simulation software, has proprietary technology that provides fracture diagnostics and production assurance, and offers consulting services for fracture design and completion optimization. The Company also provides a range of technology solutions for spill prevention and containment.\nIts products and services are sold to operators of oil and natural gas wells and to oilfield service companies for use in the hydraulic fracturing of natural gas and oil wells.\nCARBO Industrial Technologies - is a leading provider of high-performance industrial ceramic media products that are engineered to increase process efficiency, improve end-product quality and reduce operating costs.\nIts products and services are primarily sold to industrial companies that work in manufacturing and mineral processing.\nFor more information, please visit www.carboceramics.com .\nInvestor Contact:\nMark Thomas, Director, Investor Relations\n(281) 921-6400\n : releases/carbo-schedules-fourth-quarter-and-full-year-2017-earnings-call-for-january-25-2018-300582094.html\nSOURCE CARBO Ceramics Inc.", "external_links": ["http://www.prnewswire.com/news-releases/carbo-schedules-fourth-quarter-and-full-year-2017-earnings-call-for-january-25-2018-300582094.html", "https://finance.yahoo.com/quote/crr?ltr=1", "http://photos.prnewswire.com/prnh/20120503/MM00528LOGO", "http://www.carboceramics.com/", "http://dpregister.com/10115898"], "published": "2018-01-13T00:05:00.000+02:00", "crawled": "2018-01-13T02:07:34.106+02:00", "highlightTitle": ""}