{"organizations": [], "uuid": "709788b2aaba65eb453c0351eb0fc39718f39364", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224173721&w=1200&r=LYNXMPEE0L1CT", "site_section": "http://feeds.reuters.com/reuters/technologyNews", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/uk-swiss-crypto/top-swiss-cryptocurrency-lawyer-questions-stupid-ico-structure-idUSKBN1FB1TM", "country": "US", "domain_rank": 408, "title": "Top Swiss cryptocurrency lawyer questions 'stupid' ICO structure", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T16:00:00.000+02:00", "replies_count": 0, "uuid": "709788b2aaba65eb453c0351eb0fc39718f39364"}, "author": "", "url": "https://www.reuters.com/article/uk-swiss-crypto/top-swiss-cryptocurrency-lawyer-questions-stupid-ico-structure-idUSKBN1FB1TM", "ord_in_thread": 0, "title": "Top Swiss cryptocurrency lawyer questions 'stupid' ICO structure", "locations": [], "entities": {"persons": [{"name": "brenna hughes neghaiwi", "sentiment": "none"}, {"name": "luka mueller", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "zurich", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "tezos foundation", "sentiment": "none"}, {"name": "bancor", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 2:12 PM / in 4 hours Top Swiss cryptocurrency lawyer questions 'stupid' ICO structure Brenna Hughes Neghaiwi 6 Min Read \nZURICH (Reuters) - One of the top lawyers in the booming cryptocurrency industry says the legal structure he helped set up to raise funds for new virtual currencies is “old, inflexible and stupid” and may no longer be fit for purpose. \nThe Swiss lawyer’s comments come as regulators around the world increase their scrutiny of initial coin offerings (ICOs), the digital fundraisers that precede a currency’s launch. \nThere is also growing scrutiny from investors. The Zug-based Tezos Foundation is facing U.S. class-action lawsuits from those who say they were misled and defrauded in its ICO. \nLuka Mueller’s MME law firm helped set up foundations in Switzerland for Tezos and some of the world’s biggest ICOs, including those of Bancor and Ethereum. Many foundations applied for non-profit tax status. The money raised in the ICO is treated as a donation that may not be returned. \nRegulators in the United States, the UK, and elsewhere are looking at whether an ICO should have similar investor protection to an initial public offering (IPO) for a company. \nMueller told Reuters cryptocurrency groups involving U.S. participants or gaining backing from investors should set up companies instead of the Swiss foundations he helped popularize. \n“If you structure your token sale in a way that it would look like an initial public offering, then even if you launch a (blockchain) protocol, the foundation is maybe not suitable,” he said. \n“If...the background is more an investor environment rather than a technical environment, yes, do all the registrations. If you want to sell it, if you want to be active and actively promoting it in the US, apply U.S. law.” \nHe said a foundation could still work for ICOs if a project is of interest mainly to technical experts rather than investors. \n“CRYPTO VALLEY” \nBitcoin, the best-known cryptocurrency, exploded in value since it was launched in 2009. Its price increased from less than a cent in early 2010 to a record shy of $20,000 in December 2017. \nThe coins use encryption and a blockchain transaction database enabling fast and anonymous transfer of funds without centralized payment systems. \nICOs skyrocketed in 2017, reaching nearly $3 billion through September. Switzerland attracted around a quarter of the world’s ICOs with nearly $650 million raised there in the first nine months of 2017, according to data compiled by cryptocurrency research firm Smith + Crown. \nBlockchain groups have set up foundations in the Swiss “Crypto Valley,” but the model has also loosely been exported elsewhere including to the Seychelles, Mauritius and Singapore. \nTezos aims to be a blockchain that’s more reliable than the ones behind bitcoin and ether. Its foundation raised $232 million last July. \nIt is now facing at least half a dozen class-action lawsuits in the United States. The plaintiffs are seeking a refund as well as damages. \nThey made non-refundable donations and expected to receive tokens called Tezzies when the network launched. But a former board member said the project is in a state of paralysis because of the lawsuits and a dispute between the developers and the foundation’s president. The network has not yet launched. \nTezos Foundation officials have declined to comment on the lawsuits. An attorney for the founders, Kathleen and Arthur Breitman, said of the first lawsuit that is was without merit and that the couple would aggressively defend themselves. \nUnder MME’s guidelines, tokens become property with an enforceable right once the blockchain launches and the token receives a spot on the first block. Before the launch contributors have no such rights. \nMueller said the foundation structure his team helped bring to cryptocurrency groups was initially conceived as a means to ensure funds were used for a set purpose and to protect developers from any liability over the project’s success. \n“It’s a concept of a donation, from which it is clear you donate,” Mueller said. “You donate into a structure and you donate to a team and to their idea.” \nBy MME’s definition, the developers behind the tokens are not liable for the projects and there is no counterparty to sue. BURNT FINGERS \nOther experts on Swiss foundation law say it would be nearly impossible for contributors to see money refunded from the foundation. \nAlexandre Swoboda, an economist who sat on the Swiss National Bank’s council from 1997 to 2009 said: “ICOs are basically about financing yourself by giving these people these new coins, and holding those new coins doesn’t give you a claim on anything except to be part of the club that holds those coins.” \nBut regulators are looking into this. \nInvestors in the United States may have been encouraged to file lawsuits after the U.S. regulator, the Securities and Exchange Commission (SEC), in July stated that some of the coins, also called tokens, may be considered securities subject to federal rules and regulation. \nThis has opened the door for courts to follow suit in enforcing the interpretation of ICOs as security sales. \nMueller conceded that while a foundation was a useful model for launching a new blockchain project that expected to see interest exclusively from a small technically-geared community, other projects would “need to have an operational company, like a GmbH or an AG, and not a foundation.” \n“The Swiss foundation actually is a very old, inflexible, stupid model,” he said. “The foundation is not designed for operations.” \nNevertheless, he said the vast majority of cryptocurrency fundraiser participants understood the terms and were therefore accountable for the risky decision to contribute. \n“You as a user must be absolutely clear — and if you don’t understand it keep your fingers away — that if you have an ether or a bitcoin, and it does not work, you have nobody to claim against,” he said. Editing by Anna Willard", "external_links": [], "published": "2018-01-22T16:00:00.000+02:00", "crawled": "2018-01-22T16:33:43.013+02:00", "highlightTitle": ""}