{"organizations": [], "uuid": "508c29e5592e96ed1f31b7bb080feed2b647b007", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180116.html", "section_title": "Archive News &amp; Video for Tuesday, 16 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/singapore-economy-exports/update-1-singapore-dec-exports-growth-slows-on-weaker-electronics-china-shipments-idUSL3N1PB39B", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Singapore Dec exports growth slows on weaker electronics, China shipments", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T09:31:00.000+02:00", "replies_count": 0, "uuid": "508c29e5592e96ed1f31b7bb080feed2b647b007"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/singapore-economy-exports/update-1-singapore-dec-exports-growth-slows-on-weaker-electronics-china-shipments-idUSL3N1PB39B", "ord_in_thread": 0, "title": "UPDATE 1-Singapore Dec exports growth slows on weaker electronics, China shipments", "locations": [], "entities": {"persons": [{"name": "decem", "sentiment": "none"}, {"name": "fathin ungku", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "international enterprise singapore", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* December NODX slows more than expected: +3.1 pct y/y, -5.0 m/m\n* Electronics exports -5.3 y/y\n* Export to China declined 6.0 pct y/y after a 27.4 pct y/y increase in November\nBy Fathin Ungku\nSINGAPORE, Jan 17 (Reuters) - Singapore’s export growth slowed more than expected in December from a year earlier due to a fall in electronics trade and the first decline in shipments to China in more than a year.\nNon-oil domestic exports rose 3.1 percent in December year-on-year, data from the trade agency International Enterprise Singapore showed, slower than the 8.7 percent increase predicted by economists in a Reuters poll and the 9.1 percent rise the month before.\nOn a seasonally adjusted month-on-month basis, exports contracted 5.0 percent in December after growing a revised 8.6 percent in November. The poll called for a 4.5 percent contraction from the month before.\nThe exports boom has benefited Singapore and other trade-dependent Asian economies, particularly for makers of electronics products and components such as semiconductors.\nBut electronic exports contracted 5.3 percent by December, the sector’s first on-year decline in three months.\nWith the exception of a “one-off blip” in September when it contracted a revised 8.0 percent, exports of electronics have grown at a double-digit pace for most months of this year.\n“Electronics, as we know, had so many months of outperformance so the high base is going to kick in,” OCBC economist Selena Ling said.\nExports to China contracted 6.0 percent in December, after a 27.4 percent surge the month earlier. It’s the first on-year fall in shipments to China since October 2016 when it contracted 0.1 percent.\nOCBC’s Ling said that it’s too early to tell if this is a trend or a one-off.\nSingapore exports managed to sustain growth in December thanks to improvements in non-electronics sectors, particularly pharmaceuticals, which grew 7.0 percent from the year before.\n“We would really be dependent on non-electronics to see sustained exports growth this year,” Ling said.\nAnalysts have worried that Singapore’s growth over the past year has been overly dependent on electronics.\nSingapore’s economic growth slowed in the fourth quarter as factories lost steam, but a services sector recovery has bolstered expectations the central bank could tighten monetary policy as early as April.\nAt its last semi-annual policy meeting in October, the central bank held monetary policy steady but changed a reference to maintaining current settings for an extended period, a shift that analysts said created room for a tightening this year. (Reporting by Fathin Ungku; Editing by Sam Holmes)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T09:31:00.000+02:00", "crawled": "2018-01-17T19:50:20.023+02:00", "highlightTitle": ""}