{"organizations": [], "uuid": "0af0f7324cd8e12e68cab626d0b4ebc510b20c90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-fiduciary-trust-elevates-kevin-duncan-to-director-of-estate-administration.html", "country": "US", "domain_rank": 767, "title": "Fiduciary Trust Elevates Kevin Duncan to Director of Estate Administration", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T19:30:00.000+02:00", "replies_count": 0, "uuid": "0af0f7324cd8e12e68cab626d0b4ebc510b20c90"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-fiduciary-trust-elevates-kevin-duncan-to-director-of-estate-administration.html", "ord_in_thread": 0, "title": "Fiduciary Trust Elevates Kevin Duncan to Director of Estate Administration", "locations": [], "entities": {"persons": [{"name": "kevin duncan", "sentiment": "negative"}, {"name": "kevin", "sentiment": "none"}, {"name": "joyce", "sentiment": "none"}, {"name": "gerald f. joyce, jr.", "sentiment": "none"}, {"name": "duncan", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "fiduciary trust company international", "sentiment": "negative"}, {"name": "franklin templeton investments", "sentiment": "none"}, {"name": "fiduciary trust", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 03, 2018 (GLOBE NEWSWIRE) -- Fiduciary Trust Company International, a global wealth manager and wholly-owned subsidiary of Franklin Templeton Investments, announced that Kevin Duncan has been promoted to director of estate administration. In his new role, Mr. Duncan will manage and develop all aspects of estate administration, and lead a team of experienced estate specialists, across the firm.\n“Kevin’s dedication to clients, and his understanding of their diverse needs, make him the ideal leader to cultivate partnerships with professionals throughout the firm to provide exceptional client experiences,” said Gerald F. Joyce, Jr., national head of trust and estates at Fiduciary Trust. “In light of potential changes to laws and regulations governing trust and estate administration, it is incumbent upon us to maintain the high-quality services, professionalism, and expertise that our clients have come to expect from our team of knowledgeable estate specialists.”\nMr. Duncan is based in New York and reports to Mr. Joyce. His duties in his new position will include working closely with Fiduciary Trust team members in local markets around the country to generate more business, and identify ongoing estate administration needs in those markets.\nMr. Duncan joined Fiduciary Trust in December 2012 and served as vice president, associate trust counsel and senior estate settlement officer before being promoted to managing director and trust counsel last year. Prior to Fiduciary Trust, he served as a wealth advisory associate at Lazard. As he began his career, Mr. Duncan completed two internships with Fiduciary Trust, serving as a trust counsel intern in 2007 and investment intern in the Miami office in 2004.\n“Helping clients with estate administration has always been one of Fiduciary Trust’s strengths,” said Mr. Duncan. “I am very pleased to be leading a first-class group of professionals. I also look forward to helping the families we work with to not only transfer their wealth from generation to generation, but to do so in a manner which both reflects and builds upon each family’s values.”\nMr. Duncan earned a master of laws (LLM) in taxation from Georgetown University Law Center and a juris doctor from Western New England University School of Law. He received a bachelor of business administration in finance from the University of Miami.\nAbout Fiduciary Trust\nFiduciary Trust Company International, a global wealth management firm, has served individuals, families, endowments and foundations since 1931. With over $78 billion in assets under administration and management as of September 30, 2017, the firm specializes in strategic wealth planning, investment management and trust and estate services, as well as tax and custody services. The firm and its subsidiaries maintain offices in New York, Coral Gables, FL, Boca Raton, FL, St. Petersburg, FL, Los Angeles, San Mateo, CA, Washington, DC, Wilmington, DE, Arlington, VA, and London. For more information, please visit fiduciarytrust.com .\nAbout Franklin Resources\nFranklin Resources, Inc. (NYSE:BEN) is a global investment management organization operating as Franklin Templeton Investments. Franklin Templeton Investments provides global and domestic investment management to retail, institutional and sovereign wealth clients in over 170 countries. Through specialized teams, the company has expertise across all asset classes—including equity, fixed income, alternative and custom solutions. The company's more than 650 investment professionals are supported by its integrated, worldwide team of risk management professionals and global trading desk network. With offices in over 30 countries, the California-based company has 70 years of investment experience and over $753 billion in assets under management as of November 30, 2017. For more information, please visit franklintempleton.com .\nCopyright © 2018. Fiduciary Trust Company International. All rights reserved.\nContacts:\nRebecca Radosevich: 212-632-3207\nrebecca.radosevich@franklintempleton.com\nJenna Focarino: 646-922-7763\njfocarino@jconnelly.com\nSource:Fiduciary Trust Company International", "external_links": ["https://www.globenewswire.com/Tracker?data=Gvq0rNrMxi7SLXYKogAO8mtG-Rio9uhqiUBayEW5Lb70XFFvq5dVNLBjs9t_0EhMuQbnRKAv7vkN4Gs6e84NMQRfhj17Cfm2ZSTF2-zp3Ak=", "https://www.globenewswire.com/Tracker?data=7SVcduNtNWBMg16iQyPNrFfv4_zoBHU3qR5YcBApMMxjaVTmwgG8oBn9lkeS4FNFFEXJ_R-1oF6aAlY_YJAzMk6s0CmGCFUaUT_eCmofthg="], "published": "2018-01-03T19:30:00.000+02:00", "crawled": "2018-01-03T20:57:42.011+02:00", "highlightTitle": ""}