{"organizations": [], "uuid": "7f893be413ce420653e19f9dedffa47f05d409bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221180781&w=1200&r=LYNXMPEE0A1D7", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-france-crime/police-find-getaway-car-hunt-two-after-paris-ritz-jewel-heist-idUSKBN1F026F", "country": "US", "domain_rank": 408, "title": "Police find getaway car, hunt two after Paris Ritz jewel heist", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T18:27:00.000+02:00", "replies_count": 0, "uuid": "7f893be413ce420653e19f9dedffa47f05d409bd"}, "author": "", "url": "https://www.reuters.com/article/us-france-crime/police-find-getaway-car-hunt-two-after-paris-ritz-jewel-heist-idUSKBN1F026F", "ord_in_thread": 0, "title": "Police find getaway car, hunt two after Paris Ritz jewel heist", "locations": [], "entities": {"persons": [{"name": "paris rit", "sentiment": "negative"}], "locations": [{"name": "paris", "sentiment": "none"}, {"name": "paris ritz", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "place vendome", "sentiment": "none"}], "organizations": [{"name": "paris ritz", "sentiment": "negative"}, {"name": "justice ministry", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 4:29 PM / Updated 9 minutes ago Police find getaway car, hunt two after Paris Ritz jewel heist Reuters Staff 3 Min Read \nPARIS (Reuters) - French police on Thursday sought two men after finding the getaway car used by a gang of axe-wielding thieves who snatched jewelry from a store in the upscale Paris Ritz hotel. \nThree hooded thieves carried out the robbery late on Wednesday at the ultra-chic hotel on the city center’s Place Vendome, next to the Justice Ministry. \nBut the three, all aged about 30, were arrested after being blocked in the building, a source close to the investigation said. \nTwo accomplices waiting outside were thrown some booty and escaped by car and motorbike. The source said that the motorcyclist however dropped one satchel of loot after hitting a pedestrian in a melee fleeing the scene. \nThe getaway car was found about 20 kms (12 miles) north of Paris in an area where the three arrested came from, the source said. \nOfficials were still determining the value of the haul since some jewels and watches had been recovered on those arrested. \nA figure of 4.5 million euros ($5.42 million), announced earlier, related to the total value of the jewelry in the display cases. \n“It’s possible that the total amount stolen is a lot less,” the source said. \nThe hotel, owned by Egyptian billionaire Mohammed al-Fayed, first opened in 1898 and was the first Paris hotel to boast electricity on all floors and bathrooms that were inside rooms. \nIt was at the Ritz that Diana, Princess of Wales, spent her last night in 1997 before the car crash that killed her and her lover Dodi Fayed, al-Fayed’s son. \nThe former home of fashion designer Coco Chanel and author Marcel Proust, the Ritz was a favorite drinking hole of American writer Ernest Hemingway. \nArmed heists targeting jewelry stores are not uncommon in the area where dozens of luxury boutiques align the streets. Over the last few years police have kept a permanent presence in the area, but that has not deterred potential robbers. \nIn December, a man was able to substitute two diamonds and two rings worth 5.5 million euros in a jewelry store replacing them with fakes. \nIn October 2016, reality television celebrity Kim Kardashian was the victim of a robbery just 10 minutes walk from the Ritz, in which millions of dollars’ worth of jewelry was stolen from her. \n($1 = 0.8297 euros)", "external_links": [], "published": "2018-01-11T18:27:00.000+02:00", "crawled": "2018-01-11T18:39:56.060+02:00", "highlightTitle": ""}