{"organizations": [], "uuid": "338bfe91b92b31aec6d905ac87f0678a12682ac7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220467145&w=1200&r=LYNXMPEE080CT", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-china-france/macron-urges-china-eu-to-avoid-pitfalls-of-protectionism-idUKKBN1EY0L6", "country": "US", "domain_rank": 408, "title": "In China, Macron urges openness, pitches France Inc", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T14:10:00.000+02:00", "replies_count": 0, "uuid": "338bfe91b92b31aec6d905ac87f0678a12682ac7"}, "author": "", "url": "https://uk.reuters.com/article/us-china-france/macron-urges-china-eu-to-avoid-pitfalls-of-protectionism-idUKKBN1EY0L6", "ord_in_thread": 0, "title": "In China, Macron urges openness, pitches France Inc", "locations": [], "entities": {"persons": [{"name": "macron", "sentiment": "negative"}, {"name": "michel rose", "sentiment": "none"}, {"name": "emmanuel macron", "sentiment": "none"}, {"name": "reuters/jason lee", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "france inc", "sentiment": "negative"}, {"name": "airbus", "sentiment": "none"}, {"name": "soho", "sentiment": "none"}, {"name": "edf", "sentiment": "none"}, {"name": "lvmh", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "bnp paribas", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 7:11 AM / Updated 2 minutes ago In China, Macron urges openness, pitches France Inc Michel Rose 5 Min Read \nBEIJING (Reuters) - President Emmanuel Macron offered to open up France to Chinese investment in exchange for greater access to China’s booming markets on Tuesday, warning during talks in Beijing that existing trade imbalances would lead to protectionism. French President Emmanuel Macron delivers an economic speech to Chinese and French entrepreneurs at SOHO 3Q in Beijing, China January 9, 2018. REUTERS/Jason Lee \nOn the second leg of a three-day state visit, the first of his eight-month-old presidency, Macron is hoping greater openness from China, coupled with lobbying from the 50-strong business delegation traveling with him, will help narrow the 30-billion-euro ($36 billion) trade deficit Paris runs with Beijing. \nBut despite bringing with him some of the heaviest hitters in French business, finance and industry -- including senior executives from Airbus, BNP Paribas, AccorHotels, EDF and LVMH -- there were no immediate announcements of mega-deals. Instead, smaller contracts or commitments to go on talking were signed. \nBNP Paris was set to announce plans for a joint-venture on consumer credit, an official said, and added that French nuclear group Areva had “never been so close” to signing a contract to build a reprocessing plant in China. \n“We have an access to markets which is unbalanced, unsatisfying,” Macron told members of the French and Chinese business community at a start-up incubator in Beijing. \n“If we don’t deal with this responsibly, the first, natural, reaction will be to close up on both sides.” \nIn his short time in office so far, 40-year-old Macron has managed to push through reforms to France’s labor market and seen a steady rise in business and consumer confidence. Growth forecasts for 2018 have been upgraded. \nIn the absence of either German and British leadership, with Chancellor Angela Merkel bogged down in coalition negotiations and Prime Minister Theresa May swamped by Brexit, Macron has emerged as arguably the strongest voice in Europe. \nThe trip to China is well-timed to convey that message and Macron has not been shy about promoting it, declaring after he arrived that “Europe is back” and announcing that he would visit China every year of his five-year presidency. OPEN ON BOTH ENDS French President Emmanuel Macron speaks at a France-Chinese forum on the applications of artificial intelligence at SOHO 3Q in Beijing, China January 9, 2018. REUTERS/Jason Lee \nBut while the rhetoric has been strong, and TV commentary suggests Macron and his glamorous 64-year-old wife Brigitte have been a big hit with the Chinese, the underlying success of state visits is best measured these days in business contracts. \nOne of the most closely watched sectors is aerospace, with Airbus talks to sell 100 or more jetliners to China, officials familiar with the talks said last week. \nJack Ma, founder and executive chairman of online retailer Alibaba, gave Macron’s pitch for more openness his backing on Tuesday, but added both sides had a part to play. \n“I think he’s right, China should open more, China is opening more,” he told reporters on the sidelines of a business forum at the Great Hall of the People in Beijing. Slideshow (8 Images) \n“France should open more, China should open more,” he added. \nMacron, who met President Xi Jinping on Monday evening, said the two countries would fall into a lose-lose situation if continued restrictions on foreign firms in China prompted France and Europe to put a brake on Chinese investment in Europe. \n“Let’s open up both instead,” said Macron, whose government has at the same time called for greater scrutiny of Chinese investment in Europe, particularly in sensitive sectors, concerned about protecting French interests and security. \nDespite the relatively small number of deals announced so far, officials were confident of success. \n“We’re confident we’ll achieve more than symbolic stuff,” a French official said, speaking on condition of anonymity. As well as aerospace, the agrifood sector is seen as key. \nAt the start-up incubator, French engineering firm Fives signed a deal with Chinese online retail giant JD.com, which will set up a logistics center in France to source French food and luxury products for sale online in China. \nJD.com agreed to sell 2 billion euros worth of French products - such as Remy Martin cognac or Evian water - on its website over the next two years. Reporting by Michel Rose; Additional reporting by Tom Daly; Writing by Luke Baker,; Editing by Clarence Fernandez and Raissa Kasolowsky", "external_links": [], "published": "2018-01-09T14:10:00.000+02:00", "crawled": "2018-01-09T14:22:48.039+02:00", "highlightTitle": ""}