{"organizations": [], "uuid": "ebf46d4dd0a945350077a79efe7bb4b33987b3fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222113230&w=1200&r=LYNXMPEE0E0L4", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-kyrgios/kyrgios-eases-to-quickfire-victory-in-melbourne-opener-idUKKBN1F415V", "country": "US", "domain_rank": 408, "title": "Kyrgios eases to quickfire victory in Melbourne opener", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T12:27:00.000+02:00", "replies_count": 0, "uuid": "ebf46d4dd0a945350077a79efe7bb4b33987b3fd"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-kyrgios/kyrgios-eases-to-quickfire-victory-in-melbourne-opener-idUKKBN1F415V", "ord_in_thread": 0, "title": "Kyrgios eases to quickfire victory in Melbourne opener", "locations": [], "entities": {"persons": [{"name": "dutra silva", "sentiment": "none"}, {"name": "nick kyrgios", "sentiment": "none"}, {"name": "rogerio dutra silva", "sentiment": "none"}, {"name": "kyrgios", "sentiment": "none"}, {"name": "reuters/toru hanai", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "hisense arena", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "kyrgios", "sentiment": "negative"}, {"name": "min read  melbourne", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 10:30 AM / Updated 10 hours ago Kyrgios off to flying start in Melbourne Martyn Herman 3 Min Read \nMELBOURNE (Reuters) - Home hope Nick Kyrgios launched his Australian Open campaign with a 6-1 6-2 6-4 demolition of Brazilian Rogerio Dutra Silva on Monday to continue his bright start to the year. Tennis - Australian Open - Nick Kyrgios of Australia v Rogerio Dutra Silva of Brazil - Hisense Arena, Melbourne, Australia, January 15, 2018. Kyrgios hits a shot. REUTERS/Toru Hanai \nThe volatile 17th seed was on his best behaviour, apart from one first-set rant about a heckler in the crowd, letting his racket do the talking as he treated his fans in the Hisense Arena to an impressive opening salvo. \nKyrgios, one of nine Australian men to start in the main draw, is shouldering his nation’s hopes of a first home men’s champion since 1976 and could not have asked for a better start. \nHe wrapped up the opening two sets in 51 minutes and was never seriously troubled until the third set when the 100th ranked Dutra Silva provided stiffer resistance. \n“Obviously with me, I’d like to get on and off the court as quick as possible, save my body for the later rounds,” Kyrgios, who has been plagued by hip injuries during his career and has been having treatment on a knee problem, told reporters. \nKyrgios was jeered by the home crowd last year when he lost a second-round match from two sets up against Italian Andreas Seppi and he won only two matches in grand slams in 2017. \nAfter claiming the Brisbane title in the build-up to Melbourne, his first on home soil, there is real optimism that he might be able to mount a serious assault. Tennis - Australian Open - Nick Kyrgios of Australia v Rogerio Dutra Silva of Brazil - Hisense Arena, Melbourne, Australia, January 15, 2018. Kyrgios shakes hands with Dutra Silva after winning their match. REUTERS/Toru Hanai \nHis best run in Melbourne came in 2015 when he reached the quarter-finals as a 19-year-old but before he can think about bettering that he must focus on Serbia’s Viktor Troicki. \nTroicki came from two sets down to beat Australian wildcard Alex Bolt and will be a far tougher hurdle than Dutra Silva. Slideshow (5 Images) \n“There’s not many people that come back from two sets to love down and win against an Aussie in Australia,” Kyrgios said. \n“He’s a tough competitor.” \nKyrgios was joined in the second round by fellow Australians John Millman, who beat Borna Coric in straight sets, and Matthew Ebden who shocked 16th-seeded American John Isner. \nEbden, 30, began 2017 ranked 695 after knee injuries forced him out of action but he climbed back into the top 100 by the end of the year and is now aiming even higher. \n“I know the level that I can play and maintain now consistently,” he said. “Got to keep things rolling.” Reporting by Martyn Herman,; Editing by Ed Osmond", "external_links": [], "published": "2018-01-15T12:27:00.000+02:00", "crawled": "2018-01-15T12:46:49.064+02:00", "highlightTitle": ""}