{"organizations": [], "uuid": "8530d9efe931b7326a77e72603d136ca402507d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/07/gettyimages-803328174.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/17/facebook-russia-meddling-brexit/", "country": "US", "domain_rank": 1196, "title": "Facebook Investigating Possible Russia Meddling in Brexit | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.574, "site_type": "news", "published": "2018-01-17T02:00:00.000+02:00", "replies_count": 0, "uuid": "8530d9efe931b7326a77e72603d136ca402507d6"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/17/facebook-russia-meddling-brexit/", "ord_in_thread": 0, "title": "Facebook Investigating Possible Russia Meddling in Brexit | Fortune", "locations": [], "entities": {"persons": [{"name": "simon milner", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "facebook inc.", "sentiment": "negative"}, {"name": "facebook investigating possible russia meddling", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "facebook and twitter", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg January 17, 2018 \nFacebook Inc. is expanding a U.K. investigation into possible interference by Russia ahead of the country’s 2016 election to exit the European Union, after facing pressure from lawmakers who were unsatisfied with an earlier probe by the social media company. \nFacebook and Twitter had previously told U.K. lawmakers that it found minimal use of its platforms compared to the more comprehensive Russian misinformation campaign ahead of the U.S. presidential election. The companies reached that conclusion by analyzing accounts U.S. intelligence officials said were used during the American election. British policy makers have pressed the companies to investigate further to see if Russia had used other methods on social media to influence the important EU vote. \n“We are committed to making all reasonable efforts to establish whether or not there was coordinated activity similar to that which was found in the U.S. and will report back to you as soon as the work has been completed,” Facebook’s policy director, Simon Milner, said in a letter Wednesday to the members of a House of Commons panel investigating the use of social media to spread misinformation ahead of the EU referendum. \nFacebook said it would look for coordinated activity to spread misinformation ahead of the vote. The company said it would take several weeks to complete the review, and asked U.K. authorities to share intelligence assessments and other information that could help in the review. \nThe Brexit probe is part of a broader reckoning that Facebook, Twitter Inc. and Google’s YouTube are facing globally, as governments come to grips with the companies’ far-reaching influence on society, as well as vulnerability to manipulation. \nDamian Collins, the chairman of the digital, culture, media and sport committee that’s leading the investigation, said social media companies must be more proactive in investigating the misuse of their services rather than wait for prodding from regulators. “They are best placed to investigate activity on their platform,” he said. \nTwitter, which has until Thursday to offer its own response to U.K. lawmakers, declined to comment. \nAlso on Wednesday Twitter said it would begin notifying U.S. users who had been exposed to Russia propaganda. In a hearing in Washington, U.S. lawmakers pressed executives from Facebook, Twitter and YouTube to act more aggressively to prevent the spread of terrorist-related content. \nResponding to a broadening backlash, Facebook Chief Executive Officer Mark Zuckerberg has vowed to “fix” the social network, and last week made changes to its main news feed to ratchet back posts from businesses and media outlets in favor of those from friends and family. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-17T02:00:00.000+02:00", "crawled": "2018-01-18T03:09:45.019+02:00", "highlightTitle": ""}