{"organizations": [], "uuid": "611c6df0583aef82b8e8fd9ecef5366bb8aebb12", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/11/104942106-GettyImages-902078920.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/24/germany-has-difficulties-and-polarization-that-we-havent-seen-for-decades-merkel-tells-davos.html", "country": "US", "domain_rank": 767, "title": "German leader Merkel says the current world order is under threat", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-24T16:35:00.000+02:00", "replies_count": 0, "uuid": "611c6df0583aef82b8e8fd9ecef5366bb8aebb12"}, "author": "Holly Ellyatt", "url": "https://www.cnbc.com/2018/01/24/germany-has-difficulties-and-polarization-that-we-havent-seen-for-decades-merkel-tells-davos.html", "ord_in_thread": 0, "title": "German leader Merkel says the current world order is under threat", "locations": [], "entities": {"persons": [{"name": "merkel", "sentiment": "negative"}, {"name": "angela merkel", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "German leader Angela Merkel said that multilateralism was under threat and said that protectionism is not the answer to the world's problems.\n\"Frankly speaking, the country I have the honor to represent and where I am chancellor has difficulties. And polarization is something that we see in our country as well, which we haven't had for decades,\" Merkel said.\nShe attributed increasing populism and polarization to both the euro zone crisis and migration crisis seen in Europe over the last few years following an influx of refugees, but said Germany would not shrink from the world stage.\n\"Germany wishes to be a country that lends its contribution in the future to solve the problems of the world together, we think that shutting ourselves off and isolating ourselves will not lead us into a good future. Protectionism is not the proper answer,\" she said.\nshow chapters Germany needs 'new political blood': Pro 3 Hours Ago | 03:22 Merkel is just the latest leader at Davos to criticize a protectionist and isolationist stance towards the world's problems . Such comments appear to be directed towards President Donald Trump who has adopted an \"America First\" stance in his foreign and economic policies.\n'Not learned the lessons from history' In contrast, Merkel said the answer to the world's problems was to see multilateral solutions instead of a \"unilateral, protectionist course\" of action.\nAt the start of her address, Merkel referenced both world wars in the 20th century, saying that the \"political actors involved had almost sleepwalked into a horrendous situation.\" She said there was a danger that the world had not learned the lessons from history.\nShe said the foundation of the United Nations (UN) was a multilateral and cooperative solution that was borne out of World War II, adding that a multilateral response helped to resolve the global financial crisis of 2008-2009.\nCheck out the world leaders and celebrities who are at Davos this year Larry Busacca | Getty Images Entertainment | Getty Images German coalition talks Merkel's comments come amid continued speculation over Germany, and indeed Merkel's, political future after months of negotiations aimed at forming a coalition government. This after no one party gained a majority in last September's election.\nMerkel's conservative alliance of the Christian Democratic Union (CDU) and Christian Social Union (CSU) first attempted to form a coalition with the Green party and pro-business Free Democratic Party (FDP), but it failed after the parties couldn't agree on various policies ranging from immigration to euro zone integration.\nWith no prospect of an alliance, Merkel's coalition partner in several former governments, the Social Democratic party (SPD) led by Martin Schulz, did a U-turn on an earlier pledge to voters not to go into government with the CDU-CSU again and began talks with Merkel's conservative alliance in January.\nThe decision could backfire on the SPD which performed badly in the last election due to its supporters' disapproval of its alliance with the CDU-CSU. As such, the SPD is likely to extract many concessions from the CDU-CSU during upcoming negotiations in return for its support in government.\nThere is also doubt over whether Merkel, known as \"Mutti\" (mother) in Germany, will see out the whole of what will be her fourth term as chancellor and there is speculation on who her successor might be.\nMerkel said Wednesday that she would continue to hold talks aimed at forming a government \"as quickly as possible.\" Speaking on Germany's economy, she said it had enjoyed 11 years of consecutive growth but needed to modernize and make more progress in terms of digitization.", "external_links": [], "published": "2018-01-24T16:35:00.000+02:00", "crawled": "2018-01-24T15:56:07.006+02:00", "highlightTitle": ""}