{"organizations": [], "uuid": "2e3cb1c6646d7c9ea20c1509311a203ff2d56f8d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-l-brands-announces-proposed-500-million-offering-of-senior-notes-due-2028.html", "country": "US", "domain_rank": 767, "title": "L Brands Announces Proposed $500 Million Offering of Senior Notes Due 2028", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-08T17:13:00.000+02:00", "replies_count": 0, "uuid": "2e3cb1c6646d7c9ea20c1509311a203ff2d56f8d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-l-brands-announces-proposed-500-million-offering-of-senior-notes-due-2028.html", "ord_in_thread": 0, "title": "L Brands Announces Proposed $500 Million Offering of Senior Notes Due 2028", "locations": [], "entities": {"persons": [], "locations": [{"name": "columbus", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "l brands, inc.", "sentiment": "neutral"}, {"name": "united states securities and exchange commission", "sentiment": "none"}, {"name": "citigroup", "sentiment": "none"}, {"name": "wells fargo securities", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "j.p. morgan", "sentiment": "none"}, {"name": "hsbc", "sentiment": "none"}, {"name": "bofa merrill lynch", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "COLUMBUS, Ohio, Jan. 08, 2018 (GLOBE NEWSWIRE) -- L Brands, Inc. (the “Company”) (NYSE:LB) announced today that it is offering to sell $500 million aggregate principal amount of unsecured senior notes due 2028 (the “2028 Notes”) in a public offering underwritten by BofA Merrill Lynch, Citigroup, HSBC, J.P. Morgan and Wells Fargo Securities as joint book-running managers. The 2028 Notes will be guaranteed by certain of the Company’s subsidiaries.\nThe Company intends to use proceeds from the offering, after the payment of fees and expenses, together with cash on hand, for the redemption of its outstanding 8.500% senior notes due 2019. The foregoing does not constitute a notice of redemption or an obligation to issue a notice of redemption for the outstanding notes.\nA registration statement relating to the offering of the 2028 Notes has been filed with the United States Securities and Exchange Commission and is effective. This press release shall not constitute an offer to sell nor an offer to buy any securities and shall not constitute an offer, solicitation or sale in any jurisdiction in which such offer, solicitation or sale would be unlawful. The offering of the 2028 Notes may be made only by means of a prospectus supplement and the accompanying prospectus.\nCopies of the prospectus supplement and the accompanying prospectus may be obtained from (i) BofA Merrill Lynch, NC1-004-03-43, 200 North College Street, 3rd floor, Charlotte NC 28255-0001, Attn: Prospectus Department, or by e-mail at dg.prospectus_requests@baml.com , (ii) Citigroup Global Markets Inc., c/o Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, NY 11717, or by calling (800) 831-9146 or by e-mail at prospectus@citi.com , (iii) HSBC Securities (USA) Inc., 452 Fifth Avenue, New York, NY 10018, or by calling (212) 525-5000, (iv) J.P. Morgan Securities LLC, c/o Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, NY 11717, or by calling (866) 803-9204 or (v) Wells Fargo Securities, LLC, 550 South Tryon Street, Charlotte, NC 28202, by e-mail at Robert.t.hammond@wellsfargo.com , or by calling (704) 410-0380.\nABOUT L BRANDS:\nL Brands, through Victoria’s Secret, PINK, Bath & Body Works, La Senza and Henri Bendel, is an international company. The company operates 3,100 company-owned specialty stores in the United States, Canada, the United Kingdom, Ireland and Greater China, and its brands are sold in more than 800 additional franchised locations worldwide. The company’s products are also available online at www.VictoriasSecret.com , www.BathandBodyWorks.com , www.HenriBendel.com and www.LaSenza.com .\nSafe Harbor Statement Under the Private Securities Litigation Reform Act of 1995\nWe caution that any forward-looking statements (as such term is defined in the Private Securities Litigation Reform Act of 1995) contained in this press release or made by our company or our management involve risks and uncertainties and are subject to change based on various factors, many of which are beyond our control. Accordingly, our future performance and financial results may differ materially from those expressed or implied in any such forward-looking statements. Words such as “estimate,” “project,” “plan,” “believe,” “expect,” “anticipate,” “intend,” “planned,” “potential” and any similar expressions may identify forward-looking statements. Risks associated with the following factors, among others, in some cases have affected and in the future could affect our financial performance and actual results and could cause actual results to differ materially from those expressed or implied in any forward-looking statements included in this press release or otherwise made by our company or our management:\ngeneral economic conditions, consumer confidence, consumer spending patterns and market disruptions including severe weather conditions, natural disasters, health hazards, terrorist activities, financial crises, political crises or other major events, or the prospect of these events; the seasonality of our business; the dependence on mall traffic and the availability of suitable store locations on appropriate terms; our ability to grow through new store openings and existing store remodels and expansions; our ability to successfully expand internationally and related risks; our independent franchise, license and wholesale partners; our direct channel businesses; our ability to protect our reputation and our brand images; our ability to attract customers with marketing, advertising and promotional programs; our ability to protect our trade names, trademarks and patents; the highly competitive nature of the retail industry and the segments in which we operate; consumer acceptance of our products and our ability to manage the life cycle of our brands, keep up with fashion trends, develop new merchandise and launch new product lines successfully; our ability to source, distribute and sell goods and materials on a global basis, including risks related to: political instability, significant health hazards, environmental hazards or natural disasters; duties, taxes and other charges; legal and regulatory matters; volatility in currency exchange rates; local business practices and political issues; potential delays or disruptions in shipping and transportation and related pricing impacts; disruption due to labor disputes; and changing expectations regarding product safety due to new legislation; our geographic concentration of supplier and distribution facilities in central Ohio; fluctuations in foreign currency exchange rates; stock price volatility; our ability to pay dividends and related effects; our ability to maintain our credit rating; our ability to service or refinance our debt; our ability to retain key personnel; our ability to attract, develop and retain qualified associates and manage labor-related costs; the ability of our vendors to deliver products in a timely manner, meet quality standards and comply with applicable laws and regulations; fluctuations in product input costs; our ability to adequately protect our assets from loss and theft; fluctuations in energy costs; increases in the costs of mailing, paper and printing; claims arising from our self-insurance; our ability to implement and maintain information technology systems and to protect associated data; our ability to maintain the security of customer, associate, supplier or company information; our ability to comply with regulatory requirements; legal and compliance matters; and tax, trade and other regulatory matters.\nWe are not under any obligation and do not intend to make publicly available any update or other revisions to any of the forward-looking statements contained in this press release to reflect circumstances existing after the date of this press release or to reflect the occurrence of future events even if experience or future events make it clear that any expected results expressed or implied by those forward-looking statements will not be realized. Additional information regarding these and other factors can be found in Item 1A. Risk Factors in our 2016 Annual Report on Form 10-K.\nFor further information, please contact:\nL Brands: Investor Relations Media Relations Amie Preston Tammy Roberts Myers (614) 415-6704 (614) 415-7072 apreston@lb.com communications@lb.com\nSource:L Brands, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=zMb8rrdVsoj97cGAwJoBjIYQ9vCTRap507Ov_cgk-Mo_rUh6kTmDzB0sfFBOASIKjfL7aWef96BANM3hHNILkqd9VejtiD04Uh1jnhGBb9k=", "https://www.globenewswire.com/Tracker?data=668A1R-Bk5TZv8QGR0BxMUEoJorKVz54pMaIf16hguVi66Fd7_n5dPUHoxf0mCrGBVlJK6NqZ25yXpXaCjSO3mx0Y4p585yOzj21HpMcMBs=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/a88aa585-b10c-455a-9f09-58cd0bfee72b", "https://www.globenewswire.com/Tracker?data=0QXz0OUwQyXDtE8JoGXvY887YX0f3R1AT6fxSyUACe97JKJMeE9MVOeO5_6vp2NgLam7goA-NyB9WhmIVfcl_A==", "https://www.globenewswire.com/Tracker?data=E-_f5kUK9Pu7DcEw67UM8ZK1d6NDQ8s6Smw_uRVUh-aaB2sbvdbSrCy2fDC4inzpEJFKD8Kpc6dPxY-Uy2iIigiFOta4_FsDLkQg7818gsQsg2WwcVEHhY7J2B5aWLkf", "https://www.globenewswire.com/Tracker?data=WiEG_Qjoyh2RiwEoYyETbm3bevnn1AtB6wVyyqqotDz9oIEZYmhX1xMVFD1vChzXaQWkfXuLdOIefIPfu2swUWPoea0b6Q7J_NnsB8pZeK8=", "https://www.globenewswire.com/Tracker?data=sjcPYqA3TtD_8WOqVW7Nr0JcSbkP07aOTj2WWA5mxPowXFCFB8DrlLldBi008iIKozHIghKnp4aG2ddwzuXF7Gk8Pi4Nj-AyWMQixcJ5dKaxGNPjh-Fv9b9Rns1NcVXE", "https://www.globenewswire.com/Tracker?data=AaK2Pt505SOgiu6ENxd8tYDKGQqkLkTux7e4qB_m0xu4GP0XXs9RTIqC1wLhfdYiQH3wJajL6zMgw25vPIu2PCm3OaKN-sbBccHdFWqNWRw="], "published": "2018-01-08T17:13:00.000+02:00", "crawled": "2018-01-08T19:06:32.015+02:00", "highlightTitle": ""}