{"organizations": [], "uuid": "788fa0c15f90b555e1e5f017ea8364cad5d62d49", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-bulgaria-government/bulgarias-government-faces-no-confidence-vote-over-corruption-idUSKBN1F61EQ", "country": "US", "domain_rank": 408, "title": "Bulgaria's government faces no-confidence vote over corruption", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T14:14:00.000+02:00", "replies_count": 0, "uuid": "788fa0c15f90b555e1e5f017ea8364cad5d62d49"}, "author": "", "url": "https://www.reuters.com/article/us-bulgaria-government/bulgarias-government-faces-no-confidence-vote-over-corruption-idUSKBN1F61EQ", "ord_in_thread": 0, "title": "Bulgaria's government faces no-confidence vote over corruption", "locations": [], "entities": {"persons": [{"name": "boyko borissov", "sentiment": "none"}, {"name": "borissov", "sentiment": "none"}, {"name": "kornelia ninova", "sentiment": "none"}], "locations": [{"name": "bulgaria", "sentiment": "none"}], "organizations": [{"name": "min read  sofia", "sentiment": "none"}, {"name": "united patriots", "sentiment": "none"}, {"name": "socialist party", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "angel krasimirov", "sentiment": "none"}, {"name": "bsp", "sentiment": "none"}, {"name": "gerb", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 12:16 PM / Updated 21 minutes ago Bulgaria's government faces no-confidence vote over corruption Angel Krasimirov 3 Min Read \nSOFIA (Reuters) - Bulgaria’s main opposition party filed a motion of no-confidence in Prime Minister Boyko Borissov’s government on Wednesday over lack of progress in fighting corruption but the attempt is likely to fail. \nThe center-right government is backed by a small populist party and if the bloc abstains in next week’s vote the Socialist Party (BSP) motion will fall 41 votes short of the number it needs to topple the coalition in the 240-seat parliament. \nBorissov’s GERB party and junior coalition partner, the nationalist formation United Patriots, have 133 votes along with the populist Will party. \n“The no-confidence vote is not sabotage but a response to 83 percent of Bulgarian citizens who think this is their number one problem,” Socialist party leader Kornelia Ninova said. \n“Combating corruption is a pro-European policy, not an anti-European one. It is better to be alone against corruption than a be part of the status quo that defends corruption,” Ninova said. \nThe European Commission has repeatedly rebuked the country for failing to prosecute and sentence corrupt officials. \nBulgaria, the European Union’s poorest country, assumed the six-month, rotating presidency of the bloc two weeks ago for the first time since it joined the EU in 2007. \nLast week demonstrations, some with an anti-corruption theme, blocked the capital Sofia as the country hosted ceremonies for the start of its EU presidency.[nL8N1P44SF] \n“While the vote has little chance of succeeding, public protests are likely in the coming weeks,” Otilia Dhand of Teneo Intelligence wrote in an analyst note. \n“Borissov’s efforts to maintain domestic political calm may strain coalition relations, increasing medium-term risks for government stability,” Dhand said. \nCorruption has reduced foreign investment since communism collapsed in Bulgaria in 1989 and the EU has kept Sofia as well as neighboring Romania outside its Schengen zone of passport-free travel citing failings over its fight against graft. \nOn Friday, Bulgaria’s parliament overturned a presidential veto on anti-graft legislation, clearing the way for the creation of a special unit to investigate individuals occupying high public office as well as assets and conflicts of interest. Editing by Matthew Mpoke Bigg", "external_links": [], "published": "2018-01-17T14:14:00.000+02:00", "crawled": "2018-01-17T14:24:38.020+02:00", "highlightTitle": ""}