{"organizations": [], "uuid": "5a697757cb7b32fad2fdfe460244d77d75ca1f63", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-mx-gold-acquires-360-avalonminer-741-cryptocurrency-mining-rigs.html", "country": "US", "domain_rank": 767, "title": "MX Gold Acquires 360 AvalonMiner 741 Cryptocurrency Mining Rigs", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T11:01:00.000+02:00", "replies_count": 0, "uuid": "5a697757cb7b32fad2fdfe460244d77d75ca1f63"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-mx-gold-acquires-360-avalonminer-741-cryptocurrency-mining-rigs.html", "ord_in_thread": 0, "title": "MX Gold Acquires 360 AvalonMiner 741 Cryptocurrency Mining Rigs", "locations": [], "entities": {"persons": [{"name": "dan omeniuk", "sentiment": "none"}], "locations": [{"name": "vancouver", "sentiment": "none"}], "organizations": [{"name": "mx gold corp.", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "canaan creative co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VANCOUVER, B.C. , Jan. 08, 2018 (GLOBE NEWSWIRE) -- MX Gold Corp. (TSX-V:MXL) (FSE:ODV) (OTCQX:MXLGF) (the “ Company ” or “ MX Gold ”) is pleased to announce, further to its news release dated November 13, 2017, the delivery of 360 AvalonMiner 741 cryptocurrency mining systems (each, a “ Mining Rig ”), purchased from Canaan Creative Co. The purchase of the Mining Rigs equips the Company with a fleet of state of the art, digital currency extraction hardware. Each Mining Rig contains 88 x A3212 16 nm ASIC chips and boasts an in field Reliable Hashrate Per Second (RTHS) of up to 7.8. The Mining Rigs are housed in high-grade aluminum cases and employ innovative Airforming Cooling Technology, allowing more efficient heat dissipation. Coupled with access to contracted low-cost energy sources, the Company expects that the Mining Rigs set up will result in a competitive digital currency extraction environment.\nFor additional information on the AvalonMiner 741, please see the following link: https://canaan.io/product/avalonminer-741/\nDan Omeniuk, CEO of MX Gold, stated, \"Our company is looking forward to developing a pilot project involving a cryptocurrency mining operation to determine whether further investment in the growing cryptocurrency industry is warranted.”\nThe Company is excited to have the Mining Rigs landed and onsite, and is currently completing various testing procedures to ensure optimal operating efficiencies. The Company will disclose in upcoming announcements when the Mining Rigs are installed and fully operational.\nFor more information on cryptocurrency, please see the following link:\nhttps://clients.haywood.com/uploadfiles/secured_reports/BCOct242017.pdf?inf_contact_key=579b43223c79ee11357ecfc6b62ebaae942374871c40ac756f37211bcc125ddb\nAbout MX\nMX Gold is a junior mining company focused on the exploration and development of advanced projects located in Mexico and British Columbia, Canada. The company’s primary focus, is the Magistral del Oro tailings project located 392 km SW of Chihuahua and includes a fully permitted, 500 tonne-per-day dynamic cyanide countercurrent system plant constructed in 2013. The company is currently expanding to 1000 tonne-per day which is scheduled to be completed by the 1st quarter of 2018. The Company also owns 50% of the IDS Project, which includes a fully permitted smelter that was completed in 2014 for a throughput capacity of 50 tonnes per day. The smelter was built to receive and process high-grade direct-ship ores and concentrates from small-scale miners across the state of Durango and beyond.\nMX Gold Corp. is also focused on the exploration, development and mining of advanced projects located in British Columbia and Mexico. The Company’s primary focus in British Columbia is its Willa gold and copper project located 12 kilometers south of Silverton, B.C. In 2015, MX Gold Corp. completed the accretive acquisition of the Willa project and the Max Molybdenum Mine and Mill Complex. This acquisition removed major costs and shortened timelines typically associated with mine project development. The Willa mine is located 135 kilometers south of the Max Mill. MX Gold Corp. can also elect to reopen the Max Molybdenum mining operation once world Moly prices improve. For updates on the Magistral Project please visit our website. www.mxgoldcorp.com\nOn behalf of the Board of Directors,\n“Akash Patel”\nFor further information, please contact\nDan Omeniuk, CEO\nEmail: dano@mxgoldcorp.com\nOr at: info@mxgoldcorp.com\nStatements in this news release that are not historical facts are forward-looking statements. Forward-looking statements are statements that are not historical, and consist primarily of projections - statements regarding future plans, expectations and developments. Words such as \"expects\", \"intends\", \"plans\", \"may\", \"could\", “potential”, \"should\", \"anticipates\", \"likely\", \"believes\" and words of similar import tend to identify forward-looking statements. Forward-looking statements in this news release include the expectation that, with access to contracted low-cost energy sources, the Mining Rigs set up will result in a competitive digital currency extraction environment, and statements respecting the future installation and operation of the Mining Rigs. All of these forward-looking statements are subject to a variety of known and unknown risks, uncertainties and other factors that could cause actual events or results to differ from those expressed or implied, including, without limitation: that the Mining Rigs will not enable a competitive digital currency extraction environment; that the Company may not successfully install or render operational the Mining Rigs; that the Company may not be able to attract and retain qualified personnel and management; and that the Company may not be able to fund its operations, as well as other risks and uncertainties identified under the heading “Risk Factors” in the Company’s continuous disclosure documents filed on SEDAR. You are cautioned that the foregoing list is not exhaustive of all factors and assumptions which may have been used. MX Gold cannot assure you that actual events, performance or results will be consistent with these forward-looking statements, and management’s assumptions may prove to be incorrect. These forward-looking statements reflect current expectations regarding future events and operating performance and speak only as of the date hereof and MX Gold does not assume any obligation to update forward-looking statements if circumstances or management’s beliefs, expectations or opinions should change other than as required by applicable law. For the reasons set forth above, you should not place undue reliance on forward-looking statements.\nNeither the TSX Venture Exchange Inc. nor its Regulation Service Provider (as that term is defined in the policies of the TSX Venture Exchange Inc.) accepts responsibility for the adequacy or accuracy of this press release.\nSource:MX Gold Corp.", "external_links": ["https://www.globenewswire.com/Tracker?data=tAxIc2-8Nepur3ncGz_8cX01nGexGXrmBiS2-Gbq0qu2Wzgy98ivm9PT8RtKNOBX_BoVa_WKVh_G6pZjxu5ab_C-KbMMevSzGQbsqjoXIt4=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/1ac6fb55-4eb0-4e51-9282-f9d36c0bd0ef", "https://www.globenewswire.com/Tracker?data=gc8iF-ZY0xzoRMCkOzSLWlM_eRzNNIxodsaUhiDAWMd5SDAsAY76x7h1pKKzCwnvBoVa23MHdFzYmpK3B-LWMgkHPPkxGBGTbc8jaERcaBM=", "https://www.globenewswire.com/Tracker?data=z6NyCKa9Bsac5Y_FpsuVdWShWBB__9mPXLSllDnSv8TlZvhLFnoTwO2iWqxs-gapHp8DrTUlinGI-ziMkZFQyY1h7mPmRU42q8P260cyuSE=", "https://clients.haywood.com/uploadfiles/secured_reports/BCOct242017.pdf?inf_contact_key=579b43223c79ee11357ecfc6b62ebaae942374871c40ac756f37211bcc125ddb", "https://www.globenewswire.com/Tracker?data=Gkr3akPabOhOmY9HGFJwGC_0b3uYiqs9L2I-zQfyDl-AYclpyEhaUwev5EHQ9WlLt4Alk2x1F6m5PnzjGFE-OFlSgxYDShMcS0bZAZdwK79wATCOvQ1al677YemyLHQ8hj0rv6MkosHqYGTG-currQ==", "https://canaan.io/product/avalonminer-741/", "https://www.globenewswire.com/Tracker?data=Gkr3akPabOhOmY9HGFJwGE0E6rTEeQlC2dWfo3mT8A9sGeFeFkabus2UhHD0U3RHBs9DNeXV5PvQVKMezV9wO1jcvTG81xXxxklHKP_voYvJi0sw9kxQxBdNJRdO3VJ5TYUmUplnMudqZ9LaQLD8x7YpLeF5FIBph2pSgCsnTljXEVP9mPUrILBylWbDmN8-QAAfoMjPmNBYdSRlmj1nGv49lzIZeOiHUUehhRvd_Icf8q9R0Zbz8eiYBMgzssUplFWb2HqjknZjP-YD-6vAaGdc8aPflyz43JP9Ctn1SjwfQkG92-5vqdgop1lGwwQVo_hd7pmekPilEyLcyhCogfFDyqre6PQGWBQpVrmf2_v2IFKK-AwAN9HvfmSYQ6BPaEfB1D05rvvzfyuPmOPqTCvPBQmfxabidUuaeZcSue65p53VzYjhJzBpWtFwPCvl"], "published": "2018-01-08T11:01:00.000+02:00", "crawled": "2018-01-08T12:12:32.000+02:00", "highlightTitle": ""}