{"organizations": [], "uuid": "07a613be2fd859c5e30793ec8bf3b5a8113ff5c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-first-midwest-names-kathleen-carroll-as-chief-human-resources-officer.html", "country": "US", "domain_rank": 767, "title": "First Midwest Names Kathleen Carroll as Chief Human Resources Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T23:47:00.000+02:00", "replies_count": 0, "uuid": "07a613be2fd859c5e30793ec8bf3b5a8113ff5c9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-first-midwest-names-kathleen-carroll-as-chief-human-resources-officer.html", "ord_in_thread": 0, "title": "First Midwest Names Kathleen Carroll as Chief Human Resources Officer", "locations": [], "entities": {"persons": [{"name": "kathleen carroll", "sentiment": "negative"}, {"name": "carroll", "sentiment": "none"}, {"name": "kathleen", "sentiment": "none"}, {"name": "kathleen s. carroll", "sentiment": "none"}], "locations": [{"name": "ill.", "sentiment": "none"}, {"name": "itasca", "sentiment": "none"}, {"name": "first midwest", "sentiment": "none"}], "organizations": [{"name": "nasda", "sentiment": "negative"}, {"name": "first midwest bancorp", "sentiment": "negative"}, {"name": "aon corporation", "sentiment": "none"}, {"name": "first midwest", "sentiment": "none"}, {"name": "sprint", "sentiment": "none"}, {"name": "first midwest bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ITASCA, Ill., Jan. 24, 2018 (GLOBE NEWSWIRE) -- First Midwest Bancorp, Inc. (“First Midwest”) (NASDAQ:FMBI) and First Midwest Bank announced today the appointment of Kathleen S. Carroll as Executive Vice President and Chief Human Resources Officer. She will be responsible for all aspects of First Midwest’s people activities, including recruiting, talent management, organizational development and total rewards to support First Midwest’s operations and continued growth.\nCarroll has over 25 years of multi-functional experience in human resources, strategy, corporate development and finance within several industries and diverse business models. Prior to joining First Midwest, she held various leadership positions of increasing responsibility at Aon Corporation, most recently as Global Head of Talent Acquisition and HR Lead for M&A. Carroll previously served in management positions with the telecommunications firm, Sprint, and began her career in consulting and accounting at PricewaterhouseCoopers.\n“We are extremely pleased to welcome Kathleen to our executive leadership team. She is an experienced and versatile leader with a proven record of achievement,” said Michael L. Scudder, Chairman and Chief Executive Officer of First Midwest Bancorp and First Midwest Bank. “Kathleen brings extensive human resources leadership experience that will help guide First Midwest as we recruit, develop and engage a talented and diverse workforce to support our continued growth and the evolving needs of our business and our clients. She also will oversee all aspects of our market-competitive compensation programs.”\nCarroll holds a Master of Management degree from Northwestern University’s Kellogg School of Management and a Bachelor of Science degree in Accountancy from the University of Missouri. She is a board member of Leadership Greater Chicago and the International Women’s Forum Leadership Foundation.\nAbout First Midwest\nFirst Midwest is a relationship-focused financial institution and one of the largest independent publicly-traded bank holding companies based on assets headquartered in the Midwest, with over $14 billion in assets and $10 billion in trust assets under management. First Midwest’s principal subsidiary, First Midwest Bank, and other affiliates provide a full range of commercial, treasury management, equipment leasing, retail, wealth management, trust and private banking products and services through over 130 locations in metropolitan Chicago, northwest Indiana, central and western Illinois, and eastern Iowa. First Midwest’s common stock is traded on the NASDAQ Stock Market under the symbol FMBI. First Midwest’s website is www.firstmidwest.com .\nContact Information\nJames M. Roolf\nSenior Vice President and Corporate Relations Officer\n(630) 875-7533\njim.roolf@firstmidwest.com\nSource:First Midwest Bancorp, Inc.;First Midwest Bank", "external_links": ["https://www.globenewswire.com/Tracker?data=Y6G5V6GRc5vQgicSWJ6bsFua0QoUezp9KKp1VcMU4obs9uG949PT_lpKKijTMixDE-1TQLA8C6vfSfrim5_BRrr2aQ91vJ64_JeK5p16IPs=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/74024116-1a42-4eef-ad0f-0da592e3317a"], "published": "2018-01-24T23:47:00.000+02:00", "crawled": "2018-01-25T02:03:28.011+02:00", "highlightTitle": ""}