{"organizations": [], "uuid": "5d4f30f125612cd3ee02e60209ad484898a9aff3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220827968&w=1200&r=LYNXMPEE090SI", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-eu-poland-morawiecki/poland-says-hopes-for-de-escalation-of-tensions-with-eu-idUKKBN1EZ1JL", "country": "US", "domain_rank": 408, "title": "EU to Poland - comply with rules or you could lose cash", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T18:14:00.000+02:00", "replies_count": 0, "uuid": "5d4f30f125612cd3ee02e60209ad484898a9aff3"}, "author": "", "url": "https://uk.reuters.com/article/uk-eu-poland-morawiecki/poland-says-hopes-for-de-escalation-of-tensions-with-eu-idUKKBN1EZ1JL", "ord_in_thread": 0, "title": "EU to Poland - comply with rules or you could lose cash", "locations": [], "entities": {"persons": [{"name": "gabriela baczynska", "sentiment": "none"}, {"name": "morawiecki", "sentiment": "none"}, {"name": "jean-claude juncker", "sentiment": "none"}, {"name": "mateusz morawiecki", "sentiment": "none"}, {"name": "justyna pawlak", "sentiment": "none"}, {"name": "guenther oettinger", "sentiment": "none"}], "locations": [{"name": "poland", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "warsaw", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "lenoir  eu budget", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}, {"name": "eu commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 1:22 PM / Updated 18 minutes ago EU to Poland - comply with rules or you could lose cash Justyna Pawlak , Gabriela Baczynska 4 Min Read \nWARSAW/BRUSSELS (Reuters) - The man in charge of the European Union’s budget raised the possibility on Wednesday of Poland losing out financially if it refuses to give ground in a bitter dispute with the bloc over its judicial reforms. FILE PHOTO - European Commission President Jean-Claude Juncker poses with Poland's Prime Minister Mateusz Morawiecki ahead of talks at the EU Commission headquarters in Brussels, Belgium, January 9, 2018. REUTERS/Francois Lenoir \nEU Budget Commissioner Guenther Oettinger’s comments came after Poland’s new prime minister, Mateusz Morawiecki, pressed a charm offensive in Brussels aimed at smoothing relations badly strained by disputes over the courts and also over migration. \nBut Morawiecki, a former banker who took the reins of the conservative government in Warsaw last month, showed no sign of scrapping the judicial overhaul that critics, including Brussels, say weaken judicial independence and the rule of law. \n“I genuinely believe that with added effort to explain our intentions we will be able to clarify misunderstandings,” Morawiecki told reporters in Warsaw on Wednesday on his return from Brussels. “I believe dialogue will lead to de-escalation.” \nPoland’s nationalist ruling party, Law and Justice (PiS), says the reforms are needed because the judiciary is still steeped in the mindset and practices of the postwar communist era. The party has also tightened control over state media. \nPoland’s feud with Brussels have left a country once seen as the posterchild of post-communist transition increasingly isolated in the EU as crucial negotiations over the bloc’s next seven-year budget begin. Poland is currently the biggest beneficiary of EU funds, receiving 7 billion euros in 2016. \nAsked whether Poland could see its funds cut in the new EU budget starting in 2021 because of issues concerning the rule of law, Oettinger told a news conference in Brussels: \n“Either... the rule of law and the independence of courts would constitute a condition for claiming European budgetary resources. Or otherwise the restoration of the rule of law could be seen as a possible way of getting more resources.” \nThe remarks, which seemed to contradict an earlier statement from his boss, Commission president Jean-Claude Juncker, suggest Poland could also be rewarded for compliance with EU recommendations. PRESSURE \nOettiner said the executive Commission would come up with a proposal in April. \nJuncker said last week it would be wrong to put pressure on Poland by cutting funds, though some EU states including Italy have openly called for this. \nMorawiecki has made clear he sees the EU funds as key to helping Poland close the economic gap with wealthier countries in western Europe. \nBefore flying to Brussels for dinner with Juncker on Tuesday, Morawiecki sacked several ministers who have clashed most sharply with the EU since PiS took power in late 2015. \nDespite Morawiecki’s conciliatory gestures and rhetoric, it remains unclear whether Poland can reach a compromise with Brussels over its judicial reforms by Feb.27, when the 28 EU member states are due to debate the matter. \nThe Commission has opened an unprecedented legal case against Warsaw over its backsliding on the rule of law and democracy. \nHowever, the EU is unlikely to impose the ultimate sanction of suspending Poland’s voting rights because its ally Hungary has vowed to veto any such move. \nPiS, which faces a string of elections from late 2018, can also draw comfort from opinion polls putting its support at 40-45 percent, well ahead of its rivals, a performance reinforced by Poland’s strong economic growth. Additional reporting by Philip Blenkinsop and Peter Maushagen in Brussels, Marcin Goclowski in Warsaw, Writing by Gabriela Baczynska; Editing by Gareth Jones", "external_links": [], "published": "2018-01-10T18:14:00.000+02:00", "crawled": "2018-01-10T18:37:30.007+02:00", "highlightTitle": ""}