{"organizations": [], "uuid": "52dae5781447e3dab7b5647efbb8f86814297ce4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-louis-m-weiner-m-d-joins-john-theurer-cancer-centers-advisory-board.html", "country": "US", "domain_rank": 767, "title": "Louis M. Weiner, M.D., Joins John Theurer Cancer Center's Advisory Board", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T21:05:00.000+02:00", "replies_count": 0, "uuid": "52dae5781447e3dab7b5647efbb8f86814297ce4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-louis-m-weiner-m-d-joins-john-theurer-cancer-centers-advisory-board.html", "ord_in_thread": 0, "title": "Louis M. Weiner, M.D., Joins John Theurer Cancer Center's Advisory Board", "locations": [], "entities": {"persons": [{"name": "louis m. weiner", "sentiment": "negative"}, {"name": "andré goy", "sentiment": "none"}, {"name": "weiner", "sentiment": "none"}, {"name": "john theurer", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "hackensack", "sentiment": "none"}, {"name": "d.c", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "m.s.", "sentiment": "none"}], "organizations": [{"name": "hackensack meridian health john theurer cancer cente", "sentiment": "negative"}, {"name": "joins john theurer cancer center's advisory board", "sentiment": "neutral"}, {"name": "research and innovation", "sentiment": "none"}, {"name": "hackensack university medical center", "sentiment": "none"}, {"name": "medstar georgetown cancer institute", "sentiment": "none"}, {"name": "translational cancer research", "sentiment": "none"}, {"name": "georgetown lombardi comprehensive cancer center", "sentiment": "none"}, {"name": "georgetown university medical center", "sentiment": "none"}, {"name": "georgetown university school of medicine", "sentiment": "none"}, {"name": "john theurer cancer center advisory board", "sentiment": "none"}, {"name": "lymphoma", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HACKENSACK, N.J., Jan. 23, 2018 /PRNewswire/ -- Hackensack Meridian Health John Theurer Cancer Center at Hackensack University Medical Center, announced today the appointment of Louis M. Weiner, M.D., to its advisory board. Dr. Weiner is director of the Georgetown Lombardi Comprehensive Cancer Center , part of Georgetown University Medical Center , in Washington, D.C. He is also director of the MedStar Georgetown Cancer Institute .\n\"We are pleased to welcome Dr. Weiner to the John Theurer Cancer Center Advisory Board,\" said André Goy, M.D., M.S., chairman and director, chief of Lymphoma, and director of Clinical and Translational Cancer Research, John Theurer Cancer Center; chief science officer and director of Research and Innovation, RCCA; professor of medicine, Georgetown University School of Medicine. \"He has been a leading voice in the field of oncology and his expertise will be valued as our institutions continue to collaborate on specific joint research projects we feel are of the utmost importance and significance in advancing cancer care.\"\nIn 2013, John Theurer Cancer Center and Georgetown Lombardi Comprehensive Cancer Center, a National Cancer Institute-designated Comprehensive Cancer Center, established a research partnership. This strategic collaboration has allowed the two institutions to leverage resources, capabilities, and expertise to accelerate discoveries in cancer research and clinical care. The combined strength also sparks collaborations with other academic cancer centers as well as the pharmaceutical industry. The shared goal of the research collaboration fosters combined leadership in basic cancer research and clinical care for the betterment of their patients.\n\"Dr. Weiner is uniquely qualified to join John Theurer Cancer Center's advisory board, with expertise in the development and coordination of clinical care and research programs spanning prevention, treatment, rehabilitation, and survivorship,\" said Ihor S. Sawczuk, M.D., president, Hackensack University Medical Center. \"Our combined efforts will accelerate development and execution of innovative clinical trials and improvements in cancer care.\"\nAn internationally recognized medical oncologist, Dr. Weiner specializes in the treatment of gastrointestinal cancers. He holds the Francis L. and Charlotte G. Gragnani Chair and is professor of oncology at Georgetown University School of Medicine. Dr. Weiner is an accomplished researcher who focuses on monoclonal antibody research and other immunotherapy treatments. Dr. Weiner serves as chair of the NCI's Board of Scientific Counselors and as a member of its Clinical Trials Advisory Committee. In addition, Dr. Weiner recently concluded service as a member of the Advisory Panel of the National Institutes of Health (NIH) Center for Scientific Research, which administers NIH research grants, and is past chair of the immunology Task Force for the American Association for Cancer Research.\n\"I am delighted to serve on the John Theurer Cancer Center Advisory Board. John Theurer Cancer Center and the Georgetown Lombardi Comprehensive Cancer Center have established a research partnership, and my service on this board will further align the research activities of our respective organizations,\" said Weiner. \"This will improve opportunities for patients in both regions that we serve to receive world-class research-inspired cancer care that benefits them and leads to cancer prevention and cures around the world.\"\n\"A seasoned clinician, clinical researcher, laboratory scientist, and director of a large research operation, Dr. Weiner's commitment to our collaboration has significantly expanded the ability for each of our institutions to conduct cancer research,\" said Andrew Pecora, M.D., chief innovation officer and president of Physician Enterprise at Hackensack Meridian Health. \"By working together, we will continue to elevate our cancer research to offer more treatment options for tomorrow's patients.\"\nDr. Weiner earned his bachelor's degree in biology from the University of Pennsylvania and his medical degree from Mount Sinai School of Medicine. He completed his fellowship at Tufts University School of Medicine. Prior to his appointment as Georgetown Lombardi director in 2007, he held several leadership positions at Fox Chase Cancer Center in Philadelphia.\nAbout Georgetown Lombardi Comprehensive Cancer Center\nGeorgetown Lombardi Comprehensive Cancer Center is designated by the National Cancer Institute as a comprehensive cancer center — the only cancer center of its kind in the Washington, D.C. area. A part of Georgetown University Medical Center and MedStar Georgetown University Hospital, Georgetown Lombardi seeks to improve the diagnosis, treatment, and prevention of cancer through innovative basic and clinical research, patient care, community education and outreach, and the training of cancer specialists of the future. Connect with Georgetown Lombardi on Facebook ( Facebook.com/GeorgetownLombardi ) and Twitter ( @LombardiCancer ).\nABOUT JOHN THEURER CANCER CENTER AT HACKENSACK UNIVERSITY MEDICAL CENTER\nJohn Theurer Cancer Center at Hackensack University Medical Center is New Jersey's largest and most comprehensive center dedicated to the diagnosis, treatment, management, research, screenings, and preventive care as well as survivorship of patients with all types of cancers. The 14 specialized divisions covering the complete spectrum of cancer care have developed a close-knit team of medical, research, nursing, and support staff with specialized expertise that translates into more advanced, focused care for all patients. Each year, more people in the New Jersey/New York metropolitan area turn to John Theurer Cancer Center for cancer care than to any other facility in New Jersey. Housed within Hackensack University Medical Center , a 775-bed not-for-profit teaching, tertiary care, and research hospital, John Theurer Cancer Center provides state-of-the-art technological advances, compassionate care, research innovations, medical expertise, and a full range of aftercare services that distinguish John Theurer Cancer Center from other facilities. For additional information, please visit www.jtcancercenter.org .\nView original content with multimedia: http://www.prnewswire.com/news-releases/louis-m-weiner-md-joins-john-theurer-cancer-centers-advisory-board-300586827.html\nSOURCE John Theurer Cancer Center", "external_links": ["http://gumc.georgetown.edu/", "https://twitter.com/LombardiCancer", "http://lombardi.georgetown.edu/", "http://www.jtcancercenter.org/", "http://www.facebook.com/GeorgetownLombardi", "http://www.prnewswire.com/news-releases/louis-m-weiner-md-joins-john-theurer-cancer-centers-advisory-board-300586827.html", "https://www.medstargeorgetowncancer.org/", "https://www.hackensackumc.org/services/cancer-care/"], "published": "2018-01-23T21:05:00.000+02:00", "crawled": "2018-01-23T22:16:29.009+02:00", "highlightTitle": ""}