{"organizations": [], "uuid": "7849fb24a16ccd604c1625fd1d458b5a33aafc28", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-fourth-quarter-2017-results-reported-by-amphenol-corporation.html", "country": "US", "domain_rank": 767, "title": "Fourth Quarter 2017 Results Reported by Amphenol Corporation", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T16:00:00.000+02:00", "replies_count": 0, "uuid": "7849fb24a16ccd604c1625fd1d458b5a33aafc28"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-fourth-quarter-2017-results-reported-by-amphenol-corporation.html", "ord_in_thread": 0, "title": "Fourth Quarter 2017 Results Reported by Amphenol Corporation", "locations": [], "entities": {"persons": [], "locations": [{"name": "wallingford", "sentiment": "none"}, {"name": "conn.", "sentiment": "none"}], "organizations": [{"name": "amphenol corporation", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "gaap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WALLINGFORD, Conn.--(BUSINESS WIRE)-- Amphenol Corporation (NYSE:APH) reported today a GAAP diluted loss per share for the fourth quarter 2017 of $0.34 1 compared to GAAP Diluted Earnings Per Share (“EPS”) of $0.75 for the comparable 2016 period. GAAP diluted loss per share for the fourth quarter 2017 includes (i) an estimated one-time charge of approximately $400 million ($1.26 per share) related to the enactment of the Tax Cuts and Jobs Act (the “Tax Act”) partially offset by (ii) the excess tax benefit of approximately $21 million ($0.07 per share) related to options exercised during the quarter, which compares to a tax benefit of $0.01 included in our fourth quarter 2017 guidance. Excluding the effect of these items, fourth quarter 2017 Adjusted Diluted EPS 2 was a record $0.86 compared to $0.75 for the comparable 2016 period. The charge of $1.26 per share related to the Tax Act represents our current estimate of taxes arising from the implementation of a modified territorial tax regime and the deemed and intended repatriation of certain unremitted earnings of foreign subsidiaries, partially offset by the re-measurement of the Company’s net U.S. deferred tax liabilities arising from a lower U.S. corporate tax rate. In addition, as a result of the Tax Act’s reduction of a substantial portion of the future tax benefits of the Company’s stock option program as well as 2017 being the first year in which these excess tax benefits were reflected in income under GAAP, the Company has now excluded the excess tax benefit of stock option exercises in the presentation of its adjusted non-GAAP results for 2017.\nSales for the fourth quarter of 2017 were a record $1.944 billion compared to $1.651 billion for the comparable 2016 period. Currency translation had the effect of increasing sales by approximately $36 million in the fourth quarter of 2017 compared to the 2016 period.\nFor the year ended December 31, 2017, GAAP Diluted EPS was $2.06, compared to $2.61 for the comparable 2016 period. In addition to the impact of the Tax Act mentioned above, the 2017 period includes acquisition-related costs of $4 million ($0.01 per share) as well as the tax benefit of options exercised during the year of approximately $67 million ($0.21 per share), which compares to a tax benefit of $0.15 per share included in our 2017 full year guidance. The 2016 period included acquisition-related costs of $37 million ($0.11 per share), mainly relating to the acquisition of FCI Asia Pte Ltd (FCI) in January 2016. Excluding the effect of these items, Adjusted Diluted EPS for the year ended December 31, 2017 was a record $3.12 compared to $2.72 for the 2016 period.\nSales for the year ended December 31, 2017 were a record $7.011 billion compared to $6.286 billion for the 2016 period. Currency translation had the effect of increasing sales by approximately $13 million for the full year 2017 compared to the 2016 period.\nAmphenol President and Chief Executive Officer, R. Adam Norwitt, stated, “We are extremely pleased to close the fourth quarter 2017 well above the high end of our guidance in sales and Adjusted Diluted EPS. Sales were a record $1.944 billion in the fourth quarter and Adjusted Diluted EPS was a record $0.86 in the fourth quarter. We achieved these record results amidst an environment of continued geopolitical and economic policy uncertainty. Compared to the fourth quarter 2016, sales increased a strong 18%, reflecting diversified growth across the Company’s markets including in particular mobile devices, industrial, automotive, commercial air and military. For the full year 2017, we grew sales by a strong 12%. Our record performance was driven primarily by organic growth as well as through the Company’s successful acquisition program. While GAAP Diluted EPS in the fourth quarter and full year 2017 was significantly impacted by the one-time estimated charge resulting from the Tax Act, our Adjusted Diluted EPS grew by a strong 15% for both the quarter and the full year 2017 compared to the respective 2016 periods. This earnings growth was driven by our strong operating results, as reflected in the Company’s achievement of an Operating Margin of 20.5% and 20.4% in the fourth quarter and full year 2017, respectively. I am very proud of our organization as we continue to execute extremely well.”\n“The Company continues to expand its growth opportunities through a deep commitment to developing enabling technologies for customers in all markets, an ongoing strategy of market and geographic diversification, as well as an active acquisition program. As part of that program, near the end of the fourth quarter, the Company acquired Sunpool Automotive Electronics Ltd. Sunpool, based in the industrial center of northeast China, is a leading manufacturer of automotive antennas and related interconnect assemblies for the Chinese automotive market, with annual sales of approximately $30 million. In addition, in early January, the Company acquired CTI Holdings Inc. (“CTI”). CTI, based in Toronto, Canada, is a North American leader in the design and manufacture of interconnect assemblies for IT Datacom and industrial applications with annual sales of approximately $60 million. These acquisitions collectively strengthen the Company’s global capabilities and enhance our product offerings in these important end markets.”\n“Operating cash flow in the quarter and full year reached record levels of $428 million and $1.144 billion, respectively, a clear confirmation of the quality of the Company’s earnings. In addition to the strong operating results, the Company continues to deploy its financial strength in a variety of ways to increase shareholder value. This included the purchase during the fourth quarter of 2017 of 0.7 million shares of the Company’s stock under our $1 billion two-year open market stock repurchase plan, bringing total repurchases under the plan to approximately 8.4 million shares, or $618 million.”\n“The Company’s consistent and balanced approach to capital deployment will be further enhanced through the increased flexibility afforded by the territorial tax system implemented in the Tax Act. We believe the ability to more freely move earnings under the new territorial system will provide additional support for the Company’s long-term capital allocation strategy which focuses on achieving a balance among organic business development, acquisition growth and shareholder returns, including dividends and share buybacks.”\n“While we are pleased that the overall demand environment has improved, the global economy remains dynamic. Considering this environment and based on current currency exchange rates, we expect first quarter 2018 sales in the range of $1.780 billion to $1.820 billion and diluted EPS in the range of $0.78 to $0.80. For the full year 2018, we expect to achieve sales in the range of $7.440 billion to $7.600 billion, an increase over 2017 of 6% to 8%. We also expect diluted EPS in the range of $3.39 to $3.47, an increase of 9% to 11% compared to 2017 Adjusted Diluted EPS. As we are still evaluating the impact of the Tax Act, we currently expect an estimated benefit of at least 100 basis points on our effective tax rate going forward. Accordingly, our full year 2018 guidance reflects this approximate benefit of the Tax Act compared to the Adjusted Effective Tax Rate in 2017 of approximately 26.5%. The effective tax rate included in our guidance does not reflect any potential impact due to the finalization of the estimated one-time charge resulting from the Tax Act.”\n“The electronics revolution continues to create exciting, long-term growth opportunities for Amphenol. We are very encouraged by the Company’s broad-based and strong results in 2017, and we remain very confident for the future. New applications and higher performance requirements continue to drive increased demand for our broadened range of high technology products across all our diversified end markets. Our ongoing actions to strengthen our competitive advantages and build sustained financial strength, as well as our initiatives to expand our high technology product offering both organically and through our successful acquisition program, have created an excellent base for future performance. I am confident in the ability of our outstanding, entrepreneurial management team to dynamically adjust to the constantly changing environment, to continue to generate strong profitability and to further capitalize on the many opportunities to expand our market position.”\nThe Company will host a conference call to discuss its fourth quarter results at 1:00 PM (EST) Wednesday, January 24, 2018. The toll free dial-in number to participate in this call is 888-455-0949; International dial-in number is 773-799-3973; Passcode: LAMPO. There will be a replay available until 10:59 PM (EST) on Saturday, February 24, 2018. The replay numbers are toll free 866-422-8164; International toll number is 203-369-0833; Passcode: 7183.\nA live broadcast as well as a replay will also be available on the Internet at http://www.amphenol.com/investors/webcasts.php .\nAmphenol Corporation is one of the world’s largest designers, manufacturers and marketers of electrical, electronic and fiber optic connectors, interconnect systems, antennas, sensors and sensor-based products and coaxial and high-speed specialty cable. Amphenol designs, manufactures and assembles its products at facilities in the Americas, Europe, Asia, Australia and Africa and sells its products through its own global sales force, independent representatives and a global network of electronics distributors. Amphenol has a diversified presence as a leader in high growth areas of the interconnect market including: Automotive, Broadband Communications, Commercial Aerospace, Industrial, Information Technology and Data Communications, Military, Mobile Devices and Mobile Networks.\nForward-Looking Statements\nThis press release contains certain statements that are intended to be “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. All statements, other than statements of historical facts, included in this press release that address activities, events or developments that the Company expects or anticipates will or may occur in the future, including, but not limited to, the Company’s expectations regarding first quarter and full year 2018 sales, GAAP and Adjusted Diluted EPS as well as the Company’s anticipated effective tax rate and the related impact of the Tax Act, are forward-looking statements. Forward-looking statements are based on our management’s current beliefs, expectations and assumptions and on information currently available to our management. Forward-looking statements may be identified through the use of terms such as “expect”, “may”, “will”, “should”, “intend”, “plan”, “guidance” and/or other similar expressions generally intended to identify forward-looking statements. Such forward-looking statements are not guarantees of future performance and involve risks and uncertainties, and actual results may differ materially from those projected in the forward-looking statements. Factors that might cause or contribute to a material difference include, but are not limited to, governmental, political, economic, end market, competitive, technological, acquisition-related, cybersecurity and foreign currency-related risk factors that may affect the Company’s operations, products, markets, customers and prices. Such forward-looking statements may also be impacted by, among other things, clarifications to and additional guidance under the Tax Act. More specifically, on December 22, 2017, the Tax Act was enacted and it significantly revises U.S. corporate income tax law by, among other things, reducing the U.S. corporate income tax rate to 21% and implementing a modified territorial tax system that includes a one-time transition tax on deemed repatriated earnings of foreign subsidiaries. The estimated impact of the Tax Act on our tax provision incorporates assumptions made based upon the Company’s current interpretation of the Tax Act, and it may change as the Company receives additional clarification and implementation guidance and as the interpretation of the Tax Act evolves over time. Details regarding various significant risks and uncertainties that may affect our operating and financial performance can be found in Part I, Item 1A of the Company’s Annual Report on Form 10-K for the year ended December 31, 2016, and other Company filings with the Securities and Exchange Commission including Quarterly Reports on Form 10-Q and Current Reports on Form 8-K. There may be other risks and uncertainties that we are unable to predict at this time or that we currently do not expect to cause actual results to differ materially from those contained in any forward-looking statements we may make and affect our operating and financial performance. Given these risks and uncertainties, readers are cautioned not to place undue reliance on such forward-looking statements. Forward-looking Adjusted Diluted EPS included in our first quarter and full year 2018 guidance assumes that the Company will not have, in either period, any additional income or expense that is not directly related to the Company’s operating performance during such periods, including additional income or expense arising from, among other things, clarifications to and additional guidance under the Tax Act. Further details regarding these types of income and expenses are provided below under the heading “Non-GAAP Financial Measures.” To the extent the Company has any such income or expense in such periods that is not directly related to the Company’s operating performance, then the Company’s forward-looking diluted EPS expectations for the first quarter and/or full year 2018 will be adjusted to exclude such income or expense. Forward-looking statements set forth in this press release speak only as of the date hereof and the Company does not undertake any obligation to revise or update these statements whether as a result of new information, future events or otherwise, except as required by law.\nNon-GAAP Financial Measures\nThe financial statements included within this press release are prepared in accordance with accounting principles generally accepted in the United States of America (“GAAP”). This press release also contains certain non-GAAP financial information, including Adjusted Operating Income, Adjusted Operating Margin, Adjusted Net Income attributable to Amphenol Corporation, Adjusted Effective Tax Rate and Adjusted Diluted EPS (collectively, “non-GAAP financial measures”), which are intended to supplement the reported GAAP results. Management utilizes these non-GAAP financial measures as part of its internal reviews for purposes of monitoring, evaluating and forecasting the Company’s financial performance, communicating operating results to the Company’s Board of Directors and assessing related employee compensation measures. Management believes that such non-GAAP financial measures may be helpful to investors in assessing the Company’s overall financial performance, trends and period-over-period comparative results. Non-GAAP financial measures discussed within this press release exclude income and expenses that are not directly related to the Company’s operating performance during the periods presented. Items excluded in the presentation of the non-GAAP financial measures in any period may consist of, without limitation, acquisition-related expenses, refinance-related costs and certain discrete tax items including but not limited to (i) the estimated one-time income tax charge related to the Tax Act and (ii) the excess tax benefits related to stock-based compensation that may arise during such periods. Reconciliations of non-GAAP financial measures to the most directly comparable GAAP financial measures are included at the end of this press release. However, such non-GAAP financial measures should not be considered in isolation, as a substitute for or superior to the related GAAP financial measures. In addition, these non-GAAP financial measures are not necessarily the same or comparable to similar measures presented by other companies, as such measures may be calculated differently or may exclude different items. The non-GAAP financial measures are defined within the “Supplemental Financial Information” table at the end of this press release and should be read in conjunction with the Company’s financial statements presented in accordance with GAAP.\n1 GAAP diluted loss per share for the fourth quarter 2017 would be $0.01 less if the dilutive impact of common share equivalents was included in dilutive weighted average common shares outstanding. Such shares are excluded from the computation of GAAP Diluted loss per share due to the GAAP net loss during the period. This impact is excluded from Adjusted Diluted EPS for the fourth quarter 2017. See the condensed consolidated statements of income and supplemental financial information attached for further information. 2 All referenced non-GAAP financial measures are defined in the tables at the end of this press release. AMPHENOL CORPORATION CONDENSED CONSOLIDATED STATEMENTS OF INCOME (Unaudited) (dollars and shares in millions, except per share data) Three Months Ended Twelve Months Ended December 31, December 31, 2017 2016 2017 2016 Net sales $ 1,943.9 $ 1,651.1 $ 7,011.3 $ 6,286.4 Cost of sales 1,308.5 1,105.0 4,701.4 4,246.4 Gross profit 635.4 546.1 2,309.9 2,040.0 Acquisition-related expenses — — 4.0 36.6 Selling, general and administrative expenses 236.0 207.0 878.3 798.2 Operating income 399.4 339.1 1,427.6 1,205.2 Interest expense (25.0 ) (18.4 ) (92.3 ) (72.6 ) Other income, net 4.2 3.5 17.1 8.5 Income before income taxes 378.6 324.2 1,352.4 1,141.1 Provision for income taxes (1) (479.0 ) (85.9 ) (691.7 ) (308.5 ) Net income (loss) (100.4 ) 238.3 660.7 832.6 Less: Net income attributable to noncontrolling interests (3.0 ) (2.9 ) (10.2 ) (9.7 ) Net income (loss) attributable to Amphenol Corporation $ (103.4 ) $ 235.4 $ 650.5 $ 822.9 Net income (loss) per common share - Basic $ (0.34 ) $ 0.76 $ 2.13 $ 2.67 Weighted average common shares outstanding - Basic 305.4 308.5 305.7 308.3 Net income (loss) per common share - Diluted (2) (3) $ (0.34 ) $ 0.75 $ 2.06 $ 2.61 Weighted average common shares outstanding - Diluted 317.8 315.7 316.5 315.2 Dividends declared per common share $ 0.19 $ 0.16 $ 0.70 $ 0.58 Note 1\nProvision for income taxes for the three months ended December 31, 2017 included an estimated one-time income tax charge of $398.5 million ($1.26 per share) related to the Tax Cuts and Jobs Act (the “Tax Act Charge”) enacted into law in December 2017, partially offset by the excess tax benefits related to stock-based compensation of $20.8 million ($0.07 per share). Provision for income taxes for the twelve months ended December 31, 2017 included the Tax Act Charge, partially offset by the excess tax benefits related to stock-based compensation of $66.6 million ($0.21 per share). Note 2\nNet income (loss) per share for the three months ended December 31, 2017 included the Tax Act Charge, partially offset by the excess tax benefits related to stock-based compensation of $20.8 million ($0.07 per share). Excluding these effects, Adjusted Diluted EPS, a non-GAAP financial measure which is defined and reconciled to its most comparable GAAP financial measure in this press release, was $0.86 for the three months ended December 31, 2017. Net income (loss) per share for the twelve months ended December 31, 2017 included the Tax Act Charge and acquisition-related expenses of $4.0 million ($0.01 per share), partially offset by excess tax benefits related to stock-based compensation of $66.6 million ($0.21 per share). Net income (loss) per share for the twelve months ended December 31, 2016 included acquisition-related expenses of $36.6 million ($0.11 per share). Excluding these effects, Adjusted Diluted EPS, a non-GAAP financial measure which is defined and reconciled to its most comparable GAAP financial measure in this press release, was $3.12 and $2.72 for the twelve months ended December 31, 2017 and 2016, respectively. Note 3\nDiluted weighted average shares used to calculate the GAAP diluted net loss per common share for the fourth quarter of 2017 excludes the anti-dilutive effect of 12.4 million common share equivalents due to the GAAP net loss position during the period. AMPHENOL CORPORATION CONDENSED CONSOLIDATED BALANCE SHEETS (Unaudited) (dollars in millions) December 31, December 31, 2017 2016 ASSETS Current Assets: Cash and cash equivalents $ 1,719.1 $ 1,034.6 Short-term investments 34.6 138.6 Total cash, cash equivalents and short-term investments 1,753.7 1,173.2 Accounts receivable, less allowance for doubtful accounts of $23.0 and $23.6, respectively 1,598.6 1,349.3 Inventories 1,106.9 928.9 Other current assets 196.8 139.8 Total current assets 4,656.0 3,591.2 Property, plant and equipment, less accumulated depreciation of $1,200.1 and $1,007.2, respectively 816.8 711.4 Goodwill 4,042.6 3,678.8 Intangibles, net and other long-term assets 488.5 517.3 $ 10,003.9 $ 8,498.7 LIABILITIES & EQUITY Current Liabilities: Accounts payable $ 875.6 $ 678.2 Accrued salaries, wages and employee benefits 151.6 131.8 Accrued income taxes 154.2 125.1 Other accrued expenses 338.8 275.6 Accrued dividends 58.1 49.3 Current portion of long-term debt 1.1 375.2 Total current liabilities 1,579.4 1,635.2 Long-term debt, less current portion 3,541.5 2,635.5 Accrued pension and postretirement benefit obligations 272.0 288.4 Deferred income taxes 241.2 77.7 Other long-term liabilities 326.4 138.8 Equity: Common stock 0.3 0.3 Additional paid-in capital 1,249.0 1,020.9 Retained earnings 2,941.5 3,122.7 Accumulated other comprehensive loss (201.0 ) (469.0 ) Total shareholders' equity attributable to Amphenol Corporation 3,989.8 3,674.9 Noncontrolling interests 53.6 48.2 Total equity 4,043.4 3,723.1 $ 10,003.9 $ 8,498.7 AMPHENOL CORPORATION CONDENSED CONSOLIDATED STATEMENTS OF CASH FLOW (Unaudited) (dollars in millions) Twelve Months Ended December 31, 2017 2016 Cash from operating activities: Net income $ 660.7 $ 832.6 Adjustments to reconcile net income to cash provided by operating activities: Depreciation and amortization 226.8 217.0 Stock-based compensation expense 49.7 47.6 Deferred income taxes 186.3 (29.9 ) Excess tax benefits from stock-based compensation payment arrangements — (44.4 ) Net change in components of working capital (158.1 ) 51.2 Net change in other long-term assets and liabilities 178.8 3.5 Net cash provided by operating activities 1,144.2 1,077.6 Cash from investing activities: Capital expenditures (226.6 ) (190.8 ) Proceeds from disposals of property, plant and equipment 4.1 7.1 Purchases of short-term investments (40.2 ) (232.4 ) Sales and maturities of short-term investments 148.0 108.5 Acquisitions, net of cash acquired (265.5 ) (1,305.1 ) Net cash used in investing activities (380.2 ) (1,612.7 ) Cash from financing activities: Proceeds from issuance of senior notes, net 749.3 — Repayments of long-term debt (375.0 ) — Borrowings under commercial paper program, net 154.1 183.2 Payment of costs related to debt financing (5.2 ) (3.0 ) Proceeds from exercise of stock options 184.1 147.2 Excess tax benefits from stock-based compensation payment arrangements — 44.4 Distributions to and purchases of noncontrolling interests (24.4 ) (6.8 ) Purchase and retirement of treasury stock (618.0 ) (325.8 ) Dividend payments (205.0 ) (172.7 ) Net cash used in financing activities (140.1 ) (133.5 ) Effect of exchange rate changes on cash and cash equivalents 60.6 (34.0 ) Net change in cash and cash equivalents 684.5 (702.6 ) Cash and cash equivalents balance, beginning of year 1,034.6 1,737.2 Cash and cash equivalents balance, end of year $ 1,719.1 $ 1,034.6 Cash paid during the year for: Interest $ 84.3 $ 68.5 Income taxes 325.2 246.8 AMPHENOL CORPORATION SEGMENT INFORMATION (Unaudited) (dollars in millions) Three months ended Twelve Months Ended December 31, December 31, 2017 2016 2017 2016 Net sales:\nInterconnect Products and Assemblies $ 1,852.6 $ 1,555.3 $ 6,606.9 $ 5,922.3 Cable Products and Solutions 91.3 95.8 404.4 364.1 Consolidated Net sales $ 1,943.9 $ 1,651.1 $ 7,011.3 $ 6,286.4 Operating income:\nInterconnect Products and Assemblies $ 414.4 $ 348.1 $ 1,475.2 $ 1,280.3 Cable Products and Solutions 10.2 14.2 54.2 52.8 Stock-based compensation expense (12.6 ) (12.2 ) (49.7 ) (47.6 ) Other operating expenses (12.6 ) (11.0 ) (48.1 ) (43.7 ) Acquisition-related expenses — — (4.0 ) (36.6 ) Consolidated Operating income $ 399.4 $ 339.1 $ 1,427.6 $ 1,205.2 Operating margin (%):\nInterconnect Products and Assemblies 22.4 % 22.4 % 22.3 % 21.6 % Cable Products and Solutions 11.2 % 14.9 % 13.4 % 14.5 % Stock-based compensation expense -0.6 % -0.7 % -0.7 % -0.8 % Other operating expenses -0.7 % -0.7 % -0.7 % -0.7 % Acquisition-related expenses 0.0 % 0.0 % 0.0 % -0.6 % Consolidated Operating margin (%) 20.5 % 20.5 % 20.4 % 19.2 % AMPHENOL CORPORATION\nSUPPLEMENTAL FINANCIAL INFORMATION\nRECONCILIATIONS OF GAAP TO NON-GAAP FINANCIAL MEASURES\n(Unaudited)\n(dollars in millions, except per share data)\nManagement utilizes the non-GAAP financial measures defined below as part of its internal reviews for purposes of monitoring, evaluating and forecasting the Company’s financial performance, communicating operating results to the Company's Board of Directors and assessing related employee compensation measures. As a result of the Tax Act’s reduction of a substantial portion of the future tax benefits of the Company’s stock option program as well as 2017 being the first year in which these excess tax benefits were reflected in income under GAAP, the Company has now excluded the excess tax benefit of stock option exercises in the presentation of its adjusted non-GAAP results for 2017. Management believes that such non-GAAP financial measures may be helpful to investors in assessing the Company’s overall financial performance, trends and period-over-period comparative results. The following non-GAAP financial measures exclude income and expenses that are not directly related to the Company's operating performance during the periods presented. Items excluded in the non-GAAP financial measures in any period may consist of, without limitation, acquisition-related expenses, refinancing-related costs, and certain discrete tax items including but not limited to (i) the estimated one-time income tax charge related to the Tax Act and (ii) the excess tax benefits related to stock-based compensation that may arise during such periods. The following non-GAAP financial information is included for supplemental purposes only and should not be considered in isolation, as a substitute for or superior to the related U.S. GAAP financial measures. In addition, these non-GAAP financial measures are not necessarily the same or comparable to similar measures presented by other companies, as such measures may be calculated differently or may exclude different items.\nThe following are reconciliations of non-GAAP financial measures to the most directly comparable U.S. GAAP financial measures for the periods presented:\nTwelve Months Ended December 31, 2017 2016 Net Income Net Income attributable Effective attributable Effective Operating Operating to Amphenol Tax Diluted Operating Operating to Amphenol Tax Diluted Income Margin Corporation Rate EPS Income Margin Corporation Rate EPS Reported (GAAP) $ 1,427.6 20.4 % $ 650.5 51.1 % $ 2.06 $ 1,205.2 19.2 % $ 822.9 27.0 % $ 2.61 Acquisition-related expenses 4.0 - 3.7 - 0.01 36.6 0.6 33.1 (0.5 ) 0.11 Excess tax benefits related to stock-based compensation - - (66.6 ) 4.9 (0.21 ) - - - - - Tax Act Charge - - 398.5 (29.5 ) 1.26 - - - - - Adjusted (non-GAAP) (1) $ 1,431.6 20.4 % $ 986.1 26.5 % $ 3.12 $ 1,241.8 19.8 % $ 856.0 26.5 % $ 2.72 (1) The definitions of non-GAAP financial measures used are as follows: Adjusted Operating Income is defined as Operating Income (as reported in the Condensed Consolidated Statements of Income), excluding income and expenses that are not directly related to the Company's operating performance during the periods presented.\nAdjusted Operating Margin is defined as Adjusted Operating Income (as defined above) expressed as a percentage of Net sales (as reported in the Condensed Consolidated Statements of Income).\nAdjusted Net Income attributable to Amphenol Corporation is defined as Net Income (loss) attributable to Amphenol Corporation (as reported in the Condensed Consolidated Statements of Income), excluding income and expenses and their specific tax effects, that are not directly related to the Company's operating performance during the periods presented.\nAdjusted Effective Tax Rate is defined as Provision for income taxes (as reported in the Condensed Consolidated Statements of Income) expressed as a percentage of Income before income taxes (as reported in the Condensed Consolidated Statements of Income), each excluding the income and expenses and their specific tax effects that are not directly related to the Company’s operating performance during the periods presented.\nAdjusted Diluted EPS is defined as diluted earnings (loss) per share (as reported in accordance with U.S. GAAP), excluding income and expenses and their specific tax effects, that are not directly related to the Company's operating performance during the periods presented. Adjusted Diluted EPS is calculated as Adjusted Net Income attributable to Amphenol Corporation, as defined above, divided by the weighted average outstanding diluted shares (as reported in the Condensed Consolidated Statements of Income).\nAMPHENOL CORPORATION\nSUPPLEMENTAL FINANCIAL INFORMATION\nRECONCILIATIONS OF GAAP TO NON-GAAP FINANCIAL MEASURES (continued)\n(Unaudited)\n(dollars in millions, except per share data)\nThe following are reconciliations of non-GAAP financial measures to the most directly comparable U.S. GAAP financial measures for the periods presented below:\n2017 2016 Net Income (loss) Net Income (loss) attributable to Effective attributable to Effective Operating Operating Amphenol Tax Diluted Operating Operating Amphenol Tax Diluted Income Margin Corporation Rate EPS Income Margin Corporation Rate EPS Three Months Ended December 31:\nReported (GAAP) $ 399.4 20.5 % $ (103.4 ) 126.5 % $ (0.34 ) $ 339.1 20.5 % $ 235.4 26.5 % $ 0.75 Dilutive share impact excluded due to net loss (1) - - - - 0.01 - - - - - Excess tax benefits related to stock-based compensation - - (20.8 ) 5.5 (0.07 ) - - - - - Tax Act Charge - - 398.5 (105.3 ) 1.26 - - - - - Adjusted (non-GAAP) (1) (2) $ 399.4 20.5 % $ 274.3 26.7 % $ 0.86 $ 339.1 20.5 % $ 235.4 26.5 % $ 0.75 Three Months Ended September 30:\nReported (GAAP) $ 377.9 20.5 % $ 277.5 21.8 % $ 0.88 $ 326.3 19.9 % $ 224.3 26.9 % $ 0.71 Acquisition-related expenses - - - - - 6.3 0.4 5.8 (0.4 ) 0.02 Excess tax benefits related to stock-based compensation - - (16.6 ) 4.7 (0.05 ) - - - - - Adjusted (non-GAAP) (2) $ 377.9 20.5 % $ 260.9 26.5 % $ 0.83 $ 332.6 20.3 % $ 230.1 26.5 % $ 0.73 Three Months Ended June 30:\nReported (GAAP) $ 336.2 20.2 % $ 251.5 20.1 % $ 0.80 $ 300.3 19.4 % $ 206.5 26.5 % $ 0.65 Acquisition-related expenses 4.0 0.2 3.7 (0.2 ) 0.01 - - - - - Excess tax benefits related to stock-based compensation - - (21.2 ) 6.6 (0.07 ) - - - - - Adjusted (non-GAAP) (2) $ 340.2 20.4 % $ 234.0 26.5 % $ 0.74 $ 300.3 19.4 % $ 206.5 26.5 % $ 0.65 Three Months Ended March 31:\nReported (GAAP) $ 314.1 20.1 % $ 224.9 23.8 % $ 0.71 $ 239.4 16.5 % $ 156.6 28.7 % $ 0.50 Acquisition-related expenses - - - - - 30.3 2.1 27.3 (2.2 ) 0.09 Excess tax benefits related to stock-based compensation - - (8.0 ) 2.7 (0.02 ) - - - - - Adjusted (non-GAAP) (2) $ 314.1 20.1 % $ 216.9 26.5 % $ 0.69 $ 269.7 18.6 % $ 183.9 26.5 % $ 0.59", "external_links": ["http://www.amphenol.com/investors/webcasts.php", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.amphenol.com%2Finvestors%2Fwebcasts.php&esheet=51747951&newsitemid=20180124005341&lan=en-US&anchor=http%3A%2F%2Fwww.amphenol.com%2Finvestors%2Fwebcasts.php&index=1&md5=c6415cf6f5c39f3099ffe53a3c44b2f0"], "published": "2018-01-24T16:00:00.000+02:00", "crawled": "2018-01-24T17:31:17.003+02:00", "highlightTitle": ""}