{"organizations": [], "uuid": "c1773ef7258c87b6191cbe9036632bb75c6d1365", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 712, "shares": 712, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225528621&w=1200&r=LYNXMPEE0P10Z", "site_section": "https://www.reuters.com/breakingviews", "section_title": "Breakingviews | Reuters", "url": "https://www.reuters.com/article/us-davos-meeting-breakingviews/breakingviews-trump-reworks-america-first-for-the-global-elite-idUSKBN1FF25R", "country": "US", "domain_rank": 408, "title": "Trump reworks America First for the global elite", "performance_score": 7, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T00:12:00.000+02:00", "replies_count": 0, "uuid": "c1773ef7258c87b6191cbe9036632bb75c6d1365"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-davos-meeting-breakingviews/breakingviews-trump-reworks-america-first-for-the-global-elite-idUSKBN1FF25R", "ord_in_thread": 0, "title": "Trump reworks America First for the global elite", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "DAVOS, Switzerland Donald Trump surprised Davos. After a week of anticipation and a parade of world leaders at the World Economic Forum, the U.S. president laid out in unexpectedly statesmanlike fashion the most succinct and persuasive version yet of his “America First” ideas. Though the substance was familiar – that America is no longer keen to underwrite an economic order without reciprocity from other countries – its sober and inclusive tone was new.\nTrue, Trump’s speech consisted largely of a sales pitch. Other speakers, including Prime Ministers Narendra Modi of India and Theresa May of the UK, also touted the merits of investing in their respective countries. But absent from Trump’s scripted performance were any references to issues like climate change or gender equality, which peppered other addresses at the summit.\nAnd no-one takes a victory lap like Trump. He boasted about reaching 84 new stock-market highs since taking office a year ago, when he referred in his inaugural address to “American carnage”. The president has a good scorecard to flash. GDP grew at an annual rate above 3 percent in the second and third quarters of 2017, though it came in at 2.6 percent in the fourth by the first estimate, below expectations. Unemployment has fallen to 4.1 percent and American companies will now pay 14 percentage points less in corporate tax then they did before.\nWhat was new in Trump’s Davos appearance aside from the style was the framing of his administration’s approach to trade and the like. Rather than bashing the Chinese for stealing American jobs, he stuck to larger principles of fairness. The United States “will no longer turn a blind eye to unfair economic practices including massive intellectual-property theft, industrial subsidies, and pervasive state-led economic planning,” he said. It’s a rational argument – and hints at something like leadership.\nMany gathered in Switzerland anticipated an uncouth performance from the former reality-TV star. They were expecting to laugh. Equally, many of them acknowledged the economic and financial benefits that accompanied his first year in the Oval Office. Trump knows how to play to an audience, and he avoided any ugliness about immigration and such things. This more measured version of Trumpism was designed for the global elite. Even so, it may help Davos Man and Woman feel less embarrassed about embracing some of its attributes.\n ", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-27T00:12:00.000+02:00", "crawled": "2018-01-27T00:11:57.019+02:00", "highlightTitle": ""}