{"organizations": [], "uuid": "6b705334218feae3ce0b32f004ecfeb71f81810c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/ford-special-service-plug-in-hybrid-sedan-1.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/26/ford-patent-autonomous-police-car/", "country": "US", "domain_rank": 1196, "title": "Ford Files Patent For Autonomous Police Car That Can Issue Tickets | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-26T16:00:00.000+02:00", "replies_count": 0, "uuid": "6b705334218feae3ce0b32f004ecfeb71f81810c"}, "author": "Kirsten Korosec", "url": "http://fortune.com/2018/01/26/ford-patent-autonomous-police-car/", "ord_in_thread": 0, "title": "Ford Files Patent For Autonomous Police Car That Can Issue Tickets | Fortune", "locations": [], "entities": {"persons": [{"name": "kirsten korosec", "sentiment": "negative"}], "locations": [{"name": "united states patent", "sentiment": "none"}], "organizations": [{"name": "ford", "sentiment": "negative"}, {"name": "trademark office", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Kirsten Korosec 2:00 PM EST \nFord already supplies law enforcement with fleets of vehicles built for police officers and first responders, including a modified F-150 truck and a pursuit-rated hybrid . Now the automaker appears to be planning for the day when human police officers are no longer needed to ticket speeding drivers. \nFord has filed for a patent for an autonomous police car that would be capable of detecting traffic violations such as speeding and then wirelessly communicate with the vehicle and its human driver to verify identity and issue a citation. The autonomous police car would be able to tap into surveillance cameras to spot the infractions. Or the car might just see the violation, like a human driver rolling through a stop sign, on its own. \nEither way, the autonomous police car would capture an image of the license plate, pursue the vehicle, and begin communicating with the driver. \nThe patent filing, which was first reported by Motor1 , was recently submitted to the United States Patent and Trademark Office. \nIn the patent, Ford notes that “routine police tasks, such as issuing tickets for speeding or failure to stop at a stop sign, can be automated so that police officers can perform tasks that cannot be automated.” \nThe patent also describes other scenarios in which police officers are in the autonomous vehicle, they’re just not driving. In these cases, the vehicle might respond and pull over a vehicle driving erratically and the human officers might need to intercede if the human driver is suspected of driving under the influence of alcohol or drugs. \nKeep in mind that just because a patent was filed, it doesn’t mean Ford intends to build out this technology. And even if the company did, this does not protect what would likely be a firestorm of lawsuits from privacy advocates and the ACLU to prevent such technology from being used. For instance, red-light cameras, which take photos of drivers who run red lights, have not been well received in places like Arizona. Opponents there have made multiple attempts to ban the practice. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-26T16:00:00.000+02:00", "crawled": "2018-01-26T23:46:32.023+02:00", "highlightTitle": ""}