{"organizations": [], "uuid": "7b39f1e0a2ae86bd6c9dbd87f1a24f3d40df5cb9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/africa-currencies/weekahead-africa-fx-kenya-currency-seen-bearish-nigeria-zambias-may-firm-idUSL8N1OZ0PP", "country": "US", "domain_rank": 408, "title": "WEEKAHEAD-AFRICA-FX-Kenya currency seen bearish, Nigeria, Zambia's may firm", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T08:18:00.000+02:00", "replies_count": 0, "uuid": "7b39f1e0a2ae86bd6c9dbd87f1a24f3d40df5cb9"}, "author": "", "url": "https://www.reuters.com/article/africa-currencies/weekahead-africa-fx-kenya-currency-seen-bearish-nigeria-zambias-may-firm-idUSL8N1OZ0PP", "ord_in_thread": 0, "title": "WEEKAHEAD-AFRICA-FX-Kenya currency seen bearish, Nigeria, Zambia's may firm", "locations": [], "entities": {"persons": [], "locations": [{"name": "zambia", "sentiment": "none"}, {"name": "nigeria", "sentiment": "none"}, {"name": "nigeria", "sentiment": "none"}, {"name": "kenya", "sentiment": "none"}, {"name": "uganda", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "min read  nairobi", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 6:20 AM / Updated an hour ago WEEKAHEAD-AFRICA-FX-Kenya currency seen bearish, Nigeria, Zambia's may firm Reuters Staff 3 Min Read \nNAIROBI, Jan 5 (Reuters) - The Kenyan currency may come under pressure next week on rising demand for dollars while Nigeria’s naira and Zambia’s local unit may firm. KENYA \nThe Kenyan shilling might come under pressure in the coming week due to increased demand for dollars from manufacturers, oil and food importers. \nOn Thursday, commercial banks quoted the shilling at 103.25/45 per dollar, compared with 103.10/30 at last Thursday’s close. UGANDA \nThe Ugandan shilling is seen trading with a bearish tone in the coming days, weighed down by surging appetite from manufacturing firms as they look to replenish raw material stocks after the festive season. \nOn Thursday commercial banks quoted the shilling at 3,645/3,655, weaker than last Thursday’s close of 3,625/3,635. NIGERIA \nThe naira is expected to firm slightly to 360 per dollar for investors next week as trading pick up after the Christmas holiday, traders said. \nThe currency traded weaker at 362 naira for investors on thin volumes on Thursday, around the same level as in the parallel market. On the official market, it was quoted at 305.95, supported by central bank’s regular intervention. ZAMBIA \nThe kwacha may gain marginally next week as firms convert dollars to the local unit in preparation for tax payments due next Wednesday. \nEarly on Friday, the currency of Africa’s No.2 copper producer was at 10.1000 per dollar, down from a close of 9.9150 a week earlier, according to Reuters data. \n“The supply side will be supported by corporates selling dollars to meet tax obligations,” independent financial analyst Maambo Hamaundu said. TANZANIA \nThe Tanzanian shilling is seen trading in a stable range over the coming days or could weaken marginally, underpinned by subdued demand for U.S. dollars. \nCommercial banks quoted the shilling at 2,239/2,244 to the dollar on Thursday, weaker than 2,233/2,243 a week ago. \n“The shilling is expected to remain at the same levels next week, but it could weaken slightly if we see an increase in demand for dollars,” said a trader at CRDB Bank. GHANA \nThe cedi is seen stable due to matching corporate dollar demand and supply as businesses ramp up slowly after the New Year holidays. \nThe local unit was trading at 4.5407 to the dollar on Thursday, same level as its 2018 open. (Reporting by John Ndiso, Elias Biryabarema, Chijioke Ohuocha, Chris Mfula, Fumbuka Ng‘wanakilala and Kwasi Kpodo; Compiled by Chris Mfula; Editing by Ed Stoddard)", "external_links": [], "published": "2018-01-05T08:18:00.000+02:00", "crawled": "2018-01-05T08:44:06.015+02:00", "highlightTitle": ""}