{"organizations": [], "uuid": "35cd5972659d4a06072b7f2a7ee10c3a6e96caa4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-907164044.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/25/trump-border-wall-dreamers-immigration/", "country": "US", "domain_rank": 1196, "title": "Donald Trump Still Wants $25 Billion to Build Border Wall | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-01-25T05:16:00.000+02:00", "replies_count": 0, "uuid": "35cd5972659d4a06072b7f2a7ee10c3a6e96caa4"}, "author": "Reuters", "url": "http://fortune.com/2018/01/25/trump-border-wall-dreamers-immigration/", "ord_in_thread": 0, "title": "Donald Trump Still Wants $25 Billion to Build Border Wall | Fortune", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "trum", "sentiment": "none"}, {"name": "herika martinez", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "ciudad juarez", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "chihuahua", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Immigration President Trump Says He's Open to Eventual 'Dreamers' Citizenship. But He Still Wants That $25 Billion Wall A view of the border wall between Mexico and the United States, in Ciudad Juarez, Chihuahua state, Mexico on Jan. 19, 2018. Herika Martinez—AFP/Getty Images By Reuters 3:16 AM EST \nPresident Donald Trump on Wednesday previewed his outline for an immigration bill that he will promote next week, saying he wants $25 billion to build a border wall and is open to granting citizenship to illegal immigrants who were brought to the United States as children. \nTrump said he was optimistic he could come to an agreement with both Republicans and Democrats in the U.S. Congress that would appeal to hardliners seeking tougher rules for immigrants while also preventing the roughly 700,000 “Dreamers” from being deported. \n“Tell them not to be concerned, ok? Tell them not to worry. We’re going to solve the problem. It’s up to the Democrats, but they (the Dreamers) should not be concerned,” Trump told reporters during an impromptu question-and-answer session at the White House. \nTrump campaigned for president in 2016 promising tougher rules for immigration. In September, he announced he was ending the Deferred Action for Childhood Arrivals (DACA) program created by his Democratic predecessor Barack Obama, effective in March – unless Congress came up with a new law. \nThe program currently protects about 700,000 people, mostly Hispanic young adults, from deportation and provides them work permits. \nRepublican Senator Lindsey Graham, one of the lead lawmakers in the immigration negotiations, said Trump‘s comments signaled a major breakthrough. \n“President Trump‘s support for a pathway to citizenship will help us get strong border security measures as we work to modernize a broken immigration system,” Graham said in a statement. “With this strong statement by President Trump, I have never felt better about our chances of finding a solution on immigration.” \nFor more on DACA, watch Fortune’s video: ‘Could go either way’ \nGraham was part of a bipartisan group of three dozen senators who met on Wednesday on Capitol Hill to discuss moving forward on immigration legislation. \nAfter the meeting, Democratic Senator Claire McCaskill expressed cautious optimism to reporters about Trump‘s framework, saying “that could go either way,” when asked if it will be helpful to lawmakers. \nTrump‘s chief of staff, John Kelly, was slated to meet with lawmakers on Capitol Hill on Thursday, a senior White House official said. \nTrump so far has rejected bipartisan proposals to continue DACA, leading to the standoff between Republicans and Democrats in the Senate that resulted in a three-day government shutdown that ended on Monday. \nCongress agreed to extend funding to Feb. 8, but Republicans promised to allow debate on the future of the young illegal immigrants. Senators began meeting to discuss their proposals on Wednesday. \nThe White House plans on Monday to unveil a framework for immigration legislation that it believes can pass muster with both parties. Trump will deliver his State of the Union address to Congress on Tuesday night. \nFor immigration legislation to be enacted into law, the House of Representatives ultimately would have to pass a bill identical to whatever the Senate approves. \nTrump said his proposal would include a request for $25 billion for the border wall, $5 billion for other border security programs, measures to curb family sponsorship of immigrants, and an overhaul of or end to the visa lottery system. \nIn exchange, he said he wanted to offer the Dreamers protection from deportation and an “incentive” of citizenship, perhaps in 10 to 12 years. \nAddressing the status of the Dreamers’ parents, who brought them into America illegally, would be “tricky,” Trump said. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-25T05:16:00.000+02:00", "crawled": "2018-01-25T15:22:11.021+02:00", "highlightTitle": ""}