{"organizations": [], "uuid": "800ff52fdafca6901b9d161f571e3a7856eb367b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-j2-global-announces-key-appointments-to-its-leadership-team.html", "country": "US", "domain_rank": 767, "title": "j2 Global Announces Key Appointments to its Leadership Team", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-09T00:10:00.000+02:00", "replies_count": 0, "uuid": "800ff52fdafca6901b9d161f571e3a7856eb367b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-j2-global-announces-key-appointments-to-its-leadership-team.html", "ord_in_thread": 0, "title": "j2 Global Announces Key Appointments to its Leadership Team", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES--(BUSINESS WIRE)-- j2 Global, Inc. (NASDAQ:JCOM), a leading Internet information and services company, announced three executive promotions: Harmeet Singh has been named President of Cloud Services; Steve Horowitz has been named President of Ziff Davis; and Joey Fortuna has been named Chief Technology Officer of j2 Global. All three will report to Vivek Shah, Chief Executive Officer of j2 Global.\nHarmeet Singh joined j2 in 2013 to help the company build its Fusemail business into a leading player in the security business and has more recently been overseeing j2’s backup unit. In his new role, he will oversee all of Cloud Services, including fax, voice, backup, security and email marketing. Prior to joining j2, Harmeet spent over 10 years at SingerLewak LLP where he was a senior partner and led their Northern California region. He also co-directed the firm’s technology practice, leading various IPOs, debt offerings and M&A transactions.\nSteve Horowitz joined Ziff Davis in 2010 as its Chief Operating Officer and subsequently joined j2 in 2012 following its acquisition of Ziff Davis. Steve has been instrumental in the significant growth and expansion that Ziff Davis has experienced over the past seven years. In his new role, Steve will oversee all aspects of the technology, gaming and e-commerce properties at the company. Before joining Ziff Davis and j2, Steve was the Senior Vice President and General Manager of Bankrate; Vice President of Classifieds at AOL; and Director of Marketing at Yahoo.\nJoey Fortuna joined Ziff Davis in 2011 as its Chief Technology Officer and subsequently joined j2 in 2012 following its acquisition of Ziff Davis. Joey has been a central figure in driving innovation and developing proprietary technology at our media businesses. In his new role, Joey will oversee corporate IT initiatives, policies and practices, and facilitating cross-company technology efforts. Prior to joining j2, Joey was the Senior Vice President of Engineering at Vindico, VP of Engineering at Quigo, and co-founder and Vice President of Technology at Pseudo.\n“Harmeet, Steve and Joey are world-class executives and have been critical to j2’s growth,” said Mr. Shah. “We are excited to start the year with them in their new roles and look forward to their continued success.”\nAbout j2 Global\nj2 Global, Inc. (NASDAQ: JCOM) provides Internet services through two segments: Business Cloud Services and Digital Media. The Business Cloud Services segment offers Internet fax, virtual phone, unified communications, hosted email, email marketing, online backup and CRM solutions. It markets its services principally under the brand names eFax ®, eVoice ®, Onebox ®, FuseMail ®, Campaigner ®, KeepItSafe ®, Livedrive® and LiveVault®, and operates a messaging network spanning 50 countries on six continents. The Digital Media segment offers technology, gaming, lifestyle and healthcare content through its digital properties, which include PCMag, IGN, AskMen, Speedtest, Offers, ExtremeTech, Geek, Toolbox, Techbargains, emedia, Salesify, Everyday Health and others. As of December 31, 2016, j2 had achieved 21 consecutive fiscal years of revenue growth. For more information about j2, please visit www.j2global.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180108006580/en/\nj2 Global, Inc.\nLaura Hinson, 800-577-1790\npress@j2.com\nSource: j2 Global, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.j2global.comm&esheet=51739229&newsitemid=20180108006580&lan=en-US&anchor=www.j2global.com&index=1&md5=95ce4cdca567e074411145dbce6a6d6d", "http://www.businesswire.com/news/home/20180108006580/en/"], "published": "2018-01-09T00:10:00.000+02:00", "crawled": "2018-01-09T09:40:22.078+02:00", "highlightTitle": ""}