{"organizations": [], "uuid": "9daf8a7f3c21c02f431c1dc80f66ad07d52e19c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/us-japan-weather-snow/tokyo-braces-for-rare-heavy-snowfall-trains-disrupted-idINKBN1FB0CC", "country": "US", "domain_rank": 408, "title": "Snowstorm in Tokyo disrupts road, rail and air transport", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T10:53:00.000+02:00", "replies_count": 0, "uuid": "9daf8a7f3c21c02f431c1dc80f66ad07d52e19c1"}, "author": "", "url": "https://in.reuters.com/article/us-japan-weather-snow/tokyo-braces-for-rare-heavy-snowfall-trains-disrupted-idINKBN1FB0CC", "ord_in_thread": 0, "title": "Snowstorm in Tokyo disrupts road, rail and air transport", "locations": [], "entities": {"persons": [], "locations": [{"name": "tokyo", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "raleigh", "sentiment": "none"}, {"name": "honshu", "sentiment": "none"}, {"name": "haneda", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "nhk", "sentiment": "none"}, {"name": "japanese meteorological agency", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 3:57 AM / Updated 27 minutes ago Snowstorm in Tokyo disrupts road, rail and air transport Reuters Staff 3 Min Read \nTOKYO (Reuters) - A rare snowstorm hit Tokyo on Monday, snarling train services, forcing the cancellation of scores of flights and prompting hordes of workaholic Japanese to heed official advice to head home early. \nSnow began falling on Monday morning, with as much as 10 cm (4 inches) predicted for central Tokyo by the time it is expected to stop early on Tuesday. By 5:00 p.m. 6 cm (2.4 inches) had fallen in central Tokyo, as the snowfall intensified, NHK national broadcaster said. \nTrain services were curtailed and some highways were closed, as icy roads were causing traffic accidents. Around 250 flights from Tokyo’s Haneda airport were canceled. \nA looming low pressure system and cold front just off the coast of the Japanese main island of Honshu was expected to bring low temperatures and more snow throughout the day and night, the Japanese Meteorological Agency said. \nThe Japanese capital, which is on roughly the same latitude as the U.S. city of Raleigh, North Carolina, often sees snow at least once a year, but this time it is expected to accumulate, rather than quickly melt as it usually does. \nThe government issued heavy snow warnings for the area around the capital, just two weeks after hundreds of people were trapped overnight in a train in northern Japan due to heavy snow. \nNHK national broadcaster issued detailed recommendations for coping with the weather, including wearing boots with heavy treads, heading home early and not walking with hands in coat pockets in case of slips and falls. \nTrains to the suburbs were packed full by the unusually early hour of 4:00 p.m. and long lines formed at supermarkets. \nNHK reported that universities had postponed entrance exams due to have been held on Tuesday morning. \nA disaster management center in the prime minister’s office was collating information on the situation. \n“We will respond to this based on various scenarios,” \nChief Cabinet Secretary Yoshihide Suga told a news conference. “We call on all citizens to keep informed about the latest conditions and beware of transport delays.” Reporting by Kaori Kaneko and Elaine Lies; Editing by Simon Cameron-Moore", "external_links": [], "published": "2018-01-22T10:53:00.000+02:00", "crawled": "2018-01-22T11:24:41.006+02:00", "highlightTitle": ""}