{"organizations": [], "uuid": "63434f7c22cfebfdcedcab0bdcae845e0b9d3811", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222411312&w=1200&r=LYNXMPEE0F0SP", "site_section": "http://feeds.reuters.com/reuters/environment/", "section_title": "Reuters: Environment", "url": "https://www.reuters.com/article/us-usa-offshore-drilling-tourism/not-just-florida-tourism-big-in-other-states-opposing-coastal-drilling-idUSKBN1F51ES", "country": "US", "domain_rank": 408, "title": "Not just Florida: Tourism big in other states opposing coastal drilling", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T14:24:00.000+02:00", "replies_count": 0, "uuid": "63434f7c22cfebfdcedcab0bdcae845e0b9d3811"}, "author": "", "url": "https://www.reuters.com/article/us-usa-offshore-drilling-tourism/not-just-florida-tourism-big-in-other-states-opposing-coastal-drilling-idUSKBN1F51ES", "ord_in_thread": 0, "title": "Not just Florida: Tourism big in other states opposing coastal drilling", "locations": [], "entities": {"persons": [{"name": "richard valdmanis", "sentiment": "none"}, {"name": "ryan zinke", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "valerie volcovici", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "florida", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "pacific", "sentiment": "none"}, {"name": "maine", "sentiment": "none"}, {"name": "alaska", "sentiment": "none"}, {"name": "atlantic", "sentiment": "none"}], "organizations": [{"name": "min read", "sentiment": "none"}, {"name": "interior", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "interior department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - The Trump administration’s decision last week to exempt Florida from its national offshore drilling plan was based in part on the state’s argument that a spill would cripple its crucial tourism industry.\nBut several other states opposed to oil and gas drilling off their coasts are similarly dependent on tourism, according to a Reuters review of economic data - a fact that could make it hard for the administration to reject similar requests, and complicate its efforts to expand drilling.\nThe Interior Department this month proposed opening up virtually all U.S. coastline to drillers as part of Republican President Donald Trump’s plan to boost domestic energy production, leading the governors of every state along the Atlantic and Pacific seaboards - except Maine and Alaska - to object.\nInterior Secretary Ryan Zinke said last Tuesday, however, that he was removing Florida from consideration after meeting with its Republican governor, Rick Scott.\nThat surprised officials in other states and prompted Democratic lawmakers to accuse Zinke of favoritism - a charge he has denied. It also disappointed the oil industry, which had been eager to drill in the region.\n“For Florida, we have to remember we are a tourism state. One out of every six jobs in our state is tied to tourism. So, I oppose offshore drilling,” Scott told Fox News in an interview after the announcement.\n‘CLEARLY UNIQUE’\nIn announcing his decision, Zinke said that “Florida is clearly unique” and mentioned its recreation-centered coast.\nIndeed, tourism is massive in Florida. Visitors to the state spent $111.7 billion there in 2016, according to the state’s tourism marketing corporation, Visit Florida, accounting for about 12 percent of the state’s gross domestic product.\nBut tourism makes up about 11 percent of the economy of neighboring Georgia, 10 percent of the economies of South Carolina and Maine and nearly 7 percent of the economy of New Jersey. tmsnrt.rs/2DuPuu3\nSouth Carolina’s Republican governor, Henry McMaster, has said he is seeking an exemption from the drilling plan, while Georgia’s Republican governor, Nathan Deal, said he was concerned about drilling in coastal Georgia.\nA spokeswoman for Maine’s Republican governor, Paul LePage, said LePage generally supported Trump’s efforts to expand domestic drilling but was still reviewing the offshore drilling proposal.\nIn New Jersey, Governor-elect Phil Murphy, a Democrat who takes office this week, has said he will fight drilling off the coast and called Interior’s plan a “ticking time bomb.” Outgoing Republican Governor Chris Christie, a Trump ally, is also “steadfastly opposed,” his spokesman, Brian Murray, said.\nMost other states along the Atlantic coast, like Delaware, Virginia, North Carolina and New York, have tourist industries that contribute between 4 and 6 percent of their GDP.\nOn the West Coast, California’s tourism industry also contributes about 5 percent to the economy - but the full dollar figure exceeds Florida’s at $126 billion, according to state tourism figures.\nZinke has said he will meet with every governor who has concerns about his offshore drilling proposal in a process that could take a year.\nReporting by Valerie Volcovici in Washington and Richard Valdmanis in Boston; Writing by Richard Valdmanis; Editing by Peter Cooney\n ", "external_links": [], "published": "2018-01-16T14:24:00.000+02:00", "crawled": "2018-01-16T14:40:38.021+02:00", "highlightTitle": ""}