{"organizations": [], "uuid": "c66ac322e9318cbe093743d66a1566138c8d58fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221130139&w=1200&r=LYNXMPEE0A0X3", "site_section": "http://feeds.reuters.com/news/wealth?format=xml", "section_title": "Reuters: Money", "url": "https://www.reuters.com/article/us-funds-jns-hndsn-glb-uncon-bd-gross/bill-gross-of-janus-bonds-like-men-are-in-a-bear-market-idUSKBN1F01LO", "country": "US", "domain_rank": 408, "title": "Bill Gross of Janus: 'Bonds, like men, are in a bear market'", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T15:00:00.000+02:00", "replies_count": 0, "uuid": "c66ac322e9318cbe093743d66a1566138c8d58fb"}, "author": "", "url": "https://www.reuters.com/article/us-funds-jns-hndsn-glb-uncon-bd-gross/bill-gross-of-janus-bonds-like-men-are-in-a-bear-market-idUSKBN1F01LO", "ord_in_thread": 0, "title": "Bill Gross of Janus: 'Bonds, like men, are in a bear market'", "locations": [], "entities": {"persons": [{"name": "bill gross", "sentiment": "negative"}, {"name": "jennifer ablan", "sentiment": "none"}, {"name": "gross", "sentiment": "none"}, {"name": "bill gross of janus henderson", "sentiment": "none"}], "locations": [{"name": "hollywood", "sentiment": "none"}], "organizations": [{"name": "min read  new york", "sentiment": "none"}, {"name": "janus henderson global unconstrained bond fund", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 1:01 PM / Updated 7 hours ago Bill Gross of Janus: 'Bonds, like men, are in a bear market' Jennifer Ablan 3 Min Read \nNEW YORK (Reuters) - Billionaire bond veteran Bill Gross of Janus Henderson said on Thursday that the U.S. Treasury market has begun a bear market, though “not a dangerous one” for investors. \nIn his first Investment Outlook report of 2018 to investors, Gross, who oversees the $2.2 billion Janus Henderson Global Unconstrained Bond Fund, likened recent selling pressure to changing attitudes about how to address and stop improper conduct by men toward women. \nSexual harassment has been at the forefront of public attention following a string of recent complaints against prominent men in Hollywood, the media and politics. \n“Bonds, like men, are in a bear market,” Gross said. “For both, it’s hard to say when it all began.” \nGross, whose letters to investors are as famous for their quirky asides and analogies as for their economic and market analysis, said there are several significant reasons that the benchmark 10-year yield should reach 2.70 percent-plus by year-end and a mild bear market a total return of 0-1 percent for most bond portfolios. \n“Long stuck in a 4-percent plus or minus range that led to mild bond price changes despite a series of Fed hikes, the nominal economy now looks capable of 5 percent for at least a few quarters,” Gross said. \n“Tax cuts and increasing budget deficits are providing a temporary fiscal push that likely will increase future inflation to the 2 percent core target long desired by the Fed. Three percent real growth, although perhaps illusionary in your author’s opinion, gives the economy that 5 percent nominal number that overvalues 10 year Treasuries at 2.5 percent.” \nSecondly, the Fed and importantly other central banks are cutting back on quantitative easing, Gross said. \n“Later this year, perhaps in September, net central bank purchases of sovereign and corporate notes and bonds may stop, or at least falter far below the $1-2 trillion pace of recent years. The market’s central bank buyers of last resort have perhaps accomplished “whatever it takes”, and are set to allow artificially low yields, and artificially high bond prices to become a little less artificial.” \nGross said the diminution of “QE check writing” and a 5 percent nominal GDP should be enough to produce higher 10 year Treasury yields, near zero percent total returns, and the legitimate characterization of the beginning of a mild bear market. \nU.S. television celebrity Oprah Winfrey brought the Golden Globes film awards crowd to its feet with a powerful speech during Sunday’s ceremony, calling out sexual harassers around the world: “Their time has come.” \nGross said: “The bear bond market’s time has come as well. Many would say, including yours truly - It’s about time’.” Reporting By Jennifer Ablan", "external_links": [], "published": "2018-01-11T15:00:00.000+02:00", "crawled": "2018-01-11T15:17:38.000+02:00", "highlightTitle": ""}