{"organizations": [], "uuid": "1dbd7a2e673a8029c0905c8cc1504a75ac4472f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/04/23/100665307-106658224.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/02/gold-hits-3-12-month-highs-on-weaker-dollar.html", "country": "US", "domain_rank": 767, "title": "Gold hits 3-1/2-month highs on weaker dollar", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T04:26:00.000+02:00", "replies_count": 0, "uuid": "1dbd7a2e673a8029c0905c8cc1504a75ac4472f2"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/02/gold-hits-3-12-month-highs-on-weaker-dollar.html", "ord_in_thread": 0, "title": "Gold hits 3-1/2-month highs on weaker dollar", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "u.s. federal reserve", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Gold prices edged down on Wednesday after hitting a 3-1/2-month high, as the dollar recovered from its lows and technical indicators pointed to a short-term correction.\nSpot gold fell 0.4 percent to $1,312.71 an ounce at 0257 GMT. The precious metal earlier hit $1,321.33, its highest level since Sept. 15.\nU.S. gold futures were mostly unchanged at $1,315.60 an ounce.\n\"Relative strength index shows the metal at overbought levels, which may lead to short term selling,\" ScotiaMocatta analysts said in a research note.\nThe 14-day relative strength index (RSI) for spot gold touched 75 on Tuesday, it highest since September 2017. An RSI above 70 indicates a commodity is overbought and could lead to a price correction.\nThe dollar index , in which the gold is priced, was up 0.1 percent at 91.946 after falling to a more than three-month low Tuesday.\nThe greenback posted its biggest annual drop since 2003 in 2017, helping gold to an annual increase of more than 13 percent. Bullion surged $55 an ounce in the last three weeks of 2017 alone.\nGold's medium-term outlook appeared positive, analysts said.\n\"At this moment we are expecting some kind of inflationary expectations. People are more optimistic with stock rally are also expecting returns in commodities including gold,\" said Mark To, head of research at Hong Kong's Wing Fung Financial Group.\n\"We should tap the short term opportunities to go long as gold has crossed $1,300 with a momentum. It may act as a support, while $1,340 could be an immediate resistance level and we might reach $1,400 in the first quarter this year.\"\nshow chapters Gold's record run 16 Hours Ago | 01:58 Spot gold may break a resistance at $1,326 per ounce and rise towards the next resistance at $1,380 in three months, as suggested by its wave pattern and a Fibonacci ratio analysis, according to Reuters technical analyst Wang Tao.\nHoldings of SPDR Gold Trust , the world's largest gold-backed exchange-traded fund, fell 0.14 percent to 836.32 tonnes on Tuesday from 837.50 tonnes on Friday.\nAmong other precious metals, spot palladium fell 0.6 percent to $1,086.30 an ounce, after hitting a record high on Tuesday at $1,096.50\nThe metal, which soared 57 percent in 2017, has been surging on fears of short supplies.\nAnalysts expect that about 80 percent of global palladium demand will come from autocatalysts for gasoline-powered cars, which many consumers now prefer over diesel-fueled vehicles.\nSpot silver fell 0.5 percent at $17.10 an ounce, after hitting a six week high at $17.21 earlier in the session.\nSpot platinum fell 0.8 percent to $935.74 an ounce.", "external_links": [], "published": "2018-01-03T04:26:00.000+02:00", "crawled": "2018-01-03T03:58:53.011+02:00", "highlightTitle": ""}