{"organizations": [], "uuid": "210c23afafe91d8214a9595975dc6767fdf14f68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/bonds", "section_title": "Bonds News | Reuters.com", "url": "https://www.reuters.com/article/easteurope-markets/cee-markets-forint-leads-fx-retreat-hungarian-bond-yields-higher-idUSL8N1PE2L9", "country": "US", "domain_rank": 408, "title": "CEE MARKETS-Forint leads FX retreat, Hungarian bond yields higher", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.964, "site_type": "news", "published": "2018-01-19T20:12:00.000+02:00", "replies_count": 0, "uuid": "210c23afafe91d8214a9595975dc6767fdf14f68"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/easteurope-markets/cee-markets-forint-leads-fx-retreat-hungarian-bond-yields-higher-idUSL8N1PE2L9", "ord_in_thread": 0, "title": "CEE MARKETS-Forint leads FX retreat, Hungarian bond yields higher", "locations": [], "entities": {"persons": [{"name": "sandor peto", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "hungary", "sentiment": "none"}, {"name": "budapest", "sentiment": "none"}], "organizations": [{"name": "hungarian irs", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "nbh", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "irs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Currencies retreat after hitting multi-year highs vs dollar * Disappointment over Hungarian IRS tender causes jitters * Hungary trying to push down borrowing costs By Sandor Peto BUDAPEST, Jan 19 (Reuters) - The forint led a weakening of Central European currencies on Friday after their surge to multi-year highs against the dollar made the greenback more attractive for investors. The dollar is labouring near a three-year low against a basket of global currencies, partly pressured by fears of a possible U.S. government shutdown. The Senate has yet to approve a bill that would fund government operations through to Feb. 16. The Hungarian currency and bond market were also hit by disappointment that the central bank's (NBH) long-term interest rate swap (IRS) tender on Thursday had featured a smaller volume and at a lower discount than banks had expected.. Hungarian government bond yields have declined in recent months to record lows in anticipation that new bi-weekly tenders and an NBH mortgage scheme would push long-term market interest rates down, with the aim of stimulating mortgage lending. The benchmark 10-year bond yield jumped about 10 basis points after the IRS auction and was trading flat at 2.08 percent on Friday. A Budapest-based fixed income trader said a jump in IRS yields in the market on Thursday triggered some spot debt selling. The NBH may consider now lifting the IRS programme's 300 billion forint limit for the first quarter and offering the swaps more cheaply, market participants said. The European Central Bank, which meets next week, may continue to keep its policy accommodative, supporting the Hungarian central bank's loose stance, but a rise in interest rates is a global trend, said Erste analyst Orsolya Nyeste. \"If the NBH want to keep yields down, it needs to be present actively in the market,\" she said. The NBH said on Friday it planned to use the IRS facility evenly for a long period of time, \"with the pricing conditions revealed at the first auction (on Thursday) nearly unchanged\". The less aggressive than expected IRS tender contributed to an overnight surge in the forint to a 3-month high of 307.7 against the euro in illiquid international trade. After that spike the forint turned into a regional underperformer on Friday against both the euro and the dollar. Other Central European currencies also eased on Friday, with the Polish zloty retreating from its three-year highs against the dollar and the Czech crown off its former record high against the greenback. The forint shed 0.4 percent versus the euro by 1047 GMT, trading at 309.2 and the Czech crown was down a quarter of a percentage point. The zloty and the leu shed 0.2 percent against the single currency. All four units are still slightly above their end-2017 levels despite diverging monetary policies in the region. Hungary continues to stimulate the economy via unconventional tools and some Polish central bankers have projected no change in record-low rates throughout this year. Romania's central bank delivered its first rate hike in a decade earlier this month. The Czech central bank (CNB) may deliver its third hike since August at its February meeting. A member of its board, Tomas Nidetzky was Quote: d as saying on Friday that two hikes this year could be sufficient. CEE SNAPSHOT AT MARKETS 1147 CET CURRENCI ES Latest Previous Daily Change bid close change in 2018 Czech <EURCZK= 25.4240 25.3600 -0.25% +0.46% crown > Hungary <EURHUF= 309.2000 307.9500 -0.40% +0.55% forint > Polish <EURPLN= 4.1740 4.1652 -0.21% +0.06% zloty > Romanian <EURRON= 4.6615 4.6520 -0.20% +0.39% leu > Croatian <EURHRK= 7.4380 7.4400 +0.03% -0.10% kuna > Serbian <EURRSD= 118.4000 118.4300 +0.03% +0.08% dinar > Note: calculated from 1800 CET daily change Latest Previous Daily Change close change in 2018 Prague 1121.47 1119.050 +0.22% +4.02% 0 Budapest 39827.95 39663.92 +0.41% +1.14% Warsaw 2599.73 2591.22 +0.33% +5.63% Bucharest 8361.45 8374.67 -0.16% +7.84% Ljubljana <.SBITOP 833.30 831.33 +0.24% +3.34% > Zagreb 1873.30 1873.87 -0.03% +1.65% Belgrade <.BELEX1 774.64 773.33 +0.17% +1.95% 5> Sofia 708.71 711.20 -0.35% +4.61% BONDS Yield Yield Spread Daily (bid) change vs Bund change in Czech spread Republic 2-year <CZ2YT=R 0.7560 0.1620 +134bps +16bps R> 5-year <CZ5YT=R 1.0030 -0.0260 +113bps -3bps R> 10-year <CZ10YT= 1.7660 -0.0030 +118bps -2bps RR> Poland 2-year <PL2YT=R 1.5830 -0.0010 +217bps +0bps R> 5-year <PL5YT=R 2.6490 -0.0080 +277bps -1bps R> 10-year <PL10YT= 3.3350 0.0050 +275bps -1bps RR> FORWARD RATE AGREEMEN T 3x6 6x9 9x12 3M interban k Czech Rep 1.03 1.20 1.37 0.77 <PRIBOR= > Hungary 0.10 0.17 0.25 0.02 Poland 1.75 1.77 1.87 1.72 Note: FRA are for ask prices Quote: s", "external_links": [], "published": "2018-01-19T20:12:00.000+02:00", "crawled": "2018-01-19T14:17:16.006+02:00", "highlightTitle": ""}