{"organizations": [], "uuid": "e98c066a8d46720cd2c33123d746acaf4dfa49d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/cnbc-interview-with-baker-mckenzie-global-chairman-paul-rawlinson-from-the-world-economic-forum-2018.html", "country": "US", "domain_rank": 767, "title": "CNBC Interview with Baker McKenzie Global Chairman, Paul Rawlinson from the World Economic Forum 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.013, "site_type": "news", "published": "2018-01-26T12:17:00.000+02:00", "replies_count": 0, "uuid": "e98c066a8d46720cd2c33123d746acaf4dfa49d0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/cnbc-interview-with-baker-mckenzie-global-chairman-paul-rawlinson-from-the-world-economic-forum-2018.html", "ord_in_thread": 0, "title": "CNBC Interview with Baker McKenzie Global Chairman, Paul Rawlinson from the World Economic Forum 2018", "locations": [], "entities": {"persons": [{"name": "baker mckenzie", "sentiment": "negative"}, {"name": "paul rawlinson", "sentiment": "negative"}, {"name": "steve sedgwick", "sentiment": "none"}, {"name": "geoff cutmore", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "cnbc interview", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Following are excerpts from a CNBC interview with Paul Rawlinson, Baker McKenzie Global Chairman and CNBC's Steve Sedgwick and Geoff Cutmore from the World Economic Forum 2018.\nSS: Right. It's been almost a month since MiFID II was launched in Europe, it feels longer, doesn't it? The sweeping regulations are designed to make financial markets more transparent, and offer greater protection to investors. Let's get straight to Paul Rawlinson, who is Global Chairman, Baker McKenzie. Well, I mean, what a botched launch that was, wasn't it, really? And they were giving out exemptions left, right and centre to all kinds of exchanges and what have you. Talk about a soft launch. Or is that a bit harsh?\nPR: A bit harsh-,\nSS: [Laughter].\nPR: A bit harsh. I think what we need to look at is the-, this whole concept of the landscape of European regulation, in the light of Brexit and what-, what we're trying to achieve here. And, you know, when you talk to business, what they want is certainty across markets, certainly the financial sector has had its ups and downs, but a, sort of, acceptance of a certain degree of pretty robust regulation seems to be the norm. And then, when you look at the impact of-, of Brexit, there's a big spotlight on, you know, whether or not we've got too much regulation, we've got Donald Trump talking about rolling back regulation, what does this mean for other sectors, as well? So, it's not just the finance sector. And, the interesting thing about Brexit is the-, is this notion of us trying to replicate EU rules outside the EU, and that's probably what will happen, because we've got to try and set a level playing field for business, doing business right across the European Union.\nSS: So-, so, just get this right for me, Paul. So, your job now, Baker McKenzie, one of your jobs, will be to mirror every rule that's there, but not abide by those rules? I.e., the British-, the whole big gain from Brexit is going to be so that we can have exactly the same rules, but we'll call them British.\nPR: Well, that is the softest of soft Brexits, right? So, that-, that is actually mirroring what's in Europe. We adopt the European rules, first of all, clearly-,\nSS: Mm. Yes, of course-,\nPR: We adopt them in to our law, and then, over time, we shape the laws that suit the UK. That's the philosophy. But, of course, the further you diverge from the European rules, the harder it is to-, to justify, you know, investment in the UK versus the European Union, because it makes it harder for business, generally.\nSS: Right.\nPR: If you look at a US investor coming in, they'll say, 'Can I really be bothered with the UK as a smaller market, when the rules, and the complexity of doing business are-, are too great?' So, there's a temptation to, sort of, say, let's just mirror as far as possible, unless it's in the UK's interest to do something pretty radical. But, of course, the-, the counter part of this is, that's a cost to business, because if you want an EU anti-trust ruling, you've got to go to the EU and the UK, as well. So, there's a cost to business of Brexit, not just the, sort of, cost of getting there.\nGC: Oh, it's clearly, still, very much a work in progress.\nPR: Yes.\nGC: Just moving on to one of the other areas where the business has been active, of course, is looking at M&A activity-,\nPR: Yes.\nGC: Forecasting M&A activity, being involved in M&A activity. Is 2018 going to be a stellar year?\nPR: That's what we predict. So, our global transactions forecast talks about 3.2 trillion as the peak point this year, which, I think we see as a-, a-, not-, not quite up to, sort of, historical levels, but getting pretty close. And that's driven by positive investment indicators across all regions, and multisector. Tech, consumer, healthcare, in particular. So, we're seeing quite a-, a positive dynamic with our clients investing, and, kind of, M&A, and it shows a confidence in-, in the global economy. But also, IPO activity, we're very much seeing a significant increase in IPO activity. We certainly see it continuing in to 2019, but there's a prospect of a slowdown the second half of 2019, just the usual investment cycle-,\nGC: Mm.\nPR: Prediction of interest rates going up a little bit, and running a bit of-, a bit of steam. But-, but for 2018, we're extremely positive.\nGC: Mm.\nSS: Um-,\nGC: Go on.\nSS: No, I was just going to ask about your own profession, as well.\nPR: Yes.\nSS: I mean, given everything you've just said, and we-, you know, I introduced MiFID, maybe I'd been a bit harsh, maybe I hadn't, who knows, but-, and everything that's going on with Brexit, as well. This is boom time for your business, isn't it? Absolute boom time for-, for lawyers, for accountants out there, it must just be a fantastic time.\nPR: Well, certainly, there's a lot of activity in law firms, in advisory firms, professional services generally, to try and help clients navigate all this complexity. But, what we still see as the ultimate driver of our business is-, is continued investment and activity. So, whilst this is good work, in terms of looking at regulation, and the impact on business, and, yes, that-, that breeds a, sort of, level of complexity, what we-, what we still , really, need, in the economy for all of us, is-, is continued, you know, economic activity-,\nSS: Sure.\nPR: In the real economy. So-, so, yes-, yes, to your answer, it is-, it is a-, a busy time for lawyers, but it's also a-, you know, like any other business, a very competitive environment. Clients have ever-increasing demands, on what they want from us, and pressure on-, on rates, and all the rest of it. So, we're no different, in that respect.\nSS: Alright. Fair enough-,\nPR: [Laughter].\nSS: One of your competitors said to me, on the-, on the morning after Brexit, he had a conference call, 3,000 clients. I'm not saying he was rubbing his hands, but-, [laughter] but I think quite amazing, the level of lack of understanding. I'm sure they all know about it now. Paul, nice to see you-,\nPR: Thank you.\nSS: Paul Rawlinson, Global Chairman at Baker McKenzie.\nENDS", "external_links": [], "published": "2018-01-26T12:17:00.000+02:00", "crawled": "2018-01-26T12:36:44.000+02:00", "highlightTitle": ""}