{"organizations": [], "uuid": "e7b55a9acefa11d2f1da68f5af4a7e200ee1cc78", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-eu-taxavoidance-blacklist/eu-to-remove-panama-korea-uae-five-others-from-tax-haven-blacklist-idUSKBN1F4235", "country": "US", "domain_rank": 408, "title": "EU to remove Panama, Korea, UAE, 5 other from tax haven blacklist", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T17:45:00.000+02:00", "replies_count": 0, "uuid": "e7b55a9acefa11d2f1da68f5af4a7e200ee1cc78"}, "author": "", "url": "https://www.reuters.com/article/us-eu-taxavoidance-blacklist/eu-to-remove-panama-korea-uae-five-others-from-tax-haven-blacklist-idUSKBN1F4235", "ord_in_thread": 0, "title": "EU to remove Panama, Korea, UAE, 5 other from tax haven blacklist", "locations": [], "entities": {"persons": [{"name": "francesco guarascio", "sentiment": "none"}, {"name": "gabriela baczynska", "sentiment": "none"}], "locations": [{"name": "panama", "sentiment": "none"}, {"name": "uae", "sentiment": "none"}, {"name": "korea", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "mongolia", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "barbados", "sentiment": "none"}, {"name": "macao", "sentiment": "none"}, {"name": "united arab emirates", "sentiment": "none"}, {"name": "tunisia", "sentiment": "none"}, {"name": "grenada", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BRUSSELS (Reuters) - European Union officials have proposed removing eight jurisdictions from the blacklist of tax havens the bloc adopted in December, in what critics may see as a blow to its campaign against tax avoidance.\nEU states decided last month to draw up the list in a bid to discourage the most aggressive tax dodging practices.\nBut eight of the 17 jurisdictions currently listed are set to be quickly removed from the list after they offered to change their tax rules, according to EU documents seen by Reuters.\nPanama, South Korea, the United Arab Emirates, Barbados, Grenada, Macao, Mongolia and Tunisia are the jurisdictions that EU officials have recommended be delisted.\nThe removal of Bahrain was also initially considered, but its delisting was eventually not recommended, the documents show.\nThe proposal will be discussed at a meeting of EU ambassadors on Wednesday and is expected to be adopted by EU finance ministers when they meet next week in Brussels for monthly talks.\nJurisdictions set to remain on the blacklist are American Samoa, Bahrain, Guam, the Marshall Islands, Namibia, Palau, Saint Lucia, Samoa, and Trinidad and Tobago.\nThe proposal for the delisting was made by the so-called Code of Conduct Group, which gathers tax experts from the 28 EU member states. It monitors countries’ commitments to abide by EU standards on tax matters.\nIf the recommendation were confirmed by EU ministers, the eight jurisdictions will be moved to a so-called gray list which includes those who have committed to change their rules on tax transparency and cooperation. The gray list currently includes 47 jurisdictions.\nThe shrinking of the blacklist is likely to be criticized by tax transparency groups. In December some activists denounced the listing process as a whitewash and had called for the inclusion in the blacklist of some EU countries accused of facilitating tax avoidance, like Luxembourg, Malta, Ireland and the Netherlands.\nThe recommended removal of Panama may cause particular outcry, as it has been at the center of one of the largest disclosures of offshore schemes, the so-called Panama Papers.\nEU officials have said the purpose of the blacklist is to convince jurisdictions to become more transparent. Having fewer on the list means more countries have committed to changes, they say.\nReporting by Francesco Guarascio; Editing by Gabriela Baczynska and Andrew Roche\n ", "external_links": [], "published": "2018-01-15T17:45:00.000+02:00", "crawled": "2018-01-15T18:17:56.023+02:00", "highlightTitle": ""}