{"organizations": [], "uuid": "44989f1e747fa0ae393415f627bc159243f71e4a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222641226&w=1200&r=LYNXMPEE0G0AU", "site_section": "http://feeds.reuters.com/reuters/sportsNews/", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-tennis-ausopen-tsonga/tennis-tsonga-tames-shapovalov-in-five-set-classic-idUSKBN1F60JK", "country": "US", "domain_rank": 408, "title": "Tennis: Tsonga tames Shapovalov in five-set classic", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T08:14:00.000+02:00", "replies_count": 0, "uuid": "44989f1e747fa0ae393415f627bc159243f71e4a"}, "author": "", "url": "https://www.reuters.com/article/us-tennis-ausopen-tsonga/tennis-tsonga-tames-shapovalov-in-five-set-classic-idUSKBN1F60JK", "ord_in_thread": 0, "title": "Tennis: Tsonga tames Shapovalov in five-set classic", "locations": [], "entities": {"persons": [{"name": "shapovalov", "sentiment": "negative"}, {"name": "tsonga", "sentiment": "negative"}, {"name": "martyn herman", "sentiment": "none"}, {"name": "denis shapovalov", "sentiment": "none"}, {"name": "jo-wilfried tsonga", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "min read  melbourne", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "margaret court arena", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MELBOURNE (Reuters) - There was a time when Jo-Wilfried Tsonga was one of the new kids bounding on to the block, swinging from the hip and shaking up the established hierarchy in men’s tennis.\nNow aged 32, the charismatic Frenchman, who reached the Australian Open final 10 years ago, is part of the old guard holding back the charge of precocious young warriors hungry to seize power.\nHe managed it, just, on Wednesday as his vast experience saw the 15th seed outlast straggly-haired Canadian teenager Denis Shapovalov in a five-set classic in Melbourne.\nTheir second-round clash always looked like being something special and it was just that, as Tsonga avenged a straight-sets defeat at last year’s U.S. Open to reach the third round for the 10th time with a 3-6 6-3 1-6 7-6(4) 7-5 win.\nOutplayed at times by the stylish left-hander who struck 60 winners, Tsonga looked a beaten man at 5-2 down in the deciding set before he roused himself to claim an improbable victory.\nIt was not all dogged defense though, even if Shapovalov’s firepower often threatened to overwhelm the former world number five, who has been troubled by a calf injury.\nWith his back to the wall in a thrilling denouement to the three hour, 37 minute clash on a baking Margaret Court Arena, he produced some trademark fireworks of his own, including a between the legs effort that had the captivated crowd on its feet.\nEighteen-year-old Melbourne debutant Shapovalov, playing only his third grand slam, would have been a worthy winner had he not wobbled when serving for the match at 5-3.\nTwo errors from his favorite backhand and a double-fault opened the door for Tsonga to break back and the Frenchman then swept through the final three games, sealing the 16th five-set victory of his career with a textbook serve and volley winner.\n“I‘m tired but really happy,” Tsonga, who performed his crowd-pleasing celebratory dance, said on court.\n“I did a big fight today. It’s not easy to play the young guns, they play great and go for everything so it’s difficult to defend. I suffered physically but I continued to fight.”\nTennis - Australian Open - Margaret Court Arena, Melbourne, Australia, January 17, 2018. Jo-Wilfried Tsonga of France hits a shot against Denis Shapovalov of Canada. REUTERS/David Gray NEVER EASY TO WIN Later he expressed some sympathy for 50th-ranked Shapovalov, who looks to have an exciting career ahead of him.\n“I think he deserved to win also today, but I was also courageous and I did my job,” he said.\n“It’s never easy to finish the match.”\nSlideshow (5 Images) Shapovalov’s explosive shot-making helped him take the opening set comfortably but Tsonga, popular Down Under after his final appearance against Novak Djokovic in 2008, found some extra zip on his shots to level the match.\nThe third set whizzed by in 26 minutes as Shapovalov again seized control with some ripping winners off both flanks.\nIt was tight in the fourth as Tsonga’s physical presence kept him ahead on serve and he piled on the pressure with some superb forceful tennis to claim the tiebreaker 7-4.\nShapovalov was a point away from a 4-0 lead in the decider but Tsonga dug in, hoping his young foe would tighten.\nAnd so it proved, as Tsonga landed a blow for the old guard.\nShapovalov said he would try to take as many positives from the defeat as possible.\n”As much as the loss hurts, I don’t find it as a loss,“ he told reporters. ”I find it as an opportunity to learn.\n“I‘m the type of guy when things don’t go my way, instead of sulking or getting mad, I go back on the court and try to work twice as hard, so next time when I‘m in that position I can hit some good serves, just close the match out.”\nReporting by Martyn Herman; Editing by John O'Brien\n ", "external_links": [], "published": "2018-01-17T08:14:00.000+02:00", "crawled": "2018-01-17T09:23:57.000+02:00", "highlightTitle": ""}