{"organizations": [], "uuid": "16292eda0df83c768f1b9c736dd731a1707379a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/17/104950038-GettyImages-901570382.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/17/china-transport-hub-could-be-the-african-island-of-sao-tome.html", "country": "US", "domain_rank": 767, "title": "China's next transport hub could be the African island of Sao Tome", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.051, "site_type": "news", "published": "2018-01-17T14:06:00.000+02:00", "replies_count": 0, "uuid": "16292eda0df83c768f1b9c736dd731a1707379a7"}, "author": "Justina Crabtree", "url": "https://www.cnbc.com/2018/01/17/china-transport-hub-could-be-the-african-island-of-sao-tome.html", "ord_in_thread": 0, "title": "China's next transport hub could be the African island of Sao Tome", "locations": [], "entities": {"persons": [{"name": "pico cao grande", "sentiment": "negative"}, {"name": "ruth mcdowall", "sentiment": "negative"}, {"name": "agnese ortolani", "sentiment": "none"}, {"name": "wang yi", "sentiment": "none"}, {"name": "principe", "sentiment": "none"}], "locations": [{"name": "sao tome", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "international airport", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "central africa", "sentiment": "none"}], "organizations": [{"name": "bbc", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "economist intelligence unit", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Ruth McDowall | AFP | Getty Images A view of Pico Cao Grande, a volcanic peak on Sao Tome island on January 1, 2018. \nChina's Foreign Minister Wang Yi concluded his annual trip to Africa on Tuesday with a visit to the tiny island nation of Sao Tome and Principe, off the continent's western gulf. \nBeijing's interest in the archipelago, with its population of roughly 200,000, may seem unusual. But experts CNBC spoke to have suggested that Sao Tome and Principe could serve as a strategic transport hub for the superpower. \nAgnese Ortolani, Western and Central Africa analyst at the Economist Intelligence Unit, told CNBC via email that: \"China has pledged to provide the archipelago with a $146 million for the modernization of its International Airport and the construction of a deep-sea container port, which could serve as a logistics hub for Chinese exports to Central Africa.\" \nThis is not the first time a foreign power has expressed an interested in Sao Tome and Principe as a port. In 2002, the BBC reported that the U.S. was considering building a naval base on the island to safeguard oil interests in the region — though little has been heard of this plan since. \nWang pledged China's support of Sao Tome and Principe's development while in talks with the island's Foreign Minister Urbino Botelho on Monday, Xinhua reported. Yohei Kanasashi | AFP | Getty Images Chinese President Xi Jinping (R) shows the way to Sao Tome's Prime Minister Patrice Trovoada ahead of their meeting at the Great Hall of People in Beijing on April 14, 2017. \nAccording to the state-run news agency, Botelho said that Chinese companies are welcome to contribute to improving Sao Tome and Principe's infrastructure and cooperate further in areas such as agriculture and fishing. \nSao Tome and Principe is a former Portuguese colony, covering approximately 1,000 square kilometers in total. According to the World Bank, the archipelago has \"no single economic activity that serves as a driver for growth.\" \nChina's relationship with Sao Tome and Principe is relatively young. Ortolani told CNBC: \"In April 2017, the two countries signed a first five-year co-operation agreement relating to areas including infrastructure, technology, student scholarships and medical assistance.\" \nThis followed Sao Tome and Principe's ditching of ties with Taiwan in December 2016. Such a move is required by China, as part of its One China Policy, to enable diplomacy with Beijing. \nDaniel de Blocq van Scheltinga, managing partner at Hong Kong-based advisory Polarwide, told CNBC via email that Wang's visit was focused on the West Africa region due to \"geopolitics and oil.\" Wang has been in OPEC member Angola as well as Gabon in the past week, a marked change from China's previous focus on East Africa. Ruth McDowall | AFP | Getty Images Youngsters play football in Sao Tome city on January 1, 2018. \nDe Blocq van Scheltinga pointed out that should China establish a naval base in Sao Tome and Principe, the superpower would have a presence both to the east and west of the African continent, meaning that it would be \"able to deploy their fleet and troops quickly to safeguard trade routes and the like.\" \nSao Tome and Principe joins a long list of African nations signed up to receive Chinese financing. During a press conference in Angolan capital Luanda, Wang defended China against claims that the superpower's financing of African countries increases their debt burden . \nChina has a military base on the tiny East African nation of Djibouti — alongside the U.S.' presence there — that is known for its strategic location ahead of the Suez Canal, which provides access to European markets. \nBut given China's foreign investment pledges, Ortolani did warn that: \"With economic growth in China forecast to slow in 2018, we think actual commitments will be lower than promised.\"", "external_links": [], "published": "2018-01-17T14:06:00.000+02:00", "crawled": "2018-01-17T14:07:41.071+02:00", "highlightTitle": ""}