{"organizations": [], "uuid": "f75e1f006d6cf6f8ed6cd19c3fe199015099d097", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180122.html", "section_title": "Archive News &amp; Video for Monday, 22 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/europe-electricity/europe-power-day-ahead-up-on-tighter-supply-week-2-up-on-cooler-trend-idUSL8N1PH3FU", "country": "US", "domain_rank": 408, "title": "EUROPE POWER-Day-ahead up on tighter supply, week 2 up on cooler trend", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-01-22T20:15:00.000+02:00", "replies_count": 0, "uuid": "f75e1f006d6cf6f8ed6cd19c3fe199015099d097"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/europe-electricity/europe-power-day-ahead-up-on-tighter-supply-week-2-up-on-cooler-trend-idUSL8N1PH3FU", "ord_in_thread": 0, "title": "EUROPE POWER-Day-ahead up on tighter supply, week 2 up on cooler trend", "locations": [], "entities": {"persons": [], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "frankfurt", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "thomson reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FRANKFURT, Jan 22 (Reuters) - European wholesale power prices for next day delivery rose on Monday, along with those for the week starting Feb. 5, due to bullish weather and demand patterns that overrode comfortable thermal supply in mid-winter.\n* “January will turn out to have been a warm winter month while February could be a lot colder,” one trader said. “Nearby, there is rising demand, wind will be slow to arrive, and a French nuclear plant is out,” he added.\n* German baseload for Tuesday delivery, at 37.5 euros ($45.94) a megawatt hour (MWh), was up 4.2 percent from Monday’s over-the-counter closing price.\n* The equivalent French contract, at 38.5 euros, was up 9.2 percent.\n* Thomson Reuters data showed German wind production on Tuesday would be slow to arrive, but then ramp up strongly late in the day to hit 12.1 gigawatts (GW) for the entire day, compared with 10.9 GW expected for Monday.\n* On Wednesday, it may reach 26.1 GW, but this could possibly be the peak seen for the next fortnight.\n* French nuclear supply, meanwhile, remains at a comfortable 91.6 percent of total availability but the Tricastin 1 plant is due to remain offline in an unscheduled stoppage at least up to Tuesday.\n* On the demand side, day-on-day increases of 2 GW and 2.5 GW were respectively forecast for Germany and France.\n* Prices for the week starting Feb. 5 gained 7.9 percent in Germany and 12.2 percent in France, when a cold front is due to arrive and protective buying took account of this.\n* Along the forward power curve, Germany’s Cal ‘19 baseload contract, the European benchmark, nudged 5 cents higher to 35.4 euros/MWh.\n* The equivalent French contract was at 40.6 euros/MWh, up 20 cents from its close.\n* December 2018 expiry European carbon emissions permits lost 0.6 percent to 8.71 euros a tonne.\n* Cif Europe coal for 2019 was down 0.4 percent at $85.5 a tonne.\n* In eastern Europe, the Czech baseload contract for Tuesday delivery was at 38 euros, down from 52.5 euros paid for Monday. Czech year-ahead power shed 15 cents to 36.3 euros. ($1 = 0.8163 euros) (Reporting by Vera Eckert; Editing by Mark Potter)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T20:15:00.000+02:00", "crawled": "2018-01-23T18:16:18.000+02:00", "highlightTitle": ""}