{"organizations": [], "uuid": "90ddda42f0b8d60c604ef3edfa33df48e66f90d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 500, "shares": 500, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180120&t=2&i=1223565659&w=1200&r=LYNXMPEE0I1TG", "site_section": "https://www.reuters.com/politics", "section_title": "Politics &amp; Political News | Reuters", "url": "https://www.reuters.com/article/uk-usa-congress-shutdown/u-s-government-shutdown-begins-as-spending-bill-fails-in-senate-idUSKBN1F814D", "country": "US", "domain_rank": 408, "title": "U.S. government shutdown begins as spending bill fails in Senate", "performance_score": 5, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T14:49:00.000+02:00", "replies_count": 0, "uuid": "90ddda42f0b8d60c604ef3edfa33df48e66f90d0"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/uk-usa-congress-shutdown/u-s-government-shutdown-begins-as-spending-bill-fails-in-senate-idUSKBN1F814D", "ord_in_thread": 0, "title": "U.S. government shutdown begins as spending bill fails in Senate", "locations": [], "entities": {"persons": [{"name": "chuck schumer", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "mitch mcconnell", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "senate", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - The U.S. government shut down at midnight on Friday after Democrats and Republicans, locked in a bitter dispute over immigration and border security, failed to agree on a last-minute deal to fund its operations.\nIn a late-night session, senators blocked a bill to extend government funding through Feb. 16. The bill needed 60 votes in the 100-member Senate but only 50 supported it.\nMost Democrats opposed the bill because their efforts to include protections for hundreds of thousands of mostly young immigrants, known as Dreamers, were rejected by President Donald Trump and Republican leaders.\nHuddled negotiations between Senate Majority Leader Mitch McConnell and Senate Democratic leader Chuck Schumer were unsuccessful, and the U.S. government technically ran out of money at midnight.\nWhile the two men said they remained committed to reaching a deal, the shutdown formally began on Saturday, the first anniversary of President Donald Trump’s inauguration.\nHis inability to cut a deal despite enjoying a Republican majority in both houses of Congress highlighted the deep political divide in Washington.\nUntil a funding deal is worked out, scores of federal agencies across the country will be unable to operate, and hundreds of thousands of “non-essential” federal workers will be put on temporary unpaid leave.\nTrump immediately moved to blame Democrats.\n“Tonight, they put politics above our national security, military families, vulnerable children, and our country’s ability to serve all Americans,” the White House said in a statement.\nIt also said it would not discuss immigration until the government was up and running again.\n“We will not negotiate the status of unlawful immigrants while Democrats hold our lawful citizens hostage over their reckless demands. This is the behaviour of obstructionist losers, not legislators.”\nIn return, Schumer pointed the finger directly at Trump.\n“It’s almost as if you were rooting for a shutdown and now we’ll have one and the blame should crash entirely on President Trump’s shoulders,” he said.\nNEGOTIATE OR FIGHT? Democratic and Republican leaders agreed to reopen negotiations on Saturday and said they were committed to getting a quick agreement.\nWhite House budget director Mick Mulvaney talks with reporters at the White House in Washington, U.S., January 19, 2018. REUTERS/Carlos Barria But both sides may now be even less willing to make concessions because a political defeat on the issue could be costly, especially with the control of Congress up for grabs at midterm elections later this year.\nThe Republican-controlled House of Representatives passed a stopgap funding measure on Thursday. But Republicans then needed the support of at least 10 Democrats to pass the bill in the Senate. While five Democrats ended up voting for the measure, five Republicans voted against it.\nDemocratic leaders wanted the measure to include protections from deportation for about 700,000 undocumented immigrants who arrived in the United States as children.\nDespite bipartisan negotiations, Republican leaders refused to include those protections, and neither side was willing to back down.\nTrump, who had made strict measures on immigration a cornerstone of his presidential campaign, last week rejected a bipartisan proposal.\nSlideshow (12 Images) He said he wanted to include any deal for Dreamers in a bigger legislative package that also boosted funding for a wall and tighter security measures along the U.S. border with Mexico.\nSchumer met with Trump on Friday afternoon and later said he had reluctantly agreed to include the border wall in the negotiations but that it still was not enough to persuade Trump to find a compromise.\nMcConnell said he would seek over the weekend a new funding bill that covered the federal government through to Feb. 8.\nA Senate Democratic source said that was still too far out. Democrats had argued for an extension of just four or five days to force both sides into serious negotiations on the immigration issue.\nDespite the formal shutdown, “essential” employees who deal with public safety and national security will keep working.\nThat includes more than 1.3 million people on active duty in the military who will be required to work but will not be paid until funding is renewed or handled with separate legislation.\nAlthough past government shutdowns have done little lasting damage to the U.S. economy, they can rattle financial markets and undermine the United States’ reputation abroad.\nThis impasse follows a months-long struggle in Congress to agree on government funding levels and protections for Dreamers, most of whom are originally from Mexico or Central America.\nThey were given temporary legal status under the Deferred Action for Childhood Arrivals programme started by former President Barack Obama.\nIn September, Trump announced he was ending the programme and gave Congress until March 5 to come up with new legislation. Efforts to do that have so far failed so Democrats tried to get it done by linking a deal to funding of the federal government.\nAdditional reporting by Roberta Rampton and Jim Oliphant; Writing by Kieran Murray; Editing by Leslie Adler and Michael Perry\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-20T14:49:00.000+02:00", "crawled": "2018-01-20T16:23:05.002+02:00", "highlightTitle": ""}