{"organizations": [], "uuid": "8358b743d603a4f79b000d613f040fd93927729f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180115.html", "section_title": "Archive News &amp; Video for Monday, 15 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/africa-factors/african-markets-factors-to-watch-on-jan-16-idUSL8N1PB09C", "country": "US", "domain_rank": 408, "title": "African Markets - Factors to watch on Jan. 16", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-16T12:53:00.000+02:00", "replies_count": 0, "uuid": "8358b743d603a4f79b000d613f040fd93927729f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/africa-factors/african-markets-factors-to-watch-on-jan-16-idUSL8N1PB09C", "ord_in_thread": 0, "title": "African Markets - Factors to watch on Jan. 16", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "jacob zuma", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "nigeria usa/trump nigeria", "sentiment": "none"}], "organizations": [{"name": "european central bank", "sentiment": "none"}, {"name": "african national congress party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The following company announcements, scheduled economic indicators, debt and currency market moves and political events may affect African markets on Tuesday. - - - - - GLOBAL MARKETS Asian shares pushed higher on Tuesday, erasing early modest losses while the euro stood near a 3-year peak on rising expectations that the European Central Bank could pare its monetary stimulus. WORLD OIL PRICES Brent crude prices were on Tuesday settling in around $70 per barrel, levels last seen before the start of an oil market slump in late 2014. EMERGING MARKETS For the top emerging markets news, double click on AFRICA STOCKS For the latest news on African stocks, click on SOUTH AFRICA MARKETS South Africa's rand strengthened slightly on Monday, helped by a weaker dollar and by reports that the ruling African National Congress party was preparing to discuss whether President Jacob Zuma should step down as head of state. NIGERIA USA/TRUMP Nigeria's government on Monday summoned a representative of the U.S. ambassador to explain reported remarks by President Donald Trump that immigrants from Africa and Haiti come from \"shithole countries\", the foreign ministry said. NIGERIA SECURITY Nigeria will punish all those behind an outbreak of deadly clashes between cattle herders and farmers, President Muhammadu Buhari said on Monday pushing back at accusations that he failed to take action against members of his own ethnic group. NIGERIA CURRENCY Nigeria's central bank said on Monday that it had injected $210 million into the interbank foreign exchange market as part of its attempt to boost liquidity and alleviate dollar shortages. KENYA MARKETS The Kenyan shilling was stable against the dollar on Monday, with increased buying activity from retail and oil importers seen posing a depreciation risk. AFRICA SAMSUNG South Korea's Samsung Electronics plans to double the annual revenue contribution from its African markets to 20 percent of the firm's global total in the next five years, the head of its business on the continent said on Monday. GHANA CURRENCY Ghana's cedi will be more stable in 2018 than last year, helped by lower inflation outlook and higher oil production, the central bank said on Monday. GHANA CRIME Police in Ghana have seized suspected explosives of various kinds in Accra, the capital, and are holding three men connected to the substances, the regional police command said in a statement on Monday. IVORY COAST COCOA Dusty Saharan winds hampered cocoa crop development in Ivory Coast last week, though some light rain provided respite for the main crop, farmers said on Monday. UGANDA MARKETS The Ugandan shilling remained unchanged on Monday, helped by flat dollar demand as mid-month tax payments forced most firms to stay out of the market. UGANDA POLITICS Uganda's leading lawyers sought on Monday to overturn a law that critics say would allow incumbent leader Yoweri Museveni to effectively become president for life. TANZANIA ACACIA MINING Acacia Mining said on Monday said fourth-quarter production fell by a third on the previous year due to a ban on exports of gold and copper concentrates in Tanzania. ETHIOPIA POLITICS Ethiopian authorities have dropped charges against a senior opposition leader and hundreds of others who had been jailed for involvement in unrest that gripped the country in 2015 and 2016, the country's attorney general said on Monday. ZIMBABWE INFLATION Zimbabwe's consumer price inflation quickened to 3.46 percent year-on-year in December from 2.97 percent in November, data from the national statistics agency showed on Monday. For the latest precious metals report click on For the latest base metals report click on For the latest crude oil report click on\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-16T12:53:00.000+02:00", "crawled": "2018-01-16T13:35:32.000+02:00", "highlightTitle": ""}