{"organizations": [], "uuid": "d864584564716f9f1bcbe9bf567f04c238f85511", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/12/02/103211730-RTX1W1EXr.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/macys-holiday-sales-stronger-but-not-enough-to-ward-off-dismal-2017.html", "country": "US", "domain_rank": 767, "title": "Macy's holiday sales stronger, but not enough to ward off dismal 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.708, "site_type": "news", "published": "2018-01-04T15:00:00.000+02:00", "replies_count": 0, "uuid": "d864584564716f9f1bcbe9bf567f04c238f85511"}, "author": "Andrew Kelly", "url": "https://www.cnbc.com/2018/01/04/macys-holiday-sales-stronger-but-not-enough-to-ward-off-dismal-2017.html", "ord_in_thread": 0, "title": "Macy's holiday sales stronger, but not enough to ward off dismal 2017", "locations": [], "entities": {"persons": [{"name": "macy", "sentiment": "negative"}, {"name": "andrew kelly", "sentiment": "none"}], "locations": [], "organizations": [{"name": "macy", "sentiment": "negative"}, {"name": "reuters  macy's", "sentiment": "none"}, {"name": "macy's", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "7 Hours Ago | 01:11 \nMacy's said Thursday it had a \"strong\" holiday season thanks to fresher products and a renewed focus on customers, but the retailer's full-year sales are still expected to decline against a backdrop of weakening foot traffic at malls and the growth of internet giants like Amazon . \nThe department store chain continues to whittle away at its store fleet,. It confirmed on Thursday that 11 locations are set to close early this year. With such a massive portfolio of stores, Macy's has been forced to rethink its strategy and right-size its real estate, hoping those bets will pay dividends in the long run. \nMacy's stock fell more than 7 percent Thursday morning on the news. \nMacy's comparable sales on an owned basis rose 1 percent during the months of November and December compared with the same period last year. On a licensed and owned basis, same-store sales were up 1.1 percent. \nFollowing the better-than-expected results, Macy's narrowed the range of its prior fiscal 2017 sales guidance and raised its full-year earnings outlook. To be sure, the company has yet to return to same-store sales growth. \nMacy's now expects comparable sales on an owned basis to fall 2.4 percent to 2.7 percent, whereas total revenue is expected to drop 3.6 to 3.9 percent in fiscal 2017. Previously, Macy's had forecast total comparable sales to decline by 2.2 to 3.3 percent, while annual revenue was projected to fall by 3.2 to 4.3 percent. \n\"Macy's success comes with a few caveats,\" GlobalData Retail Managing Director Neil Saunders wrote in a note to clients. \n\"The first is that growth remains relatively weak and comes off the back of soft prior year comparatives when comparable sales fell by 2.1%,\" Saunders said. \"The second is that while Macy's grew, it did so by far less than the overall sector; as such it is still losing market share both in total and within a number of key categories.\" \nMacy's said it expects full-year earnings to benefit from the recent federal tax reform, which will result in an effective annual tax rate that is about 1 point lower than the retailer previously estimated. \nThe company raised its fiscal 2017 earnings outlook to a range of $3.59 and $3.69 per share, excluding the impact of various store closings and other costs associated with debt repurchases. Excluding the impact of an anticipated fourth-quarter gain on the sale of a building in San Francisco, adjusted earnings should fall within $3.11 and $3.21 per share. \n\"We saw improved sales trends in our stores and continued to see double-digit growth on our digital platforms,\" CEO Jeff Gennette said in a statement. \n\"Our primary focus in 2017 has been to continue the strong growth of digital and mobile, stabilize our brick & mortar business and set the foundation for future growth,\" he added. \"Looking ahead to 2018, we are focused on continuous improvement and will take the necessary steps to move faster, execute more effectively and allocate resources to invest in growth.\" \nIn confirming the 11 locations that will shutter this year, Macy's also said this path (along with other efforts) should save the company about $300 million in expenses annually, starting in fiscal 2018, which will be reinvested back in the business. Macy's said it will begin reducing employees in some locations, while adding in others, and will work to \"streamline\" certain operations completed outside of stores. \n\"A healthy store base combined with robust digital capabilities is Macy's recipe for success,\" Gennette said. More doors set to be closed \nAbout this same time last year, Macy's posted disappointing holiday sales and released the locations of more than 60 of the 100 stores it planned to close in 2017. The company also said at the time it would close 34 more stores \"over the next few years\" as leases or operating covenants expired or as sale transactions were completed (making 100 closures in total). \nOn Wednesday, reports began to surface that a handful of those 34 closures would take place in 2018, and the retailer's shares dropped nearly 4 percent on the news. On Thursday morning, Macy's confirmed that it's nearing completing 81 of the 100 planned store closures, with 19 more to take place over time. \nHaving faced pressure before from activist investor Starboard ( which sold its stake in the company in 2017 ) to separate its real estate from its retail business, Macy's has still been taking steps to make money from those assets. The department store chain now has a partnership with Brookefield Asset Management to explore opportunities on 50 properties. \n\"The company's announcements of further store closures and more cost-streaming underscore the need for more surgery to restore the business to health,\" GlobalData Retail's Saunders said. \"In our view, Macy's still has an enormous amount of work to do here.\" \nMeantime, Macy's is testing smaller versions of its off-price concept, Macy's Backstage, inside some of its existing stores, which appeals to customers looking for more of a \"treasure hunt\" shopping experience. Other efforts have focused on upgrading Macy's loyalty program and mobile app. \nAll in all, this holiday season was an important one for Macy's to prove its relevance in retail against a backdrop of declining revenues and negative same-store sales. \nIn late November, Gennette told CNBC Macy's was already looking to be a \"better destination with better experiences\" throughout the holiday season compared with the year prior. Top-selling items included coats, sweaters, boots (namely winter weather apparel) and fragrances, the company said. \nMeantime, promotions across stores were less severe, Gennette said, which should help boost the company's embattled profit margins in the long term. \n\"We're looking at new opportunities to bring traffic into stores,\" Gennette has said about initiatives in 2018. \"Customers love experiences when they come into the building.\" \nAs of Wednesday's close, Macy's shares have tumbled more than 25 percent over the past 12 months. The retailer's fourth-quarter earnings results are set to be announced Feb. 27. \nThe following Macy's stores are closing in early 2018. In most cases, clearance sales will begin on Jan. 8 and run for up to 12 weeks. \nLaguna Hills Mall, Laguna Hills, CaliforniaWestside Pavilion, Los Angeles", "external_links": [], "published": "2018-01-04T15:00:00.000+02:00", "crawled": "2018-01-04T15:13:25.004+02:00", "highlightTitle": ""}