{"organizations": [], "uuid": "c18fe95bb6fd64a9f00aa012744fb4d175549269", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220165333&w=1200&r=LYNXMPEE0707B", "site_section": "https://www.reuters.com/breakingviews", "section_title": "Breakingviews | Reuters", "url": "https://www.reuters.com/article/us-usa-trade-southkorea-breakingviews/breakingviews-trump-would-be-wise-to-ease-up-on-seoul-idUSKBN1EX09B", "country": "US", "domain_rank": 408, "title": "Trump would be wise to ease up on Seoul", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.223, "site_type": "news", "published": "2018-01-08T12:27:00.000+02:00", "replies_count": 0, "uuid": "c18fe95bb6fd64a9f00aa012744fb4d175549269"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-trade-southkorea-breakingviews/breakingviews-trump-would-be-wise-to-ease-up-on-seoul-idUSKBN1EX09B", "ord_in_thread": 0, "title": "Trump would be wise to ease up on Seoul", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "neutral"}, {"name": "donald trump", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "seoul washington", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "korus", "sentiment": "none"}, {"name": "korea", "sentiment": "none"}], "organizations": [{"name": "general motors", "sentiment": "none"}, {"name": "ford motor", "sentiment": "none"}, {"name": "fiat chrysler", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON The Trump administration has an understandable beef with South Korea. A trade pact struck back in 2011 didn’t live up to expectations. As talks kick off to amend the deal, though, there will be an unusually difficult balancing act to strike.\nFormal negotiations to modify the U.S.-Korea Free Trade Agreement, known as KORUS, started on Friday, following two special sessions last year. An update could help American car and machinery makers, who haven’t fared as well as economists originally anticipated. President Donald Trump last year called it a “horrible deal,” one promoted by his election opponent Hillary Clinton when she was U.S. secretary of state, and threatened to terminate it.\nThe value of goods sent to Korea in 2016 was lower than before the deal went into effect. Meanwhile, imports have increased by nearly $20 billion, fueling a trade in goods deficit that has more than doubled in five years.\nA weak won and tepid Korean import demand are partly to blame. U.S. automakers also point to regulatory barriers. General Motors, Ford Motor and Fiat Chrysler Automobiles, for example, can ship over only 25,000 vehicles a year each based on U.S. safety standards. Any more must comply with Korean specs. Lifting the cap would provide a boost.\nIt’s a question of how hard the administration wants to push amid more significant priorities. South Korea accounts for only about 3 percent of total U.S. trade in goods. By comparison, Canada and Mexico – bordering countries in the North American Free Trade Agreement, which is also being renegotiated – collectively make up about 30 percent. There also may be trade action involving China, which could quickly consume the agenda and political capital.\nWhat’s more, dealings with Seoul are never solely – or even mostly – about trade. Previous U.S. presidents advanced talks to help reassure an ally in the face of saber-rattling from the Kim family, which has escalated with Trump taunting the current North Korean leader on Twitter over nuclear arsenals.\nDiplomatic considerations are growing in significance, too. At least some U.S. officials are worried that North Korea’s emerging détente with the South may be an attempt to drive a wedge between Seoul and Washington. That means pushing for a better trade deal while trying to present a united front against Pyongyang. One may have to give.\n ", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-08T12:27:00.000+02:00", "crawled": "2018-01-08T14:04:32.003+02:00", "highlightTitle": ""}