{"organizations": [], "uuid": "c03b4caff5c8e52fbbb1250e0be60ea993b07822", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224565732&w=1200&r=LYNXMPEE0M1OT", "site_section": "http://www.reuters.com/resources/archive/us/20180123.html", "section_title": "Archive News &amp; Video for Tuesday, 23 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-davos-funds-guggenheim/guggenheims-minerd-davos-valuable-contra-indicator-for-investors-idUSKBN1FC2PC", "country": "US", "domain_rank": 408, "title": "Guggenheim's Minerd: Davos 'valuable contra-indicator' for investors", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.869, "site_type": "news", "published": "2018-01-24T03:17:00.000+02:00", "replies_count": 0, "uuid": "c03b4caff5c8e52fbbb1250e0be60ea993b07822"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-davos-funds-guggenheim/guggenheims-minerd-davos-valuable-contra-indicator-for-investors-idUSKBN1FC2PC", "ord_in_thread": 0, "title": "Guggenheim's Minerd: Davos 'valuable contra-indicator' for investors", "locations": [], "entities": {"persons": [{"name": "davos", "sentiment": "negative"}, {"name": "scott minerd", "sentiment": "negative"}, {"name": "guggenheim", "sentiment": "negative"}, {"name": "minerd", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "guggenheim partners", "sentiment": "negative"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Guggenheim Partners chief investment officer Scott Minerd said Tuesday that extreme optimism about the global economy among political and business leaders at the World Economic Forum in Davos, Switzerland is a “valuable contra-indicator” for investors and turning him cautious.\nMinerd, who helps oversee more than $260 billion, said in a telephone interview from Davos: ”While I am still a Davos neophyte - it is only my fifth visit to Davos - I am starting to consider that Davos may be a valuable contra-indicator.\n“Optimism about global growth is disturbingly high at Davos. While I am of the opinion that the global economy is gaining momentum, I always find it discomforting when virtually everybody shares the same opinion,” he said. “My fear is that that economic optimism is spilling over into global equities, which will lead to a mania in stocks.”\nIn that regard, “We’ve been taking risk off the table” as well hedging by purchasing long-dated call options on the S&P 500 index and emerging markets, he said.\nMinerd said he purchased one-year S&P LEAPS because “the risk is that the S&P could go to 3,600 and I could underperform.”\nA staff member is seen during the World Economic Forum (WEF) annual meeting in Davos, Switzerland, January 23, 2018. REUTERS/Denis Balibouse An index call option locks in the price at which the holder of the contract can buy the value of an underlying index at a fixed time in the future.\nThere has been a pick-up in demand for buying of S&P 500 Index options in recent months as investors seek exposure to further gains, options data showed.\nDavos optimism is strong in the face of U.S. tariffs on solar panels and washing machines, a rising tide of nationalism, and an immigration debate just when healthy Western economies are starting to experience labor shortages in certain key industries, Minerd said.\nMinerd said a few years ago, the big story in Davos was about the emergence of Africa as an important component of future global growth. “While I think that view is ultimately correct, the immediate experience proved very disappointing for investors. Rather than a buying opportunity, investors would have done better to go short for the near term,” Minerd said.\n“While I am hesitant to jump to a conclusion, I‘m troubled by the euphoria undergirding the gathering here,” Minerd said. “I have seen bull market tsunamis before. They can be both rewarding and destructive.”\nAdditonal reporting by Saqib Iqbal Ahmed; Editing by Cynthia Osterman\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T03:17:00.000+02:00", "crawled": "2018-01-24T15:35:23.022+02:00", "highlightTitle": ""}