{"organizations": [], "uuid": "c8db1a92cc129c658c506b84708a1a6dd1cf3af3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-tonix-pharmaceuticals-appoints-jessica-morris-as-chief-operating-officer.html", "country": "US", "domain_rank": 767, "title": "Tonix Pharmaceuticals Appoints Jessica Morris as Chief Operating Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T15:00:00.000+02:00", "replies_count": 0, "uuid": "c8db1a92cc129c658c506b84708a1a6dd1cf3af3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-tonix-pharmaceuticals-appoints-jessica-morris-as-chief-operating-officer.html", "ord_in_thread": 0, "title": "Tonix Pharmaceuticals Appoints Jessica Morris as Chief Operating Officer", "locations": [], "entities": {"persons": [{"name": "jessica morris", "sentiment": "negative"}, {"name": "tonix", "sentiment": "none"}, {"name": "seth lederman", "sentiment": "none"}, {"name": "tonmya", "sentiment": "none"}, {"name": "morris", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "tonix", "sentiment": "none"}], "organizations": [{"name": "tonix pharmaceuticals holding corp.", "sentiment": "negative"}, {"name": "tonix pharmaceuticals", "sentiment": "negative"}, {"name": "operations", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 09, 2018 (GLOBE NEWSWIRE) -- Tonix Pharmaceuticals Holding Corp. (Nasdaq:TNXP) (Tonix), a company developing innovative pharmaceutical and biological products to address major public health challenges, today announced the appointment of Jessica Morris as Chief Operating Officer. Previously Executive Vice President of Operations, Ms. Morris brings to the senior leadership team a deep understanding of drug development and corporate strategy from her tenure at Tonix as well as over a decade of experience in the financial industry.\n“Ms. Morris’ contributions have been integral to Tonix as we have advanced and expanded our pipeline,” commented Seth Lederman, M.D., President and Chief Executive Officer of Tonix. “With the increased responsibility of this new role, Ms. Morris will perform key management functions in ensuring efficient advancement of our late-stage candidate, Tonmya®*, for which we expect to report topline data from the Phase 3 HONOR study in military-related PTSD in the fourth quarter of this year.”\nMs. Morris has served in positions of increasing responsibility at Tonix beginning in 2013. Prior to joining Tonix, Ms. Morris served in an investment management role at Zhong Rong Group, as well as at American Capital and Calvert Street Capital Partners. In addition, Ms. Morris worked in banking at Silicon Valley Bank and Deutsche Bank. Ms. Morris holds degrees in commerce and music from the University of Virginia, where she was an Echols Scholar.\n*Tonmya has been conditionally accepted by the U.S. Food and Drug Administration (FDA) as the proposed trade name for TNX-102 SL (cyclobenzaprine HCl sublingual tablets) for PTSD. TNX-102 SL is an investigational new drug and has not been approved for any indication.\nAbout Tonix Pharmaceuticals Holding Corp.\nTonix is developing innovative pharmaceutical and biological products to address major public health challenges and diseases with significant unmet needs. Tonix’s lead product candidate, Tonmya, or TNX-102 SL, is in Phase 3 development as a bedtime treatment for PTSD. Due to the unique mechanism of action of the active ingredient (TNX-102 or cyclobenzaprine hydrochloride) in Tonmya to improve sleep quality, TNX-102 SL is being developed as a bedtime treatment for agitation in Alzheimer’s disease. Tonix is planning to submit an IND for this additional indication in 1Q2018 after completing a successful pre-IND meeting with the FDA in 4Q2017. TNX-601 (tianeptine oxalate) is in the pre-IND (Investigational New Drug) application stage, also for the treatment of PTSD but designed for daytime dosing. Tonix’s lead biologic candidate, TNX-801, is a potential smallpox-preventing vaccine based on a live synthetic version of horsepox virus, currently in the pre-IND application stage.\nThis press release and further information about Tonix can be found at www.tonixpharma.com .\nForward Looking Statements\nCertain statements in this press release are forward-looking within the meaning of the Private Securities Litigation Reform Act of 1995. These statements may be identified by the use of forward-looking words such as “anticipate,” “believe,” “forecast,” “estimate,” “expect,” and “intend,” among others. These forward-looking statements are based on Tonix's current expectations and actual results could differ materially. There are a number of factors that could cause actual events to differ materially from those indicated by such forward-looking statements. These factors include, but are not limited to, substantial competition; our need for additional financing; uncertainties of patent protection and litigation; uncertainties of government or third party payor reimbursement; limited research and development efforts and dependence upon third parties; and risks related to failure to obtain FDA clearances or approvals and noncompliance with FDA regulations. As with any pharmaceutical under development, there are significant risks in the development, regulatory approval and commercialization of new products. Tonix does not undertake an obligation to update or revise any forward-looking statement. Investors should read the risk factors set forth in the Annual Report on Form 10-K for the year ended December 31, 2016, as filed with the Securities and Exchange Commission (the “SEC”) on April 13, 2017, and periodic reports filed with the SEC on or after the date thereof. All of Tonix's forward-looking statements are expressly qualified by all such risk factors and other cautionary statements. The information set forth herein speaks only as of the date thereof.\nContacts\nJessica Morris (investors)\nTonix Pharmaceuticals\ninvestor.relations@tonixpharma.com\n(212) 980-9159\nRich Allan (media)\nRusso Partners\nrich.allan@russopartnersllc.com\n(646) 942-5588\nSource:Tonix Pharmaceuticals Holding Corp.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/16aad249-3d33-4501-b3d9-118a703fa46e", "https://www.globenewswire.com/Tracker?data=eOP1MoWDRU_GVyowCAQiXrPzP1FLGxyecgURYZsWzeMtjCBk6lxOQYjPTXhnUB40aHoL5oOloars0Y-2Iq9Iv9bnBzMBIzcJ79mTitfUhiY=", "https://www.globenewswire.com/Tracker?data=ZId1C3-b6Lmf9rN-Ddl1KhwdIpsZEOn4rdkeMw-9IFS-ZkTDenQWos2T49P95ANMBStjYUJJc9w9VJtYJ66vIMAJ3M7kj63BQi8JOB0qcsriri23KPvR_cbIozlUsk9p", "https://www.globenewswire.com/Tracker?data=LA1LU-Q-TwcezNqNrjU2iu5sxJ6QngsgFsneHEOB7sqbQLU4lT1cseNmdAj36ahkQPHIlo7w4nwhgm3HC-SQEyEa-2yyxd9bxqriLB8Bq2sKkNMSEpYCQvrK_7AnPXZ-aTl_9OLRKE0uA3NGaiGgOg=="], "published": "2018-01-09T15:00:00.000+02:00", "crawled": "2018-01-09T15:28:03.000+02:00", "highlightTitle": ""}