{"organizations": [], "uuid": "0e1a6cd9289d919ddfeef8d1aa4b127b860c3bef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222011245&w=1200&r=LYNXMPEE0E00P", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-global-oil/oil-dips-away-from-2014-highs-on-rising-u-s-rig-count-but-analysts-say-market-supported-idUKKBN1F4026", "country": "US", "domain_rank": 408, "title": "Oil dips away from 2014 highs on rising U.S. rig count, but analysts say market supported", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T02:40:00.000+02:00", "replies_count": 0, "uuid": "0e1a6cd9289d919ddfeef8d1aa4b127b860c3bef"}, "author": "", "url": "https://uk.reuters.com/article/uk-global-oil/oil-dips-away-from-2014-highs-on-rising-u-s-rig-count-but-analysts-say-market-supported-idUKKBN1F4026", "ord_in_thread": 0, "title": "Oil dips away from 2014 highs on rising U.S. rig count, but analysts say market supported", "locations": [], "entities": {"persons": [{"name": "henning gloystein", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "mumbai", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "opec", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "wti", "sentiment": "none"}, {"name": "anz", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 12:41 AM / Updated an hour ago Oil hovers near three-year high despite rising U.S. output Nia Williams , Rod Nickel 3 Min Read \nCALGARY, Alberta (Reuters) - Oil hovered near a three-year high above $70 a barrel on Monday on signs that production cuts by OPEC and Russia are tightening supplies, although analysts warned of a “red flag” due to surging U.S. production. FILE PHOTO: A driver reads a newspaper as he sits on a spare tire attached to a parked oil tanker at a truck terminal in Mumbai, India, January 10, 2018. REUTERS/Shailesh Andrade/File Photo \nInternational benchmark Brent crude futures LCOc1 last traded 29 cents higher at $70.16 by 1937 GMT, having risen to a high of $70.37 a barrel earlier in the session. \nU.S. West Texas Intermediate (WTI) crude futures CLc1 gained 51 cents at $64.81 a barrel. Both benchmarks hit levels not seen since December 2014, although trading was thin due to a holiday in the United States. \nA production-cutting pact between the Organization of the Petroleum Exporting Countries, Russia and other producers has given a strong tailwind to oil prices. \nGrowing signs of a tightening market after a three-year rout have bolstered confidence among traders and analysts. \n“It’s catching a lot of people by surprise and I think (prices) are sustainable,” said Phil Flynn, an analyst at Price Futures Group. “We’re seeing the reality of strong demand and declining supplies.” \nBank of America Merrill Lynch on Monday raised its 2018 Brent price forecast to $64 a barrel from $56, forecasting a deficit of 430,000 barrels per day (bpd) in oil production compared to demand this year. \n“OPEC and non-OPEC producers remain committed to production cuts at the same time world oil demand continues to increase,” said Andrew Lipow, president of Lipow Oil Associates in Houston. \n“As we go through 2018, the market is also going to continue to look at geopolitical supply disruptions that could occur in Libya, Nigeria and Venezuela.” RED FLAG \nStill, some analysts have warned that the 13 percent rally since the start of the year could peter out due to global refinery maintenance and rising North American production. \nU.S. energy companies added 10 oil rigs in the week to Jan. 12, taking the number to 752, energy service firm Baker Hughes ( GE.N ) said on Friday. \nThat was the biggest increase since June 2017. \nIn Canada, energy firms almost doubled the number of rigs drilling for oil last week to 185, the highest level in 10 months. \nVienna-based consultancy JBC Energy expects U.S. production to grow by 600,000 bpd in the first quarter of 2018 compared to a year earlier. \n“From a fundamental perspective, the surge in U.S. managed money raises a clear red flag for us. We see the U.S. complex as decidedly bearish over the next two months.” \nBut Flynn said a fast climb in U.S. output is not so clear. \n“The realities of the shale market are starting to sink in. Shale producers have to add a lot of rigs, frack crews and add a lot of investment. It takes time to raise that production.”   Ron Bousso in London and Henning Gloystein in Singapore; Editing by Louise Heavens and Bill Trott", "external_links": [], "published": "2018-01-15T02:40:00.000+02:00", "crawled": "2018-01-15T02:55:44.003+02:00", "highlightTitle": ""}