{"organizations": [], "uuid": "3bbcbdf84915ceb1f7116fd67b437c6907c1e008", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/25/104967946-GettyImages-905796424.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10000101/device/rss/rss.html", "section_title": "Autos", "url": "https://www.cnbc.com/2018/01/25/ford-says-its-a-new-era-wall-street-isnt-buying-it.html", "country": "US", "domain_rank": 767, "title": "Ford says it’s a new era. Wall Street isn’t buying it.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T18:08:00.000+02:00", "replies_count": 0, "uuid": "3bbcbdf84915ceb1f7116fd67b437c6907c1e008"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/25/ford-says-its-a-new-era-wall-street-isnt-buying-it.html", "ord_in_thread": 0, "title": "Ford says it’s a new era. Wall Street isn’t buying it.", "locations": [], "entities": {"persons": [{"name": "jim hackett", "sentiment": "negative"}, {"name": "hackett", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}], "organizations": [{"name": "ford motor", "sentiment": "negative"}, {"name": "ford", "sentiment": "neutral"}, {"name": "standard & poor", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "steelcase", "sentiment": "none"}, {"name": "consumer electronics show", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Eight months after taking over as chief executive of Ford Motor , Jim Hackett is still trying to accomplish one of his most important tasks: convincing Wall Street that he has a compelling plan to reinvigorate the automaker.\nMr. Hackett, 62, a former chief executive of the office-furniture supplier Steelcase , has taken several shots at it. In October, he and the new team of top executives he selected appeared before financial analysts in New York to outline a plan to cut costs — improve Ford's \"fitness,\" in Mr. Hackett's words — and to accelerate development of trucks, electric cars and self-driving vehicles.\nHe pressed his case further this month before large audiences at the Consumer Electronics Show in Las Vegas and the Detroit auto show.\nBut so far investors and analysts remain uninspired. The company's stock is virtually unchanged since late September, while the Standard & Poor's 500-stock index has gained 13 percent.\nRead more from The New York Times:\nSalaried or hourly? The gaps in family-friendly policies begin to close\nWhy strong growth is a headache for the European Central Bank\nAbout that joint: Marijuana start-ups pass\n\"Ford is basically saying, 'We have a lot of inefficiencies, and it's going to take a lot of time to fix,'\" said David Whiston, a financial analyst at Morningstar. \"I thought a lot of these inefficiencies were taken care of a long time ago. It's disappointing.\"\nThe latest disappointment arrived on Wednesday, when Ford reported fourth-quarter net income of $2.4 billion, or 60 cents a share. That was an improvement over a loss in the comparable period a year ago, but its adjusted earnings were 39 cents a share, about 4 cents less than analysts expected.\nProfit fell in North America as sales slowed in the United States, and the company lost about $200 million in the rest of the world. Sales in China fell 6 percent.\nThe company forecast a decline in earnings this year, mainly as a result of rising commodity costs and unfavorable exchange rates. Ford also said it would have higher costs related to the introduction of new models — 23 are coming this year globally, compared with 11 in 2017.\n\"We need to be fitter,\" said Ford's chief financial officer, Robert L. Shanks.\nMr. Shanks told reporters that he didn't think analysts were unconvinced about Ford's turnaround plan. \"With the exception of Tesla , the market is skeptical about the sector's ability to be successful in the world that's ahead of us\" he said.\nIn a conference call, analysts pressed Mr. Hackett to talk about initiatives to improve profitability, but he declined to discuss them in detail, except to say they are \"up and running.\"\nJust a few years ago, Ford was considered the healthiest of the three Detroit automakers, having escaped the government-engineered bankruptcies that engulfed General Motors and Chrysler . With Alan Mulally as chief executive, Ford slimmed down, focused on its Ford and Lincoln brands, and roared to record profits.\nAfter Mr. Mulally retired in 2014 and passed the baton to Mark Fields, however, Ford began to drift as new technologies started reshaping the industry; as new challengers emerged in Tesla, Google and Uber; and as a revived G.M. and a merged Fiat Chrysler Automobiles provided increased competition in the high-margin business of trucks and roomy sport-utility vehicles. Its stock slumped, and Ford directors began wondering if Mr. Fields had the right strategy.\nIn May, Ford's board ousted Mr. Fields and called on Mr. Hackett, who had previously served on the board and then joined the company to run its activities in autonomous vehicles and related efforts.\nMr. Hackett took three months to dive into Ford's troubles and found that Ford was spending too much time and money developing new vehicles, and that costs for steel, other materials and components were rising. His prescription called for Ford to refocus investments on growing markets like China and highly profitable vehicles like trucks and S.U.V.s, while cutting back on initiatives in less promising areas like Europe and passenger cars.\n\"We are intensely focusing on fixing the fundamental health of our company,\" Mr. Hackett said on Wednesday.\nTo ensure that Ford will be a player down the road, the company is also ramping up plans to introduce 40 electrified vehicles by 2022 and a driverless car for taxi fleets, ride-hailing services and delivery companies by 2021.\nAt the Detroit show, Ford said it planned to spend $11 billion on electric vehicles by 2022.\nBut neither the plan nor Mr. Hackett himself has generated much excitement. His appearance in Las Vegas, where Mr. Mulally shined in the past, fell flat. At a conference known for gee-whiz demonstrations of new technologies, Mr. Hackett gave a presentation about how to rethink transportation and cities of the future.\n\"It was very philosophical,\" said Mr. Whiston, who was in the audience. \"He might be appealing to a nonautomotive audience, but financial analysts want more.\"\nMore troubling to Wall Street is that Ford's new strategy is likely to have little immediate impact on its bottom line.\nBrian Johnson, a financial analyst at Barclays , wrote in a note to clients issued before Ford reported its fourth-quarter results that \"the path ahead in shifting Ford's strategy will be rather long.\"\nG.M. has been ahead of Ford in adding trucks and S.U.V.s to its lineup. At the Detroit show, Ford unveiled a midsize pickup truck, the Ranger. G.M.'s Chevrolet and GMC brands have had midsize trucks for nearly three years.\n\"There was a really stark contrast between Ford and G.M. presentations\" given to financial analysts at the show, Mr. Whiston said. \"G.M. was all about optimism, and Ford talked about fitness and efficiency.\"", "external_links": [], "published": "2018-01-25T18:08:00.000+02:00", "crawled": "2018-01-25T18:34:54.011+02:00", "highlightTitle": ""}