{"organizations": [], "uuid": "6fb64fc7b717af70ce5cabc91a9a6fda27c3265b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-chris-lydon-and-chris-tecu-join-avison-young-in-chicago.html", "country": "US", "domain_rank": 767, "title": "Chris Lydon and Chris Tecu join Avison Young in Chicago", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.93, "site_type": "news", "published": "2018-01-10T18:00:00.000+02:00", "replies_count": 0, "uuid": "6fb64fc7b717af70ce5cabc91a9a6fda27c3265b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-chris-lydon-and-chris-tecu-join-avison-young-in-chicago.html", "ord_in_thread": 0, "title": "Chris Lydon and Chris Tecu join Avison Young in Chicago", "locations": [], "entities": {"persons": [{"name": "chris tecu", "sentiment": "negative"}, {"name": "chris lydon", "sentiment": "negative"}, {"name": "lydon", "sentiment": "none"}, {"name": "tecu", "sentiment": "none"}, {"name": "nikitas", "sentiment": "none"}, {"name": "danny nikitas", "sentiment": "none"}, {"name": "avison young", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}, {"name": "il", "sentiment": "none"}, {"name": "rosemont", "sentiment": "none"}, {"name": "tecu", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "avison young", "sentiment": "negative"}, {"name": "avison young principal", "sentiment": "none"}, {"name": "centerpoint properties", "sentiment": "none"}, {"name": "trammell crow company", "sentiment": "none"}, {"name": "cushman & wakefield", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Highly regarded industry veterans become Principals, will work as a team while focusing on their industrial brokerage specialty\nCHICAGO, Danny Nikitas , Avison Young Principal and Managing Director of the firm's Chicago office, announced today the strategic hiring of highly regarded commercial real estate industry veterans Chris Lydon and Chris Tecu .\nEffective immediately, Lydon and Tecu become Principals of Avison Young and will work as a team while focusing on industrial brokerage services. Both will be based in the firm's Rosemont, IL office. Lydon was most recently a senior director with Cushman & Wakefield in Chicago while Tecu most recently served as a vice-president with CenterPoint Properties in Chicago. Lydon and Tecu previously worked together at Trammell Crow Company in Chicago.\n\"We're thrilled that Chris Lydon and Chris Tecu have joined us in Chicago,\" comments Nikitas. \"We have known them for many years as strong industrial brokerage professionals who have held various positions within the industrial real estate sector. Between them, they have more than 40 years of experience, and their reputations are impeccable in the industry. They are known for honest and intelligent representation of their clients, and have elevated themselves to a very high level of respect in our business. They will also enhance our capital markets capabilities with their experience on the investment side.\"\nNikitas adds: \"Their move to Avison Young is actually a reunion because they previously worked together at another firm. Both have adopted a collaborative approach to each transaction and, therefore, will fit seamlessly into Avison Young's culture and client-first business model. They will also play important roles as we expand our industrial service line throughout Chicagoland and further Avison Young's ongoing expansion program.\"\nLydon brings 25 years of industry experience to Avison Young. During his career, he has been involved in transactions covering more than 100 million square feet (msf) with an aggregate value in excess of $950 million. A consistent top producer, he has represented institutional owners and users on both a local and national level while serving in the roles of broker, owner and developer.\nLydon's past and current clients include Sears Holding Corporation, Seefried Properties, Liberty Property Trust, Panattoni Development, Wirtz Realty Corp., Invesco, 3D Exhibits, Prologis and Morgan Stanley, among others.\nPrior to joining Cushman & Wakefield, Lydon was a senior vice-president and industrial brokerage leader at Grubb & Ellis Company in Chicago. Before moving to Grubb & Ellis, he was a vice-president and marketing director at AMB Property Corporation, where he oversaw the leasing of the company's 14-msf Chicago industrial-building portfolio. He began his career as a vice-president with Trammell Crow Company, providing brokerage services and brokerage management for the Chicago-area office's industrial brokerage division while working in partnership with Tecu.\nLydon is a member of the Society of Industrial and Office Realtors (SIOR) and the Chicago chapter of the Association of Industrial Real Estate Brokers (AIRE).\n\"We look forward to our new venture here at Avison Young, and to leveraging the company's full-service platform,\" notes Lydon. \"The Principal-based ownership model was highly attractive to us, as it allows us to participate in the company's overall decision-making process. We were very familiar with some of the existing industrial brokerage professionals and felt that we shared a similar vision in relation to the overall industry. The client-first attitude that exists at Avison Young will continue to be our emphasis moving forward.\"\nTecu brings 19 years of commercial real estate experience to Avison Young. During his career, he has negotiated more than 80 msf of industrial real estate acquisitions, dispositions and leasing transactions. From 2010 to 2017, he managed CenterPoint Properties' acquisitions in the Gulf Coast region, particularly in the Houston marketplace. From 2008 to 2017, he was responsible for the purchase of more than $1 billion of industrial properties nationally. Prior to joining CenterPoint in 2008, Tecu was an industrial broker in the O'Hare submarket for CBRE. He entered the commercial real estate industry in 1999 with Trammell Crow Company in Chicago, where he originally partnered with Lydon.\nTecu's past and current clients include AMB, Prologis, CenterPoint, Duke Realty, First Industrial Realty Trust and Sitex Realty Group. He is an active member of NAIOP and AIRE. He holds a bachelor's degree in business from the University of Kansas.\nTecu adds: \"We feel that the in-house resources here at Avison Young will enable us to even better service existing customers and help us expand our client base. There seems to be great entrepreneurial spirit within the firm, and we look forward to continuing with the overall collaboration within the industrial brokerage group. The firm is in a global growth mode and we are pleased to be part of its expansion here in Chicago. We look forward to collaborating with our new colleagues across the globe while serving local, national and international clients.\"\nOver the past nine years, Avison Young has grown from 11 to 82 offices and from 300 to more than 2,600 real estate professionals in Canada, the U.S., Mexico and Europe.\nAvison Young is the world's fastest-growing commercial real estate services firm. Headquartered in Toronto, Canada, Avison Young is a collaborative, global firm owned and operated by its principals. Founded in 1978, the company comprises 2,600 real estate professionals in 82 offices, providing value-added, client-centric investment sales, leasing, advisory, management, financing and mortgage placement services to owners and occupiers of office, retail, industrial, multi-family and hospitality properties.\nFor further information/comment/photos:\nSherry Quan , Principal, Global Director of Communications & Media Relations,\nAvison Young: 604.647.5098; cell: 604.726.0959 sherry.quan@avisonyoung.com\nDanny Nikitas , Principal and Managing Director, Chicago, Avison Young: 312.940.8797\ndanny.nikitas@avisonyoung.com\nChris Lydon , Principal, Avison Young: 847.232.8610 chris.lydon@avisonyoung.com\nChris Tecu , Principal, Avison Young: 847.232.8611 chris.tecu@avisonyoung.com\nEarl Webb , President, U.S. Operations, Avison Young: 312.957.7610\nMark Rose, Chair and CEO, Avison Young: 416.673.4028\nwww.avisonyoung.com\nAvison Young was a winner of Canada's Best Managed Companies program in 2011 and requalified in 2017 to maintain its status as a Best Managed Gold Standard company.\nFollow Avison Young on Twitter:\nFor industry news, press releases and market reports: www.twitter.com/avisonyoung For Avison Young listings and deals: www.twitter.com/AYListingsDeals\nFollow Avison Young Bloggers : http://blog.avisonyoung.com\nFollow Avison Young on LinkedIn : www.linkedin.com/company/avison-young-commercial-real-estate\nFollow Avison Young on YouTube : www.youtube.com/user/AvisonYoungRE\nFollow Avison Young on Instagram: www.instagram.com/avison_young_global\nEditors/Reporters\nPlease click on links to view and download photos of Chris Lydon and Chris Tecu:\nhttp://www.avisonyoung.com/documents/20342/2631393/Chris_Lydon.jpg\nhttp://www.avisonyoung.com/documents/20342/2631393/Chris_Tecu.jpg\nSOURCE Avison Young Commercial Real Estate (BC)", "external_links": ["http://blog.avisonyoung.com/", "http://www.twitter.com/avisonyoung", "http://www.linkedin.com/company/avison-young-commercial-real-estate", "http://www.avisonyoung.com/", "http://www.youtube.com/user/AvisonYoungRE", "http://www.twitter.com/AYListingsDeals", "http://www.instagram.com/avison_young_global"], "published": "2018-01-10T18:00:00.000+02:00", "crawled": "2018-01-10T18:39:29.000+02:00", "highlightTitle": ""}