{"organizations": [], "uuid": "965d77bb0c837cfed6a1f114132e9c27d2015152", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "http://fashioniawalk.com/wp-content/uploads/2018/01/104134968-GettyImages-159980335.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/dont-count-insurers-out-yet-after-amazon-berkshire-jp-morgan-move.html/", "country": "US", "domain_rank": 767, "title": "Don't count insurers out yet after Amazon-Berkshire-JP Morgan moveFashionia Walk | Fashionia Walk", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.18, "site_type": "news", "published": "2018-01-10T02:00:00.000+02:00", "replies_count": 0, "uuid": "965d77bb0c837cfed6a1f114132e9c27d2015152"}, "author": "", "url": "https://www.cnbc.com/2018/01/30/dont-count-insurers-out-yet-after-amazon-berkshire-jp-morgan-move.html/", "ord_in_thread": 0, "title": "Don't count insurers out yet after Amazon-Berkshire-JP Morgan moveFashionia Walk | Fashionia Walk", "locations": [], "entities": {"persons": [{"name": "berkshire hathaway", "sentiment": "negative"}, {"name": "p. morgan", "sentiment": "none"}, {"name": "niall brennan", "sentiment": "none"}], "locations": [{"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "fashionia walk", "sentiment": "negative"}, {"name": "aetna", "sentiment": "none"}, {"name": "health care cost institute", "sentiment": "none"}, {"name": "cvs health", "sentiment": "none"}, {"name": "cigna", "sentiment": "none"}, {"name": "anthem", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "unitedhealth", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 13 \nCalling health-care costs a hungry tapeworm on the economy, Amazon , Berkshire Hathaway and J.P. Morgan say they are joining forces to try to simplify their employee benefits using technology make for a better health-care experience and to drive down costs. \nThe news hit like a shot across the bow of health insurers, sending shares of Cigna , Anthem , UnitedHealth and Aetna tumbling. Pharmacy benefit management firms Express Scripts and CVS Health also fell on the news. \n“I think particularly with Amazon in play, it reflects an almost evangelical faith people have that they can disrupt established business problems in the way that they’ve done in many other industries,” said Niall Brennan, president of the Health Care Cost Institute, while cautioning that the market may have overreacted. \n“Employers have been trying and struggling to do this for 20, 30 or more years with … unfortunately, limited success,” he said. “I really applaud it and I couldn’t be more supportive, but we really need to see a lot more details beyond a press release.” \nWhat could make this effort different from other employer cost-cutting initiatives is that the firms are coming together to form a not-for-profit company to try to leverage the companies’ market power; combined the trio have more than half a million U.S. employees. \nThe question is whether the venture will try to do that by knocking out the middlemen who negotiate hospital networks and prices, and pharmacy benefit contracts with drugmakers. \n“I think that those who are selling their shares in health-care stocks are reading this all wrong,” said Jim Klein, American Benefits Council president. “The middlemen here have an interest that is aligned with employers. They are the intermediaries with the health-care providers. The main problem with health care these days … is that cost and quality are not aligned.” \nA number of health-care firms hailed the news, saying they want to be on board. \nAetna and CVS — which have announced a $69 billion deal to merge their insurance and pharmacy into an integrated health clinic service — both said they welcome the chance to help the firms with the new venture. \n“There is an unmet consumer need in health care. Individuals and families want a simple, affordable and high-quality experience that helps them stay well,” said Aetna CEO Mark Bertolini in a statement, adding “I am encouraged to see other companies working toward the same goal.” \nPharmacy benefit firm Express Scripts said in a statement, “Today’s announcement by Amazon, J.P. Morgan Chase, and Berkshire Hathaway is clear recognition that the healthcare system needs to continue to create and deliver meaningful value to payers and patients … We look forward to hearing more about this new initiative and how we can work together to improve health care for everyone.” \nUntil now the fear has been that Amazon would enter health care as a competitor to these services, but combining with other employers would still put the tech giant in a position to exert tremendous pricing pressure on health care. \n“The best results that we’ve seen have come from jumbo employer efforts — from them either teaming together or doing pilot projects on their own to prove that something is a good idea and then everybody else gets in line and adopts similar approaches,” said Tracy Watts, senior partner at benefit consulting firm Mercer. \nIt’s not clear how soon Amazon, Berkshire and J.P. Morgan’s new health-care venture would launch, but with tech giants like Apple and Google also increasingly focused on health-care, current players in the industry have to brace for continuing disruption. \n“This puts the market on notice,” said Watts. ", "external_links": [], "published": "2018-01-10T02:00:00.000+02:00", "crawled": "2018-01-31T01:06:35.029+02:00", "highlightTitle": ""}