{"organizations": [], "uuid": "b7a37c74bc90a8f24cc353afec66a365480e4262", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-hanmi-financial-increases-quarterly-cash-dividend-by-14-percent.html", "country": "US", "domain_rank": 767, "title": "Hanmi Financial Increases Quarterly Cash Dividend By 14%", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T17:00:00.000+02:00", "replies_count": 0, "uuid": "b7a37c74bc90a8f24cc353afec66a365480e4262"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-hanmi-financial-increases-quarterly-cash-dividend-by-14-percent.html", "ord_in_thread": 0, "title": "Hanmi Financial Increases Quarterly Cash Dividend By 14%", "locations": [], "entities": {"persons": [{"name": "c. g. kum", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "hanmi", "sentiment": "negative"}, {"name": "hanmi financial corporation", "sentiment": "negative"}, {"name": "hanmi bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES, Hanmi Financial Corporation (NASDAQ:HAFC) (“Hanmi” or “the Bank”), the holding company for Hanmi Bank, today announced that its Board of Directors declared a cash dividend on its common stock for the 2018 first quarter of $0.24 per share, up 14.3% from $0.21 per share in the prior quarter. The dividend will be paid on February 23, 2018 to stockholders of record as of the close of business on February 5, 2018.\n“I am pleased to announce this increase in our quarterly dividend, which is one of the benefits of Hanmi’s strong financial performance and the passage of the Tax Cuts and Jobs Act that significantly enhances the earnings power of the Company,” said Mr. C. G. Kum, President and Chief Executive Officer. “For the first quarter of 2018, shareholders will enjoy a 14% increase in the quarterly dividend, which brings our annualized dividend yield to 3.02% based on yesterday’s closing stock of $31.75. The Board of Directors is committed to rewarding Hanmi’s loyal shareholders and remains confident in our ability to continue generating profitable growth in 2018 and beyond.”\nAbout Hanmi Financial Corporation\nHeadquartered in Los Angeles, California, Hanmi Financial Corporation owns Hanmi Bank, which serves multi-ethnic communities through its network of 40 full-service branches and 8 loan production offices in California, Texas, Illinois, Virginia, New Jersey, New York, Colorado, Washington and Georgia. Hanmi Bank specializes in real estate, commercial, SBA and trade finance lending to small and middle market businesses. Additional information is available at www.hanmi.com .\nForward-Looking Statements\nThis press release contains forward-looking statements, which are included in accordance with the “safe harbor” provisions of the Private Securities Litigation Reform Act of 1995. In some cases, you can identify forward-looking statements by terminology such as “may,” “will,” “should,” “could,” “expects,” “plans,” “intends,” “anticipates,” “believes,” “estimates,” “predicts,” “potential,” or “continue,” or the negative of such terms and other comparable terminology. Although we believe that the expectations reflected in the forward-looking statements are reasonable, we cannot guarantee future results, levels of activity, performance or achievements. All statements other than statements of historical fact are “forward–looking statements” for purposes of federal and state securities laws, including, but not limited to, statements about anticipated future operating and financial performance, financial position and liquidity, business strategies, regulatory and competitive outlook, investment and expenditure plans, capital and financing needs and availability, plans and objectives of management for future operations, developments regarding our capital plans, strategic alternatives for a possible business combination, merger or sale transaction, and other similar forecasts and statements of expectation and statements of assumption underlying any of the foregoing. These statements involve known and unknown risks, uncertainties and other factors that may cause our actual results, levels of activity, performance or achievements to differ from those expressed or implied by the forward-looking statement. These factors include the following: failure to maintain adequate levels of capital and liquidity to support our operations; the effect of potential future supervisory action against us or Hanmi Bank; general economic and business conditions internationally, nationally and in those areas in which we operate; volatility and deterioration in the credit and equity markets; changes in consumer spending, borrowing and savings habits; availability of capital from private and government sources; demographic changes; competition for loans and deposits and failure to attract or retain loans and deposits; fluctuations in interest rates and a decline in the level of our interest rate spread; risks of natural disasters related to our real estate portfolio; risks associated with Small Business Administration loans; failure to attract or retain key employees; changes in governmental regulation, including, but not limited to, any increase in FDIC insurance premiums; ability of Hanmi Bank to make distributions to Hanmi Financial Corporation, which is restricted by certain factors, including Hanmi Bank’s retained earnings, net income, prior distributions made, and certain other financial tests; ability to identify a suitable strategic partner or to consummate a strategic transaction; adequacy of our allowance for loan and lease losses; credit quality and the effect of credit quality on our provision for loan and lease losses and allowance for loan and lease losses; changes in the financial performance and/or condition of our borrowers and the ability of our borrowers to perform under the terms of their loans and other terms of credit agreements; our ability to control expenses; and changes in securities markets. In addition, we set forth certain risks in our reports filed with the U.S. Securities and Exchange Commission, including, Item 1A of our Annual Report on Form 10-K for the year ended December 31, 2016, our Quarterly Reports on Form 10-Q, and Current Reports on Form 8-K that we will file hereafter, which could cause actual results to differ from those projected. We undertake no obligation to update such forward-looking statements except as required by law.\nInvestor Contacts:\nRomolo (Ron) Santarosa\nSenior Executive Vice President & Chief Financial Officer\n213-427-5636\nRichard Pimentel\nSenior Vice President & Corporate Finance Officer\n213-427-3191\nLasse Glassen\nInvestor Relations\nAddo Investor Relations\n424-238-6249\nSource:Hanmi Bank", "external_links": ["https://www.globenewswire.com/Tracker?data=i4DIZ28vPqJHZaEn3SkKXIFP_OtVSx9y3l41d8TquJ9AXIJumaEMx4xk7bZsx8hppoP1WofvQ6z5HagWh8jB-g==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/fd788159-17a0-4bee-87f9-bbac8cb2cf0d"], "published": "2018-01-25T17:00:00.000+02:00", "crawled": "2018-01-25T18:33:26.062+02:00", "highlightTitle": ""}