{"organizations": [], "uuid": "137a2967e37f7a1bd252efb2a5eb085c112c8946", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-steve-stagner-to-be-appointed-ceo-of-mattress-firm.html", "country": "US", "domain_rank": 767, "title": "Steve Stagner to be Appointed CEO of Mattress Firm", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T02:06:00.000+02:00", "replies_count": 0, "uuid": "137a2967e37f7a1bd252efb2a5eb085c112c8946"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-steve-stagner-to-be-appointed-ceo-of-mattress-firm.html", "ord_in_thread": 0, "title": "Steve Stagner to be Appointed CEO of Mattress Firm", "locations": [], "entities": {"persons": [{"name": "steve stagner", "sentiment": "negative"}, {"name": "ken", "sentiment": "none"}, {"name": "stagner", "sentiment": "none"}, {"name": "ken murphy", "sentiment": "none"}, {"name": "murphy", "sentiment": "none"}], "locations": [{"name": "houston", "sentiment": "none"}], "organizations": [{"name": "mattress firm, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON, Jan. 26, 2018 /PRNewswire/ -- Mattress Firm, Inc., the nation's largest specialty mattress retailer, today announced that Ken Murphy will step down as CEO and President and Steve Stagner, Executive Chairman and Chairman of the Board, will assume the additional responsibilities of CEO effective March 1. The joint decision by Mr. Murphy and the Board of Directors reflects the need for a singular voice of leadership for the Company as it navigates the next phase of its growth story.\n\"Ken has been an integral part of growing our company, and we are forever grateful for his incredible 20-year impact. His charismatic leadership style has contributed greatly to our culture at Mattress Firm and has inspired our entrepreneurial zeal for many years and he will be dearly missed,\" said Mr. Stagner. \"We are now in a new phase of our development as the first and only coast-to-coast mattress specialty retailer. We will look to our experienced leadership team to build on our platform of unique business assets to win at retail, leverage our scale to bring unparalleled value to the customer, and navigate the current environment.\"\nMr. Stagner, who has been with Mattress Firm for more than 20 years and served as CEO from February 2010 to March 2016 will assume direct leadership of operations of the Company. He guided the Company through the \"Great Recession\" in 2008 and 2009, and oversaw Mattress Firm's successful initial public offering in 2011. Additionally, he led the Company through periods of rapid growth, driving the Company from $400 million in sales to over $3 billion today. Mr. Stagner has extensive experience in the bedding industry, including employment with mattress manufacturers Sealy Corporation and Simmons Bedding Company, as well as owning and operating the largest franchisee in the Mattress Firm network prior to joining the corporate office in 2005.\n\"Being part of this company has been one of the greatest privileges of my life. I am confident in the future of Mattress Firm and bringing Steve back as CEO is the right thing to do for the next chapter of the business. It's bittersweet to step down, but I am incredibly proud of the success we have built together,\" Mr. Murphy said.\nAbout Mattress Firm\nFounded in 1986, Houston-based Mattress Firm is the nation's first and only border-to-border, coast-to-coast specialty bedding retailer. With over $3 billion in annual sales through over 3,300 stores across 49 states and multiple online sites, Mattress Firm offers a broad selection of mattresses and bedding accessories from leading manufacturers and brand names, including Serta, Simmons, Dream Bed, tulo, Sleepy's and Hampton & Rhodes. In 2016, Mattress Firm was acquired by Steinhoff International Holdings N.V. and currently operates as a subsidiary of Steinhoff.\nView original content with multimedia: http://www.prnewswire.com/news-releases/steve-stagner-to-be-appointed-ceo-of-mattress-firm-300589150.html\nSOURCE Mattress Firm", "external_links": ["http://www.prnewswire.com/news-releases/steve-stagner-to-be-appointed-ceo-of-mattress-firm-300589150.html"], "published": "2018-01-27T02:06:00.000+02:00", "crawled": "2018-01-27T03:53:36.000+02:00", "highlightTitle": ""}