{"organizations": [], "uuid": "ee5f4672d04e7ac2cc3ae24e0dce2bf960ab6826", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/project-linda.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/09/razers-project-linda-phone-laptop/", "country": "US", "domain_rank": 1196, "title": "Razer: Project Linda Tries To Revive Smartphone-Laptop Hybrid | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.598, "site_type": "news", "published": "2018-01-09T02:00:00.000+02:00", "replies_count": 0, "uuid": "ee5f4672d04e7ac2cc3ae24e0dce2bf960ab6826"}, "author": "Aaron Pressman", "url": "http://fortune.com/2018/01/09/razers-project-linda-phone-laptop/", "ord_in_thread": 0, "title": "Razer: Project Linda Tries To Revive Smartphone-Laptop Hybrid | Fortune", "locations": [], "entities": {"persons": [{"name": "aaron pressman", "sentiment": "negative"}, {"name": "razer", "sentiment": "negative"}, {"name": "linda", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "google", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Aaron Pressman January 9, 2018 \nVideo gaming specialist Razer grabbed the gadget world’s attention at CES on Tuesday with a prototype phone-laptop hybrid dubbed the Project Linda Concept. \nOn first glance, the Linda appears to be a stylish if common-looking 13-inch laptop. But below the keyboard, where the trackpad would typically be, is an open compartment that is just the right size to fit the new Razer phone. \nThe laptop unit itself has no processor or other key computing components. It’s just a screen with an attached keyboard and battery. But slide the Razer phone in and the device becomes, in essence, a laptop running Google’s Android software. \n“Imagine a future where the power of the Razer phone merges seamlessly with the versatility of an ultra-portable laptop…the best of both worlds,” Razer’s narrator opines in a promotional video, bragging that the hybrid offers a much larger screen for mobile gaming and a quality keyboard for getting work done in mobile apps. \nIt all looks pretty sexy in the video, but Project Linda isn’t an actual product yet. There’s no word on pricing or availability, or even whether Razer actually will turn the concept into a real product. \nGet Data Sheet , Fortune’s technology newsletter. \nThe Linda tease comes a few weeks after Razer’s well-reviewed first effort with a smartphone. The all-black phone with the company’s three-headed snake logo matches Razer’s laptops and PCs. The 5.7-inch screen has a faster refresh rate than most phones, making games look better. \nBut Razer has a mixed record on CES prototypes like Project Linda. Last year it showed off a triple-screen gaming laptop called Project Valerie that never made it to market. Neither did the futuristic modular desktop PC called Project Christine from a few years ago. Then again, the gaming-oriented Windows tablet called Project Fiona unveiled in 2012 did become a real, if short-lived, product sold as the Razer Edge. \nThe other hurdle for Project Linda is the long and unhappy history of phone-laptop hybrids. Going back to CES in 2011, Motorola introduced a similar screen, keyboard and battery add-on for some of its smartphones dubbed the Atrix Lapdock . Created before Motorola was acquired by Google (googl) and then Lenovo, the lapdock was killed within two years due to a lack of sales. Limited functionality and a $500 price tag probably hurt adoption. \nOver the next few years, Microsoft (msft) and Linux distributor Canonical tried to come up with new variations on the hybrid concept, but without much success . Last year, Samsung took a swing at a slightly different hybrid, creating a module called Dex to connect a Galaxy S8 smartphone to a full size monitor, keyboard, and mouse. That doesn’t seem to have lit the world on fire, either, though now Huawei is rumored to be working on a similar device. \nThe bottom line for Project Linda may be that there just isn’t much of a market for a hybrid device that, at three pounds, weighs about the same as a full-powered laptop. And with most files stored in the cloud, it’s easy to access them on a phone or a laptop without needing to the old-fashioned syncing features of yesteryear. Plus there are all the mobile software apps that don’t easily adapt to running on a bigger screen. With all the compromises, it’s hardly the “best of both worlds.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-09T02:00:00.000+02:00", "crawled": "2018-01-10T09:20:33.020+02:00", "highlightTitle": ""}