{"organizations": [], "uuid": "85d1be2c8034f301b1b6ad03e9c987ea6a507ada", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-everi-appoints-harper-ko-executive-vice-president-chief-legal-officer-a-general-counsel.html", "country": "US", "domain_rank": 767, "title": "Everi Appoints Harper Ko, Executive Vice President, Chief Legal Officer – General Counsel", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T19:30:00.000+02:00", "replies_count": 0, "uuid": "85d1be2c8034f301b1b6ad03e9c987ea6a507ada"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-everi-appoints-harper-ko-executive-vice-president-chief-legal-officer-a-general-counsel.html", "ord_in_thread": 0, "title": "Everi Appoints Harper Ko, Executive Vice President, Chief Legal Officer – General Counsel", "locations": [], "entities": {"persons": [{"name": "everi appoints harper ko", "sentiment": "negative"}, {"name": "ko", "sentiment": "none"}, {"name": "everi", "sentiment": "none"}, {"name": "harper ko", "sentiment": "none"}], "locations": [{"name": "las vegas", "sentiment": "none"}], "organizations": [{"name": "everi holdings inc.", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "gaming for scientific games corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LAS VEGAS, Jan. 16, 2018 (GLOBE NEWSWIRE) -- Everi Holdings Inc. (NYSE:EVRI) (“Everi” or the “Company”), the casino gaming industry’s single source provider of gaming products and payments solutions announced today the appointment of Harper Ko as Executive Vice President, Chief Legal Officer – General Counsel, effective immediately.\nMs. Ko, who has direct responsibility for all of Everi’s legal and regulatory compliance affairs, brings to the Company extensive expertise in the casino gaming industry with over 17 years of corporate legal and regulatory compliance experience on behalf of gaming equipment suppliers and casino operators. She most recently served as Deputy General Counsel, Gaming for Scientific Games Corporation, a $2.9 billion gaming and lottery equipment and services supplier. During her time in this position from November 2014 – December 2017, Ms. Ko led a team of attorneys and related administrative staff with a wide responsibility for all commercial revenue matters within its global Gaming and Interactive business units. In her role as Deputy General Counsel, Gaming, Ms. Ko served as a strategic advisor to their Gaming unit executive management team for all commercial matters including material commercial transactions, customer and third-party matters, and regulatory compliance and litigation matters. She joined Scientific Games following its acquisition of Bally Gaming, Inc. in November 2014 where she served as Assistant General Counsel beginning in November 2007. Prior to that Ms. Ko was a Contract Attorney with Harrah’s Operating Company and Associate Corporate Counsel for Aristocrat Technologies, Inc. Ms. Ko began her career in the gaming industry as Staff Counsel for WMS Gaming Inc. from May 2000 to August 2004.\nMichael Rumbolz, President and Chief Executive Officer of Everi, commented, “Harper brings to our executive team a deep knowledge and expertise of the gaming industry’s unique regulatory and compliance issues as well as a significant track record of success in helping to foster commercial relationships with customers and vendors. Harper possesses the ideal skill set to help Everi shape strategies to address the industry’s complex legal and regulatory environment. We are pleased to have attracted a general counsel with Harper’s level of expertise, experience and accomplishments and we look forward to the benefit of her counsel and contributions.”\nHarper Ko commented on her appointment, “I was attracted to Everi and the opportunities for continued growth in its Games and Payments segments as well as its commitment to integrity in its business practices. I look forward to working with Mike and the entire Everi team as we continue to execute on our strategic priorities.”\nMs. Ko holds a J.D. from Chicago-Kent College of Law, and a B.S. in Psychology as a Natural Science from the University of Michigan. She is a Board Member at Project 150, a 501(c)3 non-profit charitable organization committed to helping over 2,500 students in 45 high schools across Las Vegas and a member of the Executive Leadership Committee for the Go Red for Women, American Heart Association. Ms. Ko previously served as an Officer (co-General Counsel, Vice President) of the Association of Gaming Equipment Manufacturers, and was honored with the Rising Star Award by Great Women in Gaming.\nAbout Everi\nEveri is dedicated to providing video and mechanical reel gaming content and technology solutions, integrated gaming payments solutions and compliance and efficiency software to casino operators. Everi Games provides: (a) comprehensive content, electronic gaming units and systems for Native American and commercial casinos, including both Wide-Area Progressive systems and the award winning TournEvent® slot tournament solution; and (b) the central determinant system for the video lottery terminals installed in the State of New York. Everi Payments provides: (a) access to cash at gaming facilities via Automated Teller Machine cash withdrawals, credit card cash access transactions, point of sale debit card transactions, and check verification and warranty services; (b) fully integrated gaming industry kiosks that provide cash access and related services; (c) products and services that improve credit decision making, automate cashier operations and enhance patron marketing activities for gaming establishments; (d) compliance, audit and data solutions; and (e) online payment processing solutions for gaming operators in states that offer intrastate, Internet-based gaming and lottery activities.\nContacts\nInvestor Relations\nRichard Land, James Leahy\nJCIR\n212-835-8500 or evri@jcir.com\nSource:Everi Holdings Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/42de8334-51c0-4656-93a5-385c60613f53"], "published": "2018-01-16T19:30:00.000+02:00", "crawled": "2018-01-16T21:12:17.012+02:00", "highlightTitle": ""}