{"organizations": [], "uuid": "aea4d33287346e2574cb474e33267433b7fd9894", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-wowio-inc-acquires-lodgenuity-inc.html", "country": "US", "domain_rank": 767, "title": "Wowio, Inc. Acquires Lodgenuity, Inc.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.056, "site_type": "news", "published": "2018-01-25T14:35:00.000+02:00", "replies_count": 0, "uuid": "aea4d33287346e2574cb474e33267433b7fd9894"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-wowio-inc-acquires-lodgenuity-inc.html", "ord_in_thread": 0, "title": "Wowio, Inc. Acquires Lodgenuity, Inc.", "locations": [], "entities": {"persons": [{"name": "tony anish", "sentiment": "none"}], "locations": [{"name": "mesa", "sentiment": "none"}, {"name": "lodgenuity", "sentiment": "none"}, {"name": "ca", "sentiment": "none"}], "organizations": [{"name": "hotel management and consulting cos", "sentiment": "negative"}, {"name": "acquires lodgenuity, inc", "sentiment": "neutral"}, {"name": "wowio, inc", "sentiment": "neutral"}, {"name": "lodgenuity, inc.", "sentiment": "none"}, {"name": "wowio, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Lodgenuity Brings Vast Experience in Hospitality, Restaurant and Hotel Management and Consulting\nCosta Mesa, CA, Jan. 25, 2018 (GLOBE NEWSWIRE) -- Wowio, Inc. (OTC Pink: WWIO) “Wowio, WWIO or The Company” has entered into a Letter of Intent to acquire 100% of Lodgenuity, Inc. ( www.lodgenuity.com ).\nLodgenuity provides market research, HR policies and procedures, oversees day to day operations, establishes maintenance programs and generally provides thorough analysis and implementation of critical best practice procedures for restaurants, hotels and other service businesses.\nTony Anish, CEO of Wowio, Inc., stated, “We are developing a strategy to grow our business and the team at Lodgenuity will assist us in our strategy to manage our restaurant locations and help us develop the procedures so that in the near future we can consider franchising our restaurant concepts. Our next step is to build our real estate side of our business and we expect to announce more growth opportunities very soon. Keep watching, our new website www.wowioinc.com will be ready very soon and follow us on twitter @WOWIOinc”.\nWOWIO recently announced the signed letter of Intent for the acquisition of “Little Italy” Restaurant in Arizona – this concept will be the first one to benefit from the expertise of the management team at Lodgenuity. Wowio looks forward to growing that brand and analyzing opportunities to grow additional concepts within its new strategic direction.\nAbout Wowio, Inc.\nWOWIO, Inc. has, historically, operated a digital media and technology development company with a patented process and a proprietary mobile ad-delivery platform that planned to disrupt the eBook distribution landscape by exploiting a previously untapped marketplace: ad-supported eBooks.\nHowever, with the introduction of the new management team, WWIO will be a holding company supporting a number of investments in entertainment, restaurants, tourism, hospitality and other businesses including homebuilding in Northern California and the real estate development in Arizona.\nSafe Harbor and Informational Statement\nThis press release may contain forward-looking information within the meaning of Section 21E of the Security Exchange Act of 1934, as amended (the Exchange Act), including all statements that are not statement of historical fact regarding the intent, belief or current expectations of the company, its directors or its officers with respect to, among other things: (i) the company's financing plans; (ii) trends affecting the company's financial conditions or results of operations; (iii): the company's growth strategy and operating strategy; and (iv) the declaration and payment of dividends.\nThe words \"may\", \"would\", \"will\", \"expect\", \"estimate\", \"anticipate\", \"believe\", \"intend\", and similar expressions and variations thereof are intended to identify forward-looking statements. Investors are cautioned that any such forward-looking statement are not a guarantee of future of future performance and involve risks and uncertainties, many of which are beyond the company's ability to control, and that actual results may differ materially from those projected in the forward-looking statements as a result of various factors including the risk disclosed in the company's statements and reports filed with the OTC Markets. The Company claims the safe harbor provided by Section 21E(c) of the Exchange Act for all forward-looking statements.\nFor more information contact Anthony L. Anish info@wowioinc.com www.wowioinc.com twitter: @WOWIOinc\nSource:Wowio, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=EMocWYW4m2kb8ZjqYP8UxGdaroWjz5CdyE5HYqkUJfKfk8R0aUgNY8WAmjssDHoPSNoGdRrYXSfymHwQqGSc2w==", "https://www.globenewswire.com/Tracker?data=kw9ioPCe5XJWteHOjtzjqpd9AwdslPODxuKndXXp-1Hnu-YB1vxv7RaqufvxZZD_i-yaOFjw36agi6MzAjzkGrA1HN1EZ7bshrxjBC6x9VU=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/b6d6517c-e9fe-4a36-b61c-706e866af3de"], "published": "2018-01-25T14:35:00.000+02:00", "crawled": "2018-01-25T14:22:42.000+02:00", "highlightTitle": ""}