{"organizations": [], "uuid": "c43c9dd6744b29798b18ae38c6acee8aab2c9907", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XC462_3bwkm_TOP_20180122034608.jpg", "site_section": "http://www.wsj.com/xml/rss/3_7031.xml", "section_title": "WSJ.com: Markets", "url": "https://www.wsj.com/articles/chinese-banks-sudden-strategy-shift-isnt-risk-free-1516617591", "country": "US", "domain_rank": 387, "title": "Chinese Banks’ Sudden Strategy Shift Isn’t Risk-Free - WSJ", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T12:39:00.000+02:00", "replies_count": 0, "uuid": "c43c9dd6744b29798b18ae38c6acee8aab2c9907"}, "author": "Anjani Trivedi", "url": "https://www.wsj.com/articles/chinese-banks-sudden-strategy-shift-isnt-risk-free-1516617591", "ord_in_thread": 0, "title": "Chinese Banks’ Sudden Strategy Shift Isn’t Risk-Free - WSJ", "locations": [], "entities": {"persons": [{"name": "ping an bank shareh", "sentiment": "none"}], "locations": [{"name": "beijing", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "wsj", "sentiment": "negative"}, {"name": "ping an bank", "sentiment": "none"}, {"name": "ping an insurance", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "1 COMMENTS The riskiest Chinese banks have found a new wheeze—lend more to big-spending Chinese consumers.\nAs Beijing ramps up scrutiny of the financial sector , midtier banks have turned away from activities like seemingly indiscriminate lending and shadow banking—now frowned upon— to retail lending, handing out piles of credit cards and nonmortgage loans .\nTake Shenzhen-listed Ping An Bank , a subsidiary of Ping An Insurance 601318 1.55% Group, whose 3.2 trillion yuan ($400 billion) in assets represents around 2% of the country’s banking system.\nMore than 4% of its loans are designated “special-mention” —meaning on the edge of going bad—one of the highest proportions among its Chinese peers. Both return on equity and regulatory capital have been declining , the latter to just over 8%, the lowest among China’s top banks. Its cost of funding has risen sharply , and a measure of its liquidity is near the regulatory minimum . Its insurer parent has had to inject fresh capital three times in recent years, the latest a 26 billion yuan ($4 billion) infusion last year.\nPing An Bank shareholders may need cover. Photo: Qilai Shen/Bloomberg News In desperation, new management has embraced a new strategy, turning a long-touted consumer focus into reality. Retail loans, which accounted for only about 15% of Ping An Bank ’s assets at the end 2016, had surged by the end of September to around a third of assets—and about 60% of profits before tax. Of the more than 30 million credit cards the bank has issued, a third were handed out in the first nine months of last year. Yields on its nonmortgage assets are lucrative, at around 9%.\nBut Ping An Bank’s record should cause concern. It was once notorious for its wealth-management products —the often highly leveraged investment products that Beijing is now so worried about . Now, along with its credit-card splurge, the number of unsecured cash loans typically to cash-strapped borrowers has rocketed, rising by 50% in the first nine months of 2017.\nSo far, investors don’t seem troubled: Ping An Bank trades at 1.4 times its book value, the highest among Chinese banks barring outlier China Merchants Bank . Investors should wonder whether it can make up for what’s looming in its past quite so easily and safely.\nCorrections & Amplifications\nShenzhen-listed Ping An Bank, a subsidiary of Ping An Insurance Group, has about $400 billion in assets. An earlier version of this article incorrectly stated the amount of assets in U.S. dollars.\nWrite to Anjani Trivedi at anjani.trivedi@wsj.com", "external_links": [], "published": "2018-01-22T12:39:00.000+02:00", "crawled": "2018-01-22T13:16:26.031+02:00", "highlightTitle": ""}