{"organizations": [], "uuid": "bd2e76ff499089cf8a657dbf51103e582824de3c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-hc-government-realty-trust-names-jason-d-post-vice-president-of-finance-corporate-controller.html", "country": "US", "domain_rank": 767, "title": "HC Government Realty Trust Names Jason D. Post Vice President of Finance & Corporate Controller", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T17:00:00.000+02:00", "replies_count": 0, "uuid": "bd2e76ff499089cf8a657dbf51103e582824de3c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-hc-government-realty-trust-names-jason-d-post-vice-president-of-finance-corporate-controller.html", "ord_in_thread": 0, "title": "HC Government Realty Trust Names Jason D. Post Vice President of Finance & Corporate Controller", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SARASOTA, Fla., Jan. 31, 2018 (GLOBE NEWSWIRE) --\nHC Government Realty Trust, Inc. (“HCGRT”, www.hcgovtrust.com ) today named Jason D. Post, CPA, CFE, as its new Vice President of Finance & Corporate Controller.\nBringing what we consider to be highly relevant expertise to his position, Mr. Post will be responsible for HCGRT’s financial management, including corporate accounting, regulatory and financial reporting, budgeting, as well as internal control policies, particularly as they relate to financial risk management. He will report to Edwin M. Stanton, HCGRT’s Co-founder, Director and CEO, and be based at the Company’s Sarasota, Florida headquarters.\n“Jason joins us at an inflection point in our corporate evolution, as we seek to enhance our efforts with respect to our SEC-qualified Regulation A+ offering and significantly grow our asset base,” Stanton said. “Under his direction, Jason’s prior company used the Reg A exemption as it prepared for public status. That experience, along with his substantive expertise as both a financial officer at public companies and principal of his own consultancy providing accounting, SEC financial reporting services, and tax and litigation services should be of immediate benefit to our Company.”\nPrior to joining HCGRT, Post was the Principal Financial Officer of As Seen On TV, Inc., a direct marketing company. Before that he operated Jason D. Post CPA, PA, a consulting firm offering financial and controller services for pre-IPO and listed companies. Previously he was CFO of Amacore Group, a marketer of health, life and dental insurance plans, and Zurvita, a distributor of health and wellness products. Post began his career in a series of roles of increasing responsibility at accounting firms Deloitte & Touche LLP, Cherry, Bekaert & Holland LLP, Cavanaugh & Company LLP, and Arthur Andersen LLP. He is a Certified Public Accountant as well as a Certified Fraud Examiner, and holds a Bachelor of Science degree, cum laude, from the University of South Florida.\n“HCGRT’s value proposition of achieving stable, predictable returns from a growing portfolio of single tenant buildings leased to federal government agencies is compelling to me as a financial professional. I see significant upside, a strong management team and a clear vision and strategy to build the asset base and increase stakeholder value. I am thrilled to join the Company at this exciting time in its development. I look forward to applying my skills and experience to advance the Company’s investment, acquisition and financial goals,” Post said.\nCoinciding with this announcement, Elizabeth L. Watson, CPA, who has served HCGRT as Chief Financial Officer, will be departing the Company. “Liz played an instrumental role in establishing HCGRT’s financial management infrastructure, for which we express our appreciation. All of us at HCGRT thank her and offer our best wishes as she moves on to the next opportunity,” Stanton said.\nAbout HC Government Realty Trust, Inc.\nHC Government Realty Trust, Inc. was formed in 2016 with the purpose of acquiring and operating GSA properties, which are full-faith credit obligations of the U.S. Government. GSA-leased real estate asset classes typically possess a highly stable tenant base, long-term lease structures and low risk of tenant turnover. The Company’s initial portfolio consists of U.S. Government tenant agencies, including a number of the U.S. Government’s largest and most essential agencies, such as the Drug Enforcement Administration, the Federal Bureau of Investigation, the Social Security Administration and the Department of Transportation. For more information, please visit our corporate website at www.hcgovtrust.com .\nAbout this Press Release\nThis press release is neither an offer to sell nor a solicitation of an offer to buy any securities of the Company, including without limitation the common stock. Any such offer is made exclusively through the Company’s offering circular dated December 18, 2017, as the same may be amended or supplemented (the “Offering Circular”). The Offering Circular is available at: https://www.sec.gov/Archives/edgar/data/1670010/000165495417011724/hcgr_253g2.htm .\nForward-Looking Statements\nWe make statements in this press release that are considered “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933, as amended (the “Securities Act”), which are usually identified by the use of words such as “anticipates,” “believes,” “estimates,” “expects,” “intends,” “may,” “plans,” “projects,” “seeks,” “should,” “will,” and variations of such words or similar expressions. We intend for these forward-looking statements to be covered by the safe harbor provisions for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995 and are including this statement in this press release for purposes of complying with those safe harbor provisions. These forward-looking statements reflect our current views about our plans, intentions, expectations, strategies and prospects, which are based on the information currently available to us and on assumptions we have made. Although we believe that our plans, intentions, expectations, strategies and prospects as reflected in or suggested by those forward-looking statements are reasonable, we can give no assurance that the plans, intentions, expectations or strategies will be attained or achieved. Furthermore, actual results may differ materially from those described in the forward-looking statements and will be affected by a variety of risks and factors that are beyond our control. For further discussion of the factors that could affect outcomes, please refer to the risk factors set forth in the “Risk Factors” section of the Final Offering Circular. We assume no obligation to update publicly any forward-looking statements, whether as a result of new information, future events or otherwise.\nLiquidity Risk\nAn investment in HC Government Realty Trust, Inc. has a high degree of risk including the lack of a listed market for its securities, as well as other risks common to Regulation A+ investments generally, including, but not limited to, a small equity market capitalization and lack of public float, which may impair its liquidity. Consequently investors in HC Government Realty Trust, Inc. may lose some or all of their investments.\nInvestor Relations Contact:\nGlenn Wiener, GW Communications\nTel: 212-786-6011\nEmail: gwiener@GWCco.com\nMedia Relations Contact:\nSteve Hoechster, GW Communications\nTel: 212-786-6015\nEmail: shoechster@GWCco.com\nSource:HC Government Realty Trust, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=6aLXSiIOGA_HKari-PP7o7zhqf4pL72hd-Cys5FYuxWQWQBd_QOmLRSq6BsMVhiSbEPOiqgTRggOJRhR0tpqWg5hj97QXIn_ZrsaLpHDQfw=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/576182cb-421d-4120-a0b2-f5825c3a095c", "https://www.globenewswire.com/Tracker?data=6aLXSiIOGA_HKari-PP7o7c7wiQ-YMwbIA8N7ZTV3TWFiCqXfC8QE8HewL1EBCAggs27PYgN-TZ3hCufru2pNJlgIZykBoJ0_07Hm2Z76ytV6Bu_s_uq7q5shvCT7kk4fjw1vU-OCGzGy_wmJOS1FcaPXxgChS28daRQllJS0V77WPfKjKbelz3X_9apQ-P_CTjPoFDm2-eaDCLfM7MNb0Ka__7fElc46k5zNEtSYUea-4c-8kIOyhStZvmfZw9l", "https://www.sec.gov/Archives/edgar/data/1670010/000165495417011724/hcgr_253g2.htm", "https://www.globenewswire.com/Tracker?data=7LPY3hEk453XLimz6TtD8JFXFVowxbyza2kGh9Ss90AgjCgTyT3KjsxCGAaF0HziHGzsAMHGEjtuh8jjDUjYdg==", "https://www.globenewswire.com/Tracker?data=BfuXipx3Db4Cmv9hPCAj9gCXo4qwgUYJbAlTfUaAXbX1ZczWriiWTGyUsukUfiIZzzfbjCHHrWydyM6fX7LWadnkalz2H6S8zn_s4I795PallF7sNWLCQb03j9NqoLOyVZ2jbDft43fCgI3j1tN68wf4ht2iA3iq7JsH4FPgrg46uTL5sDgg7I0nJgtaDH59M3I6hzCC8X76UgAoKbPXQfFcv2bkug-dNaicBVqGKC-PAi42vJYjK0dB9T7FU0Dy", "https://www.globenewswire.com/Tracker?data=O-7xhdFfERSHdbktaQBFAJOuzNnSt1En4ltrQ9rmU1F7VapI3jlLMfgqbJZjTpkxfMr6xJIyohDEWxmu0sIG0hPP20AHRKXZ-SXbP7jaQCc="], "published": "2018-01-31T17:00:00.000+02:00", "crawled": "2018-01-31T18:47:00.039+02:00", "highlightTitle": ""}