{"organizations": [], "uuid": "0cd3e706ad27f329e31739a9a394e6fe14565a23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180108.html", "section_title": "Archive News &amp; Video for Monday, 08 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/taiwan-economy-exports/update-2-global-tech-demand-drives-taiwans-exports-to-new-high-idUSL4N1P31SI", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Global tech demand drives Taiwan's exports to new high", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.726, "site_type": "news", "published": "2018-01-08T18:53:00.000+02:00", "replies_count": 0, "uuid": "0cd3e706ad27f329e31739a9a394e6fe14565a23"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/taiwan-economy-exports/update-2-global-tech-demand-drives-taiwans-exports-to-new-high-idUSL4N1P31SI", "ord_in_thread": 0, "title": "UPDATE 2-Global tech demand drives Taiwan's exports to new high", "locations": [], "entities": {"persons": [{"name": "roger tung", "sentiment": "none"}, {"name": "jess macy yu", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "taiwan", "sentiment": "none"}, {"name": "taipei", "sentiment": "none"}], "organizations": [{"name": "apple inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Dec exports rise +14.8 pct y/y vs +14.0 pct in Nov\n* Exports to U.S. +12.4 pct y/y, to China +16.8 pct\n* Dec exports at all-time high by volume - ministry (Adds details on past full-year performance in paragraph 11)\nBy Roger Tung and Jess Macy Yu\nTAIPEI, Jan 8 (Reuters) - Taiwan’s exports climbed to a record amount in December, boosting confidence solid global technology demand will keep the island economy’s growth momentum steady this year.\nTaiwan’s factories are an integral part of the global supply-chain for technology giants such as Apple Inc, and the economy is riding a robust export cycle on strong demand around the world for new smartphones and other gadgets.\nThe government recently raised its growth forecast for 2017 to 2.58 percent from 2.11 percent, and also nudged up its outlook for 2018 on improvements in the domestic economy.\nExports in December rose 14.8 percent from a year earlier, the finance ministry’s statistics department said on Monday, compared with 9.45 percent forecast in a Reuters poll and 14.0 percent growth in November.\nThe December performance extended a streak of 15 months of exports growth, and marked a milestone high for a single month, in volume terms, the finance ministry said in a statement.\nExports for the full-year also marked an annual milestone high, by volume, the statement added.\n“Benefitting from the increased strength of the global economic recovery, and the hot demand for mobile devices and consumer electronics, as well as the impact of high prices of international raw materials... December reached a record high for any single month,” the ministry said.\nShipments to China in December jumped 16.8 percent, matching November’s pace, and those to the United States rose 12.4 percent, up from growth of 14.6 percent.\nThe ministry also said the strong exports performance was “due to strong foreign demand for integrated circuits and machinery extending a robust momentum, as well as international crude oil and basic metal prices getting stronger.”\nBeatrice Tsai, an official with the finance ministry, told a news conference it is possible for exports to post double-digit growth again in January.\nMOMENTUM TO SUSTAIN Exports grew 13.2 percent in 2017, putting the economy on a strong footing for this year though momentum could be affected by a buoyant Taiwan dollar and rising global interest rates. Exports contracted 1.8 percent in 2016 and 10.9 percent in 2015.\n“We are optimistic that January exports can maintain single-digit growth, however, the strength of first quarter export growth will be slightly weaker than the fourth quarter,” said Kevin Wang, analyst at Taishin investment advisory company.\nWang attributed December’s better-than-expected performance in part to artificial intelligence and mobile phone products helping demand for integrated circuits.\nIn November, the government nudged up its outlook for 2018 economic growth to 2.29 percent from 2.27 percent projected in August.\n“Given the outlook for global demand recovery as well as the high base effects, we expect export growth to moderate in 2018 but remain healthy at a high single-digit rate,” DBS Bank said in a research note ahead of Monday’s data. (Additional reporting by Emily Chan; Editing by Jacqueline Wong)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-08T18:53:00.000+02:00", "crawled": "2018-01-09T17:15:11.015+02:00", "highlightTitle": ""}