{"organizations": [], "uuid": "7639f7938dba386070562ff881dbc32f20cdacef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XE337_PRRECR_SOC_20180125152211.jpg", "site_section": "http://www.wsj.com/xml/rss/3_7014.xml", "section_title": "WSJ.com: US Business", "url": "https://www.wsj.com/articles/struggling-to-fill-jobs-u-s-employers-look-to-storm-battered-puerto-rico-1516962600", "country": "US", "domain_rank": 387, "title": "Struggling to Fill Jobs, U.S. Employers Look to Storm-Battered Puerto Rico", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T12:30:00.000+02:00", "replies_count": 0, "uuid": "7639f7938dba386070562ff881dbc32f20cdacef"}, "author": "Arian Campo-Flores", "url": "https://www.wsj.com/articles/struggling-to-fill-jobs-u-s-employers-look-to-storm-battered-puerto-rico-1516962600", "ord_in_thread": 0, "title": "Struggling to Fill Jobs, U.S. Employers Look to Storm-Battered Puerto Rico", "locations": [], "entities": {"persons": [{"name": "bryan stirling", "sentiment": "none"}, {"name": "bayada", "sentiment": "none"}, {"name": "carolina lobo", "sentiment": "none"}], "locations": [{"name": "puerto rico", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "south carolina", "sentiment": "none"}], "organizations": [{"name": "storm-battered puerto rico", "sentiment": "negative"}, {"name": "department of corrections", "sentiment": "none"}, {"name": "bayada home health care", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "21 COMMENTS Faced with worker shortages, employers are trying to lure Puerto Rico residents to the mainland with the promise of jobs for many on the island devastated by Hurricane Maria.\nThe Department of Corrections in South Carolina began billboard advertisements in Puerto Rico to hire correctional officers, noting “Relocation Assistance Available.” The department has more than 650 such openings. Director Bryan Stirling is hoping to lure candidates with the promise of decent pay—$35,000 a year, plus overtime—and benefits. \nBayada Home Health Care, which struggles to fill in-home care positions in 22 states, also set its sights on the island, which has a bounty of health-care workers and an economy reeling from recession. Since Bayada began running Facebook ads in December targeting Puerto Ricans on the island, nearly 700 have responded, a rate triple the average for the company’s recruitment drives, said Carolina Lobo, chief marketing officer at the company.\n“The response was so overwhelming that we had to stop the social marketing,” she said.\nWith the U.S. unemployment rate at a 17-year low of 4.1%, employers are straining to hire everyone from carpenters to engineers. But in Puerto Rico, where the unemployment rate is 10.8%, many businesses remain closed due to lack of electricity or have trimmed workforces because of depleted demand. So workers are seeking opportunity elsewhere.\nFor employers in Branson, Mo.—a tourist destination in a county with a 3.8% jobless rate—Puerto Ricans present an appealing labor source because, as U.S. citizens, they don’t need work visas that are in short supply. Last year, even before the hurricane, recruiters traveled to the island several times searching for hospitality workers, industrial welders and nurses, among other occupations. Branson-area businesses hired more than 200 Puerto Ricans.\nRecruiters from Missouri are planning to visit again in February and launch a print and radio ad campaign, said Heather Hardinger, who works with the Taney County Partnership, an economic-development organization based in Branson. “We’re expecting a greater response than we had earlier,” she said, in part because of the island’s worsening economic woes.\nRecruiting employees in Puerto Rico isn’t new. U.S. mainland companies have long hunted for prospects there, from factory workers to engineers, said Joaquin Torres, past president of the Puerto Rican Chamber of Commerce of Central Florida. But he said that the combination of historically low unemployment on the mainland and deepening crisis in Puerto Rico have intensified the push.\nThe exodus to the mainland appears to be gaining steam in the aftermath of Maria. In Florida, the Office of Economic and Demographic Research projects that more than 53,000 Puerto Ricans will permanently settle in the state as a result of the hurricane.\nWidalis Otero, a 39-year-old teacher from Isabela, P.R., moved in October with her husband and four children to Orlando, Fla., after tiring of living conditions on the island. At a resource center set up in the airport for Puerto Rican newcomers, she visited the table for Orange County Public Schools to ask about enrolling her children. When staffers learned she was a teacher, they urged her to apply for a position.\nThe district, in a county with a 3.1% unemployment rate, stepped up recruitment efforts in Puerto Rico after the storm. It has since hired 50 teachers and 27 employees in areas like food service and secretarial work, said Bridget Williams, chief of staff at the school system.\nIn December, Ms. Otero began a job at Innovation Middle School as a paraprofessional working with English-language learners. Once she gathers the necessary documentation, she said she plans to apply for a teaching position. “I really like it here,” she said.\nAveluz Costello, a 26-year-old hotel worker, left San Juan in October after she was recruited by the Nantucket Hotel and Resort in Massachusetts. She said she worried about her mother’s financial situation and could barely help her earning just $7.25 an hour in Puerto Rico. The Nantucket job pays more than twice that and provides housing and airline tickets home to visit.\n“It happened right at the time when I needed it.” Ms. Costello said.\nMark Snider, owner of the hotel, said the U.S. visa program for temporary workers is erratic. He brought on a half-dozen Puerto Ricans after the storm and plans to hire more in February.\nBayada, the home health-care company, shrank its pool of nearly 700 respondents to about 160 people and sent 15 staffers last weekend to San Juan, P.R. to interview them. The company made offers to 26 of them for positions in Minneapolis, where the metropolitan area has an unemployment rate of 2.4%.\n“Assuming we get results and this catches, I will want to quickly replicate the approach to fill needs in other parts of the country,” said David Baiada, the company’s chief executive.\nWrite to Arian Campo-Flores at arian.campo-flores@wsj.com", "external_links": [], "published": "2018-01-26T12:30:00.000+02:00", "crawled": "2018-01-26T14:34:33.006+02:00", "highlightTitle": ""}