{"organizations": [], "uuid": "2ec86c916aa7bafc161d195108ae7a56ec62b54e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1227074575&w=1200&r=LYNXMPEE0U1PI", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-football-nfl-superbowl-goodell/goodell-president-trump-remain-at-odds-over-player-protests-idUSKBN1FK369", "country": "US", "domain_rank": 408, "title": "Goodell, President Trump remain at odds over player protests", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T23:37:00.000+02:00", "replies_count": 0, "uuid": "2ec86c916aa7bafc161d195108ae7a56ec62b54e"}, "author": "", "url": "https://www.reuters.com/article/us-football-nfl-superbowl-goodell/goodell-president-trump-remain-at-odds-over-player-protests-idUSKBN1FK369", "ord_in_thread": 0, "title": "Goodell, President Trump remain at odds over player protests", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "goodell", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "roger goodell", "sentiment": "none"}, {"name": "steve keating", "sentiment": "none"}], "locations": [{"name": "minneapolis", "sentiment": "none"}], "organizations": [{"name": "goodell", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 9:39 PM / in 6 minutes Goodell, President Trump remain at odds over player protests Steve Keating 3 Min Read \nMINNEAPOLIS (Reuters) - National Football League commissioner Roger Goodell and President Donald Trump remained on a collision course after both men conceded no ground on the issue of players kneeling in protest at racial injustice during the national anthem. \nJust 14 hours after Trump raised the issue during his State of the Union address on Tuesday, Goodell would not back away from the league’s position that they need to work with players to address their concerns which include the police shootings of minorities and racial disparities in the justice system. \n“What the players are really interested in is making our communities better, seeing injustices that they see in their local communities that we can address collectively and support from the players. That’s where our focus is,” said Goodell during his own State of the League address on Wednesday. \nOver the course of the season players were caught in Trump’s Twitter crosshairs, the President repeatedly calling out Goodell and NFL owners for not taking action. \nTrump scorned any player who protests as a “son of a bitch” who should face suspension. Goodell praised the athletes as political activists. \nTrump renewed his criticism on Tuesday when he singled out a speech guest, 12-year-old Preston Sharp, for leading an effort to put American flags on the graves of 40,000 veterans, saying the initiative was “why we proudly stand for the national anthem”. \nGoodell said a committee of league representatives and players would continue to meet in an effort to find a compromise to an issue that has divided fans. FILE PHOTO: NFL commissioner Roger Goodell speaks during a news conference following the NFL owners autumn meeting in New York City, U.S., October 18, 2017. REUTERS/Brendan McDermid/File Photo \n“We have created a committee of owners and players who have met in person once, on the phone a second time and will meet again in the next 30 days,” Goodell said. \n“The effort there is to continue to make recommendations to our players, to our ownership about what we can do to evolve that platform make the platform effective.” \nIn the build-up to Sunday’s Super Bowl between the New England Patriots and Philadelphia Eagles the issue has not been a major one with players sticking mostly to game-related questions. \nAny type of protest on Sunday, however, would almost certainly trigger a Presidential response. \nGoodell would not comment on a lawsuit brought by former San Francisco 49ers quarterback Colin Kaepernick, who sparked the protests when he first sat and then knelt during the national anthem before games during the 2016 season. \nKaepernick, who has not been able to find a job in football and did not play this season, has filed a grievance against the NFL, accusing the 32 owners of collusion. \n“All the clubs individually have to make their own decisions about who is on the roster, who is not on the roster,” said Goodell. “I think that is something the clubs have to make that decision and we the league do not get involved with that.” Editing by Ed Osmond", "external_links": [], "published": "2018-01-31T23:37:00.000+02:00", "crawled": "2018-01-31T23:58:58.024+02:00", "highlightTitle": ""}