{"organizations": [], "uuid": "b2ab0120732dcd72b6342859f4f0d3175ecd7938", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-646727466.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/30/national-security-council-nationalized-5g-proposal/", "country": "US", "domain_rank": 1196, "title": "Here's What You Need To Know About That 'Nationalized 5G' Proposal | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.581, "site_type": "news", "published": "2018-01-30T10:24:00.000+02:00", "replies_count": 0, "uuid": "b2ab0120732dcd72b6342859f4f0d3175ecd7938"}, "author": "David Meyer", "url": "http://fortune.com/2018/01/30/national-security-council-nationalized-5g-proposal/", "ord_in_thread": 0, "title": "Here's What You Need To Know About That 'Nationalized 5G' Proposal | Fortune", "locations": [], "entities": {"persons": [{"name": "david meyer", "sentiment": "neutral"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}], "organizations": [{"name": "national security council", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By David Meyer 8:24 AM EST \nSunday brought a big surprise in the form of a leaked proposal to create a secure, government-controlled “5G” network in the U.S. that would keep out the Chinese (in more ways than one). \nThe document , leaked to Axios and largely verified by Reuters, was the product of a “senior National Security Council official” who recently presented it to senior officials from other agencies. \nThe proposal may or may not already be dead in the water, but it looks like the White House will continue to push for certain elements of what was in there. That means it’s worth taking a deeper look at what the memo called for. Hold up. What’s 5G? \nRight now you probably use fourth-generation (4G) mobile broadband through your phone and other mobile devices. It’s really fast, but fifth-generation (5G) wireless broadband should be able to provide even better connections. And that will make it useful as a substitute for fixed-line broadband in places like the rural U.S., where the economics of fixed-line rollouts have proven unattractive to cable companies. \nIf it lives up to the industry’s promises, 5G will also be much better suited than 4G to handling the data from the “internet of things”—from connected cars to smart vending machines—and it will allow telecom companies to run their networks more efficiently. Gotcha. So what did the memo say? \nThere’s a lot to unpack here, but here’s the headline for the presentation: “The Eisenhower National Highway System for the Information Age”—a secure, nationwide 5G network that would reflect American values and counter China’s “dominant position in the manufacture and operation of network infrastructure,” along with China’s position as the “dominant malicious actor in the Information Domain.” \nHere are the key details: China, where the state owns the big mobile operators, reserves up to 70% of its mobile infrastructure market for its top equipment vendors, Huawei and ZTE, effectively funding them through protectionism. Meanwhile, U.S. vendors are mostly out of the picture these days. So the U.S. should push back. That means the American government building a nationwide 5G network within just three years—a timespan that includes the recreation of a “telecommunications manufacturing base in the U.S.” There would need to be new national standards for deploying the infrastructure, in order to speed up the process. There would also need to be new security standards for this version of 5G, in order to “build a network that is inherently secure” against Chinese cyberattacks. The network would make it possible to fight back against those who “steal intellectual property and private data, sow division and obscure bad behavior, slander and defame the innocent, prey on the weak and plans the seeds for total darkness in the event of all-out war.” To make the 5G network a better defensive tool, anonymity would not be allowed on it. Friendly countries might choose to partner with the U.S. on this—attracted by U.S.-developed security capabilities. This would create a “democratic counter” to China’s Belt and Road soft-power initiative. Rural broadband would “guarantee a revenue stream” while the government figures out other business models that could pay for all this. The 5G network would “provide 100 Mbps speeds to approximately 80% of rural customers.” The network’s development would also allow the U.S. to avoid losing the “AI arms race” to China, where “complete elimination of privacy standards” allows the authorities to mine people’s data freely. So what’s the political reaction? \nBrutal. Once it went public, the proposal quickly met stiff resistance on many fronts. \nAjit Pai, the chairman of the Federal Communications Commission (FCC) said he opposed the “costly and counterproductive distraction” from the policies needed to put the U.S. at the forefront of 5G—the upcoming new generation of wireless broadband technology. (It’s worth noting that U.S. carriers are already preparing to roll out 5G , based on already-agreed standards, this year.) \nPoliticians from both parties rushed to condemn the proposal —”We’re not Venezuela,” said House Energy & Commerce Committee chair Greg Walden—as did telecom companies. \nWithin a day of the original leak, Recode reported White House officials as saying the leaked document was “outdated” and the nationalized 5G network plan “probably might never be.” \n“There are a lot of things on the table,” White House press secretary Sarah Huckabee Sanders said. “Again, these are the very earliest stages of the discussion period, and there’s been absolutely no decision made other than…the need for a secure network.” \nBut how much of the proposal actually makes sense? According to experts, some elements aren’t actually so out there. But others are. The economic case \n“I’ve been wondering what the U.S. government was going to do,” said Joe Madden, a Mobile Experts analyst who has been fretting about China’s protectionist telecoms strategy. \nChina did indeed invest huge amounts of money in building out its 4G networks, and over a decade that took Huawei and ZTE to the number one and two spots when it comes to the number of radio transceivers that are sold to telecoms companies. However, Madden said, those companies still had to rely on U.S. firms’ semiconductors for that equipment. And this time China is planning to build out its own semiconductor capabilities for the 5G rollout. \n“That puts the U.S. at a big disadvantage from an economic point of view,” said Madden. “The national security implications are secondary—I think this is a trade thing.” \nBut what about the idea of funding the network through revenue from rural broadband rollouts? That’s where it really makes no sense. “It’s a safe bet that if you put broadband out in rural areas, you will get some revenue, from ranchers [and so on],” said Madden. “There’s just not a lot of those people out there. The revenue stream is fairly risk-free, but it’s small.” \nHow about the proposed timescale then? Disruptive Analysis’s Dean Bubley is deeply sceptical about the three-years thing. “It would likely take a decade-plus to roll out genuine national coverage, including in rural areas. The U.S. probably doesn’t have the manpower,” he said. The security aspect \nAs Sanders said, the one thing the White House is sure about right now is that it wants a secure network. But would what was proposed actually provide that? \nAccording to Madden, there is a “valid concern” about using network equipment from an unfriendly country, particularly if they make everything down to the processing chips (a concern that has of course been animating the Chinese when it comes to American chips). “There is a danger that there could be a back door that could open a security hole in the system,” he said. \nHowever, as Bubley noted, the proposal does not mention radio spectrum that would be useful for giving people connectivity indoors. So users’ devices would constantly need to switch over to other connections that aren’t part of some government-controlled network. “Which sort of blows up the idea of a completely firewalled separate Internet,” he said. \nThe cybersecurity expert Alan Woodward, a professor at the University of Surrey in England, said the proposed network would not “protect anyone more than the current Internet” because it would presumably have to connect to the regular Internet. “If the U.S. government were talking about building a standalone 5G network then maybe they could secure it from certain threats but I don’t see what use such a network would be,” he said. \nHowever, Woodward added, there are some reasons why it might make sense to build a 5G network under government control. Firstly, it would make it easier to demand that equipment suppliers—such as Huawei—allow the authorities to strip down the equipment and check it for flaws that might aid a foreign government. Secondly, it would make it possible for the government to “flip the appropriate switches in an emergency and use it for essential use only.” \n“Third, again if you build, own and operate a 5G network, and you assume that it will be the mobile network of choice in your country, then you can conduct surveillance operations much more easily,” Woodward added. \nHowever, he noted, it would be difficult for the government to stop companies from rolling out competing networks. “Assuming the U.S. didn’t government didn’t give itself a monopoly on 5G, then it’s difficult to see how their network would be the preferred network for consumers in a few years’ time. Other countries do it, but they typically are much smaller and have maybe one state owned telecommunications company running their infrastructure already.” \n“All in all I would be very surprised if the U.S. government progressed with this idea, but I can fully understand why it might be considered,” Woodward said. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-30T10:24:00.000+02:00", "crawled": "2018-01-30T16:41:54.004+02:00", "highlightTitle": ""}