{"organizations": [], "uuid": "88c0f6354e0b82858d9422e362883237da80e80c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/888970172.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/16/pbs-me-too-tv-series-sexual-harassment/", "country": "US", "domain_rank": 1196, "title": "'Me Too' Movements Gets a PBS TV Series | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.578, "site_type": "news", "published": "2018-01-08T02:00:00.000+02:00", "replies_count": 0, "uuid": "88c0f6354e0b82858d9422e362883237da80e80c"}, "author": "Tom Huddleston Jr.", "url": "http://fortune.com/2018/01/16/pbs-me-too-tv-series-sexual-harassment/", "ord_in_thread": 0, "title": "'Me Too' Movements Gets a PBS TV Series | Fortune", "locations": [], "entities": {"persons": [{"name": "tom huddleston jr", "sentiment": "negative"}, {"name": "zainab salbi", "sentiment": "none"}], "locations": [{"name": "salbi", "sentiment": "none"}], "organizations": [{"name": "pbs", "sentiment": "negative"}, {"name": "women for women international", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Tom Huddleston Jr. January 16, 2018 \nSexual misconduct and harassment has dominated headlines and conversations for several months now, as more and more women step forward with allegations against powerful men in a variety of industries and settings. \nSoon, that massive cultural shift will be the focus of a new television series aimed at charting the origins of the #MeToo movement while looking ahead to discuss how changing attitudes about sexual harassment may affect behavior in the future. On Feb. 2, PBS will begin airing #MeToo, Now What? , a five-part series hosted by author and Women for Women International founder Zainab Salbi that will look to take the current sexual harassment discussion “to another level,” PBS said on Tuesday. \nThe series’ five, half-hour episodes will tackle the sexual harassment issue through a mix of reporting from Salbi as well as conversations with guests who will include activists, journalists, celebrities, and prominent people from various industries and sectors. Every episode will deal with sexual harassment and the #MeToo movement, but there will also be standalone topics ranging from the gender wage gap to the affects of race and class on the issue of sexual harassment. In its press release, PBS noted that the new TV series will look to address a central question about the movement: “How did we get here and how can we use this moment to effect positive and lasting change?” \nGet Data Sheet , Fortune’s technology newsletter. \n“This series will provide context and perspective from a wide range of voices, with the goal of moving towards healing and understanding,” Beth Hoppe, PBS’ chief programming executive, said in a statement. \nTIME chose the women who came forward as part of the #MeToo movement as its Person of the Year for 2017 after a year of allegations against powerful men in Hollywood and the media such as Harvey Weinstein , Kevin Spacey , and Matt Lauer , while also eventually expanding to include several other industries. More recently, some of Hollywood’s most powerful women teamed up on an anti-harassment action plan called Time’s Up . \nThe first episode of #MeToo, Now What? will air on PBS at 8:30 p.m. ET on Feb. 2. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-08T02:00:00.000+02:00", "crawled": "2018-01-17T05:49:12.015+02:00", "highlightTitle": ""}