{"organizations": [], "uuid": "2cbc44378897daf3cca8343ac6069f58bb270107", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-526202114.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/16/pfizer-parkinsons-alzheimers-research/", "country": "US", "domain_rank": 1196, "title": "Commentary: Pfizer: Bad Move to Halt Alzheimer’s, Parkinson’s Research | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.188, "site_type": "news", "published": "2018-01-16T16:16:00.000+02:00", "replies_count": 0, "uuid": "2cbc44378897daf3cca8343ac6069f58bb270107"}, "author": "Allan Hugh Cole Jr.", "url": "http://fortune.com/2018/01/16/pfizer-parkinsons-alzheimers-research/", "ord_in_thread": 0, "title": "Commentary: Pfizer: Bad Move to Halt Alzheimer’s, Parkinson’s Research | Fortune", "locations": [], "entities": {"persons": [{"name": "joan cao", "sentiment": "neutral"}, {"name": "allan hugh cole jr.", "sentiment": "none"}, {"name": "sandy huffaker corbis", "sentiment": "none"}, {"name": "parkinson", "sentiment": "none"}], "locations": [{"name": "san diego", "sentiment": "none"}], "organizations": [{"name": "pfizer", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Pfizer Commentary: Why Is Pfizer Giving Up on Parkinson's and Alzheimer’s? Scientist Joan Cao works in a lab at Pfizer on Friday, August 21, 2009 in San Diego, CA. Sandy Huffaker Corbis via Getty Images By Allan Hugh Cole Jr. 2:16 PM EST \nThe pharmaceutical company Pfizer (PFE) , perhaps best known for its erectile dysfunction drug Viagra, recently announced that it will shut down its research and development efforts related to neurological disorders, particularly Alzheimer’s and Parkinson’s. \nThe company says that this decision will result in the loss of approximately 300 research jobs, but it also suggests that savings will be applied to other Pfizer pursuits. Perhaps this will include research and development of drugs for other diseases, albeit with fewer researchers, but to date, neither the amount the company will save nor its specific use of these freed-up resources has been detailed. \nAs a 49 year old living with Parkinson’s disease, I think Pfizer’s decision is a disappointment. Like more than 10 million others worldwide, I depend on treatment advances to maximize my quality of life, and historically, large pharmaceutical companies have played a key role in spurring these advances. Any one of us can get these life-changing diseases. At the very least, Pfizer should think about the human element in its decisions. \nOn one hand, Pfizer’s decision makes some sense. Finding better treatments, not to mention cures, for brain diseases has proved difficult, particularly for Pfizer. Neurological research requires large investments of time and money, talent, patience, and resolve, before any potential success, and thus profit, can be found. In other words, this kind of research comes with a lot of risk, and Pfizer, it seems, perhaps because of its track record, has become more risk-averse when it comes to neurological diseases. \nOn the other hand, the potential for profit is extraordinary if and when new treatment breakthroughs occur. With respect to Parkinson’s disease, many researchers and neurologists routinely recognize that we are quite close to having several potentially “game-changing” treatments available, meaning within the next five years. Consider the 10 million people living with Parkinson’s disease and the more than 44 million people living with Alzheimer’s disease, and factor in that the frequency of both is expected to increase considerably as people live longer. Some predict a threefold increase in Alzheimer’s cases alone. Moreover, consider that, in 2017, Alzheimer’s cost the United States more than $259 billion, and that estimates suggest the cost will rise to more than $1 trillion by 2050 . \nI don’t know how much is spent annually on treating erectile dysfunction, but clearly, finding treatments and cures for neurological disorders has a profound positive impact on the larger economic and public good. \nAll is not lost. Many pharmaceutical companies continue to work on treatments for neurological diseases, as do many smaller biotech firms and academic medical research centers, and funding sources for these pursuits include private foundations as well as governments. The role that big pharma plays in research, while valuable, is often tenuous, because profit models for many diseases are not always apparent, at least in the short term. \n\nThat’s one reason I support the Michael J. Fox Foundation for Parkinson’s Research. Its mission is to help minimize the research and development risk that gave Pfizer cold feet. In other words, they make it less risky for companies to invest in research and development by underwriting the costs. The breakthroughs will come. We are close. Maximizing support for the efforts of those such as Michael J. Fox Foundation for Parkinson’s Research and academic medical research centers is key, especially now because other major pharmaceutical companies could follow Pfizer’s decision. \nQuestions about Pfizer’s decision remain, a principal one being whether curbing costs related to developing new neurological drugs will result in the price of other Pfizer drugs decreasing. I hope so, particularly in light of pharmaceutical companies frequently pointing to the high costs of developing new drugs as being the primary reason prices are so high for existing drugs. \nAllan Hugh Cole Jr. is a professor and senior associate dean in the Steve Hicks School of Social Work at The University of Texas at Austin. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-16T16:16:00.000+02:00", "crawled": "2018-01-16T22:11:37.021+02:00", "highlightTitle": ""}