{"organizations": [], "uuid": "d19f0be1cd3d5a0c04990c005878dae787cebdec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220826199&w=1200&r=LYNXMPEE090S6", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-olympics-2018-fski-christensen/bad-luck-dogs-sochi-slopestyle-surprise-christensen-idUSKBN1EZ1IU", "country": "US", "domain_rank": 408, "title": "Bad luck dogs Sochi slopestyle surprise Christensen", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T15:12:00.000+02:00", "replies_count": 0, "uuid": "d19f0be1cd3d5a0c04990c005878dae787cebdec"}, "author": "", "url": "https://www.reuters.com/article/us-olympics-2018-fski-christensen/bad-luck-dogs-sochi-slopestyle-surprise-christensen-idUSKBN1EZ1IU", "ord_in_thread": 0, "title": "Bad luck dogs Sochi slopestyle surprise Christensen", "locations": [], "entities": {"persons": [{"name": "christensen", "sentiment": "negative"}, {"name": "gus kenworthy", "sentiment": "none"}, {"name": "nick goepper", "sentiment": "none"}, {"name": "chr", "sentiment": "none"}, {"name": "joss christensen", "sentiment": "none"}], "locations": [{"name": "sochi", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - If anybody can defy the odds to win gold in Pyeongchang it is American skier Joss Christensen, whose preparations for the 2018 Winter Games have been blighted by a serious knee injury, broken bones and a dog bite.\nChristensen won the first men’s ski slopestyle gold medal awarded at the Olympics when he topped the podium ahead of Gus Kenworthy and Nick Goepper in a U.S. clean sweep at Sochi.\nHis victory came as a shock as Christensen had only made the U.S. team after being handed a coaches’ discretionary spot following a troubled qualifying campaign that coincided with the death of his father.\nChristensen rewarded his coaches’ faith with the ride of his life in the 2014 Olympic final but it has been far from plain sailing since Sochi, with a series of injuries making it tough for him to even be on the slopes.\nSince his triumph in Russia, Christensen has suffered two broken hands, a broken wrist and a separated collarbone. His most recent injury, a torn ACL and meniscus suffered last May, meant Christensen did not ski this season until the end of November.\nFILE PHOTO: Joss Christensen of the U.S. performs a jump during the men's freestyle skiing slopestyle qualification round at the 2014 Sochi Winter Olympic Games in Rosa Khutor February 13, 2014. REUTERS/Dylan Martinez/File Photo Combine that with a brief loss of sponsorship and a dog bite in Bosnia that required 40 rabies and tetanus shots and it all adds up to less than ideal preparations for defending his Olympic crown.\nHowever, in a Sports Illustrated interview last month, Christensen was upbeat about competing in Pyeongchang and being fully fit by February, despite admitting the battle with injury had been a difficult journey.\n“My knee decided to win the battle against this injury,” said Christensen.\n“At that point, once everything started getting better and better, I just got all the negative thoughts out of my brain and I felt like that just helped me get through all the down time I’ve had and rehab that much better.”\nChristensen sat out the first two qualifying events in December as he continues to heal his knee, yet hopes to qualify through competing at the final two events held in January at Aspen and Mammoth.\nEditing by Peter Rutherford\n ", "external_links": [], "published": "2018-01-10T15:12:00.000+02:00", "crawled": "2018-01-10T15:33:33.017+02:00", "highlightTitle": ""}