{"organizations": [], "uuid": "0c461a8358337b6fab526e7cb9450c88c2a1b8b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/10/14/104021055-GettyImages-453612803p.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/10/cloud-companies-consider-intel-rivals-after-security-flaws-found.html", "country": "US", "domain_rank": 767, "title": "Cloud companies consider Intel rivals after security flaws found", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T15:53:00.000+02:00", "replies_count": 0, "uuid": "0c461a8358337b6fab526e7cb9450c88c2a1b8b0"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/10/cloud-companies-consider-intel-rivals-after-security-flaws-found.html", "ord_in_thread": 0, "title": "Cloud companies consider Intel rivals after security flaws found", "locations": [], "entities": {"persons": [{"name": "altern", "sentiment": "none"}], "locations": [], "organizations": [{"name": "intel", "sentiment": "negative"}, {"name": "idc", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Buchachon | Getty Images \nSome of Intel's data center customers, whose thousands of computers run cloud networks, are exploring using microchips from the market leader's rivals to build new infrastructure after the discovery of security flaws affecting most chips. \nWhether Intel sees a slew of defectors or is forced to offer discounts, the company could take a hit to one of its fastest growing business units. Intel chips back 98 percent of data center operations, according to industry consultancy IDC. \nSecurity researchers last week disclosed flaws, dubbed Meltdown and Spectre, that could allow hackers to steal passwords or encryption keys on most types of computers, phones, and cloud-based servers. \nMicrosoft said on Tuesday the patches necessary to secure the threats could have a significant performance impact on servers. \nIntel will help customers find the best approach in terms of security, performance, and compatibility, it said in a statement on Tuesday. \"For many customers, the performance element is foremost, and we are sharply focused on doing all we can to ensure that we meet their expectations.\" \nAlternatives include Advanced Micro Devices , which shares with Intel a chip architecture called x86, or chips based on technology from ARM Holdings or graphics processing chips, which were developed for different tasks than Intel and AMD's central processing units, or CPUs. \nFor Gleb Budman's company, San Mateo-based online storage firm Backblaze, building with ARM chips would not be difficult. \n\"If ARM provides enough computing power at lower cost or lower power than x86, it would be a strong incentive for us to switch,\" said Budman. \"If the fix for x86 results in a dramatically decreased level of performance, that might increasingly push in favor of switching to ARM.\" \nInfinitely Virtual, a Los Angeles-based cloud computing vendor, is counting on Intel to replace equipment or offer a rebate to make up for the loss in computing power, Chief Executive Adam Stern said in an interview. \n\"If Intel doesn't step up and do something to make this right then we're going to have to punish them in the marketplace by not purchasing their products,\" said Stern, whose company relies exclusively on Intel processors. \nCloud providers said swapping out previously installed Intel chips for rivals' would be too complex, but moving forward they could expand their networks using alternatives. Moving from Intel to AMD is easiest since AMD and Intel chips share a common core technology called the x86 instruction set, they said. \nARM-based chips lag the speed of Intel's x86 based chips for tasks such as searches, and software would have to be rewritten. \nNvidia's so-called graphical processing units, or GPUs, are not a direct replacement for Intel's CPUs, but they are taking over the CPU's role for new types of work like image recognition and speech recognition. \nMajor technology companies had been experimenting with Intel alternatives even before the security flaws were revealed. \nLast March, Microsoft committed to using ARM processors for its Azure cloud service, and in December, Microsoft Azure deployed Advanced Micro Devices processors in its data centers. \nAlphabet's Google said in 2016 that it was designing a server based on International Business Machines' Power9 processor. And Amazon.com's Amazon Web Services chose AMD graphics processing units for a graphics design service announced in September. \nBoth Qualcomm and Cavium are developing ARM chips aimed at data centers. Cavium said it aimed to rival the performance of Intel chips for applications like databases and the content-delivery networks that help speed things like how fast online videos load. \nCavium is working with Microsoft and \"several other cloud\" vendors, said Gopal Hegde, vice president of the data center processor group. Cavium and ARM rival Qualcomm work together to reduce the amount of software that has to be rewritten for ARM chips. \nCloudflare, a San Francisco cloud network company, has been evaluating ARM chips. The new security patches have not slowed its performance, but it will use the security issues as an opportunity to re-evaluate its use of Intel products, said Chief Technology Officer John Graham Cumming. Related Securities ", "external_links": [], "published": "2018-01-10T15:53:00.000+02:00", "crawled": "2018-01-10T16:09:34.004+02:00", "highlightTitle": ""}