{"organizations": [], "uuid": "b3740aecbc7c510803408dfce98741f95a712b39", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/22/reuters-america-update-11-government-shutdown-fizzles-on-spending-immigration-deal-in-u-s-congress.html", "country": "US", "domain_rank": 767, "title": "UPDATE 11-Government shutdown fizzles on spending, immigration deal in U.S. Congress", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T02:17:00.000+02:00", "replies_count": 0, "uuid": "b3740aecbc7c510803408dfce98741f95a712b39"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/22/reuters-america-update-11-government-shutdown-fizzles-on-spending-immigration-deal-in-u-s-congress.html", "ord_in_thread": 0, "title": "UPDATE 11-Government shutdown fizzles on spending, immigration deal in U.S. Congress", "locations": [], "entities": {"persons": [{"name": "chuck schumer", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "congress", "sentiment": "negative"}, {"name": "congress congress", "sentiment": "negative"}, {"name": "house", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "house of representatives", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Congress@ (Updates with House vote, adds background)\nWASHINGTON, Jan 22 (Reuters) - Congress voted on Monday to end a three-day U.S. government shutdown, approving another short-term funding bill as Democrats accepted promises from Republicans for a broad debate later on the future of young illegal immigrants.\nThe fourth temporary funding bill since October easily passed the Senate and the House of Representatives. That sent it to the White House, which said President Donald Trump was expected to sign the bill, a product chiefly of negotiations among Senate leaders.\nEnactment by Trump of the bill will allow the government to reopen fully on Tuesday and keep the lights on through Feb. 8, when Congress will have to revisit the budget and immigration policy, two disparate issues that have become closely linked.\nThe House approved the funding bill by a vote of 266-150 just hours after it passed the Senate by a vote of 81-18.\nTrump's attempts to negotiate an end to the shutdown with Senate Democratic leader Chuck Schumer collapsed on Friday in recriminations and fingerpointing. The Republican president took a new swipe at Democrats as he celebrated the Senate's pact.\n\"I am pleased that Democrats in Congress have come to their senses,\" Trump said in a statement. \"We will make a long term deal on immigration if and only if it's good for the country.\"\nImmigration and the budget are entangled because of Congress' failure last year to approve a budget on time by Oct. 1, just weeks after Trump summarily ordered an end by March to Obama-era legal protections for young immigrants known as \"Dreamers.\"\nThe budget failure has necessitated passage by Congress of a series of temporary funding measures, giving Democrats leverage each step of the way since they hold votes needed to overcome a 60-vote threshold in the Senate for most legislation.\nWith government spending authority about to expire again at midnight on Friday, Democrats withheld support for a fourth stopgap spending bill and demanded action for the Dreamers.\n'DREAMERS'\nThe roughly 700,000 young people were brought to the United States illegally as children, mainly from Mexico and Central America. They mostly grew up in the United States.\nFormer President Barack Obama's Deferred Action for Childhood Arrivals, or DACA, program gave the Dreamers legal protections and shielded them from deportation.\nDemocrats, as a condition of supporting a new spending stopgap, demanded a resolution of the uncertain future Trump created for the Dreamers with his DACA order last year.\nBut Democratic leaders, worried about being blamed for the disruptive shutdown that resulted, relented in the end and accepted a pledge by Republicans to hold a debate later over the fate of the Dreamers and related immigration issues.\nTens of thousands of federal workers had begun closing down operations for lack of funding on Monday, the first weekday since the shutdown, but essential services such as security and defense operations had continued.\nThe shutdown undercut Trump's self-crafted image as a dealmaker who would repair the broken culture in Washington.\nIt forced Trump to cancel a weekend trip to his Mar-a-Lago estate in Florida and created uncertainty around his scheduled trip this week to the World Economic Forum in Davos, Switzerland.\nThe U.S. government cannot fully operate without funding bills that are voted in Congress regularly. Washington has been hampered by frequent threats of a shutdown in recent years as the two parties fight over spending, immigration and other issues. The last U.S. government shutdown was in 2013.\nBoth sides in Washington had tried to blame each other for the shutdown. The White House on Saturday refused to negotiate on immigration issues until the government reopened.\nOn Monday, Trump met separately at the White House with Republican senators who have taken a harder line on immigration and with moderate Democratic Senators Joe Manchin and Doug Jones.\n'WHY DO WE HAVE TO WAIT?'\nSome liberal groups were infuriated by the decision to reopen the government.\n\"Today's cave by Senate Democrats - led by weak-kneed, right-of-center Democrats - is why people dont believe the Democratic Party stands for anything,\" said Stephanie Taylor, co-founder of the Progressive Change Campaign Committee.\nMarkets have absorbed the shutdown drama over the past week.\nU.S. stocks advanced on Monday as each of Wall Street's main indexes touched a record intraday level after the shutdown deal.\nFor Jovan Rodriguez of Brooklyn, New York, a Dreamer whose family came from Mexico when he was 3 years old and ultimately settled in Texas, the latest development was more of the same.\n\"Why do we have to wait - again? It's like our lives are suspended in limbo,\" he said. And they have been for months. I don't trust the Republicans and I don't trust (Senate Majority Leader Mitch) McConnell with just a promise. That's not good enough any more.\"\n(Additional reporting by David Morgan, Ginger Gibson, Amanda Becker, Blake Brittain, Susan Heavey, Steve Holland, Diane Bartz, Lucia Mutikani, Yasmeen Abdutaleb and Patricia Zengerle in Washington, Megan Davies in New York and Sharon Bernstein in Sacramento, Calif.; Writing by Doina Chiacu; Editing by Alistair Bell and Peter Cooney)", "external_links": [], "published": "2018-01-23T02:17:00.000+02:00", "crawled": "2018-01-23T08:19:16.003+02:00", "highlightTitle": ""}