{"organizations": [], "uuid": "dc5b0483a3509dbb9a9a0470e34946679fb4cfe7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 11, "shares": 11, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220424672&w=1200&r=LYNXMPEE08039", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-global-oil/u-s-oil-prices-hit-highest-since-2015-but-doubts-loom-over-rally-idUKKBN1EY059", "country": "US", "domain_rank": 408, "title": "U.S. oil prices hit highest since 2015, but doubts loom over rally", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T05:08:00.000+02:00", "replies_count": 0, "uuid": "dc5b0483a3509dbb9a9a0470e34946679fb4cfe7"}, "author": "", "url": "https://uk.reuters.com/article/us-global-oil/u-s-oil-prices-hit-highest-since-2015-but-doubts-loom-over-rally-idUKKBN1EY059", "ord_in_thread": 0, "title": "U.S. oil prices hit highest since 2015, but doubts loom over rally", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 1:35 AM / Updated 3 hours ago U.S. oil prices hit highest since 2015, but doubts loom over rally Henning Gloystein 3 Min Read \nSINGAPORE (Reuters) - U.S. oil prices hit their highest since 2015 again on Tuesday as speculators bet on further price rises amid OPEC-led production cuts and a dip in American drilling activity, though some warned the rally could run out of steam. FILE PHOTO: A pump jack operates at a well site leased by Devon Energy Production Company near Guthrie, Oklahoma, U.S., September 15, 2015. REUTERS/Nick Oxford/File Photo \nU.S. West Texas Intermediate (WTI) crude futures were at $62.24 a barrel at 0252 GMT - 51 cents, or 0.8 percent, above their last settlement. They earlier marked a May-2015 high of $62.56 a barrel. \nBeyond that 2015-high, which was a short intra-day spike, Tuesday’s peak was the strongest level for WTI since December, 2014, at the start of the oil market slump. \nBrent crude futures were at $68.22 a barrel, 44 cents, or 0.65 percent, above their last close. Brent touched $68.27 last week, its highest since May, 2015. \nTraders said prices were mainly being driven by speculative money being poured into crude futures on the notion of a tighter market following a year of production cuts led by the Organization of the Petroleum Exporting Countries (OPEC) and Russia, which are set to last through 2018. \n“Speculators continued to increase their net long in ICE Brent ... According to exchange data, speculators increased their position by 4,175 lots to leave them with a record net long of 565,459 lots,” ING bank said in a note. \nA slight dip in the amount of rigs in the United States drilling for new oil was supporting WTI, traders said. \nThe number of rigs drilling for oil fell by 5 to 742 in the week to Jan. 5, according to oil services firm Baker Hughes. GETTING AHEAD? \nDespite the recent bull run, which has lifted crude prices by more than 10 percent since early December, some warn that markets are getting ahead of themselves. \nThe U.S. rig-count remains significantly above the low of 316 in June, 2016, and U.S. crude output is expected to break through 10 million barrels per day (bpd) soon, hitting a level that only Russia and Saudi Arabia have achieved so far. \n“U.S. crude oil production is still increasing, so surely this evidences that the system is, once again, becoming even more efficient,” said Matt Stanley, a fuel broker with Freight Investor Services (FIS) in Dubai. \nIn Asia, the world’s biggest oil consuming region, there were also signs that despite the cuts in crude production, fuel supplies remain ample. \nEnjoying good profit-margins in 2017, Asian refiners had cranked up processing to a record 23 million bpd by last October. \nWith profits, known in the oil industry as cracks, now down due to higher feedstock crude prices and ample fuel supplies because of last year’s processing binge, Asian refiners have started to reduce output, likely resulting in lower crude orders. \n“Falling crude throughput will bring downward price pressure in Q1/Q2, as seasonally softening consumption, narrowing distillate cracks and spring maintenance lower run rates,” BMI Research said in a note. Reporting by Henning Gloystein; Editing by Joseph Radford", "external_links": [], "published": "2018-01-09T05:08:00.000+02:00", "crawled": "2018-01-09T09:42:34.997+02:00", "highlightTitle": ""}