{"organizations": [], "uuid": "b433fef6856adf1f8a344f429c9b0fdce49c5b4e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 13}, "facebook": {"likes": 70, "shares": 70, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/05/104568241-RTX3A3CD.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/24/south-korean-president-moon-jae-in-may-be-pandering-to-pyongyang.html", "country": "US", "domain_rank": 767, "title": "South Korean President Moon Jae-In may be pandering to Pyongyang", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-25T06:35:00.000+02:00", "replies_count": 0, "uuid": "b433fef6856adf1f8a344f429c9b0fdce49c5b4e"}, "author": "Nyshka Chandran", "url": "https://www.cnbc.com/2018/01/24/south-korean-president-moon-jae-in-may-be-pandering-to-pyongyang.html", "ord_in_thread": 0, "title": "South Korean President Moon Jae-In may be pandering to Pyongyang", "locations": [], "entities": {"persons": [{"name": "moon jae-in", "sentiment": "none"}, {"name": "kim jong un", "sentiment": "none"}, {"name": "jason lee", "sentiment": "none"}, {"name": "sung-yoon lee", "sentiment": "none"}], "locations": [{"name": "pyongyang south korea", "sentiment": "none"}, {"name": "pyongyang", "sentiment": "none"}], "organizations": [{"name": "korean unification flag", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "tufts university's fletcher school of law", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "South Korea's Olympic peace overture to its nuclear-armed northern neighbor is increasingly coming under fire.\nHopes are high in some quarters that sports diplomacy could advance denuclearization talks, and North Korean leader Kim Jong Un's decision to participate in the upcoming Winter Games was hailed as a win for inter-Korean relations when it was first announced. But critics say South Korean President Moon Jae-In's recent actions — allowing athletes from both sides of the border to march under the Korean Unification Flag and the approval of a joint women's ice hockey team — reveal a leader who is pandering to the rogue state.\nJason Lee | Reuters Those two initiatives are a clear example of \"North Korean exceptionalism\" and display the international community's willingness \"to bend over backwards\" for Pyongyang, according to Sung-Yoon Lee, a Korean studies professor at Tufts University's Fletcher School of Law and Diplomacy.\nOnly four out of 10 South Koreans are in favor of using the unified flag at the opening and closing Olympic ceremonies, according to a recent survey by pollster Realmeter that was reported by Yonhap News. Meanwhile, it's widely believed that the incorporation of North Korean players into the women's ice hockey team could minimize the South's chances of success. With less than three weeks to go until the games, North Korean athletes only just arrived in the South on Thursday to begin training.\nshow chapters \"It pays to provoke' for North Korea 17 Hours Ago | 03:04 \"It is a tough situation to have our team be used for political reasons, but its kind of something that's bigger than ourselves right now,\" Reuters Quote: d head coach Sarah Murray as saying this week.\nCitizens of Asia's fourth-largest economy have taken to social media to complain of Pyeongchang Olympics turning into \"the Pyongyang Olympics.\"\n\"Duyeon Kim Tweet: SKoreans in 20s-30s outraged about joint Korean team, criticizing #PyeongChang2018 as Pyongyang Olympics. Reaction isnt purely political.\"\n(Duyeon Kim is a fellow at the Korean Peninsula Future Forum, a Seoul-based think-tank.)\nIn response, Moon's administration has said that it believes the games \"will be a stepping stone to bring peace to the Korean Peninsula.\" But the negative sentiment has already hit the president's popularity — a Realmeter poll on Thursday showed his ratings dropping to the lowest level since he took office last May, according to Yonhap.\n\"The Moon administration is going overboard to accommodate North Korea,\" Lee said, adding that Moon was \"probably overreaching in seeking North Korea's denuclearization .\nIf this was the first example of North Korean outreach, Moon's optimism would be justified \"but we've seen this movie several times before,\" Lee continued, referring to Pyongyang's previous attempts at sports engagement. North Korean cheerleaders have frequently attended sporting events in the South, including the 2002 Asian Games in Busan, the 2003 Summer Universiade in Daegu and the 2005 Asian Athletics Championships in Incheon.\nKim's latest olive branches — recent inter-Korean discussions and Thursday's call for unification — don't indicate a change of heart, according to Lee. \"All of this was pre-planned,\" he said, explaining that Kim is simply trying to please Seoul in order to obtain more aid payments, which in the past exceeded $900 million a year .", "external_links": ["https://twitter.com/duyeonkim/status/955681576284602368"], "published": "2018-01-25T06:35:00.000+02:00", "crawled": "2018-01-25T05:47:33.002+02:00", "highlightTitle": ""}