{"organizations": [], "uuid": "82d3ffa7df8083572a57ecbd41d9e9d6f3f9e8a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/29/the-associated-press-eu-ready-to-hit-back-if-trump-imposes-anti-eu-trade-measures.html", "country": "US", "domain_rank": 767, "title": "EU ready to hit back if Trump imposes anti-EU trade measures", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T13:33:00.000+02:00", "replies_count": 0, "uuid": "82d3ffa7df8083572a57ecbd41d9e9d6f3f9e8a0"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/29/the-associated-press-eu-ready-to-hit-back-if-trump-imposes-anti-eu-trade-measures.html", "ord_in_thread": 0, "title": "EU ready to hit back if Trump imposes anti-EU trade measures", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "barack obama", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "the european union", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BRUSSELS (AP) — The European Union said Monday that it stands ready to hit back \"swiftly and appropriately\" if U.S. President Donald Trump takes unfair trade measures against the 28-nation bloc.\nThe EU's warning comes less than 24 hours after Trump expressed his annoyance with EU trade policy, saying it \"may morph into something very big.\"\nThe standoff contrasted sharply with relations during the administration of Barack Obama, when both sides sought to create a massive free trade zone between the EU and United States that was argued could yield over $100 billion a year for both sides.\nWhen Trump won the presidential election in November 2016, those hopes evaporated as the new president talked about protecting American jobs and going against multilateral trade deals that he portrayed as detrimental to his \"America First\" policies.\nOn Sunday, Trump said in a British television interview that \"the European Union has been very, very unfair to the United States, and I think it'll turn out to be very much to their detriment.\"\nHe insisted that his trade issues with the EU \"may morph into something very big from that standpoint, from a trade standpoint.\"\nIn the past, he has hinted at punitive measures against trading partners he thought were abusing the U.S. market.\nTrump last week approved tariffs on imported solar-energy components and large washing machines in a bid to help U.S. manufacturers, particularly against competition from China and South Korea. His administration has also pulled out of a Pacific trade deal and is looking to renegotiate the North American Free Trade Agreement.\nEU chief spokesman Margaritis Schinas retorted Monday that \"the EU stands ready to react swiftly and appropriately in case our exports are affected by any restrictive trade measure from the United States.\"\nSchinas said that \"while trade has to be open and fair it also has to be rules-based.\"\nThe issues also came to the fore during last week's World Economic Forum in Davos, Switzerland.\nIn 2016, official figures show, the EU imported 246 billion euros ($304 billion) in goods from the U.S. while exporting some 362 billion euros ($448 billion) to the country. Trump has taken aim at that U.S. deficit of 116 billion euros ($143 billion). In services, the U.S. deficit is much smaller, of only about 13 billion euros ($16 billion).\nThe EU and Germany both called for cooperation Monday.\nGerman government spokesman, Steffen Seibert, noted that Chancellor Angela Merkel set out in Davos last week why her government wants \"an even stronger, more competitive, more self-confident EU that takes over even more international responsibility.\"\n\"But that is not directed against anyone, including the United States of America,\" Seibert told reporters in Berlin. \"We try for solutions, strive for cooperation that is advantageous for both partners.\"\nGeir Moulson in Berlin contributed to this report.", "external_links": [], "published": "2018-01-29T13:33:00.000+02:00", "crawled": "2018-01-29T19:26:41.019+02:00", "highlightTitle": ""}