{"organizations": [], "uuid": "a6d1450eb405ce714dd9f36d5ac8a21583edf068", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221450474&w=1200&r=LYNXMPEE0B0XI", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-olympics-2018-alps-bolivia/bolivias-alpine-skier-overcomes-mountains-of-a-different-kind-idUSKBN1F11L0", "country": "US", "domain_rank": 408, "title": "Bolivia's Alpine skier overcomes mountains of a different kind", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T15:21:00.000+02:00", "replies_count": 0, "uuid": "a6d1450eb405ce714dd9f36d5ac8a21583edf068"}, "author": "", "url": "https://www.reuters.com/article/us-olympics-2018-alps-bolivia/bolivias-alpine-skier-overcomes-mountains-of-a-different-kind-idUSKBN1F11L0", "ord_in_thread": 0, "title": "Bolivia's Alpine skier overcomes mountains of a different kind", "locations": [], "entities": {"persons": [{"name": "brian", "sentiment": "negative"}, {"name": "simon breitfuss kammerlander", "sentiment": "none"}, {"name": "kammerlander", "sentiment": "none"}], "locations": [{"name": "alpine", "sentiment": "none"}, {"name": "bolivia", "sentiment": "none"}, {"name": "austria", "sentiment": "none"}, {"name": "adelboden", "sentiment": "none"}, {"name": "adelboden", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ADELBODEN, Switzerland (Reuters) - Bolivia’s lone Olympic Alpine skier had to overcome mountains of paperwork, as well as ones covered in snow and ice, on his torturous route to a place at next month’s Pyeongchang Games.\nSimon Breitfuss Kammerlander was born and raised in Austria and has no family connection to the Andean nation, meaning that he had go through the laborious process of obtaining citizenship to represent his adopted country.\n“I don’t know how many times I went to the immigration department or how many photocopies I had to make or how many forms I had to fill in,” he told Reuters after taking part in a World Cup slalom race in Adelboden.\n“In total the whole process took a lot of time, six to six and a half years, and in that time it was very difficult to ski and to train.”\nSome countries offer short cuts to athletes hoping to compete for them but Kammerlander obtained no such privileges.\n“A long time ago maybe I could have got around this, but nowadays, everything is done with documents, registrations...it’s really difficult,” the 24-year-old said.\nIt will be the fifth time Bolivia has been represented at the Winter Games and the first since Albertville in 1992.\nMuch of the country lies at over 3,000 metres above sea level and it used to boast the world’s highest ski resort, Chacaltaya at a dizzying 5,300 metres.\nOlder versions of the South American Handbook described a nerve-wracking journey up a winding road to the resort in buses which were not equipped with chains and “drivers not used to driving on snow”.\nBut the single tow rope stopped working around a decade ago after glacier on the mountain disappeared completely and the country now has no official ski resort.\nAlpine Skiing - FIS Alpine Skiing World Cup - Men's Giant Slalom - Adelboden, Switzerland - January 6, 2018 - Bolivia's Simon Breitfuss Kammerlander in action. REUTERS/Stefan Wermuth “Maybe now I am in a position to change something,” Kammerlander said.\n“At the moment, the sport is not very well-known in Bolivia. Hopefully, more youngsters will want to practice this sport, and maybe in the future we will have a lift.”\nLOCAL SKIERS Kammerlander’s affinity with South America began as a child with trips to Argentina where his father, himself a former professional racer, trained local skiers.\nThe 24-year-old’s travels also took him to Bolivia and a chance meeting at a street festival kick-started his skiing career.\n“I began talking to some locals about the mountains and it turned out that they were members of the country’s skiing federation,” he said.\nAt that same time, he had been hoping to ski for Austria. But having failed to make the grade, Bolivia offered an unexpected chance to revive his dream of becoming a professional skier.\nHe moved to the country, living and studying there before finally being awarded citizenship.\nKammerlander now bases himself in Austria for the European winter, competing on the World Cup circuit, and Bolivia in the European summer.\n“It’s perfect as I combine both things - living in Bolivia and being a skier,” said Kammerlander, the first from Bolivia to compete professionally in skiing’s season-long World Cup.\n“It means a lot to me to take part at the Olympics. I feel very proud and privileged to compete under the Bolivian flag.”\nEditing by Ed Osmond\n ", "external_links": [], "published": "2018-01-12T15:21:00.000+02:00", "crawled": "2018-01-12T15:30:29.010+02:00", "highlightTitle": ""}