{"organizations": [], "uuid": "a83b6a243b2b5c0904f70ef2e469af1d4652aba0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/business-wire-apple-hospitality-reit-announces-february-2018-distribution.html", "country": "US", "domain_rank": 767, "title": "Apple Hospitality REIT Announces February 2018 Distribution", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T17:00:00.000+02:00", "replies_count": 0, "uuid": "a83b6a243b2b5c0904f70ef2e469af1d4652aba0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/business-wire-apple-hospitality-reit-announces-february-2018-distribution.html", "ord_in_thread": 0, "title": "Apple Hospitality REIT Announces February 2018 Distribution", "locations": [], "entities": {"persons": [], "locations": [{"name": "richmond", "sentiment": "none"}, {"name": "va.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "apple hospitality reit, inc.", "sentiment": "none"}, {"name": "marriott", "sentiment": "none"}, {"name": "inc", "sentiment": "none"}, {"name": "hilton", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "RICHMOND, Va.--(BUSINESS WIRE)-- Apple Hospitality REIT, Inc. (NYSE:APLE) (the “Company” or “Apple Hospitality”), today announced that its Board of Directors declared a regular monthly cash distribution of $0.10 per common share for the month of February 2018. The distribution is payable on February 15, 2018, to shareholders of record as of February 2, 2018.\nBased on the Company’s common stock closing price of $19.64 on January 18, 2018, the annualized distribution of $1.20 per common share represents an annual yield of approximately 6.1 percent.\nAbout Apple Hospitality REIT, Inc.\nApple Hospitality REIT, Inc. (NYSE: APLE) is a publicly traded real estate investment trust (REIT) that owns one of the largest portfolios of upscale, select-service hotels in the United States. The Company’s portfolio consists of 239 hotels, with approximately 30,300 guest rooms, diversified across the Hilton® and Marriott® families of brands with locations in urban, high-end suburban and developing markets throughout 34 states. For more information, please visit www.applehospitalityreit.com .\nForward-Looking Statements Disclaimer\nCertain statements contained in this press release other than historical facts may be considered forward-looking statements. These forward-looking statements are predictions and generally can be identified by use of statements that include phrases such as “may,” “believe,” “expect,” “anticipate,” “intend,” “estimate,” “project,” “target,” “goal,” “plan,” “should,” “will,” “predict,” “potential,” “outlook,” “strategy,” and similar expressions that convey the uncertainty of future events or outcomes. Such statements involve known and unknown risks, uncertainties, and other factors which may cause the actual results, performance, or achievements of Apple Hospitality to be materially different from future results, performance or achievements expressed or implied by such forward-looking statements. Such factors include, but are not limited to, the ability of Apple Hospitality to effectively acquire and dispose of properties; the ability of Apple Hospitality to implement its operating strategy; changes in general political, economic and competitive conditions and specific market conditions; adverse changes in the real estate and real estate capital markets; financing risks; the outcome of current and future litigation; regulatory proceedings or inquiries; and changes in laws or regulations or interpretations of current laws and regulations that impact Apple Hospitality’s business, assets or classification as a real estate investment trust. Although Apple Hospitality believes that the assumptions underlying the forward-looking statements contained herein are reasonable, any of the assumptions could be inaccurate, and therefore there can be no assurance that such statements included in this press release will prove to be accurate. In light of the significant uncertainties inherent in the forward-looking statements included herein, the inclusion of such information should not be regarded as a representation by Apple Hospitality or any other person that the results or conditions described in such statements or the objectives and plans of Apple Hospitality will be achieved. In addition, Apple Hospitality’s qualification as a real estate investment trust involves the application of highly technical and complex provisions of the Internal Revenue Code. Readers should carefully review Apple Hospitality’s financial statements and the notes thereto, as well as the risk factors described in Apple Hospitality’s filings with the Securities and Exchange Commission, including, but not limited to, in the section entitled “Risk Factors” in the Company’s Annual Report on Form 10-K for the year ended December 31, 2016. Any forward-looking statement that Apple Hospitality makes speaks only as of the date of such statements. Apple Hospitality undertakes no obligation to publicly update or revise any forward-looking statements or cautionary factors, as a result of new information, future events, or otherwise, except as required by law.\nFor additional information or to receive press releases by email, visit www.applehospitalityreit.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180119005296/en/\nApple Hospitality REIT, Inc.\nKelly Clarke, 804-727-6321\nVice President, Investor Relations\nkclarke@applereit.com\nSource: Apple Hospitality REIT, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.applehospitalityreit.com&esheet=51745743&newsitemid=20180119005296&lan=en-US&anchor=www.applehospitalityreit.com&index=1&md5=bf1931c475eb0afedadddfed2da04506", "http://www.businesswire.com/news/home/20180119005296/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.applehospitalityreit.com&esheet=51745743&newsitemid=20180119005296&lan=en-US&anchor=www.applehospitalityreit.com&index=2&md5=cd50823f556c339c576a945674c577bc"], "published": "2018-01-19T17:00:00.000+02:00", "crawled": "2018-01-19T21:02:53.019+02:00", "highlightTitle": ""}