{"organizations": [], "uuid": "3770a2c54b5225469b59008ea6f1820a37453093", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 9, "shares": 9, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-spark-luxturna-novartis/spark-licenses-blindness-gene-therapy-rights-outside-u-s-to-novartis-idUSKBN1FD35R", "country": "US", "domain_rank": 408, "title": "Spark licenses blindness gene therapy rights outside U.S. to Novartis", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T00:23:00.000+02:00", "replies_count": 0, "uuid": "3770a2c54b5225469b59008ea6f1820a37453093"}, "author": "", "url": "https://www.reuters.com/article/us-spark-luxturna-novartis/spark-licenses-blindness-gene-therapy-rights-outside-u-s-to-novartis-idUSKBN1FD35R", "ord_in_thread": 0, "title": "Spark licenses blindness gene therapy rights outside U.S. to Novartis", "locations": [], "entities": {"persons": [{"name": "novartis reut", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "luxturna", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "novartis", "sentiment": "negative"}, {"name": "novartis ag", "sentiment": "none"}, {"name": "reuters) - spark therapeutics inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 10:29 PM / in 14 hours Spark licenses blindness gene therapy rights outside U.S. to Novartis Deena Beasley 3 Min Read \n(Reuters) - Spark Therapeutics Inc, whose breakthrough gene therapy to treat a rare form of blindness was approved by U.S. regulators in December, said on Wednesday that it had licensed rights to the drug outside the United States to Switzerland-based Novartis AG. \nPhiladelphia-based Spark said it will keep U.S. rights to Luxturna, or voretigene neparvovec, which is the first approved gene therapy for an inherited disease. It plans to launch the one-time treatment in March, charging an unprecedented $850,000. \nSpark will receive $105 million from Novartis and up to another $65 million in milestone payments based on near-term European regulatory approval and initial sales in certain markets. Spark is also entitled to future royalties on net sales outside the United States. \nIn a statement, Spark said the deal leverages Novartis’“large, existing commercial and medical infrastructure in ophthalmology, as well as its commitment to commercializing genetic-based medicines.” \nNovartis, which sells opthalmology drugs including macular degeneration treatment Lucentis, last year won U.S. approval for Kymriah, the first of a new type of potent gene-modifying immunotherapy for leukemia. \n“We think this deal is a positive for Spark, as the company will be able to focus on the U.S. launch of Luxturna, leaving the ex-U.S. launch and commercialization to Novartis, a leader in the ophthalmology space,” Jefferies analyst Michael Yee said in a note to investors. \nLuxturna treats inherited retinal disease caused by defects in a gene known as RPE65, which affects between 1,000 and 2,000 people in the United States. It works by delivering by an eye injection viral vector particles containing a correct copy of the gene to retinal cells, restoring their ability to make a needed enzyme. \nShares of Spark, which fell 2 percent to close at $55.36 in regular trading on Wednesday, were up 3 percent at $57 after hours. The shares have lost nearly 25 percent of their value since mid-December when investors were disappointed by trial data for Spark’s experimental gene therapy for hemophilia A. Reporting y Deena Beasley; Editing by Susan Thomas and Tom Brown", "external_links": [], "published": "2018-01-25T00:23:00.000+02:00", "crawled": "2018-01-25T00:32:49.008+02:00", "highlightTitle": ""}