{"organizations": [], "uuid": "e6cf3bc2a66d754d4ec14093ec966d87bb48ce1b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 8, "shares": 8, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/healthNews", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-health-kids-reading/parent-reading-workshops-can-help-low-income-kids-learn-idUSKBN1F82SN", "country": "US", "domain_rank": 408, "title": "Parent reading workshops can help low-income kids learn", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T00:51:00.000+02:00", "replies_count": 0, "uuid": "e6cf3bc2a66d754d4ec14093ec966d87bb48ce1b"}, "author": "", "url": "https://www.reuters.com/article/us-health-kids-reading/parent-reading-workshops-can-help-low-income-kids-learn-idUSKBN1F82SN", "ord_in_thread": 0, "title": "Parent reading workshops can help low-income kids learn", "locations": [], "entities": {"persons": [{"name": "lisa rapaport", "sentiment": "none"}], "locations": [{"name": "brazil", "sentiment": "none"}, {"name": "boa vista", "sentiment": "none"}], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters Health) - Even in communities where many people lack a high school degree, reading workshops for parents can give their kids a leg up on learning in preschool, a study in Brazil suggests.\nLots of research has shown that reading to young kids can help improve their language development and cognitive skills. But while programs teaching parents the best ways to read with young kids have proven effective in affluent areas, less is known about how well these interventions work for poor children whose parents have lower levels of education and literacy.\nFor the current study, researchers tested a reading program for parents of kids at 22 free child care centers for low-income families in Boa Vista, a city in northern Brazil. At the start of the school year, half of the centers were randomly selected to offer parents the chance to participate in the reading program, while the rest of the centers provided only traditional daycare.\nFamilies at the centers with reading programs could borrow books each week, and parents could participate in monthly workshops focused on reading aloud and interacting with kids during story time. By the end of the school year, children in these families scored higher in assessments of cognitive skills, language and memory than kids at centers that didn’t offer reading programs.\n“Because books contain language and ideas that are much more diverse and complex than typical speech to children, this increase in shared reading supported children’s learning of new words and concepts as well as their ability to engage in more abstract thinking, which was reflected in tests of vocabulary, memory and IQ,” said lead study author Adriana Weisleder, a pediatrics researcher at New York University School of Medicine.\nSince the families in the study had limited education and income, the results suggest that the intervention might be successfully duplicated in countries where many parents need help learning how to read with their kids, Weisleder said by email.\n“This provides strong experimental evidence that the benefits of parent-child shared reading are observed across countries and cultures,” Weisleder added.\nAltogether, the study included 279 parent-child pairs at centers offering the reading program and a control group of 287 parent-child pairs at centers without the program.\nMost of the parents who joined the study were mothers, and roughly two-thirds of them were married or living with a partner. Half of them earned no more than minimum wage and about 40 percent didn’t finish high school.\nIn the reading program, parents attended monthly workshops with a facilitator who guided discussions about reading aloud and other opportunities for interacting with children such as play and talking during everyday routines.\nDuring each workshop, parents shared their experiences of reading aloud at home, discussed any potential barriers and solutions to reading aloud including challenges with child behavior, and practiced reading aloud with their child.\nOne limitation of the study is that it excluded parents who were not available when families were enrolled, which might have skewed the results toward families with parents that had more ability to participate. The study was also limited to children enrolled in daycare, and might not reflect what would happen for kids outside of this setting.\nEven so, the parenting program in the study could be incorporated into existing child care programs and has the potential for widespread dissemination, said Dr. Caroline Kistin, a pediatrics researcher at Boston University School of Medicine who wasn’t involved in the study.\n“Programs such as the workshops studied here can help parents engage and support their children during shared reading and move beyond simply reading the words on the page,” Kistin said by email.\n“Common interactive approaches include asking the child questions about what characters are thinking, letting the child explain the scene, and discussing the meaning of the story after the book is finished,” Kistin added. “These conversations expose children to complex language and ideas, which in turn promote early literacy skills.”\nSOURCE: bit.ly/2EVPQcG Pediatrics, online December 28, 2017.\n ", "external_links": [], "published": "2018-01-20T00:51:00.000+02:00", "crawled": "2018-01-20T01:17:12.001+02:00", "highlightTitle": ""}