{"organizations": [], "uuid": "64371ae5174c5e2a24c53df84a09357c661a2673", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 13, "shares": 13, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/08/104934855-GettyImages-865402794.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/08/china-fintech-jianpu-ceo-david-ye-shrugs-off-competition-regulatory-crackdown.html", "country": "US", "domain_rank": 767, "title": "China fintech: Jianpu CEO David Ye shrugs off competition, regulatory crackdown", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.106, "site_type": "news", "published": "2018-01-09T05:44:00.000+02:00", "replies_count": 0, "uuid": "64371ae5174c5e2a24c53df84a09357c661a2673"}, "author": "Cheang Ming", "url": "https://www.cnbc.com/2018/01/08/china-fintech-jianpu-ceo-david-ye-shrugs-off-competition-regulatory-crackdown.html", "ord_in_thread": 0, "title": "China fintech: Jianpu CEO David Ye shrugs off competition, regulatory crackdown", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "12 Hours Ago | 02:51 \nChina's burgeoning financial technology industry went through plenty of ups and downs last year, but growing pains experienced in the sector aren't fazing one local player. \nGrowth in the fintech space — which encompasses everything from peer-to-peer lending to insurance technology (insurtech) — has been rapid. And that's been on top of a sector that was already estimated to be worth more than 12 trillion yuan ($1.8 trillion) at the end of 2015, according to McKinsey. \nLast year saw multiple Chinese fintech firms, including Qudian , PPDai , Hexindai and Jianpu , launch initial public offerings in the U.S. \nBut increased competition in the space doesn't suggest the sector is overcrowded, according to David Ye, the co-founder and CEO of Jianpu Technology. \n\"Keep in mind: The market is huge ... The growth has just started,\" Ye told CNBC on the sidelines of the Morgan Stanley China Technology, Media & Telecoms Conference in Beijing. \n\"In China, we have close to 9,000 microfinance companies, we have close to 2,000 peer-to-peer companies. Only four of them got listed ... It's just a tiny drop of water in the big blue ocean,\" he said. \nJianpu, a platform for financial product recommendations, was listed in November last year on the New York Stock Exchange. It connects some 95 million monthly active users with 2,500 financial service providers, according to Ye. \nYe also said the mainland's regulatory crackdown against peer-to-peer lenders and microlenders was ultimately beneficial to ensuring a healthy and sustainable market. \n\"We want to give credit to Chinese regulators because, compared to other Western countries like the U.S., the overall regulatory framework is more supportive [in China],\" Ye said. \nHe added that Jianpu's position as an independent platform meant that it didn't have credit or liquidity risks that were associated with other fintech companies. ", "external_links": [], "published": "2018-01-09T05:44:00.000+02:00", "crawled": "2018-01-09T10:01:07.008+02:00", "highlightTitle": ""}