{"organizations": [], "uuid": "8d3d7c156b2d01547d842f1c0049a470830cdcbb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224078985&w=1200&r=LYNXMPEE0L0HQ", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/philippines-volcano/philippines-raises-volcano-alert-again-hazardous-eruption-seen-imminent-idINKBN1FB0PG", "country": "US", "domain_rank": 408, "title": "Philippines raises volcano alert again; hazardous eruption seen imminent", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T09:32:00.000+02:00", "replies_count": 0, "uuid": "8d3d7c156b2d01547d842f1c0049a470830cdcbb"}, "author": "", "url": "https://in.reuters.com/article/philippines-volcano/philippines-raises-volcano-alert-again-hazardous-eruption-seen-imminent-idINKBN1FB0PG", "ord_in_thread": 0, "title": "Philippines raises volcano alert again; hazardous eruption seen imminent", "locations": [], "entities": {"persons": [{"name": "renato solidum", "sentiment": "none"}], "locations": [{"name": "philippines", "sentiment": "none"}, {"name": "manila", "sentiment": "none"}, {"name": "albay", "sentiment": "none"}, {"name": "mayon", "sentiment": "none"}], "organizations": [{"name": "philippine institute of volcanology and seismology", "sentiment": "none"}, {"name": "phivolcs", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MANILA (Reuters) - The Philippines raised the alert level at its Mayon volcano on Monday after a loud explosion in the wake of increased activity made a hazardous eruption likelier, prompting authorities to close all schools and urge residents to stay indoors.\nMayon, the country’s most active volcano, has been spewing ash, lava, and pyroclastic material since Jan. 13, displacing close to 40,000 residents in the central province of Albay.\nThe Philippine Institute of Volcanology and Seismology (Phivolcs) raised its alert on Mayon to level 4, signifying a hazardous eruption is imminent, from level 3, which warns that such an eruption could be “weeks or even days” away.\n“We strongly advise all people, both residents and tourists, to avoid the danger zone, and airlines to avoid flying near the volcano summit,” agency chief Renato Solidum told a news conference.\nThe danger zone around the 2,462-metre (8,077-foot) volcano has been expanded to a radius of 8 km (5 miles), he added.\nAn ash cloud hovers over Mayon volcano, as seen from the Bicol Region, Philippines, in this still image taken from a January 21,2018 social media video. Randall Matthew Lorayes via REUTERS Solidum said the agency had recorded increased seismic activity and “lava fountaining and a summit explosion” from Sunday night, indicating more explosions ahead, including a hazardous eruption.\nA level 5 alert signifies a hazardous eruption is underway.\nAlbay province has run out of emergency funds and more people would be evacuated once government financial help arrived, said provincial governor Al Francis Bichara.\nHe ordered schools to suspend classes, amid ash fall warnings following the explosion at the volcano.\n“In some areas...it’s already zero visibility, especially along the foot of the volcano,” he told CNN Philippines, adding that strong winds could carry ash to distant towns.\n“(People) have to stay home and if they intend to get out of their houses, they have to wear masks,” Bichara said.\nReporting by Enrico dela Cruz; Editing by Martin Petty and Clarence Fernandez\n ", "external_links": [], "published": "2018-01-22T09:32:00.000+02:00", "crawled": "2018-01-22T10:04:57.028+02:00", "highlightTitle": ""}