{"organizations": [], "uuid": "c71d4089ef05b7558e764d42e1fcc88dd82929b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180120&t=2&i=1223623184&w=1200&r=LYNXMPEE0J0G0", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-germany-politics/german-spd-leaders-upbeat-as-biggest-branch-backs-coalition-talks-idUKKBN1F90KX", "country": "US", "domain_rank": 408, "title": "German SPD leaders upbeat as biggest branch backs coalition talks", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T15:31:00.000+02:00", "replies_count": 0, "uuid": "c71d4089ef05b7558e764d42e1fcc88dd82929b8"}, "author": "", "url": "https://uk.reuters.com/article/uk-germany-politics/german-spd-leaders-upbeat-as-biggest-branch-backs-coalition-talks-idUKKBN1F90KX", "ord_in_thread": 0, "title": "German SPD leaders upbeat as biggest branch backs coalition talks", "locations": [], "entities": {"persons": [{"name": "angela merkel", "sentiment": "none"}, {"name": "martin schulz", "sentiment": "none"}, {"name": "michael nienaber", "sentiment": "none"}, {"name": "schulz", "sentiment": "none"}], "locations": [{"name": "germany", "sentiment": "none"}, {"name": "north rhine-westphalia", "sentiment": "none"}], "organizations": [{"name": "spd", "sentiment": "negative"}, {"name": "min read  berlin", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "social democrats", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 20, 2018 / 1:33 PM / Updated an hour ago German SPD leaders upbeat as biggest branch backs coalition talks Michael Nienaber 4 Min Read \nBERLIN (Reuters) - Senior members of Germany’s Social Democrats (SPD) said on Saturday they were confident the party would approve the start of formal coalition talks with Chancellor Angela Merkel’s conservatives at a special congress this weekend. \nThe upbeat comments came after the SPD’s biggest regional branch in North Rhine-Westphalia recommended its members to vote in favour of entering negotiations, on condition that party leader Martin Schulz pushes for more concessions on labour, health and migration policies. \nAround 600 SPD delegates vote on Sunday on whether their leaders should press ahead with talks on renewing an alliance with the conservatives that has governed Germany since 2013. \nThe two groups struck a preliminary deal last week but Schulz is facing a strong backlash from the SPD’s left and youth wings, which argue that the blueprint does not bear enough of the party’s hallmarks. \nThey say the SPD would be better off in opposition after last year scoring its worst election result since Germany became a federal republic in 1949. \nSchulz defended the preliminary deal. \n“Toll-free day care facilities for children, a strong Europe and decent care of the elderly - that will only happen when we join the government,” Schulz said in a tweet. \n“To seize the opportunity to considerably help many people is a duty for me,” Schulz added. \nSPD parliamentary leader Andrea Nahles said she still expected formal talks to happen. \n“I expect a majority to back coalition negotiations,” Nahles told Welt am Sonntag newspaper. “Nevertheless, I ask everyone in my party to take responsibility: Please consider the consequences if this government option fails.” \nSpeaking to reporters in Bulgaria, Merkel said she hoped the SPD would approve the start of formal coalition talks. FILE PHOTO: Kevin Kuehnert, the head of the SPD’s youth wing, speaks during an SPD party convention in Berlin, Germany, December 7, 2017. REUTERS/Fabrizio Bensch/File Photo \n“We will wait for the SPD party congress and then hopefully start coalition talks,” Merkel said. ROOM FOR MANOEUVRE? \nA negative vote by the SPD on Sunday would prolong political deadlock in Europe’s largest economy, which has been without a government since the Sept. 24 election that weakened both blocs. \nPossible scenarios then would include new elections or a minority government for what would be the first time in Germany’s post-war era. \nSPD General Secretary Lars Klingbeil told regional newspaper Neue Osnabruecker Zeitung he expected the delegates to approve the start of coalition talks. \n“The SPD knows very well what it wants, what it does not want and what is good for the people in the country,” he said. \nMichael Groschek, leader of the SPD’s biggest regional branch in NRW, said he also expected a positive outcome, though the final coalition deal would “for certain” have to look different from the blueprint. Related Coverage Germany's Merkel hopes SPD will approve talks with her CDU party \nThe SPD branch in that region wants a final coalition agreement to include a call to abolish Germany’s dual public-private health insurance system in favour of a single citizen’s insurance, to scale back temporary employment contracts and to allow family reunions for asylum seekers suffering unusual hardship. \nMerkel’s conservatives and leading business associations have urged the SPD delegates to back coalition talks, saying a rejection could plunge the country into a severe political crisis. \nBut Thomas Strobl, party deputy of Merkel’s Christian Democrats (CDU), rejected the SPD’s latest demands for more policy changes to be included in the final coalition deal. \n“We’ll still be talking about details - but basic things that are not already in the blueprint won’t be added during coalition negotiations,” Strobl told Funke media group. Reporting by Michael Nienaber; Editing by Andrew Bolton", "external_links": [], "published": "2018-01-20T15:31:00.000+02:00", "crawled": "2018-01-20T16:11:00.089+02:00", "highlightTitle": ""}