{"organizations": [], "uuid": "0f4da1ab3166791c8adac6c02a277606ccb02ad9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 6}, "facebook": {"likes": 19, "shares": 19, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/28/104973002-2103908064.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/tabikaeru-a-mobile-game-about-a-traveling-frog-is-a-hit-in-china.html", "country": "US", "domain_rank": 767, "title": "'Tabikaeru' a mobile game about a traveling frog is a hit in China", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.301, "site_type": "news", "published": "2018-01-29T09:58:00.000+02:00", "replies_count": 0, "uuid": "0f4da1ab3166791c8adac6c02a277606ccb02ad9"}, "author": "Cheang Ming", "url": "https://www.cnbc.com/2018/01/29/tabikaeru-a-mobile-game-about-a-traveling-frog-is-a-hit-in-china.html", "ord_in_thread": 0, "title": "'Tabikaeru' a mobile game about a traveling frog is a hit in China", "locations": [], "entities": {"persons": [{"name": "tabikaeru", "sentiment": "positive"}, {"name": "hit-point", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CNBC A screenshot of \"Tabikaeru: Journey Frog,\" a mobile game created by Japanese developer Hit-Point. \nA free mobile game about a traveling frog has become a hit in China , despite being available only in Japanese. \nCalled \"Tabikaeru: Travel Frog,\" the main protagonist of the game is a frog that goes on adventures around Japan. Players collect clovers that grow in the frog's garden so they can buy supplies for the frog's journeys. \nIn turn, the frog sends players souvenirs and snapshots from its travels. Users cannot control when the frog chooses to go on its adventures. \nWhile news of the game's appeal among mobile phone users on the mainland was first reported on by local media outlets last week, its popularity hasn't diminished in any way since: \"Travel Frog\" on Monday was still ranked first on a list of the most downloaded games from Apple's app store in China. CNBC \"Tabikaeru: Journey Frog\" ranks at the top of the list of the most popular free mobile apps on Apple's app store in China on Jan. 29, 2017. \nBehind the craze is Japanese game developer Hit-Point, which was previously best-known for creating the popular cat-collecting game \"Neko Atsume.\" \nEven though it's difficult to pinpoint what has driven interest among mainland users in \"Travel Frog,\" which is still only available in Japanese, local media outlets reported that mainland players said the game's slow nature was part of its charm. \nThe game was popular as it \"tap[ped] the trend among younger generations in China to search out 'Zen-like' activities,\" China Daily said , adding that those users were taken with its \"Buddha-style gameplay.\" \nBut not everyone is thrilled about \"Travel Frog.\" \nIn a post on social media platform Weibo last week, the state-run People's Daily opined that people should aim to enrich themselves and \"avoid being a lonely frog-raising youth.\" \nAs an indication of the popularity of the \"Travel Frog,\" Apple has already had to remove from its store an app that appeared to masquerade as the Chinese version of the original, the South China Morning Post reported . \nThat version of the game, which was created by a developer called Song Yang, charged users 30 yuan ($4.74) to download the game, the South China Morning Post said. \nOn Monday, another free-to-download app available on the app store claimed it offered strategies and guides in Chinese that players could adopt to improve gameplay. \nWhile Hit-Point has not responded to inquiries about whether or not it intends to develop versions of the game in other languages, the company did put out an English update for \"Neko Atsume\" in 2015.", "external_links": [], "published": "2018-01-29T09:58:00.000+02:00", "crawled": "2018-01-29T09:58:18.041+02:00", "highlightTitle": ""}