{"organizations": [], "uuid": "b8fddee43638bfe0e65ad5579d1d52356aa449c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180101&t=2&i=1218492559&w=1200&r=LYNXMPEE000LC", "site_section": "https://www.reuters.com/news/entertainment", "section_title": "Entertainment Industry &amp; Celebrity News | Reuters.com", "url": "https://www.reuters.com/article/us-usa-boxoffice/box-office-star-wars-the-last-jedi-tops-1-billion-worldwide-idUSKBN1EQ0NE", "country": "US", "domain_rank": 408, "title": "Box Office: 'Star Wars: The Last Jedi' Tops $1 Billion Worldwide", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-01T08:52:00.000+02:00", "replies_count": 0, "uuid": "b8fddee43638bfe0e65ad5579d1d52356aa449c5"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-boxoffice/box-office-star-wars-the-last-jedi-tops-1-billion-worldwide-idUSKBN1EQ0NE", "ord_in_thread": 0, "title": "Box Office: 'Star Wars: The Last Jedi' Tops $1 Billion Worldwide", "locations": [], "entities": {"persons": [{"name": "disney-lucasfilm", "sentiment": "negative"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "variety.com", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "disney", "sentiment": "none"}, {"name": "universal-illumination", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 1, 2018 / 12:52 AM / Updated 17 hours ago Box Office: 'Star Wars: The Last Jedi' Tops $1 Billion Worldwide Dave McNary 6 Min Read \nLOS ANGELES (Variety.com) - Disney-Lucasfilm’s “Star Wars: The Last Jedi” has cleared the $1 billion milestone in worldwide grosses in less than three weeks. \n“Star Wars: The Last Jedi” pulled in $120.4 million globally on the New Year’s Eve weekend with $52.4 million at 4,232 domestic venues and $68 million internationally during the Friday-Sunday period. \n“The Last Jedi” is now the eighth highest-grossing domestic movie of all time with $517.1 million -- only $15 million behind last year’s “Rogue One: A Star Wars Story” in the seventh spot. On the worldwide chart, it’s now 24th with $1.04 billion, edging Universal-Illumination’s “Despicable Me 3.” The tentpole’s international total, currently at $523.2 million, will see a significant jolt when it opens on Jan. 5 in China, its final market. \n“Star Wars: The Last Jedi” has also topped Disney’s “Beauty and the Beast,” which grossed $504 million in North America, for the top spot among 2017 releases domestically. It’s the fourth 2017 title to go past $1 billion worldwide, along with “Beauty and the Beast” at $1.26 billion, “The Fate of the Furious” at $1.24 billion and “Despicable Me 3” at $1.03 billion. \n“The Last Jedi” is also winning the domestic weekend box office crown for the third time with $52.4 million, edging Sony’s “Jumanji: Welcome to the Jungle,” which took in $50.6 million at 3,765 locations for the Friday-Sunday. However, Sony’s projection showed the “Jumanji” sequel grossing $16.5 million on New Year’s Day on Monday -- well above Disney’s forecast of $13.2 million for “The Last Jedi.” Should those numbers hold, “Jumanji” would edge “Jedi” over the four-day period with $67 million, winning by $1.4 million. \n“Jumanji” has been “The Last Jedi‘s” biggest competitor by far since it opened on Dec. 20. The action-comedy should wind up with an 11-day domestic total of $186.3 million by the end of Monday. The action-comedy, starring Dwayne Johnson and Kevin Hart, has a $90 million budget. It’s also performed impressively in international markets with $107 million thr0ugh Dec. 28. \n“Jedi” and “Jumanji” helped lift the entire domestic box office for 2017 to $11.12 billion, down 2.3% from last year’s $11.38 billion and off slightly from 2015’s $11.14 billion, according to comScore. The gap for 2017 had been more than 6% at the end of the worst summer in a decade but performances by “It,”“Thor: Ragnarok,”“Justice League,”“Jedi” and “Jumanji” closed most of that margin. \n“With another $11 billion plus year on the books, the industry looks ahead to awards season and a 2018 packed with blockbuster titles and a hope for a year slightly less volatile than 2017,” said Paul Dergarabedian, senior media analyst with comScore. Universal’s “Pitch Perfect 3” led the rest of weekend’s domestic pack with a projected $22.7 million at 3,468 locations for Friday-Monday, lifting its 11-day total to $69.2 million. The comedy threequel, starring Anna Kendrick and Rebel Wilson, took in $13.1 million this weekend from 34 international markets for a foreign total of $28.6 million. \nHugh Jackman’s musical drama “The Greatest Showman” is finishing a close fourth with $20.3 million at 3,316 theaters forecasted for the four days. The Fox-Chernin Entertainment title showed the biggest gain in the top 10 movies from the Christmas Eve weekend with an impressive 73% surge. The domestic total should hit $53.8 million through Monday. \nFox’s second weekend of “Ferdinand” -- the only film to open on the same weekend as “The Last Jedi” -- followed in fifth with $15.1 million at 3,337 North American venues, giving the animated comedy $57.3 million in 18 days. Disney-Pixar’s seventh weekend of “Coco” finished sixth with a projected $8.8 million at 2,845 sites for a domestic total of $181.1 million and $539 million worldwide. \nSony’s “All the Money in the World” and Focus Features’“The Darkest Hour” were in a battle for seventh place at about $7.2 million for the four days. “All the Money” opened on Christmas Day as the final wide release of the year at 2,074 locations after director Ridley Scott excised Kevin Spacey’s scenes and reshot them with Christopher Plummer as J. Paul Getty, following the early November sexual abuse allegations against Spacey. Its eight-day total will be around $14.4 million. \nAwards contender “Darkest Hour,” starring Gary Oldman as the 1940 version of Winston Churchill, expanded to 943 venues in its sixth weekend and will have taken in $19.8 million by the end of the weekend. Focus reported strong performance in Washington, D.C./Maryland, Phoenix, Boston, Salt Lake City, and Florida markets. \n“‘Darkest Hour’ is taking America by storm,” said distribution chief Lisa Bunnell. “We’re seeing audiences coming out in big numbers. It’s a movie they found inspiring over the holiday break and the word of mouth gives us a strong outlook for the upcoming weeks.” \nMatt Damon’s comedy-drama “Downsizing” finished ninth with a projected $6 million at 2,664 sites for the four days for Paramount. The 11-day total for “Downsizing,” which carries a $65 million budget and was directed by Alexander Payne, should come in around $18.5 million. \nWarner Bros.-Alcon Entertainment’s second weekend of R-rated comedy “Father Figures” rounded out the top 10 with a projected $5.5 million at 2,902 locations. The 11-day total for the Owen Wilson-Ed Helms vehicle, which has a $25 million price tag, should hit about $14 million.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-01T08:52:00.000+02:00", "crawled": "2018-01-01T04:03:31.004+02:00", "highlightTitle": ""}