{"organizations": [], "uuid": "c9f92bc3ee4f0addd2138fb6fb292f217c259c0e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222965401&w=1200&r=LYNXMPEE0H0IK", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-bhutan-change/dance-bars-mobile-phones-and-chelsea-jerseys-changing-face-of-bhutan-idUKKBN1F70U1", "country": "US", "domain_rank": 408, "title": "Dance bars, mobile phones and Chelsea jerseys: changing face of Bhutan", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T10:15:00.000+02:00", "replies_count": 0, "uuid": "c9f92bc3ee4f0addd2138fb6fb292f217c259c0e"}, "author": "", "url": "https://uk.reuters.com/article/uk-bhutan-change/dance-bars-mobile-phones-and-chelsea-jerseys-changing-face-of-bhutan-idUKKBN1F70U1", "ord_in_thread": 0, "title": "Dance bars, mobile phones and Chelsea jerseys: changing face of Bhutan", "locations": [], "entities": {"persons": [{"name": "bhut", "sentiment": "negative"}, {"name": "cathal mcnaughton", "sentiment": "none"}, {"name": "lhaden", "sentiment": "none"}], "locations": [{"name": "bhutan", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "thimphu", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "chelsea", "sentiment": "negative"}, {"name": "min read  thimphu", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 19 AM / Updated 26 minutes ago Dance bars, mobile phones and Chelsea jerseys: changing face of Bhutan Cathal McNaughton 3 Min Read \nTHIMPHU (Reuters) - For decades Bhutan had no television, no traffic lights and a culture that had barely changed in centuries. \nToday, bars dot the capital, Thimphu, set in mist-covered mountains, teenagers crowd internet cafes to play violent video games, and men smoke and gamble in snooker halls. \nThere are still no traffic lights after residents protested against the installation of one, but otherwise the once-isolated Buddhist country tucked between India and China is changing, and bringing the modern world's problems in its wake. (Click reut.rs/2Dc5U9E for a picture package of Bhutan's changing face.) \nInside a gaudily lit dance club, guests watch a 38-year-old woman swaying to the songs they choose, usually traditional folk music but sometimes a Bollywood number or two. \nLhaden, a divorced mother-of-two, dances until midnight, and like thousands of her compatriots, is struggling to make ends meet. \n“I‘m not happy or sad about things, I have no other choice,” said Lhaden, who only has one name. \nBhutan measures its national wealth by a Gross National Happiness index aiming to build a contented, fulfilled society. But Lhaden, who earns $125 a month, is counting the pennies. A man sings in a Karaoke bar beside a portrait of King Jigme Khesar Namgyel Wangchuck in the capital city of Thimphu, Bhutan, December 16, 2017. REUTERS/Cathal McNaughton \n“I live in such a small flat so I can afford food and clothes.” \nSigns of change are everywhere, pulling the country of snow-capped, jagged mountains, forests, rivers and clean air into the modern world. \nSmoke billows from construction sites across the country and a giant bronze-and-gold Buddha statue that commands the entry to the Thimphu valley now shares space with modern telecom towers. Slideshow (27 Images) \nOn the streets and even in the countryside, jeans have become as commonplace as the traditional Bhutanese knee-length gho robes for men and the ankle-length kira dresses that women wear. \nBhutan’s $2.2 billion economy remains predominantly agricultural, but mobile phones and TV sets are everywhere, even in the Phobjikha valley, a tourist haven about seven hours’ drive from Thimphu and in winter, home to Bhutan’s famed black-necked cranes. \n“Children are spending more time on their mobile phones and not studying,” said Ap Daw, 43, a farmer who also bemoans the rising mounds of trash by the road. \nNext to his house, a squad of Buddhist monks has discarded their crimson robes to play football, in Manchester United and Chelsea jerseys. \nDaw’s 13-year-old son, Sonam Tshering, a football fan himself, has big dreams too. \n“I would love to become a science teacher and watch Cristiano Ronaldo play for Real Madrid,” said Sonam as he helped feed the family cattle. Writing by Tony Tharakan; Editing by Sanjeev Miglani", "external_links": [], "published": "2018-01-18T10:15:00.000+02:00", "crawled": "2018-01-18T10:50:16.004+02:00", "highlightTitle": ""}