{"organizations": [], "uuid": "da943c0ad1cab1e41006ba754e9aa428c8b4e730", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-cyxtera-to-acquire-immunity-inc.html", "country": "US", "domain_rank": 767, "title": "Cyxtera To Acquire Immunity Inc.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.746, "site_type": "news", "published": "2018-01-08T16:30:00.000+02:00", "replies_count": 0, "uuid": "da943c0ad1cab1e41006ba754e9aa428c8b4e730"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-cyxtera-to-acquire-immunity-inc.html", "ord_in_thread": 0, "title": "Cyxtera To Acquire Immunity Inc.", "locations": [], "entities": {"persons": [{"name": "cyxtera", "sentiment": "none"}], "locations": [{"name": "miami", "sentiment": "none"}], "organizations": [{"name": "cyxtera to acquire immunity inc", "sentiment": "negative"}, {"name": "cyxtera technologies", "sentiment": "negative"}, {"name": "immunity inc", "sentiment": "none"}, {"name": "global", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MIAMI, Jan. 8, 2018 /PRNewswire/ -- Cyxtera Technologies, the secure infrastructure company, today announced it has entered into a definitive agreement to acquire privately-held Immunity Inc. Founded in 2002, Miami-based Immunity is recognized as a global leader in offense-oriented systems vulnerability research, exploit development and penetration testing services, and is also known for its real-world approach to vulnerability assessments and deeply experienced team. When the transaction closes, Cyxtera will incorporate Immunity's offerings into its expanding portfolio of threat analytics solutions and leverage the team's capabilities across its global infrastructure platform and customer base. The transaction is expected to close in the current quarter, pending regulatory approvals and customary closing conditions.\nImmunity delivers its products and services to Global 2,000 companies and government agencies. A concentration on offense-oriented techniques and technologies distinguishes Immunity from organizations that attempt to address only defensive security postures in their service or product lines. Founded by chief executive officer Dave Aitel, Immunity's leadership team also includes Bas Alberts and Nico Waisman, two acknowledged experts in the vulnerability research and exploit development space.\n\"We know the team at Cyxtera well and are excited to take this next step to expand our reach and resources,\" said Aitel. \"We're proud to be joining forces, where our combined capabilities will help Cyxtera further its vision of delivering a secure infrastructure platform.\"\nImmunity Highlights\nINNUENDO – An advanced penetration testing tool for modeling data exfiltration attacks CANVAS – A trusted assessment tool that allows penetration testing and hostile attack simulations to be conducted by security professionals Specialized attack and assessment services – including penetration testing, application assessments, vulnerability analysis, reverse engineering, architecture review and source code review\nImmunity's business lines include testing, assessment and consulting services as well as specialized security products designed to aid in the hunt for adversaries. In addition, the company owns and operates Infiltrate, the premier annual technical conference exclusively focused on offense and counter-offense security issues.\n\"In the security industry, it's rare that you can blend together offense and defense-oriented capabilities,\" said Christopher Day, chief cybersecurity officer of Cyxtera. \"The advantages of combining Immunity's products and services with Cyxtera's portfolio creates an opportunity to approach cybersecurity in a truly holistic manner. The expertise developed in both companies is highly complementary; it will strengthen our ability to help customers better secure their infrastructure.\"\nBenefits of Immunity acquisition to Cyxtera customers:\nWorld-class services portfolio addressing the complete cyber-attack lifecycle Comprehensive suite of offense and defensive solutions Automated and continuous penetration testing and advanced adversary simulation services\n\"We're pleased to welcome Immunity to the Cyxtera family,\" said Manuel D. Medina, chief executive officer of Cyxtera. \"They bring a world-renowned team and an exceptional set of capabilities to our organization, which will help us not only extend our existing cybersecurity offerings, but also help harden and augment our entire portfolio and global data center platform.\"\nAbout Cyxtera\nCyxtera Technologies combines a worldwide footprint of 57 best-in-class data centers with a portfolio of modern, cloud- and hybrid-ready security and analytics offerings – providing more than 3,500 enterprises, government agencies and service providers an integrated, secure and resilient infrastructure platform for critical applications and systems. For more information about Cyxtera visit http://www.cyxtera.com/ .\nAbout Immunity\nImmunity Inc. is a prominent offensive security firm that serves the financial sector, large enterprises and government agencies. Founded in 2002, the company is hired by clients to assess network and application security. Immunity also develops advanced security tools that are widely used within the security industry and by the security teams of major corporations. Immunity is a past member of DARPA's Cyber Fast Track program and hosts the annual security conference Infiltrate . The company is headquartered in Miami, Florida with offices in Washington, D.C. and Buenos Aires, Argentina. For more information on Immunity please visit www.immunityinc.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/cyxtera-to-acquire-immunity-inc-300578683.html\nSOURCE Cyxtera Technologies", "external_links": ["http://www.cyxtera.com/", "http://www.immunityinc.com/", "http://www.infiltratecon.com/", "http://www.prnewswire.com/news-releases/cyxtera-to-acquire-immunity-inc-300578683.html"], "published": "2018-01-08T16:30:00.000+02:00", "crawled": "2018-01-08T19:39:54.003+02:00", "highlightTitle": ""}