{"organizations": [], "uuid": "281b16749f9047f7171eadce252582a5323ff4ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/business-wire-fluent-promotes-matthew-koncz-to-president-of-performance-media-group.html", "country": "US", "domain_rank": 767, "title": "Fluent Promotes Matthew Koncz to President of Performance Media Group", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.901, "site_type": "news", "published": "2018-01-31T16:30:00.000+02:00", "replies_count": 0, "uuid": "281b16749f9047f7171eadce252582a5323ff4ab"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/business-wire-fluent-promotes-matthew-koncz-to-president-of-performance-media-group.html", "ord_in_thread": 0, "title": "Fluent Promotes Matthew Koncz to President of Performance Media Group", "locations": [], "entities": {"persons": [{"name": "matthew koncz", "sentiment": "negative"}, {"name": "matt", "sentiment": "none"}, {"name": "koncz", "sentiment": "none"}, {"name": "ryan schulke", "sentiment": "none"}, {"name": "schulke", "sentiment": "none"}], "locations": [{"name": "york", "sentiment": "none"}], "organizations": [{"name": "performance media group the company continues to strengthen its leadership team", "sentiment": "negative"}, {"name": "llc", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "performance media group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Company Continues to Strengthen its Leadership Team as it Prepares to Expand Internationally\nNEW YORK--(BUSINESS WIRE)-- Fluent, LLC, a cogint company (NASDAQ: COGT) and a leading provider of digital performance marketing solutions, today announced that the Company has promoted Matthew Koncz, an executive who has been with the Company for over 7 years, to President of Fluent’s Performance Media Group, effective immediately.\nKoncz will report directly to Fluent’s CEO, Ryan Schulke. In his role, he will be responsible for overseeing global operations for Fluent’s extensive Performance Media portfolio, including audience acquisition and insights, client strategy, new product development and international expansion.\n“Matt’s expanded role within our leadership team highlights a distinct and important evolution of our growth strategy,” said Schulke. “Our Performance Marketing suite is becoming more robust and distinguished than ever, with heavy demand from top-tier clientele. A high double-digit percentage of this revenue is operating on unlimited budgets due to the consistent and reliable ROI generated from these programs. We believe that under Matt’s leadership we will be able to expand our offerings dramatically to deliver more results to these partners and many other category leaders.”\nSince joining Fluent in 2011, Mr. Koncz has held a number of key management roles within the Company. Most recently, he was the Executive Vice President, Media & Distribution where he oversaw a media buying budget in excess of $100 million on audience acquisition in 2017. Prior to that role, he headed up Publisher Development with a focus on partnering with media owners to utilize Fluent’s flagship advertising products to realize greater monetization of their inventory. Prior to Fluent, Mr. Koncz was a Director at Clash Media.\n“Since inception, I have been incredibly energized by Fluent’s ability to create massive efficiencies for advertisers. Our ability to acquire media cost effectively, on a performance basis, while simultaneously delivering scale through smart partnerships with publishers and the world’s leading media platforms is unmatched,” said Koncz. “I am anxious to spearhead some of our newest and most exciting business initiatives as we continue to advance our roadmap domestically and internationally.”\nOn February 6-7, 2018, Fluent will be the Networking App Sponsor at the Affiliate Summit Europe 2018 in London, which will take place at the InterContinental. The Company will have a booth in the Meet Market on Wednesday, February 7, 2018 from 12pm to 6pm.\nAbout Fluent\nFluent LLC, a cogint company, is an industry leader in people-based digital marketing and customer acquisition, serving over 500 leading consumer brands and direct marketers. Leveraging a unique data-driven platform, Fluent enables advertisers to more effectively target and acquire their most valuable customers, with precision, at a massive scale. The company is headquartered in New York City.\nAbout cogint™\nAt cogint, we believe that time is your most valuable asset. Through powerful analytics, we transform data into intelligence, in a fast and efficient manner, so that our clients can spend their time on what matters most – running their organizations with confidence. Through leading-edge, proprietary technology and a massive data repository, our data and analytical solutions harness the power of data fusion, uncovering the relevance of disparate data points and converting them into comprehensive and insightful views of people, businesses, assets and their interrelationships. We empower clients across markets and industries to better execute all aspects of their business, from managing risk, conducting investigations, identifying fraud and abuse, and collecting debts, to identifying and acquiring new customers. At cogint, we are dedicated to making the world a safer place, to reducing the cost of doing business, and to enhancing the consumer experience.\nRELATED LINKS: http://www.fluentco.com and http://www.cogint.com\nForward-Looking Statements\nThis press release contains \" ,\" as that term is defined under the Private Securities Litigation Reform Act of 1995 (PSLRA), which statements may be identified by words such as \"expects,\" \"plans,\" \"projects,\" \"will,\" \"may,\" \"anticipate,\" \"believes,\" \"should,\" \"intends,\" \"estimates,\" and other words of similar meaning. Such include whether under Mr. Koncz’s leadership, we will be able to expand our offerings to deliver more results for our performance marketing partners and many other category leaders and whether Mr. Koncz will be able to spearhead some of our newest and most exciting business initiatives as we continue to advance our roadmap domestically and internationally. Readers are cautioned not to place undue reliance on these , which are based on our expectations as of the date of this press release and speak only as of the date of this press release and are advised to consider the factors listed above together with the additional factors under the heading \"Forward-Looking Statements\" and \"Risk Factors\" in the Company's Annual Report on Form 10-K, as may be supplemented or amended by the Company's Quarterly Reports on Form 10-Q and other SEC filings. We undertake no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events or otherwise, except as required by law.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180131005457/en/\nNorth 6th Agency, Inc. (For Fluent)\nShauna Garriques, 212-334-9753 ext. 145\nfluent@n6a.com\nSource: Fluent, LLC", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.fluentco.com&esheet=51751384&newsitemid=20180131005457&lan=en-US&anchor=http%3A%2F%2Fwww.fluentco.com&index=1&md5=00340a0e2a9f51de6f6e4f7d4c8b91bb", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.cogint.com&esheet=51751384&newsitemid=20180131005457&lan=en-US&anchor=http%3A%2F%2Fwww.cogint.com&index=2&md5=cd404603a9efb01609ec026bd5e6235e", "http://www.businesswire.com/news/home/20180131005457/en/"], "published": "2018-01-31T16:30:00.000+02:00", "crawled": "2018-01-31T17:52:04.002+02:00", "highlightTitle": ""}