{"organizations": [], "uuid": "0e5009ae2071fcbe1b9827f2745e426c56272da5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 15, "shares": 15, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/rtx46xiu.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/08/intel-nvidia-amd-qualcomm-ces/", "country": "US", "domain_rank": 1196, "title": "Nvidia, Intel, AMD and Qualcomm Offer New Chips At CES | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.109, "site_type": "news", "published": "2018-01-09T21:25:00.000+02:00", "replies_count": 0, "uuid": "0e5009ae2071fcbe1b9827f2745e426c56272da5"}, "author": "Aaron Pressman", "url": "http://fortune.com/2018/01/08/intel-nvidia-amd-qualcomm-ces/", "ord_in_thread": 0, "title": "Nvidia, Intel, AMD and Qualcomm Offer New Chips At CES | Fortune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Aaron Pressman 7:25 PM EST \nAfter hostile takeover attempts, lawsuits, and a huge problem with chip security, the semiconductor industry is ready to move on from 2017. \nTo kick off the new year, the leading chipmakers all appeared at the annual CES technology show in Las Vegas, hoping to take the spotlight on the bad news by introducing new products. Their new chips make video games play faster, allow for even thinner notebook computers, and speed the way for self-driving cars. \nNvidia , Intel , Advanced Micro Devices and Qualcomm were among the first to show off new products at CES. The announcements came even as Qualcomm remains enmeshed in litigation with one of its biggest customers, Apple , and is trying to fend off an unwanted takeover bid from Broadcom. \nAnd Intel and AMD would love customers to forget about the recently revealed security flaws known as Spectre and Meltdown. But considering the seriousness of the problem, the companies have their work cut out for them. Nvidia’s CES announcements \nNvidia had a couple of announcements for its traditional customer base of avid video gamers, but most of the emphasis was on the future self-driving car market. \nGamers got a new streaming service called GeForce Now that will let them play titles with the most complex imagery even on laptops without powerful graphics chips. Nvidia will do the massive calculating needed on graphics cards running on cloud servers and then send the result that determine what the laptop should display on the screen back to the game player over the Internet. That should allow even a laptop with a relatively wimpy built-in graphics card to run complex games. \nThe company also introduced a new PC gaming monitor standard dubbed the Big Format Gaming Display, or BFGD, which allows games to run on 65-inch screens at 4K resolution with support for a broader range of colors known as high dynamic range. The end result should be larger, sharper and better looking gaming images on a big screen. \nGet Data Sheet , Fortune’s technology newsletter. \nBut gamers couldn’t help but notice that the cloud system is still in beta and that the price consumers will have to pay wasn’t announced. Nor was pricing available for BFGD monitors, which are expected to hit the market this summer. \nAnd Nvidia (nvda) did not release a consumer-oriented version of its line of graphics cards featuring its newest Volta chip, which has thus far been reserved for corporate-oriented machine learning and artificial intelligence products. Gamers have been waiting for months to hear about when they’ll get access to Volta in mainstream products. \nThe main focus at CES was on Nvidia’s autonomous car effort and its Xavier chipset, announced last year and now ready for manufacturers to test. The microprocessor packs 9 billion transistors onto a chip in a small package that can power all of a car’s self-driving features. Nvidia CEO Jensen Huang bragged that it took 2,000 engineers and cost $2 billion to develop Xavier. Volkswagen said it would use Nvidia chips for its self-driving vehicles and Uber disclosed it has been using Nvidia in its fleet of autonomous Volvos. Advanced Micro Devices’ CES announcements \nAmong the major chipmakers, AMD had the most announcements of updated chips for this year for ordinary consumers and corporate customers. \nNew central processors based on last year’s groundbreaking Ryzen design that also integrate built in graphics chips are coming this month for laptops and next month for desktop computers. A second generation of Ryzen chips that will be even faster arrives in April, while an update to AMD’s super-speedy Threadripper processor, best for handling complex tasks like video and photo editing, are expected for the second half of the year. \nAMD (amd) also said that by the end of the year it would be able to reduce the scale of its Vega graphics chips to just 7 nanometers, down from 12 and 14 nanometer designs now in use. The smaller scale allows more transistors to be packed into the same space, speeding up performance and likely saving energy. Intel’s CES News \nIntel tried to steal some of Nvidia’s spotlight by teaming up with AMD. Following up on a surprise deal first disclosed in November, Intel said it would sell five versions of a chip aimed at laptops that combine its own central processor with AMD’s Vega graphics chip. Qualcomm’s CES announcements \nThe mobile chip giant had news on several fronts at CES on Monday. Qualcomm created a kit for hardware makers that want to incorporate smart digital voice assistants into new devices. And Qualcomm said its effort would be compatible with all three major assistants on the market: Amazon Alexa, Microsoft Cortana and Google Assistant. \nThe company also announced deals to supply chips and antennas to bring gigabit speed and faster cellular service to upcoming smartphones made by Google, HTC, LG, Samsung, and Sony. Noticeably missing from the announcement, however, was the world’s most profitable smartphone maker, Apple, which has been increasingly relying on Intel for the cellular components in iPhones. \nOn the automotive front, Qualcomm (qcom) unveiled deals to add more technology to cars from Honda and Land Rover. The 2018 Honda Accord will feature Internet connectivity, navigation and entertainment systems powered by Qualcomm chips. And Land Rover will use Qualcomm chips to offer cellular Internet connectivity in some of its models, too. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-09T21:25:00.000+02:00", "crawled": "2018-01-09T10:06:06.029+02:00", "highlightTitle": ""}