{"organizations": [], "uuid": "2094713b2e6a6e715c05055817c0de8b920b66c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226674595&w=1200&r=LYNXMPEE0T1BT", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-pope-china/vatican-rebukes-cardinal-over-selling-out-to-china-accusations-idUSKBN1FJ2J8", "country": "US", "domain_rank": 408, "title": "Vatican rebukes cardinal over 'selling out' to China accusations", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T20:02:00.000+02:00", "replies_count": 0, "uuid": "2094713b2e6a6e715c05055817c0de8b920b66c5"}, "author": "", "url": "https://www.reuters.com/article/us-pope-china/vatican-rebukes-cardinal-over-selling-out-to-china-accusations-idUSKBN1FJ2J8", "ord_in_thread": 0, "title": "Vatican rebukes cardinal over 'selling out' to China accusations", "locations": [], "entities": {"persons": [{"name": "pope francis", "sentiment": "none"}, {"name": "philip pullella", "sentiment": "none"}, {"name": "joseph zen", "sentiment": "none"}], "locations": [{"name": "vatican", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}], "organizations": [{"name": "vatican city", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VATICAN CITY (Reuters) - The Vatican on Tuesday rebuked a senior cardinal who said its diplomats were “selling out” Chinese Catholics loyal to the pope as part of a deal aimed at normalizing ties with Beijing’s communist government.\nIn a sharply worded statement, the Vatican said it was surprising and regrettable that some people in the Church were “fostering confusion and controversy”.\nIt came a day after Cardinal Joseph Zen, the outspoken former archbishop of Hong Kong, caused a stir with a long post on his Facebook page that was highly critical of the Vatican.\nThe statement, which did not name Zen but which official Vatican sources said was prompted by the controversy he began, said it was “surprising and regrettable” that some were promoting “a presumed difference of thought and action” between Pope Francis and his top aides over China strategy.\nZen has often criticized the Vatican’s attempt at rapprochement with the government of China, where Catholics are split between an “underground” Church that recognizes the pope and those belonging to a state-controlled group where bishops are appointed by the government.\nIn his post, Zen, 86, referred to a report by AsiaNews agency about the activity of Vatican negotiators seeking to reunite the two Churches ahead of possible resumption of diplomatic ties between the Vatican and Beijing that were severed after the communist takeover in 1949.\nAsiaNews said last week that Vatican negotiators had asked two bishops loyal to the pope to give up their posts to make room for two backed by the government.\nThe main point of contention between the Vatican and Beijing has for decades been which side can appoint bishops.\nIn his post, Zen said the pope had told him that he instructed his aides “not to create another Mindszenty case”.\nHe was referring Cardinal Joseph Mindszenty, who was freed from jail during Hungary’s short-lived anti-Soviet uprising in 1956 and given refuge in the U.S. embassy in Budapest for 15 years before the Vatican forced him to leave the country.\nCritics at the time said the Vatican had sold out to the communists but the Holy See said it was necessary to protect the Church from more persecution.\nIn his post criticizing Vatican diplomacy, Quote: : “So, do I think that the Vatican is selling out the Catholic Church in China? Yes, definitely, if they go in the direction which is obvious from all they are doing in recent years and months”.\nReporting by Philip Pullella; Editing by Catherine Evans\n ", "external_links": [], "published": "2018-01-30T20:02:00.000+02:00", "crawled": "2018-01-30T20:17:22.006+02:00", "highlightTitle": ""}