{"organizations": [], "uuid": "c907bf37761213563cb52fb04a0d7c165f023b8c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/12/104944206-GettyImages-814614014.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/opioid-crisis-continues-to-ravage-us-in-trumps-first-year-commentary.html", "country": "US", "domain_rank": 767, "title": "Opioid crisis continues to ravage US in Trump's first year-commentary", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-29T18:07:00.000+02:00", "replies_count": 0, "uuid": "c907bf37761213563cb52fb04a0d7c165f023b8c"}, "author": "Chris Lu", "url": "https://www.cnbc.com/2018/01/29/opioid-crisis-continues-to-ravage-us-in-trumps-first-year-commentary.html", "ord_in_thread": 0, "title": "Opioid crisis continues to ravage US in Trump's first year-commentary", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "chris lu", "sentiment": "none"}, {"name": "allison hunn", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "warren", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "trump administration", "sentiment": "none"}, {"name": "medicaid", "sentiment": "none"}, {"name": "labor", "sentiment": "none"}, {"name": "getty images medical", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "When Donald Trump took the oath of office a little over a year ago, he promised that \"[t]he forgotten men and women of our country will be forgotten no longer.\" However, on one of the most pressing social issues facing these \"forgotten\" people — the opioid epidemic — the president's record has been one of talk instead of action.\nRecently, Trump told a bipartisan group of lawmakers that there is an \"answer\" to the opioid problem: \"I think I actually know the answer, but I'm not sure the country is ready for it yet.\"\nAfterwards, both Democratic and Republican senators expressed confusion about Trump's remarks. \"I don't have any idea what the president was talking about,\" said Sen. Sherrod Brown, D-Ohio. \"I don't know if he even knew what he was talking about.\"\nThat's precisely the problem.\nNo one is quite sure how Trump plans to combat this epidemic. As the administration dithers on the appropriate federal response, the crisis claims the lives of 142 people each day and devastates communities around the country.\nLast December, a day before the president signed the tax bill into law, it was announced that life expectancy in the U.S. declined for a second consecutive year in 2016 — fueled by the rising rate of drug overdoses. The crisis led to 92,000 children entering the foster care system in 2016. Opioid abuse is also contributing to a significant drop in prime-age men in the labor force.\nAccording to the Trump administration's own estimates, the annual economic cost of the opioid crisis exceeds a half trillion dollars due to premature deaths, criminal justice costs and lost productivity. A crisis of this magnitude demands the commitment of significant government resources — with estimates suggesting that treatment costs alone could exceed $200 billion over the next decade.\nYet, during its first year, the Trump administration has gone in the other direction. It has proposed slashing federal substance abuse programs, as well as Medicaid funding, which supports addiction services.\nTo deal with the opioid epidemic, the president issued a limited \"public health emergency\" declaration in October that allowed some regulations to be waived. However, to the frustration of health professionals on the front lines of the epidemic, the declaration did not provide any additional federal resources, even as the White House and congressional Republicans approved $1.5 trillion in tax cuts.\nAs former Rep. Patrick Kennedy, a member of Trump's opioid commission, bluntly explained : \"The emergency declaration has accomplished little because there's no funding behind it. You can't expect to stem the tide of a public health crisis ... without putting your money where your mouth is.\"\nLast October, the president also announced \"really tough, really big, really great advertising so we get to people before they start.\" Beyond a token $100,000 contribution from Trump to this initiative, the White House has not explained how it would fund an ad campaign that could cost hundreds of millions of dollars. Even Trump's favorite bully pulpit — his Twitter feed — has mentioned opioids only a handful of times over the past year, which is ironic given that he has tweeted about \"Making America Great Again\" more than 100 times as president.\nNotably, there is also no one around to coordinate federal efforts. Trump's pick to be the drug czar, Rep. Tom Marino, withdrew from consideration in early October after it was revealed that he had pushed legislation that would make it harder to fight opioids. No new nominee has been named. Meanwhile, a 24-year-old former campaign staffer with no relevant experience was one of the leaders of the drug czar office for the past year.\nIn recent months, the Trump administration has taken additional steps that will hinder federal efforts to fight opioids.\nThe tax bill's repeal of the Obamacare individual mandate will raise health insurance premiums by 10 percent this year, impacting families already struggling to afford treatment for addiction. The Health and Human Services Department has frozen a government database that helps health professionals find effective interventions for dealing with substance abuse.\nAnd earlier this year, Attorney General Jeff Sessions gave the green light to federal prosecutors to crack down on marijuana use in states where it is legal. Some advocates have argued that this move will make it harder to offer marijuana as a safer alternative to opioids.\nA national crisis like the opioid epidemic needs strong, focused leadership and a commitment of resources. Despite the bipartisan consensus to address this issue, this past year has been a lost opportunity for the president to help those \"forgotten men and women\" who believed his election would change their lives.\nCommentary by Chris Lu and Allison Hun. Lu served as the deputy secretary of labor and White House cabinet secretary during the Obama administration and is a senior fellow at the University of Virginia Miller Center. Follow him on Twitter at @ChrisLu44 . Allison Hunn, currently a law student at U.C. Berkeley, worked in the White House Office of Cabinet Affairs.\nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": [], "published": "2018-01-29T18:07:00.000+02:00", "crawled": "2018-01-29T18:09:05.019+02:00", "highlightTitle": ""}