{"organizations": [], "uuid": "593304a4710722b597468193bc3d040875c7a4d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180125.html", "section_title": "Archive News &amp; Video for Thursday, 25 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-euro-holds-at-3-year-high-as-attention-turns-to-draghi-idUSL8N1PK362", "country": "US", "domain_rank": 408, "title": "FOREX-Euro holds at 3-year high as attention turns to Draghi", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T21:10:00.000+02:00", "replies_count": 0, "uuid": "593304a4710722b597468193bc3d040875c7a4d4"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-euro-holds-at-3-year-high-as-attention-turns-to-draghi-idUSL8N1PK362", "ord_in_thread": 0, "title": "FOREX-Euro holds at 3-year high as attention turns to Draghi", "locations": [], "entities": {"persons": [{"name": "draghi", "sentiment": "negative"}, {"name": "tommy wilkes", "sentiment": "none"}, {"name": "mario draghi", "sentiment": "none"}, {"name": "yuan", "sentiment": "none"}, {"name": "steven mnuchin", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "ecb", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* ECB’s Draghi to speak amid rally in euro\n* Dollar slumps leaves greenback near fresh 3-year low\n* Swiss Franc, Yuan hit highest levels since 2015\n* Graphic: World FX rates in 2018 tmsnrt.rs/2egbfVh\nBy Tommy Wilkes\nLONDON, Jan 25 (Reuters) - The euro hovered at 3-year highs against a weakened dollar on Thursday, as traders looked to whether European Central Bank President Mario Draghi would try to talk down the single currency from its recent rally.\nDraghi was to speak at 1330 GMT after the monetary policy meeting against a backdrop of a euro that has gained more than 3 percent against the dollar already this year, following double digit gains last year.\nIts rise was intensified on Wednesday when U.S. Treasury Secretary Steven Mnuchin said a weaker dollar was “good for us”.\nThe euro was flat at $1.24100, down from a high of $1.2459 but still close to its best levels since December 2014.\nThe ECB kept its ultra-easy policy stance and guidance unchanged on Thursday, as expected, but the currency was little moved.\nThe dilemma facing Draghi will be how to address the euro’s surge against the dollar, a move that threatens to dampen inflation and endanger the work done by years of unprecedented stimulus amid an economic rebound in the euro region.\n“The burning question for FX markets at today’s ECB meeting is ‘will – and can – President Draghi talk the euro lower?’ For the past week, we’ve argued that in the current environment – there is very little the ECB can do to stem the tide of a stronger euro,” ING said.\nAnalysts note that the euro’s rise on a trade weighted basis has been far less substantial than versus the dollar, and with investor sentiment towards the region at its highest in years, the single currency is strengthening for the right reasons.\nStill, Draghi will likely seek to stop the euro from firming further, economists said.\n“What we are seeing for all of 2017 is the euro has been rising despite the ECB being dovish,” said Alessio de Longis, portfolio manager for OppenheimerFunds’ global multi-asset group.\n“Going forward, the ECB will be dealing with a rising euro that is a result of rising confidence in the euro zone, in the growth outlook, improving equity inflows in the euro zone.”\nElsewhere, the dollar hit multi-year lows.\nAgainst a basket of currencies the dollar was flat after falling, slightly off its overnight lows that marked a fresh three-year low.\nThe Swiss Franc hit its strongest level versus the dollar since August 2015, and the Chinese yuan since November 2015.\nSterling gained 0.2 percent to $1.4257 after earlier shooting above $1.43 for a fresh high since a June 2016 vote to leave the European Union.\nThe greenback had already been on the defensive on trade protectionism worries fanned by U.S. President Donald Trump’s decision to impose steep import tariffs on washing machines and solar panels earlier in the week.\nWith a weaker dollar, the yen strengthened despite the Bank Of Japan keeping monetary settings unchanged on Tuesday and Governor Haruhiko Kuroda quashing market speculation of a shift away from ultra-easy policy later this year.\nThe U.S. currency was 0.2 percent lower at 109.025 yen , after sinking 1 percent the previous day to a four-month trough of 108.965. (Reporting by Tommy Wilkes; Additional reporting by Fanny Potkin; Editing by Jon Boyle)\n ", "external_links": ["http://tmsnrt.rs/2egbfVh", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T21:10:00.000+02:00", "crawled": "2018-01-26T21:40:45.007+02:00", "highlightTitle": ""}