{"organizations": [], "uuid": "5d5cdae1a294f0fb6c9ba2b9331664f3217966c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/autoshow-detroit-trucks/new-ram-pickup-notches-win-for-steel-in-u-s-truck-market-idUSL1N1P71MV", "country": "US", "domain_rank": 408, "title": "New Ram pickup notches win for steel in U.S. truck market", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T07:01:00.000+02:00", "replies_count": 0, "uuid": "5d5cdae1a294f0fb6c9ba2b9331664f3217966c8"}, "author": "", "url": "https://www.reuters.com/article/autoshow-detroit-trucks/new-ram-pickup-notches-win-for-steel-in-u-s-truck-market-idUSL1N1P71MV", "ord_in_thread": 0, "title": "New Ram pickup notches win for steel in U.S. truck market", "locations": [], "entities": {"persons": [{"name": "nick carey", "sentiment": "none"}, {"name": "silverado", "sentiment": "none"}, {"name": "michael manley", "sentiment": "none"}, {"name": "joseph white", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}], "organizations": [{"name": "fiat chrysler automobiles nv", "sentiment": "none"}, {"name": "chevrolet silverado", "sentiment": "none"}, {"name": "general motors co", "sentiment": "none"}, {"name": "fiat chrysler", "sentiment": "none"}, {"name": "ford", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ford motor co", "sentiment": "none"}, {"name": "detroit auto show", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DETROIT, Jan 15 (Reuters) - Fiat Chrysler Automobiles NV on Monday unveiled a redesigned Ram large pickup that along with General Motors Co’s new Chevrolet Silverado, which debuted on Saturday, sealed a double victory for the steel industry’s fight to remain the dominant metal in the auto market.\nThe 2019 Ram is made mostly of “real steel,” Michael Manley, head of the global Ram and Jeep brands for Fiat Chrysler, told reporters at a briefing ahead of the official debut of the truck at the Detroit Auto Show. The new Silverado also is made mostly of steel, including a high-strength steel cargo box, unlike the top-selling U.S. pickup truck, Ford Motor Co’s F-150, which has a body and cargo box made of aluminum.\nFord jolted the industry in December 2014 when it launched the current generation F-150 with an all-aluminum body. Ford’s F-series trucks represented the largest-scale use of aluminum in a high-volume vehicle, and required technological risk-taking at a level rarely seen among the Detroit automakers.\nThe aluminum F-150 was up to 700 pounds (318 kg) lighter than the previous steel model, and delivered an 11-percent improvement in combined city and highway fuel economy - a substantial boost for Ford’s effort to meet escalating federal fuel efficiency targets.\nHowever, it came at a cost. Rolled steel costs around $800 per ton, while aluminum is more than $2,000 per ton, estimated metals industry analyst Charles Bradford of Bradford Research. The high-strength steels used in the new Ram and Silverado cost more than standard steel alloys, but still have the price edge over aluminum, he said.\nThe auto show, officially called the North American International Auto Show, opened to media on Sunday and runs until Jan. 28.\nLOW GAS PRICES TIP THE SCALES Since the aluminum F-150’s launch, U.S. auto executives have come to a consensus that U.S. gasoline prices will be stable for the long haul. In that environment, Ford’s rivals chose to stick with steel, and aim for higher profit margins. The automakers are lobbying the Trump administration for changes to federal Corporate Average Fuel Economy, or CAFE, targets that would make it easier for trucks to comply.\n”CAFE standards have been driving much of the shift to aluminum and the Trump administration has really backed off those,” Bill Hickey, president of Chicago-based Lapham-Hickey Steel, which has seven steel processing plants in the Midwest and Northeast.\nFiat Chrysler is taking steps to improve the fuel efficiency of the 2019 Ram over the current model, which is rated at 20 miles per gallon in combined city and highway driving.\nThe new Ram is more aerodynamic than its predecessor, and will offer a 48-volt hybrid system on most gasoline versions, one of the highest-volume uses of such technology yet. When accelerating from a stop, the hybrid system will use electricity to launch the vehicle before the gasoline engine kicks in.\nThe 2019 Ram is wider than the current model and has a 4-inch longer wheelbase. Passengers get more leg room and Fiat Chrysler benefits from federal fuel economy rules that set lower mileage targets for wider, longer vehicles, company officials said.\nGM’s new Silverado’s wheelbase is also stretched by four inches compared to the current model, and can carry more in the back. GM executives on Saturday said it will nonetheless it is 450 pounds lighter, and will be more efficient.\nGM is taking between 200 and 500 pounds out of all its new models using a mix of materials, including high strength steel, and redesigning parts to reduce weight, said Mark Reuss, head of the automaker’s global product development. “That’s a great formula without charging all kinds of money for materials that people don’t care about,” he said after the official debut of the 2019 Silverado in Detroit on Saturday.\nGM and Fiat Chrysler together sold about 1.3 million large pickup trucks in 2017, and the Silverado and Ram are respectively the second- and third best-selling model lines in the United States.\nFiat Chrysler identified its steel suppliers as AK Steel, Nucor Corp and Arcelor Mittal.\nThe auto industry accounts for about two-thirds of sales for AK Steel, and trucks and sport utility vehicles accounted for about three-fourths of those automotive sales, spokeswoman Lisa Jester wrote in an email. She declined to comment on specific customers.\nFiat Chrysler engineers said using high-strength steel in the new Ram’s frame and body helped cut a total of 225 pounds (102 kg) from the vehicle’s weight, or about a 4 percent reduction compared with the outgoing model. The new Ram has some aluminum parts, including the tailgate and certain components such as engine mounts and elements of the suspension.\nCutting weight makes more room to boost payload, and add luxury features to increase revenue per truck, such as an optional 12-inch touch screen to control entertainment and other features, and optional “barnwood” accents in the interior of the Western-themed Longhorn model. (Reporting by Joe White and Nick Carey; Editing by Matthew Lewis and Nick Zieminski)\n ", "external_links": [], "published": "2018-01-15T07:01:00.000+02:00", "crawled": "2018-01-15T07:18:25.023+02:00", "highlightTitle": ""}