{"organizations": [], "uuid": "5782d4fccf079ade8d2fa661a9cf52172620fa03", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 16, "shares": 16, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/05/26/104494030-GettyImages-647498828.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/31/nintendo-earnings-q3-2017.html", "country": "US", "domain_rank": 767, "title": "Nintendo earnings beat: Switch sale forecast increased to 15 million", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.288, "site_type": "news", "published": "2018-01-31T09:32:00.000+02:00", "replies_count": 0, "uuid": "5782d4fccf079ade8d2fa661a9cf52172620fa03"}, "author": "Arjun Kharpal", "url": "https://www.cnbc.com/2018/01/31/nintendo-earnings-q3-2017.html", "ord_in_thread": 0, "title": "Nintendo earnings beat: Switch sale forecast increased to 15 million", "locations": [], "entities": {"persons": [{"name": "angerer", "sentiment": "none"}, {"name": "mario", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "madison square park", "sentiment": "none"}], "organizations": [{"name": "nintendo", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Nintendo reported earnings for its fiscal third quarter of 2017 on Wednesday that beat market expectations, with the gaming giant also upping the sales forecast for its flagship Switch console.\nThe Japanese firm also increased its outlook for operating profit in the year ending March 2018.\nNintendo reported the following results for the three months to the end of December 2017.\nRevenue of 482.97 billion yen ($4.44 billion) versus analyst forecasts of 407.86 billion yen, according to Reuters estimates. This is a more than 177 percent year-on-year rise. It's also the highest quarterly revenue figure since the quarter ending December 2009. Operating profit of 116.5 billion yen versus expectations of 69.3 billion yen. This is an increase of over 261 percent and the highest quarterly operating profit since the quarter ending December 2009. Nintendo also said it now expects to sell 15 million units of its Switch gaming console in the year ending March 2018, after previously raising the forecast to 14 million .\nThe gaming firm also raised its outlook. It now expects operating profit for the year ending March 31 to come in at 160 billion yen from a previous forecast of 120 billion yen.\nSwitch boosted by holidays Nintendo sold 7.23 million Switch units in the quarter. The Nintendo Switch got a boost from the holiday season helped by big name games such as \"Super Mario Odyssey\" and \"Mario Kart 8 Deluxe.\" Nintendo also said its handheld 3DS console was not cannibalized by the Switch. In fact, sales for the 3DS grew in the U.S. during the holiday season.\nWhen the Nintendo Switch was launched last year , there were some skeptical analysts . The console is unusual in that it is a hybrid, allowing users to play on their TV, then pick up the tablet-like device and continue playing the game from where they left off, on the go.\nBut the company announced in mid-December that it had sold more than 10 million Switch units since the March 2017 launch. And the increased forecast on Wednesday shows management expects better-than-expected sales.\nAfter struggling in 2015, Nintendo has been on a turnaround path, focusing more seriously on smartphone games, and the new Switch console. It has released a number of high-profile mobile games including \"Super Mario Run\" and \"Fire Emblem Heroes.\" The strategy is paying off. Nintendo said that its smart device and intellectual property-related income was 29.1 billion yen in the quarter, up 172 percent on the year.\nEarnings came after the close of the Toyko stock market, but shares were up around 2 percent ahead of the release. Nintendo shares are up over 107 percent in the past year.", "external_links": [], "published": "2018-01-31T09:32:00.000+02:00", "crawled": "2018-01-31T09:32:24.013+02:00", "highlightTitle": ""}