{"organizations": [], "uuid": "991ca4187045b90c8aa077380c7c0002213c1d62", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/12/01/102227863-RTR25DW8r.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/08/sec-halts-another-stock-for-wacky-bitcoin-related-trading.html", "country": "US", "domain_rank": 767, "title": "SEC halts another stock for wacky bitcoin-related trading", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.245, "site_type": "news", "published": "2018-01-08T21:13:00.000+02:00", "replies_count": 0, "uuid": "991ca4187045b90c8aa077380c7c0002213c1d62"}, "author": "Liz Moyer", "url": "https://www.cnbc.com/2018/01/08/sec-halts-another-stock-for-wacky-bitcoin-related-trading.html", "ord_in_thread": 0, "title": "SEC halts another stock for wacky bitcoin-related trading", "locations": [], "entities": {"persons": [{"name": "jim bourg", "sentiment": "none"}, {"name": "jay clayton", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "hong kong-based", "sentiment": "none"}], "organizations": [{"name": "sec", "sentiment": "negative"}, {"name": "venture capital sec", "sentiment": "negative"}, {"name": "securities and exchange commission", "sentiment": "none"}, {"name": "ubi blockchain internet", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The U.S. government continues to crack down on wacky trading activity in shares of companies involved in cryptocurrency.\nThe Securities and Exchange Commission has halted trading in shares of UBI Blockchain Internet , a Hong Kong-based company, citing potentially inaccurate information in its disclosures to the regulator and unusual and unexplained market activity in the stock since November.\nThe shares spiked to $87 on Dec. 18 from just $9 on Dec. 11 and have since fallen back to $22 as of Friday. The share halt began Monday and runs through Jan. 22.\nLast week, SEC Chairman Jay Clayton repeated a warning he made in December to investors about the risks of cryptocurrencies and related activities, such as initial coin offerings. The concerns are being raised after a year of spectacular gains in the value of some digital currencies, such as bitcoin .\nThese currencies plunged in value on Monday, with bitcoin falling 6.3 percent, according to Coinbase.\nIn December, the SEC halted trading in shares of The Crypto Co ., which had surged in price 2,700 percent in one month's time. That halt was through Jan. 3. The agency cited concerns about potentially manipulative trading. On Monday the shares traded at $175, down 69 percent, according to FactSet.\nThe attention on digital currencies and new products that have sprung up around them has been described as a mania and seen as a warning to those speculating in them. But that hasn't stopped some companies from trying to catch some of the momentum.\nShares of Long Blockchain Corp. — previously known as Long Island Iced Tea Corp. — have doubled since the beverage maker turned blockchain investor changed its name to include the technology underpinning currencies such as bitcoin. The company's market value has jumped to $48 million.\nLong Blockchain said in December it was shifting its focus to explore and invest in blockchain technology, though it will continue to make juices, lemonades and iced tea beverages. This all comes after it was warned in October it would be delisted by Nasdaq Stock Market because its market value had fallen below the $35 million needed to qualify for the exchange.\nTo avoid delisting, its market value had to climb to $35 million or greater and stay there for 10 consecutive days. The company had until April to achieve that.\nWATCH: Riot Blockchain CEO sells $870,000 worth of shares show chapters Riot Blockchain CEO sells $870,000 worth of the shares 1:53 PM ET Fri, 5 Jan 2018 | 00:50", "external_links": [], "published": "2018-01-08T21:13:00.000+02:00", "crawled": "2018-01-08T21:14:05.002+02:00", "highlightTitle": ""}