{"organizations": [], "uuid": "220db0d816b9574b523fa1c766c7f8e7d5b55f3e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 117, "shares": 117, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/902386002.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/08/oprah-2020-golden-globes/", "country": "US", "domain_rank": 1196, "title": "Oprah 2020: Democrats Need to Take Black Women Seriously | Fortune", "performance_score": 1, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.992, "site_type": "news", "published": "2018-01-09T02:00:00.000+02:00", "replies_count": 0, "uuid": "220db0d816b9574b523fa1c766c7f8e7d5b55f3e"}, "author": "Claire Zillman", "url": "http://fortune.com/2018/01/08/oprah-2020-golden-globes/", "ord_in_thread": 0, "title": "Oprah 2020: Democrats Need to Take Black Women Seriously | Fortune", "locations": [], "entities": {"persons": [{"name": "oprah", "sentiment": "negative"}, {"name": "winfrey", "sentiment": "negative"}, {"name": "claire zillman", "sentiment": "none"}, {"name": "cecil b. demille", "sentiment": "none"}, {"name": "oprah winfrey", "sentiment": "none"}, {"name": "kevork djansezian", "sentiment": "none"}, {"name": "seth meyers", "sentiment": "none"}], "locations": [{"name": "white house", "sentiment": "none"}], "organizations": [{"name": "hollywood", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Democrats Need to Take Black Women More Seriously. Oprah Could Be the Answer Winfrey received a lifetime achievement award on Sunday. Kevork Djansezian—NBC 2018 Kevork Djansezian/NBC By Claire Zillman January 8, 2018 \nThe Oprah 2020 buzz reached a new high Sunday night after the billionaire media mogul delivered an impassioned speech at the Golden Globes awards ceremony, and it’s got people wondering if Democrats are ready for their Aha! moment. \nIn receiving the Cecil B. DeMille Award, Oprah Winfrey echoed the feminist theme of the evening that saw stars don black to protest Hollywood’s rampant sexual harassment and sexism. \n“I want all the girls watching here, now, to know that a new day is on the horizon!” she said. “And when that new day finally dawns, it will be because of a lot of magnificent women, many of whom are right here in this room tonight, and some pretty phenomenal men, fighting hard to make sure that they become the leaders who take us to the time when nobody ever has to say ‘Me too’ again.” \nGolden Globes host Seth Meyers had alluded to a 2020 White House run for Winfrey before her speech, but after the stirring address, speculation of her landing on the Democratic ticket erupted at after-parties and on social media. Her partner Stedman Graham fanned the flames, telling the Los Angeles Times that Winfrey’s candidacy is “up to the people” and that she would “absolutely do it.” \nThe “President Winfrey!” cheers were met, expectedly, with plenty of arguments against her candidacy. Commentators pointed to her lack of governing experience, decried the prospect of another TV-star-turned-White House hopeful, and asserted that she could perhaps do more good from her current platform than from the Oval Office. \nBut for all the reasons why Winfrey shouldn’t run, there’s an especially timely reason why she should. She would answer, in resounding fashion, the call for black women to have a larger role in Democratic politics. \nIn the two most recent high-stakes elections, African American women have carried Democrats to victory. \nThey turned out for Democrat Doug Jones in Alabama’s special Senate election in December, with 98% of black women casting ballots for him. They factored big in November’s Virginia gubernatorial race too, as 91% of black women voted for Democrat Ralph Northam in his defeat of Republican Ed Gillespie. (By comparison, 34% and 48% of white women voted for the Democrats in the two races, respectively.) \nAfter the Alabama election, critics accused the Democratic party of taking the reliable base for granted, and suggestions of how Democrats could repay black women for their allegiance flooded the Internet. \nSome recommendations were specific— The Washington Post ‘s Jonathan Capehart suggested that Sen. Kamala Harris (D-Calif.) replace Sen. Al Franken (D-Minn.) on the Senate Judiciary Committee—but the overarching message was that black women need more political power; they need to factor more critically into Democrats’ decision-making and have more say in the party’s agenda-setting. \n“Bet on black women. Follow black women. Give power to black women,” political consultant Angela Peoples wrote in an op-ed after Jones’s win . \nWinfrey topping the 2020 Democratic ticket would certainly meet that demand. The former talk show host has long been an icon among African American women, thanks to her self-made success and cultural relevance. A Pew study in 2008 pointed to her enormous sway, with 87% of African Americans rating Winfrey as having a good influence on the black community. \nWinfrey’s net worth ( an estimated $2.8 billion ), her unparalleled brand recognition that largely transcends race and gender, and philanthropic drive would make her a viable hopeful in any year, but her presidential candidacy and ultimate nomination in 2020 would carry special significance. And in a hallmark of office-seekers, Winfrey didn’t shy away from assuming that kind of symbolism Sunday night. \n“In 1982, Sidney [Poitier] received the Cecil B. DeMille award right here at the Golden Globes, and it is not lost on me that at this moment, there are some little girls watching as I become the first black woman to be given this same award,” she said. “It is an honor.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-09T02:00:00.000+02:00", "crawled": "2018-01-09T17:03:16.000+02:00", "highlightTitle": ""}