{"organizations": [], "uuid": "334f70bb4d2907c65c804463f03fe1bd11bc8eea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222074186&w=1200&r=LYNXMPEE0E0AX", "site_section": "http://www.reuters.com/resources/archive/us/20180115.html", "section_title": "Archive News &amp; Video for Monday, 15 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-tennis-ausopen-highlights/highlights-of-australian-open-day-one-idUSKBN1F40LJ", "country": "US", "domain_rank": 408, "title": "Highlights of Australian Open day one", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T15:05:00.000+02:00", "replies_count": 0, "uuid": "334f70bb4d2907c65c804463f03fe1bd11bc8eea"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-tennis-ausopen-highlights/highlights-of-australian-open-day-one-idUSKBN1F40LJ", "ord_in_thread": 0, "title": "Highlights of Australian Open day one", "locations": [], "entities": {"persons": [{"name": "timea babos", "sentiment": "none"}, {"name": "becker tomic", "sentiment": "none"}, {"name": "federer", "sentiment": "none"}, {"name": "vandeweghe", "sentiment": "none"}, {"name": "ostapenko", "sentiment": "none"}, {"name": "stephens", "sentiment": "none"}, {"name": "edmund out-guns anderson", "sentiment": "none"}, {"name": "grigor dimitrov", "sentiment": "none"}, {"name": "dennis novak", "sentiment": "none"}, {"name": "fergus murphy", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "hisense arena", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "williams", "sentiment": "none"}, {"name": "belinda bencic", "sentiment": "none"}, {"name": "kyrgios", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MELBOURNE (Reuters) - Highlights of Monday’s opening day of the Australian Open, the first grand slam tournament of the year:\n0635 COCO GOES BANANAS CoCo Vandeweghe received a code violation for time wasting because there were no bananas available at Hisense Arena.\nAfter losing the first set in a tiebreak to Hungarian Timea Babos, the American number 10 seed remained in her seat and argued with chair umpire Fergus Murphy that she should be allowed more time during the break because bananas had not been provided in time.\n“I‘m waiting for the bananas,” Vandeweghe, who lost the match 7-6(4) 6-2, told the umpire.\nREAD MORE Edmund out-guns Anderson for first round shock\nBencic sends Venus crashing in Melbourne\nFACTBOX-Venus Williams v Belinda Bencic - stats\nStephens tumbles out, Ostapenko impresses\nOrder of play\nFederer says he should not be favorite at 36\nKyrgios can become global superstar - Becker\nTomic slide continues with Melbourne failure\n0550 DIMITROV RACES INTO ROUND TWO World number three Grigor Dimitrov fired 21 winners to claim a 6-3 6-2 6-1 victory over Austrian Dennis Novak in the first round.\n0530 DREAM DEBUT FOR SHAPOVALOV Talented Canadian teenager Denis Shapovalov recorded his first ever win at Melbourne, defeating 19-year-old Greek Stefanos Tsitsipas 6-1 6-3 7-6(5).\n0515 AILING VANDEWEGHE FALLS TO BABOS Last year’s semi-finalist Coco Vandeweghe said flu symptoms left her struggling to breathe on court during the American’s 7-6(4) 6-2 opening round defeat to Hungarian Timea Babos.\n“This is the first time I’ve been out of bed in four days,” the world number nine said. “I’ve had the flu. The doctor gave me some medication, but it’s not working all that well, so here I am.”\nIt was Babos’ first win over a top 10-player. “In women’s tennis, anything can happen when there is no Serena Williams,” she said in her on-court interview, referring to the absent defending champion who gave birth in September.\n0450 ISNER FALLS IN OPENING ROUND Australian Matthew Ebden beat world number 16 John Isner 6-4 3-6 6-3 6-3 on Margaret Court Arena.\n0420 EDMUND OUTLASTS ANDERSON Kyle Edmund progressed to the second round when the British world number 49 recorded an upset 6-7(4) 6-3 3-6 6-3 6-4 victory over last year’s U.S. Open finalist and 11th seed Kevin Anderson.\n0345 BENCIC UPSETS VENUS Last year’s runner-up Venus Williams was knocked out in the first round with a 6-3 7-5 defeat by Swiss counter-puncher Belinda Bencic.\n0325 CIBULKOVA BOWS OUT Estonian Kaia Kenepi beat 2014 runner-up Dominika Cibulkova 6-2 6-2 in the first round.\n0245 PLAY RESUMES AFTER LIGHT DRIZZLE Action resumed after light rain stopped play on all courts. Roof closed on Rod Laver Arena, where fifth seed Venus Williams will continue her opening round match against Belinda Bencic.\n0225 DOLGOPOLOV THROUGH FROM MEN‘S FIELD\nUkrainian Alexandr Dolgopolov was the first one through to the second round from the men’s field with a 7-6(3) 6-3 6-4 win over Andreas Haider-Maurer of Austria.\n0210 ZHANG STUNS STEPHENS China’s Zhang Shuai, who reached the quarter-finals as a qualifier in Melbourne two years ago, roared back from a set and a break down to beat U.S. Open winner Sloane Stephens 2-6 7-6(2) 6-2 on Margaret Court Arena.\n“This court is really special for me. I was so excited to get back on here and I think I was really ready. She’s a great player but when i arrived in Australia I was ready to play anyone,” Zhang said in a court-side interview.\n0145 GOERGES EXTENDS HOT STREAK World number 12 Julia Goerges beats American Sofia Kenin 6-4 6-4 to extend her winning streak to 15 matches, stretching back to last year when she won in Moscow, then the WTA Elite Trophy in Zhuhai and opened the season with a title in Auckland.\n0140 RYBARIKOVA MAKES WINNING START Wimbledon semi-finalist Magdalena Rybarikova advanced to the second round with a 6-0 7-5 victory over American Taylor Townsend.\n0135 OSTAPENKO CRUISES PAST SCHIAVONE French Open champion Jelena Ostapenko roared back from 1-4 down in the second set to beat Italian Francesca Schiavone 6-1 6-4.\n0105 CHINA‘S DUAN FIRST PLAYER TO ADVANCE\nChina’s world number 100 Duan Yingying was the first player into the second round of the tournament after doling out a 6-0 6-1 thrashing of Colombian Mariana Duque-Marino in 51 minutes on Court 10.\n0015 PLAY UNDERWAY AT MELBOURNE PARK Play got underway on schedule under sunny skies at 11 a.m. local time (0000) GMT with the temperature hovering just under the 20 degrees Celsius mark.\nCompiled by Nick Mulvenney and Hardik Vyas; Editing by Greg Stutchbury/Peter Rutherford/John O'Brien\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T15:05:00.000+02:00", "crawled": "2018-01-16T13:36:30.016+02:00", "highlightTitle": ""}