{"organizations": [], "uuid": "fe558e7721aaf3ab28d622df40fbb12bdebe6efb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180115.html", "section_title": "Archive News &amp; Video for Monday, 15 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/eurozone-bonds/euro-zone-bond-yields-pull-back-from-multi-month-highs-idUSL8N1PA158", "country": "US", "domain_rank": 408, "title": "Euro zone bond yields pull back from multi-month highs", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T16:36:00.000+02:00", "replies_count": 0, "uuid": "fe558e7721aaf3ab28d622df40fbb12bdebe6efb"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/eurozone-bonds/euro-zone-bond-yields-pull-back-from-multi-month-highs-idUSL8N1PA158", "ord_in_thread": 0, "title": "Euro zone bond yields pull back from multi-month highs", "locations": [], "entities": {"persons": [{"name": "dhara ranasinghe", "sentiment": "none"}, {"name": "jens weidmann", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "bundesbank", "sentiment": "none"}, {"name": "european central bank", "sentiment": "none"}, {"name": "ecb", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Respite for euro zone bonds after sharp selloff\n* Bund yields edge off 5-month lows\n* Euro zone periphery govt bond yields tmsnrt.rs/2ii2Bqr\nBy Dhara Ranasinghe\nLONDON, Jan 15 (Reuters) - Borrowing costs in the euro area pulled back from multi-month highs on Monday, as bond investors paused for thought after a hefty selloff last week on expectations that the ECB could end its massive stimulus sooner than anticipated.\nGerman Bundesbank President Jens Weidmann, normally one of the staunchest critics of the European Central Bank’s ultra-easy policy, said late on Friday the risk of an imminent hike in interest rates was low.\nThose comments bought some respite to battered bond prices, while overall trade was expected to be subdued with U.S. markets closed for a holiday on Monday.\nIn addition, analysts said heavy redemptions this week and less new issuance compared with last week were also supportive for regional bond markets.\nSentiment towards fixed income has taken a hit after a week of heightened talk about an end to massive stimulus in Japan and the euro zone, while data on Friday showed underlying U.S. consumer prices posting their biggest gain in 11 months in December.\nTwo-year U.S. Treasury yields, sensitive to traders’ views on interest rates, on Friday rose to more than 2 percent for the first time since the financial crisis.\nEuro zone money markets continue to price in a roughly 70 percent chance of 10 basis point rate rise from the ECB by year-end, having ratcheted up rate-hike bets in the past week.\nOn Monday, Bank of Japan Governor Haruhiko Kuroda reiterated the central bank’s resolve to maintain its massive stimulus programme, but his positive comments on inflation and the economy sent the yen to a four-month high versus the dollar .\nStill, in early trade, most euro zone government bond yields were down 1-2 basis point on the day.\nGermany’s benchmark 10-year year Bund yield was at 0.51 percent, off a five-month high hit on Friday at 0.54 percent .\nTwo-year German bond yields were around 5 basis points below more than six-month peaks hit last week at around minus 0.55 percent.\n“There are chances for more selling but also reasons to be cautious,” said Chris Scicluna, head of economic research at Daiwa Capital Markets.\n“Inflation numbers in euro zone this week should confirm the price story is not that different from last year and we are looking at the chance of a downward revision,” he said, referring to the final release of euro zone December inflation data on Wednesday. (Reporting by Dhara Ranasinghe; Editing by Toby Chopra)\n ", "external_links": ["http://tmsnrt.rs/2ii2Bqr", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T16:36:00.000+02:00", "crawled": "2018-01-16T13:20:10.006+02:00", "highlightTitle": ""}