{"organizations": [], "uuid": "763654b1c93af4a6f7c86fba0d21be314a15c6c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180118.html", "section_title": "Archive News &amp; Video for Thursday, 18 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-nordics-economy-poll/sweden-leads-scandinavias-2018-growth-outlook-reuters-poll-idUSKBN1F70TM", "country": "US", "domain_rank": 408, "title": "Sweden leads Scandinavia's 2018 growth outlook: Reuters poll", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T16:13:00.000+02:00", "replies_count": 0, "uuid": "763654b1c93af4a6f7c86fba0d21be314a15c6c3"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-nordics-economy-poll/sweden-leads-scandinavias-2018-growth-outlook-reuters-poll-idUSKBN1F70TM", "ord_in_thread": 0, "title": "Sweden leads Scandinavia's 2018 growth outlook: Reuters poll", "locations": [], "entities": {"persons": [{"name": "joachim bernhardsen", "sentiment": "none"}], "locations": [{"name": "sweden", "sentiment": "none"}, {"name": "oslo", "sentiment": "none"}, {"name": "scandinavia", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "denmark", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "nordea markets", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OSLO (Reuters) - Swedish and Danish growth prospects for 2018 have brightened in recent months, following last year’s forecast-beating economic performance in Scandinavia, a Reuters poll of economists showed on Thursday.\nSweden is expected to remain the top performer in 2018, but its lead over neighboring Denmark and Norway will become smaller in 2019, according to the survey of 24 banks and brokerages.\nIn 2017, all three countries grew more rapidly than had been forecast, as global economic strength combined with ultra-loose domestic monetary policies to spur activity.\n“We’re in a synchronized international upswing that benefits the region,” Nordea Markets economist Joachim Bernhardsen said, adding export-driven Scandinavian economies are well positioned to take advantage.\nThe Swedish economy, the largest of the three, is now expected to growth 2.7 percent in 2018. That’s better than the 2.5 percent predicted in October, although down from the estimated 2.8 percent expansion in 2017.\nBoth Denmark and Norway’s economies are expected to grow 2.0 percent in 2018. For Denmark, that was an increase from 1.8 percent since October; for Norway, a cut from 2.1 percent.\n“In the case of Norway, it looks like the upswing came faster than most people had anticipated,” DNB Markets economist Jeanette Stroem Fjaere said, adding renewed optimism in the country’s oil industry had shown greater impact already in 2017.\n“The timing of a shift like this can be difficult to forecast,” she said.\nA near-absence of inflation has been a major cause of concern at the region’s central banks, triggering rate cuts, quantitative easing and other measures, but consumer prices are now expected to accelerate in all three countries from 2018 to 2019.\nUnemployment was seen declining across Scandinavia in both 2018 and 2019.\nSweden’s economy grew an estimated 2.8 percent last year, better than the 2.4 percent expected a year ago. Norway’s grew 1.9 percent instead of the 1.5 percent forecast a year ago. The Danish economy expanded 2.1 percent, beating a forecast of 1.5 percent, according to the poll.\nEconomists cautioned falling housing prices in Norway and Sweden pose a potential risk to growth, but only in the unlikely case they cause private consumption to slow.\nIn Norway, Finance Minister Siv Jensen downplayed the risk.\n“The probability that a further fall in housing prices will trigger an economic downturn is very small,” she told a business conference on Wednesday.\nAdditional reporting by Ole Petter Skonnord; Polling by Sarmista Sen, editing by Larry King\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T16:13:00.000+02:00", "crawled": "2018-01-19T12:21:14.005+02:00", "highlightTitle": ""}