{"organizations": [], "uuid": "0d7e8f0b6de88e15ffcbc3062a8e508e680be006", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/business-wire-experienced-lawyer-bonnie-paskvan-joins-dorsey-in-anchorage.html", "country": "US", "domain_rank": 767, "title": "Experienced Lawyer Bonnie Paskvan Joins Dorsey in Anchorage", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.891, "site_type": "news", "published": "2018-01-23T00:54:00.000+02:00", "replies_count": 0, "uuid": "0d7e8f0b6de88e15ffcbc3062a8e508e680be006"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/business-wire-experienced-lawyer-bonnie-paskvan-joins-dorsey-in-anchorage.html", "ord_in_thread": 0, "title": "Experienced Lawyer Bonnie Paskvan Joins Dorsey in Anchorage", "locations": [], "entities": {"persons": [{"name": "bonnie paskvan joins dorsey", "sentiment": "negative"}, {"name": "bonnie j. paskvan", "sentiment": "none"}, {"name": "dorsey", "sentiment": "none"}], "locations": [{"name": "anchorage", "sentiment": "none"}, {"name": "alaska", "sentiment": "none"}, {"name": "anchorage", "sentiment": "none"}], "organizations": [{"name": "anchorage deepening alaska native corporation", "sentiment": "negative"}, {"name": "dorsey & whitney llp", "sentiment": "none"}, {"name": "calista corporation", "sentiment": "none"}, {"name": "alaska native corporation", "sentiment": "none"}, {"name": "dorsey & whitney", "sentiment": "none"}, {"name": "alaska native practice group", "sentiment": "none"}, {"name": "regulatory affairs group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Deepening Alaska Native Corporation Expertise\nANCHORAGE, Alaska--(BUSINESS WIRE)-- International law firm Dorsey & Whitney LLP announced today that Bonnie J. Paskvan has joined the Firm in its Anchorage, Alaska, office as Of Counsel in its Regulatory Affairs Group and Indian and Alaska Native Practice Group. Paskvan has extensive finance, M&A, telecom, and regulatory experience, in addition to her Alaska Native Corporation experience.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180122006598/en/\nDorsey & Whitney is pleased to announce that Bonnie J. Paskvan has joined the Firm in its Anchorage, Alaska, office as Of Counsel in its Regulatory Affairs Group and Indian and Alaska Native Practice Group. (Photo: Dorsey & Whitney LLP)\nPaskvan joins Dorsey after serving as general counsel from 2014-2017 for Anchorage-based Calista Corporation, an Alaska Native Corporation representing over 24,000 shareholders, and parent to over 35 subsidiaries engaged in a wide range of industries, including military defense contracting, construction, real estate, environmental, mining and natural resource development, telecommunications, and oil field services. As general counsel, she was responsible for all legal matters and had extensive experience leading and overseeing strategic initiatives, corporate governance, corporate codes, policies and procedures, commercial and government contracting and agreements, mediation, arbitration and litigation, regulatory compliance, financing and business structures, loss prevention and risk management, M&A, and natural resource permitting and development. After leaving Calista Corporation, Bonnie has served as interim general counsel for Koniag, Inc., another Alaska Native Corporation. Before joining Calista Corporation, Paskvan served for two years as chief legal officer for The Alaska Wireless Network, a startup wholesale wireless telecommunications company, and for 12 years as corporate counsel for General Communication, Inc., the largest telecommunications and technology company in Alaska. Before joining GCI in 2000, she was in private practice for 14 years with law firms in Anchorage and Los Angeles, including as the first woman partner at Hartig, Rhodes, Norman, Edwards and Mahoney, P.C.\nBonnie earned a B.A. degree from Stanford University and a J.D. degree from Stanford Law School, where she served for three years as Associate Editor on the Stanford Law Review. Bonnie is a Truman Scholar. She is Co-Chair of the Corporate Counsel and Ethics and Compliance Sections of the Alaska Bar Association.\n“We are very pleased that Bonnie has joined Dorsey in Anchorage,” noted Partner Mike Mills, Dorsey’s Anchorage Office Head. “Born and raised in Fairbanks, she has deep roots in Alaska, and deep experience and relationships throughout the Alaska Native Corporation community, a community that Dorsey has been proud to serve for decades.”\n“Bonnie not only brings great depth and experience in Alaska Native Corporations to Dorsey, she also brings the keen perspectives of a long-time general counsel,” added Dorsey’s Managing Partner Ken Cutler. “She will add tremendously to the full range of Dorsey’s nationally recognized Indian and Alaska Native practices. We continue to add talent strategically to the Firm to better serve our clients around the world.”\n“I am delighted to be joining Dorsey and its great team of Indian and Alaska Native lawyers,” noted Paskvan. “I look forward to serving Dorsey’s exceptional client base and to working with my new Dorsey colleagues to serve the needs of the commercial, banking and Alaska Native Corporation communities.”\nAbout Dorsey & Whitney LLP\nClients have relied on Dorsey since 1912 as a valued business partner. With locations across the United States and in Canada, Europe and the Asia-Pacific region, Dorsey provides an integrated, proactive approach to its clients' legal and business needs. Dorsey represents a number of the world's most successful companies from a wide range of industries, including leaders in the banking, energy, food and agribusiness, health care, mining and natural resources, and public-private project development sectors, as well as major non-profit and government entities.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180122006598/en/\nDorsey & Whitney LLP\nJeri Longtin-Kloss, 612-492-5315\nlongtin.kloss.jeri@dorsey.com\nSource: Dorsey & Whitney LLP", "external_links": ["http://www.businesswire.com/news/home/20180122006598/en/"], "published": "2018-01-23T00:54:00.000+02:00", "crawled": "2018-01-23T02:17:41.002+02:00", "highlightTitle": ""}