{"organizations": [], "uuid": "31ec130ec4cadca7ae1e77c70b83063eff264c60", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-patient-advertising-guru-continues-to-rock-enroll-by-adding-a-real-life-patient-recruitment-guru-to-the-team.html", "country": "US", "domain_rank": 767, "title": "Patient Advertising Guru Continues to \"Rock Enroll\" by Adding a Real-Life Patient Recruitment Guru to The Team", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-01-02T16:40:00.000+02:00", "replies_count": 0, "uuid": "31ec130ec4cadca7ae1e77c70b83063eff264c60"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-patient-advertising-guru-continues-to-rock-enroll-by-adding-a-real-life-patient-recruitment-guru-to-the-team.html", "ord_in_thread": 0, "title": "Patient Advertising Guru Continues to \"Rock Enroll\" by Adding a Real-Life Patient Recruitment Guru to The Team", "locations": [], "entities": {"persons": [{"name": "wallace", "sentiment": "none"}, {"name": "ken", "sentiment": "none"}, {"name": "ken wallace", "sentiment": "none"}], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "plainview", "sentiment": "none"}], "organizations": [{"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PLAINVIEW, N.Y., Jan. 2, 2018 /PRNewswire/ -- Patient Advertising Guru , an advertising firm primarily focused on patient recruitment for clinical trials, announced that Ken Wallace has joined the Company as vice president. Mr. Wallace has spent more than 20 years planning, developing and executing patient recruitment programs for hundreds of clinical trials. He will head business development efforts and serve in a leadership role in operations and client services.\nMr. Wallace's hire comes at an important time for the Company. While there are myriad ways to create awareness of clinical trials, many sites still rely heavily on advertising. Billions of dollars are spent annually on clinical trial patient recruitment efforts and clinical trial sponsors will continue to apply pressure on clinical research sites to find and enroll patients quickly. With the addition of Mr. Wallace, Patient Advertising Guru is now uniquely positioned to offer sponsors and sites a better and more cost-effective way to advertise to potential clinical trial participants.\n\"Ken is near the top of a short list of people who have been exclusively focused on patient recruitment for more than 20 years and I am thrilled to add someone with his experience to the team,\" said Evan Brett, president of Patient Advertising Guru. \"Ken and I have known each other since 1996 and I finally convinced him to join the Guru team. I look forward to working with him as we stay committed to delivering outstanding value and service to our clients and continue to grow.\"\n\"Evan Brett is truly a guru in patient advertising. By following a philosophy of letting 'experts to do expert work,' Patient Advertising Guru has helped hundreds of sites enroll thousands of patients for dozens of sponsors. As a result, Evan has built Patient Advertising Guru into a leader in locally executed, centrally managed patient recruitment advertising solutions,\" said Mr. Wallace.\nAbout Ken Wallace, MBA\nPrior to joining Patient Advertising Guru, Ken was a vice president at Integrated Clinical Trial Services. Previously he was president of Clinical Trial Marketing Communications and he served in many capacities at a patient recruitment company, Clinical Solutions, most recently as president and chief operating officer. He earned his bachelor's degree in communications / public relations from Glassboro State College (now Rowan University) and his Master of Business Administration from the Kennesaw State University.\nAbout Patient Advertising Guru\nPatient Advertising Guru is a niche provider of advertising and media buying services that exclusively serves the healthcare industry. Guru offers clients patient-driven advertising expertise and access to its tremendous purchasing power, enabling Guru to pay far less for advertising. Many of the largest pharmaceutical manufacturers in the world have relied on Patient Advertising Guru to recruit patients for their research studies. Patient Advertising Guru is based in Plainview, NY.\nFOR MORE INFORMATION CONTACT:\nEvan Brett • 516-586-6926 • 187852@email4pr.com\nKen Wallace • 404-556-8802 • 187852@email4pr.com\npatientadvertisingguru.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/patient-advertising-guru-continues-to-rock-enroll-by-adding-a-real-life-patient-recruitment-guru-to-the-team-300576116.html\nSOURCE Patient Advertising Guru", "external_links": ["http://www.prnewswire.com/news-releases/patient-advertising-guru-continues-to-rock-enroll-by-adding-a-real-life-patient-recruitment-guru-to-the-team-300576116.html", "http://patientadvertisingguru.com/"], "published": "2018-01-02T16:40:00.000+02:00", "crawled": "2018-01-02T16:34:06.010+02:00", "highlightTitle": ""}