{"organizations": [], "uuid": "30b1c91a38f1f305067ee7b5b3e7ec12af137c83", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/17/104950732-GettyImages-810714.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/18/super-bowl-2018-what-advertisers-have-planned-for-the-big-game.html", "country": "US", "domain_rank": 767, "title": "Super Bowl 2018: What advertisers have planned for the big game", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.857, "site_type": "news", "published": "2018-01-18T16:22:00.000+02:00", "replies_count": 0, "uuid": "30b1c91a38f1f305067ee7b5b3e7ec12af137c83"}, "author": "Lucy Handley", "url": "https://www.cnbc.com/2018/01/18/super-bowl-2018-what-advertisers-have-planned-for-the-big-game.html", "ord_in_thread": 0, "title": "Super Bowl 2018: What advertisers have planned for the big game", "locations": [], "entities": {"persons": [{"name": "marcos menendez", "sentiment": "none"}, {"name": "cindy crawford", "sentiment": "none"}, {"name": "marcos", "sentiment": "none"}, {"name": "airbnb", "sentiment": "none"}, {"name": "bud light", "sentiment": "none"}], "locations": [{"name": "mars", "sentiment": "none"}], "organizations": [{"name": "audi", "sentiment": "none"}, {"name": "pepsi getty", "sentiment": "none"}, {"name": "pepsi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Super Bowl is one of the biggest entertainment events of the year and a time for advertisers to get creative to make the most of the estimated $5 million they have to shell out for a 30-second spot.\nIn 2017, some ads focused on social or political messages, with Audi promoting equal pay and Budweiser, 84 Lumber and Airbnb talking about immigration.\nSo far, this year's crop look to be a mix of classics (Pepsi is remaking its famous 1992 ad featuring Cindy Crawford) and humor — see Bud Light's \"dilly dilly\" spots.\nHere's a look at what advertisers have planned ahead of Sunday, February 4.\nSkittles The Mars candy brand is set to release its \"most exclusive Super Bowl ad ever made,\" which will be shown to just one person, a teenager called Marcos Menendez. Viewers will, however, be able to watch Marcos watching the ad on the Skittles Facebook page on Super Bowl Sunday.\nPepsi Getty Images Cindy Crawford in a 1990s Pepsi commercial Supermodel Cindy Crawford is set to star in a remake of 1992's classic Super Bowl ad, in which she buys a can of soda from a drinks machine at a gas station. Two boys gawp from the sidelines, but at the drink rather than her. The 30-second remake will feature her son Presley Gerber too as well as other celebrities, yet to be announced.\nPepsi is also a sponsor of the Super Bowl, which will give it an estimated $32 million worth of \"brand exposure,\" according to Apex Marketing Group.\nBud Light In 2017, Bud Light's ad saw a spoof political party featuring Amy Schumer and Seth Rogen. This year, it will feature its new catchphrase \"dilly dilly,\" used by characters in its \"Game of Thrones\"-style ads as a way of saying \"cheers\".\nAvocados From Mexico Avocado toast is a big hit with Americans, who apparently spend nearly $900,000 a month on it. Avocados From Mexico will be hoping to attract even more of them with its Super Bowl ad this year. Details are to be confirmed, but the spot will focus on the avocado's \"tasty versatility,\" according to an emailed statement. It's the fourth consecutive year the company has advertised during the big game. Last year's commercial is shown above.\nDoritos and Mountain Dew show chapters Pepsi pushes new Doritos and Mountain Dew flavors ahead of Super Bowl 9:23 AM ET Wed, 17 Jan 2018 | 04:28 PepsiCo brands Doritos and Mountain Dew are back in the game after a year off, and in 2018 will feature in the same ad. The company released a short teaser on its YouTube channel on Wednesday, starring Morgan Freeman and \"Game of Thrones\" actor Peter Dinklage. It said the commercial is making \"advertising history\" in an online statement, because it's the first time the corn chip snack and beverage will be advertised together.\nM&Ms Skittles' fellow Mars brand M&Ms is running a trailer for its ad featuring people watching… an ad. Critics Choice Awards judges review the commercial in the spot, with one very sincere critic calling it \"outrageous, singular, cathartic and breathtaking,\" as they sit in a movie theater. M&Ms hasn't advertised during the Super Bowl since 2014.\nGroupon The deals website announced \"Girls Trip\" actor Tiffany Haddish as its spokesperson, and she'll also star in this year's Super Bowl ad. Haddish was already a fan of Groupon, having taken Jada Pinkett Smith and Will Smith on a discount Cajun \"swamp tour\" during \"Girls Trip\" filming. It's been seven years since Groupon advertised during the game — in 2011 it ran two controversial ads, that were accused of making light of issues in Tibet and Brazil, that it had to pull .\nMonster Products Ethan Miller | Getty Images Monster founder Noel Lee (left) and rapper Iggy Azalea at the Consumer Electronics Show in Las Vegas on January 8, 2018 The home entertainment company announced rapper Iggy Azalea as its spokesperson at the Consumer Electronics Show in Las Vegas last week and she will also star in its first Super Bowl commercial. Azalea will launch its wireless jewelry-style \"AirLinks\" headphones with an ad that will feature a new single.\nHyundai Last year's emotional tribute to the U.S. military showed troops overseas being connected by video link to their families who were at the Super Bowl (above). This year, Hyundai will continue with its \"Better Drives Us\" theme. Full plans haven't been revealed yet, but it's the tenth time the car manufacturer has advertised at the game.\nIntuit Not many people know that QuickBooks and Turbo Tax are owned by parent company Intuit , and this year the business will run a corporate campaign featuring animated characters in its first Super Bowl spot. It will also run an ad for TurboTax, its fifth appearance at the Super Bowl. Details aren't yet confirmed, but it started the year with campaigns talking about free filing (shown above) and being unafraid of tax.\nSquarespace Pier Marco Tacca | Getty Images Keanu Reeves at a press conference for his motorcycle brand Arch, at the International Motorcycle Fair in Milan on November 8, 2017 Last year's Emmy-winning Super Bowl ad starred John Malkovich trying to make it as a fashion designer, and this year the website-building company will feature Keanu Reeves, it announced Wednesday. No further details have been released, but the company said Reeves built a website for his motorcycle company Arch on Squarespace in 2015.\nStella Artois Stella Artois Matt Damon will feature in Stella Artois' Super Bowl 2018 commercial Stella Artois continues its tie-up with Matt Damon to promote its partnership with non-governmental organization Water.org. Damon appeals for people to buy a Stella Artois chalice, with the aim to provide clean water for 1 million people for five years. It will be the first time Stella has advertised during the Super Bowl since 2011.\nSuper Bowl LII takes place on February 4, and will air on NBC.\nDisclosure: NBC and CNBC are owned by Comcast's NBCUniversal unit.", "external_links": ["https://www.youtube.com/embed/Ir8f1DDAiIA", "https://www.youtube.com/embed/P7n-GxJBw1k", "https://www.youtube.com/embed/VneoEvAJX0g", "https://www.youtube.com/embed/ewNEBVwZuxw", "https://www.youtube.com/embed/Dx_D6phoqck", "https://www.youtube.com/embed/ftC0jYFi34c", "https://www.youtube.com/embed/D8Cb5Wk2t-8", "http://www.nbcnews.com/id/41458483/ns/business-business_of_the_super_bowl/t/groupon-super-bowl-ads-draw-scorn/#.Wl91r2u0OUk"], "published": "2018-01-18T16:22:00.000+02:00", "crawled": "2018-01-18T16:13:52.007+02:00", "highlightTitle": ""}