{"organizations": [], "uuid": "26e00801aa013b20c2567e49be903cac68f1f153", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-ev-energy-partners-announces-extension-of-grace-period-to-meet-nasdaq-requirement.html", "country": "US", "domain_rank": 767, "title": "EV Energy Partners Announces Extension of Grace Period to Meet NASDAQ Requirement", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.045, "site_type": "news", "published": "2018-01-18T01:00:00.000+02:00", "replies_count": 0, "uuid": "26e00801aa013b20c2567e49be903cac68f1f153"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-ev-energy-partners-announces-extension-of-grace-period-to-meet-nasdaq-requirement.html", "ord_in_thread": 0, "title": "EV Energy Partners Announces Extension of Grace Period to Meet NASDAQ Requirement", "locations": [], "entities": {"persons": [], "locations": [{"name": "houston", "sentiment": "none"}], "organizations": [{"name": "ev energy partners", "sentiment": "negative"}, {"name": "nasdaq", "sentiment": "none"}, {"name": "evep", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON, Jan. 17, 2018 (GLOBE NEWSWIRE) -- EV Energy Partners, L.P. (NASDAQ:EVEP) today announced that it received a notice from the NASDAQ Stock Market granting an additional 180-day grace period to regain compliance with NASDAQ’s minimum bid price requirement.\nAs previously disclosed, EVEP was notified by NASDAQ on July 17, 2017, that it no longer satisfied the minimum bid price requirement for continued listing of $1.00 per unit. In anticipation of not meeting the minimum bid price requirement by January 15, 2018, the end of the initial 180-day grace period, EVEP applied for and was approved to transfer the listing of its units to the NASDAQ Capital Market. In order to regain compliance, the minimum bid price per unit of EVEP’s common units must be at least $1.00 for at least ten consecutive business days during the additional 180-day grace period, which will end on July 16, 2018. If EVEP fails to regain compliance during this grace period, EVEP’s common units will be subject to delisting by NASDAQ. EVEP has provided NASDAQ written assurance that it intends to implement a reverse unit split if the closing bid price of its units is not at least $1.00 for a minimum of ten consecutive business days during the extension period.\nAbout EV Energy Partners, L.P.\nEV Energy Partners, L.P. is a master limited partnership engaged in acquiring, producing and developing oil and natural gas properties. More information about EVEP is available on the Internet at http://www.evenergypartners.com .\n(code #: EVEP/G)\nForward Looking Statements\nThis press release may include statements that are not historical facts which are “forward-looking statements” within the meaning of the U.S. Private Securities Litigation Reform Act of 1995. These statements relate to, among other things, EVEP’s future financial and operating performance and results, EVEP’s ability to meet the minimum bid price requirements of the NASDAQ or to cure any deficiency in meeting the minimum bid price requirements, the implementation of a reverse unit split, and other statements which include words such as “anticipates,” “plans,” “projects,” “expects,” “intends,” “believes,” “should,” and similar expressions of forward-looking information. Forward-looking statements are inherently uncertain and necessarily involve risks that may affect the business prospects and performance of EVEP. These statements are based on certain assumptions made by EVEP based on its experience and perception of historical trends, current conditions, expected future developments and other factors it believes are appropriate in the circumstances. Actual results may differ materially from those contained in the press release. Such risks and uncertainties include, but are not limited to, our ability to meet the financial covenants in our debt agreements and continue as a going concern, changes in commodity prices, changes in reserve estimates, requirements and actions of purchasers of properties, exploration and development activities, the availability and cost of financing, the returns on our capital investments and acquisition strategies, the availability of sufficient cash flow to pay distributions and execute our business plan and general economic conditions. Additional information on risks and uncertainties that could affect our business prospects and performance are provided in the most recent reports of EVEP with the SEC. You are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of this press release. All forward-looking statements included in this press release are expressly qualified in their entirety by the foregoing cautionary statements.\nAny forward-looking statement speaks only as of the date on which such statement is made and EVEP undertakes no obligation to correct or update any forward-looking statement, whether as a result of new information, future events or otherwise.\nEV Energy Partners, L.P., Houston\nNicholas Bobrowski\n713-651-1144\nhttp://www.evenergypartners.com\nSource:EV Energy Partners, L.P.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/f17752c1-307a-4531-bf52-f8a46388d35b", "https://www.globenewswire.com/Tracker?data=5WIX4A8dk9rwDCJo9TRckvb92zfLSck4SQSkW2HUAhFMJl87oguvkzKHyzjfazqBrWEvxcIBM_FvO502xBCCo7sA-ivYE864CaTARZw6BeeD6RWwcwUNoGlTH6MJGgIr", "https://www.globenewswire.com/Tracker?data=5WIX4A8dk9rwDCJo9TRckvb92zfLSck4SQSkW2HUAhFmtDXnpPrWSoAzY_YkJprb5cqgcJ-1arfxr44PKRV5CwNpJZf00q9AEcT43f-5wCMnDZHu8G7EdMT8Sno1luDaengyjmNJQKUIqhlT5VpULonTmqb8PNjUlTxU1tuEK7iG99qYiJsaSYAytGPKx5YSu6TgdFHEwzV1J30HbtTx58WocgrjFiMdFLxPNq_UFgr9wKy1BJNT3t_oDdE8RQyd4p-HYhsC9c8M63QYU1-sm5dz8G3PR249ZxzVAto7P1c="], "published": "2018-01-18T01:00:00.000+02:00", "crawled": "2018-01-18T03:33:51.062+02:00", "highlightTitle": ""}