{"organizations": [], "uuid": "1150a1d86e65f404ffff01ed27c49db7ac72f8c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/15/104946339-GettyImages-506228848.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/24/france-macron-says-globalization-is-going-through-a-major-crisis.html", "country": "US", "domain_rank": 767, "title": "France's Macron says globalization is going through a major crisis", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T18:47:00.000+02:00", "replies_count": 0, "uuid": "1150a1d86e65f404ffff01ed27c49db7ac72f8c9"}, "author": "Holly Ellyatt", "url": "https://www.cnbc.com/2018/01/24/france-macron-says-globalization-is-going-through-a-major-crisis.html", "ord_in_thread": 0, "title": "France's Macron says globalization is going through a major crisis", "locations": [], "entities": {"persons": [{"name": "macron", "sentiment": "negative"}, {"name": "xi jinping", "sentiment": "none"}, {"name": "angela merkel", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "French President Emmanuel Macron has said that globalization is facing a \"major crisis\" and that collective action is needed to confront the challenge.\n\"Let us not be naive, globalization is going through a major crisis and this challenge needs to be collectively fought by states and civil society in order to find and implement global solutions,\" he said at the World Economic Forum in Davos, Switzerland, on Wednesday.\n\"I want to come here (to Davos) to make a call to action. France has been affected by structural change and this relationship with globalization,\" he added.\nMacron was tipped as the European leader to watch at the Forum , particularly as he appears to be the strongest leader in the region at the moment while Germany's Chancellor Angela Merkel continues in her long-running attempt to form a coalition government with a rival party.\nSpeaking to CNBC after the speech, Macron said \"more cooperation\" was needed and a \"global compact\" was necessary to mitigate the negative consequences of globalization. The compact would see governments, companies and investors finance \"the common good,\" Macron said.\n\"We have to accompany this transition and we have to deliver a new message to our middle and working classes, without this consistency it will be impossible to deliver,\" he said.\n\"So [the 'global compact' is] a strong commitment, we are reforming France in depth and making it far more competitive but at the same time we want to build a new global leadership in that direction.\"\nMacron has only been in office for eight months, having fought off rival presidential candidate and far-right politician Marine Le Pen in an election last May.\nSpeaking to the audience in Davos earlier, he said that France had witnessed mass fears about globalization and a lack of understanding over its benefits.\n\"Some people proposed to French people just to get out of globalization as a very first solution to these issues,\" he said.\nFABRICE COFFRINI | AFP | Getty Images French President Emmanuel Macron addresses the annual World Economic Forum (WEF) on January 24, 2018 in Davos, eastern Switzerland. He said it was incumbent on his leadership to build a France that was \"prosperous and open to the world\" and to make sure people \"weren't left behind\" by globalization.\nMacron is also taking an increasingly visible presence on the global stage, having traveled to China earlier in January and the U.K. last week.\nHe is seen as a keen globalist and proponent of free trade and during his recent trip to China emphasized the need for reciprocal open trade agreements when meeting President Xi Jinping.\nA vision for Europe Drawing regular applause from the audience, Macron said he wanted France \"to find its place in world competition\" and that a stronger, more unified Europe was essential.\nHis comment \"France is back, France is back at the core of Europe\" was also popular with the crowd of European leaders and business people at Davos as he set out his regional strategy.\n\"The core strategy for me in the coming years and especially for this year is to manage to deliver a new foundation for our Europe,\" he said. Issues surrounding energy, migration, digital and investments need to be improved, he warned, but added that Europe had values it could offer to the world.\nshow chapters French President Emmanuel Macron: France is back 3 Hours Ago | 07:13 \"Our vision, our DNA, in terms of our relationship with freedom, justice, fairness and individual rights is unique and there is a balance of these values in Europe, this is the core of our globalization.\"\n\"If we want to avoid this fragmentation of the world, we need a stronger Europe ... And my view is that we have to re-design a 10-year strategy to make Europe a natural economic, social, green, scientific and political power.\"\nHe conceded that with 27 members, the EU would never be able to build something \"so ambitious.\"\n\"I don't want to say it's impossible but we need more ambition to deliver on these critical issues. We need to change our methodology and to not have to wait for everyone around the table to be ready to move forward,\" he said.\n\"But those that don't want to move forward should not block the more ambitious people in the room,\" he said, to more applause.\n— CNBC's Karen Tso contributed reporting to this story.", "external_links": [], "published": "2018-01-24T18:47:00.000+02:00", "crawled": "2018-01-24T18:54:32.012+02:00", "highlightTitle": ""}