{"organizations": [], "uuid": "073f1787bbd640aab2cee41697e5ec68ea77e86b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/myanmar-electricity/myanmar-to-double-electricity-capacity-by-2021-to-fill-power-shortages-idUSL4N1PQ2UM", "country": "US", "domain_rank": 408, "title": "Myanmar to double electricity capacity by 2021 to fill power shortages", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T10:48:00.000+02:00", "replies_count": 0, "uuid": "073f1787bbd640aab2cee41697e5ec68ea77e86b"}, "author": "", "url": "https://www.reuters.com/article/myanmar-electricity/myanmar-to-double-electricity-capacity-by-2021-to-fill-power-shortages-idUSL4N1PQ2UM", "ord_in_thread": 0, "title": "Myanmar to double electricity capacity by 2021 to fill power shortages", "locations": [], "entities": {"persons": [{"name": "shoon naing", "sentiment": "none"}, {"name": "aung san suu kyi", "sentiment": "none"}, {"name": "yimou lee", "sentiment": "none"}], "locations": [{"name": "myanmar", "sentiment": "none"}, {"name": "yangon", "sentiment": "none"}], "organizations": [{"name": "ministry of electricity and energy", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 8:49 AM / in 30 minutes Myanmar to double electricity capacity by 2021 to fill power shortages Shoon Naing , Yimou Lee 3 Min Read \nYANGON, Jan 31 (Reuters) - Myanmar is planning to double its electric power capacity by 2021 by building natural gas-fired power plants, two senior officials told Reuters on Wednesday, in an ambitious move to tackle chronic power shortages in the energy-starved country. \nWith only one-third of the country’s 60 million people connected to the electrical grid and cities experiencing blackouts, Myanmar needs to boost its power supply to attract much-needed foreign investment. \nThe plan is the most impressive attempt yet to tackle the energy problem since the government led by Aung San Suu Kyi swept to power in March 2016. However, experts cautioned that it remains to be seen how the government would strike power purchase agreements with the investors. \nFour gas-fired power plants would be built by 2021 at a total cost of $5.16 billion in several parts of Myanmar, said two officials from Myanmar’s Ministry of Electricity and Energy. \nThey said the plants will raise generation capacity by 3,100 megawatts (MW) and would double the current capacity of around 3,000 MW. \n“We will need another 3,000 megawatts by 2021. That’s why we speed up the process in order to quickly meet the demand,” said Soe Myint, deputy permanent secretary at the energy ministry. \nMyanmar’s government has signed agreements to “start preliminary engineering work,” such as environmental assessments, with six companies, said Zaw Win Naing, assistant secretary at the ministry. \nThe companies include TOTAL, Siemens AG , Zhefu Holding, TTCL Public Company Ltd , Sinohydro Corporation and Myanmar-based Supreme Trading. \nThe four plants will be in areas including the western state of Rakhine and Myanmar’s largest city of Yangon, with the government purchasing electricity from the six firms, said Zaw Win Naing. \nHe said Myanmar is in talks with the individual companies to work out the power purchase agreements. The plants would mostly use imported liquefied natural gas (LNG). \nMyanmar has gas reserves, but exports most of its existing offshore production. Several floating gas storage and regasification units would be deployed to store the LNG for the projects, said Soe Myint. \nWa Than Oo, an analyst from Myanmar Energy Monitor, said the projects are “ambitious in scope” but there are uncertainties. \n“There have been negative experiences in the past where electricity generation projects have been announced but no power purchase agreement has been signed, and as a result they haven’t been built.” \nMyanmar aims to increase its power generation more than fourfold by 2030 to meet demand, though that could be difficult to achieve. (Reporting By Shoon Naing and Yimou Lee; Writing By Yimou Lee; Editing by Christian Schmollinger)", "external_links": [], "published": "2018-01-31T10:48:00.000+02:00", "crawled": "2018-01-31T11:23:28.026+02:00", "highlightTitle": ""}