{"organizations": [], "uuid": "9f4b79b2cb31b4271f5f7c51a5e58143e557aebd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220467145&w=1200&r=LYNXMPEE080CT", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/us-china-france/macron-urges-china-eu-to-avoid-pitfalls-of-protectionism-idINKBN1EY0L6", "country": "US", "domain_rank": 408, "title": "Macron urges China, EU to avoid pitfalls of protectionism", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T09:09:00.000+02:00", "replies_count": 0, "uuid": "9f4b79b2cb31b4271f5f7c51a5e58143e557aebd"}, "author": "", "url": "https://in.reuters.com/article/us-china-france/macron-urges-china-eu-to-avoid-pitfalls-of-protectionism-idINKBN1EY0L6", "ord_in_thread": 0, "title": "Macron urges China, EU to avoid pitfalls of protectionism", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING (Reuters) - President Emmanuel Macron offered on Tuesday to open up the French economy to Chinese investment in exchange for greater access to China’s booming markets, warning in talks in Beijing that existing trade imbalances would lead to protectionism.\nOn the first state visit of his eight-month-old presidency, Macron is hoping greater openness from China, coupled with lobbying from the 50-strong business delegation traveling with him, will help narrow the 30-billion-euro ($36 bln) trade deficit Paris runs with Beijing.\nBut despite bringing with him a delegation of French business, finance and industry - including senior executives from Airbus, BNP Paribas, AccorHotels, EDF and LVMH - there were no immediate announcements on the second leg of his three-day trip of major deals. Instead, smaller contracts or commitments to go on talking were signed.\nBNP Paribas was set to announce plans for a joint-venture on consumer credit, a French official in Beijing said, adding that French nuclear group Areva had “never been so close” to signing a contract to build a nuclear waste reprocessing plant in China.\n“We have an access to markets which is unbalanced, unsatisfying,” Macron told members of the French and Chinese business community at a start-up incubator in Beijing.\n“If we don’t deal with this responsibly, the first, natural, reaction will be to close up on both sides.”\nIn his short time in office, 40-year-old Macron has managed to push through reforms to France’s labor market and seen a steady rise in business and consumer confidence. Growth forecasts for 2018 have been upgraded.\nMacron has emerged as arguably the strongest voice in Europe, in the absence of either German and British leadership, with Chancellor Angela Merkel bogged down in coalition negotiations and Prime Minister Theresa May swamped by Brexit.\nSoon after arriving in China, the French president declared that “Europe is back”, announcing he intended to visit China every year of his five-year presidency.\nOPEN ON BOTH ENDS But while the rhetoric has been strong, and TV commentary suggests Macron and his glamorous 64-year-old wife Brigitte have been a big hit with the Chinese, the underlying success of state visits is often measured in the size of business contracts.\nPlanemaker Airbus was in talks to sell 100 or more jetliners to China, officials familiar with the talks said last week.\nFrench President Emmanuel Macron delivers an economic speech to Chinese and French entrepreneurs at SOHO 3Q in Beijing, China January 9, 2018. REUTERS/Jason Lee But after an official contract signing ceremony on Tuesday, it appeared that an Airbus deal had not been clinched. That would be a significant setback for Macron and Europe, although it is possible details will be finalised in the weeks ahead.\nU.S. President Donald Trump’s visit to China last year coincided with an announcement by Boeing Co that it had sold 300 aircraft to China.\nWithout a big dollar figure attached to the visit, Macron appeared to have fallen short, although French officials said China had asked them not to put a figure on any commercial and industrial deals they did strike.\nJack Ma, founder and executive chairman of online retailer Alibaba, gave Macron’s pitch for more openness his backing on Tuesday, but added both sides had a part to play.\nSlideshow (9 Images) “I think he’s right, China should open more, China is opening more,” he told reporters on the sidelines of a business forum in Beijing.\n“France should open more, China should open more,” he added.\nForeign businesses in China though have grown more pessimistic about Beijing’s market restrictions even though government officials have repeatedly pledged to increase access. These businesses have also chafed at government policies they see as intended to assimilate and supplant foreign technology.\n“We welcome France to expand investment in China and exports of high-grade French products, and we hope the French side will further loosen exports of high-tech products to China,” China’s Premier Li Keqiang told Macron, according to a Chinese government statement.\nMacron, who met President Xi Jinping on Monday, said the two countries would fall into a lose-lose situation if continued restrictions on foreign firms in China prompted France and Europe to put a brake on Chinese investment in Europe.\n“Let’s open up both instead,” said Macron, whose government has at the same time called for greater scrutiny of Chinese investment in Europe, particularly in sensitive sectors, concerned about protecting French interests and security.\nThe two presidents met again on Tuesday at Beijing’s Great Hall of the People, and oversaw the signing of bilateral agreements, including the framework deals for Airbus and Areva in China.\nChinese online retail giant JD.com agreed to sell 2 billion euros worth of French products - such as Remy Martin cognac or Evian water - on its website over the next two years. JD.com also signed a deal to buy 100 million euros of machinery from French engineering firm Fives.\nReporting by Michel Rose; Additional reporting by Tom Daly and Michael Martina; Writing by Luke Baker; Editing by Clarence Fernandez, Raissa Kasolowsky and Neil Fullick\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-09T09:09:00.000+02:00", "crawled": "2018-01-09T09:47:07.521+02:00", "highlightTitle": ""}