{"organizations": [], "uuid": "373d0984964077fb7a66ffcdc9cb9ae895cbe70f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224643460&w=1200&r=LYNXMPEE0N014", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-aviation-finance-embraer-turboprop/embraer-says-no-plans-to-build-turboprop-focuses-on-e2-jets-idUSKBN1FD01G", "country": "US", "domain_rank": 408, "title": "Embraer says no plans to build turboprop, focuses on E2 jets", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T08:52:00.000+02:00", "replies_count": 0, "uuid": "373d0984964077fb7a66ffcdc9cb9ae895cbe70f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-aviation-finance-embraer-turboprop/embraer-says-no-plans-to-build-turboprop-focuses-on-e2-jets-idUSKBN1FD01G", "ord_in_thread": 0, "title": "Embraer says no plans to build turboprop, focuses on E2 jets", "locations": [], "entities": {"persons": [{"name": "john slattery", "sentiment": "none"}], "locations": [{"name": "dublin", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "embraer", "sentiment": "negative"}, {"name": "bombardier", "sentiment": "none"}, {"name": "bombardier inc", "sentiment": "none"}, {"name": "embraer commercial aviation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DUBLIN (Reuters) - Brazil’s Embraer continues to study an eventual return to the turboprop market after a 20-year hiatus but has no immediate plans to launch such a plane as it focuses on the latest version of its regional E-Jet series, a top executive said.\nEmbraer ( EMBR3.SA ) said in September it was considering the development of a propeller-driven passenger plane, potentially returning to a segment dominated by the Franco-Italian ATR ( AIR.PA )( LDOF.MI ) and Canada’s Bombardier Inc ( BBDb.TO ).\nExperts say developing a turboprop would open a new front against arch-rival Bombardier, while giving Embraer options to address the U.S. regional market, where the smallest member of its upgraded E2 family, the E175-E2, faces union restrictions.\nBut Embraer Commercial Aviation Chief Executive John Slattery said the project was on the back burner for now.\n“I continue to be interested in exploring the business case for a turboprop but I can assure you there are no immediate plans to launch any turboprop program,” he told Reuters on Tuesday.\n“Our focus now is exclusively on certification of the E190-E2, which will happen in the next few weeks, and the E195-E2 in due course, next year.”\nNonetheless, Slattery said he continued to have a “small stealth team” working on the business case for a turboprop.\n“It is a platform that I continue to have interest in and I monitor what that stealth team is doing. But until we get our E2 certified and sold it will be difficult for me to go to the shareholders and ask for investment for a new platform, and I am acutely conscious of that.”\nA turboprop would flesh out a regional portfolio that Embraer increasingly sees as covering everything up to 150 seats, rather than the narrower 70-130-seat range traditionally associated with the world’s third largest planemaker.\n“We always look at opportunities. That is in our natural franchise footprint. We have said that we want to be the leader below 150 seats,” Slattery said on the sidelines of the Airline Economics conference in Dublin.\nBy capping its ambitions at 150 seats, Embraer has signaled it has no plans to build a larger jet encroaching on territory dominated by Airbus ( AIR.PA ) and Boeing, industry experts said.\nEmbraer is in talks over a tie-up with Boeing ( BA.N ), on which Slattery declined detailed comment.\nBut the Brazilian firm is equally signaling to the industry that it does not exclude building smaller aircraft.\n“I have said that in due course I would like to have a second platform in commercial aviation so the turboprop certainly ticks those boxes, but right now my shareholders want me to certify the E2 and to sell it and that’s where my focus is,” Slattery said.\n“You would only build a new aircraft if the business case were robust.”\nExperts say any new turboprop could also have ramifications for an engine market dominated by Pratt & Whitney Canada ( UTX.N ), currently sole supplier to both ATR and Bombardier.\nGeneral Electric ( GE.N ) is working on new turboprop designs and could see any move by Embraer, or an upgrade by the two existing players, as a chance to loosen its rival’s grip.\nReporting by Tim Hepher; Editing by Conor Humphries\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T08:52:00.000+02:00", "crawled": "2018-01-24T04:30:56.010+02:00", "highlightTitle": ""}