{"organizations": [], "uuid": "d7e9fe46d045d448e6d81de1635655271f5e8132", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-yatra-online-inc-announces-results-for-the-three-months-ended-december-31-2017.html", "country": "US", "domain_rank": 767, "title": "Yatra Online, Inc. Announces Results For The Three Months Ended December 31, 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.019, "site_type": "news", "published": "2018-01-30T17:26:00.000+02:00", "replies_count": 0, "uuid": "d7e9fe46d045d448e6d81de1635655271f5e8132"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-yatra-online-inc-announces-results-for-the-three-months-ended-december-31-2017.html", "ord_in_thread": 0, "title": "Yatra Online, Inc. Announces Results For The Three Months Ended December 31, 2017", "locations": [], "entities": {"persons": [{"name": "dhruv shringi", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "gurgaon", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "yatra online, inc", "sentiment": "neutral"}, {"name": "yatra online, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GURGAON, India and NEW YORK, January 30, 2018 /PRNewswire/ --\nYatra Online, Inc. (NASDAQ: YTRA, OTCQX: YTROF), India's leading online travel company, today announced its unaudited financial and operating results for three months ended December 31, 2017.\n(Logo: http://mma.prnewswire.com/media/538225/Yatra_Logo.jpg )\nWe delivered yet another solid quarter of results with revenue less service cost growth at 45.6% year-over-year. Our multi-channel approach and the resultant symbiotic relationship between our corporate and consumer direct businesses continues to deliver well for us. We have taken great strides on our technology platform for both our retail and corporate customers. This is an exciting time for Yatra, as we believe the combination of strong economic growth and consumer demand at the macro level and our own unique approach at the company level will help us maintain a strong growth rate over the longer term. Dhruv Shringi, Co-founder and CEO.\nYatra Online, Inc.'s financial and operating results for the three months ended December 31, 2017, include the financial and operating results of Air Travel Bureau Limited ('ATB') for three months ended December 31, 2017.\nFinancial and operating highlights for the three months ended December 31, 2017 :\n- Re venue increased by 40.8% year-over-year (YOY) to INR 3,360.4 million.\n- Revenue Less Service Cost(2) increased to INR 1,957.8 million, representing an increase of 45.6% YOY.\n- Revenue Less Service Cost(2) from Hotels and Packages increased to INR 437.3 million, an increase of 46.8% YOY.\n- Standalone Hotel Room Nights Booked during the quarter was 0.5 million, represented an increase of 37.8% YOY.\n- Revenue Less Service Cost(2) from Air Ticketing increased to INR 1,370.4 million, an increase of 46% YOY.\n- Gross Air Passengers Booked were 2.3 million representing YOY growth of 31.0%.\n- Total Gross Bookings (Air Ticketing and Hotels and Packages) (4) reached INR 23.9 billion representing YOY growth of 44.8%.\n- Profit for the period of INR 232.3 million and Adju sted EBITDA (3) Loss of INR 388.3 million.\nThree months ended December 31, YOY 2017 2017 2016 Change Unaudited (in thousands except percentages) INR USD INR % Financial Summary as per IFRS Revenue 3,360,4 43 52,646 2,387,22 6 40.8 % Results from operations (631,750 ) (9,898 ) (282,231) 123.8 % Exceptional Items (1) - - (4,251,447) 100.0 % Profit/(loss) for the period 232,311 3,639 (4,613,916) Financial Summary as per non-IFRS measures Revenue Less Service Costs (2) 1,957,758 30,671 1,344,722 45.6 % Air Ticketing 1,370,397 21,469 938,719 46.0 % Hotels and Packages 437,340 6,852 297,834 46.8 % Other 150,021 2,350 108,169 38.7 % Adjusted EBITDA (3) (388,255) (6,083) (187,140) 107.5 % Operating Metrics Gross Bookings (4) 23,936,731 375,007 16,532,430 44.8 % Air Ticketing 20,448,781 320,363 13,837,882 47.8 % Hotels and Packages 3,487,950 54,644 2,694,548 29.4 % Net Revenue Margin% (5) Air Ticketing 6.7 % 6.8 % Hotels and Packages 12.5 % 11.1 % Quantitative details (6) Air Passengers Booked 2,308 1,761 31.0 % Stand-alone Hotel Room Nights Booked 504 365 37.8 % Packages Passengers Travelled 46 36 26.2 %\nMore details are available on our site - http://investors.yatra.com/home/default.aspx\nAbout Yatra Online, Inc and Yatra Online Pvt Ltd\nYatra Online, Inc is the parent company of Yatra Online Pvt Ltd which is based in Gurugram, India and is one of India's leading online travel companies and operates the website Yatra.com . The company provides information, pricing, availability, and booking facility for domestic and international air travel, domestic and international hotel bookings, holiday packages, buses, trains, in city activities, inter-city and point-to-point cabs, homestays and cruises. As a leading platform of accommodation options, Yatra provides real-time bookings for more than 70,000 hotels in India and over 800,000 hotels around the world.\nCustomers can access Yatra in multiple ways: through a user-friendly website, mobile optimised WAP site and applications, a multi-lingual call centre, a countrywide network of Holiday Lounges and Yatra Travel Express stores.\nLaunched in August 2006, Yatra was ranked the Most Trusted e-Commerce Travel Brand in India in the Economic Times Brand Equity Survey 2016 for the second successive year, and has won the National Tourism Award for 'Best Domestic Tour Operator (Rest of India)' at the India Tourism Awards held in September 2017 for the third time in a row.\nSafe Harbor Statement :\nThis press release contains certain statements concerning the Company's future growth prospects and forward-looking statements, as defined in the safe harbor provisions of the U.S. Private Securities Litigation Reform Act of 1995. These forward-looking statements are based on the Company's current expectations, assumptions, estimates and projections about the Company and its industry. These forward-looking statements are subject to various risks and uncertainties. Generally, these forward-looking statements can be identified by the use of forward-looking terminology such as \"anticipate,\" \"believe,\" \"estimate,\" \"expect,\" \"intend,\" \"will,\" \"project,\" \"seek,\" \"should\" and similar expressions. Such statements include, among other things, management's beliefs as well as our strategic and operational plans. Forward-looking statements involve inherent risks and uncertainties. A number of important factors could cause actual results to differ materially from those contained in any forward-looking statement. Potential risks and uncertainties include, but are not limited to, the slow-down of economic growth in India and the global economic downturn, general declines or disruptions in the travel industry, volatility in the trading price of our shares, our reliance on our relationships with travel suppliers and strategic alliances, failure to further increase our brand recognition to obtain new business partners and consumers, failure to compete against new and existing competitors, failure to successfully manage current growth and potential future growth, risks associated with any strategic investments or acquisitions, seasonality in the travel industry in India and overseas, failure to successfully develop our corporate travel business, damage to or failure of our infrastructure and technology, loss of services of our key executives, and inflation in India and in other countries. These and other factors are discussed in our reports filed with the U.S. Securities and Exchange Commission. All information provided in this press release is provided as of the date of issuance of this press release, and we do not undertake any obligation to update any forward-looking statement, except as required under applicable law.\nNote:\n(1) The exceptional items relate to listing related expenses, transaction costs and contingent dividend expense.\n(2) Revenue Less Service Cost represents Revenue after deducting service costs. See \"Certain Non-IFRS Measures.\"\n(3) See section \"Certain Non-IFRS Measures.\"\n(4) Gross Bookings represent the total amount paid by our customers for travel services and products booked through us, including taxes, fees and other charges, and are net of cancellation fees and refunds.\n(5) Net Revenue Margin is defined as Revenue Less Service Cost as a percentage of Gross Booking.\n(6) Quantitative details are considered on a gross basis.\nFor further information, please contact:\nManish Hemrajani\nYatra Online, Inc.\nVP, Head Investor Relations\nmanish.hemrajani@yatra.com\nSOURCE Yatra Online, Inc.", "external_links": ["http://investors.yatra.com/home/default.aspx"], "published": "2018-01-30T17:26:00.000+02:00", "crawled": "2018-01-30T18:46:23.000+02:00", "highlightTitle": ""}