{"organizations": [], "uuid": "cbeeef2825a0d9fceaef79b09145bc0a7b777658", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222849639&w=1200&r=LYNXMPEE0G1WI", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-motor-rally-dakar/rallying-sainz-stretches-dakar-lead-after-penalty-rescinded-idUKKBN1F630H", "country": "US", "domain_rank": 408, "title": "Rallying - Sainz stretches Dakar lead after penalty rescinded", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T00:16:00.000+02:00", "replies_count": 0, "uuid": "cbeeef2825a0d9fceaef79b09145bc0a7b777658"}, "author": "", "url": "https://uk.reuters.com/article/uk-motor-rally-dakar/rallying-sainz-stretches-dakar-lead-after-penalty-rescinded-idUKKBN1F630H", "ord_in_thread": 0, "title": "Rallying - Sainz stretches Dakar lead after penalty rescinded", "locations": [], "entities": {"persons": [{"name": "reuter", "sentiment": "negative"}, {"name": "sainz", "sentiment": "negative"}, {"name": "carlos sainz", "sentiment": "none"}, {"name": "belen", "sentiment": "none"}, {"name": "stephane", "sentiment": "none"}, {"name": "nasser al-attiyah", "sentiment": "none"}, {"name": "stephane peterhansel", "sentiment": "none"}, {"name": "bernhard ten brinke", "sentiment": "none"}, {"name": "carlos", "sentiment": "none"}], "locations": [{"name": "dakar", "sentiment": "none"}, {"name": "argentina", "sentiment": "none"}, {"name": "chilecito", "sentiment": "none"}, {"name": "qatar", "sentiment": "none"}, {"name": "fiambala", "sentiment": "none"}], "organizations": [{"name": "toyota", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "peugeot", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 10:19 PM / Updated 12 hours ago Rallying - Sainz stretches Dakar lead after penalty rescinded Reuters Staff 3 Min Read \n(Reuters) - Spaniard Carlos Sainz stretched his Dakar Rally lead to more than an hour on Wednesday after organizers rescinded a 10-minute penalty imposed earlier in the week for an incident with a quadbike. \nThe double world rally champion, and father of the Formula One driver of the same name, finished third for Peugeot in the 281km 11th stage from Belen to the sands of Fiambala and Chilecito in Argentina. \nThat left Sainz an hour and 45 seconds clear of French team mate and 13-times champion Stephane Peterhansel, who finished fourth in the stage won by Toyota’s Dutch driver Bernhard ten Brinke, with three days to go. \nQatar’s two-times Dakar winner Nasser al-Attiyah was in third place for Toyota, an hour and 24 minutes off the leader’s pace. \nSainz had started the day 50 minutes clear but, despite the top four finishing within 15 seconds of each other, gained another 10 minutes thanks to the stewards. \n“Carlos now has a comfortable lead and Stephane is covering him in second place. But there’s still a long way to go to the finish and we have to get to Cordoba with no drama, which is never a given,” said Peugeot Sport head Bruno Famin. Dakar Rally - 2018 Peru-Bolivia-Argentina Dakar rally - 40th Dakar Edition stage eleven, Belen to Chilecito - January 17, 2018. Carlos Sainz of Spain prepares to depart for the stage. REUTERS/Andres Stapff \nDutch rider Kees Koolen had claimed on Monday that Sainz had hit his machine on a previous stage and failed to stop, with the stewards penalizing the Spaniard. \nSainz had angrily denied any contact was made and Peugeot had backed him up. Slideshow (6 Images) \n“We appreciate the event stewards looking into this again and re-examining all the documents and other evidence at their disposal,” Famin said in a Peugeot statement. \n“We supplied them with a certain amount of data, relating to the speed and movement of the car. They were able to compare that to the tracking and ascertain that Carlos’s point of view was the correct one - of which we never had any doubt.” \nIn the motorcycle category, Spanish challenger Joan Barreda had to withdraw after requesting medical assistance near Fiambala. \nAustralian Toby Price, the 2016 champion, won the stage with   on a KTM taking it carefully and staying   \nThursday’s 12th stage is from Fiambala to San Juan with   Reporting   Ed Osmond", "external_links": [], "published": "2018-01-18T00:16:00.000+02:00", "crawled": "2018-01-18T00:42:26.003+02:00", "highlightTitle": ""}