{"organizations": [], "uuid": "6aeb4660fd61e5dc175adab29ad0fc42e2b2024d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-aerohive-networks-announces-preliminary-fourth-quarter-2017-financial-results.html", "country": "US", "domain_rank": 767, "title": "Aerohive Networks Announces Preliminary Fourth Quarter 2017 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T00:15:00.000+02:00", "replies_count": 0, "uuid": "6aeb4660fd61e5dc175adab29ad0fc42e2b2024d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-aerohive-networks-announces-preliminary-fourth-quarter-2017-financial-results.html", "ord_in_thread": 0, "title": "Aerohive Networks Announces Preliminary Fourth Quarter 2017 Financial Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Schedules Earnings Conference Call for February 8\nMILPITAS, Calif.--(BUSINESS WIRE)-- Aerohive Networks™ (NYSE: HIVE) today announced preliminary results for the fourth quarter ended December 31, 2017.\nAerohive® expects net revenue for the fourth quarter to be approximately $37 million, which is below the Company's previously stated guidance of $40 million to $42 million. The Company expects non-GAAP gross margin to be between 67.5 percent and 68.5 percent, above the Company’s previously stated guidance of 66 percent to 67 percent. The Company expects gross margin to be between 67 percent and 68 percent on a GAAP basis. On a non-GAAP basis, the Company expects to report positive operating margin and a modest non–GAAP operating profit, towards the high end of the Company’s previously stated guidance. On a GAAP basis, the Company expects net loss to be in the range of $3 million to $4 million, primarily related to stock-based compensation expense of $3 million to $4 million. Aerohive increased its cash, cash equivalents and short-term investments by $12 million for the fiscal year and $3 million for the fourth quarter of 2017, excluding the impact in those periods of its share repurchase program.\nAs of the end of the fourth quarter of 2017, the Company’s cash, cash equivalents and short-term investments totaled $85 million.\n“We delivered non-GAAP operating profitability in our fourth quarter but were disappointed that our revenue was below our prior guidance,” stated David Flynn, President and Chief Executive Officer. “Following the change in our sales leadership at the end of our third quarter, we uncovered underlying sales execution issues which became fully apparent in the last month of the fourth quarter. We have taken actions to replace underperforming sales team members, and we believe that the new people we have been putting in place, combined with other actions, will enable us to capitalize on our improved product offering and exciting roadmap in 2018.”\nDuring the fourth quarter of 2017, Aerohive achieved significant milestones:\nOperationalized Dell OEM partnership; Shipped new AP122X access point; Released new SD-WAN product; Received initial orders for 1,500-site, PCI-compliant, cloud-managed switching deployment; and Received $1.7 million order from Fortune 500 customer in Asia that the Company expects to ship in 2018.\nIn 2018, Aerohive expects to benefit from:\nGrowing Dell business through OEM partnership; Strengthened solution based on mature HiveManager® NG product; Growing distributed-enterprise and branch business based on new full-stack solution that adds SD-WAN to access switching and Wi-Fi products; Delivering disruptive new AP form factor that will radically simplify enterprise Wi-Fi deployments and topologies; Expanding hospitality presence by leveraging Connect offering, wall-plate AP, and MSP management features; and Capitalizing on transition to 802.11ax as frontrunner in delivering new 802.11ax access points.\nThese preliminary, unaudited results are based on management's initial review of operations for the fiscal year and fourth quarter ended December 31, 2017 and remain subject to completion of the Company's customary year-end and quarterly closing and review procedures.\nThere will not be a conference call in conjunction with this press release.\nFourth Quarter and Fiscal Year 2017 Conference Call to be held on February 8, 2018\nAerohive Networks will release final results for the fourth quarter and fiscal year ended December 31, 2017 in its regularly scheduled earnings release and conference call after the U.S. markets close on Thursday, February 8, 2018. The conference call and live webcast for analysts and investors will take place at 2:00 p.m. Pacific time (5:00 p.m. Eastern time) that day. The call may be accessed by dialing 719-325-2170 and providing the passcode 1825507. A live and archived audio webcast of the conference call will be accessible from the “Investor Relations” section of the Company’s website at http://ir.aerohive.com .\nSafe Harbor Statement\nThis press release contains forward-looking statements, including statements regarding Aerohive operating performance and preliminary results for its fourth quarter and full year 2017; the Company’s expectations that it will be able to grow its Dell-related business through OEM partnership; the Company’s expectation that it will benefit from a strengthened solution based on a mature HiveManager NG product; the Company’s expectations that it will benefit from a growing distributed enterprise and branch business based on a new full-stack solution that adds SD-WAN to access switching and Wi-Fi products; the Company’s expectation that it will benefit from delivering a disruptive new AP form factor that will simplify enterprise Wi-Fi deployments and topologies; the Company’s expectations regarding expanding its hospitality presence by leveraging its Connect offering, wall-plate AP, and MSP management features; and the Company’s expectation that it will be able to successfully capitalize on the transition to 802.11ax as a frontrunner in delivering new 802.11ax access points.\nThese forward-looking statements are based on current expectations and are subject to completion of the Company's customary year-end and quarterly closing and review procedures. The actual outcomes and results may differ materially from those contemplated by these forward-looking statements as a result of completion of these procedures. In addition, forward-looking statements in this press release are based on current expectations and are subject to inherent uncertainties, risks and changes in circumstances that are difficult or impossible to predict. The actual outcomes and results may differ materially from those contemplated by these forward-looking statements as a result of these uncertainties, risk and changes in circumstances, including, but not limited to, risks and uncertainties related to: the Company’s ability to grow its Dell-related business through OEM partnerships; the Company’s ability to successfully sell new products and technologies, including a strengthened solution based on a mature HiveManager NG product and a new full-stack solution that adds SD-WAN to Access Switching and Wi-Fi products and new AP form factor that will simplify enterprise Wi-Fi deployments and topologies; the Company’s ability to capitalize on changing industry trends, including capitalizing on the transition to 802.11ax as a frontrunner in delivering new 802.11ax access points; the Company’s ability to expand its hospitality presence; the Company’s ability to continue to attract, integrate, retain and train skilled personnel, especially skilled R&D and sales personnel, in general and in specific regions; the Company’s ability to develop and expand its revenue opportunities and sales capacity and improve the effectiveness of its channel; the Company’s ability to improve its operating and sales execution, general demand for wireless networking in the industry verticals the Company targets or demand for Aerohive products in particular; unpredictable and changing market conditions and risks a", "external_links": ["http://www.businesswire.com/news/home/20180116006713/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fboundless.aerohive.com%2F&esheet=51744187&newsitemid=20180116006713&lan=en-US&anchor=blog&index=6&md5=f1c18dc81a2436932f11051beaa0856b", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51744187&newsitemid=20180116006713&lan=en-US&anchor=www.sec.gov&index=3&md5=b3bd3bcc9071b6831abc3d9c0c569f01", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fir.aerohive.com&esheet=51744187&newsitemid=20180116006713&lan=en-US&anchor=http%3A%2F%2Fir.aerohive.com&index=1&md5=94cbfea38d63223e6b6e03b4ef4d6bc4", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fir.aerohive.com%2F&esheet=51744187&newsitemid=20180116006713&lan=en-US&anchor=http%3A%2F%2Fir.aerohive.com&index=2&md5=6f9cf40e31d510087f1f227aafc0f341", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.facebook.com%2Faerohivenetworks%2F%3Fref%3Dts&esheet=51744187&newsitemid=20180116006713&lan=en-US&anchor=Facebook+page&index=7&md5=ac389cead87edb52d1e8d28983037642", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2F%23%2521%2FAerohive&esheet=51744187&newsitemid=20180116006713&lan=en-US&anchor=%40Aerohive&index=5&md5=4bbc26c83f43569a82e7a0277e5e9cc9", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.aerohive.com&esheet=51744187&newsitemid=20180116006713&lan=en-US&anchor=www.aerohive.com&index=4&md5=f9a627c678ab2c00b65308132ebce5f6"], "published": "2018-01-17T00:15:00.000+02:00", "crawled": "2018-01-17T00:04:42.000+02:00", "highlightTitle": ""}