{"organizations": [], "uuid": "6312327c89bc625acde29c419722d9062fb7190a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets/europe", "section_title": "European Stock Market News | Reuters.com", "url": "https://www.reuters.com/article/eu-exchanges-align-with-zurich-after-mif/eu-exchanges-align-with-zurich-after-mifid-ii-tick-size-mismatch-idUSL8N1P74BD", "country": "US", "domain_rank": 408, "title": "EU exchanges align with Zurich after MiFID II tick size mismatch", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T23:34:00.000+02:00", "replies_count": 0, "uuid": "6312327c89bc625acde29c419722d9062fb7190a"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/eu-exchanges-align-with-zurich-after-mif/eu-exchanges-align-with-zurich-after-mifid-ii-tick-size-mismatch-idUSL8N1P74BD", "ord_in_thread": 0, "title": "EU exchanges align with Zurich after MiFID II tick size mismatch", "locations": [], "entities": {"persons": [], "locations": [{"name": "london", "sentiment": "none"}, {"name": "zurich", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "cboe europe", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "cboe europe", "sentiment": "negative"}, {"name": "aquis exchange", "sentiment": "negative"}, {"name": "six swiss exchange", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON, Jan 12 (IFR) - European stock exchanges, including Cboe Europe and Aquis Exchange, have aligned minimum pricing increments for Swiss share trading with Zurich’s SIX Swiss Exchange, which some believe may have been granted an unintended competitive advantage by MiFID II.\nThe Swiss bourse saw its market share in domestic securities jump to 75% at the start of 2018 - up 10 percentage points from a year previously. The cause, some believe, was more granular pricing resulting from a mismatch in calculation data between EU and EEA exchanges under the MiFID II tick size regime.\nThe Swiss exchange adheres to the MiFID II regime, applying the same tick size logic as its EU counterparts, but as a non-EU venue it bases those calculations on its own activity. EU venues, in contracts, were forced to ignore the largest market for Swiss stocks, instead basing tick sizes on activity at the largest EU venue for the instruments. For the stocks in question, that is Cboe Europe, which had market share of around 13% in Swiss stocks on the January 3 implementation date, down from over 17% from a year earlier.\nThat changed this morning when Cboe Europe and Aquis Exchange moved Swiss stocks traded on their venues to a new tick table, aligning with more granular domestic increments. That affects around 40 instruments at Aquis and 168 at Cboe.\n”The regulators are aware of our decision to do so and this is part of a wider analysis by the regulators of the post-MiFID II impact on trading third-country listed securities,” Cboe said in a statement.\nThe change appeared to garner immediate rewards for Cboe Europe, which saw market share in the instruments rise back to almost 16% in mid-afternoon trading. The Swiss Exchange saw its share of domestic stocks slip below 72% at the same point, data from Cboe Global Markets show.\nEU exchange groups have lobbied on the issue, noting wider concerns associated with misalignment of tick sizes. In the wake of the first MiFID overhaul of equity markets a decade ago, a race to reduce tick increments was abruptly halted by an agreement for greater consistency. As a result, systems have become used to shares being traded at the same tick size across all venues. Problems can occur when smart order routers attempt to send orders from one venue to another as the prices may not be divisible.\n“The whole scope of MiFID I was to create a level playing field. If you inadvertently stifle that with the second iteration by constraining your scope of trading to fewer venues, no one is winning” said David Howson, chief operating officer at Cboe Europe.\nA spokesperson for SIX in Zurich declined to comment on market share given the limited number of trading days under the new regime, noting only that figures vary day-to-day and are influenced by various factors.\n“The market share of SIX has been very strong in Q4 due to our focus on order book quality, which has been significantly stronger than on other venues,” he said. (Reporting by Helen Bartholomew)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T23:34:00.000+02:00", "crawled": "2018-01-12T18:24:33.000+02:00", "highlightTitle": ""}