{"organizations": [], "uuid": "7a7e6b4de74d25caab305f1f3aec91c4e8c103dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-kosovo-arrest/suspect-in-kosovo-organ-trafficking-case-arrested-in-cyprus-idUSKBN1EU1TS", "country": "US", "domain_rank": 408, "title": "Suspect in Kosovo organ trafficking case arrested in Cyprus", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T20:10:00.000+02:00", "replies_count": 0, "uuid": "7a7e6b4de74d25caab305f1f3aec91c4e8c103dc"}, "author": "", "url": "https://www.reuters.com/article/us-kosovo-arrest/suspect-in-kosovo-organ-trafficking-case-arrested-in-cyprus-idUSKBN1EU1TS", "ord_in_thread": 0, "title": "Suspect in Kosovo organ trafficking case arrested in Cyprus", "locations": [], "entities": {"persons": [{"name": "moshe harel", "sentiment": "none"}, {"name": "m.h.", "sentiment": "none"}, {"name": "harel", "sentiment": "none"}, {"name": "baki kelani", "sentiment": "none"}], "locations": [{"name": "kosovo", "sentiment": "none"}, {"name": "cyprus", "sentiment": "none"}, {"name": "pristina", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "ex-soviet union", "sentiment": "none"}, {"name": "pristina", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "cyprus fatos bytyci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PRISTINA (Reuters) - An Israeli citizen accused of involvement in a human organ trafficking scandal in Kosovo a decade ago has been arrested in Cyprus and the authorities in Pristina have requested his extradition to face trial, police said on Friday.\nPolice accuse Israeli Moshe Harel of seeking out people in need of kidney transplants and of luring donors to Kosovo from Turkey and the ex-Soviet Union with the promise of up to 12,000 euros ($14,500) in payment.\nRecipients, mainly Israelis, paid between 80,000 and 100,000 euros for the organs. Some donors never received any money.\n“Based on an international arrest warrant the suspect M.H. was arrested a few days ago in Cyprus. He has been a wanted person since 2010,” police spokesman Baki Kelani told Reuters.\nRussia has also issued an international arrest warrant for Harel.\nCypriot authorities were not immediately available for comment on the case.\nHarel was arrested in 2012 in Israel in connection with a parallel investigation, but was not extradited to Kosovo, which has no diplomatic relations with Israel.\nThe organ scandal came to light in 2008 when a Turkish man was stopped at Pristina airport, visibly in pain having had his kidney removed. The trafficking ring acted out of the Medicus clinic on a residential road on the outskirts of Pristina.\nThe director of the clinic, urologist Lutfi Dervishi, was sentenced to eight years in jail for organized crime and human trafficking and his son Arban for seven years in 2013, though both men went into hiding and have not served their sentences.\nIn 2016 a Kosovo court ordered a retrial of doctors and officials convicted of involvement in the case and that trial is still ongoing. They have all denied any wrongdoing.\nPolice said Lutfi Dervishi had been recaptured last year and was among those now being retried. His son and another suspect in the case, Turkish doctor Yusuf Sonmez, are still at large.\nIn a separate case, attention over the trafficking allegations has grown since Council of Europe envoy Dick Marty in 2010 accused Kosovo Albanian guerrilla fighters of harvesting organs from captives, mainly Serbs, during the 1998-99 Kosovo war.\nA special court with international prosecutors and judges but under Kosovo law was set up to tackle Marty’s allegations but no indictments have yet been filed.\nReporting by Fatos Bytyci; Editing by Gareth Jones\n ", "external_links": [], "published": "2018-01-05T20:10:00.000+02:00", "crawled": "2018-01-05T20:19:23.002+02:00", "highlightTitle": ""}