{"organizations": [], "uuid": "644ade67beb893abec43e8d739a85246fdb953fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/01/davos.png", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/09/what-is-the-world-economic-forum-annual-meeting-davos/", "country": "US", "domain_rank": 1196, "title": "Davos: Everything to Know About the World Economic Forum | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.771, "site_type": "news", "published": "2018-01-09T02:00:00.000+02:00", "replies_count": 0, "uuid": "644ade67beb893abec43e8d739a85246fdb953fb"}, "author": "Natasha Bach", "url": "http://fortune.com/2018/01/09/what-is-the-world-economic-forum-annual-meeting-davos/", "ord_in_thread": 0, "title": "Davos: Everything to Know About the World Economic Forum | Fortune", "locations": [], "entities": {"persons": [{"name": "davos", "sentiment": "negative"}, {"name": "sarah sanders", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "world economic forum", "sentiment": "negative"}, {"name": "white house press", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 \nThe World Economic Forum in Davos, Switzerland is fast approaching, and President Donald Trump plans to attend. \nWhite House Press Secretary Sarah Sanders said in a statement Tuesday that President Trump looks forward being on being on hand at the event, a gathering of the world’s political and business elite, to promote “his policies to strengthen American businesses, American industries, and American workers.” \nAs president-elect last year, Trump did not attend Davos. But his election, proposed policies, and very un-Davos-like personality were a big topic among attendees. \nHere’s everything you need to know about Davos. What Is Davos? \nColloquially known as Davos for the Alpine resort town in which it’s held, the Annual Meeting is hosted by the World Economic Forum (WEF), a Swiss nonprofit foundation. It brings together global leaders from different sectors, including business, politics, academia, and journalism, for several days to discuss the most pressing issues facing the world. Typically, more than 2,000 people are invited to attend, participate, or cover the event. Every year, the event focuses on a different theme with this year’s being “Creating a Shared Future in a Fractured World.” Who attends? \nWhile heads of state frequently attend Davos, U.S. presidents have often declined the invitation because of the perceived elitism of the event. Trump is the first sitting president to attend since Bill Clinton in 2000, during the final year of his presidency. \nMuch of the attendee list is kept private until the event, but the all-female list of this year’s co-chairs include: International Monetary Fund chief Christine Lagarde, IBM CEO Ginni Rometty, Norway’s Prime Minister Erna Solberg, Sharan Burrow, general secretary of the International Trade Union Confederation (ITUC) in Belgium; Fabiola Gianotti, director general of the European Organization for Nuclear Research (CERN) in Geneva; Isabelle Kocher, CEO of ENGIE Group; and Chetna Sinha, founder and president of Mann Deshi Mahila Bank and Mann Deshi Foundation in India. \nHeads of state that have previously attended include Chinese President Xi Jinping, former British Prime Minister Gordon Brown, Canadian Prime Minister Justin Trudeau, and Israeli Prime Minister Benjamin Netanyahu. \nAmong other previous attendees are Facebook COO Sheryl Sandberg, Google co-founder Sergey Brin, and short-lived White House Communications Director Anthony Scaramucci. What is the World Economic Forum \nFormed in 1971, the Forum is headquartered in Geneva, Switzerland. It calls itself the International Organization for Public-Private Cooperation, and is “committed to improving the state of the world.” It seeks to be independent, impartial, and not tied to special interests. \nWhile the Forum is best known for its annual meeting in Davos, it also hosts several other regional meetings throughout the year. These events take place in different locations across Africa, East Asia, and Latin America, as well as two recurring events in the United Arab Emirates and China. \nThe Forum also produces a series of research reports and engages in a number of initiatives that seek to tackle global challenges through public-private collaboration. When is Davos? \nThis year’s Annual Meeting will be held Jan. 23 to 26. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-09T02:00:00.000+02:00", "crawled": "2018-01-10T06:52:43.009+02:00", "highlightTitle": ""}