{"organizations": [], "uuid": "b9f16fcc9fbe69583c5b9c06b09cec56e0bd46a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-diageo-results/diageo-sales-growth-curbed-by-forex-idUSKBN1FE0NQ", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Diageo sales growth curbed by strengthening pound", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T12:15:00.000+02:00", "replies_count": 0, "uuid": "b9f16fcc9fbe69583c5b9c06b09cec56e0bd46a0"}, "author": "", "url": "https://www.reuters.com/article/us-diageo-results/diageo-sales-growth-curbed-by-forex-idUSKBN1FE0NQ", "ord_in_thread": 0, "title": "UPDATE 2-Diageo sales growth curbed by strengthening pound", "locations": [], "entities": {"persons": [{"name": "martinne geller", "sentiment": "none"}, {"name": "pernod ricard", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "diageo", "sentiment": "negative"}, {"name": "brown-forman", "sentiment": "none"}, {"name": "johnnie walker scotch and smirnoff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 7:25 AM / Updated 20 minutes ago Diageo sales growth curbed by strengthening pound Martinne Geller 4 Min Read \nLONDON (Reuters) - Sales driven by increased spending on marketing helped Diageo ( DGE.L ), the world’s largest spirits company, to report better-than-expected first-half results. \nBut the British-based maker of Johnnie Walker Scotch and Smirnoff vodka said foreign exchange rates would take a bigger-than-expected gulp out of sales and profits in the full year, due to a strengthening sterling and weak U.S. dollar. \nDiageo said organic net sales grew 4.2 percent in the six months ended in December, above what analysts said was a 3.7 percent consensus. \nEarnings per share before one-off items was 67.8 pence, 3.5 percent ahead of expectations, according to Liberum analysts. \nThe company said marketing spend rose 7 percent in the period, as it works to improve performance of Scotch, its key product, and vodka in the United States, which has been weak. \nBut Diageo and rivals like Pernod Ricard ( PERP.PA ) and Brown-Forman ( BFb.N ) have benefited from the current popularity of cocktails, as spirits gains market share from beer. \nLike many global packaged goods companies, Diageo has adopted a plan of cost-cutting that has helped make its business more efficient, providing funds to use for generating sales. \n“Diageo is a business in change,” said Jefferies analysts, citing its new chairman, Javier Ferran, and a perceived threat of a possible takeover by companies associated with private equity firm 3G. \n“We see a perfect blend of productivity and top-line growth.” YEAR OF TWO HALVES \nDiageo’s operating profit rose 6.1 percent to 2.2 billion pounds ($3.14 billion) in the six months ended in December on net sales up 1.7 percent at 6.5 billion pounds. \nDiageo had previously warned that sales and profit growth for the current financial year, ending in June, would be driven by the second half, due to a later Chinese New Year and new restrictions on selling alcohol in India. \nThe company said on Thursday that strength in its Chinese white spirits had reduced the effect of the later holiday, which pushes more of retailers’ purchases into the next period. \n“Despite having warned of a second-half weighting to its 2018 performance, Diageo’s first-half results were good enough,” said analysts at RBC Capital Markets. \nThe company stood by its goal for mid-single digit revenue growth and 175 basis points of organic operating margin improvement in the three years ending June 2019. \n“Our financial performance expectations for this year remain unchanged,” Chief Executive Ivan Menezes said. \nHowever, Diageo now expects currency to reduce the value of full-year sales by 460 million pounds and earnings by 60 million pounds. That compares to a previous expectation of an 80 million pound hit to sales and a 70 million pound benefit on profit. \n“In all, then, this equates to a 7 percent reduction in actual currency EBIT guidance,” RBC said. \nThe company also lowered its expected 2018 tax rate to 20 percent, from 21 percent, due to changes in the U.S. corporate tax legislation. \nDiageo’s shares were up 1 percent at 0950 GMT. ($1 = 0.7006 pounds) Reporting by Martinne Geller; editing by Jason Neely", "external_links": [], "published": "2018-01-25T12:15:00.000+02:00", "crawled": "2018-01-25T12:40:26.017+02:00", "highlightTitle": ""}