{"organizations": [], "uuid": "3a16b22a541dec767ca179f2711cf6934c041e12", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-former-itc-commissioner-f-scott-kieff-joins-mckool-smith.html", "country": "US", "domain_rank": 767, "title": "Former ITC Commissioner F. Scott Kieff Joins McKool Smith", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T20:40:00.000+02:00", "replies_count": 0, "uuid": "3a16b22a541dec767ca179f2711cf6934c041e12"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-former-itc-commissioner-f-scott-kieff-joins-mckool-smith.html", "ord_in_thread": 0, "title": "Former ITC Commissioner F. Scott Kieff Joins McKool Smith", "locations": [], "entities": {"persons": [{"name": "f. scott kieff joins mckool smith", "sentiment": "negative"}, {"name": "mckool smith", "sentiment": "negative"}, {"name": "obama", "sentiment": "none"}, {"name": "kieff", "sentiment": "none"}, {"name": "f. scott kieff", "sentiment": "none"}, {"name": "david sochia", "sentiment": "none"}, {"name": "scott", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "itc", "sentiment": "negative"}, {"name": "international trade commission", "sentiment": "none"}, {"name": "principal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON, Jan. 8, 2018 /PRNewswire/ -- McKool Smith, one of the nation's leading trial firms, has announced that F. Scott Kieff , former Commissioner of the International Trade Commission (ITC), has joined the firm as a Principal in its Washington, D.C. office. Nominated by President Obama, Mr. Kieff served as Commissioner of the ITC from October 2013 to June 2017.\n\"We are very excited about Scott's arrival to the firm,\" said David Sochia , McKool Smith's Managing Principal. \"Obviously, Scott has a wealth of experience in patent matters and disputes before the ITC. He also has significant expertise in antitrust, trade secret, and false advertising-related cases, all areas in which we are seeing an increased demand for our services. He's a fantastic addition to McKool Smith.\"\n\"McKool Smith is simply amazing. They are fantastic trial lawyers and have a well-earned reputation as creative entrepreneurs in the finest traditions of law practice,\" Mr. Kieff explained. \"With the fast pace of change these days in the fields of intellectual property, antitrust, and trade, I was looking hard to find teammates who are ready and able to offer a range of creative solutions for helping clients on all sides of commercial disputes. The firm regularly deploys some of the finest trial lawyers from around the nation to handle virtually any type of dispute in any forum, from district courts to the ITC and beyond, while offering innovative fee arrangements. We are a natural fit for each other and I'm delighted to be working on the McKool Smith team for our clients.\"\nMr. Kieff joins McKool Smith with nearly 25 years of experience in the private, government, and academic sectors. He has extensive experience in high-stakes litigation and investigations, and often integrates diverse fields of law to accomplish his clients' business objectives, such as when antitrust, false advertising, or other unfair competition claims are brought in Section 337 disputes before the ITC, or when strategies implicate multiple areas of law and many courts and agencies, including those in multiple countries.\nMr. Kieff's subject matter expertise includes intellectual property; international trade; antitrust; finance; securities regulation; bankruptcy; biotechnology and medicine; cyber; privacy; and security. His practice spans trials, appeals, regulatory agencies, investigations, and structured transactions. He also serves as a mediator, arbitrator, special master, and compliance monitor. Mr. Kieff's work extends across global value chains for both tangible and intangible assets, including finance, and includes many foreign legal regimes as well as many international treaties and organizations.\nHe began his career in 1994 as a trial and patent lawyer for Pennie & Edmonds in New York and Jenner & Block in Chicago. Mr. Kieff also served as a Law Clerk to Judge Giles S. Rich of the United States Court of Appeals for the Federal Circuit. Prior to attending law school at the University of Pennsylvania, he studied molecular biology and microeconomics at the Massachusetts Institute of Technology and conducted research in molecular genetics at the Whitehead Institute for Biomedical Research in Cambridge, MA.\nWith more than 180 trial lawyers across offices in Austin, Dallas, Houston, Los Angeles, Marshall, New York, Silicon Valley, and Washington, D.C., McKool Smith has established a reputation as one of America's leading trial firms. Since 2006, the firm has secured ten nine-figure jury verdicts and twelve eight-figure jury verdicts. The firm has also won more VerdictSearch and The National Law Journal \"Top 100 Verdicts\" over the last ten years than any other law firm in the country. Courtroom successes like these have earned McKool Smith critical acclaim and helped the firm become what The Wall Street Journal describes as \"one of the biggest law firm success stories of the past decade.\" McKool Smith represents clients in complex commercial litigation, intellectual property, bankruptcy, and white collar defense matters.\nFor more information, please contact Michael R. Coston (212) 402-9450 or mcoston@mckoolsmith.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/former-itc-commissioner-f-scott-kieff-joins-mckool-smith-300579155.html\nSOURCE McKool Smith", "external_links": ["http://www.prnewswire.com/news-releases/former-itc-commissioner-f-scott-kieff-joins-mckool-smith-300579155.html", "https://www.mckoolsmith.com/professionals-David_Sochia", "https://www.mckoolsmith.com/professionals-Scott_Kieff"], "published": "2018-01-08T20:40:00.000+02:00", "crawled": "2018-01-08T21:04:29.014+02:00", "highlightTitle": ""}