{"organizations": [], "uuid": "d712fae16e5f95731211d95975ae84ee91622ffc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218767365&w=1200&r=LYNXMPEE010A9", "site_section": "https://www.reuters.com/subjects/euro-zone", "section_title": "Euro Zone | Reuters.com", "url": "https://www.reuters.com/article/us-eurozone-economy-pmi/euro-zone-factories-ended-2017-with-record-high-growth-pmi-idUSKBN1ER0JG", "country": "US", "domain_rank": 408, "title": "Euro zone factories ended 2017 with record high growth: PMI", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T17:08:00.000+02:00", "replies_count": 0, "uuid": "d712fae16e5f95731211d95975ae84ee91622ffc"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-eurozone-economy-pmi/euro-zone-factories-ended-2017-with-record-high-growth-pmi-idUSKBN1ER0JG", "ord_in_thread": 0, "title": "Euro zone factories ended 2017 with record high growth: PMI", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Euro zone manufacturers ended 2017 by ramping up activity at the fastest pace in more than two decades, a survey showed on Tuesday, and rising demand suggests they will start the new year on a high.\nThe bloc’s economy outpaced its peers last year, and the European Central Bank plans to scale back its stimulus program from this month.\nIHS Markit’s December final manufacturing Purchasing Managers’ Index for the bloc was 60.6, matching an earlier preliminary reading and above November’s 60.1. That was the highest since the survey began in June 1997.\nAn index measuring output, which feeds into a composite PMI due on Thursday and seen as a good guide to economic health, rose to 62.2 from November’s 61.0 - its highest in over 17 years and has only been above that once in the survey’s history.\n“The euro zone manufacturing boom gained further momentum in December, rounding off the best year on record and setting the scene for a strong start to 2018,” said Chris Williamson, chief business economist at IHS Markit.\n”Forward-looking indicators bode well for the new year: new orders rose at a near-record pace, while purchasing growth hit a new peak as firms readied themselves for higher production.\nMeanwhile, job creation was maintained at November’s record pace.”\nDespite factories raising prices again last month, albeit at a slightly weaker rate than in November, an index measuring new orders nudged up to 61.5 from 61.4, a level not seen since around the start of the century.\nInflation was 1.5 percent in November, below the ECB’s 2 percent target ceiling, but the central bank announced in October it will halve its monthly asset purchases to 30 billion euros from January.\nA majority of economists in a Reuters poll last year said they thought the ECB should shut the door on the program in September, but they were split on whether it actually would.\nEditing by Hugh Lawson\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-02T17:08:00.000+02:00", "crawled": "2018-01-02T18:16:26.002+02:00", "highlightTitle": ""}