{"organizations": [], "uuid": "a718b4c2929501a0eac84e1a5a1fe785b46940d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-ron-perry-named-chairman-ceo-columbia-records.html", "country": "US", "domain_rank": 767, "title": "Ron Perry Named Chairman & CEO, Columbia Records", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.827, "site_type": "news", "published": "2018-01-02T19:00:00.000+02:00", "replies_count": 0, "uuid": "a718b4c2929501a0eac84e1a5a1fe785b46940d5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-ron-perry-named-chairman-ceo-columbia-records.html", "ord_in_thread": 0, "title": "Ron Perry Named Chairman & CEO, Columbia Records", "locations": [], "entities": {"persons": [{"name": "rob stringer", "sentiment": "negative"}, {"name": "ron perry", "sentiment": "negative"}, {"name": "ron", "sentiment": "none"}, {"name": "perry", "sentiment": "none"}, {"name": "rob", "sentiment": "none"}, {"name": "stringer", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "columbia", "sentiment": "none"}], "organizations": [{"name": "sony music entertainment", "sentiment": "negative"}, {"name": "columbia records", "sentiment": "negative"}, {"name": "sony music", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 2, 2018 /PRNewswire/ -- Rob Stringer, CEO, Sony Music Entertainment today announced Ron Perry has been named Chairman & CEO of Columbia Records. Based in New York, Perry will report to Stringer and will be responsible for leading the overall management of Columbia, the label home to many of the most accomplished and iconic artists in the world.\nStated Stringer, \"Ron is an immensely dynamic and forward thinking executive who excels at bringing the best out of artistic vision. After his enormous success in recent years, we are thrilled to have Ron join Sony Music and lead the great team and unparalleled roster at the legendary Columbia Records label.\"\nStated Perry, \"I want to thank Rob for the extraordinary opportunity to run the premier label in the history of music. To embark as the curator of this storied company is both the highest and most humbling career achievement I could imagine. Columbia Records has stood the test of time as the industry's marquee home for the world's greatest stars. Rob has handed off an extremely talented team at Columbia. I look forward to building on his successes, while developing culturally innovative new artists and extending Columbia's unprecedented run at the top into the future.\"\nPerry, 38, joins Columbia from SONGS Music Publishing, where he was President, and a significant minority partner since its founding in 2004. In that role, Perry was responsible for signing Lorde, The Weeknd, Major Lazer, Diplo, Desiigner and many others. Recently, Perry has been credited as the A&R on Lorde's Grammy 2017 Album of the Year nominated \"Melodrama,\" and the pairing of The Weeknd and Daft Punk on the multi-platinum tracks, \"Starboy\" and \"I Feel It Coming.\" Perry has received numerous industry honors and recognitions over the course of his career, including Billboard's Power 100 list in 2017, Variety's \"Hitmakers\" list in 2017, The Hollywood Reporter's \"Top Hitmakers\" and Billboard's \"Top A&R Power Players\" lists in 2016. He has also been named to Billboard's \"40 Under 40\" list in 2013, 2014 and 2015.\nAbout Sony Music Entertainment\nSony Music Entertainment is a global recorded music company with a current roster that includes a broad array of both local artists and international superstars. The company boasts a vast catalog that comprises some of the most important recordings in history. It is home to premier record labels representing music from every genre, including Arista Nashville, Beach Street Records, Black Butter Records, BPG Music, Bystorm Entertainment, Century Media, Columbia Nashville, Columbia Records, Day 1, Descendant Records, Disruptor Records, Epic Records, Essential Records, Essential Worship, Fo Yo Soul Recordings, House of Iona Records, Insanity Records, Kemosabe Records, Legacy Recordings, Masterworks, Masterworks Broadway, Ministry of Sound Recordings, Monument Records, OKeh, Polo Grounds Music, Portrait, RCA Inspiration, RCA Nashville, RCA Records, Relentless Records, Reunion Records, Sony Classical, Sony Music Latin, Star Time International, Syco Music and Verity Records. Sony Music Entertainment is a wholly owned subsidiary of Sony Corporation of America.\nView original content with multimedia: http://www.prnewswire.com/news-releases/ron-perry-named-chairman--ceo-columbia-records-300575382.html\nSOURCE Sony Music Entertainment", "external_links": ["http://www.prnewswire.com/news-releases/ron-perry-named-chairman--ceo-columbia-records-300575382.html"], "published": "2018-01-02T19:00:00.000+02:00", "crawled": "2018-01-02T19:10:26.019+02:00", "highlightTitle": ""}