{"organizations": [], "uuid": "75650b9e0a164e8b585d77ea2fbead18979d1bfa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180128&t=2&i=1226064216&w=1200&r=LYNXMPEE0R0PZ", "site_section": "http://feeds.reuters.com/reuters/topNews\r", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-usa-trump-russia/reports-that-trump-tried-to-fire-mueller-prompt-lawmakers-concern-idUSKBN1FH0SG", "country": "US", "domain_rank": 408, "title": "Reports that Trump tried to fire Mueller prompt lawmakers' concern", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T19:03:00.000+02:00", "replies_count": 0, "uuid": "75650b9e0a164e8b585d77ea2fbead18979d1bfa"}, "author": "", "url": "https://www.reuters.com/article/us-usa-trump-russia/reports-that-trump-tried-to-fire-mueller-prompt-lawmakers-concern-idUSKBN1FH0SG", "ord_in_thread": 0, "title": "Reports that Trump tried to fire Mueller prompt lawmakers' concern", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "mueller", "sentiment": "negative"}, {"name": "graham", "sentiment": "none"}, {"name": "collins", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "lindsey graham", "sentiment": "none"}, {"name": "robert mueller", "sentiment": "none"}, {"name": "susan collins", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "justice department", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "abc news", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "republican", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 28, 2018 / 5:04 PM / in 3 minutes Republican senators urge Congress to revisit bill to protect Mueller Reuters Staff 3 Min Read \nWASHINGTON (Reuters) - The U.S. Congress should revisit proposed legislation to protect special counsel Robert Mueller after   tried to fire him last year while he investigated the Trump campaign’s ties with Russia, two Republican senators said on Sunday. \nIn separate television interviews, Senators Susan Collins and Lindsey Graham expressed dismay at reports the Republican president had told the top White House lawyer to order U.S. Justice Department officials to fire Mueller. \n“I’ve got legislation protecting Mr. Mueller, and I’d be glad to pass it tomorrow,” Graham told the ABC News “This Week” program. \nOn CNN’s “State of the Union,” Collins said: “It certainly wouldn’t hurt to put that extra safeguard in place, given the latest stories.” \nTensions over Mueller’s probe are hovering over Trump’s year-old presidency as he prepares to give his first State of the Union Address on Tuesday. \nThe New York Times reported on Thursday that Trump ordered White House counsel Donald McGahn to fire Mueller in June but backed down after McGahn threatened to resign rather than carry out the order. \nMcGahn was “fed up” after Trump’s order, a person familiar with the matter told Reuters. He did not issue an ultimatum directly to the president but told then-White House chief of staff Reince Priebus and then-chief strategist Steve Bannon that he wanted to quit, the source said. FILE PHOTO: Special Counsel Robert Mueller (R) departs after briefing members of the U.S. Senate on his investigation into potential collusion between Russia and the Trump campaign on Capitol Hill in Washington, U.S., June 21, 2017. REUTERS/Joshua Roberts/File Photo \nGraham and three Democratic senators introduced legislation last August that would protect special counsels, including Mueller, by requiring that a panel of federal judges review any action to remove them. \nThe likelihood that such a bill would become law have seemed remote. Republicans in the U.S. House of Representatives have shown little enthusiasm for the idea. \n“I don’t think there’s a need for legislation right now to protect Mueller,” House Republican leader Kevin McCarthy said on NBC’s “Meet the Press” program. “The president and his team have fully cooperated” with the special counsel, he said. U.S.   looks on during the World Economic Forum (WEF) annual meeting in Davos, Switzerland January 26, 2018. REUTERS/Carlos Barria \nRepublicans hold the majority in both the House and Senate. \nMueller is investigating whether Trump associates and the Kremlin colluded during the 2016 presidential election. Russia denies such collusion, and Trump frequently denounces the probe as a “witch hunt.” \nBoth Collins and Graham said they saw no sign that Trump is currently trying to fire Mueller. \n“I think what happened here is the president had a bad idea,” Collins said. “He talked with his counsel, who explained to an angry and frustrated president why it was a bad idea.” \nGraham said: “It’s pretty clear to me everyone in the White House knows it’d be the end of President Trump’s presidency if he tried to fire Mr. Mueller.” Reporting by Yasmeen Abutaled and Caren Bohan Writing by Warren Strobel Editing by Lisa Von Ahn", "external_links": [], "published": "2018-01-28T19:03:00.000+02:00", "crawled": "2018-01-28T19:17:22.019+02:00", "highlightTitle": ""}