{"organizations": [], "uuid": "766746bacb0ed15f30e05de91301a5f35ba7cce9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-boot-barn-holdings-inc-announces-preliminary-q3-results-increased-fiscal-year-2018-earnings-outlook-and-participation-in-the.html", "country": "US", "domain_rank": 767, "title": "Boot Barn Holdings, Inc. Announces Preliminary Q3 Results, Increased Fiscal Year 2018 Earnings Outlook and Participation in the ICR Conference 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T14:00:00.000+02:00", "replies_count": 0, "uuid": "766746bacb0ed15f30e05de91301a5f35ba7cce9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-boot-barn-holdings-inc-announces-preliminary-q3-results-increased-fiscal-year-2018-earnings-outlook-and-participation-in-the.html", "ord_in_thread": 0, "title": "Boot Barn Holdings, Inc. Announces Preliminary Q3 Results, Increased Fiscal Year 2018 Earnings Outlook and Participation in the ICR Conference 2018", "locations": [], "entities": {"persons": [], "locations": [{"name": "calif.", "sentiment": "none"}, {"name": "irvine", "sentiment": "none"}], "organizations": [{"name": "barn holdings, inc", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "IRVINE, Calif.--(BUSINESS WIRE)-- Boot Barn Holdings, Inc. (NYSE:BOOT) today announced preliminary results for the third quarter of fiscal year 2018 ended December 30, 2017 in advance of its participation in the ICR Conference on Monday, January 8, 2018.\nPreliminary Results for the Third Quarter of Fiscal Year 2018\nFor the third quarter ended December 30, 2017, the Company expects to report:\nNet sales increased 13% to approximately $225 million. Same store sales increased approximately 5.2%, with stores outperforming e-commerce sales. This compares with third quarter guidance of 2.0% to 4.0%. Net income per diluted share of $0.70 to $0.71 based on 27.6 million weighted average diluted shares outstanding. Excluding the impact of the change in federal tax law, preliminary net income per diluted share is estimated to be $0.45 to $0.46 compared to guidance of $0.40 to $0.43, which was based on 27.2 million weighted average diluted shares outstanding. Net income per diluted share includes approximately $0.02 arising from a $1.0 million pre-tax net gain from insurance and other settlements, primarily related to losses suffered in the second quarter from Hurricane Harvey. The Company opened four new stores during the quarter.\nJim Conroy, Chief Executive Officer, commented, “I am very pleased with our performance in the third quarter, in which we delivered strong same store sales growth, solid merchandise margin performance, and earnings that exceeded our guidance. Our same store sales was driven by growth in all major product categories and strength in virtually every geography across the country, with particularly solid performance in Texas. It was further encouraging to see that the majority of our retail same store sales growth was driven by an increase in transactions, indicating strong customer traffic.”\nThe foregoing expected results are preliminary and remain subject to the completion of normal quarter-end accounting procedures and closing adjustments. The Company currently plans to report third quarter results on January 31, 2018.\nFiscal Year 2018 Outlook\nGiven the strong sales performance, the Company has raised its outlook for its fiscal year 2018, which ends March 31, 2018:\nSame store sales growth of 3.0% to 4.0%, compared to the Company’s prior outlook of low single digit same store sales growth. Income from operations between $42.3 million and $43.8 million, compared to the Company’s prior outlook of $40.0 million to $42.5 million. Net income between $23.3 million and $24.5 million. Excluding the impact of the change in federal tax law, the Company expects net income to be between $16.7 million and $17.6 million, compared to the Company’s prior outlook of $15.4 million to $16.6 million. Net income per diluted share of $0.85 to $0.89 based on 27.6 million weighted average diluted shares outstanding. Excluding the impact of the change in federal tax law, the Company expects net income per diluted share of $0.60 to $0.64 compared to the Company’s prior outlook of $0.57 to $0.61, which was based on 27.2 million weighted average diluted shares outstanding.\nMr. Conroy continued, “I am further encouraged that we continue to make progress on each of our four strategic initiatives. Many of our efforts to drive same store sales are building momentum, including both the increased focus on our work business and the changes we have made with our marketing. We have also transformed our e-commerce and omni channel capabilities this year. While that created disruption to the business in the Spring and resulted in some expense pressure during the holiday period as we retrofitted our Wichita distribution center, we are well positioned for additional growth going forward. Finally, we have continued to invest in our design and development capability for exclusive brands which we expect to drive merchandise margin expansion.\nTax Reform\nRecent changes in tax law lowered the federal corporate tax rate from 35% to 21%, which the Company estimates will result in an effective tax rate of 25% during the year ending March 30, 2019, the first full fiscal year under the new law. During the quarter ended December 30, 2017, the Company is required to re-measure deferred taxes under the new effective tax rate of 25%. The Company estimates the deferred tax impact will result in a non-cash tax benefit of $6.0 million, or approximately $0.22 per share, to its 3 rd quarter earnings. Due to the timing of the Company’s fiscal year, the fiscal year 2018 effective tax rate is expected to be 35.5%, excluding the impact from the $6.0 million re-measurement of deferred taxes. The 35.5% rate is calculated by blending nine months at the Company’s historical rate of 39% and three months at the Company’s new rate of 25% and applying the blended rate to the entire fiscal year. The reduction in the Company’s full year effective tax rate from 39.0%, assumed in its earlier guidance, to 35.5%, is expected to result in lower tax expense of $0.8 million, or $0.03 cents per diluted share, during the quarter ended December 30, 2017.\nICR Conference 2018\nThe Company will be presenting at the ICR Conference 2018 held at the JW Marriott Orlando Grande Lakes in Orlando, Florida, on Monday, January 8, 2018 at 1:30 pm Eastern Standard Time.\nThe audio portion of the presentation will be webcast live over the internet and can be accessed under the Investor Relations section at www.investor.bootbarn.com . An online archive will be available for a period of 90 days following the presentation.\nAbout Boot Barn\nBoot Barn is the nation’s leading lifestyle retailer of western and work-related footwear, apparel and accessories for men, women and children. The Company offers its loyal customer base a wide selection of work and lifestyle brands. Boot Barn now operates 226 stores in 31 states, in addition to an e-commerce channel www.bootbarn.com . The Company also operates www.sheplers.com , the nation’s leading pure play online western and work retailer. Sheplers has been part of the western, outdoor, and work lifestyle for over 100 years. Beginning in February 2017, the Company has operated www.countryoutfitter.com , an e-commerce site selling to customers who live a country lifestyle. For more information, call 888-Boot-Barn or visit www.bootbarn.com .\nForward Looking Statements\nThis press release contains forward-looking statements that are subject to risks and uncertainties. All statements other than statements of historical fact included in this press release are forward-looking statements. Forward-looking statements refer to our current expectations and projections relating to, by way of example and without limitation, our financial condition, liquidity, profitability, results of operations, margins, plans, objectives, strategies, future performance, business and industry. You can identify forward-looking statements by the fact that they do not relate strictly to historical or current facts. These statements may include words such as \"anticipate\", \"estimate\", \"expect\", \"project\", \"plan“, \"intend\", \"believe\", “may”, “might”, “will”, “could”, “should”, “can have”, “likely”, “outlook” and other words and terms of similar meaning in connection with any discussion of the timing or nature of future operating or financial performance or o", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.countryoutfitter.com&esheet=51739279&newsitemid=20180108005744&lan=en-US&anchor=www.countryoutfitter.com&index=4&md5=331196b72faf11c5a44962fc9698c566", "http://www.businesswire.com/news/home/20180108005744/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sheplers.com&esheet=51739279&newsitemid=20180108005744&lan=en-US&anchor=www.sheplers.com&index=3&md5=58d441c4cec7c339acf47126f86d692e", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.investor.bootbarn.com&esheet=51739279&newsitemid=20180108005744&lan=en-US&anchor=www.investor.bootbarn.com&index=1&md5=7ad2e71ae958ef2bb8811b220ab1034e", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.bootbarn.com&esheet=51739279&newsitemid=20180108005744&lan=en-US&anchor=www.bootbarn.com&index=2&md5=27c931c3730821d64c9084fa151cf2d9", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.bootbarn.com&esheet=51739279&newsitemid=20180108005744&lan=en-US&anchor=www.bootbarn.com&index=5&md5=626a2939a40ed2a2105fa200f5f1db9e"], "published": "2018-01-08T14:00:00.000+02:00", "crawled": "2018-01-08T15:16:18.027+02:00", "highlightTitle": ""}