{"organizations": [], "uuid": "e647845d7cef46b5476dc9f1c0dc0d7d91e18ef6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews/", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-israel-palestinians-gazapower/israel-says-will-resume-power-supply-to-gaza-on-monday-idUKKBN1EW0VN", "country": "US", "domain_rank": 408, "title": "Israel says will resume power supply to Gaza on Monday", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T00:06:00.000+02:00", "replies_count": 0, "uuid": "e647845d7cef46b5476dc9f1c0dc0d7d91e18ef6"}, "author": "", "url": "https://uk.reuters.com/article/uk-israel-palestinians-gazapower/israel-says-will-resume-power-supply-to-gaza-on-monday-idUKKBN1EW0VN", "ord_in_thread": 0, "title": "Israel says will resume power supply to Gaza on Monday", "locations": [], "entities": {"persons": [{"name": "mahmoud abbas", "sentiment": "none"}, {"name": "abbas", "sentiment": "none"}, {"name": "ori lewis", "sentiment": "none"}, {"name": "yuval steinitz", "sentiment": "none"}], "locations": [{"name": "gaza", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}, {"name": "gaza strip", "sentiment": "none"}], "organizations": [{"name": "hamas", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  jerusalem", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 7, 2018 / 10:07 PM / Updated 8 hours ago Israel says will resume power supply to Gaza on Monday Ori Lewis 3 Min Read \nJERUSALEM (Reuters) - Israel said it will restore full electricity supply to the Hamas dominated Gaza Strip on Monday following a request last week by the Palestinians who said they will resume payments. \nWestern-backed Palestinian President Mahmoud Abbas withdrew his guarantee to pay Israel for power in April, leaving Gaza’s two million residents with only three to four hours of electricity a day as supplies were cut by about half. \nAbbas’s move, which affected schools, factories, hospitals and households, was part of a bid to press Hamas to loosen its hold over the enclave a decade after the Islamist movement seized the territory from forces loyal to him. \nA brief statement by Israeli Energy Minister Yuval Steinitz on Sunday said he had ordered the power lines, that can deliver up to 120 megawatts of electricity, to be prepared for full operation “no later than tomorrow (Monday).” The move will restore an additional 50 megawatts of power to Gaza. \nA Gaza economist said the restoration of electricity from Israel, the enclave’s main electricity supplier, could raise power delivery to six hours. Gaza’s sole power station generates only a small amount of power. \nPrompted partly by Abbas’s sanctions and fears of financial and political isolation, Hamas signed an Egyptian-brokered reconciliation agreement with his Fatah movement in October and agreed to hand over administrative control of the Gaza Strip to the Palestinian Authority. \nBut both groups have failed to finalise details of the deal, which had been due to be completed on December 1. The Authority’s decision to resume the electricity payments could help smooth the way towards completing the accord. \nThe resumption of power delivery comes at a time of heightened Israeli-Palestinian tensions. \nPalestinians have been mounting protests in the occupied West Bank and violence has flared along the Israel-Gaza border since U.S. President Donald Trump announced on December 6 that he was recognising Jerusalem as Israel’s capital. \nPalestinians want East Jerusalem as the capital of a state they seek to establish in the occupied West Bank and the Gaza Strip. Additional reporting by Nidal al-Mughrabi in Gaza, Writing by Ori Lewis; Editing by Elaine Hardcastle", "external_links": [], "published": "2018-01-08T00:06:00.000+02:00", "crawled": "2018-01-08T00:34:13.020+02:00", "highlightTitle": ""}