{"organizations": [], "uuid": "4af372a6a207f81c921c586e2ae78561e0dd132f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/business-wire-horizon-global-announces-revised-expectations-for-2017-results.html", "country": "US", "domain_rank": 767, "title": "Horizon Global Announces Revised Expectations for 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T16:30:00.000+02:00", "replies_count": 0, "uuid": "4af372a6a207f81c921c586e2ae78561e0dd132f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/business-wire-horizon-global-announces-revised-expectations-for-2017-results.html", "ord_in_thread": 0, "title": "Horizon Global Announces Revised Expectations for 2017 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "mich.", "sentiment": "none"}], "organizations": [{"name": "horizon global corporation", "sentiment": "negative"}, {"name": "horizon global", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TROY, Mich.--(BUSINESS WIRE)-- Horizon Global Corporation (NYSE: HZN), the world’s leading manufacturer of branded towing and trailering equipment, today announced expectations for full-year 2017 results, which are revised from the Company’s previous guidance. For full-year 2017, Horizon Global expects:\nRevenue growth in the range of 37.2 to 37.6 percent, revised from prior guidance of 38 to 41 percent Operating profit in the range of $34.0 million to $36.0 million, revised from prior guidance of $38.2 million to $44.2 million Adjusted operating profit (1) in the range of $49.0 million to $51.6 million, revised from prior guidance of $53.0 million to $59.0 million Diluted loss per share in the range of $0.02 to $0.08, revised from earnings per share of $0.50 to $0.60 Adjusted diluted earnings per share (1) in the range of $0.88 to $0.96, revised from prior guidance of $1.04 to $1.14 Operating cash flow in the range of $12.0 million to $16.0 million, revised from prior guidance of $40.0 million to $50.0 million\nThe revised expectations resulted from a number of factors in the Company’s business. Horizon Americas’ revenue fell below expectations for the full year due to a sales shortfall resulting from system stock take-out by retailers, as well as delivery delays during the fourth quarter related to the Company’s transition to its new distribution facility in Kansas City. Horizon Europe-Africa’s operating profit fell below expectations due to an unfavorable sales mix and increased material costs.\nIn addition, diluted earnings per share were reduced by our estimate of the effects on our existing deferred tax balances and the one-time transition tax under the Tax Cuts and Jobs Act. Operating cash flow fell short of our previous guidance on lower net income and higher-than-expected working capital levels.\n“While we are disappointed with the financial results in the fourth quarter and the impact on our full year, we are taking actions to address these operating issues,” said Mark Zeffiro, President and Chief Executive Officer of Horizon Global. “We remain encouraged by the many accomplishments in 2017 that we expect will set the stage for future growth. We remain positive about our outlook for 2018, and will provide additional details on 2017 performance when we report our full results in early March. At that time, we will provide more information regarding the dynamics affecting Horizon Americas and an action plan to address the factors contributing to the shortfall. In the interim, we continue to move forward with the Brink Group acquisition and remain focused on driving improved performance over the long term.”\nAbout Horizon Global\nHorizon Global is the #1 designer, manufacturer and distributor of a wide variety of high-quality, custom-engineered towing, trailering, cargo management and other related accessory products in North America, Australia and Europe. The Company serves OEMs, dealer networks, retailers, distributors, installers and the end consumer as the category leader in the automotive, leisure and agricultural market segments. Horizon provides its customers with outstanding products and services that reflect the Company’s commitment to market leadership, innovation and operational excellence.\nHorizon Global is home to some of the world’s most recognized brands in the towing and trailering industry, including: Reese®, Hayman-Reese™, Draw-Tite®, Bulldog®, Fulton®, ROLA®, Tekonsha®, and Westfalia®. Horizon Global has approximately 4,600 employees in 58 facilities across 21 countries.\nFor more information, please visit www.horizonglobal.com .\nSafe Harbor Statement\nThis release contains “forward-looking statements” as defined in the Private Securities Litigation Reform Act of 1995. Forward-looking statements contained herein speak only as of the date they are made and give our current expectations or forecasts of future events. These forward-looking statements can be identified by the use of forward-looking words, such as “may,” “could,” “should,” “estimate,” “project,” “forecast,” “intend,” “expect,” “anticipate,” “believe,” “target,” “plan” or other comparable words, or by discussions of strategy that may involve risks and uncertainties. These forward-looking statements are subject to numerous assumptions, risks and uncertainties which could materially affect our business, financial condition or future results including, but not limited to, risks and uncertainties with respect to: the completion of the Company’s financial statements for the fourth quarter and full year ended December 31, 2017; the Company’s leverage; liabilities imposed by the Company’s debt instruments; market demand; competitive factors; supply constraints; material and energy costs; technology factors; litigation; government and regulatory actions; the Company’s accounting policies; future trends; general economic and currency conditions; various conditions specific to the Company’s business and industry; the spin-off from TriMas Corporation; our ability to successfully complete the acquisition of the Brink Group, including the possibility that the closing conditions to the contemplated acquisition may not be satisfied or waived; delay in closing the proposed acquisition of the Brink Group; risks inherent in the achievement of cost synergies and timing thereof in connection with the Brink Group acquisition, including whether the acquisition will be accretive; the Company’s ability to promptly and effectively integrate the Brink Group; the performance and costs of integration of the Brink Group; the timing and amount of repurchases of the Company’s common stock, if any; and other risks that are discussed in the Company’s most recent Annual Report on Form 10-K, Quarterly Reports on Form 10-Q or Current Reports on Form 8-K. The risks described herein are not the only risks facing our Company. Additional risks and uncertainties not currently known to us or that we currently deemed to be immaterial also may materially adversely affect our business, financial position and results of operations or cash flows. We caution readers not to place undue reliance on such statements, which speak only as of the date hereof. We do not undertake any obligation to review or confirm analysts’ expectations or estimates or to release publicly any revisions to any forward-looking statement to reflect events or circumstances after the date hereof or to reflect the occurrence of unanticipated events.\n(1) The Company provides guidance for adjusted operating profit and adjusted diluted earnings per share, which exclude “Special Items” that are included in the determination of operating profit and diluted earnings per share under GAAP. “Special Items” are certain costs, expenses, other charges, gains or income, that management would not consider important in evaluating the quality of the Company’s operating results as they are not indicative of the Company’s core operating results or may obscure trends useful in evaluating the Company’s continuing activities. See Appendix I for reconciliation of the non-GAAP financial measures the Company provides guidance on to the most comparable GAAP measure. Appendix I\nHorizon Global Corporation\n2017 Guidance Reconciliation\n(Unaudited - dollars in thousands, except per share amounts)\nThe Company provides guidance for adjusted operating profit and adjusted diluted earnings per share, which exclude “Special Items” that are included in the determination of operating profit and diluted earnings per share under GAAP. “Special Items” are certain costs, expenses, other charges, gains or income, that management would not consider important in evaluating the quality of the Company’s operating results as they are not indicative of the Company’s core operating results or may obscure trends useful in evaluating the Company’s continuing activities. Accordingly, the Company provides guidance for adjusted operating profit and adjusted diluted earnings per share, excluding these Special Items, to help investors evaluate our operating performance and trends in our business consistent with how management evaluates such performance and trends. The following appendix reconciles the non-GAAP financial measures the Company provides guidance on to the most comparable GAAP measure.\nRevised Full Year Guidance:\nYear ended on December 31, 2017 Year ended\nDecember 31, 2016 Low End of Guidance High End of Guidance Revenue $ 890,700 $ 893,000 $ 649,200 Operating profit $ 34,000 3.8 % $ 36,000 4.0 % $ 6,300 1.0 %\nEstimated Special Items 15,000 1.7 % 15,600 1.8 % 30,860 4.8 %\nAdjusted operating profit $ 49,000 5.5 % $ 51,600 5.8 % $ 37,160 5.7 % Year ended on December 31, 2017 Low End of Guidance High End of Guidance Diluted loss per share $ (0.08 ) $ (0.02 ) Impact of Special Items (including tax impact) 0.98 1.00 Impact of dilutive shares (0.02 ) (0.02 ) Adjusted diluted earnings per share $ 0.88 $ 0.96 Diluted weighted average common shares outstanding, in accordance with U.S. GAAP 24,781,349 24,781,349 Impact of Special Items on diluted weighted average common shares outstanding 431,516 431,516 Diluted weighted average common shares outstanding, adjusted to exclude Special Items 25,212,865 25,212,865\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180125005626/en/\nHorizon Global Corporation\nChristi Cowdin, 248-593-8810\nDirector, Corporate Communications & Investor Relations\nccowdin@horizonglobal.com\nSource: Horizon Global Corporation", "external_links": ["http://www.businesswire.com/news/home/20180125005626/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.horizonglobal.com&esheet=51748738&newsitemid=20180125005626&lan=en-US&anchor=www.horizonglobal.com&index=1&md5=a7b5afe2d31bcc38e9cff2ac216d6c27"], "published": "2018-01-25T16:30:00.000+02:00", "crawled": "2018-01-25T17:15:32.000+02:00", "highlightTitle": ""}