{"organizations": [], "uuid": "25ee89e72449d8858d721ff334253a51af31348b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/business-wire-ogsystemsa-ceo-to-transition-to-chairman-of-the-board.html", "country": "US", "domain_rank": 767, "title": "OGSystems’ CEO to Transition to Chairman of the Board", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T15:00:00.000+02:00", "replies_count": 0, "uuid": "25ee89e72449d8858d721ff334253a51af31348b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/business-wire-ogsystemsa-ceo-to-transition-to-chairman-of-the-board.html", "ord_in_thread": 0, "title": "OGSystems’ CEO to Transition to Chairman of the Board", "locations": [], "entities": {"persons": [{"name": "steve martin", "sentiment": "none"}, {"name": "garrett", "sentiment": "none"}, {"name": "dan ehrmantraut", "sentiment": "none"}, {"name": "garrett pagon", "sentiment": "none"}, {"name": "balkissoon", "sentiment": "none"}, {"name": "omar balkissoon", "sentiment": "none"}], "locations": [{"name": "va.", "sentiment": "none"}, {"name": "chantilly", "sentiment": "none"}], "organizations": [{"name": "board company announces new executive leadership team", "sentiment": "negative"}, {"name": "geospark analytics", "sentiment": "none"}, {"name": "intelligence community", "sentiment": "none"}, {"name": "department of defense", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Company Announces New Executive Leadership Team\nCHANTILLY, Va.--(BUSINESS WIRE)-- OGSystems, a leader in technology innovation for the Department of Defense (DoD) and Intelligence Community (IC), today announced that co-founder Omar Balkissoon will transition from Chief Executive Officer (CEO) to Chairman of the Board. Garrett Pagon, President and co-founder, will step into the role of CEO. Balkissoon will focus on further building the technology and organization of OGSystems’ recent tech start-up spinout, GeoSpark Analytics, serving as the new company’s CEO ( http://bizj.us/1pgb99 ). OGSystems also announced the recent promotion of Steve Martin as the Chief Operating Officer (COO) and Dan Ehrmantraut to Chief Financial Officer (CFO).\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180109005313/en/\nOGSystems announces new executive leadership team. (Pictured left to right: Dan Ehrmantraut, Garrett Pagon, and Steve Martin) (Photo: Business Wire)\n“Since OGSystems’ founding, Garrett and I have put our heart and soul into the mission of making a positive impact on national security and the goal of providing growth opportunities for our people,” Balkissoon said. “We have a relentless focus on finding the right people, playing to their strengths, and empowering them to Own the Outcome. As co-founders, we’ve watched the company grow in ways we couldn’t imagine by enabling others to step into new roles with an eye towards delivering the best execution in the business. Having Garrett by my side has been instrumental to the journey as CEO, and that formula doesn’t change as I transition to Chairman with me by his.”\nPagon is a graduate of Stanford University and served as an intelligence officer for the United States Air Force before he and Balkissoon founded OGSystems in 2005. Through his leadership, the company has become a recognized and trusted prime contractor capable of winning and executing large engineering projects for the IC. He is responsible for scaling an entrepreneurial outfit into a large and reliable organization, while keeping the innovative spirit of the original culture.\n“People are the secret sauce at OGSystems,” said Pagon. “We give leaders from within an opportunity to grow and we recognize those responsible for our success. Both Steve and Dan have the right combination of skill, commitment to leading their teams, and tremendous respect from their peers and industry partners.”\nWith more than 20 years of DoD and IC experience - including over 10 years with OGSystems - Steve Martin has helped build the culture, client relationships, partnerships, and approaches that are the foundation of the company’s success. Previously serving as the Executive Partner responsible for performance on all client programs, Martin led the doubling of OGSystems revenues in the last three years. Known for a commitment to personnel development and increasing mission performance through innovation, he has overseen increases in key metrics such as employee retention to over twice the industry average.\nDan Ehrmantraut joined OGSystems in 2014 and quickly established the growing organization’s first in-house corporate finance and accounting department. In three years, he has proven himself as an outstanding leader in command of all financial aspects of the business and now formally assumes the role from Bill Earle as the interim CFO. As CFO, Ehrmantraut manages an agile, high-performing team responsible for contract/subcontract management, corporate accounting, payroll, program control, cost proposals, and corporate financial reporting and forecasting.\nAbout OGSystems\nOGSystems’ (OGS) mission is to provide technically advanced geospatial and security solutions to customers through constant innovation, effecting positive change in every engagement. In an industry accustomed to long and inefficient system development cycles, OGS thinks differently - we are an alternative for DoD and IC clients seeking nimble companies to solve their most difficult problems. Headquartered in Chantilly, Virginia, with regional offices in St. Louis, Missouri, San Diego, California, and Portland, Oregon, OGS employs over 300 geospatial engineers, software developers, data scientists and mission subject matter experts. For more information, visit http://www.ogsystems.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180109005313/en/\nOGSystems\nCarrie Drake, 703-870-7552, ext. 275\ncarrie.drake@ogsystems.com\nSource: OGSystems", "external_links": ["http://www.businesswire.com/news/home/20180109005313/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fbizj.us%2F1pgb99&esheet=51739810&newsitemid=20180109005313&lan=en-US&anchor=http%3A%2F%2Fbizj.us%2F1pgb99&index=1&md5=de2b32cfa9d35594f77de60afe4862b0", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ogsystems.com&esheet=51739810&newsitemid=20180109005313&lan=en-US&anchor=http%3A%2F%2Fwww.ogsystems.com&index=2&md5=2c99ffb6cb3507d79ac3935943580f08", "http://bizj.us/1pgb99"], "published": "2018-01-09T15:00:00.000+02:00", "crawled": "2018-01-09T15:40:37.072+02:00", "highlightTitle": ""}