{"organizations": [], "uuid": "157c1447db01973c2422800f9fcb7cf8e428b219", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/business-wire-crown-laboratories-inc-a-hildred-capital-partners-portfolio-company-acquires-innovative-self-tanning-brand-vita-liberata.html", "country": "US", "domain_rank": 767, "title": "Crown Laboratories, Inc., a Hildred Capital Partners Portfolio Company, Acquires Innovative Self-Tanning Brand Vita Liberata", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-05T16:30:00.000+02:00", "replies_count": 0, "uuid": "157c1447db01973c2422800f9fcb7cf8e428b219"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/business-wire-crown-laboratories-inc-a-hildred-capital-partners-portfolio-company-acquires-innovative-self-tanning-brand-vita-liberata.html", "ord_in_thread": 0, "title": "Crown Laboratories, Inc., a Hildred Capital Partners Portfolio Company, Acquires Innovative Self-Tanning Brand Vita Liberata", "locations": [], "entities": {"persons": [{"name": "vita liberata", "sentiment": "none"}, {"name": "alyson hogg", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "tenn.", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "johnson city", "sentiment": "none"}], "organizations": [{"name": "hildred capital partners portfolio company", "sentiment": "negative"}, {"name": "acquires innovative self-tanning brand vita liberata", "sentiment": "negative"}, {"name": "crown laboratories, inc.", "sentiment": "neutral"}, {"name": "vita liberata", "sentiment": "none"}, {"name": "hildred capital partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Adds Leading, All-Natural Product Line in Sunless Tanning to Crown’s Dermatology Portfolio\nNEW YORK & JOHNSON CITY, Tenn.--(BUSINESS WIRE)-- Crown Laboratories, Inc. (“Crown Laboratories”), a leading, fully integrated, specialty pharmaceutical company and a Hildred Capital Partners, LLC (“Hildred”) portfolio company, today announced it has acquired Vita Liberata, an Ireland-based company with advanced organic formulations, specializing in sunless tanning and skincare products.\nFounded in 2003 by Alyson Hogg, Vita Liberata was the first completely non-toxic tanning brand, with a collection of odorless products free from parabens, perfume and alcohol. Vita Liberata products employ the company’s proprietary Advoganic™ Technology, which combines cutting edge skin chemistry with highly potent organic botanicals. The technology fully releases the premium ingredients’ potential, enabling skincare benefits that are superior to those found in formulas using traditional cosmetic chemicals. Vita Liberata’s award-winning collection is sold in premium retailers across the U.S. and Europe, as well as in more than 26 countries worldwide. The brand is the self tanner of choice for the world’s top spas, including George V Paris, St Regis, Viceroy, Ritz-Carlton and Burj Al Arab. Ms. Hogg will stay on as President of Consumer Brands for Crown Laboratories.\n“We believe the Vita Liberata product line and the company’s strength in premium retail are a terrific complement to Crown’s Blue Lizard sunscreen brand and builds on Crown’s consumer healthcare products strategy in the dermatology space,” said Jeff Bedard, Crown Laboratories President and CEO. “Alyson and her entire team have done a remarkable job disrupting the self-tanning space, and we look forward to welcoming them to the Crown family. We will work together to continue to provide high-quality products that are at the forefront of skincare innovation.”\n“The harmful effects of UVA and UVB exposure are undeniable, and skin cancer rates continue to rise worldwide,” said Alyson Hogg. “Before Vita Liberata, few natural alternatives existed. Our ingredients are natural, certified organic and Ecocert – the purest in the tanning world. Crown and Hildred have a genuine understanding of the suncare market and a very impressive vision for the Vita Liberata brand. We are thrilled to partner with them to leverage Crown’s strong positioning within the dermatology space and advance our mission of making self tanning a viable alternative to sun exposure for all.”\n“Hildred’s goal for Crown is to build value by providing the company with the flexibility needed to foster organic growth while leveraging our experience to identify products that would complement Crown’s current offerings and contribute to accelerated growth,” said Hildred Partner David Solomon. “With a distinctive portfolio and an impressive track record of growth, Vita Liberata is a very exciting opportunity and a natural fit with Crown. As we mentioned at the time of the Crown acquisition, we will continue to actively look for interesting acquisitions, licenses and partnerships as we seek to build upon the growing overlap between medical, aesthetic, and over-the-counter dermatology,”.\nFinancial terms of the transaction were not disclosed. Centerview Partners served as financial advisor to Crown Laboratories, and Lowenstein Sandler and A&L Goodbody served as its legal advisors. The Sage Group and Tughans served as financial and legal advisors, respectively, to Vita Liberata.\nAbout Crown Laboratories, Inc.\nCrown Laboratories, Inc. is a privately held, fully integrated, specialty pharmaceutical company, focused in dermatology, and committed to developing and providing a diverse portfolio of pharmaceutical and consumer products, which improve the quality of life for its customers. Crown Laboratories is an innovative company, whose Blue Lizard Australian Sunscreen and robust portfolio of dermatological products have paved the way for Crown Laboratories’ rapid growth. Crown Laboratories’ prescription portfolio includes key branded products AlaScalp, AlaQuin, Daxbia and Dermasorb HC & TA Kits. For more information about Crown Laboratories or its products, visit www.crownlaboratories.com .\nAbout Hildred Capital Partners\nHildred Capital Partners, LLC is a private investment firm that invests in a broad range of securities, including equity and debt, across geographies and sectors, on both an actively and passively managed basis. Founded in 2014, Hildred has a particular interest in private equity, including situations where the principals can apply their extensive management experience to help a company reach its full potential. Hildred is headed by Howard Solomon, former CEO of Forest Laboratories, and David Solomon, former Senior Vice President, Corporate Development & Strategic Planning at Forest Laboratories, together with Andrew Goldman, the firm’s Chief Investment Officer.\nForward Looking Statements\nIn this press release, the use of words such as \"expect,\" \"anticipate,\" \"possible,\" \"potential,\" \"believe,\" \"commit,\" \"intend,\" \"continue,\" \"may,\" \"would,\" \"could,\" \"should,\" or similar expressions is intended to identify forward-looking statements that represent Crown Laboratories management’s current judgment about possible future events. We believe these judgments are reasonable, but these statements are not guarantees of any events or results, and actual results may differ materially due to a variety of important factors. Such risks and uncertainties may include, but are not limited to: the satisfaction of closing conditions to the investment by Hildred; the possibility that the transaction will not be completed or, if completed, not completed in the expected timeframe; the potential that the expected benefits and opportunities of the transaction may not be realized or may take longer to realize than expected; and adverse litigation or government action. Crown Laboratories undertakes no obligation to update the information contained in this release.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180105005352/en/\nCrown Laboratories\nLibby Erwin, 423-630-2269\nlerwin@crownlaboratories.com\nor\nFor Hildred:\nSard Verbinnen & Co\nRobin Weinberg/Pamela Greene, 212-687-8080\nSource: Hildred Capital Partners, LLC", "external_links": ["http://www.businesswire.com/news/home/20180105005352/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.crownlaboratories.com%2F&esheet=51738498&newsitemid=20180105005352&lan=en-US&anchor=www.crownlaboratories.com&index=1&md5=f18cd36935f4e4124603fe01c71a1e00"], "published": "2018-01-05T16:30:00.000+02:00", "crawled": "2018-01-05T18:05:08.020+02:00", "highlightTitle": ""}