{"organizations": [], "uuid": "77d60cf8d3aa260c24d397e552697942c7ed78fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-cato-reports-december-same-store-sales-down-9-percent.html", "country": "US", "domain_rank": 767, "title": "Cato Reports December Same-store Sales Down 9%", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.111, "site_type": "news", "published": "2018-01-04T15:00:00.000+02:00", "replies_count": 0, "uuid": "77d60cf8d3aa260c24d397e552697942c7ed78fb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-cato-reports-december-same-store-sales-down-9-percent.html", "ord_in_thread": 0, "title": "Cato Reports December Same-store Sales Down 9%", "locations": [], "entities": {"persons": [{"name": "john cato", "sentiment": "none"}], "locations": [{"name": "charlotte", "sentiment": "none"}, {"name": "n.c.", "sentiment": "none"}, {"name": "decembe", "sentiment": "none"}], "organizations": [{"name": "cato", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "cato corporation", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHARLOTTE, N.C., Jan. 4, 2018 /PRNewswire/ -- The Cato Corporation (NYSE: CATO) today reported sales for the five weeks ended December 30, 2017 of $94.7 million, a 9% decrease from sales of $104.4 million for the five week period ended December 31, 2016. Same-store sales for the month decreased 9%.\nSales for the eleven months ended December 30, 2017 were $787.9 million, a 13% decrease from sales of $901.8 million for the eleven months ended December 31, 2016. The Company's year-to-date same-store sales decreased 13%.\n\"The December same store sales decline is consistent with our recent trend,\" stated John Cato, Chairman, President, and Chief Executive Officer. \"We expect the fourth quarter earnings to be a loss of between $.30 and $.45 versus a loss of $.48 last year. This includes our current estimated impact of an additional expense of between $.20 and $.30 for the required adjustments due to the implementation of the \"Tax Cuts and Jobs Act of 2017\". The Company's estimate for full year earnings per diluted share is in the range of $.50 to $.65 versus $1.72 last year.\"\nAs of December 30, 2017, the Company operated 1,355 stores in 33 states, compared to 1,368 stores in 33 states as of December 31, 2016.\nThe Cato Corporation is a leading specialty retailer of value-priced fashion apparel and accessories operating three concepts, \"Cato\", \"Versona\" and \"It's Fashion\". The Company's Cato stores offer exclusive merchandise with fashion and quality comparable to mall specialty stores at low prices every day. The Company also offers exclusive merchandise found in its Cato stores at www.catofashions.com . Versona is a unique fashion destination offering apparel and accessories including jewelry, handbags and shoes at exceptional prices every day. Select Versona merchandise can also be found at www.shopversona.com . It's Fashion offers fashion with a focus on the latest trendy styles for the entire family at low prices every day.\nStatements in this press release not historical in nature including, without limitation, statements regarding the Company's expected or estimated operational and financial results are considered \"forward-looking\" within the meaning of The Private Securities Litigation Reform Act of 1995. Such forward-looking statements are based on current expectations that are subject to known and unknown risks, uncertainties and other factors that could cause actual results to differ materially from those contemplated by the forward-looking statements. Such factors include, but are not limited to, the following: any actual or perceived deterioration in the conditions that drive consumer confidence and spending, including, but not limited to, levels of unemployment, fuel, energy and food costs, wage rates, tax rates, home values, consumer net worth and the availability of credit; uncertainties regarding the impact of any governmental responses to the foregoing conditions; changes in laws or regulations affecting our business; competitive factors and pricing pressures; our ability to predict and respond to rapidly changing fashion trends and consumer demands; adverse weather or similar conditions that may affect our sales or operations; inventory risks due to shifts in market demand, including the ability to liquidate excess inventory at anticipated margins; and other factors discussed under \"Risk Factors\" in Part I, Item 1A of the Company's most recently filed annual report on Form 10-K and in other reports the Company files with or furnishes to the SEC from time to time. The Company does not undertake to publicly update or revise the forward-looking statements even if experience or future changes make it clear that the projected results expressed or implied therein will not be realized. The Company is not responsible for any changes made to this press release by wire or Internet services.\nView original content: http://www.prnewswire.com/news-releases/cato-reports-december-same-store-sales-down-9-300577302.html\nSOURCE The Cato Corporation", "external_links": ["http://www.prnewswire.com/news-releases/cato-reports-december-same-store-sales-down-9-300577302.html"], "published": "2018-01-04T15:00:00.000+02:00", "crawled": "2018-01-04T17:12:05.008+02:00", "highlightTitle": ""}