{"organizations": [], "uuid": "5b823b436020164162f6ece4c89b50d3258910c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/05/the-associated-press-the-latest-producer-ok-being-schooled-in-transgender-life.html", "country": "US", "domain_rank": 767, "title": "The Latest: Producer OK being schooled in transgender life", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T21:39:00.000+02:00", "replies_count": 0, "uuid": "5b823b436020164162f6ece4c89b50d3258910c1"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/05/the-associated-press-the-latest-producer-ok-being-schooled-in-transgender-life.html", "ord_in_thread": 0, "title": "The Latest: Producer OK being schooled in transgender life", "locations": [], "entities": {"persons": [{"name": "evan peters", "sentiment": "none"}, {"name": "james van der beek", "sentiment": "none"}, {"name": "ryan murphy", "sentiment": "none"}, {"name": "murphy", "sentiment": "none"}, {"name": "kate mara", "sentiment": "none"}], "locations": [{"name": "pasadena", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "pasadena", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "hollywood", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PASADENA, Calif. (AP) — The Latest from the TV Critics meeting in Pasadena, California (all times local):\n6:25 p.m.\nProducer Ryan Murphy says he's OK being schooled in transgender life during the making of his new FX series \"Pose.\"\nThe large number of transgender actors and others connected with the show freely offer advice about authentically depicting their experience, Murphy told TV critics Friday.\nThe prominent Murphy said he doesn't have a lot of people telling him \"no\" and called it a welcome change.\n\"Pose,\" about the New York ballroom scene of the 1980s and today, also gave him a chance to discover new talent in a way he hadn't done since the series \"Glee,\" Murphy said.\nBeing able to give gifted transgender people a path into mainstream Hollywood was especially satisfying, he said.\nAs a teenager who was beaten after his father discovered he was gay, Murphy said, he never could have imagined the personal and professional success he's achieved. His father is dead, he said.\n\"Pose,\" which stars Evan Peters, Kate Mara and James Van Der Beek, will debut this summer. An air date has yet to be announced.\n3:45 p.m.\nFX Networks CEO John Landgraf says TV keeps churning out record numbers of original series but can be overshadowed by the internet's dubious distractions.\nTechnology distracts people with \"hourly doses of bite-size half-truths and click bait come-ons,\" Landgraf told a TV critics' meeting Friday.\nHe said it sometimes seems that even worthy TV is a \"sideshow\" to what he called the \"daily three-ring media circus.\"\nGiven concerns over society's shrinking attention span and \"dwindling intolerance for dissent,\" he's glad when even his competitors' worthy shows draw viewers, he said.\nThe veteran TV executive, who has made FX the unofficial accountant for so-called \"Peak TV\" numbers, said that the total number of cable, broadcast and streamed series hit an estimated 487 in 2017, a 7 percent increase over 2016's tally of 455.\nThe 117 streamed series in 2017 from rapidly expanding outlets including Netflix and Amazon represented the biggest increase, 30 percent, over 2016.\n11:20 a.m.\nFX says it is ordering a spinoff to \"Sons of Anarchy\" with Edward James Olmos as part of a nearly all-Latino cast.\nThe 10-episode \"Mayans MC\" will premiere later this year, FX Networks CEO John Landgraf told a TV critics meeting Friday. The date was not announced.\nThe series, focused on characters from \"Sons of Anarchy,\" is poised to show that \"hit television and diverse television\" can be the same thing, Landgraf said.\nAlso starring in the drama are JD Pardo, Sarah Bolger, Clayton Cardenas and Richard Cabral.\n\"Sons of Anarchy\" creator Kurt Sutter will produce the show with Elgin James and Norberto Barba.\n11:15 a.m.\nFX Networks CEO John Landgraf says an investigation into sexual misconduct by Louis C.K. found nothing involving his work for the company over the past eight years.\nThe investigation followed a published report of misbehavior, Landgraf told TV critics Friday. The network cut ties in November with C.K. after he admitted wrongdoing.\nAfter the comedian was accused by five women of sexual misconduct, Netflix scrapped plans for an upcoming Louis C.K. stand up special, the release of C.K.'s feature film \"I Love You, Daddy\" was shelved and HBO removed his work from its on demand video streaming service.\nC.K. has said the allegations are true and expressed remorse.", "external_links": [], "published": "2018-01-05T21:39:00.000+02:00", "crawled": "2018-01-07T03:41:50.001+02:00", "highlightTitle": ""}