{"organizations": [], "uuid": "38f3fa9c0c24f6365669adae4d36f34dcf7d7417", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-germany-iran/iranian-cleric-leaves-germany-under-threat-of-prosecution-idUSKBN1F02CN", "country": "US", "domain_rank": 408, "title": "Iranian cleric leaves Germany under threat of prosecution", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T19:21:00.000+02:00", "replies_count": 0, "uuid": "38f3fa9c0c24f6365669adae4d36f34dcf7d7417"}, "author": "", "url": "https://www.reuters.com/article/us-germany-iran/iranian-cleric-leaves-germany-under-threat-of-prosecution-idUSKBN1F02CN", "ord_in_thread": 0, "title": "Iranian cleric leaves Germany under threat of prosecution", "locations": [], "entities": {"persons": [{"name": "reut", "sentiment": "none"}, {"name": "majid samii", "sentiment": "none"}, {"name": "shahroudi", "sentiment": "none"}, {"name": "ayatollah mahmoud hashemi shahroudi", "sentiment": "none"}, {"name": "volker beck", "sentiment": "none"}], "locations": [{"name": "germany", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "hanover", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "iranian-german", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "national council of resistance of iran", "sentiment": "none"}, {"name": "ncri", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "green", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 5:21 PM / Updated 29 minutes ago Iranian cleric leaves Germany under threat of prosecution Reuters Staff 3 Min Read \nBERLIN (Reuters) - A senior Iranian cleric under investigation in Germany for alleged crimes against humanity left the country on a homeward-bound flight on Thursday, cutting short his stay at a Hanover clinic, a German official said. \nAyatollah Mahmoud Hashemi Shahroudi, a former chief justice, was in Germany for treatment at the clinic of Iranian-German neurosurgeon Majid Samii when activists referred him to prosecutors, citing what they called his record of passing death sentences. \nThe National Council of Resistance of Iran (NCRI), an exiled opposition group, said his issuing of “thousands” of death sentences amounted to a crime against humanity and urged German prosecutors to investigate. \nProsecutors said they were investigating the referrals, including one from senior Green politician Volker Beck. Later, the NCRI reported that Iran had reserved tickets for Shahroudi and his entourage to leave the country. \nA German government official told Reuters on Thursday afternoon that Shahroudi was aboard an Iran-bound plane. \nWhile Germany, like all European Union countries, opposes the death penalty, German prosecutors do not automatically act on cases referred to them involving executions in foreign countries. \nFor the issuing of death sentences to amount to a crime against humanity, they would have to be part of a systematic attack on a civilian population. \nAn NCRI activist condemned Shahroudi’s departure. “He should have been prosecuted for thousands of executions in Iran,” said Shahin Gobadi, a member of the NCRI’s foreign affairs committee. \nNCRI spokesman Javad Dabiran said the group had seen Shahroudi leave the Hanover hospital in a convoy before departing from Hamburg airport on an Iran Air flight at 1325 local time (1225 GMT). \nIt said it had filed a formal complaint with prosecutors, accusing Shahroudi of committing crimes against humanity and urging Berlin to prevent the cleric from leaving Germany. \nAn arrest warrant would have to be issued by Germany’s constitutional court. \nShahroudi was head of Iran’s judiciary for a decade and is currently the head of the Expediency Council, a body intended to resolve disputes between parliament and a hardline watchdog body, the Guardian Council. \nReuters could not immediately reach Shahroudi for comment. \nShahroudi’s visit to a hospital in Germany prompted anger among some Iranians who believe officials in the Islamic Republic should use the same health system as ordinary Iranians. \nParviz Davoudi, an official in his office, said on Monday that “Shahroudi was against traveling to Germany, and only did so after doctors insisted there is a medical emergency”. Reporting by Michelle Martin, additional reporting by Bozorgmehr Sharafedin,; Writing by Thomas Escritt, Editing by William Maclean", "external_links": [], "published": "2018-01-11T19:21:00.000+02:00", "crawled": "2018-01-11T19:28:47.021+02:00", "highlightTitle": ""}