{"organizations": [], "uuid": "e86c42798e9ab8f3d02a22a27dac161b6623240e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226986929&w=1200&r=LYNXMPEE0U167", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/us-olympics-2018-putin/a-lottery-russians-criticize-olympic-team-selection-process-idUKKBN1FK28C", "country": "US", "domain_rank": 408, "title": "'A lottery' - Russians criticise Olympic team selection process", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T17:55:00.000+02:00", "replies_count": 0, "uuid": "e86c42798e9ab8f3d02a22a27dac161b6623240e"}, "author": "", "url": "https://uk.reuters.com/article/us-olympics-2018-putin/a-lottery-russians-criticize-olympic-team-selection-process-idUKKBN1FK28C", "ord_in_thread": 0, "title": "'A lottery' - Russians criticise Olympic team selection process", "locations": [], "entities": {"persons": [{"name": "gabrielle tetrault-far", "sentiment": "neutral"}, {"name": "viktor ahn", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "sofia prosvirnova", "sentiment": "none"}, {"name": "international olympic committee", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  novo-ogaryovo", "sentiment": "none"}, {"name": "ioc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  a minute ago 'A lottery:' Russians criticize Olympic team selection process Gabrielle Tetrault-Farber 3 Min Read \nNOVO-OGARYOVO, Russia (Reuters) - Several Russian athletes competing at the Pyeongchang Winter Olympics next month questioned on Wednesday why some of their team mates did not receive invitations from the International Olympic Committee (IOC) to take part as neutrals. \nThe IOC last month banned Russia from the Games for “systematic manipulation” of the anti-doping testing system at the 2014 Sochi Games, but left the door open for some athletes without a history of doping to compete as “Olympic Athletes from Russia” -- without the Russian flag, national emblems or anthem. \nHowever, the exclusion of athletes who have not served doping bans in the past, including short track speed skater Viktor Ahn, a six-time Olympic gold medalist, have left Russian athletes wondering how the invitation list was conceived. \n“It’s a lottery,” said Sofia Prosvirnova, one of seven Russian short track speed skaters headed to South Korea, ahead of a meeting of “Olympic Athletes from Russia” with President Vladimir Putin. \n“I know very well the athletes they didn’t let go (to the Olympics). I know 100 percent that they’re not guilty of anything.” \nThe IOC last week released a list of 17 factors that were used to determine which Russians would be invited to the Games. \nIt said the selection panel had used information from an IOC probe into anti-doping violations at the Sochi Games to make its list, among other sources. Russian President Vladimir Putin (2nd L) poses for a selfie during a meeting with Russian athletes and team members, who will take part in the upcoming 2018 Pyeongchang Winter Olympic Games, at the Novo-Ogaryovo state residence outside Moscow, Russia January 31, 2018. REUTERS/Grigory Dukor \n”I think the Olympics Games is like a birthday party for the IOC,“ hockey player Ilya Kovalchuk told reporters. ”They invite whoever they want. \n“Guys in biathlon and ski, they train and all season-long they win medals to be able to go to Olympics and they said no. It’s not right.” Slideshow (7 Images) \nAddressing dozens of “Olympic Athletes from Russia” wearing their neutral grey and red uniforms, Putin said the country would do everything to support the athletes left out of the Games. \n“We will have a substantive discussion with our colleagues from international (sports) organizations,” Putin said. “We can figure all of this out.” \nIn an e-mail to Reuters, the IOC, which says it does not comment on individual cases, said panel members had gone “into detailed consideration of each individual athlete” in its selection of Russian competitors. \nSome athletes said the absence of team mates will provide additional motivation. \n“It’s a very difficult situation for the athletes who cannot go,” said Pavel Datsyuk, the captain of the country’s hockey team. “We will fight for them too.” Reporting by Gabrielle Tétrault-Farber; Editing by Christian Radnedge", "external_links": [], "published": "2018-01-31T17:55:00.000+02:00", "crawled": "2018-01-31T18:10:27.003+02:00", "highlightTitle": ""}