{"organizations": [], "uuid": "634700657cf13341299031b748ebfc1547437e47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/business-wire-boston-pharmaceuticals-appoints-dr-peter-ho-as-chief-medical-officer.html", "country": "US", "domain_rank": 767, "title": "Boston Pharmaceuticals Appoints Dr. Peter Ho as Chief Medical Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T16:00:00.000+02:00", "replies_count": 0, "uuid": "634700657cf13341299031b748ebfc1547437e47"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/business-wire-boston-pharmaceuticals-appoints-dr-peter-ho-as-chief-medical-officer.html", "ord_in_thread": 0, "title": "Boston Pharmaceuticals Appoints Dr. Peter Ho as Chief Medical Officer", "locations": [], "entities": {"persons": [{"name": "peter ho", "sentiment": "negative"}, {"name": "ho", "sentiment": "none"}, {"name": "robert armstrong", "sentiment": "none"}, {"name": "peter", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}, {"name": "epizyme", "sentiment": "none"}], "organizations": [{"name": "boston pharmaceuticals", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CAMBRIDGE, Mass.--(BUSINESS WIRE)-- Boston Pharmaceuticals (the “Company”) today announced the appointment of Peter Ho, MD, PhD, as Chief Medical Officer. Dr. Ho joins Boston Pharmaceuticals from Epizyme, where as Chief Medical Officer he led the company’s clinical development, translational medicine and regulatory affairs functions. At Boston Pharmaceuticals, Dr. Ho will oversee the clinical development the Company’s diversified portfolio of candidates.\n“Peter is a tremendous addition to the Boston Pharmaceuticals team as we continue to build and advance our portfolio of differentiated therapeutics,” said Robert Armstrong, PhD, Chief Executive Officer and Co-Founder of Boston Pharmaceuticals. “Peter brings extensive expertise in translational medicine and clinical development and has overseen the progression of product candidates from early stage research through clinical development across multiple disease areas. We welcome him to our leadership team, and look forward to his contributions as we continue to advance candidates that we believe will ultimately improve patients’ lives.”\n“Boston Pharmaceuticals is an exciting opportunity to advance the development of truly innovative programs across a range of therapeutic areas,” said Dr. Ho. “We are entering 2018 with great momentum. Two programs are in ongoing clinical trials, one in patients with advanced nonhematologic malignancies and one in patients with systemic lupus erythematosus, and we look forward to rapidly advancing our growing portfolio of candidates which have the potential to provide meaningful clinical benefit for patients.”\nPrior to joining Epizyme, Dr. Ho was Co-Founder and President of BeiGene Ltd. His previous pharmaceutical positions included Vice President of Oncology Clinical Development at Johnson and Johnson and Senior Vice President of the Oncology Center of Excellence in Drug Discovery at GlaxoSmithKline. Dr. Ho began his career in drug discovery and development at the Investigational Drug Branch of the Cancer Therapy Evaluation Program, National Cancer Institute (NCI) followed by positions of increasing responsibility at Novartis and DuPont Pharmaceuticals.\nOver his career, Dr. Ho has been directly responsible for first-in-human dosing of 17 anticancer agents and has overseen the development of over 50 hematology and oncology compounds. His work has contributed to seven new chemical entity approvals to-date including Gleevec ® , Arranon ® , Tykerb ® , Promacta ® , Votrient ® , Tafinlar ® and Mekinist ® (all trademarks registered to Novartis). Dr. Ho completed his pediatrics residency at The Children's Hospital of Boston followed by clinical fellowships in pediatric hematology/oncology at the Dana-Farber Cancer Institute and in clinical oncology and regulatory sciences jointly through the U.S. Food and Drug Administration (FDA) and the NCI. He received a BA in biology from The Johns Hopkins University, and MD and PhD degrees from Yale University. Dr. Ho serves on the Scientific Advisory Board of Accent Therapeutics and served as a member of the Pediatric Cancer Working Group of the Cancer Moonshot Task Force.\nTo learn more about the Boston Pharmaceuticals team, visit www.bostonpharmaceuticals.com/who-we-are .\nAbout Boston Pharmaceuticals\nBoston Pharmaceuticals (the “Company”) is a clinical stage biopharmaceutical company developing differentiated therapeutics. By leveraging a highly experienced clinical development team, Boston Pharmaceuticals is building a portfolio of high value clinical candidates addressing important unmet medical needs. The Company partners with innovative biotechnology companies, pharmaceutical companies and academic groups to acquire or in-license drug development candidates at late stages of pre-clinical development through early stages of clinical development. Following completion of human proof-of-concept trials, Boston Pharmaceuticals intends to partner successful development candidates to larger pharmaceutical or biotechnology companies for registration and commercialization, or alternatively build its own late stage portfolio, enabling the best molecules to reach patients while creating downstream value for the innovator and the Company. Boston Pharmaceuticals is funded by Gurnet Point Capital to build a diversified portfolio of clinical candidates across multiple therapeutic areas. For more information, please visit www.bostonpharmaceuticals.com .\n //www.businesswire.com/news/home/20180103005385/en/\nMacDougall Biomedical Communications for Boston Pharmaceuticals\nKari Watson, 781-235-3060\nkwatson@macbiocom.com\nSource: Boston Pharmaceuticals", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.bostonpharmaceuticals.com%2F&esheet=51737018&newsitemid=20180103005385&lan=en-US&anchor=Boston+Pharmaceuticals&index=1&md5=6a3fbef4183453fb88d756c68808d60c", "http://www.businesswire.com/news/home/20180103005385/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.bostonpharmaceuticals.com&esheet=51737018&newsitemid=20180103005385&lan=en-US&anchor=www.bostonpharmaceuticals.com&index=3&md5=967936df9a1c3d9767ea03ee2ad25be8", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.bostonpharmaceuticals.com%2Fwho-we-are&esheet=51737018&newsitemid=20180103005385&lan=en-US&anchor=www.bostonpharmaceuticals.com%2Fwho-we-are&index=2&md5=160d53eabeec374a935fcc015822d761"], "published": "2018-01-03T16:00:00.000+02:00", "crawled": "2018-01-03T16:49:26.004+02:00", "highlightTitle": ""}