{"organizations": [], "uuid": "813c7881dd9e11081e1fc7a7f26385f0e11e2407", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-csx-strengthens-management-team-with-addition-of-edmond-l-harris-as-executive-vice-president-of-operations.html", "country": "US", "domain_rank": 767, "title": "CSX Strengthens Management Team with Addition of Edmond L. Harris as Executive Vice President of Operations", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T22:07:00.000+02:00", "replies_count": 0, "uuid": "813c7881dd9e11081e1fc7a7f26385f0e11e2407"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-csx-strengthens-management-team-with-addition-of-edmond-l-harris-as-executive-vice-president-of-operations.html", "ord_in_thread": 0, "title": "CSX Strengthens Management Team with Addition of Edmond L. Harris as Executive Vice President of Operations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "JACKSONVILLE, Fla., Jan. 08, 2018 (GLOBE NEWSWIRE) -- CSX Corporation (NASDAQ:CSX) announced today that Edmond L. Harris has been named executive vice president of operations, effective immediately. Mr. Harris has more than 40 years’ experience in the railroad industry in an operating capacity, including nearly two decades at the Illinois Central and Canadian National (CN), where he worked closely with Hunter Harrison to transform the traditional operating models of both railroads to Precision Scheduled Railroading models. Mr. Harris ultimately served as executive vice president of operations until his retirement from CN.\nJim Foote, president and chief executive officer of CSX, said, “I am thrilled to have Ed join the CSX team and believe his railroading experience, including nearly a decade working closely with me at CN, will be invaluable in achieving our ultimate goal of establishing CSX as the best railroad in North America. Ed joins an already strong and diversified leadership team at CSX that is focused on creating value for our customers and shareholders through operational excellence and the continued implementation of the new operating plan.”\nEd Harris, executive vice president of operations of CSX, said, “The pace of transformation that CSX has accomplished in such a short period of time has been remarkable and I am excited to get to work. Similar to Jim, I have spent many years implementing the scheduled railroading operating plan and I am confident that I can make an immediate contribution to CSX’s commitment to delivering value to all stakeholders.”\nAs executive vice president of operations, Mr. Harris will have responsibility for mechanical, engineering, transportation and network operations.\nPrior to joining CSX, Mr. Harris served as a senior advisor to Global Infrastructure Partners, an independent fund that invests in infrastructure assets worldwide; chairman of Omnitrax Rail Network; and board director for Universal Rail Services. Mr. Harris also consulted recently with Rio Tinto in Australia and Cosan Industries in Brazil. Mr. Harris began his career with Illinois Central Railroad serving as a key member of the operating team, which included Hunter Harrison, that first introduced the scheduled railroading model to the industry. Following CN’s acquisition of Illinois Central, Mr. Harris held leadership positions alongside Jim Foote. After retiring from CN, Mr. Harris joined Canadian Pacific (CP) where he served as chief operations officer and subsequently joined the CP Board.\nMr. Harris brings a demonstrated track record of improving productivity, service, and safety at North American railways. He earned a Bachelor of Science degree in business management from the University of Illinois and served in the U.S. Marine Corps from 1969 to 1973.\nAbout CSX\nCSX, based in Jacksonville, Florida, is a premier transportation company. It provides rail, intermodal and rail-to-truck transload services and solutions to customers across a broad array of markets, including energy, industrial, construction, agricultural, and consumer products. For over 190 years, CSX has played a critical role in the nation’s economic expansion and industrial development. Its network connects every major metropolitan area in the eastern United States, where nearly two-thirds of the nation’s population resides. It also links more than 240 short-line railroads and more than 70 ocean, river and lake ports with major population centers and farming towns alike.\nMore information about CSX Corporation and its subsidiaries is available at www.csx.com and on Facebook ( http://www.facebook.com/OfficialCSX ).\nForward-looking Statements\nThis information and other statements by the Company may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act with respect to, among other items: projections and estimates of earnings, revenues, margins, volumes, rates, cost-savings, expenses, taxes, liquidity, capital expenditures, dividends, share repurchases or other financial items, statements of management’s plans, strategies and objectives for future operations, and management’s expectations as to future performance and operations and the time by which objectives will be achieved, statements concerning proposed new services, and statements regarding future economic, industry or market conditions or performance. Forward-looking statements are typically identified by words or phrases such as “will,” “should,” “believe,” “expect,” “anticipate,” “project,” “estimate,” “preliminary” and similar expressions. Forward-looking statements speak only as of the date they are made, and the Company undertakes no obligation to update or revise any forward-looking statement. If the Company updates any forward-looking statement, no inference should be drawn that the Company will make additional updates with respect to that statement or any other forward-looking statements.\nForward-looking statements are subject to a number of risks and uncertainties, and actual performance or results could differ materially from that anticipated by any forward-looking statements. Factors that may cause actual results to differ materially from those contemplated by any forward- looking statements include, among others; (i) the Company’s success in implementing its financial and operational initiatives; (ii) changes in domestic or international economic, political or business conditions, including those affecting the transportation industry (such as the impact of industry competition, conditions, performance and consolidation); (iii) legislative or regulatory changes; (iv) the inherent business risks associated with safety and security; (v) the outcome of claims and litigation involving or affecting the Company; (vi) natural events such as severe weather conditions or pandemic health crises; and (vii) the inherent uncertainty associated with projecting economic and business conditions.\nOther important assumptions and factors that could cause actual results to differ materially from those in the forward-looking statements are specified in the Company’s SEC reports, accessible on the SEC’s website at www.sec.gov and the Company’s website at www.csx.com .\nContacts: Kevin Boone, Investor Relations 904-359-1090 Bryan Tucker, Corporate Communications 855-955-6397\nSource:CSX Corporation", "external_links": ["https://www.globenewswire.com/Tracker?data=fYleyXuP6UrG-iQSCAx3NIatqIVW0jBSRAiQxC5zuM3-4lddS_MQvtL1HtX9PHMcdLulX6lhmWDjov66LjX7Og==", "http://www.facebook.com/OfficialCSX", "https://www.globenewswire.com/NewsRoom/AttachmentNg/1afb6a45-48a6-4383-b819-3a03a870984c", "https://www.globenewswire.com/Tracker?data=5G84CSfC_6XVOTzjXTAC2rlIg481tqp9riDeVWJRwQX6OY4_fzMPYv_FI58qP9BhABPROjiUcywZdnuxxR76wT0q1db-rDhf_kugDlNIe3MpVTXGOdSiRJdAhBKk9xsJ"], "published": "2018-01-08T22:07:00.000+02:00", "crawled": "2018-01-09T09:36:20.869+02:00", "highlightTitle": ""}