{"organizations": [], "uuid": "44ef1d5c916db2a3ec61062c1e79b08abef9e25f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224465673&w=1200&r=LYNXMPEE0M0XX", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-usa-stocks/futures-higher-on-strong-earnings-global-growth-hopes-idUSKBN1FC1MH", "country": "US", "domain_rank": 408, "title": "US STOCKS-Futures higher on strong earnings, global growth hopes", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T14:40:00.000+02:00", "replies_count": 0, "uuid": "44ef1d5c916db2a3ec61062c1e79b08abef9e25f"}, "author": "", "url": "https://www.reuters.com/article/us-usa-stocks/futures-higher-on-strong-earnings-global-growth-hopes-idUSKBN1FC1MH", "ord_in_thread": 0, "title": "US STOCKS-Futures higher on strong earnings, global growth hopes", "locations": [], "entities": {"persons": [{"name": "sruthi shankar", "sentiment": "negative"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "netflix", "sentiment": "none"}, {"name": "johnson & johnson", "sentiment": "none"}, {"name": "verizon", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - U.S. stocks advanced on Tuesday, as strong results from Netflix helped lift the S&P and Nasdaq Composite, but the Dow Industrials were hemmed in by declines in Johnson & Johnson and Procter & Gamble. \nNetflix touched a record high of $257.71 and was last up 9.98 percent at $250.29, to cross the $100 billion market value threshold. The video-streaming pioneer beat Wall Street targets for new subscribers in the fourth quarter. \nOther stocks known as part of the “FAANG” group - Facebook, Apple, Amazon and Google parent Alphabet - also moved higher. \nInsurer Travelers provided the biggest boost to the Dow, up 4.96 percent after profit topped estimates. \n“There has not been another time in this recovery where Main Street was doing well, where every economy in the world was doing well, and where so far there isn’t really an overwhelming show that we have a significant inflation or interest rate problem which would mandate a valuation change,” said Jim Paulsen, chief investment strategist at The Leuthold Group in Minneapolis. \nPaulsen cautioned, however, that as the rally continued more challenges were mounting that could cause a pullback. “If it ever does turn, there could be a fair amount of correction,” he said. \nThe S&P 500 has reached a streak of 396 trading days without a 5-percent correction, according to LPL Financial, the longest on record. The benchmark index has closed within 5 percent of a record in 467 of the past 468 trading days. \nS&P 500 earnings growth for the fourth-quarter is expected at 12.4 percent, according to Thomson Reuters data through Tuesday morning. Of the 68 companies in the benchmark index that have posted results, 76.5 percent have topped Wall Street expectations. \nThe Dow Jones Industrial Average fell 3.79 points, or 0.01 percent, to 26,210.81, the S&P 500 gained 6.17 points, or 0.22 percent, to 2,839.14 and the Nasdaq Composite added 52.26 points, or 0.71 percent, to 7,460.29. \nJohnson & Johnson fell 4.26 percent, dragged down by a $13.6-billion charge related to the new U.S. tax law and a court ruling on a crucial patent on its blockbuster rheumatoid arthritis drug Remicade. \nProcter & Gamble dropped 3.09 percent as investors focused on a drop in gross margins at the world’s largest consumer goods maker. \nU.S. President Donald Trump on Monday approved steep import tariffs on washing machines and solar panels, a move that was criticized by China, South Korea and Europe and stoked fears about potential retaliation. \nIn the wake of the tariffs, shares of Whirlpool rose 3.20 percent and smaller solar names such as Real Goods Solar, up 33.04 percent and Sunworks, up 10.71 percent, moved higher. \nVerizon slipped 0.43 percent as its quarterly profit fell short of Wall Street estimates but revenue beat expectations as it added phone subscribers. \nAdvancing issues outnumbered declining ones on the NYSE by a 1.60-to-1 ratio; on Nasdaq, a 1.28-to-1 ratio favored advancers. \nThe S&P 500 posted 135 new 52-week highs and 1 new low; the Nasdaq Composite recorded 232 new highs and 16 new lows. \nVolume on U.S. exchanges was 6.78 billion shares, above the 6.38 billion average for the full session over the last 20 trading days. \nReporting by Chuck Mikolajczak, Editing by Chizu Nomiyama and Nick Zieminski\n ", "external_links": [], "published": "2018-01-23T14:40:00.000+02:00", "crawled": "2018-01-23T14:59:16.009+02:00", "highlightTitle": ""}