{"organizations": [], "uuid": "9403d3928c470139fbae7eeb901f90c8d91b1c71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/10/104938549-GettyImages-134210415.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/11/bonds-and-fixed-income-fed-speech-bonds-data-politics-on-the-agenda-for-investors.html", "country": "US", "domain_rank": 767, "title": "Bonds and fixed income: Fed speech, bonds, Data, politics, on the agenda for investors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T13:25:00.000+02:00", "replies_count": 0, "uuid": "9403d3928c470139fbae7eeb901f90c8d91b1c71"}, "author": "Alexandra Gibbs", "url": "https://www.cnbc.com/2018/01/11/bonds-and-fixed-income-fed-speech-bonds-data-politics-on-the-agenda-for-investors.html", "ord_in_thread": 0, "title": "Bonds and fixed income: Fed speech, bonds, Data, politics, on the agenda for investors", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "fed", "sentiment": "negative"}, {"name": "treasury", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "bloomberg news", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. government debt yields slipped Thursday but held near highs after the European Central Bank said it may adjust its guidance to investors given the strength in the European economy.\nThe yield on the benchmark 10-year Treasury note fell to 2.531 percent at 2:33 p.m. ET, while the yield on the 30-year Treasury bond fell to 2.862 percent. Bond yields move inversely to prices.\nThe ECB is just the latest central bank to signal that it may reconsider its massive bond-buying program, a key stimulus plan enacted to assist markets after the financial crisis. The Bank of Japan made headlines Tuesday after tweaking its own bond purchases, renewing concerns that the globe's major banks may be curtailing stimulus too quickly.\nThe Federal Reserve just raised rates in December for the third and final time in 2017. While the U.S. central bank has indicated that it sees three rate hikes this year, markets appear to be expecting fewer hikes given lagging inflation.\nThe benchmark 2-year U.S. Treasury yield rose to its highest level since 2008 on Wednesday, after Bloomberg News reported that officials in Beijing had recommended that China's government lower — or even potentially cease — its buying of U.S. sovereign debt. The all-important 10-year yield hit its highest level since March on Tuesday.\nThe Treasury Department auctioned $12 billion in 30-year bonds at a high yield of 2.867 percent. The bid-to-cover ratio, an indicator of demand, was 2.74. Indirect bidders, which include major central banks, were awarded 71.5 percent. Direct bidders, which includes domestic money managers, bought 7.3 percent.\nThe 10-year yield has \"really already broken out. The 2.42 [percent] level was important to me and we've already seen a decisive move above that,\" said Katie Stockton, chief technical strategist at BTIG. \"Now we contend with the highs around 2.64 [percent] and above that you're talking about this multi-decade downtrend channel being challenge. That would be a major move.\"\nYields have been steadily rising since Republican lawmakers proposed tax cut legislation last fall, a plan many economists think will balloon debt further. China may be concerned about the effect the GOP plan will have on the national debt, with the Tax Cuts and Jobs Act expected to add more than $100 billion per year to the deficit according to the Congressional Budget Office.\nSymbol Yield Change %Change US 3-MO --- US 1-YR --- US 2-YR --- US 5-YR --- US 10-YR --- US 30-YR --- China remains the world's largest holder of international debt, with foreign-exchange reserves hitting $3.1 trillion in December.\nSince the report however, China's currency regulator has announced that the country was diversifying its foreign exchange reserves and disputed the media report on U.S. bonds, according to Reuters.\nTreasurys briefly pared some of their losses Thursday after the Labor Department reported that U.S. producer prices fell for the first time in nearly 1.5 years. The government said its producer price index (PPI) dropped 0.1 percent in December, while its so-called core PPI (which excludes food, energy, and trade services) edged up 0.1 percent.\nThough the PPI's correlation with consumer prices has recently weakened, the anemic number could nonetheless moderate inflation expectations.\nThe closely-watched gap between the yields on the 10-year Treasury and the 2-year Treasury has been widening in recent days, bucking the trend of the last year and providing buoyancy for bank stocks. The so-called yield climbed curve climbed to 0.58 percentage point from a low around 0.5 percentage point earlier this month.\nBank stocks tend to outperform when the spread widens given that they lend in the long term and borrow in the short term.\nLooking to the U.S. Federal Reserve, New York Fed President William Dudley is expected to appear at SIFMA's \"U.S. economic outlook: What's in store for 2018\" event in New York.", "external_links": [], "published": "2018-01-11T13:25:00.000+02:00", "crawled": "2018-01-11T14:47:24.055+02:00", "highlightTitle": ""}