{"organizations": [], "uuid": "816047b2fe263aa019e802ab01f38cf4110ac0c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 78, "shares": 78, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-turkey-denial/turkey-says-u-s-denial-of-syrian-border-force-plan-important-idUSKBN1F70VN", "country": "US", "domain_rank": 408, "title": "Turkey says U.S. denial of Syrian border force plan 'important'", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T16:37:00.000+02:00", "replies_count": 0, "uuid": "816047b2fe263aa019e802ab01f38cf4110ac0c4"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-turkey-denial/turkey-says-u-s-denial-of-syrian-border-force-plan-important-idUSKBN1F70VN", "ord_in_thread": 0, "title": "Turkey says U.S. denial of Syrian border force plan 'important'", "locations": [], "entities": {"persons": [{"name": "tillerson", "sentiment": "none"}, {"name": "rex tillerson", "sentiment": "none"}, {"name": "abdulhamit gul", "sentiment": "none"}], "locations": [{"name": "turkey", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "ankara", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "ankara", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "ntv", "sentiment": "none"}, {"name": "pkk", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "kurdistan workers party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 8:37 AM / Updated 37 minutes ago Turkey seeks Russian approval for air campaign against Afrin Gulsen Solaker , Tuvan Gumrukcu 5 Min Read \nANKARA (Reuters) - Turkey dispatched its military chief to Moscow on Thursday, seeking approval for an air campaign in Syria’s Kurdish-controlled Afrin region, although Damascus warned it could shoot down any Turkish planes in its skies. \nTurkey’s foreign minister said the Moscow trip by Chief of Staff Hulusi Akar was part of talks with both Russia and Iran, the two main backers of Syrian President Bashar al-Assad, to allow Turkish planes to take part in an Afrin campaign. \nThe diplomacy was the strongest signal yet that Turkey plans direct military action against territory held by Kurdish militia, potentially opening a new front in Syria’s civil war. \nIt would mean confronting Kurds allied to the United States at a time when Turkey’s relations with Washington are reaching the breaking point. The U.S. State Department called on Turkey to focus on the fight against Islamic State militants and not take military action in Afrin. \n“We would call ... on the Turks to not take any actions of that sort,” State Department spokeswoman Heather Nauert told a briefing after being asked about apparent Turkish plans to attack Afrin. “We don’t want them to engage in violence but we want them to keep focused on ISIS.” \n“We will intervene in Afrin,” Foreign Minister Mevlut Cavusoglu told broadcaster CNN Turk, adding he did not expect Russia to oppose any operation there. “We are meeting the Russians and Iran on the use of air space.” \nTurkey has ratcheted up its threats to take military action in Afrin in the past week, in response to U.S. plans to support setting up a 30,000-strong force to guard areas held by Kurdish-led fighters in a large part of Syria east of Afrin. \nWashington has become closely allied with the Syrian Kurds, who served as the main U.S. proxies on the ground in battle with Islamic State militants over the past two years. That infuriates Ankara, which considers the Syrian Kurdish YPG militia to be a branch of the banned PKK movement that has fought a decades-old insurgency against the Turkish state. \nPresident Tayyip Erdogan called the new U.S.-backed border force a “terror army” on Turkey’s border and vowed to “strangle it before it’s even born”. \nThe issue is one of several that have disrupted relations between Washington and its biggest Muslim ally within NATO. The countries are also at odds over the U.S. refusal to extradite a cleric Turkey blames for a failed 2016 coup, and the U.S. prosecution of a Turkish banker for sanctions busting, in which testimony implicated top Turkish officials. \nIn recent days Turkey has deployed tanks near the border with Syria across from the Afrin region, and Erdogan says Turkey’s military has shelled Kurdish forces there. \nThroughout most of the nearly seven-year-old Syrian civil war, Turkey has been one of the strongest opponents of Assad, joining the United States in supporting rebels fighting to overthrow him. More recently, Turkey has been working with Assad’s backers Iran and Russia to reduce fighting between Assad and the rebels, while describing the Kurds as the main threat. \nCavusoglu said Akar would hold talks in Moscow with Russia’s armed forces chief to discuss Afrin, Idlib “and the future of Syria”. \nCavusoglu said Turkey needed to take into account the presence of a small number of Russian observers in Afrin. “When we carry out an intervention, we need to coordinate on this, it should not impact the Russian observers,” he said. \nCavusoglu said attacks were being targeted against Turkey from Afrin every day. The region of northern Syria controlled by Turkey-backed Syrian rebels was also being attacked, he said. \n“Our response to this is our legitimate right to retaliate. We told the United States this,” Cavusoglu said, adding that Turkey was not satisfied with U.S. attempts to allay its concern over U.S. support for the Kurdish-led border force. \nOn Wednesday, U.S. Secretary of State Rex Tillerson said he met Cavusoglu to clarify the issue, and said the situation had been “misportrayed, misdescribed”. \n“We voiced our discomfort in the meetings we held with the Secretary of Defence and the Secretary of State ... However, the United States’ statements did not fully satisfy us,” he said. \n“Our direct mistrust of the United States continues.” Additional reporting by Ece Toksabay and Arshad Mohammed; Writing by Dominic Evans and David Alexander; Editing by Peter Graff and James Dalgleish", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T16:37:00.000+02:00", "crawled": "2018-01-18T12:20:43.033+02:00", "highlightTitle": ""}