{"organizations": [], "uuid": "ba4b521600863da4378b9b0326071070469c9915", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220289325&w=1200&r=LYNXMPEE070YF", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-myanmar-journalists-letter/myanmar-journalists-ask-government-for-details-of-reuters-reporters-case-idUSKBN1EX1IO", "country": "US", "domain_rank": 408, "title": "Myanmar journalists ask government for details of Reuters reporters' case", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T16:57:00.000+02:00", "replies_count": 0, "uuid": "ba4b521600863da4378b9b0326071070469c9915"}, "author": "", "url": "https://www.reuters.com/article/us-myanmar-journalists-letter/myanmar-journalists-ask-government-for-details-of-reuters-reporters-case-idUSKBN1EX1IO", "ord_in_thread": 0, "title": "Myanmar journalists ask government for details of Reuters reporters' case", "locations": [], "entities": {"persons": [{"name": "reut", "sentiment": "negative"}, {"name": "kyaw soe oo", "sentiment": "none"}, {"name": "wa lone", "sentiment": "none"}], "locations": [{"name": "myanmar", "sentiment": "none"}, {"name": "naypyitaw", "sentiment": "none"}, {"name": "rakhine", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "min read  yangon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 2:58 PM / Updated 6 hours ago Myanmar journalists ask government for details of Reuters reporters' case Reuters Staff 4 Min Read \nYANGON (Reuters) - A group of Myanmar reporters asked the government on Monday for details about the arrest of two Reuters journalists last month, arguing that the case could have implications for the ability of journalists to do their jobs, two members of the group said. \nThe two Reuters journalists, Wa Lone, 31, and Kyaw Soe Oo, 27, are being investigated on suspicion of breaching the Official Secrets Act, a little-used law that has been on the books from the days of British colonial rule. \nThey had worked on Reuters coverage of a crisis in the western state of Rakhine, where an estimated 655,000 Rohingya Muslims have fled from a military crackdown that followed militant attacks on security forces. \nThe two are due to appear in court on Wednesday. It will be their second appearance in court and the prosecutor could request that charges are filed against them. \nTwelve reporters based in Myanmar’s capital, Naypyitaw, said they had made their request to the interior ministry for more information about the case in accordance with the media law. \n“The government hasn’t given a proper enough explanation to the country,” Nyan Hlaing Lynn, Naypyitaw bureau chief for the Frontier Myanmar magazine told Reuters. \n”We’re worried that this will set a bad example of what happens when someone gives information to the media.” CALLS FOR THEIR RELEASE \nThe two Reuters reporters were arrested on Dec. 12, after they were invited to meet police for dinner in Yangon. \nThe Ministry of Information has cited the police as saying the two journalists were “arrested for possessing important and secret government documents related to Rakhine State and security forces”. It said they had “illegally acquired information with the intention to share it with foreign media”. FILE PHOTO: Reuters journalist Kyaw Soe Oo, who is based in Myanmar, poses for a picture at the Reuters office in Yangon, Myanmar December 11, 2017. REUTERS/Antoni Slodkowski/File Photo \nGovernment officials from some of the world’s major nations, including the United States, Britain and Canada, as well as top U.N. officials, have called for the release of the journalists. \nReuters President and Editor-In-Chief Stephen J. Adler has called for the immediate release of the two. \n“As they near their hearing date, it remains entirely clear that they are innocent of any wrongdoing,” Adler said in a statement on Monday. \nAung Myo Min, reporter for the Mizzima magazine, said he and the others who wrote the letter were concerned about the implications for their work. \n“We hope they’ll give reasonable answers to our questions. We feel it could happen to us,” Aung Myo Min told Reuters. “This case is a threat to the security of us journalists.” \nThe 12 journalists had tried to present their written request to the Ministry of Home Affairs but officials there had told them to send it through the post, they said. They also published a copy online. \nAuthorities have blocked most media access to the north of Rakhine State, where Rohingya militant attacks on the security forces on Aug. 25 sparked the military crackdown. \nThe United Nations has condemned the Myanmar military campaign as ethnic cleansing. Buddhist-majority Myanmar has rejected that. \nThe U.S. and British embassies condemned on Monday a rare attack by the Arakan Rohingya Salvation Army insurgents on the Myanmar security forces last week in which several members of the armed forces were wounded. \n“This act of violence only serves to further undermine peace and security,” the U.S. embassy said. \nThe U.S. and British missions both called for all sides to work to ensure safe conditions for the refugees to return home. Reporting by Shoon Naing and Thu Thu Aung; Writing by Robert Birsel; Editing by Martin Howell", "external_links": [], "published": "2018-01-08T16:57:00.000+02:00", "crawled": "2018-01-08T17:03:53.020+02:00", "highlightTitle": ""}