{"organizations": [], "uuid": "6249968b83790a0be2a7b4eef4b3f8fa770058b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180121.html", "section_title": "Archive News &amp; Video for Sunday, 21 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/football-nfl-nep-jac-recap/patriots-rally-from-10-down-to-top-jags-and-win-afc-title-idUSMTZEE1LXI5EYK", "country": "US", "domain_rank": 408, "title": "Gotta hand it to them: Brady, Pats rally for another AFC title", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-22T07:31:00.000+02:00", "replies_count": 0, "uuid": "6249968b83790a0be2a7b4eef4b3f8fa770058b5"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/football-nfl-nep-jac-recap/patriots-rally-from-10-down-to-top-jags-and-win-afc-title-idUSMTZEE1LXI5EYK", "ord_in_thread": 0, "title": "Gotta hand it to them: Brady, Pats rally for another AFC title", "locations": [], "entities": {"persons": [{"name": "brady", "sentiment": "negative"}, {"name": "rex burkhead", "sentiment": "none"}, {"name": "tom brady", "sentiment": "none"}, {"name": "danny amendola", "sentiment": "none"}], "locations": [{"name": "foxborough", "sentiment": "none"}, {"name": "mass.", "sentiment": "none"}, {"name": "new england patri", "sentiment": "none"}, {"name": "gillette stadium", "sentiment": "none"}, {"name": "minneapolis", "sentiment": "none"}, {"name": "new england", "sentiment": "none"}, {"name": "u.s. bank stadium", "sentiment": "none"}], "organizations": [{"name": "pats", "sentiment": "negative"}, {"name": "jacksonville jaguars", "sentiment": "none"}, {"name": "jaguars", "sentiment": "none"}, {"name": "philadelphia eagles", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "EditorsNote: fixes “struck” in fifth graf\nFOXBOROUGH, Mass. -- There is no one the New England Patriots would rather have with the ball in his hands when a game is on the line than Tom Brady, even when his hands are battered and bruised.\nAlthough questionable for the Sunday game against the Jacksonville Jaguars due to a right hand injury, the ageless 40-year-old quarterback proved his mettle again while orchestrating yet another game-winning drive to send New England back to the Super Bowl.\nBrady’s 4-yard touchdown pass to Danny Amendola with 2:48 remaining put the Patriots ahead for good in a 24-20 victory against the Jaguars in the AFC Championship Game at Gillette Stadium.\nNew England will meet the Philadelphia Eagles in the Super Bowl at U.S. Bank Stadium in Minneapolis on Feb. 4.\nAll week long, Brady ducked questions from the media about his hand, which required stitches after he was hurt on the practice field Wednesday when he accidentally struck teammate Rex Burkhead’s helmet.\n“Well, I said, ‘We’ll see (if I play),'” Brady said while accepting the Lamar Hunt Trophy, awarded to the AFC champion, at midfield after the game. “So how’d it go?”\nFollowing the Patriots’ go-ahead score, Jacksonville faced a fourth-and-15 after driving to the New England 43-yard-line. However, Jaguars quarterback Blake Bortles’ deep toss down the sideline to Dede Westbrook was broken up by Stephon Gilmore.\n“We had a two-minute drive at the end of the game to win the AFC championship, so there’s not a whole lot more you can ask for than that,” a reflective Bortles said.\nAmendola finished with seven catches for 84 yards and two scores for the Patriots, who extended their own NFL record with an unprecedented 10th trip to the Super Bowl.\n“You cherish these moments and opportunities, and I know we’ve had quite a few of them, which we’ve been very blessed to do,” said Brady, who completed 26 of 38 passes for 290 yards and two TDs. “It’s just been an unbelievable run, and I think everyone should be really proud of what we accomplished.”\nLast year, New England erased a 28-3 Super Bowl deficit to beat the Atlanta Falcons 34-28 in overtime and claim their fifth championship.\n“This is what I dreamt about as a fan in the stands just like all of you, and now we have to go to Minnesota and finish the job,” Patriots owner Robert Kraft, who purchased the Patriots 24 years ago to the day Sunday, told the crowd during the trophy ceremony.\n“It’s just been a great year,” Brady added. “It’d be really great if we take care of business in a couple weeks, so we’ll see.”\nBortles threw for 293 yards (23 of 36) and a touchdown, and Leonard Fournette rushed for 76 yards and a touchdown on 24 carries to lead the Jaguars.\nJacksonville was playing in its third-ever AFC title game and its first since 1999.\n“(Our locker) room fully expected to win this game, and I think everybody is shocked, disappointed and upset,” Bortles said.\nJosh Lambo’s 54-yard field goal with 10:23 left in the third quarter and another from 43 yards seconds into the fourth bumped Jacksonville’s lead to 20-10.\nBrady led New England down the field quickly and hit Amendola for a 9-yard touchdown with 8:44 to go to bring the Pats within three.\nBortles marched the Jaguars down the field 76 yards and found a wide-open Marcedes Lewis for a 4-yard touchdown pass at 14:15 of the second quarter, making it 7-3.\nWith 7:06 to play in the quarter, Fournette’s 4-yard rushing score capped a 77-yard drive to extend Jacksonville’s lead to 14-3.\n“We were able to get the lead. Then we did not make enough plays to keep the lead. We had an opportunity at the end of the game to win it, and we did not do that,” Jaguars coach Doug Marrone said.\nRob Gronkowski’s 21-yard catch on the second play of ensuing drive moved him past Dallas Clark into first place on the NFL’s all-time postseason receiving yardage list for a tight end.\nMinutes later, Gronkowski left the game with a head injury after taking a helmet-to-helmet hit from Jaguars safety Barry Church at the Jacksonville 40-yard line with 1:23 remaining before halftime.\nAlthough Gronkowski was deemed questionable to return, he never did.\n“It’s hard when you lose such a critical part of your team and offense, and hopefully he’s OK,” Brady said of Gronkowski. “It was a tough shot he took, and he’s as tough as they come.”\nChurch was flagged for unnecessary roughness, helping to set up a 1-yard TD run by James White three plays later to bring the Patriots within four at the break.\nNew England led 3-0 after one quarter.\n--Field Level Media\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T07:31:00.000+02:00", "crawled": "2018-01-22T20:44:20.015+02:00", "highlightTitle": ""}