{"organizations": [], "uuid": "85dadd4296f680246e9e42b8bb95e6950450b125", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-jbs-usa-names-thomas-lopez-president-of-plumrose-usa.html", "country": "US", "domain_rank": 767, "title": "JBS USA Names Thomas Lopez President of Plumrose USA", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.101, "site_type": "news", "published": "2018-01-09T22:00:00.000+02:00", "replies_count": 0, "uuid": "85dadd4296f680246e9e42b8bb95e6950450b125"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-jbs-usa-names-thomas-lopez-president-of-plumrose-usa.html", "ord_in_thread": 0, "title": "JBS USA Names Thomas Lopez President of Plumrose USA", "locations": [], "entities": {"persons": [{"name": "thomas lopez", "sentiment": "negative"}, {"name": "lopez", "sentiment": "none"}, {"name": "heinz", "sentiment": "none"}], "locations": [{"name": "plumrose usa greeley", "sentiment": "none"}, {"name": "colo.", "sentiment": "none"}, {"name": "vt.", "sentiment": "none"}, {"name": "elkhart", "sentiment": "none"}, {"name": "iowa", "sentiment": "none"}, {"name": "swanton", "sentiment": "none"}, {"name": "tupelo", "sentiment": "none"}, {"name": "miss", "sentiment": "none"}, {"name": "miss.", "sentiment": "none"}, {"name": "ind.", "sentiment": "none"}, {"name": "booneville", "sentiment": "none"}, {"name": "south bend", "sentiment": "none"}, {"name": "plumrose usa", "sentiment": "none"}], "organizations": [{"name": "kraft", "sentiment": "negative"}, {"name": "jbs usa", "sentiment": "negative"}, {"name": "globe newswire", "sentiment": "negative"}, {"name": "u.s. army", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GREELEY, Colo., Jan. 09, 2018 (GLOBE NEWSWIRE) -- JBS USA has selected Thomas Lopez, a former Kraft-Heinz food executive with more than 18 years of industry experience and a captain in the U.S. Army, to lead its Plumrose USA, pork consumer ready business. Lopez will lead the company’s strategy, growth and development, including direct oversight of its operations.\nPlumrose USA is a well-known and highly-regarded producer of branded and prepared foods, including bacon, lunch meats, sliced deli meats, canned hams and cooked ribs. The Plumrose USA business is comprised of five prepared foods facilities, including one in Elkhart, Ind., two in Council Bluffs, Iowa, one in Booneville, Miss., and one in Swanton, Vt., and two distribution centers in South Bend, Ind., and Tupelo, Miss.\nThe appointment of Lopez as president of Plumrose USA is a continuation of JBS USA’s strategy to build a team of world-class executives that will grow and strengthen our position as a leading global food company with recognized products and brands enjoyed by consumers around the world.\n“It is an honor to join the JBS USA team and serve alongside some of the most respected leaders in food and agriculture,” Lopez said. “Over the last decade, JBS USA has successfully led the turnaround and integration of iconic food brands and companies such as Swift ® , Pilgrim’s ® , Moyer ® and Packerland ® . I look forward to contributing to the Plumrose USA team as we position the business for brand expansion and innovation to meet the evolving needs of today’s consumer.”\nLopez previously held several senior positions at Kraft Foods and the Kraft-Heinz Food Company, most recently as President of Beverages and Snacks Division. He has been responsible for the transformation and portfolio strategies for some of Kraft’s most distinctive brands. During his career at Kraft and Kraft-Heinz, Lopez’s tenacity and leadership skills allowed him to swiftly rise in the organization from an Associate Brand Manager in 1999, to Senior Marketing Director in 2009, Vice President of Marketing of Refrigerated Meats in 2012, Vice President of U.S. Growth Channels in 2014, President of Meals and Desserts in 2015, and finally, President of Beverages and Snacks.\n“Tom brings a wealth of experience in leveraging consumer marketing practices to deliver strong brand performance,” said Andre Nogueira, JBS USA chief executive officer. “During his public service in the military and throughout his professional career, Tom has demonstrated the unique ability to lead and engage teams to produce outstanding results. His extensive experience in building consumer brands, leading turnaround efforts, accelerating top- and bottom-line growth, and managing sales, marketing, R&D and operations, will be an incredible asset for the Plumrose USA team. We are excited to add such a well-respected and accomplished executive to our team.”\nA native of Kewanee, Ill., Lopez holds a Bachelor of Science degree in Engineering Management from the U.S. Military Academy at West Point and Master of Science degree in Engineering Management from the University of Missouri at Rolla.\nAbout JBS USA\nJBS ® USA is a leading processor of beef, pork and lamb in the U.S., a leading processor of beef in Canada and a majority shareholder of Pilgrim's Pride Corporation, the largest poultry company in North America, with operations in the U.S., Mexico, the U.K., Ireland and continental Europe. JBS USA also enjoys a strategic relationship with JBS Australia, the leading processor of beef, lamb and smallgoods in Australia.\nHeadquartered in Greeley, Colo., JBS ® USA processes, prepares, packages and delivers fresh, further-processed and value-added beef, pork, lamb and poultry products for sale to customers in more than 105 countries on six continents. The company employs more than 100,000 team members and operates more than 120 facilities in the United States, Australia, Canada, Puerto Rico, Mexico, the U.K. and Europe.\nContact:\nCameron Bruett\nJBS USA\nCorporate Affairs\n+1 202.445.6168\ncameron.bruett@jbssa.com\nSource:JBS USA, LLC", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/7676dae1-a210-4c41-a757-5a58faa2c45a", "https://www.globenewswire.com/Tracker?data=SaB9naMuDw6IFPv5x02PQr2ZFng4rPfmqJraUnswZYO6IWCWQhw4aTliVTIQLhfNYOc_sql5AuM-jP3er12qRaky-yBo9eaGJV59W_G6Brg="], "published": "2018-01-09T22:00:00.000+02:00", "crawled": "2018-01-09T23:33:47.038+02:00", "highlightTitle": ""}