{"organizations": [], "uuid": "7a24e08b4bf1881e130ae30274da30a6de177896", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/technologyNews/", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-vickersventure-fund/singapores-vickers-venture-targets-500-million-fund-late-2018-eyes-biotech-nanotech-ai-idUSKBN1ET0Y9", "country": "US", "domain_rank": 408, "title": "Singapore's Vickers Venture targets $500 million fund late-2018, eyes biotech, nanotech, AI", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T11:41:00.000+02:00", "replies_count": 0, "uuid": "7a24e08b4bf1881e130ae30274da30a6de177896"}, "author": "", "url": "https://www.reuters.com/article/us-vickersventure-fund/singapores-vickers-venture-targets-500-million-fund-late-2018-eyes-biotech-nanotech-ai-idUSKBN1ET0Y9", "ord_in_thread": 0, "title": "Singapore's Vickers Venture targets $500 million fund late-2018, eyes biotech, nanotech, AI", "locations": [], "entities": {"persons": [{"name": "tan", "sentiment": "none"}, {"name": "liz lee", "sentiment": "none"}], "locations": [{"name": "singapore", "sentiment": "none"}, {"name": "southeast asia", "sentiment": "none"}], "organizations": [{"name": "vickers venture", "sentiment": "negative"}, {"name": "vickers", "sentiment": "none"}, {"name": "min read  kuala lumpur", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "vickers venture partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KUALA LUMPUR (Reuters) - Singapore-based Vickers Venture Partners is looking to raise its largest fund yet of up to $500 million later this year as it seeks to increase investment in biotechnology, nanotechnology and artificial intelligence (AI), said its chairman, Finian Tan.\nThe venture capital firm is already looking for investors to participate in its Fund VI, Tan said in an interview.\n“It’s not so soon (but) we are soft-marketing right now, looking for anchor investors for our new fund,” he told Reuters.\nAt $500 million, Fund VI will be one of the largest venture capital funds to be raised in Southeast Asia.\nSingapore-based venture capital firms, which benefit from government incentives, have enjoyed robust fundraising in 2017. Fundraising in the island city has attracted foreign investors ranging from family offices to corporate backers who want a finger in the technology investment space.\nVickers adopts a largely non-thematic strategy globally but is keen to ride on the growth it sees in biotechnology, nanotechnology and AI, Tan said.\n“In these three megatrends, if you follow them and invest in them, the growth will be exponential,” he said.\nThe firm closed its fifth fund of $230 million in October. Of that, it has committed to about $130 million in deals and expects another $20 million worth to be closed soon.\n“We still have some reserves for follow-on investments, and we probably have space for perhaps another seven new deals,” he said.\nBiotechnology is the best-performing sector in Vickers’ portfolio, achieving a multiple of more than 10 times for the firm, Tan said, due largely to an investment five years ago in San Diego-based regenerative medicine technology company Samumed LLC, a unicorn startup valued at $12 billion.\nThe current average valuation multiple across its first four funds is 5.8 times, with a net internal rate of return of 37 percent.\n“All our life science investments are in the U.S. and U.K. currently, but we plan to invest more in Asia,” he said.\nTan’s investment track record includes China’s Baidu Inc ( BIDU.O ) five years before it went public - a deal he entered as then-head of Asia at DFJ Eplanet Ventures, and which has since become the one he is most recognized for. The investment made DFJ Eplatnet Ventures the largest shareholder of Baidu when the search engine provider listed.\nReporting by Liz Lee; Editing by Christopher Cushing\n ", "external_links": [], "published": "2018-01-04T11:41:00.000+02:00", "crawled": "2018-01-04T11:51:00.047+02:00", "highlightTitle": ""}