{"organizations": [], "uuid": "bac51039143b0bfef0e5b33475f02d6df1400d76", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-change-healthcare-acquires-national-decision-support-company.html", "country": "US", "domain_rank": 767, "title": "Change Healthcare Acquires National Decision Support Company", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.074, "site_type": "news", "published": "2018-01-18T17:03:00.000+02:00", "replies_count": 0, "uuid": "bac51039143b0bfef0e5b33475f02d6df1400d76"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-change-healthcare-acquires-national-decision-support-company.html", "ord_in_thread": 0, "title": "Change Healthcare Acquires National Decision Support Company", "locations": [], "entities": {"persons": [{"name": "neil de crescenzo", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "newton", "sentiment": "none"}], "organizations": [{"name": "change healthcare acquires national decision support company", "sentiment": "negative"}, {"name": "today change healthcare", "sentiment": "negative"}, {"name": "ndsc", "sentiment": "none"}, {"name": "decision support company", "sentiment": "none"}, {"name": "change healthcare", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEWTON, Mass., Jan. 18, 2018 /PRNewswire/ -- Today Change Healthcare announced the acquisition of National Decision Support Company (NDSC), a leader in cloud-based solutions that deliver medical guidelines to the point of care through leading electronic health record (EHR) systems. The addition of NDSC accelerates the efforts of Change Healthcare to leverage evidence-based clinical information and next-generation technologies to reduce cost and help ensure appropriate care.\n\"We are singularly focused on helping customers address the big challenges in healthcare—achieving better outcomes, reducing costs, and creating an interconnected healthcare ecosystem. With NDSC, we've added strategic capabilities to accelerate our product roadmap and increase the value we provide to healthcare stakeholders,\" said Neil de Crescenzo, president and chief executive officer (CEO), Change Healthcare. \"NDSC puts clinical intelligence in the hands of physicians and other clinicians as they are delivering care. With ready access to medical guidelines, clinicians can make decisions that lead to better patient outcomes, improve efficiency, and optimize care paths based on world-class clinical expertise.\"\nNDSC's flagship offering, CareSelect™ Imaging, delivers evidence-based guidelines through an exclusive digital distribution license with the American College of Radiology, and is positioned to help customers meet the federal mandate requiring that clinicians consult Appropriate Use Criteria (AUC) for imaging. NDSC's current portfolio also includes CareSelect Choosing Wisely®, founded on the American Board of Internal Medicine's highly-regarded Choosing Wisely Initiative, and CareSelect Lab, based on a partnership with the Mayo Clinic. With a rapidly growing customer base of over 500 provider organizations today, NDSC is a proven technology platform for the delivery of guidance at the point of order.\nNDSC and the Change Healthcare InterQual ® team have used the NDSC platform to deliver industry-leading clinical criteria to the point of care, leveraging real-time access to clinical data. The goal of this relationship is to streamline utilization management and authorization processes, which today are labor-intensive, redundant, and expensive.\n\"We have forged a strong and complementary working relationship across our teams with a special, rarely attained energy,\" said Michael Mardini, CEO, NDSC, who will continue leading the NDSC team within Change Healthcare as part of the company's decision support portfolio. \"We share a vision and passion for improving care delivery through innovative technology and common-sense process improvements. This strategic and cultural fit will accelerate the success of our combined organizations, and it expands our ability to deliver solutions that improve patient care and decrease cost across the payer and provider ecosystem.\"\nThe NDSC team will continue to operate from its offices in Madison, Wis. The NDSC acquisition also accelerates the expansion of Change Healthcare's operations in Madison through the planned addition of other company operations there.\nAbout Change Healthcare\nChange Healthcare is inspiring a better healthcare system. Working alongside our customers and partners, we leverage our software and analytics, network solutions, and technology-enabled services to enable better patient care, choice, and outcomes at scale. As a key catalyst of a value-based healthcare system, we are accelerating the journey toward improved lives and healthier communities. Learn more at www.changehealthcare.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/change-healthcare-acquires-national-decision-support-company-300584583.html\nSOURCE Change Healthcare", "external_links": ["http://www.changehealthcare.com/", "http://www.prnewswire.com/news-releases/change-healthcare-acquires-national-decision-support-company-300584583.html"], "published": "2018-01-18T17:03:00.000+02:00", "crawled": "2018-01-18T20:09:13.004+02:00", "highlightTitle": ""}