{"organizations": [], "uuid": "0817592d50c9c37d3a9c3a7869b8c17b21baca34", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226510768&w=1200&r=LYNXMPEE0T09V", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-usa-russia-sanctions-list/russian-bank-ceos-metals-magnates-and-gas-chief-named-on-u-s-oligarchs-list-idUKKBN1FJ0KF", "country": "US", "domain_rank": 408, "title": "Russian bank CEOs, metals magnates and gas chief named on U.S. \"oligarchs' list\"", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T08:32:00.000+02:00", "replies_count": 0, "uuid": "0817592d50c9c37d3a9c3a7869b8c17b21baca34"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-russia-sanctions-list/russian-bank-ceos-metals-magnates-and-gas-chief-named-on-u-s-oligarchs-list-idUKKBN1FJ0KF", "ord_in_thread": 0, "title": "Russian bank CEOs, metals magnates and gas chief named on U.S. \"oligarchs' list\"", "locations": [], "entities": {"persons": [{"name": "polina devitt", "sentiment": "none"}, {"name": "vladimir putin", "sentiment": "none"}, {"name": "putin", "sentiment": "none"}, {"name": "christian lowe", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "crimea", "sentiment": "none"}, {"name": "ukraine", "sentiment": "none"}, {"name": "kremlin", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "treasury department", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. treasury department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 09 AM / Updated 36 minutes ago Russia's elite dismiss U.S. list as 'telephone book' of the wealthy Polina Devitt , Katya Golubkova 6 Min Read \nMOSCOW (Reuters) - Russia’s elite on Tuesday shrugged off U.S. publication of a sweeping list of oligarchs close to the Kremlin as simply a “telephone directory” of the rich, though a Kremlin spokesman said it could even harm the image of Russia’s political leaders. \nOne Western businessman said it could create uncertainty in dealings with sectors of Russian business. One Russian energy executive feared for future dealings with foreign banks. \nThe U.S. Treasury Department named top businessmen including the heads of the two of Russia’s biggest banks, metals magnates and the boss of the state gas monopoly on a list of oligarchs close to Russian power. \nThe list of 210 people, including 96 ‘oligarchs’ with wealth of $1 billion or more, was drawn up as part of a sanctions package signed into law in August last year. \nThe document said inclusion did not mean those named were likely to be sanctioned, although it seemed it would cast the shadow of potential sanctions over a wide circle of wealthy Russians. \n“Publication of such a wide list of everything and everyone could potentially damage the image and reputation of our firms, our businessmen, our politicians, and of members of the leadership,” Kremlin spokesman Dmitry Peskov, himself included on the list, told reporters. \nShares in some of the big metals companies - Norilsk Nickel ( GMKN.MM ) and aluminium giant Rusal ( 0486.HK ), whose owners were named - initally fell, though Russian stock in general recovered later. \nPresident Vladimir Putin’s inner circle is already subject to personal U.S. sanctions imposed over Russia’s 2014 annexation of Ukraine’s Crimea region. \nThe White House said on Monday it would not immediately impose new sanctions on Russia. \n“All this looks more like a book, ‘Who’s Who in Russian Politics’. I as a member of the government am obliged to be on this list,” Deputy Prime Minister Arkady Dvorkovich, one of 114 government officials named, told Reuters. THE LIST \nThe 2017 sanctions package leading to the list being drawn up was prompted partly by Washington’s belief that Russia meddled in the 2016 U.S. presidential election. The Kremlin denies these allegations. \nThe list reached deep into the business elite and government. \nOfficials and others named said it amounted to little more than a copy of last year’s Forbes list of Russia’s wealthiest people - with some factual mistakes thrown in. \n“It seems no-one decided to look too deeply. They just copied Forbes list,” said one oligarch whose name is on the list but who had distanced himself from Russian investments and Putin’s inner circle. Slideshow (3 Images) \nLast year’s list in Forbes magazine estimated the total wealth of the oligarchs listed at almost $400 billion. \nA senior executive on a major energy company described it as a “telephone directory”, adding sarcastically: “This was really Titanic work.” \nThe list also mentions Oleg Budargin as the chief executive of the state utility company Rosseti - though he was replaced in that post last September. \n“UNCERTAINTY” CREATED \nA Western banker who is currently involved in a deal with a person named on the list said it was unclear what inclusion meant. “If all these people were banned, 80 percent of deals (with Russian firms) would stall,” he said. \nAnother banker who works for a U.S. bank in Moscow described the list as ‘harmful.’“It creates uncertainty around all more or less known people. Even without sanctions,” he said. \nAnother state energy executive said he believed inclusion could complicate dealings with the foreign banks and raising financing for the companies whose owners were named. \nThe list was sweeping though some names of people known to be closely associated with Putin were absent. \nSome Putin loyalists suggested that being named amounted to a badge of honour - while being left off was cause for suspicion. Prime Minister Dmitry Medvedev, who was named, said being left off was “a basis for considering resignation”. \nAnother U.S. report outlining potential restrictions on investment by foreigners in Russian government debt was not published on Tuesday as many had expected. \nThe rouble opened down 0.1 percent against the dollar on Tuesday. Shares in some big companies fell, although Russian stocks and the rouble later edged higher overall. \nRepresentatives for Vladimir Potanin, co-owner of Norilsk Nickel, and Oleg Deripaska of Rusal who were both named declined comment. Others including metals magnate Alisher Usmanov, part-owner of London’s Arsenal soccer club, and Alexei Mordashov, co-owner of Severstal ( CHMF.MM ), also declined to comment. \nGerman Gref, CEO of Sberbank, Russia’s biggest lender, and Andrey Kostin, chief executive of No. 2 bank VTB - both of which are state-controlled - were also on the list. \nSberbank declined to comment. VTB did not respond to a request for comment. Kostin told Reuters in an interview last week that he was not afraid of being on the list. \nAlexei Miller, CEO of state-controlled gas export monopoly Gazprom ( GAZP.MM ), was named, as was Leonid Mikhelson, co-owner of private gas producer Novatek ( NVTK.MM ). \nEugene Kaspersky, CEO of the Moscow-based cyber security company that carries his name, were also listed. Related Coverage", "external_links": [], "published": "2018-01-30T08:32:00.000+02:00", "crawled": "2018-01-30T08:44:22.024+02:00", "highlightTitle": ""}