{"organizations": [], "uuid": "7d58c8e260eeb48ed51fc9531ef10044906c4ade", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/11", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-altercare-to-welcome-ohio-based-greystone-healthcare-management-facilities-to-its-family-of-skilled-nursing-care-centers.html", "country": "US", "domain_rank": 767, "title": "Altercare to welcome Ohio-based Greystone Healthcare Management facilities to its family of skilled nursing care centers", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.331, "site_type": "news", "published": "2018-01-25T21:34:00.000+02:00", "replies_count": 0, "uuid": "7d58c8e260eeb48ed51fc9531ef10044906c4ade"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-altercare-to-welcome-ohio-based-greystone-healthcare-management-facilities-to-its-family-of-skilled-nursing-care-centers.html", "ord_in_thread": 0, "title": "Altercare to welcome Ohio-based Greystone Healthcare Management facilities to its family of skilled nursing care centers", "locations": [], "entities": {"persons": [{"name": "altercar", "sentiment": "negative"}, {"name": "alte", "sentiment": "none"}, {"name": "schroer", "sentiment": "none"}, {"name": "connie bessler", "sentiment": "none"}], "locations": [{"name": "north canton", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "coshocton", "sentiment": "none"}, {"name": "adena", "sentiment": "none"}, {"name": "newark", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}, {"name": "somerset", "sentiment": "none"}, {"name": "zanesville", "sentiment": "none"}, {"name": "thornville", "sentiment": "none"}], "organizations": [{"name": "greystone healthcare management", "sentiment": "negative"}, {"name": "altercare integrated health services", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NORTH CANTON, Ohio, Jan. 25, 2018 (GLOBE NEWSWIRE) -- Altercare Integrated Health Services (Altercare) has entered into an agreement to acquire the operations of six Ohio-based centers managed by Greystone Healthcare Management, with a proposed effective date of February 1, 2018, with the addition of two remaining facilities to follow in the next several months. The center locations include those in Adena, Cambridge, Coshocton, Newark, Somerset, Thornville, and Zanesville, and represent an additional 541 licensed beds for Altercare. The parties are actively working to close on the proposed transfer of operations.\n“Enhancing the quality of life for patients and residents is our mission which is why we aligned our efforts with Altercare,” said Connie Bessler, president and CEO, Greystone Healthcare Management. “Altercare is a highly-respected provider of rehabilitation, nursing and residential services, and we felt their oversite would best benefit our employees and residents. Altercare’s vast resources and strong presence in Ohio is a positive for all.”\nThe Schroer family founded Altercare in Northeast Ohio in 1973 and since then have embraced each community’s unique needs to serve those requiring skilled nursing care and rehabilitation services. “Altercare welcomes our new colleagues as we continue the mission of our founding family. We are fortunate to work together with our new teams and centers,” says Gregory Colaner, Altercare President. “We are honored by the opportunity to provide an enriching lifestyle balanced with supportive, expert care and services to residents and employees in our new communities.”\nAltercare centers are nationally recognized for quality care: centers have earned the ACHA Gold award for excellence in care, the Centers for Medicare and Medicaid 5-Star Quality Rating, and the U.S. News & World Report America’s Best Nursing Homes recognition. Altercare is also recognized among the NorthCoast 99 Best Places to Work.\nAbout Altercare Integrated Health Services\nAltercare Integrated Health Services is a family-owned company operating 21 nursing care and rehabilitation centers in Ohio and Michigan. Altercare facilities are dedicated to patient-focused nursing and rehabilitation services. Innovative care programming and employee education are a priority at all Altercare facilities. Altercare provides a full continuum of services including post-hospital transitional care, skilled nursing, physical, occupational and speech therapies, Alzheimer’s and related dementia programming and assisted living & independent living in specific locations. The objective of these caring services is to enable patients to successfully transition through our healing pathway.\nAbout Greystone Healthcare Management\nGreystone Healthcare Management Corp., headquartered in Tampa, Fla., manages a healthcare network comprised of skilled nursing and assisted living communities, outpatient rehabilitation, and home health and private duty services. Greystone centers are recognized for quality care having earned bronze, silver and gold AHCA awards, CMS quality star ratings, and Best Nursing Home recognition from US News & World Report. With locations throughout Florida, Greystone is committed to providing only the highest quality customer service and patient care. Named a Top Workplace in Tampa Bay for the eighth year in 2018, Greystone Healthcare Management was also selected as an exceptional workplace by Provider Magazine and US News & World Report.\nMedia Contact:\nSuzanne Santangelo\nGreystone Healthcare Management\n813-853-2227\nsuzanne.santangelo@greystonehealth.com\nLisa Werstler\nAltercare Integrated Health Services\n330-417-2489\nlwerstler@altercareonline.net\nSource: Greystone", "external_links": ["https://www.globenewswire.com/Tracker?data=5tGj1YuQIARxAJkrue6r_kw8ZVj_KmTqmTEUNt4NvZTIm7BrUETqPv6FR3FzxQtEOQVejtfaSneBLIXWpaanpQgfIjzqsOlyvdaa9OWI6Wl-d_tCGw4WnASzPx4WVWyo", "https://www.globenewswire.com/NewsRoom/AttachmentNg/4fa17cfe-a9c7-4b64-bd41-5acebc384de5/en", "https://www.globenewswire.com/Tracker?data=9ITUJNXK0piAJ1JZpceNQhTXamru4pxXTtdkPeERIIuUD-9VG2ljRpDr_fZPdYjEE2JmGz-faJ6yIYkGuLdFnNwvMMwfCBF8ljU-hMrc9S9cC4L8t0wtC1zUiD3URYY7Y5BlYR4BZYX6U9FakUMg5A==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/3651692f-32f8-4898-a85e-4b73ea47bc2b/en"], "published": "2018-01-25T21:34:00.000+02:00", "crawled": "2018-01-26T02:01:09.007+02:00", "highlightTitle": ""}