{"organizations": [], "uuid": "7213ef0444f25e0e40fc1dac0d084fd185d766aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222955033&w=1200&r=LYNXMPEE0H0ES", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-tennis-ausopen-djokovic/djokovic-survives-melbourne-furnace-to-beat-monfils-idUSKBN1F70Q1", "country": "US", "domain_rank": 408, "title": "Djokovic survives Melbourne furnace to beat Monfils", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T09:28:00.000+02:00", "replies_count": 0, "uuid": "7213ef0444f25e0e40fc1dac0d084fd185d766aa"}, "author": "", "url": "https://www.reuters.com/article/us-tennis-ausopen-djokovic/djokovic-survives-melbourne-furnace-to-beat-monfils-idUSKBN1F70Q1", "ord_in_thread": 0, "title": "Djokovic survives Melbourne furnace to beat Monfils", "locations": [], "entities": {"persons": [{"name": "monfils reuter", "sentiment": "negative"}, {"name": "djokovic", "sentiment": "negative"}, {"name": "monfils", "sentiment": "none"}, {"name": "gael monfils", "sentiment": "none"}, {"name": "novak djokovic", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "rod laver arena", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 7:29 AM / in 6 hours Djokovic survives Melbourne furnace to beat Monfils Martyn Herman 4 Min Read \nMELBOURNE (Reuters) - Six-times champion Novak Djokovic emerged from the Rod Laver Arena furnace and into the third round of the Australian Open after putting suffering Gael Monfils out of his misery with a scrappy victory on Thursday. \nBoth men struggled physically as air temperatures peaked at 39.9 degrees Celsius with reports of 69 degrees being measured down on the court surface. \nBut 12-times grand slam champion Djokovic, playing his first tournament for six months because of an elbow problem, was the more durable as he recovered from a woeful start to claim a 4-6 6-3 6-1 6-3 win and take his record over Monfils to 15-0. \nThe 14th seeded Serb will play Spain’s Albert Ramos-Vinolas in the third round. \n“It was brutal,” Djokovic who wore a compression sleeve and employed a truncated service action, said. \n”I thought, it is going to be a big challenge for both of us. Gael is one of the best athletes in our sport. \n“It was about just hanging in there.” \nMonfils looked in danger of keeling over from the middle of the second set and throughout the third -- pleading with the match umpire to give them more than 25 seconds between points. \n“I was dying on the court for 40 minutes,” the 31-year-old told reporters later after having revived in a cold tub. \n”It was really warm. It was tough to breathe. I think it was the hardest (conditions) I have played in. \n“I tried to cool down. But even with the ice towel, the water, I think my body was super warm.” Tennis - Australian Open - Rod Laver Arena, Melbourne, Australia, January 18, 2018. Novak Djokovic of Serbia embraces Gael Monfils of France after Djokovic won their match. REUTERS/Thomas Peter \nDjokovic was rumored to have requested to play his match in the middle of the afternoon, despite the predicted heatwave. \nBut if it was supposed to earn him an advantage that plan quickly unraveled as he opened the match with two double faults and lost his first two service games. \nHe then broke back twice to level the set. Slideshow (8 Images) \n“They should put this in the washing machine and start again,” Channel Seven commentator Jim Courier, twice an Australian Open champion, said on air about the scrappy nature of the opening exchanges. \nIt did improve but Djokovic, with coach Andre Agassi watching on, dropped serve again 3-3. \nThe former world number one wasted two chances to break back as Monfils served at 5-4 and was powerless to stop the elastic-limbed Frenchman taking the opening set with a volley after running Djokovic ragged. \nMonfils hung in for the first seven games of the second set but was clearly in distress -- seeking out the shade behind the baselines to catch his breath between points. Related Coverage", "external_links": [], "published": "2018-01-18T09:28:00.000+02:00", "crawled": "2018-01-18T09:46:40.002+02:00", "highlightTitle": ""}