{"organizations": [], "uuid": "917d9b15ff050c394c8f9e6dd9284b10846a4f4a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/business-wire-astronova-announces-the-appointment-of-david-s-smith-as-chief-financial-officer.html", "country": "US", "domain_rank": 767, "title": "AstroNova Announces the Appointment of David S. Smith as Chief Financial Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T16:30:00.000+02:00", "replies_count": 0, "uuid": "917d9b15ff050c394c8f9e6dd9284b10846a4f4a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/business-wire-astronova-announces-the-appointment-of-david-s-smith-as-chief-financial-officer.html", "ord_in_thread": 0, "title": "AstroNova Announces the Appointment of David S. Smith as Chief Financial Officer", "locations": [], "entities": {"persons": [{"name": "david s. smith", "sentiment": "negative"}, {"name": "smith", "sentiment": "none"}, {"name": "david", "sentiment": "none"}, {"name": "joseph p. o’connell", "sentiment": "none"}, {"name": "greg woods", "sentiment": "none"}], "locations": [{"name": "r.i.", "sentiment": "none"}, {"name": "warwick", "sentiment": "none"}], "organizations": [{"name": "company", "sentiment": "none"}, {"name": "business development", "sentiment": "none"}, {"name": "dover corporatio", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Senior Financial Executive Brings Strong Background in M&A, Strategy and Operational Excellence\nWEST WARWICK, R.I.--(BUSINESS WIRE)-- AstroNova, Inc. (NASDAQ: ALOT), a global leader in data visualization technologies, today announced that its Board of Directors has elected David S. Smith as Vice President, Treasurer and Chief Financial Officer (CFO), effective January 22, 2018. Joseph P. O’Connell, the Company’s Interim CFO since August 2017, will return to his position as Vice President, Business Development and assist Mr. Smith through the filing of the Company's annual report.\n“David brings a valuable blend of financial acumen and operational skill to AstroNova,” said Greg Woods, the Company’s President and Chief Executive Officer. “He is a proven leader whose financial experience with diverse, global businesses, strong operations background and M&A expertise are a great fit with our long-term growth strategy.”\nDuring his more than 25 years of financial leadership experience at public manufacturing companies, Mr. Smith has served as CFO for multinational companies Dover Corporation and Crane Co. From 2005 to 2008 he was Senior Vice President and CFO of semiconductor company Standard Microsystems Corporation. Most recently, Mr. Smith was a Managing Partner for S.C. Advisors LLC, his financial management consultancy based in Darien, CT. He received his Master's Degree in Business Administration from Wharton School, University of Pennsylvania and his Bachelor of Arts degree from Columbia College, Columbia University.\nMr. Smith’s responsibilities at AstroNova will include oversight of financial and information systems functions, including accounting, budgeting, strategic planning, risk management, tax, treasury and investor relations.\n“Under Greg’s leadership, AstroNova has effectively combined organic growth and strategic acquisitions to expand its reach to new customers and new markets worldwide,” Mr. Smith said. “I am delighted to join the strong customer-centric AstroNova team and welcome the opportunity to contribute my financial and operations experience to help drive continued success across all levels of the organization.”\nAbout AstroNova\nAstroNova, Inc. (NASDAQ: ALOT), a global leader in data visualization technologies, designs, manufactures, distributes and services a broad range of products that acquire, store, analyze and present data in multiple formats. The Product Identification segment offers a variety of hardware and software products and associated supplies that allow customers to mark, track and enhance the appearance of their products. The segment’s two business units are QuickLabel®, the industry leader in tabletop digital color label printing and TrojanLabel™, a leader in the light-production color label press and specialty printer markets. The Test and Measurement segment includes the Test & Measurement business unit, which offers a suite of products and services that acquire, record and analyze electronic signal data from local and networked sensors. The segment also includes the Aerospace business unit, which makes printers, networking hardware and related accessories. These products are used in the aircraft flight deck to print flight plans, navigation information and performance data and in the aircraft cabin to print maintenance data, receipts and passenger manifests. AstroNova is a member of the Russell Microcap® Index and the LD Micro Index (INDEXNYSEGIS: LDMICRO). Additional information is available by visiting www.astronovainc.com .\nForward-Looking Statements\nInformation included in this news release may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements are not statements of historical fact, but rather reflect the Company’s current expectations concerning future events and results. AstroNova generally uses the words “believes,” “expects,” “intends,” “plans,” “anticipates,” “likely,” “continues,” “may,” “will,” and similar expressions to identify forward-looking statements. Such forward-looking statements, including those concerning the Company’s expectations, involve risks, uncertainties and other factors, some of which are beyond the Company’s control, which may cause actual results, performance or achievements to be materially different from those expressed or implied by such forward-looking statements. Factors which could cause actual results to differ materially from those anticipated include, but are not limited to (a) general economic, financial and business conditions; (b) declining demand in the test and measurement markets, especially defense and aerospace; (c) competition in the specialty printer industry; (d) ability to develop market acceptance of the Company’s products and effective design of customer required features; (e) competition in the data acquisition industry; (f) the impact of changes in foreign currency exchange rates on the results of operations; (g) the ability to successfully integrate acquisitions and realize benefits from divestitures; (h) the business abilities and judgment of personnel and changes in business strategy; (i) the efficacy of research and development investments to develop new products; (j) the launching of significant new products which could result in unanticipated expenses; (k) bankruptcy or other financial problems at major suppliers or customers that could cause disruptions in the Company’s supply chain or difficulty in collecting amounts owed by such customers; and (l) other risks included in the Company’s Annual Report on Form 10-K for the fiscal year ended January 31, 2017 and subsequent filings AstroNova makes with the Securities and Exchange Commission. AstroNova assumes no obligation to update or revise any forward-looking statement, whether as a result of new information, future events or otherwise, except as required by law. The reader is cautioned not to unduly rely on such forward-looking statements when evaluating the information presented in this news release.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180117005732/en/\nSharon Merrill Associates\nScott Solomon, 617-542-5300\nSenior VP\nALOT@investorrelations.com\nSource: AstroNova, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180117005732/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.astronovainc.com&esheet=51744369&newsitemid=20180117005732&lan=en-US&anchor=www.astronovainc.com&index=1&md5=90d2e53fc4556337f1f41f5e6fb26333"], "published": "2018-01-17T16:30:00.000+02:00", "crawled": "2018-01-17T16:36:21.003+02:00", "highlightTitle": ""}