{"organizations": [], "uuid": "733a1b25aa8e64876df15e19e12415d55c010a54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180116.html", "section_title": "Archive News &amp; Video for Tuesday, 16 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/dairy-auction-results/update-1-global-dairy-prices-surge-as-new-zealand-production-wanes-idUSL3N1PB4ZJ", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Global dairy prices surge as New Zealand production wanes", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T05:11:00.000+02:00", "replies_count": 0, "uuid": "733a1b25aa8e64876df15e19e12415d55c010a54"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/dairy-auction-results/update-1-global-dairy-prices-surge-as-new-zealand-production-wanes-idUSL3N1PB4ZJ", "ord_in_thread": 0, "title": "UPDATE 1-Global dairy prices surge as New Zealand production wanes", "locations": [], "entities": {"persons": [{"name": "charlotte greenfield", "sentiment": "none"}], "locations": [{"name": "new zealand", "sentiment": "none"}, {"name": "wellington", "sentiment": "none"}], "organizations": [{"name": "fonterra", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Global dairy prices rise 4.9 pct * Biggest lift in more than a year * Crimped NZ production weighing on prices - analyst (Re-casts, adds analyst comment, market reaction) By Charlotte Greenfield WELLINGTON, Jan 17 (Reuters) - Global dairy prices surged in the second auction of the year as buyers anticipated sluggish supply from the world's largest milk exporter, New Zealand. The Global Dairy Trade Price Index climbed 4.9 percent - the largest gain in more than a year - with an average selling price of $3,310 per tonne, in the auction held early on Wednesday. The lift was largely on the back of the world's biggest dairy processor, Fonterra , slashing its New Zealand milk collection as the country struggles with unusually dry weather. The index had risen 2.2 pct at the previous sale, according to GDT Events, snapping a losing streak that had left farmers worried that they would receive a lower payout in 2018. Nevertheless, analysts cautioned the gains might ease off in coming months given global supply for some products remained strong. \"Poor milk production from NZ should be supporting prices for WMP (whole milk powder) ... as NZ is the key supplier,\" said Amy Castleton, analyst at AgriHQ. \"But global milk production is continuing to grow – notably that coming out of Europe and the U.S. – so plenty more SMP (skim milk powder), butter and cheese will make its way onto the global market in coming months.\" Whole milk powder jumped 5.1 percent at the latest auction, and skim milk powder also posted strong gains of 6.5 percent. Auction results can affect the New Zealand dollar as the dairy sector generates more than 7 percent of the nation's gross domestic product. Despite the stellar result, the currency slipped 0.34 percent overnight to $0.7273 as it consolidated after a rally in the past week. A total of 23,319 tonnes was sold at the latest auction, falling 8.2 percent from the previous one, the auction platform said on its website. A number of companies, including Dairy America and Murray Goulburn , use the platform to sell milk powder and other dairy products, with roughly half of buyers based in China as traders there seek to supplement flagging domestic milk supplies. The auctions are held twice a month, with the next one scheduled for Feb. 6. (Reporting by Charlotte Greenfield; Editing by Robin Pomeroy)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T05:11:00.000+02:00", "crawled": "2018-01-17T20:16:45.007+02:00", "highlightTitle": ""}