{"organizations": [], "uuid": "b89211302034bcf16e716b28cf65b40741fdd9fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/27/104864179-20150331-0014-1180.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/warren-buffett-on-the-failure-of-trickle-down-economics.html", "country": "US", "domain_rank": 767, "title": "Warren Buffett on the failure of 'trickle down' economics", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.219, "site_type": "news", "published": "2018-01-04T19:30:00.000+02:00", "replies_count": 0, "uuid": "b89211302034bcf16e716b28cf65b40741fdd9fe"}, "author": "Catherine Clifford", "url": "https://www.cnbc.com/2018/01/04/warren-buffett-on-the-failure-of-trickle-down-economics.html", "ord_in_thread": 0, "title": "Warren Buffett on the failure of 'trickle down' economics", "locations": [], "entities": {"persons": [{"name": "warren buffett", "sentiment": "negative"}, {"name": "buffett", "sentiment": "none"}], "locations": [{"name": "america", "sentiment": "none"}], "organizations": [{"name": "berkshire hathaway", "sentiment": "negative"}, {"name": "time magazine", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "David A. Grogan | CNBC SHARES \nWarren Buffett knows first hand the power of American capitalism. As the third richest person in the world , with a net worth of more than $86 billion , the octogenarian investor has personally benefited from it. \nAnd yet, in a piece penned for Time magazine , published Thursday, Buffett says there is a problem with that economic system, which made him a king: Many individuals suffer even as those at the top prosper wildly. \nHe points to the Forbes 400, which lists the wealthiest Americans. \"Between the first computation in 1982 and today, the wealth of the 400 increased 29-fold — from $93 billion to $2.7 trillion — while many millions of hardworking citizens remained stuck on an economic treadmill. During this period, the tsunami of wealth didn't trickle down. It surged upward.\" show chapters 11:50 AM ET Wed, 28 June 2017 | 01:04 \nAmerica's capitalist economy requires its winners not ignore the system's faults, says Buffett. \nThe market system has \"left many people hopelessly behind, particularly as it has become ever more specialized. These devastating side effects can be ameliorated: a rich family takes care of all its children, not just those with talents valued by the marketplace,\" writes Buffett. \nHe also notes that, in particular, those workers replaced by technological advancements will be left behind. \n\"This game of economic miracles is in its early innings. Americans will benefit from far more and better 'stuff' in the future. The challenge will be to have this bounty deliver a better life to the disrupted as well as to the disrupters,\" Buffett writes. \"And on this matter, many Americans are justifiably worried.\" show chapters 2:57 PM ET Tue, 17 Jan 2017 | 00:47 \nIn the long term, those technological advancements are a boon for the economy. But in the short term, they cause unemployment and anxiety for those who lose their jobs to automation and are left unemployed. To demonstrate his point, Buffett points to 1776, when the United States declared its independence, and the evolution of farming technology. \n\"Replicating those early days would require that 80% or so of today's workers be employed on farms simply to provide the food and cotton we need. So why does it take only 2% of today's workers to do this job? Give the credit to those who brought us tractors, planters, cotton gins, combines, fertilizer, irrigation and a host of other productivity improvements,\" writes Buffett. \n\"We know today that the staggering productivity gains in farming were a blessing. They freed nearly 80% of the nation's workforce to redeploy their efforts into new industries that have changed our way of life.\" \nIndeed, despite the warnings, Buffett is optimistic. \n\"In 1776, America set off to unleash human potential by combining market economics, the rule of law and equality of opportunity. This foundation was an act of genius that in only 241 years converted our original villages and prairies into $96 trillion of wealth,\" he says. show chapters 1:52 PM ET Tue, 27 June 2017 | 00:45 \n\"In the years of growth that certainly lie ahead, I have no doubt that America can both deliver riches to many and a decent life to all. We must not settle for less.\" \nThis is not the first time the billionaire investor has said as much. In June, he told PBS Newshour, that the problem with the economy was billionaires like him . He also touted the importance of building in protections for the most vulnerable and retraining those workers replaced by new technologies. \nAnd the billionaire's talk is not rhetoric. Buffett, along with billionaire buddy Bill Gates , co-founded The Giving Pledge , a commitment from billionaires to give away at least half of their wealth. \nSee also:", "external_links": [], "published": "2018-01-04T19:30:00.000+02:00", "crawled": "2018-01-04T19:31:05.005+02:00", "highlightTitle": ""}