{"organizations": [], "uuid": "7e27079b1260ef6a3a11d637f3089b233575c12a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-macatawa-bank-corporation-increases-quarterly-dividend.html", "country": "US", "domain_rank": 767, "title": "Macatawa Bank Corporation Increases Quarterly Dividend", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.184, "site_type": "news", "published": "2018-01-29T15:30:00.000+02:00", "replies_count": 0, "uuid": "7e27079b1260ef6a3a11d637f3089b233575c12a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-macatawa-bank-corporation-increases-quarterly-dividend.html", "ord_in_thread": 0, "title": "Macatawa Bank Corporation Increases Quarterly Dividend", "locations": [], "entities": {"persons": [{"name": "ronald l. haan", "sentiment": "none"}], "locations": [{"name": "holland", "sentiment": "none"}, {"name": "mich.", "sentiment": "none"}, {"name": "allegan", "sentiment": "none"}, {"name": "kent", "sentiment": "none"}, {"name": "ottawa", "sentiment": "none"}, {"name": "holland", "sentiment": "none"}], "organizations": [{"name": "macatawa bank corporation", "sentiment": "negative"}, {"name": "macatawa bank", "sentiment": "none"}, {"name": "macatawa bank headquartered", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOLLAND, Mich., Jan. 29, 2018 (GLOBE NEWSWIRE) --\nMacatawa Bank Corporation (Nasdaq:MCBC) (the \"Company\" or \"Macatawa\") today announced that its Board of Directors has declared a quarterly cash dividend of $0.06 per share on its common stock to be paid on February 28, 2018 to shareholders of record on February 13, 2018. This quarter’s dividend payment represents a 20% increase from the previous quarterly dividend rate of $0.05 per share.\n\"We are pleased to make another increase in the amount of the dividend payment to our shareholders,\" said Ronald L. Haan, President and CEO of the Company. \"The continued improvement in Company earnings performance and our strong capital position makes this increase possible.\"\nAbout Macatawa Bank\nHeadquartered in Holland, Mich., Macatawa Bank offers a full range of banking, retail and commercial lending, wealth management and ecommerce services to individuals, businesses and governmental entities from a network of 26 full-service branches located throughout communities in Kent, Ottawa and northern Allegan counties. The bank is recognized for its local management team and decision making, along with providing customers excellent service, a rewarding experience and superior financial products. Macatawa Bank has been recognized for the past seven consecutive years as “West Michigan’s 101 Best and Brightest Companies to Work For”. For more information, visit www.macatawabank.com .\nCAUTIONARY STATEMENT: This press release contains forward-looking statements that are based on management's current beliefs, expectations, assumptions, estimates, plans and intentions. Such statements are based upon current beliefs and expectations and involve substantial risks and uncertainties which could cause actual results to differ materially from those expressed or implied by such forward-looking statements. The declaration and payment of each future dividend to common shareholders will be considered by the Board of Directors in its discretion and will depend on a number of factors, including our financial condition, liquidity, profits and anticipated profitability. These statements are not guarantees of future performance and involve certain risks, uncertainties and assumptions (\"risk factors\") that are difficult to predict with regard to timing, extent, likelihood and degree of occurrence. Therefore, actual results and outcomes may materially differ from what may be expressed in or implied by such forward-looking statements. Macatawa Bank Corporation does not undertake to update forward-looking statements to reflect the impact of circumstances or events that may arise after the date of the forward-looking statements.\nRisk factors include, but are not limited to, the risk factors described in \"Item 1A - Risk Factors\" of our Annual Report on Form 10-K for the year ended December 31, 2016. These and other factors are representative of the risk factors that may emerge and could cause a difference between an ultimate actual outcome and a preceding forward-looking statement.\nContact: Jon Swets, CFO 616-494-7645\nSource:Macatawa Bank Corporation", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/22cfefc7-8e81-43a2-a16a-9ac0b109d961", "https://www.globenewswire.com/Tracker?data=cYlLfdgUdQp7Y15VGPXXqrcTrIXCvf39XOIke0oM-xu1kdb15lj0MQ885BO7w0mQU_C7tbzjMkT4PoEr3Y-EEzAQUhFWmd3KIHnmOIVt3oA="], "published": "2018-01-29T15:30:00.000+02:00", "crawled": "2018-01-29T16:37:58.003+02:00", "highlightTitle": ""}