{"organizations": [], "uuid": "1033654adccf783127bd6f6be8fb471497882ec9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/business-wire-kilroy-realty-announces-2017-tax-treatment-of-its-dividend-distributions.html", "country": "US", "domain_rank": 767, "title": "Kilroy Realty Announces 2017 Tax Treatment of Its Dividend Distributions", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.043, "site_type": "news", "published": "2018-01-19T00:08:00.000+02:00", "replies_count": 0, "uuid": "1033654adccf783127bd6f6be8fb471497882ec9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/business-wire-kilroy-realty-announces-2017-tax-treatment-of-its-dividend-distributions.html", "ord_in_thread": 0, "title": "Kilroy Realty Announces 2017 Tax Treatment of Its Dividend Distributions", "locations": [], "entities": {"persons": [], "locations": [{"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "kilroy realty corporation", "sentiment": "negative"}, {"name": "kilroy realty", "sentiment": "negative"}, {"name": "krc", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES--(BUSINESS WIRE)-- Kilroy Realty Corporation (NYSE: KRC) announced today the 2017 tax treatment of its dividend distributions. The company's total dividend distributions per share of common stock (CUSIP #49427F108) are to be classified for income tax purposes as follows:\nRecord\nDate\nPayable\nDate\nTotal\nDistribution\nper Share\nTotal\nDistribution\nAttributable\nto 2017\n2017\nTaxable\nOrdinary\nDividend\n2017\nTotal\nQualified\nDividend (1)\n2017\nTotal Capital\nGain\nDistribution\n2017\nUnrecaptured\nSection 1250\nGain (2)\n2017\nReturn of\nCapital\n12/30/2016 1/13/2017 $2.2750000 (3) $.6879937 $.4883784 $.0007854 $.0757891 $.0757891 $.1238262 3/31/2017 4/12/2017 .3750000 .3750000 .2661970 .0004281 .0413099 .0413099 .0674931 6/30/2017 7/12/2017 .4250000 .4250000 .3016900 .0004852 .0468178 .0468178 .0764922 9/29/2017 10/18/2017 .4250000 .4250000 .3016900 .0004852 .0468178 .0468178 .0764922 (1) Total Qualified Dividend is a subset of, and is included in, the Taxable Ordinary Dividend amount.\n(2) Unrecaptured Section 1250 Gain is a subset of, and is included in, the Total Capital Gain Distribution amount.\n(3) Amount consists of a $1.90 per share special distribution and a $0.375 per share regular quarterly distribution.\nThe $2.2750000 per share common stock distribution with a record date of December 30, 2016 consists of a $1.90 per share special distribution and a $0.375 per share regular quarterly distribution. The $1.90 per share special distribution is treated as paid in two tax years for income tax purposes: $1.5870063 is treated as paid on December 31, 2016 and $0.3129937 is treated as paid on January 13, 2017. The $0.375 per share regular quarterly distribution is considered a 2017 dividend distribution for income tax purposes.\nThe dividend distributions made to holders of record as of December 29, 2017 and paid on January 12, 2018 are considered 2018 dividend distributions for federal income tax purposes.\nThe company's total dividend distributions per share of Series G cumulative redeemable perpetual preferred stock (CUSIP #49427F702) are to be classified for income tax purposes as follows:\nRecord\nDate (1)\nPayable\nDate\nTotal\nDistribution\nper Share\n2017\nTaxable\nOrdinary\nDividend\n2017\nTotal\nQualified\nDividend (2)\n2017\nTotal Capital\nGain\nDistribution\n2017\nUnrecaptured\nSection 1250\nGain (3)\n2017\nReturn of\nCapital\n1/31/2017 2/15/2017 $.4296875 $.3719642 $.0005982 $.0577233 $.0577233 - (1) To the extent that the record date is on a Saturday, Sunday or New York Stock Exchange holiday, the effective record date shall be the immediately preceding business day.\n(2) Total Qualified Dividend is a subset of, and is included in, the Taxable Ordinary Dividend amount.\n(3) Unrecaptured Section 1250 Gain is a subset of, and is included in, the Total Capital Gain Distribution amount.\nThe company's total dividend distributions per share of Series H cumulative redeemable perpetual preferred stock (CUSIP #49427F801) are to be classified for income tax purposes as follows:\nRecord\nDate (1)\nPayable\nDate\nTotal\nDistribution\nper Share\n2017\nTaxable\nOrdinary\nDividend\n2017\nTotal\nQualified\nDividend (2)\n2017\nTotal Capital\nGain\nDistribution\n2017\nUnrecaptured\nSection 1250\nGain (3)\n2017\nReturn of\nCapital\n1/31/2017 2/15/2017 $.3984375 $.3449122 $.0005547 $.0535253 $.0535253 - 4/30/2017 5/15/2017 .3984375 .3449122 .0005547 .0535253 .0535253 - 7/31/2017 8/15/2017 .3984375 .3449122 .0005547 .0535253 .0535253 - (1) To the extent that the record date is on a Saturday, Sunday or New York Stock Exchange holiday, the effective record date shall be the immediately preceding business day.\n(2) Total Qualified Dividend is a subset of, and is included in, the Taxable Ordinary Dividend amount.\n(3) Unrecaptured Section 1250 Gain is a subset of, and is included in, the Total Capital Gain Distribution amount.\nStockholders are encouraged to consult with their tax advisors as to their specific tax treatment for Kilroy Realty Corporation common and preferred distributions.\nAbout Kilroy Realty Corporation. Kilroy Realty Corporation (KRC), a publicly traded real estate investment trust and member of the S&P MidCap 400 Index, is one of the West Coast’s premier landlords. The company has over 70 years of experience developing, acquiring and managing office and mixed-use real estate assets. The company provides physical work environments that foster creativity and productivity and serves a broad roster of dynamic, innovation-driven tenants, including technology, entertainment, digital media and health care companies.\nAt September 30, 2017, the company’s stabilized portfolio totaled approximately 13.7 million square feet of office space located in the coastal regions of Los Angeles, Orange County, San Diego, the San Francisco Bay Area and Greater Seattle and 200 residential units located in the Hollywood submarket of Los Angeles. In addition, KRC had four projects totaling approximately 1.8 million square feet of office space, 237 residential units and 96,000 square feet of retail space under construction.\nThe company has been recognized by GRESB as the North American leader in office sustainability for the last four years and is listed in the Dow Jones Sustainability World Index. At the end of the third quarter, the company’s stabilized portfolio was 55% LEED certified and 73% of eligible properties were ENERGY STAR certified. More information is available at http://www.kilroyrealty.com .\nForward-Looking Statements. This press release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Forward-looking statements are based on our current expectations, beliefs and assumptions, and are not guarantees of future performance. Forward-looking statements are inherently subject to uncertainties, risks, changes in circumstances, trends and factors that are difficult to predict, many of which are outside of our control. Accordingly, actual performance, results and events may vary materially from those indicated in the forward-looking statements, and you should not rely on the forward-looking statements as predictions of future performance, results or events. Numerous factors could cause actual future performance, results and events to differ materially from those indicated in the forward-looking statements, including, among others: global market and general economic conditions and their effect on our liquidity and financial conditions and those of our tenants; adverse economic or real estate conditions generally, and specifically, in the States of California and Washington; risks associated with our investment in real estate assets, which are illiquid, and with trends in the real estate industry; defaults on or non-renewal of leases by tenants; any significant downturn in tenants’ businesses; our ability to re-lease property at or above current market rates; costs to comply with government regulations, including environmental remediation; the availability of cash for distribution and debt service and exposure to risk of default under debt obligations; increases in interest rates and our ability to manage interest rate exposure; the availability of financing on attractive terms or at all, which may adversely impact our future interest expense and our ability to pursue development, redevelopment and acquisition opportunities and refinance existing debt; a decline i", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.kilroyrealty.com&esheet=51745574&newsitemid=20180118006378&lan=en-US&anchor=http%3A%2F%2Fwww.kilroyrealty.com&index=1&md5=be58efcbcf08368c0b34c7c7a4ef0ca3", "http://www.businesswire.com/news/home/20180118006378/en/"], "published": "2018-01-19T00:08:00.000+02:00", "crawled": "2018-01-19T00:30:28.002+02:00", "highlightTitle": ""}