{"organizations": [], "uuid": "f67f28069c03e8a9533901917ac4db792ca6e964", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220330494&w=1200&r=LYNXMPEE0719K", "site_section": "http://feeds.reuters.com/reuters/topNews", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-nevada-militia/judge-ends-case-over-armed-standoff-in-nevada-grazing-dispute-idUSKBN1EX218", "country": "US", "domain_rank": 408, "title": "Judge ends case over armed standoff in Nevada grazing dispute", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T20:27:00.000+02:00", "replies_count": 0, "uuid": "f67f28069c03e8a9533901917ac4db792ca6e964"}, "author": "", "url": "https://www.reuters.com/article/us-nevada-militia/judge-ends-case-over-armed-standoff-in-nevada-grazing-dispute-idUSKBN1EX218", "ord_in_thread": 0, "title": "Judge ends case over armed standoff in Nevada grazing dispute", "locations": [], "entities": {"persons": [{"name": "ian simpson", "sentiment": "none"}, {"name": "gloria navarro", "sentiment": "none"}, {"name": "cliven bundy", "sentiment": "none"}, {"name": "jonathan oatis", "sentiment": "none"}], "locations": [{"name": "nevada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "min read  las vegas", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 6:28 PM / Updated an hour ago Judge ends case over standoff in Nevada land dispute John L. Smith 3 Min Read \nLAS VEGAS (Reuters) - A federal judge on Monday threw out a criminal case against a Nevada rancher and three other men over a 2014 militia standoff with federal agents, saying prosecutors had repeatedly withheld evidence from the defense. \nU.S. District Judge Gloria Navarro dismissed the case “with prejudice,” meaning that rancher Cliven Bundy, two of his sons and a militia member will not face another trial. Navarro had declared a mistrial last month. \nNavarro’s decision was a rebuke to prosecutors in the politically charged case, which arose from Bundy’s grazing of cattle on federal land without paying fees for two decades. His defiance galvanized right-wing militia groups challenging U.S. government authority over vast tracts of public land. \nBundy emerged from the courthouse to cheers from about 100 supporters and said he still did not recognize federal authority over the land where he grazed his herds. \n“They stuck the guns down our throats and that’s definitely not what our Founding Fathers meant to happen in America,” the 71-year-old rancher said, his wife, Carol, at his side. \nNavarro told a packed Las Vegas courtroom that prosecutors made “several misrepresentations to the defense and to the court” that amounted to misconduct and prevented a fair trial for Bundy, his sons Ammon and Ryan and militia member Ryan Payne. FILE PHOTO: Rancher Cliven Bundy stands near a cattle gate on his 160 acre ranch in Bunkerville, Nevada, U.S., May 3, 2014. REUTERS/Mike Blake/File Photo \nShe said more than 1,000 pages of Federal Bureau of Investigation memos were kept from the defense until well past an October deadline. The agency failed in its duty despite years of investigations and two years of trial preparation, she said. \nProsecutors appeared stunned after the judge’s decision, and Bundy family members wept in the spectators’ section. \nThe 2014 revolt at the heart of the trial was sparked by a court-ordered roundup of Bundy’s cattle by the U.S. Bureau of Land Management, after the rancher had refused to pay federal grazing fees. \nHundreds of supporters, many of them armed, rallied at his ranch in a show of force to demand the return of his impounded livestock. Police and federal agents retreated rather than risk bloodshed and no shots were fired. \nKieran Suckling, executive director of the Center for Biological Diversity, said prosecutors had bungled the case and let the Bundys succeed in breaking the law. \n”The failure of this case will only embolden this violent and racist anti-government movement that wants to take over our public lands,” he said. Reporting by John Smith, Writing by Ian Simpson, Editing by Frank McGurty and Steve Orlofsky", "external_links": [], "published": "2018-01-08T20:27:00.000+02:00", "crawled": "2018-01-08T20:44:46.001+02:00", "highlightTitle": ""}