{"organizations": [], "uuid": "de3651503c2171108cf35ad3a628cbdc51690418", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/business-wire-emagin-corporation-announces-pricing-of-its-11-point-5-million-upsized-underwritten-public-offering.html", "country": "US", "domain_rank": 767, "title": "eMagin Corporation Announces Pricing of Its $11.5 Million Upsized Underwritten Public Offering", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-25T14:30:00.000+02:00", "replies_count": 0, "uuid": "de3651503c2171108cf35ad3a628cbdc51690418"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/business-wire-emagin-corporation-announces-pricing-of-its-11-point-5-million-upsized-underwritten-public-offering.html", "ord_in_thread": 0, "title": "eMagin Corporation Announces Pricing of Its $11.5 Million Upsized Underwritten Public Offering", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "hopewell junction", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "craig-hallum capital group llc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOPEWELL JUNCTION, N.Y.--(BUSINESS WIRE)-- eMagin Corporation (NYSE American: EMAN) today announced that it has priced an underwritten offering of an aggregate of 8,527,918 shares of common stock of the Company and warrants to purchase up to 3,411,168 shares of common stock of the Company. Each share of common stock is being sold together in a fixed combination with a warrant to purchase four tenths of one share of common stock at an offering price of $1.35 per share and associated warrant. The warrants will have an exercise price of $1.55 per share of common stock and a term of five (5) years, exercisable upon the date of issuance. The Company has granted the underwriters a 30-day option to purchase up to 1,279,187 additional shares of common stock and/or additional warrants to purchase up to 511,674 shares of common stock at the public offering price, less underwriting discounts and commission, to cover over-allotments, if any. The offering is expected to close on or about January 29, 2018, subject to satisfaction of customary closing conditions.\nCraig-Hallum Capital Group LLC is acting as the sole book-running manager and H.C. Wainwright & Co. is acting as the co-manager in connection with the offering.\nIn a concurrent private placement, certain of the Company’s directors and officers have agreed to purchase $275,000 of shares of common stock of the Company, together with warrants to purchase shares of common stock of the Company, at the public offering price per fixed combination. The sale of such shares of common stock and warrants in the concurrent private placement will not be registered under the Securities Act of 1933, as amended.\nThe Company expects to receive net proceeds of $10.6 million from the public offering and the concurrent private placement, after deducting underwriting discounts and commissions and estimated offering expenses. The Company intends to use the net proceeds of the public offering and the concurrent private placement for working capital and general corporate purposes.\nThe securities described in the public offering are being offered by the Company pursuant to a registration statement on Form S-1 (File No. 333-222375) which was declared effective by the Securities and Exchange Commission (the “SEC”) on January 24, 2018, and an additional registration statement on Form S-1 filed pursuant to Rule 462(b) (File No. 333- 222682), which became automatically effective on January 24, 2018.\nThe public offering may be made only by means of a prospectus. A prospectus related to the public offering will be filed with the SEC and, once filed, will be available by contacting Craig-Hallum Capital Group LLC at 222 South 9th Street, Suite 350, Minneapolis Minnesota 55402 or by calling 612-334-6300, or at the SEC’s website at http://www.sec.gov.\nThis press release shall not constitute an offer to sell, or a solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such an offer, solicitation, or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\nAbout eMagin Corporation\nA leader in OLED microdisplay technology, OLED microdisplay manufacturing know-how and mobile display systems, eMagin manufactures high-resolution OLED microdisplays and integrates them with magnifying optics to deliver virtual images comparable to large-screen computer and television displays in portable, low-power, lightweight personal displays. eMagin microdisplays provide near-eye imagery in a variety of products from military, industrial, medical and consumer OEMs. More information about eMagin is available at www.emagin.com .\nForward-Looking Statements\nThis press release contains “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995 that involve significant risks and uncertainties about eMagin, including but not limited to statements with respect to eMagin’s plans to consummate its proposed underwritten offering and concurrent private placement of common stock and warrants. eMagin may use words such as “expect,” “anticipate,” “project,” “intend,” “plan,” “aim,” “believe,” “seek,” “ estimate,” “can,” “focus,” “will,” and “may” and similar expressions to identify such forward-looking statements. Among the important factors that could cause actual results to differ materially from those indicated by such forward-looking statements are risks relating to, among other things, whether or not eMagin will be able to raise capital, the final terms of the underwritten offering of common stock and warrants, the final terms of the concurrent private placement, market and other conditions, the satisfaction of customary closing conditions related to the underwritten offering of common stock and warrants, eMagin’s business and financial condition, and the impact of general economic, industry or political conditions in the United States or internationally. For additional disclosure regarding these and other risks faced by eMagin, see disclosures contained in eMagin’s public filings with the SEC, including the “Risk Factors” in the company’s Annual Report on Form 10-K for the year ended December 31, 2016 and under the heading “Risk Factors” of the prospectus for this offering. You should consider these factors in evaluating the forward-looking statements included in this press release and not place undue reliance on such statements. The forward-looking statements are made as of the date hereof, and eMagin undertakes no obligation to update such statements as a result of new information.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180125005404/en/\neMagin Corporation\nJeffrey Lucas, 845-838-7931\nChief Financial Officer\njlucas@emagin.com\nor\nMBS Value Partners\nBetsy Brod, 212-661-2231\nBetsy.brod@mbsvalue.com\nSource: eMagin Corporation", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.emagin.com&esheet=51748734&newsitemid=20180125005404&lan=en-US&anchor=www.emagin.com&index=1&md5=2f9b63a9803816d064bdc78fb25ce5b3", "http://www.businesswire.com/news/home/20180125005404/en/"], "published": "2018-01-25T14:30:00.000+02:00", "crawled": "2018-01-25T14:17:44.009+02:00", "highlightTitle": ""}