{"organizations": [], "uuid": "f869703e9f9ac5922e1ff437d522d655d3933bba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-usa-climatechange-lawsuit/ninth-u-s-city-sues-big-oil-firms-over-climate-change-idUSKBN1FC2RR", "country": "US", "domain_rank": 408, "title": "Ninth U.S. city sues big oil firms over climate change", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T21:24:00.000+02:00", "replies_count": 0, "uuid": "f869703e9f9ac5922e1ff437d522d655d3933bba"}, "author": "", "url": "https://www.reuters.com/article/us-usa-climatechange-lawsuit/ninth-u-s-city-sues-big-oil-firms-over-climate-change-idUSKBN1FC2RR", "ord_in_thread": 0, "title": "Ninth U.S. city sues big oil firms over climate change", "locations": [], "entities": {"persons": [{"name": "sebastien malo", "sentiment": "none"}], "locations": [{"name": "ninth u.s.", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "earth", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "richmond", "sentiment": "none"}], "organizations": [{"name": "min read  new york", "sentiment": "none"}, {"name": "chevron", "sentiment": "none"}, {"name": "thomson reuters foundation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 7:39 PM / a few seconds ago Ninth U.S. city sues big oil firms over climate change Sebastien Malo 3 Min Read \nNEW YORK (Thomson Reuters Foundation) - A California city has filed a lawsuit against 29 oil companies seeking damages to pay for the costs of rising sea levels it blames on climate change, the ninth U.S. community to take the fossil fuel industry to court. \nThe San Francisco suburb of Richmond filed a civil case in a California court on Monday against the energy giant Chevron, its biggest employer, and other oil companies for planet-warming carbon dioxide emissions dating back to 1965. \n“Defendants have known for nearly 50 years that greenhouse gas pollution from their fossil fuel products has a significant impact on the Earth’s climate and sea levels,” the complaint said. \n“Defendants concealed the dangers, sought to undermine public support for greenhouse gas regulation, and engaged in massive campaigns to promote the ever-increasing use of their products at ever greater volumes.” \nNew York City announced earlier this month that it filed a multibillion dollar lawsuit against five top oil companies, citing their “contributions to global warming,” following similar lawsuits filed last year by California cities. \nA Chevron spokesman questioned the benefits that could come from Richmond’s lawsuit, filed on Monday. \n“Reducing greenhouse gas emissions is a global issue that requires global engagement,” said Braden Reddall in emailed comments. \nChevron employs nearly 3,500 people at its Richmond refinery, municipal data shows. \nRichmond is “uniquely vulnerable” because it is surrounded by water on three sides, with 32 miles (52 km) of shoreline and is one of the poorest communities in the Bay area, the mayor’s office said in a statement. \n“Taxpayers of this low-income city should not have to pay for the damages that these companies are causing,” Alex Knox, Richmond mayor’s chief of staff, said in emailed comments. \nU.S. President Donald Trump’s move to pull out of the global Paris climate change accord and roll back environmental regulations means campaigners are increasingly resorting to litigation. \nLegal scrutiny of oil companies is growing in the United States, said Michael Gerrard, an environmental expert at Columbia Law School.“Each new lawsuit is incrementally more pressure on the oil companies,” he told the Thomson Reuters Foundation by phone. Reporting by Sebastien Malo @sebastienmalo, Editing by Katy Migiro. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org", "external_links": [], "published": "2018-01-23T21:24:00.000+02:00", "crawled": "2018-01-23T21:43:38.016+02:00", "highlightTitle": ""}