{"organizations": [], "uuid": "7413d41680d2291a090dd2e331a7212b02b5f036", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-adamas-announces-pricing-of-public-offering-of-common-stock.html", "country": "US", "domain_rank": 767, "title": "Adamas Announces Pricing of Public Offering of Common Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T04:29:00.000+02:00", "replies_count": 0, "uuid": "7413d41680d2291a090dd2e331a7212b02b5f036"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-adamas-announces-pricing-of-public-offering-of-common-stock.html", "ord_in_thread": 0, "title": "Adamas Announces Pricing of Public Offering of Common Stock", "locations": [], "entities": {"persons": [{"name": "adamas", "sentiment": "none"}], "locations": [{"name": "emeryville", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "adamas", "sentiment": "none"}], "organizations": [{"name": "adamas announces pricing of public offering of common stock", "sentiment": "negative"}, {"name": "adamas pharmaceuticals, inc.", "sentiment": "neutral"}, {"name": "securities and exchange commission", "sentiment": "none"}, {"name": "evercore isi", "sentiment": "none"}, {"name": "leerink partners", "sentiment": "none"}, {"name": "bofa merrill lynch", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "EMERYVILLE, Calif., Jan. 23, 2018 (GLOBE NEWSWIRE) -- Adamas Pharmaceuticals, Inc. (Nasdaq:ADMS) today announced the pricing of its underwritten public offering of 3,000,000 shares of its common stock at a price to the public of $41.50 per share. The aggregate gross proceeds from this offering are expected to be $124,500,000, before deducting the underwriting discounts and commissions and estimated offering expenses payable by Adamas. Adamas also granted the underwriters a 30-day option to acquire up to an additional 450,000 shares from Adamas. The offering is expected to close on January 26, 2018, subject to customary closing conditions.\nBofA Merrill Lynch, Leerink Partners and Evercore ISI are acting as book-running managers for the proposed offering.\nA shelf registration statement relating to the shares was filed with the Securities and Exchange Commission on November 3, 2016, and became effective on November 21, 2016. The offering will be made only by means of a prospectus supplement. When available, copies of the prospectus supplement and accompanying prospectus relating to the public offering may be obtained by contacting BofA Merrill Lynch, NC1-004-03, 200 North College Street, 3rd floor, Charlotte NC 28255-0001, Attn: Prospectus Department, email: dg.prospectus_requests@baml.com ; Leerink Partners, Attention: Syndicate Department, One Federal Street, 37th Floor, Boston, MA 02110, by telephone at (800) 808-7525 ext. 6132 or by email at Syndicate@Leerink.com ; or Evercore ISI, Attention: Equity Capital Markets, 55 East 52nd Street, 36th Floor, New York, NY 10055, or by telephone at (888) 474-0200 or by email at ecm.prospectus@evercore.com .\nThis press release shall not constitute an offer to sell or the solicitation of an offer to buy these securities, nor shall there be any sale of these securities in any state or other jurisdiction in which such offer, solicitation or sale would be unlawful prior to the registration or qualification under the securities laws of any such state or other jurisdiction.\nAbout Adamas Pharmaceuticals, Inc.\nAdamas is a pharmaceutical company committed to developing and commercializing products and product candidates for the treatment of chronic neurological disorders.\nForward-Looking Statements\nThis announcement contains , including statements relating to Adamas’ expectations regarding the completion of the proposed public offering. These statements are subject to significant risks and uncertainties, actual results could differ materially from those projected and Adamas cautions investors not to place undue reliance on the contained in this release. These risks and uncertainties include, without limitation, risks and uncertainties related to market conditions and satisfaction of customary closing conditions related to the public offering. There can be no assurance that Adamas will be able to complete the public offering on the anticipated terms, or at all. Risks and uncertainties relating to Adamas and its business can be found in the “Risk Factors” section of Adamas’ Form 8-K, filed with the SEC on January 22, 2018, and in the preliminary prospectus supplement related to the offering filed with the SEC on January 22, 2018. Adamas undertakes no duty or obligation to update any contained in this release as a result of new information, future events or changes in Adamas’ expectations.\nFor questions, please contact:\nAshleigh Barreto\nDirector, Corporate Communications & Investor Relations\nAdamas Pharmaceuticals, Inc.\n510-450-3567\nSource:Adamas Pharmaceuticals, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/78b294ca-f8a8-4bf4-bf30-8550f15be062"], "published": "2018-01-24T04:29:00.000+02:00", "crawled": "2018-01-24T06:02:40.018+02:00", "highlightTitle": ""}