{"organizations": [], "uuid": "2b8ace7c47e8e30f429ca26989c47245fcdbe338", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222189851&w=1200&r=LYNXMPEE0E17C", "site_section": "http://www.reuters.com/resources/archive/us/20180115.html", "section_title": "Archive News &amp; Video for Monday, 15 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-engie-strategy/engie-to-boost-growth-in-2018-investment-plan-nearly-complete-idUSKBN1F426O", "country": "US", "domain_rank": 408, "title": "Engie to boost growth in 2018, investment plan nearly complete", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T00:54:00.000+02:00", "replies_count": 0, "uuid": "2b8ace7c47e8e30f429ca26989c47245fcdbe338"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-engie-strategy/engie-to-boost-growth-in-2018-investment-plan-nearly-complete-idUSKBN1F426O", "ord_in_thread": 0, "title": "Engie to boost growth in 2018, investment plan nearly complete", "locations": [], "entities": {"persons": [{"name": "engie", "sentiment": "none"}, {"name": "isabelle kocher", "sentiment": "none"}], "locations": [{"name": "paris", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PARIS (Reuters) - French utility Engie hopes to boost earnings growth and partnerships in its core businesses of renewable energy, grids and energy services this year, after an estimated five percent gain in core earnings in 2017, its chief executive said.\nIsabelle Kocher said 2018 would be “decisive in terms of accelerating and deepening partnerships”, pointing to Engie’s investments in fuel-cell specialist Symbio FCell, green mobility and solar energy, notably in Africa.\nShe said 2018 would see an acceleration of growth.\n“Our 2017 earnings guidance was based on a growth rate of about five percent for our core businesses, which is a lot in today’s world. For 2018, our ambition is to continue moving ahead at a very high pace,” she said.\nIn November, Engie confirmed its outlook for 2017 core earnings of 10.7-11.3 billion euros, from 10.7 billion in 2016.\nWhile she painted a rosy picture for earnings, she said a plan to invest 15 billion euros in new assets was nearly complete, but she did not give a detailed breakdown on how the money had been spent.\nLast year, Engie sold its upstream liquefied natural gas assets for $1.5 billion, its exploration and production business for $3.9 billion and the Loy Yang B coal-fired power station in Australia for $835 million.\nOf the 15 billion euros expected to be raised from the disposal of fossil fuel assets, Kocher said Engie had already spent about two thirds and signed or secured about 90 percent.\nEngie has not made major acquisitions in the past two years: in 2017 it bought 40 percent of Dubai cooling specialist Tabreed for $762 million and the building regeneration business of Keepmoat for 330 million pounds ($455 million).\nLast year, it also bought a stake in electric vehicle charging specialist EVBox for an undisclosed sum and the energy services activities of Spie in Morocco.\nIn renewable energy, it brought six gigawatts (GW) of new power generation online over the past two years, and another six GW have been signed or secured.\nIn infrastructure, Engie moved outside its traditional European markets. In Chile, it is building a power network that will connect the country’s northern and southern power grids. Kocher also confirmed Engie is interested in bidding for a stake in a gas pipeline grid owned by Brazil’s Petrobras..\nKocher said that about 12,000 new staff had been hired in the company’s energy services division, boosting the unit’s headcount to 100,000, two-thirds of the total.\nKocher said the shift to renewables, grids and services had improved Engie’s return on capital employed.\n“All of this is of significant scale, and as it is organic growth,” she said, adding that she would outline a new strategy for 2030 in the second half of 2018.\nReporting by Geert De Clercq. Editing by Jane Merriman\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-16T00:54:00.000+02:00", "crawled": "2018-01-16T13:21:45.002+02:00", "highlightTitle": ""}