{"organizations": [], "uuid": "372d4d42a5825f723e356e35ddf695ac7d9659fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 11, "shares": 11, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/04/104928158-GettyImages-900529390.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/05/us-stock-futures-us-jobs-dow-politics-on-the-agenda.html", "country": "US", "domain_rank": 767, "title": "US stock futures: US jobs, Dow, politics on the agenda", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-05T13:26:00.000+02:00", "replies_count": 0, "uuid": "372d4d42a5825f723e356e35ddf695ac7d9659fd"}, "author": "Alexandra Gibbs", "url": "https://www.cnbc.com/2018/01/05/us-stock-futures-us-jobs-dow-politics-on-the-agenda.html", "ord_in_thread": 0, "title": "US stock futures: US jobs, Dow, politics on the agenda", "locations": [], "entities": {"persons": [{"name": "bryan r. smith", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "new york stock exchange", "sentiment": "none"}, {"name": "bureau of labor statistics", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Dow surges more than 200 points, caps off best start to a year since 2006 The Dow and Nasdaq had their best start to a year since 2006. Stocks closed at record highs and posted strong weekly gains. The U.S. economy added 148,000 jobs in December, according to the Labor Department. Economists polled by Reuters expected a gain of 190,000. CNBC.com SHARES \nStocks rose on Friday, capping off a strong start to the new year, as Wall Street shook off jobs data that missed expectations. \nThe Dow Jones industrial average advanced 220.74 points to close at 25,295.87. The S&P 500 climbed 0.7 percent and finished at 2,743.15, with tech stocks rising 1.2 percent. The Nasdaq composite gained 0.8 percent to 7,136.56 as Alphabet and Amazon shares hit record highs. The major indexes also reached all-time highs. \nThe Dow and Nasdaq enjoyed their best start to a year since 2006, notching their biggest four-day gain to kick off a year since then. \n\"Valuations long term are stretched but people are looking past that because of the tax cuts,\" said John Serrapere, director of research at Arrow Funds. President Donald Trump signed a bill last month that slashed the corporate tax rate to 21 percent from 35 percent. \nThe U.S. economy added 148,000 jobs in December , according to the Labor Department. Economists polled by Reuters expected a gain of 190,000. \n\"I think the net-net effect in the market is neutral,\" said Randy Frederick, vice president of trading and derivatives at Charles Schwab. \"Yes, the numbers were a bit disappointing, but not so much that they change Fed policy, for example.\" \n\"December and January are also notorious months for being off the mark,\" Frederick said. \nU.S. stock index futures initially pared gains after the data were released, but quickly recovered. Dow futures briefly traded 100 points higher. \nThe report \"keeps inflationary pressures at bay for now, and the Fed less pressured to move beyond the already discounted three rate hikes for 2018,\" said Quincy Krosby, chief market strategist at Prudential Financial. \nOther data released Friday include the non-manufacturing ISM index, which fell to 55.9 in December from 57.4 in November. Factory orders, meanwhile, rose 1.3 percent in November, exceeding expectations. \nU.S. equities kicked off 2018 with a bang. The Dow, S&P and Nasdaq rose 2.3 percent, 2.6 percent and 3.4 percent, respectively, this week. The S&P 500 and the Nasdaq also had their biggest weekly gains since December 2016. \nThey have also notched key milestones this week. The Dow closed above 25,000 for the first time on Thursday. It took the Dow just 23 trading days to rally from 24,000 to 25,000, marking the fastest 1,000 point move in the index's history. The move is also tied for the fastest ever in terms of calendar days at 35. \nThe S&P 500 and Nasdaq finished above 2,700 and 7,000, respectively, for the first time ever earlier in the week. \nOverseas, international markets posted solid gains on the last trading day of the week, as investors shrugged off concerns surrounding geopolitical tensions between North Korea and the West, and focused on the positive momentum seen in markets. \nThs Stoxx 600, which tracks a wide swath of European stocks, rose 0.9 percent. In Asia, the Nikkei 225 jumped 0.9 percent, while the Shanghai composite gained 0.2 percent. \nIn corporate news, shares of Target and Lowe's rose 0.4 percent and 1.6 percent, respectively, after being upgraded at Barclays. Analysts cited a stimulus to retailers from the recent tax code overhaul and \"improved flexibility to make necessary investments without negatively impacting EPS results.\" \nCisco shares climbed 1.4 percent, hitting their highest level in nearly 17 years, after Bank of America Merrill Lynch upgraded them to buy from neutral . \"The company is in the early stages of a positive transition to software,\" analyst Tal Liani said. Liani also noted Cisco has strong free cash flow and a low valuation compared with its competitors. \nGoogle-parent Alphabet rose 1.3 percent and hit a record high of $1,113.58. Amazon climbed 1.6 percent and reached an all-time high of $1,229.14. Alexandra Gibbs Digital News Writer & Assistant Related Securities", "external_links": [], "published": "2018-01-05T13:26:00.000+02:00", "crawled": "2018-01-05T13:12:38.080+02:00", "highlightTitle": ""}