{"organizations": [], "uuid": "6e126b63eb1f3bdf834e34b48f01e711f5b29196", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225577246&w=1200&r=LYNXMPEE0P17Y", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-eritrea-mining-nevsun-resources/nevsun-appeals-to-canada-supreme-court-in-eritreans-forced-labor-lawsuit-idUSKBN1FF2M5", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Nevsun appeals to Canada Supreme Court in Eritreans' forced labor lawsuit", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T23:14:00.000+02:00", "replies_count": 0, "uuid": "6e126b63eb1f3bdf834e34b48f01e711f5b29196"}, "author": "", "url": "https://www.reuters.com/article/us-eritrea-mining-nevsun-resources/nevsun-appeals-to-canada-supreme-court-in-eritreans-forced-labor-lawsuit-idUSKBN1FF2M5", "ord_in_thread": 0, "title": "UPDATE 1-Nevsun appeals to Canada Supreme Court in Eritreans' forced labor lawsuit", "locations": [], "entities": {"persons": [{"name": "susan taylor", "sentiment": "none"}, {"name": "nevsun", "sentiment": "none"}], "locations": [{"name": "eritrea", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}, {"name": "british columbia", "sentiment": "none"}], "organizations": [{"name": "nevsun appeals to canada supreme court", "sentiment": "negative"}, {"name": "canada supreme court", "sentiment": "negative"}, {"name": "reuters) - nevsun resources ltd", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 7:43 PM / Updated 2 minutes ago Nevsun appeals to Canada Supreme Court in Eritreans' forced labor lawsuit Susan Taylor 3 Min Read \nTORONTO (Reuters) - Nevsun Resources Ltd is appealing to Canada’s Supreme Court to throw out a lower court ruling which allowed Eritrean workers, who say they were forced to work at its mine, to have their lawsuit heard in Canada. \nCanada’s top court said on Friday that Nevsun filed an application on Jan. 19, seeking permission to appeal a British Columbia court ruling in November, which confirmed the case could proceed in the western Canadian province. \nThe Supreme Court can grant or deny such applications and there is no fixed time for a decision. \nNevsun confirmed its appeal, but said it would not otherwise comment. \nIn the application, Nevsun said that it was inappropriate for a British Columbia judge the legality of a sovereign state’s conduct, calling it an issue of national importance for Canada. \nNevsun said the B.C. ruling was “out of step” with international consensus and common law courts that do not recognize damage claims based on breaches of international law. \nA Supreme Court ruling could shield Nevsun from similar actions by 59 other Eritrean nationals, it said, and avoid the case devolving into a “complicated, difficult and expensive inquiry into the lawfulness of the acts of the State of Eritrea within its own territory.” \nNevsun previously argued the case should be dismissed and any lawsuit should be heard in Eritrea, not Canada. \nThe case is closely watched by Canadian miners operating abroad because its outcome could increase litigation risk. \nCanadian courts have agreed to hear lawsuits against Tahoe Resources by Guatemalans who say they were shot by the miner’s security and against HudBay Minerals by Guatemalans who say they were gang raped and shot by security forces. [L1N1FH004] \nIf Nevsun loses at trial, the Vancouver-based company could potentially be forced to pay compensation for “severe physical and mental pain and suffering.” \nIn affidavits, six men, who have since left Eritrea, said they were forced to work at Nevsun’s Bisha from 2008 to 2012, enduring harsh conditions, including hunger, illness and physical punishment at the hands of military commanders. \nThey said they were conscripts in a national service system, working not for Nevsun directly but for government-owned construction firms subcontracted to build the mine. \nNevsun says its mine is a model development. In legal filings, it said the Eritrean military never provided labor to the mine. Even if it did, Nevsun argues it was not directly responsible for employing the workers. Reporting by Susan Taylor; editing by Susan Thomas and Grant McCool", "external_links": [], "published": "2018-01-26T23:14:00.000+02:00", "crawled": "2018-01-26T23:33:50.008+02:00", "highlightTitle": ""}