{"organizations": [], "uuid": "920db84d8f4ec747050a83dad310adc9e05bd867", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/25/104608923-GettyImages_r-669889770.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10000238/device/rss", "section_title": "Mark Zuckerberg", "url": "https://www.cnbc.com/2018/01/19/new-york-times-digital-executive-behind-facebookas-china-charm-campaign-is-out.html", "country": "US", "domain_rank": 767, "title": "Facebook's China liaison, Wang-Li Moser, has left the company", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T15:51:00.000+02:00", "replies_count": 0, "uuid": "920db84d8f4ec747050a83dad310adc9e05bd867"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/19/new-york-times-digital-executive-behind-facebookas-china-charm-campaign-is-out.html", "ord_in_thread": 0, "title": "Facebook's China liaison, Wang-Li Moser, has left the company", "locations": [], "entities": {"persons": [{"name": "wang-li moser", "sentiment": "negative"}, {"name": "moser", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "negative"}, {"name": "google", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "intel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The executive in charge of Facebook ’s efforts to court China has left the company, a fresh setback for the social network as it seeks to get its products into China’s huge internet market.\nWang-Li Moser, who as Facebook’s lead liaison with Beijing had become a symbol of its ambitions in the country, resigned in December, according to two people familiar with the matter.\nMs. Moser had been brought in from Intel to professionalize Facebook’s efforts to court China’s government. Her job was a tough one. She set up and presided over negotiations between China’s most powerful officials and a social network that many of them believed could be dangerously destabilizing .\nShe also had to manage broader trade and security frictions between China and the United States. China blocks Facebook and most other major American internet companies, fearing the products could be used to undermine the government. Google , Twitter and Snapchat are all inaccessible within China. Apple and Amazon have been forced to use local partners to offer cloud services.\nDuring her roughly three-year tenure, Ms. Moser worked behind the scenes as Facebook waged a charm campaign to get back into the country. As part of those efforts, Facebook’s founder, Mark Zuckerberg, showed off his Mandarin, did a promotional jog through a polluted Tiananmen Square and dined with President Xi Jinping .\nMs. Moser’s departure, after she failed to achieve any major breakthrough in China, underscores the challenges, and setbacks, Facebook has faced as it seeks to gain entry to one of the world’s largest — and most closed off — internet markets.\nMore from The New York Times:\nWhere Amazon May Build Its New Headquarters Lebanese Intelligence Turned Targets' Android Phones Into Spy Devices, Researchers Say A Savage Question About Obama and HQ, Answered Along with Mr. Zuckerberg’s high-profile appearances in China, Facebook has quietly tried numerous other strategies to gain access. The company worked internally on a tool that would allow targeted censorship , even as some employees quit over the project. The tool has thus far not been used.\nLast year, Facebook took the novel approach of releasing an app in China without putting its name to the product. Called Colorful Balloons, the app is an almost exact copy of Facebook’s own photo-sharing app Moments. Considered a sort of trial balloon to better understand the market, the app was introduced anonymously by Facebook through a separate company. It appears to be no longer available in app stores in China.\nStepping into the role of government liaison will be William Shuai, a former government relations executive at the Chinese search engine Baidu and the American social network LinkedIn. Before holding those positions, Mr. Shuai was briefly a low-level official in the Chinese government.\nFor Facebook, which declined to comment on Ms. Moser’s departure, getting into China remains a major priority. China is Facebook’s largest market for ad spending in Asia, even though it is blocked in the country. Chinese companies, local governments and the state news media all use advertising on Facebook as a way to reach beyond Chinese borders.\nAs has generally been the case for Facebook, at the moment there are both signs of progress and problems for the company efforts to enter China.\nFacebook has been quietly scouting Shanghai for an office and late last year Mr. Zuckerberg was among several executives who met President Xi shortly after China’s leaders held the 19th Communist Party Congress.\nBut in the lead-up to the party congress, Chinese censors blocked the company’s last major viable product in China, WhatsApp. The chat app remains mostly unusable in the country.\nCarolyn Zhang contributed research from Shanghai.", "external_links": [], "published": "2018-01-19T15:51:00.000+02:00", "crawled": "2018-01-19T16:24:21.024+02:00", "highlightTitle": ""}