{"organizations": [], "uuid": "fdb8184408fcf49d97f5c305167c1050fb36052d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-dropcar-completes-merger-with-wpcs.html", "country": "US", "domain_rank": 767, "title": "DropCar Completes Merger with WPCS", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T15:00:00.000+02:00", "replies_count": 0, "uuid": "fdb8184408fcf49d97f5c305167c1050fb36052d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-dropcar-completes-merger-with-wpcs.html", "ord_in_thread": 0, "title": "DropCar Completes Merger with WPCS", "locations": [], "entities": {"persons": [{"name": "brian", "sentiment": "negative"}, {"name": "dropcar", "sentiment": "none"}, {"name": "harrington", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "wpcs", "sentiment": "negative"}, {"name": "wpcs international incorporated", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "- DropCar Commences Trading on NASDAQ Capital Market under Ticker Symbol “DCAR”\n- Company Adds Brian Harrington, Former Zipcar Chief Marketing Officer, to Board of Directors\nNEW YORK, Jan. 31, 2018 (GLOBE NEWSWIRE) -- DropCar , Inc. a provider of app-based automotive logistics and mobility services for both consumers and the automotive industry, today announced the completion of its merger with WPCS International Incorporated (NASDAQ:WPCS) following the approval of WPCS stockholders received on January 30, 2018. The combined company will be known as DropCar, with trading beginning today, January 31, 2018, on the NASDAQ Capital Market under the symbol “DCAR”.\nDropCar is at the nexus of the revolution in urban mobility and the evolution of the automotive industry. The company is reinventing the traditional models for car ownership, parking, and maintenance all while enabling the automotive industry to better connect with customers, mobility companies to better manage their fleets, and auto manufacturers to launch vehicle subscription models.\nDropCar maintains parking spaces in garages around the New York Metro area. Subscribers use the DropCar mobile app to schedule pickup and dropoff of their vehicles by professionally-trained drivers, either on-demand or with as little as an hour advance notice. While the vehicle is in storage, DropCar schedules, performs or sources the required vehicle services, ensuring that when the owner is ready for the vehicle, the vehicle is ready for the owner.\nDropCar offers its Enterprise Vehicle Assistance & Logistics (“VAL”) technology platform to auto dealerships and fleet managers. The platform tracks vehicle movements, service status and provides email and text notifications on status to both dealers and customers, increasing the quality of communication and subsequent satisfaction with the service, enabling the dealer’s maintenance and sales teams to deliver an entirely new and improved level of service. DropCar’s VAL is also used by mobility service providers to facilitate movement and maintenance of shared vehicles to streamline operations and lower costs.\n“Becoming a publicly traded company is the first step in DropCar’s larger journey to become the middleware for urban mobility,” said Spencer Richardson. “By removing the stress and hassle of car ownership for people in cities, and by enabling new models for vehicle ownership and subscription, we believe we can play a role in the evolution of the auto industry.”\nAccess to public markets will allow DropCar to significantly expand its efforts to bring its cloud-based vehicle logistics and driver services to the burgeoning auto tech and driver mobility market, one which has seen significant increased investment and M&A activity from leading companies such as GM, Ford, Toyota, BMW iVentures (and many others) in the last two years, as well as the rise of such companies as Uber and Lyft, as autonomy, connectivity and mobility are rapidly changing the automotive experience.\nThe company’s rapidly growing base of approximately 1,400 individual members (up approximately 176 percent Year over Year), and several new B2B partnerships have established DropCar as a premier provider of vehicle logistics for consumers, dealerships, fleet managers and auto manufacturers.\nThe combined company will be led by Spencer Richardson, DropCar’s co-founder and CEO, and will be headquartered in New York City. Sebastian Giordano, former CEO of WPCS, will remain as a member of the Board of Directors. In addition to Richardson and Giordano, the Board of Directors includes David Newman, Josh Silverman, Zvi Joseph, Solomon Mayer and Greg Shiffman.\nBrian Harrington, Former Chief Marketing Officer at Zipcar, Joins Board\nIn addition, joining the Board of Directors is Brian Harrington, a veteran marketing and product executive with experience working with global brands in the hospitality, mobility and commercial real estate industries. Former Chief Marketing Officer at Zipcar, Harrington was instrumental in leading that company’s overall global brand development as well as its member acquisition and engagement programs. Prior to Zipcar, he worked in the travel and tourism industry, representing brands including Sheraton Hotels and EF Education. He currently is the Chief Product Officer at CBRE 360, a part of CBRE Group, the world’s largest commercial real estate services and investment firm.\nPalladium Capital Advisors, LLC acted as the advisor to DropCar on this transaction and Mintz, Levin, Cohn, Ferris, Glovsky and Popeo, P.C. acted as legal counsel to DropCar. Morse, Zelnick, Rose & Lander, LLP acted as legal counsel to WPCS.\nAbout DropCar\nFounded and launched in New York City in 2015, DropCar (NASDAQ:DCAR) offers its Vehicle Support Platform (VSP), a cloud-based platform and mobile app that help consumers and automotive-related companies reduce the cost, hassles and inefficiencies of owning a car, or fleet of cars, in urban centers. Its technology platform blends the efficiency and scale of cloud computing, machine learning and connected cars with the high-touch of highly trained drivers to move cars to/from fully staffed, secure garages to/from the people (or businesses) who own them. Consumers use DropCar’s mobile app to ease the cost and stress of owning a car in the city. Dealerships, leasing companies, OEMs and shared mobility companies use DropCar’s enterprise platform to reduce costs, streamline logistics and deepen relationships with customers. More information is available at www.dropcar.com .\nForward-Looking Statements\nThis press release contains “forward-looking statements” that involve substantial risks and uncertainties for purposes of the safe harbor provided by the Private Securities Litigation Reform Act of 1995. All statements, other than statements of historical facts, included in this press release regarding strategy, future operations, future financial position, future revenue, projected expenses, prospects, plans and objectives of management are forward-looking statements. Such statements are based on management’s current expectations and involve risks and uncertainties. Actual results and performance could differ materially from those projected in the forward-looking statements as a result of many factors, including, without limitation, the ability to project future cash utilization and reserves needed for contingent future liabilities and business operations, the availability of sufficient resources of the combined company to meet its business objectives and operational requirements and the impact of competitive products and services and technological changes. The foregoing review of important factors that could cause actual events to differ from expectations should not be construed as exhaustive and should be read in conjunction with statements that are included herein and elsewhere, including the risk factors included in WPCS’s registration statement on Form S-4, including the proxy statement/prospectus/information statement therein, WPCS’ most recent Annual Report on Form 10-K, and WPCS’ recent Quarterly Report on Form 10-Q and Current Reports on Form 8-K filed with the Securities and Exchange Commission. Except as required by applicable law, DropCar undertakes no obligation to revise or update any forward-looking statement, or to make any other forward-looking statements, whether as a result of new information, future events or otherwise.\nMedia Contact John Williams, Scoville PR for DropCar jwilliams@scovillepr.com (206) 625-0075 Investor Relations Contact Daniel Gelbtuch, VP of Corporate Finance for DropCar daniel@dropcar.com (917) 509-9582\nSource:DropCar, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=gtmVoYVMnhkBeCdT2IiDkwmg80iq-2fsktYhkuik8Imph5S5OD4YwnC3JlXc6DWbuCztGUCAkwfvMY2_i4xvPA==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/bd4d613e-8ade-4812-9bf8-26d197aaf5a3", "https://www.globenewswire.com/Tracker?data=noW7M9WxrY0Qh6WjrTc2wQA7vNYDDOzHQYqUBpZL-0RqG4oF8PEYos3_mjoaTcWWwLIGvWS49ywohiDGHRXnAA=="], "published": "2018-01-31T15:00:00.000+02:00", "crawled": "2018-01-31T17:14:34.009+02:00", "highlightTitle": ""}