{"organizations": [], "uuid": "10899b05092145766fb9c727938f3f84c6bd8564", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221372906&w=1200&r=LYNXMPEE0B0DC", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/china-economy-trade-northkorea/chinas-imports-from-north-korea-plummet-in-december-lowest-for-four-years-idINKBN1F10N9", "country": "US", "domain_rank": 408, "title": "China's imports from N.Korea plummet in December, lowest for 4 years", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T19:28:00.000+02:00", "replies_count": 0, "uuid": "10899b05092145766fb9c727938f3f84c6bd8564"}, "author": "", "url": "https://in.reuters.com/article/china-economy-trade-northkorea/chinas-imports-from-north-korea-plummet-in-december-lowest-for-four-years-idINKBN1F10N9", "ord_in_thread": 0, "title": "China's imports from N.Korea plummet in December, lowest for 4 years", "locations": [], "entities": {"persons": [{"name": "huang songping", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "yawen chen", "sentiment": "none"}, {"name": "ryan woo", "sentiment": "none"}], "locations": [{"name": "n.korea", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "friendship bridge", "sentiment": "none"}, {"name": "sinuiju", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states-led", "sentiment": "none"}, {"name": "yalu", "sentiment": "none"}, {"name": "pyongyang", "sentiment": "none"}, {"name": "liaoning province", "sentiment": "none"}, {"name": "dandong", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "u.n.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING (Reuters) - China’s imports from North Korea plunged in December to their lowest level in dollar terms since at least the start of 2014, with trade curbed by U.N. sanctions aimed at persuading Pyongyang to abandon its ballistic missile and nuclear weapons programs.\nTrucks cross the Friendship Bridge on the Yalu river from Sinuiju, North Korea, to Dandong, Liaoning province, China January 8, 2018. Picture taken January 8, 2018. REUTERS/Stringer/Files Imports from North Korea slumped 81.6 percent year-on-year to $54.34 million, Chinese customs spokesman Huang Songping said in a briefing in Beijing on Friday. That’s the smallest monthly value since at least January 2014.\nThe administration of U.S. President Donald Trump welcomed signs that China, North Korea’s main economic partner, was “sharply reducing” trade with its neighbor.\n“This action supports the United States-led global effort to apply maximum pressure until the North Korean regime ends its illicit programs, changes its behavior and moves toward denuclearization of the Korean peninsula,” the White House said.\nThe United Nations began imposing sanctions on North Korea in 2006, but tougher measures were invoked in 2017 as tensions flared anew over the country’s nuclear and missile programmes.\nThe penalties that came into force on Sept. 5 last year banned countries from buying coal, iron ore, lead, lead ore and seafood from North Korea.\nIn November, China imported no iron ore, coal or lead from North Korea, the second full month of the U.N. trade sanctions.\n“In terms of how big of an impact it (falling trade) had on North Korea, there was definitely impact because some of their products could only go to China while others could only be imported from China,” said Chen Fengying, an economics expert at state-backed China Institutes of Contemporary International Relations.\n“You have to understand it was the most tense period for bilateral ties, and foreign relations determine trade relations.”\nChina, the main source of North Korea’s fuel, did not export any gasoline, jet fuel, diesel or fuel oil to its neighbour in November.\nChina’s exports to North Korea in December declined 23.4 percent from a year earlier to $260 million, Huang told reporters.\nCompared with a month earlier, exports fell 9.7 percent.\nIn November, China stopped exporting oil products to North Korea, after the U.N. Security Council that month imposed new caps on trade with North Korea, including limiting oil product shipments.\nFor 2017, China’s imports from North Korea dropped 33 percent to $1.72 billion, the lowest value in at least four years.\nHowever, exports to the country rose 8.3 percent to $3.34 billion. The value was the highest since 2014.\nNon-commodities that China exports to North Korea included electronics, plastic products and garments.\nChinese customs will formally release data for trade with North Korea in the second half of the month, along with a breakdown by product.\nReporting by Yawen Chen, Stella Qiu and Ryan Woo, additional reporting by Matt Spetalnick and Doina Chiacu in Washington; Editing by Simon Cameron-Moore, Shri Navaratnam and Susan Thomas\n ", "external_links": [], "published": "2018-01-12T19:28:00.000+02:00", "crawled": "2018-01-12T19:49:07.004+02:00", "highlightTitle": ""}