{"organizations": [], "uuid": "9c1d258769bc6ec9baa1287d2ce9f80c30a74262", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/globe-newswire-mattersightas-frank-suljic-named-to-customer-contact-week-advisory-board.html", "country": "US", "domain_rank": 767, "title": "Mattersight’s Frank Suljic Named to Customer Contact Week Advisory Board", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.046, "site_type": "news", "published": "2018-01-19T17:13:00.000+02:00", "replies_count": 0, "uuid": "9c1d258769bc6ec9baa1287d2ce9f80c30a74262"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/globe-newswire-mattersightas-frank-suljic-named-to-customer-contact-week-advisory-board.html", "ord_in_thread": 0, "title": "Mattersight’s Frank Suljic Named to Customer Contact Week Advisory Board", "locations": [], "entities": {"persons": [{"name": "frank suljic", "sentiment": "negative"}, {"name": "mattersight", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "mattersight corporation", "sentiment": "negative"}, {"name": "customer contact week advisory board chicago", "sentiment": "negative"}, {"name": "customer contact week’s advisory board", "sentiment": "none"}, {"name": "ccw digital", "sentiment": "none"}, {"name": "ccw advisory board", "sentiment": "none"}, {"name": "ccw executive exchange", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 19, 2018 (GLOBE NEWSWIRE) -- Mattersight Corporation (NASDAQ:MATR), the pioneer in personality-based software applications, announced today that Frank Suljic, Senior Vice President of Strategic Sales, has been named to Customer Contact Week’s Advisory Board.\nStarted in 1999 as Call Center Week, CCW is the world’s largest customer contact event series and is the place where customer care, CX, and contact center leaders come together. The CCW brand is also comprised of CCW Executive Exchange and CCW Digital, the global online community for more than 140,000 customer contact members.\nThe mission of the CCW Advisory Board is to enable better navigation of the continually changing customer contact sector by keeping members informed on the latest industry trends, drivers, and evolving initiatives through extensive market research, reporting, and unparalleled events. Members of the board provide valuable insight on emerging issues, thought leadership on innovations and strategies within the customer contact space, input on conference topics, and often leveraged for keynote presentations and educational training programs.\nAs Mattersight’s Senior Vice President of Strategic Sales, Frank Suljic brings a unique blend of over 25 years of proven leadership from both corporate and startup enterprises. In his current role, Frank enables enterprises to provide more personalized customer experiences through Mattersight’s suite of personality based routing and analytics software.\n“I’m thrilled to be on the CCW board and get a seat at the table with some of its fantastic members,” said Frank. “For nearly twenty years, CCW has played a very important role in transforming how brands service customers and it’s exciting to have an opportunity to make an impact on the direction that the organization takes going forward.”\n“We are thrilled to add Frank to the CCW Advisory Board. His insight and knowledge will be a welcomed addition and certainly help us deliver on our commitment to this all important industry,” said Mario Matulich, Executive Director of IQPC’s Customer Management Practice.\nThe makeup of the CCW board is comprised of customer experience and contact center leaders from leading brands, such as Microsoft, Comcast, Target and PetSmart.\nAbout Mattersight\nMattersight unleashes the power of personality to improve every interaction with every customer every time. With tools to learn, analyze, and predict customer behavior based on customer conversations, Mattersight helps brands create chemistry with their customers through shorter, more satisfying conversations that increase loyalty. To learn how Mattersight can help you click better with your customers visit www.mattersight.com .\nContact\nDavid Mullen\nChief Financial Officer\n312.954.7380\ndave.mullen@mattersight.com ﻿\nSource:Mattersight Corporation", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/8030dcc8-1445-4af3-abfe-72279df47ecb", "https://www.globenewswire.com/Tracker?data=Ypwdz3FQKAEFsbwXxYyaYxVbaKfsSUnaq0_BBpUoabfVa2USS_yKo1Uh79BanftaOW5vwV6sRFJSJpSj4L9aR6IljqUWb39t5-Ccpd-RFS77FBoAIy3B5XKRAr6poohb", "https://www.globenewswire.com/Tracker?data=EPPMu1sziVEyJS_iS6mzTYANorTkAkA3SrNyJAkgNBooJ4uDS9TqKk1QPWCPIkBJlXrbkTO2eJpvxwYTUKLaKcWUdUEuuAFQSE2UZAzjfCQ="], "published": "2018-01-19T17:13:00.000+02:00", "crawled": "2018-01-19T21:06:19.003+02:00", "highlightTitle": ""}