{"organizations": [], "uuid": "62061fbce133aac4aac5190dba9e356fc45af0a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225409262&w=1200&r=LYNXMPEE0P0D1", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-britain-russia/uk-defence-minister-says-russia-looking-to-cause-thousands-of-deaths-in-britain-idUKKBN1FF0R6", "country": "US", "domain_rank": 408, "title": "UK defence minister says Russia looking to cause thousands of deaths in Britain", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T09:58:00.000+02:00", "replies_count": 0, "uuid": "62061fbce133aac4aac5190dba9e356fc45af0a8"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-russia/uk-defence-minister-says-russia-looking-to-cause-thousands-of-deaths-in-britain-idUKKBN1FF0R6", "ord_in_thread": 0, "title": "UK defence minister says Russia looking to cause thousands of deaths in Britain", "locations": [], "entities": {"persons": [{"name": "gavin williamson", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "brighton beach", "sentiment": "none"}, {"name": "south bay", "sentiment": "none"}, {"name": "scarborough", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}], "organizations": [{"name": "britain reuters staff", "sentiment": "none"}, {"name": "telegraph", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 7:59 AM / Updated 4 hours ago UK defence minister says Russia looking to cause thousands of deaths in Britain Reuters Staff 3 Min Read \nLONDON (Reuters) - Britain’s defence minister warned that Russia was looking to damage the British economy by attacking its infrastructure, a move he said could cause “thousands and thousands and thousands of deaths”, The Telegraph newspaper reported. \nRelations between Russia and Britain are strained. Prime Minister Theresa May last year accused Moscow of military aggression and in December, Foreign Secretary Boris Johnson said there was evidence showing Russian meddling in Western elections. \nBritain has also scrambled jets in recent months to intercept Russian jets near the United Kingdom’s airspace. \n“The plan for the Russians won’t be for landing craft to appear in the South Bay in Scarborough, and off Brighton Beach,” defence minister Gavin Williamson, tipped as a possible successor to May, was quoted as saying by The Telegraph. \n“What they are looking at doing is they are going to be thinking ‘How can we just cause so much pain to Britain?'. Damage its economy, rip its infrastructure apart, actually cause thousands and thousands and thousands of deaths, but actually have an element of creating total chaos within the country.” \nThe Kremlin, which under Vladimir Putin has clawed back some of the global influence lost when the Soviet Union collapsed, has denied meddling in elections in the West. It says anti-Russian hysteria is sweeping through the United States and Europe. \nWilliamson said Russia was look at ways to attack Britain. \n“Why would they keep photographing and looking at power stations, why are they looking at the interconnectors that bring so much electricity and so much energy into our country,” he was quoted as saying. \n“If you could imagine the domestic and industrial chaos that this would actually cause. What they would do is cause the chaos and then step back.” \n“This is the real threat that I believe the country is facing at the moment,” he said. \nThe Russian Defence Ministry said on Friday that Williamson’s comments showed he had lost his understanding of what was reasonable, RIA news agency reported. \n“It is likely he has lost his grasp on reason,” RIA quoted ministry spokesman Igor Konashenkov as saying. Reporting by Costas Pitas; editing by Stephen Addison", "external_links": [], "published": "2018-01-26T09:58:00.000+02:00", "crawled": "2018-01-26T10:13:00.010+02:00", "highlightTitle": ""}