{"organizations": [], "uuid": "8ac91f865a55b89ce872ceeab759ade3cd45f4e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223437370&w=1200&r=LYNXMPEE0I0SQ", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-delta-air-safety-animals/delta-air-to-tighten-onboard-emotional-support-animal-requirements-idUKKBN1F81G9", "country": "US", "domain_rank": 408, "title": "Delta Air to tighten rules for onboard service animals", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T22:39:00.000+02:00", "replies_count": 0, "uuid": "8ac91f865a55b89ce872ceeab759ade3cd45f4e5"}, "author": "", "url": "https://uk.reuters.com/article/us-delta-air-safety-animals/delta-air-to-tighten-onboard-emotional-support-animal-requirements-idUKKBN1F81G9", "ord_in_thread": 0, "title": "Delta Air to tighten rules for onboard service animals", "locations": [], "entities": {"persons": [{"name": "alana wise", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "delta air", "sentiment": "negative"}, {"name": "delta air lines", "sentiment": "none"}, {"name": "delta", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 1:10 PM / Updated an hour ago Delta Air to tighten rules for onboard service animals Alana Wise 3 Min Read \nNEW YORK (Reuters) - Delta Air Lines is tightening the requirements for passengers traveling with onboard service and emotional support animals, the carrier said on Friday, following a sharp uptick in pet-related safety issues in recent years. \nEffective March 1, Delta, the second largest U.S. airline by passenger traffic, said it will require passengers seeking to fly with pets to present additional documents outlining the passenger’s need for the animal and proof of its training and vaccinations, 48 hours prior to the flight. \nThis comes in response to what the carrier said was a 150 percent increase in service and support animals - pets, often dogs, that accompany people with disabilities - carried onboard since 2015. \nAlongside that increase has been an 84 percent spike in the number of reported animal incidents since 2016, including urination and/or defecation, biting, and a high-profile 2017 mauling of a passenger by a 70 pound (32 kg) emotional support dog. \n“The rise in serious incidents involving animals in flight leads us to believe that the lack of regulation in both health and training screening for these animals is creating unsafe conditions across U.S. air travel,” said John Laughter, Delta’s senior vice president of corporate safety, security and compliance, in a statement. \nDelta said that it flies some 700 service animals a day. Among them, customers have attempted to fly with comfort turkeys, gliding possums, snakes, spiders and other unusual pets. A Delta Air Lines Airbus A330 aircraft takes off at the Charles de Gaulle airport in Roissy, France, August 9, 2016. REUTERS/Jacky Naegelen \n“Ignoring the true intent of existing rules governing the transport of service and support animals can be a disservice to customers who have real and documented needs,” Delta said. \nRival carrier American Airlines, the largest U.S. carrier by passenger traffic, said it was examining its own policies regarding onboard service and support animals. \n“Unfortunately, untrained animals can lead to safety issues for our team, our passengers and working dogs onboard our aircraft. We agree with Delta’s efforts and will continue to support the rights of customers, from veterans to people with disabilities, with legitimate needs,” the Fort Worth, Texas-based carrier said in a statement. \nChicago-based United Airlines said it was also reviewing its policy on onboard pets. \nUnder federal law, service animals are permitted to fly in-cabin with their owners, provided they do not pose a threat to the health and safety of others. \nDelta declined to say if it would be open to additional federal intervention, but the carrier had been in touch with the U.S. Department of Transportation prior to issuing the new guidance, it said. Reporting by Alana Wise; Editing by Michael Perry and Rosalba O'Brien", "external_links": [], "published": "2018-01-19T22:39:00.000+02:00", "crawled": "2018-01-19T23:14:16.015+02:00", "highlightTitle": ""}