{"organizations": [], "uuid": "5128ce69ab6bf4483783f582620798317e8f649d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/globe-newswire-myokardia-announces-appointment-of-cynthia-ladd-as-general-counsel.html", "country": "US", "domain_rank": 767, "title": "MyoKardia Announces Appointment of Cynthia Ladd as General Counsel", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T16:30:00.000+02:00", "replies_count": 0, "uuid": "5128ce69ab6bf4483783f582620798317e8f649d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/globe-newswire-myokardia-announces-appointment-of-cynthia-ladd-as-general-counsel.html", "ord_in_thread": 0, "title": "MyoKardia Announces Appointment of Cynthia Ladd as General Counsel", "locations": [], "entities": {"persons": [{"name": "cynthia ladd", "sentiment": "negative"}, {"name": "ladd", "sentiment": "none"}, {"name": "cynthia", "sentiment": "none"}, {"name": "tassos gianakakos", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "cytomx therapeutics, inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SOUTH SAN FRANCISCO, Calif., Jan. 19, 2018 (GLOBE NEWSWIRE) -- MyoKardia, Inc. (Nasdaq:MYOK), a clinical-stage biopharmaceutical company pioneering a precision medicine approach for the treatment of heritable cardiovascular diseases, today announced the expansion of its executive committee with the appointment of Cynthia Ladd as General Counsel.\n“Cynthia brings substantial experience as a biotech executive and expertise in intellectual property, business development, corporate governance and clinical and regulatory matters as well as operations to the MyoKardia leadership team,” said Tassos Gianakakos, MyoKardia’s Chief Executive Officer. “As MyoKardia continues to grow as a company with mavacamten entering late-stage clinical development and our portfolio of targeted cardiovascular therapeutics advancing, Cynthia’s extensive experience and leadership will be highly valued.”\nMs. Ladd joins MyoKardia having most recently served as senior vice president and general counsel for CytomX Therapeutics, Inc. Before joining CytomX in 2015, she was an independent consultant to biotechnology companies (including CytomX), supporting corporate growth by advising on corporate strategy, negotiations around collaborations, and clinical and regulatory issues, as well as acting as general counsel. Prior to her consultancy, she was president and chief executive officer of AGY Therapeutics, leading the company through a successful venture round and its transition to a clinical organization. Ms. Ladd also served as senior vice president and general counsel at Pharmacyclics, where she led various operating groups, including regulatory affairs, advised on corporate governance and compliance, structured negotiations for business development activities and led all the legal activities, including those related to the company’s intellectual property portfolio. Earlier in her career, Ms. Ladd held a number of positions at Genentech, including vice president of corporate law and chief corporate counsel.\nMs. Ladd began her career as an associate with Wilson, Sonsini, Goodrich & Rosati and Ware & Freidenrich (now DLA Piper). She received her law degree from Stanford Law School, a master’s degree in animal nutrition and biochemistry from Cornell University and a bachelor’s degree in animal science from Pennsylvania State University.\nAbout MyoKardia\nMyoKardia is a clinical-stage biopharmaceutical company pioneering a precision medicine approach to discover, develop and commercialize targeted therapies for the treatment of serious and rare cardiovascular diseases. MyoKardia’s initial focus is on the treatment of heritable cardiomyopathies, a group of rare, genetically-driven forms of heart failure that result from biomechanical defects in cardiac muscle contraction. MyoKardia has used its precision medicine platform to generate a pipeline of therapeutic programs for the chronic treatment of the two of the most prevalent forms of heritable cardiomyopathy – hypertrophic cardiomyopathy (HCM), and dilated cardiomyopathy (DCM). MyoKardia’s most advanced product candidate is mavacamten (MYK-461), a novel, oral, allosteric modulator of cardiac myosin that has been shown to reduce hypercontractility in early clinical studies and is currently being studied in the Phase 2 PIONEER-HCM clinical trial. MYK-491, MyoKardia’s second product candidate, is designed to increase the overall extent of the heart’s contraction in DCM patients by increasing cardiac contractility. MyoKardia is currently evaluating MYK-491 in a Phase 1b study in DCM patients. A cornerstone of the MyoKardia platform is the Sarcomeric Human Cardiomyopathy Registry (SHaRe), a multi-center, international repository of clinical and laboratory data on individuals and families with genetic heart disease, which MyoKardia helped form in 2014. MyoKardia’s mission is to change the world for patients with serious cardiovascular disease through bold and innovative science.\nContacts Beth DelGiacco (Investors) Stern Investor Relations, Inc. 212-362-1200 beth@sternir.com Steven Cooper (Media) Edelman 415-486-3264 steven.cooper@edelman.com\nSource:MyoKardia, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/69c7a27b-1b77-4717-878b-d2ff10d08588"], "published": "2018-01-19T16:30:00.000+02:00", "crawled": "2018-01-19T18:21:06.007+02:00", "highlightTitle": ""}