{"organizations": [], "uuid": "a887607793cf9835c0ed8c9db94af195a32ce16b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 253, "shares": 253, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/03/104925752-GettyImages-622468874.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/03/steve-bannon-says-a-june-2016-trump-tower-meeting-was-treasonous.html", "country": "US", "domain_rank": 767, "title": "Steve Bannon says a June 2016 Trump Tower meeting was 'treasonous'", "performance_score": 2, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.11, "site_type": "news", "published": "2018-01-03T16:54:00.000+02:00", "replies_count": 0, "uuid": "a887607793cf9835c0ed8c9db94af195a32ce16b"}, "author": "Tucker Higgins", "url": "https://www.cnbc.com/2018/01/03/steve-bannon-says-a-june-2016-trump-tower-meeting-was-treasonous.html", "ord_in_thread": 0, "title": "Steve Bannon says a June 2016 Trump Tower meeting was 'treasonous'", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "steve bannon", "sentiment": "negative"}, {"name": "michael wolff", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "bannon", "sentiment": "none"}, {"name": "don junior", "sentiment": "none"}, {"name": "jared kushner", "sentiment": "none"}, {"name": "henry holt", "sentiment": "none"}, {"name": "wolff", "sentiment": "none"}, {"name": "trump jr.", "sentiment": "none"}, {"name": "natalia veselnitskaya", "sentiment": "none"}, {"name": "paul mana", "sentiment": "none"}], "locations": [{"name": "trump tower", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}], "organizations": [{"name": "trump white house", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "fbi", "sentiment": "none"}, {"name": "trump tower", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Steve Bannon said a June 2016 Trump Tower meeting between the president's eldest son and a Russian lawyer was \"treasonous\" and \"unpatriotic,\" The Guardian reported Wednesday.\nPresident Donald Trump 's former chief strategist made his comments in an interview with author Michael Wolff for a book out next week , the newspaper said.\n\"Even if you thought that this was not treasonous, or unpatriotic, or bad, and I happen to think it's all of that, you should have called the FBI immediately,\" Bannon told Wolff, adding an expletive.\nIn a statement, the president said: \"Steve Bannon has nothing to do with me or my Presidency. When he was fired, he not only lost his job, he lost his mind.\"\nBannon's comments appear in \"Fire and Fury: Inside the Trump White House,\" which is based on more than 200 interviews with the president and members of his staff. The book will be published Jan. 9 by Henry Holt.\n\"They're going to crack Don Junior like an egg on national TV,\" Bannon predicts.\nTrump Jr. helped set up the Trump Tower meeting with Russian lawyer Natalia Veselnitskaya, senior Trump campaign officials, and other Russians.\nThe meeting, first reported by The New York Times last summer, was also attended by Trump senior advisor Jared Kushner and campaign chairman Paul Manafort .\nWhile Trump Jr. has said that the purpose of the meeting was to discuss damaging information on Democrat presidential candidate Hillary Clinton , Veselnitskaya has claimed that the meeting would cover The Magnitsky Act, the 2012 U.S. sanctions law against Russia.\nBannon did say that if the meeting was necessary, there were better ways of pulling it off. He suggested hosting the meeting in a \"Holiday Inn in Manchester, New Hampshire,\" and between lawyers, not senior campaign officials.\nThe information could then be delivered \"to Breitbart or something like that, or maybe some other more legitimate publication.\"\nBannon was the head of the right-wing news outlet Breitbart News until joining the Trump campaign as its CEO. After departing the Trump administration in August following seven months in the White House, he returned to Breitbart as its executive chairman.\nAn attorney for Trump Jr. did not respond to a CNBC request for comment. Attempts to reach Bannon were unsuccessful.\nThe Guardian said it obtained a copy of the book ahead of publication from a bookseller in New England.\nWolff is a columnist and author, who previously wrote \"The Man Who Owns the News,\" a book about Rupert Murdoch. His work often appears in The Guardian.\nRead the full report at The Guardian here.", "external_links": [], "published": "2018-01-03T16:54:00.000+02:00", "crawled": "2018-01-03T16:54:43.005+02:00", "highlightTitle": ""}