{"organizations": [], "uuid": "61525990da6ad4e7f18b37ff540b53f4d94e47df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 33, "shares": 33, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222074365&w=1200&r=LYNXMPEE0E0B6", "site_section": "http://feeds.reuters.com/reuters/UKdomesticNews", "section_title": "Reuters: UK", "url": "https://uk.reuters.com/article/uk-carillion-restructuring/britains-carillion-collapses-idUKKBN1F40ME", "country": "US", "domain_rank": 408, "title": "Britain's Carillion collapses", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T09:06:00.000+02:00", "replies_count": 0, "uuid": "61525990da6ad4e7f18b37ff540b53f4d94e47df"}, "author": "", "url": "https://uk.reuters.com/article/uk-carillion-restructuring/britains-carillion-collapses-idUKKBN1F40ME", "ord_in_thread": 0, "title": "Britain's Carillion collapses", "locations": [], "entities": {"persons": [{"name": "kate holton", "sentiment": "none"}, {"name": "reuters/simon dawson", "sentiment": "none"}, {"name": "philip green", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "carillion", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 7:06 AM / Updated 7 minutes ago UK government seeks to limit damage after Carillion collapses Kate Holton 5 Min Read \nLONDON (Reuters) - Britain’s Carillion collapsed on Monday after its banks lost faith in the construction and services company, forcing the government to step in to guarantee major public works contracts. Carillion's Midland Metropolitan Hospital construction site is seen after the company went into liquidation, in Smethwick, Britain January 15, 2018. REUTERS/Darren Staples \nIn one of the biggest British corporate failures in recent years, Carillion went into compulsory liquidation after costly contract delays and a slump in new business left it swamped by debt and pensions liabilities of around 1.5 billion pounds. \nThe demise of the 200-year-old business poses a headache for Theresa May’s government which had employed Carillion to work on 450 projects including the building and maintenance of hospitals, prisons, defence sites and a high-speed rail line. \nThe government’s priority is to ensure that public services are not disrupted, said David Lidington, the minister in charge of the Cabinet Office which oversees the running of government. \nSome contracts handled by Carillion would go to alternative providers, he added. Lidington urged the company’s staff to continue to work and said the government would pay their salaries. \nAlthough the government has promised to support workers and ensure contracts are delivered, it has stopped short of bailing out the company as it did with major banks during the financial crisis almost a decade ago. WEEKEND TALKS FAIL \nCarillion owed around 900 million pounds to banks which include the country’s five biggest - RBS, Santander UK, Lloyds, HSBC and Barclays - and it has a pension deficit of 580 million pounds. \n“In recent days we have been unable to secure the funding to support our business plan and it is therefore with the deepest regret that we have arrived at this decision,” Chairman Philip Green said. \n“This is a very sad day for Carillion, for our colleagues, suppliers and customers that we have been proud to serve over many years.” \nEmploying 43,000 people around the world, including 20,000 in Britain, Carillion has been fighting for survival since July when it revealed it was losing cash on several projects and had written down the value of its contract book by 845 million pounds. \nWith banks refusing to accept the group’s latest attempt to restructure, May’s senior ministers met around the clock in recent days, under pressure from the opposition Labour Party and unions not to use taxpayer money to prop up the failing company. \nMinisters, top bankers and company bosses scrambled to find a way to save the company in last ditch talks over the weekend. But Carillion announced its own “compulsory liquidation” just over an hour before the London Stock Exchange opened on Monday. A woman cleans a branded door at Carillion's headquarters after the company went into liquidation, in Wolverhampton, Britain, January 15, 2018. REUTERS/Darren Staples GOVERNMENT UNDER PRESSURE \nSpun out of Tarmac nearly 20 years ago and having bought Alfred McAlpine in 2008, Carillion has worked on major construction projects including London’s Royal Opera House, the Suez Canal road tunnel and Toronto’s Union Station. \nIn July last year, a week after its initial profit warning, it was named as one of the contractors on Britain’s new High Speed 2 rail line, a flagship project that will better connect London with the north of England. \nAt its headquarters in Wolverhampton, central England, a handful of workers could be seen holding meetings. \nShares in rival businesses such as G4S, Interserve, Balfour Beatty and Kier Group advanced on hopes they would pick up some additional work. Slideshow (7 Images) \nHowever, Balfour, which worked with Carillion on three British road projects, said the collapse would probably cost it between 35 and 45 million pounds. \nThe company’s collapse comes at a difficult time for May who is trying to negotiate Britain’s exit from the European Union. \nThe opposition Labour Party questioned why May’s government continued to award contracts to Carillion despite its profit warnings and questioned why Britain had handed over so much of its public service work to private companies. \n“This company issued three profit warnings in the last six months yet despite those profit warnings the government continued to award government contracts to this company,” Labour’s business spokeswoman Rebecca Long-Bailey told BBC TV. \n“We’re ... asking for a full investigation into the government conduct of this matter.” \nMany of Britain’s service providers have been hit in recent years after they took on work during the financial crisis at low prices for long-running, fixed-price contracts. \nThe contracts left little room for delay or failure and have led to problems for groups including Capita, Mitie and Interserve. \n“Taxpayers cannot be expected to bail out a private sector company,” Lidington said. \n“All employees should keep coming to work, you will continue to get paid. Staff that are engaged on public sector contracts still have important work to do.” Reporting by Kate Holton; editing by Guy Faulconbridge/Keith Weir", "external_links": [], "published": "2018-01-15T09:06:00.000+02:00", "crawled": "2018-01-15T09:23:07.001+02:00", "highlightTitle": ""}