{"organizations": [], "uuid": "3b7c7e68fa0b3ced53757fe1cfae9145796bf467", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-ecolab-comments-on-expected-impact-of-u-s-tax-cuts-and-jobs-act-announces-intent-to-contribute-25-million-to-ecolab.html", "country": "US", "domain_rank": 767, "title": "Ecolab Comments on Expected Impact of U.S. Tax Cuts and Jobs Act, Announces Intent to Contribute $25 Million to Ecolab Foundation, and Forecasts Double-Digit 4Q 2017 and Full Year 2018 Adjusted EPS Growth", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T16:30:00.000+02:00", "replies_count": 0, "uuid": "3b7c7e68fa0b3ced53757fe1cfae9145796bf467"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-ecolab-comments-on-expected-impact-of-u-s-tax-cuts-and-jobs-act-announces-intent-to-contribute-25-million-to-ecolab.html", "ord_in_thread": 0, "title": "Ecolab Comments on Expected Impact of U.S. Tax Cuts and Jobs Act, Announces Intent to Contribute $25 Million to Ecolab Foundation, and Forecasts Double-Digit 4Q 2017 and Full Year 2018 Adjusted EPS Growth", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "minn.", "sentiment": "none"}], "organizations": [{"name": "ecolab foundation", "sentiment": "neutral"}, {"name": "st. paul", "sentiment": "neutral"}, {"name": "ecolab", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "2018 Adjusted EPS Expected to Rise 12% to 16% to the $5.25-$5.45 Range\nST. PAUL, Minn.--(BUSINESS WIRE)-- As a result of the passage of the U.S. Tax Cuts and Jobs Act and based on currently available information, Ecolab expects to record a net discrete tax benefit in the fourth quarter of 2017 of approximately $0.45 to $0.55 per share. The net discrete tax benefit results from the re-measurement of net U.S. deferred tax liabilities at a lower future corporate tax rate, partially offset by tax expense from deemed repatriated earnings of foreign subsidiaries. Beginning in 2018, Ecolab expects the U.S. Tax Cuts and Jobs Act to benefit earnings by approximately $0.10 per share.\nIn response to the passage of the new U.S. tax law, Ecolab announced its intent to make a $25 million contribution to the Ecolab Foundation. Since 1986, the Ecolab Foundation has contributed more than $100 million to communities in which we do business by providing basic needs, including hunger relief and affordable housing; supporting education, the arts and environmental conservation; as well as providing support to global relief organizations during times of natural disasters.\nEcolab also said that it expects to report improved sales momentum and double-digit adjusted earnings growth in its fourth quarter ended Dec. 31, 2017, and for that momentum to continue and lead to strong growth into 2018 with adjusted diluted earnings per share expected to rise 12% to 16% to the $5.25 to $5.45 range.\nDouglas M. Baker, Jr., Ecolab’s Chairman and Chief Executive Officer, said, “We finished 2017 in a strong fashion, with better than forecasted sales growth and double-digit adjusted earnings per share growth in the fourth quarter. Sales rose 9%, with 6% fixed currency acquisition adjusted growth, led by good volume gains and accelerating pricing. All operating segments showed improving sales growth, with Energy recording double-digit gains. We plan on again driving growth in 2018 using new product introductions, superior sales and service execution, new account wins, improved customer penetration and pricing. We will also continue to focus on improved operating efficiency to leverage our top line gains and yield margin improvement.\n“With our business focused on helping our customers deliver on fundamental global needs including clean water, safe food, abundant energy and healthy environments, we believe we are very well-positioned to deliver superior growth in 2018 and beyond. We will continue to invest in our business to further build our product and service capabilities as well as our business base so that we can better serve our customers, and as a result, generate superior returns for our shareholders. We remain excited by our opportunities and by our terrific team.”\nBusiness Outlook\n2017\nTaking into account the significant net discrete tax benefit resulting from the implementation of the U.S. Tax Cuts and Jobs Act described above, fourth quarter reported diluted earnings per share are expected to be in the $1.84 to $1.98 range, with full year 2017 reported diluted earnings per share expected to be in the $5.05 to $5.19 range. As a result of the new U.S. tax law and based on currently available information, Ecolab expects to record a net discrete tax benefit in the fourth quarter of 2017 of approximately $0.45 to $0.55 per share. In addition to the net discrete tax benefit described above, we expect additional special gains and charges and other discrete tax items for the fourth quarter to be a net benefit of $0.01 to $0.03 per share. Special gains and charges and discrete tax items for the full year 2017 are expected to be a net benefit in the $0.37 to $0.49 range. Ecolab’s reported diluted earnings per share were $1.24 in the fourth quarter 2016 and were $4.14 for the full year 2016.\nEcolab expects fourth quarter 2017 adjusted diluted earnings per share, excluding special gains and charges and discrete tax items, to continue to show sequential quarterly improvement, rising 10% to 12% to the $1.38 to $1.40 range. Full year 2017 adjusted diluted earnings per share is expected to rise 7% to 8% to the $4.68 to $4.70 range. Ecolab’s adjusted diluted earnings per share were $1.25 in the fourth quarter 2016 and $4.37 for the full year 2016.\nEcolab expects to announce final 2017 results February 20, 2018.\n2018\nEcolab looks for the improved sales and earnings momentum to continue in 2018 with growth in all segments. The new US tax law is expected to benefit the 2018 tax rate, with an expected adjusted tax rate of approximately 22%, providing an approximate $0.10 benefit to adjusted diluted earnings per share. Including the expected tax benefit, Ecolab expects 2018 adjusted diluted earnings per share to rise approximately 12% to 16% to the $5.25 to $5.45 range, excluding special gains and charges and discrete tax items, with second half earnings growth outpacing the first half, reflecting the expected impact of higher delivered product costs and increased systems investments, both of which are expected to have an outsized impact on the first half. Reflecting these, first quarter 2018 adjusted diluted earnings per share are expected to be in the $0.84 to $0.92 range and compare to $0.80 earned in the first quarter 2017.\nWe expect special charges in 2018 to be $0.12 to $0.15 per share principally related to the contribution to the Ecolab Foundation as well as integration of previously announced acquisitions and previously announced restructuring plans. In addition, the discrete tax item related to excess tax benefits on share-based compensation is expected to be favorable. Other than this discrete tax item and special gains and charges noted above, other such expected amounts are not currently quantifiable.\nWe do not provide reconciliations for non-GAAP estimates on a forward-looking basis (including those contained in this report) when we are unable to provide a meaningful or accurate calculation or estimation of reconciling items and the information is not available without unreasonable effort. This is due to the inherent difficulty of forecasting the timing and amount of various items that have not yet occurred, are out of our control and/or cannot be reasonably predicted, and that would impact reported earnings per share and the reported tax rate, the most directly comparable forward-looking GAAP financial measures to adjusted earnings per share and the adjusted tax rate. For the same reasons, we are unable to address the probable significance of the unavailable information.\nAbout Ecolab\nA trusted partner at more than one million customer locations, Ecolab (ECL) is the global leader in water, hygiene and energy technologies and services that protect people and vital resources. With 2016 sales of $13 billion and 48,000 associates, Ecolab delivers comprehensive solutions and on-site service to promote safe food, maintain clean environments, optimize water and energy use and improve operational efficiencies for customers in the food, healthcare, energy, hospitality and industrial markets in more than 170 countries around the world. For more Ecolab news and information, visit www.ecolab.com .\nCautionary Statements Regarding Forward-Looking Information\nThis communication contains certain statements relating to future events and our intentions, beliefs, expectations and predictions for the future which are forward-looking statements as that term is defined in the Private Securities Litigation Reform Act of 1995. Words or phrases such as “will likely result,” “are expected to,” “will continue,” “is anticipated,” “we believe,” “we expect,” “estimate,” “project,” “may,” “will,” “intend,” “plan,” “believe,” “target,” “forecast” (including the negative or variations thereof) or similar terminology used in connection with any discussion of future plans, actions or events generally identify forward-looking statements. These forward-looking statements include, but are not limited to, statements regarding our financial and business performance and prospects, including forecasted 2017 fourth quarter and 2017 and 2018 full-year financial and business results, including sales growth, reported and adjusted diluted earnings per share, delivered product costs, new systems investments, special gains and charges and quantifiable discrete tax items, adjusted tax rates and the impact of the new US tax law. These statements are based on the current expectations of management of the company. There are a number of risks and uncertainties that could cause actual results to differ materially from the forward-looking statements included in this communication. In particular, the ultimate results of any restructuring, integration and business improvement actions, including cost synergies, depend on a number of factors, including the development of final plans, the impact of local regulatory requirements regarding employee terminations, the time necessary to develop and implement the restructuring and other business improvement initiatives and the level of success achieved through such actions in improving competitiveness, efficiency and effectiveness.\nAdditional risks and uncertainties that may affect operating results and business performance are set forth under Item 1A of our most recent Form 10-K and our other public filings with the Securities and Exchange Commission (the \"SEC\") and include the vitality of the markets we serve, including the impact of oil price fluctuations on the markets served by our Global Energy segment; the impact of economic factors such as the worldwide economy, capital flows, interest rates and foreign currency risk, including reduced sales and earnings in other countries resulting from the weakening of local currencies versus the U.S. dollar; our ability to attract and retain high caliber management talent to lead our business; our ability to execute key business initiatives, including upgrades to our information technology systems; potential information technology infrastructure failures and cybersecurity attacks; exposure to global economic, political and legal risks related to our international operations including with respect to our operations in Russia; the costs and effects of complying with laws and regulations, including those relating to the environment and to the manufacture, storage, distribution, sale and use of our products; the occurrence of litigation or claims, including related to the Deepwater Horizon oil spill; our ability to develop competitive advantages through innovation; difficulty in procuring raw materials or fluctuations in raw material costs; our substantial indebtedness; our ability to acquire complementary businesses and to effectively integrate such businesses; restraints on pricing flexibility due to contractual obligations; pressure on operations from consolidation of customers, vendors or competitors; public health epidemics; potential losses arising from the impairment of goodwill or other assets; potential loss of deferred tax assets; changes in tax law and unanticipated tax liabilities; potential chemical spill or release; potential class action lawsuits; the loss or insolvency of a major customer or distributor; acts of war or terrorism; natural or man-made disasters; water shortages; severe weather conditions; and other uncertainties or risks reported from time to time in our reports to the SEC. In light of these risks, uncertainties, assumptions and factors, the forward-looking events discussed in this communication may not occur. We caution that undue reliance should not be placed on forward-looking statements, which speak only as of the date made. Ecolab does not undertake, and expressly disclaims, any duty to update any forward-looking statement whether as a result of new information, future events or changes in expectations, except as required by law.\nNon-GAAP Financial Information\nThis news release and certain of the accompanying tables include financial measures that have not been calculated in accordance with accounting principles generally accepted in the U.S. (“GAAP”), including adjusted diluted earnings per share, acquisition adjusted fixed currency sales and the adjusted tax rate.\nWe provide these measures as additional information regarding our operating results. We use these non-GAAP measures internally to evaluate our performance and in making financial and operational decisions, including with respect to incentive compensation. We believe that our presentation of these measures provides investors with greater transparency with respect to our results of operations and that these measures are useful for period-to-period comparison of results.\nOur non-GAAP financial measures for diluted earnings per share and tax rate exclude the impact of special (gains) and charges and the impact of discrete tax items. We include items within special (gains) and charges and discrete tax items that we believe can significantly affect the period-over-period assessment of operating results and not necessarily reflect costs associated with historical trends and future results. After tax special (gains) and charges are derived by applying the applicable local jurisdictional tax rate to the corresponding pre-tax special (gains) and charges.\nWe evaluate the performance of our international operations based on fixed currency rates of foreign exchange, which eliminate the translation impact of exchange rate fluctuations on our international results. Fixed currency amounts included in this release are based on translation into U.S. dollars at the fixed foreign currency exchange rates established by management at the beginning of 2017. We also provide our segment results based on public currency rates for informational purposes.\nAcquisition adjusted growth rates exclude the results of any acquired business from the first twelve months post acquisition and exclude the results of divested businesses from the previous twelve months prior to divestiture. Acquisition adjusted growth rates also exclude sales to our Venezuelan deconsolidated subsidiaries from both the current period and comparable period of the prior year.\nThese non-GAAP financial measures are not in accordance with, or an alternative to, GAAP and may be different from non-GAAP measures used by other companies. Investors should not rely on any single financial measure when evaluating our business. We recommend that investors view these measures in conjunction with the GAAP measures included in this news release.\nThe table below provides a reconciliation of the percentage components for acquisition adjusted fixed currency sales growth for the fourth quarter ended December 31, 2017 over the fourth quarter ended December 31, 2016.\nAcquisition adjusted fixed currency sales increase 6% Currency impact 2% Acquisitions & divestitures sales increase 1% Reported GAAP sales increase 9% (ECL-E)\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123005346/en/\nEcolab Inc.\nMichael J. Monahan, 651-250-2809\nor\nAndrew C. Hedberg, 651-250-2185\nSource: Ecolab Inc.", "external_links": ["http://www.businesswire.com/news/home/20180123005346/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ecolab.com&esheet=51747220&newsitemid=20180123005346&lan=en-US&anchor=www.ecolab.com&index=1&md5=04e60e540809330f98cae9d617f505c9"], "published": "2018-01-23T16:30:00.000+02:00", "crawled": "2018-01-23T17:32:07.005+02:00", "highlightTitle": ""}