{"organizations": [], "uuid": "101c909300d05fc7a22f3cd1d592a0b1386e33ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-delek-us-announces-repurchase-of-2-point-0-million-shares-from-affiliates-of-alon-israel.html", "country": "US", "domain_rank": 767, "title": "Delek US Announces Repurchase of 2.0 million Shares from Affiliates of Alon Israel", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T01:00:00.000+02:00", "replies_count": 0, "uuid": "101c909300d05fc7a22f3cd1d592a0b1386e33ac"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-delek-us-announces-repurchase-of-2-point-0-million-shares-from-affiliates-of-alon-israel.html", "ord_in_thread": 0, "title": "Delek US Announces Repurchase of 2.0 million Shares from Affiliates of Alon Israel", "locations": [], "entities": {"persons": [{"name": "alon israel", "sentiment": "none"}, {"name": "uzi yemin", "sentiment": "none"}], "locations": [{"name": "alon israel brentwood", "sentiment": "none"}, {"name": "tenn.", "sentiment": "none"}, {"name": "alon israel", "sentiment": "none"}], "organizations": [{"name": "delek us", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "delek us holdings, inc.", "sentiment": "neutral"}, {"name": "delek", "sentiment": "none"}, {"name": "alon israel oil company, ltd.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BRENTWOOD, Tenn., Jan. 23, 2018 (GLOBE NEWSWIRE) -- Delek US Holdings, Inc. (NYSE:DK) (“Delek”) announced today that it closed a transaction to repurchase 2.0 million shares of Delek common stock from Alon Israel Oil Company, Ltd. (“Alon Israel”) in connection with Delek’s rights pursuant to a Stock Purchase Agreement dated April 14, 2015 (the “SPA”), by and between Delek and Alon Israel. Alon Israel delivered a ROFO Notice (as defined in the SPA) to Delek on January 16, 2018 informing Delek of Alon Israel’s intention to sell the 2.0 million shares, and Delek accepted such offer on January 17, 2018. The total purchase price was approximately $75.3 million, or $37.64 per share. Following this repurchase, there is approximately $43.0 million remaining under Delek US’ $150.0 million share repurchase authorization.\nUzi Yemin, Chairman, President and Chief Executive Officer of Delek said, “We are committed to using our financial flexibility to return cash to our shareholders and began repurchasing shares during the fourth quarter 2017. Including this transaction, approximately 3.0 million shares have been repurchased for approximately $107.0 million. Going forward, we expect to continue to return cash to shareholders as part of our capital allocation program based on our financial flexibility and operating performance.”\nAbout Delek US Holdings, Inc.\nDelek is a diversified downstream energy company with assets in petroleum refining, logistics, asphalt, renewable fuels and convenience store retailing. The refining assets consist of refineries operated in Tyler and Big Spring, Texas, El Dorado, Arkansas and Krotz Springs, Louisiana with a combined nameplate crude throughput capacity of 302,000 barrels per day. As of July 1, 2017, Delek, through its subsidiaries, owns 100 percent of the general partner and 81.6 percent of the limited partner interest in Alon USA Partners, LP (NYSE:ALDW), which owns the crude oil refinery in Big Spring, Texas, with a crude oil throughput capacity of 73,000 barrels per day and an integrated wholesale marketing business.\nThe logistics operations primarily consist of Delek Logistics Partners, LP (NYSE:DKL). Delek and its affiliates also own approximately 63 percent (including the 2 percent general partner interest) of Delek Logistics Partners, LP. Delek Logistics Partners, LP is a growth-oriented master limited partnership focused on owning and operating midstream energy infrastructure assets.\nThe asphalt operations consist of owned or operated asphalt terminals serving markets from Tennessee to the West Coast through a combination of non-blended asphalt purchased from third parties and production at the Big Spring, Texas and El Dorado, Arkansas refineries. The renewables operations consist of plants in Texas and Arkansas that produce biodiesel fuel.\nThe convenience store retail business is the largest 7-Eleven licensee in the United States and operates approximately 300 convenience stores in central and west Texas and New Mexico.\nSafe Harbor Provisions Regarding Forward-Looking Statements\nThis press release contains that are based upon current expectations and involve a number of risks and uncertainties. Statements concerning current estimates, expectations and projections about future results, performance, prospects, opportunities, plans, actions and events and other statements, concerns, or matters that are not historical facts are “ ,” as that term is defined under the federal securities laws. These include, but are not limited to, statements regarding the repurchase by Delek of 2.0 million shares and the terms and timing thereof, repurchase of Delek shares up to $150.0 million or at all, our ability to return cash to shareholders, future operating performance, financial flexibility and our usage thereof, our ability to repurchase shares during 2018 or at all, and other factors.\nForward-looking statements should not be read as a guarantee of future performance or results and will not be accurate indications of the times at, or by, which such performance or results will be achieved. Forward-looking information is based on information available at the time and/or management's good faith belief with respect to future events, and is subject to risks and uncertainties that could cause actual performance or results to differ materially from those expressed in the statements. Delek undertakes no obligation to update or revise any such , except as required by applicable law or regulation.\nContact:\nU.S. Investor / Media Relations Contact:\nKeith Johnson\nDelek US Holdings, Inc.\nVice President of Investor Relations\n615-435-1366\nSource:Delek US Holdings, Inc", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/868a1c5d-8c22-44e4-abdf-3dc8125a4c4d"], "published": "2018-01-24T01:00:00.000+02:00", "crawled": "2018-01-24T01:24:24.031+02:00", "highlightTitle": ""}