{"organizations": [], "uuid": "2b0e7c140513ed7ee924f39d304ed4318138a06c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/02/the-associated-press-lawsuit-duke-unc-agreed-to-not-hire-each-others-doctors.html", "country": "US", "domain_rank": 767, "title": "Lawsuit: Duke, UNC agreed to not hire each other's doctors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T17:31:00.000+02:00", "replies_count": 0, "uuid": "2b0e7c140513ed7ee924f39d304ed4318138a06c"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/02/the-associated-press-lawsuit-duke-unc-agreed-to-not-hire-each-others-doctors.html", "ord_in_thread": 0, "title": "Lawsuit: Duke, UNC agreed to not hire each other's doctors", "locations": [], "entities": {"persons": [{"name": "duke", "sentiment": "negative"}, {"name": "danielle seaman", "sentiment": "none"}], "locations": [{"name": "raleigh", "sentiment": "none"}, {"name": "n.c.", "sentiment": "none"}], "organizations": [{"name": "duke university", "sentiment": "negative"}, {"name": "unc", "sentiment": "negative"}, {"name": "university of north caro", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "duke university health system", "sentiment": "none"}, {"name": "u.s. district judge catherine eagles", "sentiment": "none"}, {"name": "seaman", "sentiment": "none"}, {"name": "unc-chapel hill", "sentiment": "none"}, {"name": "university of north car", "sentiment": "none"}, {"name": "duke", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "RALEIGH, N.C. (AP) — The basketball rivalry between Duke University and the University of North Carolina battle is legendary, but a federal lawsuit says the two elite institutions have agreed not to compete in another prestigious area: the market for highly skilled medical workers.\nThe anti-trust complaint by a former Duke radiologist accuses the schools just 10 miles (16 kilometers) apart of secretly conspiring to avoid poaching each other's professors. If her lawyers succeed in persuading a judge to make it a class action, thousands of faculty, physicians, nurses and other professionals could be affected.\n\"The intended and actual effect of this agreement is to suppress employee compensation, and to impose unlawful restrictions on employee mobility,\" Dr. Danielle Seaman's lawyers wrote.\nU.S. District Judge Catherine Eagles expects to hear arguments Thursday on whether Seaman's complaint should include all skilled medical workers employed between 2012 and 2017 at the Duke medical school, the Duke University Health System, the UNC-Chapel Hill med school and the University of North Carolina Health Care System.\nEagles could approve a smaller class instead, perhaps limiting the litigation to faculty members and medical doctors. The two medical schools together employ about 3,000 faculty members, the lawsuit said.\nThe judge also is considering a proposed settlement between UNC and Seaman's team, which has experience securing major antitrust settlements from powerful companies. Her San Francisco law firm got $415 million from Google Inc., Intel Corp., Adobe Systems Inc. and Apple Inc., in 2015 after accusing them of agreeing not to hire each other's best workers.\nSeaman's lawyers made this deal in part because as a public institution, UNC could invoke constitutional limits on federal lawsuits against states, and in part because UNC would be required to deliver a trove of documents, data and testimony supporting her efforts to win monetary damages from Duke, a private university in Durham.\nUNC wouldn't pay any money in the settlement, and would promise not to participate in any unlawful restraints on competition.\nBoth UNC and Duke deny the existence of the no-hire agreement that Seaman claims was reached by top administrators to allow promotions while preventing lateral transfers.\nBut Seaman's complaint cites emails referencing the inside deal after an employment courtship of more than three years with UNC's chief of cardiothoracic imaging ended in frustration.\n\"I agree that you would be a great fit for our cardiothoracic imaging division. Unfortunately, I just received confirmation today from the Dean's office that lateral moves of faculty between Duke and UNC are not permitted. There is reasoning for this 'guideline' which was agreed upon between the deans of UNC and Duke a few years back. I hope you understand,\" Dr. Paul Molina wrote in 2015.\nDisappointed, Seaman wrote that \"there are only two academic centers in this area where I could work, and I am already at one of them.\"\nMolina then said the agreement was hatched to reduce competition and costs after a previous effort by Duke to recruit UNC faculty.\n\"Dear Danielle, . . . In answer to your question, the 'guideline' was generated in response to an attempted recruitment by Duke a couple of years ago of the entire UNC bone marrow transplant team; UNC had to generate a large retention package to keep the team intact,\" his email said.\nMolina said when he was deposed that he was already preparing an offer to another candidate when Seaman's application arrived. Only two of the 116 pages transcribing his deposition were included in a filing not under seal, and Molina doesn't address the alleged no-hire agreement in that fragment.\nSeaman's lawyers say other emails within the two medical schools also mentioned the prohibition on recruiting or hiring from the other school. Internal records produced so far amount to more than 220,000 pages of documents and 70 gigabytes of employee data, nearly all of it under seal, they wrote to the court.\nSeaman's employment at Duke ended in September 2015, three months after she filed suit. Neither Duke nor her lawyers would explain why. She retains an unpaid courtesy appointment as a Duke instructor, which enables her to supervise Duke residents who rotate through the local Veterans Administration hospital, Duke spokesman Michael Schoenfeld told The Associated Press.\nMeanwhile, another Duke radiologist's testimony could undercut her claim.\nDr. Laura Heyneman worked and taught at UNC. She transferred to Duke in November 2015, Schoenfeld said.\nHeyneman said in her deposition that Molina never told her about any recruiting restrictions while she was at UNC. She said she thinks Molina invented the idea of a no-hire pact to save face as he turned Seaman down.\n\"It would be essentially an easier excuse, because it wouldn't be personal for him to essentially blame the higher-ups rather than accepting responsibility and saying he didn't want to hire Danielle,\" Heyneman testified.\nFollow Emery P. Dalesio at http://twitter.com/emerydalesio . His work can be found at http://bigstory.ap.org/content/emery .", "external_links": [], "published": "2018-01-02T17:31:00.000+02:00", "crawled": "2018-01-03T08:49:02.013+02:00", "highlightTitle": ""}