{"organizations": [], "uuid": "af8cd991b206cc08dc0a9f175b6f0714c9e917e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-electronic-merchant-systems-announces-move-of-its-headquarters-to-downtown-cleveland.html", "country": "US", "domain_rank": 767, "title": "Electronic Merchant Systems Announces Move Of Its Headquarters To Downtown Cleveland", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T16:24:00.000+02:00", "replies_count": 0, "uuid": "af8cd991b206cc08dc0a9f175b6f0714c9e917e9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-electronic-merchant-systems-announces-move-of-its-headquarters-to-downtown-cleveland.html", "ord_in_thread": 0, "title": "Electronic Merchant Systems Announces Move Of Its Headquarters To Downtown Cleveland", "locations": [], "entities": {"persons": [{"name": "daniel neistadt", "sentiment": "none"}], "locations": [{"name": "cleveland cleveland", "sentiment": "none"}, {"name": "west huron building at tower city center", "sentiment": "none"}, {"name": "tower city center", "sentiment": "none"}, {"name": "downtown cleveland", "sentiment": "none"}, {"name": "west huron", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "cleveland", "sentiment": "none"}], "organizations": [{"name": "electronic merchant systems", "sentiment": "negative"}, {"name": "ems", "sentiment": "negative"}, {"name": "chase financial plaza", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CLEVELAND, Jan. 5, 2018 /PRNewswire/ -- Electronic Merchant Systems (EMS) announced today that it will be relocating its corporate headquarters to Downtown Cleveland in mid-2018 as its business continues to expand. EMS has signed a lease with Bedrock for approximately 48,000 square feet of office space in the 250 West Huron Building at Tower City Center. This ideal location occupies the entire fourth floor and a portion of the fifth floor of Tower City Center's former Chase Financial Plaza, and will comfortably accommodate EMS' growing work force, which is currently based outside of downtown Cleveland in Independence, Ohio.\n\"We're excited to start the process of creating a new headquarters that reflects our winning culture and will help us attract and retain great talent in Cleveland,\" said Daniel Neistadt, CEO. \"Our growth has been significant, and we were drawn to the 250 West Huron building because of its central location, which will enable our employees to fully experience the city of Cleveland and what it has to offer, as well as Bedrock's reputation for outstanding management and tenant relations. This first-class space will be large enough to accommodate our current needs, as well as those driven by EMS' continuing growth.\"\n\"The decision by Electronic Merchant Systems to move over 180 jobs to Cleveland is a welcomed decision,\" said Cleveland Mayor Frank G. Jackson. \"Their choice to relocate to our great City will provide them with an environment where they can continue to grow, recruit talent and create jobs.\"\n\"Electronic Merchant Systems is an exciting addition to downtown Cleveland's commercial landscape,\" said Bedrock's chairman and founder, Dan Gilbert. \"Tower City is at the core of Bedrock's Cleveland investments, and is the perfect location for a FinTech leader like EMS. As more and more people choose downtown to live work and play, we are looking forward to helping meet the growing demand for modern, tech-friendly office space and building Cleveland's profile as a true destination for flourishing new economy businesses.\"\nAbout Electronic Merchant Systems\nElectronic Merchant Systems ( www.emscorporate.com ) has been helping small to mid-sized business owners realize their full potential since 1988. Headquartered in Northeast Ohio, EMS currently has sales offices across the country. EMS provides trouble-free deployment of customizable payment applications that will increase business profitability. EMS currently services tens of thousands of retail, internet, and start-up businesses nationwide by handling over $3 billion of their annual payment card transactions. EMS' mission is to be the industry leader in payment services by providing an innovative suite of business solutions, a high level of quality service, and having professional, dedicated employees that increase the financial well-being of its' clients.\nElectronic Merchant Systems has a vested interest in the health, happiness and growth of its community. As part of its continued commitment to the Cleveland community, EMS and its employees continue to work with longtime partner, Coach Sam's Inner Circle Foundation, whose mission is to provide educational support to at risk children. EMS also cherishes its partnership with Cornerstone of Hope, a center for grieving children, teens and adults. EMS also is grateful to be working with the Greater Cleveland Food Bank, Providence House, the Cleveland Indians Community Partners program, and the Cleveland Browns / U.S. Marines Toys for Tots program.\nAbout Cleveland\nDowntown Cleveland is the largest central business district in the State of Ohio in terms of employment and population with over 95,000 jobs and 15,000 residents. Historic preservation and adaptive reuse to underutilized office buildings have added over 1,000 new units of housing to the market in 2017. Thriving independent restaurants, cafés, technology start-ups, business attraction, parks, sports, arts & culture and a public-private partnership with mixed-use development projects along the City's cherished natural resources , Lake Erie and the Cuyahoga River, have created a thriving and vibrant walkable City for businesses like EMS.\nAbout Bedrock\nTower City is owned and managed by Detroit-based Bedrock, a full service commercial real estate firm, whose portfolio includes more than 100 properties in Detroit and Cleveland. Together with Bedrock affiliates, other Cleveland holdings include the recently-renovated Ritz-Carlton Cleveland, the Higbee Building and the May Company Building, all located in close proximity to Tower City. Bedrock is a member of the Quicken Loans Family of companies, which employs nearly 4,000 team members in and around Cleveland at Quicken Loans, JACK Cleveland and Thistledown, Cleveland Cavaliers, The Q Arena, and other affiliates.\nBedrock specializes in acquiring, developing, leasing, financing, and managing commercial and residential buildings. Since its founding in 2011, Bedrock and its affiliates has committed more than $5.6 billion in acquiring and developing properties in downtown Detroit and Cleveland totaling more than 16 million square feet. Bedrock's real estate portfolio consists of more than 330 office and retail tenants in Detroit and Cleveland's rapidly-growing downtowns. For more information, visit bedrockdetroit.com or engage with us on Twitter @BedrockDetroit and Facebook.\nContact:\nMerrell Sheehan\n1-800-726-2117 x1865\nmsheehan@emscorporate.com\nView original content: http://www.prnewswire.com/news-releases/electronic-merchant-systems-announces-move-of-its-headquarters-to-downtown-cleveland-300578177.html\nSOURCE Electronic Merchant Systems", "external_links": ["http://www.prnewswire.com/news-releases/electronic-merchant-systems-announces-move-of-its-headquarters-to-downtown-cleveland-300578177.html"], "published": "2018-01-05T16:24:00.000+02:00", "crawled": "2018-01-05T18:05:02.006+02:00", "highlightTitle": ""}