{"organizations": [], "uuid": "118a4784dba82e2ad1be1669f264c6db548ea47c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225236492&w=1200&r=LYNXMPEE0O1HA", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-italy-election-5star/not-so-anti-establishment-now-italys-5-stars-evolving-face-idUSKBN1FE259", "country": "US", "domain_rank": 408, "title": "Not so anti-establishment now: Italy's 5-Star's evolving face", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T20:41:00.000+02:00", "replies_count": 0, "uuid": "118a4784dba82e2ad1be1669f264c6db548ea47c"}, "author": "", "url": "https://www.reuters.com/article/us-italy-election-5star/not-so-anti-establishment-now-italys-5-stars-evolving-face-idUSKBN1FE259", "ord_in_thread": 0, "title": "Not so anti-establishment now: Italy's 5-Star's evolving face", "locations": [], "entities": {"persons": [{"name": "carla ruocco", "sentiment": "none"}, {"name": "gavin jones", "sentiment": "none"}], "locations": [{"name": "italy", "sentiment": "none"}, {"name": "rome", "sentiment": "none"}], "organizations": [{"name": "min read  rome", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ROME (Reuters) - When parliamentarians from Italy’s “anti-establishment” 5-Star Movement sat down for a closed-door meeting with international banks and hedge funds in November, they feared the encounter was going to be awkward. \nThe concern was understandable. 5-Star has more friends among the unemployed than among bankers and has often decried the sway of high finance. Yet Carla Ruocco, a lower house lawmaker, said she was pleasantly surprised. \n”There were three of us and about 20 of them sat in a circle, she said. “I expected some prejudice but they seemed open-minded and interested. They mainly asked about the euro and how we would help bring stability after the election.” \nThe meeting in Rome was part of efforts by Italy’s most popular party to reassure markets and investors that it can be trusted with power. It also reflected how much 5-Star has changed since it started in 2009 as an angry protest movement. \nOn the euro, the investors probably liked what they heard. 5-Star has steadily rowed back on an early plan to hold a referendum on whether Italy should leave the common currency zone, and this month its new, moderate leader Luigi Di Maio said it was no longer a party policy. \nFounded by the foul-mouthed comedian Beppe Grillo, who vowed to sweep away Italy’s cronyistic ruling class, 5-Star presents a far less threatening face under the young, dapper Di Maio as it bids for power in national elections on March 4. \nGrillo has retreated from the limelight and this month announced his popular blog was no longer 5-Star’s official mouthpiece. The move raised speculation he was disowning his creation, which Grillo forcefully denied. \nSince he was elected leader of the party and its candidate for prime minister in September, Di Maio, 31, has been meeting with bankers, businessmen, foreign diplomats and members of the Catholic church to try to assuage their concerns. \nHe has also shifted 5-Star’s policies, scrapping not only the euro referendum but also its long-standing refusal to govern with traditional parties. \nSo far, the voters have followed him. Helped by a split in the ruling Democratic Party (PD), 5-Star leads the polls with about 28 percent of the vote, five points ahead of the PD. \nA center-right alliance of smaller parties, led by Silvio Berlusconi’s Forza Italia (Go Italy!) totals about 37 percent and is seen winning most parliamentary seats but probably not enough for a working majority. \nThat could give Di Maio his chance. He says if the center-right bloc is unable to form a government and 5-Star is the largest party, President Sergio Mattarella must give him a mandate to try to win cross-party support for his program. \nThat includes “drastic” cuts to corporate taxes and slashing red tape, as well as 5-Star’s flagship policy of guaranteeing a minimum income of up to 780 euros for the poor. \n“MORE ACCEPTABLE” \nDi Maio’s makeover has not gone unnoticed. \n“They are seen as more acceptable since they rowed back on the euro referendum. That was the real no-go for markets,” said Gilles Guibout, who helps manage 730 billion euros ($904 billion) at AXA IM in Paris. \nBankers who have met with 5-Star gave contrasting reports. \nA London-based equity analyst with one of the world’s largest investment banks who attended the meeting in Rome said he got “an impression of decent, reasonable people”. \n“Considering we were meeting politicians not economists, they were well-informed, I’d say better-informed than politicians from some other parties I have met,” he said. \n\n5-Star Movement leader Luigi Di Maio is seen during the television talk show \"Porta a porta\" (Door to door) in Rome, Italy January 23, 2018. REUTERS/Remo Casilli A senior Milan-based investor with a large European bank who met 5-Star representatives in Milan said he appreciated their tough stance against corruption, but was shocked by their lack of knowledge about business administration. \n“It was quite an eye-opener, they haven’t got a clue,” he said. \nThe analyst and the investment banker both asked not to be named because of the political sensitivity of the issue. \nAntoine Lesne, head of strategy at State Street ETFs which manages some $680 billion, said if 5-Star won power he expected Italian bond yields would rise initially, but only modestly, and “nothing like what we saw in 2011 and 2012 during the euro zone debt crisis”. \nAs well as reassuring markets, Di Maio is trying to burnish his credentials with business and has spent the last few weeks visiting small- and medium-sized companies around Italy. \nThe top item on 5-Star’s 20-point election platform is a promise to cut red tape by abolishing 400 “useless” laws. \nIt remains to be seen how Di Maio’s efforts will be received in the industrial north, which traditionally favors the right and where 5-Star is weak. \nSo far, the only significant business figure to publicly back 5-Star is Enrico Bracalente, the head of shoemaker and clothing company Nerogiardini, which employs some 2,000 people. \nDespite Di Maio’s appeal, 5-Star remains a political outsider. Mainstream parties of left and right attack it far more than they attack each other and Italy’s public television and its main newspapers, owned by big business, take a similar approach. \n“The worst scenario for Italy would be a government run by 5-Star. They are people with no competence at all,” said business tycoon Carlo De Benedetti, whose family owns the Repubblica daily, which supports the PD. \nCOURTING THE CHURCH 5-Star has also been courting the Roman Catholic church, which still wields considerable influence in Italy. \nLast year Grillo, who has a stormy relationship with the media, surprised many observers by giving a rare interview to the Italian bishops’ daily Avvenire, the main mouthpiece of the Italian church. \nWhile 5-Star’s position on matters such as euthanasia, gay marriage and artificial insemination runs counter to Catholic doctrine, the paper’s editor said afterward that “on the big issues, from work to the fight against poverty, in three-quarters of cases we have similar views.” \nDi Maio has called for curbs on opening hours for shops on religious holidays, a cause dear to the Church, and during a visit to Washington in November he took time out to meet with the pope’s secretary of state and top diplomat Pietro Parolin, who happened to be in the U.S. capital on other business. \nDi Maio, who requested the meeting, said he wanted to explain 5-Star’s foreign policy to the pope’s number 2. \nDi Maio and other party members have also started meeting regularly with foreign ambassadors. \nTwo ambassadors from European countries, who asked not to be named, said Di Maio had gone out of his way to be reassuring, especially on the euro. They both said they were concerned about inconsistencies in the party’s messages, however. \n“They want to reassure and be popular but you can’t please everyone,” said one ambassador. “I think with these changing positions they risk losing credibility rather than gaining it.” \nAdditional reporting by Stephen Jewkes, Giselda Vagnoni and Crispian Balmer; Editing by Sonya Hepinstall\n ", "external_links": [], "published": "2018-01-25T20:41:00.000+02:00", "crawled": "2018-01-25T20:54:54.010+02:00", "highlightTitle": ""}