{"organizations": [], "uuid": "bb01df799d395ad2ad2a579398bef555784a0d44", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-learning-care-group-taps-brightwheel-to-connect-with-parents-all-day-every-day.html", "country": "US", "domain_rank": 767, "title": "Learning Care Group Taps Brightwheel to Connect with Parents All Day, Every Day", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-11T18:21:00.000+02:00", "replies_count": 0, "uuid": "bb01df799d395ad2ad2a579398bef555784a0d44"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-learning-care-group-taps-brightwheel-to-connect-with-parents-all-day-every-day.html", "ord_in_thread": 0, "title": "Learning Care Group Taps Brightwheel to Connect with Parents All Day, Every Day", "locations": [], "entities": {"persons": [{"name": "chris sacca", "sentiment": "none"}, {"name": "dave vasen", "sentiment": "none"}, {"name": "mark bierley", "sentiment": "none"}], "locations": [{"name": "mich.", "sentiment": "none"}], "organizations": [{"name": "learning care group taps brightwheel", "sentiment": "negative"}, {"name": "learning care group", "sentiment": "negative"}, {"name": "abc", "sentiment": "none"}, {"name": "everbrook academy", "sentiment": "none"}, {"name": "la petite academy", "sentiment": "none"}, {"name": "creative kids learning center", "sentiment": "none"}, {"name": "children’s courtyard", "sentiment": "none"}, {"name": "childtime", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NOVI, Mich., Jan. 11, 2018 (GLOBE NEWSWIRE) -- Learning Care Group is opening a window for parents into their child’s school day with real-time photos, videos and updates anytime, anywhere. The early childhood education leader is ensuring that families enrolled at its preschools nationwide feel as close to their children as possible during school hours through brightwheel – a groundbreaking software platform featured on ABC’s “Shark Tank.”\nBrightwheel founder and CEO Dave Vasen pitches the software platform on ABC’s ‘Shark Tank,’ securing the backing of investors Mark Cuban and Chris Sacca during Season 7.\nTeachers and school management at Childtime, Children’s Courtyard, Creative Kids Learning Center, Everbrook Academy, La Petite Academy, and Tutor Time schools are now using the innovative app to update parents about major milestones, timely messages and special moments.\n“At Learning Care Group, we know that communicating with parents as partners is at the heart of a fantastic customer experience,” said Mark Bierley, President and Chief Operating Officer, Learning Care Group. “We’re proud to team with brightwheel to connect with families throughout the day as we share the ‘wow’ moments, learning updates and important reminders with real-time, secure and private communications.”\nWith the easy-to-use brightwheel mobile app, parents at Learning Care Group schools can opt to receive custom notifications, including:\nphotos videos updates on learning experiences throughout the day updates on the daily menu and food eaten diaper change information nap start and end times kudos and amazing moments captured by the teacher\nStaff members can send brightwheel alerts to communicate emergencies to a parent. Families and school staff also may send and receive short messages. Updates are private, visible only to the authorized family members and any of their chosen recipients.\n“Brightwheel is designed specifically for early education – giving families a personal connection to their child’s day while freeing up more one-on-one time for educators to spend with students,” said Dave Vasen, founder and CEO of brightwheel. “We’re thrilled to partner with Learning Care Group in offering our technology as part of their commitment to individualized service and care.”\nBrightwheel was featured during Season 7 of ABC’s critically acclaimed Emmy® Award-winning reality series “Shark Tank,” as Vasen pitched the platform and secured the backing of investors Mark Cuban and Chris Sacca. Tune in to ABC on Sunday, Jan. 14, 2018 at 9 p.m. EST/ 8 p.m. CST to see the follow-up appearance with brightwheel and the Learning Care Group team.\nAbout Learning Care Group\nLearning Care Group is a leader in early childhood education, with nearly 50 years of experience in inspiring children to love learning. Headquartered in Novi, Mich., the company provides early education and care for children ages 6 weeks to 12 years through seven unique brands: The Children’s Courtyard, Childtime Learning Centers, Creative Kids Learning Centers, Everbrook Academy, La Petite Academy, Montessori Unlimited, and Tutor Time Child Care/Learning Centers. It operates more than 900 schools (corporate and franchise) across 36 states, the District of Columbia and internationally, and has a capacity to serve more than 130,000 children. Learning Care Group’s proprietary School Readiness Pathway supports the development of the academic and social skills needed for a smooth transition to elementary school. For more information, please visit www.learningcaregroup.com\nAbout brightwheel\nBrightwheel is the first all-in-one software platform for preschools, childcare providers, camps, and afterschool programs. Brightwheel helps teachers manage their day and communicate with parents, gives parents deeper insight into what their children are learning, and automates the process of managing operations for administrators. The platform has been shown to save teachers and administrators up to an hour per day, while improving parent satisfaction and giving them a closer connection to their child's learning. It is the fastest growing platform in early education, used across thousands of locations globally. Learn more at www.mybrightwheel.com/ .\nAttachments:\nA photo accompanying this announcement is available at http://www.globenewswire.com/NewsRoom/AttachmentNg/0700a6bc-1bb7-46f7-925a-c2ffad08f13a\nLydia Cisaruk Learning Care Group 248.697.9140 lcisaruk@learningcaregroup.com\nSource: Learning Care Group", "external_links": ["https://www.globenewswire.com/Tracker?data=fTUojPdjbcLrBPXnmd6n__Pj6olQUcS3HzD0DGGESmH8IUGWJkbHjNPeU-kWpZm9WaD0WdoVJ-yjhqK3et9sAuxxuKizLLqzhxKoinIKTgE=", "https://www.globenewswire.com/Tracker?data=uukkbgmx3_BZ6lSP3CgLnbeoVTACXWvmGTDHQcA_UUDJdT1waks1XqBRg7xSI2mdT094fBcHfJF2eWZRAjwbuTPxsNvDU8-VXQblpeQYiY8=", "http://www.globenewswire.com/NewsRoom/AttachmentNg/0700a6bc-1bb7-46f7-925a-c2ffad08f13a", "https://www.globenewswire.com/Tracker?data=R7c4OyyAbaqEmNmAT4n00za9Ltw4oePIdpxbpeLJn84BC-mekwLwu2r4zLVah6xuA27hy3f1_ZfTzPO9IWMhzduOBikVy_BENj2DtnlOfro=", "https://www.globenewswire.com/Tracker?data=24Rd3MDEoIoGqNVQPAwN_U5AJq70yDwdUOnA7BFchKbsikvH8Hfl71FEwkRnWm3Dbt-ODXJbUBOxud_MYxW8G7XulTUmtmhO-lQN4q-HfJXDQYTAiwErGCa4En-JuIXYYGSN06kY72OWugIxzeCSdm_8rwxkK-ohaqoTEZJfjw24x0zXdTTWkUakTuVV9XlwxzeXbiaFMOht_UzAFsX01CJ_08j5nMsg-jAXATUXAY-8mAk5S0J3HHLodjwiLzUksfU1xhCHMPw_4ZObRYJXrQ==", "https://www.globenewswire.com/Tracker?data=FtLw0bC8WoCJoMZNywxwtxmSUQRf1SmJ5QfrvcMQGu7oM5H1KTMZbG-uGlp_-44nxrIhkx5GEK6EBgPcmyXDdw==", "https://www.globenewswire.com/Tracker?data=myOthm6ua6iy5zkV8aIuDWWvFZWwzoyY4aB5s7sW0yhSVaPRYn--fYJgrgh5lKBUSkUF4gQpCDngnwsxfuFmJS9Dei7JOeMONVCICk6ETCA=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/e990dc2d-f788-463d-8ad6-8c1706f66ea6", "https://www.globenewswire.com/NewsRoom/AttachmentNg/0700a6bc-1bb7-46f7-925a-c2ffad08f13a/en"], "published": "2018-01-11T18:21:00.000+02:00", "crawled": "2018-01-11T18:54:46.013+02:00", "highlightTitle": ""}