{"organizations": [], "uuid": "4a81f3b1233e82d2b90f5799b380046fda70b466", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-neogen-reports-record-revenues-and-earnings.html", "country": "US", "domain_rank": 767, "title": "Neogen reports record revenues and earnings", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.079, "site_type": "news", "published": "2018-01-03T16:45:00.000+02:00", "replies_count": 0, "uuid": "4a81f3b1233e82d2b90f5799b380046fda70b466"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-neogen-reports-record-revenues-and-earnings.html", "ord_in_thread": 0, "title": "Neogen reports record revenues and earnings", "locations": [], "entities": {"persons": [], "locations": [{"name": "mich.", "sentiment": "none"}, {"name": "lansing", "sentiment": "none"}], "organizations": [{"name": "neogen", "sentiment": "negative"}, {"name": "neogen corporation", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LANSING, Mich., Jan. 3, 2018 /PRNewswire/ -- Neogen Corporation (NASDAQ: NEOG) announced today that its revenues for the second quarter of its 2018 fiscal year, which ended Nov. 30, increased 12% to $101,817,000, from the previous year's second quarter revenues of $90,717,000. Current year-to-date revenues were $197,073,000, up 13% compared to $174,362,000 for the same period a year ago.\nSecond quarter net income was $17,100,000, an increase of 53% compared to the prior year's $11,151,000. Adjusted for a 4-for-3 stock split effective Dec. 29, 2017, earnings per share in the current quarter were $0.33, compared to $0.22 a year ago. In the current quarter, Neogen benefitted $3.4 million, or $0.07 per share, due to the adoption of Accounting Standard Update 2016-09 on June 1, 2017, which changes how companies report the excess tax benefits of employee stock option exercises. Current year-to-date net income was $29,014,000, or $0.56 per share after being adjusted for the split, compared to $21,032,000, or an adjusted $0.41 per share, for the same period a year ago. The quarterly revenue and net income results represent records for the 35-year-old company.\n\"We are pleased to report strong performance that combined organic growth and the continued integration of recent acquisitions. In addition, recent changes in accounting rules added a tax benefit that boosted our net income,\" said James Herbert, Neogen's executive chairman. \"We were also pleased to reward shareholders with our recent stock split. The split reflects our Board's strong belief in Neogen's long-term growth prospects, and enhances the availability and liquidity of our shares to allow more participation in Neogen's success.\"\nThe second quarter was the 103rd of the past 108 quarters that Neogen reported revenue increases as compared with the previous year — a record spanning 27 years. The current quarter marked the first time Neogen has exceeded $100 million in quarterly revenues.\n\"We are particularly pleased with the strong organic growth of a number of our existing core product lines in the current quarter,\" said John Adent, Neogen's president and chief executive officer. \"Within our food safety segment, we had substantial organic sales increases in our line of dehydrated culture media, and test kits to detect sanitation concerns, dairy antibiotics, and foodborne pathogens, especially Listeria. In our animal safety segment, we also recorded increases in sales of veterinary instruments, rodent control products, and continued our strong growth in our agricultural genomic services.\"\nExpressed as a percentage of sales, operating income was 17.7% for the second quarter, compared to 18.6% in the same quarter a year ago. Neogen's gross margin was 48.4% of sales in its second quarter of the current year, compared to 48.1% recorded in the same quarter of the prior fiscal year.\n\"We continue to generate strong cash flow from operations, which has enabled us to reinvest in the business, particularly in areas such as information technology,\" said Steve Quinlan, Neogen's chief financial officer. \"Our strong cash position will allow us to pursue our identified growth strategies going forward.\"\nRevenues for the company's Food Safety segment increased 21% during the second quarter compared to the prior year quarter, aided by acquisitions within the past year, which report through Neogen's operations in Scotland and Brazil. Sales of Neogen's line of general sanitation products increased 23% in the current quarter compared to the prior year quarter. The line includes AccuPoint ® , a system that allows users to instantly verify that surfaces and equipment have been effectively sanitized. The segment's comparative results also included a 20% increase in sales of culture media products.\nAlso of note in the Food Safety segment's current second quarter results was an 18% increase in sales of test kits to detect drug residues in milk, and a 14% increase in foodborne pathogen detection tests — including a 43% increase in sales of tests to detect Listeria. In June, Neogen launched Listeria Right Now ™ , an innovative test that detects Listeria in environmental samples in under 60 minutes — without the need to enrich samples.\nIn the current quarter, revenues from international sources increased to 38% of total revenues, compared to 34% in the prior year quarter. Overall, international sales increased 24% over the prior year, aided by acquisitions. Revenues from Neogen do Brasil increased 22% in U.S. dollars in the current quarter, Mexico-based Neogen Latinoamerica's sales increased 36%, Neogen Europe's revenues rose 15% in the quarter, Neogen China's revenues increased 23%, and Neogen India's revenues increased 48%, albeit from a small base.\nNeogen's Animal Safety segment reported a revenue increase for the second quarter of 5%, led by growth in its genomics business, a 10% increase in sales of its animal care line of products, a 14% increase in its rodent control product line, and a 19% increase in sales of veterinary instruments, which included a 17% increase in sales of its detectable needles. Revenues from Neogen's worldwide animal genomics business increased 19% in the second quarter of fiscal 2018 compared to the prior year.\nNeogen Corporation develops and markets products dedicated to food and animal safety. The company's Food Safety Division markets dehydrated culture media and diagnostic test kits to detect foodborne bacteria, natural toxins, food allergens, drug residues, plant diseases and sanitation concerns. Neogen's Animal Safety Division is a leader in worldwide biosecurity products, animal genomics testing, and the manufacturing and distribution of a variety of animal healthcare products, including diagnostics, pharmaceuticals and veterinary instruments.\nCertain portions of this news release that do not relate to historical financial information constitute forward-looking statements. These forward-looking statements are subject to certain risks and uncertainties. Actual future results and trends may differ materially from historical results or those expected depending on a variety of factors listed in Management's Discussion and Analysis of Financial Condition and Results of Operations in the Company's most recently filed Form 10-K.\nNEOGEN CORPORATION UNAUDITED SUMMARIZED CONSOLIDATED OPERATING DATA\n(In thousands, except for per share and percentages)\nQuarter ended Nov. 30\nSix months ended Nov. 30\n2017\n2016\n2017\n2016\nRevenue\nFood Safety\n$\n49,560\n$\n40,961\n$\n96,295\n$\n80,118\nAnimal Safety\n52,257\n49,756\n100,778\n94,244\nTotal revenue\n101,817\n90,717\n197,073\n174,362\nCost of sales\n52,546\n47,126\n101,931\n90,292\nGross margin\n49,271\n43,591\n95,142\n84,070\nOperating expenses\nSales & marketing\n17,815\n15,687\n34,838\n30,484\nAdministrative\n10,491\n8,284\n19,817\n16,546\nResearch & development\n2,967\n2,768\n6,065\n5,446\nTotal operating expenses\n31,273\n26,739\n60,720\n52,476\nOperating income\n17,998\n16,852\n34,422\n31,594\nOther income (expense)\n1,055\n(81)\n1,867\n411\nIncome before tax\n19,053\n16,771\n36,289\n32,005\nIncome tax\n1,900\n5,600\n7,200\n10,900\nNet income\n$\n17,153\n$\n11,171\n$\n29,089\n$\n21,105\nNet (income) attributable\nto non-controlling interest\n(53)\n(20)\n(75)\n(73)\nNet", "external_links": ["http://www.prnewswire.com/news-releases/neogen-reports-record-revenues-and-earnings-300576976.html"], "published": "2018-01-03T16:45:00.000+02:00", "crawled": "2018-01-03T16:27:49.000+02:00", "highlightTitle": ""}