{"organizations": [], "uuid": "512dd8cd1a3101c725a794b9db0415b9619c4b89", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/01/the-associated-press-tax-on-medical-devices-to-resume-after-2-year-suspension.html", "country": "US", "domain_rank": 767, "title": "Tax on medical devices to resume after 2-year suspension", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.999, "site_type": "news", "published": "2018-01-01T18:14:00.000+02:00", "replies_count": 0, "uuid": "512dd8cd1a3101c725a794b9db0415b9619c4b89"}, "author": "Leeannwhite", "url": "https://www.cnbc.com/2018/01/01/the-associated-press-tax-on-medical-devices-to-resume-after-2-year-suspension.html", "ord_in_thread": 0, "title": "Tax on medical devices to resume after 2-year suspension", "locations": [], "entities": {"persons": [], "locations": [{"name": "massachusetts", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "minnesota", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "While much of corporate America will enjoy a tax cut in the new year, one industry is getting a tax increase it has fought hard but so far unsuccessfully to avoid.\nA 2.3-percent excise tax on medical device manufacturers is set for reinstatement Monday after a two-year hiatus. It was originally imposed in 2013 as one of several taxes and fees in the Affordable Care Act that pay for expanded health insurance under the law.\nThe tax was strongly opposed by the $150 billion a year industry that produces everything from catheters to heart stents to artificial joints. In Congress, it was unpopular not only with Republicans but many Democrats from states like Massachusetts and Minnesota with large numbers of medical device companies.\nCongress voted to suspend the tax for 2016 and 2017 with the widespread expectation it would be permanently abolished before 2018. But various GOP efforts to repeal the Affordable Care Act and the taxes associated with it failed, and the sweeping federal tax overhaul recently signed by President Donald Trump didn't eliminate the medical device tax either.\nIndustry groups Including the Advanced Medical Technology Association (AdvaMed) and the Medical Imaging & Technology Alliance warn the tax will take a $20 billion bite out of the industry over the next decade.\n\"What we have seen from past experience is that it comes out of funding for product development, research and the jobs associated with those things,\" said J.C. Scott, AdvaMed's head of government affairs. \"We fear we will see employment freezes or reductions and a slowdown in the pipeline for medical innovation.\"\nThe slashing of the overall corporate tax from 35 percent to 21 percent may soften the blow for some manufacturers, industry officials say, but not for all. As the excise tax is applied to sales and not income, it will fall harder on smaller firms and startups with promising new products that have yet to yield profits.\nSupporters of the tax contend manufacturers have overstated both the harm suffered while the tax was in effect, and the potential impact of its resumption. They argue expansion of health coverage under the ACA benefited medical device makers by boosting the potential market for their products and note other sectors — including private insurers and pharmaceutical companies — also pay taxes and fees toward the health law and complain less about them.\nDevice makers certainly aren't giving up their fight. They still hold out hope of repealing or again suspending the tax.\nDespite earlier failures, industry officials say congressional backing for repeal remains strong. The next attempt could come in connection with a spending bill needed by Jan. 19 to avert a government shutdown.\nBoston Scientific , a leading maker of heart stents and other devices, estimates reinstatement of the tax will cost the Marlborough, Massachusetts-based firm $75 million in 2018. The company said when the tax was suspended it invested the savings in projects including a partnership with Mayo Clinic that combines manufacturing expertise with ideas from physicians for new products to help patients.\n\"The reinstatement of the device tax threatens continued investment in programs like these,\" Boston Scientific said in a statement.\nSome Democrats, including Sen. Elizabeth Warren of Massachusetts, have said they won't support repeal of the tax unless an equivalent source of revenue is found for the ACA.\nIn a Dec. 20 letter to Trump, AdvaMed urged the president to support repeal of the tax and, in the interim, direct the IRS to grant companies \"administrative relief\" from the tax. That could include such steps as waiving the bimonthly deposit requirement or any penalties resulting from late payments.\n\"Retroactive action by Congress next year cannot fully undo the impact of allowing this tax to be triggered on Jan. 1,\" the companies wrote.", "external_links": [], "published": "2018-01-01T18:14:00.000+02:00", "crawled": "2018-01-01T20:16:33.007+02:00", "highlightTitle": ""}