{"organizations": [], "uuid": "54c1a1e8ae69405b48d70d05ab2f335555f6711d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-indisoft-names-kenneth-m-goins-jr-cfo.html", "country": "US", "domain_rank": 767, "title": "IndiSoft Names Kenneth M. Goins, Jr. CFO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T15:45:00.000+02:00", "replies_count": 0, "uuid": "54c1a1e8ae69405b48d70d05ab2f335555f6711d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-indisoft-names-kenneth-m-goins-jr-cfo.html", "ord_in_thread": 0, "title": "IndiSoft Names Kenneth M. Goins, Jr. CFO", "locations": [], "entities": {"persons": [{"name": "kenneth m. goins", "sentiment": "neutral"}, {"name": "kenneth", "sentiment": "none"}, {"name": "hans rusli", "sentiment": "none"}, {"name": "ken", "sentiment": "none"}, {"name": "thomas radkiewicz", "sentiment": "none"}, {"name": "m. goins", "sentiment": "none"}, {"name": "goins", "sentiment": "none"}, {"name": "cam melchiorre", "sentiment": "none"}, {"name": "sanjeev dahiwadkar", "sentiment": "none"}, {"name": "dahiwadkar", "sentiment": "none"}, {"name": "amit sheth", "sentiment": "none"}], "locations": [{"name": "md.", "sentiment": "none"}], "organizations": [{"name": "mortgage industry veteran joins technology company columbia", "sentiment": "negative"}, {"name": "indisoft", "sentiment": "none"}, {"name": "advisory board", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Financial, Mortgage Industry Veteran Joins Technology Company\nCOLUMBIA, Md.--(BUSINESS WIRE)-- IndiSoft , a technology development firm that specializes in systems for the financial services industry , has appointed Kenneth (Ken) M. Goins, Jr. as the company’s CFO. Goins, working closely with IndiSoft’s CEO, Sanjeev Dahiwadkar, will focus on accelerating growth, operational excellence and financial performance based on defined business goals and metrics to measure success.\n“Since 2005, IndiSoft has provided the most scalable and reliable solutions to its customers looking to stay compliant while effectively managing workflows,” Dahiwadkar explained. “There have been several key events during the past year at IndiSoft; Cam Melchiorre joined as President, Thomas Radkiewicz, Hans Rusli and Amit Sheth joined the Advisory Board and now Ken as our CFO. Many exciting things are on the horizon for us, and we have a solid management team and infrastructure in place to manage additional business partners as well as product and company growth.”\nGoins brings more than 35 years of domestic and international business experience as the CEO, COO and CFO of private and public companies in the Financial Services, Mortgage Services, Fin-Tech, Information Technology and Healthcare industries to his new position at IndiSoft. Goins joins IndiSoft from TechCXO, a national consulting firm, where he is a partner. He is also an Adjunct Professor at the Eugene Stetson School of Business and Economics at Mercer University. Additionally, Goins was the vice chairman and CEO of Brightwell Payments, Inc., CEO of Prommis Solutions, LLC., COO and CFO of the Lender Services Division of LandAmerica Financial Group, Inc., and the chairman and CEO of INFO1. He also held executive positions at Caredata.com, Inc., First Data, MicroBilt and Colonial Life & Accident Insurance Company.\nGoins is a Cum Laude Graduate with a Bachelor’s in Business Administration, with Phi Beta Kappa distinction, from the Moore School of Business, at the University of South Carolina. He also earned an MBA with a concentration in Innovation and Entrepreneurship from the Eugene Stetson School of Business and Economics at Mercer University. Goins is a CPA and a Green Belt in Six Sigma.\n“I have worked with and known Sanjeev for over a decade,” Goins said. “I have always been impressed by his entrepreneurial focus and dedication to solving real client needs as well as with the quality of IndiSoft’s products and services. It is very exciting to be a trusted advisor and the CFO for Sanjeev and IndiSoft, and I look forward to working with everyone at the company and applying my skills and expertise to the company and its management team. I firmly believe that as our industry continues to evolve, IndiSoft is properly positioned to be a market leader with its product focus and new product innovations soon be announced.”\nAbout IndiSoft LLC\nColumbia, Md.-based IndiSoft, LLC develops collaborative technology solutions for the financial services industry. Its flagship products, RxOffice® Compliance and RxOffice® Vendor Management, enhance risk-based assessment and help companies, including servicers and sub-servicers with increased regulatory concerns. The company provides efficient, reliable and scalable solutions for companies that want to remain compliant, effectively manage workflow and maintain a competitive edge. Connect: www.indisoft.us | Twitter: @IndiSoftllc .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123005065/en/\nMedia Contact for IndiSoft\nCharlyne H. McWilliams, 301-933-5567\ncharlyne@williammills.com\nSource: IndiSoft, LLC", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.indisoft.us%2F&esheet=51746215&newsitemid=20180123005065&lan=en-US&anchor=IndiSoft&index=1&md5=f8ce1138cc091d3db92c9215cd83ced9", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.indisoft.us&esheet=51746215&newsitemid=20180123005065&lan=en-US&anchor=www.indisoft.us&index=3&md5=178682895179015fb8637440e8f3962c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Findisoft.us&esheet=51746215&newsitemid=20180123005065&lan=en-US&anchor=financial+services+industry&index=2&md5=7bc4d648b44b7bd6afcba6b9ef57038e", "http://www.businesswire.com/news/home/20180123005065/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2FIndiSoftLLC&esheet=51746215&newsitemid=20180123005065&lan=en-US&anchor=%40IndiSoftllc&index=4&md5=93677c25e0325705a9dd556f9ca2a3f1"], "published": "2018-01-23T15:45:00.000+02:00", "crawled": "2018-01-23T18:44:15.004+02:00", "highlightTitle": ""}