{"organizations": [], "uuid": "c58d31e7fe22a71455806d954771aac81124fff1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-andrew-e-shipley-a-top-government-contracts-practitioner-joins-wilmerhale.html", "country": "US", "domain_rank": 767, "title": "Andrew E. Shipley, a Top Government-Contracts Practitioner, Joins WilmerHale", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T19:47:00.000+02:00", "replies_count": 0, "uuid": "c58d31e7fe22a71455806d954771aac81124fff1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-andrew-e-shipley-a-top-government-contracts-practitioner-joins-wilmerhale.html", "ord_in_thread": 0, "title": "Andrew E. Shipley, a Top Government-Contracts Practitioner, Joins WilmerHale", "locations": [], "entities": {"persons": [{"name": "andrew e. shipley", "sentiment": "negative"}, {"name": "andrew", "sentiment": "negative"}, {"name": "robert novick", "sentiment": "none"}, {"name": "e. shipley", "sentiment": "none"}, {"name": "shipley", "sentiment": "none"}], "locations": [{"name": "wilmerhale washington, dc", "sentiment": "none"}, {"name": "washington, dc", "sentiment": "none"}, {"name": "wilmerhale", "sentiment": "none"}], "organizations": [{"name": "wilmerhale", "sentiment": "negative"}, {"name": "national security and government contracts group", "sentiment": "none"}, {"name": "government and regulatory litigation group", "sentiment": "none"}, {"name": "defense", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Washington, DC, Jan. 16, 2018 (GLOBE NEWSWIRE) -- WilmerHale is very pleased to announce that Andrew E. Shipley, one of the nation’s leading government contracts practitioners, has joined the firm.\nAndrew E. Shipley\nMost recently chair of the government contracts practice at an Am Law 100 firm, Mr. Shipley brings to WilmerHale his deep and broad understanding of litigation, counseling and investigations related to federal government contracts, as well as significant commercial litigation experience. He also brings to the firm a well-deserved reputation as a trusted advisor to clients not only on contracts and claims, but also on regulatory and data rights matters.\nIn addition, Mr. Shipley knows firsthand the needs of clients, having served for many years as corporate counsel for one of the nation’s largest defense contractors.\nMr. Shipley is based in the firm’s Washington, DC offices and is a member of the firm’s Defense, National Security and Government Contracts Group and its Government and Regulatory Litigation Group.\nOf Mr. Shipley’s arrival, Robert Novick, WilmerHale co-managing partner, said: “Lawyers with Andy’s experience and skills are in very great demand. Given that, we are thrilled that Andy chose WilmerHale as the best platform for the next phase of his career.\n“Not only is he a go-to lawyer on just about any federal contracting issues but his many years as a corporate counsel at Northrop Grumman provide him a unique vantage point from which to help clients,” Mr. Novick said. “He is collaborative and entrepreneurial, making him a perfect fit for WilmerHale.”\n“I am very excited to be at WilmerHale,” Mr. Shipley said. “The firm is renowned for its dedication to client service, and the excellence and collegiality of its lawyers. Many of WilmerHale’s lawyers have held senior federal government positions giving them a deep understanding of regulatory and federal contract issues from the government’s perspective. Their background, coupled with my years of experience handling these same issues from the contractor’s perspective—both as in-house and outside counsel—will provide our clients with the skills and expertise needed to navigate the complex world of federal government contracting.”\nBefore joining WilmerHale, Mr. Shipley spent the past five years at an Am Law 100 firm, the last two as chair of its government contracts practice group. He was previously Assistant General Counsel at Northrop Grumman, a large defense-aerospace contractor, where he served in various corporate counsel roles from 1995 to 2012.\nMr. Shipley graduated from the University of Maryland with a BS in journalism and earned his law degree cum laude from Harvard Law School.\nAbout Wilmer Cutler Pickering Hale and Dorr LLP\nWilmerHale provides legal representation across a comprehensive range of practice areas that are critical to the success of its clients. The law firm’s leading Intellectual Property, Litigation/Controversy, Regulatory and Government Affairs, Securities, and Transactional Departments participate in some of the highest-profile legal and policy matters. With a staunch commitment to public service, the firm is renowned as a leader in pro bono representation. WilmerHale is 1,000 lawyers strong with 12 offices in the United States, Europe and Asia. For more information, please visit www.wilmerhale.com .\nAttachments:\nA photo accompanying this announcement is available at http://www.globenewswire.com/NewsRoom/AttachmentNg/2a593c74-7c64-4b7a-b17d-67444e5d26f6\nFrank James WilmerHale 202 247 3560 frank.james@wilmerhale.com\nSource: WilmerHale", "external_links": ["http://www.globenewswire.com/NewsRoom/AttachmentNg/2a593c74-7c64-4b7a-b17d-67444e5d26f6", "https://www.globenewswire.com/NewsRoom/AttachmentNg/f7ca2836-f531-4db0-b5c1-506ab1a274a4", "https://www.globenewswire.com/Tracker?data=9nvNQhMDHUDbGND6NR8c4Ss4He5tuE745XEvpg1h4rKdLw8RBwdI8uur5sVSgpavf_wkbN8sMooRvibouF90BQrUEHVe-TTqj9xhoBW596tBVKorMdSiL9-Z1AXl1gjV4lqBs7TrZAEWFIsrlvmruYx2_tS7T-Xpqs3D1dL4XR9RPn-cu9kMe6xbnVYKdxfiB2KgsKC0-My6AJjnrEZtwNgxCOq0DWuJSHNiix1z0UVL-2Fg3boeRt0lD2NJTKeZy-NzTtueAj89XyEcmPg3eQ==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/2a593c74-7c64-4b7a-b17d-67444e5d26f6/en"], "published": "2018-01-16T19:47:00.000+02:00", "crawled": "2018-01-16T21:16:33.015+02:00", "highlightTitle": ""}