{"organizations": [], "uuid": "67721b7365f80f0a734efe62b0f5870d45c2ed3c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-das-health-acquires-las-vegas-based-integra-i-t-solutions-expands-ehr-and-managed-i-t-services.html", "country": "US", "domain_rank": 767, "title": "DAS Health Acquires Las Vegas-Based Integra I.T. Solutions, Expands EHR and Managed I.T. Services", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.534, "site_type": "news", "published": "2018-01-02T22:45:00.000+02:00", "replies_count": 0, "uuid": "67721b7365f80f0a734efe62b0f5870d45c2ed3c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-das-health-acquires-las-vegas-based-integra-i-t-solutions-expands-ehr-and-managed-i-t-services.html", "ord_in_thread": 0, "title": "DAS Health Acquires Las Vegas-Based Integra I.T. Solutions, Expands EHR and Managed I.T. Services", "locations": [], "entities": {"persons": [], "locations": [{"name": "tampa", "sentiment": "none"}], "organizations": [{"name": "das health acquires las vegas-based integra i.t. solutions", "sentiment": "negative"}, {"name": "das health", "sentiment": "none"}, {"name": "security risk assessments", "sentiment": "none"}, {"name": "las vegas-based integra i.t. solutions", "sentiment": "none"}, {"name": "rcm", "sentiment": "none"}, {"name": "integra", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tampa, Jan. 02, 2018 (GLOBE NEWSWIRE) -- Unified by a passion for helping independent physicians thrive, DAS Health has acquired Las Vegas-based Integra I.T. Solutions, an eMDs electronic health record Platinum reseller and IT services provider. The acquisition – DAS Health’s fifth in less than three years – broadens DAS Health’s electronic health record (EHR) services and technology solutions while enhancing customer support and care.\nAlready a leader in patient-centric health IT and management services and the largest national reseller of Aprima® Medical Software, DAS Health (DAS) will now sell and support eMDs Plus™, Lytec™, Practice Partner™, and Medisoft™ EHR and PM platforms. DAS continues to also offer cloud hosting, managed IT, VOIP, Security Risk Assessments, MIPS/MACRA reporting & consulting, as well as additional patient-centered and revenue generating services including assessURhealth™ mental & behavioral health screenings, chronic care management, and revenue cycle management (RCM) medical billing solutions.\n“Together with Integra’s suite of services, DAS Health will now be able to share new benefits and better serve both our existing and new clients,” David Schlaifer, DAS Health President and CEO, stated. “This acquisition marks an exciting phase of DAS’ continued rapid growth and ability to help independent physicians prosper in an evolving industry.”\n“Joining the DAS Health brand allows us to expand and enhance our existing services, raising the bar as a business partner and healthcare solutions provider,” Deepak Shroff, Managing Partner of Integra I.T. Solutions, who will be staying on through the acquisition. “I know that our clients are in good hands, with top of the line support from a recognized expert in the industry.”\nThe expanded company now serves nearly 2,000 clinicians and more than 600 practices nationwide. DAS plans to integrate Integra employees into its overall team, further expanding the company’s skill sets and talent pool. DAS will maintain its national headquarters in Tampa, FL, and expects to merge its existing west coast operations into Integra’s Las Vegas, NV office.\n*Aprima is a registered trademark of Aprima Medical Software, Inc.\n* eMDs, eMDs Plus, Lytec, Medisoft and Practice Partner are trademarks of eMDs, Inc.\nAbout DAS Health\nDAS Health has been a leading provider of Health IT and management solutions and a trusted consultant to independent physician groups, hospitals and healthcare systems across North America since 2003. Headquartered in Tampa, FL, DAS delivers superior health IT, medical billing and practice management solutions for nearly 2,000 clinicians and 6,000 users, servicing more than 8 million patients. DAS was recognized in 2017 for the 6 th year in a row as a top healthcare company on the Inc. 500|5000 list and is a Tampa Bay Business Journal Fast 50 fastest growing company for the last 8 consecutive years. Visit DAShealth.com to learn more.\nMedia Contact Tori Couch | Marketing Manager Tori.Couch@DAShealth.com | 813-774-9800 x 401\nSource:DAS Health", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/646a3b04-382b-40dc-87f5-c94291b7e20a"], "published": "2018-01-02T22:45:00.000+02:00", "crawled": "2018-01-03T00:39:27.007+02:00", "highlightTitle": ""}