{"organizations": [], "uuid": "de7a966a14db3b00ea72ad5d9bc1dd7043bb9705", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-evio-inc-announces-the-appointment-of-ron-russak-as-vice-president-of-operations.html", "country": "US", "domain_rank": 767, "title": "EVIO Inc. Announces the Appointment of Ron Russak as Vice President of Operations", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.83, "site_type": "news", "published": "2018-01-29T16:30:00.000+02:00", "replies_count": 0, "uuid": "de7a966a14db3b00ea72ad5d9bc1dd7043bb9705"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-evio-inc-announces-the-appointment-of-ron-russak-as-vice-president-of-operations.html", "ord_in_thread": 0, "title": "EVIO Inc. Announces the Appointment of Ron Russak as Vice President of Operations", "locations": [], "entities": {"persons": [{"name": "ron russak", "sentiment": "negative"}, {"name": "ron", "sentiment": "none"}, {"name": "lori glauser", "sentiment": "none"}, {"name": "russak", "sentiment": "none"}], "locations": [{"name": "ore.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}], "organizations": [{"name": "evio inc", "sentiment": "neutral"}, {"name": "quest diagnostics", "sentiment": "none"}, {"name": "evio", "sentiment": "none"}, {"name": "laboratory services", "sentiment": "none"}, {"name": "university of pennsylvania health system", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEND, Ore., Jan. 29, 2018 (GLOBE NEWSWIRE) -- EVIO, Inc. (OTCQB:EVIO), a life sciences company and leading provider of quality control testing and advisory services for the regulated cannabis industry, is pleased to announce the appointment of Ron Russak as Vice President of Operations.\nRussak joins EVIO from a 17-year career at Quest Diagnostics where, as regional director, he had operational responsibility for 529 patient service centers and 228 inter-office phlebotomy sites throughout the western United States. Prior to joining Quest, Russak worked for Pennsylvania Hospital (of the University of Pennsylvania Health System) for 13 years where he served as administrative director of Laboratory Services.\n“After an exhaustive search, we knew immediately that Ron was the right fit for EVIO,” said Lori Glauser, EVIO’s co-founder and COO. “His experience with Quest, a Fortune 500 provider of diagnostic services with a global network of labs and service centers, aligns seamlessly with our desire to rapidly scale up our laboratory operations.”\nIn this new role, Russak will provide operational direction and leadership for EVIO’s portfolio of labs and will drive EVIO’s profitability and growth by scaling existing and new laboratory operations.\n“EVIO is establishing an excellent analytical foundation that will set the standard for quality, precision and efficiency within this rapidly evolving industry,” Russak stated. “Clients and customers will increasingly turn to EVIO for their testing needs and will benefit by utilizing services from a fully accredited laboratory.”\nRussak’s appointment comes as EVIO is in the planning and deployment phases of several new cannabis testing labs across North America. Russak has a bachelor’s degree in life sciences from the University of Pittsburgh and an Master of Business Administration from La Salle University.\nAbout EVIO, Inc.\nEVIO, Inc. is a life sciences company focused on analyzing cannabis as a means for improving quality of life. The Company provides analytical testing services, advisory services and performs product research in its accredited laboratory testing facilities. The Company’s EVIO Labs division operating coast-to-coast provides state-mandated ancillary services to ensure the safety and quality of the nation's cannabis supply.\nFor more information, visit www.eviolabs.com ,\nSafe Harbor Statement\nAny statements in this press release that are not statements of historical fact maybe considered to be forward-looking statements. Statements may contain certain forward-looking statements pertaining to future anticipated or projected plans, performance and developments, as well as other statements relating to future operations and results. Words such as \"may,\" \"will,\" \"expect,\" \"believe,\" \"anticipate,\" \"estimate,\" \"intends,\" \"goal,\" \"objective,\" \"seek,\" \"attempt,\" or variations of these or similar words, identify forward-looking statements. These forward-looking statements by their nature are estimates of future results only and involve substantial risks and uncertainties, including but not limited to risks associated with the uncertainty of future financial results, additional financing requirements, development of new products, our ability to complete our product testing and launch our product commercially, the acceptance of our product in the marketplace, the uncertainty of the laws and regulations relating to cannabis, the impact of competitive products or pricing, technological changes, the effect of economic conditions and other uncertainties detailed from time to time in our reports filed with the Securities and Exchange Commission, available at www.sec.gov or www.eviolabs.com .\nCompany Contact:\nEVIO Inc.\nBend, OR\nwww.EVIOlabs.com\n888.544.EVIO\ninfo@EVIOlabs.com\nCorporate Communications Contact:\nNetworkNewsWire (NNW)\nNew York, New York\nwww.NetworkNewsWire.com\n212.418.1217 Office\nEditor@NetworkNewsWire.com\nSource:EVIO, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=-mgrQkQ9vPjf-dlJI2tfadFF2rO7-BkV805R9mhQ35gzxZ_gn2hoD4WXtNz7VYkBXjkqmcT3ouawX3GlM11pYQ==", "https://www.globenewswire.com/Tracker?data=MFERyqBLBXD1FuouwQ-bjZ1k9yJ4uppUyHjVYhO_i38Ie-ftHkwj1RMyyOQosO8TtJV82fyV-f1EWCmL2Yx73A==", "https://www.globenewswire.com/Tracker?data=Cw2q7iDzm3feuk345zrQppLdrlXTG_RGPhZlPLn4djP8aGv8RUsI_5UnTTYVIlSjg7mKHhkfOqJvdA8fpWqw_twB9Ny0JzwAilo57QVrrmY=", "https://www.globenewswire.com/Tracker?data=VwTkSFRWWuHPitGBrnK6vIoTZ-6oJMxKP4c6OFQil363CklByQv6AteVqgOso18SbPPl_YU2msU1DpGSNIL4HA==", "https://www.globenewswire.com/Tracker?data=zskzUJE4gTCpx1rsDuMfynMtbodDO94WiBCUe7y40QK3NsUOwk-AUBZXL6DV-ewjlcrZtYc4-uQSeIJtJsnixw==", "https://www.globenewswire.com/Tracker?data=VwTkSFRWWuHPitGBrnK6vPglt-45CFa0YLiwcbkTWdoKGp7NbBK9mt9VKPvp2LSS7yHFYqfTezKb3fSEwvZy2w=="], "published": "2018-01-29T16:30:00.000+02:00", "crawled": "2018-01-29T19:26:56.020+02:00", "highlightTitle": ""}