{"organizations": [], "uuid": "cf3bf8c8d7f156373c9d1284b30e011556861eb5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-jacksonville-bancorp-inc-announces-financial-results-at-and-for-the-quarter-and-year-ended-december-31-2017.html", "country": "US", "domain_rank": 767, "title": "Jacksonville Bancorp, Inc. Announces Financial Results at and for the Quarter and Year Ended December 31, 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.012, "site_type": "news", "published": "2018-01-24T17:29:00.000+02:00", "replies_count": 0, "uuid": "cf3bf8c8d7f156373c9d1284b30e011556861eb5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-jacksonville-bancorp-inc-announces-financial-results-at-and-for-the-quarter-and-year-ended-december-31-2017.html", "ord_in_thread": 0, "title": "Jacksonville Bancorp, Inc. Announces Financial Results at and for the Quarter and Year Ended December 31, 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "ill.", "sentiment": "none"}, {"name": "jacksonville", "sentiment": "none"}], "organizations": [{"name": "jacksonville bancorp, inc", "sentiment": "neutral"}, {"name": "jacksonville bancorp, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JACKSONVILLE, Ill., Jan. 24, 2018 (GLOBE NEWSWIRE) -- Jacksonville Bancorp, Inc. (NASDAQ:JXSB) (the “Company”) reported net income for the quarter ended December 31, 2017 of $141,000, or $0.08 per basic and diluted common share, compared to net income of $697,000, or $0.39 per basic and diluted common share, for the quarter ended December 31, 2016. Net income for the quarter ended December 31, 2017 decreased $556,000 compared to the quarter ended December 31, 2016 primarily due to an increase of $999,000 in income tax expense due to the passage of the Tax Cuts & Jobs Act on December 22, 2017. Net income for the quarter benefited from an increase of $119,000 in net interest income and decreases of $300,000 in provision for loan losses and $83,000 in noninterest expense, partially offset by a decrease of $59,000 in noninterest income.\nThe Company reported net income of $2,441,000, or $1.36 per basic common share and $1.35 per diluted common share for the year ended December 31, 2017, compared to net income of $3,048,000, or $1.72 per basic common share and $1.70 per diluted common share for the year ended December 31, 2016. Net income decreased $607,000 in 2017 as compared to 2016 primarily due to an increase of $1.0 million in income tax expense as a result of the passage of the Tax Cuts & Jobs Act. Net income for the year benefited from decreases of $300,000 in provision for loan losses and $146,000 in noninterest expense and an increase of $72,000 in noninterest income, partially offset by a decrease of $113,000 in net interest income. Basic per share information for the quarter and year ended December 31, 2017 is based upon 1,797,701 and 1,792,392 average shares outstanding, respectively, and per share information for the quarter and year ended December 31, 2016 is based upon 1,779,917 and 1,776,342 average shares outstanding, respectively.\nOn December 22, 2017, the Tax Cuts & Jobs Act was signed into law and reduced the corporate tax rate from 34% to 21%. As a result, generally accepted accounting standards required the immediate revaluation of our deferred tax assets and liabilities, which resulted in an $816,000 decrease in net income for both the fourth quarter of 2017 and full-year 2017. Excluding the impact of the new tax law, the fourth quarter of 2017 net income would have been $957,000, or $0.53 per basic common share, and our 2017 net income would have been $3,257,000, or $1.82 per basic common share.\nFor 2017, net interest income decreased $113,000 to $10.3 million, primarily due to an increase of $119,000 in interest expense, partially offset by an increase of $6,000 in interest income. For the year ended December 31, 2017, our net interest margin was 3.41% compared to 3.58% for the year ended December 31, 2016. The ratio of interest earning assets to interest bearing liabilities was 1.30x at December 31, 2017 and 1.28x at December 31, 2016.\nThe Company recorded a decrease of $300,000 in the provision for loan losses to a credit of $180,000 for the year ended December 31, 2017 compared to a provision of $120,000 for 2016. Management reviews the allowance for loan losses quarterly and has determined the allowance for loan losses with a balance of $2.9 million, or 1.5% of total loans, at December 31, 2017 to be adequate. Nonperforming loans totaled $1.8 million, or 0.9% of total loans at December 31, 2017.\nNoninterest income increased $72,000 in 2017 primarily due to increases of $61,000 in commission income, $43,000 from service charges on deposits, $33,000 in ATM and bank card interchange income and $31,000 in income from fiduciary activities, partially offset by a decrease of $71,000 in gains on the sales of securities. Noninterest expense decreased $146,000 primarily due to decreases of $98,000 in salaries and employee benefits, $49,000 in marketing expense, and $113,000 in other expense, partially offset by an increase of $107,000 in professional fees. The decrease in other expense includes decreases in real estate owned expense and amortization of intangible assets.\nTotal assets at December 31, 2017 increased to $325.0 million compared to $319.3 million at December 31, 2016. Total deposits at December 31, 2017 were $252.7 million compared to $258.7 million at December 31, 2016. Total stockholders’ equity increased to $48.8 million at December 31, 2017 from $46.2 million at December 31, 2016. The Company reported a book value per share of $26.89 at December 31, 2017. At December 31, 2017, Jacksonville Savings Bank exceeded its applicable regulatory capital requirements and was considered well-capitalized with Tier 1 leverage, common equity Tier 1, Tier 1 risk-based capital, and total risk-based capital ratios of 13.0%, 18.7%, 18.7%, and 19.9%, respectively.\nOn January 18, 2018, the Company announced the signing of a merger agreement under which CNB Bank Shares, Inc. will acquire the Company in an all-cash transaction for total consideration valued at approximately $61.6 million. Subject to the satisfaction or waiver of the closing conditions contained in the merger agreement, including the approval of the merger agreement by the Company’s stockholders and the receipt of required regulatory approvals, CNB Bank Shares and the Company expect that the merger will be completed during the second quarter of 2018. However, it is possible that factors outside the control of both companies, including whether or when the required regulatory approvals will be received, could result in the merger being completed at a different time or not at all.\nJacksonville Bancorp, Inc. is a Maryland chartered company. The Company is headquartered at 1211 West Morton Avenue, Jacksonville, Illinois. The Company’s operations are limited to its ownership of Jacksonville Savings Bank, an Illinois chartered savings bank, which operates five branch offices located in Morgan, Macoupin, and Montgomery Counties in Illinois. All information at and for the periods ended December 31, 2017, has been derived from unaudited financial information.\nThis news release contains certain forward-looking statements within the meaning of the federal securities laws. The Company intends such forward-looking statements to be covered by the safe harbor provisions for forward-looking statements contained in the Private Securities Reform Act of 1995, and is including this statement for purposes of these safe harbor provisions. Forward-looking statements, which are based on certain assumptions and describe future plans, strategies and experiences of the Company, are generally identified by use of the words “believe”, “expect”, “intend”, “anticipate”, “estimate”, “project”, or similar expressions. The Company’s ability to predict results or the actual effect of future plans or strategies is inherently uncertain. Factors which could have a material adverse effect on the operations of the Company and the subsidiaries include, but are not limited to, changes in: interest rates, general economic conditions, legislative/regulatory changes, monetary and fiscal policies of the U.S. Government, including policies of the U.S. Treasury and the Federal Reserve Board, the quality or composition of the loan or investment portfolios, demand for loan products, deposit flows, competition, demand for financial services in the Company’s market area and accounting principles and guidelines. These risks and uncertainties should be considered in evaluating forward-looking statements and undue reliance should not be placed on such statements.\nContact:\nRichard A. Foss\nPresident and CEO\n(217) 245-4111\nDiana S. Tone\nEVP and Chief Financial Officer\n(217) 245-4111\nSource:Jacksonville Bancorp Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/bdc50e76-85b9-4d42-93d8-12db52ec56a2"], "published": "2018-01-24T17:29:00.000+02:00", "crawled": "2018-01-24T19:17:42.042+02:00", "highlightTitle": ""}