{"organizations": [], "uuid": "528da753c42568f5877bceb3d2c60b4baadf8af2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XC517_3nt4F_TOP_20180122100412.jpg", "site_section": "http://www.wsj.com/xml/rss/3_7455.xml", "section_title": "WSJ.com: WSJD", "url": "https://www.wsj.com/articles/icahn-deason-push-xerox-to-explore-sale-fire-ceo-1516633653", "country": "US", "domain_rank": 387, "title": "Icahn, Deason Push Xerox to Explore Sale, Fire CEO - WSJ", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T17:07:00.000+02:00", "replies_count": 0, "uuid": "528da753c42568f5877bceb3d2c60b4baadf8af2"}, "author": "Cara Lombardo", "url": "https://www.wsj.com/articles/icahn-deason-push-xerox-to-explore-sale-fire-ceo-1516633653", "ord_in_thread": 0, "title": "Icahn, Deason Push Xerox to Explore Sale, Fire CEO - WSJ", "locations": [], "entities": {"persons": [{"name": "deason push xerox", "sentiment": "negative"}, {"name": "carl icahn", "sentiment": "negative"}, {"name": "icahn", "sentiment": "negative"}, {"name": "darwin deason", "sentiment": "negative"}, {"name": "deason", "sentiment": "none"}, {"name": "jeff jacobson", "sentiment": "none"}], "locations": [{"name": "norwalk", "sentiment": "none"}, {"name": "conn.", "sentiment": "none"}], "organizations": [{"name": "xerox corp", "sentiment": "negative"}, {"name": "wsj", "sentiment": "negative"}, {"name": "fujifilm holdings corp", "sentiment": "none"}, {"name": "xerox", "sentiment": "none"}, {"name": "wall street journal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "3 COMMENTS Billionaires Carl Icahn and Darwin Deason urged Xerox Corp. XRX 2.45% to explore a sale and refresh its top ranks in a letter made public on Monday.\nThe Wall Street Journal reported Sunday evening that the two, Xerox’s first- and third-biggest investors, had formed an alliance and planned to encourage the printer and copier giant to explore a potential sale and remove CEO Jeff Jacobson.\nThe two investors, who together control more than 15% of Xerox’s shares, already had been separately calling for changes at the Norwalk, Conn., company on slightly different topics. Now they say they are “completely aligned” and have agreed to act in concert.\nA spokesman for Xerox said in a statement that the board and management “are confident with the strategic direction in which the Company is heading, and we will continue to take action to achieve our common goal of creating value for all Xerox shareholders.”\nMessrs. Icahn and Deason want Xerox to explore strategic alternatives, which could include a sale or other transaction, to break its joint venture with Fujifilm Holdings Corp. The Journal reported this month that Fujifilm and Xerox are discussing a range of potential deals that could include a change of control of Xerox, though not a full sale.\nThey also said Mr. Jacobson and any other “old guard” directors unwilling to make tough decisions to save the company must be replaced. Mr. Icahn already had launched a fight for four new board members.\n“Every day that the ’old guard’ remains in power—feebly overseeing the company’s steady decline—is a waste of time that could inevitably erode the value of our investment down to nothing,” the two wrote.\nXerox shares rose 2.5% to $32.59 in midday trading Monday.\nShares of Xerox have languished for years. They have rallied lately on hopes of a deal, bringing the company’s market capitalization to about $8.1 billion.\nMr. Icahn, who owns a 9.7% stake, had already called for a change in management and started a fight for four new board members. The activist had campaigned successfully for change to the board two years ago, but his former employee resigned as a director last month to open the way to a new campaign .\nLast week, Mr. Deason, who owns a 6% stake, sent a letter urging Xerox to cancel its long-runningjoint venture with Fujifilm that sells copiers and printers in the Asia Pacific region. Mr. Deason got his stake when Xerox bought the company he founded, Affiliated Computer Services Inc., for $6 billion in 2010.\nThe joint venture, Fuji Xerox, would likely be at the center of any review given its strategic importance. Xerox and Fujifilm believe there are large savings and efficiencies from expanding their cooperation, a key reason they have engaged in deal talks, people familiar with the matter have said.\nAny other interested party, meanwhile, would need to navigate Fujifilm’s rights in the joint venture, a concern Mr. Deason has raised. He has demanded Xerox disclose the agreement between the two parties, saying the market has a right to know what Xerox is allowed to do.\nHe called on Xerox to cancel the agreement following an accounting scandal at the joint venture last year , saying that should have breached the contract. Mr. Icahn seconded that.\nWrite to Cara Lombardo at cara.lombardo@wsj.com and David Benoit at david.benoit@wsj.com", "external_links": [], "published": "2018-01-22T17:07:00.000+02:00", "crawled": "2018-01-22T17:58:08.053+02:00", "highlightTitle": ""}