{"organizations": [], "uuid": "2531b059e17f605cf7ea467f9e3203cf4bdd75d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-692184548.jpg", "site_section": "http://bizdailies.com/News/Rss", "section_title": "Biz Dailies: Business and Financial News Feed", "url": "http://fortune.com/2018/01/10/raceahead-free-your-mind/", "country": "US", "domain_rank": 1196, "title": "RaceAhead: Free Your Mind - Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T21:09:00.000+02:00", "replies_count": 0, "uuid": "2531b059e17f605cf7ea467f9e3203cf4bdd75d7"}, "author": "", "url": "http://fortune.com/2018/01/10/raceahead-free-your-mind/", "ord_in_thread": 0, "title": "RaceAhead: Free Your Mind - Fortune", "locations": [], "entities": {"persons": [{"name": "hay festi", "sentiment": "negative"}, {"name": "raoul martinez", "sentiment": "negative"}, {"name": "ellen mcgirt", "sentiment": "none"}], "locations": [{"name": "hay-on-wye", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "raceAhead raceAhead: Free Your Mind Raoul Martinez, artist, philosopher and writer, at the Hay Festival on June 4, 2017 in Hay-on-Wye, United Kingdom. David Levenson/Getty Images By Ellen McGirt Updated: January 10, 2018 2:16 PM ET \nNo essay today, because I’m working on a magazine feature – one that is sure to make the inclusion crowd quite happy. So, thanks for your patience. \nInstead, I’ll leave you with a little inspiration from rising philosophy star, Raoul Martinez. \nHe’s a portrait painter, not an academic, so his new popularity has ruffled some feathers, evidently. But in his recent book, Creating Freedom, he explores the idea that as products of our distinct environments we all have different limits to our choices in how we navigate the world. He calls into question the idea of a level playing field, as well as the purpose of capitalism, the nature of criminal justice and of course, the flaws baked into the democratic process. \nThink of it as a philosopher’s challenge to the pervasive myth of meritocracy. \nHis first insight came at a young age, according to this Guardian interview . \nMartinez tells me of an epiphany he had walking home from school with a friend when he was aged 12 or 13. “He was religious and wanted to convince me that I should be, too. I wanted to convince him that his position wasn’t well grounded. Had he been born to a different family he would be arguing with exactly the same force for the opposite perspective. I don’t think the argument changed him, but it did change me. I realised my genes, my inheritance, being born in a particular point of history all made me. I keep returning to the question: how can we be free if we can’t control the forces that shape us?” \nThis charming short video , animated by Joe Bichard, is an easy way to wade into a very chewy topic. \n“In the end, luck is what separates the rich from the poor, the saint from the sinner, the prisoner from the judge, the powerful and the powerless,” says Martinez. So where does meritocracy come into play? \nFree your mind, then go dazzle them at the water cooler, philosopher-royals that you are. On Point A federal judge protects safeguards for DACA dreamers The decision, issued late yesterday, says that protections must remain in place for the 690,000 people in the Obama-era Deferred Action for Childhood Arrivals program, while a legal challenge proceeds. It remains unclear when the DACA recipients can resume applying for their work permits. Advocates say that it is in the hands of the Department of Homeland Security, which runs DACA. The Trump administration called the ruling “outrageous,” and has vowed to challenge it. Washington Post Nebraska is the first red state to try to save net neutrality On Monday, Nebraska became the first Republican-controlled state to introduce legislation upholding net neutrality rules, joining a growing list of states – including California, New York and Massachusetts – who are considering similar actions. A Senate vote on the recent FCC ruling is expected, but it may not make a difference. Experts say that the FCC could claim that their rules supersede any created by the states or Congress. Fortune Sens. Cory Booker and Kamala Harris appointed to the Senate Judiciary Committee The move came after Congressional Black Caucus members lobbied for an African American to fill Al Franken’s now-vacated seat. Booker and Harris, who are both attorneys, would become the second and third people of color ever to join the Judiciary Committee in its 201-year history. In a letter to minority leader Sen. Chuck Schumer (D-N.Y.), CBC chair Rep. Cedric Richmond (D-La.) said the move was essential and that black America is currently facing “the greatest threats to its rights and safety since the post-Reconstruction era.” Fortune Want brilliant women to answer your job posting? New research finds that the pervasive belief that “genius” is a largely male trait can discourage genius women from seeking certain jobs. Research from New York University finds that female prospects are turned off by recruitment pitches that say the firm is seeking “brilliant minds.” It’s the stereotype, not a lack of confidence, says author and psychologist Andrei Cimpian. “Signaling that one’s field, job, or company is only for the most brilliant people out there may inadvertently turn away many qualified people that happen to belong to groups that our society deems less than brilliant.” The Woke Leader Howard University’s uncertain path Author, educator, and New Yorker staff writer Jelani Cobb explores the future of the famous HBCU under a Trump administration. The university has always attracted an overtly political crowd, and it’s a delight to be reminded of its storied history – which includes Cobb himself, who arrived at the school in 1987. A year later, he observed a specific type of pragmatic move, when the long-serving president, James Cheek, recruited race-baiting political operative Lee Atwater to the university’s board. Processing what appears to be Howard’s currently pragmatic attempt to work with the Trump world view, Cobb revisits a longstanding concern. Is Howard a black university or a university with black people? New Yorker When art makes you free Morgan Jerkins, a Harlem-based writer and editor, has written a beautiful essay that explores the deep need for escape that many black people feel in America, a longing for emotional safety and freedom from systemic violence that has fueled personal choices for generations. A Rochester man seeks Canadian asylum in 2015. An enslaved man disguises himself as a free black sailor to escape to New York in 1838. A Rhodes Scholar crosses the globe from the U.S to Brazil and back, looking for a place called home. “Our perpetual lack of belonging fuels our desire to flee, but where do you turn when there seems to be nowhere to seek refuge?” Her answer is an affirmation of art you didn’t know you needed. Hazlitt By erasing Islam from Rumi’s poetry, we all miss his point Rumi’s love poetry has been a revelation for seekers of universal wisdom around the world for centuries. But the New Yorker’s Rozina Ali argues that his popularity, particularly within high tone circles — Madonna, Tilda Swinton and Coldplay’s Chris Martin are among his current celebrity fans – have allowed publishers to erase Rumi’s Muslim essence from his work to our detriment. But don’t blame rock and roll. “It was in the Victorian period that readers in the West began to uncouple mystical poetry from its Islamic roots.” It was Rumi’s unique experience at the intersection of Sufism, Sunni Islam and Koranic debate that informed his voice, and animated his desire for oneness with God. But a committed contempt for Islam persuaded scholars over the years that Rumi was “mystical not because of Islam but in spite of it.” New Yorker Quote", "external_links": [], "published": "2018-01-10T21:09:00.000+02:00", "crawled": "2018-01-10T22:19:16.018+02:00", "highlightTitle": ""}