{"organizations": [], "uuid": "e803842139faa5bb97d4ca2ea598707ebcaddab4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 32, "shares": 32, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226251040&w=1200&r=LYNXMPEE0S0LN", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-philippines-drugs/philippine-police-return-to-war-on-drugs-cannot-promise-no-bloodshed-idUSKBN1FI0WP", "country": "US", "domain_rank": 408, "title": "Philippine police return to war on drugs, cannot promise no bloodshed", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T11:40:00.000+02:00", "replies_count": 0, "uuid": "e803842139faa5bb97d4ca2ea598707ebcaddab4"}, "author": "", "url": "https://www.reuters.com/article/us-philippines-drugs/philippine-police-return-to-war-on-drugs-cannot-promise-no-bloodshed-idUSKBN1FI0WP", "ord_in_thread": 0, "title": "Philippine police return to war on drugs, cannot promise no bloodshed", "locations": [], "entities": {"persons": [{"name": "dela rosa", "sentiment": "none"}, {"name": "duterte", "sentiment": "none"}, {"name": "ronaldo dela rosa", "sentiment": "none"}, {"name": "rodrigo duterte", "sentiment": "none"}], "locations": [{"name": "philippine", "sentiment": "none"}, {"name": "philippines", "sentiment": "none"}, {"name": "manila", "sentiment": "none"}, {"name": "davao", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MANILA (Reuters) - Police in the Philippines on Monday resumed President Rodrigo Duterte’s war on drugs, making visits to the homes of users and dealers to convince them to surrender, but the national police chief said he could not promise a bloodless campaign.\nThe announcement came as the justice department filed its first criminal case against police officers in the battle against drugs, bolstering human rights activists’ accusations of fabricated accounts of shoot-outs with drug suspects.\nThe program of visits, known as “Oplan Tokhang”, made a comeback with an assurance from police chief Ronaldo dela Rosa that it should be free of violence if offenders agreed to go quietly and did not resist.\nBut he could not promise a “foolproof anti-drug campaign that would be bloodless”, Dela Rosa added, as the police were “not dealing with people who are in their proper state of mind”.\nIn the dialect of Duterte’s southern hometown of Davao, “Tokhang” is a combination of the words “knock” and “plead”.\nBesides the visits, police have also run so-called “buy-bust” or sting operations and raided suspected drug dens and illicit laboratories.\nIn many of these operations, say rights activists, suspects did not get the chance to surrender, but were executed in cold blood instead. But police insist suspects died because they violently resisted arrest.\nNearly 4,000 drug suspects have died in gun battles with police since June 2016, when Duterte came to power. The government lost 85 police and soldiers in the drugs war, police data show.\nMore than 1.2 million people had also turned themselves in after the home visits.\nDuterte has stopped police anti-drugs operations twice due to questions over the conduct of the force, including the killing of a teenager in a supposed anti-drug operation.\nOn Monday, the justice department filed murder charges and two drug-related cases against three police officers who killed the teenager, Kian Loyd delos Santos, after witnesses disputed the police version of the killing.\nNational police spokesman Dionardo Carlos said the force welcomed the filing.\n“The police officers have to face their accusers in court and prove their innocence, they have to follow the procedures,” he said, urging due process for the officers.\nTo ensure transparency, Dela Rosa invited human rights advocates, priests and the media to join the relaunched program of home visits.\nThe police officers involved would also undergo a vetting process to weed out “rogue” officers, said Dela Rosa, adding that past abuses had involved the police seeking bribes to drop the names of people from the lists they compiled.\n“We are certainly hoping that it will be less controversial, because controversy will only blur the real intention, which is really the fight against dangerous drugs,” Harry Roque, Duterte’s spokesman, told a regular media briefing.\nReporting by Karen Lema and Manuel Mogato; Editing by Clarence Fernandez\n ", "external_links": [], "published": "2018-01-29T11:40:00.000+02:00", "crawled": "2018-01-29T11:55:47.002+02:00", "highlightTitle": ""}