{"organizations": [], "uuid": "e84b27c6406839b7b8ebaac8aef0d3c6c083c520", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 12}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223448560&w=1200&r=LYNXMPEE0I1NM", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-bunge-m-a-archer-daniels/archer-daniels-has-made-takeover-approach-to-bunge-wsj-idUKKBN1F82N4", "country": "US", "domain_rank": 408, "title": "ADM has made takeover approach to Bunge - WSJ", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T23:59:00.000+02:00", "replies_count": 0, "uuid": "e84b27c6406839b7b8ebaac8aef0d3c6c083c520"}, "author": "", "url": "https://uk.reuters.com/article/us-bunge-m-a-archer-daniels/archer-daniels-has-made-takeover-approach-to-bunge-wsj-idUKKBN1F82N4", "ord_in_thread": 0, "title": "ADM has made takeover approach to Bunge - WSJ", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 9:22 PM / Updated 5 minutes ago ADM pursues big ag merger with grain trader Bunge: WSJ Tom Polansek , Rod Nickel 5 Min Read \nCHICAGO/CALGARY, Alberta (Reuters) - Top U.S. grains merchant Archer Daniels Midland Co ( ADM.N ) has proposed a takeover of Bunge Ltd ( BG.N ), the Wall Street Journal reported on Friday, a move that could set up a battle for Bunge with London-based rival Glencore Plc ( GLEN.L ). \nLarge grain traders which make money by buying, selling, storing, shipping and trading crops have struggled in recent years with the global oversupply. Thin margins have squeezed core commodity trading operations, including those of Bunge, ADM, Cargill Inc [CARG.UL] and Louis Dreyfus Co [AKIRAU.UL]. Together the four are known as the “ABCDs.” \nConsolidation is seen as one remedy. Glencore last year sought a tie-up with grains trader Bunge in what was viewed as start of a wave of consolidation in the industry. \nThe Journal quoted unnamed sources as saying that ADM had made the approach and that details were unclear. \nWhite Plains, New York-based Bunge operates in more than 40 countries and is Brazil’s largest exporter of agricultural products, while Chicago-based ADM says it has customers in 160 countries. \nBunge, which has a market cap of $9.79 billion, closed up 11 percent at $77.56 on Friday. ADM has a market capitalization of $22.64 billion. \nADM said it does not comment on “rumors or speculation,” while Bunge was not immediately available for comment. STRATEGY SHIFT? \nGrain companies have expanded into higher-margin endeavors, such as food ingredients and aquaculture, to offset weak results and wild swings connected to their traditional business of handling crops. \nIn 2014, ADM bought natural ingredient company Wild Flavors for about $3 billion in its biggest deal ever. The company has also expanded into handling healthy ingredients such as fruits, nuts and “ancient grains.” \n“News of the ADM bid is a bit surprising given that ADM had been indicating the company’s strategic direction was more towards value-added rather the traditional commodities,” said Farha Aslam, analyst for Stephens Inc. HURDLES LOOM \nAny tie-up would likely face stiff scrutiny from regulators and opposition from farmers who fear handing more market control to ADM could hurt prices paid for wheat, corn and soybeans. \nThe biggest overlap between ADM and Bunge in the United States is in grain origination and oilseeds processing, Aslam said. The companies would probably need to divest facilities in North America and also possibly in Europe, she said. \nAslam also said it was possible ADM and Glencore could partner in a bid for Bunge to split up its operations. \n“ADM would take the more value-added downstream businesses and Glencore would own the more ag commodity businesses,” she said. \nAnalysts at Morningstar said Bunge could go for about $90 to more than $100 per share. Aslam estimated that fair value for Bunge in a takeover would be $90 to $95 per share. \nA grain trading source said there is so much overlap of oilseed crushing assets between the two companies that the deal looks defensive – a way to keep Glencore from acquiring Bunge. Still, it would shore up ADM’s assets in South America, the trader said. \nBunge rebuffed Glencore last year, and the two struck an agreement that temporarily prevents Glencore from making a hostile bid, according to news media reports. \nAn ADM-Bunge merger would also face opposition from farmer groups in key agricultural markets, including the United States, European Union, China, India and Brazil, said Erik Gordon, a professor at the University of Michigan’s Ross School of Business. \nThe companies’ relative tardiness in joining the big-agriculture merger game - following on the heels of DowDuPont ( DWDP.N ), Nutrien Ltd ( NTR.TO ) and others – would make gaining regulatory approval even tougher, Gordon said. \n“When you’re the first one, there’s still more competition. Once they’ve let a few through, they may have second thoughts,” Gordon said. \nIllinois farmer Dan Henebry, who delivers corn and soybeans to ADM’s North American headquarters in Decatur, Illinois, said he was worried a takeover of Bunge could lead to grain handlers paying farmers less for their crops. \n“We’ve had so many mergers,” Henebry said. “Less competition is not good.” \nRodney Weinzierl, executive director of the Illinois Corn Growers Association, said they would watch the deal closely even though Illinois farmers have a fairly diversified set of buyers for their corn, ranging from ADM and Bunge to cattle ranchers. \n”Obviously when a couple of our customers talk about being one customer, you lose competition,” he said. Reporting by John Benny in Bengaluru, Rod Nickel in Calgary, Alberta; Tom Polansek in Chicago, Chris Prentice in New York and Diane Bartz in Washington; Writing by Peter Henderson and Anna Driver; Editing by Maju Samuel and Matthew Lewis", "external_links": [], "published": "2018-01-19T23:59:00.000+02:00", "crawled": "2018-01-20T00:11:03.009+02:00", "highlightTitle": ""}