{"organizations": [], "uuid": "1c69cce6161a30125f603e7797fc9e6725f2f1aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/business-wire-jim-kelliher-joins-drift-as-chief-financial-officer-to-help-scale-the-worldas-leading-conversational-marketing-and-sales.html", "country": "US", "domain_rank": 767, "title": "Jim Kelliher Joins Drift as Chief Financial Officer to Help Scale the World’s Leading Conversational Marketing and Sales Platform", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T16:00:00.000+02:00", "replies_count": 0, "uuid": "1c69cce6161a30125f603e7797fc9e6725f2f1aa"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/business-wire-jim-kelliher-joins-drift-as-chief-financial-officer-to-help-scale-the-worldas-leading-conversational-marketing-and-sales.html", "ord_in_thread": 0, "title": "Jim Kelliher Joins Drift as Chief Financial Officer to Help Scale the World’s Leading Conversational Marketing and Sales Platform", "locations": [], "entities": {"persons": [{"name": "jim kelliher", "sentiment": "negative"}, {"name": "actifio", "sentiment": "none"}, {"name": "jim", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Former Actifio and LogMeIn CFO brings 20+ years of operating experience to the Drift team.\nBOSTON--(BUSINESS WIRE)-- Drift, the world’s first and only conversational marketing and sales platform, today announced that Jim Kelliher has joined as the company’s first Chief Financial Officer. Jim will be responsible for all financial and administrative operations at Drift, including human resources, legal, IT, and facilities.\nPrior to Drift, Jim served as the CFO of Actifio, a venture-backed company in the enterprise data management space, which he joined in January 2015. Prior to Actifio, Jim served as the CFO of LogMeIn from 2006 to 2015 and played a pivotal role in taking LogMeIn public in July 2009, and scaling the company from 50 employees and $10M in revenue when he joined to over 1,000 employees and $250M in revenue.\n“Last year I asked many of our advisors, investors, and mentors who the best CFO they ever worked with was and they all had the same answer: Jim Kelliher. We met shortly after that, and today I couldn’t be happier to welcome Jim to the team,” said Drift Founder & CEO David Cancel. “Over the past year, Drift has grown from 25 people to 100, opened a new office in San Francisco, and increased revenue by more than 10x. I’m thrilled to be able to partner with Jim on this next phase of growth and scaling Drift in 2018 and beyond.”\n“The Drift team has been able to build a brand, create a movement, and become one of the fastest-growing SaaS companies at this stage. The opportunity here is tremendous,” Jim said. “Joining at the Series B stage has been my sweet spot over the course of my career, and I’m excited to get back in there at Drift and build the systems and processes to help the company scale.”\nIn addition to his time at Actifio and LogMeIn, Jim was the CFO of IMlogic, a venture-backed enterprise instant messaging company. Before that he served in a number of financial executive roles, including stints as VP of Finance and International Chief Financial Officer of PTC, a publicly traded software development company.\nJim serves on the Board of Directors of Adaptive Insights, a venture funded SaaS based business analytics company based in Palo Alto, and previously served on the Board of Fleetmatics Group PLC, a NYSE publicly traded SaaS company, prior to its acquisition by Verizon in November 2016. He holds a B.S. in Accountancy from Bentley University.\nAbout Drift\nDrift is the world’s first and only conversational marketing and sales platform. With its quickly evolving set of tools and playbooks, Drift makes it easier for businesses to buy from businesses. Customers use Drift to provide a modern buying experience for potential customers, generate more qualified leads, and dramatically accelerate the sales cycle. Based in Boston, Massachusetts, Drift is a venture-backed company founded by serial marketing technology entrepreneurs David Cancel and Elias Torres.\nTo learn more about how Drift is making it easier for businesses to buy from businesses by visiting https://www.drift.com/ .\n //www.businesswire.com/news/home/20180103005348/en/\nDrift\nDave Gerhardt\nDirector of Marketing\ndg@drift.com\nSource: Drift", "external_links": ["http://www.businesswire.com/news/home/20180103005348/en/", "https://www.drift.com/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.drift.com%2F.&esheet=51736996&newsitemid=20180103005348&lan=en-US&anchor=https%3A%2F%2Fwww.drift.com%2F&index=1&md5=35723c1643e81a2b0975c8cb73f01d73"], "published": "2018-01-03T16:00:00.000+02:00", "crawled": "2018-01-03T16:50:27.006+02:00", "highlightTitle": ""}