{"organizations": [], "uuid": "3d3592d4c890b0eac1f53d86e8f948cc85f00500", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/business-wire-preliminary-results-for-2017-sartorius-stedim-biotech-grows-in-revenue-and-earnings-aapositive-outlook-for-2018.html", "country": "US", "domain_rank": 767, "title": "Preliminary Results for 2017: Sartorius Stedim Biotech Grows in Revenue and Earnings – Positive Outlook for 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.336, "site_type": "news", "published": "2018-01-31T09:00:00.000+02:00", "replies_count": 0, "uuid": "3d3592d4c890b0eac1f53d86e8f948cc85f00500"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/business-wire-preliminary-results-for-2017-sartorius-stedim-biotech-grows-in-revenue-and-earnings-aapositive-outlook-for-2018.html", "ord_in_thread": 0, "title": "Preliminary Results for 2017: Sartorius Stedim Biotech Grows in Revenue and Earnings – Positive Outlook for 2018", "locations": [], "entities": {"persons": [{"name": "sartorius stedim biotech", "sentiment": "none"}], "locations": [{"name": "aubagne", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}], "organizations": [{"name": "americas", "sentiment": "none"}, {"name": "emea", "sentiment": "none"}, {"name": "ebitda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AUBAGNE, France--(BUSINESS WIRE)-- Regulatory News:\n€ in millions unless otherwise specified Unaudited figures\n2017 2016 Growth in % Growth in % const. fx Sales revenue 1,081.0 1,051.6 2.8 4.1 EMEA 1 460.7 454.4 1.4 2.2 Americas 1 368.8 387.8 -4.9 -3.5 Asia | Pacific 1 251.6 209.5 20.1 21.4 Order intake 1,162.3 1,080.8 7.5 8.8 EBITDA 2 294.9 288.7 2.2 EBITDA margin 2 in % 27.3 27.5 Net profit 3 180.4 176.6 2.2 Earnings per share 3 in € 1.96 1.92 2.2 1 According to customers’ location\n2 Underlying EBITDA = earnings before interest, taxes, depreciation and amortization, adjusted for extraordinary items\n3 Underlying net profit = net profit after non-controlling interest; adjusted for extraordinary items and non-cash amortization, as well as based on a normalized financial result and tax rate\nSolid revenue growth despite a high prior-year base; order intake gaining momentum\nGiven the high revenue base after two extraordinarily strong years and a partially challenging business environment, Sartorius Stedim Biotech (SSB), a leading supplier for the biopharmaceutical industry, showed robust development in fiscal 2017 with an increase in sales revenue by around 4.1% to €1,081.0 million. Consolidation of acquisitions contributed around 1 percentage point to growth. Dynamics were temporarily dampened by destocking by some customers as well as by transient manufacturing and supply bottlenecks that weighed especially on the Americas region. In contrast, Asia showed strong double-digit growth fueled by large equipment projects. Driven by a robust H2 performance, order intake grew twice as fast as sales; supporting a positive 2018 outlook.\nSlight increase in underlying EBITDA and net profit\nSSB’s underlying EBITDA increased by 2.2% to €294.9 million. Influenced by unfavorable currency effects, the corresponding margin declined slightly from 27.5% to 27.3%. Underlying earnings per share were up to €1.96 from €1.92 last year. The US tax reform had no significant impact on SSB´s net earnings in 2017.\nComfortable financial position\nEven after the acquisition of Umetrics in 2017, SSB ´s financial position has remained very solid. Equity ratio was at 62.6% and the ratio of net debt to underlying EBITDA at 0.4 (63.9% and 0.2 by year-end 2016), net debt at the end of the fiscal year 2017 stood at €127.1 million (year-end 2016 67.6 million).\nPositive outlook for 2018\nSartorius Stedim Biotech expects profitable growth for the year 2018. Management forecasts a rise in sales revenue by about 7% to 10% and an increase of the underlying EBITDA margin by approx. 0.5 percentage points over the prior-year figure of 27.3%. Capex is expected to be at approx. 15% of sales.\nAll figures in this outlook are given in constant currencies. Because of current currency developments, especially regarding the exchange rate between the US dollar and the euro, the profitability expectation may have to be checked during the year.\nFrom 2018 onwards, the US tax reform is expected to lead to a reduction in the SSB Group´s tax rate by approximately 2 percentage points to 26%.\nAll figures given above are subject to a final audit by statutory auditors.\nThis press release contains statements about the future development of the Sartorius Stedim Biotech Group. We cannot guarantee that the content of these statements will actually apply because these statements are based upon assumptions and estimates that harbor certain risks and uncertainties.\nConference call\nJoachim Kreuzburg, CEO and Chairman of the Board of the Sartorius Stedim Biotech Group, will discuss the company’s results with analysts and investors on Wednesday, January 31, 2018, at 4 p.m. Central European Time (CET), in a teleconference. You may register to the teleconference at:\nhttp://services.choruscall.de/DiamondPassRegistration/register?confirmationNumber=4999614&linkSecurityString=18dd48dd2\nAlternatively, you can dial into the teleconference without registration at:\n+49 (0) 69 566 03 6000\nTo view the presentation, log onto: www.sartorius-stedim.com\nA profile of Sartorius Stedim Biotech\nSartorius Stedim Biotech is a leading international supplier of products and services that enable the biopharmaceutical industry to develop and manufacture drugs safely and efficiently. As a total solutions provider, Sartorius Stedim Biotech offers a portfolio covering nearly all steps of biopharmaceutical manufacture. The company focuses on single-use technologies and value-added services to meet the rapidly changing technology requirements of the industry it serves. Headquartered in Aubagne, France, Sartorius Stedim Biotech is Quote: d on the Eurolist of Euronext Paris. With its own manufacturing and R&D sites in Europe, North America and Asia and an international network of sales companies, Sartorius Stedim Biotech has a global reach. In 2017, the company employed approx. 5,100 people, and earned sales revenue of €1,081.0 million according to preliminary figures.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fservices.choruscall.de%2FDiamondPassRegistration%2Fregister%3FconfirmationNumber%3D4999614%26linkSecurityString%3D18dd48dd2&esheet=51751017&newsitemid=20180130006102&lan=en-US&anchor=http%3A%2F%2Fservices.choruscall.de%2FDiamondPassRegistration%2Fregister%3FconfirmationNumber%3D4999614%26linkSecurityString%3D18dd48dd2&index=1&md5=5dfdfbd27de5eaaa2ada20d474fc27ad", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sartorius-stedim.com&esheet=51751017&newsitemid=20180130006102&lan=en-US&anchor=www.sartorius-stedim.com&index=2&md5=fd76106e5394b255ddfd766ef9b811c5", "http://services.choruscall.de/DiamondPassRegistration/register?confirmationNumber=4999614&linkSecurityString=18dd48dd2"], "published": "2018-01-31T09:00:00.000+02:00", "crawled": "2018-01-31T11:09:57.017+02:00", "highlightTitle": ""}