{"organizations": [], "uuid": "72cbe3d0ae2df5e2a6cd47a3da37e77179f86a92", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-seadrill-bankruptcy/u-s-court-should-demand-more-info-on-seadrill-restructuring-watchdog-says-idUSKBN1ET1WQ", "country": "US", "domain_rank": 408, "title": "U.S. court should demand more info on Seadrill restructuring, watchdog says", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T18:30:00.000+02:00", "replies_count": 0, "uuid": "72cbe3d0ae2df5e2a6cd47a3da37e77179f86a92"}, "author": "", "url": "https://www.reuters.com/article/us-seadrill-bankruptcy/u-s-court-should-demand-more-info-on-seadrill-restructuring-watchdog-says-idUSKBN1ET1WQ", "ord_in_thread": 0, "title": "U.S. court should demand more info on Seadrill restructuring, watchdog says", "locations": [], "entities": {"persons": [{"name": "john fredrik", "sentiment": "none"}, {"name": "seadrill", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OSLO/CHICAGO (Reuters) - A U.S. court should dismiss the information provided by drilling rig firm Seadrill ( SDRL.OL ) about its restructuring plan as inadequate, a U.S. government bankruptcy watchdog said in a filing on Wednesday.\nThe U.S. Trustee said the bankruptcy court in Texas should reject Seadrill’s so-called “disclosure statement” on its restructuring proposal, a move that would require the Norwegian company to revise its statement and could delay the process.\nThe court, which has to approve the disclosure statement before the plan can be put to a vote by creditors, is due to hold a hearing on Jan. 10. It is not obliged to follow the Trustee’s recommendations.\nSeadrill, once the largest drilling rig operator by market value, filed for bankruptcy protection in a U.S. court on Sept. 12 after being hit hard by cutbacks in oil company investment following a steep drop in oil prices.\nThe company’s main owner, Norwegian-born billionaire John Fredriksen, has drawn up a $1.1 billion restructuring plan with Centerbridge Partners L.P. and a group of hedge funds.\nHowever, Seadrill has also received two alternative proposals, one from Barclays Capital and another from a group of unsecured bondholders, and will have to convince the U.S. court and its creditors that its plan is better.\nIn an objection filed with the U.S. Bankruptcy Court in Houston, acting U.S. Trustee Henry G. Hobbs, Jr. said Seadrill’s disclosure statement lacked “information and detail in critical areas which prevent creditors and interest holders from making an informed decision” about the company’s restructuring plan.\nThe Trustee, part of the U.S. Justice Department, said Seadrill’s statement failed to disclose payments that benefited company insiders before it filed for Chapter 11 bankruptcy. The company disclosed $23 million in payments to unidentified company insiders as part of its statement of financial affairs (SOFA) on Nov. 11.\nThe Trustee said Seadrill had also wrongly included unsecured bank claims in the same class as other unsecured claims, echoing objections from some bondholders, including shipbuilder Samsung Heavy Industries Co Ltd.\nThat could affect how the class as a whole votes on the restructuring plan, under which banks could recover at least 90 percent of their exposure, but bondholders as little as 18 percent.\nReporting by Nerijus Adomaitis in Oslo and Tracy Rucinski in Chicago; Additional reporting by Tom Hals in Wilmington; Editing by Mark Potter\n ", "external_links": [], "published": "2018-01-04T18:30:00.000+02:00", "crawled": "2018-01-04T18:39:01.008+02:00", "highlightTitle": ""}