{"organizations": [], "uuid": "61514e8f42aaeb712f3fa4613dcbac2c72b6c980", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.goldreview.com/feed", "section_title": "Gold Review » Gold Review", "url": "https://uk.reuters.com/article/global-precious/precious-gold-hits-4-mth-high-as-dollar-index-slumps-to-3-yr-lows-idUKL3N1PA1CS", "country": "US", "domain_rank": 408, "title": "Gold hits over 4-mth high as dollar index slumps to 3-yr lows", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T16:08:00.000+02:00", "replies_count": 0, "uuid": "61514e8f42aaeb712f3fa4613dcbac2c72b6c980"}, "author": "cmullen", "url": "https://uk.reuters.com/article/global-precious/precious-gold-hits-4-mth-high-as-dollar-index-slumps-to-3-yr-lows-idUKL3N1PA1CS", "ord_in_thread": 0, "title": "Gold hits over 4-mth high as dollar index slumps to 3-yr lows", "locations": [], "entities": {"persons": [{"name": "sethuraman n r jan", "sentiment": "none"}, {"name": "stephen innes", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "middle east", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}], "organizations": [{"name": "comex", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "oanda", "sentiment": "none"}, {"name": "apac", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 3:29 AM / a day ago PRECIOUS-Gold hits over 4-mth high as dollar index slumps to 3-yr lows Reuters Staff 4 Min Read \n* Spot gold may rise to $1,357.54/oz - technicals * Speculators raise net longs in COMEX gold in the week to Jan. 9. * Palladium hits new record highs (Updates prices) By Sethuraman N R Jan 15 (Reuters) - Gold prices touched their highest in more than four months on Monday, buoyed by a weaker U.S. dollar, which slumped to three-year lows against a basket of currencies. Spot gold was up 0.3 percent at $1,342.50 an ounce by 0718 GMT after touching its strongest since Sept. 8 at $1,344.44. Spot gold rose for a fifth straight week last week, gaining 1.4 percent. U.S. gold futures were up 0.5 percent at $1,341.90 an ounce. \"While the weaker dollar remained gold's primary driver, investors are keeping an eye on the simmering geopolitical hot spot in the Middle East,\" said Stephen Innes, APAC head of trading at OANDA. \"Iran remains among the most poignant of geopolitical risks this year following President Trump's decision not to ratify Iran's compliance on the nuclear deal ... Gold investors are likely under-positioned for a significant escalation which could lead to considerable price increase.\" Iran's president said on Sunday the United States had failed to undermine a nuclear deal between Tehran and major powers, and hailed the accord as a \"long-lasting victory\" for Iran, state television reported. U.S. President Donald Trump on Friday delivered an ultimatum to European signatories of the deal to fix the \"terrible flaws\" of the agreement with Iran, or the United States would pull out. The dollar index dropped 0.2 percent to 90.810. Earlier in the session, it hit a low of 90.622 , its worst since Jan. 2015. The recent drop in U.S. unemployment could spark a surge in inflation that, given the Federal Reserve's current policy framework, could trigger interest-rate hikes that bring on a recession, Boston Federal Reserve President Eric Rosengren warned on Friday. Higher rates could dent demand for non-interest-paying gold. Adding a touch of bullishness to gold was the data from U.S. Commodity Futures Trading Commission (CFTC) on Friday, which showed that hedge funds and money managers raised their net long positions in COMEX gold and silver contracts in the week to Jan. 9. Spot gold may break a resistance at $1,341 per ounce and rise to the Sept. 8, 2017 high of $1,357.54, as suggested by a retracement analysis, according to Reuters technical analyst Wang Tao. Among other precious metals, palladium rose 1 percent to $1,135 on Monday, after hitting a record high of $1,138 early in the session. The metal has seen a sustained rally from high demand in the auto industry amid a supply deficit, analysts said. Spot silver rose 0.7 percent to $17.26 an ounce, after touching a near three-month high at $17.42. Platinum was up 0.3 percent at $996.95, after touching its highest since Sept. 11 at $1,001.40 on Monday. (Reporting by Nallur Sethuraman in Bengaluru; Editing by Sunil Nair and Biju Dwarakanath)", "external_links": [], "published": "2018-01-15T16:08:00.000+02:00", "crawled": "2018-01-16T00:43:05.023+02:00", "highlightTitle": ""}