{"organizations": [], "uuid": "0a8c588e168c6abe949215af86b8201dea170852", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-predictive-technology-group-finalizes-letter-of-intent-to-acquire-flagshiphealth-group.html", "country": "US", "domain_rank": 767, "title": "Predictive Technology Group Finalizes Letter of Intent to Acquire FlagshipHealth Group", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.969, "site_type": "news", "published": "2018-01-09T21:00:00.000+02:00", "replies_count": 0, "uuid": "0a8c588e168c6abe949215af86b8201dea170852"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-predictive-technology-group-finalizes-letter-of-intent-to-acquire-flagshiphealth-group.html", "ord_in_thread": 0, "title": "Predictive Technology Group Finalizes Letter of Intent to Acquire FlagshipHealth Group", "locations": [], "entities": {"persons": [], "locations": [{"name": "lake city", "sentiment": "none"}, {"name": "utah", "sentiment": "none"}], "organizations": [{"name": "predictive technology group finalizes letter of intent to acquire flagshiphealth group", "sentiment": "negative"}, {"name": "predictive technology group, inc.", "sentiment": "neutral"}, {"name": "flagshiphealth group", "sentiment": "none"}, {"name": "predictive technology group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SALT LAKE CITY, Utah, Jan. 09, 2018 (GLOBE NEWSWIRE) -- Predictive Technology Group, Inc. (OTC PINK:PRED), a leader in the use of data analytics for disease identification and subsequent therapeutic intervention through unique biotechnology treatments, announces that it finalized an arrangement for the acquisition of FlagshipHealth Group , a Minneapolis-based provider of sales and consulting services for the healthcare industry.\nPredictive Technology Group, Inc. (OTC PINK: PRED), a leader in the use of data analytics for disease identification and subsequent therapeutic intervention through unique biotechnology treatments, today announced that it has finalized arrangements for the acquisition of FlagshipHealth Group, a Minneapolis-based provider of sales and consulting services for the health care industry, www.predictivetechnologygroup.com and www.flagshiphealthgroup.com\nThe business combination provides essential resources for Predictive Technology Group to develop, launch, and grow its services directed at limiting disease and improving the health and well-being of individuals confronting a wide-range of medical conditions. Since February 2017, Flagship provided sales and marketing support for the successful launch of treatments offered by Predictive Technology Group’s wholly owned subsidiary Predictive Biotech - one of the fastest growing regenerative medicine portfolios in the U.S.\nFlagshipHealth Group also worked with Predictive Technology Group’s wholly owned subsidiary Predictive Therapeutics toward commercialization, in late 2018, of the ARTGuide™, a genetic diagnostic for endometriosis and other concerns addressed in fertility clinics , and FertilityDx™ Services, a test suite delivering personalized and comprehensive genetic diagnostic services to couples undergoing infertility care.\nThe seasoned and proven management team at FlagshipHealth Group brings diverse and deep experience in all areas of healthcare. The company focuses on delivering innovative and beneficial health and treatment approaches to people who can benefit from them, and in ways which help improve the services and efficiency of those providing care. FlagshipHealth Group, headed by President and Founder Tim Lacy , a veteran executive whose experience includes senior executive positions at UnitedHealth Group and Walgreens , and FlagshipHealth’s Michael Herbert , a seasoned healthcare veteran who has focused on the Predictive partnership since February of 2017. Also, William W. McGuire, M.D ., the former Chairman and Chief Executive Officer of UnitedHealth Group for 17 years in its formative development and growth phase, provides Predictive Technology Group with strategic and tactical planning around healthcare issues and customer needs.\n“We are very pleased to have the team at Flagship join the Predictive organization,” said Bradley Robinson, CEO of Predictive Technology Group. “As we move forward to fully address important challenges, such as endometriosis, and our efforts in regenerative health interventions, the team at Flagship demonstrates a tremendous understanding of the complexity and stakeholder diversity within healthcare delivery, finance and administration. With the expansion of our products and services addressing significant medical problems confronting individuals and families throughout the world and our imminent commercialization of diagnostics and therapeutics for endometriosis, it became obvious that the integration of our two organizations better serves patients, care providers, and shareholders.”\nCommenting on the opportunities, Tim Lacy said, “We have enjoyed working closely with Predictive since our introduction in 2010, and through Predictive Biotech’s regenerative medicine commercialization in 2017. We are excited to transition Flagship from a long-time advisory partner into a permanent contributor to the Predictive family.”\n“Predictive’s business success will be directly linked to enhancing the well-being of the people it serves and its ability to improve the system within which it operates to address specific health challenges. This will be particularly true in association with the pending launch of products and services directed at the immense problems surrounding endometriosis, women’s health and the supporting health care delivery system – whether measured in terms of economic cost, patient morbidity, the needs of care providers or system efficiency,” said Dr. McGuire. “There is great potential in Predictive’s ability to positively influence an area of women’s health that has been largely underserved.”\nIn conjunction with significant additions to business management and its advisory group, the combined resources of FlagshipHealth Group, Predictive Technology Group and its subsidiaries, will be immediately directed at continued expansion of the regenerative medicine business and its efforts to assist women in overcoming the devastating consequences of endometriosis, including appropriate early-stage diagnosis and subsequent treatment.\nAbout Predictive Technology Group, Inc.\nPredictive Technology Group, Inc. (OTC PINK:PRED), a Salt Lake City, UT, based Life-Sciences Holding company formed in 2013, aims to revolutionize patient care through predictive data analytics, novel gene-based diagnostics, and companion therapeutics through its wholly owned subsidiaries Predictive Therapeutics and Predictive Biotech. Its subsidiary companies currently focus on four main categories: Endometriosis, Scoliosis, Degenerative Disc Disease and Regenerative Tissue Products. PRED is exploring possibilities for additional disease identification and treatment categories in its integrated, registered laboratories. PRED subsidiaries use genetic and other information as cornerstones in the development of new diagnostics that assess a person’s risk of illness and therapeutic products designed to identify, prevent and treat diseases more effectively, www. predictivetechnologygroup .com, www.predrx.com , and www.predbiotech.com .\nFor more information about Predictive Technology Group, Inc. and the release, contact Rich Kaiser, Investor Relations, YES INTERNATIONAL, 757-306-6090, and yes@yesinternational.com .\nForward-Looking Statements- To the extent any statements made in this release contain information that is not historical, these statements are essentially forward-looking and are subject to risks and uncertainties, including the difficulty of predicting FDA approvals, acceptance and demand for new vaccines and other pharmaceutical products, the impact of competitive products and pricing, new product development and launch, reliance on key strategic alliances, availability of raw materials, availability of additional intellectual property rights, availability of future financing sources, the regulatory environment, and other risks the Company may identify from time to time in the future.\nContact:\nRich Kaiser\nInvestor Relations\n757-306-6090\nSource:PREDICTIVE TECHNOLOGY GROUP, INC.;FlagshipHealth Group", "external_links": ["https://www.globenewswire.com/Tracker?data=wazz8asHxVbIHYSSIBkCOtqpKl-_D9K7xPSKNbkQVzBkQwjhwY3HPnQJq9S0Ubds4_lfRJxOQZ7Bbe70yalTstI8O7FDwkLTkc93wKcFjlgbnxldxnlMzYB0EOql-zryqIES5xcdHn1E1-ls_8WVyQ==", "https://www.globenewswire.com/Tracker?data=PF3h5SOOtR6BUmI-THYZp8l-iPJe45wL-p8qBSxSXdHiOFtN9kUqr710FdhYgdgNkwcUhXz0VNWM6fiKBABIe5u_JKXrKT7JNyWlPjVVA0oxhLm9WlhADZpVh4x5eaR5", "https://www.globenewswire.com/Tracker?data=BgiFZ0fyCPUoPzKiXE5R5_UJsIKshlCJdLZd3nYqIitvKTxCSw192hm5OYhyUHLVmdGQ1fyIDlxLB51n48WNf85TDT1E8N_WW1rXSNeZIIPymUJTiZeofQEaUbbUtKIpYgUdM64rkJYEBhEwjkF-PQ==", "https://www.globenewswire.com/Tracker?data=MdLnE9QGbmN0sK9xbemRjpxB-XS9Erb_bMVtU-GUcCXY6aBKzZLb_IWkeOdoiLWiKJh5dZEQy5u6SBzTU_YWtA==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/8448bcb1-d904-425c-9b52-7dafe5d762a7/en", "https://www.globenewswire.com/Tracker?data=LtkTfNjo5F_URhk3cScd4Vhf_OMU1MKKHAPWMimH0HL9bm-JnOVK0nhJZjwjRK3LJTpZ_T_Rh8jiK8JO3JW6b6PsQHfkDZgGHy1oOLNYnl0=", "https://www.globenewswire.com/Tracker?data=wazz8asHxVbIHYSSIBkCOkLbJObcTOxrYZYGFncCIFce8i0Ik1U3mRcJVV566WeWHxm_7U9uOuHFBLtJVTy27w==", "https://www.globenewswire.com/Tracker?data=TNDFVoSQ56mN1YxFNJ5BF-eQ5nnjNVtwOoxnb486A-97gYOoirHLomCEGDfY0shDmhvGVXLU4iLvPS4WB1ZKMRg0Ngzq-X9P8MPsUIillvBI9_1da-TzWgGOO6Ow2n8ctThGhGu9Y8sn9Z97udhpj7SjRaqvwex3f9Q65ncfLXxBL4-ZkdNmZhLXgJbOPVdHSzbITYkB-HR0JQDiAxgoWppkEzrv0glQ1N6OIYKvRTkrYDsrQx2Her2ifZfdqoU1vSzYkWx2poK0vbjArzylbw==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/38d9f750-b194-4161-a45d-908ed1e1314d", "https://www.globenewswire.com/Tracker?data=s7Zo27Y9QyY1ISLdnZapH8NOjsauGXKeUQWQA50l5KLbzPVjRtLXMccoazzKN73pC9FEcFLcm734vp50fyX-sg==", "https://www.globenewswire.com/Tracker?data=yhsxfebFcpsbCCd0H3BBk_S5ZNyAefDGIu0cphZ-e5yphGL-ydkW_ax966xZ3GVySqNdGXFqLb71QcfPLvgPq0tQVlvuKKf4VdT8nV99djqPSGO0uIMqz8wrCWheMStBLbfsyA8Q7vJ3GJGRxwyRf9rfwS_591lr57-75SjtZqE-f7CzDFy_boW2ZctNekAAg-Hadbj3WyLAeu_GDfyRBQ==", "https://www.globenewswire.com/Tracker?data=wazz8asHxVbIHYSSIBkCOtqpKl-_D9K7xPSKNbkQVzBeKPuQe0CeFXeFbJnBLx4jA-n53QaXFNV8xe7uKlBZNiSliiTr1HVSSXjthtBuya4E29XQrWdGCK34iAkLUyn9", "https://www.globenewswire.com/Tracker?data=ZalfEmqpwAo1IYu3557jA3zTgmxUJOHqCU0nq1_nqKHA_KNa7iZPTIx-f1gxrHhzdLTpTRzVIv8ACUsrcfMSyM7KYLm_nxuRXJtciiF__SIIVGVvDDplELfTCwEjeqTYksSnrgrXoOjC8t1F2nytF0iUVKR_7XFyURrzYam-UiAyGt60vo0QCkoVKotb-dEKS_CnJ2L6WS7CS7C01Nf7akmaXpj5BNnEB2aRAFrRKoknH2dvyRtIp33F5WKUcQawRRuZ2nApsjqmeJSjzRqaWlgjfzbQ796zBlUIm7A8xFjf6w7Bie9eb9F1XwnNRF6qHdr_d8TXdK0ylvBS8LZqqkr1lZWcpICkljGsrCAK5Ns-grfVXxIzDuqkDvyRtwdj", "https://www.globenewswire.com/Tracker?data=PF3h5SOOtR6BUmI-THYZp6vj5cC25dKwU5bLh7WDTcYgu1MV4fbckdQ6dPsQ7XQ3l7VReyjPDgznXWZZWJE0ZkH0QvYfJf1gnhoLYtYwWxwT19q14xK1xXlzyyAWvHTm9YcDoetCZq_yCtOlHmAW4xNRX5VhtrsmmlWpL5_z5v0=", "https://www.globenewswire.com/Tracker?data=wazz8asHxVbIHYSSIBkCOrfV30nAslLKbNfBRtkyGRrFH-Io9ucGpXUBfdUuiUEbM2UF5wCA-wlhmZTrspEED4N4gEw2Uu22rX3Wh-3QHUOtIEMYKNttZVIJfEFXaRmE", "https://www.globenewswire.com/Tracker?data=s7Zo27Y9QyY1ISLdnZapH044d_VmaQUzrQNj7Dhz_PDhjp8w7bY5daJoJ6uQkDdXDr8WfjI5eiSm8m8a2TlVagEXQ5_XMXkVlMeXnp32V4k=", "https://www.globenewswire.com/Tracker?data=YWS_CfMLfLjg2ckYTBv08geWfqKQroNbZ49IDoiczBU5XR5itAShBPK6kqhuKtZuMFSbBB5uS0DAEG0VhfH78-KaIzZN3_ngRhmDeXGEI6kRNLXHI9KGhVD-WeAz1akq", "https://www.globenewswire.com/Tracker?data=h1PdKlltZrbaCCt4T0d5AyGrXv_JWLC8up9oqi0KebIJAjwEmnT-5VDnJNfYTjwjAiWt2XhNms6jhmnaORRFJ0L-kSTh-Gwm9SNOcLpHSRsp7nOysrlyTHCm5j7m7LKVvX6sdPWxZ-d0wdw4unEYBQ==", "https://www.globenewswire.com/Tracker?data=Ws4JjiYL6EFK_0C6SBY2dVLMdPs--vYbw2FDuqzJOAX3Fs5IYyNmu18NLTiHtPNP9G0aZhGVdG4P5jVFttMyKOytPNKK4gWcbwpTuKMDI64P8mSck3loRlwtYOTB0w39GzlJz_e79DbHzlJoZwjZT_2m7_hqA5qILC-dJ9A1bTC09BJyTgU6vF1srbaXT1pJksIH4cCpIbbq7R5WxN7rhgSrMvyDeGMTnj1TkcCw5gUhYqTAEtBVPlZv_c23RRyw5meIaPyDk-ioPNBC6bF2Zw==", "https://www.globenewswire.com/Tracker?data=wazz8asHxVbIHYSSIBkCOovGqXOJXX9xx3k4TT8hem3CmlvXWG3jLtKrXbeVIrv4a99_5O9sGv6kHFA_d1kyZw=="], "published": "2018-01-09T21:00:00.000+02:00", "crawled": "2018-01-09T23:53:14.002+02:00", "highlightTitle": ""}