{"organizations": [], "uuid": "0db9be1a0a996545027c8688aad38dc4749d227e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-kemin-industries-acquires-canadian-company.html", "country": "US", "domain_rank": 767, "title": "Kemin Industries Acquires Canadian Company", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.033, "site_type": "news", "published": "2018-01-03T16:00:00.000+02:00", "replies_count": 0, "uuid": "0db9be1a0a996545027c8688aad38dc4749d227e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-kemin-industries-acquires-canadian-company.html", "ord_in_thread": 0, "title": "Kemin Industries Acquires Canadian Company", "locations": [], "entities": {"persons": [{"name": "chris nelson", "sentiment": "none"}, {"name": "kemin", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "iowa", "sentiment": "none"}, {"name": "quebec", "sentiment": "none"}, {"name": "kemin", "sentiment": "none"}, {"name": "mont-saint-hilaire", "sentiment": "none"}], "organizations": [{"name": "kemin industries acquires canadian company global", "sentiment": "negative"}, {"name": "agri-marketing corp", "sentiment": "none"}, {"name": "kemin industries", "sentiment": "none"}, {"name": "kemin", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Global ingredient leader creates division in Canada to serve agricultural and pet food industries\nDES MOINES, Iowa, Today Kemin Industries announced the creation of a Canadian division and will hold a grand opening and ribbon cutting ceremony on January 18, 2018, at its new location in Mont-Saint-Hilaire, Quebec, Canada. Kemin has acquired the assets of its long-time distributor Agri-Marketing Corp. Agri-Marketing was founded in 1973 in Mont-Saint-Hilaire and has provided exclusive distribution and manufacturing services for Kemin products in Canada.\n\"With this new location in Canada, we are increasing our efforts to better serve our current customers as well as explore new opportunities for our product and services to improve the quality of life for people and animals in Canada,\" said Dr. Chris Nelson, President and CEO of Kemin. \"Kemin continues to grow, and having a larger presence in Canada is a logical next step for our global expansion.\"\nAgri-Marketing has been distributing Kemin products since its inception more than 35 years ago. Kemin expects a seamless transition for customers as Agri-Marketing sales employees become Kemin employees. The new Kemin location will focus on serving the animal nutrition and health market, as well as the pet food and rendering industries. Kemin will look to grow its business through offering an expanded portfolio.\n\"The partnership with Kemin has been longstanding and imperative to our business. We consider our customers to be our top priority and we know Kemin will maintain that close relationship with them through the transition,\" said Scott Ross, President of Agri-Marketing.\nSince early 2017, Kemin has continued to increase its global reach with acquisitions and with the addition of new locations. In March, Kemin acquired Algal Scientific, a Michigan-based company specializing in beta-glucan technology for antibiotic alternatives for animals. In April, Kemin opened an office and manufacturing facility in Lipetsk, Russia.\nAbout Kemin Industries\nKemin ( www.kemin.com ) has been dedicated to using applied science to improve the quality of life for over half a century. As a global company touching 3.8 billion people every day with its products, Kemin is committed to improving the quality, safety and efficacy of food, feed and health-related products to feed a growing population and be a resource for others in need.\nCommitted to feed and food safety, Kemin maintains top-of-the-line manufacturing facilities where over 500 specialty ingredients are made for humans and animals in the global feed and food industries, as well as the health, nutrition and beauty markets. The company provides product solutions and options to customers in more than 120 countries.\nA privately held, family-owned and operated company, Kemin has more than 2,500 global employees and operates in 90 countries including manufacturing facilities in Belgium, Brazil, China, India, Italy, Russia, Singapore, South Africa and the United States.\nMedia Contact:\nLauren M.G. Burt, Worldwide Communications Manager, lauren.burt@kemin.com , (515) 559-5589\nView original content with multimedia: releases/kemin-industries-acquires-canadian-company-300576566.html\nSOURCE Kemin Industries", "external_links": ["http://www.prnewswire.com/news-releases/kemin-industries-acquires-canadian-company-300576566.html", "http://www.kemin.com/"], "published": "2018-01-03T16:00:00.000+02:00", "crawled": "2018-01-03T16:50:45.000+02:00", "highlightTitle": ""}