{"organizations": [], "uuid": "5c341ff9426e38ea5cd469507ca31652aea7c138", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/11", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-dr-john-mcgoohan-joins-cano-health-as-a-senior-leader-of-managed-care.html", "country": "US", "domain_rank": 767, "title": "Dr. John McGoohan Joins Cano Health As A Senior Leader Of Managed Care", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.792, "site_type": "news", "published": "2018-01-31T14:00:00.000+02:00", "replies_count": 0, "uuid": "5c341ff9426e38ea5cd469507ca31652aea7c138"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-dr-john-mcgoohan-joins-cano-health-as-a-senior-leader-of-managed-care.html", "ord_in_thread": 0, "title": "Dr. John McGoohan Joins Cano Health As A Senior Leader Of Managed Care", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MIAMI, Jan. 31, 2018 /PRNewswire/ -- Cano Health, LLC, a leading population health management company and operator of primary care medical centers in South Florida, today announced that Dr. John McGoohan has joined as a Senior Leader of Managed Care. Dr. McGoohan has more than 25 years of senior executive healthcare leadership and managed care experience.\nThroughout his career, Dr. McGoohan has served in senior executive positions at CarePlus Health Plans, Univita Health, Summit Health Plans, and Vista Health Plans. He has also provided consulting services for Avmed Health Plans, and IPC of Florida. Among Dr. McGoohan's areas of focus has been on improving quality outcomes throughout the continuum of care, ranging from the acute inpatient episode to the post-acute care setting.\nAs examples of this breadth and quality focus, Dr. McGoohan served as the Market Vice President and Chief Medical Officer for CarePlus Health Plans with direct oversight of the Health Services Organization, which included: pharmacy, health services, quality improvement, and 5 Stars maximization. Under Dr. McGoohan, CarePlus was the only 5 Star rated health plan in the State of Florida, and the only Humana owned company in the United States to achieve a 5 Star ranking in 2015. Most recently, Dr. McGoohan served as South Regional Medical Director with Florida Blue, which provides healthcare benefits for over 4.5M Members statewide.\nDr. Marlow Hernandez, Chief Executive Officer of Cano Health said, \"We are extremely pleased to welcome Dr. John McGoohan to our team. John's extraordinary career spans the complete spectrum of health care services, and his commitment to quality is unparalleled. Most importantly, he is single-mindedly focused on patient care and well-being – particularly in the South Florida region. This is consistent with the Mission and Vision of Cano Health and we are very excited to have him on board.\"\n\"I am thrilled and proud to join the Cano Health team,\" said Dr. McGoohan. \"I have spent my career actively pursuing their same goal: Improving patient health by delivering superior primary care medical services. I'm particularly glad to continue my work in South Florida, where building patient relationships is central to improving personal and community health care.\"\nAbout Cano Health\nCano Health, LLC operates health care centers and pharmacies in South Florida that specialize in Senior Care and Primary Care for all ages. Cano Health also provides a suite of population health management services. Cano Health's mission is to improve patient health by delivering superior primary care medical services, while forging a life-long bond with its patients. For more information visit www.canohealth.com .\nMedia Contact\nRick Sanchez\n9725 NW 117 Ave.\nMiami, FL 33178\n404.275.4098\nView original content: http://www.prnewswire.com/news-releases/dr-john-mcgoohan-joins-cano-health-as-a-senior-leader-of-managed-care-300590623.html\nSOURCE Cano Health", "external_links": ["http://www.canohealth.com/", "http://www.prnewswire.com/news-releases/dr-john-mcgoohan-joins-cano-health-as-a-senior-leader-of-managed-care-300590623.html"], "published": "2018-01-31T14:00:00.000+02:00", "crawled": "2018-01-31T18:59:27.002+02:00", "highlightTitle": ""}