{"organizations": [], "uuid": "419c9c0208abc99f92c25f5def56bfe55af2294f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-4front-congratulates-seminal-client-oasis-cannabis-on-proposed-acquisition.html", "country": "US", "domain_rank": 767, "title": "4Front Congratulates Seminal Client Oasis Cannabis on Proposed Acquisition", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.055, "site_type": "news", "published": "2018-01-23T16:30:00.000+02:00", "replies_count": 0, "uuid": "419c9c0208abc99f92c25f5def56bfe55af2294f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-4front-congratulates-seminal-client-oasis-cannabis-on-proposed-acquisition.html", "ord_in_thread": 0, "title": "4Front Congratulates Seminal Client Oasis Cannabis on Proposed Acquisition", "locations": [], "entities": {"persons": [], "locations": [{"name": "phoenix", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "4front congratulates seminal client oasis cannabis on proposed acquisition", "sentiment": "negative"}, {"name": "4front holdings", "sentiment": "negative"}, {"name": "cls holdings usa inc.", "sentiment": "none"}, {"name": "cannabis life science", "sentiment": "none"}, {"name": "oasis cannabis", "sentiment": "none"}, {"name": "4front advisors", "sentiment": "none"}, {"name": "oasis", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PHOENIX, Jan. 23, 2018 /PRNewswire/ -- 4Front Holdings, LLC (\"4Front\"), a leading investment and management firm in the medical cannabis industry, today congratulates Oasis Cannabis (\"Oasis\") on the announcement of its pending acquisition by CLS Holdings USA Inc. (\"CLS\"), a development-stage, diversified cannabis company operating as Cannabis Life Science.\nOasis is a longtime client of 4Front Advisors, a wholly owned subsidiary of 4Front that provides consulting services and operational support. Oasis operates a thriving retail location in Las Vegas that welcomes approximately 400 daily visitors and generates roughly $650,000 per month in gross revenue through retail cannabis sales, according to a news release issued by CLS.\n4Front Advisors has worked with Oasis since the summer of 2014, when the latter sought help in anticipation of Nevada accepting license applications for its nascent medical cannabis program. Oasis capitalized on 4Front Advisors' leading application support capabilities to successfully obtain one of the 60 competitively awarded dispensary licenses. 4Front Advisors also supported Oasis' application submissions for its non-competitive cultivation and processing licenses, which were also successfully obtained.\n4Front Advisors subsequently trained Oasis' management staff with its proprietary, week-long management training program, based upon 4Front Advisors' core dispensary operations model. This model was developed over several years with extensive consultation and access to the practices and people from leading medical cannabis dispensaries in Northern California, including Harborside Health Center and SPARC. 4Front's operations model also deploys the standard operating procedures that created the foundation for the retailer's success. 4Front Advisors has also provided Oasis with ongoing operational support.\nOasis opened its dispensary, located in close proximity to the Las Vegas Strip, in December 2015. The dispensary is currently undergoing an expansion of its cultivation and production facility that is expected to be completed during the third quarter of 2018. While Oasis began as a medical cannabis dispensary, Nevada has since legalized cannabis for all adults aged 21 and older, and the incumbent medical dispensaries are the first to provide this adult-use access.\n\"Oasis is now an industry leader in Nevada thanks in large part to the early risk Ben Sillitoe (Oasis' CEO and co-founder) took in 2014 when he decided to pursue an operating license, and hired us to help,\" said Kris Krane, president and co-founder of 4Front. \"4Front is proud of its role in Oasis becoming a well-respected cannabis retailer in Nevada, and is gratified that this client was able to implement these skills and training to attract a lucrative acquisition partner that will help Oasis attain its long-term goals.\"\nPer its press release, CLS Holdings' pending acquisition of Oasis is currently scheduled to close in the first quarter of 2018.\nAbout 4Front\n4Front Holdings , LLC (\"4Front\"), is a leading investment and management firm in the U.S. cannabis sector. It has developed a national platform that consists of a multi-state footprint and a far-reaching network of partnership relationships. Led by a group of professionals with experience in finance, real estate, manufacturing, and multi-location retail and hospitality operations, 4Front brings to the table a comprehensive collection of management skills and hands-on operating expertise. It has invested heavily in its talent and capabilities in order to support the rapid operational growth curve in front of it. For more information, visit www.4frontventures.com .\nMedia Contacts\nAnne Donohoe/ Azizza Brinson\nKCSA Strategic Communications\n212-896-1265 / 212-896-1276\nadonohoe@kcsa.com / abrinson@kcsa.com\nView original content: http://www.prnewswire.com/news-releases/4front-congratulates-seminal-client-oasis-cannabis-on-proposed-acquisition-300586570.html\nSOURCE 4Front Holdings, LLC", "external_links": ["http://www.4frontventures.com/", "http://www.prnewswire.com/news-releases/4front-congratulates-seminal-client-oasis-cannabis-on-proposed-acquisition-300586570.html", "http://www.nasdaq.com/press-release/cls-holdings-usas-oasis-cannabis-provides-key-performance-indicators-20171206-00393"], "published": "2018-01-23T16:30:00.000+02:00", "crawled": "2018-01-23T17:32:08.012+02:00", "highlightTitle": ""}