{"organizations": [], "uuid": "f817d684b5c8e5705eb1e7bbbe363dbb7afdc71d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/24/104965486-content_1.1910x1000.png", "site_section": "http://www.cnbc.com/id/19854910/device/rss/rss.html", "section_title": "Tech", "url": "https://www.cnbc.com/2018/01/24/djis-mavic-air-4k-folding-drone-costs-799.html", "country": "US", "domain_rank": 767, "title": "DJI’s Mavic Air 4K folding drone costs $799", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T21:45:00.000+02:00", "replies_count": 0, "uuid": "f817d684b5c8e5705eb1e7bbbe363dbb7afdc71d"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/24/djis-mavic-air-4k-folding-drone-costs-799.html", "ord_in_thread": 0, "title": "DJI’s Mavic Air 4K folding drone costs $799", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york city", "sentiment": "none"}], "organizations": [{"name": "mavic air", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DJI is ready to tighten its grip on the drone market with the new Mavic Air. Announced today at an event in New York City, the $799 Mavic Air slots right in between the company's cheapest drone (the $399 Spark) and its most capable prosumer model (the $999 Mavic Pro). It goes on sale January 28th.\nThe Mavic Air is truly a blend of those two drones. From certain angles, especially from the top, it resembles a stockier Mavic Pro, while from others (the front) it looks an awful like the Spark. Like the Mavic Pro, the drone folds up for better portability. It folds up into a smaller footprint than the Spark, and it's 41 percent lighter than the Pro.\n4K video at 24 or 30 FPS, or 12-megapixel stills The specs of the Mavic Air are much closer to those of the Pro, which should please consumers who thought the Spark was too underpowered to use for filming or photography. In some ways, it almost sounds better. The Mavic Air uses a 1/2.3-inch sensor that shoots 4K video at 24 or 30 frames per second, or 12-megapixel stills, all with a wide-angle 24mm f/2.8 lens. It tops out at 42.5 miles per hour, can withstand winds of up to 22 miles per hour, and has a 2.5-mile range (within visual line of sight), thanks to a new antenna design.\nMore from The Verge:\nFitbit will end support for Pebble smartwatches in June \nChecking out the new $129.95 DJI Osmo Mobile 2 phone stabilizer \nSpire Studio is a recording studio that fits in your hand \n\nThe Mavic Air also got a redesigned ventilation system that DJI says will help keep it from overheating, along with a new 3-axis gimbal casing for the camera for smooth footage. It should be relatively easy and safe to fly, too, with a seven-camera obstacle avoidance system. There's also a new remote, which is included in the $799 price.\nDJI is promising both updated and improved software features on the Air, too. There are new shooting modes (including a 32-megapixel panorama option, or a tiny planet mode), better gesture controls, and the company claims it's improved its image processing in order to squeeze better photos and videos out of that relatively tiny sensor. New obstacle-avoidance software, which calls on more sensors and better algorithms, will help the drone avoid and move past obstacles instead of just stopping in front of them, according to DJI.\nOne thing DJI didn't do with the new drone is improve the flying time in any significant way. The Mavic Air is only capable of staying in flight for 21 minutes, which is five more than the Spark, but six short of the Mavic Pro. (The flight time is nine minutes short of the flight time of the Mavic Pro Platinum, an upgraded version of the Mavic Pro that costs $1,099.)\nDJI built up its dominant market share in North America on the strength of the Phantom series of drones, but it's the increased portability and affordability of products like the Mavic Pro and the Spark that have solidified its grip. As DJI keeps innovating with new drones and finding new price points to match, the American competition has essentially fallen away . Just two weeks ago, GoPro announced that it is exiting the market and shutting down the division that made its own drone, Karma.\nUpdate January 23rd, 2:20PM ET: This post originally listed the Spark's price as $499, but DJI recently discounted the Spark to $399. The post also listed that the new controller has an integrated screen, which it does not. The story has been updated.", "external_links": [], "published": "2018-01-24T21:45:00.000+02:00", "crawled": "2018-01-24T22:20:36.052+02:00", "highlightTitle": ""}