{"organizations": [], "uuid": "cd867bfd836d27c9f6f62f6589a4cf2808f64382", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/08/104933960-Man_traveling.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/08/best-credit-cards-for-travel-rewards.html", "country": "US", "domain_rank": 767, "title": "Best credit cards for travel rewards", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.191, "site_type": "news", "published": "2018-01-08T19:10:00.000+02:00", "replies_count": 0, "uuid": "cd867bfd836d27c9f6f62f6589a4cf2808f64382"}, "author": "Emmie Martin", "url": "https://www.cnbc.com/2018/01/08/best-credit-cards-for-travel-rewards.html", "ord_in_thread": 0, "title": "Best credit cards for travel rewards", "locations": [], "entities": {"persons": [{"name": "wallethub", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Paying with a credit card over cash or a debit card is the smart choice much of the time , many experts agree, as long as you can pay off your balance each month in full, since plastic can offer both protection and rewards.\nBut with hundreds of cards to choose from, narrowing down the best options for you and your lifestyle can be challenging. Luckily, financial services site WalletHub worked with a team of experts to crunch the numbers and determine which cards lead the pack in various categories for 2018.\nIf your priority is to see the world, WalletHub's pick for the best credit card for you is the Capital One Venture Rewards Credit Card . The card is free for the first year and charges an annual fee of $95 after that. You'll need relatively good credit to be approved for it.\nHowever, it comes with a host of flexible perks that can be applied to almost any trip. Here are the highlights :\nReceive 50,000 bonus miles if you spend $3,000 in the first three months Earn double points on every purchase Miles never expire and there's no limit to how many you can earn No foreign transaction fees Can redeem travel purchases from any airline, hotel or rental car using miles Access to 24-hour travel assistance services show chapters This couple goes on round-the-world trips for free using credit card points 7:56 AM ET Mon, 24 July 2017 | 01:10 Avid travelers may also want to consider the Chase Sapphire Reserve , as recommended by CNBC Make It Money writer Kathleen Elkins. It has become a favorite among millennials since its debut in August 2016.\nDespite the card's steep $450 annual fee, Elkins says the benefits outweigh the cost . \"For starters, the Sapphire Reserve offers a $300 annual travel credit reimbursement each calendar year,\" Elkins says. \"That essentially bumps the annual fee down to $150 a year if I spend at least $300 on travel related expenses a year.\"\nPlus, if you spend a lot on travel, the perks align with your spending.\n\"Besides rent, my biggest expense is travel, specifically airfare,\" Elkins says. \"This particular card rewards travelers by doling out an unmatched three times points on travel and dining. Plus, the card comes with access to airport lounges, waives the $100 application fee for Global Entry or TSA Pre-check and has no foreign transaction fees.\"\nDon't miss: Here's why millennials would rather save than invest\nLike this story? Like CNBC Make It on Facebook !\nshow chapters Why millennials are making a huge mistake by not using credit cards more often 11:49 AM ET Mon, 24 July 2017 | 00:52", "external_links": [], "published": "2018-01-08T19:10:00.000+02:00", "crawled": "2018-01-08T19:17:44.011+02:00", "highlightTitle": ""}