{"organizations": [], "uuid": "d73a58fa2170c226daa6f0a5ef12dd6ca788d6af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKCricketNews", "section_title": "Reuters: Cricket News", "url": "https://uk.reuters.com/article/cricket-ashes/factbox-cricket-fifth-ashes-test-in-sydney-idUKL4N1OX18Q", "country": "US", "domain_rank": 408, "title": "FACTBOX-Cricket-Fifth Ashes test in Sydney", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T12:00:00.000+02:00", "replies_count": 0, "uuid": "d73a58fa2170c226daa6f0a5ef12dd6ca788d6af"}, "author": "", "url": "https://uk.reuters.com/article/cricket-ashes/factbox-cricket-fifth-ashes-test-in-sydney-idUKL4N1OX18Q", "ord_in_thread": 0, "title": "FACTBOX-Cricket-Fifth Ashes test in Sydney", "locations": [], "entities": {"persons": [{"name": "followi", "sentiment": "negative"}, {"name": "darren gough", "sentiment": "none"}], "locations": [{"name": "sydney", "sentiment": "none"}, {"name": "moore park", "sentiment": "none"}, {"name": "oval", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "scg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 10:04 AM / Updated an hour ago FACTBOX-Cricket-Fifth Ashes test in Sydney Reuters Staff 5 Min Read \nJan 2 (Reuters) - Following is a factbox on the fifth Ashes test match between Australia and England, which starts on Thursday: WHERE? Sydney Cricket Ground - Capacity: 44,002 Situated in Moore Park in the city's east, the SCG has been the venue for tests since 1882, making it the world's third oldest test ground after the Melbourne Cricket Ground and the Oval in London. A facility that allows spectators to get up close to the action, the SCG has also been used to host a whole range of sports including soccer, rugby union, rugby league and Australian Rules football. Although the SCG has always had a reputation for being the most spin-friendly of Australia's test tracks, particularly on the last couple of days, it has helped the seamers as well. Australia have won 26 of the 55 Ashes tests played at the SCG while England have won 22. It was at the SCG on the first day of the fifth test in the 1998-99 series when England pacer Darren Gough wrote his name into Ashes history by picking up a hat-trick. England went on to lose the series 3-1. Steve Waugh scored a potentially career-saving century at his home ground in the fifth test of the 2003 series after averaging just over 30 across 11 tests in the previous year. Australia won the series 4-1. WHEN? Jan. 4-8. Play starts at 1030 local time (2330 GMT) AUSTRALIA (World ranking: fifth) Squad - David Warner, Cameron Bancroft, Steve Smith (captain), Jackson Bird, Pat Cummins, Peter Handscomb, Josh Hazlewood, Usman Khawaja, Nathan Lyon, Mitchell Marsh, Shaun Marsh, Tim Paine, Mitchell Starc Coach: Darren Lehmann ENGLAND (World ranking: third) Squad - Joe Root (captain), Moeen Ali, James Anderson, Jonny Bairstow, Jake Ball, Gary Ballance, Stuart Broad, Alastair Cook, Mason Crane, Tom Curran, Ben Foakes, Dawid Malan, Mark Stoneman, James Vince, Chris Woakes Coach: Trevor Bayliss MATCH OFFICIALS Umpires: Kumar Dharmasena (Sri Lanka), Joel Wilson (West Indies) TV umpire: Sundaram Ravi (India) Match referee: Ranjan Madugalle (Sri Lanka) HISTORY Previous Australia v England tests in Sydney Matches: 55 Australia wins: 26 England wins: 22 1882 Australia 5 wickets 1882 Australia 6 wickets 1883 England 69 runs 1883 Australia 4 wickets 1885 Australia 6 runs 1885 Australia 8 wickets 1887 England 13 runs 1887 England 71 runs 1888 England 126 runs 1892 Australia 72 runs 1894 England 10 runs 1895 Australia inns & 147 runs 1897 England 9 wickets 1898 Australia 6 wickets 1901 England inns & 124 runs 1902 Australia 7 wickets 1903 England 5 wickets 1904 England 157 runs 1907 Australia 2 wickets 1908 Australia 49 runs 1911 Australia 146 runs 1912 England 70 runs 1920 Australia 377 runs 1921 Australia 9 wickets 1924 Australia 193 runs 1925 Australia 307 runs 1928 England 8 wickets 1932 England 10 wickets 1933 England 8 wickets 1936 England inns & 22 runs 1946 Australia inns & 33 runs 1947 Australia 5 wickets 1951 Australia inns & 13 runs 1954 England 38 runs 1955 Match drawn 1959 Match drawn 1963 Australia 8 wickets 1963 Match drawn 1966 England inns & 93 runs 1971 England 299 runs 1971 England 62 runs 1975 Australia 171 runs 1979 England 93 runs 1979 England 9 wickets 1980 Australia 6 wickets 1983 Match drawn 1987 Australia 55 runs 1988 Match drawn 1991 Match drawn 1995 Match drawn 1999 Australia 98 runs 2003 England 225 runs 2007 Australia 10 wickets 2011 England inns & 83 runs 2014 Australia 281 runs CURRENT TOUR 1st test Gabba, Brisbane Australia won by 10 wickets 2nd test Adelaide Oval Australia won by 120 runs 3rd test WACA, Perth Australia won by inns & 41 runs 4th test MCG, Melbourne Match drawn (Compiled by Shrivathsa Sridhar in Bengaluru; editing by Sudipto Ganguly)", "external_links": [], "published": "2018-01-02T12:00:00.000+02:00", "crawled": "2018-01-02T13:33:42.002+02:00", "highlightTitle": ""}