{"organizations": [], "uuid": "1a828bf2f63d14743587864e40e312e9a40c46b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223756292&w=1200&r=LYNXMPEE0K01Z", "site_section": "https://www.reuters.com/news/world", "section_title": "World News | Reuters.com", "url": "https://www.reuters.com/article/us-germany-politics/germanys-spd-to-vote-on-coalition-talks-with-merkels-conservatives-idUSKBN1FA00Z", "country": "US", "domain_rank": 408, "title": "Germany's SPD to vote on coalition talks with Merkel's conservatives", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T10:07:00.000+02:00", "replies_count": 0, "uuid": "1a828bf2f63d14743587864e40e312e9a40c46b2"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-germany-politics/germanys-spd-to-vote-on-coalition-talks-with-merkels-conservatives-idUSKBN1FA00Z", "ord_in_thread": 0, "title": "Germany's SPD to vote on coalition talks with Merkel's conservatives", "locations": [], "entities": {"persons": [{"name": "merkel", "sentiment": "negative"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "martin schulz", "sentiment": "none"}, {"name": "kevin kuehnert", "sentiment": "none"}], "locations": [{"name": "bonn", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "bonn", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "spd", "sentiment": "negative"}, {"name": "social democrats", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 21, 2018 / 2:07 AM / Updated 4 minutes ago German SPD backs coalition talks, leader vows tough approach Paul Carrel , Holger Hansen 5 Min Read \nBONN (Reuters) - Germany’s Social Democrats (SPD) voted on Sunday to begin formal coalition talks with Chancellor Angela Merkel’s conservatives, moving Europe’s economic powerhouse closer to a stable government after months of political deadlock. \nSPD delegates voted 362 to 279, with one abstention, to press ahead with negotiations. The center-left party’s leaders had agreed a preliminary coalition blueprint with Merkel’s conservative bloc earlier this month. \nA recount was held after an initial show of hands was too close to call for the SPD official in charge of the count and the result was slightly narrower that most analysts expected \n“We are of course all relieved,” SPD leader Martin Schulz told Phoenix television after the vote in Bonn, the capital of former West Germany where late SPD chancellors Willy Brandt and Helmut Schmidt earned reputations as global statesmen. \nNow, the SPD aims to negotiate an improved coalition deal it can sell to members wary of acting as junior partner to Merkel. \n“The coalition talks are going to be just as hard as the exploratory talks,” said Schulz. “We will talk to conservatives in the coming days and agree on a time frame. Then I hope that we will start negotiations soon.” \nMerkel welcomed the SPD’s decision, saying she looked forward to intensive talks focused on reaching a conclusion which she hoped would take place in a sensible atmosphere. \n“The blueprint from the exploratory talks is the framework in which we will negotiate and there are still many questions to clear up in detail and that will require intensive talks,” Merkel told reporters. \nThe beginning of full coalition negotiations is likely to be welcomed by Germany’s partners in Europe, where Merkel has long played a leading role in economic and security affairs. \nMerkel and French President Emmanuel Macron said on Sunday they wanted to deepen bilateral cooperation and give the European Union a fresh push toward closer integration. \nThe leader of Merkel’s Bavarian allies, Horst Seehofer, told Bild am Sonntag before the SPD vote he expected a new government to be in place in the first half of March. After the vote, he said the close decision would not make the negotiations easy. \nNEGOTIATE “UNTIL THEY SQUEAL” Caption: Germany's Social Democratic Party (SPD) youth wing leader Kevin Kuehnert speaks during the SPD's one-day party congress in Bonn, Germany, January 21, 2018. REUTERS/Thilo Schmuelgen \nSPD leaders vowed to improve on the coalition blueprint. \n“We will negotiate until the other side squeals,” the party’s parliamentary leader, Andrea Nahles, said in the most impassioned of the speeches at the congress in Bonn, imploring delegates to vote ‘yes’. \nSPD demands include the abolition of Germany’s dual public-private health insurance system in favor of a single citizen’s insurance, scaling back temporary employment contracts and allowing family reunions for asylum seekers suffering unusual hardship. \nAfter the vote, leading members of Merkel’s conservative Christian Democrats (CDU) immediately rejected SPD demands for concessions. Slideshow (8 Images) \n“The benchmark for further negotiations is what we already agreed on during exploratory talks,” Thomas Strobl, a CDU deputy party chairmen, told Funke media group. \nVolker Bouffier, CDU premier in the western state of Hesse, added: “The result of the exploratory talks counts. The key points may no longer be called into question.” \nHowever, SPD party members will still get to vote on any final coalition deal that emerges. \nThe coalition blueprint also includes a clause that provides for a review after two years of the next government’s progress to assess whether any changes to its mission are needed. \nThe SPD and conservative blocs, which both bled support to the far right in the Sept. 24 election, struck their preliminary deal after exploratory talks on renewing their ruling alliance that took office in 2013. \nSPD critics, including the party’s youth wing leader Kevin Kuehnert, argued the exploratory blueprint did not bear enough of the SPD’s hallmarks. \nAndrea Roemmele, professor for communication in politics at Hertie School of Governance, said the close result was difficult for Schulz, who led the party to its worst election result last September since Germany became a federal republic in 1949. \n“But it is also difficult for the conservatives because they know any deal still has to go through SPD members,” Roemmele told Phoenix television. Additional reporting by Michael Nienaber and Madeline Chambers in Berlin; Editing by John Stonestreet and Elaine Hardcastle", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-21T10:07:00.000+02:00", "crawled": "2018-01-21T04:19:56.027+02:00", "highlightTitle": ""}