{"organizations": [], "uuid": "50008bb552220ed0240b636a85ddfc97fcdf29c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-motor-f1-europe-complaint/force-india-and-sauber-withdraw-eu-complaint-idUKKBN1FE1JR", "country": "US", "domain_rank": 408, "title": "Force India and Sauber withdraw EU complaint", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T14:00:00.000+02:00", "replies_count": 0, "uuid": "50008bb552220ed0240b636a85ddfc97fcdf29c2"}, "author": "", "url": "https://uk.reuters.com/article/uk-motor-f1-europe-complaint/force-india-and-sauber-withdraw-eu-complaint-idUKKBN1FE1JR", "ord_in_thread": 0, "title": "Force India and Sauber withdraw EU complaint", "locations": [], "entities": {"persons": [{"name": "chase carey", "sentiment": "none"}, {"name": "alexander smith", "sentiment": "none"}, {"name": "sauber", "sentiment": "none"}, {"name": "alan baldwin", "sentiment": "none"}, {"name": "bernie ecclestone", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "force india", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}, {"name": "liberty media", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 12:02 PM / Updated 20 minutes ago Force India and Sauber F1 teams drop EU complaint Alan Baldwin 3 Min Read \nLONDON (Reuters) - Force India and Sauber have given Formula One’s new owners Liberty Media a vote of confidence by withdrawing a complaint to the European Commission about alleged anti-competitive practices in the sport. \nThe two privately-owned teams made their complaint in 2015, before U.S.-based Liberty took over and ousted former commercial supremo Bernie Ecclestone. \nThey had argued that the billion dollar sport was in breach of articles prohibiting cartels and the abuse of dominant market positions. \nEcclestone dismissed talk of a cartel at the time of the complaint but has questioned the influence of dominant world champions Mercedes and Ferrari, Formula One’s oldest and most successful team. \nThe two teams said in a joint statement they were reassured by talks with Formula One’s new management under chairman Chase Carey and preferred to resolve the issues through dialogue rather than a legal dispute. \n“Their approach has brought a new culture of transparency to the sport and illustrates willingness to debate fundamental issues such as the distribution of the prize fund monies, cost control and engine regulations,” Sauber and Force India said of Liberty. \n”We are encouraged and reassured by the even-handed and fair negotiating approach taken by the new management of Formula One to all the teams and their issues. \n“While the concerns leading to the compliant were fully justified, we believe this new approach provides the necessary degree of assurance that our concerns will be looked at objectively.” \nA Formula One spokesman welcomed the decision as a positive step for the sport, which is facing tough talks over its future as contracts with teams expire at the end of 2020. \nFerrari boss Sergio Marchionne has already said that Ferrari, who are Swiss-based Sauber’s engine suppliers, could walk away if the Italian manufacturer does not like the direction the sport is taking. \nMercedes, Ferrari, McLaren, Williams and Red Bull receive special payments in recognition of past performance and sit permanently with the commercial rights holder and governing FIA on the sport’s ‘Strategy Group’. \nForce India and Sauber had argued that that amounts to a “questionable cartel”, with the system favouring big teams that shape the rules and are guaranteed millions of dollars regardless of how they perform on the track. \nFormula One’s new management has said it wants a more level playing field in future. Reporting by Alan Baldwin; editing by Alexander Smith and Jon Boyle", "external_links": [], "published": "2018-01-25T14:00:00.000+02:00", "crawled": "2018-01-25T14:21:54.013+02:00", "highlightTitle": ""}