{"organizations": [], "uuid": "1cf7f2edecbe3afc2cb7a39d1b85db90bcaed0b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XB921_0119ED_SOC_20180119145721.jpg", "site_section": "https://www.wsj.com/europe", "section_title": "The Wall Street Journal &amp; Breaking News, Business, Financial and Economic News, World News and Video", "url": "https://www.wsj.com/articles/to-get-into-baseballs-hall-of-fame-players-need-career-successand-an-obsessed-fan-1516562711", "country": "US", "domain_rank": 387, "title": "Baseball Hall of Fame Checklist: Home Runs, RBIs, One Obsessive Fan", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.401, "site_type": "news", "published": "2018-01-21T22:25:00.000+02:00", "replies_count": 0, "uuid": "1cf7f2edecbe3afc2cb7a39d1b85db90bcaed0b0"}, "author": "Jared Diamond", "url": "https://www.wsj.com/articles/to-get-into-baseballs-hall-of-fame-players-need-career-successand-an-obsessed-fan-1516562711", "ord_in_thread": 0, "title": "Baseball Hall of Fame Checklist: Home Runs, RBIs, One Obsessive Fan", "locations": [], "entities": {"persons": [{"name": "edgar martinez", "sentiment": "none"}], "locations": [{"name": "cooperstown", "sentiment": "none"}], "organizations": [{"name": "national baseball hall of fame", "sentiment": "negative"}, {"name": "seattle mariners", "sentiment": "negative"}, {"name": "baseball writers’ association of america", "sentiment": "none"}, {"name": "philadelphia phillies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A-hed Baseball Hall of Fame Checklist: Home Runs, RBIs, One Obsessive Fan Outsiders are busting open the clubby world of baseball writers who cast votes for Cooperstown; ‘why are people not seeing the truth?’ Designated hitter Edgar Martinez of the Seattle Mariners is greeted by fans ahead of his retirement in 2004. Photo: Elaine Thompson/Associated Press SHARE \nJared Diamond Jan. 21, 2018 2:25 p.m. ET \nIn his ninth year on the ballot for the National Baseball Hall of Fame, longtime Seattle Mariners designated hitter Edgar Martinez finds himself on the cusp of Cooperstown. He has mounted a slow climb toward the 75% of votes needed for induction from eligible members of the Baseball Writers’ Association of America. \nIf he hears his name called when the election results are revealed on Jan. 24, he will have one very important person to thank for putting him over the top: a 28-year-old Philadelphia Phillies fan who barely ever... \nIn his ninth year on the ballot for the National Baseball Hall of Fame, longtime Seattle Mariners designated hitter Edgar Martinez finds himself on the cusp of Cooperstown. He has mounted a slow climb toward the 75% of votes needed for induction from eligible members of the Baseball Writers’ Association of America. \nIf he hears his name called when the election results are revealed on Jan. 24, he will have one very important person to thank for putting him over the top: a 28-year-old Philadelphia Phillies fan who barely ever saw Mr. Martinez play on television, let alone in person, and was still in grade school for most of his best seasons. Edgar Martinez \n“It’s unjust to keep him out of the Hall of Fame,” said Ryan Spaeder, an active U.S. Marine and the vocal leader of a grass-roots movement dedicated to fighting for the former player’s candidacy. “Justice needs to be served.” \nMr. Spaeder embodies a phenomenon that has recently gripped the Hall of Fame selection process. The Hall’s gatekeepers are a small group of veteran baseball writers who vote on which players will be inducted. But the writers’ gates have been crashed by amateur baseball enthusiasts who bombard them with obscure stats and analysis , canvassing the electorate like a presidential campaign. \nMr. Spaeder has spent a large portion of the past five months preaching the gospel of Edgar, delivering his message mostly through his baseball statistics Twitter account, which boasts more than 45,000 followers. \nAround the time that ballots were sent to writers in late November, Mr. Spaeder fired off about 250 tweets and emails to writers who didn’t vote for Mr. Martinez last year, imploring them to reconsider. His pitch included a barrage of esoteric statistics designed to bolster Mr. Martinez’s case. Advertisement Ryan Spaeder, a leading campaigner to include Edgar Martinez in Baseball’s Hall of Fame, visited its museum in Cooperstown, above. Photo: Ryan Spaeder \nFor instance, did you know that Mr. Martinez reached base safely 203 more times than Chicago Cubs great Ernie Banks, in 1,721 fewer plate appearances? Or that Mr. Martinez would need to go 0-for-660 at the plate without reaching base safely for his lifetime on-base percentage to fall below the legendary San Diego Padres hitter Tony Gwynn’s ? Mr. Spaeder does—and he made sure the voters did, too. \n“There’s just no question about it that this guy is a Hall of Famer,” Mr. Spaeder said. “He just needed somebody to make his case and stick up for him.” \nRich Lederer, an investment manager in California, is widely credited with orchestrating the first Hall of Fame fan campaign, using his baseball blog to spread awareness of the advanced metrics that supported Bert Blyleven’s candidacy. With Mr. Lederer’s help, which included lobbying writers in person one year at the baseball industry’s annual winter meetings, Mr. Blyleven earned the necessary 75% of the vote in his 14th turn on the ballot in 2011. \nBut this year, the notion of fans leading campaigns for individual players has exploded, with new campaigns sprouting up online and existing ones gaining prominence. A quick search of social media will find people stumping not just for Mr. Martinez, but for borderline candidates such as Larry Walker, Mike Mussina, Scott Rolen and Omar Vizquel. \n“It feels to me that it’s a little oversaturated now,” said Ryan Thibodaux, a 36-year-old Athletics fan who tracks publicly available Hall ballots. “I’ve seen some things where voters say they’re being inundated with emails and tweets. It’s not a conversation anymore—it’s being badgered with stats.” \nJonah Keri, a prominent baseball writer and author, spearheaded a campaign for Tim Raines , his childhood hero growing up in Montreal. Among the 309 writers who made their ballots public last year, 37 voted for Mr. Raines who hadn’t voted for him the year before, according to Mr. Thibodaux’s data. That was enough to send Mr. Raines to Cooperstown in his final time on the ballot. (Rules were revised a few years ago so that players are now allowed 10 tries, down from 15.) \n“Sports are about justice,” Mr. Keri said. “People get worked up about this stuff because they feel, ‘Yes, this is the truth! Why are people not seeing the truth?’ ” \nMr. Spaeder’s favorite player growing up was Rico Brogna, a journeyman first baseman who played three-plus seasons with the Phillies and has no Hall of Fame prospects. When Mr. Spaeder fell over a rail lunging for a ball at a Phillies game as a child, Mr. Brogna lifted him back into his seat, gave him the ball and went on to hit a home run. \nHis interest in Mr. Martinez is more clinical. Mr. Spaeder, who hopes to work in baseball following his military service, became frustrated with Mr. Martinez’s poor showing on the ballot. He was convinced that his performance—a career .312 batting average and .933 on-base-plus-slugging percentage—was worthy of Cooperstown. In Mr. Spaeder’s mind, Mr. Martinez was being unfairly stigmatized because was mostly a designated hitter and didn’t play in the field, allowing some voters to brand him an incomplete candidate for immortality. \nSo Mr. Spaeder went on the campaign trail. On Nov. 21, he tweeted that “if you do not think Edgar Martinez belongs in the Hall of Fame, you are objectively incorrect.” In early December, he authored a widely shared article for the Sporting News that featured an interview with Mr. Martinez. \nAs of midday Sunday, with about 47% of the ballots public, Mr. Martinez is tracking at 81% and is expected to finish close to 75%, up from 58.6% in 2017 and 36.2% in his first year on the ballot, 2010. Mr. Spaeder said about a dozen writers have told him privately that his campaign factored into their decision to flip their votes from “no” to “yes.”", "external_links": [], "published": "2018-01-21T22:25:00.000+02:00", "crawled": "2018-01-22T08:36:22.028+02:00", "highlightTitle": ""}