{"organizations": [], "uuid": "c04aae53def70e06461bbb4995fdfc80f63e4b8a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222422963&w=1200&r=LYNXMPEE0F0VG", "site_section": "https://www.reuters.com/places/africa", "section_title": "Reuters.com | Africa", "url": "https://www.reuters.com/article/us-olympics-2018-curl-growth/rocking-from-scotland-to-saudi-arabia-canada-to-qatar-idUSKBN1F51JV", "country": "US", "domain_rank": 408, "title": "Rocking from Scotland to Saudi Arabia, Canada to Qatar", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.021, "site_type": "news", "published": "2018-01-16T21:12:00.000+02:00", "replies_count": 0, "uuid": "c04aae53def70e06461bbb4995fdfc80f63e4b8a"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-olympics-2018-curl-growth/rocking-from-scotland-to-saudi-arabia-canada-to-qatar-idUSKBN1F51JV", "ord_in_thread": 0, "title": "Rocking from Scotland to Saudi Arabia, Canada to Qatar", "locations": [], "entities": {"persons": [{"name": "kate caithness", "sentiment": "none"}], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "qatar london", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "kazakhstan", "sentiment": "none"}, {"name": "portugal", "sentiment": "none"}, {"name": "central coast", "sentiment": "none"}, {"name": "qatar", "sentiment": "none"}, {"name": "mojave", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}, {"name": "kyrgyzstan", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "world curling federation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Curling, once a minority pastime played mostly by Scots and Canadians, will sweep onto the ice at next month’s Pyeongchang Olympics with the proud boast of being the world’s fastest growing winter sport.\nThe ‘roaring game’, with its origins in the frozen ponds and mists of medieval Scotland, is now popping up in the sort of sunny places where ice usually comes in cubes to cool the drinks.\nQatar’s men’s curling team celebrated their first international victory last November, beating Kazakhstan on Australia’s sun-soaked Central Coast north of Sydney.\nA few months earlier, Middle Eastern neighbors Saudi Arabia secured conditional membership of the World Curling Federation along with fellow-newcomers Kyrgyzstan, Afghanistan and Portugal.\nLas Vegas, in Nevada’s Mojave desert, will host the men’s world championship next April.\n“You’d obviously think curling is for winter sport countries, it’s not really,” says Kate Caithness, the Scottish head of World Curling and one of only two female presidents of any Olympic sports.\n”You can have curling anywhere in the world.\n“Give us a hall and we’ll make ice. We’ve got these new facilities where we can almost roll out a mat, plug it in, add water and freeze it,” she told Reuters from her headquarters in Perth, Scotland.\nIn order to be included on the full program at the 1998 Nagano Olympics, curling needed to have 30 member nations. Twenty years on and there are 60 with more to come and a growth explosion predicted.\n“We’ve never been in better shape, actually,” says Caithness.\n“Mexico and Guyana are new members, and there’s other members in South America waiting to come on board.”\nAt the 2010 Games in Vancouver, curling was the most watched Winter Olympic sport on television in Brazil -- a country that recently challenged Canada for a place at the men’s world championships.\nThere are no member nations from Africa as yet, but there has been interest with South Africa most likely to be the first on board.\nSLEEPING GIANT Curling is big already in Korea and Japan and the main growth areas over the next four years for a sport also known as ‘chess on ice’ are likely to be China, hosts of the 2022 Olympics, and the United States.\n“China is a huge, huge market for us,” said Caithness.\n“We’ve just signed a $13.4 million contract with a sponsor (Kingdomway Sports) in China for the next four years in the runup between now and 2022.”\nThe curling at those Beijing Winter Games will be held in the ‘Water Cube’ facility that hosted the swimming at the 2008 summer Olympics.\nTransformed into the Ice Cube, the plan is to have a three sheet rink in the basement so that fans can watch the competition upstairs and also try their hand at the sport downstairs.\n“I‘m on the 2022 IOC co-ordination commission, so I do have the inside information. I’ve been there already with the IOC,” said Caithness.\n“They are going to put 300 million people through winter sport (in China) between now and 2022... I understand they are building 500 new ice rinks. I think the sport’s going to explode.”\nStarting this year, a new made-for-television World Cup will start up with four city events on three continents forming the ‘Road to Beijing’.\nIn the United States, USA Curling last year signed a sponsorship deal with Pepsico’s Frito-Lay brand Cheetos that features tight end Vernon Davis of the National Football League’s Washington Redskins.\nAs part of the promotion, the cheese curl snack has come up with a rap video ‘Teach me how to Curl’ featuring curling moves and dance.\nEven if Cheetos said in a statement that the deal aimed to “help raise awareness for one of America’s least participated in sports”, Caithness felt things were moving in the right direction.\n“I think we’re going to see things go crazy in the United States. They’ve woken up at last,” she said.\nCurling, whose tournament starts a day before the opening ceremony in Pyeongchang and runs right through to the last Sunday, can also expect more television coverage than any other sport.\nTo win a gold medal in men’s or women’s curling takes up to 33 hours on the field of play, with nine round robin games of three hours each followed by a semi-final and final. Pyeongchang sees the debut also of mixed doubles.\n“We’ll have non-stop curling every day from dawn until dusk. We have huge TV coverage and this is really going to help our sport as well,” said Caithness.\nEditing by Sudipto Ganguly\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-16T21:12:00.000+02:00", "crawled": "2018-01-16T23:06:06.033+02:00", "highlightTitle": ""}