{"organizations": [], "uuid": "697d02b45fab11c1f63f7daf2180a400499e5edb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-star-group-l-p-declares-quarterly-distribution-of-11-cents-per-unit.html", "country": "US", "domain_rank": 767, "title": "Star Group, L.P. Declares Quarterly Distribution of 11 Cents per Unit", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.317, "site_type": "news", "published": "2018-01-18T19:00:00.000+02:00", "replies_count": 0, "uuid": "697d02b45fab11c1f63f7daf2180a400499e5edb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-star-group-l-p-declares-quarterly-distribution-of-11-cents-per-unit.html", "ord_in_thread": 0, "title": "Star Group, L.P. Declares Quarterly Distribution of 11 Cents per Unit", "locations": [], "entities": {"persons": [], "locations": [{"name": "conn.", "sentiment": "none"}, {"name": "stamford", "sentiment": "none"}], "organizations": [{"name": "l.p.", "sentiment": "negative"}, {"name": "star group", "sentiment": "negative"}, {"name": "l.p. star group", "sentiment": "none"}, {"name": "star", "sentiment": "none"}, {"name": "about star group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "STAMFORD, Conn., Jan. 18, 2018 (GLOBE NEWSWIRE) -- Star Group, L.P. (the \"Company\" or \"Star\") (NYSE:SGU), a home energy distributor and services provider, today declared its quarterly distribution of $0.11 per common unit for the fiscal 2018 first quarter ended December 31, 2017.\nRecord date: January 29, 2018\nPayment date: February 6, 2018\nAbout Star Group, L.P.\nStar Group, L.P. is a full service provider specializing in the sale of home heating products and services to residential and commercial customers to heat their homes and buildings. The Company also sells and services heating and air conditioning equipment to its home heating oil and propane customers and, to a lesser extent, provides these offerings to customers outside of its home heating oil and propane customer base. In certain of Star's marketing areas, the Company provides home security and plumbing services primarily to its home heating oil and propane customer base. Star also sells diesel fuel, gasoline and home heating oil on a delivery only basis. Star is the nation's largest retail distributor of home heating oil based upon sales volume. Including its propane locations, Star serves customers in the more northern and eastern states within the Northeast, Central and Southeast U.S. regions. Additional information is available by obtaining the Company's SEC filings at www.sec.gov and by visiting Star's website at www.stargrouplp.com , where unit holders may request a hard copy of Star's complete audited financial statements free of charge.\nForward Looking Information\nThis news release includes \"forward-looking statements\" which represent the Company’s expectations or beliefs concerning future events that involve risks and uncertainties, including those associated with the effect of weather conditions on our financial performance; the price and supply of the products we sell; the consumption patterns of our customers; our ability to obtain satisfactory gross profit margins; our ability to obtain new customers and retain existing customers; our ability to make strategic acquisitions; the impact of litigation; our ability to contract for our current and future supply needs; natural gas conversions; future union relations and the outcome of current and future union negotiations; the impact of future governmental regulations, including environmental, health and safety regulations; the ability to attract and retain employees; customer creditworthiness; counterparty creditworthiness; marketing plans; general economic conditions and new technology. All statements other than statements of historical facts included in this news release are forward-looking statements. Without limiting the foregoing, the words \"believe,\" \"anticipate,\" \"plan,\" \"expect,\" \"seek,\" \"estimate\" and similar expressions are intended to identify forward-looking statements. Although the Company believes that the expectations reflected in such forward-looking statements are reasonable, it can give no assurance that such expectations will prove to be correct and actual results may differ materially from those projected as a result of certain risks and uncertainties. These risks and uncertainties include, but are not limited to, those set forth under the heading \"Risk Factors\" and \"Business Strategy\" in our Annual Report on Form 10-K (the \"Form 10-K\") for the fiscal year ended September 30, 2017. Important factors that could cause actual results to differ materially from the Company’s expectations (\"Cautionary Statements\") are disclosed in this news release and in the Form 10-K. All subsequent written and oral forward-looking statements attributable to the Company or persons acting on its behalf are expressly qualified in their entirety by the Cautionary Statements. Unless otherwise required by law, the Company undertakes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise after the date of this news release.\nCONTACT:\nStar Group\nInvestor Relations\n203/328-7310\nChris Witty\nDarrow Associates\n646/438-9385 or cwitty@darrowir.com\nSource:Star Group, L.P.", "external_links": ["https://www.globenewswire.com/Tracker?data=Ce3ul-Fw1pWM1nHewR1w_18QB95NKrrxdwhNagtu8MXcMgqgXCPfuBe2bTaXXm_ORtlCx7cPEyahAZ7ezdJ8UrnLXNoRKhwlboarVDYCex8=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/0dba9914-8cc6-419e-bbfd-a2a7c1cbd782"], "published": "2018-01-18T19:00:00.000+02:00", "crawled": "2018-01-18T19:58:51.042+02:00", "highlightTitle": ""}