{"organizations": [], "uuid": "adc07e02b2306ee86cee53718088911f30d55645", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220400895&w=1200&r=LYNXMPEE0802G", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/us-global-forex/euro-rally-loses-steam-dollar-firms-slightly-versus-yen-idUSKBN1EY02V", "country": "US", "domain_rank": 408, "title": "Yen jumps after BOJ operation, euro rally loses steam", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T09:04:00.000+02:00", "replies_count": 0, "uuid": "adc07e02b2306ee86cee53718088911f30d55645"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-global-forex/euro-rally-loses-steam-dollar-firms-slightly-versus-yen-idUSKBN1EY02V", "ord_in_thread": 0, "title": "Yen jumps after BOJ operation, euro rally loses steam", "locations": [], "entities": {"persons": [{"name": "shusuke yamada", "sentiment": "none"}], "locations": [{"name": "tokyo", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "bank of japan", "sentiment": "negative"}, {"name": "boj", "sentiment": "negative"}, {"name": "bank of america merrill lynch", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TOKYO (Reuters) - The yen jumped on Tuesday after the Bank of Japan trimmed its buying of long-dated Japanese government bonds in market operations, helping to stoke speculation about a future exit from its massive stimulus policy.\nThe yen rose about 0.4 percent to 112.62 yen to the dollar JPY= , bouncing back further from its two-week low of 113.40 per dollar touched on Monday.\n“The BOJ’s operation was a trigger for the yen’s gains, although I suspect there were a lot of New Year flows given today was the first business day for quite a lot of people,” said Shusuke Yamada, chief Japan FX/equity strategist at Bank of America Merrill Lynch.\n“I think it is still too early for the BOJ to clarify its stance towards an exit from the current policy,” he said.\nThe BOJ trimmed the amount it bought in Japanese government bonds of 10 to 25 years left to maturity and those of 25 to 40 years to maturity by 10 billion yen ($88.39 million) each from its previous operations. [L4N1P4168]\nSince it adopted the yield curve control policy in 2016, the BOJ has occasionally tweaked its bond operations, with officials saying any changes are meant to keep bond yields in line with its policy goal and not to telegraph hints on its future policy.\nWhile Tuesday’s move was considered largely technical, it surprised some market players.\nThe euro languished on Tuesday after slipping from last week’s high as investors were cautious after a months-long rally, while the dollar firmed against the yen though a lack of catalysts tempered its momentum.\nThe euro EUR= traded at $1.1971, little changed in Asia after having slipped 0.5 percent on Monday, its largest daily drop since late October.\nAnalysts said a correction was inevitable for the common currency after its rally over the past couple months to near its 2017 peak of $1.2092, thanks to signs of acceleration in the euro zone economy.\nSpeculators’ net long position in euro/dollar futures in Chicago reached a record high last week, data from the Commodity Futures Trading Commission showed on Friday, pointing to potential for profit-taking.\n“The euro is going through a consolidation after it had reached high levels above $1.2. Friday’s euro zone inflation data was somewhat weaker than expected,” said Shinichiro Kadota, senior FX and rates strategist at Barclays.\n“Going forward, the market’s outlook depends more on U.S. factors, such as whether the Fed raises interest rates three times or more, and also the impact of the tax reform,” he said.\nWhile many Federal Reserve officials have said they expect three rate hikes this year, markets are not fully convinced as inflation remains tame despite very tight labor market conditions.\nIndeed, Atlanta Fed President Raphael Bostic, a voter on interest rate policy this year, said on Monday that the Fed may only need to raise interest rates two times in 2018 given weak price pressures.\nSuch doubts have held the dollar index down near its lowest levels since 2015 during the past few months.\nThe index stood at 92.239 .DXY, after having fallen to 91.751 last week, not far from its 2-3/4-year low of 91.011 touched last September and way below its 2017 high of 102.26.\nAn immediate market focus included the talks planned later in the day between North and South Korea, their first formal contact in two years, for signs of any reduction in tensions on the Korean peninsula.\nEditing by Shri Navaratnam and Jacqueline Wong\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-09T09:04:00.000+02:00", "crawled": "2018-01-09T15:04:37.011+02:00", "highlightTitle": ""}