{"organizations": [], "uuid": "8cb90a732a961f701fbc5171a7a59fcbfd10488b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/15/business-wire-mauna-kea-technologies-appoints-experienced-healthcare-executive-molly-oaneill-to-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Mauna Kea Technologies Appoints Experienced Healthcare Executive, Molly O’Neill, to Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.049, "site_type": "news", "published": "2018-01-15T19:45:00.000+02:00", "replies_count": 0, "uuid": "8cb90a732a961f701fbc5171a7a59fcbfd10488b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/15/business-wire-mauna-kea-technologies-appoints-experienced-healthcare-executive-molly-oaneill-to-board-of-directors.html", "ord_in_thread": 0, "title": "Mauna Kea Technologies Appoints Experienced Healthcare Executive, Molly O’Neill, to Board of Directors", "locations": [], "entities": {"persons": [{"name": "molly o’neill", "sentiment": "neutral"}, {"name": "christopher d. mcfadden", "sentiment": "none"}, {"name": "molly", "sentiment": "none"}, {"name": "marie meynadier", "sentiment": "none"}], "locations": [{"name": "paris", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "mauna kea", "sentiment": "none"}], "organizations": [{"name": "mauna kea technologies appoints experienced healthcare executive", "sentiment": "negative"}, {"name": "mauna kea technologies", "sentiment": "negative"}, {"name": "board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PARIS--(BUSINESS WIRE)-- Regulatory News:\nMauna Kea Technologies (Paris:MKEA) (OTCQX:MKEAY) inventor of Cellvizio®, the multidisciplinary confocal laser endomicroscopy (CLE) platform, today announced the appointment of Molly O’Neill to the Company’s Board of Directors, effective immediately. She replaces Ms. Marie Meynadier who recently resigned from the Board. Her appointment is expected to be ratified by shareholders at the Company’s Annual General Meeting in May 2018.\n“During a career that includes leadership roles at some of the world’s most prestigious healthcare delivery systems as well as ground-breaking product development achievements in the area of digital health, Molly has demonstrated an exceptional capacity to deliver clinical value to patients, providers and payers” stated Christopher D. McFadden, chairman of the Board of Directors. “Building on the important accomplishments Mauna Kea has achieved in the areas of product design, clinical acceptance and regulatory approval, I am pleased to welcome her to the Board of the Directors as the Company increases U.S. market adoption of Cellvizio. Our thanks go to Marie for her significant contributions to Mauna Kea and we wish her the best in her future endeavors.”\nMs. O’Neill has an extensive background in the healthcare industry. She is currently chief commercial officer of Proteus Digital Health. Proteus Digital Health and Otsuka Pharmaceutical Co., Ltd. (Otsuka) were recently granted the first approval of a digital medicine system, ABILIFY MYCITE (aripiprazole tablets with sensor), a drug-device combination product comprised of Otsuka’s oral aripiprazole tablets embedded with the Proteus Ingestible Event Marker (IEM) sensor. The ABILIFY MYCITE System includes: ABILIFY MYCITE, the MYCITE Patch (a wearable sensor, developed by Proteus). This enables individuals with serious mental illnesses to gain feedback and engage with their care team in a new way.\nOver the past 30 years, Ms. O’Neill has held a number of senior strategy and growth positions with healthcare delivery systems including Tenet, Ascension Health Care Network, Duke Medicine and Partners Healthcare in Boston. Earlier in her career, Ms. O’Neill was vice president, Disease Management and Business Development at Gambro Healthcare. Molly received her B.Sc. in Journalism and her M.S. in Health Care Administration from Virginia Commonwealth University/Medical College of Virginia.\n“What attracted me to Mauna Kea is Cellvizio’s capacity to improve the evaluation of disease and thereby reduce healthcare costs,” said Ms. O’Neil. “Real-time in vivo endomicroscopy is the type of disruptive technology that can significantly improve how healthcare is delivered. Moreover, the Company’s most recent FDA clearance appears to reinforce Cellvizio’s clinical leadership. I look forward to working with the management team and the board to expand the use of Cellvizio for its current and future indications.”\nAbout Mauna Kea Technologies\nMauna Kea Technologies is a global medical device company focused on eliminating uncertainties related to the diagnosis and treatment of cancer and other diseases thanks to real time in vivo microscopic visualization. The Company’s flagship product, Cellvizio, has received clearance/approval in a wide range of applications in more than 40 countries, including the United States, Europe, Japan, China, Canada, Brazil and Mexico. For more information on Mauna Kea Technologies, visit www.maunakeatech.com\nDisclaimer\nThis press release contains forward-looking statements concerning Mauna Kea Technologies and its activities. Such forward looking statements are based on assumptions that Mauna Kea Technologies considers to be reasonable. However, there can be no assurance that the anticipated events contained in such forward-looking statements will occur. Forward- looking statements are subject to numerous risks and uncertainties including the risks set forth in the registration document of Mauna Kea Technologies registered by the French Financial Markets Authority (Autorité des marchés financiers (AMF)) on June 13, 2016 under number R.16-054 and available on the Company's website ( www.maunakeatech.com ), and to the development of economic situation, financial markets,\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180115005466/en/\nMauna Kea Technologies\nUnited States\nThe Ruth Group\nRobert Flamm / Lee Roth, 646-536-7017 / 7012\nrflamm@theruthgroup.com / lroth@theruthgroup.com\nor\nU.S. Media\nThe Ruth Group\nKirsten Thomas, 508-280-6592\nkthomas@theruthgroup.com\nor\nFrance and Europe\nNewCap - Investor Relations\nFlorent Alba, +33 (0)1 44 71 94 94\nmaunakea@newcap.eu\nSource: Mauna Kea Technologies", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.maunakeatech.fr%2F&esheet=51743203&newsitemid=20180115005466&lan=en-US&anchor=www.maunakeatech.com&index=1&md5=a44e44da171db944b512954114b4d300", "http://www.businesswire.com/news/home/20180115005466/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.maunakeatech.fr%2F&esheet=51743203&newsitemid=20180115005466&lan=en-US&anchor=www.maunakeatech.com&index=2&md5=c2d392550326644b6689234f8d6068ca"], "published": "2018-01-15T19:45:00.000+02:00", "crawled": "2018-01-15T22:59:46.010+02:00", "highlightTitle": ""}