{"organizations": [], "uuid": "ad88db3383b941bb54ab3de2c79554750d5098cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/04/104928999-GettyImages-883220374.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/05/how-artificial-intelligence-will-affect-your-life-and-work-in-2018.html", "country": "US", "domain_rank": 767, "title": "How artificial intelligence will affect your life and work in 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.124, "site_type": "news", "published": "2018-01-05T18:53:00.000+02:00", "replies_count": 0, "uuid": "ad88db3383b941bb54ab3de2c79554750d5098cb"}, "author": "Catherine Clifford", "url": "https://www.cnbc.com/2018/01/05/how-artificial-intelligence-will-affect-your-life-and-work-in-2018.html", "ord_in_thread": 0, "title": "How artificial intelligence will affect your life and work in 2018", "locations": [], "entities": {"persons": [{"name": "— alejandro troccoli", "sentiment": "none"}], "locations": [], "organizations": [{"name": "nvidia", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "You've heard of artificial intelligence — everyone from Elon Musk to Mark Zuckerberg couldn't stop talking about it in 2017. But this year, AI will affect your life in tangible ways.\n\"I believe 2018 is the year that this will start to become mainstream, to begin to impact many aspects of our lives in a truly ubiquitous and meaningful way,\" says Ralph Haupter , the president of Microsoft Asia.\nThe idea that computers have some amount of \"intelligence\" is not new, says Haupter, pointing as far back as 1950 when computer pioneer Alan Turing asked whether machines can think. \"So it has taken nearly 70 years for the right combination of factors to come together to move AI from concept to an increasingly ubiquitous reality,\" says Haupter.\nThose factors are the mass distribution and use of Internet-connected devices, which generate massive quantities of data, and cloud computing and software algorithms that can recognize patterns within data, he says.\nshow chapters Elon Musk issues yet another warning against runaway artificial intelligence 1:37 PM ET Mon, 17 July 2017 | 01:03 The development of artificial intelligence will be the story of the coming generations, not just the coming year, but as 2018 gets underway, here are eight ways AI will begin to touch your life.\n1. Everybody will have a virtual assistant, and they're going to be pretty smart \"Personal assistant AIs will keep getting smarter. As our personal assistants learn more about our daily routines, I can imagine the day I need not to worry about preparing dinner. My AI knows what I like, what I have in my pantry, which days of the week I like to cook at home, and makes sure that when I get back from work all my groceries are waiting at my doorstep, ready for me to prepare that delicious meal I had been craving.\" — Alejandro Troccoli, senior research scientist, NVIDIA\n2. All your voice-based gadgets will work together (and may get confused) \"Because of the popularity of voice-based personal assistants, we're starting to see the technology embedded across a wide range of devices, from lamps, to TVs, to cars and beyond. In addition, after initial experiments with a single unit, many people have started putting smart speakers all over their homes. The practical net result is that sometime in 2018, a large percentage of personal assistant users will have regular access to multiple assistants simultaneously—often across multiple platforms. Combine that with the fact that in 2018 we'll likely start seeing vendors enabling people to customize the trigger word for these various assistants to start listening and, well, it's a quick recipe for disaster. …\n\"Don't get me wrong, I'm certainly excited about the potential that voice-based interactions can bring to speakers and all our tech devices, but I'm concerned we could hit some serious roadblocks in 2018.\" — Bob O'Donnell, president, founder and chief analyst at TECHnalysis Research, a market research and consulting firm\nshow chapters Mark Cuban: AI will produce the world’s first trillionaires 4:19 PM ET Fri, 21 April 2017 | 00:46 3. Facial recognition will be the new credit card \"Thanks to AI, the face will be the new credit card, the new driver's license and the new barcode. Facial recognition is already completely transforming security with biometric capabilities being adopted, and seeing how tech and retail are merging, like Amazon is with Whole Foods, I can see a near future where people will no longer need to stand in line at the store.\" — Georges Nahon, CEO, Orange Silicon Valley; president, Orange Institute, a global research co-laboratory\n4. Your boss is going to start to talk about AI \"As AI permeates the enterprise, everyone—from the CEO and business unit leaders to your middle managers and frontline employees—will need to be conversant in some basic terminology. Speaking the same language gets organizations on the same page and helps demystify AI's role in the enterprise and what it means for business processes and workers.\" — Chris Curran, Chief Technologist for PricewaterhouseCoopers US, and Anand Rao, innovation lead for PricewaterhouseCoopers US Analytics Group\nshow chapters This CEO wants to put a computer chip in your brain 10:35 AM ET Wed, 12 April 2017 | 01:15 5. Artificial intelligence will generate media specific to your personal preferences \"Given the rapid pace of research, I expect AI to be able to create new personalized media, such as music according to your taste. Imagine a future music service that doesn't just play existing songs you might like, but continually generates new songs just for you.\" — Jan Kautz, senior director of Visual Computing and Machine Learning Research, NVIDIA\n6. Artificial intelligence will write news and market reports tailored specifically for you \"Imagine market reports that were written on demand and not just when the market closed. These reports could be more than just a simple recap of market performance, but a comparison of a how a reader's portfolio performed against the broader market, as well as key reasons why. For example: It's 3:35 pm. The market is currently up 1%, but your portfolio is down 2%. This is attributed in part to the purchase of XX stock last week, which has fallen sharply since …'\n\"How close are we to being able to do this, and much more? The technologies are very nearly here already, and newsrooms are starting to embrace the possibilities.\" — Reg Chua, Chief Operating Officer, Reuters News\n7. Your computer will become empathetic \"I believe practical advancements in artificial intelligence will start to enable a more contextual form of computing with some of our devices, particularly smartphones and smart speakers. Going beyond the simple question and single, discrete response that typically marks these interactions now, we should start to see more human-like responses to our queries and requests. Multi-part conversations, more comprehensive answers, as well as appropriate and even insightful suggestions based on what it is we're doing (or trying to do), will start to give us the sense that our devices are getting smart. Ironically, part of the way this development will likely occur is by learning more about people and how they think—essentially building a form of digital empathy.\" — Bob O'Donnell, president, founder and chief analyst at TECHnalysis Research, a market research and consulting firm\n8. Your doctor is going to use AI \"2018 will be the year AI becomes real for medicine. ... By the end [of the year] I think around half of leading healthcare systems will have adopted some form of AI within their diagnostic groups. And while a lot of this adoption will happen first in the diagnostic medical specialties, we're seeing solutions for population health, hospital operations and a broad set of clinical specialties quickly follow behind. In 2018, we'll begin the adoption of a technology that may truly transform the way providers work, and the way patients experience healthcare, on a global scale.\" — Mark Michalski, executive director, Massac", "external_links": [], "published": "2018-01-05T18:53:00.000+02:00", "crawled": "2018-01-05T19:07:26.002+02:00", "highlightTitle": ""}