{"organizations": [], "uuid": "b8c925864cf104e2e9a71185523b4e07111553b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/01/davos.png", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/17/american-business-risks-wef-davos/", "country": "US", "domain_rank": 1196, "title": "5 Massive Threats to U.S. Business: World Economic Forum | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.981, "site_type": "news", "published": "2018-01-17T06:00:00.000+02:00", "replies_count": 0, "uuid": "b8c925864cf104e2e9a71185523b4e07111553b9"}, "author": "Sy Mukherjee", "url": "http://fortune.com/2018/01/17/american-business-risks-wef-davos/", "ord_in_thread": 0, "title": "5 Massive Threats to U.S. Business: World Economic Forum | Fortune", "locations": [], "entities": {"persons": [{"name": "sy mukherjee", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "world economic forum wef", "sentiment": "negative"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "wef", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "These Are the Biggest Risks for Businesses in 2018, According to the World Economic Forum WEF lays out the risks to keep an eye on. By Sy Mukherjee 4:00 AM EST \nA slew of security, financial, and environmental threats will pose the greatest risk to businesses around the world in 2018, according to a wide-ranging report from the World Economic Forum (WEF) unveiled Wednesday ahead of the organization’s annual meeting in Davos, Switzerland next week . And two of the most prominent risks for American businesses, specifically, will be inadequate protections against cyberattacks and the potential environmental disasters stemming from climate change. \nWEF’s new Global Risks Report is an 80-page compilation of risks to global business compiled with the help of business, government, academic, and other stakeholder around the world. These hazards span the gamut from the collapse of governments to poor urban planning to the spread of infectious diseases to infrastructure failures. \nBut one of the main takeaways from the 2018 Risks report is that a combination of environmental havoc and digital delinquency—from data breaches by online thieves to targeted attacks on nations’ security apparatuses—will be both the likeliest risks to businesses and the ones that have the biggest impact on them. Three of the top five largest risks in terms of both likelihood and overall impact are related to the environment, for instance; cyberattacks and data breaches rank in the top five most likely risks while cyberattacks fall just outside the top five when it comes to impact. World Economic Forum \nAll five of the risks listed in the environmental category have steadily risen in the past 10 years of the Risks report. “This follows a year characterized by high-impact hurricanes, extreme temperatures and the first rise in CO2 emissions for four years. We have been pushing our planet to the brink and the damage is becoming increasingly clear,” write the authors. \nThey point specifically to the destruction by hurricanes and other extreme weather events in the U.S. that scientists say are linked with climate change, such as America’s record-breaking summer and winter storms in the past year. Such cascading events take an immediate toll on human life, disrupt local businesses in the short term, and can devastate local economies for years by destroying infrastructure. The 2017 Atlantic hurricane season in the U.S. was the costliest one to date . World Economic Forum \nAmerican business also has a long way to go in getting its digital IT house in order—particularly by shoring up anti-cyberattack technology and making sure all employees know the best practices for preventing data breaches. “Too often boards and C-suites approach risk analysis as a standalone activity to be ticked off a list, but then fall short on mitigating the risks that their analysis has identified,” write the authors. “Organizations must do better in educating teams on risk awareness. Think of an employee derailing cybersecurity plans by inadvertently clicking on a phishing email because not enough was done to spread risk awareness from the C-suite to the wider organization.” Consider: There were several high profile U.S. data breaches in 2017 alone because employees fell victim to phishing scams . The spread of misinformation and “fake news” via social media can also roil markets, as WEF points out. \nThe full report goes into far more detail about these, and many other, risks. (For instance: WEF cites the rise of populist anger in many nations and President Donald Trump’s “America First” policies as volatile elements for business that could have unexpected downstream effects.) Click here to read the complete writeup. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-17T06:00:00.000+02:00", "crawled": "2018-01-17T12:00:58.021+02:00", "highlightTitle": ""}