{"organizations": [], "uuid": "b9a218b36321e918863735adf9e6a0ef5e5c857e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/global-lng/global-lng-chinese-retreat-relieves-bullish-pressure-on-asias-spot-market-idUSL8N1PL5KE", "country": "US", "domain_rank": 408, "title": "GLOBAL LNG-Chinese retreat relieves bullish pressure on Asia's spot market", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T21:30:00.000+02:00", "replies_count": 0, "uuid": "b9a218b36321e918863735adf9e6a0ef5e5c857e"}, "author": "", "url": "https://www.reuters.com/article/global-lng/global-lng-chinese-retreat-relieves-bullish-pressure-on-asias-spot-market-idUSL8N1PL5KE", "ord_in_thread": 0, "title": "GLOBAL LNG-Chinese retreat relieves bullish pressure on Asia's spot market", "locations": [], "entities": {"persons": [{"name": "oleg vukmanovic", "sentiment": "none"}, {"name": "gail", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "kogas", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "gwangyang", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "chevron", "sentiment": "none"}, {"name": "posco", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 7:32 PM / in 3 minutes GLOBAL LNG-Chinese retreat relieves bullish pressure on Asia's spot market Oleg Vukmanovic 3 Min Read \nLONDON, Jan 26 (Reuters) - Asian spot LNG prices slid this week on improving production and uncertain demand for cargoes in March amid indications that Chinese importers have largely covered their first-quarter needs. \nAsian spot prices for March delivery fell 10 cents to $10.40 per million British thermal units (mmBtu). Chevron’s Wheatstone project in Australia potentially had surplus supply to offer as well as one or two other exporters. \nThe apparent retreat of Chinese demand for Q1 put further pressure on prices. “I expect spot prices to drop to $7.50 per mmBtu soon as Chinese slow down their buying,” a trader said. \nPlunging temperatures in South Korean capital Seoul could spark additional demand for spot LNG purchases from Kogas as heating needs spike at a time when 11 nuclear reactors are offline. \nPeer POSCO meanwhile seeks a March 2-5 delivery cargo into Gwangyang. \nIndian demand looked healthy. Gail called for a March 1-17 delivery via spot tender to counteract delayed production from Dominion Energy’s new Cove Point liquefaction plant in the United States. \nOther buyers including Indian Oil Corporation and Bharat Petroleum also sought H1 March deliveries. Gujarat State Petroleum closed a tender for a delivery in the first half of February this week. \nWith snowfall in Tokyo and temperatures forecast below-average until mid-February, Tohoku Electric took a cargo unloading in March 18-22 for an estimated $10.30 per mmBtu. \nLNG supply to Japan was disrupted by a partial outage at Petronas’ Bintulu project in Malaysia, where Tohoku is an off-taker. \nPetronas substituted lost output with at least one spot purchase, though not from the AP LNG project in Australia as first reported, market sources said. \nBintulu volumes are lower than usual with the disruption delaying loadings by one to two weeks, a Singapore-based trader said. \nCheniere Energy’s Sabine Pass facility on the U.S. Gulf Coast restarted exports on Wednesday after freezing weather disrupted water supply used in the plant’s turbines, forcing a partial shutdown. \nSliding March prices tightened arbitrage opportunities for traders seeking to transfer LNG from Atlantic to Pacific markets with charter rates fetching about $78,000 per day. \nSeveral reloads were offered from north-west European terminals to Asian buyers. Organising a shipment within the next week would yield fatter margins as Asian spot prices in early March carry a $0.70/mmBtu premium to late March. \nOn the demand side, Mexico’s CFE tendered to buy four LNG cargoes for delivery across February and March. The tender closed on Jan. 25. \nArgentina sought nine cargoes due between April and June via its first spot tender of the year, closing on Feb. 6. \nEgyptian Natural Gas Holding Company (EGAS) is speaking to its Q1 LNG suppliers - Gas Natural, Trafigura, Glencore and Vitol - to buy five cargoes for Q2, traders said. \nOthers believed EGAS was trying to line up supplies under a government-to-government deal via Middle Eastern, Russian, Caribbean and European companies. Additional reporting by Jessica Jaganathan; Editing by David Evans", "external_links": [], "published": "2018-01-26T21:30:00.000+02:00", "crawled": "2018-01-26T21:39:09.025+02:00", "highlightTitle": ""}