{"organizations": [], "uuid": "107e1ab0392e78d96558bde43b4e24895fef38a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225488193&w=1200&r=LYNXMPEE0P0TJ", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/intel-results-research/intel-shares-hit-dotcom-era-highs-on-robust-data-center-demand-idINKBN1FF1PK", "country": "US", "domain_rank": 408, "title": "Intel shares hit dotcom-era highs on robust data center demand", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T15:21:00.000+02:00", "replies_count": 0, "uuid": "107e1ab0392e78d96558bde43b4e24895fef38a5"}, "author": "", "url": "https://in.reuters.com/article/intel-results-research/intel-shares-hit-dotcom-era-highs-on-robust-data-center-demand-idINKBN1FF1PK", "ord_in_thread": 0, "title": "Intel shares hit dotcom-era highs on robust data center demand", "locations": [], "entities": {"persons": [{"name": "supantha mukherjee", "sentiment": "none"}, {"name": "sonam rai", "sentiment": "none"}], "locations": [{"name": "santa", "sentiment": "none"}], "organizations": [{"name": "intel", "sentiment": "negative"}, {"name": "intel inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Intel Inc’s shares rose 7 percent on Friday to their highest in almost two decades, after strong results offered the clearest sign yet that its years-long effort to shift away from a slowing PC business was paying off.\nShares of the company were trading at $48.50 on Friday, adding nearly $15 billion to its market value and hitting highs last seen in September 2000 during the dotcom boom.\nInvestors were also comforted by Intel’s assurances that it does not expect any material impact from the recent disclosure of security flaws Spectre and Meltdown in billions of its chips.\nThe Santa Clara-based company helped found the personal computer industry and became one of the world’s biggest chipmaker on the back of growing demand for PCs. But, in the last few years, falling PC demand has pushed Intel to focus on making chips for data centers to offset revenue loss.\nRevenue from the company’s higher-margin data center business jumped about 20 percent to $5.58 billion.\n“Intel is successfully navigating the transition from a PC-centric to data-centric company – specifically, Intel’s data-centric businesses now comprise about 47 percent of revenue,” Credit Suisse analyst John Pitzer said.\nPitzer upgraded the stock to “outperform” from “neutral.”\nThe business is showing no signs of slowing down - Intel forecast its data centric unit to grow mid-teens and PC centric business in the low single digits this year, projecting overall revenue growth of 4 percent to $65 billion.\n“While we believe near term PC unit declines have been impacted by a lengthening in the PC refresh cycle, we view this lengthening as slowing over time, lessening the deleterious impact on overall company growth,” Susquehanna Financial Group analyst Christopher Rolland said.\nAnalysts said Intel will benefit this year from higher demand for gaming computers, memory chip ramp and increased modem sales to Apple Inc’s iPhones.\nModem sales increased 26 percent year-over-year, which we attribute largely to the iPhone refresh, Oppenheimer analyst Rick Schafer said.\nIntel has been increasingly displacing Qualcomm as Apple’s key modem supplier after its relationship with the iPhone maker soured last year over chip prices.\nAt least 12 brokerages raised their price targets on the stock. Their median price target was $52.\nOf the 39 brokerages covering the stock, 23 rate it as “buy” or higher, 11 “hold” and five “sell” or lower.\nThe stock has gained 20 percent in the last 12 months, compared with a 40 percent gain in the Philadelphia Semiconductor index.\nReporting by Supantha Mukherjee and Sonam Rai in Bengaluru; Editing by Saumyadeb Chakrabarty\n ", "external_links": [], "published": "2018-01-26T15:21:00.000+02:00", "crawled": "2018-01-26T15:39:37.008+02:00", "highlightTitle": ""}