{"organizations": [], "uuid": "fc83890670947de1f3780c8e578dd0aed3c6622f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 14}, "facebook": {"likes": 94, "shares": 94, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-WY343_2Tvh8_TOP_20180111015839.jpg", "site_section": "http://www.wsj.com/xml/rss/3_7014.xml", "section_title": "WSJ.com: US Business", "url": "https://www.wsj.com/articles/icahn-deason-push-for-xerox-to-explore-sale-1516577445", "country": "US", "domain_rank": 387, "title": "Icahn, Deason Push for Xerox to Explore Sale - WSJ", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T01:30:00.000+02:00", "replies_count": 0, "uuid": "fc83890670947de1f3780c8e578dd0aed3c6622f"}, "author": "David Benoit", "url": "https://www.wsj.com/articles/icahn-deason-push-for-xerox-to-explore-sale-1516577445", "ord_in_thread": 0, "title": "Icahn, Deason Push for Xerox to Explore Sale - WSJ", "locations": [], "entities": {"persons": [{"name": "carl icahn", "sentiment": "negative"}, {"name": "icahn", "sentiment": "negative"}, {"name": "deason push", "sentiment": "negative"}, {"name": "deason", "sentiment": "none"}, {"name": "jeff jacobson", "sentiment": "none"}], "locations": [{"name": "norwalk", "sentiment": "none"}, {"name": "conn.", "sentiment": "none"}], "organizations": [{"name": "xerox", "sentiment": "negative"}, {"name": "xerox corp.", "sentiment": "negative"}, {"name": "wsj", "sentiment": "negative"}, {"name": "fujifilm holdings corp", "sentiment": "none"}, {"name": "wall street journal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "1 COMMENTS Xerox Corp.’s XRX 2.47% first- and third-biggest investors, billionaires Carl Icahn and Darwin Deason, have formed an alliance and plan to encourage the printer and copier giant to explore a potential sale, according to people familiar with the matter.\nThe two investors, who together control more than 15% of Xerox’s shares, had already been separately calling for changes at the Norwalk, Conn., company on slightly different topics, but this would be the first time either has come out publicly for a potential sale.\nThe fact that they are working together and own such a big stake is sure to ratchet up the pressure on a company that is grappling with slumping demand as the world becomes more digital—and is already considering a major transaction.\nMessrs. Icahn and Deason plan to call on the company to explore strategic alternatives, which could include a sale or other transaction, to break its joint venture with Fujifilm Holdings Corp. FUJIY 0.09% , and immediately fire chief executive Jeff Jacobson, the people said.\nThe Wall Street Journal reported this month that Fujifilm and Xerox are discussing a range of potential deals that could include a change of control of Xerox, though not a full sale. Xerox just a year ago split itself in two, spinning off its business-services unit into Conduent Inc. \nXerox has said that since the breakup it is ahead of its transformation plan, and the board is willing to take any necessary steps to create more value.\n“The Xerox board of directors and management are confident with the strategic direction in which the company is heading and we will continue to take action to achieve our common goal of creating value for all Xerox shareholders,” a company spokesman said Sunday. \nShares of Xerox have languished for years. They have rallied lately on hopes of a deal, bringing the company’s market capitalization to about $8.1 billion.\nMr. Icahn, who owns a 9.7% stake, had already called for a change in management and started a fight for four new board members. The activist had campaigned successfully for change to the board two years ago, but his former employee resigned as a director last month to open the way to a new campaign .\nLast week, Mr. Deason, who owns a 6% stake, sent a letter urging Xerox to cancel its long-running joint venture with Fujifilm that sells copiers and printers in the Asia Pacific region. Mr. Deason got his stake when Xerox bought the company he founded, Affiliated Computer Services Inc., for $6 billion in 2010.\nThe joint venture, Fuji Xerox, would likely be at the center of any review given its strategic importance. Xerox and Fujifilm believe there are large savings and efficiencies from expanding their cooperation, a key reason they have engaged in deal talks, people familiar with the matter have said.\nAny other interested party, meanwhile, would need to navigate Fujifilm’s rights in the joint venture, a concern Mr. Deason has raised. He has demanded Xerox disclose the agreement between the two parties, saying the market has a right to know what Xerox is allowed to do.\nHe called on Xerox to cancel the agreement following an accounting scandal at the joint venture last year , saying that should have breached the contract. Mr. Icahn seconded that.\nWrite to David Benoit at david.benoit@wsj.com \nAppeared in the January 22, 2018, print edition as 'Activist Allies Push Xerox on Sale.'", "external_links": [], "published": "2018-01-22T01:30:00.000+02:00", "crawled": "2018-01-22T02:00:59.046+02:00", "highlightTitle": ""}