{"organizations": [], "uuid": "b772eb52d49a70ff10db4aedd7165d8e59b86c54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224771394&w=1200&r=LYNXMPEE0N0UZ", "site_section": "http://feeds.reuters.com/reuters/INtechnologyNews", "section_title": "Reuters: Technology News", "url": "https://in.reuters.com/article/eu-qualcomm/eu-fines-qualcomm-1-2-billion-over-apple-chip-deals-idINKBN1FD191", "country": "US", "domain_rank": 408, "title": "EU fines chipmaker Qualcomm $1.2 billion over exclusivity deal with Apple", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T15:26:00.000+02:00", "replies_count": 0, "uuid": "b772eb52d49a70ff10db4aedd7165d8e59b86c54"}, "author": "", "url": "https://in.reuters.com/article/eu-qualcomm/eu-fines-qualcomm-1-2-billion-over-apple-chip-deals-idINKBN1FD191", "ord_in_thread": 0, "title": "EU fines chipmaker Qualcomm $1.2 billion over exclusivity deal with Apple", "locations": [], "entities": {"persons": [{"name": "margrethe vestager", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "apple", "sentiment": "negative"}, {"name": "qualcomm", "sentiment": "negative"}, {"name": "apple foo yun chee", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}, {"name": "min read  brussels", "sentiment": "none"}, {"name": "intel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 10:47 AM / Updated 3 hours ago EU fines chipmaker Qualcomm $1.2 billion over exclusivity deal with Apple Foo Yun Chee 5 Min Read \nBRUSSELS (Reuters) - U.S. chipmaker Qualcomm Inc ( QCOM.O ) was hit with a 997 million euro ($1.23 billion) fine by European Union antitrust regulators on Wednesday for paying Apple Inc ( AAPL.O ) to use only its chips, blocking out rivals such as Intel Corp ( INTC.O ). \nThe EU decision is the latest in a series by global regulators that have amounted to billions of dollars in fines and require changes in Qualcomm business. The contract at issue with Apple is no longer in force, and Qualcomm already faces more competition from Intel and other rivals. \nStill, the EU decision could make Qualcomm more vulnerable to chipmaker Broadcom Ltd’s ( AVGO.O ) $103 billion hostile bid, since Broadcom argues it can smooth rocky relations with customers such as Apple.( INTC.O ). \nQualcomm said it would appeal the decision immediately. \nThe European Commission said its investigation, launched in 2015, covered the period from 2011 to 2016 and took into account Qualcomm’s market dominance in LTE baseband chipsets, which enable rapid mobile broadband connections. \n“Qualcomm paid billions of U.S. dollars to a key customer, Apple, so that it would not buy from rivals. These payments were not just reductions in price – they were made on the condition that Apple would exclusively use Qualcomm’s baseband chipsets in all its iPhones and iPads,” European Competition Commissioner Margrethe Vestager said in a statement. \n“This meant that no rival could effectively challenge Qualcomm in this market, no matter how good their products were,” she said. \nThe fine represented 4.9 percent of Qualcomm’s 2017 turnover, the Commission said. \nQualcomm General Counsel Don Rosenberg said in a statement that the company believed its agreement with Apple did not violate EU rules. “We have a strong case for judicial review and we will immediately commence that process,” he said. \nQualcomm’s shares were down 1.35 percent at $67.42 in midday trade, and analysts saw the fine as good for Broadcom’s approach. \n“While Qualcomm believes they are in a temporary (albeit perfect) storm of customer and regulatory issues, Broadcom believes that the current problems are a harbinger of further headwinds to come,” Stacy Rasgon, an analyst with Bernstein, said in a note to clients Wednesday. “And this latest finding continues to support the idea that regulators remain unhappy with the current state of affairs.” A woman looks at the screen of her mobile phone in front of an Apple logo outside its store in Shanghai, China July 30, 2017. REUTERS/Aly Song/Files \nDespite levying fines, EU antitrust regulators recently cleared Qualcomm’s $38 billion bid to buy NXP Semiconductors ( NXPI.O ). Chinese regulators still need to approve the deal, and some NXP shareholders want a higher price. \nQualcomm is required to post a bond for the fine while the appeal unfolds, which will likely result in a charge for the current quarter. When hit with fines in the past, such as $774 million levy last year from Taiwanese regulators, Qualcomm took a charge as it appealed. RELATIONS WITH APPLE STRAINED \nVestager told a news conference there would be no repercussions for Apple in the case. \nEU antitrust regulators have come under pressure after European judges sent a case against U.S. chipmaker Intel ( INTC.O ) back to an EU court for an appeal. Intel was fined 1 billion euros in 2009 for paying computer makers to buy most of their chips from them. \nGoogle has also appealed against a record 2.4 billion euro fine for giving prominent placements in searches to its shopping service and demoting rival offerings. \nThis is the Commission’s first decision on market abuse since the Intel ruling last September. Vestager said the ruling had given guidance on how to prove its case. \n“We have carefully examined the ruling and the evidence in our case to make sure that our decision fully complies with the guidance given by the court,” she said. \nApple and Qualcomm are meanwhile locked in a wide-ranging legal battle over Qualcomm’s business practices, which started a year ago with Apple suing Qualcomm for nearly $1 billion in patent royalty rebates that the chipmaker allegedly withheld from the phone maker. \nOther regulators, including the U.S. Federal Trade Commission, are also investigating Qualcomm’s dealings with Apple. The EU competition enforcer is expected to rule in the coming months against Qualcomm in another case involving British phone software maker Icera, which was later acquired by Nvidia Corp ( NVDA.O ), a person familiar with the matter has told Reuters. \nIn that case, Qualcomm is accused of selling chipsets below cost to drive out Icera - a practice known as predatory pricing. \n($1 = 0.8107 euros) Additional reporting by Robert-Jan Bartunek and Stephen Nellis; Editing by Peter Henderson, Elaine Hardcastle and Tom Brown", "external_links": [], "published": "2018-01-24T15:26:00.000+02:00", "crawled": "2018-01-24T15:47:52.011+02:00", "highlightTitle": ""}