{"organizations": [], "uuid": "17ff8ba92c0fbbb012c12377bb560033dbba2468", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219007810&w=1200&r=LYNXMPEE020DP", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-britain-economy-pmi/uk-building-firms-see-growth-slow-in-december-pmi-idUKKBN1ES0KC", "country": "US", "domain_rank": 408, "title": "UK building firms see growth slow in December - PMI", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T11:37:00.000+02:00", "replies_count": 0, "uuid": "17ff8ba92c0fbbb012c12377bb560033dbba2468"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-economy-pmi/uk-building-firms-see-growth-slow-in-december-pmi-idUKKBN1ES0KC", "ord_in_thread": 0, "title": "UK building firms see growth slow in December - PMI", "locations": [], "entities": {"persons": [{"name": "william schomberg", "sentiment": "none"}, {"name": "primrose hill", "sentiment": "none"}, {"name": "reuters/hannah mckay", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "ihs markit/cips uk construction pmi", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 37 AM / Updated 10 minutes ago UK building firms see growth slow in December - PMI William Schomberg 2 Min Read \nLONDON (Reuters) - Growth in Britain’s construction sector slowed last month for the first time since September, as weaker growth in house-building combined with a fall in commercial building and stagnating infrastructure work, a survey showed on Wednesday. A man walks accross Primrose Hill as dawn breaks behind construction cranes in the City of London, Britain, December 28, 2017. REUTERS/Hannah McKay \nThe IHS Markit/CIPS UK Construction PMI slipped to 52.2 after hitting a five-month high of 53.1 in November. \nIt was just below a median forecast of 52.5 in a Reuters poll of economists. \nConstruction comprises around 6 percent of British economic output, and official figures showed the sector grew by 4.8 percent in the 12 months to the end of September. \nA PMI for the far larger services sector is due on Thursday and will be watched more closely by investors as a gauge of whether the British economy lost pace at the end of 2017, when some surveys suggested the prospect of Brexit weighed on growth. \nNew orders for construction projects grew at the fastest rate since May 2017 and purchases of materials rose by the most in two years, pointing to further growth in the immediate future, IHS Markit said. \nHowever, the balance of companies expecting a rise in output over the next 12 months remained among the weakest since 2013, mainly due to worries about the outlook for Britain’s economy as the country prepares to leave the European Union in March 2019. \nThe residential sector grew for a 16th straight month while the moderate fall in commercial building extended a run of weakness seen since July. \nBritish finance minister Philip Hammond announced a series of measures in November to boost house-building which has lagged demand for years, pushing up house prices sharply. \nCosts faced by construction companies remained strong as prices rose for bricks, blocks, insulation and other materials. \nBut the rate of inflation was below a peak seen in February. Reporting by William Schomberg; Editing by Catherine Evans", "external_links": [], "published": "2018-01-03T11:37:00.000+02:00", "crawled": "2018-01-03T11:45:17.009+02:00", "highlightTitle": ""}