{"organizations": [], "uuid": "84a46d4a7a17ce927179bd7e38dc48c05f358037", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/advertising-agency-groups-set-to-take-further-hit-from-consultancies.html", "country": "US", "domain_rank": 767, "title": "Advertising agency groups set to take further hit from consultancies", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.131, "site_type": "news", "published": "2018-01-29T18:30:00.000+02:00", "replies_count": 0, "uuid": "84a46d4a7a17ce927179bd7e38dc48c05f358037"}, "author": "Lucy Handley", "url": "https://www.cnbc.com/2018/01/29/advertising-agency-groups-set-to-take-further-hit-from-consultancies.html", "ord_in_thread": 0, "title": "Advertising agency groups set to take further hit from consultancies", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "wpp", "sentiment": "negative"}, {"name": "publicis", "sentiment": "negative"}, {"name": "omnicom", "sentiment": "negative"}, {"name": "published updated moments ago cnbc.com  advertising", "sentiment": "neutral"}, {"name": "google", "sentiment": "none"}, {"name": "karmarama", "sentiment": "none"}, {"name": "accenture", "sentiment": "none"}, {"name": "interpublic", "sentiment": "none"}, {"name": "bank of america merrill lynch", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "deloitte", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Advertising agency conglomerates WPP, Publicis, Omnicom and Interpublic are set to see three years of muted growth, according to a note from Bank of America Merrill Lynch (BAML) analysts.\nBusinesses are shifting their spending from investing in creativity and \"storytelling\" to technology and data-driven marketing, the analysts wrote in a note to clients and seen by Reuters .\nCompanies that weren't traditionally involved in advertising or marketing are buying up agencies, with Accenture acquiring ad agency Karmarama in 2016 and Deloitte buying Swedish agency Acne last August, just two of many deals done by consultancies over the past two years or so.\nWPP lowered its expectations for full-year organic net sales last October, citing disruption from Facebook and Google, competition from management consultancies and \"zero-based budgeting\" from clients as reasons. Paris-based Publicis reported sales up 1.2 percent in the quarter ending September 2017 and said that the environment was \"challenging\" for its clients.\nshow chapters Martin Sorrell: Need to differentiate between media and tech firms 4:44 AM ET Tue, 23 Jan 2018 | 02:50 Sir Martin Sorrell, WPP chief executive, called conditions \" a relatively low growth world \" last year, and said that consultancies were addressing clients' concerns about cost. \"Very few CEOs will resist the suggestion that they may be overspending and the promise of an audit or review that will only cost a proportion of any cost savings,\" WPP said in an online statement at the time.\nPublicis, meanwhile, bought digital and tech company Sapient for $3.7 billion in 2015, and has since reorganized itself \"around the challenges our clients our facing,\" according to Publicis.Sapient EMEA and APAC CEO Nigel Vaz, speaking to CNBC last October. Digital transformation is now a firm focus for CEO clients who previously might only have needed a website, Vaz said.\n\"Now you can spend a day with them because they are focused. The fastest way to drive cost out of the business is embracing digital technology. The fastest way to drive growth is leveraging digital technology,\" he said.\nOmnicom's revenue decreased 1.9 percent in the quarter ending September 30, according to its latest results , and Interpublic reported a 1 percent decline in revenue in the third quarter of 2017.\nCuts by consumer packaged goods companies are also affecting the advertising world . Last week, Procter and Gamble reported $750 million savings in ad agency and production costs and Diageo said it was saving money across media buying, live experience marketing and point of sale.", "external_links": [], "published": "2018-01-29T18:30:00.000+02:00", "crawled": "2018-01-29T18:31:29.006+02:00", "highlightTitle": ""}