{"organizations": [], "uuid": "85e9449d75d5c45f85242679c29202a3657c7750", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 567, "shares": 567, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/04/11/104398528-GettyImages-505286836.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/12/walmart-is-reportedly-planning-to-cut-over-1000-corporate-jobs.html", "country": "US", "domain_rank": 767, "title": "Walmart is reportedly planning to cut over 1,000 corporate jobs", "performance_score": 5, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T00:13:00.000+02:00", "replies_count": 0, "uuid": "85e9449d75d5c45f85242679c29202a3657c7750"}, "author": "Lauren Hirsch", "url": "https://www.cnbc.com/2018/01/12/walmart-is-reportedly-planning-to-cut-over-1000-corporate-jobs.html", "ord_in_thread": 0, "title": "Walmart is reportedly planning to cut over 1,000 corporate jobs", "locations": [], "entities": {"persons": [{"name": "mark ralston", "sentiment": "negative"}, {"name": "sam", "sentiment": "none"}], "locations": [{"name": "los ange", "sentiment": "none"}, {"name": "chinatown", "sentiment": "none"}, {"name": "southern california", "sentiment": "none"}], "organizations": [{"name": "walmart", "sentiment": "negative"}, {"name": "wall street journal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Walmart is planning to cut over 1,000 corporate jobs, the Wall Street Journal reported Friday citing sources.\nThe layoffs, expected to be completed by Jan. 31, 2019, will focus largely on employees in its corporate headquarters, the report said.\nWalmart, the country's largest private employer, has 1.5 million workers in the U.S. and 2.3 million around the world.\nThe news comes a day after a whirlwind Thursday for Walmart, when it announced in the morning it would be boosting its starting wage , just hours before news began to trickle out it was closing certain Sam's Clubs stores. The company confirmed the store closures by Thursday evening.\nIn all, more than 60 Sam's Club stores are closing.\nMeantime, Walmart is also shaking up its management workforce , according to a report by Bloomberg. The report said the retailer is planning to remove about 3,500 store co-managers and adding 1,700 assistant store managers. The latter is a slightly lower-paid role.\nWalmart, like many retailers, is attempting to reorient itself to a new retail landscape in which store footprints are out of sync of shoppers. It is also battling e-commerce giant Amazon , whose advanced investment in technology helps it leapfrog traditional stores' profit margins.\nIt has sought to make its store more profitable by pouring money into shelf-scanning robots and cashier-replacing capabilities. Walmart expects to roll out its \"Scan & Go\" technology to 100 more locations.\nMore broadly, it has also looked to redefine itself as a digital company, even planning to drop the word \"stores\" from its name. These efforts have been propelled by its acquisition of Amazon-competitor Jet.com, through which it has been building a coterie of online brands.\nA Walmart spokesperson said, \"As we've previously stated, we've been looking at our structure for some time as we explore ways to operate more effectively. We continue to do that but are not going to comment on rumors and speculation.\"\nWATCH: Walmart announces bonuses, sheds stores, jobs show chapters Walmart announces bonuses...then sheds stores and jobs 20 Hours Ago | 02:04", "external_links": [], "published": "2018-01-13T00:13:00.000+02:00", "crawled": "2018-01-13T00:21:30.029+02:00", "highlightTitle": ""}