{"organizations": [], "uuid": "15ab2f877ed86150605b4bde07d13e559d5b802e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/legal", "section_title": "Legal News | Reuters", "url": "https://www.reuters.com/article/autoshow-detroit-emissions/california-trump-administration-fuel-efficiency-talks-intensify-idUSKBN1F52ML", "country": "US", "domain_rank": 408, "title": "California-Trump administration fuel-efficiency talks intensify", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T04:56:00.000+02:00", "replies_count": 0, "uuid": "15ab2f877ed86150605b4bde07d13e559d5b802e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/autoshow-detroit-emissions/california-trump-administration-fuel-efficiency-talks-intensify-idUSKBN1F52ML", "ord_in_thread": 0, "title": "California-Trump administration fuel-efficiency talks intensify", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "california-trump", "sentiment": "negative"}, {"name": "scott pruitt", "sentiment": "none"}], "locations": [{"name": "detroit", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "white house", "sentiment": "none"}, {"name": "environmental protection agency", "sentiment": "none"}, {"name": "california air resources board", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DETROIT (Reuters) - California and the Trump administration will hold a series of new talks over fuel efficiency rules as the auto industry still hopes for a deal to retain nationwide requirements.\nOfficials from the California Air Resources Board are set to meet in Washington this month for another round of discussions on the 2022-2025 fuel-efficiency rules, automakers and government officials said on Tuesday. Environmental Protection Agency chief Scott Pruitt told Reuters last week that more talks are also planned in California in the coming weeks.\nCalifornia, which touts its environmental agenda and efforts to cut greenhouse gas emissions, has been increasingly at odds with the Trump administration’s efforts to roll back environmental regulations.\nAutomakers want the White House and California to reach agreement on revisions because a legal battle over the rules could result in lengthy uncertainly for the industry. They also want changes to address lower gasoline prices and a shift in U.S. consumer preferences to larger, less fuel-efficient vehicles.\nA group representing General Motors Co, Volkswagen AG ( VOWG_p.DE ), Toyota Motor Corp and other automakers has encouraged more talks between California and federal regulators in hopes an agreement is reached.\nIn 2011, California’s air emissions regulator and the Obama administration reached an agreement with major automakers to nearly double average fleetwide fuel efficiency to more than 50 miles per gallon by 2025, but included a “midterm review” to determine by April 2018 whether the final requirements were feasible.\nCalifornia, joined by nearly a dozen other states, could seek to enforce existing emissions rules, even if the Trump administration softens the federal 2022-2025 requirements.\nPruitt told Reuters last week that no decisions on the requirements have been made but he hoped national rules would remain. ”California doesn’t have the authority to set the standards for the rest of the country,” Pruitt said.\nAsked if EPA would consider withdrawing California’s waiver under the Clean Air Act to set its own emission rules, Pruitt said: “There’s no reason to speculate on that right now. I think that what’s important is that we continue to reach out to work with California.”\nReuters first reported earlier this month that the Trump administration met with California officials on Dec. 15 to discuss the programme.\nThe meeting included EPA air office chief Bill Wehrum, National Highway Traffic Safety Administration (NHTSA) deputy chief Heidi King, and White House aide Mike Catanzaro.\nNHTSA plans to issue its proposed changes, if any, for the 2022-25 model years by March 30. The agency is “on track” to meet that deadline, King told Reuters on the sidelines of the Detroit auto show on Tuesday. She expects it to propose “a broad range of options.”\nIn a move widely seen as a preamble to loosening fuel standards, U.S. President Donald Trump announced in March he was revisiting the 2025 requirements.\nIn June, New York state’s attorney general and 12 other top state law officials said they would mount a court challenge to any effort to roll back vehicle fuel rules.\nReporting by David Shepardson in Detroit; Editing by Matthew Lewis\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T04:56:00.000+02:00", "crawled": "2018-01-16T23:20:06.010+02:00", "highlightTitle": ""}