{"organizations": [], "uuid": "1b657b128172cfc5367049837379aae0c34ded45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/11/gettyimages-813610454.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/05/weight-loss-pill-burn-fat-appetite/", "country": "US", "domain_rank": 1196, "title": "New Obesity Drug Burns Fat Without Blocking Appetite | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.341, "site_type": "news", "published": "2018-01-05T02:00:00.000+02:00", "replies_count": 0, "uuid": "1b657b128172cfc5367049837379aae0c34ded45"}, "author": "Sy Mukherjee", "url": "http://fortune.com/2018/01/05/weight-loss-pill-burn-fat-appetite/", "ord_in_thread": 0, "title": "New Obesity Drug Burns Fat Without Blocking Appetite | Fortune", "locations": [], "entities": {"persons": [{"name": "stanley watowich", "sentiment": "none"}], "locations": [{"name": "galveston", "sentiment": "none"}], "organizations": [{"name": "brainstorm health daily", "sentiment": "none"}, {"name": "texas medical branch", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Sy Mukherjee January 5, 2018 \nA new weight loss drug being developed by scientists at the University of Texas Medical Branch at Galveston takes a very different approach to fighting obesity: It burns fat without suppressing appetite, according to a study published in the journal Biochemical Pharmacology . \nIt’s important to note that this research is preliminary and was conducted on mice. But the fat fighting pill’s action mechanism is intriguing. In the study, mice were given food until they became obese, and were then fed the drug, which increases the cellular metabolism of obesity-linked white fat cells. The size of these fat cells in mice given the drug shrunk 30% after 10 days of treatment compared to those given a placebo. Strikingly, the drug-taking mice’s blood cholesterol levels also returned to normal. \nSubscribe to Brainstorm Health Daily , our newsletter about the most exciting health innovations. \nSenior study author Stanley Watowich notes that weight loss and obesity drugs of this kind could help prevent conditions like heart disease and type 2 diabetes. Most American children today are expected to be obese by the time they’re 35, according to recent research by Harvard, compared with about 40% of U.S. adults who are currently obese. “As fat cells grow larger, they begin to overexpress a protein that acts as a metabolic brake that slows down fat cell metabolism, making it harder for these cells to burn accumulating fat,” he said in a statement. “In addition, as the fat tissue expands, they secrete greater amounts of hormones and pro-inflammatory signals that are responsible for several chronic diseases, including type 2 diabetes and cardiovascular disease.” \nThe most common approaches to fighting obesity include bariatric surgery and pills ( or devices ) which suppress appetite. Accelerated fat cell metabolism would essentially tackle obesity at its root biological level, rather than simply facilitate behavioral changes. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-05T02:00:00.000+02:00", "crawled": "2018-01-06T02:02:08.000+02:00", "highlightTitle": ""}