{"organizations": [], "uuid": "4cc1262d9270e4b24fcb29e14c654934864f71de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-WY184_jdware_SOC_20180110184141.jpg", "site_section": "https://www.wsj.com/news/business", "section_title": "Business &amp; Finance News - Wall Street Journal", "url": "https://www.wsj.com/articles/todays-top-supply-chain-and-logistics-news-from-wsj-1515671848", "country": "US", "domain_rank": 387, "title": "Today’s Top Supply Chain and Logistics News From - WSJ", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T14:57:00.000+02:00", "replies_count": 0, "uuid": "4cc1262d9270e4b24fcb29e14c654934864f71de"}, "author": "Paul Page", "url": "https://www.wsj.com/articles/todays-top-supply-chain-and-logistics-news-from-wsj-1515671848", "ord_in_thread": 0, "title": "Today’s Top Supply Chain and Logistics News From - WSJ", "locations": [], "entities": {"persons": [{"name": "john d. stoll", "sentiment": "none"}, {"name": "adrienne roberts", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "huntsville", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "ala.", "sentiment": "none"}, {"name": "alabama", "sentiment": "none"}, {"name": "south carolina", "sentiment": "none"}], "organizations": [{"name": "logistics news from - wsj", "sentiment": "negative"}, {"name": "toyota motor corp", "sentiment": "neutral"}, {"name": "volvo cars", "sentiment": "none"}, {"name": "toyota", "sentiment": "none"}, {"name": "mazda motor corp.", "sentiment": "none"}, {"name": "wsj", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Sign up: With one click, get this newsletter delivered to your inbox .\nToyota Motor Corp.’s TM -0.22% choice of Alabama as a site of a new factory highlights a once-unthinkable shift in automotive supply chains. Once almost entirely dependent on importing cars to the U.S., foreign auto makers are set for the first time to build as many automobiles in American factories as Detroit does , the WSJ’s Adrienne Roberts and John D. Stoll report. Toyota will build a $1.6 billion factory it will share with Mazda Motor Corp. 7261 -0.03% in Huntsville, Ala., the latest in a series of big-dollar expansions by Asian and European car companies in Southern states. The investments, including a $1.1 billion factory Volvo Cars is opening in South Carolina this year, are creating new backing for rail, road and port expansions to help move parts to the plants and finished cars to export gateways. Other foreign auto makers say they are considering expanding or establishing U.S. operations, adding to the drive to build a broader new eco-system of automotive manufacturing.\nCanada is taking a tough stance with the U.S. on trade just as talks between North American countries are set to resume. The country is formally complaining to the World Trade Organization over tariffs the U.S. imposed last year on Canada’s softwood-lumber producers. The WSJ’s Paul Vieira reports the complaint escalates tensions between Ottawa and Washington just weeks before crucial talks on revamping the North American Free Trade Agreement get underway, and it highlights the more pugnacious approach Canada is taking toward the Trump administration. Experts say Canada’s WTO filing is among the broadest challenges yet against the U.S. use of antidumping tariffs against imports it deems to be hurting American industries. A report from Reuters says Canadian officials are “increasingly convinced” President Donald Trump will withdraw from the continental trade pact after the Montreal round. In going to the WTO over lumber, Canada’s may be setting the groundwork for a post-Nafta trade world.\nTo find the latest area of digital commerce growth in China, just look for the fish heads. JD.com has delivered some 400 million pounds of carp heads for one restaurant chain in an unlikely but growing business China’s No. 2 e-commerce company has built in providing outsourced logistics to food outlets. It’s among the new services JD.com is adding to maintain its growth, the WSJ’s Alyssa Abkowitz writes, including greater use of an in-house logistics operation that the company considers a competitive advantage. JD’s move could provide a blueprint for a company in the U.S., where restaurant food-supply remains fragmented. While many U.S. procurement companies use technology to help restaurants find fresh food, experts say it would take a major player such as Amazon.com Inc. to change how restaurants are supplied. The sourcing trade comes with tight margins, but JD.com is betting that intensive use of data and strong flow of goods can offset the challenges.\nTRANSPORTATION A JD.com warehouse in Shanghai. Photo: Bloomberg News One of container shipping’s fastest-growing operators appears to be trying to get ahead of a vessel glut before it begins. China Cosco Shipping is deferring delivery of 10 big vessels from this year to 2019 , Lloyd’s List Maritime Intelligence reports, pushing off what would have been a 30% increase in the shipping line’s cargo capacity. The action comes after China Cosco vaulted up the rankings of ship operators with its acquisition of Orient Overseas Container Lines, and as experts say carriers are bracing for a big new influx of capacity that could cost them newfound pricing leverage. Research group Alphaliner said in a report this week that seven newly-built vessels with capacity from 19,000 to 21,000 containers are set to join fleets this month, launching a year of record mega-ship deliveries. That could trigger new rate reductions just as shipping lines are seeing a long-awaited recovery in global trade and profits.\nQUOTABLE\n‘ Having an efficient procurement and logistics network is critical to success. ’\n—David Henkes of restaurant consultancy Technomic Inc., on restaurant sourcing.\nNumber of the Day 70% Year-over-year increase in U.S. coal exports in the first 10 months of 2017, according to the Energy Information Administration.\nIN OTHER NEWS An explosion on the stricken Iranian oil tanker Sanchi forced a temporary halt in rescue and recovery efforts. (WSJ)\nThe World Bank says the global economy is operating at its potential for the first time in a decade. (WSJ)\nOil prices in some markets are pushing close to $70 a barrel. (WSJ)\nAT&T Inc. is walking away from a deal to sell smartphones made by China’s Huawei Technologies Co. (WSJ)\nSears Holdings Corp. raised new financing and is seeking new debt relief as the retailer reported sharply declining sales . (WSJ)\nThe Renault-Nissan-Mitsubishi Alliance is creating one of the largest venture-capital funds dedicated to automotive technology startups . (WSJ)\nFrench President Emmanuel Macron says China is close to finalizing orders for 184 Airbus A320 aircraft . (WSJ)\nHouston-based Ocean Infinity will deploy unmanned submersibles in the southern Indian Ocean for the wreckage of Malaysia Airlines Flight 370. (WSJ)\nFedEx Corp.’s payout of $227 million last year was among the largest in a growing number of high-priced settlements by companies of worker-treatment claims . (WSJ)\nWhite House officials say the release of President Donald Trump’s infrastructure package may slip to next month . (The Hill)\nKohl’s Corp. plans to lease unused space in its “right-sized” stores to grocery chains and convenience stores. (CNBC)\nMaritime piracy around the world is at a two-decade low . (MarineLink)\nGlobal airfreight demand rose 8.8% in November , more than double capacity growth. (Air Cargo News)\nTurkish Airlines added three Boeing Co. 777 freighters to an earlier order for two of the jets . (Air Cargo World)\nJapanese trucking companies are joining parcel carriers in raising domestic transport prices . (Nikkei Asian Review)\nShipments of mobile phones in China fell 12.3% last year , including a 32.5% decline in December. (Xinhua)\nCanadian crude shipments to the U.S. by rail could rise more than 60% this year on demand by Gulf Coast refiners . (BOE Report)\nLogistics comapny Transplace named Frank McGuigan chief executive as CEO Tom Sanderson became executive chairman. (Fleet Owner)\nABOUT US Paul Page is deputy editor of WSJ Logistics Report. Follow him at @PaulPage , and follow the entire WSJ Logistics Report team: @brianjbaskin , @jensmithWSJ and @EEPhillips_WSJ . Follow the WSJ Logistics Report on Twitter at @WSJLogistics .\nWrite to Paul Page at paul.page@wsj.com", "external_links": ["http://www.fleetowner.com/people/transplace-names-mcguigan-ceo", "http://www.aircargonews.net/news/business/air-cargo-statistics/single-view/news/air-cargo-continues-to-improve-in-november-while-optimism-for-2018-grows.html", "https://twitter.com/WSJLogistics?lang=en", "https://www.marinelink.com/news/maritime-activity-piracy432802", "https://www.cnbc.com/2018/01/10/kohls-to-partner-with-grocer-convenience-store-to-fill-vacant-space.html", "https://twitter.com/EEPhillips_WSJ?lang=en", "https://aircargoworld.com/allposts/turkish-airlines-orders-three-more-777-freighters-from-boeing/", "https://asia.nikkei.com/Business/Companies/Japan-s-Seino-joins-parcel-delivery-peers-seeking-higher-rates", "http://thehill.com/policy/transportation/368226-trumps-infrastructure-plan-may-slip-to-next-month", "http://www.xinhuanet.com/english/2018-01/10/c_136884744.htm", "https://lloydslist.maritimeintelligence.informa.com/LL1120789/Cosco-delays-newbuildings-on-overcapacity-fears", "https://twitter.com/brianjbaskin?lang=en", "https://twitter.com/jensmithWSJ", "https://twitter.com/PaulPage", "https://boereport.com/2018/01/05/rail-shipments-of-canadian-oil-to-u-s-seen-rising-over-60-pct/"], "published": "2018-01-11T14:57:00.000+02:00", "crawled": "2018-01-11T18:26:29.002+02:00", "highlightTitle": ""}