{"organizations": [], "uuid": "3b39605133cdadad0f1862ac36b4d4977c4b7682", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-peyto-reports-achievement-of-year-end-production-target-and-revises-2018-outlook.html", "country": "US", "domain_rank": 767, "title": "Peyto Reports Achievement of Year End Production Target and Revises 2018 Outlook", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.036, "site_type": "news", "published": "2018-01-12T03:33:00.000+02:00", "replies_count": 0, "uuid": "3b39605133cdadad0f1862ac36b4d4977c4b7682"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-peyto-reports-achievement-of-year-end-production-target-and-revises-2018-outlook.html", "ord_in_thread": 0, "title": "Peyto Reports Achievement of Year End Production Target and Revises 2018 Outlook", "locations": [], "entities": {"persons": [{"name": "peyto", "sentiment": "none"}], "locations": [{"name": "calgary", "sentiment": "none"}, {"name": "alberta", "sentiment": "none"}, {"name": "peyto", "sentiment": "none"}], "organizations": [{"name": "peyto exploration & development corp.", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CALGARY, Alberta, Jan. 11, 2018 (GLOBE NEWSWIRE) -- Peyto Exploration & Development Corp. (TSX:PEY) (\"Peyto” or the “Company\") is pleased to announce the achievement of its year-end 2017 production target of 115,000 boe/d. Together with its industry leading cost structure and robust hedging program, the company expects to report another profitable and successful year in 2017. In addition, Peyto announces today a revised capital plan for 2018 in light of the recent 40% decline in near-term natural gas prices. The plan is designed to prudently defer investment on a portion of Peyto’s inventory in order to ensure maximum returns can be achieved from these opportunities, while at the same time strengthening the Company’s financial position for the future. This plan involves the following five elements:\nDevelopment plans deferred and capital budget reduced to $200-$250 million. The preliminary 2018 capital budget announced Nov 8, 2017, ranging from $300-$450 million, has been reduced to $200 to $250 million. As always, investment will be directed toward the highest return opportunities within Peyto’s vast inventory of drilling locations, now with particular focus on the most liquids rich portions of the Company’s Deep Basin assets. For example, Peyto’s lands in the Greater Sundance Area contain approximately 2.4 TCFe of net Cardium resource with only 14% recovered to date and over 500 internally identified drilling locations. The Cardium in this area yields between 40 to 60 bbl/MMcf of natural gas liquids (greater than 50% C5+) and Peyto plans to exploit this undeveloped resource with newly designed horizontal wells with higher density fracture treatments. As Peyto enjoys the benefit of very little land expiring in 2018, it has the freedom to develop much of its lands as market conditions dictate.\nMonthly dividend reduced to $0.06/share . Starting with the January dividend, for shareholders of record on January 31, 2018 to be paid on February 15, 2018, the monthly dividend will be reduced from the current $0.11/share to $0.06/share. This new dividend level will align better with projected earnings for 2018 and lower near term natural gas prices. In conjunction with the reduced capital program, the reduced monthly dividend will free up cash for debt reduction, share repurchases, and potential new business opportunities that may arise.\nShare buyback program . Peyto intends to apply to the Toronto Stock Exchange (“TSX”) to implement a normal course issuer bid (“NCIB”). Subject to TSX approval, the NCIB is expected to commence on January 22, 2018 and will terminate on the earlier of 1) January 21, 2019; or 2) the date on which the maximum number of Common Shares that can be acquire pursuant to the NCIB are purchased.\nTerm debt issuance. As announced on January 2, 2018, Peyto has continued to protect its balance sheet from rising interest rates with the closing of another private placement of senior unsecured notes. On that date, Peyto issued CND$100 million of senior unsecured notes which bear a coupon rate of 3.95% and mature on January 2, 2028. The issuance of senior notes expands Peyto’s aggregate borrowing capacity to $1.92 billion, split into a $1.3 billion, 4 year revolver with a stated term date of October 2021 and $620 million of senior unsecured notes. Peyto now has approximately $600 million in available borrowing capacity.\nStrong near-term hedge book and medium-term market diversification strategy. Peyto’s hedging strategy in the past has used fixed price financial swaps to smooth out the volatility in natural gas prices. For 2018, this program has secured a fixed price of $2.68/Mcf for approximately 75% of 2018 forecast natural gas production, which combined with liquid revenues ensures close to 90% of projected revenues will not be subject to natural gas price volatility. These revenues, when combined with the remaining unhedged natural gas revenue, is expected to deliver sufficient funds from operations to more than cover both the capital program and dividend payment while also generating significant free cash flow that can be used for debt repayment or share buybacks. As well, the Board of Directors has approved a market diversification strategy to diversify a portion of Peyto’s future natural gas sales away from the AECO hub.\nOperational Update\nPeyto exited 2017 hitting its year end production target of 115,000 boe/d. Of this production, approximately 11,000 boe/d was natural gas liquids and 42% was from wells drilled and connected in 2017. A total of 143 gross (138.5 net) wells were drilled in the year, with 91 in the Greater Sundance area, 47 in the Brazeau area and 5 in the newly established Whitehorse area. The Notikewin formation contributed the largest proportion of new production at 49% while the Wilrich formation contributed 36% of the volumes. Production in the Brazeau area exited the year at 29,000 boe/d up from 19,000 boe/d at the start of the year, while production from the Greater Sundance area remained level at approximately 80,000 boe/d.\nRevised 2018 Budget\nBoth AECO and Henry Hub natural gas prices have softened since Peyto released its preliminary 2018 budget back in November 2017. At that time, the future strip for Henry Hub and AECO prices for calendar 2018 was US$3.09/MMBTU and CND$2.02/GJ respectively. Today, these same benchmark prices are USD$2.87/MMBTU and CND$1.35/GJ. Although Peyto can still generate positive returns on its well economics at these prices, the returns are significantly improved merely by delaying investments until higher natural gas prices on the future strip, or lower development costs, can be realized.\nIn response to these lower natural gas prices, Peyto is planning to defer its drilling activity and is reducing its 2018 capital budget until natural gas prices rebound. The revised capital budget for 2018 is now expected to range between $200 and $250 million. Activity will include drilling, completing and connecting approximately 50 to 60 net wells, installing a new 20 MMCF/d gas plant in the Whitehorse area, and adding new drilling inventory through new land purchases. Much of this activity will be scheduled in the latter half of the year to ensure new, flush production is coming on-stream into next winter’s higher natural gas prices. This reduced program is expected to add approximately 25,000 boe/d of new production by year end to the existing production base which is anticipated to decline at approximately 35% throughout the year. Average production for the year 2018 is expected to be 2% lower than 2017.\nThe current 2018 future AECO strip price for Alberta natural gas is $1.35/GJ, which when combined with a Canadian Light Sweet oil price of approximately $75/bbl, yields an unhedged revenue stream of approximately $2.30/Mcfe, using Peyto’s current blend of gas and NGLs. As mentioned, Peyto has secured a fixed price for approximately 75% of the expected 2018 natural gas production at an average price of $2.34/GJ ($2.68/Mcf). When these prices are adjusted for Peyto’s historic NGL and heat content premiums and are combined with the Company’s industry leading cash costs of appro", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/e8c9397b-0c9c-4dbc-a426-f5275a74de11"], "published": "2018-01-12T03:33:00.000+02:00", "crawled": "2018-01-12T06:15:56.001+02:00", "highlightTitle": ""}