{"organizations": [], "uuid": "f4edaa95dfa2047542f9c3853f74ccb12983f6aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-aerie-pharmaceuticals-announces-appointments-of-nils-hauptmann-as-director-of-regulatory-affairs-and-pharmacovigilance-and.html", "country": "US", "domain_rank": 767, "title": "Aerie Pharmaceuticals Announces Appointments of Nils Hauptmann as Director of Regulatory Affairs and Pharmacovigilance and Tim Swan as Director of Sales and Transparency Operations", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.512, "site_type": "news", "published": "2018-01-16T14:30:00.000+02:00", "replies_count": 0, "uuid": "f4edaa95dfa2047542f9c3853f74ccb12983f6aa"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-aerie-pharmaceuticals-announces-appointments-of-nils-hauptmann-as-director-of-regulatory-affairs-and-pharmacovigilance-and.html", "ord_in_thread": 0, "title": "Aerie Pharmaceuticals Announces Appointments of Nils Hauptmann as Director of Regulatory Affairs and Pharmacovigilance and Tim Swan as Director of Sales and Transparency Operations", "locations": [], "entities": {"persons": [{"name": "nils hauptmann", "sentiment": "neutral"}, {"name": "tim swan", "sentiment": "neutral"}, {"name": "pharmacovigilance", "sentiment": "neutral"}, {"name": "cindy martin", "sentiment": "none"}, {"name": "gerry mckenzie", "sentiment": "none"}, {"name": "swan", "sentiment": "none"}, {"name": "hauptmann", "sentiment": "none"}], "locations": [{"name": "calif.", "sentiment": "none"}, {"name": "irvine", "sentiment": "none"}], "organizations": [{"name": "aerie pharmaceuticals, inc.", "sentiment": "neutral"}, {"name": "regulatory affairs", "sentiment": "neutral"}, {"name": "avanir pharmaceuticals, inc.", "sentiment": "none"}, {"name": "fibrogen, inc", "sentiment": "none"}, {"name": "transparency operations", "sentiment": "none"}, {"name": "allergan, inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "IRVINE, Calif.--(BUSINESS WIRE)-- Aerie Pharmaceuticals, Inc. (NASDAQ:AERI), an ophthalmic pharmaceutical company focused on the discovery, development, and commercialization of first-in-class therapies for the treatment of patients with open-angle glaucoma and other diseases of the eye, today announced the appointments of Nils Hauptmann as Director of Regulatory Affairs and Pharmacovigilance, reporting to Cindy Martin, Aerie’s Vice President of Regulatory, and Tim Swan as Director of Sales and Transparency Operations, reporting to Gerry McKenzie, Aerie’s Vice President of Commercial Operations. Mr. Hauptmann will support the preparation of regulatory and clinical documents along with oversight of post-marketing pharmacovigilance and promotional activities. Mr. Hauptmann previously held related positions at Avanir Pharmaceuticals, Inc. and Fibrogen, Inc. Mr. Swan will lead the operational functions in support of teams that interact with healthcare providers and organizations. Mr. Swan previously held related positions at Allergan, Inc.\nIn connection with the acceptance of their positions, Mr. Hauptmann and Mr. Swan on a combined basis will receive awards totaling 28,800 stock options. The stock options will vest over 4 years, with 25% vesting on the first anniversary of the hire date and the remainder vesting ratably on each of the subsequent 36 monthly anniversaries of the hire date. These awards were made outside of Aerie’s stockholder-approved equity incentive plan and were approved by the Company’s independent directors as inducements material to Mr. Hauptmann and Mr. Swan entering into employment with the Company in reliance on NASDAQ Listing Rule 5635(c)(4), which requires this public announcement.\nAbout Aerie Pharmaceuticals, Inc.\nAerie is an ophthalmic pharmaceutical company focused on the discovery, development and commercialization of first-in-class therapies for the treatment of patients with open-angle glaucoma and other diseases of the eye. Aerie's first product, Rhopressa® (netarsudil ophthalmic solution) 0.02%, for the reduction of elevated intraocular pressure (IOP) in patients with open-angle glaucoma or ocular hypertension, was approved by the U.S. Food and Drug Administration (FDA) in December 2017. A link to the full product label is available on the Aerie website at http://investors.aeriepharma.com . Aerie’s second product candidate, Roclatan TM (netarsudil/latanoprost ophthalmic solution) 0.02%/0.005%, which is a fixed dose combination of Rhopressa ® and widely prescribed PGA latanoprost, achieved its primary efficacy endpoint in two Phase 3 registration trials, named Mercury 1 and Mercury 2, and also achieved successful 12-month safety and efficacy results in Mercury 1. The Roclatan TM NDA submission is expected to take place in the second quarter of 2018. Aerie is also focused on global expansion and the development of additional product candidates and technologies in ophthalmology.\nForward-Looking Statements\nThis press release contains for purposes of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. We may, in some cases, use terms such as “predicts,” “believes,” “potential,” “proposed,” “continue,” “estimates,” “anticipates,” “expects,” “plans,” “intends,” “may,” “could,” “might,” “will,” “should,” “exploring,” “pursuing” or other words that convey uncertainty of future events or outcomes to identify these . include statements regarding our intentions, beliefs, projections, outlook, analyses or current expectations concerning, among other things: the success, timing and cost of our ongoing and anticipated preclinical studies and clinical trials for our current product candidates, including statements regarding the timing of initiation and completion of the studies and trials; our expectations regarding the clinical effectiveness of our product candidates and results of our clinical trials; the timing of and our ability to request, obtain and maintain FDA or other regulatory authority approval of, or other action with respect to, our product candidates, including the expected timing of, and timing of regulatory and/or other review of, filings for our product candidates; our expectations regarding the commercialization of our product candidates; the potential advantages of our product candidates; our plans to pursue development of our product candidates for additional indications and other therapeutic opportunities; our plans to explore possible uses of our existing proprietary compounds beyond glaucoma; our ability to protect our proprietary technology and enforce our intellectual property rights; and our expectations regarding strategic operations, including our ability to in-license or acquire additional ophthalmic products or product candidates or technologies. By their nature, involve risks and uncertainties because they relate to events, competitive dynamics, industry change and other factors beyond our control, and depend on regulatory approvals and economic and other environmental circumstances that may or may not occur in the future or may occur on longer or shorter timelines than anticipated. We discuss many of these risks in greater detail under the heading “Risk Factors” in the quarterly and annual reports that we file with the Securities and Exchange Commission (SEC). In particular, FDA approval of Rhopressa® does not constitute approval of Roclatan TM , and there can be no assurance that we will receive FDA approval for Roclatan TM or any future product candidates. are not guarantees of future performance and our actual results of operations, financial condition and liquidity, and the development of the industry in which we operate may differ materially from the contained in this press release. Any that we make in this press release speak only as of the date of this press release. We assume no obligation to update our whether as a result of new information, future events or otherwise, after the date of this press release.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180116005353/en/\nAerie Pharmaceuticals\nRichard Rubino, 908-947-3540\nrrubino@aeriepharma.com\nor\nBurns McClellan, Inc., on behalf of Aerie Pharmaceuticals\nInvestors\nAmi Bavishi, 212-213-0006\nabavishi@burnsmc.com\nor\nMedia\nJustin Jackson, 212-213-0006\njjackson@burnsmc.com\nSource: Aerie Pharmaceuticals, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180116005353/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestors.aeriepharma.com&esheet=51737365&newsitemid=20180116005353&lan=en-US&anchor=http%3A%2F%2Finvestors.aeriepharma.com&index=1&md5=6dd58f76ff86f5016e07fc1d95ad6699"], "published": "2018-01-16T14:30:00.000+02:00", "crawled": "2018-01-16T17:05:36.000+02:00", "highlightTitle": ""}