{"organizations": [], "uuid": "f682489db8f55183bfa9ee27d1b355630bcdaab2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/eu-payment-regulation/rpt-european-banks-braced-for-slow-burn-payments-revolution-idUSL8N1P55JG", "country": "US", "domain_rank": 408, "title": "RPT-European banks braced for \"slow burn\" payments revolution", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T08:00:00.000+02:00", "replies_count": 0, "uuid": "f682489db8f55183bfa9ee27d1b355630bcdaab2"}, "author": "", "url": "https://www.reuters.com/article/eu-payment-regulation/rpt-european-banks-braced-for-slow-burn-payments-revolution-idUSL8N1P55JG", "ord_in_thread": 0, "title": "RPT-European banks braced for \"slow burn\" payments revolution", "locations": [], "entities": {"persons": [{"name": "huw jones", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Repeats January 10 story with no changes to text)\n* Retailers look to bypass cards for online purchases\n* Tougher competition could reshape Europe’s retail banking\n* Establishing consumer trust in data protection a hurdle\nBy Huw Jones\nLONDON, Jan 10 (Reuters) - New European rules on online payments and banking due to go into effect on Saturday mark the start of a “slow burn” revolution that will prise open traditional retail banking and may force lenders to rethink their business models, regulators say.\nThe Payments Services Directive 2 (PSD2), which allows retailers and consumers to bypass banks by authorising payments directly from personal accounts, among other things, aims to cut costs and increase choice by widening the range of firms offering financial services.\nThe European Union rules, which also reflect rapid advances in technology in banking like the use of smart phones, open the door to “fintech” online applications like Money Dashboard, Plum and Moneybox, as well as established retail giants like Amazon, Apple, Facebook and Google.\n“The development of the market is likely to be a slow burn,” said Karina McTeague, director of retail banking supervision at Britain’s regulator, the Financial Conduct Authority (FCA). “We, like everyone in this industry, don’t know exactly which direction it will go.”\nIndustry experts said the directive would likely have enormous implications for traditional retail banks.\nAlthough firms with PSD2 licenses will not be authorised to take deposits or make loans, bypassing the banks means debit or credit cards will not be necessary for most of their customers’ online transactions.\nCustomers will also be able to authorise firms to access their accounts to help them manage their finances, for example by guiding them to the cheapest points of credit and consolidating data from accounts with more than one bank, which banks have resisted up until now.\n“PSD2 is a revolutionary piece of regulation that is likely to signal the end of the high street bank in the medium-to-long term,” said Michael McKee, head of financial services regulation at international law firm DLA Piper.\nThe FCA said it has received 40 licence applications for PSD2 services in Britain. As many as a dozen could be in place by Saturday, it said.\nThe directive puts the EU at the forefront of efforts to disrupt the central role of banks in how people pay for goods and services online and encourage competition by giving customers the right to share their account data.\nFintech startups in the United States have argued that a little-known provision in the Dodd-Frank Act gives them the right to source data from their customers’ accounts, but say some banks have been slow to comply.\nOPEN BANKING The “open banking” system may take a while to gain momentum with the public.\nBritish government efforts to make it easier to switch bank accounts have had limited success due to customer inertia, for example. Another difficulty is convincing customers that their bank account data is safe in the hands of outside firms.\n“It will be a challenge for all existing banks and payments firms, given their responsibilities to protect information, to properly and promptly handle requests for access to customer data from new open banking portals,” said Tim Dolan, a regulation lawyer at Reed Smith.\nSteve Tigar, CEO of Edinburgh-based personal financial management service Money Dashboard, said the new rules will help their business by establishing trust.\n“Using a service like Money Dashboard will become commonplace as opposed to the sole domain of early adopters,” he told Reuters.\nThe Bank of England has said direct payment and account services firms could become the future “face” of day-to-day banking, effectively turning traditional retail banks into vaults.\nThat represents a challenge for banks. A BoE stress test of top UK lenders last year said PSD2’s feature of finding the cheapest credit could mean banks will lose revenue from charging for overdrafts, for example.\nIncome from processing payments and overdrafts currently contribute 800 million pounds and 2.6 billion pounds respectively to annual pre-tax profits of the major UK banks, the BoE said.\nThat’s a relatively small amount compared to the 2016 pre-tax profit of 3.2 billion pounds at just one bank, Barclays. But banks may also have to spend more on marketing to attract and retain customers in face of increased competition, the BoE says.\n“I think the days of when you have a big bank and it provides all the touch points to that financial services organisation and provides you with all the product sets, and keeps you captive, are gone,” said Anne Boden, CEO of upstart Starling Bank. “PSD2 could change banking forever.”\nReed Smith’s Dolan said there is nothing to stop banks competing in the same space. HSBC has already said it will launch a new app to aggregate bank accounts.\n“We are expecting a mixed market to develop here with both small firms challenging and larger players offering these services to their customers for the first time,” said Christopher Woolard, the FCA’s executive director of strategy and competition.\nThe FCA this year is reviewing the business models of retail banks to see if they are sustainable, and will include the impact of PSD2 as an added consideration.\nBritain’s plan to leave the EU next March will not affect the implementation of PSD2 because all of the EU’s financial rules will be incorporated into UK law. (Additional reporting by Emma Rumney in London and Anna Irrera in New York; Editing by Sonya Hepinstall)\n ", "external_links": [], "published": "2018-01-11T08:00:00.000+02:00", "crawled": "2018-01-11T08:13:18.016+02:00", "highlightTitle": ""}