{"organizations": [], "uuid": "868d9c548a827097f977823d7f72125dc2f5cbc5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-dale-foster-and-charles-bass-join-wayside-technology-group.html", "country": "US", "domain_rank": 767, "title": "Dale Foster and Charles Bass Join Wayside Technology Group", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T21:19:00.000+02:00", "replies_count": 0, "uuid": "868d9c548a827097f977823d7f72125dc2f5cbc5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-dale-foster-and-charles-bass-join-wayside-technology-group.html", "ord_in_thread": 0, "title": "Dale Foster and Charles Bass Join Wayside Technology Group", "locations": [], "entities": {"persons": [{"name": "dale foster", "sentiment": "negative"}, {"name": "bass", "sentiment": "none"}, {"name": "charles", "sentiment": "none"}, {"name": "foster", "sentiment": "none"}, {"name": "charles bass", "sentiment": "none"}, {"name": "dale", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "eatontown", "sentiment": "none"}], "organizations": [{"name": "charles bass join wayside technology group", "sentiment": "negative"}, {"name": "wayside technology group inc.", "sentiment": "negative"}, {"name": "blue medora", "sentiment": "none"}, {"name": "wayside technology", "sentiment": "none"}, {"name": "wayside technology group", "sentiment": "none"}, {"name": "promark technology", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "EATONTOWN, N.J., Jan. 04, 2018 (GLOBE NEWSWIRE) -- Wayside Technology Group Inc. (NASDAQ:WSTG), an international technology channel company, announced today the appointment of Dale Foster as Executive Vice President and Charles Bass as Vice President – New Business Development, effective January 3, 2018. Messrs. Foster and Bass, both recognized industry leaders, bring along a wealth of sales and channel experience as well as many valuable relationships to Lifeboat Distribution and Wayside Technology Group.\nDale Foster, who joins Wayside Technology with over 20 years of industry and channel experience, built a value-added specialty distributor focused on storage and virtualization solutions as the Executive Director and General Manager of Promark Technology. During his tenure at Promark, Dale developed an industry leading team known for their exceptional, high-touch service.\nCharles Bass also joins us with more than 20 years of industry and channel experience, most recently as Vice President Worldwide Channel Sales at Blue Medora. Charles’ focus will be on vendor development and strategic relationships.\n“Both Dale Foster and Charles Bass are well-respected industry leaders and we truly look forward to working together,” said Simon Nynens, Chairman and Chief Executive Officer, Wayside Technology Group. “Their experience will be vital in shaping and executing our business strategies with our reseller and vendor partners − this year and in the years to come.”\n“I am very excited about the opportunity to join Wayside Technology,” said Dale Foster, Executive Vice President. “I look forward to joining a very successful organization and continuing to build a world class specialty distributor, focused on the unique needs of emerging technology platforms.”\n“I share Dale’s excitement in joining Wayside. I believe that we have an outstanding opportunity before us to meet the needs of emerging technology vendors. I think that there is a significant unmet need in the market that we plan to efficiently fill,” added Charles Bass.\nA bou t Wayside Technology Group, Inc.\nWayside Technology Group, Inc. (NASDAQ:WSTG) was founded in 1982 and is a unified and integrated technology company providing products and solutions for corporate resellers, VARs, and developers as well as business, government and educational entities. The company offers technology products from software publishers and manufacturers including Acronis, Bitdefender, Bluebeam Software, Dell Software, erwin, ExaGrid Systems, Flexera Software, Hewlett Packard, Infragistics, Intel Software, Lenovo, Micro Focus, Microsoft, Mindjet, Samsung, SmartBear Software, SolarWinds, Sophos, StorageCraft Technology, Super Micro Computer, Inc., TechSmith, Unitrends, Veeam Software and VMware.\nAdditional information can be found by visiting www.waysidetechnology.com .\nFor Media & PR inquiries contact:\nMedia Relations\nWayside Technology Group, Inc.\nmedia@waysidetechnology.com\n(732) 389-0932\nThe statements in this release concerning the Company’s future prospects are forward-looking statements that involve certain risks and uncertainties. Such risks and uncertainties include the continued acceptance of the Company’s distribution channel by vendors and customers, the timely availability and acceptance of new products, and contribution of key vendor relationships and support programs. The forward-looking statements contained herein are also subject generally to other risks and uncertainties that are described from time to time in our filings with the Securities and Exchange Commission.\nSource:Wayside Technology Group, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/cc9389e9-b3a1-4e3d-9a32-8508cf7f1d0c", "https://www.globenewswire.com/Tracker?data=W6Ctp0NBAgZgpuUqNhfkXxylfofSIUDil5ayV49824TYyfKbXTigUUrp6plXfnMiEX034u132ryW4rZWQ8GhNmVkIGEOG0R0gi2NAEcuJZ4=", "https://www.globenewswire.com/Tracker?data=QqtkTWsEXddzs2NkiiFVXoaoDzZAwqC9n6UteHwVX2C0UqUfVFBX9ZB4TriCZQwLV1HfbFcdN5yXZgzc9XQ_CM6mVpAyaLu40upUkza_bKp2HYQ2SDDH91WB-cI2_Wjv", "https://www.globenewswire.com/Tracker?data=rfU5RUWtYwTmhu8vnVeeV0UaK6cUIu9cPGtrbFU1ab684NXkp__Zay8j7NNYkdLd3hfoSreqU2FTaO5WoAWm0A=="], "published": "2018-01-04T21:19:00.000+02:00", "crawled": "2018-01-04T22:51:36.008+02:00", "highlightTitle": ""}