{"organizations": [], "uuid": "3acb44e7dfc3224bfe09047bd28e46ee8b77d870", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-storyful-names-mandy-jenkins-to-editor-in-chief.html", "country": "US", "domain_rank": 767, "title": "Storyful Names Mandy Jenkins to Editor in Chief", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.69, "site_type": "news", "published": "2018-01-18T17:00:00.000+02:00", "replies_count": 0, "uuid": "3acb44e7dfc3224bfe09047bd28e46ee8b77d870"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-storyful-names-mandy-jenkins-to-editor-in-chief.html", "ord_in_thread": 0, "title": "Storyful Names Mandy Jenkins to Editor in Chief", "locations": [], "entities": {"persons": [{"name": "mandy jenkins", "sentiment": "negative"}, {"name": "jenkins", "sentiment": "none"}, {"name": "storyful", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "storyful", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Storyful, a News Corp-owned social media insights and content company, announced today Mandy Jenkins has assumed the role of Editor in Chief.\nPreviously the Head of News, Ms. Jenkins will continue to lead Storyful's growing newsroom as the Editor in Chief and expand the team's research and verification services as well as their industry-leading social verification for breaking and viral news.\n\"Over the past two years, Storyful has evolved into a global social newsroom that helps partners deliver the context, social content, and accurate information their audiences need to understand the most important stories of the day. I'm extremely proud of the work the team has done and look forward to growing our scope and capabilities to protect our partners from the perils of virtual disinformation while helping build trust with their audiences through our social video and investigative journalism services,\" said Mandy Jenkins.\nMs. Jenkins has been at Storyful for three years, managing a global team of more than 60 journalists across four continents and works closely with Storyful's product development and sales teams to manage key relationships with publishers and social platforms. She is a seasoned journalist and expert in the media industry having worked at several different publications over the course of her career including the Milwaukee Journal Sentinel, the Cincinnati Enquirer, TBD.com , Digital First Media and the Huffington Post. Mandy has served on the Board of Directors of the Online News Association since 2012, most recently in the role of Vice President, and also sits on the board of the American Society of News Editors. She has more than a decade of experience in training journalists around the world in social media strategy, community engagement, social journalism ethics, and social search and verification.\n\"Mandy Jenkins has been a vital member of the Storyful team and we are thrilled to grow her role in the organization, especially as we continue to evolve into a world-class social newsroom,\" said Sharb Farjami, CEO of Storyful. \"We cover a wide variety of stories and topics with our newsroom partners every day and we rely on Mandy's leadership and our team of expert journalists to provide the insights and analysis our partners need.\"\nAbout Storyful\nStoryful, a division of News Corp (NASDAQ: NWS, NWSA; ASX: NWS, NWSLV), is a social insights and content company combining world-class journalism with unique access to data and proprietary technology to find insights and content for media and brand partners. Their expertise allows them to contextualize stories and verify content to find the truth in the vast landscape of social noise.\nFounded as the first social news agency by three Irish journalists during the Arab Spring, Storyful was created out of the need to break the news faster and utilize social content to add context around the stories being told by journalists. Storyful now provides the same intelligence to brands to help them proactively analyze social activity to understand their audience, create targeted content, and inform their messaging and strategy.\nAbout News Corp\nNews Corp (NASDAQ: NWS, NWSA; ASX: NWS, NWSLV) is a global, diversified media and information services company focused on creating and distributing authoritative and engaging content to consumers throughout the world. The company comprises businesses across a range of media, including: news and information services, book publishing, digital real estate services, and cable network programming and pay-TV distribution in Australia. Headquartered in New York, the activities of News Corp are conducted primarily in the United States, Australia, and the United Kingdom. More information: http://www.newscorp.com .\nContact:\nJennifer Laski\njlaski@relativity.ventures\n(917) 848-9173\n releases/storyful-names-mandy-jenkins-to-editor-in-chief-300584467.html\nSOURCE Storyful", "external_links": ["http://www.newscorp.com/", "http://www.prnewswire.com/news-releases/storyful-names-mandy-jenkins-to-editor-in-chief-300584467.html"], "published": "2018-01-18T17:00:00.000+02:00", "crawled": "2018-01-18T19:53:35.021+02:00", "highlightTitle": ""}