{"organizations": [], "uuid": "44631f0aab5800979848adf7e626f915d41c5ca2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220894280&w=1200&r=LYNXMPEE091AM", "site_section": "http://feeds.reuters.com/reuters/UKHealth", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-health-childlessness/moms-age-at-birth-linked-to-daughters-later-childlessness-idUKKBN1EZ2D6", "country": "US", "domain_rank": 408, "title": "Mom’s age at birth linked to daughter’s later childlessness", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T19:59:00.000+02:00", "replies_count": 0, "uuid": "44631f0aab5800979848adf7e626f915d41c5ca2"}, "author": "", "url": "https://uk.reuters.com/article/us-health-childlessness/moms-age-at-birth-linked-to-daughters-later-childlessness-idUKKBN1EZ2D6", "ord_in_thread": 0, "title": "Mom’s age at birth linked to daughter’s later childlessness", "locations": [], "entities": {"persons": [{"name": "carolyn crist", "sentiment": "none"}, {"name": "olga basso", "sentiment": "none"}, {"name": "basso", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "montreal", "sentiment": "none"}], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}, {"name": "mcgill university", "sentiment": "none"}, {"name": "human reproduction", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 6:02 PM / Updated 27 minutes ago Mom’s age at birth linked to daughter’s later childlessness Carolyn Crist 4 Min Read \n(Reuters Health) - - Moms who have children later in life are more likely to have daughters who don’t have kids, according to a new study. Pregnant women attend a yoga class in Madrid March 17, 2009. REUTERS/Susana Vera \nCompared with women born to 20- to 24-year-old mothers, daughters born to mothers in their mid-20s or 30s were more likely to be childless, the study authors report in the journal Human Reproduction. \n“In many countries, couples are having children later and later, and there haven’t been many studies of future reproduction,” said study author Dr. Olga Basso of McGill University in Montreal, Canada. \nBasso and colleagues analyzed data from the U.S.-based Sister Study on more than 43,000 women born between 1930 and 1964. \nOverall, about 7,600 women - or nearly 18 percent - hadn’t given birth. The researchers found that as maternal age at delivery went up, so did the odds that daughters would be childless. \nCompared with study participants born to 20- to 24-year-old mothers, for instance, the odds of childlessness were 21 percent higher for participants born to mothers ages 25-29, 30 percent higher for women born to mothers ages 30 to 34, and 40 percent higher for women born to mothers who were 35 or older. \nBasso and colleagues want to know why. They’re interested in future studies about changes in biology, behavior and socioeconomic status and how those could affect birth and childlessness. \n“It could be that women who have children at an older age have daughters instilled with different behaviors,” Basso said. “They may have different ambitions and different plans.” \n“I was concerned when I saw these findings because I really think women should have children when they’re ready as a matter of choice,” she told Reuters Health by phone. “I don’t want people to believe, as a result of this, that they need to have children when they’re 25.” \nAdditional studies are looking at the effect of father’s age on childlessness and the historical trends of childbirth. \n“We’ve seen an increase in age at first birth, or when women have their first child, but the age hasn’t changed much for last birth,” said Ruben Arslan of the Max Planck Institute for Human Development in Berlin, Germany. Arslan, who wasn’t involved with this study, researches delayed childbearing. \n“In past decades, women had children for longer and had more children,” Arslan told Reuters Health by phone. “What we’re seeing is not unprecedented, and it’s not a reason to get worried about childbearing now.” \nThe main limitation of the study is that researchers didn’t know whether women’s childlessness was by choice and intentional. \n“It’s important to think about the consequences and social structures that would give women more choices,” said Dr. Sarah Hayford of Ohio State University in Columbus. Hayford, who wasn’t involved with this study, researches childlessness trends in the U.S. \n“The question of childlessness is often framed as a negative outcome, without asking about whether it was voluntary or not,” Hayford told Reuters Health by phone. “But studying the voluntary nature is a complicated task, especially over a broad population, when it’s such a personal decision.” \nThe cultural context is key, too. A stronger family orientation, religiosity, and other cultural values may contribute to earlier childbearing, which may be passed down to children, said Dr. Martin Kolk of Stockholm University in Sweden, who studies intergenerational patterns of childbearing but wasn’t involved with this study. \n“Fertility decisions are often shared between daughters (and sons) and mothers (and fathers),” Kolk told Reuters Health by email. “We’re seeing additional evidence that there is a strong familial and cultural factor affecting childbearing.” \nSOURCE: bit.ly/2FnQ4dy Human Reproduction, online December 4, 2017.", "external_links": [], "published": "2018-01-10T19:59:00.000+02:00", "crawled": "2018-01-10T20:29:52.009+02:00", "highlightTitle": ""}