{"organizations": [], "uuid": "5b688d671bc57bd28f9c0a25b49eaded2b17606f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/business-wire-rev-group-acquires-lance-camper.html", "country": "US", "domain_rank": 767, "title": "REV Group Acquires Lance Camper", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.995, "site_type": "news", "published": "2018-01-13T00:15:00.000+02:00", "replies_count": 0, "uuid": "5b688d671bc57bd28f9c0a25b49eaded2b17606f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/business-wire-rev-group-acquires-lance-camper.html", "ord_in_thread": 0, "title": "REV Group Acquires Lance Camper", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Acquisition Adds Comprehensive Towable Product Lineup to Enter Large, Rapidly Growing Segment and Expands REV’s Iconic Family of Brands\nMILWAUKEE--(BUSINESS WIRE)-- REV Group (NYSE: REVG), a $2.3 billion manufacturer of industry-leading specialty vehicle brands and leading provider of parts and services, today announced the acquisition of Lance Camper Manufacturing Corporation (“Lance Camper” or the “Company”). This acquisition enables REV to meaningfully enter the rapidly growing over $10 billion towables segment of the RV market by adding Lance Campers’ premium portfolio of truck campers, towable campers and toy haulers to REV’s existing suite of motorized offerings.\nFounded in 1965, Lance Camper designs, engineers and manufactures its lineup of innovative, high quality, and customer-centric products from its state-of-the-art campus in Lancaster, CA. Throughout its over 50-year history, the Company has built a tremendous reputation as a leader in the towable RV industry. Lance Camper has the number one selling truck camper in the U.S. and has won the National RV Dealer Association’s prestigious Quality Circle Award 16 years running. The Company employs over 550 associates and generates approximately $100 million in annual revenue.\nAfter the acquisition, Lance Camper will continue to be led by its innovative founders, Jack Cole and Jeff Souleles. “We’re thrilled to be joining REV’s iconic family of brands,” said Jack Cole, President of Lance Camper, “We look forward to leveraging REV’s scale and footprint in the RV industry to rapidly expand our distribution and further accelerate our growth. We’re an excellent fit given REV’s strong commitment to providing its dealers and customers with premium quality, brand leadership, and continuous innovation, all of which align well with our culture and ambition.”\n“We are absolutely delighted to welcome Jack, Jeff, and the entire Lance Camper team into the REV family,” said Tim Sullivan, REV Group CEO. “This acquisition is well aligned across all of our acquisition criteria. Lance Camper adds one of the highest quality towable lines in the U.S. and provides a significant new avenue of growth in our RV segment.”\nThe acquisition of Lance Camper was closed on January 12, 2018.\nAbout Rev Group\nREV (NYSE: REVG) is a leading designer, manufacturer and distributor of specialty vehicles and related aftermarket parts and services. We serve a diversified customer base primarily in the United States through three segments: Fire & Emergency, Commercial and Recreation. We provide customized vehicle solutions for applications including: essential needs (ambulances, fire apparatus, school buses, mobility vans and municipal transit buses), industrial and commercial (terminal trucks, cut-away buses and street sweepers) and consumer leisure (recreational vehicles (“RVs”) and luxury buses). Our brand portfolio consists of 30 well-established principal vehicle brands including many of the most recognizable names within our served markets. Several of our brands pioneered their specialty vehicle product categories and date back more than 50 years. Investors-REVG\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180112005618/en/\nREV Group\nSandy Bugbee. 1-888-738-4037 (1-888-REVG-037)\nVP, Treasurer and Investor Relations\ninvestors@revgroup.com\nSource: REV Group", "external_links": ["http://www.businesswire.com/news/home/20180112005618/en/"], "published": "2018-01-13T00:15:00.000+02:00", "crawled": "2018-01-13T02:07:35.097+02:00", "highlightTitle": ""}