{"organizations": [], "uuid": "c043a6eb3af41d2c060617069e1e5b0c59da3412", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180120&t=2&i=1223644226&w=1200&r=LYNXMPEE0J0J7", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/mideast-crisis-syria-turkey/turkey-air-strikes-hit-syrias-afrin-province-in-push-to-secure-borders-idINKBN1F90R2", "country": "US", "domain_rank": 408, "title": "Turkey air strikes hit Syria's Afrin province in push to secure borders", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T17:33:00.000+02:00", "replies_count": 0, "uuid": "c043a6eb3af41d2c060617069e1e5b0c59da3412"}, "author": "", "url": "https://in.reuters.com/article/mideast-crisis-syria-turkey/turkey-air-strikes-hit-syrias-afrin-province-in-push-to-secure-borders-idINKBN1F90R2", "ord_in_thread": 0, "title": "Turkey air strikes hit Syria's Afrin province in push to secure borders", "locations": [], "entities": {"persons": [{"name": "orhan coskun", "sentiment": "none"}, {"name": "ezgi erkoyun", "sentiment": "none"}, {"name": "tayyip erdogan", "sentiment": "none"}], "locations": [{"name": "turkey", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "ankara", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "pkk", "sentiment": "none"}, {"name": "min read  ankara", "sentiment": "none"}, {"name": "kurdistan workers party", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "free syrian army", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HASSA, Turkey/BEIRUT (Reuters) - Turkey opened a new front in Syria’s war on Saturday, launching airstrikes against a U.S.-backed Kurdish militia in Afrin province that raise the prospect of worsening relations between Ankara and NATO ally Washington.\nThe operation, which the Turks dubbed “Operation Olive Branch”, sees Ankara confronting Kurdish fighters allied to the United States at a time when ties between Turkey and Washington - both members of the coalition against Islamic State - appear dangerously close to a breaking point.\nThe attacks could also complicate Turkey’s push to improve its relationship with Russia. Moscow will demand in the United Nations that Turkey halt the operation, RIA news reported, citing a member of the Russian parliament’s security committee.\nThe Syrian government condemned what it called Turkish aggression and said Afrin was an intrinsic part of Syrian land.\n“We are carrying out this operation from land and air,” Foreign Minister Mevlut Cavusoglu told broadcaster NTV. He said the attacks were being carried out to target the Syrian-Kurdish YPG militia and that no civilians had been hurt.\n“In a situation like this our expectations from everyone and especially from our allies is that they side with us, not with terrorists,” he said, appearing to refer to Washington.\nSome 108 targests had been hit in airstrikes, the Turkish military said. A Turkey-backed rebel group in Syria, the Free Syrian Army, was also providing assistance to the operation in Afrin, a senior Turkish official said.\nThe YPG said the attacks left it with no choice but to fight back, saying Ankara had hit civilian neighbourhoods and a number of people had been wounded.\n“We will defeat this aggression, like we have defeated other such assaults against our villages and cities,” the YPG said.\nRojhat Roj, a YPG media official in Afrin, said warplanes pounded parts of Afrin city and villages around it, while there were skirmishes with Turkish forces and their rebel allies at the edge of Afrin.\nHevi Mustafa, a top member of the civilian administration that governs Afrin, said people were holed up in shelters and homes and several wounded people had arrived in hospitals.\nAuthorities in the Afrin region and war monitors say at least a million people live in the Afrin canton. Many of them are displaced from other areas.\nBORDER STRIKES\nSmoke rises from the Syria's Afrin region, as it is pictured from near the Turkish town of Hassa, on the Turkish-Syrian border in Hatay province, Turkey January 20, 2018. REUTERS/Osman Orsal Reuters cameramen in Hassa, near the border with Syria, heard the sound of heavy bombardment and saw thick plumes of smoke rising from the Syrian side of the border. The warplanes appeared to be striking from the Turkish side of the border, one of the cameramen said.\nThe attacks follow weeks of warnings against the YPG in Syria from President Tayyip Erdogan and his ministers. Turkey considers the YPG to be an extension of the outlawed Kurdistan Workers Party (PKK), which has carried out a deadly, three-decade insurgency in Turkey’s mainly Kurdish southeast.\nTurkey has been particularly outraged by an announcement that the United States planned to train 30,000 personnel in a part of eastern Syria under the control of the YPG-spearheaded Syrian Democratic Forces.\nTurkish officials have said the operation is likely to continue toward Manbij, further east. They also said that thousands of pro-Turkey civilians had escaped the YPG-controlled areas in an attempt to reach Aleppo.\nHowever, the Syrian Observatory for Human Rights, a U.K-based monitoring organisation said it was not true that people were fleeing en-masse.\nSlideshow (2 Images) GROWING STRENGTH The YPG’s growing strength across large parts of northern Syria has alarmed Ankara, which fears the creation of an independent Kurdish state on its southern border. Syrian Kurdish leaders say they seek autonomy as part of Syria, not secession.\nThe Turkish military said its Afrin operation was to provide safety for Turkey’s border and to “eliminate terrorists... and save friends and brothers, the people of the region, from their cruelty.”\n“We will destroy the terror corridor gradually as we did in Jarabulus and Al-Bab operations, starting from the west,” Turkey’s Erdogan said, referring to previous operations in northern Syria designed to push out Islamic State and check the YPG’s advance.\nEarlier on Saturday, the military said it hit shelters and hideouts used by the YPG and other Kurdish fighters, saying Kurdish militants had fired on Turkish positions inside Turkey.\nBut the U.S.-backed Syrian Democratic Forces - which the YPG spearheads - accused Turkey on Saturday of using cross-border shelling as a false pretext to launch an offensive in Syria.\nDifferences over Syria policy have further complicated Turkey’s already difficult relationship with NATO ally the United States. Washington has backed the YPG, seeing it as an effective partner in the fight against Islamic State.\nA U.S. State Department official on Friday said military intervention by Turkey in Syria would undermine regional stability and would not help protect Turkey’s border security.\nInstead, the United States has called on Turkey to focus on the fight against Islamic State. Ankara accuses Washington of using one terrorist group to fight another in Syria.\nAdditional reporting by Osman Orsal in Hassa; Orhan Coskun, Tulay Karadeniz, Gulsen Solaker and Tuvan Gumrukcu in Ankara; Omer Berberoglu, Ezgi Erkoyun in Istanbul; Writing by David Dolan, Editing by William Maclean\n ", "external_links": [], "published": "2018-01-20T17:33:00.000+02:00", "crawled": "2018-01-20T17:45:10.009+02:00", "highlightTitle": ""}