{"organizations": [], "uuid": "1ecc4fe290bb0c0640aa4687a0016913990a15fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-rexford-industrial-acquires-four-industrial-properties-for-62-point-7-million-sells-one-property-for-2-point-4-million.html", "country": "US", "domain_rank": 767, "title": "Rexford Industrial Acquires Four Industrial Properties For $62.7 Million; Sells One Property For $2.4 Million", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T00:05:00.000+02:00", "replies_count": 0, "uuid": "1ecc4fe290bb0c0640aa4687a0016913990a15fd"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-rexford-industrial-acquires-four-industrial-properties-for-62-point-7-million-sells-one-property-for-2-point-4-million.html", "ord_in_thread": 0, "title": "Rexford Industrial Acquires Four Industrial Properties For $62.7 Million; Sells One Property For $2.4 Million", "locations": [], "entities": {"persons": [{"name": "howard schwimmer", "sentiment": "none"}, {"name": "michael frankel", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "southern california", "sentiment": "none"}], "organizations": [{"name": "rexford industrial acquires four industrial properties", "sentiment": "negative"}, {"name": "rexford industrial realty, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES, Jan. 4, 2018 /PRNewswire/ -- Rexford Industrial Realty, Inc. (the \"Company\" or \"Rexford Industrial\") (NYSE: REXR), a real estate investment trust focused on owning and operating industrial properties located in Southern California infill markets, today announced the acquisition of a four property industrial portfolio for approximately $62.7 million. The acquisitions were completed during the fourth quarter of 2017 and were funded using cash on hand, draws on the Company's line of credit and proceeds from a $2.4 million disposition.\n\"These acquisitions contribute 416,843 square feet of 100% leased product in prime, supply-constrained infill Southern California with favorable NOI growth potential as below-market in-place leases roll over the next twenty months,\" stated Howard Schwimmer and Michael Frankel, Co-Chief Executive Officers of the Company. \"As we continue to capitalize upon our regional consolidation opportunity, we closed the year with $667 million of acquisitions and recycled approximately $99 million of capital through dispositions. Driven by our proprietary, research-driven acquisition platform, we continue to generate attractive opportunities to acquire value-add and leased industrial property as we execute our internal and external growth strategies focused on driving cash flow and shareholder value.\"\nThe Company acquired 302 S. Rockefeller Avenue and 4355 E. Brickell Street, located in Ontario in the Inland Empire – West submarket for $14.5 million or $146 per square foot and $13.1 million or $137 per square foot, respectively. The S. Rockefeller Avenue property contains 99,282 square feet on 5.34 acres of land, and the E. Brickell Street property contains 95,644 square feet on 5.76 acres of land. Both Class A single tenant industrial buildings are 100% leased, offer 30-foot warehouse clearance, modern functionality and a favorable number of dock high loading positions. Both properties are currently leased at below-market rents and are located proximate to the I-10, I-60, and I-15 freeways. According to CBRE, the vacancy rate in the 285 million square foot Inland Empire – West submarket was 1.7% at the end of the third quarter 2017.\nThe Company also acquired 12622-32 Monarch Street, located in Garden Grove in the Orange County – West submarket for $20.5 million or $169 per square foot. The property comprises two high-quality industrial buildings totaling 121,225 square feet on 5.95 acres which are currently 100% leased to three tenants at below market rates. Monarch Street features a favorable ratio of dock-high loading positions, a large yard and 26-foot warehouse clearance. According to CBRE, the vacancy rate in the 41 million square foot Orange Country – West submarket was 0.6% at the end of the third quarter 2017.\nIn addition, the Company acquired 8315 Hanan Way, located in Pico Rivera in the Los Angeles - Central submarket for $14.5 million, or $144 per square foot. The single tenant industrial building contains 100,692 square feet on 4.43 acres of land and is 100% leased on a long-term basis to an entrenched tenant in the packaging manufacturing industry. The property features 24-foot minimum warehouse clearance, recently modernized offices and nine dock-high loading positions. According to CBRE, the vacancy rate in the 287 million square foot Los Angeles – Central submarket was 1.6% at the end of the third quarter 2017.\nThe Company sold 77-700 Enfield Lane in Palm Desert in the Inland Empire-East submarket for approximately $2.4 million or $113 per square foot. The multi-tenant industrial building was 74% occupied and contains 21,607 square feet on 1.61 acres of land. The property was sold to a private investor. Proceeds from the disposition were recycled in a tax deferred 1031 exchange to fund a portion of the Monarch Street acquisition. In 2017, the Company completed a total of approximately $98.7 million of dispositions with all sale proceeds recycled through 1031 exchanges to fund concurrent acquisitions.\nAbout Rexford Industrial\nRexford Industrial is a real estate investment trust focused on owning and operating industrial properties in Southern California infill markets. The Company owns 151 properties with approximately 18.5 million rentable square feet and manages an additional 19 properties with approximately 1.2 million rentable square feet.\nFor additional information, visit www.rexfordindustrial.com .\nForward-Looking Statements\nThis press release may contain within the meaning of the federal securities laws, which are based on current expectations, forecasts and assumptions that involve risks and uncertainties that could cause actual outcomes and results to differ materially. Forward-looking statements relate to expectations, beliefs, projections, future plans and strategies, anticipated events or trends and similar expressions concerning matters that are not historical facts. In some cases, you can identify by the use of forward-looking terminology such as \"may,\" \"will,\" \"should,\" \"expects,\" \"intends,\" \"plans,\" \"anticipates,\" \"believes,\" \"estimates,\" \"predicts,\" or \"potential\" or the negative of these words and phrases or similar words or phrases which are predictions of or indicate future events or trends and which do not relate solely to historical matters. While reflect the Company's good faith beliefs, assumptions and expectations, they are not guarantees of future performance. For a further discussion of these and other factors that could cause the Company's future results to any , see the reports and other filings by the Company with the U.S. Securities and Exchange Commission, including the Company's Annual Report on Form 10-K for the year ended December 31, 2016. The Company disclaims any obligation to publicly update or revise any forward-looking statement to reflect changes in underlying assumptions or factors, of new information, data or methods, future events or other changes.\nContact:\nInvestor Relations:\nStephen Swett\n424 256 2153 ext. 401\ninvestorrelations@rexfordindustrial.com\nView original content: http://www.prnewswire.com/news-releases/rexford-industrial-acquires-four-industrial-properties-for-627-million-sells-one-property-for-24-million-300577859.html\nSOURCE Rexford Industrial Realty, Inc.", "external_links": ["http://www.rexfordindustrial.com/", "http://www.prnewswire.com/news-releases/rexford-industrial-acquires-four-industrial-properties-for-627-million-sells-one-property-for-24-million-300577859.html"], "published": "2018-01-05T00:05:00.000+02:00", "crawled": "2018-01-05T01:34:16.000+02:00", "highlightTitle": ""}