{"organizations": [], "uuid": "fbd4e4c72518b3e6319cc393f4879f714366178b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-masonite-international-corporation-announces-acquisition-of-dw3-products-holding-limited.html", "country": "US", "domain_rank": 767, "title": "Masonite International Corporation Announces Acquisition of DW3 Products Holding Limited", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-30T16:00:00.000+02:00", "replies_count": 0, "uuid": "fbd4e4c72518b3e6319cc393f4879f714366178b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-masonite-international-corporation-announces-acquisition-of-dw3-products-holding-limited.html", "ord_in_thread": 0, "title": "Masonite International Corporation Announces Acquisition of DW3 Products Holding Limited", "locations": [], "entities": {"persons": [{"name": "tony hair", "sentiment": "none"}], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "tampa", "sentiment": "none"}, {"name": "residor", "sentiment": "none"}, {"name": "stoke-on-trent", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "gloucester", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "nicedor", "sentiment": "none"}], "organizations": [{"name": "masonite international corporation", "sentiment": "negative"}, {"name": "masonite international corporation announces acquisition of dw3 products holding limited", "sentiment": "negative"}, {"name": "dw3 products holding limited", "sentiment": "none"}, {"name": "masonite", "sentiment": "none"}, {"name": "solidor", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TAMPA, Fla.--(BUSINESS WIRE)-- Masonite International Corporation (NYSE:DOOR) today announced that it has completed the acquisition of DW3 Products Holding Limited (“DW3”), a leading UK provider of high quality premium door solutions and window systems, supplying products under brand names such as Solidor, Residor, Nicedor, and Residence. Solidor utilizes a leading online offering, including a door designer and a specialized online portal, which allows trade customers to specify and purchase products online.\nDW3 employs approximately 300 people located in Stoke-on-Trent and Gloucester, England. DW3’s net sales for the twelve months ended December 2017 were approximately £45 million. The purchase price for all of DW3’s outstanding shares was approximately £70 million, net of cash acquired and subject to customary post-closing adjustments.\n“DW3 fits exceptionally well with Masonite’s existing business in the UK,” said Tony Hair, Masonite’s President, Global Residential. “Their online quick ship capabilities and product portfolio both complement and expand the strategies we are pursuing in this important market.”\n“DW3’s products and service model are a natural addition to Masonite’s business, and Masonite is an excellent cultural fit for our company,” said Gareth Mobley, CEO of DW3. “We are excited about the opportunities this will bring our employees and customers.”\nMasonite expects the acquisition to be immediately accretive to adjusted EBITDA margin and adjusted EPS in 2018. DW3 is Masonite’s eighth acquisition in the last four years, and the fourth in the UK during that period.\nAbout Masonite\nMasonite International Corporation is a leading global designer and manufacturer of interior and exterior doors for the residential new construction; the residential repair, renovation and remodeling; and the non-residential building construction markets. Since 1925, Masonite has provided its customers with innovative products and superior service at compelling values. Masonite serves more than 7,000 customers in 65 countries. Additional information about Masonite can be found at www.masonite.com .\nForward-looking Statements\nThis press release may contains forward-looking information and other forward-looking statements within the meaning of applicable Canadian and/or U.S. securities laws, including information related to the expected financial impact of the acquisition of DW3 Products Holding Limited. When used in this press release, such forward-looking statements may be identified by the use of such words as “may,” might, “could,” “will,” would,” “should,” “expect,” “believes,” “outlook,” “predict,” “forecast,” “objective,” “remain,” “anticipate,” “estimate,” “potential,” “continue,” “plan,” “project,” “targeting,” or the negative of these terms or other similar terminology. Forward-looking statements involve significant known and unknown risks, uncertainties and other factors that may cause the actual results, performance or achievements of Masonite, or industry results, to be materially different from any future plans, goals, targets, objectives, results, performance or achievements expressed or implied by such forward-looking statements. As a result, such forward-looking statements should not be read as guarantees of future performance or results, should not be unduly relied upon, and will not necessarily be accurate indications of whether or not such results will be achieved. Factors that could cause actual results to differ materially from the results discussed in the forward-looking statements include, but are not limited to, our ability to successfully integrate the products, employees and operations of DW3, as well as the ability to ensure continued performance of DW3's products; the potential that the expected benefits and opportunities of the transaction may not be realized or may take longer to realize than expected; general economic, market and business conditions; competition; increases in the costs of raw materials or any shortage in supplies; the actions by, and the continued success of, certain key customers; our ability to maintain relationships with certain customers; retention of key management personnel; and other factors publicly disclosed by the company in its Form 10-K for fiscal 2016 and subsequent 10-Qs filed with the SEC.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180130005258/en/\nMasonite International Corporation\nJoanne Freiberger, CPA, CTP, IRC, 813-739-1808\nVP, TREASURER\njfreiberger@masonite.com\nor\nBrian Prenoveau, CFA, 813-371-5839\nDIR. INVESTOR RELATIONS\nbprenoveau@masonite.com\nSource: Masonite International Corporation", "external_links": ["http://www.businesswire.com/news/home/20180130005258/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.masonite.com&esheet=51750513&newsitemid=20180130005258&lan=en-US&anchor=www.masonite.com&index=1&md5=94c50c63f7447238f88880d09791c4b9"], "published": "2018-01-30T16:00:00.000+02:00", "crawled": "2018-01-30T17:46:24.014+02:00", "highlightTitle": ""}