{"organizations": [], "uuid": "a88cf377004c92287311e2d201b84b9c99a37c69", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-donna-troy-and-michael-klayko-to-join-tibco-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Donna Troy and Michael Klayko to Join TIBCO Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T16:00:00.000+02:00", "replies_count": 0, "uuid": "a88cf377004c92287311e2d201b84b9c99a37c69"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-donna-troy-and-michael-klayko-to-join-tibco-board-of-directors.html", "ord_in_thread": 0, "title": "Donna Troy and Michael Klayko to Join TIBCO Board of Directors", "locations": [], "entities": {"persons": [{"name": "donna troy", "sentiment": "negative"}, {"name": "michael klayko", "sentiment": "negative"}, {"name": "murray rode", "sentiment": "none"}, {"name": "klayko", "sentiment": "none"}, {"name": "troy", "sentiment": "none"}], "locations": [{"name": "palo alto", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "epicor", "sentiment": "none"}], "organizations": [{"name": "tibco software inc.", "sentiment": "negative"}, {"name": "tibco", "sentiment": "negative"}, {"name": "dell", "sentiment": "none"}, {"name": "sap", "sentiment": "none"}, {"name": "ibm", "sentiment": "none"}, {"name": "mcafee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PALO ALTO, Calif., Jan. 9, 2018 /PRNewswire/ -- TIBCO Software Inc. , a global leader in integration, API management, and analytics, today announced the appointment of Donna Troy and Michael Klayko to its board of directors. Troy and Klayko each bring to TIBCO extensive executive experience in a diverse range of technology domains.\n\"Donna Troy and Michael Klayko are exemplary leaders in their fields, each with proven track records of driving business growth,\" said Murray Rode, chief executive officer, TIBCO. \"We look forward to benefitting from their experience and expertise as we continue to grow and evolve TIBCO.\"\nTroy has held executive roles throughout her career with industry-leading companies, including IBM, McAfee, SAP, Dell, and Epicor Software, where her demonstrated global leadership and general management experience drove success for several business units and groups. As executive vice president and general manager at Epicor from 2013 until 2015, she delivered year-over-year margin growth alongside a sustainable go-to-market strategy. During her time in executive channel roles at SAP from 2004 to 2007, she drove a 20% increase in revenue and a 33% growth in new customer acquisition. Troy is currently a director on the board of Pivot3, a hyperconverged infrastructure provider; an advisory board member at Kony, an enterprise mobility solutions provider; and a member of the technology advisory board at the private equity firm Riverside Partners, LLC.\n\"TIBCO's history of creating and delivering innovative solutions to meet the changing demands of its customer base attracted me to the organization,\" said Troy. \"I'm excited to work with this team to reach more customers, especially through TIBCO's evolving partner ecosystem.\"\nKlayko has diverse and broad experience in growing companies into global leaders in their industries. He served as the chief executive officer and president of Rhapsody Networks from 2001 to 2003, growing the company from a start-up to an industry-standard for router technology. Brocade Communication Systems, Inc. purchased Rhapsody, and Klayko went on to become CEO of Brocade. During his tenure as CEO from 2005 to 2013, Klayko grew Brocade's revenue from $574 million to $2.3 billion. Since 2013, Klayko has been managing partner at MKA Capital LLC. Currently, he also serves as chairman of the board at AllScripts Healthcare Solutions and as a member of the boards of Cyrus One and Egnyte, Inc.\n\"TIBCO is a company at the forefront of solutions for forward-thinking businesses,\" said Klayko. \"I look forward to helping build on the success of TIBCO's advanced product portfolio for digital business.\"\nAbout TIBCO\nTIBCO fuels digital business by enabling better decisions and faster, smarter actions through the TIBCO Connected Intelligence Cloud. From APIs and systems to devices and people, we interconnect everything, capture data in real time wherever it is, and augment the intelligence of your business through analytical insights. Thousands of customers around the globe rely on us to build compelling experiences, energize operations, and propel innovation. Learn how TIBCO makes digital smarter at www.tibco.com .\nTIBCO and the TIBCO logo are trademarks or registered trademarks of TIBCO Software Inc. and/or its subsidiaries in the United States and/or other countries. All other product and company names and marks mentioned in this document are the property of their respective owners and are mentioned for identification.\nMedia Contact:\nLindsey Ashjian Torres\nTIBCO Software Inc.\n(650) 846-8862\npublicrelations@tibco.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/donna-troy-and-michael-klayko-to-join-tibco-board-of-directors-300579593.html\nSOURCE TIBCO Software Inc.", "external_links": ["http://www.tibco.com/", "http://www.prnewswire.com/news-releases/donna-troy-and-michael-klayko-to-join-tibco-board-of-directors-300579593.html"], "published": "2018-01-09T16:00:00.000+02:00", "crawled": "2018-01-09T17:50:53.004+02:00", "highlightTitle": ""}