{"organizations": [], "uuid": "27e46f57258300ea37a98e04d45f8115d883d9c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/britain-economy-housingstarts/uk-housing-starts-hit-10-year-high-in-2017-nhbc-idUSL8N1PJ683", "country": "US", "domain_rank": 408, "title": "UK housing starts hit 10-year high in 2017 - NHBC", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T02:01:00.000+02:00", "replies_count": 0, "uuid": "27e46f57258300ea37a98e04d45f8115d883d9c8"}, "author": "", "url": "https://www.reuters.com/article/britain-economy-housingstarts/uk-housing-starts-hit-10-year-high-in-2017-nhbc-idUSL8N1PJ683", "ord_in_thread": 0, "title": "UK housing starts hit 10-year high in 2017 - NHBC", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "national house-building council", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON, Jan 25 (Reuters) - British construction companies had their best year in decade for starting work on new homes in 2017 and the outlook for 2018 is positive, an industry body said on Thursday.\nPrime Minister Theresa May wants construction of new homes to rise to 300,000 a year to tackle a shortage of housing.\nThe National House-Building Council said builders registered plans to start 160,606 new homes, up 6 percent from 2016 and the highest number since the start of the financial crisis in 2007.\nCompletions rose 4 percent to 147,278, the most since 2008.\nBritish house-building halved after property prices fell by around a fifth during the financial crisis and has only risen slowly since, helped by government incentives to subsidise first-time buyers’ purchases of newly built homes.\nLast year’s rate of housing starts was slightly above the average of the past 45 years, albeit below government targets.\nUnlike Ireland, Spain and parts of the United States, Britain did not have a housing construction boom before the financial crisis. Tight planning rules and a shortage of skilled workers remain a key constraint.\nSteve Wood, NHBC’s chief executive, said he expected housing starts to rise further in 2018.\n“If the economy is sound, the housing market is sound,” he said. “I know there is a bit of an argument about whether we are going to lag behind global growth. But if we are still going to get growth, we will get growth in housing as well.”\nEconomists polled by Reuters on average expect economic growth of 1.4 percent in 2018 - weak by international standards but still better than some of the gloomier forecasts made after Britain voted to leave the European Union in June 2016.\nWood said construction workers - many of whom moved to Britain from eastern Europe - were becoming harder to find, but there was no sign of housing investment drying up ahead of Britain’s scheduled departure from the EU in March 2019.\nHousing starts rose by nearly 20 percent in Wales and parts of central England, and crept up by 1 percent in London - the first rise in the British capital since 2014. (Reporting by David Milliken; Editing by William Schomberg)\n ", "external_links": [], "published": "2018-01-25T02:01:00.000+02:00", "crawled": "2018-01-25T02:29:09.032+02:00", "highlightTitle": ""}