{"organizations": [], "uuid": "dcc430f5fe6ac20b2a7708c3897a52d923c19385", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-usa-brazil-arms/u-s-biggest-source-of-illegal-foreign-guns-in-brazil-report-idUKKBN1EZ2M3", "country": "US", "domain_rank": 408, "title": "U.S. biggest source of illegal foreign guns in Brazil - report", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T21:35:00.000+02:00", "replies_count": 0, "uuid": "dcc430f5fe6ac20b2a7708c3897a52d923c19385"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-brazil-arms/u-s-biggest-source-of-illegal-foreign-guns-in-brazil-report-idUKKBN1EZ2M3", "ord_in_thread": 0, "title": "U.S. biggest source of illegal foreign guns in Brazil - report", "locations": [], "entities": {"persons": [{"name": "ricardo brito", "sentiment": "none"}, {"name": "lisandra paraguassu", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "rio de janeiro", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "min read  brasilia", "sentiment": "none"}, {"name": "brazilian federal police", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 7:37 PM / Updated 2 hours ago U.S. biggest source of illegal foreign guns in Brazil - report Lisandra Paraguassu , Ricardo Brito 4 Min Read \nBRASILIA (Reuters) - The United States is the largest source of guns entering Brazil that end up in the hands of armed bandits and drug traffickers, according to a Brazilian Federal Police report seen by Reuters. \nRoughly 1,500 guns originated in the United States out of a study of more than 10,000 arms seized by police since 2014, mostly in Rio de Janeiro, the December 2017 report said, although the guns often travelled through a third country before arriving in Brazil. \nGuns from the United States tended to be assault rifles and higher caliber handguns, while guns already circulating in Brazil or arriving from other countries skewed toward smaller handguns. \n“The US continues to be the largest indirect source of illegal handguns and assault rifles as a result of unrestricted sales in stores and fairs in American cities,” the report said. \nViolence fuelled by illegal guns has spiked in Brazil as a deep recession from 2015 to 2017 led to funding cuts for many police forces around the country. The federal government sent troops to Rio de Janeiro and other areas last year to quell violence generally related to the drug trade. \nThe report calls for international bodies such as the United Nations and the Mercosur trade bloc to offer more support to stop illegal arms trafficking, as well as for more bilateral agreements such as a 2006 deal between Brazil and Paraguay to cooperate in combating the arms trade. \nEight foreign stores are named selling the most high caliber guns that ended up in Brazil, with five located in Florida, although a store in Paraguay was the largest individual seller. \nGuns from the United States generally enter Brazil through direct shipments of assembled weapons, shipments of gun parts or indirect shipments through a third country, with Paraguay being the top intermediary. \nOutside the military, Brazilians can legally own guns only if they meet a series of stiff checks and even then can buy only small caliber weapons. In these instances, guns are allowed for rural residents who need them for daily subsistence, hunters and those who can prove they need a gun for self-defence. \nWhile laws on gun purchases in the United States vary from state to state and also depend on the type of weapon being sold, it can be a fairly simple process to buy a gun, or to acquire one that was legally sold to another person. \nWhile the overwhelming majority of guns entered over land, the report detailed an instance of 22 assault rifles sent to Brazil in a shipment of furniture, having been sewn into mattresses, with most ending up in Sao Paulo and Rio. \nIn another incident, 60 assault rifles that originated in Miami were discovered inside pool heaters in a cargo shipment at a Rio airport. \nThe entry of high caliber arms into the country is associated with gangs carrying out robberies of banks, ATMs and armoured cars as the criminals want to guarantee they will have superior fire power in a confrontation with the police or armed guards, according to the report. Reporting by Lisandra Paraguassu and Ricardo Brito; Writing by Jake Spring; Editing by Frances Kerry", "external_links": [], "published": "2018-01-10T21:35:00.000+02:00", "crawled": "2018-01-10T21:52:26.000+02:00", "highlightTitle": ""}