{"organizations": [], "uuid": "19d5d1355a6bde5104e0f3d974ede542fa083383", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/cnbc-interview-with-deloitte-ceo-punit-renjen-from-the-world-economic-forum-2018.html", "country": "US", "domain_rank": 767, "title": "CNBC Interview with Deloitte CEO, Punit Renjen, from the World Economic Forum 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T09:12:00.000+02:00", "replies_count": 0, "uuid": "19d5d1355a6bde5104e0f3d974ede542fa083383"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/cnbc-interview-with-deloitte-ceo-punit-renjen-from-the-world-economic-forum-2018.html", "ord_in_thread": 0, "title": "CNBC Interview with Deloitte CEO, Punit Renjen, from the World Economic Forum 2018", "locations": [], "entities": {"persons": [{"name": "akiko fujita", "sentiment": "negative"}, {"name": "punit renjen", "sentiment": "negative"}, {"name": "nancy", "sentiment": "none"}, {"name": "deloitte", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}], "organizations": [{"name": "cnbc interview", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "negative"}, {"name": "deloitte", "sentiment": "negative"}, {"name": "imf", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Following are excerpts from a CNBC interview with Punit Renjen, Deloitte CEO and CNBC's Akiko Fujita from the World Economic Forum 2018.\nAF: Hi there, Nancy. And now we are joined by Punit Renjen, who is, of course, the CEO of Deloitte. Punit, great to have you on today, you know, we were just talking about, you know, how the sentiment is on the ground here. I mean, the IMF put out a report that estimates 1.5% growth in the world's biggest economies. We haven't seen that kind of synchronized growth in a while. What's your sense, in the conversations you've had here, about the optimism that's fuelling this, and perhaps some of the risks that are being overlooked right now?\nPR: I think that's a great question. First, thank you for having me. I've been coming to Davos for a number of years, and I haven't seen, as you said, this level of positivity, in a synchronized way, across the world. And that certainly focuses us to be cautious. I believe that, other than the fiscal and the monetary side of it, there is now an acknowledgement that the Fourth Industrial Revolution, which is the confluence of the physical and the digital world, is here to stay. And the potential from the Fourth Industrial Revolution is huge. And that's what our readiness report, that we conducted, that had 1,600 C-level executives, from 19 different countries, pointed to. Here's an interesting statistic. 87% of them, 87% of them said that the Fourth Industrial Revolution would enable them towards a more stable, more equitable world, which I thought was remarkable.\nAF: You know, when we hear about the industrial revolution, and perhaps you mix in the tech revolution, with that, as well, there's always concern about automation, and whether that's taking away from jobs, and the use of artificial intelligence. What does your report suggest, about the concerns around that, among those who were surveyed, and how companies are incorporating this technology to improve efficiency?\nPR: Yes. The Fourth Industrial Revolution, from our perspective, certainly is enabled by technology. AI, cognitive, Cloud, etc. But it is also enabled by new business models, and new ways of doing work. Every revolution has changed the way work gets done. People get impacted, there is no doubt about that. But it has always been expansionary. What this readiness report suggests is the following. While there's great optimism, there's also, by the way, 66% of the CEOs believe that public companies will play a bigger role than governments. But what we did find was that 14% of them believe that their organization is not ready to embrace what the Fourth Industrial Revolution entails.\nAF: Mm. And when you say public companies are expected to take a bigger role, does that come from the distrust of government? Because there are several reports that we've addressed this week, that really highlights that, especially in the US.\nPR: Well, I think it comes from the fact that this revolution enables giving back to society in ways that maybe previous ones didn't. So, for instance, in terms of social impact, everybody believes that this revolution is going to bring-, to lead to greater stability, and greater equality. 25%, by the way, believe that their organization, while it's going to play a bigger role, is not ready to generate the social impact that is required. So, it's a real dichotomy. One other key statistic. Talent is going to play a critical role, your question suggested that, but only 25% of the executives that we surveyed, 1,600 of them, in 19 countries, suggested that their organization has the right talent, and the right processes, to harness the talent, to be able to take advantage of the Fourth Industrial Revolution.\nAF: So, how is Deloitte preparing for that?\nPR: Well, it's fascinating. Let's take one element, social impact. You can't boil the ocean. For us, we believe that there are-, we know that there are about a billion people in this world that are-, are caught up in the cycle of poverty, and when you decompose that, it's all linked to education. We have committed, as an organization, that we are going to impact 50 million futures, through leveraging our 265,000 professionals, our most prized asset, across the globe. Now, will that solve the entire problem around poverty? No. But it will make a make a contribution.\nAF: The focus here, at Davos, going in to Friday, will, of course, be President Trump's speech. We've heard several\nworld leaders already speak, in perhaps what is already a rebuttal to what we are expecting the President to say, which is push forward his America First policy. We know what the expectations are. What do you think he should say, given the crowd here at Davos?\nPR: I think he should certainly-, I think he will talk about the accomplishments of the past year, the Tax Reform Act, the first time in 30 years, I think that is a major accomplishment, and I think he will talk about America's role going forward, which I think would be very welcome.\nAF: Mm. Keep it positive.\nPR: Yes.\nAF: Alright, we'll leave it on that note. Punit Renjen joining me here, from Davos.\nENDS", "external_links": [], "published": "2018-01-24T09:12:00.000+02:00", "crawled": "2018-01-24T09:37:12.080+02:00", "highlightTitle": ""}