{"organizations": [], "uuid": "6f86c9eeb9b8590976160126e53271d944ec7a85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/subjects/euro-zone", "section_title": "Euro Zone | Reuters.com", "url": "https://www.reuters.com/article/us-eu-argentina-biodiesel/eu-launches-subsidy-inquiry-in-argentine-biodiesel-idUSKBN1FK0SF", "country": "US", "domain_rank": 408, "title": "EU launches new trade inquiry into Argentine biodiesel", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-31T15:36:00.000+02:00", "replies_count": 0, "uuid": "6f86c9eeb9b8590976160126e53271d944ec7a85"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-eu-argentina-biodiesel/eu-launches-subsidy-inquiry-in-argentine-biodiesel-idUSKBN1FK0SF", "ord_in_thread": 0, "title": "EU launches new trade inquiry into Argentine biodiesel", "locations": [], "entities": {"persons": [{"name": "arnaud rousseau", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "france", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "european commission", "sentiment": "negative"}, {"name": "european biodiesel board", "sentiment": "none"}, {"name": "fop", "sentiment": "none"}, {"name": "commission", "sentiment": "none"}, {"name": "saipol", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BRUSSELS (Reuters) - The European Commission has begun a new investigation into whether Argentine biodiesel exporters benefit from unfair subsidies, following a complaint in December by the European Biodiesel Board (EBB).\nThe EU’s official journal said on Wednesday that the Commission had found the complaint contained evidence that Argentine producers had benefited from government subsidies.\nThese came in the form of artificially cheap goods and services, such as soybeans, excessively high prices paid for the biodiesel or price support, preferential loans and government revenue, such as tax, foregone or not collected, it said.\n“I hope the Commission will go as fast as possible in its investigation, because every day makes things more difficult on the ground,” Arnaud Rousseau, president of French oilseed producer group FOP said.\nOilseed processor Saipol has said it plans to cut its biodiesel production in France by around half this year, blaming renewed imports of Argentine biodiesel for exacerbating poor market conditions.\nThe EU’s new investigation would offer another channel for imposing effective tariffs on imported biodiesel as Argentina, and Indonesia, both major producers, have mounted successful challenges to anti-dumping duties, which the European Union set for five years in 2013.\nArgentina and Indonesia have called the trade measures protectionist.\nThe General Court of the European Union, the second-highest EU court, delivered a series of rulings in September 2016 to annul those duties. The EU initially appealed the ruling, but decided last week to withdraw that appeal.\nArgentina and Indonesia have also both won cases at the World Trade Organization.\nThe European Commission cut the anti-dumping duties for Argentinean biodiesel last year to between 4.5 and 8.1 percent from initial rates of 22-25.7 percent. The rates for Indonesia remain those set in 2013 - between 8.8 and 20.5 percent.\nFrench producers are now concerned the EU decision will also lower duties on imports of Indonesian biodiesel.\nThe European Union’s case was based on export duties both countries impose on the raw material, soybeans in the case of Argentina and palm oil for Indonesia. The EU view was that this gave an unfair advantage to biodiesel producers there, allowing them to “dump” product at unfairly low prices.\nThe EBB said in its latest complaint that the flow of subsidized imports was likely to increase because of the reduced anti-dumping tariffs and the recent imposition of duties of more than 70 percent by the United States.\nEU anti-subsidy investigations last up to 13 months, with the possibility of applying provisional duties after nine.\nReporting by Philip Blenkinsop; additional reporting by Sybille de la Hamaide in Paris; editing by Robert-Jan Bartunek and Alexander Smith\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-31T15:36:00.000+02:00", "crawled": "2018-01-31T17:45:22.001+02:00", "highlightTitle": ""}