{"organizations": [], "uuid": "6507f8489cbc323c8937c7cc060a33f8760df177", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/bonds", "section_title": "Bonds News | Reuters.com", "url": "https://www.reuters.com/article/eurozone-bonds/update-1-spain-germany-bond-yield-gap-at-lowest-in-half-a-year-as-ratings-upgrade-eyed-idUSL8N1PE2KS", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Spain-Germany bond yield gap at lowest in half a year as ratings upgrade eyed", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.016, "site_type": "news", "published": "2018-01-19T19:47:00.000+02:00", "replies_count": 0, "uuid": "6507f8489cbc323c8937c7cc060a33f8760df177"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/eurozone-bonds/update-1-spain-germany-bond-yield-gap-at-lowest-in-half-a-year-as-ratings-upgrade-eyed-idUSL8N1PE2KS", "ord_in_thread": 0, "title": "UPDATE 1-Spain-Germany bond yield gap at lowest in half a year as ratings upgrade eyed", "locations": [], "entities": {"persons": [{"name": "abhinav ramnarayan", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "fitch ratings", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Spanish debt rallies on potential Fitch upgrade\n* Spain/Germany yield spread narrows to 94 bps\n* High-grade euro zone yields flat to a touch higher\n* Euro zone periphery govt bond yields tmsnrt.rs/2ii2Bqr (Rewrites top, updates prices)\nBy Abhinav Ramnarayan\nLONDON, Jan 19 (Reuters) - The premium investors demand to hold Spanish government bonds over benchmark German debt dropped to its lowest in six months on Friday on expectations of a ratings upgrade that would give Spain its first “A” rating since the euro zone debt crisis.\nFitch Ratings is due to review Spain’s sovereign credit rating on Friday, and analysts expect a strengthening economy and declining political risk will lead it to upgrade it to “A-” from “BBB+”.\nThat would restore the country’s “A” status for the first time since 2012, the height of the euro zone debt crisis, when Spain was downgraded by all three main ratings agencies.\nOn Friday, when most high-grade euro zone bond yields were flat to a touch higher, Spain’s 10-year borrowing costs dropped 4 basis points to 1.45 percent.\nThat narrowed the gap between Spanish and German 10-year yields to 94 basis points, its tightest since July last year .\n“We now consider that there exists a slightly higher probability that Fitch will upgrade Spain by one notch than that it will reaffirm the BBB+ rating,” said BBVA strategist Jaime Costero Denche. “It is only a question of time before all the main rating agencies upgrade their ratings on Spain.”\nMoody’s rates Spain “Baa2”; S&P Global at “BBB+”.\nSpanish gross domestic product grew 3.1 percent in 2017, making it one of the best-performing economies in Europe, but concern over an independence bid by the region of Catalonia, kept it from being upgraded.\nU.S. 10-year Treasury yields climbed to 2.64 percent early on Friday, their highest in more than three years, as legislation to keep the federal government running hit obstacles in the Senate late on Thursday.\nAs a result high grade euro zone bond yields opened 1-2 bps higher, but they were broadly flat by 1130 GMT.\nGermany’s 10-year government bond yield, the benchmark for the euro zone, was marginally higher at 0.52 percent. .\nAt this level, it is not far from a 5-1/2 month high of 0.54 percent hit last week.\nAn improving global economy and expectations of central bank tightening have been pushing up the yields of most major developed country debt. The latest trigger has been faster-than-expected Chinese growth in the fourth quarter of 2017.\n“The market seems keen to test the 2.64 percent level in 10-year US Treasury yields, which has held repeatedly in recent years and is seen by some commentators as the dividing line to a bear market in bonds,” Commerzbank analysts said in a note.\nReporting by Abhinav Ramnarayan; Editing by Larry King and Robin Pomeroy\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://tmsnrt.rs/2ii2Bqr", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T19:47:00.000+02:00", "crawled": "2018-01-19T14:17:23.018+02:00", "highlightTitle": ""}