{"organizations": [], "uuid": "a1077ad46b4896f3e8802b76caed91ab383b34db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223416755&w=1200&r=LYNXMPEE0I1HX", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-nike-stocks/nike-at-two-year-high-as-analysts-tout-margin-benefits-of-direct-sales-idUSKBN1F82E1", "country": "US", "domain_rank": 408, "title": "Nike at two-year high as analysts tout margin benefits of direct sales", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T21:02:00.000+02:00", "replies_count": 0, "uuid": "a1077ad46b4896f3e8802b76caed91ab383b34db"}, "author": "", "url": "https://www.reuters.com/article/us-nike-stocks/nike-at-two-year-high-as-analysts-tout-margin-benefits-of-direct-sales-idUSKBN1F82E1", "ord_in_thread": 0, "title": "Nike at two-year high as analysts tout margin benefits of direct sales", "locations": [], "entities": {"persons": [{"name": "christopher svezia", "sentiment": "none"}], "locations": [], "organizations": [{"name": "nike", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "wedbush", "sentiment": "none"}, {"name": "amazon.com inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "nike inc", "sentiment": "none"}, {"name": "bernstein research", "sentiment": "none"}, {"name": "wedbush securities", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 7:03 PM / Updated 3 hours ago Nike at two-year high as analysts tout margin benefits of direct sales Reuters Staff 3 Min Read \n(Reuters) - Nike Inc’s ( NKE.N ) shares surged to a two-year high on Friday after two Wall Street brokerages said the footwear maker’s profitability would soon reap the benefits of its recent move to sell directly to consumers. \nNike’s shares jumped nearly 5 percent, set for their best day since June 30, 2017, when the company said it would sell more products directly through retailers such as Amazon.com Inc ( AMZN.O ) and its own stores, rather than through wholesalers. \nBernstein Research and Wedbush Securities said this direct-to-consumer (DTC) model would boost Nike’s margins once the plans were fully implemented and the business accounted for a larger chunk of total sales from the current 28 percent. \nIn fact, Wedbush estimated Nike’s overall gross margins would expand for the first time in 10 quarters in the March-May quarter. It upgraded Nike’s stock to “outperform.” \nAnalyst Christopher Svezia said the company’s results next fiscal would also get a boost from the launch of new shoe styles and easier comparison with last year, when it took a bit of a beating from weak demand in North America. \nBernstein estimated said Nike’s realized retail price was double its wholesale price, suggesting the gross profit contribution of each product it sold directly was more than three times higher than if sold through a wholesaler. \n“As Nike moves from a wholesale business to a more direct business, we believe there is clear margin upside from this shift,” analyst Jamie Merriman wrote in a note. \nMerriman estimated gross margins in Nike’s DTC business are 62 percent, compared with 38 percent in its wholesale business. \nNike’s overall gross margins could grow by as much as 3.3 percentage points by 2022, Merriman estimated, if the DTC business increased to about 42 percent of total revenue. \nThat growth would be even more if margins in its e-commerce business scale to those in its store business, Merriman said, who rates Nike’s stock “outperform.” \nThe company's shares were up 4.5 percent at $66.98, easily the top gainer on the bluechip Dow Jones Industrial Average .DJI . The stock rose to as much as $67.14, its highest since December 2015. Reporting by Siddharth Cavale in Bengaluru; Editing by Savio D'Souza", "external_links": [], "published": "2018-01-19T21:02:00.000+02:00", "crawled": "2018-01-19T21:20:34.002+02:00", "highlightTitle": ""}