{"organizations": [], "uuid": "48dd773f01b7e87c81adfbaff07d19792a737841", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/29/104974481-GettyImages-857687424.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/seattle-seahawks-richard-sherman-told-his-grandma-not-to-buy-bitcoin.html", "country": "US", "domain_rank": 767, "title": "Seattle Seahawks' Richard Sherman told his grandma not to buy bitcoin", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.033, "site_type": "news", "published": "2018-01-30T18:14:00.000+02:00", "replies_count": 0, "uuid": "48dd773f01b7e87c81adfbaff07d19792a737841"}, "author": "Ali Montag", "url": "https://www.cnbc.com/2018/01/30/seattle-seahawks-richard-sherman-told-his-grandma-not-to-buy-bitcoin.html", "ord_in_thread": 0, "title": "Seattle Seahawks' Richard Sherman told his grandma not to buy bitcoin", "locations": [], "entities": {"persons": [{"name": "richard sherman", "sentiment": "negative"}, {"name": "sherman", "sentiment": "none"}, {"name": "bobby wagner", "sentiment": "none"}], "locations": [{"name": "seattle", "sentiment": "none"}, {"name": "centurylink field", "sentiment": "none"}, {"name": "wa", "sentiment": "none"}], "organizations": [{"name": "seattle seahawks", "sentiment": "negative"}, {"name": "seahawks", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "nfl", "sentiment": "none"}, {"name": "standford university", "sentiment": "none"}, {"name": "indianapolis colts", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Richard Sherman, an NFL player and Standford University graduate whose $57.4 million contract with the Seattle Seahawks once made him one of the highest paid cornerbacks in the league, took an interest in bitcoin long before it had mainstream attention.\nAs early as 2014, he was accepting bitcoin as payment for merchandise on his website.\n\"I had heard about the idea and the premise behind it being kind of like a universal currency — [it could] mitigate concerns about exchanges and stuff like that — and I really thought that was innovative,\" Sherman tells CNBC Make It. \"I could appreciate that idea, and I just wanted to get involved.\"\nHe began buying it himself in June, when the price of a single bitcoin was over $2,000 according to historical data from CoinMarketCap.com . He currently also holds other cryptos like ethereum and litecoin.\nWhen bitcoin saw a dramatic spike to a record-breaking $19,000 in December, Sherman says he heard buzz about cryptocurrency everywhere.\nEven from his grandmother.\n\"You couldn't go anywhere when bitcoin was at $19,000 and not hear somebody,\" he says. \"I mean, when I heard my grandma talking about it, I was like, 'Oh yeah this is way too big if my grandma is talking about bitcoin.'\n\"My grandma doesn't have a computer,\" he adds with a laugh.\nCourtesy of Richard Sherman Throwback: Richard Sherman, family and friends But, her low-tech nature didn't hinder her curiosity. \n\"She was like, 'Baby can you help me get me invested in this? Just buy me a couple of the bitcoin, and we'll just hang on to them,'\" Sherman remembers her asking. \nAlthough he himself holds bitcoin, he talked his grandma out of investing.\n\"I just told her that it was a fad, and that it is tough to invest,\" Sherman says. \"Once she got to the point when she had to get on the computer and get on websites and do all that, she kind of lost interest.\"\nSherman, who grew up in Compton, Calif., has been devoting time to researching the industry after an injury to his Achilles tendon ended his football season in November 2017. He's also now a spokesperson for Cobinhood, a cryptocurrency trading platform, and an investor in the company's coin, COB .\nTweet \nFor Sherman, cryptocurrency is a technology with a lot of potential.\n\"It really has changed the way people view currency, the way people view IPOs and ICOs,\" he says, referring to initial public offerings and initial coin offerings, two ways businesses can raise capital. \"I think that is obviously incredible, and great for people looking for alternative investments.\" \nJust not for his grandmother.\nDon't miss: 'HODL,' 'whale' and 5 other cryptocurrency slang terms explained \nLike this story? Like CNBC Make It on Facebook ! \nshow chapters 'HODL,' 'whale' and other cryptocurrency slang terms explained      9:38 AM ET Tue, 23 Jan 2018 | 01:36", "external_links": [], "published": "2018-01-30T18:14:00.000+02:00", "crawled": "2018-01-30T18:15:02.000+02:00", "highlightTitle": ""}