{"organizations": [], "uuid": "776435a815de653bddfb934c0bfa2fd5720f6e03", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-unum-to-acquire-poland-based-pramerica-aycie.html", "country": "US", "domain_rank": 767, "title": "Unum to acquire Poland-based Pramerica Życie", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.416, "site_type": "news", "published": "2018-01-23T14:00:00.000+02:00", "replies_count": 0, "uuid": "776435a815de653bddfb934c0bfa2fd5720f6e03"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-unum-to-acquire-poland-based-pramerica-aycie.html", "ord_in_thread": 0, "title": "Unum to acquire Poland-based Pramerica Życie", "locations": [], "entities": {"persons": [{"name": "pramerica życie", "sentiment": "none"}, {"name": "peter o’donnell", "sentiment": "none"}, {"name": "rick mckenney", "sentiment": "none"}], "locations": [{"name": "tenn.", "sentiment": "none"}, {"name": "chattanooga", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "poland", "sentiment": "none"}], "organizations": [{"name": "pramerica życie entry", "sentiment": "negative"}, {"name": "unum", "sentiment": "negative"}, {"name": "unm", "sentiment": "none"}, {"name": "pramerica życie tuir sa", "sentiment": "none"}, {"name": "prudential financial, inc.", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "unum uk", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Entry into Polish market boosts company’s growth strategy\nCHATTANOOGA, Tenn.--(BUSINESS WIRE)-- Unum (NYSE:UNM) today announced it has entered into a definitive agreement to acquire Pramerica Życie TUiR SA (“Pramerica Życie”), a financial protection provider in Poland, from a subsidiary of Prudential Financial, Inc. (“PFI”).\n“Growth of the Unum franchise through strategic acquisitions is an important avenue for us,” said Unum President and CEO Rick McKenney. “The purchase of Pramerica Życie opens an opportunity to expand our European footprint into Poland, an attractive market for financial protection benefits. Pramerica Życie is an excellent fit for Unum, with a shared focus of delivering financial protection to individuals and families when they need it most.”\nUnum is one of the leading providers of employee benefits products and services, and the largest provider of group and individual disability income protection insurance in the United States 1 and United Kingdom 2 .\nPramerica Życie will remain a standalone business reporting to Unum UK President and CEO Peter O’Donnell.\n“Pramerica Życie is a group and individual risk protection provider with a strong distribution model and a solid reputation as a trustworthy provider of high-quality products and professional financial advice,” O’Donnell said. “I am delighted to welcome the Polish team to Unum, and look forward to supporting them as they seek to build on their growth momentum.”\nAneta Podyma-Milczarek, president of Pramerica Życie, said she expects the financial stability, high quality products, and strong professional relationships the business has built over the last 20 years will continue to grow with the new owner.\n“Over the past 20 years, Pramerica Życie with our current shareholder PFI created a successful and highly recognized company in the Polish market,” Podyma-Milczarek said. “We are proud to become a part of Unum and look forward to further developing our offering using the extensive experience and innovative solutions of our new shareholder. Most important, we will continue to offer our clients protection for what is most valuable for them: their lives and health.”\nTerms of the sale were not disclosed. The transaction is expected to close by the end of the year, subject to regulatory approvals and customary closing conditions. It will not alter Unum’s earnings or capital management outlook for 2018, nor does it change Unum’s overall capital management strategy of investing in its business while also returning capital to shareholders through share repurchases and dividends. It is expected to be neutral to accretive to Unum’s earnings per share in 2018.\nPricewaterhouseCoopers Corporate Finance LLC served as financial advisor to Unum. Deutsche Bank served as financial advisor to PFI.\nABOUT UNUM GROUP\nUnum Group ( www.unum.com ) is a leading provider of financial protection benefits in the United States and the United Kingdom. Its primary businesses are Unum US, Colonial Life, Starmount and Unum UK. Unum’s portfolio includes disability, life, accident and critical illness, dental and vision coverage, which help protect millions of working people and their families in the event of an illness or injury. Unum also provides stop-loss coverage to help self-insured employers protect against unanticipated medical costs. The company reported revenues of $11 billion in 2016, and provided $6.9 billion in benefits.\nFor more information, connect with us on Facebook , Twitter and LinkedIn .\nABOUT PRAMERICA ŻYCIE\nPramerica Życie TUiR SA is a group and individual risk protection provider based in Poland. The scope of coverage in life insurance products the company offers in Poland is among the most extensive on the market. Customer focus and care about their trust, side by side with the highest quality of service, are the company’s competitive advantage. Pramerica Życie gives customers genuine financial support in their hour of need, and all along helps them protect what is most important for them so that they can pursue their goals in life. The company creates a friendly working environment built on respect, where ambitious and exceptional people can succeed by developing and realizing their potential. Core values are the foundation on which, day by day, Pramerica Życie builds a company that helps customers bring their dreams to life and addresses their dynamically evolving needs.\nPramerica Życie has been awarded the title of Ethical Company (2016), Customer Friendly Company (2017) and Friendly Insurance Company (2017).\nMore information on www.pramerica.pl\nPrudential Financial, Inc. of the United States is not affiliated with Prudential plc. of the United Kingdom.\nSAFE HARBOR STATEMENT\nCertain information in this press release constitutes “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements are those not based on historical information, but rather relate to our outlook, future operations, strategies, financial results, or other developments, may include words such as “expects,” “anticipates,” “intends,” “plans,” “believes,” “estimates,” and similar expressions, and speak only as of the date made. These forward-looking statements, including statements regarding the timing of the closing of the acquisition, are subject to numerous assumptions, risks, and uncertainties, many of which are beyond our control. Forward-looking statements involve known and unknown risks and uncertainties that may cause our actual future results to differ materially from those projected or contemplated in the forward-looking statements.\nThese risks and uncertainties include, but are not limited to, the satisfaction of the closing conditions for the acquisition, the timing and receipt of regulatory approval for the acquisition, our ability to effectively manage growth and our ability to effectively execute and integrate acquisitions. Given the risks and uncertainties inherent in forward-looking statements, any of our forward-looking statements could be incorrect and investors are cautioned not to place undue reliance on any of our forward-looking statements.\nFor further discussion of risks and uncertainties which could cause actual results to differ from those contained in the forward-looking statements, see Item 1A “Risk Factors” of our annual report on Form 10-K for the year ended December 31, 2016, and, to the extent applicable, our subsequent quarterly reports on Form 10-Q. The forward-looking statements in this press release are being made as of the date of this press release, and the Company expressly disclaims any obligation to update or revise any forward-looking statement contained herein, even if made available on our website or otherwise.\n1 LIMRA, “U.S. Group Disability Insurance 2016 Annual Sales and In Force” (2017), based on inforce premium.\n2 Swiss Re, Group Watch 2017 (reporting sales data for 2016), based on inforce premium.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123005733/en/\nUnum Group\nInvestors:\nTom White, 423-294-8996\nor\nMatt Barnett, 423-294-7498\nor\nMedia:\nJim Sabourin, 866-750-8686\nSource: Unum Group", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.facebook.com%2Funumbenefits&esheet=51747406&newsitemid=20180123005733&lan=en-US&anchor=Facebook&index=4&md5=85456da886669c681c739279f7404f13", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.linkedin.com%2Fcompany%2Funum&esheet=51747406&newsitemid=20180123005733&lan=en-US&anchor=LinkedIn&index=6&md5=3c4bbff4b1b2bc702388514a736c7aa8", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.unum.com%2F&esheet=51747406&newsitemid=20180123005733&lan=en-US&anchor=Unum&index=1&md5=0bbeefa5f1fe7505d435329087c6e936", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.pramerica.pl&esheet=51747406&newsitemid=20180123005733&lan=en-US&anchor=Pramerica+%C5%BBycie&index=2&md5=ba6b22049cef0631f4701d0a1805867e", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2Funumnews&esheet=51747406&newsitemid=20180123005733&lan=en-US&anchor=Twitter&index=5&md5=81f198c5789daccfe03dd5b8bb2304ed", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.pramerica.pl&esheet=51747406&newsitemid=20180123005733&lan=en-US&anchor=www.pramerica.pl&index=7&md5=47a708d05adceec573a3589c9beab54d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Funum.me%2F1mHaNHq&esheet=51747406&newsitemid=20180123005733&lan=en-US&anchor=www.unum.com&index=3&md5=4b0ab3a69cc6dc0e9b5b11a0dce4d030", "http://www.businesswire.com/news/home/20180123005733/en/"], "published": "2018-01-23T14:00:00.000+02:00", "crawled": "2018-01-23T14:16:56.000+02:00", "highlightTitle": ""}