{"organizations": [], "uuid": "45463902bbc6c7a2c0e2998d559ad2bdb2d0fd0e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-markets/global-markets-stocks-scale-new-record-highs-dollar-stuck-idUSL8N1P00UL", "country": "US", "domain_rank": 408, "title": "GLOBAL Stocks scale new record highs, dollar stuck", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T17:43:00.000+02:00", "replies_count": 0, "uuid": "45463902bbc6c7a2c0e2998d559ad2bdb2d0fd0e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-markets/global-markets-stocks-scale-new-record-highs-dollar-stuck-idUSL8N1P00UL", "ord_in_thread": 0, "title": "GLOBAL Stocks scale new record highs, dollar stuck", "locations": [], "entities": {"persons": [{"name": "tommy wilkes", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "msci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* World stocks hit fresh highs\n* Dollar stuck near four month low vs euro\n* Investors prepare for U.S., euro zone inflation reports\n* Oil slips from recent highs\n* Graphic: World FX rates in 2018 tmsnrt.rs/2egbfVh\nBy Tommy Wilkes\nLONDON, Jan 5 (Reuters) - World stocks scaled fresh record highs on Friday after more data pointed to the strength of the world’s largest economy, while the dollar was stuck near four-month lows ahead of crucial payroll numbers.\nGlobal equity markets have begun 2018 with their best week in more than a year, continuing last year’s rally that has seen volatility plunge and risk appetite surge.\nMSCI’s gauge of stocks across the globe was up 0.15 percent, above 524 points and at a record high.\nEuropean markets opened firmer after Asian shares approached record levels. The pan-European STOXX 600 index was up 0.4 percent, holding at a two-month high, and the first trading week of the new year looks set to be the best for Euro zone stocks since May, as shares shrug off a stronger single currency that could dampen export earnings.\nThe U.S. dollar failed to draw any strength from better-than-expected private payrolls data on Thursday and manufacturing numbers earlier this week, leaving the greenback around a four-month low against the euro.\nWith two U.S. interest rate hikes already baked into market expectations, traders believe there is more upside room for the euro as the European Central Bank may move to rein in its monetary largesse faster than the market anticipates.\nInvestors will also be looking closely at crucial December inflation data out of the euro zone on Friday, as well as the monthly employment report in the United States, along with average hourly earnings data, due at 1330 GMT.\nThe data could give some clues to the likely path for when central banks will step up monetary tightening.\n“Currency markets broadly know what the Fed is going to do this year but the ECB monetary policy may be the surprise package of 2018,” said Richard Falkenhall, senior FX strategist at SEB in Stockholm.\nThe dollar has weakened as U.S. long-term bond yields have remained low, despite the Federal Reserve increasing interest rates three times last year.\nThe 10-year U.S. Treasuries yield stood at 2.460 percent , below its seven-month peak of 2.504 percent touched on Dec. 21.\nThose levels are little different from about a year ago, even after the Fed hiked interest rates and with market expectations for another three hikes in 2018.\nExpectations that inflation will remain low as wage growth has been slower than before the 2007-2008 financial crisis has capped U.S. long-term bond yields.\nElsewhere, oil prices slipped from highs last seen in 2015 after soaring U.S. production undermined a 10-percent rally from lows hit in December driven by tightening supply and political tensions in Iran.\nGold prices dipped from the previous session’s 3-1/2 month high, ahead of the U.S. non-farm payroll data, but remained on track for their fourth straight weekly gain.\nSigns of the investor appetite for risk more broadly were evident in Greece, where the euro zone member’s 10-year borrowing costs hit their lowest in 12 years on Friday.\nThe country, once on the verge of defaulting on its debts, has benefited from expectations of a clean exit from its bailout this year and a revival in the economy.\n“Greece’s fundamentals have been on the mend and investors have been looking at the yield pick-up they get from investing in that debt,” said DZ Bank strategist Christian Lenk.\n“Also, a rising tide lifts all boats - with the euro zone economy doing so well, it’s a very ‘risk on’ environment and that is benefiting Greece.”\nFor Reuters Live Markets blog on European and UK stock markets open a news window on Reuters Eikon by pressing F9 and type in ‘Live Markets’ in the search bar.\nAdditional reporting by Saikat Chatterjee; Reporting by Tommy Wilkes; Editing by Peter Graff\n ", "external_links": ["http://tmsnrt.rs/2egbfVh", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-05T17:43:00.000+02:00", "crawled": "2018-01-05T22:36:46.032+02:00", "highlightTitle": ""}