{"organizations": [], "uuid": "4a924941d4bf04692c604205bbb03f9be0b99c6f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/19/104956322-GettyImages-905661366.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/19/cramers-game-plan-watch-individual-stocks-amid-the-earnings-deluge.html", "country": "US", "domain_rank": 767, "title": "Cramer's game plan: Watch individual stocks amid the earnings deluge", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T01:11:00.000+02:00", "replies_count": 0, "uuid": "4a924941d4bf04692c604205bbb03f9be0b99c6f"}, "author": "Elizabeth Gurdus", "url": "https://www.cnbc.com/2018/01/19/cramers-game-plan-watch-individual-stocks-amid-the-earnings-deluge.html", "ord_in_thread": 0, "title": "Cramer's game plan: Watch individual stocks amid the earnings deluge", "locations": [], "entities": {"persons": [{"name": "cramer", "sentiment": "negative"}, {"name": "jim cramer", "sentiment": "negative"}, {"name": "kohl", "sentiment": "none"}], "locations": [{"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "walmart", "sentiment": "none"}, {"name": "halliburton", "sentiment": "none"}, {"name": "irs", "sentiment": "none"}, {"name": "netflix halliburton", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Even with a government shutdown, CNBC's Jim Cramer expects good things for the next leg of earnings season.\n\"Earnings season is upon us and it is always a guessing game, but this time around the rules have changed,\" the \" Mad Money \" host said. \"Rather than worrying about whether companies will beat or miss their forecasts, now we're guessing how much money those companies will return to you, the shareholders, in the form of dividends and buybacks.\"\nCalling the shutdown news less than meaningful for the market, Cramer said it was unlikely to crush equities. Instead, it will probably push stocks down to buyable levels, he said.\n\"If a shutdown does cause delays in when the IRS sends its tax rebates, we might get a temporary decline in consumer spending,\" Cramer said. \"Again, though, another buying opportunity: Home Depot , Amazon , Kohl's , Walmart . Why? The problem is temporary.\"\nWith that in mind, Cramer turned to the stocks and events he'll be watching with or without a shutdown:\n\nMonday: Halliburton, Netflix Halliburton : The next leg of earnings season begins with a report from oil service company Halliburton. Cramer expected a strong result given what he called \"the incredible drilling renaissance\" in the United States.\nNetflix : Facing a high bar set by Wall Street, entertainment giant Netflix will issue a highly anticipated earnings report after Monday's closing bell.\n\"That means the subscriber count, the price increases, the exciting new programming and the international sign-ups ... all need to be better than these already elevated expectations,\" Cramer said. \"Somehow, I think Netflix can do it.\"\nTuesday: Verizon, Procter & Gamble, Johnson & Johnson, Travelers Verizon : Cramer anticipated a good earnings report from Verizon, but said it would probably fail to attract buyers due to increased competition from rising interest rates.\nProcter & Gamble : Still a \" work in progress ,\" the consumer goods giant could deliver some less-than-outstanding results in its Tuesday earnings report, Cramer said.\nJohnson & Johnson and Travelers : Shares of pharmaceutical giant Johnson & Johnson and insurance play Travelers — both of which Cramer called best-in-breed companies — have been rising steadily ahead of their Tuesday reports.\n\"You just have to hope that you get some kind of price break between Monday and Tuesday so you can buy either one of them\" on weakness, the \"Mad Money\" host said.\nWednesday: General Electric, United Technologies, Stanley Black & Decker General Electric : The fate of General Electric under new CEO John Flannery has become a central topic of discussion among Cramer and top executives, the \"Mad Money\" host said.\nThe industrial conglomerate, which reports earnings on Wednesday, is struggling on a number of fronts, causing analysts to float the possibility of GE doing a large equity offering to raise cash.\n\"Still, I'll say this: Flannery is not without cards,\" Cramer said. \"GE's aerospace business is strong with huge service revenues. The oil and gas business is getting better and can be broken up. I see buyers. The health care business is just fine. The power segment, which had grand ambitions that are now being called into question ... is the next hurdle.\"\nUnited Technologies : Cramer expected \"best-in-show\" results from United Techologies' earnings report with raised guidance for every single one of the manufacturer's divisions.\nStanley Black & Decker : Several positive drivers, including hurricane recovery efforts in Florida and Houston, could make for an \"outstanding\" report from this toolmaker, Cramer said.\nThursday: Caterpillar, Intel, Starbucks Caterpillar : Cramer sensed some pressure on this construction machinery maker ahead of its Thursday report.\n\"Here's another company that needs to put up extraordinary numbers, a la Netflix, or else the stock will give back some of its recent gains,\" he said. \"That said, CAT's a major beneficiary of the weak dollar , the repatriation tax holiday and the booming global economy as well as commodity prices going higher. I'm praying it sells off on an in-line number so you can buy it into weakness.\"\nIntel : Intel's seemingly endless chip-security debacle will be put to rest by a \"robust\" earnings report and CEO Brian Krzanich's commentary, Cramer predicted.\nStarbucks : An earnings report from coffeemaker Starbucks could make or break its stock's rally to the $60s, the \"Mad Money\" host said.\n\"If Starbucks doesn't give us a good quarter this time, I am telling you its stock will finally lose its premium price-to-earnings multiple slash luster. That's never a fun experience,\" he said.\nFriday: Honeywell, Colgate-Palmolive Honeywell : Cramer anticipated some more information on Honeywell's double-spin-off strategy in its Friday earnings report. In its last report , the company said it expected the deals to be completed by the end of this year.\n\"I've been recommending this stock for ages,\" Cramer said. \"I suggest buying part of your position before the quarter, but leave some powder dry in case it pulls back and you want some more.\"\nColgate-Palmolive : Cramer had one piece of advice for investors ahead of this consumer goods company's earnings report: listen to the conference call.\n\"This stock is way too strong for its recent move to be based on earnings alone,\" he said. \"The consumer product group is way out of favor. The numbers have been decent; they've not been incredible. Could Colgate possibly be up for sale? Is Kraft Heinz interested? Maybe Unilever ? It wouldn't shock me if we find out on Friday that something else is going on besides earnings.\"\nFinal thoughts \"If you only look at the averages, you might be tempted to think that stocks have run up too much,\" the \"Mad Money\" host said. \"But when you look at things company by company, the fact is that none of these stocks seems overstretched going into the earnings other than maybe Netflix and Caterpillar. I think some of them will turn out to be terrific buys right here if tax reform allows them to make more money, buy back more stock, boost their dividends and tell a much more bullish story about the future.\"\nWATCH: Cramer's game plan ahead of a big earnings week show chapters Cramer's game plan: Watch individual stocks amid the earnings deluge      21 Hours Ago | 11:42 Disclosure: Cramer's charitable trust owns shares of General Electric and Honeywell. \nQuestions for Cramer?\nCall Cramer: 1-800-743-CNBC\nWant to take a deep dive into Cramer's world? Hit him up!\nMad Money Twitter - Jim Cramer Twitter - Facebook - Instagram - Vine \nQuestions, comments, suggestions for the \"Mad Money\" website? madcap@cnbc.com", "external_links": [], "published": "2018-01-20T01:11:00.000+02:00", "crawled": "2018-01-20T01:21:41.014+02:00", "highlightTitle": ""}