{"organizations": [], "uuid": "3160bdb3cb4f728afccf4f3a1300b2ba18122207", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219112791&w=1200&r=LYNXMPEE0213G", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-france-macron/macron-wants-anti-fake-news-law-in-2018-idUSKBN1ES1LJ", "country": "US", "domain_rank": 408, "title": "Macron plans law to fight 'fake news' in 2018", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T00:01:00.000+02:00", "replies_count": 0, "uuid": "3160bdb3cb4f728afccf4f3a1300b2ba18122207"}, "author": "", "url": "https://www.reuters.com/article/us-france-macron/macron-wants-anti-fake-news-law-in-2018-idUSKBN1ES1LJ", "ord_in_thread": 0, "title": "Macron plans law to fight 'fake news' in 2018", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PARIS (Reuters) - President Emmanuel Macron announced on Wednesday he would overhaul French media legislation this year to fight the spread of “fake news” on social media which he said was a threat to liberal democracies.\nMacron has said he and his team were victims of fake news and a major data hack during his election campaign last year.\nSince coming to office in May 2017, he has particularly pointed the finger at Russian media, accusing TV channel RT of sowing disinformation about him via its website and social media during the campaign.\n“If we want to protect liberal democracies, we must have strong legislation,” Macron said in a New Year’s address to journalists, adding that the reform he envisaged would also change the role of France’s media watchdog CSA.\n“At election time, on internet platforms, the rules applying to content won’t be exactly the same,” Macron said.\nFrench President Emmanuel Macron delivers his New Year wishes to the members of the press corps at the Elysee Palace in Paris, France, January 3, 2018. REUTERS/Ludovic Marin/Pool “There will be increased transparency requirements for internet platforms regarding sponsored content, with the aim of making public the identity of those who place the ads and also limiting the amount of them.”\nA new emergency procedure in the event of fake news appearing would allow a judge to delete some content, close a user’s account, or block access to a website, he said.\nSlideshow (3 Images) Macron, who has cut back on the close relations his predecessor, Francois Hollande, had with the media, said the authorities must keep their distance with the press.\n“The closeness which we had on occasions got used to was, I think, neither good for those in government nor for the journalists,” he said.\n“It sometimes led to more importance being given to backroom chatter than to official comments,” he said, calling for a “healthy distance” to be maintained with the press.\nReporting by Michel Rose and Jean-Baptiste Vey; Additional reporting by Simon Carraud; Writing by Ingrid Melander; Editing by Richasrd Balmforth\n ", "external_links": [], "published": "2018-01-04T00:01:00.000+02:00", "crawled": "2018-01-04T00:13:45.016+02:00", "highlightTitle": ""}