{"organizations": [], "uuid": "899dfb1552689058d725204fcfc41d5117a97f3a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/china-msci-inclusion/asset-managers-rush-to-launch-msci-index-funds-ahead-of-china-a-share-inclusion-idUSL4N1PJ1OG", "country": "US", "domain_rank": 408, "title": "Asset managers rush to launch MSCI index funds ahead of China A-share inclusion", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T01:00:00.000+02:00", "replies_count": 0, "uuid": "899dfb1552689058d725204fcfc41d5117a97f3a"}, "author": "", "url": "https://www.reuters.com/article/china-msci-inclusion/asset-managers-rush-to-launch-msci-index-funds-ahead-of-china-a-share-inclusion-idUSL4N1PJ1OG", "ord_in_thread": 0, "title": "Asset managers rush to launch MSCI index funds ahead of China A-share inclusion", "locations": [], "entities": {"persons": [{"name": "samuel", "sentiment": "negative"}, {"name": "john ruwitch", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}], "organizations": [{"name": "msci", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "truvalue asset management co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 11:02 PM / Updated 18 minutes ago Asset managers rush to launch MSCI index funds ahead of China A-share inclusion Samuel Shen , John Ruwitch 4 Min Read \nSHANGHAI, Jan 30 (Reuters) - Chinese asset managers, seeking to get ahead of an expected wave of foreign money inflows, are racing to launch index funds that place bets on a select group of mainland stocks, which will be included in MSCI’s emerging market benchmark this year. \nThe first such product to follow MSCI’s inclusion announcement in June is Truvalue Asset Management Co’s MSCI China stock index fund, which launched after receiving the regulatory green light earlier this month. Launches from other fund managers are also in the pipeline. \nWhile some foreign investors are still haunted by painful memories of China’s 2015 stock market crash and concerns about current elevated valuations, a deeper “fear of missing out” is expected to support a surge in mainland stocks. \nMSCI’s decision last June to include yuan-denominated Chinese stocks, known as “A-shares”, into its emerging market (EM) index has already boosted interest in China’s banking and consumer heavyweights. But an explosion in funds allowing more focused bets will likely add fuel to China’s blue-chip euphoria. \nTruvalue fund manager Chen Long forecasts that the partial inclusion would initially trigger 80 billion yuan ($12.52 billion) of passive investments into China, while an eventual full inclusion will usher in 2.5 trillion yuan of inflows. \nThe fund, which tracks the MSCI China A International Index, would enable investors to get ahead of overseas investors “with just one press of a button,” Chen said. \nSuch a strategy has a good chance of success, he said, citing post-inclusion stock performances in markets including South Korea, South Africa and Taiwan. \nIn June and September, MSCI will add around 230 large-cap Chinese stocks into its EM index in a two-stage process. They will represent a 0.73 percent index weighting, with MSCI’s 5 percent partial inclusion factor taking China’s foreign ownership caps and market accessibility into account. \nTruvalue’s rivals Invesco Great Wall, PingAn-UOB and Huaan have also applied to launch MSCI index funds, which are among about two dozen such products awaiting the regulatory nod. \nAlready, foreign funds with existing exposure to A-shares have witnessed a surge in demand. \nFour years ago, U.S. asset managers Krane Funds Advisors launched its New York-listed KraneShares Bosera MSCI China A Share ETF. In 2017, this fund saw a 12-fold surge in assets under management to about $300 million following MSCI’s inclusion announcement. \nMSCI estimates that a full inclusion could potentially give A-shares an approximately 18 percent weighting in the MSCI EM Index, enabling China to dwarf many large emerging markets such as Brazil, Russia and India. \nInvestor concerns centre on some lofty valuations in Chinese stocks, as well as recollections of the 2015 market rout, during which over 1,000 stocks were suspended from trading to avert a deeper meltdown. \nA bigger worry, however, seems to be the possibility of having no exposure to China at all. \n“Prejudice and information disparity resulted in foreign under-investment in China stocks in the past. The MSCI inclusion is an ice-breaking event that will stimulate foreign demand for A-share allocation,” said Wan Qiong, fund manager at Bosera Asset Management. \n“As foreigners’ understanding of China deepens, global investors will gradually move from underweight China, to equal-weight and eventually overweight.” \nUBS strategist Gao Ting expects foreign ownership in Chinese A-share market to be raised to 10-12 percent in the coming years, from less than 2 percent currently. \nAnthony Cragg, senior portfolio manager at Wells Fargo Asset Management, and a veteran China investor, said while many global investors have finally “woken up” to China, funds worldwide remain “massively” underweight. \nVictoria Mio, Asia Pacific equities co-head at Dutch asset manager Robeco put it more bluntly: \n“If you are underweight China, there’s a price to pay.” $1 = 6.3895 Chinese yuan Reporting by Samuel Shen and John Ruwitch; Editing by Sam Holmes", "external_links": [], "published": "2018-01-30T01:00:00.000+02:00", "crawled": "2018-01-30T01:17:54.019+02:00", "highlightTitle": ""}