{"organizations": [], "uuid": "06fb2563802a6a7ac27d72ae662bb10751ac4d68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1227006459&w=1200&r=LYNXMPEE0U1BF", "site_section": "http://feeds.reuters.com/reuters/Lifestyle", "section_title": "Reuters: Lifestyle", "url": "https://www.reuters.com/article/us-france-ritz-auction/paris-ritz-to-auction-old-furnishings-hemingway-era-bar-stools-idUSKBN1FK2GM", "country": "US", "domain_rank": 408, "title": "Paris Ritz to auction old furnishings, Hemingway-era bar stools", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T18:54:00.000+02:00", "replies_count": 0, "uuid": "06fb2563802a6a7ac27d72ae662bb10751ac4d68"}, "author": "", "url": "https://www.reuters.com/article/us-france-ritz-auction/paris-ritz-to-auction-old-furnishings-hemingway-era-bar-stools-idUSKBN1FK2GM", "ord_in_thread": 0, "title": "Paris Ritz to auction old furnishings, Hemingway-era bar stools", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PARIS (Reuters) - The world famous Ritz hotel in Paris has decided to sell off more than 3,500 pieces of furniture and “objets d‘art” that it no longer has a home for after a renovation.\nRanging from sofas that once filled the salon frequented by novelist Marcel Proust to bar stools that propped up Ernest Hemingway and F. Scott Fitzgerald in the 1920s, the lots cover the sweep of the hotel’s illustrious 120-year history.\nThe sale, to take place from April 17-21, is being held by Artcurial, an auction house that has previously sold off the contents of the Hotel de Crillon and Plaza Athenee in Paris, and the Hotel de Paris in Monaco.\n“Collectors and enthusiasts of 15 Place Vendome will have the unique opportunity to return home with a piece of the Ritz legend during the sale,” Artcurial said in its brochure.\nThe hotel, which occupies one side of the octagonal Place Vendome near the city’s most fashionable boutiques, has been owned by Egyptian billionaire Mohammed al-Fayed since 1979, when he purchased it for $30 million.\nFILE PHOTO: General exterior view of the Ritz Hotel in Paris, France, August 4, 2016. Picture taken August 4, 2016. REUTERS/Jacky Naegelen/File Photo It is where his son, Dodi, dined with Diana, the princess of Wales, the evening they died in a car crash in 1997.\nThe hotel, founded in 1898 by Swiss hotelier Cesar Ritz, reopened in 2016 after a four-year renovation. It has 71 rooms and 71 suites, including several named after its most-famous residents, from Coco Chanel to opera diva Maria Callas.\nAmong the quirkier items to be auctioned are a Louis XVI style dog bed (estimate 200-300 euros), an old barber’s chair (400-600 euros), a Ritz-monogrammed minibar (300-500 euros) and three stools from one of its famed bars (1,000-1,500 euros).\nThe entire sale is expected to raise between 1 and 1.5 million euros, Artcurial said.\nWhile the Ritz is a byword for elegance, it has enjoyed less welcome headlines in recent weeks. This month, robbers wielding axes stole jewelry worth $5 million from a store inside the hotel. The thieves were quickly apprehended and the jewelry recovered.\nEditing by Matthew Mpoke Bigg\n ", "external_links": [], "published": "2018-01-31T18:54:00.000+02:00", "crawled": "2018-01-31T19:20:58.000+02:00", "highlightTitle": ""}