{"organizations": [], "uuid": "74bb12688784b4159c7d205be6dbbdb860f4f2b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/airasia-india/update-1-airasia-explores-india-unit-ipo-seeks-partner-for-services-business-idUSL4N1P51LO", "country": "US", "domain_rank": 408, "title": "UPDATE 1-AirAsia explores India unit IPO, seeks partner for services business", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T06:35:00.000+02:00", "replies_count": 0, "uuid": "74bb12688784b4159c7d205be6dbbdb860f4f2b8"}, "author": "", "url": "https://www.reuters.com/article/airasia-india/update-1-airasia-explores-india-unit-ipo-seeks-partner-for-services-business-idUSL4N1P51LO", "ord_in_thread": 0, "title": "UPDATE 1-AirAsia explores India unit IPO, seeks partner for services business", "locations": [], "entities": {"persons": [{"name": "jamie freed", "sentiment": "none"}, {"name": "tony fernandes", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "philippines", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}], "organizations": [{"name": "ipo", "sentiment": "negative"}, {"name": "airasia", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "airasia bhd", "sentiment": "none"}, {"name": "indonesia airasia tbk pt", "sentiment": "none"}, {"name": "sats ltd", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "airasia group bhd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 4:36 AM / Updated an hour ago UPDATE 1-AirAsia explores India unit IPO, seeks partner for services business Reuters Staff \n* AirAsia restructuring, pursuing asset monetisation strategy \n* Indian stake could be worth $200 mln once profitable - analyst \n* Completed Indonesia unit IPO, Philippines expected this year (Adds details of services business, analyst comment) \nBy Jamie Freed \nSINGAPORE, Jan 10 (Reuters) - Malaysia-based AirAsia Bhd is considering an initial public offering for its Indian unit and seeking a partner for its services business, the carrier’s group chief executive Tony Fernandes said on Wednesday. \nThis is the latest in a series of asset monetisations being undertaken by the budget airline group, which this week received shareholder nod for a reorganisation to make AirAsia Group Bhd the listed holding company for assets across Asia. \nAirAsia has already completed a backdoor listing of Indonesia AirAsia TBK PT and finalised a S$119.3 million ($89.38 million) joint venture for its ground-handling business with Singapore’s SATS Ltd. Its Philippine unit is looking to raise up to $250 million via an IPO in mid-2018. \nAirAsia will seek approval at the next AirAsia India board meeting to pick a banker to start a preliminary process for an IPO, Fernandes posted on Twitter on Wednesday. \nWhile analysts are “giving zero value to AirAsia India”, the unit is a “very valuable asset with huge growth potential”, he said in separate tweets, adding the subsidiary “was not far from 20 planes and a potential IPO”. \nAccording to Indian regulations, airlines need to have a fleet of at least 20 aircraft to fly on international routes. \nAirAsia India, a joint venture with India’s Tata Sons conglomerate, had 14 planes at end-2017. Its revenue last year was expected to double to 12 billion rupees ($188.44 million) and climb to 18 billion rupees in 2018. \nThe fast-growing Indian venture reported a net loss of 164 million rupees in the quarter ended September, according to AirAsia’s latest accounts. \n“AirAsia India is still incurring start-up losses and in negative equity so it is challenging to ascribe much value to the business at this point,” said Corrine Png, the CEO of transport research firm Crucial Perspective. \nHowever, she said if the Indian venture grew its fleet to 20 and turned profitable, AirAsia’s 49-percent stake could be worth $200 million based on listed Indian airline rivals. \nFernandes said AirAsia was also in the process of appointing a banker to find a partner for its shared services centre business, AirAsia Global Shared Services, which provides accounting services and data management for its airlines. \nBut Png said the value of that business would be insignificant, at around 1 million ringgit ($249,563.26). \nAirAsia said it did not have any additional information to share on the plans announced by Fernandes. \nThe company’s strategy involves selling more stakes in non-flying businesses to help fund special dividends, Fernandes said in October. ($1 = 1.3347 Singapore dollars) ($1 = 63.6800 Indian rupees) ($1 = 4.0070 ringgit) (Reporting by Jamie Freed in Singapore and Ishita Chigilli Palli in Bengaluru; Editing by Himani Sarkar)", "external_links": [], "published": "2018-01-10T06:35:00.000+02:00", "crawled": "2018-01-10T07:14:59.007+02:00", "highlightTitle": ""}