{"organizations": [], "uuid": "fda357238dee1b7d003955ed685de1286700b386", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226704629&w=1200&r=LYNXMPEE0T1GF", "site_section": "http://feeds.reuters.com/news/wealth", "section_title": "Reuters: Money", "url": "https://www.reuters.com/article/us-usa-stocks-volatility/u-s-stock-pullback-stokes-fears-of-more-volatility-idUSKBN1FJ2S6", "country": "US", "domain_rank": 408, "title": "U.S. stock pullback stokes fears of more volatility", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T22:14:00.000+02:00", "replies_count": 0, "uuid": "fda357238dee1b7d003955ed685de1286700b386"}, "author": "", "url": "https://www.reuters.com/article/us-usa-stocks-volatility/u-s-stock-pullback-stokes-fears-of-more-volatility-idUSKBN1FJ2S6", "ord_in_thread": 0, "title": "U.S. stock pullback stokes fears of more volatility", "locations": [], "entities": {"persons": [{"name": "saqib", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "iqbal ahmed", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 8:19 PM / in 19 minutes U.S. stock pullback stokes fears of more volatility Saqib Iqbal Ahmed 3 Min Read \nNEW YORK (Reuters) - Tuesday’s stock selloff on Wall Street set traders in the options market fretting about a near-term shock to equities in a way they have rarely done since U.S. President Donald Trump took office a year ago. \nU.S. stocks fell for a second straight day on Tuesday, with the benchmark S&P 500 stock index on pace for its worst two-day decline since September 2016, hammered by a rise in bond yields and a decline in healthcare companies. \nThe Cboe Volatility Index, better known as the VIX and the most widely followed barometer of expected near-term stock market gyrations, spiked up to 15.42, its highest since August. \nMore tellingly, volatility futures point to equity investors beginning to focus on the downside potential for stocks in the months ahead. For most of the day, the VIX itself traded above the 3-month VIX futures, a rare occurrence. \n“Equity investors are beginning to become so concerned about the potential downside for stocks that they are starting to irrationally pay up for short-term protection when longer-term protection is cheaper,” Brian Reynolds, asset class strategist at New York-based Canaccord Genuity, said in a note. \nOver the last year, this inversion of the VIX curve has happened only on eight trading sessions. \n(Graphic: Inverted Volatility Curve - reut.rs/2EoUP6J ) \nIn the recent past, these instances of inversion have been fleeting and proved to be a limited roadblock to continued gains for stocks. \n“We expect this one will have a similar outcome,” said Reynolds. \nAs of 2:55 p.m. EST (1955 GMT), the VIX was trading at 14.79, while the three-month futures were at 14.66. \nBut much will depend on how the trading session ends, Reynolds said. \n“If it were to close in this fashion, it may lead to a further multi-week pullback in stocks,” said Reynolds. \nThe VIX futures curve is particularly important for market participants who have used VIX-based exchange traded products to bet on continued calm in the stock market. \nInverse volatility products such as the VelocityShares Daily Inverse VIX Short-Term ETN, make money as long as front month volatility futures cost less than deferred month futures - a state called “contango.” On Tuesday, XIV shares were down 4.6 percent at $122.4. \n“At this level the front-month futures are still below second month futures,” said Joe Tigay, chief trading officer at Equity Armor Investments in Chicago. \nFebruary VIX futures were trading at 14.2, while March VIX futures were at 14.25. \n“If that were to invert, the people short volatility via ETFs would likely have to exit. That could cause an additional increase in the futures later in the day.” \n(This version of the story corrects the Reuters instrument code in paragraph 4) Reporting by Saqib Iqbal Ahmed; editing by Daniel Bases and Nick Zieminski", "external_links": [], "published": "2018-01-30T22:14:00.000+02:00", "crawled": "2018-01-30T22:30:47.011+02:00", "highlightTitle": ""}