{"organizations": [], "uuid": "483fa5e5a7dcb24e1c1c8ae753ed109ca5e0fb8b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222592206&w=1200&r=LYNXMPEE0G03U", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-global-oil/oil-prices-edge-up-on-tighter-supplies-healthy-demand-idUSKBN1F607G", "country": "US", "domain_rank": 408, "title": "Oil gives up early gains, but market still well supported", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.872, "site_type": "news", "published": "2018-01-17T09:57:00.000+02:00", "replies_count": 0, "uuid": "483fa5e5a7dcb24e1c1c8ae753ed109ca5e0fb8b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-global-oil/oil-prices-edge-up-on-tighter-supplies-healthy-demand-idUSKBN1F607G", "ord_in_thread": 0, "title": "Oil gives up early gains, but market still well supported", "locations": [], "entities": {"persons": [{"name": "norbert ruecker", "sentiment": "none"}, {"name": "julius baer", "sentiment": "none"}], "locations": [{"name": "singapore", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "opec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SINGAPORE (Reuters) - Oil prices gave up some early gains on Wednesday as analysts warned of a downward correction, but remained well supported on the back of tightening supply and strong global demand\nTighter fundamentals have lifted both crude futures benchmarks about 13 percent above levels in early December, helped by production curbs by OPEC and Russia, as well as by healthy demand growth.\nBrent crude futures LCOc1 were at $69.23 a barrel at 0808 GMT, up 8 cents from their last close, but down from a high of $69.37 earlier in the day. Brent on Monday rose to $70.37 a barrel, its highest since December 2014, the start of a three-year oil price slump.\nU.S. West Texas Intermediate (WTI) crude futures CLc1 were at $63.84 a barrel, down from a high of $63.89 earlier, but up 11 cents from their last settlement. WTI hit $64.89 on Tuesday, also the highest since December 2014.\nNorbert Ruecker, head of commodity research at Swiss bank Julius Baer, said a price “correction should occur... (as) hedge fund expectations for further rising prices have reached excessive levels.”\nHe said this was especially the case as political risk factors that have helped boost Brent, including tensions in Qatar, and the Kurdish region of Iraq and in Iran have so far not caused significant supply disruptions.\nMoney managers have raised the bullish positions in WTI and Brent crude futures and options to a record, according to data from the U.S. Commodity Futures Trading Commission and the Intercontinental Exchange.\nBMI Research said “seasonally high refining run rates” from the northern hemisphere winter season “are set to fall substantially” as the end of winter approaches.\nBrent spot crude futures contracts have already moved out of winter, now trading for March delivery.\n“This will act as a substantial drag on global crude demand in Q1 and feeds into our bearish short-term outlook on Brent,” BMI said.\nStill, traders and analysts said overall oil markets were well supported, and steep price falls unlikely.\nThe Organization of the Petroleum Exporting Countries (OPEC) and Russia have been withholding production since January last year and the cuts are set to last through 2018.\nThis restraint has coincided with healthy oil demand.\n“Oil remains underpinned by the solid economy with strong oil demand tightening global oil inventories. The past years’ surplus supplies are slowly disappearing,” Ruecker said.\nOne factor that in 2017 prevented crude prices from rising further was a surge in U.S. production.\nDespite a recent drop due to extreme cold, U.S. crude output C-OUT-T-EIA is expected to soon break through 10 million barrels per day (bpd), challenging top producers Russia and Saudi Arabia.\nReporting by Henning Gloystein; Editing by Christian Schmollinger and Richard Pullin\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T09:57:00.000+02:00", "crawled": "2018-01-17T10:47:22.017+02:00", "highlightTitle": ""}