{"organizations": [], "uuid": "392345ac00aca90e004982ab3a0c40eff7315060", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 66, "shares": 66, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180113&t=2&i=1221682471&w=1200&r=LYNXMPEE0C086", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-safrica-politics/south-africa-open-for-investment-new-anc-leader-ramaphosa-says-idUSKBN1F20CH", "country": "US", "domain_rank": 408, "title": "South Africa 'open for investment', new ANC leader Ramaphosa says", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T12:56:00.000+02:00", "replies_count": 0, "uuid": "392345ac00aca90e004982ab3a0c40eff7315060"}, "author": "", "url": "https://www.reuters.com/article/us-safrica-politics/south-africa-open-for-investment-new-anc-leader-ramaphosa-says-idUSKBN1F20CH", "ord_in_thread": 0, "title": "South Africa 'open for investment', new ANC leader Ramaphosa says", "locations": [], "entities": {"persons": [{"name": "ramaphosa", "sentiment": "neutral"}, {"name": "alexander smith", "sentiment": "none"}, {"name": "ed stoddard", "sentiment": "none"}, {"name": "cyril ramaphosa", "sentiment": "none"}, {"name": "jacob zuma", "sentiment": "none"}, {"name": "alexander winning", "sentiment": "none"}], "locations": [{"name": "south africa", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "east london", "sentiment": "none"}], "organizations": [{"name": "anc", "sentiment": "neutral"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "african national congress", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "EAST LONDON, South Africa (Reuters) - South Africa wants to attract foreign investors to help it kick-start economic growth and will crack down on corruption, the new leader of the ruling African National Congress said on Saturday.\nCyril Ramaphosa, who narrowly won the race to succeed President Jacob Zuma as ANC leader last month, also used a speech to mark 106 years since the founding of Africa’s oldest liberation movement to call for party unity after a bitter leadership contest.\nSouth Africa’s economy has slowed to a near-standstill over Zuma’s two presidential terms, as allegations of influence-peddling in government and mismanagement of state-owned enterprises have dented consumer and business confidence.\nBut Ramaphosa’s election win has injected a sense of optimism that the ANC, which has governed South Africa since the end of apartheid in 1994, could win back the trust of voters and investors disillusioned with Zuma’s rule.\nRamaphosa, 65, a former trade union leader and one of the country’s wealthiest businessmen, pledged during his campaign for ANC leader to address record unemployment and a sluggish economy.\n“South Africa is open for investment,” he told tens of thousands of cheering ANC members in a stadium in the Eastern Cape province on Saturday. Through foreign investment “we can grow our economy, create jobs, end poverty,” he said.\n“We must have an economy that offers policy certainty and addresses areas that inhibit investment, growth as well as social inclusion.”\nRamaphosa reassured investors that the role, mandate and independence of the central bank would be maintained while plans for free higher education for the poor would be implemented gradually so as to safeguard public finances.\nThe ANC needs to follow the example of liberation hero Nelson Mandela to unite the country and combat the racial inequalities that persist to this day, he added.\nPresident of the ANC Cyril Ramaphosa waves to supporters ahead of the ANC's 106th anniversary celebrations, in East London, South Africa, January 13, 2018. REUTERS/Siphiwe Sibeko Ramaphosa faces a difficult balancing act as he must accommodate the competing interests of rival ANC factions vying for control of the party. One faction backed his bid for ANC leader, while another favored Nkosazana Dlamini-Zuma, a former cabinet minister and ex-wife of Zuma.\nZUMA‘S FUTURE\nThere has been widespread speculation that Ramaphosa and his allies are lobbying ANC members to oust Zuma as head of state in the coming weeks, but he made no mention of Zuma’s future.\nSlideshow (10 Images) Zuma, 75, sat alongside Kenyan President Uhuru Kenyatta to hear Ramaphosa speak and was booed on several occasions during Saturday’s anniversary celebrations.\nZuma’s second presidential term doesn’t officially end until 2019 when national elections will be held, but he could be removed early through a motion of no confidence in parliament or at a meeting of the ANC’s national executive committee.\nRamaphosa welcomed Zuma’s recent announcement that there would be an inquiry into influence-peddling in government and said it was a top priority for those responsible to be prosecuted.\nZuma has denied allegations that he has allowed his friends to influence the appointment of ministers. Ramaphosa said that corruption in the private sector was also an important issue.\nANC member Vanita Kok, from the Khoisan royal house, said Ramaphosa’s message struck a chord because “corruption is rife”.\nWhile markets have rallied since Ramaphosa’s victory, some analysts are skeptical he will deliver on his bold promises.\nGwen Ngwenya, an economist at South Africa’s Institute of Race Relations, said: “Ramaphosa is hamstrung by the need to ensure unity, and this will result in confused policymaking.”\nReporting by Ed Stoddard; Writing by Alexander Winning; Editing by Alexander Smith and Clelia Oziel\n ", "external_links": [], "published": "2018-01-13T12:56:00.000+02:00", "crawled": "2018-01-13T13:18:21.013+02:00", "highlightTitle": ""}