{"organizations": [], "uuid": "c90782ead50e3ee11ff5e04c5edddcb27c52a2e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220124996&w=1200&r=LYNXMPEE07001", "site_section": "http://feeds.reuters.com/reuters/businessNews", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-global-markets/asia-stocks-near-historic-highs-u-s-earnings-loom-idUSKBN1EX00H", "country": "US", "domain_rank": 408, "title": "Asia stocks near historic highs, U.S. earnings loom", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T02:25:00.000+02:00", "replies_count": 0, "uuid": "c90782ead50e3ee11ff5e04c5edddcb27c52a2e9"}, "author": "", "url": "https://www.reuters.com/article/us-global-markets/asia-stocks-near-historic-highs-u-s-earnings-loom-idUSKBN1EX00H", "ord_in_thread": 0, "title": "Asia stocks near historic highs, U.S. earnings loom", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "asia-pacific", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}], "organizations": [{"name": "wall street", "sentiment": "none"}, {"name": "bank of america merrill lynch", "sentiment": "none"}, {"name": "msci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 12:25 AM / Updated 2 minutes ago S&P 500 extends new year's gains; dollar up as euro falters Caroline Valetkevitch 4 Min Read \nNEW YORK (Reuters) - The S&P 500 edged up for a fifth straight session on Monday, extending its winning streak for the new year, while the dollar hit its highest level in more than a week against a basket of currencies as the euro’s rally faltered. \nA global index of equities also rose slightly. The S&P 500 is now up 2.8 percent since Dec. 31 after rising 19.4 percent in 2017. \nHistorically, the first five days of January can be an indicator for the market’s direction for the full year, according to the Stock Traders Almanac. \nAttention in the United States now turns to the quarterly earnings season, with investors expected to focus on what U.S. companies will say about the recently approved tax overhaul and corporate tax cuts. Results from JPMorgan Chase ( JPM.N ) are due Friday. \n“We had a big move last week and everyone knows earnings is coming up. People don’t want to chase too much further when you have a round of fundamental inputs in the next few weeks,” said Michael O‘Rourke, chief market strategist at JonesTrading in Greenwich, Connecticut. \nThe Dow Jones Industrial Average .DJI fell 12.87 points, or 0.05 percent, to 25,283, the S&P 500 .SPX gained 4.56 points, or 0.17 percent, to 2,747.71 and the Nasdaq Composite .IXIC added 20.83 points, or 0.29 percent, to 7,157.39. \nWith the New Year’s Day holiday falling on a Monday this year, there were only four trading days last week. \nThe pan-European FTSEurofirst 300 index .FTEU3 rose 0.23 percent and MSCI's gauge of stocks across the globe .MIWD PUS gained 0.11 percent. \nA surprise dip in German industrial orders, which fell in November for the first time since July, appeared unlikely to dent growing confidence in the euro zone’s biggest economy after a strong run of positive economic news. Slideshow (2 Images) \nInvestors took profits in the euro after the common currency’s recent rally. \nThe dollar index .DXY, which measures the greenback against six rival currencies, was up 0.42 percent at 92.338. The euro EUR= slipped 0.52 to $1.1966. The euro hit a nearly four-month high of $1.2089 last week. \n“It’s a little bit of profit taking and some healthy correction going on the euro’s side, which is driving some of the dollar trades,” said Brad Bechtel, managing director FX at Jefferies in New York. \nIn the U.S. Treasury market, bond yields were little changed after a boost from stronger German government debt and a Federal Reserve official’s remarks that the U.S. central bank may only raise interest rates two times this year. \nBenchmark 10-year notes US10YT=RR last fell 1/32 in price to yield 2.48 percent, from 2.476 percent late on Friday. \nOil prices ended up slightly as protests in Iran and the arrests of 11 princes in Saudi Arabia offset projections for higher U.S. oil production. \nU.S. crude CLc1 rose 29 cents to settle at $61.73 a barrel, while Brent crude LCOc1 gained 16 cents to settle at $67.78. \nGold retreated from last week’s 3-1/2-month high as the U.S. dollar regained some ground against the euro. Spot gold XAU= was down 0.1 percent at $1,318.84 an ounce. \nFor Reuters Live Markets blog on European and UK stock markets, open a news window on Reuters Eikon by pressing F9 and type in ‘Live Markets’ in the search bar. Additional reporting by Sinead Carew, Saqib Iqbal Ahmed and Kate Duguid in New York and Wayne Cole in Sydney; Editing by Nick Zieminski and James Dalgleish", "external_links": [], "published": "2018-01-08T02:25:00.000+02:00", "crawled": "2018-01-08T02:36:29.002+02:00", "highlightTitle": ""}