{"organizations": [], "uuid": "645a6e790f4ccd1552d814ec7c2fac1e50f35148", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 284, "shares": 284, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://images.wsj.net/im-1660/social", "site_section": "http://online.wsj.com/xml/rss/3_7087.xml", "section_title": "WSJ.com: Politics And Policy", "url": "https://www.wsj.com/articles/trump-tries-taking-on-a-new-role-optimist-1517371199", "country": "US", "domain_rank": 387, "title": "Trump Tries Taking On a New Role: Optimist", "performance_score": 2, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T06:39:00.000+02:00", "replies_count": 0, "uuid": "645a6e790f4ccd1552d814ec7c2fac1e50f35148"}, "author": "Gerald F. Seib", "url": "https://www.wsj.com/articles/trump-tries-taking-on-a-new-role-optimist-1517371199", "ord_in_thread": 0, "title": "Trump Tries Taking On a New Role: Optimist", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "446 COMMENTS In the year since President Donald Trump took office, voters have frequently seen the angry Trump, the divisive Trump, and occasionally the reserved Trump. On Tuesday night, the president wanted voters to see something different: the optimistic Trump.\nIn his first official State of the Union address , Mr. Trump presented his own relentlessly upbeat picture of the country, its economy and its prospects. “Exciting progress is happening every day,” he declared.\nJobs are returning, business confidence is high and the stock market has added $8 trillion in value, he said. “Together, we are rediscovering the American way,” he proclaimed.\nMr. Trump called out more than a dozen average Americans in the audience as heroes and role models. The darkest cloud hanging over his administration, the investigation of Russian interference in the 2016 election, went unmentioned.\nAnd, in a capital that during his term has been riven by division and polarization—often aggravated by Mr. Trump’s own barbed comments—he insisted he could see the possibility of unity: “Tonight, I call upon all of us to set aside our differences, to seek out common ground, and to summon the unity we need to deliver for the people we were elected to serve.” Rather than unity, though, Democrats, saw more divisiveness sown by the president’s description of immigrants as criminals and gang members.\nRelated Trump Calls for Bipartisan Deals; Fights Loom Lawmakers Not Sold on Trump’s ‘Fair Compromise’ on Immigration Democrats Spurn Trump’s Vision Guantanamo Bay to Remain Open Trump’s North Korean Defector: The Harrowing Full Story Recap: Trump’s State of the Union Address Transcript of the Speech All told, his speech was a long distance from Mr. Trump’s dark inaugural address last January, when he painted a picture of what he called “American carnage,” of “rusted-out factories,” plagues of crime and gang warfare. It was as relentlessly dark as Tuesday night’s speech was upbeat.\nTaken as a whole, the speech may represent an attempt by the president to change the capital’s tone—though critics will note that steps in that direction often have been upended in short order by presidential tweets and off-the-cuff remarks. He steered clear of some of the enemies who have been the targets of recent attacks, including the press and the leaders of his own government’s top law-enforcement agency, the Federal Bureau of Investigation.\nCertainly the body language of Democrats suggested they weren’t ready to buy in. They were particularly grim during Mr. Trump’s discussion of immigration , the issue that is driving the most emotional divides between the two parties now. Mr. Trump dwelt at length on the crimes of MS-13, a Central America-based gang, and held up its actions as the rationale for reducing legal immigration programs—an assertion that drew Democratic grumbling.\nHe then laid out a compromise the White House advanced late last week, offering a path to citizenship for young immigrants brought here as children in return for funding for a wall along the Southern border and an end to existing visa-lottery and family-migration policies. Again, Democrats appeared unmoved.\nPresident Donald Trump's first State of the Union focused on infrastructure, immigration and the strength of Americans. Watch the highlights in three minutes. Photo: Getty Judging by his own words before the speech, Mr. Trump’s two great frustrations in his first year in office are that he doesn’t get more credit for a good economy, and that the dark cloud of special counsel Robert Mueller’s investigation of Russia’s actions in the 2016 campaign just won’t go away.\nThere was little Mr. Trump could do about the latter in his State of the Union address, so instead he focused much of his attention on the former, pointing to a good economy and calling it his own.\nIn an extended passage of his remarks, he touted in particular the virtues of the big tax-cut legislation passed late last year by Republican votes. “Since we passed tax cuts, roughly three million workers have already gotten tax-cut bonuses—many of them thousands of dollars per worker,” he said.\nOne of the anomalies of Mr. Trump’s presidency so far is that he appears to get little political boost from a generally good economy (though one marred a bit by a nasty stock-market dip in the last two days). The president’s job-approval stands at just 39% in the latest Wall Street Journal/NBC News poll this month and has basically been stuck at roughly that level for the last 10 months.\nTrump’s State of the Union in Superlatives That is more than 20 points below the average for all modern presidents one year into office. Moreover, his job-approval rating has remained stuck despite the fact that the share of Americans who say they are satisfied with the economy has risen to 69% from 56% last spring.\nNewsletter Sign-up Woven into these numbers are two problems for the president. The first is that while the economy clearly has been good, it actually hasn’t been booming. Unemployment has dropped to 4.1% from 4.8% since Mr. Trump took office, and the economy added a solid 2.1 million jobs last year. Yet that actually represents the lowest level of annual job growth since 2010. Gross domestic product grew 2.3% last year, above 1.5% in 2016 but below the 2.9% gain in 2015.\nThe second is that Mr. Trump often gets in the way of his own good news. He creates controversies and fights that, while they keep attention focused on him, have the effect of distracting attention from good economic news. It’s far from clear that Tuesday’s upbeat speech will represent a change in that pattern.\nWrite to Gerald F. Seib at jerry.seib@wsj.com", "external_links": [], "published": "2018-01-31T06:39:00.000+02:00", "crawled": "2018-01-31T08:47:12.008+02:00", "highlightTitle": ""}