{"organizations": [], "uuid": "9cf2fcaf9bf34e52f137ce3681116b5ae52669bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225075726&w=1200&r=LYNXMPEE0O0DX", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-bulgaria-government/bulgarian-government-survives-no-confidence-vote-over-corruption-idUSKBN1FE0UU", "country": "US", "domain_rank": 408, "title": "Bulgarian government survives no-confidence vote over corruption", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T10:33:00.000+02:00", "replies_count": 0, "uuid": "9cf2fcaf9bf34e52f137ce3681116b5ae52669bb"}, "author": "", "url": "https://www.reuters.com/article/us-bulgaria-government/bulgarian-government-survives-no-confidence-vote-over-corruption-idUSKBN1FE0UU", "ord_in_thread": 0, "title": "Bulgarian government survives no-confidence vote over corruption", "locations": [], "entities": {"persons": [{"name": "boyko borissov", "sentiment": "none"}, {"name": "borissov", "sentiment": "none"}], "locations": [{"name": "sofia", "sentiment": "none"}, {"name": "bulgaria", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "transparency international", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "gerb", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 8:34 AM / in 8 minutes Bulgarian government survives no-confidence vote over corruption Reuters Staff 2 Min Read \nSOFIA (Reuters) - The Bulgarian government on Thursday survived a parliamentary vote of no-confidence brought by the opposition Socialists over what they said was a lack of progress in fighting rampant corruption. \nSome 103 deputies in the 240-seat parliament voted in favor of the first no-confidence vote against the center-right coalition cabinet led by Prime Minister Boyko Borissov, while 131 deputies opposed it. \nThe vote was overcome easily as the Borissov’s ruling GERB party holds a majority, albeit it fragile, in the chamber with its nationalist partners and also enjoys the support of a small populist party. \nBulgaria, currently holding the European Union’s rotating presidency, ranks as the bloc’s most corrupt member state according to Transparency International’s 2016 Corruption Perceptions Index. \nThe Socialists accused the government of doing close to nothing since taking office last May to bring high level corrupt officials behind bars and for passing anti-graft legislation which they believe would not yield the needed results. \nThe European Commission has repeatedly rebuked Bulgaria, an ex-communist nation of 7.1 million, for failing to uproot graft and for being too slow to overhaul its judiciary. \nCorruption has reduced much needed foreign investment in the country and is among the main reasons for some fellow European Union countries to oppose Bulgaria’s entry into the Schengen zone of passport-free travel and to the euro zone. \nThe government says new legislation will give the tools the country needs to crack down on graft. Speaking to EU deputies last week, Borissov pledged to deliver tangible results in the fight against corruption in two to three years. \nAnalysts say Borissov’s government is likely to withstand pressures in the near term but it would face difficult months ahead in trying to balance the interests within the ruling coalition and pressures coming from environmental protests. Reporting by Tsvetelia Tsolova and Angel Krasimirov; Editing by Toby Chopra/Jeremy Gaunt", "external_links": [], "published": "2018-01-25T10:33:00.000+02:00", "crawled": "2018-01-25T10:45:50.025+02:00", "highlightTitle": ""}