{"organizations": [], "uuid": "97f05df28d85f220f13b80ce29d32438595521d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-dunkin-brands-promotes-scott-murphy-to-coo-dunkin-u-s-and-hires-restaurant-veteran-rick-colan-as-senior-vice-president.html", "country": "US", "domain_rank": 767, "title": "Dunkin' Brands Promotes Scott Murphy To COO Dunkin' U.S. And Hires Restaurant Veteran Rick Colón As Senior Vice President, Operations & Development", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T00:15:00.000+02:00", "replies_count": 0, "uuid": "97f05df28d85f220f13b80ce29d32438595521d7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-dunkin-brands-promotes-scott-murphy-to-coo-dunkin-u-s-and-hires-restaurant-veteran-rick-colan-as-senior-vice-president.html", "ord_in_thread": 0, "title": "Dunkin' Brands Promotes Scott Murphy To COO Dunkin' U.S. And Hires Restaurant Veteran Rick Colón As Senior Vice President, Operations & Development", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CANTON, Mass., Jan. 8, 2018 /PRNewswire/ -- In support of its mission to eventually have 18,000 Dunkin' Donuts restaurants in the U.S., Dunkin' Brands Group, Inc., (Nasdaq: DNKN), the parent company of Dunkin' Donuts and Baskin-Robbins, today announced that it has strengthened its executive operations team. With a focus on becoming the country's leading beverage-led, on-the-go brand, the Company has promoted Scott Murphy, 45, to Chief Operating Officer (COO) Dunkin' Donuts U.S. and appointed veteran restaurant executive Rick Colón, 56, to the newly-created position of Senior Vice President, Operations & Development for Dunkin' Donuts U.S. Mr. Colón will report to Scott Murphy, who will continue to report to David Hoffmann, President, Dunkin' Donuts U.S.\nThe Company also said it was moving responsibility for restaurant development and construction to the operations team under Mr. Murphy and Mr.Colón in order to make quicker and better market-based decisions as it expands its footprint across the country.\nMr. Murphy joined Dunkin' Brands in 2004 and most recently served as Senior Vice President, Operations, Dunkin' Donuts U.S. In this role, Mr. Murphy oversaw the field operations of more than 8,500 Dunkin' Donuts restaurants in the U.S., as well as the manufacturing and supply chain functions. In his new position, he will assume the additional responsibility of executing the annual restaurant development plan.\nMr. Colón comes to Dunkin' Brands following a successful career with McDonald's Corporation that spanned nearly 40 years. He began working in the restaurants as a teenager and eventually worked in leadership positions, first, for a large franchised organization and then for the corporation, helping to guide and accelerate numerous business turn-arounds. He rose to the position of East Division President with responsibility for thousands of stores across New England, New York and the eastern seaboard, and finally was named South Zone President where he had responsibility for 4,000 restaurants and $11 billion in systemwide sales across eleven states. Throughout his time with the company, Mr. Colon's business units consistently achieved year-over-year revenue growth and profitability and optimized shareholder value.\n\"Scott and Rick are innovative, inspirational leaders who understand every aspect of the restaurant industry, including most importantly driving operational excellence, people development and franchisee profitability,\" said Dave Hoffmann. \"Each has a unique blend of store operations and general management experience, and both are eminently qualified to help us capitalize on our tremendous growth opportunities. I am confident that in their new roles they will enable us to continue to better support our franchisees, better serve our guests and accelerate the development of Dunkin' Donuts restaurants as we push to become the country's leading beverage-led, on-the-go brand.\"\nDuring his nearly 14 years with Dunkin' Brands, Mr. Murphy has served in a variety of positions, beginning in supply chain where he was ultimately named Chief Supply Officer. For ten years Mr. Murphy also served on the Board of Directors for the National DCP, the Dunkin' Donuts franchisee-owned procurement and distribution cooperative. He began working in international restaurant operations in 2013 and was named Senior Vice President, Dunkin' Donuts U.S. in 2015. Mr. Murphy earned his Bachelor of Science degree from Georgetown University and his M.B.A. from the MIT Sloan School of Management.\nIn his nearly four decades with McDonald's, Mr. Colón served in a number of key leadership roles in the U.S., including Zone President for McDonald's South Zone, Division President and Senior Vice President for the McDonald's East Division, and Vice President and General Manager for the New York Metro and Greater Southwest Regions. In those positions, he was responsible for all aspects of managing the restaurants, including operations, finance, restaurant development, franchising, marketing, human resources, supply chain, government relations, and communications. A long-time champion for diversity and inclusion, Mr. Colón is the recipient of numerous industry and corporate awards. He remains active in the community and serves on numerous non-profit, hospital, and healthcare boards.\nAbout Dunkin' Brands Group, Inc.\nWith more than 20,000 points of distribution in more than 60 countries worldwide, Dunkin' Brands Group, Inc. (Nasdaq: DNKN) is one of the world's leading franchisors of quick service restaurants (QSR) serving hot and cold coffee and baked goods, as well as hard-serve ice cream. At the end of the third quarter 2017, Dunkin' Brands' 100 percent franchised business model included more than 12,400 Dunkin' Donuts restaurants and more than 7,900 Baskin-Robbins restaurants. Dunkin' Brands Group, Inc. is headquartered in Canton, Mass.\nView original content with multimedia: http://www.prnewswire.com/news-releases/dunkin-brands-promotes-scott-murphy-to-coo-dunkin-us-and-hires-restaurant-veteran-rick-colon-as-senior-vice-president-operations--development-300579227.html\nSOURCE Dunkin' Brands Group, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/dunkin-brands-promotes-scott-murphy-to-coo-dunkin-us-and-hires-restaurant-veteran-rick-colon-as-senior-vice-president-operations--development-300579227.html"], "published": "2018-01-09T00:15:00.000+02:00", "crawled": "2018-01-09T10:13:58.826+02:00", "highlightTitle": ""}