{"organizations": [], "uuid": "cb2ab4ff92a92de07c13df18083f77fe2a0d2b1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/07/gettyimages-818918912.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/31/elon-musk-flamethrower-banned/", "country": "US", "domain_rank": 1196, "title": "Elon Musk's Flamethrower Could Be Banned in California | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.612, "site_type": "news", "published": "2018-01-31T12:14:00.000+02:00", "replies_count": 0, "uuid": "cb2ab4ff92a92de07c13df18083f77fe2a0d2b1d"}, "author": "Chris Morris", "url": "http://fortune.com/2018/01/31/elon-musk-flamethrower-banned/", "ord_in_thread": 0, "title": "Elon Musk's Flamethrower Could Be Banned in California | Fortune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Chris Morris 10:14 AM EST \nElon Musk has now made nearly $9 million from the sale of flamethrowers —and his Boring Company is nearly sold out of the product. But Musk’s product has just hit a bump in the road. A California assemblyman says he intends to introduce legislation that would prevent the sale of the sought-after item. \nMiguel Santiago (D-Los Angeles) is leading the charge against flamethrower sales. And while his bill would only impact sales in California, it could nudge other states to reconsider sales, even though Musk says the flamethrowers are legal according to standards set by the Bureau of Alcohol, Tobacco, Firearms and Explosives. ATF says any flamethrower with a flame shorter than 10 ft is A-ok. Our design is max fun for least danger. I’d be way more scared of a steak knife. \n— Elon Musk (@elonmusk) January 28, 2018 \nSantiago, in a statement quoted by a Los Angeles Times writer on Twitter, said the technical legality of the flamethrowers doesn’t matter to him. \n“I honestly thought it was a joke when the article was read to me—while I was sitting in Los Angeles traffic,” he said. “The state of California and county and city of Los Angeles have entrusted Mr. Musk to help alleviate a real public policy problem here by executing a tunnel under the city to help alleviate traffic. This deviation feels like a complete slap in the face….I cannot even begin to imagine the problems a flamethrower would cause firefighters and police officers alike.” \nMusk didn’t specifically address Santiago’s complaints, but did tweet a link to the song “I Don’t Want to Set the World on Fire” by The Ink Spots. \n— Elon Musk (@elonmusk) January 31, 2018 \nSantiago’s objections aside, sales of the flamethrower continue to be, well, hot. Tuesday evening, Musk said the updated sales total had hit 17,500 units—with 2,000 still available. 17.5k, so 2.k left \n— Elon Musk (@elonmusk) January 31, 2018 \nGiven the pace of sales, the flamethrowers may be sold out at some point today. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-31T12:14:00.000+02:00", "crawled": "2018-01-31T18:40:47.007+02:00", "highlightTitle": ""}