{"organizations": [], "uuid": "6783ec072799c66f7d1519003c676c16b43b4fe3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/business-wire-kindred-announces-spin-off-of-agi-research-division.html", "country": "US", "domain_rank": 767, "title": "Kindred Announces Spin-off of AGI Research Division", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T20:00:00.000+02:00", "replies_count": 0, "uuid": "6783ec072799c66f7d1519003c676c16b43b4fe3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/business-wire-kindred-announces-spin-off-of-agi-research-division.html", "ord_in_thread": 0, "title": "Kindred Announces Spin-off of AGI Research Division", "locations": [], "entities": {"persons": [{"name": "geordie rose", "sentiment": "none"}, {"name": "suzanne gildert", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "vancouver", "sentiment": "none"}], "organizations": [{"name": "agi research division continues", "sentiment": "negative"}, {"name": "agi", "sentiment": "none"}, {"name": "artificial general intelligence", "sentiment": "none"}, {"name": "kindred systems inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Continues focus on commercial applications of human-like intelligence in machines\nSAN FRANCISCO--(BUSINESS WIRE)-- Kindred Systems Inc. was founded with the mission of creating human-like intelligence in machines and vision to commercialize its research work in tandem. Over the past few years, Kindred’s Product and Artificial General Intelligence (AGI) divisions have accomplished a tremendous amount in their respective domains, working independently to allow each team to optimize for their objectives.\nThe company has reached a point in its evolution where spinning off the AGI division maximizes the likelihood of success for both divisions, as well as returns to Kindred shareholders.\nGeordie Rose is stepping down as CEO and President of Kindred to lead this new entity named Sanctuary based in Vancouver, Canada. Kindred co-founder Suzanne Gildert will also be stepping down from her role as Chief Science Officer and will join Sanctuary as co-CEO. Sanctuary’s focus is on the implementation and testing of a specific framework for artificial general intelligence. The new entity will license some of Kindred’s patents and software, and Kindred will maintain a minority ownership in Sanctuary.\nKindred’s Board of Directors has appointed Jim Liefer, previously the company’s COO, to serve as CEO and President. As COO, Liefer brought strong executive leadership alongside co-founder, George Babu, for the development and deployment of Kindred’s first commercial product Sort, and will continue to lead the company in its mission to research and develop human-like intelligence in machines. The Kindred team in Toronto will continue its applied research in machine and reinforcement learning, with the San Francisco office focused on robotics, product development and commercialization.\nWith Kindred Sort, the company aims to alleviate the massive pressures facing the retail and fulfillment industry, which includes significant online sales growth, labor shortages, and a lack of advancement in technology. Kindred Sort allows retailers to manage the exploding growth and demand of this sector more efficiently. During the 2017 holiday season, Kindred’s robots sorted thousands of items ordered at speeds averaging over 410 units per hour, and reaching peak speeds of over 531 units per hour, freeing human workers to perform other parts of the fulfillment process critical to meet growing customer demand.\n“Kindred will maintain its commitment to building human-like intelligence in machines and applying those learnings to create and teach a new intelligent class of robots that will enhance the quality of our day-to-day lives, and in particular, the way we work,” said Liefer. “We look forward to advancing Kindred Sort, achieving new AI and robotic milestones while also helping to drive retail and other industries forward.”\nBabu, Kindred co-founder and Chief Product Officer will be joining Liefer on Kindred’s Board of Directors. Babu will continue to oversee product strategy and the expansion of Kindred’s partnerships and pilot programs with major global retailers.\nAbout Kindred\nKindred Systems Inc.’s mission is to build machines with human-like intelligence. The company’s central thesis is that intelligence requires a body. Since its founding in 2014, Kindred has been exploring and engineering systems that enable robots to understand and participate in our world, with the ultimate goal of a future where intelligent machines work together with people. Kindred is headquartered in San Francisco with an office in Toronto.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180105005243/en/\nThe Hatch Agency\nJudy Huang\nkindred.ai@thehatchagency.com\nSource: Kindred Systems Inc.", "external_links": ["http://www.businesswire.com/news/home/20180105005243/en/"], "published": "2018-01-05T20:00:00.000+02:00", "crawled": "2018-01-05T20:12:41.003+02:00", "highlightTitle": ""}