{"organizations": [], "uuid": "218ef91385d1a6d4ad18e18f730aa7a34973c75c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-varian-reports-results-for-first-quarter-of-fiscal-year-2018.html", "country": "US", "domain_rank": 767, "title": "Varian Reports Results for First Quarter of Fiscal Year 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T00:09:00.000+02:00", "replies_count": 0, "uuid": "218ef91385d1a6d4ad18e18f730aa7a34973c75c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-varian-reports-results-for-first-quarter-of-fiscal-year-2018.html", "ord_in_thread": 0, "title": "Varian Reports Results for First Quarter of Fiscal Year 2018", "locations": [], "entities": {"persons": [{"name": "varian", "sentiment": "none"}], "locations": [{"name": "palo alto", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "varian reports results", "sentiment": "negative"}, {"name": "proton", "sentiment": "none"}, {"name": "gaap", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PALO ALTO, Calif., Jan. 24, 2018 /PRNewswire/ --\nFirst Quarter 2018 Summary\nRevenues of $679 million grew 13 percent Oncology gross orders grew 7 percent; booked 2 new Proton orders GAAP operating earnings of 17.9 percent of revenues; Non-GAAP of 18.6 percent GAAP net loss per diluted share from continuing operations of ($1.22), which reflects the impact of the new Tax Cuts and Jobs Act; Non-GAAP net earnings per diluted share from continuing operations of $1.06\nVarian (NYSE: VAR) today announced its first-quarter fiscal year 2018 results. All comparisons in this announcement are year-over-year unless noted otherwise. As a reminder, Varian adopted revenue Accounting Standard Codification 606 at the beginning of fiscal year 2018. First quarter fiscal year 2018 also reflects the impact from the new Tax Cuts and Jobs Act. As such the GAAP effective tax rate for the first quarter is 191.5 percent; Non-GAAP effective tax rate is 22.5 percent, which excludes the tax expense due to the mandatory deemed repatriation of foreign earnings and lower corporate tax rate's impact on our deferred tax assets. The results that we disclose today, and any forward-looking statements, including guidance, reflect the new accounting standard and tax legislation.\nSummary\n($ in millions except EPS)\nQ1 2018\nQ1 2017\nRevenues (from Continuing Operations)\n$\n678.5\n$\n601.5\nGross Margin\n44.6\n%\n44.4\n%\nGAAP Net (Loss) Earnings (1)\n$\n(112.2)\n$\n8.0\nGAAP Net (Loss) Earnings per Diluted Share (1)\n$\n(1.22)\n$\n0.08\nNet Cash Provided by Operating Activities\n$\n179.0\n$\n82.2\nNon-GAAP Net Earnings (1) (2)\n$\n98.4\n$\n47.5\nNon-GAAP Net Earnings per Diluted Share (1) (2)\n$\n1.06\n$\n0.50\n(1)\nGAAP Net (Loss) Earnings and Net (Loss) Earnings Per Diluted Share and Non-GAAP Net Earnings and Non-GAAP Net Earnings Per Diluted Share refer only to continuing operations. For the quarter ended December 29, 2017, GAAP and Non-GAAP Net Earnings Per Diluted Share were calculated based on diluted shares of 91.6 million and 92.7 million, respectively. For the quarter ended December 30, 2016, the number of diluted shares was 94.2 million.\n(2)\nNon-GAAP Net Earnings and Non-GAAP Net Earnings Per Diluted Share are defined as GAAP Net (Loss) Earnings and GAAP Net (Loss) Earnings Per Diluted Share adjusted to exclude the amortization of intangible assets, acquisition-related expenses and benefits, restructuring and impairment charges, and significant litigation charges or benefits, legal costs and significant effects of the new tax legislation.\n\"We are very pleased with the strong start to the new fiscal year,\" said Dow Wilson, Chief Executive Officer of Varian. \"We generated healthy orders, revenues and operating earnings growth in our Oncology business, and added two more proton therapy orders.\"\nThe company ended the quarter with $823 million in cash and cash equivalents and $340 million of debt. Net cash provided by operating activities was $179 million. During the quarter, the company invested $57 million to repurchase 525,000 shares of common stock.\n\"I'm delighted with our operational focus and execution in delivering these strong financial results during the quarter\" added Gary E. Bischoping Jr., Chief Financial Officer of Varian.\nOncology Systems Segment\nIn the fiscal first quarter, Oncology revenues for the segment totaled $649 million, up 14 percent in dollars and 12 percent in constant currency. Gross orders were $620 million, up 7 percent in dollars and 6 percent in constant currency. Gross orders in the Americas increased 2 percent in dollars and in constant currency. In EMEA, gross orders rose 19 percent in dollars and 13 percent in constant currency, to $190 million; in APAC gross orders increased 6 percent in dollars and in constant currency with strong orders growth in Greater China and Japan. Operating earnings for the segment increased 19 percent.\nParticle Therapy Segment\nRevenues in the first quarter were $29 million, down 4 percent. In the quarter, the company booked ProBeam™ Compact orders from the University of Alabama at Birmingham and the Sylvester Comprehensive Cancer Center at the University of Miami totaling $46 million.\nFY18 Annual Guidance Updated\nConsidering the financial and operational performance in the first quarter, and the impact of the new Tax Cuts and Jobs Act, fiscal year 2018 guidance is updated and increased to the following:\nRevenue growth range of 4 percent to 7 percent Non-GAAP Operating earnings as a percentage of revenues range of 18 percent to 19 percent Non-GAAP effective tax rate of 21 percent Weighted average diluted shares of 93 million Non-GAAP Earnings per diluted share range of $4.24 to $4.36 Cash flow from operations range of $475 million to $550 million\nPlease refer to \"Discussion of Non-GAAP Financial Measures\" below for a description of items excluded from expected non-GAAP earnings.\nInvestor Conference Call\nVarian Medical Systems is scheduled to conduct its first quarter fiscal year 2018 conference call at 2 p.m. PT today. To hear a live webcast or replay of the call, visit the investor relations page on our web site at www.varian.com/investor where it will be archived for a year. To access the call via telephone, dial 1-877-869-3847 from inside the U.S. or 1-201-689-8261 from outside the U.S. The replay can be accessed by dialing 1-877-660-6853 from inside the U.S. or 1-201-612-7415 from outside the U.S. and entering confirmation code 13674372. The telephone through 5 p.m. PT, Friday, January 26, 2018.\nAbout Varian\nVarian is a leader in developing and delivering cancer care solutions, and is focused on creating a world without fear of cancer. Headquartered in Palo Alto, California, Varian employs approximately 6,500 people around the world. For more information, visit http://www.varian.com and follow @VarianMedSys on Twitter.\nForward-Looking Statements\nExcept for historical information, this news release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Statements concerning industry or market outlook, including growth drivers; the company's future orders, revenues, or earnings growth or other financial results; and any statements using the terms \"could,\" \"believe,\" \"expect,\" \"promising,\" \"outlook,\" \"should,\" \"will\" or similar statements are forward-looking statements that involve risks and uncertainties that could cause the company's actual results to differ materially from those anticipated. Such risks and uncertainties include global economic conditions and changes to trends for cancer treatment regionally; currency exchange rates and tax rates; the impact of the Tax Cuts and Jobs Act; the impact of the Affordable Health Care for America Act (including excise taxes on medical devices) and any further healthcare reforms (including changes to Medicare and Medicaid), and/or changes in third-party reimbursement levels; demand for and delays in delivery of the company's products; the company's ability to develop, commercialize and deploy new products; the company's ability to meet Food and Drug Administration (FDA) and other regulatory requirements, regulations or procedures; changes in regulatory environments; the company's assessment of the goodwill associated with its particle therapy business, risks associated with the company providing financing for the construction and start-up operations of particle therapy centers, challenges associated with commercializing the company's particle therapy business; challenges to public tender awards and the loss of such awards or other orders; the effect of adverse publicity; the company's reliance on sole or limited-source suppliers; the company's ability to maintain or increase margins; the impact of competitive products and pricing; the company's assessment of the goodwill associated with its particle therapy business; the potential loss of key distributors or key personnel; and the other risks listed from time to time in the company's filings with the Securities and Exchange Commission, which by this reference are incorporated herein. The company assumes no obligation to update or revise the forward-looking statements in this release because of new information, future events, or otherwise.\nVarian has not filed the Form 10-Q for the quarter ended December 29, 2017. As a result, all financial results described here should be considered preliminary, and are subject to change to reflect any necessary adjustments, or changes in accounting estimates, that are identified prior to the time the company completes these filings.\nVarian Medical Systems, Inc. and Subsidiaries\nPreliminary Condensed Consolidated Statements of Earnings\n(Unaudited)\nQ1\n2018\nQ1\n2017\n(Dollars and shares in millions, except per share amounts)\nGross orders\n$\n666.1\n$\n581.0\nOncology Systems\n619.9\n576.7\nParticle Therapy\n46.2\n4.3\nOrder Backlog\n3,020.8\n2,736.8\nRevenues\n678.5\n601.5\nOncology Systems\n649.4\n571.2\nParticle Therapy\n29.1\n30.3\nCost of revenues\n375.7\n334.5\nGross margin\n302.8\n267.0\nAs a percent of revenues\n44.6\n%\n44.4\n%\nOperating expenses\nResearch and development\n55.9\n49.9\nSelling, general and administrative\n125.5\n161.4\nImpairment charges\n—\n38.3\nOperating earnings\n121.4\n17.4\nAs a percent of revenues\n17.9\n%\n2.9\n%\nInterest income, net\n1.1\n1.9\nEarnings from continuing operations before taxes\n122.5\n19.3\nTaxes on earnings\n234.7\n11.3\nNet (loss) earnings from continuing operations\n(112.2)\n8.0\nNet earnings from discontinued operations\n—\n6.5\nNet (loss) earnings\n(112.2)\n14.5\nLess: Net earnings attributable to noncontrolling interests\n0.1\n0.6\nNet (loss) earnings attributable to Varian\n$\n(112.3)\n$\n13.9\nNet (loss) earnings per share - basic\nContinuing operations\n$\n(1.22)\n$\n0.08\nDiscontinued operations\n—\n0.07\nNet (loss) earnings per share - basic\n$\n(1.22)\n$\n0.15\nNet (loss) earnings per share - diluted\nContinuing operations\n$\n(1.22)\n$\n0.08\nDiscontinued operations\n—\n0.07\nNet (loss) earnings per share - diluted\n$\n(1.22)\n$\n0.15\nShares used in the calculation of net earnings per share:\nWeighted average shares outstanding - basic\n91.6\n93.5\nWeighted average shares outstanding - diluted\n91.6\n94.2\nVarian Medical Systems, Inc. and Subsidiaries\nPreliminary Condensed Consolidated Balance Sheets\n(Unaudited)\n(In millions)\nDecember 29,\n2017\nSeptember 29,\n2017 (1)\nAssets\nCurrent assets:\nCash and cash equivalents\n$\n822.6\n$\n716.2\nTrade and unbilled receivable, net\n854.3\n883.0\nInventories\n431.4\n417.7\nPrepaid expenses and other current assets\n206.2\n190.3\nCurrent assets of discontinued operations\n11.3\n11.1\nTotal current assets\n2,325.8\n2,218.3\nProperty, plant and equipment, net\n250.4\n255.3\nGoodwill\n223.4\n222.6\nIntangible assets\n65.6\n71.6\nDeferred tax assets\n112.8\n147.3\nOther assets\n296.0\n300.8\nTotal assets\n$\n3,274.0\n$\n3,215.9\nLiabilities and Equity\nCurrent liabilities:\nAccounts payable\n$\n152.0\n$\n162.3\nAccrued liabilities\n350.0\n374.9\nDeferred revenues\n746.5\n676.9\nShort-term borrowings\n340.0\n350.0\nCurrent liabilities of discontinued operations\n2.1\n2.5\nTotal current liabilities\n1,590.6\n1,566.6\nOther long-term liabilities\n292.4\n127.4\nTotal liabilities\n1,883.0\n1,694.0\nEquity:\nVarian stockholders' equity:\nCommon stock\n91.6\n91.7\nCapital in excess of par value\n740.5\n716.1\nRetained earnings\n620.2\n778.6\nAccumulated other comprehensive loss\n(65.7)\n(68.8)\nTotal Varian stockholders' equity\n1,386.6\n1,517.6\nNoncontrolling interests\n4.4\n4.3\nTotal equity\n1,391.0\n1,521.9\nTotal liabilities and equity\n$\n3,274.0\n$\n3,215.9\n(1)\nCertain prior year balances have been reclassified to conform to the current year presentation. Such reclassifications primarily relate to the adoption of Accounting Standard Codification 606.\nDiscussion of Non-GAAP Financial Measures\nThis press release includes the following non-GAAP financial measures derived from our Condensed Consolidated Statements of Earnings: non-GAAP operating earnings, non-GAAP net earnings and non-GAAP net earnings per diluted share. We define non-GAAP operating earnings from continuing operations as operating earnings from continuing operations excluding amortization of intangible assets, restructuring charges, legal costs, impairment charges and acquisition-related expenses and benefits. These measures are not presented in accordance with, nor are they a substitute for U.S. generally accepted accounting principles, or GAAP. In addition, these measures may be different from non-GAAP measures used by other companies, limiting their usefulness for comparison purposes. The non-GAAP financial measures should not be considered in isolation from measures of financial performance prepared in accordance with GAAP. Investors are cautioned that there are material limitations associated with the use of non-GAAP financial measures as an analytical tool. We have provided a reconciliation of each non-GAAP financial measure used in this earnings release to the most directly comparable GAAP financial measure. We have not provided a reconciliation of non-GAAP guidance measures to the corresponding GAAP measures on a forward-looking basis due to the potential significant variability and limited visibility of the excluded items discussed below.\nWe utilize a number of different financial measures, both GAAP and non-GAAP, in analyzing and assessing the overall performance of our business, in making operating decisions, forecasting and planning for future periods, and determining payments under compensation programs. We consider the use of the non-GAAP measures to be helpful in assessing the performance of the ongoing operation of our business. We believe that disclosing non-GAAP financial measures provides useful supplemental data that, while not a substitute for financial measures prepared in accordance with GAAP, allows for greater transparency in the review of our financial and operational performance. We also believe that disclosing non-GAAP financial measures provides useful information to investors and others in understanding and evaluating our operating results and future prospects in the same manner as management and in comparing financial results across accounting periods and to those of peer companies. Non-GAAP operating earnings and non-GAAP net earnings exclude the following items, except for significant effects of tax legislation, which are only excluded from non-GAAP net earnings:\nAmortization of intangible assets: We do not acquire businesses and assets on a predictable cycle. The amount of purchase price allocated to intangible assets and the term of amortization can vary significantly and are unique to each acquisition or purchase. We believe that excluding amortization of intangible assets allows the users of our financial statements to better review and understand the historic and current results of our operations, and also facilitates comparisons to peer companies.\nAcquisition-related expenses and benefits: We incur expenses or benefits with respect to certain items associated with our acquisitions, such as transaction costs, changes in the fair value of contingent consideration liabilities, gain or expense on settlement of pre-existing relationships, etc. We exclude such expenses or benefits as they are related to acquisitions and have no direct correlation to the operation of our on-going business.\nRestructuring and impairment charges: We incur restructuring and impairment charges that result from events, which arise from unforeseen circumstances and/or often occur outside of the ordinary course of our on-going business. Although these events are reflected in our GAAP financials, these unique transactions may limit the comparability of our on-going operations with prior and future periods.\nSignificant effects of tax legislation: We may incur significant effects of tax legislation that are generally unrelated to the level of business activity in the period in which the effects of such legislation are reported. We exclude such expenses, because we believe this does not accurately reflect the underlying performance of our continuing business operations. This exclusion is applicable to non-GAAP net earnings only.\nSignificant litigation charges or benefits and legal costs: We may incur charges or benefits as well as legal costs from time to time related to litigation and other contingencies. We exclude these charges or benefits, when significant, as well as legal costs associated with significant legal matters, because we do not believe they are reflective of on-going business and operating results.\nWe apply our GAAP consolidated effective tax rate to our non-GAAP financial measures, other than when the underlying item has a materially different tax treatment.\nFrom time to time in the future, there may be other items that we may exclude if we believe that doing so is consistent with the goal of providing useful information to investors and management. Non-GAAP items are generally included in selling, general and administrative expenses, except for significant effects of tax legislation and unless otherwise specified.\nThe following table reconciles GAAP and non-GAAP financial measures for Varian's continuing operations:\nVarian Medical Systems, Inc. and Subsidiaries\nReconciliation of Preliminary GAAP to Non-GAAP Financial Measures\n(Unaudited)\n(Dollars and shares in millions, except per share amounts)\nQ1\n2018\nQ1\n2017\nNon-GAAP adjustments\nAmortization of intangible assets (1)\n$\n3.1\n$\n2.8\nRestructuring charges\n—\n3.6\nLegal costs\n—\n6.2\nImpairment charges\n—\n38.3\nOther (2)\n1.5\n0.3\nTotal non-GAAP adjustments to operating earnings\n4.6\n51.2\nTax effects of non-GAAP adjustments\n(1.0)\n(11.3)\nSignificant effects of tax legislation (3)\n207.1\n—\nTotal net earnings from continuing operations impact from non-GAAP adjustments\n$\n210.7\n$\n39.9\nOperating earnings reconciliation\nGAAP operating earnings from continuing operations\n$\n121.4\n$\n17.4\nTotal operating earnings from continuing operations impact from non-GAAP adjustments\n4.6\n51.2\nNon-GAAP operating earnings from continuing operations\n$\n126.0\n$\n68.6\nNet (loss) earnings and net (loss) earnings per diluted share reconciliation\nGAAP net (loss) earnings from continuing operations attributable to Varian (4)\n$\n(112.3)\n$\n7.6\nTotal net earnings from continuing operations impact from non-GAAP adjustments\n210.7\n39.9\nNon-GAAP net earnings from continuing operations attributable to Varian\n$\n98.4\n$\n47.5\nGAAP net (loss) earnings per diluted share from continuing operations\n$\n(1.22)\n$\n0.08\nNon-GAAP net earnings per diluted share from continuing operations\n$\n1.06\n$\n0.50\nShares used in computing GAAP net earnings per diluted share\n91.6\n94.2\nShares used in computing non-GAAP net earnings per diluted share\n92.7\n94.2\n(1)\nIncludes $1.2 million and $1.3 million, respectively in cost of revenues for the periods presented.\n(2)\nOther includes acquisition-related expenses and benefits.\n(3)\nRepresents the tax effect of a change in law related to the U.S. Tax Cuts and Jobs Act. The corporate rate reduction results in a remeasurement of our Deferred Tax Assets of $37.8 million. The mandatory deemed repatriation of unremitted foreign earnings results in an estimated charge of $169.3 million.\n(4)\nExcludes immaterial net earnings (loss) from continuing operations attributable to noncontrolling interests for the periods presented.\nInvestor Relations Contact\nJ. Michael Bruff\nVice President, Investor Relations\n+1 (650) 424-5163\nmike.bruff@varian.com\nPress Contact\nMark Plungy\nDirector, Public Relations\n+1 (650) 424-5630\nmark.plungy@varian.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/varian-reports-results-for-first-quarter-of-fiscal-year-2018-300587809.html\nSOURCE Varian", "external_links": ["https://na01.safelinks.protection.outlook.com/?url=http%3A%2F%2Fwww.varian.com%2F&data=01%7C01%7CMonica.Prokocki%40varian.com%7C66d982e009934e13f4df08d5592357b6%7Cc49d9c494b114ccdb13772f88c68a252%7C1&sdata=pwSHF8K99FfxYs1QDuGzoGVt9eB2Sh8VOJyKQg0%2BnIQ%3D&reserved=0", "http://www.prnewswire.com/news-releases/varian-reports-results-for-first-quarter-of-fiscal-year-2018-300587809.html", "http://www.varian.com/investor"], "published": "2018-01-25T00:09:00.000+02:00", "crawled": "2018-01-25T02:35:48.000+02:00", "highlightTitle": ""}