{"organizations": [], "uuid": "4e7fe631b7358ff9400225ae4bf0a51ae9f6284c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/business-wire-orthofix-announces-preliminary-2017-fourth-quarter-and-full-year-net-sales-results.html", "country": "US", "domain_rank": 767, "title": "Orthofix Announces Preliminary 2017 Fourth Quarter and Full Year Net Sales Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.134, "site_type": "news", "published": "2018-01-09T16:00:00.000+02:00", "replies_count": 0, "uuid": "4e7fe631b7358ff9400225ae4bf0a51ae9f6284c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/business-wire-orthofix-announces-preliminary-2017-fourth-quarter-and-full-year-net-sales-results.html", "ord_in_thread": 0, "title": "Orthofix Announces Preliminary 2017 Fourth Quarter and Full Year Net Sales Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "texas", "sentiment": "none"}, {"name": "lewisville", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "orthofix international n.v.", "sentiment": "negative"}, {"name": "orthofix", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Provides 2018 Net Sales Guidance\nLEWISVILLE, Texas--(BUSINESS WIRE)-- Orthofix International N.V. (NASDAQ:OFIX), a global medical device company focused on musculoskeletal healing products and value-added services, today announced preliminary unaudited fourth quarter 2017 net sales of approximately $117 million. These preliminary results represent reported sales growth of 7.7% and constant currency sales growth of 6.1% over the fourth quarter 2016. For the full year 2017, preliminary unaudited net sales were approximately $434 million, an increase of 5.9% on a reported basis and 5.5% on a constant currency basis over the full year 2016.\nThree Months Ended December 31, (Unaudited, U.S. Dollars, in millions) 2017 2016 Reported\nChange\nConstant\nCurrency\nChange\nBioStim $ 49.8 $ 47.8 4.1 % 4.1 % Extremity Fixation 29.1 26.8 8.4 % 2.2 % Spine Fixation 21.2 18.7 13.5 % 13.2 % Biologics 16.8 15.2 10.7 % 10.7 % Total net sales $ 116.9 $ 108.5 7.7 % 6.1 % Year Ended December 31, (Unaudited, U.S. Dollars, in millions) 2017 2016 Reported\nChange\nConstant\nCurrency\nChange\nBioStim $ 185.9 $ 176.6 5.3 % 5.3 % Extremity Fixation 103.2 102.7 0.5 % (0.9) % Spine Fixation 82.0 72.6 12.8 % 12.7 % Biologics 62.7 57.9 8.3 % 8.3 % Total net sales $ 433.8 $ 409.8 5.9 % 5.5 % As of December 31, 2017, cash and cash equivalents were approximately $81 million compared to $40 million as of December 31, 2016.\n“In 2017 our strategy was to accelerate our organic topline growth rate while maintaining Adjusted EBITDA margins. This strategy proved very effective and resulted in us far exceeding our growth expectations for the year. Now as we look forward to 2018 and beyond, we are focused on continuing our organic growth momentum, expanding margins and actively pursuing value-accretive inorganic opportunities to further accelerate growth,” said Brad Mason, President and Chief Executive Officer.\n“The keys to maintaining our organic sales momentum are, first and foremost, continuing our initiatives to further engage our legacy sales force and add new representation in under-served markets. The second key is to remain committed to investing in R&D and our rapid pace of new product introductions and value-added processes and services, such as our STIM onTrack ™ mobile app and JuniOrtho™ pediatric care support tools. Lastly, we must educate physicians and payers through published, peer-reviewed research papers that demonstrate the safety, efficacy and cost-effectiveness of our products.\n“While 2017 was a year to invest in accelerating our top-line growth rate, we can now return our focus to Adjusted EBITDA margin expansion. Our biggest opportunity is in gross margins, particularly around improving inventory and instrument set management in our Spine and Extremity Fixation businesses. We also expect to begin to realize the cost benefits of our restructuring initiatives as well as benefit from leveraging our fixed costs in SG&A.\n“Lastly, Orthofix is very well positioned to grow through the acquisition of products, technologies and companies. In addition to our strong balance sheet and free cash flow, we have an experienced and proven management team, a global footprint and a reconstructed infrastructure on which to build. We have been and will remain very active in pursuing opportunities of all sizes that will drive shareholder value. However, we will remain disciplined in our investment decisions, focusing on strategic fit, near-term cash EPS accretion and ROIC.\n“We are pleased with our positioning going into 2018 and optimistic about our ability to drive shareholder value for the foreseeable future.”\n2018 Outlook\nFor the full year 2018, the Company expects to report net sales of $450 million to $455 million based on current foreign exchange rates, which reflects reported growth of approximately 4% to 5%. This guidance includes a positive currency impact of approximately $4.0 million, offset by an estimated $4.0 million decrease in the 2018 marketing services fee the Company receives from MTF Biologics. This decrease is due to the final contractual step-down in the fee that Orthofix receives from MTF Biologics for our sales of Trinity ELITE ® and Trinity Evolution ® from 65% to 60%. This change, effective March 2018 in accordance with the terms of our amended 2008 agreement with MTF Biologics, coincides with the expiration of a corresponding royalty payment on our net sales of Trinity ELITE and Trinity Evolution that Orthofix currently pays to a third party. The expiration of the royalty payment substantially offsets the impact of the fee reduction to Operating Income and Adjusted EBITDA.\nThis 2018 net sales guidance reflects the new required revenue recognition standard that is required as of January 1, 2018. One of the primary impacts of this new standard is the timing of revenue recognition for our sales to stocking distributors that were historically accounted for using the sell-through method. This revenue will now be recorded on invoiced sales instead of deferring recognition until cash is received. While we expect that the new revenue recognition standard will provide a materially consistent revenue result on an annual basis as compared to our current revenue recognition policies, there may be some variability on a quarterly basis.\nU.S. Tax Changes – Estimated Impact\nThe recent lowering of the U.S. corporate tax rate from 35% to 21% requires a revaluation of our U.S. deferred tax assets and liabilities. The Company expects to recognize a one-time, non-cash tax charge of $8 million - $12 million in the fourth quarter of 2017 related to this change. The new U.S. tax legislation is subject to a number of complex provisions, which we are currently reviewing. We will provide an update when we announce our fourth quarter and full year 2017 financials.\nUpcoming Presentations / Conference Calls\nAs previously announced, the Company’s President and Chief Executive Officer, Brad Mason, will provide an investor presentation at 8:30 a.m. Pacific Time on Thursday, January 11, 2018, at the J.P. Morgan Healthcare Conference in San Francisco. A live audio webcast will be available on the Company’s website at www.orthofix.com by clicking on the Investors tab and then clicking the link on the Events and Presentations page.\nThe Company also expects to host a conference call in late February to discuss final fourth quarter and full year 2017 financial results and further discuss our outlook for 2018.\nNon-GAAP Measures:\nConstant Currency\nConstant currency is a non-GAAP measure, which is calculated by using foreign currency rates from the comparable, prior-year period, to present net sales at comparable rates. Constant currency can be presented for numerous GAAP measures, but is most commonly used by management to analyze net sales without the impact of changes in foreign currency rates.\nAdjusted EBITDA\nAdjusted EBITDA (earnings before interest income (expense), net; income tax expense; and depreciation and amortization) is a non-GAAP financial measure, which is calculated by adjusting EBITDA by certain items such as share-based compensation, foreign exchange impact, strategic investments, SEC/FCPA matters and related costs, infrastructure investments, legal judgments/settlements, charges related to U.S. Government resolutions, restructuring, succession charges and long-term income tax rate.\nFree Cash Flow\nFree cash flow is a non-GA", "external_links": ["http://www.businesswire.com/news/home/20180109005743/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.orthofix.com&esheet=51740103&newsitemid=20180109005743&lan=en-US&anchor=www.orthofix.com&index=2&md5=9b645c1efadb3852d000283380f2b7f9", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.orthofix.com&esheet=51740103&newsitemid=20180109005743&lan=en-US&anchor=www.orthofix.com&index=1&md5=cc007b806b41ce8eb09596150417be9b"], "published": "2018-01-09T16:00:00.000+02:00", "crawled": "2018-01-09T17:55:33.024+02:00", "highlightTitle": ""}