{"organizations": [], "uuid": "708e8e5dacb9deb56eff25d3ff853f1d50218bc3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/03/104926227-GettyImages-869652238.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/03/harvard-study-how-much-money-millionaires-need-to-be-happy.html", "country": "US", "domain_rank": 767, "title": "Harvard study: How much money millionaires need to be happy", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.181, "site_type": "news", "published": "2018-01-03T19:36:00.000+02:00", "replies_count": 0, "uuid": "708e8e5dacb9deb56eff25d3ff853f1d50218bc3"}, "author": "Sarah Berger", "url": "https://www.cnbc.com/2018/01/03/harvard-study-how-much-money-millionaires-need-to-be-happy.html", "ord_in_thread": 0, "title": "Harvard study: How much money millionaires need to be happy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "harvard", "sentiment": "negative"}, {"name": "harvard business school", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "In the pursuit of happiness, being a millionaire won't necessarily serve as a shortcut.\nA recent study from Harvard Business School asked more than 4,000 millionaires of varying degrees of wealth to rank their life satisfaction and happiness levels, as well as the source of that wealth.\nThe findings reveal that making it as a millionaire doesn't necessarily buy you happiness, and even the super-rich aren't always satisfied.\nEven millionaires aren't totally happy Harvard's new research reveals that the price of happiness is pretty steep: It seems to be around $8 million to $10 million. Only at these levels \"are wealthier millionaires happier than millionaires with lower levels of wealth,\" says the study, revealing that in one group, millionaires who hit the $8 million mark reported higher life satisfaction than those with $7.9 million or less, and in another, those with a net worth of over $10 million were significantly happier than those with lower levels of wealth. But even then, it is only associated with \"modestly greater well-being.\"\nshow chapters 5 sumptuous meals only the super-rich can afford 12:04 PM ET Thu, 20 July 2017 | 01:34 The study also found that across all wealth levels, millionaires said that to be 100 percent happy they would need to grow their fortune by leaps and bounds — just a bit more wealth wouldn't be enough. Respondents most frequently said that they would need to increase their wealth by a whopping 1,000 percent, followed by 500 percent for total happiness.\n\"What seems to happening is even a marginal increase in wealth can increase happiness. But they predict they would need so much more,\" lead researcher Grant Donnelly tells Money .\nBut it wasn't just the amount of wealth millionaires had that impacted their happiness, it was also the source of that wealth. Researchers found that people who earned their wealth were happier than those who inherited it.\nMaximize the money you do have to achieve happiness Even if you don't have $8 million, you can be strategic about the way you spend the money you do have that can make you happier.\nFor example, according to two of the researchers on the Harvard happiness study, Donnelly and Michael Norton, \"giving to others leads to greater happiness than spending on oneself,\" they write in an article for The Wall Street Journal .\nYou can also use some of your cash to purchase your way out of an unpleasant task. That way, you spend more time doing things you enjoy, ultimately leading to happiness.\n\"Spending money on time saving purchases — like housecleaning, lawn-mowing and task outsourcing — promotes happiness by protecting people from the time-famine of modern life,\" Ashley Whillans, a professor at Harvard Business School and author of a study on money and happiness, tells CNBC Make It .\n\"Both the most and least wealthy individuals we studied derived benefits from spending money to buy time,\" meaning it has \"broad benefits for well-being,\" she says.\nAfter all, \"What matters for your well-being is what you're doing with the minutes and days of your life,\" University of British Columbia psychology professor Elizabeth Dunn tells CNBC Make It . \"If you have a lot of money and a lot of nice stuff, but you're spending your time doing things that you dislike, then your minute-to-minute happiness and overall happiness is likely to be pretty low.\"\nDon't miss: 3 ways money can buy you happiness, according to science\nshow chapters This $52M Ferrari GTO is a car only a multimillionaire can afford 12:58 PM ET Thu, 27 July 2017 | 01:02 Like this story? Like CNBC Make It on Facebook !", "external_links": [], "published": "2018-01-03T19:36:00.000+02:00", "crawled": "2018-01-03T19:36:35.020+02:00", "highlightTitle": ""}