{"organizations": [], "uuid": "85efd01831d06b4d888f55e41930f91a3231a2b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-ps-business-parks-inc-announces-tax-treatment-of-2017-dividends.html", "country": "US", "domain_rank": 767, "title": "PS Business Parks, Inc. Announces Tax Treatment of 2017 Dividends", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T03:08:00.000+02:00", "replies_count": 0, "uuid": "85efd01831d06b4d888f55e41930f91a3231a2b5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-ps-business-parks-inc-announces-tax-treatment-of-2017-dividends.html", "ord_in_thread": 0, "title": "PS Business Parks, Inc. Announces Tax Treatment of 2017 Dividends", "locations": [], "entities": {"persons": [], "locations": [{"name": "glendale", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "ps business parks, inc.", "sentiment": "neutral"}, {"name": "ps business parks, inc", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "irc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GLENDALE, Calif.--(BUSINESS WIRE)-- PS Business Parks, Inc. (NYSE:PSB) announced today the tax treatment of the Company’s 2017 dividends. For the tax year ended December 31, 2017, distributions for the common stock and all the various series of preferred stock were classified as follows:\n2017\n1 st Quarter 2 nd Quarter 3 rd Quarter 4 th Quarter Ordinary Income 100.0000% 97.9825% 100.0000%\n85.4341%\nLong-Term Capital Gain 0.0000% 2.0175% 0.0000%\n14.5659%\nTotal 100.0000% 100.0000% 100.0000%\n100.0000%\nThe ordinary income dividends do not constitute “qualified dividend income.”\nFor the second quarter of 2017, the percentage of the long-term capital gain that constitutes unrecaptured section 1250 gain is 75.9804%. Corporate shareholders subject to IRC §291 should treat 20% of the unrecaptured section 1250 gain as ordinary income.\nThis release is based on the preliminary results of work on the Company’s tax filings and is subject to correction or adjustment when the filings are completed. The Company is releasing information at this time to aid those required to distribute Forms 1099 on the Company’s distributions. No material change in this classification is expected.\nAlternative Minimum Tax\nAlternative minimum tax adjustments are to be apportioned between a real estate investment trust (“REIT”) and its shareholders under Internal Revenue Code Section 59(d). Although regulations have not yet been issued under that provision, based on regulations issued pursuant to a similar provision of prior law and the legislative history of the current provision, it appears that such alternative minimum tax adjustments are to be apportioned to a REIT’s shareholders to the extent that the REIT distributes its regular taxable income. It is the Company’s policy to distribute all of its regular taxable income and accordingly, all of the Company’s alternative minimum tax adjustments are being apportioned to the Company’s shareholders.\nThe Company has determined that -0.1920% of each distribution to its common shareholders for the tax year ended December 31, 2017 consists of alternative minimum tax adjustments (i.e., for each $1 of dividend reportable by a shareholder, $0.00192 represents a negative alternative minimum tax adjustment). To determine your share of the Company’s alternative minimum tax adjustments, multiply the aggregate dollar amount of your reportable 2017 dividends from the Company (the sum of the amounts shown in Boxes 1a and 2a of the Company’s 2017 Form 1099-DIV) by -0.00192.\nIf you are an individual, please refer to Internal Revenue Service Form 6251, Alternative Minimum Tax—Individuals. Your share of alternative minimum tax adjustments should be input as a negative amount in Part I, Line 18 (depreciation on assets placed in service after 1986). A corporation’s share of alternative minimum tax adjustments should be input as a negative amount on Internal Revenue Service Form 4626, Alternative Minimum Tax—Corporations, on line 2a (depreciation of post-1986 property).\nIf you have questions, please consult your tax advisor for further guidance.\nCompany Information\nPS Business Parks, Inc., a member of the S&P SmallCap 600, is a real estate investment trust (“REIT”) that acquires, develops, owns and operates commercial properties, primarily multi-tenant flex, office and industrial space. The Company defines “flex” space as buildings that are configured with a combination of office and warehouse space and can be designed to fit a number of uses (including office, assembly, showroom, laboratory, light manufacturing and warehouse space). As of December 31, 2017, the Company wholly owned 28.0 million rentable square feet with approximately 4,950 customers concentrated in six states and a 95.0% interest in 395 apartments.\nAdditional information about PS Business Parks, Inc. is available on the Internet. The Company’s website is psbusinessparks.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180116006912/en/\nPS Business Parks, Inc.\nMaria R. Hawthorne\n(818) 244-8080, Ext. 1370\nSource: PS Business Parks, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180116006912/en/"], "published": "2018-01-17T03:08:00.000+02:00", "crawled": "2018-01-17T02:58:09.003+02:00", "highlightTitle": ""}