{"organizations": [], "uuid": "20f4c855699d10b73f00f68d1a38d23c5f903222", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-markets/global-markets-asian-shares-dollar-steady-nikkei-rallies-idUSL4N1P405X", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-Asian shares edge up, yen jumps as BOJ trims bond buying", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-09T08:50:00.000+02:00", "replies_count": 0, "uuid": "20f4c855699d10b73f00f68d1a38d23c5f903222"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-markets/global-markets-asian-shares-dollar-steady-nikkei-rallies-idUSL4N1P405X", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Asian shares edge up, yen jumps as BOJ trims bond buying", "locations": [], "entities": {"persons": [{"name": "lisa twaronite", "sentiment": "none"}], "locations": [{"name": "asia-pacific", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "bank of japan", "sentiment": "negative"}, {"name": "boj", "sentiment": "negative"}, {"name": "msci", "sentiment": "none"}, {"name": "samsung", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "samsung electronics co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Yen rises after Bank of Japan trims JGB purchases\n* Nikkei probes highest levels since November 1991\n* Samsung’s guidance disappoints, weighing on tech sector\n* Crude oil futures rise to highest since May 2015\nBy Lisa Twaronite\nTOKYO, Jan 9 (Reuters) - Asian shares pared gains on Tuesday, pulling away from the cusp of a record high, while the yen stole the currency spotlight and jumped after the Bank of Japan’s slight reduction to its bond purchases reminded investors that it will eventually normalise policy.\nEuropean stock futures were slightly lower, suggesting a subdued opening for the region, with DAX futures slightly higher and FTSE futures up 0.2 percent.\nMSCI’s broadest index of Asia-Pacific shares outside Japan was nearly flat in afternoon trade after earlier rising as high as 591.28, not far from its record peak of 591.50 scaled in November 2007.\nSouth Korea’s share market erased its gains and slipped 0.1 percent, dragged lower by a 3.1 percent drop in shares of Samsung Electronics Co.\nSamsung’s guidance fell short of market expectations despite a forecast for a record fourth-quarter profit, as a strong won and one-off staff bonuses took the shine off surging DRAM chip prices.\nThe MSCI tech index for Asia slipped 0.1 percent, after it had gained more than 5 percent this year.\nOn Wall Street on Monday, the Dow Jones Industrial Average edged down 0.05 percent, the S&P 500 gained 0.17 percent, and the Nasdaq Composite added 0.29 percent. After the best start to a year in more than a decade, investors turned cautious ahead of earnings.\nJapan’s Nikkei stock index added 0.6 percent to close at its highest level since November 1991, catching up to the previous session’s gains as markets reopened after a holiday on Monday.\nAgainst the yen, the dollar erased its early modest gains and fell 0.3 percent to 112.74 following a drop as low as 112.50, after Japan’s central bank trimmed its purchases of Japanese government bonds (JGBs).\nSince it adopted the yield curve control policy in 2016, the BOJ has made similar tweaks to its JGB purchases, which are regarded as mainly technical moves. On Tuesday, it cut its JGB purchases of 10 to 25 years left to maturity and those of 25 to 40 years to maturity by 10 billion yen ($88.39 million) each, from its previous operations for those zones.\nWhile the central bank’s operational adjustments do not usually have an impact on foreign exchange markets, dealers said the timing of the move suggested some players had used it as an excuse to sell the dollar and the euro against the yen.\n“Major central banks around the world have begun to normalise policy, and the BOJ’s adjustments today reminded the market that someday it will, too,” said Ayako Sera, senior market economist at Sumitomo Mitsui Trust.\nThe euro edged down 0.1 percent to $1.1960, shy of its nearly four-month high of $1.2089 set on Thursday. Against the yen, it skidded 0.4 percent to 134.81\nThe dollar index, which tracks the greenback against a basket of six major rival currencies, edged down slightly to 92.326.\nUnderpinning the dollar, investors bet on further U.S. interest rate hikes after Friday’s payrolls data did nothing to challenge the outlook for monetary policy tightening by the U.S. Federal Reserve. While job growth slowed more than expected, a pick-up in monthly wages pointed to labour market strength.\n“Broadly, viewed in context, it was still a reasonably strong labour market,” said Bill Northey, chief investment officer at the private client group of U.S. Bank in Helena, Montana.\n“There was nothing in there to dissuade us from the view that the Fed will move again, appropriately, likely in March,” he said.\nBut the dollar’s upward momentum was tempered as investors differed on the pace of tightening while U.S. inflation remains relatively cool.\nAtlanta Fed President Raphael Bostic, who is a voting member of the central bank’s policy board, said on Monday that only two increases might be needed in 2018, in light of weak price pressures.\nCrude oil prices firmed to their highest since May 2015, as political concerns in some OPEC nations offset projections for higher U.S. oil production.\nU.S. crude rose 44 cents, or 0.7 percent, to $62.17 a barrel, while Brent crude added 35 cents, or 0.5 percent, to $68.13.\nSpot gold was down 0.2 percent at $1,318.45 an ounce, pulling back from a 3-1/2-month high hit last week.\nEditing by Sam Holmes and Jacqueline Wong\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-09T08:50:00.000+02:00", "crawled": "2018-01-09T15:04:50.003+02:00", "highlightTitle": ""}