{"organizations": [], "uuid": "175441c2c52f0bfbd4b5d288b60ba9050b040c7c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220256206&w=1200&r=LYNXMPEE070PS", "site_section": "https://www.reuters.com/breakingviews", "section_title": "Breakingviews | Reuters", "url": "https://www.reuters.com/article/us-britain-economy-breakingviews/breakingviews-british-shoppers-are-a-shaky-economic-backstop-idUSKBN1EX14Z", "country": "US", "domain_rank": 408, "title": "British shoppers are a shaky economic backstop", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-08T20:37:00.000+02:00", "replies_count": 0, "uuid": "175441c2c52f0bfbd4b5d288b60ba9050b040c7c"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-britain-economy-breakingviews/breakingviews-british-shoppers-are-a-shaky-economic-backstop-idUSKBN1EX14Z", "ord_in_thread": 0, "title": "British shoppers are a shaky economic backstop", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters Breakingviews) - Britain’s shopaholics are an increasingly shaky economic backstop. Spending on Visa cards in 2017 was the weakest in five years, while profit warnings from retailers Mothercare and Debenhams add to the gloomy outlook. Despite easing cost inflation and a tighter job market, customers who have kept the UK economy moving are becoming less reliable.\nVisa said on Monday that consumer spending on its credit and debit cards, which are used for one pound in every three spent in Britain, fell 0.3 percent in 2017 compared with a year earlier. The data does not provide a full picture of consumer spending, as the types of purchases buyers put on a Visa card may be more discretionary. Nevertheless, the figures contain two noteworthy indicators. Spending in December, a month when shoppers ought to be in full flight, was down 1 percent year-on-year. It has been five years since Visa data was negative in the runup to Christmas. Meanwhile, spending online grew by just 2 percent last month. A year earlier, e-commerce was expanding at close to three times that rate.\nSlower online sales remove a crutch for weaker retailers that are struggling with escalating costs and dwindling footfall in their bricks-and-mortar stores. Baby products chain Mothercare and department store Debenhams both reported disappointing sales over the festive period.\nThis is ominous for a UK economy where consumer spending has been one of the few recent bright spots. Some headwinds will ease this year: retailers expect an uptick in sourcing costs caused by the 2016 drop in the pound to fade out, meaning fewer price hikes to pass on to shoppers.\nBut despite a tight job market, workers are unlikely to see a real increase in wages before the end of the year, according to the Resolution Foundation think tank. They could make up the shortfall by borrowing even more: UK consumer credit is still growing at almost 10 percent a year. Yet signs that shoppers are becoming cautious will make even make even tepid economic growth forecasts more difficult to achieve.\nBreakingviews Reuters Breakingviews is the world's leading source of agenda-setting financial insight. As the Reuters brand for financial commentary, we dissect the big business and economic stories as they break around the world every day. A global team of about 30 correspondents in New York, London, Hong Kong and other major cities provides expert analysis in real time.\nSign up for a free trial of our full service at https://www.breakingviews.com/trial and follow us on Twitter @Breakingviews and at www.breakingviews.com . All opinions expressed are those of the authors.", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-08T20:37:00.000+02:00", "crawled": "2018-01-09T09:40:38.728+02:00", "highlightTitle": ""}