{"organizations": [], "uuid": "449f8d04bb74095088ab77f3121b567670c2bc0e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/19/the-associated-press-govt-shutdown-seems-near-senate-fails-to-approve-funding.html", "country": "US", "domain_rank": 767, "title": "Gov't shutdown seems near; Senate fails to approve funding", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T08:08:00.000+02:00", "replies_count": 0, "uuid": "449f8d04bb74095088ab77f3121b567670c2bc0e"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/19/the-associated-press-govt-shutdown-seems-near-senate-fails-to-approve-funding.html", "ord_in_thread": 0, "title": "Gov't shutdown seems near; Senate fails to approve funding", "locations": [], "entities": {"persons": [{"name": "donald", "sentiment": "negative"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — The government careened toward shutdown Friday night in a chaotic close to Donald Trump's first year as president. An eleventh-hour effort to stave off the shutdown for four weeks appeared to fall well short in the Senate, and lawmakers preemptively traded blame as the midnight deadline neared.\nEnough senators voted against a stopgap measure to ensure the closure of all but essential operations nationwide. But the Republican-led Senate was holding the vote open as nearly an hour ticked by and the midnight hour neared, seemingly accommodating the numerous discussions among leaders and other lawmakers away from the chamber's floor.\nUp to that point, Democrats largely held together to block the funding legislation, digging in on their insistence that the spending bill include protections for some 700,000 younger immigrants facing deportation.\nAfter hours of heated closed-door meetings and phone calls, including with the White House, the Senate scheduled its late-night vote on a House-passed plan. It failed by far to gain the 60 votes to break a Democratic filibuster, with a handful of red-state Democrats crossing the aisle to support the measure and some Republicans voting in opposition.\nEven before the vote, Trump was pessimistic, tweeting, \"Not looking good\" and blaming the Democrats who he said actually wanted the shutdown \"to help diminish the success\" of the tax bill he and fellow Republicans pushed through last month.\nThe president watched the results from the White House residence, dialing up allies and affirming his belief that Democrats would take the blame for the shutdown, said a person familiar with his conversations but not authorized to discuss them publicly.\nThe election-year standoff marked a test of the president's much vaunted deal-making skills — and of both parties' political fortitude. Republicans, who control both Congress and the White House, faced the prospect of being blamed for the display of dysfunction — just the fourth shutdown in a quarter-century. It could also threaten to slow any GOP momentum after passage of the party's signature tax law.\nDemocrats, too, risked being labeled obstructionist. Republicans branded the confrontation a \"Schumer shutdown\" and argued that Democrats were harming fellow Americans to protect \"illegal immigrants.\"\nTrump had brought Senate Democratic leader Chuck Schumer to the White House Friday afternoon in hopes of cutting a deal. But the two New Yorkers, who pride themselves on their negotiating abilities, emerged without an agreement, and Republicans and Democrats in Congress continued to pass off responsibility.\n\"We made some progress, but we still have a good number of disagreements,\" Schumer said upon returning to Capitol Hill. Budget Director Mick Mulvaney told CNN that \"Not much has changed\" over the course of the day, but he predicted a deal would be reached by Monday, when most government offices are to reopen after the weekend.\nDemocrats in the Senate had served notice they would filibuster a four-week extension, the government-wide funding bill that cleared the House Thursday evening. They were seeking an even shorter extension that they think would keep the pressure on the White House to cut a deal to protect \"dreamer\" immigrants — who were brought to the country as children and are now here illegally — before their legal protection runs out in March.\nTrump described his discussion with Schumer as an \"excellent preliminary meeting,\" tweeting that lawmakers are \"Making progress - four week extension would be best!\" But that optimism faded as the evening wore on.\nSenate GOP leader John Cornyn of Texas said Trump told Schumer to work things out with Republican Senate Majority Leader Mitch McConnell and House Speaker Paul Ryan. McConnell did not attend the meeting because he was not invited, a Senate GOP aide said.\nTrump had been an unreliable negotiator in the weeks leading up to the showdown. Earlier this week he tweeted opposition to the four-week plan, forcing the White House to later affirm his support. He expressed openness to extending the Deferred Action for Childhood Arrivals program, only to reject a bipartisan proposal. His disparaging remarks about African and Haitian immigrants last week helped derail further negotiations.\nTrump had been set to leave Friday afternoon to attend a fundraiser at his Palm Beach, Florida, estate marking the one-year anniversary of his inauguration but delayed his travel.\n\"I think the president's been very clear: he's not leaving until this is finished,\" Mulvaney told reporters.\nAs word of the Schumer meeting spread, the White House hastened to reassure Republican congressional leaders that Trump would not make any major policy concessions, said a person familiar with the conversations but not authorized to be quoted by name.\nOn Capitol Hill, McConnell said Americans at home would be watching to see \"which senators make the patriotic decision\" and which \"vote to shove aside veterans, military families and vulnerable children to hold the entire country hostage... until we pass an immigration bill.\"\nAcross the Capitol, the House backed away from a plan to adjourn for a one-week recess, meaning the GOP-controlled chamber could wait for a last-minute compromise that would require a new vote. But it wasn't coming Friday night.\n\"We can't keep kicking the can down the road,\" said Schumer, insisting on more urgency in talks on immigration. \"In another month, we'll be right back here, at this moment, with the same web of problems at our feet, in no better position to solve them.\"\nThe four-week measure would be the fourth stopgap spending bill since the current budget year started in October. A pile of unfinished Capitol Hill business has been on hold, first as Republicans ironed out last fall's tax bill and now as Democrats insist on progress on immigration. Talks on a budget deal to ease tight spending limits on both the Pentagon and domestic agencies are on hold, as is progress on a huge $80 billion-plus disaster aid bill.\nBefore Thursday night's House approval, GOP leaders sweetened the stopgap measure with legislation to extend for six years a popular health care program for children from low-income families and two-year delays in unpopular \"Obamacare\" taxes on medical devices and generous employer-provided health plans.\nA shutdown would be the first since 2013, when tea party Republicans — in a strategy not unlike the one Schumer is employing now — sought to use a must-pass funding bill to try to force then-President Barack Obama to delay implementation of his marquee health care law. At the time, Trump told Fox & Friends that the ultimate blame for a shutdown lies at the top. \"I really think the pressure is on the president,\" he said.\nArguing that Trump's predecessors \"weaponized\" that shutdown, Mulvaney said Friday the budget office would direct agencies to work to mitigate the impact this time. That position is a striking role-reversal for the conservative former congressman, who was one of the architects of the 2013 shutdown over the Affordable Care Act.\nWith no agreement by midnight, the government would begin immediately locking its doors. The impact would initially be", "external_links": [], "published": "2018-01-19T08:08:00.000+02:00", "crawled": "2018-01-20T06:52:36.090+02:00", "highlightTitle": ""}