{"organizations": [], "uuid": "79f940105d079a7ad934b60a7d16cb9a92179401", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/06/05/104509452-GettyImages-692128122.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/29/the-u-k-s-lack-of-direction-is-a-cause-for-concern-as-brexit-talks-enter-final-stage-analysts-say.html", "country": "US", "domain_rank": 767, "title": "The U.K.’s ‘lack of direction’ is a cause for concern as Brexit talks enter final stage, analysts say", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-29T15:55:00.000+02:00", "replies_count": 0, "uuid": "79f940105d079a7ad934b60a7d16cb9a92179401"}, "author": "Silvia Amaro", "url": "https://www.cnbc.com/2018/01/29/the-u-k-s-lack-of-direction-is-a-cause-for-concern-as-brexit-talks-enter-final-stage-analysts-say.html", "ord_in_thread": 0, "title": "The U.K.’s ‘lack of direction’ is a cause for concern as Brexit talks enter final stage, analysts say", "locations": [], "entities": {"persons": [{"name": "david davis", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}, {"name": "rooker", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "eu energy and environment sub-committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The British government's \"refusal\" to discuss and outline the U.K.'s post-Brexit relationship with the European Union is alarming, analysts and policymakers told CNBC on Monday.\nWith the final phase of negotiations set to receive the green light Monday afternoon, Prime Minister Theresa May's government appears lacking in unity and without a detailed plan, they said.\n\"I've worked with (Europe's chief negotiator) Michel Barnier twice as a minister; he will run rings around Mrs. May and (U.K. Brexit minister) David Davis,\" Lord Rooker, member of the House of Lords' EU Energy and Environment Sub-Committee, told CNBC.\n\"We are in deep trouble as a country because of the lack of direction of the government and not exactly stating what the end-game is after we leave. There is this refusal of the cabinet to have a discussion about what we are seeking to achieve.\"\nMay is meeting her Brexit cabinet Monday to discuss the U.K.'s position in the next round of negotiations, which will focus on trade and transition.\nshow chapters Lord Rooker: Michel Barnier will run rings around Theresa May 4 Hours Ago | 01:20 May and Davis want to reach a political agreement with Europe on a transition agreement by the end of March. However, there are doubts that the negotiations will evolve that fast.\n\"A political deal on the transition is looking less likely at the March European Council,\" Mujtaba Rahman, managing director at the Eurasia Group, said in a note Monday.\n\"For the last two weeks, it has been apparent that the EU27 have been getting increasingly frustrated at the U.K.'s attempts to backslide on commitments it made in December regarding the 'standstill' nature of the transition.\"\nIn December, the 27 members of the EU reiterated that they were ready to discuss a transitional period, which the U.K. has suggested should be \"around two years.\" However, the EU made it clear that during that \"clearly defined and precisely limited time,\" all existing European regulation will continue to apply on British soil.\nThis means that U.K. businesses will continue to operate in the EU's tariff-free area, the so-called single market. It will therefore also mean that European citizens will be able to move freely to and from the U.K.\nshow chapters Lords warn of Brexit threat to UK's energy trade 9 Hours Ago | 02:54 But there have been reports that some government officials want EU citizens entering the U.K. to register with the authorities during that period, and for the U.K. courts to be independent of the European Court of Justice.\n\"Absent greater clarity from the U.K. government on its end-state objectives, EU guidelines and negotiations on trade will also be postponed,\" Rahman said in the note.\nThe first phase of Brexit talks, which focused on citizens' rights, the Irish border and the withdrawal bill, proved tough and took longer than initially forecast. However, the second, final phase might prove even more difficult given that it will touch on a wider range of very detailed topics – including financial services, energy, transport and fishing quotas, to name just a few.\n\"Within the European Union, there's an integrated electricity and energy market, so when energy is wanted in one country and another country has got a surplus, the interconnectedness of flow of gas and electricity keeps costs down across Europe,\" Lord Rooker told CNBC, noting that the U.K. is fully integrated in such a market.\n\"Coming out from the Brexit point of view, the government hasn't got a clue about how that will operate. The first likelihood: costs will go up to U.K. consumers because the efficiencies will be lost, there's the issue of Euratom (European Atomic Energy Community) and the transfer of nuclear issues for medicine and for energy,\" he added.", "external_links": ["http://www.cnc.com/brexit", "http://www.consilium.europa.eu/media/32236/15-euco-art50-guidelines-en.pdf"], "published": "2018-01-29T15:55:00.000+02:00", "crawled": "2018-01-29T16:27:33.020+02:00", "highlightTitle": ""}