{"organizations": [], "uuid": "0fc9509d248e99f856d31258a7b72d2b352a55af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223226430&w=1200&r=LYNXMPEE0I05D", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/hna-cfius/exclusive-u-s-puts-hna-deals-on-ice-until-it-gets-ownership-info-source-idINKBN1F80AY", "country": "US", "domain_rank": 408, "title": "Exclusive: U.S. puts HNA deals on ice until it gets ownership info - source", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T05:51:00.000+02:00", "replies_count": 0, "uuid": "0fc9509d248e99f856d31258a7b72d2b352a55af"}, "author": "", "url": "https://in.reuters.com/article/hna-cfius/exclusive-u-s-puts-hna-deals-on-ice-until-it-gets-ownership-info-source-idINKBN1F80AY", "ord_in_thread": 0, "title": "Exclusive: U.S. puts HNA deals on ice until it gets ownership info - source", "locations": [], "entities": {"persons": [{"name": "koh gui qing", "sentiment": "none"}, {"name": "greg roumeliotis", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new zealand", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "hna", "sentiment": "negative"}, {"name": "min read  new york", "sentiment": "none"}, {"name": "hna group", "sentiment": "none"}, {"name": "skybridge capital llc", "sentiment": "none"}, {"name": "glencore", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "skybridge", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - The U.S. government will not approve any investment by HNA Group until the Chinese conglomerate, which has been scrutinized around the world over its ownership structure, provides adequate information on who its shareholders are, a source familiar with the situation said.\nFailure to get U.S. regulatory support means that HNA’s high-profile bids to invest in U.S. hedge fund SkyBridge Capital LLC and Swiss trader and miner Glencore’s petroleum products storage and logistics business are in limbo. Both investments are currently awaiting approval from the U.S. government.\nSkyBridge and Glencore declined to comment. HNA did not immediately respond to requests for comment.\nFaced with questions around its ultimate owners, HNA overhauled its shareholding structure last year to give majority control to two charities. However, regulators, including authorities in Switzerland and New Zealand, are still querying the airline-to-property company about the identity of its owners.\nThe Chinese conglomerate first announced in January 2017 that it was buying a majority stake in SkyBridge, a hedge fund investment firm founded by Anthony Scaramucci, a former aide to U.S. President Donald Trump. HNA and SkyBridge have never disclosed the terms of the investment.\nScaramucci declined to comment.\nBut a year on, HNA and SkyBridge have faced repeated delays in getting the green light for their deal from the Committee on Foreign Investment in the United States (CFIUS), an intra-government agency that scrutinizes foreign groups’ purchases of U.S. assets to protect national security interests.\nA source close to the SkyBridge transaction was downbeat about the prospect of the investment being completed.\nGlencore, which agreed last March to sell HNA a stake in its petroleum products storage and logistics business for $775 million, said in December it had closed parts of the deal worth $579 million. It said three assets in the United States still required clearance from CFIUS, and sources familiar with the matter said they expected the deal would be approved by the end of June.\nHNA’s inability to get CFIUS approval for its deals is the latest setback for the Chinese company.\nHNA had little trouble closing big investments in the United States in 2016 when it bought U.S electronics distributor Ingram Micro for $6 billion and a near 25 percent stake in hotel operator Hilton Worldwide Holdings Inc.\nBut after a two-year, $50 billion investment spree, HNA is facing financial, legal and regulatory problems.\nCFIUS’ deliberations are usually shrouded in secrecy but a recent lawsuit showed some of the back and forth between the committee and companies involved in the process.\nU.S. software engineering company Ness Technologies S.A.R.L., which had agreed to be bought by HNA for $325 million, sued HNA in December for allegedly failing to answer questions about its ownership in a CFIUS review. The deal fell apart when HNA did not get U.S. approval.\nNess said in the lawsuit that HNA and its unit had “covertly worked to evade and frustrate” CFIUS’s review of the investment by “discussing, planning, orchestrating and implementing various schemes to disguise the true nature of their organizations, corporate structures and ownership.”\nThe U.S. technology firm said CFIUS could not even begin its formal review of the deal because it had “material questions about the completeness and accuracy of the information provided by HNA.”\nHNA has said the lawsuit is baseless.\nU.S. lawyers who specialise in CFIUS issues said the regulator has the power to reassess previously approved transactions that have closed if it judged that material information was not submitted the first time, or that information sent earlier was misleading.\nA CFIUS spokesman declined to comment.\nCFIUS’s stance has toughened under Trump as Washington seeks to put pressure on China to help tackle North Korea’s nuclear ambitions, though the lawsuit filed by Ness noted that HNA’s case was unique partly because it repeatedly changed the story about its ownership.\nBeijing-based Naura Microelectronics Equipment Co Ltd did win CFIUS approval to buy U.S. semiconductor manufacturing equipment company Akrion Systems LLC, attorneys for Naura said this week.\nReporting by Koh Gui Qing and Greg Roumeliotis; Additional reporting by Julia Payne; Editing by Carmel Crimmins and Leslie Adler\n ", "external_links": [], "published": "2018-01-19T05:51:00.000+02:00", "crawled": "2018-01-19T06:14:31.000+02:00", "highlightTitle": ""}