{"organizations": [], "uuid": "1a8dcc7e843ededb019ba24941a021a93216f9b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-olympics-2018-sno-bigairsnow/big-air-snowboarding-looks-to-thrill-on-olympics-debut-idUSKBN1EX18M", "country": "US", "domain_rank": 408, "title": "Big air snowboarding looks to thrill on Olympics debut", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T15:17:00.000+02:00", "replies_count": 0, "uuid": "1a8dcc7e843ededb019ba24941a021a93216f9b1"}, "author": "", "url": "https://www.reuters.com/article/us-olympics-2018-sno-bigairsnow/big-air-snowboarding-looks-to-thrill-on-olympics-debut-idUSKBN1EX18M", "ord_in_thread": 0, "title": "Big air snowboarding looks to thrill on Olympics debut", "locations": [], "entities": {"persons": [{"name": "reu", "sentiment": "negative"}, {"name": "max parrot", "sentiment": "none"}, {"name": "mark mcmorris", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 1:20 PM / in 5 hours Big air snowboarding looks to thrill on Olympics debut 3 Min Read \nLONDON (Reuters) - The newest Olympic sport should prove to be a crowd-pleaser straight away. \nBig air snowboarding makes its Olympic debut in Pyeongchang, bringing tricks, thrills and danger to the slopes. \nBig air has been an FIS Snowboarding World Championship event since 2003 and has been at the X Games for far long, yet 2018 will marks its entry onto the Olympic stage. \nThe event is the extreme version of slopestyle, an Olympic discipline that itself only debuted in 2014. \nAthletes send themselves down one huge ramp and look to perform the highest-scoring individual trick possible. \nPyeongchang will have the world’s biggest big air ramp standing at 49 meters with a maximum slope angle of 40 degrees, giving athletes more time in the air to show off their latest tricks. \nMany of the snowboarders who compete in the slopestyle will also try their hand at the big air event, giving them two chances at clinching an Olympic medal. \nCanadian pair Mark McMorris and Max Parrot are widely touted as the favorites in the men’s competition. They were first and second in last year’s FIS Big Air rankings and have 11 X Games gold medals between them. Snowboarding - X Games Men's Big Air Snowboard finals, Hafjell, Norway - 11/03/17 - Silver medalist Max Parrot from Canada.NTB Scanpix/Geir Olsen/via REUTERS \nBoth athletes are known for bringing out a new trick in major competitions and so snowboarding fans should be expecting something special on the huge ramp in Pyeongchang. \nHowever, such daredevil stunts come with major risks. McMorris himself has suffered two major injuries in recent years; a broken femur in 2016 and then several severe injuries including a collapsed lung in a March 2017 incident. \nAlthough McMorris has made a full recovery to compete in Pyeongchang, if he is to show any sign of nerves on the ramp there will be a host of other top snowboarders looking to take the inaugural big air gold. \nNorwegians Staale Sandbech and Marcus Kleveland clinched podium spots at last year’s World Championships while 18-year-old Chris Corning is the hottest young prospect coming out of Team USA. \nIn the women’s competition, another American teenager Hailey Langland will look to add an Olympics gold to her X Games Big air gold. \nThe 17-year-old will have to hold off competition from compatriots Julia Marino and 2014 slopestyle Olympic champion Jamie Anderson as well as surprise British candidate Katie Ormerod, who will be looking to clinch her country’s second ever Olympic medal on the snow. \nHowever, the favorite looks to be Austrian Anna Gasser. Gasser qualified in first place for the slopestyle final in Sochi only to fall during both runs and finish in tenth place. \nThe 26-year-old has rebounded from this disappointment to win big air gold at the 2017 World Championships and won the 2017 World Cup. \nWhoever emerges victorious with a place on the podium in Pyeongchang, the fans are guaranteed to be winners of the event as the big air looks to shine on Olympics debut. Reporting by Jack Tarrant; Editing by Amlan Chakraborty", "external_links": [], "published": "2018-01-08T15:17:00.000+02:00", "crawled": "2018-01-08T15:43:41.016+02:00", "highlightTitle": ""}