{"organizations": [], "uuid": "6513a138954a6eb285e97ebd39f476e43a77f8b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220655081&w=1200&r=LYNXMPEE081KV", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-mci-bsc/manchester-citys-aguero-heads-late-winner-in-league-cup-semi-first-leg-idUKKBN1EY2OZ", "country": "US", "domain_rank": 408, "title": "Manchester City's Aguero heads late winner in League Cup semi first leg", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T00:22:00.000+02:00", "replies_count": 0, "uuid": "6513a138954a6eb285e97ebd39f476e43a77f8b8"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-mci-bsc/manchester-citys-aguero-heads-late-winner-in-league-cup-semi-first-leg-idUKKBN1EY2OZ", "ord_in_thread": 0, "title": "Manchester City's Aguero heads late winner in League Cup semi first leg", "locations": [], "entities": {"persons": [{"name": "aguero", "sentiment": "negative"}, {"name": "john stones", "sentiment": "none"}, {"name": "bobby reid", "sentiment": "none"}, {"name": "sergio aguero", "sentiment": "none"}, {"name": "kevin de bruyne", "sentiment": "none"}], "locations": [{"name": "manchester city", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "bristol city - etihad stadium", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "yates  city", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "bristol city", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 10:27 PM / Updated 29 minutes ago Manchester City's Aguero heads last-gasp winner in League Cup semi first leg Reuters Staff 3 Min Read \nMANCHESTER, England (Reuters) - Manchester City forward Sergio Aguero’s last-gasp header secured a 2-1 victory over Bristol City in their League Cup semi-final first leg on Tuesday after the second-tier side had frustrated the Premier League leaders. Soccer Football - Carabao Cup Semi Final First Leg - Manchester City vs Bristol City - Etihad Stadium, Manchester, Britain - January 9, 2018 Manchester City's Sergio Aguero scores their second goal REUTERS/Andrew Yates \nCity, who have dished out a string of maulings in a stellar league campaign, found the Championship side a tough nut to crack and had to wait until the 92nd minute to grab the winner when Argentine substitute Aguero darted in to head home. \nThe visitors had opened the scoring with a penalty just before halftime after central defender John Stones had fouled Bobby Reid, who dispatched the spot kick with aplomb. \nKevin De Bruyne’s equaliser soon after the break turned the tide and City then laid siege to their opponents’ defence in the closing stages before Aguero’s goal gave them a vital advantage ahead of the return leg in two weeks’ time. \n“My players were fantastic because in football you can win, you can lose, but we try until the end. We win many games in the last minutes because we don’t give up,” City manager Pep Guardiola told Sky Sports. \nWith Manchester City unbeaten domestically all season and streaking clear in the Premier League it was hard to imagine them facing much of a test at home to Lee Johnson’s side, who are 14 points off the pace in the second division. \nYet the visitors had beaten four top flight sides en route to the semi-finals, including City’s arch rivals Manchester United in the last round, and were in no mood to lie down and wait for Guardiola’s City juggernaut to mow them over. \nThe hosts enjoyed the majority of early possession and came close to taking the lead when Bernardo Silva’s deflected effort rippled the side netting in the 15th minute, before De Bruyne forced visiting keeper Frank Fielding into a sharp save. Soccer Football - Carabao Cup Semi Final First Leg - Manchester City vs Bristol City - Etihad Stadium, Manchester, Britain - January 9, 2018 Manchester City's Raheem Sterling shoots at goal REUTERS/Andrew Yates RASH CHALLENGE \nYet the Championship side looked threatening on the break and, after the hosts had their own penalty appeal turned down when Bailey Wright manhandled Stones, referee Anthony Taylor pointed to the spot at the other end. Slideshow (10 Images) \nStones dived into a rash challenge on Reid, who stepped up and coolly dispatched his penalty a minute before halftime. \nCity were almost level immediately but Raheem Sterling’s chipped effort was headed off the line and over by Aden Flint while the England winger was denied again when one-on-one with the keeper early in the second half. \nThe lead lasted until the 55th minute when De Bruyne drove forward and fed Sterling, who pulled the ball back for the Belgian to lash home from 15 metres. \nSterling fluffed another chance when he struck the ball straight at Fielding from close range with 20 minutes remaining, while Leroy Sane dragged an effort wide before Guardiola summoned Aguero off the bench. \nIt proved decisive as Silva dinked in a cross and the diminutive Argentine nipped in front of Fielding to power home a header from close range. \nEnglish champions Chelsea host Arsenal in a London derby on Wednesday in the other semi-final first-leg clash. Writing by Toby Davis; Editing by Ken Ferris", "external_links": [], "published": "2018-01-10T00:22:00.000+02:00", "crawled": "2018-01-10T00:45:27.039+02:00", "highlightTitle": ""}