{"organizations": [], "uuid": "ad5f4a575dc0dfcf7cc2213a30b2210f52d37a6f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/business-wire-fireeye-announces-acquisition-of-x15-software.html", "country": "US", "domain_rank": 767, "title": "FireEye Announces Acquisition of X15 Software", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T16:00:00.000+02:00", "replies_count": 0, "uuid": "ad5f4a575dc0dfcf7cc2213a30b2210f52d37a6f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/business-wire-fireeye-announces-acquisition-of-x15-software.html", "ord_in_thread": 0, "title": "FireEye Announces Acquisition of X15 Software", "locations": [], "entities": {"persons": [{"name": "john laliberte", "sentiment": "none"}], "locations": [{"name": "milpitas", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "analyze machine-generated security data across cloud", "sentiment": "none"}, {"name": "fireeye", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "X15 Software’s Next Generation Big Data Platform To Add Innovative New Capabilities To Monitor, Search and Analyze Machine-Generated Security Data Across Cloud and On-Prem Environments\nMILPITAS, Calif.--(BUSINESS WIRE)-- FireEye, Inc. (NASDAQ: FEYE), the intelligence-led security company, today announced it acquired privately held X15 Software and its innovative next generation big data platform. The acquisition, which closed on January 11, 2018, will add significant data management capabilities and provide customers with an open platform for integrating machine-generated data that can easily incorporate new security technologies and big data sources to adapt to the evolving threat environment.\n“Organizations today are overwhelmed by alerts, the number of tools required to manage their security operations, and the challenge of unifying access to the large volumes of data that matter,” said John Laliberte, senior vice president of engineering at FireEye. “The X15 Software team built an incredibly versatile, enterprise-grade big data platform that enables distributed, real-time access and ingestion of data at scale within a unified data model and modular query language. X15 Software technology will accelerate our strategy of delivering an innovative, next-gen security platform.”\nThe integration of X15 Software’s technology will enhance the ability of FireEye to collect and deliver the data organizations need to protect their most valuable assets, providing:\nBig Data Management Capabilities -- X15 Software technology solves the complex problem of collecting, querying and analyzing large volumes of machine-generated data in real-time. X15 Software technology is built with the flexibility to ingest data sources at scale, allowing organizations to capture new data as their infrastructure evolves.\nOne Management Console for Cloud, On-Premise and Hybrid Environments -- As organizations expand their usage of different cloud platforms, X15 Software technology will provide the flexibility to manage security data from on-premise, hybrid and cloud environments, including: AWS Microsoft Azure, Google Cloud Platform and Oracle Cloud.\nA Platform for Innovation -- As the security landscape changes, organizations need a flexible security operations platform that can match the evolving capabilities of the adversaries. X15 Software technology will accelerate the capabilities of FireEye platform to better enable organizations to leverage security data to make expert decisions and keep pace with the threats against them.\n“We founded X15 Software to help organizations get more value out of the massive data they were generating on a daily basis, and very quickly we saw how impactful our technology could be in the security space,” said Val Rayzman, CEO of X15 Software prior to the acquisition. “By coming together with FireEye, we can help build a security platform that uses big data, threat intelligence and analytics to keep customers secure.”\nX15 Software was founded in 2013 and currently employs approximately 20 employees. The X15 teams are located in California and India and will bring their big data management experience to the FireEye engineering teams in their respective locations.\nFinancial Terms of the Transaction\nUnder the terms of the acquisition agreement, FireEye will pay approximately $15 million in equity and $5 million in cash.\nAbout FireEye, Inc.\nFireEye is the intelligence-led security company. Working as a seamless, scalable extension of customer security operations, FireEye offers a single platform that blends innovative security technologies, nation-state grade threat intelligence, and world-renowned Mandiant® consulting. With this approach, FireEye eliminates the complexity and burden of cyber security for organizations struggling to prepare for, prevent, and respond to cyber attacks. FireEye has over 6,300 customers across 67 countries, including more than 40 percent of the Forbes Global 2000.\nForward-Looking Statements\nThis press release contains forward-looking statements about the expectations, beliefs, plans, intentions and strategies of FireEye relating to FireEye's acquisition of X15 Software. Such forward-looking statements include statements regarding future offerings; expected benefits to FireEye, X15 Software and their respective customers; and plans regarding X15 Software technology and personnel. These forward-looking statements involve risks and uncertainties, as well as assumptions which, if they do not fully materialize or prove incorrect, could cause FireEye's results to differ materially from those expressed or implied by such forward-looking statements. The risks and uncertainties that could cause FireEye's results to differ materially from those expressed or implied by such forward-looking statements include the failure to achieve expected synergies and efficiencies of operations between FireEye and X15 Software; the ability of FireEye and X15 Software to successfully integrate their respective market opportunities, technology, products, personnel and operations; the failure to timely develop and achieve market acceptance of combined products and services; customer demand and adoption of the technology and solutions of FireEye or X15 Software; real or perceived defects, errors or vulnerabilities in the offerings of FireEye or X15 Software; the potential impact on the business of X15 Software as a result of the acquisition; the ability of FireEye and X15 Software to retain and motivate key employees of FireEye or X15 Software; and general economic conditions; as well as those risks and uncertainties included under the captions \"Risk Factors\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations,\" in FireEye's Quarterly Report on Form 10-Q filed with the Securities and Exchange Commission on November 2, 2017, which is available on the Investor Relations section of the company's website at investors.FireEye.com and on the SEC website at www.sec.gov . All forward-looking statements in this press release are based on information available to FireEye as of the date hereof, and FireEye does not assume any obligation to update the forward-looking statements provided to reflect events that occur or circumstances that exist after the date on which they were made. Any future product, feature, or related specification that may be referenced in this release is for informational purposes only and is not a commitment to deliver any technology or enhancement. FireEye reserves the right to modify future product or service plans at any time.\n© 2018 FireEye, Inc. All rights reserved. FireEye, X15 and Mandiant are registered trademarks or trademarks of FireEye, Inc. in the United States and other countries. All other brands, products, or service names are or may be trademarks or service marks of their respective owners.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180112005109/en/\nFireEye, Inc.\nMedia contact:\nDan Wire, 415-895-2101\ndan.wire@fireeye.com\nor\nInvestor contact:\nKate Patterson, 408-321-4957\nkate.patterson@FireEye.com\nSource: FireEye, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51742299&newsitemid=20180112005109&lan=en-US&anchor=www.sec.gov&index=2&md5=ba5bc313bbe5cc5ac47f66d4beda8be7", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestors.fireeye.com&esheet=51742299&newsitemid=20180112005109&lan=en-US&anchor=investors.FireEye.com&index=1&md5=b5a4507bcd5f70db52ac57446d3f746a", "http://www.businesswire.com/news/home/20180112005109/en/"], "published": "2018-01-12T16:00:00.000+02:00", "crawled": "2018-01-12T17:54:00.013+02:00", "highlightTitle": ""}