{"organizations": [], "uuid": "41095948aea84e3274304e1735348396aeb73cb6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/11/104940256-GettyImages-882712542.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/11/opecnon-opec-deal-could-be-formalized-beyond-2018.html", "country": "US", "domain_rank": 767, "title": "OPEC/non-OPEC deal could be formalized beyond 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.154, "site_type": "news", "published": "2018-01-11T11:35:00.000+02:00", "replies_count": 0, "uuid": "41095948aea84e3274304e1735348396aeb73cb6"}, "author": "Holly Ellyatt", "url": "https://www.cnbc.com/2018/01/11/opecnon-opec-deal-could-be-formalized-beyond-2018.html", "ord_in_thread": 0, "title": "OPEC/non-OPEC deal could be formalized beyond 2018", "locations": [], "entities": {"persons": [{"name": "al-mazrouei", "sentiment": "none"}, {"name": "suhail al-mazrouei", "sentiment": "none"}], "locations": [{"name": "united arab emirates", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "non-opec", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}, {"name": "energy and industry", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The United Arab Emirates' (UAE) oil minister has hinted that an alliance between OPEC and non-OPEC producers, including Russia, could continue in some shape or form beyond their current deal to curb oil output.\nSpeaking to CNBC Thursday, the Energy and Industry Minister Suhail al-Mazrouei said the partnership between global oil producers to try to stabilize oil markets , by curbing output, was working and could go further than a December 2018 deadline.\n\"I am expecting that this group of countries that stood and have become responsible for helping the market to correct, (that) there is a very good chance that they could stick together and put a shape around that alliance,\" al-Mazrouei said.\nLast November, OPEC and 10 non-OPEC producers led by Russia agreed to extend cuts to their oil output in an attempt to push prices higher. Starting in mid-2014, a slide in global demand combined with a boom in U.S. shale production to severely undercut prices.\nJOE KLAMAR/AFP/Getty Images UAE Energy Minister Suhail al-Mazrouei (C) speaks to journalists as he attends the 173rd OPEC Conference of Organization of the Petroleum Exporting Countries (OPEC) in Vienna, on November 30, 2017. The OPEC/non-OPEC deal is due to run out in December 2018 , although the producers will review the agreement at their next meeting in June to assess how it is impacting prices and global crude stockpiles.\nThere have been rumors that Russia might want to end the deal earlier rather than later due to jitters among Russia's oil industry about the duration of the curbs.\nSpeaking to CNBC at the 9th Gulf Intelligence UAE Energy Forum in Abu Dhabi, al-Mazrouei said he was impressed at how well the OPEC and non-OPEC partnership was working , particularly with production data showing a high level of compliance to the agreement.\n\"OPEC will continue to be a strong organization and I think this phenomena of getting others to join OPEC in their cause of market recovery, and achieving enough to incentivise investments into this industry, is something in which interest is growing,\" he said.", "external_links": [], "published": "2018-01-11T11:35:00.000+02:00", "crawled": "2018-01-11T11:43:56.004+02:00", "highlightTitle": ""}