{"organizations": [], "uuid": "d98f04bb8f237d807e2ef62c8212add283ad588b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/africa", "section_title": "Reuters.com | Africa", "url": "https://www.reuters.com/article/us-congo-girls/football-and-singing-could-give-girl-soldiers-a-second-chance-in-congo-charity-idUSKBN1FF22Z", "country": "US", "domain_rank": 408, "title": "Football and singing could give girl soldiers a second chance in Congo: charity", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.535, "site_type": "news", "published": "2018-01-26T23:33:00.000+02:00", "replies_count": 0, "uuid": "d98f04bb8f237d807e2ef62c8212add283ad588b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-congo-girls/football-and-singing-could-give-girl-soldiers-a-second-chance-in-congo-charity-idUSKBN1FF22Z", "ord_in_thread": 0, "title": "Football and singing could give girl soldiers a second chance in Congo: charity", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Thomson Reuters Foundation) - Playing football, singing in the church choir or talking to a trusted confidant could do more to help girl soldiers recover from traumatic experiences in Democratic Republic of Congo than traditional humanitarian projects, a charity said.\nGirls fleeing armed groups in DRC face stigma and rejection from friends and family when they return, and working on simple initiatives with local communities could help, said British charity Child Soldiers International (CSI).\n“We missed the mark a bit because the girls didn’t need professional training or income-generating activities,” Sandra Olsson of CSI told an audience in London on Thursday.\n“All they wanted was to be like all the other girls, they just wanted to be accepted and have friends.”\nThe charity interviewed more than 150 former girl soldiers in DRC, and published guidelines on how best to reintegrate them - with local participation key, Olsson said.\nFor instance, CSI found that due to a lack of market research, humanitarian projects were training girls to become seamstresses in an area that was saturated with the skill.\nIn total, 38 charity projects established to rehabilitate girl soldiers had failed, with only 15 having modest success, CSI found.\nInstead, the charity’s guidelines advocate strengthening existing local activities such as farming and animal husbandry or enhancing literacy.\nEastern Congo is plagued by dozens of armed groups that menace civilians and exploit mineral reserves. About a third of child soldiers in the groups are girls, according to the United Nations’ peacekeeping mission in DRC.\nMillions have been displaced and are in need of emergency assistance, Veronique Aubert of Save the Children aid agency, told the event in London.\nA survey of aid agencies polled by the Thomson Reuters Foundation found the crisis in Congo to be the “most neglected” of 2017, outranking Yemen and the Central African Republic.\nMany of the girls said their emotional suffering came from not being able to talk to former friends or being pointed at in the street, with some being driven back to militias.\n“Not two days goes by without neighbors making us feel we have known men. We are not allowed to associate with their daughters,” said one of the girls interviewed by CSI.\nSuccessful reintegration could also have long term benefits said Aubert, as girls of today become the mothers of tomorrow.\nViolence in the DRC has been on the rise since President Joseph Kabila refused to step down at the end of his mandate in 2016, with a delayed election scheduled for December.\nIn 2017, a brutal conflict in the southwestern Kasai region drew international attention and condemnation because of reports of atrocities by pro-government militias.\nReporting by Adela Suliman; editing by Ros Russell. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-26T23:33:00.000+02:00", "crawled": "2018-01-27T00:10:26.000+02:00", "highlightTitle": ""}