{"organizations": [], "uuid": "7a0a50dd5e47358a313b75a478aab7e04252fc3a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/22/104959475-Tim_Cook_visits_students_Beirut_Lebanon_01212018.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/apple-ceo-tim-cook-education-is-a-great-equalizing-force.html", "country": "US", "domain_rank": 767, "title": "Apple CEO Tim Cook: ‘Education is a great equalizing force’", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.025, "site_type": "news", "published": "2018-01-22T02:00:00.000+02:00", "replies_count": 0, "uuid": "7a0a50dd5e47358a313b75a478aab7e04252fc3a"}, "author": "Zameena Mejia", "url": "https://www.cnbc.com/2018/01/22/apple-ceo-tim-cook-education-is-a-great-equalizing-force.html", "ord_in_thread": 0, "title": "Apple CEO Tim Cook: ‘Education is a great equalizing force’", "locations": [], "entities": {"persons": [{"name": "malala yousafzai", "sentiment": "negative"}, {"name": "tim cook", "sentiment": "negative"}, {"name": "yousafzai", "sentiment": "none"}, {"name": "cook", "sentiment": "none"}], "locations": [{"name": "lebanon", "sentiment": "none"}, {"name": "beirut", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}], "organizations": [{"name": "apple apple", "sentiment": "negative"}, {"name": "taliban", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "university of oxford", "sentiment": "none"}, {"name": "malala fund", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CNBC.com Courtesy of Apple Apple CEO Tim Cook and Nobel Peace Prize Laureate Malala Yousafzai visit with Lebanese and Syrian students in Beirut, Lebanon. SHARES \nApple CEO and philanthropist Tim Cook announced today a partnership with Nobel Peace Prize-winner Malala Yousafzai and her Malala Fund as part of the tech company's latest efforts to support global education initiatives. \n\"We believe that education is a great equalizing force and we share Malala Fund's commitment to give every girl an opportunity to go to school,\" Cook said in a news release. \nYousafzai was shot in 2012 by a Taliban gunman for advocating women's education. Since then, she has become a renowned activist for equal rights. As of fall 2017, the 20-year-old is studying at the University of Oxford. \n\"My dream is for every girl to choose her own future,\" Yousafzai said in a statement. \"Through both their innovations and philanthropy, Apple has helped educate and empower people around the world.\" \nThe partnership between Apple and the Malala Fund will help over 100,000 girls in India and Latin America receive access to secondary education. Furthermore, the Malala Fund expects to double the number of grants awarded by its Gulmakai Network, which supports programs in Afghanistan, Pakistan, Lebanon, Turkey and Nigeria. tweet \n\"I am grateful that Apple knows the value of investing in girls and is joining Malala Fund in the fight to ensure all girls can learn and lead without fear,\" Yousafzai added. \nApple said it will also provide technology, curriculum and research into policy changes to reduce the barriers for girls attending school. \n\"Malala is a courageous advocate for equality,\" Cook said. \"She's one of the most inspiring figures of our time, and we are honored to help her extend the important work she is doing to empower girls around the world.\" \nThis isn't the first time Cook supports educational causes while at Apple. \nJust last week, Apple announced 70 colleges and universities in Europe were adopting the company's Everyone Can Code program. Apple's proprietary year-long curriculum for students in kindergarten through college teaches students computing skills to prepare them for future careers in app development. tweet \nIn 2015, along with dozens of tech companies, Apple participated in former President Barack Obama's \"ConnectED Initiative.\" As part of the effort to provide technology for disadvantaged U.S. schools, Apple provided $100 million in iPads, MacBooks and other products, as well as professional development tools. \n\"I think technology has to be a key part,\" Cook told ABC's Good Morning America in 2015. \"I wouldn't be where I am today without a good public education.\" \n\"Inclusion in diversity inspires innovation,\" Cook said. He added his three tips for the children now receiving the technology is to \"explore, discover, create.\" \nCook is among other tech billionaires, including Microsoft founder Bill Gates and Facebook founder and CEO Mark Zuckerberg, who are committing to the advancement of children's' education in the field. \nThrough his largest donation in 17 years, Gates reaffirmed his commitment to education in August of 2017 when Bloomberg reported he was pledging $4.6 billion to his personal foundation. \nGates has prioritized education reform and, more specifically, educational technology through the Bill & Melinda Gates Foundation —which received a $3.17 billion pledge from Warren Buffett in July of 2017 — for years. Notably, he's been outspoken in the past that software companies must do more to help children learn more effectively with technology's aid. \n\"It's amazing how little the typical classroom has changed over the years,\" Gates writes on his blog in 2016. In fact, he addressed the education-technology gap five years ago before an audience of top professors and researchers at the 2013 Microsoft Research Faculty Summit. \nAs for Zuckerberg, improving education is one of the challenges he is focusing on with his wife Priscilla Chan through their philanthropic organization, the Chan Zuckerberg Initiative. \nOne solution to scaling this challenge is technology, Zuckerberg wrote a Facebook post in December of 2017. \n\"It's hard to overstate how important education is for our children's future,\" Zuckerberg said. \"If you take a long-term view, most economic issues today can be solved for our children and the next generation by dramatically improving our education system.\"", "external_links": [], "published": "2018-01-22T02:00:00.000+02:00", "crawled": "2018-01-22T20:47:27.000+02:00", "highlightTitle": ""}