{"organizations": [], "uuid": "fbcd7c564c9645d2d201059480d5f4a863149c90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-iris-announces-changes-and-additions-to-its-executive-leadership-team.html", "country": "US", "domain_rank": 767, "title": "IRIS Announces Changes and Additions to Its Executive Leadership Team", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T19:05:00.000+02:00", "replies_count": 0, "uuid": "fbcd7c564c9645d2d201059480d5f4a863149c90"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-iris-announces-changes-and-additions-to-its-executive-leadership-team.html", "ord_in_thread": 0, "title": "IRIS Announces Changes and Additions to Its Executive Leadership Team", "locations": [], "entities": {"persons": [{"name": "chris belmont", "sentiment": "none"}, {"name": "jason crawford", "sentiment": "none"}, {"name": "sunil gupta", "sentiment": "none"}, {"name": "jason", "sentiment": "none"}], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "pensacola", "sentiment": "none"}], "organizations": [{"name": "iris", "sentiment": "negative"}, {"name": "board", "sentiment": "none"}, {"name": "board of advisors", "sentiment": "none"}, {"name": "board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PENSACOLA, Fla., Jan. 25, 2018 /PRNewswire/ -- Intelligent Retinal Imaging Systems (IRIS), the industry leader in early detection systems for diabetic eye disease, announced today the appointment of Chris Belmont as interim CEO, effective immediately. He replaces Jason Crawford, who will step down from his position as CEO.\n\"After careful planning and a strategic review of the company, the Board of Directors has decided to make a change in direction,\" said Dr. Sunil Gupta, M.D., Board Chairman, IRIS Founder and Chief Medical Officer. \"We want to thank Jason for his service and contributions over the last five years leading IRIS to our current phase of growth and in our mission to end preventable blindness. We are excited to welcome Chris Belmont, whose experience includes more than 25 years of leadership in some of the world's most respected patient care organizations, as well as membership on our initial Board of Advisors at IRIS. His deep domain expertise and strategic acumen position IRIS strongly for the next phase of our development.\"\nBelmont is the former Senior Vice President and Chief Information Officer of MD Anderson Cancer Center in Houston, ranked the No. 1 cancer center in the nation by U.S. News & World Report. He also previously served as CIO and Senior Vice President of Ochsner Health System, Louisiana's largest nonprofit, academic, multispecialty healthcare delivery system.\nIn addition to his leadership roles at Ochsner and MD Anderson, Belmont has previously held senior IT positions at top healthcare technology companies, including Siemens Medical Solutions. He earned his Master of Business Administration from Southeastern Louisiana University in Hammond, La., and has been a member of the Louisiana HIMSS Board since 2006 and a member of the American College of Healthcare Executives (ACHE).\n\"I'm grateful for the opportunity to lead IRIS in helping medical groups and health systems end preventable blindness for people with diabetes,\" Belmont said. \"We believe strongly in our mission, and we have been very fortunate to partner with a growing number of organizations who are working within their patient populations to make a difference.\"\nThrough its numerous clients across the United States, IRIS recently eclipsed 250,000 diabetic retinopathy exams. IRIS has helped these organizations diagnose pathology in one-quarter of all patients who've received an exam and more than seven percent of those diagnosed as moderate, severe or proliferative.\nIn other news, IRIS also named Steve Martin as Chief Commercial Officer and Scott Ginnetti as Vice President of Human Resources and Leadership Development.\nMartin most recently served as Senior Vice President of Sales for Emmi Solutions, a patient engagement technology company, which was acquired by Wolters Kluwer for $175 million in November 2016. He has also held Senior Vice President of Sales roles at Merge Healthcare and Allscripts. Martin currently serves as a Board of Director for Telemedicine Solutions.\nMeanwhile, Ginnetti worked for one of the nation's largest long term care providers, where he helped centralize and rebuild the HR team from the ground up for an organization with more than 16,000 stakeholders. Prior to that, he worked at Baptist Health Care (BHC) in the Pensacola area, where he achieved numerous accomplishments over his 12-year tenure.\nAbout Intelligent Retinal Imaging Systems\nIntelligent Retinal Imaging Systems (IRIS) is the industry leader in early detection systems for diabetic eye disease. The company's IRIS solution is an end-to-end FDA-cleared, telemedicine system that has improved quality, expanded access and reduced costs for diabetic retinopathy exams across the U.S. IRIS was founded in 2011 by nationally recognized retina surgeon Dr. Sunil Gupta, with a vision to end preventable blindness through the development and deployment of retinal diagnostic services in the primary care setting. The IRIS team of physicians, technicians and best practice client success experts partner with forward-thinking providers and payers to enhance patient outcomes by closing care gaps in healthcare systems. IRIS is the recipient of the 2017 Microsoft Innovation Award and the 2016 Frost & Sullivan New Product Innovation Award in Diabetic Retinopathy. For additional information, visit www.retinalscreenings.com .\nMEDIA CONTACT:\nPhilip Anast\nAmendola Communications (for IRIS)\n312-576-6990\npanast@acmarketingpr.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/iris-announces-changes-and-additions-to-its-executive-leadership-team-300587959.html\nSOURCE Intelligent Retinal Imaging Systems", "external_links": ["http://www.prnewswire.com/news-releases/iris-announces-changes-and-additions-to-its-executive-leadership-team-300587959.html", "http://www.retinalscreenings.com/"], "published": "2018-01-25T19:05:00.000+02:00", "crawled": "2018-01-25T20:55:44.000+02:00", "highlightTitle": ""}