{"organizations": [], "uuid": "e37cf1e5d23af2df6baa9b2d570fd5e7c67bee65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-amy-cooley-promoted-to-pinnacle-vice-president.html", "country": "US", "domain_rank": 767, "title": "Amy Cooley Promoted to Pinnacle Vice President", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-29T20:00:00.000+02:00", "replies_count": 0, "uuid": "e37cf1e5d23af2df6baa9b2d570fd5e7c67bee65"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-amy-cooley-promoted-to-pinnacle-vice-president.html", "ord_in_thread": 0, "title": "Amy Cooley Promoted to Pinnacle Vice President", "locations": [], "entities": {"persons": [{"name": "amy cooley", "sentiment": "negative"}, {"name": "schwabe", "sentiment": "none"}, {"name": "eric schwabe", "sentiment": "none"}, {"name": "cooley", "sentiment": "none"}, {"name": "amy", "sentiment": "none"}], "locations": [{"name": "denver", "sentiment": "none"}, {"name": "rocky mountain region", "sentiment": "none"}, {"name": "colorado", "sentiment": "none"}, {"name": "denver", "sentiment": "none"}], "organizations": [{"name": "rocky mountain", "sentiment": "none"}, {"name": "pinnacle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DENVER, Jan. 29, 2018 (GLOBE NEWSWIRE) -- Pinnacle, one of the nation’s leading multifamily management firms, announces today the promotion of Amy Cooley to vice president presiding over operations in Colorado. Elevating from her previous role as a regional property manager, Cooley now oversees a growing portfolio of apartment communities throughout the state and provides guidance to more than 100 team members. Based out of Denver, Cooley reports to Executive Vice President, Eric Schwabe.\nAmy Cooley promoted to vice president of Pinnacle's Rocky Mountain Region\n“Amy is an on-point operator whose tremendous work ethic is already creating recognizable changes in Colorado,” explains Schwabe. “There is so much opportunity for Pinnacle in that region and she is exactly the person we want to have at the helm as we grow our portfolio and team member mentorship programs.”\nUnder Cooley’s leadership, Pinnacle was recently awarded a 1,200 unit property in Denver, taking the company’s Rocky Mountain portfolio to more than 3,600 apartment homes with several new developments in the pipeline. In addition to business development in 2018, Cooley will be focused on employee growth by launching several local programs specific to recognition and mentorship. She is also in the process of adding new analytic tools and training programs to further enhance driving property performance.\nCooley joined Pinnacle in 2016 with 21 years of management experience, of which 17 years were at the corporate level. The operational expertise she built while working with firms like Greystar, the Laramar Group and Corum Real Estate Group helped her to instill quality, consistency and compliance within her Denver-based portfolio at Pinnacle. She has ground-up experience with all asset types and draws on her knowledge in operations, finance, marketing, budgeting, team building and client relations to lead with confidence.\nCooley is a Certified Property Manager (CPM), Certified Apartment Manager (CAM) and has her Colorado Real Estate Broker’s License.\nAbout Pinnacle Property Management Services, LLC\nPinnacle Property Management Services, LLC, (“Pinnacle”) is a privately held national real estate provider specializing in third party management of multifamily residential communities. As one of the nation’s preferred third-party managers, Pinnacle’s portfolio includes over 165,000 residential units and 2.75 million square feet of commercial assets. With the Corporate headquarters located in Dallas, Texas, Pinnacle has more than 4,100 employees located in 30 states. For more information, visit www.pinnacleliving.com .\nMEDIA CONTACT\nSuzi Smith\n(214) 891-7831\nssmith@pinnacleliving.com\nA photo accompanying this announcement is available at http://www.globenewswire.com/NewsRoom/AttachmentNg/3bbc9aa1-4add-4166-a067-078c8a9ca131\nSource: US-Pinnacle Property", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/3d8b1363-21bd-496e-9755-fa0c76dd8bfa", "http://www.globenewswire.com/NewsRoom/AttachmentNg/3bbc9aa1-4add-4166-a067-078c8a9ca131", "https://www.globenewswire.com/NewsRoom/AttachmentNg/3bbc9aa1-4add-4166-a067-078c8a9ca131/en"], "published": "2018-01-29T20:00:00.000+02:00", "crawled": "2018-01-29T20:57:25.007+02:00", "highlightTitle": ""}