{"organizations": [], "uuid": "7bf74cdbcedb78d1fe618395c205b13372e80510", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-corindus-announces-preliminary-fourth-quarter-and-full-year-2017-revenue.html", "country": "US", "domain_rank": 767, "title": "Corindus Announces Preliminary Fourth Quarter and Full Year 2017 Revenue", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T01:00:00.000+02:00", "replies_count": 0, "uuid": "7bf74cdbcedb78d1fe618395c205b13372e80510"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-corindus-announces-preliminary-fourth-quarter-and-full-year-2017-revenue.html", "ord_in_thread": 0, "title": "Corindus Announces Preliminary Fourth Quarter and Full Year 2017 Revenue", "locations": [], "entities": {"persons": [{"name": "mark toland", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "waltham", "sentiment": "none"}], "organizations": [{"name": "cvrs", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "corindus vascular robotics, inc.", "sentiment": "neutral"}, {"name": "corpath grx", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WALTHAM, Mass.--(BUSINESS WIRE)-- Corindus Vascular Robotics, Inc. (NYSE American: CVRS), a leading developer of precision vascular robotics, today reported preliminary revenue results for the fourth quarter and year ended December 31, 2017.\nPreliminary and unaudited revenue for fourth quarter 2017 is expected to be between $4.0 million and $4.2 million. During the fourth quarter, the company installed 10 systems including 6 new systems and 4 CorPath GRX upgrades purchased by existing customers. This brings the installed base of CorPath GRX systems to 33 units as of December 31, 2017.\nPreliminary and unaudited revenue for full year 2017 is expected to be between $9.5 million and $9.7 million.\n\"Our fourth quarter accomplishments reflect continued progress toward our strategic objectives,\" said Mark Toland. \"Our results are highlighted by meaningful strategic partnerships with leading institutions which validates our GRX robotic technology platform and the benefits it provides to hospitals and their patients.\"\nDisclosure Regarding Preliminary Unaudited Results\nThe preliminary unaudited revenue results included in this press release are prior to the completion of review and audit procedures by our independent registered public accountants. Accordingly, our independent registered public accountants do not express an opinion or any other form of assurance with respect thereto. These results could change as a result of further review and actual fourth quarter and full year results could differ materially from these estimates. Full quarterly results will be announced during our fourth quarter and 2017 year-end financial results conference call and included in our Annual Report on Form 10-K for the year ended December 31, 2017.\nAbout Corindus Vascular Robotics\nCorindus Vascular Robotics, Inc. is a global technology leader in robotic-assisted vascular interventions. The company's CorPath ® System is the first FDA-cleared medical device to bring robotic precision to percutaneous coronary interventions. During the procedure, the interventional cardiologist sits at a radiation-shielded workstation to advance guide catheters, stents, and guidewires with millimeter-by-millimeter precision. The workstation allows the physician greater control and the freedom from wearing heavy lead protective equipment that causes musculoskeletal injuries. CorPath GRX is the second generation robotic-assisted PCI technology offering enhancements to the platform by adding important key upgrades that increase precision, improve workflow, and extend the capabilities and range of procedures that can be performed robotically. With the CorPath System, Corindus Vascular Robotics brings robotic precision to interventional procedures to help optimize clinical outcomes and minimize the costs associated with complications of improper stent placement during manual procedures. Corindus stands behind its product with its unique $1,000 hospital credit \"One Stent Program.\" For additional information, visit www.corindus.com , and follow @CorindusInc.\nForward-Looking Statements\nStatements made in this release that are not statements of historical or current facts are \" \" within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements may involve known and unknown risks, uncertainties and other factors that may cause the actual results, performance or achievements of Corindus to be materially different from historical results or from any future results or projections expressed or implied by such . Accordingly, readers should not place undue reliance on any forward looking statements. In addition to statements that explicitly describe such risks and uncertainties, readers are urged to consider statements in the conditional or future tenses or that includes terms such as \"believes,\" \"belief,\" \"expects,\" \"estimates,\" \"intends,\" \"anticipates\" or \"plans\" to be uncertain and forward-looking. Forward-looking statements may include comments as to Corindus’ beliefs and expectations as to future events and trends affecting its business and are necessarily subject to uncertainties, many of which are outside Corindus’ control.\nExamples of such statements include statements that:\nPreliminary and unaudited revenue for fourth quarter 2017 is expected to be $4.0 million to $4.2 million; and preliminary and unaudited revenue for full year 2017 is expected to be $9.5 million to $9.7 million.\nImportant factors that could cause actual results to differ materially from those indicated by such are described in the sections titled \"Risk Factors\" in the company's filings with the Securities and Exchange Commission, including its most recent Annual Report on Form 10-K and Quarterly Reports on Form 10-Q, as well as reports on Form 8-K, including, but not limited to the following: the rate of adoption of our CorPath System and the rate of use of our cassettes; risks associated with market acceptance, including pricing and reimbursement; our ability to enforce our intellectual property rights; our need for additional funds to support our operations; our ability to manage expenses and cash flow; factors relating to engineering, regulatory, manufacturing, sales and customer service challenges; potential safety and regulatory issues that could slow or suspend our sales; and the effect of credit, financial and economic conditions on capital spending by our potential customers. Forward looking statements speak only as of the date they are made. Corindus undertakes no obligation to publicly update or revise any , whether as a result of new information, future events or otherwise that occur after that date. More information is available on Corindus' website at http://www.corindus.com\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123006549/en/\nCorindus Vascular Robotics, Inc.\nInvestor Contact:\nLynn Pieper Lewis, 415-937-5402\nir@corindus.com\nor\nMedia Contacts:\nKate Stanton, 508-653-3335 ext. 200\nkate.stanton@corindus.com\nSource: Corindus Vascular Robotics, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180123006549/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.corindus.com&esheet=51747843&newsitemid=20180123006549&lan=en-US&anchor=http%3A%2F%2Fwww.corindus.com&index=3&md5=0839e1caf9529345c85e69a7b7ba7494", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.corindus.com&esheet=51747843&newsitemid=20180123006549&lan=en-US&anchor=Corindus+Vascular+Robotics%2C+Inc.&index=1&md5=135da604e9d584930d60a191e5b752fb", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.corindus.com&esheet=51747843&newsitemid=20180123006549&lan=en-US&anchor=www.corindus.com&index=2&md5=e79be39865fe0c8086413814e9f5c828"], "published": "2018-01-24T01:00:00.000+02:00", "crawled": "2018-01-24T01:38:31.005+02:00", "highlightTitle": ""}