{"organizations": [], "uuid": "50051ce59947774970a23a2856a12a0f98253213", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223339339&w=1200&r=LYNXMPEE0I0SS", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-olympics-2018-alps-kristoffersen/alpine-skiing-kristoffersen-adds-a-touch-of-spice-to-skiing-idUKKBN1F81G7", "country": "US", "domain_rank": 408, "title": "Alpine skiing - Kristoffersen adds a touch of spice to skiing", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T15:08:00.000+02:00", "replies_count": 0, "uuid": "50051ce59947774970a23a2856a12a0f98253213"}, "author": "", "url": "https://uk.reuters.com/article/uk-olympics-2018-alps-kristoffersen/alpine-skiing-kristoffersen-adds-a-touch-of-spice-to-skiing-idUKKBN1F81G7", "ord_in_thread": 0, "title": "Alpine skiing - Kristoffersen adds a touch of spice to skiing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 1:11 PM / Updated an hour ago Alpine skiing - Kristoffersen adds a touch of spice to skiing Brian Homewood 4 Min Read \nWENGEN, Switzerland (Reuters) - Winning an Alpine skiing race can involve a long, agonising wait in front of the cameras to see if any rivals can better the racer’s time. \nMost skiers react with an expression of mild disappointment if their time is beaten, happily shaking hands with the new leader as they are displaced from the podium. \nNorway’s Henrik Kristoffersen, on the other hand, sometimes livens up proceedings by throwing a tantrum. \nThe 23-year-old, slalom bronze medallist in Sochi four years ago, is something of an exception in a sport which may have become too polite for its own good. \nAt last season’s world championships in St Moritz, he stormed off the piste, swearing and refusing to talk to reporters, after a poor performance in the slalom. He later returned for interviews and apologised. \nHis frustration has grown this season after a series of defeats to his rival Marcel Hirscher. \nAfter seeing his time beaten in the Zagreb slalom, Kristoffersen threw his sticks to the ground and kicked an advertising hoarding in disgust, earning criticism from fellow skier Felix Neureuther. \n“He jumped around like Rumpelstiltskin and I simply don’t understand it,” the German said in a radio interview. “He must learn to accept that someone else is better... and improve himself.” \nKristoffersen, however, said he was simply being himself. \n“I‘m not afraid to show my disappointment,” he said. “I am ambitious and I blame myself for not having won races.” \nKristoffersen was also involved in a dispute with the Norwegian federation two years ago over whether he could display a personal sponsor on his hat, at one point missing a race in Levi, Finland. Alpine Skiing - FIS Alpine Skiing World Cup - Men's Slalom - Wengen, Switzerland - January 14, 2018 - Henrik Kristoffersen of Norway during the podium ceremony. REUTERS/Denis Balibouse DOMINANT HIRSCHER \nYet it is no wonder that Kristoffersen gets frustrated. \nTwo seasons ago, he appeared to be threatening Hirscher’s dominance, which has seen the Austrian win six successive overall World Cup titles. \nAged 21, he became the first skier to win the classic slalom races at Adelboden, Wengen and Kitzbuehel in the same season and was crowned World Cup slalom champion, pipping Hirscher. Alpine Skiing - FIS Alpine Skiing World Cup - Men's Slalom - Wengen, Switzerland - January 14, 2018 - Henrik Kristoffersen of Norway during the podium ceremony. REUTERS/Denis Balibouse \nOnly Hirscher’s greater pedigree in the giant slalom prevented Kristoffersen offering a real challenge in the overall title race. \nRemarkably, Kristoffersen nearly repeated his hat-trick last season, missing out only at Kitzbuehel. \nThis season, however, he has endured seven second-placed finishes in World Cup races, with Hirscher the winner in five of those, and so far failed to add to his tally of 15 wins. \n“It’s not really about beating Marcel, it’s about trying to win races and ski as well as possible,” he said. \nAfter losing again in Wengen, he vowed to keep on plugging away. \n”At the moment, he’s just better, that’s the way it is,“ said Kristoffersen. ”I try hard but at the moment, it’s not enough but I’ll never give up that’s for sure. \n“I’ll keep fighting and I’ll train as much as I have to and do as many races as I have to so that one day I can be on the top step on the podium again.” \nPerhaps his luck will finally change in Pyeongchang. Writing by Brian Homewood; Editing by Toby Davis", "external_links": [], "published": "2018-01-19T15:08:00.000+02:00", "crawled": "2018-01-19T16:12:42.012+02:00", "highlightTitle": ""}