{"organizations": [], "uuid": "a6d82604620bd1567a3bf7636c424a080291c6ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-anworth-announces-2017-dividend-tax-information.html", "country": "US", "domain_rank": 767, "title": "Anworth Announces 2017 Dividend Tax Information", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T23:51:00.000+02:00", "replies_count": 0, "uuid": "a6d82604620bd1567a3bf7636c424a080291c6ce"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-anworth-announces-2017-dividend-tax-information.html", "ord_in_thread": 0, "title": "Anworth Announces 2017 Dividend Tax Information", "locations": [], "entities": {"persons": [{"name": "anworth", "sentiment": "none"}], "locations": [{"name": "calif.", "sentiment": "none"}, {"name": "anworth", "sentiment": "none"}], "organizations": [{"name": "anworth mortgage asset corporation", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SANTA MONICA, Calif.--(BUSINESS WIRE)-- Anworth Mortgage Asset Corporation (NYSE: ANH), a real estate investment trust (REIT), announced today tax information regarding its dividend distributions for the Company’s fiscal year ended December 31, 2017.\nStockholders should check the tax statements they receive from brokerage firms to ensure that the Anworth dividend information reported in those statements conforms to the information reported herein. Furthermore, stockholders should consult their tax advisors to determine the taxes that should be paid on Anworth’s dividends.\nAs a REIT, Anworth’s dividends are generally not eligible for rate reductions enacted for certain types of dividend income under the Jobs and Growth Tax Relief Reconciliation Act of 2003. Thus, the portion of Anworth’s dividends that are characterized as ordinary income generally will be taxed at full ordinary income rates. For stockholders that are corporations, Anworth’s dividends are not eligible for the corporate dividends-received deduction. Any dividend distribution, or portion thereof, that is carried over to 2018 will be eligible for a 20% deduction from gross income under the new tax law that is effective for 2018.\nAs each stockholder’s tax situation may be different and each dividend distribution may have its own separate tax status, the tables below provide the detailed tax information for each of Anworth’s dividends declared during our 2017 fiscal year:\n8.625% Series A Cumulative Preferred Stock (CUSIP 037347 20 0)\n2017 Total 2017 2017 Short-Term Declaration Record Payable Distribution Ordinary Return of Capital Carry-Over Date Date Date Per Share income Capital Gains to 2018 10/14/16 12/30/16 01/17/17 $ - $ - $ - $ - $ - 01/26/17 03/31/17 04/17/17 0.539063 0.539063 - - - 04/26/17 06/30/17 07/17/17 0.539063 0.539063 - - - 07/27/17 09/29/17 10/16/17 0.539063 0.539063 - - - 10/26/17 12/29/17 01/16/18 0.539063 0.205063 - - 0.334000 Total: $ 2.156252 $ 1.822252 $ - $ - $ 0.334000 6.25% Series B Cumulative Convertible Preferred Stock (CUSIP 037347 30 9)\n2017 Total 2017 2017 Short-Term Declaration Record Payable Distribution Ordinary Return of Capital Carry-Over Date Date Date Per Share (1) income Capital Gains to 2018 10/14/16 12/30/16 01/17/17 $ 0.006634 $ 0.006634 $ - $ - $ - 01/26/17 03/31/17 04/17/17 0.397776\n0.397776\n- - - 04/26/17 06/30/17 07/17/17 0.399958 0.399958 - - - 07/27/17 09/29/17 10/16/17 0.396970 0.396970 - - - 10/26/17 12/29/17 01/16/18 0.390625 0.148596 - - 0.242029 Total: $ 1.591963\n$ 1.349934\n$ - $ - $ 0.242029 (1) The Series B Preferred Stock is convertible into shares of our common stock. The conversion rate is adjusted per a stated formula when distributions are made to our common stockholders. The value of any conversion rate increase is a deemed distribution for tax purposes and is taxable to holders of our Series B Preferred Stock to the extent supported by earnings and profits and is included in the table above. See Forms 8937 on our Company website for additional details. 7.625% Series C Cumulative Redeemable Preferred Stock (CUSIP 037347 40 8)\n2017 Total 2017 2017 Short-Term Declaration Record Payable Distribution Ordinary Return of Capital Carry-Over Date Date Date Per Share income Capital Gains to 2018 10/14/16 12/30/16 01/17/17 $ - $ - $ - $ - $ - 01/26/17 03/31/17 04/17/17 0.476563 0.476563 - - - 04/26/17 06/30/17 07/17/17 0.476563 0.476563 - - - 07/27/17 09/29/17 10/16/17 0.476563 0.476563 - - - 10/26/17 12/29/17 01/16/18 0.476563 0.181288 - - 0.295275 Total: $ 1.906252 $ 1.610977 $ - $ - $ 0.295275 Common Stock (CUSIP 037347 10 1)\n2017 Total 2017 2017 Short-Term Declaration Record Payable Distribution Ordinary Return of Capital Carry-Over Date Date Date Per Share income Capital Gains to 2018 12/16/16 12/30/16 01/30/17 $ 0.062630 $ 0.062630 $ - $ - $ - 03/15/17 03/31/17 04/28/17 0.150000 0.150000 - - - 06/15/17 06/30/17 07/28/17 0.150000 0.150000 - - - 09/15/17 09/29/17 10/27/17 0.150000 0.150000 - - - 12/15/17 12/29/17 01/29/18 0.150000 - - - 0.150000 Total: $ 0.662630 $ 0.512630 $ - $ - $ 0.150000 Because Anworth is a REIT, dividends declared in October, November, or December of a calendar year with a record date in that calendar year but which are payable in January of the following year are considered paid for Form 1099 reporting purposes on the record date, not on the payable date, to the extent the REIT has any remaining undistributed earnings and profits (as computed for income tax purposes) as of December 31 of that calendar year. The amounts shown above that were declared in the fourth quarter of 2016 but not paid until January 2017 represent the per share amount of the distributions paid which exceeded Anworth’s undistributed earnings and profits for income tax purposes as of December 31, 2016 and which were not included in the 2016 tax year but were carried over to 2017 as ordinary income for income tax purposes. The amounts shown above in the column labeled Carry Over to 2018 represent the per share amount of the distributions payable in January 2018 which exceeded Anworth’s undistributed earnings and profits for income tax purposes as of December 31, 2017. These amounts will be treated for income tax purposes as 2018 distributions to the Anworth stockholders to whom the distributions were payable in January 2018.\nDividends may be reinvested through Anworth’s Dividend Reinvestment Plan. Plan information may be obtained from the Plan Administrator, American Stock Transfer and Trust Company, at 877-248-6410, on Anworth’s web site at http://www.anworth.com , or by contacting Anworth at 310-255-4493.\nAbout Anworth Mortgage Asset Corporation\nAnworth is an externally-managed mortgage real estate investment trust. We invest primarily in mortgage-backed securities that are either rated “investment grade” or are guaranteed by federally sponsored enterprises, such as Fannie Mae or Freddie Mac. We seek to generate income for distribution to our shareholders primarily based on the difference between the yield on our mortgage assets and the cost of our borrowings. We are managed by Anworth Management LLC, or the Manager, pursuant to a management agreement. The Manager is subject to the supervision and direction of our Board of Directors and is responsible for (i) the selection, purchase, and sale of our investment portfolio; (ii) our financing and hedging activities; and (iii) providing us with management services and other services and activities relating to our assets and operations as may be appropriate. Our common stock is traded on the New York Stock Exchange under the symbol “ANH.” Anworth is a component of the Russell 2000® Index.\nSafe Harbor Statement under the Private Securities Litigation Reform Act of 1995\nThis news release may contain forward-looking statements within the meaning of the \"safe harbor\" provisions of the Private Securities Litigation Reform Act of 1995. Forward-looking statements are based upon our current expectations and speak only as of the date hereof. Forward-looking statements, which are based on various assumptions (some of which are beyond our control) may be identified by reference to a future period or periods or by the use of forward-looking terminology, such as “may, ” “will, ” “believe, ” “expect, ” “anticipate, ” “assume,” “estimate,” “intend,” “continue, ” or other similar terms, or variations on those terms, or the negative of those terms. Our actual results may differ materially and adversely from those expressed in any forward-looking statements as a result of various factors and uncertainties, including but not limited to, changes in interest rates; changes in the market value of our mortgage-backed securities; changes in the yield curve; the availability of mortgage-backed securities for purchase; increases in the prepayment rates on the mortgage loans securing our mortgage-backed securities; our ability to use borrowings to finance our assets and, if available, the terms of any financing; risks associated with investing in mortgage-related assets; changes in business conditions and the general economy, including the consequences of actions by the U.S. government and other foreign governments to address the global financial crisis; implementation of or changes in government regulations affecting our business; our ability to maintain our qualification as a real estate investment trust for federal income tax purposes; our ability to maintain an exemption from the Investment Company Act of 1940, as amended; risks associated with our home rental business; and the Manager’s ability to manage our growth. Our Annual Report on Form 10-K and other SEC filings discuss the most significant risk factors that may affect our business, results of operations and financial condition. We undertake no obligation to revise or update publicly any forward-looking statements for any reason.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180130006338/en/\nAnworth Mortgage Asset Corporation\nJohn T. Hillman\n1299 Ocean Avenue, Second Floor\nSanta Monica, CA 90401\n(310) 255-4438 or (310) 255-4493\nEmail: jhillman@anworth.com\nWeb site: http://www.anworth.com\nSource: Anworth Mortgage Asset Corporation", "external_links": ["http://www.businesswire.com/news/home/20180130006338/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.anworth.com&esheet=51751135&lan=en-US&anchor=http%3A%2F%2Fwww.anworth.com&index=2&md5=0a07c492b8b5c2d3bc2e199913df1913", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.anworth.com&esheet=51751135&newsitemid=20180130006338&lan=en-US&anchor=http%3A%2F%2Fwww.anworth.com&index=1&md5=e24fafc8b4726cc64ac05a190dd66f3a"], "published": "2018-01-30T23:51:00.000+02:00", "crawled": "2018-01-31T00:38:54.018+02:00", "highlightTitle": ""}