{"organizations": [], "uuid": "361ea10407a928b949fcf375d647983ab2b5cee6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/08/104933927-GettyImages-880077294.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/17/cryptocurrency-sell-off-continues-as-bitcoin-ethereum-sink.html", "country": "US", "domain_rank": 767, "title": "Cryptocurrency sell-off continues as bitcoin, ethereum sink", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.181, "site_type": "news", "published": "2018-01-17T14:19:00.000+02:00", "replies_count": 0, "uuid": "361ea10407a928b949fcf375d647983ab2b5cee6"}, "author": "Ryan Browne", "url": "https://www.cnbc.com/2018/01/17/cryptocurrency-sell-off-continues-as-bitcoin-ethereum-sink.html", "ord_in_thread": 0, "title": "Cryptocurrency sell-off continues as bitcoin, ethereum sink", "locations": [], "entities": {"persons": [{"name": "chris ratcliffe", "sentiment": "negative"}], "locations": [{"name": "coinbase", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "coindesk", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "4 Hours Ago | 01:01 \nBitcoin fell below $10,000 for the first time since November, as a sell-off in cryptocurrencies continued for a second day. \nThe world's largest cryptocurrency dived as low as $9,199.59 Wednesday morning, falling almost 19 percent within 24 hours, according to CoinDesk data. CoinDesk tracks prices from cryptocurrency exchanges Bitstamp, Coinbase, itBit and Bitfinex. Bitcoin then recovered slightly to $10,123 at 11:56 a.m. ET. \nThe last time bitcoin fell below the $10,000 mark was November 30. The red-hot digital asset soared to a record high of $19,783.21 on CoinDesk last month, but has since been on a gradual decline. At its current price, it is now down almost 50 percent from that all-time high. \nMore than $30 billion was shaved off the cryptocurrency's market value in the last 24 hours. \n\"Focus has shifted to negative regulation with headlines out of South Korea, China, and even minor headlines from France and the U.S.,\" Ari Paul, chief investment officer at cryptocurrency investment firm BlockTower Capital, said in an email. \"These headlines are having an outsized effect because cryptocurrency as a whole was overbought and sentiment reached exuberant levels, setting the stage for the violent correction that we're seeing.\" Credit: CoinMarketCap \nEthereum and ripple — the second and third-biggest digital assets respectively — continued to move lower. According to CoinMarketCap data, ethereum was trading 15 percent lower near $885 a coin, while ripple fell nearly 14 percent to around $1.02. \nCryptocurrencies appeared to sell off shortly after South Korea's Finance Minister, Kim Dong-yeon, said the country was still mulling a shutdown of crypto exchanges . Initial reports of South Korea — one of the biggest cryptocurrency markets in the world — moving to clamp down on virtual currency trading last week sent the price of bitcoin and a number of other major digital assets down sharply. \n\"The action we're seeing may seem dramatic but is really quite normal for this market,\" Mati Greenspan, senior market analyst at eToro, told CNBC via email. \"All in all, this drop has brought us back to the prices that were traded about a month ago for most coins.\" \nGreenspan said Tuesday that South Korean and Japanese investors often pay a premium of \"20 percent or more per coin,\" but on Wednesday said they appeared to be falling. show chapters ", "external_links": [], "published": "2018-01-17T14:19:00.000+02:00", "crawled": "2018-01-17T14:19:43.000+02:00", "highlightTitle": ""}