{"organizations": [], "uuid": "8db611a9e4ce46a954c98781a68c67d7caeae249", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-usa-municipals-fossilfuels/new-york-sues-fossil-fuel-majors-plans-divestment-from-pension-funds-idUSKBN1EZ2Q2", "country": "US", "domain_rank": 408, "title": "UPDATE 1-New York sues fossil fuel majors, plans divestment from pension funds", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T22:37:00.000+02:00", "replies_count": 0, "uuid": "8db611a9e4ce46a954c98781a68c67d7caeae249"}, "author": "", "url": "https://www.reuters.com/article/us-usa-municipals-fossilfuels/new-york-sues-fossil-fuel-majors-plans-divestment-from-pension-funds-idUSKBN1EZ2Q2", "ord_in_thread": 0, "title": "UPDATE 1-New York sues fossil fuel majors, plans divestment from pension funds", "locations": [], "entities": {"persons": [{"name": "scott stringer", "sentiment": "none"}, {"name": "laila kearney", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "conocophillips", "sentiment": "none"}, {"name": "chevron corp", "sentiment": "none"}, {"name": "bp plc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "exxon mobil corp", "sentiment": "none"}, {"name": "royal dutch shell plc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 42 PM / Updated 5 minutes ago New York sues fossil fuel majors, plans divestment from pension funds Laila Kearney 3 Min Read \nNEW YORK (Reuters) - New York City announced on Wednesday that it filed a multibillion dollar lawsuit against five top oil companies, citing their “contributions to global warming,” as it said it would divest fossil fuel investments from its $189 billion public pension funds over the next five years. \nThe lawsuit, against BP Plc, Chevron Corp, ConocoPhillips, Exxon Mobil Corp and Royal Dutch Shell Plc, follows similar lawsuits filed last year by San Francisco and other California cities seeking billions of dollars in damages from rising sea levels due to climate impacts. \n“Safeguarding the retirement of our city’s police officers, teachers, firefighters and city workers is our top priority, and we believe that their financial future is linked to the sustainability of the planet,” Comptroller Scott Stringer said in the statement. \nThe lawsuits are the latest legal challenges against oil companies over climate change and come as the firms are searching for new business models amid pressure by governments and consumers for cleaner energy. \n“Reducing greenhouse gas emissions is a global issue and requires global participation and actions,” Exxon said in a statement. “Lawsuits of this kind — filed by trial attorneys against an industry that provides products we all rely upon to power the economy and enable our domestic life – simply do not do that.” \nChevron also said the lawsuits only serve special interests. ConocoPhillips declined to comment, and neither BP nor Shell could immediately be reached. \nExxon this week hit back against the California lawsuits in a filing with a Texas state court pointing out none of the cities disclosed such risks to bond buyers and arguing the lawsuits were politically motivated and linked to cases brought by the states of New York and Massachusetts. \nIn afternoon trading, stock prices for the companies were mixed. Shares of Exxon Mobile and ConocoPhillips were down slightly, while Chevron and BP shares were up slightly. New York’s goal of eliminating about $5 billion in securities of nearly 200 oil companies, would be among the biggest public pension divestments from fossil fuels to date, the city said in a statement. \nNorway’s trillion-dollar wealth fund, the largest of its kind, in November proposed cutting billions of dollars in oil and gas stocks. \nNew York Governor Andrew Cuomo previously has said he planned to halt future fossil fuel investments in the state’s public employee pension fund. \nThe case is City of New York vs BP Plc et al, U.S. District Court for Manhattan No. 1:18-cv-00182 Additional reporting by Ernest Scheyder in Houston; Editing by Richard Chang and Lisa Shumaker", "external_links": [], "published": "2018-01-10T22:37:00.000+02:00", "crawled": "2018-01-10T22:56:38.031+02:00", "highlightTitle": ""}