{"organizations": [], "uuid": "535ec810e93930b6327dc7d9c2202223d51fb103", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/15/reuters-america-update-3-brent-crude-oil-rises-to-70-on-output-cuts-ignores-n-america-rig-gains.html", "country": "US", "domain_rank": 767, "title": "UPDATE 3-Brent crude oil rises to $70 on output cuts, ignores N.America rig gains", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T08:14:00.000+02:00", "replies_count": 0, "uuid": "535ec810e93930b6327dc7d9c2202223d51fb103"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/15/reuters-america-update-3-brent-crude-oil-rises-to-70-on-output-cuts-ignores-n-america-rig-gains.html", "ord_in_thread": 0, "title": "UPDATE 3-Brent crude oil rises to $70 on output cuts, ignores N.America rig gains", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "opec", "sentiment": "none"}, {"name": "organization of the petroleum exporting countries", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "anz", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "gains@\n* Oil propped up by OPEC/Russia-led production cuts\n* Rising North American output threatens to undermine cuts\n* Asia remains awash with refined fuel products (Re-leads with Brent at $70)\nSINGAPORE, Jan 15 (Reuters) - Brent crude oil prices rose to $70 a barrel on Monday, supported by ongoing output cuts led by OPEC and Russia, and ignoring a rise in U.S. and Canadian drilling activity that points to higher future output in North America.\nBrent crude futures, the international benchmark for oil prices, were at $70 per barrel at 0558 GMT, up 13 cents from their last close.\nU.S. West Texas Intermediate (WTI) crude futures were at $64.53 a barrel, up 23 cents.\nBoth benchmarks last week reached levels not seen since December 2014, with Brent touching $70.05 a barrel and WTI reaching as high as $64.77.\nANZ bank said on Monday oil prices had recently risen on data that continued to show the market is tightening.\nOil markets have been well supported by production cuts led by the Organization of the Petroleum Exporting Countries (OPEC) and Russia which are aimed at propping up crude prices.\nThe cuts started in January last year and are set to last through 2018, and they have coincided with healthy demand growth, pushing up crude prices by more than 13 percent since early December.\nBut other factors, including political risk, have also supported crude.\n\"Tighter fundamentals are (the) main driver to the rally in prices, but geopolitical risk and currency moves along with speculative money in tandem have exacerbated the move,\" U.S. bank JPMorgan said in a note.\nAttracted by tighter supplies and strong consumption, financial investors have raised their net long U.S. crude futures positions, which would profit from higher prices, to a new record, the U.S. Commodity Futures Trading Commission (CFTC) said on Friday.\nSome analysts, though, have been warning of a downward correction after the sharp price gains since December.\n\"Many believe that oil prices above $60 will self-correct as this level of prices will encourage substantially more drilling in U.S. shale,\" said William O'Loughlin, investment analyst at Australia's Rivkin Securities.\nU.S. energy companies added 10 oil rigs in the week to Jan. 12, taking the number to 752, energy service firm Baker Hughes said on Friday.\nThat was the biggest increase since June 2017. ANZ bank said the jump came \"as shale producers quickly reacted to the strong rise in prices in 2018.\"\nThe picture was similar in Canada, where energy firms almost doubled the number of rigs drilling for oil last week to 185, the highest level in 10 months.\nThe high prices for crude, which is the most important feedstock in the petroleum industry, have also crimped profit margins for oil refiners, resulting in a decline in new crude orders.\n(Reporting by Henning Gloystein; Editing by Richard Pullin and Tom Hogue)", "external_links": [], "published": "2018-01-15T08:14:00.000+02:00", "crawled": "2018-01-15T13:02:53.019+02:00", "highlightTitle": ""}