{"organizations": [], "uuid": "bd77b8a16f49a8dfd84ffa0eb40bd7e705f92b52", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180125.html", "section_title": "Archive News &amp; Video for Thursday, 25 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/russia-film-stalin/russian-cinema-defies-official-ban-to-screen-stalin-satire-movie-idUSL8N1PK61O", "country": "US", "domain_rank": 408, "title": "Russian cinema defies official ban to screen Stalin satire movie", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T23:47:00.000+02:00", "replies_count": 0, "uuid": "bd77b8a16f49a8dfd84ffa0eb40bd7e705f92b52"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/russia-film-stalin/russian-cinema-defies-official-ban-to-screen-stalin-satire-movie-idUSL8N1PK61O", "ord_in_thread": 0, "title": "Russian cinema defies official ban to screen Stalin satire movie", "locations": [], "entities": {"persons": [{"name": "stalin", "sentiment": "negative"}, {"name": "josef stalin", "sentiment": "none"}, {"name": "iannucci", "sentiment": "none"}, {"name": "denis aksyonov", "sentiment": "none"}, {"name": "armando iannucci", "sentiment": "none"}], "locations": [{"name": "moscow", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "pioneer", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MOSCOW, Jan 25 (Reuters) - A Russian art house cinema screened satirical film ‘The Death of Stalin’ to a packed house on Thursday, despite the Russian culture ministry cancelling the movie’s release on the grounds that it mocks the country’s Soviet past.\nAsked about the screening at Moscow’s Pioneer cinema, the culture ministry, which earlier this week withdrew a licence for the movie’s general release, said in a statement that anyone defying its ban would be held legally accountable for their actions. Staff at the cinema declined to comment.\nAt an afternoon screening, the roughly 80 seats in the cinema’s auditorium were taken, and some audience members had to sit on the floor, according to a Reuters reporter who was at the movie theatre.\nThe film, the work of Scottish director Armando Iannucci, portrays back-stabbing and in-fighting among Soviet dictator Josef Stalin’s closest allies as they vie for power immediately after his 1953 death.\nOne of the audience members, 40-year-old businessman Denis Aksyonov, said he liked U.S. television satire Veep, which Iannucci created, and expected ‘The Death of Stalin’ to be similarly entertaining.\n“I think it’s healthy to laugh about difficult issues, I think that makes it easier and less difficult for society to deal with them,” Aksyonov said before the screening.\nHe said it was regrettable that a political storm had been whipped up around the film, but that he tried to ignore such things. “Well done to Pioneer for putting on the screening, they are demonstrating their civic stance,” he said.\nStalin was repudiated by the Soviet Union after his death. He is recognised as responsible for the deaths of millions, from policies that included the forced collectivisation of farms that caused famine, and from a succession of purges that saw mass executions and imprisonment at an archipelago of camps.\nBut Stalin’s leadership during World War Two, when the Red Army beat back a German occupation, is still associated by many Russians with the country’s greatest achievements.\nRussian President Vladimir Putin, running for re-election in March, has called Stalin “a complex figure” and said attempts to demonise him were a ploy to attack Russia.\nVladimir Medinsky, the culture minister, said on Tuesday his ministry had received a number of complaints about the film which had prompted him to withdraw its general release license.\n“Many people of the older generation, and not only, will regard it as an insulting mockery of all the Soviet past, of the country that defeated fascism and of ordinary people, and what’s even worse, even of the victims of Stalinism,” Medinsky said in a statement. (Writing by Christian Lowe; Editing by Andrew Osborn)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T23:47:00.000+02:00", "crawled": "2018-01-26T21:36:30.008+02:00", "highlightTitle": ""}