{"organizations": [], "uuid": "deef5d2c13df80984be046216fd484db39758cb0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226871945&w=1200&r=LYNXMPEE0U0FL", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-h-m-results/hm-quarterly-profit-falls-by-a-third-idUKKBN1FK0VY", "country": "US", "domain_rank": 408, "title": "H&M quarterly profit falls by a third", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T10:15:00.000+02:00", "replies_count": 0, "uuid": "deef5d2c13df80984be046216fd484db39758cb0"}, "author": "", "url": "https://uk.reuters.com/article/uk-h-m-results/hm-quarterly-profit-falls-by-a-third-idUKKBN1FK0VY", "ord_in_thread": 0, "title": "H&M quarterly profit falls by a third", "locations": [], "entities": {"persons": [{"name": "zara", "sentiment": "none"}], "locations": [], "organizations": [{"name": "reuters sta", "sentiment": "negative"}, {"name": "h&m", "sentiment": "negative"}, {"name": "min read  stockholm", "sentiment": "none"}, {"name": "inditex", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 8:15 AM / Updated 26 minutes ago H&M to close more stores in 2018 as online shift hurts Anna Ringstrom , Emma Thomasson 4 Min Read \nSTOCKHOLM (Reuters) - Fashion retailer H&M ( HMb.ST ) said on Wednesday sales at the start of the new year were slower than expected and it would close more core brand stores that have attracted fewer shoppers, sending its shares to a 9-year low. \nFollowing decades of rapid store expansion, the world’s second-biggest clothes group after Zara owner Inditex ( ITX.MC ) has struggled in the last couple of years to respond to the growth of ecommerce. \nCEO Karl-Johan Persson said on Wednesday a surprise drop in sales in H&M’s fiscal fourth quarter, announced in December, was also partly due to range misses and the fact the H&M brand has been slow to develop new store concepts. \n“In comparable H&M stores, performance was weak in many of our large mature markets,” CEO Karl-Johan Persson told analysts in a conference call. “This development mirrored the shift in the market from offline to online, and also we have to say we haven’t improved the shopping experience as rapidly increasing customer expectations require.” \nPersson told Reuters he expects H&M, which has also been squeezed by tougher brick-and-mortar competition in its core budget segment, to roll out a more enticing H&M store concept in 2019. \nSwedish H&M reported a 34 percent pretax profit drop in its fiscal fourth quarter through November, to 4.9 billion crowns (£441.6 million), just above expectations in a Reuters poll of analysts. \nIt said preliminary sales were unexpectedly sluggish again in December and January, up just 1 percent, and markdowns in the first quarter to shift unsold clothes would again be bigger than in the same period a year ago. \n“There is little in the statement to suggest that H&M can reignite its top line anytime soon, without margin dilution which we think will be key to a longer term re-rating of the shares,” RBC analyst Richard Chamberlain, with a neutral stance on the stock, said in a note to clients. \nThe sales were in stark contrast to Inditex’s Nov. 1-Dec. 11 period, up 13 percent at constant exchange rates. \nH&M’s shares, already down more than a third over the last year, fell 10.5 percent by 1445 GMT to levels last seen in 2008. FILE PHOTO: People walk past the windows of an H&M store in Barcelona, Spain, December 30, 2016. REUTERS/Regis Duvignau/File Photo DIVIDEND REINVESTMENT \nH&M would now speed up efforts to adapt to the fast-changing market, the company said, promising more detail at its first-ever capital markets day in February. \nPersson, whose grandfather founded H&M in 1947, said his family, which controls more than 70 percent of votes, planned to reinvest their dividends in the company, in exchange for new shares to help finance investments in analytics and technology. \nThe board plans to ask all shareholders to do the same at the annual general meeting in May. \nH&M finished the year with net debt on its balance sheet rather than net cash for the first time in more than 20 years. \nH&M said it planned to close around 170 underperforming stores this year, more than usual, mostly in mature markets, while most new openings would be in emerging markets. The net addition of stores will be 220 stores, down from 388 in 2017. \n“The scale of the reduction will surprise some today. And it will leave the bears questioning why H&M still enjoys a ‘growth stock’ rating,” wrote Morgan Stanley analysts Geoff Ruddell and Amy Curry, who rate H&M“underweight”. \nH&M’s full-year gross margin fell to 54.0 percent from 55.2 percent a year earlier, whereas Inditex’ slipped only slightly to 57.4 percent for the nine months to Oct. 31. \nInditex has outperformed its Swedish rival in recent years, helped by having a faster and more flexible supply chain. \nH&M, which has launched seven mostly higher-end independent brands in recent years to broaden its customer base, said it would launch “Afound” in Sweden in 2018, offering budget products mainly from external brands. Writing by Emma Thomasson and Anna Ringstrom; Editing by Keith Weir and David Evans", "external_links": [], "published": "2018-01-31T10:15:00.000+02:00", "crawled": "2018-01-31T10:37:53.003+02:00", "highlightTitle": ""}