{"organizations": [], "uuid": "3de27223a4a507b3bc6846d17526353c4347ec2c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-collplant-appoints-david-tsur-as-chairman-of-the-board.html", "country": "US", "domain_rank": 767, "title": "CollPlant Appoints David Tsur as Chairman of the Board", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T14:00:00.000+02:00", "replies_count": 0, "uuid": "3de27223a4a507b3bc6846d17526353c4347ec2c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-collplant-appoints-david-tsur-as-chairman-of-the-board.html", "ord_in_thread": 0, "title": "CollPlant Appoints David Tsur as Chairman of the Board", "locations": [], "entities": {"persons": [{"name": "david tsur", "sentiment": "negative"}, {"name": "kamada", "sentiment": "none"}, {"name": "yehiel tal", "sentiment": "none"}, {"name": "tsur", "sentiment": "none"}], "locations": [{"name": "israel", "sentiment": "none"}, {"name": "jerusalem", "sentiment": "none"}], "organizations": [{"name": "tase", "sentiment": "negative"}, {"name": "hebrew university", "sentiment": "none"}, {"name": "kamada ltd.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NESS ZIONA , Israel, January 16, 2018 /PRNewswire/ --\nCollPlant (TASE: CLPT, OTC: CQPTY) , a regenerative medicine company utilizing its proprietary plant-based rhCollagen technology for tissue repair products (recombinant human, \"rhCollagen\"), announced the appointment of David Tsur to the position of Chairman of the Board of Directors, effective immediately. Mr. Tsur had served as a director of CollPlant since March 2017.\nPreviously, Mr. Tsur was the Founder and Chief Executive Officer of Kamada Ltd., a plasma-derived protein therapeutics company focused on orphan indications, and continues to serve as Deputy Chairman of Kamada's Board of Directors. He brings to CollPlant significant senior management experience in both the public and private sectors, having been involved with companies in the fields of pharmaceuticals, biological products and bio-pharmaceuticals, with cumulative sales revenues of approximately $1 billion. Mr. Tsur holds a B.A. in economics and international relations and an MBA in business management, both from the Hebrew University, Jerusalem.\nYehiel Tal, CEO of CollPlant: \"We are delighted with the appointment of David Tsur as chairman of the board. His extensive industry experience, achievements and proven leadership skills, will be invaluable as CollPlant continues to in attain its goals and realize its commercial potential. I would like to take this opportunity to thank Adi Goldin, who had served as Chairman since May 2016, during which time we made significant business progress, including establishing the use of our biological ink for 3D printing of organs and tissues, in the development processes of leading multinational companies and research institutions operating in the field. Adi is continuing as a director on the Company's Board.\"\nDavid Tsur, Chairman of the Board of Directors: \"CollPlant is ready to more fully realize the potential and competitive advantages of recombinant collagen in breakthrough applications within regenerative medicine, such as biological ink to print organs and tissues. During 2018-2019, we will continue to pursue strategic joint ventures in order to position CollPlant as leading company in the field.\"\nAbout CollPlant\nCollPlant is a regenerative medicine company leveraging its proprietary, plant-based recombinant human collagen (rhCollagen) technology for the development and commercialization of tissue repair products, initially for the orthobiologics, 3D Bio-printing of tissue and organs, and advanced wound care markets. The Company's cutting-edge technology is designed to generate and process proprietary rhCollagen, among other patent-protected recombinant proteins. Given that CollPlant's rhCollagen is identical to the type I collagen produced by the human body, it offers significant advantages compared to currently marketed tissue-derived collagen, including improved biofunctionality, superior homogeneity and reduced risk of immune response. The Company's broad development pipeline includes biomaterials indicated for orthopedics and advanced wound healing. Lead products include: Vergenix ® STR (Soft Tissue Repair Matrix), for the treatment of tendinopathy; and Vergenix ® FG (Flowable Gel) wound filler, for treatment of acute and chronic wounds. CollPlant's business strategy includes proprietary development and manufacture of tissue repair products and their commercialization and distribution, together with leading third parties, alongside alliances with leading companies for joint development, manufacture and marketing of additional products.\nFor more information about CollPlant, visit http://www.collplant.com .\nContact at CollPlant:\nEran Rotem\nDeputy CEO & Chief Financial Officer\nTel: + 972-73-2325600/612\nEmail: Eran@collplant.com\nContact at Rx Communications Group, LLC:\nPaula Schwartz (for US Investors)\nManaging Director\nTel: 917-322-2216\nEmail: pschwartz@rxir.com\nSOURCE CollPlant", "external_links": [], "published": "2018-01-16T14:00:00.000+02:00", "crawled": "2018-01-16T17:06:54.002+02:00", "highlightTitle": ""}