{"organizations": [], "uuid": "5fe2e3537b79e27cfefe7892a24162cfe8739990", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-more-lithium-juniors-could-get-swallowed-by-majors-in-2018.html", "country": "US", "domain_rank": 767, "title": "More Lithium Juniors Could Get Swallowed by Majors in 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-16T16:30:00.000+02:00", "replies_count": 0, "uuid": "5fe2e3537b79e27cfefe7892a24162cfe8739990"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-more-lithium-juniors-could-get-swallowed-by-majors-in-2018.html", "ord_in_thread": 0, "title": "More Lithium Juniors Could Get Swallowed by Majors in 2018", "locations": [], "entities": {"persons": [{"name": "forbes", "sentiment": "none"}, {"name": "chris berry", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "house mountain partners llc", "sentiment": "none"}, {"name": "nemaska lithium inc.", "sentiment": "none"}, {"name": "lithium americas corp.", "sentiment": "none"}, {"name": "nextview new energy lion", "sentiment": "none"}, {"name": "lithium x energy corp.", "sentiment": "none"}, {"name": "standard lithium ltd.", "sentiment": "none"}, {"name": "nrg metals inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, January 16, 2018 /PRNewswire/ --\nThe lithium industry could be in for a big M&A consolidation in 2018. Lithium X Energy Corp. (TSX-V: LIX) (OTC: LIXXF) ended 2018 with an announcement of a definitive agreement with Nextview New Energy Lion acquiring all of the issued and outstanding shares and warrants of Lithium X. Other junior and major lithium miners to potentially keep a close eye on are Standard Lithium Ltd. (TSX-V: SLL) (OTC: STLHF) (FRA: S5L) ( STLHF Profile ), Nemaska Lithium Inc. (TSX: NMX) (OTC: NMKEF), NRG Metals Inc. (TSX-V: NGZ) , and Lithium Americas Corp. (TSX: LAC) (OTC: LACDF) .\nAs reported by Forbes, U.S. electric vehicle sales jumped by a record 37 percent in 2016 ( http://nnw.fm/0bL77 ), adding EV companies into an already-strained space and putting lithium supply and demand at an even greater imbalance, with supply for lithium already having trouble supporting the needs of the laptop and smartphone industries.\nAccording to an interview with Chris Berry, president and founder of House Mountain Partners LLC, an energy and natural resource research company, 2018 will be the year of consolidation for the lithium market. This could be in the form of some of the more junior mining companies joining forces to amp-up production or even the major mining companies coming together to work on evolving technologies and improving techniques to increase the production of lithium. Consolidation in this manner will help to add a long-term supply of lithium.\nAs lithium production companies begin to join forces, the market will become more aggressive: companies that once had a multitude of focuses will begin to zero in and focus solely on lithium. This will help to create a pure play lithium market that is better equipped to handle the increasing demand for lithium that will result from the growing EV industry. As companies grow through consolidation, their grip on the lithium market will expand and their resulting ability to produce more lithium will drastically help to find a balance between supply and demand.\nJunior Miners in The Mix\nStandard Lithium Ltd. (TSX-V: SLL) (FRA: S5L) (OTCQX: STLHF) launched in 2017 and is led by a management team harboring decades of experience in the lithium mining space. Standard Lithium stands out in this market because SLL is one of the few small cap investment options available in lithium mining that offers a pure play in the U.S. lithium market. This gives Standard Lithium a key strategic advantage when the U.S. market begins to seek domestic sources of metals like lithium, as per Trump's executive order .\nStandard Lithium's sole focus is on unlocking the value of existing large-scale U.S.-based lithium bearing brine resources that can be brought into production quickly. The current projects that Standard Lithium is working on highlight this, such as the Bristol Dry Lake and Cadiz Dry Lake lithium brine projects in California's Mojave Desert and the recently announced Smackover Formation lithium brine project in Arkansas.\nIn the Bristol Dry Lake area, Standard Lithium is working quickly to capitalize on the growing demand for lithium, as it outlined in a mid-December update ( http://nnw.fm/1Cc5Z ). Standard Lithium installed a total of six new test evaporation ponds at the Bristol Dry Lake property in order to further assess the role that short-duration passive solar evaporation may play in pre-concentrating the near surface lithium brines encountered at the project. Standard Lithium also took samples of lithium brine from all surface pits in the Bristol Dry Lake property, with results expected in the coming weeks. The Cadiz Dry Lake property will be assessed in a similar manner.\nThe Smackover Project consists of up to 33,000 acres of brine leases located in a key brine production fairway in southern Arkansas, at the disposal of Standard Lithium for exploration, production, and extraction focus on lithium. Based on historical data, these areas have reported values of 370-424 mg/L of lithium in the brines. This elevates the Smackover Formation as a lower-risk exploration opportunity, which will aid in Standard Lithium's endeavors to accelerate new production sources of lithium such as this one.\nNew Technologies and New Approaches\nStandard Lithium is looking not just to be a pure play lithium provider, but is also looking to innovate the lithium mining space in ways not yet capitalized upon by other lithium players.\nAccording to Standard Lithium CEO Robert Mintak, a large portion of the lithium resources currently available \"haven't been viewed through the right lens\" ( http://nnw.fm/0tS9Y ). New technologies and new approaches need to be applied in order to accelerate development timeframes in the lithium space. Standard Lithium is working towards unlocking value on projects that have been overlooked by conventional mining companies. One of the main methods that Standard Lithium uses is locating areas overlooked but actively producing brine deposits throughout North America, as SLL has done in Arkansas. The investment community has taken notice. Standard Lithium's U.S.-listed shares rose from under $0.70 at IPO in June 2017 to a high of $2.23 in late October. Standard Lithium is also limiting its geological risk and startup expenses, as Mintak further details in the interview.\n\"With the Bristol Dry Lake project in California, we have inked agreements with both of the regions permitted brine operators,\" he noted. \"They have been producing industrial minerals, for decades, - calcium chloride, sodium chloride from the near surface brine at Bristol Lake, but there's highly anomalous lithium concentrations in that same brine. We know that from historic USGS drilling that was done in the area, and we know that because we have sampled brine, because they're currently producing brine… Because of the agreements we have struck we are able to immediately sample raw brine and begin working on the important hydrometallurgy and processing work that any lithium project has to do… Having access immediately to raw brine to begin that important work was key for us.\"\nIn addition to its sampling efforts, Standard Lithium has completed drilling work on four of five exploration targets identified at the Bristol Dry Lake property. These results from these targets are expected to play a key role in the development of the project, as they will form the basis of an initial maiden resource assessment under way on the 35,000+ acre land package. As a result, the company intends to be able to produce a single resource statement for the total land package at Bristol Dry Lake. Standard aims to have a National Instrument 43-101 inferred resource report, which outlines the quantity and quality of minerals estimated on the basis of geological evidence and limited sampling, completed during the first half of 2018.\nStandard Lithium's fast-track approach to lithium production makes it an intriguing option for investors seeking to gain exposure to the massive upside forecast for the lithium industry. Though other small cap investment options are available in lithium mining, few offer a pure play market like Standard Lithium.\nAnother Canadian lithium mining firm, Nemaska Lithium", "external_links": ["http://www.networknewsbreaks.com/", "http://nnw.fm/1Cc5Z", "http://nnw.fm/0tS9Y", "https://www.washingtonpost.com/news/energy-environment/wp/2017/12/19/zinke-wants-to-expand-critical-minerals-production-saying-", "https://www.networknewswire.com/clients/standard-lithium-ltd/?symbol=stlhf", "http://nnw.fm/0bL77", "https://re.tc/sll-100396", "https://re.tc/sll-100387", "http://NNW.fm/Disclaimer"], "published": "2018-01-16T16:30:00.000+02:00", "crawled": "2018-01-16T19:36:25.008+02:00", "highlightTitle": ""}