{"organizations": [], "uuid": "a3766e0e7ee7c279c07e925c9e78c6accf3cf16d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219458697&w=1200&r=LYNXMPEE0400R", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/monsanto-results/monsanto-profit-misses-estimates-as-farmers-face-squeeze-idINKBN1EU027", "country": "US", "domain_rank": 408, "title": "Monsanto profit misses estimates as farmers face squeeze", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T02:30:00.000+02:00", "replies_count": 0, "uuid": "a3766e0e7ee7c279c07e925c9e78c6accf3cf16d"}, "author": "", "url": "https://in.reuters.com/article/monsanto-results/monsanto-profit-misses-estimates-as-farmers-face-squeeze-idINKBN1EU027", "ord_in_thread": 0, "title": "Monsanto profit misses estimates as farmers face squeeze", "locations": [], "entities": {"persons": [{"name": "tom polansek", "sentiment": "negative"}, {"name": "hugh grant", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "monsanto", "sentiment": "negative"}, {"name": "new york stock exchange", "sentiment": "none"}, {"name": "bayer ag", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "monsanto co", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 34 AM / in 22 minutes Monsanto profit misses estimates as farmers face squeeze Tom Polansek 3 Min Read \n(Reuters) - Monsanto Co ( MON.N ) reported weaker-than-expected quarterly earnings on Thursday and said low crop prices hurting farmers’ incomes would limit the company’s ability to profit from sales of its genetically engineered seeds and agricultural chemicals. FILE PHOTO: The Monsanto logo is displayed on a screen where the stock is traded on the floor of the New York Stock Exchange (NYSE) in New York City, U.S., May 9, 2016. REUTERS/Brendan McDermid/File Photo \nThe outlook makes the world’s biggest seed company the latest agribusiness to detail ongoing pressures from large crop inventories that are weighing on commodity prices following four years of bumper harvests. \nMonsanto, which is being acquired by Bayer AG ( BAYGn.DE ), does not have “great hope for significant price improvement” for its U.S. corn seeds, Chief Executive Hugh Grant told analysts on a conference call. \nU.S. farmers are facing corn prices Cc1 around $3.50 a bushel, down from more than $8 in 2012, making it harder for companies to sell higher-priced seeds, fertilizer and equipment that can produce bigger yields. \n“It is a tough year, so everybody is fighting for the last acres,” Grant said. \nHis comments came a day after commodity trader Cargill Inc [CARG.UL] reported that large crop inventories had hurt earnings for its global grain handling business. \nIn the fiscal first quarter ended Nov. 30, net profit attributable to Monsanto rose to $169 million, or 38 cents per share, from $29 million, or 7 cents per share, a year earlier. Analysts had expected earnings of 42 cents a share, according to Thomson Reuters I/B/E/S. \nTotal net sales were nearly flat at $2.658 billion, below analysts’ expectations for $2.77 billion. \nMonsanto said it benefited from strong demand for its Intacta brand soybean seeds in South America and sales of glyphosate, the key ingredient in its popular weed killer Roundup. \nIn the United States, Monsanto faces lawsuits over crop damage last year linked to a new herbicide based on a chemical known as dicamba. The company says the product is safe and expects higher sales this year. \n“We continue to expect strong adoption of our newest technologies and improved pricing for glyphosate to be tempered by challenging global corn and soybean prices, even as demand for both continues to grow,” Grant said. \nMonsanto and Bayer have received about half the antitrust approvals necessary to merge and expect the tie-up to close early this year, Grant said. \nIn the EU, regulators are set to warn Bayer the deal may hurt competition, a person familiar with the matter said last month. \n“Everybody’s paying attention to the regulatory approval process for this merger,” said Matt Arnold, analyst for Edward Jones. \nMonsanto shares were up 0.4 percent at $117.91 on Thursday afternoon. Reporting by Tom Polansek in Chicago and Akshara P in Bengaluru; Editing by Saumyadeb Chakrabarty and Matthew Lewis", "external_links": [], "published": "2018-01-05T02:30:00.000+02:00", "crawled": "2018-01-05T02:50:05.011+02:00", "highlightTitle": ""}