{"organizations": [], "uuid": "d8eeeaf121fcc41bf2405bc74745bf44b275d94f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-oashaughnessy-asset-management-osam-names-patrick-oashaughnessy-ceo.html", "country": "US", "domain_rank": 767, "title": "O’Shaughnessy Asset Management (OSAM) Names Patrick O’Shaughnessy CEO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T18:15:00.000+02:00", "replies_count": 0, "uuid": "d8eeeaf121fcc41bf2405bc74745bf44b275d94f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-oashaughnessy-asset-management-osam-names-patrick-oashaughnessy-ceo.html", "ord_in_thread": 0, "title": "O’Shaughnessy Asset Management (OSAM) Names Patrick O’Shaughnessy CEO", "locations": [], "entities": {"persons": [{"name": "patrick o’shaughnessy", "sentiment": "neutral"}, {"name": "jim o’shaughnessy", "sentiment": "neutral"}, {"name": "o’shaughnessy", "sentiment": "none"}, {"name": "patrick o'shaughnessy", "sentiment": "none"}], "locations": [{"name": "conn.", "sentiment": "none"}, {"name": "stamford", "sentiment": "none"}], "organizations": [{"name": "osam", "sentiment": "negative"}, {"name": "o’shaughnessy asset management", "sentiment": "neutral"}, {"name": "aua", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jim O’Shaughnessy, OSAM founder, remains Chairman and Chief Investment Officer of quantitative money management firm\nSTAMFORD, Conn.--(BUSINESS WIRE)-- O’Shaughnessy Asset Management (OSAM), a quantitative money management firm with approximately $6.9 billion in assets under management (AUM) and assets under advisement (AUA), today announced that it has named Patrick O’Shaughnessy, CFA, as the firm’s CEO. He succeeds Jim O’Shaughnessy, OSAM’s founder, who remains in his role as Chairman and Chief Investment Officer.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180124005771/en/\nPatrick O'Shaughnessy, CEO, OSAM (Photo: Business Wire)\nPatrick O’Shaughnessy, previously principal and portfolio manager at OSAM, assumes all CEO responsibilities while working in close coordination with Jim O’Shaughnessy during a transition period that is expected to be complete by the end of March 2018. After that, the father and son will continue to work side-by-side, with Patrick O’Shaughnessy reporting to Jim O’Shaughnessy. They both will remain in their portfolio management roles at OSAM. Chris Meredith, CFA, will continue as OSAM’s Director of Research, and Chris Loveless will continue as the firm’s President, both reporting to Patrick.\n“More than twenty years after I founded the firm, it is my honor and privilege to name Patrick CEO of O’Shaughnessy Asset Management,” says Jim O’Shaughnessy, Chairman and Chief Investment Officer, OSAM. “Patrick has enhanced our investment process, enriched our client service and opened new doors of opportunity for the firm. Now, he will lead our team as we expand upon what we have spent decades building – and pave the way for an even stronger future for OSAM and our clients.”\nIn his role as CEO, Patrick O’Shaughnessy will oversee the day-to-day business of the firm. He will direct OSAM’s initiatives in the areas of research and portfolio management, investor education and client service and relationships.\n“The asset management industry looks very different today than it did when OSAM started managing money in 1996,” says Patrick O’Shaughnessy, CEO, OSAM. “What hasn’t changed is our commitment to conducting the best new research we can on behalf of our clients – and to implementing our strategies with extreme discipline. These founding principles have been baked into our DNA for more than twenty years – and this history gives us a distinct advantage.\n“In the years – even decades – to come, we will focus on further improving our investment strategies, delivering an extraordinary and unique client experience grounded in transparency and education – and identifying new ways to use our research platform to help our clients engineer better overall portfolios. I am thrilled to have this opportunity to work with the entire OSAM team to achieve these perpetual goals,” adds Patrick O’Shaughnessy.\nAbout Patrick O’Shaughnessy\nPromoted to CEO from principal and portfolio manager Joined OSAM in 2007 Chartered Financial Analyst Author of Millennial Money: How Young Investors can Build a Fortune Patrick’s podcast, “Invest Like the Best,” has been downloaded more than two million times and was named among “5 Investment Podcasts You Should Listen To” by The Wall Street Journal Holds a B.A. in Philosophy from the University of Notre Dame Lives in Greenwich, Conn., and is married with two children\nAbout O’Shaughnessy Asset Management\nBased in Stamford, Conn., O’Shaughnessy Asset Management (OSAM) is a quantitative money management firm that provides a broad range of equity portfolios to institutional investors and the high-net-worth clients of financial advisory firms and independent financial advisors. OSAM is a team of factor-investing experts whose mission is to help clients build better portfolios.\nOSAM believes that successful investing requires two things: carefully researched and designed factor-based investment strategies that align with client objectives – and the steadfast discipline to stick to those strategies across market cycles and regimes. OSAM’s investment strategies are based on years of research by Jim O’Shaughnessy , widely regarded as a pioneer in quantitative equity analysis and author of the New York Times bestseller, What Works on Wall Street. Jim and the team at OSAM have identified the characteristics that have led to successful investing over the past 50 years – and these characteristics form the foundation of the firm’s investment strategies. For more information, visit www.osam.com .\nPlease remember that past performance is no guarantee of future results. OSAM is a Registered Investment Adviser with the SEC and a copy of our current written disclosure statement discussing our advisory services and fees remains available for your review upon request.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124005771/en/\nMedia\nEncore Communications\nMegan McDonnell, 203-249-3438\nmegan.mcdonnell@encorecomm.com\nor\nInstitutional Sales\nO’Shaughnessy Asset Management (OSAM)\nChris Loveless, 203-975-3304\nChris.Loveless@osam.com\nSource: O’Shaughnessy Asset Management (OSAM)", "external_links": ["http://www.businesswire.com/news/home/20180124005771/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.osam.com&esheet=51748152&newsitemid=20180124005771&lan=en-US&anchor=O%27Shaughnessy+Asset+Management&index=5&md5=21b75804b2dc0fb7522387970b6f1ae0", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.amazon.com%2FWhat-Works-Wall-Street-Fourth%2Fdp%2F0071625763&esheet=51748152&newsitemid=20180124005771&lan=en-US&anchor=What+Works+on+Wall+Street.&index=7&md5=c8b142e57267adef5f380459f81b9914", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fosam.com%2Fabout_leadership.aspx&esheet=51748152&newsitemid=20180124005771&lan=en-US&anchor=Jim+O%27Shaughnessy&index=6&md5=19cf955652624353cdb5f0185301f5ee", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.amazon.com%2FMillennial-Money-Young-Investors-Fortune%2Fdp%2FB01LTHXKKO&esheet=51748152&newsitemid=20180124005771&lan=en-US&anchor=Millennial+Money%3A+How+Young+Investors+can+Build+a+Fortune&index=2&md5=5e45de96d65e987f20c0b5ac5301a53a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestorfieldguide.com%2Fpodcast%2F&esheet=51748152&newsitemid=20180124005771&lan=en-US&anchor=%E2%80%9CInvest+Like+the+Best%2C%E2%80%9D&index=3&md5=4b8e6ebd7d9655b90f20f24fc6c705a5", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.osam.com&esheet=51748152&newsitemid=20180124005771&lan=en-US&anchor=www.osam.com&index=8&md5=7f49a41ed36f358a1c00a341ea1427cd", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fblogs.wsj.com%2Fexperts%2F2016%2F12%2F11%2F5-investing-podcasts-you-should-listen-to%2F&esheet=51748152&newsitemid=20180124005771&lan=en-US&anchor=%E2%80%9C5+Investment+Podcasts+You+Should+Listen+To%E2%80%9D+by%C2%A0The+Wall+Street+Journal&index=4&md5=187cd989a9c94f95f30898a72ad0c65e", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.osam.com&esheet=51748152&newsitemid=20180124005771&lan=en-US&anchor=O%27Shaughnessy+Asset+Management&index=1&md5=e0e18272a046fe39bb62da787c4d65b3"], "published": "2018-01-24T18:15:00.000+02:00", "crawled": "2018-01-24T19:26:53.002+02:00", "highlightTitle": ""}