{"organizations": [], "uuid": "f4b2aca38949080a07a4acea83461250e8f1041a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226530035&w=1200&r=LYNXMPEE0T0E1", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/usa-security-cia/cia-director-expects-russia-will-try-to-target-u-s-mid-term-elections-idINKBN1FJ0VT", "country": "US", "domain_rank": 408, "title": "CIA director expects Russia will try to target U.S. mid-term elections", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T09:56:00.000+02:00", "replies_count": 0, "uuid": "f4b2aca38949080a07a4acea83461250e8f1041a"}, "author": "", "url": "https://in.reuters.com/article/usa-security-cia/cia-director-expects-russia-will-try-to-target-u-s-mid-term-elections-idINKBN1FJ0VT", "ord_in_thread": 0, "title": "CIA director expects Russia will try to target U.S. mid-term elections", "locations": [], "entities": {"persons": [{"name": "mike pompeo", "sentiment": "none"}, {"name": "michael holden", "sentiment": "none"}, {"name": "guy faulconbridge", "sentiment": "none"}, {"name": "pompeo", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "west", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "ondon", "sentiment": "none"}, {"name": "kremlin", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "cia", "sentiment": "negative"}, {"name": "bbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - CIA Director Mike Pompeo said Russia will target U.S. mid-term elections later this year as part of the Kremlin’s attempt to influence domestic politics across the West, and warned the world had to do more to push back against Chinese meddling.\nRussia has been accused of meddling in the 2016 U.S. presidential election and Special Counsel Robert Mueller is investigating the allegations, which Moscow denies, and whether there was any collusion involving President Donald Trump’s associates.\nIn an interview with the BBC aired on Tuesday, U.S. intelligence chief Pompeo said Russia had a long history of information campaigns and said its threat would not go away.\nAsked if Russia would try to influence the mid-term elections, he said: ”Of course. I have every expectation that they will continue to try and do that.\n“But I am confident that America will be able to have a free and fair election. That we’ll push back in a way that is sufficiently robust that the impact they have on our election won’t be great.”\nHe also said the Chinese posed a threat of equal concern, and were “very active” with a world class cyber capability.\n“We can watch very focused efforts to steal American information, to infiltrate the United States with spies, with people who are going to work on behalf of the Chinese government against America,” he said.\n“We see it in our schools, in our hospitals and medical systems, we see it throughout corporate America. These efforts we have to all be more focused on. We have to do better at pushing back against Chinese efforts to covertly influence the world.”\nFILE PHOTO: CIA Director Mike Pompeo delivers remarks at \"Intelligence Beyond 2018,\" a forum hosted by the American Enterprise Institute for Public Policy Research, in Washington, U.S., January 23, 2018. REUTERS/Leah Millis/File Photo GLOBAL INFLUENCE The Kremlin, which under Vladimir Putin has clawed back some of the global influence lost when the Soviet Union collapsed, has denied meddling in elections in the West. It says anti-Russian hysteria is sweeping through the United States and Europe.\nIn the interview, Pompeo also repeated his message that North Korea was close to developing missiles which could be used in a nuclear attack on the United States.\n“I think that we collectively, the United States and our intelligence partners around the world, have developed a pretty clear understanding of (North Korean leader) Kim Jong Un’s capability,” he said.\n“We talk about him having the ability to deliver a nuclear weapon to the United States in a matter of a handful of months.”\nThe CIA chief defended Trump over accusations from a book which suggested the president was unfocused, unprepared and unfit for his office.\n“It’s absurd, the claim that the president isn’t engaged and doesn’t have a grasp on these important issues is dangerous and false,” Pompeo said.\nAsked if Trump’s use of Twitter posed any national security issues, he said: “Hasn’t caused us any trouble.”\nHe added: “We deliver nearly every day, personally, to the president the most exquisite truth that we know from the CIA. Whatever the facts may be we deliver them unvarnished as accurately and as forcefully as we can.”\nReporting by Guy Faulconbridge, editing by Michael Holden and Janet Lawrence\n ", "external_links": [], "published": "2018-01-30T09:56:00.000+02:00", "crawled": "2018-01-30T10:18:03.009+02:00", "highlightTitle": ""}