{"organizations": [], "uuid": "7ad34c7a637df67e6c7f9061108ee3b233c8f121", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/16/104947781-nc-product-landscape-1.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19854910/device/rss/rss.html", "section_title": "Tech", "url": "https://www.cnbc.com/2018/01/16/contraceptive-app-hit-with-complaints-after-being-blamed-for-37-unwanted-pregnancies.html", "country": "US", "domain_rank": 767, "title": "Contraceptive app hit with complaints after being blamed for 37 unwanted pregnancies", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T15:01:00.000+02:00", "replies_count": 0, "uuid": "7ad34c7a637df67e6c7f9061108ee3b233c8f121"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/16/contraceptive-app-hit-with-complaints-after-being-blamed-for-37-unwanted-pregnancies.html", "ord_in_thread": 0, "title": "Contraceptive app hit with complaints after being blamed for 37 unwanted pregnancies", "locations": [], "entities": {"persons": [{"name": "fox", "sentiment": "none"}, {"name": "neil degrasse tyson", "sentiment": "none"}], "locations": [{"name": "stockholm", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "natural cycles", "sentiment": "none"}, {"name": "medical product agency", "sentiment": "none"}, {"name": "cosmos", "sentiment": "none"}, {"name": "mpa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Natural Cycles, a contraceptive app that became certified in the EU as a form of birth control, has been hit with a complaint after being blamed for causing 37 unwanted pregnancies, reports Swedish publication SVT . Södersjukhuset hospital in Stockholm reported the app to Swedish regulator MPA (the Medical Product Agency), after 37 women visited the hospital for an abortion after becoming pregnant while using Natural Cycles.\nMore from The Verge:\nWhat kind of emoji do you need to talk about climate change?\nOne man ruptured his throat by trying to hold back a sneeze\nFox has renewed Neil deGrasse Tyson's Cosmos for a second season\nThe app uses an algorithm and measures factors like temperature to determine the period when a woman may be fertile. It's a popular alternative to hormonal contraceptives like the pill because it lacks side effects. In a statement to The Verge , Natural Cycles said it hasn't received any information from Södersjukhuset hospital, but are in touch with the MPA about each individual case. The company has also initiated an internal investigation with their clinical department, and said:\n\"No contraception is 100% effective, and unwanted pregnancies is an unfortunate risk with any contraception. Natural Cycles has a Pearl Index of 7, which means it is 93% effective at typical use, which we also communicate.\nAt first sight, the numbers mentioned in the media are not surprising given the popularity of the app and in line with our efficacy rates. As our user base increases, so will the amount of unintended pregnancies coming from Natural Cycles app users, which is an inevitable reality.\"\nThe app currently has 700,000 users worldwide. A midwife at SÖS, Carina Montin, told SVT that the hospital was reporting Natural Cycles to the MPA because of the unwanted pregnancies it helped cause. The app is designed for users aged 18 years and over, and Natural Cycles says younger users should consider another form of contraception", "external_links": [], "published": "2018-01-16T15:01:00.000+02:00", "crawled": "2018-01-16T15:10:08.003+02:00", "highlightTitle": ""}