{"organizations": [], "uuid": "15fa2ac269620571c09788a7bd0b5672889c5bbc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180112.html", "section_title": "Archive News &amp; Video for Friday, 12 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/usa-bonds-china/rpt-column-this-isnt-the-bear-market-youre-looking-for-mcgeever-idUSL8N1P650R", "country": "US", "domain_rank": 408, "title": "RPT-COLUMN-This isn't the bear market you're looking for: McGeever", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T14:56:00.000+02:00", "replies_count": 0, "uuid": "15fa2ac269620571c09788a7bd0b5672889c5bbc"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-bonds-china/rpt-column-this-isnt-the-bear-market-youre-looking-for-mcgeever-idUSL8N1P650R", "ord_in_thread": 0, "title": "RPT-COLUMN-This isn't the bear market you're looking for: McGeever", "locations": [], "entities": {"persons": [{"name": "chin", "sentiment": "neutral"}, {"name": "mcgeever", "sentiment": "neutral"}, {"name": "jamie mcgeever", "sentiment": "neutral"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "america", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "neutral"}, {"name": "treasury", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Repeats Thursday item without changes)\nBy Jamie McGeever\nLONDON, Jan 11 (Reuters) - Fears that China may slow or even halt purchases of U.S. Treasuries resurfaced this week, the latest in a series of events foretold by some to bring world bond markets crashing to the canvas.\nBut while America’s largest lender refusing to extend credit would be a major development, it’s worth remembering we’ve been here before, with China and the oft-predicted end of the 35-year bond bull market.\nThe jump in U.S. yields over the past week was the seventh time in the past 12 months that the U.S. yield curve between two and 10 years steepened by 10 basis points or more.\nThere have been far more severe storms in recent years.\nTreasury yields soared to 3 percent from 1.6 percent between May and September 2013, to 2.5 percent from 1.65 percent between February and June 2015, and to 2.65 percent from 1.7 percent in a matter of weeks in late 2016.\nNone proved to be the turning point and world markets kept on keeping on. Measured by daily trading ranges, last year was the least volatile on record for the S&P 500 as U.S. and global stocks hit a series of record highs.\nThere’s little to suggest the equity juggernaut is about to reverse either, at least not yet, with Wall Street chalking up its best start to a year since 1987 (and even though Black Monday on Oct. 19 that year was the worst day in U.S. market history, Wall Street still ended 1987 in the green).\nRelative risk premia show that the threat to stocks from bond market jitters may be overstated.\nWhen compared with real yields, which account for inflation, stocks aren’t “particularly expensive”, according to the Bank for International Settlements. The S&P 500’s near 2.5 percent dividend yield is far more tempting to investors than real Treasury yields of around zero or even lower.\nBy other measures, U.S. stocks do look rich.\nAccording to Societe Generale analysts, the 3 percent U.S. equity risk premium, essentially investors’ compensation for buying riskier stocks over bonds, is well below its 30-year average. “The only time U.S. equity has been more expensive than the current level was at around the time of the dotcom bubble of 2000,” they warn.\nBut the euro zone ERP of around 4.5 percent is running around its 30-year average, suggesting stocks aren’t overvalued relative to bonds, and the Japanese ERP of 4 percent shows stocks are still cheap, SocGen says.\nIt would take a major fall in bond prices and jump in yields to alter that picture.\nMOVE ALONG A report by Bloomberg News on Wednesday that Beijing was considering halting U.S. Treasury purchases hit stocks and sent U.S. bond yields to the highest levels in months. Calm was restored after China’s state foreign exchange regulator said it could be “fake” news.\nBut the episode showed how sensitive markets, particularly bond markets, are to the prospect of China stepping back from U.S. debt and what that mean for the bull run.\nTwo billionaire investors this week warned that 2018 will be a rocky year: Janus Capital’s Bill Gross said a bear market in bonds was now “confirmed” and DoubleLine Capital’s Jeffrey Gundlach said the S&P 500 might rise another 15 percent from here but would close the year down.\nIf markets are to crash, recent history suggests China’s activity in U.S. bonds is unlikely to be the trigger.\nFrom mid-2014 to January 2017, Beijing ran down its FX reserves by $1 trillion to just under $3 trillion. That involved active selling of U.S. bonds - at the start of 2014 China’s U.S. bond holdings stood at $1.3 trillion and by January last year were barely $1.0 trillion.\nWhat was the market fallout? Bonds rallied further and the 10-year Treasury yield slid to 1.36 percent, the lowest since World War Two. Wall Street survived a wobble in late 2015-early 2016 to rise 25 percent.\nIf anything U.S. benchmark bonds, with yields now above 2.50 percent, are more attractive to China - and others - than they were in 2016 when they were more than 100 basis points lower.\nDan Ivascyn at Pimco, one of the world’s largest bond funds, told Reuters on Wednesday he would consider adding U.S. Treasuries to the firm’s portfolios if the bond market weakened further.\nMeanwhile, demand for U.S. and other high-grade sovereign bonds is as strong as ever. The Federal Reserve and other central banks may be winding down their quantitative easing programmes but private sector buyers are ready to step in.\nForced out of sovereign debt by the quantitative easing of central banks bond purchases and into riskier assets such as corporate and high-yield bonds, private sector investors are now underweight government bonds relative to where they would have been in QE’s absence, reckons Deutsche Bank.\nPension and insurance funds need to match their assets with liabilities. They have a longer-term, more conservative investment outlook so government bonds - traditionally among the safest and most liquid of assets - fit that criterion.\nTheir bid for bonds is relatively price-insensitive. So although bond yields are low and prices are high by historical standards, the private sector is ready and waiting in the wings.\nThere may be bond market tremors right now but no quake. At least not yet. As Morgan Stanley’s Matthew Hornbach said on Thursday: “You can go about your business. Move along.”\nReporting by Jamie McGeever; Graphics by Jamie McGeever and Ritvik Carvalho; editing by John Stonestreet\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T14:56:00.000+02:00", "crawled": "2018-01-13T14:45:34.000+02:00", "highlightTitle": ""}