{"organizations": [], "uuid": "35be0c82e8e328ca301b4dde2a90f20a0bb90726", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/16/104947686-Hitler1.1910x1000.JPG", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/16/hitlers-wartime-mercedes-car-to-be-sold-in-scottsdale-arizona.html", "country": "US", "domain_rank": 767, "title": "Hitler’s wartime Mercedes car to be sold in Scottsdale, Arizona", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.987, "site_type": "news", "published": "2018-01-16T14:28:00.000+02:00", "replies_count": 0, "uuid": "35be0c82e8e328ca301b4dde2a90f20a0bb90726"}, "author": "David Reid", "url": "https://www.cnbc.com/2018/01/16/hitlers-wartime-mercedes-car-to-be-sold-in-scottsdale-arizona.html", "ord_in_thread": 0, "title": "Hitler’s wartime Mercedes car to be sold in Scottsdale, Arizona", "locations": [], "entities": {"persons": [{"name": "hitler", "sentiment": "negative"}, {"name": "offener tourenwagen", "sentiment": "negative"}, {"name": "adolf hitler", "sentiment": "none"}, {"name": "erich kempka", "sentiment": "none"}], "locations": [{"name": "scottsdale", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}], "organizations": [{"name": "mercedes", "sentiment": "negative"}, {"name": "mercedes-benz", "sentiment": "negative"}, {"name": "worldwide auctioneers", "sentiment": "none"}, {"name": "nazi", "sentiment": "none"}, {"name": "u.s. army", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A \"super Mercedes\" parade car built for and used by Adolf Hitler during World War II is to be sold at auction on Wednesday.\nThe Nazi dictator's Mercedes-Benz 770 Grosser Offener Tourenwagen, which the U.S. Army seized after the war, is one of just three in private hands. Only five models remain in existence.\nThe German car is described by Worldwide Auctioneers, which will be selling it in Scottsdale, Arizona, as \"the most historically significant automobile ever offered for public sale.\"\nNo official estimate has been given but Worldwide Auctioneers noted that its 2004 sale, as part of a wider package of Mercedes vehicles, marked the single most-valuable private transaction in the classic car world at the time. The auctioneer said 10 percent of Wednesday's sale price will be donated to funding education about the Holocaust.\nWorldwide Auctioneers This Mercedes-Benz 770 Grosser Offener Tourenwagen was a product of design requirements laid down by Hitler and his primary chauffer, SS Officer Erich Kempka. According to supporting documentation, the car was a product of design requirements laid down by Hitler and his primary chauffer, SS officer Erich Kempka.\nKempka asked Mercedes engineers to ensure maximum protection for Hitler, even allowing for the fact that the car was an open tourer.\nBuilt-in security measures applied to the vehicle included 30-millimeter bullet-resistant laminated glass for the fixed windscreen and detachable side panels. Armor plating protected the body sides and undercarriage while a further panel at the rear could be raised or lowered depending upon threat level.\nDocuments suggest the car was first used publically in October 1939 as part of a large motorcade delivering Hitler to the Old Reich Chancellery in Berlin in front of international media.\nIt was also used for a state visit by Italian fascist dictator Benito Mussolini in June 1940. Just one month later, Hitler used it for a victory parade after the Nazis' swift defeat of France. Further outings were made with Hitler in the car after German victories over Yugoslavia and Greece.\nWorldwide Auctioneers A rear view of Hitler's “Super Mercedes” parade car But as the war turned against Germany, the car was used much less often and its latter wartime service remains unknown.\nAfter Germany's capitulation in 1945, the car was seized by American forces and used by U.S. Army Military Police stationed in Le Havre, northern France.\nIt was shipped to the United States in 1946, where it was bought by Tom Austin, a rich tobacco planter from Greeneville, Tennessee.\nAfter falling into disuse, with apparently little understanding of its provenance, the car was eventually recognized and restored by two classic car hunters in 1976 before being sold on to Ralph Engelstad, owner of the Imperial Palace Casino and Hotel in Las Vegas.\nAt the time, it had an odometer reading of just 33,309 kilometers ( 20,697 miles) and auctioneers claimed it has only added 50 kilometers over the subsequent 40 years.\nFollowing the death of Engelstad, the car was sold in 2004 as part of a 21-car package of significant Mercedes-Benz automobiles. The identity of the current owner has not been revealed, although one report suggested it was last purchased by a Russian billionaire in 2009.\nThe auction begins at 5 p.m. local time Wednesday in Scottsdale.", "external_links": [], "published": "2018-01-16T14:28:00.000+02:00", "crawled": "2018-01-16T14:43:43.001+02:00", "highlightTitle": ""}