{"organizations": [], "uuid": "d7113a84c4e2be437bcad6b99bf0654e590b7729", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-socialplay-usa-accelerates-development-of-its-cryptocurrency-compatible-mobile-payment-platform-utilizing-blockchain.html", "country": "US", "domain_rank": 767, "title": "SocialPlay USA Accelerates Development of its Cryptocurrency Compatible Mobile Payment Platform Utilizing Blockchain Technology", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.012, "site_type": "news", "published": "2018-01-23T16:00:00.000+02:00", "replies_count": 0, "uuid": "d7113a84c4e2be437bcad6b99bf0654e590b7729"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-socialplay-usa-accelerates-development-of-its-cryptocurrency-compatible-mobile-payment-platform-utilizing-blockchain.html", "ord_in_thread": 0, "title": "SocialPlay USA Accelerates Development of its Cryptocurrency Compatible Mobile Payment Platform Utilizing Blockchain Technology", "locations": [], "entities": {"persons": [], "locations": [{"name": "las vegas", "sentiment": "none"}], "organizations": [{"name": "socialplay usa, inc.", "sentiment": "neutral"}, {"name": "socialplay usa accelerates development", "sentiment": "neutral"}, {"name": "spot and pay inc.", "sentiment": "none"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LAS VEGAS, January 23, 2018 /PRNewswire/ --\nSocialPlay USA, Inc. (OTC : SPLY), (\"SocialPlay\" or the \"Company\"), announces that it is finalizing negotiations to acquire Spot And Pay Inc. ( http://www.spotandpay.com ) and its Spot&Pay Mobile Payment Platform. Details of the agreement, which is subject to approval by the board of directors of each company, will be announced in the coming weeks.\nSocialPlay identified Spot&Pay as an acquisition target due to its unique mobile payment application that is used in connection with third party QR codes that have been generated for specific uses; i.e. individual consumer products, specific services or group of services offered to the general public, B2B product and service offerings, monetary donations to charitable organizations, and quick and easy bill payments on recurring monthly accounts.\nThe Company's software development plan has evolved to include a substantially more robust proprietary platform wallet feature that will allow users to create their own wallet so that they may buy and sell bitcoin and other cryptocurrencies directly from the Spot&Pay platform. It also provides seamless abilities to transfer money within the Spot&Pay user network instantly from one account to another without any processing delays.\nAs part of its strategy going forward, SocialPlay will focus significant development efforts on the integration of cryptocurrency and blockchain technologies into its product offerings. The Company believes that the future of financial transactions will be in the mobile space, and the security of these types of financial transactions will rely on blockchain verification and its unique, decentralized ledger. Distributed blockchain ledgers provide a highly secure identity verification and authentication methodology of user data, resulting in the most secure platform for users to initiate and complete financial transactions. In addition to developing its own proprietary blockchain technology, the Company will also seek to acquire existing, complementary blockchain technologies.\nAbout SocialPlay and Spot&Pay\nSpot&Pay is a mobile payment application that is used in connection with third party QR codes that have been generated for specific uses. QR codes allow consumers a quick, simple, and paperless method of making purchases, donating to their favorite charity, and paying bills. The process relies on setting up a Spot&Pay mobile payment account attached to a credit card, direct debit account or cryptocurrency wallet, and then simply scanning a QR code with a mobile device for a particular product or service the consumer wishes to purchase. The Spot&Pay application will instantly facilitate the order and purchase of the product associated with the QR code and pay for it from the pre-designated method of payment set up by the user.\nThe most unique aspect of the Spot&Pay application is the ability to purchase products remotely, without having to visit a website or physically attending a retail establishment. This is accomplished simply by scanning a product's QR code wherever it can be seen; such as from a bus shelter advertisement or other media, i.e. television or computer screen situated in a public space.\nSocialPlay USA is a solutions provider for individuals and online companies; providing marketing, monetization, and support services for companies in the mobile applications marketplace.\nThis news release was prepared on behalf of the Board of Directors, which accepts full responsibility for its contents.\nFor more information please contact Investor Relations at 855-780-4878 or", "external_links": [], "published": "2018-01-23T16:00:00.000+02:00", "crawled": "2018-01-23T18:25:29.008+02:00", "highlightTitle": ""}