{"organizations": [], "uuid": "4036f1f04954ffacca8f965bbc07e78d6ff2c2bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-werner-enterprises-reports-improved-fourth-quarter-and-annual-2017-revenues-and-earnings.html", "country": "US", "domain_rank": 767, "title": "Werner Enterprises Reports Improved Fourth Quarter and Annual 2017 Revenues and Earnings", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.077, "site_type": "news", "published": "2018-01-30T00:05:00.000+02:00", "replies_count": 0, "uuid": "4036f1f04954ffacca8f965bbc07e78d6ff2c2bc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-werner-enterprises-reports-improved-fourth-quarter-and-annual-2017-revenues-and-earnings.html", "ord_in_thread": 0, "title": "Werner Enterprises Reports Improved Fourth Quarter and Annual 2017 Revenues and Earnings", "locations": [], "entities": {"persons": [], "locations": [{"name": "omaha", "sentiment": "none"}, {"name": "nebraska", "sentiment": "none"}], "organizations": [{"name": "werner enterprises reports improved fourth quarter", "sentiment": "negative"}, {"name": "werner enterprises, inc.", "sentiment": "none"}, {"name": "werner logistics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Three Months Ended\nDecember 31, Year Ended\nDecember 31, (In thousands, except per share amounts) 2017 2016 % Change 2017 2016 % Change Total revenues $ 567,365 $ 518,832 9 % $ 2,116,737 $ 2,008,991 5 % Trucking revenues, net of fuel surcharge 374,827 347,546 8 % 1,403,863 1,356,284 4 % Werner Logistics revenues 112,414 107,171 5 % 417,639 417,172 0 % Operating income 45,061 34,956 29 % 143,820 126,070 14 % Net income 141,134 21,811 547 % 202,889 79,129 156 % Earnings per diluted share 1.94 0.30 545 % 2.80 1.09 156 % OMAHA, Nebraska, Jan. 29, 2018 (GLOBE NEWSWIRE) -- Werner Enterprises, Inc. (NASDAQ:WERN), one of the nation’s largest transportation and logistics companies, reported improved revenues and earnings for the fourth quarter and year ended December 31, 2017. Earnings per diluted share were $1.94 for fourth quarter 2017 compared to earnings per diluted share of $0.30 for fourth quarter 2016. Earnings per diluted share for 2017 were $2.80 compared to $1.09 for 2016. Excluding the non-cash income tax reform benefit discussed below, which management believes provides a more useful comparison of the Company’s performance from period to period, earnings per diluted share were $0.42 and $1.27 for fourth quarter 2017 and full year 2017, respectively.\nFourth quarter 2017 and annual 2017 results included a $110.5 million, or $1.52 per diluted share, non-cash reduction in income tax expense, which resulted from the Company’s revalued net deferred income tax liabilities to reflect the lower federal income tax rate enacted on December 22, 2017. The Tax Cuts and Jobs Act of 2017 (the Tax Act) lowered the federal corporate income tax rate to 21% from 35% beginning in 2018. These estimates are based on the Company’s initial analysis of the Tax Act and may be adjusted in future periods as required. During fourth quarter 2017, the Company also recorded income tax benefits of $2.4 million, or three cents per share, related to state income tax accruals and other discrete income tax benefits. The Company currently estimates its full year 2018 effective income tax rate to be approximately 25% to 26%.\n2017 was a year of meaningful progress for Werner Enterprises. Our investment in the five T’s (trucks, trailers, terminals, talent and technology) produced an improved customer experience and better financial results. Our success depends on the unwavering dedication and commitment of the talented Werner Enterprises associates, and we sincerely thank our entire Werner team of driving and non-driving professionals for a job well done.\nFourth quarter 2017 freight demand in our One-Way Truckload fleet was strong. Freight in October 2017 was seasonally better than normal, and demand strengthened further in November and December. Freight volumes thus far in January 2018 have been much stronger than normal for January.\nAverage revenues per tractor per week increased 4.1% in fourth quarter 2017 compared to fourth quarter 2016 due to a 4.7% increase in average revenues per total mile and a 0.6% decrease in average miles per truck. Growth in shorter-haul Dedicated compared to longer-haul one-way Truckload had a favorable impact on revenue per total mile and an unfavorable impact on miles per truck.\nFreight metrics are improving, and we have increasing confidence that contractual rates will strengthen over the next few quarters.\nIn fourth quarter 2017, we averaged 7,436 trucks in service in the Truckload Transportation Services (Truckload) segment and 44 intermodal drayage trucks in the Werner Logistics segment. We ended fourth quarter 2017 with 7,435 trucks in the Truckload segment, a year-over-year increase of 335 trucks and a sequential increase of 60 trucks. Our Dedicated unit ended fourth quarter 2017 with 4,000 trucks (or 54% of our total Truckload segment fleet) compared to 3,650 trucks at the end of fourth quarter 2016.\nIn 2015 and 2016, we invested nearly $1 billion of capital expenditures (before sales of equipment) primarily to reduce the average age of our trucks and trailers. Our investment in newer trucks and trailers improves our driver experience, raises operational efficiency and helps us to better manage our maintenance, safety and fuel costs. We intend to maintain our newer fleet age of trucks and trailers. The average age of our truck fleet was 1.9 years as of December 31, 2017. Net capital expenditures in 2017 were $199 million compared to $430 million in 2016. We expect net capital expenditures for 2018 to be in the range of $300 million to $350 million. This range allows for increased investment in our tractor and trailer fleet as a result of the Tax Act. It reflects increased confidence in potential growth due to a strong Dedicated pipeline and overall market demand. Tractor allocations between fleets will be made based on relative returns, and growth is dependent on improved margins and continued success attracting quality drivers in a difficult market.\nThe driver recruiting market is challenging. Several ongoing market factors persist including a declining number of, and increased competition for, driver training school graduates, an historically low national unemployment rate, aging truck driver demographics and increased truck safety regulations. We proactively took many significant actions in the last two years to strengthen our driver recruiting and retention to make Werner the preferred choice for the best drivers, including raising driver pay, lowering the age of our truck fleet, purchasing best-in-class safety and training features on all new trucks, investing in our driver training schools and collaborating with customers to improve or eliminate unproductive freight. We were pleased to grow our fleet by nearly 5% in 2017 in this difficult driver market. Our driver turnover rate once again improved, achieving our lowest fourth quarter and annual driver turnover rate in 19 years.\nGains on sales of assets were $0.8 million in fourth quarter 2017. This compares to gains on sales of assets of $3.2 million in fourth quarter 2016. In fourth quarter 2017, we sold more trucks and fewer trailers than in fourth quarter 2016. We realized lower average gains per truck and higher average gains per trailer in fourth quarter 2017 compared to fourth quarter 2016. The used truck pricing market remained difficult in fourth quarter 2017 due to a higher than normal supply of used trucks in the market and low buyer demand. Gains on sales of assets are reflected as a reduction of Other Operating Expenses in our income statement. Fourth quarter 2016 included an increase in depreciation expense of $4.1 million due to a reduction in the estimated residual values of certain trucks as a result of the weak used truck market.\nDiesel fuel prices were 37 cents per gallon higher in fourth quarter 2017 than in fourth quarter 2016 and were 24 cents per gallon higher than in third quarter 2017. For the first 29 days of January 2018, the average diesel fuel price per gallon was 44 cents higher than the average diesel fuel price per gallon in the same period of 2017 and 45 cents higher than in first quarter 2017. The components of our total fuel cost consist of and are recorded in our income statement as follows: (i) Fuel (fuel expense for company trucks excluding federal and state fuel taxes); (ii) Taxes and Licenses (federal and state fuel taxes); and (iii) Rent and Purchased Transportation (fuel component of our independent contractor costs, including the base cost of fuel and additional fuel surcharge reimbursement for costs exceeding the fuel base).\nTo provide shippers with additional sources of managed capacity and network analysis, we continue to develop our non-asset based Werner Logistics segment. Werner Logistics includes Brokerage, Freight Management, Intermodal, Werner Global Logistics (International) and Werner Final Mile.\nThree Months Ended\nDecember 31, Year Ended\nDecember 31, 2017 2016 2017 2016 Werner Logistics (amounts in thousands) $ % $ % $ % $ % Operating revenues $ 112,414 100.0 $ 107,171 100.0 $ 417,639 100.0 $ 417,172 100.0 Rent and purchased transportation expense 96,267 85.6 89,836 83.8 355,544 85.1 345,790 82.9 Gross margin 16,147 14.4 17,335 16.2 62,095 14.9 71,382 17.1 Other operating expenses 14,116 12.6 13,103 12.3 53,412 12.8 50,648 12.1 Operating income $ 2,031 1.8 $ 4,232 3.9 $ 8,683 2.1 $ 20,734 5.0\nIn fourth quarter 2017, Werner Logistics revenues increased $5.2 million, or 5%, and operating income dollars decreased $2.2 million, or 52%, compared to fourth quarter 2016. The Werner Logistics gross margin percentage in fourth quarter 2017 of 14.4% decreased 182 basis points compared to the gross margin percentage of 16.2% in fourth quarter 2016. The Werner Logistics operating income percentage in fourth quarter 2017 of 1.8% decreased 214 basis points from fourth quarter 2016 of 3.9%. Tighter carrier capacity in fourth quarter 2017 compared to fourth quarter 2016 resulted in higher purchased transportation costs for the Company’s predominately contractual logistics business causing the lower gross margin and operating income percentages.\nIn fourth quarter 2017, Werner Logistics achieved 36.0% revenue growth year over year in our truck brokerage solution, including transactional brokerage, while our intermodal and international solutions had lower revenues due to more challenging market conditions. As previously disclosed, a large Werner Logistics Freight Management customer (4.3% of Werner Logistics revenues in fourth quarter 2016) that was acquired in 2015 transitioned to their parent company’s transportation platform mid-quarter during first quarter 2017. We continue to see strong customer acceptance of the value of the Werner Logistics portfolio of service offerings, particularly as the market strengthens and shippers tend to consolidate their logistics business with the stability of larger asset-backed logistics providers. Achieving contractual rate increases in 2018 to recoup rising costs of third-party capacity is a focus for Werner Logistics.\nComparisons of the operating ratios for the Truckload segment (net of fuel surcharge revenues of $57.9 million and $44.3 million in fourth quarters 2017 and 2016, respectively, and $205.5 million and $155.3 million in 2017 and 2016, respectively) and the Werner Logistics segment are shown below.\nThree Months Ended\nDecember 31, Year Ended\nDecember 31, Operating Ratios 2017 2016 Difference 2017 2016 Difference Truckload Transportation Services 88.3 % 90.7 % (2.4 )% 90.3 % 92.2 % (1.9 )% Werner Logistics 98.2 % 96.1 % 2.1 % 97.9 % 95.0 % 2.9 %\nFluctuating fuel prices and fuel surcharge revenues impact the total company operating ratio and the Truckload segment’s operating ratio when fuel surcharges are reported on a gross basis as revenues versus netting against fuel expenses. Eliminating fuel surcharge revenues, which are generally a more volatile source of revenue, provides a more consistent basis for comparing the results of operations from period to period. The Truckload segment’s operating ratios for fourth quarter 2017 and fourth quarter 2016 are 89.9% and 91.8%, respectively, and for 2017 and 2016 are 91.6% and 93.0%, respectively, when fuel surcharge revenues are reported as revenues instead of a reduction of operating expenses.\nOur financial position remains strong. As of December 31, 2017, we had $75 million of debt outstanding and over $1.1 billion of stockholders’ equity.\nINCOME STATEMENT (Unaudited) (In thousands, except per share amounts) Three Months Ended\nDecember 31, Year Ended\nDecember 31, 2017 2016 2017 2016 $ % $ % $ % $ % Operating revenues $ 567,365 100.0 $ 518,832 100.0 $ 2,116,737 100.0 $ 2,008,991 100.0 Operating expenses: Salaries, wages and benefits 180,927 31.9 156,814 30.2 681,547 32.2 636,112 31.7 Fuel 58,194 10.3 43,008 8.3 198,745 9.4 155,042 7.7 Supplies and maintenance 44,049 7.8 40,838 7.9 164,325 7.7 171,397 8.5 Taxes and licenses 22,673 4.0 21,194 4.1 86,768 4.1 85,547 4.3 Insurance and claims 19,591 3.4 24,482 4.7 79,927 3.8 83,866 4.2 Depreciation 55,020 9.7 56,879 11.0 217,639 10.3 209,728 10.4 Rent and purchased transportation 132,427 23.3 133,141 25.6 509,573 24.1 512,296 25.5 Communications and utilities 3,947 0.7 3,996 0.8 16,105 0.7 16,106 0.8 Other 5,476 1.0 3,524 0.7 18,288 0.9 12,827 0.6 Total operating expenses 522,304 92.1 483,876 93.3 1,972,917 93.2 1,882,921 93.7 Operating income 45,061 7.9 34,956 6.7 143,820 6.8 126,070 6.3 Other expense (income): Interest expense 351 — 738 0.1 2,243 0.1 2,577 0.2 Interest income (752 ) (0.1 ) (1,004 ) (0.2 ) (3,308 ) (0.1 ) (4,158 ) (0.2 ) Other 35 — 43 — 328 — 191 — Total other expense (income) (366 ) (0.1 ) (223 ) (0.1 ) (737 ) — (1,390 ) — Income before income taxes 45,427 8.0 35,179 6.8 144,557 6.8 127,460 6.3 Income tax expense (benefit) (95,707 ) (16.9 ) 13,368 2.6 (58,332 ) (2.8 ) 48,331 2.4 Net income $ 141,134 24.9 $ 21,811 4.2 $ 202,889 9.6 $ 79,129 3.9 Diluted shares outstanding 72,660 72,446 72,558 72,393 Diluted earnings per share $ 1.94 $ 0.30 $ 2.80 $ 1.09\nSEGMENT INFORMATION (Unaudited) (In thousands) Three Months Ended\nDecember 31, Year Ended\nDecember 31, 2017 2016 2017 2016 Revenues Truckload Transportation Services $ 439,173 $ 397,503 $ 1,635,244 $ 1,533,981 Werner Logistics 112,414 107,171 417,639 417,172 Other (1) 15,488 13,914 62,745 57,062 Corporate 399 449 1,938 1,749 Subtotal 567,474 519,037 2,117,566 2,009,964 Inter-segment eliminations (2) (109 ) (205 ) (829 ) (973 ) Total $ 567,365 $ 518,832 $ 2,116,737 $ 2,008,991 Operating Income Truckload Transportation Services $ 44,548 $ 32,742 $ 138,059 $ 107,713 Werner Logistics 2,031 4,232 8,683 20,734 Other (1) (570 ) (1,213 ) 35 (6,177 ) Corporate (948 ) (805 ) (2,957 ) 3,800 Total $ 45,061 $ 34,956 $ 143,820 $ 126,070 (1) Other includes our driver training schools, transportation-related activities such as third-party equipment maintenance and equipment leasing, and other business activities.\n(2) Inter-segment eliminations represent transactions between reporting segments that are eliminated in consolidation.\nOPERATING STATISTICS BY SEGMENT\n(Unaudited)\nThree Months Ended\nDecember 31, Year Ended\nDecember 31, 2017 2016 % Change 2017 2016 % Change Truckload Transportation Services segment Average percentage of empty miles 12.76 % 12.62 % 1.1 % 12.49 % 12.96 % (3.6 )% Average trip length in miles (loaded) 463 472 (1.9 )% 468 468 — % Average tractors in service 7,436 7,178 3.6 % 7,305 7,263 0.6 % Average revenues per tractor per week (1) $ 3,878 $ 3,724 4.1 % $ 3,696 $ 3,591 2.9 % Total trailers (at quarter end) 22,900 22,725 22,900 22,725 Total tractors (at quarter end) Company 6,805 6,305 6,805 6,305 Independent contractor 630 795 630 795 Total tractors 7,435 7,100 7,435 7,100 Werner Logistics segment Average tractors in service 44 80 50 73 Total trailers (at quarter end) 1,600 1,625 1,600 1,625 Total tractors (at quarter end) 45 74 45 74\n(1) Net of fuel surcharge revenues.\nSUPPLEMENTAL INFORMATION\n(Unaudited)\n(In thousands) Three Months Ended\nDecember 31, Year Ended\nDecember 31, 2017 2016 2017 2016 Capital expenditures, net $ 77,740 $ 135,593\n$ 198,845\n$ 429,607\nCash flow from operations 64,890 111,222 281,838 312,397 Return on assets (annualized)* 31.6 % 5.0 % 11.5 % 4.7 % Return on equity (annualized)* 51.8 % 8.8 % 19.5 % 8.2 % *Includes the $110.5 million non-cash reduction in income tax expense in fourth quarter 2017 and full year 2017 resulting from the revaluation of net deferred income tax liabilities due to the Tax Act. Excluding this item, return on assets was 6.9% and 5.3% and return on equity was 11.5% and 9.0% for the fourth quarter 2017 and full year 2017, respectively. Management believes the exclusion of the tax reform benefit provides a more useful comparison of the Company’s performance from period to period.\nCONDENSED BALANCE SHEET\n(In thousands, except share amounts)\nDecember 31, 2017 December 31, 2016 (Unaudited) ASSETS Current assets: Cash and cash equivalents $ 13,626 $ 16,962 Accounts receivable, trade, less allowance of $8,250 and $9,183, respectively 304,174 261,372 Other receivables 26,491 15,168 Inventories and supplies 11,694 12,768 Prepaid taxes, licenses and permits 15,972 15,374 Income taxes receivable 1,189 21,497 Other current assets 27,083 29,987 Total current assets 400,229 373,128 Property and equipment 2,114,337 2,109,991 Less – accumulated depreciation 767,474 747,353 Property and equipment, net 1,346,863 1,362,638 Other non-current assets 60,899 57,237 Total assets $ 1,807,991 $ 1,793,003 LIABILITIES AND STOCKHOLDERS’ EQUITY Current liabilities: Checks issued in excess of cash balances $ 21,539 $ — Accounts payable 73,802 66,618 Current portion of long-term debt — 20,000 Insurance and claims accruals 79,674 83,404 Accrued payroll 32,520 26,189 Other current liabilities 24,642 18,650 Total current liabilities 232,177 214,861 Long-term debt, net of current portion 75,000 160,000 Other long-term liabilities 12,575 16,711 Insurance and claims accruals, net of current portion 108,270 113,875 Deferred income taxes 195,187 292,769 Stockholders’ equity: Common stock, $.01 par value, 200,000,000 shares authorized; 80,533,536 shares issued; 72,409,222 and 72,166,969 shares outstanding, respectively 805 805 Paid-in capital 102,563 101,035 Retained earnings 1,267,871 1,084,796 Accumulated other comprehensive loss (15,835 ) (16,917 ) Treasury stock, at cost; 8,124,314 and 8,366,567 shares, respectively (170,622 ) (174,932 ) Total stockholders’ equity 1,184,782 994,787 Total liabilities and stockholders’ equity $ 1,807,991 $ 1,793,003\nWerner Enterprises, Inc. was founded in 1956 and is a premier transportation and logistics company, with coverage throughout North America, Asia, Europe, South America, Africa and Australia. Werner maintains its global headquarters in Omaha, Nebraska and maintains offices in the United States, Canada, Mexico, China and Australia. Werner is among the five largest truckload carriers in the United States, with a diversified portfolio of transportation services that includes dedicated; medium-to-long-haul, regional and expedited van; and temperature-controlled. The Werner Logistics portfolio includes truck brokerage, freight management, intermodal, international and final mile services. International services are provided through Werner’s domestic and global subsidiary companies and include ocean, air and ground transportation; freight forwarding; and customs brokerage.\nWerner Enterprises, Inc.’s common stock trades on The NASDAQ Global Select Market SM under the symbol “WERN”. For further information about Werner, visit the Company’s website at www.werner.com .\nThis press release may contain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, and made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, as amended. Such forward-looking statements are based on information presently available to the Company’s management and are current only as of the date made. Actual results could also differ materially from those anticipated as a result of a number of factors, including, but not limited to, those discussed in the Company’s Annual Report on Form 10-K for the year ended December 31, 2016.\nFor those reasons, undue reliance should not be placed on any forward-looking statement. The Company assumes no duty or obligation to update or revise any forward-looking statement, although it may do so from time to time as management believes is warranted or as may be required by applicable securities law. Any such updates or revisions may be made by filing reports with the U.S. Securities and Exchange Commission, through the issuance of press releases or by other methods of public disclosure.\nContact: John J. Steele\nExecutive Vice President, Treasurer\nand Chief Financial Officer\n(402) 894-3036\nSource:Werner Enterprises, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/6a5d441c-8791-4f12-a103-0c4a537e000e"], "published": "2018-01-30T00:05:00.000+02:00", "crawled": "2018-01-30T01:31:19.000+02:00", "highlightTitle": ""}