{"organizations": [], "uuid": "e3953a2e35529f8335a8a3687d90bcf8e7a08c22", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-golub-capital-provides-one-loan-debt-facility-to-support-the-carlyle-group-level-equity-and-managements-acquisition-of-net.html", "country": "US", "domain_rank": 767, "title": "Golub Capital Provides One-Loan Debt Facility to Support The Carlyle Group, Level Equity and Management's Acquisition of Net Health", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.797, "site_type": "news", "published": "2018-01-09T18:50:00.000+02:00", "replies_count": 0, "uuid": "e3953a2e35529f8335a8a3687d90bcf8e7a08c22"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-golub-capital-provides-one-loan-debt-facility-to-support-the-carlyle-group-level-equity-and-managements-acquisition-of-net.html", "ord_in_thread": 0, "title": "Golub Capital Provides One-Loan Debt Facility to Support The Carlyle Group, Level Equity and Management's Acquisition of Net Health", "locations": [], "entities": {"persons": [{"name": "lead-left bookrunner", "sentiment": "negative"}, {"name": "lead-left arranger", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "golub capital", "sentiment": "negative"}, {"name": "carlyle group", "sentiment": "negative"}, {"name": "level equity and management's acquisition of net health", "sentiment": "neutral"}, {"name": "net health", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 9, 2018 /PRNewswire/ -- Golub Capital recently announced that as Lead-Left Bookrunner, Lead-Left Arranger and Administrative Agent, it provided a GOLD facility to finance the acquisition of Net Health ( www.nethealth.com ) by The Carlyle Group (NASDAQ: CG), Level Equity and Management. GOLD financings are Golub Capital One-Loan Debt facilities. This facility will enable Net Health to further invest in products, customer support and ultimately drive growth, both organic and through acquisitions.\nNet Health is the leading provider of SaaS solutions for specialized outpatient care, serving national hospital systems, and healthcare professionals in wound care, physical therapy, occupational medicine, urgent care, and employee health facilities. More than 3,000 facilities across North America rely on Net Health every day to organize and accelerate their patient care, as well as bring efficiency to their overall operations, including increase revenue, reduce costs, and improve clinical outcomes for healthcare providers and their patients.\n\"At Golub Capital, we believe in the power of healthcare IT companies to create efficiencies in healthcare practices that lead to positive patient outcomes, as well as create value for stakeholders. Net Health has a proven track record of achieving both and we are pleased to partner with the Company and Carlyle during an exciting period of growth,\" said Hyun Chang, Managing Director at Golub Capital.\nGolub Capital is proud to continue its partnership with Carlyle, having previously facilitated its acquisitions of NetMotion and ECi Software Solutions.\n\"The Golub Capital team continues to be extremely knowledgeable, flexible and agile partners,\" said Michael Gozycki, Managing Director at Carlyle. \"We seek to leverage Carlyle's deep vertical market software expertise in industries such as healthcare to partner with companies with strong potential for value creation. We are thrilled to partner with the Net Health management team to support the Company's next chapter of growth.\"\nAbout Golub Capital Middle Market Lending\nGolub Capital's Middle Market Lending group provides financing for middle market, private equity-backed transactions with hold positions of up to $400 million and is an arranger of credit facilities up to $750 million. Golub Capital's award-winning team strives to establish long-term, win-win partnerships by providing dependable, fast and creative solutions that meet private equity sponsors' and portfolio companies' needs.\nGolub Capital is a nationally recognized credit asset manager with over $20 billion of capital under management. For over 20 years, Golub Capital has provided credit to help medium-sized U.S. businesses grow. The firm's award-winning Middle Market Lending business provides financing for middle market companies and their private equity sponsors. Golub Capital's credit expertise also forms the foundation of its Late Stage Lending and Broadly Syndicated Loan businesses. Golub Capital has worked hard to build a reputation as a fast, reliable provider of compelling financing solutions, and we believe this has inspired repeat clients and investors. Today, the firm has over 300 employees with lending offices in Chicago, New York and San Francisco. For more information, please visit golubcapital.com .\nAbout Net Health\nNet Health is the leader in software solutions for specialized outpatient care. Known for being experts in The Art of the Right Fit®, our fully interoperable EHR solutions serve five medical specialty markets and offer clients an end-to-end solution that includes practice management tools, clinical workflow documentation, revenue cycle management, expert coaching, and analytics. Net Health serves healthcare professionals in 98% of the largest hospital chains as well as private practices around the country—driving workflow in more than 3,000 urgent care, wound care, physical therapy, speech and language therapy, occupational therapy, occupational medicine, employee health, and workplace medicine facilities each day. For more information visit nethealth.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/golub-capital-provides-one-loan-debt-facility-to-support-the-carlyle-group-level-equity-and-managements-acquisition-of-net-health-300580013.html\nSOURCE Golub Capital", "external_links": ["http://www.nethealth.com/", "http://www.prnewswire.com/news-releases/golub-capital-provides-one-loan-debt-facility-to-support-the-carlyle-group-level-equity-and-managements-acquisition-of-net-health-300580013.html"], "published": "2018-01-09T18:50:00.000+02:00", "crawled": "2018-01-09T21:27:02.021+02:00", "highlightTitle": ""}