{"organizations": [], "uuid": "87f7ecb79655687bbc1ec0a5f2ebbbf0ebe2a7d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218706263&w=1200&r=LYNXMPEE0101H", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-soccer-africa-award/tough-choice-to-decide-african-footballer-of-the-year-idUSKBN1ER033", "country": "US", "domain_rank": 408, "title": "Tough choice to decide African Footballer of the Year", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T04:09:00.000+02:00", "replies_count": 0, "uuid": "87f7ecb79655687bbc1ec0a5f2ebbbf0ebe2a7d5"}, "author": "", "url": "https://www.reuters.com/article/us-soccer-africa-award/tough-choice-to-decide-african-footballer-of-the-year-idUSKBN1ER033", "ord_in_thread": 0, "title": "Tough choice to decide African Footballer of the Year", "locations": [], "entities": {"persons": [{"name": "mark gleeson", "sentiment": "none"}, {"name": "aubameyang", "sentiment": "none"}, {"name": "mohamed salah", "sentiment": "none"}, {"name": "riyad mahrez", "sentiment": "none"}, {"name": "pierre-emerick aubameyang", "sentiment": "none"}, {"name": "sadio mane", "sentiment": "none"}], "locations": [{"name": "gabon", "sentiment": "none"}, {"name": "accra", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "ghana", "sentiment": "none"}], "organizations": [{"name": "liverpool", "sentiment": "none"}, {"name": "borussia dortmund", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 2:10 AM / Updated 6 hours ago Tough choice to decide African Footballer of the Year Mark Gleeson 3 Min Read \nCAPE TOWN (Reuters) - Africa will crown its best soccer player on Thursday but the electors have a tough choice in deciding between the three candidates for the 2017 African Footballer of the Year award. \nPierre-Emerick Aubameyang of Borussia Dortmund and Gabon goes up against Liverpool’s Senegalese Sadio Mane and Egyptian Mohamed Salah with none of the final three candidates having a defining achievement over the last 12 months to set them apart. \nThe winner will be announced at the annual Confederation of African Football awards being hosted in Accra, Ghana. \nAubameyang, who was the African Footballer of the Year in 2015 and runner-up in the last poll to Riyad Mahrez, finished as top scorer in the Bundesliga last season, netting 31 goals, and continued his form in front of goal into the new campaign. \nHe also scored the winner in the German Cup final in May but that is hardly likely to resonate with the voters, who are the national team coaches and captains from each African country plus a selected panel of journalists. Soccer Football - Premier League - Liverpool vs West Bromwich Albion - Anfield, Liverpool, Britain - December 13, 2017 Liverpool's Sadio Mane shoots at goal REUTERS/Andrew Yates \nAt national team level, the 28-year-old Aubameyang made little impression at the African Nations Cup finals in his home country at the start of 2017 and then missed most of Gabon’s unsuccessful World Cup qualifying campaign, citing transfer negotiations among the reasons for his absences. \nMane and Salah helped Senegal and Egypt qualify for the World Cup after lengthy absences and have emerged as leading players this season in the English Premier League. Soccer Football - Premier League - Liverpool vs Leicester City - Anfield, Liverpool, Britain - December 30, 2017 Liverpool's Mohamed Salah celebrates scoring their first goal REUTERS/Phil Noble \nSalah, 25, has the edge over his club mate since he was a major catalyst in Egypt reaching the Nations Cup final in Libreville in February, where they lost narrowly to Cameroon, and has scored regularly for Liverpool after his record transfer for an African footballer in the close season. \nMane, also 25, is looking to become only the second Senegalese to win the award after El Hadji Diouf, who was African Footballer of the Year in 2001 and 2002. \nThe only Egyptian winner was Mahmoud Al Khatib in 1983, while French-born Aubameyang is the only player from Gabon to win the award, which was first introduced in 1970. Reporting by Mark Gleeson; Editing by Ken Ferris", "external_links": [], "published": "2018-01-02T04:09:00.000+02:00", "crawled": "2018-01-02T04:21:55.021+02:00", "highlightTitle": ""}