{"organizations": [], "uuid": "8625a5f5c24426bf52c9ea64b6649d69c7d792de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/news/media", "section_title": "Media | Reuters.com", "url": "https://www.reuters.com/article/usa-trump-tweets/update-1-i-tweet-from-bed-sometimes-u-s-president-trump-says-idUSL8N1PN0XR", "country": "US", "domain_rank": 408, "title": "UPDATE 1-I tweet from bed sometimes, U.S. President Trump says", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.018, "site_type": "news", "published": "2018-01-29T07:32:00.000+02:00", "replies_count": 0, "uuid": "8625a5f5c24426bf52c9ea64b6649d69c7d792de"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-trump-tweets/update-1-i-tweet-from-bed-sometimes-u-s-president-trump-says-idUSL8N1PN0XR", "ord_in_thread": 0, "title": "UPDATE 1-I tweet from bed sometimes, U.S. President Trump says", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "andrew macaskill", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "macron", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* I am a stable genius and I eat good food, Trump says\n* Trump: I need social media in an era of fake news\n* Trump says he is very popular in United Kingdom\n* Women like me because I support the military - Trump\n* On Macron, Trump says: I like him a lot (Recasts lead)\nBy Andrew MacAskill\nLONDON, Jan 28 (Reuters) - U.S. President Donald Trump, who has garnered a large following on social media with rambunctious postings, said he sometimes tweets from bed, though he occasionally allows others to post his words.\nTrump frequently uses Twitter to announce policy, assail his adversaries and to tangle with countries, including North Korea, over world affairs. The @realDonaldTrump account had 47.2 million users as of Sunday.\nIn an interview with Britain’s ITV channel, he appeared to appreciate the wide impact of his postings in Twitter and said that he needed social media to communicate with voters in the era of what he termed fake news.\n“If I don’t have that form of communication I can’t defend myself,” Trump said in an interview broadcast on Sunday. “I get a lot of fake news, a lot of news that is very false or made up.”\nIt was a crazy situation, he said, that many people in the world waited for his tweets. He usually tweets himself, sometimes from bed.\nWhen asked about whether he was lying in bed with his phone thinking of how to wind people up, Trump said: “Well, perhaps sometimes in bed, perhaps sometimes at breakfast or lunch or whatever, but generally speaking during the early morning, or during the evening I can do whatever, but I am very busy during the day, very long hours. I am busy.”\n“I will sometimes just dictate out something really quickly and give it to one of my people to put it on,” he said.\nAsked about eating burgers and drinking Coke, Trump, 71, said: “I eat fine food, really from some of the finest chefs in the world, I eat healthy food, I also have some of that food on occasion... I think I eat actually quite well.”\nTrump said that he was very popular in the United Kingdom. Some British politicians have called for Trump not to visit and 1.86 million people have signed a petition asking for him to be banned from entering the United Kingdom.\n“I get so much fan mail from people in your country - they love my sense of security, they love what I am saying about many different things,” Trump said.\nBREXIT Trump would take a “tougher” approach to Brexit negotiations than British Prime Minister Theresa May.\nWhen asked if May was in a “good position” regarding the ongoing Brexit talks, Trump replied: “Would it be the way I negotiate? No, I wouldn’t negotiate it the way it’s negotiated ... I would have had a different attitude.”\nPressed on how his approach would be different, he said: “I would have said the European Union is not cracked up to what it’s supposed to be. I would have taken a tougher stand in getting out.”\nHe said the United States would do a post-Brexit trade deal with the United Kingdom.\nHe was pressed on how some women opposed him and he said he supported women and that many women understood that.\nTrump said women in particular liked his support for a strong military as they often wanted to feel safe at home.\n“There’s nobody better than me on the military... I think women really like that. I think they want to be safe at home,” Trump said. “I have tremendous respect for women.”\n“No, I wouldn’t say I am a feminist. I mean, I think that would be maybe going too far: I am for women, I am for men, I am for everyone.”\nHe said French President Emmanuel Macron was a friend and that he liked him a lot. (Editing by Guy Faulconbridge)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-29T07:32:00.000+02:00", "crawled": "2018-01-29T15:15:02.021+02:00", "highlightTitle": ""}