{"organizations": [], "uuid": "e9d0fd0648c87d1205a0b57dcdfde40ca8b69d95", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-joyal-capital-management-franchise-development-records-the-single-largest-sale-of-a-dunkin-donuts-franchisee-owned-network-in.html", "country": "US", "domain_rank": 767, "title": "Joyal Capital Management Franchise Development records the single largest sale of a Dunkin' Donuts franchisee-owned network in the firm's 30-year history", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.628, "site_type": "news", "published": "2018-01-24T19:00:00.000+02:00", "replies_count": 0, "uuid": "e9d0fd0648c87d1205a0b57dcdfde40ca8b69d95"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-joyal-capital-management-franchise-development-records-the-single-largest-sale-of-a-dunkin-donuts-franchisee-owned-network-in.html", "ord_in_thread": 0, "title": "Joyal Capital Management Franchise Development records the single largest sale of a Dunkin' Donuts franchisee-owned network in the firm's 30-year history", "locations": [], "entities": {"persons": [{"name": "baskin robbins", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "dunkin' donuts", "sentiment": "neutral"}, {"name": "joyal capital management franchise development", "sentiment": "neutral"}, {"name": "sda", "sentiment": "none"}, {"name": "joyal capital management", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOSTON, Jan. 24, 2018 /PRNewswire/ -- JCM Franchise Development, LLC (JCMFD) is pleased to announce the successful closing of the single largest sale of a Dunkin' Donuts and Baskin Robbins franchised network ever recorded at Joyal Capital Management.\nJCMFD was able to deploy its entire suite of sell-side consulting services to their client, who is a long-time Dunkin' franchisee in greater Chicago, on the sale of the 67-store network and corresponding SDA. Over the course of five separate closings which involved seven purchasing groups, JCMFD was able to lead the facilitation, coordination and closing of a very complex transaction while ultimately providing a seamless transition among all parties.\nIn preparing the due diligence and offering materials needed to go to the market, JCMFD proved to be a significant resource to the buyers through the consolidation of a tremendous amount of raw data that speaks to the scale of this transaction. JCMFD also leveraged its extensive knowledge of the Dunkin' franchisee landscape to ensure that the potential buyers had the experience and resources to thrive within the Dunkin' brand throughout the Chicago region.\nAdditionally, JCM Finance sourced qualified lenders within its network of financial institutions to provide a conduit for potential buyers to accept the necessary credit for a portion of the stores being purchased.\n\"We are extremely proud to be part of this historic transaction for our Dunkin' Donuts franchisee client and moreover, to be able to demonstrate the various unique offerings our firm affords the QSR space. This was frankly a very complex transaction with many moving parts that demanded excellence in coordination and deliverables. The results of my team satisfying these demands are extraordinary, yielding the largest aggregate transaction value ever realized for a Dunkin' Donuts network at JCM. I look forward to other opportunities like Chicago where we can also add value through our expertise and knowledge in being able to successfully bring buyers and sellers in the QSR space together.\"\n– Gary F. Joyal, CEO and Managing Partner, Joyal Capital Management, LLC\nAbout Joyal Capital Management\nWith 30 years of experience, Joyal Capital Management, LLC represents clients throughout the United States on mergers and acquisitions, financing, private equity and family office services. JCM's subsidiaries, JCM Franchise Development, LLC and JCM Finance, LLC have consulted on dozens of restaurant-related M&A transactions and raised significant equity and debt capital for franchisee clients.\nVisit our website: http://www.joycapmgt.com\nFor more information regarding JCM, contact Daniel Connelly, Managing Director, at dconnelly@joycapmgt.com , or Jeffrey Richard, Senior Analyst at jrichard@joycapmgt.com or at 508-747-2237.\nThis Joyal Capital Management, LLC (JCM) announcement is for informational purposes only for the confidential use of the intended recipient. No announcement information may be construed as an offer of, solicitation of an offer to buy, recommendation of, representation of suitability or endorsement of, any security, investment fund, interest in real estate or other investment. Any such offering shall be made only to qualified investors by a private placement memorandum or a similar document containing risk factors and accompanied by other definitive offering documents, distributed by persons authorized by JCM, and only in those jurisdictions where permitted by applicable law. This announcement is not such an offering document nor shall it serve or be deemed to alter, supersede or amend any such offering document.\nView original content: http://www.prnewswire.com/news-releases/joyal-capital-management-franchise-development-records-the-single-largest-sale-of-a-dunkin-donuts-franchisee-owned-network-in-the-firms-30-year-history-300587507.html\nSOURCE Joyal Capital Management, LLC", "external_links": ["http://www.joycapmgt.com/", "http://www.prnewswire.com/news-releases/joyal-capital-management-franchise-development-records-the-single-largest-sale-of-a-dunkin-donuts-franchisee-owned-network-in-the-firms-30-year-history-300587507.html"], "published": "2018-01-24T19:00:00.000+02:00", "crawled": "2018-01-24T19:31:19.000+02:00", "highlightTitle": ""}