{"organizations": [], "uuid": "3cc1f217ec1e62fa135c46d96df017cad4217aa2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/29/104741526-20170929-9337-2469-3.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/15839135/device/rss/rss.html", "section_title": "Earnings", "url": "https://www.cnbc.com/2018/01/30/harley-davidson-quarterly-shipments-disappoint-sending-shares-lower.html", "country": "US", "domain_rank": 767, "title": "Harley-Davidson quarterly shipments disappoint, sending shares lower", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T14:58:00.000+02:00", "replies_count": 0, "uuid": "3cc1f217ec1e62fa135c46d96df017cad4217aa2"}, "author": "", "url": "https://www.cnbc.com/2018/01/30/harley-davidson-quarterly-shipments-disappoint-sending-shares-lower.html", "ord_in_thread": 0, "title": "Harley-Davidson quarterly shipments disappoint, sending shares lower", "locations": [], "entities": {"persons": [{"name": "adam jeffe", "sentiment": "negative"}, {"name": "matt levatich", "sentiment": "none"}, {"name": "harley", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "harley-davidson", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "harley-davidson motor co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Harley-Davidson said on Tuesday it will close a plant in Kansas City, Missouri as it consolidates manufacturing operations after its motorcycle shipments fell to their lowest level in six years, sending its shares down more than 8 percent.\nThe Milwaukee-based company forecast a drop in shipments to dealers this year as it expects retail sales in the United States - the company's biggest market - to dip.\nDespite generally higher U.S. consumer spending, Harley is grappling with an aging customer base and younger, more price-sensitive buyers hesitant to embrace the iconic brand as previous generations have done.\nIts shares fell 8.5 percent to $50.59 on the New York Stock Exchange. The stock fell nearly 13 percent in 2017.\nHarley said it expects to ship 231,000 to 236,000 motorcycles this year after shipping 241,498 vehicles in 2017, the lowest number since 2011. That is at the low end of its previous forecast of 241,000 to 246,000 units.\nIn the December quarter, Harley's U.S. sales declined 11.1 percent from the year before and overseas sales dipped 7.7 percent. Overall sales in the quarter were down 9.6 percent.\nAs it adjusts to lower demand, Harley said it will consolidate work at its motorcycle assembly plant in Kansas City, Missouri, into the one in York, Pennsylvania, eliminating about 800 jobs at the Kansas City plant but adding 450 at the York facility.\nHarley said the move would result in restructuring costs of $170 million to $200 million through 2019 but would save the company $65 million to $75 million a year after 2020.\nIt also announced the closure of its wheel operations in Adelaide, Australia, which will affect 100 employees.\nJohn Taggart | Bloomberg | Getty Images Employees lift a motorcycle up to the shipping area on the assembly line at the Harley-Davidson Inc. manufacturing facility in York, Pennsylvania, U.S., on Tuesday, Nov. 3, 2015. \"HOG is restructuring the business for the demand reality,\" analysts at RBC Capital Markets in a research note. \"A big concern of ours had been that the cost structure didn't seem right-sized for demand.\"\nInternational up, US down U.S. President Donald Trump last year praised the motorcycle maker for its U.S. manufacturing presence and blamed global tariffs for making it \"very hard\" for the company to do business overseas.\nNevertheless, the company is looking overseas for growth this year.\n\"Our assumptions include U.S. retail dealer retail sales to be down, partially offset by growth in international retail sales,\" Harley's Chief Financial Officer John Olin told analysts on an earnings conference call.\nThe company has set out a turnaround strategy to attract 2 million new riders in the next decade by introducing new models.\nOn Tuesday, Harley said it would invest $25 million to $50 million a year over the next several years to develop electric motorcycle technology and was on target to launch its first electric bike within 18 months.\nHarley's adjusted earnings for the fourth quarter, excluding some items, were 47 cents per share, just ahead of Wall Street's average forecast of 45 cents, according to Thomson Reuters I/B/E/S. Revenue from motorcycles and related products rose to $1.05 billion from $933 million.", "external_links": [], "published": "2018-01-30T14:58:00.000+02:00", "crawled": "2018-01-30T16:08:13.000+02:00", "highlightTitle": ""}