{"organizations": [], "uuid": "8af05912b6ba31c05b296ed65754e83bef0c0a5e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/25/104608162-GettyImages-672997214-mcdonalds.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/02/mcdonalds-primed-for-massive-growth-in-2018-as-dollar-menu-kicks-off.html", "country": "US", "domain_rank": 767, "title": "McDonald's primed for massive growth in 2018 as Dollar Menu kicks off", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.037, "site_type": "news", "published": "2018-01-02T20:17:00.000+02:00", "replies_count": 0, "uuid": "8af05912b6ba31c05b296ed65754e83bef0c0a5e"}, "author": "Sarah Whitten", "url": "https://www.cnbc.com/2018/01/02/mcdonalds-primed-for-massive-growth-in-2018-as-dollar-menu-kicks-off.html", "ord_in_thread": 0, "title": "McDonald's primed for massive growth in 2018 as Dollar Menu kicks off", "locations": [], "entities": {"persons": [{"name": "mark kalinowski", "sentiment": "none"}, {"name": "kalinowski", "sentiment": "none"}], "locations": [], "organizations": [{"name": "mcdonald", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A McDonald's crew member prepares french fries in Miami, Florida. \nMcDonald's looks pretty golden-headed into 2018. \nThe combination of McDonald's planned rollout of fresh, never-frozen beef, its recent relaunch of its Dollar Menu and woes at other restaurant chains could help the restaurant boost its same-store sales and grab more market share in the industry. \nThe burger giant's stock ended 2017 up more than 41 percent, the largest stock move in the restaurant industry during the year, and more than one analyst is calling for more gains in the new year. \nNomura-Instinet analyst Mark Kalinowski raised his earnings expectations and stock price target for the chain Tuesday, calling it his top restaurant pick for 2018. \nHe predicts that same-store sales for the company will continue to grow, particularly in the second half of this year, citing the national rollout of fresh, never-frozen beef in its Quarter Pounder and Signature Crafted burgers as a major catalyst. \nKalinowski revised his earnings per share 2017 forecast to $6.55, up 2 cents from his previous prediction. He also raised his 2018 and 2019 earnings estimates by 12 cents per share each to $7.05 and $7.65, respectively. \n\"Given McDonald's strong same-store sales momentum, we raise our target multiple on the stock to 27x (from 26x),\" he wrote. The stock's target price is now $190, up from $180. McDonald's shares closed at $172.12 on the last day of trading in 2017, and were up less than 1 percent in midday trading. \nPeter Saleh, an analyst at BTIG, also foresees positive growth for McDonald's and lifted his target price to $200 from $175. \n\"After several years of playing defense, we believe McDonald's is finally returning to an offensive strategy which will yield stronger comp growth and increased market share,\" Saleh wrote in a research note Tuesday. \nSaleh noted that the company's new Dollar Menu, which launches Jan. 4, has an average discount of about 13 percent. This could be a major driver for growth. \nMcDonald's launch of $1 and $2 soft drink and McCafé beverages in April of last year has been cited by the company as part of the reason sales have been strong in recent quarters. He estimates McDonald's U.S. same-store sales could \"remain in the mid-single digits\" in 2018 and beyond. \nOn Tuesday, Saleh bolstered his 2018 same-store sales estimate to 4.1 percent growth, up from 3 percent. He also raised his 2019 same-store sales prediction to a 3.9 percent gain, up from 3.3 percent.", "external_links": [], "published": "2018-01-02T20:17:00.000+02:00", "crawled": "2018-01-02T19:48:13.015+02:00", "highlightTitle": ""}