{"organizations": [], "uuid": "346365a167077c8eae55eafebdebf704b51c4006", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-boston-carriers-inc-announces-today-entry-into-bareboat-charter-contract-to-acquire-a-vessel.html", "country": "US", "domain_rank": 767, "title": "Boston Carriers Inc. Announces Today Entry into Bareboat Charter Contract to Acquire a Vessel", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.046, "site_type": "news", "published": "2018-01-10T20:49:00.000+02:00", "replies_count": 0, "uuid": "346365a167077c8eae55eafebdebf704b51c4006"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-boston-carriers-inc-announces-today-entry-into-bareboat-charter-contract-to-acquire-a-vessel.html", "ord_in_thread": 0, "title": "Boston Carriers Inc. Announces Today Entry into Bareboat Charter Contract to Acquire a Vessel", "locations": [], "entities": {"persons": [{"name": "antonios bertsos", "sentiment": "none"}, {"name": "boston carri", "sentiment": "none"}], "locations": [{"name": "greece", "sentiment": "none"}, {"name": "athens", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "boston carriers inc", "sentiment": "negative"}, {"name": "boston carriers inc.", "sentiment": "negative"}, {"name": "about boston carriers inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATHENS, Greece, January 10, 2018 /PRNewswire/ --\nBoston Carriers Inc. (OTC: BSTN) (\"Boston\" or the \"Company\") announces that in December 2017 it entered into a contract to acquire a 46K dwt dry bulk carrier, 1996 built. Boston will provide a down payment of 500,000 USD together with the issuance 10,000,000 shares of common stock restricted for four years at a price of 0.05 USD per share prior to delivery of the vessel. Boston will pay 2,191 USD per day for a period of five years for having full use of the vessel. After the end of the payment schedule the vessel will be fully owned by Boston without any further payment.\n(Logo: http://mma.prnewswire.com/media/467605/Boston_Carriers_Logo.jpg )\nMr. Antonios Bertsos, Chairman and Chief Executive Officer, stated \"Boston's short term employment strategy allows the Company to capture any potential upside that arises in the dry bulk market.\"\nMr. Antonios Bertsos added, \"We believe in the dry bulk sector and will attempt to continue to grow our fleet with additional dry bulk Handysize-Handymax vessels.\"\nAbout Boston Carriers Inc .\nBoston Carriers Inc. is an international shipping company providing ideal solutions for seaborne transportation of dry bulk commodities through owned vessels. Read more about Boston Carriers Inc . - http://www.bostoncarriers.com .\nSafe Harbor Statement\nThis announcement contains forward-looking statements. These statements are made under the \"safe harbor\" provisions of the U.S. Private Securities Litigation Reform Act of 1995. These forward-looking statements can be identified by terminology such as \"will,\" \"expects,\" \"anticipates,\" \"future,\" \"intends,\" \"plans,\" \"believes,\" \"estimates\" and similar statements. Boston may also make written or oral forward-looking statements in its filings with the U.S. Securities and Exchange Commission (\"SEC\"), in its annual report to shareholders, in press releases and other written materials and in oral statements made by its officers, directors or employees to third parties. Statements that are not historical facts, including statements about Boston's beliefs and expectations, are forward-looking statements. Forward-looking statements involve inherent risks and uncertainties. Further information regarding these and other risks will be included in our annual report on Form 20-F and other documents filed with the SEC. All information provided in this press release is as of the date of this press release, and Boston does not undertake any obligation to update any forward-looking statement, except as required under applicable law.\nSOURCE Boston Carriers Inc.", "external_links": [], "published": "2018-01-10T20:49:00.000+02:00", "crawled": "2018-01-10T20:07:15.000+02:00", "highlightTitle": ""}