{"organizations": [], "uuid": "1db2e490fcbce1fd17ee2b3161193eba2d190d04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-saul-centers-inc-prices-offering-of-depositary-shares-and-6-point-125-percent-series-d-cumulative-redeemable-preferred-stock.html", "country": "US", "domain_rank": 767, "title": "Saul Centers, Inc. Prices Offering of Depositary Shares and 6.125% Series D Cumulative Redeemable Preferred Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T02:39:00.000+02:00", "replies_count": 0, "uuid": "1db2e490fcbce1fd17ee2b3161193eba2d190d04"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-saul-centers-inc-prices-offering-of-depositary-shares-and-6-point-125-percent-series-d-cumulative-redeemable-preferred-stock.html", "ord_in_thread": 0, "title": "Saul Centers, Inc. Prices Offering of Depositary Shares and 6.125% Series D Cumulative Redeemable Preferred Stock", "locations": [], "entities": {"persons": [], "locations": [{"name": "md.", "sentiment": "none"}, {"name": "bethesda", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "bfs", "sentiment": "negative"}, {"name": "saul centers, inc.", "sentiment": "neutral"}, {"name": "saul centers, inc", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BETHESDA, Md., Jan. 16, 2018 /PRNewswire/ -- Saul Centers, Inc. (NYSE: BFS) (the \"Company\") today announced that it priced 3 million depositary shares, each representing a 1/100 th fractional interest in a share of the Company's 6.125% Series D Cumulative Redeemable Preferred Stock, at an initial public offering price of $25.00 per depositary share. The dividend rate of the Series D Cumulative Redeemable Preferred Stock underlying the depositary shares will be at a fixed rate of 6.125% of the liquidation preference per year, which is equivalent to an annual dividend of $1.53125 per depositary share. Dividends will be paid quarterly in arrears. The Company estimates that net proceeds from this offering, after deducting underwriting discounts, commissions and estimated offering expenses, will be approximately $72,137,500 million (assuming no exercise of the underwriters' over-allotment option).\nThe Company intends to use the net proceeds from this offering to redeem, in part, outstanding shares of its 6.875% Series C Cumulative Redeemable Preferred Stock and the related depositary shares.\nThe offering is expected to close on or about January 23, 2018, subject to customary closing conditions. Up to 450,000 additional depositary shares may be issued pursuant to the underwriters' over-allotment option within 30 days of the initial issuance of the depositary shares. The Company anticipates listing the depositary shares on the New York Stock Exchange.\nThe joint book-running managers for the offering are Raymond James & Associates, Inc., RBC Capital Markets, LLC, Stifel, Nicolaus & Company, Incorporated, B. Riley FBR, Inc. and D.A. Davidson & Co.\nThis communication shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities, in any state or other jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or other jurisdiction. The offering is being made pursuant to the Company's existing shelf registration statement, previously filed with the Securities and Exchange Commission. The offering of these securities will be made only by means of a prospectus and a related preliminary prospectus supplement. Copies of the prospectus and the preliminary prospectus supplement relating to these securities may be obtained from Raymond James & Associates, Inc. by calling toll-free 800-248-8863 or writing to prospectus@raymondjames.com , RBC Capital Markets, LLC by calling toll-free 866-375-6829 or writing to rbcnyfixedincomeprospectus@rbccm.com , Stifel, Nicolaus & Company, Incorporated by calling toll-free 855-300-7136 or writing to syndprospectus@stifel.com , B. Riley FBR, Inc. by writing to prospectuses@brileyfbr.com , or D.A. Davidson & Co. by calling toll-free 800-332-5915 or by writing to Prospectusrequest@dadco.com . You may also obtain a copy of the prospectus, the preliminary prospectus supplement and other documents the Company has filed with the Securities and Exchange Commission for free by visiting the Commission's Web site at www.sec.gov .\nSaul Centers, Inc. is a self-managed, self-administered equity REIT headquartered in Bethesda, Maryland, which currently operates and manages a real estate portfolio of 58 properties which includes (a) 49 community and neighborhood shopping centers and six mixed-use properties with approximately 9.2 million square feet of leasable area and (b) three land and development properties. Approximately 85% of the Saul Centers' property operating income is generated by properties in the metropolitan Washington, DC/Baltimore area.\nStatements in this press release that are not strictly historical are \"forward-looking\" statements, including statements with regard to the Company's securities offering and the anticipated use of the net proceeds. Forward-looking statements involve known and unknown risks, which may cause the Company's actual results to differ materially from expected results. No assurance can be given that the securities offering discussed above will be completed on the terms described, or at all, or that the net proceeds of the offering will be used as indicated. Completion of the securities offering on the terms described, and the application of net proceeds, are subject to numerous conditions, many of which are beyond the control of the Company, including, without limitation, general economic conditions, local real estate conditions and the availability of capital. Additional information concerning these and other factors that could cause actual results to differ materially from those forward-looking statements is contained from time to time in the Company's Securities and Exchange Commission filings, including, but not limited to, Item 1A. Risk Factors of the Company's annual report on Form 10-K. Copies of each filing may be obtained from the Company or the Commission. The Company undertakes no obligation to publicly release the results of any revisions to these forward-looking statements that may be made to reflect events or circumstances after the date these statements were made.\nView original content: http://www.prnewswire.com/news-releases/saul-centers-inc-prices-offering-of-depositary-shares-and-6125-series-d-cumulative-redeemable-preferred-stock-300583625.html\nSOURCE Saul Centers, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/saul-centers-inc-prices-offering-of-depositary-shares-and-6125-series-d-cumulative-redeemable-preferred-stock-300583625.html", "http://www.sec.gov/"], "published": "2018-01-17T02:39:00.000+02:00", "crawled": "2018-01-17T02:58:52.018+02:00", "highlightTitle": ""}