{"organizations": [], "uuid": "8d4f814d9a683916da2beb651f520bf2e579100f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/business-wire-industrial-logistics-properties-trust-prices-initial-public-offering.html", "country": "US", "domain_rank": 767, "title": "Industrial Logistics Properties Trust Prices Initial Public Offering", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T04:20:00.000+02:00", "replies_count": 0, "uuid": "8d4f814d9a683916da2beb651f520bf2e579100f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/business-wire-industrial-logistics-properties-trust-prices-initial-public-offering.html", "ord_in_thread": 0, "title": "Industrial Logistics Properties Trust Prices Initial Public Offering", "locations": [], "entities": {"persons": [], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "newton", "sentiment": "none"}], "organizations": [{"name": "industrial logistics properties trust prices initial public offering", "sentiment": "negative"}, {"name": "securities and exchange commission", "sentiment": "none"}, {"name": "ilpt", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEWTON, Mass.--(BUSINESS WIRE)-- Industrial Logistics Properties Trust (Nasdaq: ILPT) today announced that it has priced an initial public offering of 20,000,000 common shares of beneficial interest at $24.00 per share.\nThe settlement of this offering is expected to occur on January 17, 2018. The underwriters have a 30 day option to purchase up to an additional 3,000,000 shares to cover overallotments, if any. All the shares are being offered by ILPT. ILPT intends to set aside approximately $2 million of the net proceeds from the offering for working capital and use the balance of such proceeds to reduce the amount outstanding under its credit facility.\nA registration statement relating to the offering of the common shares of beneficial interest of ILPT discussed above was declared effective by the Securities and Exchange Commission on January 11, 2018. This press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities, in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\nUBS Investment Bank, Citigroup, RBC Capital Markets, BofA Merrill Lynch, Morgan Stanley and Wells Fargo Securities are the joint book running managers for the offering. B. Riley | FBR, BB&T Capital Markets, Janney Montgomery Scott, JMP Securities and Oppenheimer & Co. are the co-managers for the offering.\nA copy of the prospectus related to the offering can be obtained, when available, by contacting the offices of: UBS Securities LLC, Attn: Prospectus Department, 1285 Avenue of the Americas, New York, NY 10019, telephone: (888) 827-7275, email: ol-prospectus-request@ubs.com ; Citigroup Global Markets Inc. c/o Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, NY 11717, telephone: (800) 831-9146, email: batprospectusdept@citi.com ; RBC Capital Markets, LLC, Attn: Equity Syndicate, Three World Financial Center, 200 Vesey Street, 8 th Floor, New York, NY 10281, telephone: (877) 822-4089, email: equityprospectus@rbccm.com ; BofA Merrill Lynch, NC1-004-03-43, 200 North College Street, 3 rd Floor, Charlotte, NC 28255-0001, Attn: Prospectus Department, email: dg.prospectus_requests@baml.com ; Morgan Stanley & Co. LLC, Attn: Prospectus Department,180 Varick Street, 2 nd Floor, New York, NY 10014; or Wells Fargo Securities, Attn: Equity Syndicate Department, 375 Park Avenue, New York, NY 10152, email: cmclientsupport@wellsfargo.com .\nWARNING CONCERNING FORWARD LOOKING STATEMENTS\nTHIS PRESS RELEASE CONTAINS FORWARD LOOKING STATEMENTS WITHIN THE MEANING OF THE PRIVATE SECURITIES LITIGATION REFORM ACT OF 1995 AND OTHER SECURITIES LAWS. THESE FORWARD LOOKING STATEMENTS ARE BASED UPON ILPT’S PRESENT BELIEFS AND EXPECTATIONS, BUT THESE FORWARD LOOKING STATEMENTS ARE NOT GUARANTEED TO OCCUR. FOR EXAMPLE:\nTHIS PRESS RELEASE STATES THAT THE SETTLEMENT OF THE OFFERING OF COMMON SHARES IS EXPECTED TO OCCUR ON JANUARY 17, 2018. IN FACT, THE SETTLEMENT OF THIS OFFERING IS SUBJECT TO VARIOUS CONDITIONS AND CONTINGENCIES AS ARE CUSTOMARY IN UNDERWRITING AGREEMENTS IN THE UNITED STATES. IF THESE CONDITIONS ARE NOT SATISFIED OR THE SPECIFIED CONTINGENCIES DO NOT OCCUR, THIS OFFERING MAY NOT CLOSE. THIS PRESS RELEASE STATES THAT THE UNDERWRITERS HAVE BEEN GRANTED AN OPTION TO PURCHASE UP TO AN ADDITIONAL 3,000,000 COMMON SHARES TO COVER OVERALLOTMENTS, IF ANY. AN IMPLICATION OF THIS STATEMENT MAY BE THAT THIS OPTION MAY BE EXERCISED IN WHOLE OR IN PART. THE UNDERWRITERS ARE NOT OBLIGATED TO EXERCISE THIS OPTION, OR ANY PART OF IT.\nFOR THESE REASONS, AMONG OTHERS, INVESTORS ARE CAUTIONED NOT TO PLACE UNDUE RELIANCE UPON FORWARD LOOKING STATEMENTS.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180111006245/en/\nIndustrial Logistics Properties Trust\nOlivia Snyder, 617-219-1489\nManager, Investor Relations\nSource: Industrial Logistics Properties Trust", "external_links": ["http://www.businesswire.com/news/home/20180111006245/en/"], "published": "2018-01-12T04:20:00.000+02:00", "crawled": "2018-01-12T06:15:40.014+02:00", "highlightTitle": ""}