{"organizations": [], "uuid": "726646e7f08f90995dce47bf83e1daf9daa2e571", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180112.html", "section_title": "Archive News &amp; Video for Friday, 12 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/china-pollution-coal-gas/china-state-coal-miners-cut-prices-to-kill-rally-amid-heating-crisis-idUSL4N1P734U", "country": "US", "domain_rank": 408, "title": "China state coal miners cut prices to kill rally amid heating crisis", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T18:59:00.000+02:00", "replies_count": 0, "uuid": "726646e7f08f90995dce47bf83e1daf9daa2e571"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/china-pollution-coal-gas/china-state-coal-miners-cut-prices-to-kill-rally-amid-heating-crisis-idUSL4N1P734U", "ord_in_thread": 0, "title": "China state coal miners cut prices to kill rally amid heating crisis", "locations": [], "entities": {"persons": [{"name": "josephine mason", "sentiment": "none"}, {"name": "muyu xu", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "shanxi", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "shanxi coking coal group", "sentiment": "none"}, {"name": "jinneng group", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "datong coal mine group", "sentiment": "none"}, {"name": "datong coal", "sentiment": "none"}, {"name": "china coal transport and distribution association", "sentiment": "none"}, {"name": "yangquan coal ind", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Seven coal miners cut coal prices by 15-20 yuan a tonne\n* Thermal coal futures fall after seven days of gain\n* Price drop may not last, demand will surge, say analyst, traders\nBy Muyu Xu and Josephine Mason\nBEIJING, Jan 12 (Reuters) - China’s top state coal miners have cut spot prices for the fuel to dampen a month-long price rally that was triggered after Beijing reversed a ban on using coal in households and some industrial plants amid the nation’s winter heating crisis.\nSeven firms in China’s top coal mining province of Shanxi, including Shanxi Coking Coal Group, Datong Coal Mine Group and Jinneng Group, have issued statements announcing have lowered their coal prices by 15-20 yuan ($3.10) per tonne, according to the China Coal Transport and Distribution Association (CCTD) on Friday.\n“To deal with tight supplies and volatile prices in the coal market ... as a state-owned enterprises, we decided to play an active role to keep coal prices stable by cutting spot prices by 15 yuan a tonne from Jan. 11,” said Datong Coal in a statement dated on Wednesday.\nExcept for Yangquan Coal Industry Group, who did not respond to Reuters, the coal mines confirmed the price adjustments as outlined by CCTD.\nThe move came after coal prices jumped by more than 10 percent since heating season kicked off in mid-November, with demand at coal-fired power plants continuing to surge as freezing weather swept across the country.\nIn early December, Beijing pulled back its ambitious plan to convert northern cities to gas this winter due to shortages of the cleaner-burning fuel. Some coal-powered plants resumed operations to warm households as the central government made heating a priority despite its campaign against air pollution.\nThe most-active thermal coal futures contract on the Zhengzhou Commodity Exchange on Friday marked its first dip after seven days of gains, falling 0.6 percent to 632 yuan a tonne. It hit a record 645.4 yuan a tonne on Dec. 18.\n“Coal prices have reached a really high level that some utilities are unable to cope with,” said Xu Bo, analyst at Haitong Futures, adding that it was uncertain if the lower coal prices would last.\nAnalysts and traders expect stronger demand for coal at utilities and industrial plants in the coming months as heavy industry like steel mills and aluminium producers ramp up output once the winter curbs are over in mid-March.\nOn Thursday, Zhengzhou Exchange raised margin requirements to 6 percent from 5 percent of total contract value on thermal coal contracts, the latest effort to curb speculation.\nSpot thermal coal prices at Qinhuangdao port were at 591 yuan a tonne on Friday, down 1 yuan from the previous day.\n$1 = 6.4550 Chinese yuan Reporting by Muyu Xu and Josephine Mason; Editing by Tom Hogue\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T18:59:00.000+02:00", "crawled": "2018-01-13T14:40:23.010+02:00", "highlightTitle": ""}