{"organizations": [], "uuid": "c01c9b63b55613048cb6204549d66013a26017f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/steinhoff-accounts/update-1-crisis-hit-steinhoff-says-stabilising-its-main-businesses-idUSL8N1PL43N", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Crisis-hit Steinhoff says stabilising its main businesses", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T16:44:00.000+02:00", "replies_count": 0, "uuid": "c01c9b63b55613048cb6204549d66013a26017f8"}, "author": "", "url": "https://www.reuters.com/article/steinhoff-accounts/update-1-crisis-hit-steinhoff-says-stabilising-its-main-businesses-idUSL8N1PL43N", "ord_in_thread": 0, "title": "UPDATE 1-Crisis-hit Steinhoff says stabilising its main businesses", "locations": [], "entities": {"persons": [{"name": "steinhoff", "sentiment": "negative"}], "locations": [{"name": "poundland", "sentiment": "none"}, {"name": "johannesburg", "sentiment": "none"}, {"name": "frankfurt", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "psg group", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 2:47 PM / in 29 minutes UPDATE 2-Steinhoff says it has contained short-term cash crisis Reuters Staff \n* Steinhoff says liquidity crunch largely contained \n* Asia-Pacific still in talks with lenders for fresh money \n* Steinhoff to issue quarterly update next month \n* Shares reverse losses (Adds Keika-Leiner, analyst comment) \nBy Tiisetso Motsoeneng \nJOHANNESBURG, Jan 26 (Reuters) - Steinhoff bought itself some breathing space on Friday by plugging a short-term funding gap as the troubled South African retail group wrestles with the fallout from an accounting scandal. \nSteinhoff, which owns more than 40 brands including Poundland in Britain, admitted “accounting irregularities” last month, sparking an 85 percent share price slide that wiped more than $10 billion off its market capitalisation. \nIn a presentation to European lenders, Steinhoff said it expected to give a quarterly trading update at the end of February. It was forced to postpone the release of financial results when the crisis broke in December. \nThe company this week raised 7.1 billion rand ($595 million)from the sale of a stake in investment firm PSG Group as part of efforts to shore up its finances. \n“The group continues to take steps to maintain stability of its operations and immediate operational liquidity requirements have been largely addressed,” it said in part of the presentation on its website. \nKeika-Leiner, the Austrian subsidiary that faced the largest funding problem, has secured fresh money and has crafted a restructuring plan, Steinhoff said, without giving details. \nKeika-Leiner, a chain generating 800 million euros of annual sales, is due to hold a news conference on Monday to present its restructuring plan. \nSteinhoff is also in the final stages of putting the finances of more subsidiaries on a new footing, after securing fresh money for Poundland, France’s Conforama and U.S. group Mattress Firm over the last three weeks, the company said. \nIts Asia Pacific businesses continue discussions with their banks to secure additional funding by mid-February. SHARES REVERSE LOSSES \nShares in Steinhoff turned positive shortly after the news, rising 1.4 percent and 3.5 percent respectively in Johannesburg and Frankfurt, where the company is listed. But the stock is still down about 84 percent since Dec. 5 when news of the accounting problems broke. “From a liquidity point of view, there’s some positive news and it looks like the business would be kept running,” said Wayne McCurrie, a portfolio manager at Ashburton Investments. “But we still need more details about the accounting scandal.” \nThe company, which has asked PwC to get to the bottom of the accounting problems, said having pulled together the money to keep the business running, it would now focus its attention on broader discussions with lenders. \nSteinhoff’s top nine banks, with a combined exposure to the retailer of more than 500 million euros, are Commerzbank, Unicredit, Calyon, BNP, JPMorgan, HSBC, Citi, Mizuho and Bank of America. \nThe company, which moved its primary share listing from Johannesburg to Frankfurt two years ago, has been under investigation for suspected accounting fraud in Germany since 2015. \nSteinhoff has previously said that the investigation relates to whether revenues were booked properly and whether taxable profits were correctly declared. ($1 = 11.9180 rand) (Additional reporting by Nqobile Dludla in Johannesburg and Kirsti Knolle in Vienna; Editing by Keith Weir and Elaine Hardcastle)", "external_links": [], "published": "2018-01-26T16:44:00.000+02:00", "crawled": "2018-01-26T17:32:24.009+02:00", "highlightTitle": ""}