{"organizations": [], "uuid": "6d40e02b4d04addb1c24fa061c3bff0c122b54ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224793702&w=1200&r=LYNXMPEE0N12K", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/usa-pesticides-soybeans/insight-battle-of-the-beans-monsanto-faces-a-fight-for-soy-market-idINKBN1FD1JK", "country": "US", "domain_rank": 408, "title": "Insight: Battle of the beans - Monsanto faces a fight for soy market", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T14:07:00.000+02:00", "replies_count": 0, "uuid": "6d40e02b4d04addb1c24fa061c3bff0c122b54ed"}, "author": "", "url": "https://in.reuters.com/article/usa-pesticides-soybeans/insight-battle-of-the-beans-monsanto-faces-a-fight-for-soy-market-idINKBN1FD1JK", "ord_in_thread": 0, "title": "Insight: Battle of the beans - Monsanto faces a fight for soy market", "locations": [], "entities": {"persons": [{"name": "tom polansek", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "winnipeg", "sentiment": "none"}], "organizations": [{"name": "monsanto", "sentiment": "negative"}, {"name": "xtend", "sentiment": "none"}, {"name": "monsanto co", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WINNIPEG, Manitoba/CHICAGO (Reuters) - Monsanto Co is facing major threats to its historic dominance of seed and herbicide technology for the $40 billion U.S. soybean market.\nRivals BASF SE and DowDuPont are preparing to push their own varieties of genetically modified soybeans. At stake is control over seed supply for the next generation of farmers producing the most valuable U.S. agricultural export.\nThe market has opened up as Monsanto’s Roundup Ready line of seeds - engineered to tolerate the weed killer glyphosate - has lost effectiveness as weeds develop their own tolerance to the chemical. Compounding the firm’s troubles is a national scandal over crop damage linked to its new soybean and herbicide pairing – Roundup Ready 2 Xtend seeds, engineered to resist the chemical dicamba.\nThe newly competitive sector has sown confusion across the U.S. farm belt, particularly among smaller firms that produce and sell seeds with technology licensed from the agrichemical giants.\nMany of these sellers told Reuters they are amassing a surplus of seeds with engineered traits from multiple developers - at substantial extra cost - because they can only guess which product farmers will buy.\n“Our job is to meet our customers’ needs, and we don’t know what those are going to be,” said Carl Peterson, president of Peterson Farms Seed near Fargo, North Dakota. “I don’t think I’ve ever seen anything quite like this.”\nMonsanto has much to lose. Soybeans are the key ingredient in feed used to fatten the world’s cattle, pigs, chickens and fish.\nNet sales of Monsanto’s soybean seeds and traits totaled almost $2.7 billion in fiscal 2017, or about a fifth of its total net sales. Gross profits from soybean products climbed 35 percent over 2016, beating 15 percent growth of its bigger corn seed franchise.\nThe firm faces multiple lawsuits, along with regulatory restrictions in some U.S. states, because dicamba has drifted onto neighboring farms and fields and damaged crops not genetically modified to resist it.\nBASF and DowDuPont, however, have their own obstacles to overcome, fueling unprecedented uncertainty among farmers over which seeds they will plant on an estimated 90 million acres of U.S. farmland this spring.\nBASF is just entering the market, aiming to compete with an older soybean line called LibertyLink, which the firm is acquiring from Bayer AG. DowDuPont is eager to join the fray but needs approval from Chinese regulators before it can broadly market and sell its new soybean product, Enlist E3.\nMonsanto declined comment to Reuters on competition from rivals in the soybean market. But the firm has previously acknowledged the intensifying threat to its bottom line as rivals launch new products.\n“Our competitors’ success could render our existing products less competitive, resulting in reduced sales compared to our expectations or past results,” Monsanto said in an annual report filed with the U.S. Securities and Exchange Commission last year.\nDICAMBA DISASTER The name of Monsanto’s new dicamba-based herbicide - XtendiMax with VaporGrip - reflects the problem it tries to solve: the chemical’s tendency to vaporize and drift to neighboring fields, damaging crops.\nBut last summer, after farmers planted Monsanto’s new dicamba-resistant seeds en masse, the herbicide damaged an estimated 3.6 million acres of soybeans, or 4 percent of all U.S. plantings.\nMonsanto maintains its new formulation of dicamba reduces drift effectively. It blames farmers for not following spraying instructions and for illegally applying older versions of dicamba on Xtend seeds.\nDespite the controversy, Xtend soybeans have sold briskly, spanning 20 million U.S. acres in 2017, their second year of sales. Monsanto projects that acreage will double this year, accounting for about 44 percent of all planted acres.\nStill, Monsanto faces a slew of regulatory, legal and public relations challenges from the crop-damage crisis.\nRegulators in Arkansas, where crops were heavily damaged in 2017, have prohibited the use of dicamba-based herbicides between dates that likely will cover the entire growing season. Missouri, Minnesota and North Dakota have also restricted when farmers can spray dicamba.\nMissouri farmer Bobby Aycock joined one of several class-action lawsuits against Monsanto after dicamba spraying by nearby farmers damaged his crops in 2016.\nHe then planted Xtend in 2017 to ensure that drifting dicamba could not harm his crop again. He found another benefit at harvest time: his highest yield in 33 years of soybean farming.\nA sample of clean, processed soybeans at Peterson Farms Seed facility in Fargo, North Dakota, U.S., December 6, 2017. REUTERS/Dan Koeck/Files Despite his lawsuit against Monsanto, Aycock plans to sow Xtend seeds again this spring.\n”If something’s working,“ he said, ”I hate to change it.”\nBASF ENTERS BEAN BATTLE BASF is waiting for Monsanto and Bayer to close their proposed $63.5 billion merger before it can take over Bayer’s LibertyLink brand of seeds, which are engineered to withstand the chemical glufosinate.\nThe timing of the takeover, expected in the spring planting season, is awkward because farmers may have already bought seeds. BASF aims to prevent any “customer disruption” when it assumes control of the LibertyLink brand as part of a $7 billion deal with Bayer, BASF vice president Scott Kay said in an interview.\nBASF declined to elaborate further on its strategy because the purchase of LibertyLink is not yet completed.\nThe acquisition complements BASF’s herbicide business with a seed line that should “continue to grow profitably,” BASF’s outgoing chief executive Kurt Bock said in October.\nBayer has sold LibertyLink in the United States since 2009, steadily gaining market share to reach about 15 percent, said Rob Schrick, who runs North American corn and soy strategy for Bayer. The company expects the brand to capture 20 percent of the market in 2018.\nSlideshow (5 Images) BASF had a strategic urgency in the LibertyLink acquisition, said Patrick Jahnke, portfolio manager at Deka Investments, which owns BASF stock.\n“The Bayer seed assets were not a bargain,” Jahnke said. “But the purchase eliminates the risk of being the only major supplier in the agro business without a seeds offering.”\nWILD CARD FROM DOWDUPONT DowDuPont faces the greatest obstacle in the fight for soybean market share because it is waiting for Chinese regulators to approve imports of soybeans harvested from its Enlist E3 seeds.\nEnlist E3 soybeans are bred to resist glyphosate, glufosinate and 2,4-D, a chemical with roots stretching to the Vietnam War as an ingredient in Agent Orange, used by the U.S. military to defoliate jungle.\nLaunching Enlist widely without Beijing’s approval would risk causing unapproved seeds or soybeans to be inadvertently shipped to China, the biggest importer. So for now, DowDuPont’s seeds will be grown by a limited, undisclosed number of U.S. farmers who agree to deliver their harvests only to facilities run by Archer Daniels Midland Co, according to the company.\nThe deal will give Enlist - one of DowDuPont’s biggest crop-system investments - a toehold in the U.S. market. Approval by Chinese regulators, an uncertain process, could translate to huge profits, but DowDuPont would still face the challenge of catching rivals who have a head start, said Michael Underhill, chief investment officer of Capital Innovations, which manages shares of DowDuPont, Bayer and Monsanto.\n“To go into this market, and be late to the game, you have to be exceedingly aggressive,” Underhill said.\n238 BILLION EXTRA SEEDS DowDuPont’s entry makes it especially hard for farmers to decide what to buy because Enlist E3 may or may not be widely available, said Mark Denzler, president of Indiana-based 1st Choice Seeds, which scooped up surplus soybean seeds last autumn.\nIn Iowa, Stine Seed acquired 238 billion extra soybean seeds to sell because of the uncertainty, Chief Executive Harry Stine said. Illinois-based Great Heart Seed has amassed extra supplies of five varieties of genetically modified soybeans.\n”It’s a real pain and it will continue to be so going forward, trying to manage the inventory,” said company co-owner Nels Kasey.\nLike the seed sellers, Missouri farmer Milas Mainord plans to hedge his bets by planting at least three soybean varieties.\nHe will devote up to 30 percent of his 5,000 acres of soybeans to Monsanto’s Xtend seeds to protect himself from neighbors spraying dicamba. He also plans to plant some LibertyLink and other seeds in areas where he doesn’t expect dicamba use.\n“We’re covering our bases,” Mainord said.\nAdditional reporting by Patricia Weiss and Ludwig Burger in Frankfurt; Editing by Simon Webb and Brian Thevenot\n ", "external_links": [], "published": "2018-01-24T14:07:00.000+02:00", "crawled": "2018-01-24T14:32:38.010+02:00", "highlightTitle": ""}