{"organizations": [], "uuid": "103d026d88d7e50cbfa70b0f5e6202e6fcb0121d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 10, "shares": 10, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219528160&w=1200&r=LYNXMPEE040CG", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-china-abs/consumer-loan-securitization-boom-put-on-hold-as-china-clamps-down-on-leverage-idUSKBN1EU0K7", "country": "US", "domain_rank": 408, "title": "Consumer loan securitization boom put on hold as China clamps down on leverage", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T09:02:00.000+02:00", "replies_count": 0, "uuid": "103d026d88d7e50cbfa70b0f5e6202e6fcb0121d"}, "author": "", "url": "https://www.reuters.com/article/us-china-abs/consumer-loan-securitization-boom-put-on-hold-as-china-clamps-down-on-leverage-idUSKBN1EU0K7", "ord_in_thread": 0, "title": "Consumer loan securitization boom put on hold as China clamps down on leverage", "locations": [], "entities": {"persons": [{"name": "elias glenn", "sentiment": "none"}, {"name": "shu zhang", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "baidu inc", "sentiment": "none"}, {"name": "ant financial services group", "sentiment": "none"}, {"name": "alibaba group holding", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "jd.com inc", "sentiment": "none"}, {"name": "vipshop holdings", "sentiment": "none"}, {"name": "xiaomi technology", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 7:04 AM / Updated 15 hours ago Consumer loan securitization boom put on hold as China clamps down on leverage Shu Zhang , Elias Glenn 7 Min Read \nBEIJING (Reuters) - A boom in asset-backed securities issued by micro-lenders aiming to expand in China’s fast-growing online credit market looks set to slow this year amid growing regulatory scrutiny. \nMicro-lenders have raised billions of dollars packaging consumer loans into securities for sale to institutional investors on China’s nascent market for asset-backed securities in order to rapidly expand their loan books. \nMany of China’s largest internet and technology companies have issued securities backed by micro-loans. Ant Financial Services Group, an affiliate of Alibaba Group Holding ( BABA.N ), dominates the market and the finance arms of JD.com Inc ( JD.O ), Baidu Inc ( BIDU.O ), VIPShop Holdings ( VIPS.N ) and Xiaomi Technology have also raised funds through the products. \nBut the market for the securities is set to slow this year, industry sources say, as regulators target lenders’ high debt levels and limited asset disclosure. \nRules announced on Dec. 1 limited the amount of lending backed by the products the companies can make. They were also required to consolidate them on their balance sheets. \nChina’s exchanges and the National Association of Financial Market Institutional Investors (NAFMII) have suspended the issuance of securities backed by consumer loans by Internet-based micro-lenders, said Guo Yonggang, general manager of the structured financing department at Golden Credit Rating International Co. \nNAFMII last week amended its disclosure requirements for consumer loan securities to reflect the central bank’s higher transparency standards. \nThe volume of securities backed by consumer loans has surged over 35-fold in the last two years, with the proceeds used to finance loans to individuals looking to buy the latest iPhone or finance overseas holidays. \nAbout 489.4 billion yuan ($75.36 billion) of the securities were issued in 2017, compared with 98.9 billion yuan in 2016, according to China Securitisation Analytics. \nRepackaging the loans as asset-backed securities has allowed lenders to transfer the loans off their balance sheets, bypassing government rules stipulating how much they can lend in proportion to their equity capital. LARGEST ISSUER \nAnt Financial is the largest issuer of consumer loan securities, accounting for 60 percent of all issues in 2017, according to Reuters calculations based on data from China Securitisation Analytics. \nIts two Chongqing-based micro-loan companies had total net capital of 10.6 billion yuan, but issued 265.1 billion yuan in loans by the end of June, according to CIB Research, a unit of Industrial Bank Co ( 601166.SS ). Outstanding loan securities issued by the two units have exceeded 250 billion yuan, it said. \n“The ratio of total financing to total capital is far beyond the 2.3-times leverage requirement set by the Chongqing banking regulator,” CIB Research said in a December report. \nAs Beijing issued its new rules, Ant Financial has quietly withdrawn plans to issue asset-backed notes worth billions of dollars, two sources with knowledge of the matter told Reuters. \nOfficials from the People’s Bank of China have met with Ant Financial to discuss the high debt levels of its consumer finance business, said one of the sources. The source said the central bank may prevent Ant from issuing new consumer loan securities until it reduced its leverage level. \nAnt said the program’s cancellation was due to “tight funding conditions and rising pricing on the bond market” at the end of 2017. \nThe company plans to increase registered capital in two consumer loan units - Chongqing Mayi Micro Loans Co and Chongqing Mayi Shangcheng Small Loans Co - to 12 billion yuan, from 3.8 billion yuan at present, the company said in an email. \nThe central bank did not respond to a faxed request for comment. SHORT HISTORY, WEAK DISCLOSURE \nThe short history of micro-loan companies and China’s asset-backed securities market raises significant challenges for ratings agencies and investors trying to gauge risk. \n“The hypotheses or parameter estimations we use for data analysis could differ from the actual situation to some degree,” said Zheng Kaiwen, senior analyst at China Chengxin Securities Rating Co, pointing to loan companies’ short business histories. \nThere has yet to be a default from a consumer loan securitization product, according to China Chengxin. \nBut the likelihood of default may be “underestimated”, said Guo of Golden Credit Rating, citing incomplete credit ratings data and the rapid expansion of consumer loans. \nBefore the government cleanup, small and mid-tier Chinese banks, as well as private funds with high risk tolerance, were among the most active buyers of micro loan securities, loan companies said. \nIn March, Bank of Jiangsu Co ( 600919.SS ) and Debang Securities launched a 20 billion yuan investment fund focused on loan-backed securities, the first of its kind in China. \nDespite government efforts to control consumer loan-backed securities, reining them in will be difficult as many transactions take place “off-market”, company sources said. \nThose private sales take place on local financial exchanges and equity trading centers, as well as internet-based financial trading platforms powered by Chinese tech giants, making them difficult for the government to track. \nSeveral ratings agencies and loan companies said they were unable to accurately estimate the total of such private transactions due to limited information disclosure. \nSome loan companies choosing private sales have weak operating quality, aggressive strategies and incomplete risk control systems, said Guo at Golden Credit Rating. \n“Due to the weak information disclosure of off-market product issues, borrowers could have taken out loans from multiple platforms, or these loans could just be non-compliant campus loans or housing down-payment loans,” he said. Reporting By Shu Zhang and Elias Glenn; Additional reporting By Matthew Miller; Editing by Philip McClellan", "external_links": [], "published": "2018-01-05T09:02:00.000+02:00", "crawled": "2018-01-05T09:16:26.001+02:00", "highlightTitle": ""}