{"organizations": [], "uuid": "f653005b8a054861e47dcd482afde5ed049d975c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-lonestar-resources-us-inc-closes-250-million-senior-unsecured-notes-offering-borrowing-base-affirmed-at-160-million.html", "country": "US", "domain_rank": 767, "title": "Lonestar Resources US Inc. Closes $250 Million Senior Unsecured Notes Offering, Borrowing Base Affirmed At $160 Million", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.066, "site_type": "news", "published": "2018-01-09T18:31:00.000+02:00", "replies_count": 0, "uuid": "f653005b8a054861e47dcd482afde5ed049d975c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-lonestar-resources-us-inc-closes-250-million-senior-unsecured-notes-offering-borrowing-base-affirmed-at-160-million.html", "ord_in_thread": 0, "title": "Lonestar Resources US Inc. Closes $250 Million Senior Unsecured Notes Offering, Borrowing Base Affirmed At $160 Million", "locations": [], "entities": {"persons": [], "locations": [{"name": "texas", "sentiment": "none"}, {"name": "lonestar", "sentiment": "none"}], "organizations": [{"name": "lonestar resources us inc.", "sentiment": "negative"}, {"name": "lonestar resources us inc", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "umb bank", "sentiment": "none"}, {"name": "lrai", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FORT WORTH, Texas, Jan. 9, 2018 /PRNewswire/ -- Lonestar Resources US Inc. (NASDAQ: LONE) (together with its subsidiaries, \"Lonestar,\" \"we,\" \"us,\" \"our\" or the \"Company\") announced today that is has closed its previously announced offering of $250 million aggregate principal amount of 11.250% senior notes due 2023 (the \"Notes\"). The Notes were issued under the Indenture, dated as of January 4, 2018, by and among LRAI, the subsidiary guarantors named therein and UMB Bank, N.A., as trustee (the \"Indenture\"). The Notes are fully and unconditionally guaranteed on a senior unsecured basis by each of LRAI's current subsidiaries that guarantee LRAI's revolving credit facility. The Notes are not guaranteed by the Company and the Company is not subject to the terms of the Indenture.\nThe net proceeds of the Notes offering will be used to fully retire Lonestar's existing 8 ¾% Senior Unsecured Notes due April, 2019, which bear principal, interest and prepayment premium of approximately $162 million. The remaining net proceeds of the Notes offering will be used to reduce borrowings under the Company's Senior Secured Credit Facility (the \"Facility\").\nLonestar also announced today that it, with its lenders, have amended the Facility to maintain the existing borrowing base at $160 million. In addition, by operation of the transactions described above and the existing terms of the Facility, the maturity date of the Facility has been extended from October, 2018 to July, 2020. Lonestar will have approximately $60 million outstanding on the Facility, proforma December 31, 2017. As a result, Lonestar has approximately $100 million of liquidity under the Facility.\nFrank D. Bracken, III, Lonestar's Chief Executive Officer commented, \"Closing our Notes offering and amending our Senior Secured Credit Facility (collectively, \"the Transactions\") represent the culmination of our efforts to financially reposition Lonestar. First, the Transactions meaningfully extend the profile of both our secured and unsecured debt maturities. Second, the Transactions greatly expand our liquidity to approximately $100 million. Looking to 2018, we are now fully focused on executing our plan to increasing annual average production to 10,000-10,700 BOE per day and increasing EBITDAX by approximately 60% to $100-$110 million. This growth is expected to reduce our Net Debt / EBITDAX ratio to below 3.0x by year-end 2018. Most importantly, Lonestar is now positioned to increase shareholder value by driving up production, reserves and cash flow on a per-share basis.\"\nAbout Lonestar\nLonestar is an independent oil and natural gas company, focused on the development, production and acquisition of unconventional oil, natural gas liquids and natural gas properties in the Eagle Ford Shale in Texas.\nCautionary Note Regarding Forward Looking Statements\nDisclosures in this press release contain certain forward-looking statements within the meaning of the federal securities laws. Statements that do not relate strictly to historical or current facts are forward-looking. These statements contain words such as \"possible,\" \"if,\" \"will,\" \"expect\" and \"assuming\" and involve risks and uncertainties including, among others that our business plans may change as circumstances warrant and securities of the Company may not ultimately be offered to the public because of general market conditions or other factors. Accordingly, readers should not place undue reliance on forward-looking statements as a prediction of actual results. For more information concerning factors that could cause actual results to differ materially from those conveyed in the forward-looking statements, please refer to the \"Risk Factors\" section of the Annual Report on Form 10-K for the year ended December 31, 2016, filed with the Securities and Exchange Commission (the \"SEC\") on March 23, 2017 and subsequently filed quarterly reports on Form 10-Q. Any forward-looking statements in this press release are made as of the date of this press release and the Company undertakes no obligation to update or revise such forward-looking statements to reflect events or circumstances that occur, or of which the Company becomes aware, after the date hereof, unless required by law.\nView original content with multimedia: http://www.prnewswire.com/news-releases/lonestar-resources-us-inc-closes-250-million-senior-unsecured-notes-offering-borrowing-base-affirmed-at-160-million-300580004.html\nSOURCE Lonestar Resources US Inc.", "external_links": ["http://www.prnewswire.com/news-releases/lonestar-resources-us-inc-closes-250-million-senior-unsecured-notes-offering-borrowing-base-affirmed-at-160-million-300580004.html"], "published": "2018-01-09T18:31:00.000+02:00", "crawled": "2018-01-09T21:28:10.016+02:00", "highlightTitle": ""}