{"organizations": [], "uuid": "5abbc541cb782d4d590147a97b5920448751d96e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180123.html", "section_title": "Archive News &amp; Video for Tuesday, 23 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-usa-trade-factbox/factbox-trump-administration-prepares-for-raft-of-trade-decisions-idUSKBN1FC32Q", "country": "US", "domain_rank": 408, "title": "Factbox: Trump administration prepares for raft of trade decisions", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T05:51:00.000+02:00", "replies_count": 0, "uuid": "5abbc541cb782d4d590147a97b5920448751d96e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-trade-factbox/factbox-trump-administration-prepares-for-raft-of-trade-decisions-idUSKBN1FC32Q", "ord_in_thread": 0, "title": "Factbox: Trump administration prepares for raft of trade decisions", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "whirlpool corp", "sentiment": "none"}, {"name": "samsung electronics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - The Trump administration is set to announce a raft of trade decisions over the next months, ranging from curbs on foreign imports of steel and aluminum to steps to clamp down on China’s alleged theft of intellectual property.\nU.S. President Donald Trump has stressed his “America First” agenda in his first year in office and called for fairer, more reciprocal trade. He has blamed globalization for ravaging American manufacturing jobs as companies sought to reduce labor costs by relocating to Mexico and elsewhere.\nIMPORTED WASHING MACHINES AND SOLAR PANELS In its first major trade decision of the year, the administration slapped steep tariffs on imported washing machines and solar panels, boosting Whirlpool Corp and dealing a setback to the renewable energy industry.\nMonday’s decision imposes a 20 percent tariff on the first 1.2 million imported large residential washers in the first year, and a 50 percent tariff on machines above that number. The tariff declines to 16 percent and 40 percent respectively in the third year.\nThe move punishes Samsung Electronics, which recently began washer production in South Carolina, and LG Electronics, which is building a plant in Tennessee.\nThe U.S. Solar Energy Industries Association on Tuesday warned that Trump’s move to slap 30 percent tariffs on imported panels will kill tens of thousands of jobs, raise the cost of going solar and quash billions of dollars of investment.\nSouth Korea could push back by launching a complaint through the Geneva-based World Trade Organization, but that is likely to take years. Seoul could also raise it during current negotiations with the United States on modifying the U.S.-South Korea free trade agreement, known as KORUS.\nSTEEL The U.S. Commerce Department sent its recommendations on ways to curb foreign steel imports to the White House on Jan. 11. The report follows a decision by U.S. President Donald Trump to open a “Section 232” investigation into whether steel imports threaten U.S. national security several months after he took office.\nTrump has 90 days to decide on any potential action. He has promised that any actions will protect steelworkers from imports. Curbing excess steel production in China, which now supplies half of the world’s steel, would be a key goal of any action. Broad tariffs could however also impact steelmakers in Europe, Japan, South Korea and Turkey.\nIt is unclear when the decision on steel imports will be announced.\nALUMINUM The U.S. Commerce Department has sent Trump the results of its national security investigation into aluminum imports. The so-called “Section 232” probe could see broad import restrictions imposed on lightweight metal. The White House has been debating whether to order broad tariffs or quotas on steel and aluminum, pitting administration officials who favor aggressive restrictions against those who favor a more cautious approach to avoid a run-up in prices.\nIt is unclear when Trump will make his decision.\nINTELLECTUAL PROPERTY Trump and his trade advisers are currently considering penalizing China under Section 301 of the 1974 trade law for its alleged theft of American intellectual property.\nThe 301 investigation would allow Trump to impose retaliatory tariffs on Chinese goods or other trade sanctions until China changes its policies.\nTrump told Reuters in an interview on Jan. 17 he was considering imposing a big “fine” against China but he did not elaborate on his answer.\nU.S. businesses say they lose hundreds of billions of dollars in technology and millions of jobs to Chinese firms which have stolen ideas and software or forced them to turn over intellectual property as part of doing business in China.\nA White House official told Reuters Jan. 19 that Trump was particularly focused on the 301 investigation because it was “systemic” and covered a large swath of American businesses.\nChina could retaliate by weighing whether the actions are in line with WTO rules while reacting up pressure on U.S. businesses, for example by buying from a European company such as Airbus instead of Boeing.\nReporting by Lesley Wroughton; Editing by Cynthia Osterman\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T05:51:00.000+02:00", "crawled": "2018-01-24T15:19:04.011+02:00", "highlightTitle": ""}