{"organizations": [], "uuid": "c2ecd55595385e612aba43e9cd303e9bcf1b5c9b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-vegalab-exercises-option-to-buy-the-agronomy-group-llc.html", "country": "US", "domain_rank": 767, "title": "Vegalab Exercises Option to Buy The Agronomy Group, LLC", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.112, "site_type": "news", "published": "2018-01-17T16:20:00.000+02:00", "replies_count": 0, "uuid": "c2ecd55595385e612aba43e9cd303e9bcf1b5c9b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-vegalab-exercises-option-to-buy-the-agronomy-group-llc.html", "ord_in_thread": 0, "title": "Vegalab Exercises Option to Buy The Agronomy Group, LLC", "locations": [], "entities": {"persons": [{"name": "janu", "sentiment": "negative"}, {"name": "david selakovic", "sentiment": "none"}, {"name": "vegalab", "sentiment": "none"}], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "vegalab us", "sentiment": "none"}, {"name": "llc palm beach", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "tulare county", "sentiment": "none"}, {"name": "vegalab", "sentiment": "none"}], "organizations": [{"name": "agronomy group", "sentiment": "negative"}, {"name": "sec", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "vegalab inc.", "sentiment": "none"}, {"name": "the agronomy group", "sentiment": "none"}, {"name": "vegalab", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PALM BEACH, Fla., Jan. 17, 2018 /PRNewswire/ -- Vegalab US (\"the Company\"), (OTCQB: VEGL) -- On January 4, 2018, the Company reported in a filing with the SEC that it exercised an option to acquire the The Agronomy Group, LLC. The Agronomy Group (TAG), located in Tulare County, California (the \"Business\"), is both a producer and distributor of environmentally friendly agrochemicals. TAG is Vegalab's top U.S. sales organization for Vegalab products, so the acquisition allows the Company to expand its internal marketing capability. TAG also distributes other products, so the acquisition increases our range of product offerings. The purchase price for TAG is payable by the delivery of: 600,000 shares of the restricted common stock of Vegalab; and a warrant to purchase 1,600,000 shares of the restricted common stock of Vegalab at an exercise price of $1.20 per share exercisable over a term of five years.\nDavid Selakovic, CEO of Vegalab Inc., said, \"Vegalab's upcoming acquisition of The Agronomy Group is very strategic and will bring us direct access to distribution channels in California, through distributors like Winfield United, Buttonwillow Warehouse and Mid Valley Ag Services. It also broadens our line of products with 29 new products. TAG has 10 products that are considered organic, with 9 OMRI registered and 1 WSDA approved for use in organic agriculture. TAG follows Vegalab's philosophy of delivering environmentally friendly, natural products for sustainable, large scale growing in the big agricultural environment. TAG will also benefit from Vegalab's research and manufacturing capabilities, which will reduce costs on the products they manufacture, including significant cost savings on their flagship product Bactor Boost™. We are excited about all of TAG's products and believe many will be star Vegalab products. Currently TAG's most notable product is the original, Earth friendly Bactor Boost™ formulation and its organic version, which have proven to generate higher yields.\"\nThe Agronomy Group co-founder J. Hill stated, \"We are excited to be joining the Vegalab family, as we feel that the overall impact across the U.S. and internationally will be broadened by the products that both companies bring together. The vision and ideals behind Vegalab of taking care of the environment with Earth friendly products and helping growers exceed expected yield and crop quality are values that we have always embraced at TAG. We look forward to working with Vegalab and promoting these values within the marketplace for many years to come. The acquisition and formation of both companies into one, under the Vegalab brand, broadens the scope of products and increases the visibility of the company as a whole. The addition of the irrigation maintenance lines and Bactor Boost™ brings an immediate impact, both to the Vegalab bottom-line and its national market penetration.\"\nUnder the terms of the option to purchase exercised by Vegalab, the closing is required within 15 business days, which is on or before January 22, 2018. Closing is subject to the negotiation, execution, and delivery of definitive transaction documents, so the acquisition will not be completed unless and until that is accomplished.\nAbout Vegalab, Inc.\nVegalab, Inc. is the exclusive distributor in North and South America of a line of all-natural, biologically derived pesticides, fertilizers, and specialty agricultural products. Vegalab's pesticides are highly effective against targeted organisms, non-toxic to beneficial organisms, and safe for the environment. Vegalab products support a healthy soil biome and are cost competitive with synthetic chemicals that do just the opposite.\nSafe Harbor for Forward-looking Statements\nThis news release may contain forward-looking statements that are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. While these statements are made to convey to the public the company's progress, business opportunities, and growth prospects, they are based on management's current beliefs and assumptions as to future events. However, since the company's operations and business prospects are always subject to risk and uncertainties, the forward-looking events and circumstances discussed in this news release might not occur, and actual results could differ materially from those described, anticipated, or implied. For a more complete discussion of such risks and uncertainties, please refer to the company's filings with the Securities and Exchange Commission.\nContact:\nSean Leous\nMedia Relations\nVegalab Inc\n636 US Highway 1, suite 110\nNorth Palm Beach, FL 33408, US\nT + 800 208 1680 ext 714\n188906@email4pr.com\nhttp://vegalab.us\nView original content: http://www.prnewswire.com/news-releases/vegalab-exercises-option-to-buy-the-agronomy-group-llc-300583852.html\nSOURCE Vegalab", "external_links": ["http://www.prnewswire.com/news-releases/vegalab-exercises-option-to-buy-the-agronomy-group-llc-300583852.html", "http://vegalab.us/"], "published": "2018-01-17T16:20:00.000+02:00", "crawled": "2018-01-17T16:49:41.024+02:00", "highlightTitle": ""}