{"organizations": [], "uuid": "fe08a28ad79ee322b61a45563af3e40f1d996e73", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 20, "shares": 20, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/17/104659275-IMG_5373-jim-cramer.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/16/cramer-remix-buybacks-should-calm-fears-of-a-major-market-decline.html", "country": "US", "domain_rank": 767, "title": "Cramer Remix: Buybacks should calm fears of a major market decline", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.11, "site_type": "news", "published": "2018-01-17T01:59:00.000+02:00", "replies_count": 0, "uuid": "fe08a28ad79ee322b61a45563af3e40f1d996e73"}, "author": "Elizabeth Gurdus", "url": "https://www.cnbc.com/2018/01/16/cramer-remix-buybacks-should-calm-fears-of-a-major-market-decline.html", "ord_in_thread": 0, "title": "Cramer Remix: Buybacks should calm fears of a major market decline", "locations": [], "entities": {"persons": [{"name": "cramer", "sentiment": "negative"}, {"name": "jim cramer", "sentiment": "none"}], "locations": [{"name": "america", "sentiment": "none"}], "organizations": [{"name": "citigroup", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "saudi aramco", "sentiment": "none"}, {"name": "j.p. morgan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The worst intra-day market reversal in nearly a year might've spooked investors, but CNBC's Jim Cramer argued that the market still has a major driver in its metaphorical back pocket.\n\"I'm talking about the ongoing stock shortage,\" the \"Mad Money\" host said. \"The shortage is so real, so palpable, that I think it could become a major theme as earnings season progresses.\"\nWhy? Cramer pointed to the trend of share repurchases, or stock buybacks, emerging among major companies like J.P. Morgan and Citigroup .\nAs they buy back millions, if not billions, of their shares, their supply of stock grows tighter — hence the shortage — and their shareholders usually benefit.\n\"The only way to offset the stock shortage? Well, we'd need to see some gigantic IPOs for companies like Airbnb or Uber or Spotify, or something like that trillion-dollar Saudi Aramco deal that will definitely sop up some cash,\" Cramer said. \"Still, even if we get a wave of new deals here in America, it will be a drop in the bucket compared to the pace of these buybacks. The stock shortage, it's the greatest story never told.\"\nRules of engagement Gari Garaialde | Getty Images Revellers run with Nunez del Cuvillo's fighting bulls during the eighth day of the San Fermin Running of the Bulls festival on July 13, 2017 in Pamplona, Spain. Even after Tuesday's massive stock market reversal — the biggest in roughly 10 months — Cramer maintained that he liked the market.\nBut the \"Mad Money\" host acknowledged that there are \" rules of engagement for dealing with a bull market that's in beast mode,\" so he wanted to highlight those for investors.\nCramer's No. 1 rule is one of his most common sayings: no one ever got hurt taking a profit.\nIn a rallying market like this one, investors tend to forget that their gains aren't really winnings until they ring the register. That can burn them when the market takes a hit.\nJP Morgan Healthcare Conference: Winners and losers Assembly | Getty Images Of all the major conferences that kicked off 2018 — from the ICR confab to the tech-laden CES — the J.P. Morgan Healthcare Conference was the most important for Cramer.\n\"This meeting tends to make major waves in the health care stocks,\" he said. \"The problem is the announcements from these pharma and biotech companies often read like they're written in hieroglyphics. It can be very difficult to understand this stuff without a medical degree or a PhD in chemistry.\"\nSo, to help investors make sense of what often proves to be a groundbreaking event, Cramer went through the biggest winners and losers from J.P. Morgan's San Francisco, California-based health care convention.\nOff the charts: AMZN, GOOGL, NFLX and NVDA Akio Kon | Bloomberg | Getty Images Reed Hastings, chief executive officer of Netflix. As the bank- and health-care-led market rally pushed the Dow Jones industrial average above the 26,000 level for the first time ever, Cramer wanted to check in with tech.\n\"You always need to be thinking about when it might be time to do a little register-ringing,\" Cramer said. \"I don't want to scare you away from stocks. Just the opposite — like I said, I like stocks. But if you're going to be a responsible investor, you need to be at least considerate of whether it's a good idea to maybe be a little cautious.\"\nThe stocks of Amazon , Alphabet , Netflix and Nvidia all made 52-week highs on Tuesday amid the surge, so Cramer enlisted technician Carolyn Boroden to determine if it was time for investors to take some profits off the table.\nBoroden, the brain behind FibonacciQueen.com and Cramer's colleague at RealMoney.com , said that with the four stocks nearing her price targets, now is the time to get careful .\nRe-rating Boeing: Safe flying or stormy weather ahead? \nStock market rallies tend to feed on themselves, and Cramer sees few places where that tendency is better exemplified than in the stock of aircraft manufacturer Boeing .\nAs the Dow's best 2017 performer continues its flight higher, analysts from nearly every key Wall Street research firm have been falling over themselves to up their estimates and price targets for its stock.\n\"I don't want to make it sound like these guys are just mindlessly chasing a stock because it's roaring here. They're absolutely right to like Boeing and absolutely right to recommend it. When you factor in the impact of tax reform, this company's going to be practically overflowing with cash,\" Cramer said.\nBut the \"Mad Money\" host also noticed that the relationship has become somewhat symbiotic. Analysts upgrade the stock; the stock subsequently goes higher.\n\"As long as there are stories like Boeing where the analysts are desperate to raise their price targets and push the stock higher, ... I think you've got a nice cushion that allows you to pick up these stocks into any weakness, even intraday,\" Cramer said. \"The analysts are like a coiled spring, giving you still one more reason to buy the stock of Boeing whenever you're lucky enough – and I mean that, lucky enough – to get a dip.\"\nLightning Round: Stay with STM, but don't buy... yet In Cramer's lightning round , he rattled off his take on some callers' favorite stocks:\nSTMicroelectronics : \"I like that stock very much. Now, let's remember, that group has gotten hot again and we're starting to circle back. We want to be careful because ASML , [which] reports later this week, could impact that stock.\"\nUniversal Display : \"We're having pullbacks in these high-multiple, high-growth stocks, so now you have to wait for the pullback in OLED. It's had a big move. We can wait for a pullback. We do not need to just plunge in. There's nothing today that is moving it.\"\nDisclosure: Cramer's charitable trust owns shares of J.P. Morgan, Citigroup, Alphabet and Nvidia. \n ", "external_links": [], "published": "2018-01-17T01:59:00.000+02:00", "crawled": "2018-01-17T02:03:42.058+02:00", "highlightTitle": ""}