{"organizations": [], "uuid": "9bc4b14df5291730f91a6d362ec6f6752acecd6a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1224986045&w=1200&r=LYNXMPEE0O01U", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-global-markets/asia-shares-near-record-peak-but-trade-protectionist-fears-cast-shadow-idUKKBN1FE04B", "country": "US", "domain_rank": 408, "title": "Asia shares near record peak but trade protectionist fears cast shadow", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T03:24:00.000+02:00", "replies_count": 0, "uuid": "9bc4b14df5291730f91a6d362ec6f6752acecd6a"}, "author": "", "url": "https://uk.reuters.com/article/uk-global-markets/asia-shares-near-record-peak-but-trade-protectionist-fears-cast-shadow-idUKKBN1FE04B", "ord_in_thread": 0, "title": "Asia shares near record peak but trade protectionist fears cast shadow", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "wilbu", "sentiment": "none"}, {"name": "hideyuki sano", "sentiment": "none"}, {"name": "steven mnuchin", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "asia-pacific", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "msci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 1:25 AM / Updated an hour ago Asia shares near record peak but trade protectionist fears cast shadow Hideyuki Sano 4 Min Read \nTOKYO (Reuters) - Asian stocks held near a record high on Thursday though concerns about the Trump administration’s protectionist stance cast a shadow on financial markets, while the dollar struggled after U.S. Treasury Secretary Steven Mnuchin welcomed a weaker currency. \nMSCI’s broadest index of Asia-Pacific shares outside Japan .MIAPJ0000PUS was flat after hitting an all-time peak for the ninth session in a row. \nJapan's Nikkei .N225 fell 0.9 percent, hit by the dollar's decline against the yen. \nMSCI ACWI .MIWD PUS, the index provider’s broadest gauge of the world’s stock markets, boosted its gains for the month to 6.5 percent. It had registered declines only on two days this year amid optimism over an extended growth spurt in the global economy and solid earnings. \nA Reuters poll of over 500 economists showed the global economy is expected to grow at the fastest pace since 2010. \nThe upbeat mood, however, has come up against renewed fears of protectionism after U.S. President Donald Trump’s decision to impose steep import tariffs on washing machines and solar panels earlier in the week. \nU.S. Commerce Secretary Wilbur Ross, who attended the World Economic Forum in Davos, hinted at action against China, saying U.S. trade authorities were investigating whether there is a case for taking action over China’s infringements of intellectual property. \nTrump is scheduled to speak in Davos on Thursday. \nAlso in the Swiss Alpine town, Mnuchin made a major departure from traditional U.S. currency policy on Wednesday, saying “obviously a weaker dollar is good for us as it relates to trade and opportunities.” \nAnalysts say they cannot remember any U.S. Treasury Secretary openly embracing a cheaper dollar at least in the last two decades or so. \n“I was speculating the Trump administration may role out something with fanfare given its big delegation to Davos,” said Masayuki Kichikawa, chief macro strategist at Sumitomo Mitsui Asset Management. \n“I’d think the real aim of Mnuchin’s comments on the dollar is not so much engineering a weaker dollar per se as putting pressure on trading partners to do some trade deals with the administration,” he added. \nThe dollar’s index against a basket of six major currencies .DXY =USD tumbled to a three-year low of 88.946. \nThe euro EUR= rose to as high as $1.2439, a peak not scaled since December 2014, ahead of the European Central Bank's policy meeting later in the day. \nThe meeting comes against a backdrop of heightened speculation over when it will end its vast stimulus and signal a rise in interest rates from record lows. \nThe dollar slipped to 108.92 yen JPY= , its lowest levels since mid-September. \nThe Chinese yuan also strengthened, gaining 0.5 percent to 6.3280 yuan per dollar CNY=CFXS in onshore trade, hitting its highest level since November 2015. \nIt rose 2.7 percent so far this month. The gains, if sustained, would mark the biggest monthly rise ever. \nGold XAU= jumped past its September peak to 1-1/2-year high of $1,363.2 per ounce. A break above its July 2016 high around $1,375 would take it to a four-year high. \nOil prices rallied to three-year high, boosted by a record 10th straight weekly decline in U.S. crude inventories, though reduced refining activity and rising production signalled U.S. stocks could rise in coming weeks. \nInternational benchmark Brent futures LCOc1 were nudging $71 per barrel - $70.98 a barrel at 0232 GMT - a level not seen since early December 2014 and up 45 cents, or 0.6 percent, from their last close. Editing by Shri Navaratnam", "external_links": [], "published": "2018-01-25T03:24:00.000+02:00", "crawled": "2018-01-25T03:53:35.014+02:00", "highlightTitle": ""}