{"organizations": [], "uuid": "94484026039246dcd61839ad166ee42f35206f46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-destination-maternity-updates-on-ceo-transition-plan.html", "country": "US", "domain_rank": 767, "title": "Destination Maternity Updates on CEO Transition Plan", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T14:00:00.000+02:00", "replies_count": 0, "uuid": "94484026039246dcd61839ad166ee42f35206f46"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-destination-maternity-updates-on-ceo-transition-plan.html", "ord_in_thread": 0, "title": "Destination Maternity Updates on CEO Transition Plan", "locations": [], "entities": {"persons": [{"name": "weinstein", "sentiment": "none"}, {"name": "ronald j. masciantonio", "sentiment": "none"}, {"name": "shelley liebsch", "sentiment": "none"}, {"name": "david stern", "sentiment": "none"}, {"name": "allen weinstein", "sentiment": "none"}, {"name": "barry erdos", "sentiment": "none"}, {"name": "melissa payner-gregor", "sentiment": "none"}, {"name": "payner-gregor", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "moorestown", "sentiment": "none"}], "organizations": [{"name": "company", "sentiment": "none"}, {"name": "board", "sentiment": "none"}, {"name": "kirk palmer associates", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MOORESTOWN, N.J., Jan. 3, 2018 /PRNewswire/ -- Destination Maternity (NASDAQ: DEST) announced today the appointment of Melissa Payner-Gregor, an independent director of the Company, as Interim Chief Executive Officer, effective immediately. Ms. Payner-Gregor is succeeding Allen Weinstein, who had been serving in the role since September 2017. Mr. Weinstein has decided to retire from the Board for personal reasons, also effective immediately.\nThe Company also announced the establishment of an \"Office of the CEO\" which will be comprised of Ms. Payner-Gregor and each of the following reporting into Ms. Payner-Gregor: Ronald J. Masciantonio, the Company's Executive Vice President & Chief Administrative Officer, David Stern, the Company's Executive Vice President & Chief Financial Officer, and Shelley Liebsch, the Company's Senior Vice President of Merchandising and Design.\nThe Company also announced it is working with Kirk Palmer Associates in the ongoing search for a new permanent Chief Executive Officer.\nCommenting on behalf of the Board, Barry Erdos, Chairman of the Board, said, \"We are grateful to Allen for his service on our Board for the last seven plus years as well as his recent service as interim CEO and the progress that has been made. We are also appreciative of Melissa's willingness to lead the Company during this period of transition, and we are confident that she and our senior management team will continue our forward progress, as we to look for the right chief executive to lead Destination Maternity's next phase of growth.\"\nInterim CEO Melissa Payner-Gregor has served as a director of the Destination Maternity Board since August 2009. Ms. Payner-Gregor is currently working as a consultant for several retail/e-commerce companies. She served as an advisor to Bluefly Inc. in 2015, having previously served as the company's Chief Executive Officer from 2004 to 2012. In 2003 she was Bluefly's President. Prior to joining Bluefly, Ms. Payner-Gregor held senior management positions with prominent retailers and consumer products companies, including Chief Executive Officer and President of Spiegel Catalog and President of Chico's FAS.\nAbout Destination Maternity\nDestination Maternity Corporation is the world's largest designer and retailer of maternity apparel. As of October 28, 2017, Destination Maternity operates 1,147 retail locations in the United States, Canada and Puerto Rico, including 501 stores, predominantly under the trade names Motherhood Maternity®, A Pea in the Pod® and Destination Maternity®, and 646 leased department locations. The Company also sells merchandise on the web primarily through its brand-specific websites, motherhood.com and apeainthepod.com , as well as through its destinationmaternity.com website. Destination Maternity has international store franchise and product supply relationships in the Middle East, South Korea, Mexico, Israel and India. As of October 28, 2017, Destination Maternity has 208 international franchised locations, including 16 standalone stores operated under one of the Company's nameplates and 192 shop-in-shop locations.\nForward-Looking Statements\nThe Company cautions that any (as such term is defined in the Private Securities Litigation Reform Act of 1995) contained in this press release or made from time to time by management of the Company, including those regarding management changes and various business initiatives, involve risks and uncertainties, and are subject to change based on various important factors. The following factors, among others, in some cases have affected and in the future could affect the Company's financial performance and actual results and could cause actual results to differ expressed or implied in any such : the strength or weakness of the retail industry in general and of apparel purchases in particular, our ability to successfully manage our various business initiatives, the success of our international business and its expansion, our ability to successfully manage and retain our leased department and international franchise relationships and marketing partnerships, future sales trends in our various sales channels, unusual weather patterns, changes in consumer spending patterns, raw material price increases, overall economic conditions and other factors affecting consumer confidence, demographics and other macroeconomic factors that may impact the level of spending for apparel (such as fluctuations in pregnancy rates and birth rates), expense savings initiatives, our ability to anticipate and respond to fashion trends and consumer preferences, unanticipated fluctuations in our operating results, the impact of competition and fluctuations in the price, availability and quality of raw materials and contracted products, availability of suitable store locations, continued availability of capital and financing, our ability to hire, develop and retain senior management and sales associates, our ability to develop and source merchandise, our ability to receive production from foreign sources on a timely basis, our compliance with applicable financial and other covenants under our financing arrangements, potential debt prepayments, the trading liquidity of our common stock, changes in market interest rates, our compliance with certain tax incentive and abatement programs, war or acts of terrorism and other factors set forth in the Company's periodic filings with the U.S. Securities and Exchange Commission (the \"SEC\"), or in materials incorporated therein by reference. Although it is believed that the expectations reflected in such are reasonable, no assurance can be given that such expectations will prove to have been correct and persons reading this announcement are therefore cautioned not to place undue reliance on these which speak only as at the date of this announcement. The Company assumes no obligation to update or revise the information contained in this announcement (whether as a result of new information, future events or otherwise), except as required by applicable law.\nView original content: http://www.prnewswire.com/news-releases/destination-maternity-updates-on-ceo-transition-plan-300576422.html\nSOURCE Destination Maternity", "external_links": ["http://www.prnewswire.com/news-releases/destination-maternity-updates-on-ceo-transition-plan-300576422.html"], "published": "2018-01-03T14:00:00.000+02:00", "crawled": "2018-01-03T13:56:54.034+02:00", "highlightTitle": ""}