{"organizations": [], "uuid": "c5a2e93583b880b988e0a667b5a5af4b3cf0f010", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-healthsource-makes-healthy-additions.html", "country": "US", "domain_rank": 767, "title": "HealthSource Makes Healthy Additions", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.018, "site_type": "news", "published": "2018-01-25T18:30:00.000+02:00", "replies_count": 0, "uuid": "c5a2e93583b880b988e0a667b5a5af4b3cf0f010"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-healthsource-makes-healthy-additions.html", "ord_in_thread": 0, "title": "HealthSource Makes Healthy Additions", "locations": [], "entities": {"persons": [{"name": "kieran mccauley", "sentiment": "none"}, {"name": "ken belton", "sentiment": "none"}, {"name": "mccauley", "sentiment": "none"}], "locations": [{"name": "cleveland", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "belton", "sentiment": "none"}], "organizations": [{"name": "healthsource", "sentiment": "negative"}, {"name": "microsoft", "sentiment": "none"}, {"name": "field operations for mosaic sales solutions", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CLEVELAND, Jan. 25, 2018 /PRNewswire/ -- HealthSource, America's leading franchise group of chiropractic and holistic care clinics, is experiencing healthy new patient growth, with more consumers looking for non-surgical and non-prescription treatments for pain as a result of the opioid crisis. To manage this growth, the company has added two seasoned veterans to its executive team.\nKen Belton joins HealthSource as Vice President of Franchise Operations. Belton brings more than two decades of retail experience, working on such brands as T-Mobile, Borders and Blockbuster. He was also Director of Field Operations for Mosaic Sales Solutions, where he was responsible for sales training and merchandising for Microsoft at more than 5000 retail locations across the country. Most recently Belton worked in field operations for The Joint Chiropractic.\nAdditionally, Kieran McCauley was brought onboard as Vice President of Marketing. McCauley has earned a reputation for creating bold advertising campaigns, working on a long list of consumer and Fortune 500 brands, including White Castle, Hotels.com , Sherwin-Williams, Volvo and BP. He comes to HealthSource from Marco's Pizza, the country's fastest growing pizza concept.\nAccording to Bernie Brozek, Chief Operating Officer at HealthSource, the new additions will ensure the company continues on a steady growth path. \"I learned early in my career that you need great talent to run an exceptional company,\" said Brozek. \"The alternative health care industry has grown double digits over the past five years. This mirrors new patient growth at HealthSource clinics, which is also at double-digit levels. And the forecast over the next five years looks even stronger in the U.S. market.\"\nAbout HealthSource\nHealthSource, a national holistic care and chiropractic franchise, treats pain throughout the entire body, sciatica, fibromyalgia and other common concerns, and also focuses on pain prevention and nutrition. The company continually implements new treatments and medical advancements, staying on the cutting edge of medicine. HealthSource began franchising in 2006 and more than 250 domestic and international locations. For more information about HealthSource, visit www.healthsourcechiro.com .\nMedia Contact: Matt Siegler, Fishman Public Relations, msiegler@fishmanpr.com or 847-945-1300\nView original content: http://www.prnewswire.com/news-releases/healthsource-makes-healthy-additions-300588292.html\nSOURCE HealthSource", "external_links": ["http://www.healthsourcechiro.com/", "http://www.prnewswire.com/news-releases/healthsource-makes-healthy-additions-300588292.html"], "published": "2018-01-25T18:30:00.000+02:00", "crawled": "2018-01-25T20:49:17.000+02:00", "highlightTitle": ""}