{"organizations": [], "uuid": "4aa080456ff06880f2f60d815e6422ff7412caa6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-installed-building-products-announces-the-acquisition-of-rocket-insulation-coatings-inc.html", "country": "US", "domain_rank": 767, "title": "Installed Building Products Announces the Acquisition of Rocket Insulation & Coatings Inc.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.27, "site_type": "news", "published": "2018-01-17T00:05:00.000+02:00", "replies_count": 0, "uuid": "4aa080456ff06880f2f60d815e6422ff7412caa6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-installed-building-products-announces-the-acquisition-of-rocket-insulation-coatings-inc.html", "ord_in_thread": 0, "title": "Installed Building Products Announces the Acquisition of Rocket Insulation & Coatings Inc.", "locations": [], "entities": {"persons": [{"name": "jeff edwards", "sentiment": "none"}], "locations": [{"name": "columbus", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "long island", "sentiment": "none"}], "organizations": [{"name": "acquisition of rocket insulation & coatings inc.", "sentiment": "negative"}, {"name": "inc.", "sentiment": "none"}, {"name": "rocket insulation", "sentiment": "none"}, {"name": "ibp", "sentiment": "none"}, {"name": "rocket insulation & coatings inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "– Acquisition Adds $5.4 Million of Trailing-Twelve Month Revenue –\nCOLUMBUS, Ohio--(BUSINESS WIRE)-- Installed Building Products, Inc. (the “Company” or “IBP”) (NYSE:IBP), an industry-leading installer of insulation and complementary building products, announced today the acquisition of Rocket Insulation & Coatings Inc. Founded in 2009, Rocket Insulation serves the Long Island, New York market through one branch location. The company provides spray foam and fiberglass insulation installation services primarily for single-family residential customers.\n“With trailing-twelve month revenue of $5.4 million, Rocket Insulation expands our footprint to the Long Island market,” stated Jeff Edwards, Chairman and Chief Executive Officer. “Prior to this acquisition, IBP did not have a presence in Long Island, and we are excited to begin serving primarily single-family residential customers in this large market.”\nAbout Installed Building Products\nInstalled Building Products, Inc. is one of the nation's largest insulation installers for the residential new construction market and is also a diversified installer of complementary building products, including waterproofing, fire-stopping and fireproofing, garage doors, rain gutters, shower doors, closet shelving and mirrors, throughout the United States. The Company manages all aspects of the installation process for its customers, including direct purchases of materials from national manufacturers, supply of materials to job sites and quality installation. The Company offers its portfolio of services for new and existing single-family and multi-family residential and commercial building projects from its national network of branch locations.\nForward-Looking Statements\nThis press release contains forward-looking statements within the meaning of the federal securities laws, including with respect to the demand for our services and product offerings, expansion of our national footprint, our ability to capitalize on the new home construction recovery, our ability to strengthen our market position, our ability to pursue value-enhancing acquisitions and our ability to improve profitability. Forward-looking statements may generally be identified by the use of words such as \"anticipate,\" \"believe,\" \"expect,\" \"intends,\" \"plan,\" and \"will\" or, in each case, their negative, or other variations or comparable terminology. These forward-looking statements include all matters that are not historical facts. By their nature, forward-looking statements involve risks and uncertainties because they relate to events and depend on circumstances that may or may not occur in the future. Any forward-looking statements that we make herein and in any future reports and statements are not guarantees of future performance, and actual results may differ materially from those expressed in or suggested by such forward-looking statements as a result of various factors, including, without limitation, the factors discussed in the “Risk Factors” section of the Company’s Annual Report on Form 10-K for the year ended December 31, 2016, as the same may be updated from time to time in our subsequent filings with the Securities and Exchange Commission. Any forward-looking statement made by the Company in this press release speaks only as of the date hereof. New risks and uncertainties arise from time to time, and it is impossible for the Company to predict these events or how they may affect it. The Company has no obligation, and does not intend, to update any forward-looking statements after the date hereof, except as required by federal securities laws.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180116006198/en/\nInstalled Building Products, Inc.\nInvestor Relations: 614-221-9944\ninvestorrelations@installed.net\nSource: Installed Building Products, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180116006198/en/"], "published": "2018-01-17T00:05:00.000+02:00", "crawled": "2018-01-16T23:45:01.005+02:00", "highlightTitle": ""}