{"organizations": [], "uuid": "467aa7b84d1cb732bfa172e1495171fbff1d7f32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/france-business-tax/france-makes-a-new-push-to-tempt-bankers-to-paris-post-brexit-idUSL8N1PH5LC", "country": "US", "domain_rank": 408, "title": "France makes a new push to tempt bankers to Paris post-Brexit", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T20:01:00.000+02:00", "replies_count": 0, "uuid": "467aa7b84d1cb732bfa172e1495171fbff1d7f32"}, "author": "", "url": "https://www.reuters.com/article/france-business-tax/france-makes-a-new-push-to-tempt-bankers-to-paris-post-brexit-idUSL8N1PH5LC", "ord_in_thread": 0, "title": "France makes a new push to tempt bankers to Paris post-Brexit", "locations": [], "entities": {"persons": [{"name": "edouard philippe", "sentiment": "none"}, {"name": "emmanuel macron", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 6:02 PM / in 37 minutes France makes a new push to tempt bankers to Paris post-Brexit Reuters Staff 2 Min Read \nPARIS, Jan 22 (Reuters) - France’s prime minister on Monday renewed a push to tempt bankers to Paris after Britain leaves the European Union by pledging to temporarily exempt expats from paying into state pension schemes and making more places available in bilingual schools. \nFrance has already announced measures to cut labour costs to make Paris more attractive to the banking sector post-Brexit following the election of President Emmanuel Macron, who has made labour rules more flexible and cut wealth tax. \nNow EU expatriates in France will be able to opt out of compulsory contributions to the state pension scheme which make up about 2.3 percent of an employee’s gross salary. \nPrime Minister Edouard Philippe told investors that there would be 1,000 places available in the Paris region’s multilingual schools next September, while three new multilingual high schools would be created by 2021. \nFrance would also be ready to handle disputes over financial contracts governed by British law in March with new international sections at the Paris Commercial Court and the Paris Court of Appeal, Paris Europlace financial lobby said in a statement. \n“The Paris financial centre now has strong momentum to welcome companies and international investors and strengthen its leading position in post-Brexit Europe,” Gerard Mestrallet, the head of the Paris Europlace financial lobby said in a statement. \nThe announcement came at a highly-publicised summit on Monday of global CEOs - including Goldman Sachs’s Lloyd Blankfein and JP Morgan’s Jamie Dimon - in Versailles, where the prime minister explained French reforms, in English, over lunch. \nMacron is expected to join the more than 140 CEOs in the evening, after unveiling a 300 million euro investment by Japanese carmaker Toyota in northern France. (Reporting by Jean-Baptiste Vey and Maya Nikolaeva; editing by Richard Balmforth)", "external_links": [], "published": "2018-01-22T20:01:00.000+02:00", "crawled": "2018-01-22T20:20:26.038+02:00", "highlightTitle": ""}