{"organizations": [], "uuid": "f662a86b7481a4c85910093f83b8411b5a8830ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-pnfp-reports-diluted-earnings-per-share-of-0-point-35-for-4q-2017.html", "country": "US", "domain_rank": 767, "title": "PNFP Reports Diluted Earnings Per Share of $0.35 for 4Q 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T01:15:00.000+02:00", "replies_count": 0, "uuid": "f662a86b7481a4c85910093f83b8411b5a8830ef"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-pnfp-reports-diluted-earnings-per-share-of-0-point-35-for-4q-2017.html", "ord_in_thread": 0, "title": "PNFP Reports Diluted Earnings Per Share of $0.35 for 4Q 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "tenn.", "sentiment": "none"}, {"name": "nashville", "sentiment": "none"}], "organizations": [{"name": "pinnacle financial partners, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Excluding merger-related charges, deferred tax revaluation and investment securities losses, diluted EPS was $0.97 for 4Q 2017\nNASHVILLE, Tenn.--(BUSINESS WIRE)-- Pinnacle Financial Partners, Inc. (Nasdaq/NGS: PNFP) reported net income per diluted common share of $0.35 for the quarter ended Dec. 31, 2017, compared to net income per diluted common share of $0.78 for the quarter ended Dec. 31, 2016, a decrease of 55.1 percent. Net income per diluted common share was $2.70 for the year ended Dec. 31, 2017, compared to net income per diluted common share of $2.91 for the year ended Dec. 31, 2016, a decrease of 7.2 percent.\nThere were several items negatively impacting the firm's most recent quarterly and annual results for 2017 including:\nPre-tax merger-related charges of $19.1 million and $31.8 million for the three months and year ended Dec. 31, 2017, Pre-tax investment securities losses of $8.3 million for the three months and year ended Dec. 31, 2017 and After-tax charges related to the revaluation of the firm’s deferred tax assets of $31.5 million for the three months and year ended Dec. 31, 2017.\nExcluding the above items, net income per diluted common share was $0.97 and $3.57 for the three months and year ended Dec. 31, 2017, respectively, compared to net income per diluted common share of $0.83 and $3.07 for the three months and year ended Dec. 31, 2016, excluding pre-tax merger-related charges of $3.3 million and $11.7 million, respectively. As a result, net income per diluted common share excluding the above items increased:\n16.9 percent in the three months ended Dec. 31, 2017, compared to the three months ended Dec. 31, 2016 and, 16.3 percent for the year ended Dec. 31, 2017, compared to the year ended Dec. 31, 2016.\n\"With asset growth of 98.4 percent, revenue growth of 54.3 percent, adjusted fully-diluted earnings per share growth of 16.3 percent and tangible book value per share growth of 18.2 percent, 2017 was likely our best year yet,\" said M. Terry Turner, Pinnacle's president and chief executive officer. \"During 2017, we announced and closed our merger with BNC Bancorp (BNC), that expanded our high-growth franchise to what we believe are the best banking markets in the Carolinas. I could not be prouder of our associates for their tireless efforts to create what I believe is one of the country’s most dynamic regional banking franchises.\n\"I am particularly excited about our continued growth prospects heading into 2018,\" Turner said. \"We have now completed the BNC brand and technology integrations and are well on our way to a common culture across our four-state footprint. BNC was a double-digit asset grower and remains very strong in the commercial real estate segment. Our strategy has been to continue to support BNC’s high growth commercial real estate practice while further accelerating overall growth rates with the build out of a large commercial and industrial lending practice. In addition to our ongoing hiring in our Tennessee footprint, we have previously disclosed our intent to hire 64 financial advisors in the Carolinas and Virginia over a five-year period. We are excited that hiring has been on that pace, even during this period of transition.\"\nGROWING THE CORE EARNINGS CAPACITY OF THE FIRM:\nRevenues for the quarter ended Dec. 31, 2017 were $211.2 million, an increase of $91.1 million, or 75.8 percent, from the quarter ended Dec. 31, 2016 and a decrease of $5.0 million from the $216.2 million recognized in the third quarter of 2017. Excluding investment securities losses, revenues for the quarter ended Dec. 31, 2017 were $219.5 million. Revenue per fully-diluted share was $2.73 for the three months ended Dec. 31, 2017, compared to $2.80 for the third quarter of 2017 and $2.61 for the fourth quarter of 2016. Excluding investment securities losses, revenue per fully-diluted share was $2.83 for the three months ended Dec. 31, 2017. Loans at Dec. 31, 2017 were a record $15.63 billion, an increase of $373.3 million from Sept. 30, 2017 and $7.18 billion from Dec. 31, 2016, reflecting year-over-year growth of 85.0 percent. Deposits at Dec. 31, 2017 were a record $16.45 billion, an increase of $662.1 million from Sept. 30, 2017 and $7.69 billion from Dec. 31, 2016, reflecting year-over-year growth of 87.8 percent.\n\"We are excited to report $373.3 million in organic loan growth during the fourth quarter of 2017, or a 9.7 percent annualized rate of growth,\" Turner said. \"Including net loan growth for BNC in 2017 prior to our merger, organic loan growth for our combined franchise amounted to $1.73 billion for 2017, representing approximately 12.4 percent growth for this year. Concurrently, we delivered strong earnings growth and impressive profitability metrics. We also added 77 revenue producers to our ranks in 2017, with 27 of these in the Carolinas and Virginia, including 13 hired since we closed our merger with BNC. We spend a lot of time talking about the Carolinas and Virginia, but our Tennessee associates produced record levels of loan and deposit growth in 2017. Loans grew $1.42 billion, or 16.8 percent, while core deposits grew $1.68 billion, or 21.5 percent, in our Tennessee markets in 2017, reflecting tremendous marketing momentum even during a period of significant transition.\"\nFOCUSING ON PROFITABILITY:\nReturn on average assets was 0.48 percent for the fourth quarter of 2017, compared to 1.21 percent for the third quarter of 2017 and 1.30 percent for the fourth quarter last year. Fourth quarter 2017 return on average tangible assets amounted to 0.53 percent, compared to 1.32 percent for the third quarter of 2017 and 1.36 percent for the same quarter last year. Excluding the aforementioned merger-related charges, investment securities losses and the revaluation of deferred tax assets, return on average assets was 1.36 percent for the fourth quarter of 2017, compared to 1.31 percent for the third quarter of 2017 and 1.36 percent for the fourth quarter of 2016. Additionally, excluding the aforementioned merger-related charges, investment securities losses and the revaluation of deferred tax assets, return on average tangible assets was 1.48 percent for the fourth quarter of 2017, compared to 1.43 percent for the third quarter of 2017 and 1.44 percent for the fourth quarter of 2016, respectively. Return on average equity for the fourth quarter of 2017 amounted to 2.87 percent, compared to 6.99 percent for the third quarter of 2017 and 9.61 percent for the same quarter last year. Fourth quarter 2017 return on average tangible equity amounted to 5.76 percent, compared to 14.25 percent for the third quarter of 2017 and 15.49 percent for the same quarter last year. Excluding the aforementioned merger-related charges, investment securities losses and the revaluation of deferred tax assets, return on average tangible equity amounted to 16.11 percent for the fourth quarter of 2017, compared to 15.43 percent for the third quarter of 2017 and 16.24 percent for the fourth quarter of 2016.\n\"Several years ago we", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.pnfp.com&esheet=51744042&newsitemid=20180116006741&lan=en-US&anchor=www.pnfp.com&index=3&md5=a9e0d6bfa28ce5ec9503938231409993", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.pnfp.com&esheet=51744042&newsitemid=20180116006741&lan=en-US&anchor=www.pnfp.com&index=1&md5=ee9d8297ec92aafc0393b2a3425eb1dd", "http://www.businesswire.com/news/home/20180116006741/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.pnfp.com&esheet=51744042&newsitemid=20180116006741&lan=en-US&anchor=www.pnfp.com&index=2&md5=60b116ed7f817efd0eda81bcdce3e256", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.pnfp.com&esheet=51744042&lan=en-US&anchor=www.pnfp.com&index=5&md5=963810c873dd728c2a2b9b0af6d88afc", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51744042&newsitemid=20180116006741&lan=en-US&anchor=http%3A%2F%2Fwww.sec.gov&index=4&md5=51325f63dfc7ec427b6155e3fbe41fe7"], "published": "2018-01-17T01:15:00.000+02:00", "crawled": "2018-01-17T03:12:14.000+02:00", "highlightTitle": ""}