{"organizations": [], "uuid": "dab987a68c1b08e346756dbb1746147556bb72d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-metrospaces-announces-filing-of-etelix-acquisition-8k-with-audited-financials-up-to-september-30th-2017.html", "country": "US", "domain_rank": 767, "title": "Metrospaces Filing of Etelix Acquisition 8K With Audited Financials Up to September 30th, 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T17:15:00.000+02:00", "replies_count": 0, "uuid": "dab987a68c1b08e346756dbb1746147556bb72d0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-metrospaces-announces-filing-of-etelix-acquisition-8k-with-audited-financials-up-to-september-30th-2017.html", "ord_in_thread": 0, "title": "Metrospaces Filing of Etelix Acquisition 8K With Audited Financials Up to September 30th, 2017", "locations": [], "entities": {"persons": [{"name": "brito", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "ny", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "metrospaces filing of etelix acquisition", "sentiment": "negative"}, {"name": "metrospaces, inc.", "sentiment": "neutral"}, {"name": "ebitda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, NY, Jan. 26, 2018 (GLOBE NEWSWIRE) -- Metrospaces, Inc. (OTC: MSPC) announces the filling of Etelix acquisition 8K and adjusted-end revenue of $7,802,340.\nMr. Brito stated: “On January 25th, 2017 we filed an 8K regarding the material acquisition of 51% of the capital stock of Etelix USA.com (see: http://bit.ly/2DGU7Ur ). Audited financials reflect revenue of $5,674,585 as of September 30th, 2017. This represents a YOY increase of 89%. Additionally, EBITDA was $22.802 for the same period. EBITDA margin reflects increased investment in the new Spain office as well as new hiring needed to increase revenue and client support. Total YE revenue was adjusted to $7,802,340 from the previously announced $7,697,376 in January of 2017. This adjustment was due to a series of invoices closed in the last few weeks of December that had previously not been accounted for. We expect to have audited full year Etelix financials within the coming days. Year-end EBITDA was $164.348, increasing margin considerably from 3rd quarter due to the fact that most of our capex in implementing the new Spain office was booked in the 2nd and 3rd quarter. Year-end revenue growth was approximately 95% surpassing our estimates of revenue growth of 65% set at the beginning of 2017. Needless to say, we are very pleased, and excited about 2017 financials and at how we see this coming year unfolding. Certainly, Etelix is an acquisition that has created a lot of shareholder value; however, we estimate that we are only at the very beginning stages of its growth.”\nAbout Etelix.com USA, LLC\nEtelix.com USA ( http://www.etelix.com/ ) is a Miami-based, FCC-licensed voice, SMS and data/hosting operator. The company’s main products and services are international voice wholesale, data and hosting services as well as residential and commercial triple-play provider. The company was founded in 2007 and has been profitable since inception.\nAbout Metrospaces\nMetrospaces www.metrospaces.net is a publicly traded real estate investment and Development Company which acquires land, designs, builds, and develops then resells condominiums and Luxury High-End Hotels, principally in urban areas of Latin America. The company’s current projects are located in Buenos Aires, Argentina and Miami, USA. It is operated by an elite group of real estate and investment professionals and entrepreneurs located in New York City, Miami and Buenos Aires. Company shareholders have extensive careers in real estate and business financing worldwide, and have funded projects both in the America’s and across Europe valued in excess of US $550Million.\nMetrospaces’ majority shareholders has partnered with Investors on Elite properties including The London BLVGARI 5 Star Hotel, and is currently involved in negotiations for the development of several Elite luxury properties in South America.\nAmong Metrospace partners are Architects, Real Estate Developers, Agents and Attorneys of the highest standing, with extensive experience in the global property market.\nMetrospaces was originally founded by company President Oscar Brito.\nRelevant Links:\nhttp://metrospaces.net/\nSafe Harbor Statement:\nStatements in this news release may be “forward-looking statements”. Forward-looking statements include, but are not limited to, statements that express our intentions, beliefs, expectations, strategies, predictions or any other statements relating to our future activities or other future events or conditions. These statements are based on current expectations, estimates and projections about our business based, in part, on assumptions made by management. These statements are not guarantees of future performance and involve risks, uncertainties and assumptions that are difficult to predict. Therefore, actual outcomes and results may, and are likely to, differ materially from what is expressed or forecasted in forward-looking statements due to numerous factors. Any forward-looking statements speak only as of the date of this news release and Metrospaces Inc. undertakes no obligation to update any forward-looking statement to reflect events or circumstances after the date of this news release.\nCompany Contact: Tel: 305-600-0407 Investor Relations: investors@metrospaces.net\nSource:Metrospaces, Inc.", "external_links": ["http://metrospaces.net/", "http://bit.ly/2DGU7Ur", "http://www.etelix.com/", "https://www.globenewswire.com/Tracker?data=CaGSQ0jCiDk0f14zWwtUuyTIOdA8UCUnK9_Ju9O15Irw1wpEMtEC85vStFA4ms8vHakw9uN5QuO3GsfaV-eOn1cPi6DuxqYE1Ndq_nerajM=", "https://www.globenewswire.com/Tracker?data=UcMixrGnlOgj27-C6jalDipjFMxpoSOub5rMBson6Uyx2SpOaGfHBwSu1rHKD9rqxMNhwEIsYT36B9IOiKL4RL51UMKoMOUpTfvN_7K8PQI=", "https://www.globenewswire.com/Tracker?data=UcMixrGnlOgj27-C6jalDieDq2KsKGLtFmBOHp4wY7_TztsC8_b3CYZVC-RBVaUOS4_RdAQ6qPR7fZzpHVgRuD-YIrg1-wq2hAh5fHcvH7U=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/ac4fee78-7fdf-45e4-9763-221f54000f10"], "published": "2018-01-26T17:15:00.000+02:00", "crawled": "2018-01-26T18:00:05.008+02:00", "highlightTitle": ""}