{"organizations": [], "uuid": "9994f25e5e14269959764a19424f45a9df69beee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180129.html", "section_title": "Archive News &amp; Video for Monday, 29 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/cameroon-separatists-nigeria/update-2-cameroonian-separatist-leader-is-deported-to-cameroon-from-nigeria-idUSL8N1PO5PN", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Cameroonian separatist leader is deported to Cameroon from Nigeria", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T03:18:00.000+02:00", "replies_count": 0, "uuid": "9994f25e5e14269959764a19424f45a9df69beee"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/cameroon-separatists-nigeria/update-2-cameroonian-separatist-leader-is-deported-to-cameroon-from-nigeria-idUSL8N1PO5PN", "ord_in_thread": 0, "title": "UPDATE 2-Cameroonian separatist leader is deported to Cameroon from Nigeria", "locations": [], "entities": {"persons": [{"name": "edward mcallister abuja/dakar", "sentiment": "negative"}, {"name": "paul carsten", "sentiment": "negative"}, {"name": "issa tchiroma bakary", "sentiment": "none"}, {"name": "abdul oroh", "sentiment": "none"}, {"name": "ayuk tabe", "sentiment": "none"}, {"name": "julius ayuk tabe", "sentiment": "none"}], "locations": [{"name": "cameroon", "sentiment": "none"}, {"name": "nigeria", "sentiment": "none"}, {"name": "yaounde", "sentiment": "none"}, {"name": "ambazonia", "sentiment": "none"}, {"name": "abuja", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds Cameroon govt confirmation)\nBy Paul Carsten and Edward McAllister\nABUJA/DAKAR, Jan 29 (Reuters) - A key Cameroonian separatist leader arrested in Abuja earlier this month has been deported by Nigerian authorities to Cameroon, his lawyer and the government in Yaounde said on Monday.\nNigerian authorities on Friday deported Julius Ayuk Tabe, president of a self-declared breakaway state made up of the Anglophone regions of majority-Francophone Cameroon, said his Nigerian lawyer Abdul Oroh.\nHis deportation marks an escalation in Cameroon’s fight against the separatists who have taken up arms over the past year in their bid to create a nation which they call Ambazonia.\n“A group of 47 terrorists, among them Mr. Ayuk Tabe, has for some hours been in the hands of Cameroonian justice, before which they will answer for their crimes,” Communications Minister Issa Tchiroma Bakary said in a statement.\nThe Ambazonian movement has gathered widespread support due to a government crackdown on peaceful protests by Anglophones who complain of being marginalized by the French majority.\nNigeria and Cameroon are increasingly coordinating efforts to deal jointly with the growing insurgency that Yaounde has struggled to contain - in part because most of the leading actors are orchestrating events from abroad.\nThe countries had previously been at loggerheads over the latter’s violent crackdown on the separatist movement, which has sent tens of thousands of refugees flooding across the border into its neighbour.\nIn his statement, Cameroon’s communications minister praised his government’s cooperation with Nigeria, adding that the two countries “will never tolerate their respective territories serving as a base for activities that destabilise one or the other.”\nAyuk, a former businessman who had lived in Nigeria, is seen as a moderate voice in the separatist movement and has in the past promoted dialogue over violence.\nNevertheless, he has been the target of Cameroonian authorities as a leading member of a resurgent movement to break away from French-speaking Cameroon.\nIn December, his family home in Anglophone Cameroon was surrounded by government troops, he told Reuters at the time from Nigeria.\n“If you can kidnap someone like Ayuk, who wanted meaningful dialogue, who will you be able to speak to?” said Cho Ayaba, head of the Ambazonian Governing Council, a separatist body established to create an independent state called Ambazonia.\n“This is an intolerable act. Now we have no choice but to defend our homeland.” (Reporting by Paul Carsten in Abuja, Edward McAllister in Dakar and Josiane Kouagheu in Douala; Editing by Matthew Mpoke Bigg)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T03:18:00.000+02:00", "crawled": "2018-01-30T19:11:39.025+02:00", "highlightTitle": ""}