{"organizations": [], "uuid": "27e986279211e5cbf7bddf3552640d1e7736d51e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/03/31/104377728-GettyImages-121376534.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/china-globalism-with-chinese-characteristics-on-display-in-davos.html", "country": "US", "domain_rank": 767, "title": "China: Globalism with Chinese characteristics on display in Davos", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.216, "site_type": "news", "published": "2018-01-26T10:35:00.000+02:00", "replies_count": 0, "uuid": "27e986279211e5cbf7bddf3552640d1e7736d51e"}, "author": "Yen Nee Lee", "url": "https://www.cnbc.com/2018/01/26/china-globalism-with-chinese-characteristics-on-display-in-davos.html", "ord_in_thread": 0, "title": "China: Globalism with Chinese characteristics on display in Davos", "locations": [], "entities": {"persons": [{"name": "xi jinping", "sentiment": "none"}, {"name": "tom rafferty", "sentiment": "none"}, {"name": "liu he", "sentiment": "none"}, {"name": "scott kennedy", "sentiment": "none"}, {"name": "xi jingping", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "economist intelligence unit", "sentiment": "none"}, {"name": "caixin global", "sentiment": "none"}, {"name": "center for strategic and international studies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Getty Images President Xi Jingping. \nPresident Xi Jinping wasn't present at this year's World Economic Forum meeting in Davos, Switzerland , but the impact of his speech championing globalization at last year's gathering lingered. \nXi's right hand man, Liu He, took to the stage in the snow-capped Swiss town to reiterate claims about China's commitment to opening up further. Chinese business executives in attendance, such as Alibaba founder Jack Ma , also sang praises for trade and globalization . \n\"Such calls for globalism by China would have been unthinkable only 10 or 15 years ago, when Chinese firms were just beginning to explore the global marketplace,\" an opinion piece by Chinese media outlet Caixin Global said. \nEven as the world's second-largest economy has emerged as an advocate for free trade, China's vision for a globalized order is actually \"much more narrow\" than what the world is currently used to, according to Tom Rafferty, regional manager for China at the Economist Intelligence Unit. \nIt's all part of an ideology that Caixin deemed \"globalism with Chinese characteristics,\" and Rafferty said it means the Chinese government still wants significant control over what crosses its borders. \n\"It backs open goods trade, as this has been a primary driver of its own economic development, but believes strongly in its right to exercise significant levers of control over cross-border flows of direct investment, financial capital and people,\" he told CNBC over email. \nSuch \"deep government intervention\" is needed so that China can maintain stability at home and spread its international influence at the same time, Scott Kennedy, a deputy director at the Center for Strategic and International Studies, noted in a Twitter post in response to the Caixin article. Scott Kennedy on Twitter: Chinese at Davos \"giddy\" about \"globalism with Chinese characteristics.\" My translation: Illiberal system that encourages trade & investment coupled w/ deep govt intervention to serve industrial policy goals, ensure dom stability & greater intl influence \nA China that is insistent on its political and economic values would trigger a new world order, Yong Wang, a Peking University professor, said in a commentary. Already, foreign businesses have to bow to China's demands for political correctness, as evidenced by Marriott International's and Delta Air Lines' public apologies for listing Taiwan and Tibet as countries on their websites. \nAs more businesses look to be a part of the China story, the country's influence looks set to grow. It remains to be seen whether western nations — in particular the U.S. , which is used to making the rules in international relations — would get used to that shift in global power. \nWhether China would be as assertive in its dealings with its economic partners is worth watching too, said Rafferty. \n\"It will be interesting to see whether China applies the same logic in its economic relations,\" he said. \nDisclosure: CNBC has a content-sharing partnership with Caixin Global.", "external_links": [], "published": "2018-01-26T10:35:00.000+02:00", "crawled": "2018-01-26T10:35:02.017+02:00", "highlightTitle": ""}