{"organizations": [], "uuid": "cfa2b76ce6f40e5f9ea93fdfe04742b674adb725", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219311617&w=1200&r=LYNXMPEE030PP", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-britain-banks-pay/jpmorgan-goldman-sachs-come-top-of-banker-pay-league-in-britain-idUSKBN1ET1CN", "country": "US", "domain_rank": 408, "title": "JPMorgan, Goldman Sachs come top of banker pay league in Britain", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T14:40:00.000+02:00", "replies_count": 0, "uuid": "cfa2b76ce6f40e5f9ea93fdfe04742b674adb725"}, "author": "", "url": "https://www.reuters.com/article/us-britain-banks-pay/jpmorgan-goldman-sachs-come-top-of-banker-pay-league-in-britain-idUSKBN1ET1CN", "ord_in_thread": 0, "title": "JPMorgan, Goldman Sachs come top of banker pay league in Britain", "locations": [], "entities": {"persons": [{"name": "lawrence whit", "sentiment": "negative"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "jpmorgan", "sentiment": "negative"}, {"name": "goldman sachs", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "barclays", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "hsbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 12:41 PM / in 3 hours JPMorgan, Goldman Sachs come top of banker pay league in Britain Lawrence White 5 Min Read \nLONDON (Reuters) - JPMorgan ( JPM.N ) and Goldman Sachs ( GS.N ) paid their top bankers in Britain an average of $1.5 million each in 2016, compared with $1 million for local rivals HSBC ( HSBA.L ) and Barclays ( BARC.L ), data released by the banks last year shows. \nData compiled by Reuters from 13 banks’ filings, some of which were released only late last month, shows they paid an average of $1.06 million to such staff in 2016, down from $2 million for the year ended Dec. 31, 2013 when new European Union rules aimed at curbing banker bonuses took effect. \nThe Wall Street banks’ higher pay packages show how they have bounced back more quickly from the financial crisis than their peers in Britain, some of which have faced hefty post-crisis costs that have limited banker pay. \nThe data also shows that EU rules to rein in banker bonuses, blamed for driving excessive risk-taking in the run up to the 2008 crisis, are having an impact. \nJPMorgan paid 672 staff in senior or risk-taking positions a total of $1.02 billion in 2016 for an average of $1.52 million each, while 724 Goldman bankers took home an average of $1.48 million each, according to Reuters’ calculations from the filings. \nU.S. banks were also able to capitalize more effectively than European rivals on spikes in volatility in financial markets in 2016 from Britain’s June Brexit vote. \nEurope’s top investment banks’ trading in fixed income products fell by 6 percent in the second quarter of 2016, while their five biggest U.S. rivals reported a 21 percent increase to $13.1 billion in revenue from the same business. \nThe disclosures are among the most comprehensive released on bankers’ pay in Britain, which remains a controversial subject ten years on from the financial crisis. \nA report by the Chartered Institute of Personnel and Development released on Thursday showed that a median worker salary in Britain is about $38,493. In contrast, the average pay of a senior banker in 2016 was $1.06 million. \nThe report highlighted that the average boss of one of Britain’s top companies will by Thursday have already earned the same as the typical worker will make in the entire year. Slideshow (3 Images) \nThe banks’ pay disclosures make no mention of gender pay gaps, but banks in Britain may have to begin reporting such data after the government last April announced employers would have to disclose the difference between what they pay men and women by April 2018. \nThe average pay levels for bankers in the filings were boosted by a handful of top earners, with 10 Goldman bankers earning the highest band of more than 9 million euros in 2016 while 14 JPMorgan executives took home that lender’s top bracket of over 5 million euros each. \nThe pay disclosures focus on banks’ senior executives and ‘material risk takers’, and show how an EU rule that came into force in 2014 capping variable or bonus pay at 200 percent of fixed pay has cut fat bonuses. \nWhile Goldman Sachs paid senior staff more than five times more in variable pay than fixed in 2013, before the rule took effect, that ratio fell in 2016 to 0.6 times. \nGoldman in 2016 paid the top bankers $679 million in cash, and gave them 1.63 million shares in the bank which were worth a total of $389.6 million based on the bank’s year-end share price of $239. \nAnalysis of the filings also shows how regulators have sought to broaden the number of bankers deemed material risk takers, with the total whose pay is captured by the data rising from 2,604 in 2013 to 8,360 in 2016. \nThe disclosures cover British banks globally and overseas banks’ British-based staff, and contain more detail than is found in pay disclosures in other non-EU regions. \nMost banks released the details earlier last year, but some banks such as Goldman reported last month just before the year-end deadline. \nGoldman declined to comment. \nTo view a graphic on UK banker's pay, click: reut.rs/2lV1vBv Reporting By Lawrence White. Editing by Jane Merriman", "external_links": [], "published": "2018-01-04T14:40:00.000+02:00", "crawled": "2018-01-04T14:45:38.030+02:00", "highlightTitle": ""}