{"organizations": [], "uuid": "8fca4a848f56b75e61a15ca7535b55e89d6efc7e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-nyecs-executive-director-valerie-grey-appointed-to-federal-health-information-technology-advisory-committee.html", "country": "US", "domain_rank": 767, "title": "NYeC's Executive Director Valerie Grey Appointed To Federal Health Information Technology Advisory Committee", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-17T18:47:00.000+02:00", "replies_count": 0, "uuid": "8fca4a848f56b75e61a15ca7535b55e89d6efc7e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-nyecs-executive-director-valerie-grey-appointed-to-federal-health-information-technology-advisory-committee.html", "ord_in_thread": 0, "title": "NYeC's Executive Director Valerie Grey Appointed To Federal Health Information Technology Advisory Committee", "locations": [], "entities": {"persons": [{"name": "valerie grey", "sentiment": "negative"}, {"name": "charles schumer", "sentiment": "negative"}, {"name": "grey", "sentiment": "none"}], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "albany", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "u.s. senate", "sentiment": "negative"}, {"name": "federal health information technology advisory committee", "sentiment": "negative"}, {"name": "advisory committee", "sentiment": "none"}, {"name": "health information technology", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ALBANY, N.Y., Jan. 17, 2018 /PRNewswire-USNewswire/ -- U.S. Senate Minority Leader Charles Schumer appointed New York eHealth Collaborative (NYeC) Executive Director Valerie Grey to serve on the federal Health Information Technology (HIT) Advisory Committee. Citing her longstanding commitment to improving the healthcare landscape, numerous fellow healthcare leaders from across the state and continuum recommended Ms. Grey for her expertise in healthcare policy and insight into the complexities facing all stakeholders involved in health information exchange and its critical role in improving patient care and outcomes.\n\"I am honored to serve on this committee and look forward to working to move our healthcare system forward through innovations and technologies that advance electronic access, exchange, and use of health information, resulting in healthier patients and communities,\" said Ms. Grey. \"From reducing medical errors, to the better management of chronic disease and supporting public health and protecting vulnerable populations, HIT will continue to grow in importance and influence in the healthcare environment. The advisory committee will help shape the next phase of health information exchange in our country, while ensuring the interests of patients and the public remain at the center.\"\nThe HIT Advisory Committee was established by the 21 st Century Cures Act to provide recommendations to the National Coordinator for Health Information Technology on the implementation of healthcare infrastructure, with the goals of improving interoperability, assuring the best use of technology and data, and easing the adoption of and use by patient, providers, payers, and healthcare professionals. Committee members advise on a variety of policies, including patient care coordination, population health initiatives, telemedicine, data reporting, and security provisions.\n\"Valerie will be a tremendous addition to this important committee, bringing her wide-ranging experience in both the public and private sectors, and extensive expertise in healthcare policy and health information,\" said David Klein, Special Advisor to the Medical Center CEO at the University of Rochester and Board Chair of NYeC. \"Her dedication to improving healthcare will greatly benefit the committee, Congress, and, ultimately, all of us.\"\nAs NYeC's Executive Director, Ms. Grey interacts with a diverse group of healthcare stakeholders, including government agencies and policymakers, private industry organizations, providers, patients, industry associations, and health plans, working collaboratively to advance care and patient outcomes using health technology. NYeC works with and on behalf of the New York State Department of Health to lead the development and enhancement of the Statewide Health Information Network for New York (SHIN-NY), one of the nation's largest public health information exchanges.\nBefore joining NYeC, Ms. Grey held executive leadership positions in the New York State Governor's office, an industry association representing health systems across the state, a large health plan, and various state agencies.\nAbout the New York eHealth Collaborative (NYeC)\nNYeC is a not-for-profit organization working in partnership with the New York State Department of Health to improve healthcare by collaboratively leading, connecting, and integrating health information exchange across the state. www.nyehealth.org\nView original content with multimedia: http://www.prnewswire.com/news-releases/nyecs-executive-director-valerie-grey-appointed-to-federal-health-information-technology-advisory-committee-300583958.html\nSOURCE New York eHealth Collaborative (NYeC)", "external_links": ["http://www.prnewswire.com/news-releases/nyecs-executive-director-valerie-grey-appointed-to-federal-health-information-technology-advisory-committee-300583958.html", "http://www.nyehealth.org/", "https://www.nyehealth.org/shin-ny/what-is-the-shin-ny/"], "published": "2018-01-17T18:47:00.000+02:00", "crawled": "2018-01-17T19:05:50.003+02:00", "highlightTitle": ""}