{"organizations": [], "uuid": "fd2f61fc264f9483a805aa096b471c561b7d1f4e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/business-wire-polaris-names-lucy-clark-dougherty-general-counsel-and-svp.html", "country": "US", "domain_rank": 767, "title": "Polaris Names Lucy Clark Dougherty General Counsel and SVP", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.242, "site_type": "news", "published": "2018-01-09T19:30:00.000+02:00", "replies_count": 0, "uuid": "fd2f61fc264f9483a805aa096b471c561b7d1f4e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/business-wire-polaris-names-lucy-clark-dougherty-general-counsel-and-svp.html", "ord_in_thread": 0, "title": "Polaris Names Lucy Clark Dougherty General Counsel and SVP", "locations": [], "entities": {"persons": [{"name": "lucy clark dougherty", "sentiment": "negative"}, {"name": "lucy clark d", "sentiment": "negative"}, {"name": "clark dougherty", "sentiment": "none"}, {"name": "lucy", "sentiment": "none"}], "locations": [{"name": "minneapolis", "sentiment": "none"}], "organizations": [{"name": "polaris", "sentiment": "negative"}, {"name": "svp", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "polaris industries inc.", "sentiment": "negative"}, {"name": "polaris foundation", "sentiment": "none"}, {"name": "gm", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MINNEAPOLIS--(BUSINESS WIRE)-- Polaris Industries Inc. (NYSE: PII) today announced that Lucy Clark Dougherty will join Polaris as senior vice president, general counsel, compliance officer and corporate secretary, reporting to Chairman and CEO Scott Wine effective January 29. She will also serve as president of the Polaris Foundation.\n“Lucy has proven her ability to deliver results in various complex, challenging, and dynamic environments. Her inquisitive nature and critical-thinking skills will provide insightful guidance as we focus on innovation, global growth and product superiority, and I am excited for her to serve as a strategic advisor and contributor to our Polaris leadership team,” said Wine. “She is a pragmatic leader whose strategic legal counsel has elevated the performance of a wide variety of operations and functions. Between her time at GM and her roles within the public sector, Lucy brings extensive legal expertise and a breadth of experience that will serve as tremendous assets to Polaris.”\nThroughout her twenty-year career, Clark Dougherty has provided strategic counsel and managed complex legal operations across various sectors and industries. She joins Polaris from General Motors, where she most recently served as deputy general counsel for Global Markets, Autonomous Vehicles and Transportation as a Service. During her eight years with the company, Clark Dougherty was a trusted advisor, providing legal oversight and supporting General Motor’s global and domestic growth strategies.\n“Polaris values excellence, in their products, services, and corporate culture, continually striving to raise the bar,” said Clark Dougherty. “I look forward to building on the strong legal and governance foundation already in place, helping to drive growth and long-term value with integrity.”\nBefore joining General Motors in 2010, Clark Dougherty founded her own consulting group, advising clients on global financial regulatory and anti-corruption issues. She started her legal career with a federal judicial clerkship followed by private practice, after which she moved into the public sector with the United States Department of Justice, Executive Office of the President, and finally the United States Department of Homeland Security, where she eventually served as chief legal officer and counselor to the secretary of Homeland Security.\nClark Dougherty holds a J.D. from the University of Michigan Law School. She earned a master’s degree in history from the University of Virginia and her bachelor’s degree in history from Yale University.\nAbout Polaris\nPolaris Industries Inc. (NYSE: PII) is a global powersports leader that has been fueling the passion of riders, workers and outdoor enthusiasts for more than 60 years. With annual 2016 sales of $4.5 billion, Polaris’ innovative, high-quality product line-up includes the RANGER ® , RZR ® and Polaris GENERAL™ side-by-side off-road vehicles; the Sportsman ® and Polaris ACE ® all-terrain off-road vehicles; Indian Motorcycle ® midsize and heavyweight motorcycles; Slingshot ® moto-roadsters; and Polaris RMK ® , INDY ® , Switchback ® and RUSH ® snowmobiles. Polaris enhances the riding experience with parts, garments and accessories, along with a growing aftermarket portfolio, including Transamerica Auto Parts. Polaris’ presence in adjacent markets globally include military and commercial off-road vehicles, quadricycles, and electric vehicles. Proudly headquartered in Minnesota, Polaris serves more than 100 countries across the globe. Visit www.polaris.com for more information.\nClick here to subscribe to Mobile Alerts for Polaris Industries Inc.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180109006358/en/\nPolaris Industries Inc.\nJess Rogers, 763-513-3445\nJessica.Rogers@polaris.com\nSource: Polaris Industries Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Falerts.businesswire.com%2Fsubscribe%2Fpolarisir&esheet=51740419&newsitemid=20180109006358&lan=en-US&anchor=Click+here+to+subscribe+to+Mobile+Alerts+for+Polaris+Industries+Inc.&index=2&md5=73ffc1cd2060b996e834abaab08d4f9a", "http://www.businesswire.com/news/home/20180109006358/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.polaris.com%2F&esheet=51740419&newsitemid=20180109006358&lan=en-US&anchor=www.polaris.com&index=1&md5=072c2c84a62e33ab3249b2fc2d32aa3c"], "published": "2018-01-09T19:30:00.000+02:00", "crawled": "2018-01-09T21:30:52.032+02:00", "highlightTitle": ""}