{"organizations": [], "uuid": "213888581e79713483077c4a0a053e55d3be38f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226773876&w=1200&r=LYNXMPEE0U026", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/britain-politics-may/im-not-a-quitter-says-uks-may-as-leadership-questions-stack-up-idINKBN1FK05Z", "country": "US", "domain_rank": 408, "title": "I'm not a quitter, says UK's May as leadership questions stack up", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T03:20:00.000+02:00", "replies_count": 0, "uuid": "213888581e79713483077c4a0a053e55d3be38f1"}, "author": "", "url": "https://in.reuters.com/article/britain-politics-may/im-not-a-quitter-says-uks-may-as-leadership-questions-stack-up-idINKBN1FK05Z", "ord_in_thread": 0, "title": "I'm not a quitter, says UK's May as leadership questions stack up", "locations": [], "entities": {"persons": [{"name": "william james", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "wuhan", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WUHAN, China (Reuters) - British Prime Minister Theresa May on Wednesday defied critics calling for her to resign, saying she was not a quitter and that she has a long-term job to do: delivering Brexit and domestic reform.\nMay has come under fire in recent days from several factions within her own party. She has been accused by eurosceptics of watering down Brexit, by pro-EU lawmakers of risking Britain’s economy, and by others who say her domestic agenda is too timid.\n“I’ve said to you before, I‘m not a quitter and there is a long-term job to be done,” she told reporters on her way to China for a trade visit when asked about the recent criticism of her leadership and reports of a potential attempt to oust her.\n“That job is about getting the best Brexit deal, about ensuring that we take back control of our money, our laws, our borders, that we can sign trade deals around the rest of the world. But it is also about our domestic agenda.”\nThe leadership question dominated a briefing with journalists on board a Royal Air Force jet to China where she will meet President Xi Jinping, with an eye on securing better access to Chinese markets and an eventual free trade deal.\nMedia reports have said the number of ‘no confidence’ letters submitted by lawmakers from May’s own party is nearing the threshold which would trigger a leadership contest. The committee which holds the letters does not comment on the actual number.\nMay’s future as leader of the ruling Conservative Party has been subject to heightened speculation after she gambled on a snap election last year which went badly wrong and cost her party its majority in parliament.\nDuring a similar trade-focused visit to Japan last year May first used the “I‘m not a quitter” phrase, vowing to fight the next British election as leader in 2022.\nSince then the pressure has been amplified by gaffes, scandals, and a growing concern among some that constant infighting over Brexit was drowning out attempts to win back the voters the party lost at the 2017 election.\nResponding to one of more than 10 questions about her leadership during a 25 minute briefing, May defended her record by singling out housing, education and employment rates as areas where her government has made progress.\nBut, she acknowledged a need to make sure the messages are better heard by voters and her own party.\n“Are you asking me is there more for us to do, talk to people about, more generally about what we are achieving and what we are doing? ... Yes,” she said.\n“There is always more for us to be able to do to talk to people about what we’re achieving.”\nReporting by William James; Editing by Paul Tait and Michael Perry\n ", "external_links": [], "published": "2018-01-31T03:20:00.000+02:00", "crawled": "2018-01-31T03:48:36.000+02:00", "highlightTitle": ""}