{"organizations": [], "uuid": "be4c5fb3358d2096f03f012844257699c4d6b781", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/09/22/103962817-GettyImages-107158537.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/23/dollar-slips-to-3-year-lows-on-us-protectionism-worries.html", "country": "US", "domain_rank": 767, "title": "Dollar slips to 3-year lows on US protectionism worries", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-24T09:55:00.000+02:00", "replies_count": 0, "uuid": "be4c5fb3358d2096f03f012844257699c4d6b781"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/23/dollar-slips-to-3-year-lows-on-us-protectionism-worries.html", "ord_in_thread": 0, "title": "Dollar slips to 3-year lows on US protectionism worries", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "world economic forum", "sentiment": "none"}, {"name": "u.s. federal reserve", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "nato", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The dollar slid to three-year lows against a basket of major peers on Wednesday on worries about the protectionist agenda expected to be pursued by U.S. President Donald Trump in a speech later this week.\nThe greenback has already come under selling pressure in recent weeks, on the view that the U.S. Federal Reserve is no longer the only game in town when it comes to tighter monetary policy, as growth in other regions — in Europe in particular — picks up speed.\nThe latest bout of weakness emerged after White House officials said on Tuesday that Trump would use his speech to the World Economic Forum in Davos on Friday to stress his \"America First\" policies.\nUnder that agenda, Trump has threatened to withdraw from the North American free-trade agreement, disavowed the global climate change accord and criticized global institutions including the United Nations and NATO.\nThe dollar index , which measures the greenback's value against a basket of six major currencies, fell below the 90.00 threshold for the first time since December 2014 on Wednesday. It was last down 0.65 percent at 89.54.\n\"It feels like the next few weeks could be a watershed moment for world trade and protectionism,\" said ING currency strategist Viraj Patel, in London.\n\"(Trump's) 'America First' ideology...remains a risk strategy for the dollar — and for a U.S. economy that relies on the kindness of strangers to fund its structural external deficit,\" he added. \"The multi-year trend of a cyclically declining U.S. dollar is now in full motion - and will be difficult to fight against for medium-term investors.\"\nshow chapters This investment strategist is still bearish on the dollar 12:28 AM ET Tue, 23 Jan 2018 | 02:01 As the dollar fell broadly, the euro hit a fresh three-year peak of $1.2345, while sterling rose to its highest level since Britain's June 2016 vote to leave the European Union, at $1.4165.\nInvestors are keenly awaiting the European Central Bank's meeting on Thursday for clues on the outlook for monetary policy in the euro zone.\nAgainst the yen , the dollar fell below the 110 threshold for the first time in four months, last trading down half a percent at 109.35 yen.\nThe yen gained a lift in recent weeks, after the Bank of Japan trimmed its buying of long-dated government bonds in market operations earlier this month, sparking speculation of an eventual exit from its large stimulus.\nAnalysts said such speculation continued to support the yen, even after BOJ Governor Haruhiko Kuroda on Tuesday stressed the importance of patiently continuing with powerful monetary easing.\n\"The dilemma here for the Bank of Japan is how do they temper investor expectations?\" said Stephen Innes, head of trading in Asia-Pacific for Oanda in Singapore.\n\"This is the issue that's on the table right now beyond the broader negative downtrend in the dollar,\" he said.", "external_links": [], "published": "2018-01-24T09:55:00.000+02:00", "crawled": "2018-01-24T12:52:03.009+02:00", "highlightTitle": ""}