{"organizations": [], "uuid": "e9a8f289774b8bc033ac9e4a320b972fddf76fab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/13/pr-newswire-shareholder-alert-pomerantz-law-firm-reminds-shareholders-with-losses-on-their-investment-in-the-crypto-company-of-class.html", "country": "US", "domain_rank": 767, "title": "SHAREHOLDER ALERT: Pomerantz Law Firm Reminds Shareholders with losses on their Investment in The Crypto Company of Class Action Lawsuit and Upcoming Deadline - CRCW", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T16:08:00.000+02:00", "replies_count": 0, "uuid": "e9a8f289774b8bc033ac9e4a320b972fddf76fab"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/13/pr-newswire-shareholder-alert-pomerantz-law-firm-reminds-shareholders-with-losses-on-their-investment-in-the-crypto-company-of-class.html", "ord_in_thread": 0, "title": "SHAREHOLDER ALERT: Pomerantz Law Firm Reminds Shareholders with losses on their Investment in The Crypto Company of Class Action Lawsuit and Upcoming Deadline - CRCW", "locations": [], "entities": {"persons": [{"name": "robert s. willoughby", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "united states district court", "sentiment": "none"}], "organizations": [{"name": "pomerantz llp", "sentiment": "neutral"}, {"name": "crypto company", "sentiment": "neutral"}, {"name": "crypto", "sentiment": "none"}, {"name": "central district of california", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 13, 2018 /PRNewswire/ -- Pomerantz LLP announces that a class action lawsuit has been filed against The Crypto Company (\"Crypto\" or the \"Company\") (OTCMKTS: CRCW) and certain of its officers. The class action, filed in United States District Court, for the Central District of California, and docketed under 17-cv-09157, is on behalf of a class consisting of investors who purchased or otherwise acquired Crypto securities, seeking to recover compensable damages caused by defendants' violations of the Securities Exchange Act of 1934.\nIf you are a shareholder who purchased Crypto securities between August 21, 2017, and December 18, 2017, both dates inclusive, you have until February 20, 2018, to ask the Court to appoint you as Lead Plaintiff for the class. A copy of the Complaint can be obtained at www.pomerantzlaw.com . To discuss this action, contact Robert S. Willoughby at rswilloughby@pomlaw.com or 888.476.6529 (or 888.4-POMLAW), toll-free, Ext. 9980. Those who inquire by e-mail are encouraged to include their mailing address, telephone number, and the number of shares purchased.\n[Click here to join this class action]\nThe Crypto Company is engaged in the business of advising regarding, investing in, trading and developing proprietary source code for digital assets with diversified exposure to digital asset markets. The Company's core services include consulting and advising companies regarding investment and trading in the digital asset market and investing in a manner that diversifies exposure to the growing class of digital assets.\nThe Complaint alleges that throughout the Class Period, Defendants made materially false and misleading statements regarding the Company's business, operational and compliance policies. Specifically, Defendants made false and/or misleading statements and/or failed to disclose that: (i) Crypto unlawfully engaged in a scheme to promote and manipulate the Company's stock; and (ii) as a result, Crypto's public statements were materially false and misleading at all relevant times.\nOn December 19, 2017, the SEC temporarily suspended Crypto stock from trading due to concerns that the stock was being manipulated after the shares surged more than 17,000% in less than 3 months. The SEC said it was alarmed about \"the accuracy and adequacy of information\" relating to the compensation paid for promotion of its and statements in SEC filings about the plans of the Company's insiders to sell their stock. Crypto stock was trading at $575 per share at the time trading was suspended and the suspension will remain in effect until January 3, 2018.\nThe Pomerantz Firm, with offices in New York, Chicago, Los Angeles, and Paris, is acknowledged as one of the premier firms in the areas of corporate, securities, and antitrust class litigation. Founded by the late Abraham L. Pomerantz, known as the dean of the class action bar, the Pomerantz Firm pioneered the field of securities class actions. Today, more than 80 years later, the Pomerantz Firm continues in the tradition he established, fighting for the rights of the victims of securities fraud, breaches of fiduciary duty, and corporate misconduct. The Firm has recovered numerous multimillion-dollar damages awards on behalf of class members. See www.pomerantzlaw.com\nCONTACT:\nRobert S. Willoughby\nPomerantz LLP\nrswilloughby@pomlaw.com\nView original content: http://www.prnewswire.com/news-releases/shareholder-alert--pomerantz-law-firm-reminds-shareholders-with-losses-on-their-investment-in-the-crypto-company-of-class-action-lawsuit-and-upcoming-deadline--crcw-300582155.html\nSOURCE Pomerantz LLP", "external_links": ["http://www.pomerantzlaw.com/", "https://form.jotformpro.com/pomerantzllp2/crypto", "http://www.prnewswire.com/news-releases/shareholder-alert--pomerantz-law-firm-reminds-shareholders-with-losses-on-their-investment-in-the-crypto-company-of-class-action-lawsuit-and-upcoming-deadline--crcw-300582155.html"], "published": "2018-01-13T16:08:00.000+02:00", "crawled": "2018-01-13T18:53:08.037+02:00", "highlightTitle": ""}