{"organizations": [], "uuid": "323f64891775f873710974e82a9c7de689d69e6c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/china-bonds/chinas-money-rates-inch-up-amid-taxes-expectations-of-tight-policy-idUSL8N1PE19B", "country": "US", "domain_rank": 408, "title": "China's money rates inch up amid taxes, expectations of tight policy", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T17:00:00.000+02:00", "replies_count": 0, "uuid": "323f64891775f873710974e82a9c7de689d69e6c"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/china-bonds/chinas-money-rates-inch-up-amid-taxes-expectations-of-tight-policy-idUSL8N1PE19B", "ord_in_thread": 0, "title": "China's money rates inch up amid taxes, expectations of tight policy", "locations": [], "entities": {"persons": [], "locations": [{"name": "shanghai", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "shanghai interbank", "sentiment": "none"}, {"name": "pboc", "sentiment": "none"}, {"name": "people's bank of china", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHANGHAI, Jan 19 (Reuters) - China's primary money rates edged up again this week, lifted by strong demand for cash from financial institutions and by market expectations that policy will remain tight after data showed robust fourth-quarter economic growth. The volume-weighted average rate of the benchmark seven-day repo traded in the interbank market, considered the best indicator of general liquidity in China, was 2.9224 percent, 1.8 basis points higher than the previous week's closing average rate of 2.9043. The Shanghai Interbank Offered Rate (SHIBOR) for the same tenor rose to 2.8910 percent, or 2.7 basis points higher than the previous week's close. The one-day or overnight rate stood at 2.8582 percent and the 14-day repo at 4.3084 percent. Rates moved higher even as the People's Bank of China (PBOC) injected a net 590 billion yuan ($92.29 billion) into money markets this week, after a net injection of 40 billion yuan a week earlier. The injections come as financial institutions sought cash to make mid-January tax payments for the October-December period, and work to meet reserve requirements. Faster-than-expected economic growth in 2017's final quarter, driven by an export recovery, helped to ease concerns that Beijing's curbs on industrial capacity and credit expansion would damage China's prospects. Gross domestic product grew 6.8 percent in October-December, unchanged from the previous quarter. Against the backdrop of strong growth, economists widely expect authorities to maintain a bias toward tighter monetary conditions and controlling financial risks. Iris Pang, Greater China economist at ING, said in a note she expects the PBOC to raise short-term rates three times in 2018, following the U.S. Federal Reserve. But the central bank would likely leave benchmark rates untouched, she said in an emailed response to questions. \"The interest rate liberalisation process has reached a stage that the PBOC would only use short-term rates for policy tools,\" she said, noting the improved transmission of interbank rates to retail bank lending and deposit rates. \"There is no way that the central bank goes backward to benchmark rates again.\" Key money rates at a glance: Volume-wei Previous Change (bps) Volume ghted day (%) average rate (%) Interbank repo market Overnight 2.8582 2.7814 +7.68 0.00 Seven-day 2.9224 2.9083 +1.41 0.00 14-day 4.3084 4.4449 -13.65 0.00 Shanghai stock exchange repo market Overnight 3.5150 3.9950 -48.00 763,314.2 0 Seven-day<CN7DR 3.9600 4.2000 -24.00 58,993.00 PO=SS> 14-day 4.4000 4.6550 -25.50 8,569.50 PBOC Guidance Rates Overnight 2.8800 2.7900 +9.00 <CN1DRPFIX=CFXS > Seven-day 3.4000 3.4900 -9.00 <CN7DRPFIX=CFXS > 14-day 4.4000 4.5000 -10.00 <CN14DRPFIX=CFX S> SHANGHAI INTERBANK OFFERED RATE Overnight 2.8360 2.7655 +7.05 Seven-day 2.8910 2.8780 +1.30 Three-month 4.7115 4.7044 +0.71 KEY INTEREST RATE SWAPS: Instrument RIC Rate Spread vs 1 yr official deposit rate* 2 yr IRS based on 1 CNABAD2YF= 0.0000 -1.5 year benchmark 5 yr 7-day repo swap CNYQB7R5Y= 4.0200 n/a *This spread can be seen as a proxy for forward-looking market expectations of an interest rate cut or rise China FX and money market guide: China debt market guide: SHIBOR rates: Reports on central bank open market operations: New Chinese debt issues: Prices for central bank bills, treasury bonds and sovereign bonds: Overview of China financial market data: ($1 = 6.3931 Chinese yuan) (Reporting by Andrew Galbraith and Winni Zhou; Editing by Richard Borsuk)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T17:00:00.000+02:00", "crawled": "2018-01-20T17:38:37.031+02:00", "highlightTitle": ""}