{"organizations": [], "uuid": "9114216035e095f93944d57ba66b34a83188531f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-plumas-bancorp-reports-record-earnings.html", "country": "US", "domain_rank": 767, "title": "Plumas Bancorp Reports Record Earnings", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T17:00:00.000+02:00", "replies_count": 0, "uuid": "9114216035e095f93944d57ba66b34a83188531f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-plumas-bancorp-reports-record-earnings.html", "ord_in_thread": 0, "title": "Plumas Bancorp Reports Record Earnings", "locations": [], "entities": {"persons": [], "locations": [{"name": "quincy", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "plumas bancorp", "sentiment": "negative"}, {"name": "plumas bank", "sentiment": "none"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "QUINCY, Calif., Jan. 23, 2018 (GLOBE NEWSWIRE) -- Plumas Bancorp (Nasdaq:PLBC), the parent company of Plumas Bank (the “Bank”), today announced record earnings for the twelve months ended December 31, 2017. For the year ended December 31, 2017, Plumas Bancorp (the “Company”) reported net income of $8.2 million, an increase of $715 thousand, or 10%, from $7.5 million for the year ended December 31, 2016. Earnings per diluted share increased to $1.58 for the year ended December 31, 2017, up $0.11 from $1.47 for 2016. Earnings for the fourth quarter of 2017 totaled $1.1 million, a decrease of $971 thousand, or 46%, from $2.1 million for the three months ended December 31, 2016. Earnings per diluted share decreased to $0.22 for the three months ended December 31, 2017, down $0.19 from $0.41 for the fourth quarter of 2016. As more fully described under “Tax Cuts and Jobs Act” below, net income for the fourth quarter of 2017 was reduced by a $1.4 million, or $0.27 per diluted share, as a result of a one-time revaluation of the Company’s deferred tax assets.\nTax Cuts and Jobs Act\nOn December 22, 2017, the Tax Cuts and Jobs Act (the “TCJ Act”) was enacted into law. The TCJ Act provides for significant changes to the U.S. Internal Revenue Code of 1986, as amended. Those changes will impact corporate taxation requirements, such as the reduction of the federal tax rate for corporations from 35% to 21%. They will also provide for changes or limitations to certain tax deductions.\nPlumas Bancorp is currently assessing the extensive changes under the TCJ Act and their overall impact on the Company. Based on a preliminary assessment of the reduction in the federal corporate tax rate from 35% to 21%, which became effective on January 1, 2018, the Company expects that its effective combined federal and state tax rate for 2018 will be between 27% and 28%. This estimate is based on management’s current assumptions with respect to, among other things, the Company’s earnings, state income tax levels and tax deductions. This estimated tax rate range compares to an effective combined tax rate of 38% for 2017 – that’s before a $1.4 million revaluation of deferred tax assets described below. The Company is currently evaluating how to most effectively utilize the tax savings that are expected to result from the TCJ Act. The Company’s actual effective tax rate in 2018 may differ from management's estimate.\nThe reduction in the corporate tax rate under the TCJ Act required a one-time revaluation of certain tax-related assets to reflect their value at the lower corporate tax rate of 21%. As such, the Company has recorded a reduction in the value of these assets of $1.4 million, which relates to the Company’s net deferred tax assets. Solely based on this reduction in certain tax assets, the Company recorded an additional provision for income taxes of $1.4 million, or $0.27 per diluted share, in its income statement for the fourth quarter of 2017.\nAdditionally, in connection with its ongoing treasury and tax management objectives, during the fourth quarter of 2017 the Company sold approximately $5.4 million of fixed income available-for-sale investment securities. This transaction resulted in a loss on investment securities of approximately $141 thousand, on a pre-tax basis. The proceeds from these sales of securities were reinvested in higher-yielding investments.\nPresident’s Comments\nAndrew J. Ryback, director, president and chief executive officer of Plumas Bancorp and Plumas Bank, remarked, “The Board of Directors, executives and I are pleased to report record earnings for 2017. Significant highlights include record levels of assets, loans and deposits; a 4.35% net interest margin; and a 55.5% efficiency ratio. Deposit growth was particularly strong during 2017 with deposits increasing by $80.3 million from $582 million at December 31, 2016, to $663 million at December 31, 2017.\nRyback further stated, “A $3.8 million increase in net interest income was the largest single component of earnings growth in 2017. Throughout 2017, our net interest margin continued to benefit from our growing and diversified loan portfolio. Average interest earning assets grew by $71 million in 2017 and the average yield on these assets increased by 11 basis points to 4.5%. In addition, we continue to enjoy a very low cost of funds with over 43% of our deposits in non-interest bearing accounts and only 7% in time deposit accounts.”\nRyback concluded, “2017 was another excellent year for Plumas Bancorp. Moving forward we expect to benefit from an increasing rate environment, a lower effective tax rate and continued growth in loan and deposit balances. We are excited about the opportunities that await us in 2018 and look forward to continuing to deliver superior performance to our clients and shareholders.”\nLoans, Deposits, Investments and Cash\nGross loans increased by $25.5 million, or 6%, from $461 million at December 31, 2016 to $487 million at December 31, 2017. The increase in loan balances includes $14.1 million in commercial real estate loans, $7.8 million in agricultural loans, $3.3 million in construction and land development loans and $6.9 million in automobile loans. These increases were partially offset by declines in other loan categories the largest of which was a decrease of $4.7 million in residential real estate loans. Related to increased regulatory burden, the Company no longer offers a term residential real estate product.\nTotal deposits increased by $80.3 million, or 14%, from $582.4 million at December 31, 2016 to $662.7 million at December 31, 2017. At December 31, 2017, 43% of the Company’s deposits were in the form of non-interest bearing demand deposits. Core deposit growth remained strong in 2017 as evidenced by increases of $45.5 million in demand deposits, $27.0 million in savings accounts, $3.5 million in money market accounts and $7.9 million in interest bearing transaction accounts. Time deposits declined by $3.6 million, much of which we attribute to migration into other types of deposits given the low rates and lack of liquidity associated with time deposits. The Company has no brokered deposits.\nTotal investment securities increased by $35.9 million to $137.5 million at December 31, 2017, up from $101.6 million at December 31, 2016. The Company’s investment portfolio at December 31, 2017 consisted of $103.8 million in U.S. Government-sponsored agencies collateralized by residential mortgage obligations and $33.7 million in obligations of states and political subdivisions.\nCash and due from banks increased by $24.9 million from $62.6 million at December 31, 2016 to $87.5 million at December 31, 2017.\nAsset Quality\nNonperforming assets (which are comprised of nonperforming loans, other real estate owned (“OREO”) and repossessed vehicle holdings) at December 31, 2017 were $4.4 million, up from $3.5 million at December 31, 2016. Nonperforming assets as a percentage of total assets were 0.59% at December 31, 2017 and 0.53% at December 31, 2016. OREO totaled $1.3 million at December 31, 2017 and $0.7 million at December 31, 2016. Nonperforming loans at December 31, 2017 were $3.0 million, an increase of $298 thousand from $2.7 million at December 31, 2016. Nonperforming loans as a percentage of total loans increased to 0.62% at December 31, 2017, up from 0.59% at December 31, 2016. Included in nonperforming assets at December 31, 2017 were three loans to one customer totaling $1.8 million that were 90 days past due and still accruing interest. These loans were well secured and in process of collection at December 31, 2017. To date in 2018 we have collected $1.1 million in principal on these loans through the liquidation of a portion of the collateral securing the loans reducing the outstanding balance to $0.7 million. We anticipate collecting the remaining principal and interest by March 31, 2018 through liquidation of the remaining collateral.\nDuring the year ended December 31, 2017 we recorded a provision for loan losses of $600 thousand down $200 thousand from a provision of $800 thousand during the year ended December 31, 2016. Net charge-offs totaled $480 thousand during the twelve months ended December 31, 2017 and $329 thousand during the same period in 2016. Net charge-offs as a percentage of average loans were 0.08% during 2016 and 0.10% during the year ended December 31, 2017. The allowance for loan losses totaled $6.7 million at December 31, 2017 and $6.5 million at December 31, 2016. The allowance for loan losses as a percentage of total loans decreased from 1.42% at December 31, 2016 to 1.37% at December 31, 2017.\nShareholders’ Equity\nTotal shareholders’ equity increased by $7.7 million from $48.0 million at December 31, 2016 to $55.7 million at December 31, 2017. The largest component of the $7.7 million increase in shareholders’ equity was earnings during the twelve month period totaling $8.2 million. During 2017 the Company paid two 14 cent per share semi-annual cash dividends which had the effect of reducing shareholders’ equity by $1.4 million.\nIn May, 2017 the Company’s outstanding warrant, which represented the right to purchase 150,000 shares of common stock at $5.25 per share, was exercised in a cashless exercise resulting in the issuance of 108,111 common shares.\nNet Interest Income and Net Interest Margin\nNet interest income, on a nontax-equivalent basis, was $27.9 million for the year ended December 31, 2017, up $3.8 million, or 16%, from $24.1 million during 2016. Related mostly to an increase in average loan balances, interest income increased by $3.8 million, or 15%, from $25.1 million during 2016 to $28.9 million during the current year. Interest expense declined by $6 thousand.\nNet interest income, on a nontax-equivalent basis, for the three months ended December 31, 2017 was $7.4 million, an increase of $1 million from the $6.4 million earned during the same period in 2016. Similar to the twelve month comparison, the largest component of the increase in net interest income was an increase in average loan balances. Interest expense increased by $2 thousand from $260 thousand during the three months ended December 31, 2016 to $262 thousand during the quarter ended December 31, 2017.\nNet interest margin is net interest income expressed as a percentage of average interest-earning assets. Net interest margin for the year ended December 31, 2017 increased to 4.35%, up from 4.21% during 2016. Net interest margin for the three months ended December 31, 2017 increased to 4.28%, up from 4.18% during the fourth quarter of 2016. The increase in margin was driven by increases in loan yield. During the year ended December 31, 2017, the average yield on loans was 5.47% an increase of 12 basis points from 5.35% during 2016. For the three months ended December 31, 2017 and 2016 loan yield was 5.53% and 5.33%, respectively.\nNon-Interest Income/Expense\nDuring the year ended December 31, 2017, non-interest income totaled $8.3 million, an increase of $628 thousand from the twelve months ended December 31, 2016. The largest components of this increase were increases of $423 thousand in service charge income, $269 thousand gain on sale of loans and $89 thousand in loan servicing income. Service charge income benefited from significant increases in interchange income on debit card transactions, an increase in overdraft income and an increase in service charges on deposit accounts. We attribute much of the increase in service charge income to an increase in the size of the Bank. Gains on sale of loans mostly relate to sales of SBA 7(a) loans. Gains on sale of loans increased from $1.8 million during 2016 to $2.0 million during the twelve months ended December 31, 2017. Proceeds from SBA loan sales totaled $36.6 million during 2017 and $30.7 million during the twelve months ended December 31, 2016. Loans originated for sale totaled $31.3 million during the twelve months ended December 31, 2017 and $30.4 million during 2016. Loan servicing income, which increased by $89 thousand, represents servicing income received on the guaranteed portion of SBA loans sold into the secondary market. At December 31, 2017 we were servicing $110 million in guaranteed portions of loans, an increase of $13 million from $97 million at December 31, 2016. The largest decrease in non-interest income was a $126 increase in loss on sale of investment securities from $32 thousand in 2016 to $158 thousand in 2017.\nDuring the three months ended December 31, 2017, non-interest income totaled $1.7 million, a decrease of $284 thousand from the three months ended December 31, 2016. The largest components of this decrease were a $141 thousand loss on sale of investment securities and a $204 thousand reduction in gain on sale of loans. During the fourth quarter of 2017 the Company sold approximately $5.4 million of fixed income available-for-sale investment securities as part of its overall tax management planning, recording a $141 thousand loss on sale. The proceeds from these sales of securities were reinvested in higher-yielding investments. Gains on sale of loans decreased by $204 thousand from $373 thousand during the three months ended December 31, 2016 to $169 thousand during the current quarter. Gains on sales of loans were abnormally low during the fourth quarter of 2017 and we do not view it as an indication of a negative trend going forward.\nDuring 2017, total non-interest expense increased by $1.4 million to $20.1 million mostly related to a $1.1 million increase in salary and benefit expense. Salary expense increased by $481 thousand to $8.8 million related to additions to staff and merit and promotion increases. Bonus expense increased by $199 thousand related to increased profitability, commission expense, related to our SBA operations, increased by $121 thousand consistent with an increase in SBA activity, payroll tax expense increased by $81 thousand and health insurance costs increased by $67 thousand.\nDuring the three months ended December 31, 2017, total non-interest expense increased by $330 thousand to $5.0 million, up from $4.7 million for the comparable period in 2016. The largest component of this increase was $165 thousand in salary and benefit expense.\nFounded in 1980, Plumas Bank is a locally owned and managed full-service community bank headquartered in Northeastern California. The Bank operates twelve branches: eleven located in the California counties of Plumas, Lassen, Placer, Nevada, Modoc and Shasta and one branch in the Nevada County of Washoe. The Bank also operates three loan production offices: two located in the California Counties of Placer and Butte and one located in the Oregon County of Klamath. Plumas Bank offers a wide range of financial and investment services to consumers and businesses and has received nationwide Preferred Lender status with the United States Small Business Administration. For more information on Plumas Bancorp and Plumas Bank, please visit our website at www.plumasbank.com.\nThis news release includes forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Exchange Act of 1934, as amended and Plumas Bancorp intends for such forward-looking statements to be covered by the safe harbor provisions for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995. Future events are difficult to predict, and the expectations described above are necessarily subject to risk and uncertainty that may cause actual results to differ materially and adversely.\nForward-looking statements can be identified by the fact that they do not relate strictly to historical or current facts. They often include the words \"believe,\" \"expect,\" \"anticipate,\" \"intend,\" \"plan,\" \"estimate,\" or words of similar meaning, or future or conditional verbs such as \"will,\" \"would,\" \"should,\" \"could,\" or \"may.\" These forward-looking statements are not guarantees of future performance, nor should they be relied upon as representing management's views as of any subsequent date. Forward-looking statements involve significant risks and uncertainties and actual results may differ materially from those presented, either expressed or implied, in this news release. Factors that might cause such differences include, but are not limited to: the Company's ability to successfully execute its business plans and achieve its objectives; changes in general economic and financial market conditions, either nationally or locally in areas in which the Company conducts its operations; changes in interest rates; continuing consolidation in the financial services industry; new litigation or changes in existing litigation; increased competitive challenges and expanding product and pricing pressures among financial institutions; legislation or regulatory changes which adversely affect the Company's operations or business; loss of key personnel; and changes in accounting policies or procedures as may be required by the Financial Accounting Standards Board or other regulatory agencies.\nIn addition, discussions about risks and uncertainties are set forth from time to time in the Company’s publicly available Securities and Exchange Commission filings. The Company undertakes no obligation to publicly revise these forward-looking statements to reflect subsequent events or circumstances.\nContact: Elizabeth Kuipers\nVice President, Marketing Manager & Investor Relations Officer\nPlumas Bank\n35 S. Lindan Avenue\nQuincy, CA 95971\n530.283.7305 ext.8912\ninvestorrelations@plumasbank.com\nPLUMAS BANCORP CONDENSED CONSOLIDATED BALANCE SHEETS (In thousands) (Unaudited) As of December 31, 2017 2016 Dollar\nChange Percentage\nChange ASSETS Cash and due from banks $ 87,537 $ 62,646 $ 24,891 39.7 % Investment securities 137,466 101,595 35,871 35.3 % Loans, net of allowance for loan losses 482,248 456,580 25,668 5.6 % Premises and equipment, net 11,346 11,768 (422 ) -3.6 % Bank owned life insurance 12,866 12,528 338 2.7 % Real estate acquired through foreclosure 1,344 735 609 82.9 % Accrued interest receivable and other assets 12,620 12,123 497 4.1 % Total assets $ 745,427 $ 657,975 $ 87,452 13.3 % LIABILITIES AND SHAREHOLDERS’ EQUITY Deposits $ 662,657 $ 582,353 $ 80,304 13.8 % Accrued interest payable and other liabilities 16,760 14,943 1,817 12.2 % Note payable - 2,375 (2,375 ) -100.0 % Junior subordinated deferrable interest debentures 10,310 10,310 - 0.0 % Total liabilities 689,727 609,981 79,746 13.1 % Shareholders’ equity 55,700 47,994 7,706 16.1 % Total liabilities and shareholders’ equity $ 745,427 $ 657,975 $ 87,452 13.3 % PLUMAS BANCORP CONDENSED CONSOLIDATED STATEMENTS OF INCOME (In thousands, except per share data) (Unaudited) FOR THE THREE MONTHS ENDED DECEMBER 31, 2017 2016 Dollar\nChange Percentage\nChange Interest income $ 7,668 $ 6,644 $ 1,024 15.4 % Interest expense 262 260 2 0.8 % Net interest income before provision for loan losses 7,406 6,384 1,022 16.0 % Provision for loan losses - 200 (200 ) -100.0 % Net interest income after provision for loan losses 7,406 6,184 1,222 19.8 % Non-interest income 1,667 1,951 (284 ) -14.6 % Non-interest expense 5,004 4,674 330 7.1 % Income before income taxes 4,069 3,461 608 17.6 % Provision for income taxes 2,933 1,354 1,579 116.6 % Net income $ 1,136 $ 2,107 $ (971 ) -46.1 % Basic earnings per share $ 0.22 $ 0.43 $ (0.21 ) -48.8 % Diluted earnings per share $ 0.22 $ 0.41 $ (0.19 ) -46.3 % FOR THE YEAR ENDED DECEMBER 31, 2017 2016 Dollar\nChange Percentage\nChange Interest income $ 28,953 $ 25,100 $ 3,853 15.4 % Interest expense 1,017 1,023 (6 ) -0.6 % Net interest income before provision for loan losses 27,936 24,077 3,859 16.0 % Provision for loan losses 600 800 (200 ) -25.0 % Net interest income after provision for loan losses 27,336 23,277 4,059 17.4 % Non-interest income 8,280 7,652 628 8.2 % Non-interest expense 20,111 18,696 1,415 7.6 % Income before income taxes 15,505 12,233 3,272 26.7 % Provision for income taxes 7,316 4,759 2,557 53.7 % Net income $ 8,189 $ 7,474 $ 715 9.6 % Basic earnings per share $ 1.64 $ 1.54 $ 0.10 6.5 % Diluted earnings per share $ 1.58 $ 1.47 $ 0.11 7.5 %\nPLUMAS BANCORP SELECTED FINANCIAL INFORMATION (Dollars in thousands, except per share data) (Unaudited) Year Ended Three Months Ended 12/31/2017 12/31/2016 12/31/2015 12/31/2017 12/31/2016 EARNINGS PER SHARE Basic earnings per share $ 1.64 $ 1.54 $ 1.21 $ 0.22 $ 0.43 Diluted earnings per share $ 1.58 $ 1.47 $ 1.15 $ 0.22 $ 0.41 Weighted average shares outstanding 5,005 4,864 4,817 5,060 4,887 Weighted average diluted shares outstanding 5,185 5,098 5,058 5,200 5,115 Cash dividends paid per share (1) $ 0.28 $ 0.10 $ - $ 0.14 $ 0.10 PERFORMANCE RATIOS (annualized for the three months) Return on average assets 1.18 % 1.20 % 1.02 % 0.61 % 1.27 % Return on average equity 15.4 % 16.1 % 14.6 % 8.0 % 17.2 % Yield on earning assets 4.50 % 4.39 % 4.34 % 4.43 % 4.35 % Rate paid on interest-bearing liabilities 0.27 % 0.29 % 0.36 % 0.26 % 0.28 % Net interest margin 4.35 % 4.21 % 4.10 % 4.28 % 4.18 % Noninterest income to average assets 1.19 % 1.23 % 1.35 % 0.89 % 1.17 % Noninterest expense to average assets 2.89 % 3.00 % 3.23 % 2.68 % 2.81 % Efficiency ratio 55.5 % 58.9 % 63.5 % 55.2 % 56.1 % 12/31/2017 12/31/2016 12/31/2015 CREDIT QUALITY RATIOS AND DATA Allowance for loan losses $ 6,669 $ 6,549 $ 6,078 Allowance for loan losses as a percentage of total loans 1.37 % 1.42 % 1.52 % Nonperforming loans $ 3,022 $ 2,724 $ 4,546 Nonperforming assets $ 4,401 $ 3,471 $ 6,332 Nonperforming loans as a percentage of total loans 0.62 % 0.59 % 1.13 % Nonperforming assets as a percentage of total assets 0.59 % 0.53 % 1.06 % Net charge-offs $ 480 $ 329 $ 473 Net charge-offs as a percentage of average loans 0.10 % 0.08 % 0.12 % CAPITAL AND OTHER DATA Common shares outstanding at end of period 5,065 4,897 4,835 Tangible common equity $ 55,619 $ 47,907 $ 42,402 Tangible book value per common share $ 10.98 $ 9.78 $ 8.77 Tangible common equity to total assets 7.5 % 7.3 % 7.1 % Gross loans to deposits 73.4 % 79.2 % 76.0 % PLUMAS BANK REGULATORY CAPITAL RATIOS Tier 1 Leverage Ratio 8.8 % 9.2 % 9.4 % Common Equity Tier 1 Ratio 12.0 % 12.1 % 12.7 % Tier 1 Risk-Based Capital Ratio 12.0 % 12.1 % 12.7 % Total Risk-Based Capital Ratio 13.2 % 13.3 % 14.0 % (1) The Company paid a semi-annual dividend of 14 cents per share on November 15, 2017 and May 15, 2017 and 10 cents per share on November 21,2016.\nSource:Plumas Bancorp", "external_links": ["https://www.globenewswire.com/Tracker?data=W6Ryl3Hj3hl214aCa7pOJAm21vAZaMJr06WekTlfVCsoV48xd-W5UX4nOXZdOnMB9b0GeR8pEFliyMpbfdyDz8zxazzxbdJYm6npfGjxt80=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/efc65cd8-6154-4823-9a8e-fcd23d0c9e08", "https://www.globenewswire.com/Tracker?data=lT9rQgZBeoAEKTQUex4z5OCNtgxOu14ByXUoXuix0VqNPQYSGzDuSQhQAhYxUxjc5-QvhscNokrFpOZensodWeu7wk8yLPl1JwRbEUwkjSYVCLIQyZOJ0A46k9D_tmRl"], "published": "2018-01-23T17:00:00.000+02:00", "crawled": "2018-01-23T17:50:28.000+02:00", "highlightTitle": ""}