{"organizations": [], "uuid": "7b124bd004f8b6ae338d4fd35589a405b19b1a80", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-waste-management-projected-market-growth-to-top-560-billion-fueled-by-integrated-and-disruptive-smart-waste-technologies.html", "country": "US", "domain_rank": 767, "title": "Waste Management Projected Market Growth to Top $560 Billion Fueled By Integrated and Disruptive Smart Waste Technologies", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T16:50:00.000+02:00", "replies_count": 0, "uuid": "7b124bd004f8b6ae338d4fd35589a405b19b1a80"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-waste-management-projected-market-growth-to-top-560-billion-fueled-by-integrated-and-disruptive-smart-waste-technologies.html", "ord_in_thread": 0, "title": "Waste Management Projected Market Growth to Top $560 Billion Fueled By Integrated and Disruptive Smart Waste Technologies", "locations": [], "entities": {"persons": [], "locations": [{"name": "florida", "sentiment": "none"}], "organizations": [{"name": "integrated and disruptive smart waste technologies palm beach", "sentiment": "negative"}, {"name": "biohitech global, inc.", "sentiment": "none"}, {"name": "covanta holding corporation", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "casella waste systems inc.", "sentiment": "none"}, {"name": "cva", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PALM BEACH, Florida, January 30, 2018 /PRNewswire/ --\nMarketNewsUpdates.com News Commentary\nThe global waste management industry is forecast to swell past $560 billion by 2020 ,according to Statista.com , as the sector experiences significant growth fueled by a number of factors. One of those factors is the development of innovative technologies and advanced waste collection solutions to enhance collection processes, as well as aid in developing a more green planet. Ample opportunity exists worldwide for smart solutions that can increase efficiency and improve the quality of waste collection services. The waste management market has emerged as amongst the most swiftly developing market. Some of the prominent trends that the market is witnessing include technological advancements, expanding medical waste management services, lack of stringent regulations in developing countries and rising government initiatives. Industry Active companies in the news this week include BioHiTech Global, Inc. (OTC: BHTG), Covanta Holding Corporation (NYSE: CVA), Casella Waste Systems Inc. (NASDAQ: CWST), Waste Management Inc. (NYSE: WM), Republic Services Inc. (NYSE: RSG).\nBioHiTech Global, Inc. (OTCQB: BHTG), a green technology company that develops and deploys cost effective, innovative and disruptive waste management technologies, partners with Kinderhook Industries (\"Kinderhook\"), a private investment firm that manages over $2 billion of committed capital, to create a \"next generation\" environmental services platform company.\nThrough a series of transactions, the two companies completed the acquisition of Gold Medal Services, LLC, a market leader in municipal, commercial, and industrial solid waste collection in the Philadelphia and Southern New Jersey markets as a wholly owned subsidiary of Gold Medal Group, LLC (\"Gold Medal\"), a newly formed company majority owned by Kinderhook. BioHiTech acquired a 9.2% interest in Gold Medal in exchange for 500,000 shares of common stock. The Company also has an option to acquire an additional $5M interest in Gold Medal over the next 12 months. BioHiTech also entered into a management services agreement, with Gold Medal to provide executive oversight of its operations for fees of $750,000 per year, leveraging the significant experience and proven leadership skills of BioHiTech's management team in the waste service industry. Together, the companies intend to lead a revolutionary transformation of Gold Medal from a traditional waste disposal company to a technology driven, vertically integrated, sustainable waste services provider. Read this and more news for BHTG at http://www.marketnewsupdates.com/news/bhtg.html\n\"I am pleased to partner with Cor Carruthers, Rob Michalik, and the visionary private equity team at Kinderhook,\" stated Frank E. Celli, Chief Executive Officer of BioHiTech Global. \"Their extensive experience in environmental services and emerging technologies, coupled with their significant financial resources, make them a valuable partner for BioHiTech as we begin to utilize our proprietary technology to set a new standard for sustainable and cost-effective waste disposal in the United States.\"\nBioHiTech sees its investment in Gold Medal and ongoing management services agreement benefiting the Company in several key areas. Gold Medal's footprint of over 6,000 commercial and industrial customer locations in Southern New Jersey and the Philadelphia marketplace, including numerous food waste generators, provides an attractive distribution platform for BioHiTech's on-site Digesters while its municipal waste collection business can offer a significant source of future feedstock for the Company's planned HEBioT facilities. Gold Medal also provides a platform, in one of the most attractive markets in the United States, for Kinderhook and BioHiTech to build a much larger vertically integrated waste services company through organic growth and opportunistic acquisition.\n\"We are excited to partner with Frank and BioHiTech as we look to increase our financial presence in this industry,\" stated Corwynne Carruthers, Managing Director of Kinderhook Industries. \"By marrying BioHiTech's cost effective technology and management experience with Gold Medal's business, we believe we have created a platform company with the opportunity to expand on our initial investment and create a best in class, sustainable environmental services company throughout the Mid-Atlantic States.\"\nAdditional waste management announcements include:\nCovanta Holding Corporation (NYSE: CVA) announced on Monday that the Rookery South Energy Recovery Facility (\"Rookery\") has been granted an environmental permit by the UK Environment Agency (\"EA\"). Issuance of the permit follows a detailed review and consultation process by the EA. The Rookery project, located in Bedfordshire, UK, will convert over 500,000 tonnes of residual waste per year into approximately 60 megawatts of low carbon energy - enough electricity to meet the needs of 75,000 homes. Site preparation work has begun with full construction anticipated to follow by mid-2018, in conjunction with financial close. The project is expected to be fully operational in 2021. \"Receipt of the environmental permit represents one of the final hurdles before we move into full construction of the Rookery project,\" said Matthew Mulcahy, Covanta Executive Vice President and Head of Corporate Development. \"The facility represents critical waste infrastructure that will help the U.K. achieve national recovery, recycling and renewable energy targets. We are pleased with the progress we have made to reach this point and look forward to bringing this project to completion.\"\nCasella Waste Systems Inc. (NASDAQ: CWST) recently announced hat it has acquired all of the outstanding stock of Complete Disposal Company, Inc. and its subsidiary United Material Management of Holyoke, Inc. (collectively, \"Complete\"), for a total consideration of up to $16.5 million. The acquisition closed on January 2, 2018. Complete is an integrated solid waste services provider in the greater Holyoke, MA marketplace. Complete provides residential and roll-off collection services, operates a construction & demolition processing facility, and operates a 750 tons per day solid waste transfer station with both truck and rail transfer capabilities. Complete is expected to generate approximately $17.0 million of revenues in 2018. Also, on December 29, 2017, Casella acquired the commercial and residential collection assets from a hauler in Vermont for a total consideration of up to $1.8 million.\nRepublic Services Inc. (NYSE: RSG) closed down slightly on Monday at $68.44 trading over 750,000 shares by the market close. Republic Services will release its fourth quarter 2017 financial results on Thursday, Feb. 8, 2018, after the market closes, and will host an investor conference call at 5 p.m. ET. A live audio webcast of the conference call can be accessed by logging onto the Company's Investor Relations page on RepublicServices.com or listeners may access the call by dialing 844-890-1789 or 412-717-9598, passcode \"Republic Services\". Republic Services, Inc. is an industry leader in U.S. recycling and non-hazardous solid waste disposal. Through its subsidiaries, Republic's collection companies, recycling centers, transfer stations and landfills focus on providing effective solutions to make proper waste disposal effortless for their 14 million customers.\nWaste Management Inc. (NYSE: WM) closed down slightly on Monday at $88.22 trading over 1.5 Million shares by the market close. Waste Management was recently recognized as a '2018 Best Companies for Millennials\" by The Women's Choice Award. \"We are very honored to be recognized by The Women's Choice Award,\" said Jim Fish, president and chief executive officer of Waste Management. \"I am truly proud of the hard-working women who help us serve our customers and thrive as a company.\" The Women's Choice Award for Best Companies to Work For is the only award that reflects the needs and preferences of women based on publicly available data, which aligns with employee and consumer appreciation for corporate transparency. Data was compiled from a variety of publicly available sources and then weighed accordingly for each of the three categories. Waste Management is the largest environmental solutions provider in North America, serving more than 21 million municipal, commercial and industrial customers in the U.S. and Canada. Waste Management is North America's largest residential recycler and a renewable energy provider.\nDISCLAIMER: MarketNewsUpdates.com (MNU) is a third party publisher and news dissemination service provider, which disseminates electronic information through multiple online media channels. MNU is NOT affiliated in any manner with any company mentioned herein. MNU and its affiliated companies are a news dissemination solutions provider and are NOT a registered broker/dealer/analyst/adviser, holds no investment licenses and may NOT sell, offer to sell or offer to buy any security. MNU's market updates, news alerts and corporate profiles are NOT a solicitation or recommendation to buy, sell or hold securities. The material in this release is intended to be strictly informational and is NEVER to be construed or interpreted as research material. All readers are strongly urged to perform research and due diligence on their own and consult a licensed financial professional before considering any level of investing in stocks. All material included herein is republished content and details which were previously disseminated by the companies mentioned in this release. MNU is not liable for any investment decisions by its readers or subscribers. Investors are cautioned that they may lose all or a portion of their investment when investing in stocks. For current services performed MNU has been compensated twenty three hundred dollars for news coverage of the current press release issued by BioHiTech Global, Inc. by the company. MNU HOLDS NO SHARES OF ANY COMPANY NAMED IN THIS RELEASE.\nThis release contains \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E the Securities Exchange Act of 1934, as amended and such forward-looking statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. \"Forward-looking statements\" describe future expectations, plans, results, or strategies and are generally preceded by words such as \"may\", \"future\", \"plan\" or \"planned\", \"will\" or \"should\", \"expected,\" \"anticipates\", \"draft\", \"eventually\" or \"projected\". You are cautioned that such statements are subject to a multitude of risks and uncertainties that could cause future circumstances, events, or results to differ materially from those projected in the forward-looking statements, including the risks that actual results may differ materially from those projected in the forward-looking statements as a result of various factors, and other risks identified in a company's annual report on Form 10-K or 10-KSB and other filings made by such company with the Securities and Exchange Commission. You should consider these factors in evaluating the forward-looking statements included herein, and not place undue reliance on such statements. The forward-looking statements in this release are made as of the date hereof and MNU undertakes no obligation to update such statements.\nContact Information:\nMedia Contact email:\ninfo@marketnewsupdates.com\n+1(561)325-8757\nSOURCE MarketNewsUpdates.com", "external_links": ["http://www.marketnewsupdates.com/news/bhtg.html"], "published": "2018-01-30T16:50:00.000+02:00", "crawled": "2018-01-30T18:31:03.014+02:00", "highlightTitle": ""}