{"organizations": [], "uuid": "f52811ad50e013b96c9d83a236ab4e356be57343", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225127895&w=1200&r=LYNXMPEE0O0ST", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-raytheon-results/raytheons-quarterly-revenue-rises-8-percent-idUSKBN1FE1JF", "country": "US", "domain_rank": 408, "title": "Raytheon's quarterly revenue rises 8 pct", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T13:55:00.000+02:00", "replies_count": 0, "uuid": "f52811ad50e013b96c9d83a236ab4e356be57343"}, "author": "", "url": "https://www.reuters.com/article/us-raytheon-results/raytheons-quarterly-revenue-rises-8-percent-idUSKBN1FE1JF", "ord_in_thread": 0, "title": "Raytheon's quarterly revenue rises 8 pct", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "raytheon", "sentiment": "negative"}, {"name": "raytheon co", "sentiment": "none"}, {"name": "thomson reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Tomahawk missile maker Raytheon Co ( RTN.N ) said on Thursday a recent U.S. corporate tax cut allowed it to pre-pay some 2018 pension obligations, freeing up funds the company can return to shareholders.\nThe tax cut windfall also spurred Raytheon to boost its earnings forecasts for 2018 well above analyst estimates as it reported an 8 percent rise in revenue, sending its shares up 2 percent in midday trading.\nThe $1 billion pre-tax discretionary pension plan contribution at the end of 2017 pushed cash flow projections for 2018 up by half a billion dollars, giving the maker of Patriot missile defenses ample room to continue its target of returning 80 percent of free cash to shareholders.\nThe company said it will focus on “returning capital to shareholders through share buy backs and dividends, making small targeted acquisitions that fit our technology and global growth needs,” said Raytheon’s finance chief, Toby O‘Brien.\nOther companies with pension plans were also expected to use the tax cut windfall to front-load pension contributions before tax rates fall in 2018.\nIndeed, Lockheed Martin Co’s ( LMT.N ) chief financial officer, during a third-quarter conference call with analysts, said his company was contemplating such a move. Lockheed will announce results on Monday.\nWaltham, Massachusetts-based Raytheon, whose shares touched an all time high of $204.38 on Thursday, stands to benefit from higher overall U.S. defense spending under President Donald Trump’s and form U.S. allies.\nA lower effective tax rate in 2018 prompted the U.S. defense contractor to forecast full-year earnings per share from continuing operations in the range of $9.55 to $9.75, much higher than the average analyst estimate of $8.87.\nRaytheon’s overall sales rose to $6.78 billion in the quarter, from $6.28 billion a year earlier, narrowly missing analyst estimates for $6.81 billion.\nHowever, income from continuing operations attributable to Raytheon fell to $393 million, or $1.35 per share, from $555 million, or $1.87 per share, a year earlier.\n“We are really pleased with the results we announced here for closing out 2017, and certainly the guidance that we gave for 2018,” O‘Brien told Reuters in an interview as the company reported a record $25.3 billion in sales for the year.\nThe weapons maker said its 2018 net sales would increase 4 to 6 percent to a range of $26.4 billion-$26.9 billion, against analyst expectations for $26.63 billion, according to Thomson Reuters I/B/E/S.\nThe company expects 2018 operating cash flow from continuing operations to be between $3.6 billion and $4.0 billion, compared with $2.7 billion in 2017.\nAbout 40 percent of Raytheon’s order backlog was from non-U.S. customers, helping the company diversify its sources of revenue. O‘Brien told Reuters recent changes to the U.S. tax code were already making Raytheon “more globally competitive.”\nSales at Raytheon’s missile systems unit, its biggest by revenue, grew 15.2 percent to about $2.19 billion in the quarter ended Dec. 31, as it sold more medium-range air-to-air missiles, Paveway laser-guided bombs and SM-3 anti-ballistic missiles.\nSales in space and airborne systems, its second-biggest by revenue, rose 4.4 percent to $1.67 billion, with more airborne radars sold.\nThe unit makes electronic warfare systems for tactical aircraft, helicopters and ships, as well as tracking and navigation sensors used on airborne platforms.\nBesides the front-loaded pension contributions, Raytheon had another unanticipated U.S. tax reform-related charge in the fourth quarter, including $171 million that was not included in the company’s prior forecast.\nReporting by Mike Stone in Washington and Ankit Ajmera in Bengaluru; Editing by Bernadette Baum\n ", "external_links": [], "published": "2018-01-25T13:55:00.000+02:00", "crawled": "2018-01-25T14:13:10.001+02:00", "highlightTitle": ""}