{"organizations": [], "uuid": "87245361c272472e80e685f06d730afec34eb8ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180120&t=2&i=1223593850&w=1200&r=LYNXMPEE0J0BX", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-tennis-ausopen-djokovic/djokovic-rolls-by-ramos-vinolas-to-reach-fourth-round-idUSKBN1F90FN", "country": "US", "domain_rank": 408, "title": "Djokovic rolls by Ramos-Vinolas to reach fourth round", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T13:07:00.000+02:00", "replies_count": 0, "uuid": "87245361c272472e80e685f06d730afec34eb8ab"}, "author": "", "url": "https://www.reuters.com/article/us-tennis-ausopen-djokovic/djokovic-rolls-by-ramos-vinolas-to-reach-fourth-round-idUSKBN1F90FN", "ord_in_thread": 0, "title": "Djokovic rolls by Ramos-Vinolas to reach fourth round", "locations": [], "entities": {"persons": [{"name": "ramos-vinolas", "sentiment": "negative"}, {"name": "djokovic", "sentiment": "negative"}, {"name": "sudipto ganguly", "sentiment": "none"}, {"name": "albert ramos-vinolas", "sentiment": "none"}, {"name": "novak djokovic", "sentiment": "none"}, {"name": "chung hyeon", "sentiment": "none"}, {"name": "margaret court arena", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}], "organizations": [{"name": "min read  melbourne", "sentiment": "none"}, {"name": "ransom", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 20, 2018 / 11:09 AM / Updated 36 minutes ago Djokovic shrugs off injury scare to reach fourth round Ian Ransom 3 Min Read \nMELBOURNE (Reuters) - Novak Djokovic allayed fears over a muscle strain in his lower back after overpowering Spaniard Albert Ramos-Vinolas 6-2 6-3 6-3 to reach the Australian Open fourth round of on Saturday. \nAfter holding serve to lead 2-1 in the second set, the 14th seed took a medical time-out and lay down at the Margaret Court Arena as a trainer worked feverishly on his lower back. \nThe injury did little to restrict the six-times Australian Open champion as the Serb returned to break the 21st seed in the next game before claiming victory in two hours and 21 minutes. \n“Nothing major,” Djokovic told reporters after setting up an intriguing inter-generational battle with South Korea’s young gun Chung Hyeon, 21, for a place in the quarter-finals. \n“I knew I wanted to use the medical timeout because I needed it, but at the same time I knew it was nothing major that can potentially raise the question mark on whether I can continue playing or not,” he added. \n“I haven’t played for six months. We have to take that into consideration. I‘m kind of forced to be very cautious of what happens day-to-day. I deal with it. It’s fine. I finished the match. I‘m very pleased for that.” \nAfter arriving without a competitive match in six months, the 12-times grand slam champion has had three impressive wins, including a taxing four-set scrap in broiling 40 degree Celsius (104F) heat against Frenchman Gael Monfils in the last round. \nThe 30-year-old’s recovery from a serious elbow problem has meant fashioning a modified service action but the Serb has still proven very hard to break. Tennis - Australian Open - Margaret Court Arena, Melbourne, Australia, January 20, 2018. Serbia's Novak Djokovic celebrates winning his match against Spain's Albert Ramos-Vinolas. REUTERS/Issei Kato \nHe landed just over 60 percent of his first serves against Ramos-Vinales, but held firm against the lefthander through six break points. MORE HUMBLE \n“Obviously for me, it’s taking one match at a time,” Djokovic said in his on-court interview. Slideshow (4 Images) \n“I have to be more humble this time with my expectations because I haven’t played in six months. But I‘m very pleased with where my game is at.” \nDjokovic gave Chung a grand slam lesson in the first round in 2016 on the way to the last of his Melbourne Park titles so the re-match may say a lot about the trajectories of both players. \nChung showed another sign of his promise by coolly closing out a five-set win over German fourth seed Alexander Zverev, a player many pundits have widely tipped as a future grand slam winner. \n“I‘m really pleased with where my game is at at the moment. I‘m looking forward to the next challenge,” said Djokovic. \n”He (Chung) is playing great. He’s fit. He doesn’t have too many holes in his game. He’s very nice guy. You can see he’s a hard worker. It pays off. \n“Into the second week, it’s going to be a game of small margins. So let’s see what happens.” Editing by Sudipto Ganguly and Ken Ferris", "external_links": [], "published": "2018-01-20T13:07:00.000+02:00", "crawled": "2018-01-20T13:31:17.001+02:00", "highlightTitle": ""}