{"organizations": [], "uuid": "876318cfbb78d4d2d39780bdce68d94f184228a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180130.html", "section_title": "Archive News &amp; Video for Tuesday, 30 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/germany-economy-inflation/mixed-german-regional-inflation-data-backs-up-ecbs-cautious-approach-idUSL8N1PP39Z", "country": "US", "domain_rank": 408, "title": "Mixed German regional inflation data backs up ECB's cautious approach", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T19:28:00.000+02:00", "replies_count": 0, "uuid": "876318cfbb78d4d2d39780bdce68d94f184228a7"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/germany-economy-inflation/mixed-german-regional-inflation-data-backs-up-ecbs-cautious-approach-idUSL8N1PP39Z", "ord_in_thread": 0, "title": "Mixed German regional inflation data backs up ECB's cautious approach", "locations": [], "entities": {"persons": [{"name": "mario draghi", "sentiment": "none"}, {"name": "peter praet", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "saxony", "sentiment": "none"}, {"name": "bavari", "sentiment": "none"}, {"name": "north rhine-westphalia", "sentiment": "none"}, {"name": "baden-wuerttemberg", "sentiment": "none"}, {"name": "hesse", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "ecb", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BERLIN, Jan 30 (Reuters) - Inflation in Germany’s most populous state remained unchanged on the year in January and fell in three other regions, data showed on Tuesday, lending support to the European Central Bank’s caution in reducing stimulus further.\nECB chief Mario Draghi last week pushed back on rate hike expectations, arguing there was almost no chance of a move this year, even as some investors were betting on a rise as early as December.\nPeter Praet, the ECB’s chief economist, also struck a cautious tone on Monday when he said the central bank would only stop pumping cash into the euro zone economy when it was confident that inflation was heading towards its target of just below two percent even without its extra help.\nIn a sign that price pressures remain moderate even in Germany, the euro zone’s largest economy, despite solid growth, consumer price inflation in the German state of North Rhine-Westphalia was flat at 1.5 percent on the year in January, regional data showed.\nAnnual inflation fell in the states of Baden-Wuerttemberg, Hesse and Saxony while it edged up in Bavaria and Brandenburg, the data showed.\n“It’s a mixed bag. But there is a chance that the national inflation figure could come in a bit weaker than expected,” Capital Economics analyst Jennifer McKeown said.\nThe state readings, which are not harmonised to compare with other euro zone countries, will feed into nationwide inflation data due at 1300 GMT.\nA Reuters poll conducted before the release of the regional data suggested Germany’s harmonised consumer price inflation rate would remain unchanged at 1.6 percent in January.\nThe euro zone will publish preliminary inflation data on Wednesday, with the annual rate expected to edge down to 1.3 percent in January from 1.4 percent in December according to Reuters polls.\nThe ECB confirmed last week that it will continue buying bonds at least until September and for as long as inflation is not on a sustained path towards it target. It also pledged to keep rates at their current, ultra-low levels for long after those purchases stop.\nInflation in the euro zone is comfortably above one percent but it is not expected to hit the ECB’s target for years to come.\nHawks among the ECB rate-setters, including the German representative on the central bank’s policymaking body, Bundesbank head Jens Weidmann, have argued that it would be “appropriate” for the ECB to stop its bond purchases before the end of this year.\nWeidmann and other rate-setters have been blaming the ECB’s 2.55 trillion-euro ($3.17 trillion) bond-buying programme for fuelling bubbles in the property and bond markets.\n$1 = 0.8052 euros Reporting by Michael Nienaber,Editing by William Maclean\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T19:28:00.000+02:00", "crawled": "2018-01-31T16:21:55.006+02:00", "highlightTitle": ""}