{"organizations": [], "uuid": "1b68d0a97950501637ac9fa9fd842f969b5eec39", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180115.html", "section_title": "Archive News &amp; Video for Monday, 15 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-olympics-2018-sno-parrot/snowboarding-at-the-games-is-about-fun-not-glory-says-parrot-idUSKBN1F41SJ", "country": "US", "domain_rank": 408, "title": "Snowboarding at the Games is about fun, not glory, says Parrot", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-15T22:05:00.000+02:00", "replies_count": 0, "uuid": "1b68d0a97950501637ac9fa9fd842f969b5eec39"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-olympics-2018-sno-parrot/snowboarding-at-the-games-is-about-fun-not-glory-says-parrot-idUSKBN1F41SJ", "ord_in_thread": 0, "title": "Snowboarding at the Games is about fun, not glory, says Parrot", "locations": [], "entities": {"persons": [{"name": "max parrot", "sentiment": "negative"}, {"name": "parrot", "sentiment": "negative"}, {"name": "mcmorris", "sentiment": "none"}, {"name": "ståle sandbech", "sentiment": "none"}, {"name": "mark mcmorris", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "quebec", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Max Parrot heads to Pyeongchang as one of Canada’s best medal hopes of the 2018 Winter Olympics but all the snowboarder wants to do is put on a show. Winning gold would simply be a bonus.\nFor many, the battle for freestyle snowboarding gold medals comes down to four-time X Games champion Parrot and compatriot Mark McMorris, as well as Sochi silver medalist Ståle Sandbech.\nMcMorris and Parrot dominated the 2017 season, finishing first and second in the overall freestyle World Cup rankings. McMorris was third in the Sochi slopestyle final four years ago while Parrot was fifth.\nA rivalry between the two men may leap off the page when reading results over the past few seasons, but that is not how Parrot sees their competition.\n“If you have seen the results of the past few years, it is often either McMorris first, me second or the opposite. We are always battling for first or second and a lot of people see that we would be in competition,” Parrot told Reuters from Quebec at the beginning of the season.\n“Yes we are in a way but in the end it always comes down to doing your own thing. I do my runs for myself and he does his runs for himself and we don’t do it to beat each other.”\nThis lack of competitive spirit may come as a surprise for those used to the fiercely driven nature of professional sport.\nHowever, for Parrot it is exactly what makes snowboarding unique.\nBefore the entry of slopestyle into the Olympics in Sochi and the big air event this time around in Pyeongchang, there were discussions in the snowboarding community about the direction of the sport and whether competing in the Olympics went against snowboarding’s carefree history and lifestyle.\n“We have had many, many discussions with all the other snowboarders in the world and all what we want is not to take the joy away,” said Parrot.\n”There is not rivalry in snowboarding and that is what I love about it.\n“Snowboarding is fun and we have to keep it this way. We are not in contest with each other. It is a fun sport and that is what we want to show the world.”\nCHANCE TO IMPRESS Parrot sees the Olympics as the perfect opportunity to show off his skills to a wider audience and help grow the sport.\nWhile the Olympics have a broad appeal, the X Games and other snowboarding events tend to have a small yet loyal fan base of extreme sports enthusiasts, he said.\n“For snowboarding it is not about beating the others but more about putting down your tricks. It is more like a show and I have just fallen in love with that,” said the 23-year-old.\nThe introduction of big air to the Olympics gives freestyle snowboarders another chance to impress the millions of people watching the event.\nParrot, who says he prefers big air and is the reigning X Games champion in the discipline, thinks the daredevil stunts produced on the massive jump will endear snowboarding to a new generation of fans.\n“So far, all the big airs we have done around the world we have had thousands of people watching and it is a really great show. I think people on TV will really like it,” said Parrot.\n“For me to be snowboarding twice at an Olympics means a lot because I get to inspire more people to start snowboarding.”\nEditing by Peter Rutherford\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T22:05:00.000+02:00", "crawled": "2018-01-16T13:14:16.002+02:00", "highlightTitle": ""}