{"organizations": [], "uuid": "ba9e092c54361ffbc1ed088c4fcac26ae83bc155", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/29/104866208-GettyImages-881258254-north-korea.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/02/trump-says-sanctions-are-having-an-effect-on-north-korea.html", "country": "US", "domain_rank": 767, "title": "Trump says sanctions are having an effect on North Korea", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.299, "site_type": "news", "published": "2018-01-02T16:57:00.000+02:00", "replies_count": 0, "uuid": "ba9e092c54361ffbc1ed088c4fcac26ae83bc155"}, "author": "Jacob Pramuk", "url": "https://www.cnbc.com/2018/01/02/trump-says-sanctions-are-having-an-effect-on-north-korea.html", "ord_in_thread": 0, "title": "Trump says sanctions are having an effect on North Korea", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "kim jong-un", "sentiment": "none"}], "locations": [{"name": "north korea", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "pyongyang", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump said Tuesday that sanctions on North Korea are \"beginning to have a big impact\" following news of proposed talks between Pyongyang and South Korea.\n\"Perhaps that is good news, perhaps not — we will see!\" Trump tweeted about the possible dialogue between the neighbors.\nTrump tweet: Sanctions and \"other\" pressures are beginning to have a big impact on North Korea. Soldiers are dangerously fleeing to South Korea. Rocket man now wants to talk to South Korea for first time. Perhaps that is good news, perhaps not - we will see!\nThe United States and allies including South Korea and Japan have put increasing economic pressure on Kim Jong Un's rogue dictatorship amid its nuclear and missile development. North Korea conducted its sixth nuclear test last year. In November, Pyongyang conducted the latest in a string of missile tests, and the device flew farther than any of its previous missiles.\nIn his New Year's Day address, Kim said \"the entire United States is within range of our nuclear weapons, a nuclear button is always on my desk.\" Despite the threat, he floated the possibility of talks with South Korea when the country hosts the Winter Olympics next month.\nshow chapters Russian tankers supplied fuel to North Korea on at least 3 occasions -Reuters 4:19 PM ET Fri, 29 Dec 2017 | 00:38 On Tuesday, Seoul proposed holding talks with North Korea near their shared border next week.\nThrough sanctions, the United Nations has aimed to limit the supply of oil going to North Korea in an effort to curb its nuclear and missile programs. In recent days, South Korea has said it has seized two ships suspected of transferring oil to the regime in violation of sanctions .\nLast week, Trump sent a warning to China following reports that Beijing allowed oil to go into North Korea. China has denied illegally providing oil.\nReuters separately reported that Russian tankers supplied oil to North Korea , though there is no evidence yet that the Russian state backed the shipments, according to the wire service.\nIt is unclear if the ships seized by South Korea are linked to the alleged Chinese and Russian transactions.\nOn Tuesday, White House press secretary Sarah Sanders said Trump seeks a \"denuclearized peninsula\" and is leaving all options on the table.", "external_links": [], "published": "2018-01-02T16:57:00.000+02:00", "crawled": "2018-01-02T16:57:16.017+02:00", "highlightTitle": ""}