{"organizations": [], "uuid": "2d3ec5be8d15529d0d2fba38d69eb4f27ea83a94", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INcricketNews", "section_title": "Reuters: Cricket News", "url": "https://in.reuters.com/article/cricket-test-afghanistan-india/cricket-afghanistan-to-make-test-debut-in-june-against-india-idINKBN1F521C", "country": "US", "domain_rank": 408, "title": "Cricket-Afghanistan to make test debut in June against India", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T17:56:00.000+02:00", "replies_count": 0, "uuid": "2d3ec5be8d15529d0d2fba38d69eb4f27ea83a94"}, "author": "", "url": "https://in.reuters.com/article/cricket-test-afghanistan-india/cricket-afghanistan-to-make-test-debut-in-june-against-india-idINKBN1F521C", "ord_in_thread": 0, "title": "Cricket-Afghanistan to make test debut in June against India", "locations": [], "entities": {"persons": [{"name": "amitabh choudhary", "sentiment": "none"}, {"name": "bengaluru", "sentiment": "none"}, {"name": "choudhary", "sentiment": "none"}], "locations": [{"name": "afghanistan", "sentiment": "none"}, {"name": "new delhi", "sentiment": "none"}, {"name": "bengaluru", "sentiment": "none"}, {"name": "greater noida", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "new delhi", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "india amlan chakraborty", "sentiment": "none"}, {"name": "international cricket council", "sentiment": "none"}, {"name": "bcci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW DELHI (Reuters) - Afghanistan will play their inaugural test match in June in Bengaluru against neighbours India, the cricket boards announced on Tuesday.\nAfghanistan and Ireland joined the ranks of full member nations of the International Cricket Council last June, taking the total number of test-playing countries to 12.\nThe Indian board (BCCI) has consistently backed Afghanistan, who played a home match against Ireland last year at a stadium in Greater Noida, on the outskirts of New Delhi.\n“Afghanistan and India have been traditional friends, even diplomatically, for ages and it’s only appropriate that Afghanistan opened its international innings in India,” BCCI acting secretary Amitabh Choudhary told reporters.\nChoudhary said Bengaluru was the obvious choice to stage the match bearing in mind the expected weather conditions in other parts of the country in June.\n“At that point of time in the year, there will be rains almost everywhere, and where there will not be rain, there will be such heat that cricket would be practically impossible during day time,” he said.\nCricket has a long history in Afghanistan but the country only gained full one-day international (ODI) status in 2011.\nIn 2015, still suffering from the impact of war and conflict, Afghanistan took part in their first 50-over World Cup and they have also played in the World Twenty20 competition.\n“The historic friendship and relations between India and Afghanistan go back to centuries. I‘m glad that cricket is now added as another layer,” Afghanistan Cricket Board (ACB) chairman Atif Mashal said.\n“The support BCCI has provided to ACB in the last several years has been tremendous - whether it’s backing Afghanistan in ICC while our application for full membership was under consideration, making the facilities available for us, technical assistance. We really recognise it and appreciate it.”\nACB chief executive Shafiq Stanikzai said the June test will be a dream-come-true for the Afghanistan players, and would trigger the sport’s growth.\n“Cricket has a bright future in Afghanistan. We have raw talents, the only thing is we need is to polish them and give them proper exposure,” he said.\n“Our target is to be a competitive side in test cricket in the coming three years.”\nReporting by Amlan Chakraborty in New Delhi,; editing by Ed Osmond\n ", "external_links": [], "published": "2018-01-16T17:56:00.000+02:00", "crawled": "2018-01-16T18:33:41.013+02:00", "highlightTitle": ""}