{"organizations": [], "uuid": "e82d95d22c80f1d8adbf331ace58d6fe33e53ecf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-borqs-technologies-signs-letter-of-intent-to-acquire-electric-vehicle-control-company.html", "country": "US", "domain_rank": 767, "title": "Borqs Technologies Signs Letter of Intent to Acquire Electric Vehicle Control Company", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T17:00:00.000+02:00", "replies_count": 0, "uuid": "e82d95d22c80f1d8adbf331ace58d6fe33e53ecf"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-borqs-technologies-signs-letter-of-intent-to-acquire-electric-vehicle-control-company.html", "ord_in_thread": 0, "title": "Borqs Technologies Signs Letter of Intent to Acquire Electric Vehicle Control Company", "locations": [], "entities": {"persons": [{"name": "hu lin", "sentiment": "none"}, {"name": "kadi", "sentiment": "none"}, {"name": "shenz", "sentiment": "none"}], "locations": [{"name": "santa clara", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "borqs technologies signs letter of intent to acquire electric vehicle control company", "sentiment": "negative"}, {"name": "borqs technologies, inc.", "sentiment": "neutral"}, {"name": "shanghai volkswagen", "sentiment": "none"}, {"name": "obc", "sentiment": "none"}, {"name": "volkswagen", "sentiment": "none"}, {"name": "shanghai kadi machinery technology co., ltd", "sentiment": "none"}, {"name": "chery", "sentiment": "none"}, {"name": "dong feng motors", "sentiment": "none"}, {"name": "kadi", "sentiment": "none"}, {"name": "trw", "sentiment": "none"}, {"name": "vcu", "sentiment": "none"}, {"name": "geely auto", "sentiment": "none"}, {"name": "delphi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SANTA CLARA, Calif., Jan. 10, 2018 (GLOBE NEWSWIRE) -- Borqs Technologies, Inc. (Nasdaq:BRQS) (the “Company”), a global leader in embedded software and products for the Internet of Things (IoT), announces the signing of a Letter of Intent (“LOI”) to acquire 60% of Shanghai KADI Machinery Technology Co., Ltd (“KADI”).\nKADI was found in 2006 and develops embedded software and hardware for core electric control modules of electric vehicle (“EV”). KADI’s current products include DCDT (boost function), OBC (charger system), BMS (battery management system) and VCU (main controls). Since its formation, KADI has partnered with the leading automotive companies of China, including Geely Auto, TRW, Chery, Dong Feng Motors, and Shanghai Volkswagen. The founder of KADI, Dr. Hu Lin, is a veteran in China’s automotive industry with near 20 years of professional experience working with world-renowned entities including Volkswagen and Delphi.\nKADI has been awarded a Rmb 320 million (US$48.5 million) supply contract for its core electric control modules from a key automotive contractor in China, Shenzhen Espirit Technology Co., Ltd. The products are to be delivered between 2018 through 2020 and include all of KADI’s software imbedded modules of DCDT, OBC, BMS and VCU.\nThe Board of Directors of Borqs sees synergy between KADI’s products and Borqs’ existing automobile in-vehicle-infotainment (IVI) solutions, in terms of sales and distribution, and R&D. Borqs anticipates that the experience of Borqs’ software engineers will enhance KADI’s R&D capabilities while Borqs’ supply chain management team will ensure efficient delivery of the hardware module products. The consideration proposed to be paid by Borqs for 60% of KADI involves $15 million in cash and shares distributed over three years. Borqs is contemplating a public offering of shares in the coming months to support the cash investment needs for this acquisition.\nPat Chan, the CEO of Borqs: “KADI has strong IP related to core electric control modules for electric vehicles. Our acquisition of KADI will enhance Borqs’ internet-of-things solutions for automobiles and provide a comprehensive product line of IoT modules for electric vehicles. I trust that we are only seeing the tip of the iceberg for IoT products in this industry.”\nHu Lin, the Chairman and General Manager of KADI: “With rapid developments in the new electric vehicle industry in China, KADI believes the strategic investment from Borqs will greatly augment our overall strengths, and particularly in combination with Borqs’ existing intelligent in-vehicle-infotainment technologies, will create a real win-win scenario.”\nAbout Borqs Technologies, Inc.\nBorqs Technologies is a global leader in software and products for the IoT, providing customizable, differentiated and scalable Android-based smart connected devices and cloud service solutions. Borqs has achieved leadership and customer recognition as an innovative end-to-end IoT solutions provider leveraging its strategic chipset partner relationships as well as its broad software and IP portfolio. The Company designs, develops and provides turnkey solutions across device form factors such as smartphones, tablets, smartwatches, trackers, automotive IVI, and vertical application devices (for restaurants, payments etc.). For more information, please visit the Company’s website ( www.borqs.com ).\nForward-Looking Statements Disclosure\nThis press release includes “forward-looking statements” that involve risks and uncertainties that could cause actual results to differ materially from what is expected. Words such as “expects”, “believes”, “anticipates”, “intends”, “estimates”, “predicts”, “seeks”, “may”, “might”, “plan”, “possible”, “should” and variations and similar words and expressions are intended to identify such forward-looking statements, but the absence of these words does not mean that a statement is not forward-looking. Such forward-looking statements relate to future events or future results, based on currently available information and reflect our management’s current beliefs. Many factors could cause actual events or results to differ materially from the events and results discussed in the forward-looking statements, so the reader is advised to refer to the Risk Factors sections of the Company’s filings with the Securities and Exchange Commission for additional information identifying important factors that could cause actual results to differ materially from those anticipated in the forward-looking statements. Except as expressly required by applicable securities law, the Company disclaims any obligation to update any forward-looking statements, whether as a result of new information, future events or otherwise.\nContact\nSandra Dou, Investor Relations Sr. Manager\nEmail: sandra.dou@borqs.net\nSource:Borqs Technologies, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=yjsZq0bfp94zBntRq6iE0RxgXanGzAytwTfDQx9otakWHB7AnR3InK4JAhkR-st9PNKZgF9keHr32vYtGrRZvqTnC2_TPBgtUN6QNpqXPkY="], "published": "2018-01-10T17:00:00.000+02:00", "crawled": "2018-01-10T18:50:22.000+02:00", "highlightTitle": ""}