{"organizations": [], "uuid": "72ff9e70af7ea58f4ac79472f00723289077f94c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220467610&w=1200&r=LYNXMPEE080D7", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-china-france/macron-urges-china-eu-to-avoid-pitfalls-of-protectionism-idUKKBN1EY0LD", "country": "US", "domain_rank": 408, "title": "Macron urges China, EU to avoid pitfalls of protectionism", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T09:17:00.000+02:00", "replies_count": 0, "uuid": "72ff9e70af7ea58f4ac79472f00723289077f94c"}, "author": "", "url": "https://uk.reuters.com/article/uk-china-france/macron-urges-china-eu-to-avoid-pitfalls-of-protectionism-idUKKBN1EY0LD", "ord_in_thread": 0, "title": "Macron urges China, EU to avoid pitfalls of protectionism", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " 13 AM / Updated 24 minutes ago Macron urges China, EU to avoid pitfalls of protectionism Reuters Staff 2 Min Read \nBEIJING (Reuters) - President Emmanuel Macron on Tuesday offered to open up France to Chinese investment in exchange for greater access to Chinese markets for French companies, warning that existing trade imbalances would lead to protectionism. French President Emmanuel Macron delivers an economic speech to Chinese and French entrepreneurs at SOHO 3Q in Beijing, China January 9, 2018. REUTERS/Jason Lee \nMacron is on the second leg of a three-day state visit in China with a delegation of 50 business leaders he hopes will help reduce a 30-billion-euro (£26.4-billion) trade deficit with China. \n“We have an access to markets which is unbalanced, unsatisfying,” Macron told members of the French and Chinese business community at a start-up incubator in Beijing. \n“If we don’t deal with this responsibly, the first, natural, reaction will be to close up on both sides.” \nMacron, who met President Xi Jinping on Monday evening, said the two countries would fall into a lose-lose situation if continued restrictions on foreign firms in China prompted France and Europe to put a brake on Chinese investment in Europe. French President Emmanuel Macron speaks at a France-Chinese forum on the applications of artificial intelligence at SOHO 3Q in Beijing, China January 9, 2018. REUTERS/Jason Lee \n“Let’s open up both instead,” Macron said. \nMacron is hoping to seal deals, notably in the nuclear, aerospace and agrifood sectors. “We’re confident we’ll achieve more than symbolic stuff,” a French official said, on condition of anonymity. Slideshow (8 Images) \nFrench nuclear group Areva is close to signing a commercial deal to build a nuclear reprocessing plant, the official added. “We’ve never been that close to signing a commercial deal,” the official said. \nFrench banking giant BNP Paribas is also expected to set up a joint venture with a Chinese partner in the consumer credit sector, the same official said. \nAt the incubator, French engineering firm Fives signed a deal with Chinese online retail giant JD.com, which will set up a logistics centre in France to source French food and luxury products for sale online in China. \nJD.com agreed to sell 2 billion euros worth of French products - such as Remy Martin cognac or Evian water - on its website over the next two years. Reporting by Michel Rose; Additional reporting by Tom Daly; Editing by Clarence Fernandez", "external_links": [], "published": "2018-01-09T09:17:00.000+02:00", "crawled": "2018-01-09T09:47:49.641+02:00", "highlightTitle": ""}