{"organizations": [], "uuid": "62c375081acbf617c7f4c71a231779e4bac871ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/29/reuters-america-update-3-oil-dips-as-u-s-output-rises-still-set-for-strongest-january-in-five-years.html", "country": "US", "domain_rank": 767, "title": "UPDATE 3-Oil dips as U.S. output rises, still set for strongest January in five years", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T12:13:00.000+02:00", "replies_count": 0, "uuid": "62c375081acbf617c7f4c71a231779e4bac871ee"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/29/reuters-america-update-3-oil-dips-as-u-s-output-rises-still-set-for-strongest-january-in-five-years.html", "ord_in_thread": 0, "title": "UPDATE 3-Oil dips as U.S. output rises, still set for strongest January in five years", "locations": [], "entities": {"persons": [{"name": "steven mnuchin", "sentiment": "none"}, {"name": "amanda cooper", "sentiment": "none"}, {"name": "dona", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "opec", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "five years@\n* U.S. production to hit 10 million bpd soon\nCanadian output is also rising\n* But overall oil markets remain supported by OPEC-led cuts\n* Weakening dollar has also supported crude futures (Updates throughout with comment, refreshes prices; changes dateline from SINGAPORE)\nBy Amanda Cooper\nLONDON, Jan 29 (Reuters) - Oil dipped on Monday as soaring North American production was seen undermining efforts led by OPEC and Russia to tighten supplies, but prices were still on track for their strongest start to the year in five years.\nBrent crude futures held above $70 per barrel, but eased 23 cents on the day to $70.29 a barrel by 0943 GMT, while U.S. West Texas Intermediate (WTI) crude futures were at $66.24 a barrel, up 10 cents.\nSo far this month, the Brent crude price has risen by 6.3 percent, making this its largest rise in January since 2013.\nOne of the key drivers has been the dollar, which has lost 3.2 percent against a basket of major currencies so far this year, a decline that was exacerbated last week when U.S. Treasury Secretary Steven Mnuchin suggested President Donald Trump's administration favored a weaker currency.\nA falling dollar tends to help support the price of oil and coupled with a large premium in the front-month Brent oil contract over those for future delivery, investment in crude futures and options reached a new record high last week.\n\"The market is bullish. One side that could correct significantly could come from the strength in the U.S. dollar,\" PVM Oil Associates strategist Tamas Varga said.\n\"Undoubtedly, whatever the strategy is of Donald Trump and his finance ministry, they managed to support oil prices in the last week by talking the dollar down, so if we see a big (upward) correction in the dollar then we'll probably see a (downward) correction in oil.\"\nIn the last couple of months, oil has tended to move inversely to the dollar, as weakness in the currency makes it cheaper for non-U.S. investors in crude to buy and vice versa.\nHowever, despite generally bullish sentiment, analysts said the market had been dented by rising output in North America.\nU.S. crude production <C-OUT-T-EIA> has grown by over 17 percent since mid-2016 to 9.88 million barrels per day (bpd) in mid-January.\nOutput is expected to break through 10 million bpd soon. U.S. energy companies added 12 oil rigs drilling for new production last week, taking the total to 759, General Electric Baker Hughes energy services firm said on Friday.\nU.S. production is already on par with top exporter and OPEC kingpin Saudi Arabia. Only Russia produces more, averaging 10.98 million bpd in 2017.\nU.S. bank JP Morgan said it had increased its 2018 average price forecast by $10 per barrel to $70 per barrel for Brent and by $10.70 per barrel for WTI to $65.63.\n\"We expect Brent to touch close to $78 per barrel towards end of Q1 2018 or early Q2 2018,\" it added.\n(Additional reporting by Henning Gloystein; Editing by Alison Williams)", "external_links": [], "published": "2018-01-29T12:13:00.000+02:00", "crawled": "2018-01-29T14:00:44.020+02:00", "highlightTitle": ""}