{"organizations": [], "uuid": "5c5d6ca6b3d36d824a5eb67b2b4c008461b61e74", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223879559&w=1200&r=LYNXMPEE0K0IP", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/czech-election-president-poll/czech-presidential-election-headed-for-tight-run-off-vote-poll-idINKBN1FA0OC", "country": "US", "domain_rank": 408, "title": "Czech presidential election headed for tight run-off vote - poll", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T16:07:00.000+02:00", "replies_count": 0, "uuid": "5c5d6ca6b3d36d824a5eb67b2b4c008461b61e74"}, "author": "", "url": "https://in.reuters.com/article/czech-election-president-poll/czech-presidential-election-headed-for-tight-run-off-vote-poll-idINKBN1FA0OC", "ord_in_thread": 0, "title": "Czech presidential election headed for tight run-off vote - poll", "locations": [], "entities": {"persons": [{"name": "reu", "sentiment": "negative"}, {"name": "drahos", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "milos zeman", "sentiment": "none"}, {"name": "jiri drahos", "sentiment": "none"}, {"name": "zeman", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "prague", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "state", "sentiment": "none"}, {"name": "academy of sciences", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "kantar tns for czech television", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 11 PM / Updated 23 minutes ago Czech presidential election headed for tight run-off vote - poll Reuters Staff 3 Min Read \nPRAGUE (Reuters) - Czech voters are equally split ahead of a presidential vote next weekend between an academic who promises a better relationship with the European Union and incumbent Milos Zeman, who has used his time in office to push closer ties with Russia and China. \nA poll by Kantar TNS for Czech Television shows voters leaning 45.5 percent for Zeman and 45 percent for Jiri Drahos, who is a former head of the Academy of Sciences. \nIn the poll, which had 1,522 respondents, some 9.5 percent were undecided or not answering. Drahos also had a slightly higher number of “certain” voters than Zeman. \nThe Jan. 26-27 second round echoes other elections in the past two years across the European Union as well as U.S. President Donald Trump’s battle with former Secretary of State Hillary Clinton for the White House in 2016. \nThe 73-year-old Zeman has courted the far right in rejecting migrants from Muslim countries while pursuing warmer relations with Russia and China and sniping at the press. He won the first election round with 38.6 percent of the vote. \nDrahos, 68, finished second on 26.6 percent with support from liberal voters attracted by his policies favouring European Union integration. \nThe vote is seen as a referendum on Zeman, who has been in office since 2013. Most candidates who lost in the first round of voting endorse Drahos, which helps him narrow the gap. \nWhile Czech presidents have limited executive power in the country of 10.6 million they do appoint prime ministers and central bankers, represent the country abroad and can have a big influence in public opinion. \nThe election can impact who leads the next government. Prime Minister Andrej Babis is rushing to form a new cabinet before a new presidential term starts on March 8. \nThe billionaire businessman Babis, whose ANO party was a runaway winner in a parliamentary election last October, has struggled to get governing partners while he battles police allegations of EU subsidy fraud, which he denies. \nLawmakers stripped him of his immunity from prosecution on Friday, a few days Babis’s minority cabinet lost a confidence vote. Other parties have shunned governing with Babis. \nZeman has backed Babis - who in turn has endorsed Zeman in the election - although Drahos has advised Babis to step aside to help a new administration form and has said it would be unacceptable to have a prime minister who faces police charges. Reporting by Jason Hovet; Editing by Matthew Mpoke Bigg", "external_links": [], "published": "2018-01-21T16:07:00.000+02:00", "crawled": "2018-01-21T16:49:12.039+02:00", "highlightTitle": ""}