{"organizations": [], "uuid": "d3165f81ec0ec83ad9d84ed7c3e15f685825091e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180114&t=2&i=1221869319&w=1200&r=LYNXMPEE0D04Q", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-saudi-arrest-alwaleed/saudi-prince-alwaleed-in-settlement-talks-with-government-sources-idUKKBN1F308I", "country": "US", "domain_rank": 408, "title": "Saudi Prince Alwaleed in settlement talks with government - sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T10:31:00.000+02:00", "replies_count": 0, "uuid": "d3165f81ec0ec83ad9d84ed7c3e15f685825091e"}, "author": "", "url": "https://uk.reuters.com/article/uk-saudi-arrest-alwaleed/saudi-prince-alwaleed-in-settlement-talks-with-government-sources-idUKKBN1F308I", "ord_in_thread": 0, "title": "Saudi Prince Alwaleed in settlement talks with government - sources", "locations": [], "entities": {"persons": [{"name": "alwaleed", "sentiment": "negative"}, {"name": "stephen kalin", "sentiment": "none"}, {"name": "prince alwaleed", "sentiment": "none"}, {"name": "alwaleed bin talal", "sentiment": "none"}, {"name": "rania el gamal", "sentiment": "none"}], "locations": [{"name": "saudi prince alwaleed", "sentiment": "none"}, {"name": "saudi arabia", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "forbes", "sentiment": "none"}, {"name": "kingdom holding", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 14, 2018 / 8:32 AM / Updated 9 hours ago Saudi Prince Alwaleed in settlement talks with government - sources Rania El Gamal , Stephen Kalin 3 Min Read \nDUBAI/JEDDAH (Reuters) - Saudi Arabia’s billionaire Prince Alwaleed bin Talal, detained for over two months in an anti-corruption crackdown, is negotiating a possible settlement with authorities but so far has not agreed on terms, a senior Saudi official said. Owner of Saudi Arabia's Kingdom Holding, billionaire Prince Alwaleed bin Talal attends the traditional Saudi dance known as 'Arda', which was performed during Janadriya culture festival at Der'iya in Riyadh February 18, 2014. Picture taken February 18, 2014. REUTERS/Fayez Nureldine/Pool (SAUDI ARABIA - Tags: ROYALS BUSINESS) \nPrince Alwaleed, whose net worth has been estimated by Forbes magazine at $17 billion, is chairman and owner of international investment firm Kingdom Holding 4280.SE, and one of the country’s most prominent businessmen. \n“He offered a certain figure but it doesn’t meet the figure required from him, and until today the attorney-general hasn’t approved it,” the official said on condition of anonymity under government briefing rules. \nA second source familiar with Prince Alwaleed’s case told Reuters on Saturday that the price had offered to make a “donation” to the Saudi government, which would avoid any admission of wrongdoing, and to do so from assets of his own choosing. The government refused those terms, the source said. \nKingdom Holding’s share price jumped as much as 9.8 percent on Sunday in response to news of the negotiations, adding about $860 million to the company’s capitalisation. The stock price was still 7 percent below its level just before Prince Alwaleed was detained. FILE PHOTO - Saudi Arabian Prince Alwaleed bin Talal leaves the High Court in London July 2, 2013. REUTERS/Neil Hall/File Photo \nSince early November Prince Alwaleed has been held, with dozens of other members of Saudi Arabia’s political and business elite detained in the crackdown, in Riyadh’s opulent Ritz Carlton hotel as authorities seek to reach settlements with the detainees. \nSaudi officials say they aim to claw back some $100 billion of funds that rightfully belong to the state. Crown Prince Mohammed bin Salman, who launched the crackdown, has indicated he wants to close existing cases quickly and expects most suspects to cut a deal. \nThe allegations against Prince Alwaleed include money laundering, bribery and extorting officials, a Saudi official told Reuters soon after his detention. Neither he nor his company has commented publicly on the charges. \nKingdom Holding, which has said it is continuing to operate normally, did not respond to requests for comment when asked about any settlement talks. \nConstruction giant Saudi Binladin Group said on Saturday that some of its shareholders might transfer part of their holdings to the state in a settlement with authorities. Chairman Bakr Bin Laden and several family members were detained in the crackdown. \nIn late November, senior Saudi Prince Miteb bin Abdullah, once seen as a leading contender to the throne, was freed after reaching a settlement with authorities that involved paying more than $1 billion, according to a Saudi official. Additional reporting by Saeed Azhar in Dubai and Marwa Rashad in Riyadh; Editing by Andrew Torchia and Dale Hudson", "external_links": [], "published": "2018-01-14T10:31:00.000+02:00", "crawled": "2018-01-14T10:44:59.000+02:00", "highlightTitle": ""}