{"organizations": [], "uuid": "10b9ea2144084f7b73c6107cd163100dc39be24d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180120.html", "section_title": "Archive News &amp; Video for Saturday, 20 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-agriculture-livestock-welfare/farm-ministers-call-for-more-welfare-for-animals-idUSKBN1F90QW", "country": "US", "domain_rank": 408, "title": "Farm ministers call for more welfare for animals", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-20T23:28:00.000+02:00", "replies_count": 0, "uuid": "10b9ea2144084f7b73c6107cd163100dc39be24d"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-agriculture-livestock-welfare/farm-ministers-call-for-more-welfare-for-animals-idUSKBN1F90QW", "ord_in_thread": 0, "title": "Farm ministers call for more welfare for animals", "locations": [], "entities": {"persons": [], "locations": [{"name": "hamburg", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HAMBURG (Reuters) - Greater attention should be given worldwide to the welfare of farm animals and to reducing the use of growth-enhancing medications, agriculture ministers from about 70 countries meeting in Berlin said on Saturday.\nThere is a global need to improve animal health and animal welfare by promoting good animal husbandry management practices, biosecurity and biosafety and knowledge exchange, said a communique after the 10th Berlin Agriculture Ministersꞌ Conference.\nThe ministers said more international cooperation is necessary “in order to make livestock production and animal husbandry more sustainable, responsible and efficient”.\nThere is also a requirement to bring livestock breeding and husbandry further into line with consumers’ expectations of humane care of farm animals.\n“We note that the demand for food of animal origin, in particular food derived from meat, milk and eggs, is projected to rise significantly in many regions of the world due to the growing population, increasing purchasing power and changes in consumer behaviour,” the communique said.\n“At the same time, consumers are increasingly calling for livestock production to be made more sustainable and more respectful of animal welfare.”\nMinisters undertook to give greater consideration to animal health and animal welfare in training programs.\nA balanced consumption of meat is needed for a healthy diet, health protection and the efficient use of resources, they said.\nAnimal health and the connection with human health is another key issue, said German Agriculture Minister Christian Schmidt after the meeting.\n“This is especially clear with (animal diseases which can be transmitted to humans) and the problem of resistance to antibiotics,” Schmidt said.\n“So in our final communique we have resolved to strengthen worldwide efforts against the unnecessary use of antibiotics in animal farming.”\nReporting by Michael Hogan; Editing by Andrew Bolton\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-20T23:28:00.000+02:00", "crawled": "2018-01-21T13:22:14.004+02:00", "highlightTitle": ""}