{"organizations": [], "uuid": "e1e1e49198934b2565fecba158a29e3aacf65034", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224416417&w=1200&r=LYNXMPEE0M0JL", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-olympics-2018-organisers/north-korea-participation-to-highlight-opening-ceremony-idUSKBN1FC0YB", "country": "US", "domain_rank": 408, "title": "North Korea participation to highlight opening ceremony", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T11:21:00.000+02:00", "replies_count": 0, "uuid": "e1e1e49198934b2565fecba158a29e3aacf65034"}, "author": "", "url": "https://www.reuters.com/article/us-olympics-2018-organisers/north-korea-participation-to-highlight-opening-ceremony-idUSKBN1FC0YB", "ord_in_thread": 0, "title": "North Korea participation to highlight opening ceremony", "locations": [], "entities": {"persons": [], "locations": [{"name": "north korea", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 9:21 AM / in 8 hours North Korea participation to highlight opening ceremony Jane Chung 2 Min Read \nPYEONGCHANG, South Korea (Reuters) - North Korea’s participation at the next month’s Winter Olympics will form an integral part of an opening ceremony that will highlight a key message of peace, Games organizers said on Tuesday. \nThe 2018 Winter Olympics is being held in the mountainous resort town of Pyeongchang, 80 km (49.71 miles) from the heavily-fortified inter-Korean border, and kicks off with the opening ceremony on Feb. 9. \nSong Seung-whan, who is serving as the executive creative director for the Pyeongchang ceremonies, said peace had been set as the main motif of the opening gala even before North Korea decided to join the Games. \n“We have worked on all of our scenarios under the theme of peace,” Song, a renowned actor and producer, told a news conference in Pyeongchang. \n“Although North Korea’s participation was decided belatedly, we think this will serve as a good opportunity for us to convey our message more clearly.” \nNorth Korea’s presence at the Games had been speculated over for months amid heightened tensions surrounding Pyongyang’s contentious nuclear and ballistic missile program. \nHowever, in a dramatic turn of events, the Koreas agreed to parade together at the opening ceremony and form a unified team to compete in women’s ice hockey. \nLee Hee-beom, president of the Pyeongchang Organizing Committee, added that the ceremonies remained largely unchanged following the North’s decision to participate, except for a joint entrance of Korean athletes under a single flag. \nThe opening ceremony is expected to intertwine Korean history and tradition with aspects of modern culture, such as K-Pop. \n(This refiled version of the story corrects typo in paragraph three). Reporting By Jane Chung; Editing by John O'Brien", "external_links": [], "published": "2018-01-23T11:21:00.000+02:00", "crawled": "2018-01-23T11:41:56.002+02:00", "highlightTitle": ""}