{"organizations": [], "uuid": "354585b7e1bc9654c465006015ba4fc8494b7f1a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/cnbc-interview-with-prefect-of-the-dicastery-for-integral-human-development-cardinal-peter-turkson-from-the-world-economic-forum-2018.html", "country": "US", "domain_rank": 767, "title": "CNBC Interview with Prefect of the Dicastery for Integral Human Development, Cardinal Peter Turkson from the World Economic Forum 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T08:00:00.000+02:00", "replies_count": 0, "uuid": "354585b7e1bc9654c465006015ba4fc8494b7f1a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/cnbc-interview-with-prefect-of-the-dicastery-for-integral-human-development-cardinal-peter-turkson-from-the-world-economic-forum-2018.html", "ord_in_thread": 0, "title": "CNBC Interview with Prefect of the Dicastery for Integral Human Development, Cardinal Peter Turkson from the World Economic Forum 2018", "locations": [], "entities": {"persons": [{"name": "peter turkson", "sentiment": "negative"}, {"name": "steve sedgwick", "sentiment": "none"}, {"name": "geoff cutmore", "sentiment": "none"}], "locations": [{"name": "vatican", "sentiment": "none"}], "organizations": [{"name": "cnbc interview", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "negative"}, {"name": "integral human development", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Following are excerpts from a CNBC interview with Cardinal Peter Turkson, Dicastery for Integral Human Development and CNBC's Steve Sedgwick and Geoff Cutmore from the World Economic Forum 2018.\nGC: Well, of course, the Pope's message coming in to this World Economic Forum, we cannot remain silent as millions suffer, and I'm pleased to say we have with us Cardinal Peter Turkson, Prefect of the Vatican's Dicastry for Integral Human Development. Cardinal, welcome.\nPT: Thank you.\nGC: Thank you for being with us.\nPT: Thanks a lot.\nGC: Do you think that the community that are gathered here have taken on board that message?\nPT: Uh, whether they have taken on board the message, we need to see that when everybody leaves from here and goes back to doing whatever they were used to doing. Whether this message is going to impact on what they used to do and, you know, have them make a difference, so that's still something to expect. But judging from the reactions we're getting from the floor, it looks like it was a message that was well-received, well-appreciated for its content, and if this is anything to go by, then we expect that when they go back, they will have this message impact on whatever they do.\nSS: But, Your Eminence, there is a feeling that it's relying on philanthropy from rich people here, it's relying on tax breaks for rich people, and rich companies, and then to pass it down to people. Do you think the whole economic, or the business model, is wrong, actually rather than a trickle-down, maybe it should come from the other way?\nPT: Yes. I mean, as you know, this has been a policy that was adopted, a very prevalent in the days of, you know, President Regan and Margaret Thatcher, this belief in a trickle-down effect, which, you know, they didn't work. And currently, if you want, one of the big promoters of this event, India, is living a similar experience, where a lot of the rich, you know, grow whatever, thinks that that will trickle down. It's still something that we need to see. Instead of the trickle-down, I think we can-, we can promote another model of economic development that would emphasize a sense of fraternity and solidarity. You referred to globalization at the beginning of this program. If globalization is not simply enhancing the reach of-, of, you know, big companies and all, but if globalization is seen as expressing the common fraternity of the human family, then there will be an awakening of a real sense of solidarity-,\nSS: Sure.\nPT: And wanting to share, you know, with everyone. Then we will probably be able to overcome, you know, the challenges of inequality, and everything you're talking about.\nGC: What-, what went wrong with capitalism, that it has not created benefits for all?\nPT: Well. What went wrong with capitalism? I mean, indeed, you know, for us, right from, you know 18s .. 1892 when one of the Popes, you know, Pope Leo the Great, wrote a circular about the new towns. This was right at the beginning of the industrial age, the new, industrial, you know, revolution and all. He defended capitalism, he defended the right of people to own, you know, things and property. But then went on to say that, when people own property, then out of responsibility, they freely decide to share the proceeds of their responsibility with the poor. So, there was this awakening of people freely deciding to respond to a sense of responsibility that they have, as a member of the human family.\nGC: Mm.\nPT: So, capitalism, itself, has never really been condemned by the church. It's rather an invitation for people to, in freedom, exercise a sense of responsibility and solidarity to the rest of humanity. And if that was done, it would be good. I guess, in the last-, towards the end of last year, I participated in an event at the Catholic University, Washington, at which, you know, there was Charles Koch, who had just written a book, Profit for Good, and that was the center of discussion out there, and, you know, challenging for several people, whether profit can be for good, you know.\nSS: So, if I-, Your Eminence, if I may move it on just ab it here, if capitalism is changing, what about, and if I may put this crudely, 'Brand Vatican'? Because the Pope looks very different from previous Popes, certainly in my lifetime-,\nPT: [Laughter].\nSS: Pope Francis looks like a very different brand of Pope compared with previous Popes, as well.\nPT: Certainly.\nSS: Is the Vatican-, is the Catholic Church, and the leadership of it, is it changing?\nPT: It is-, it is, certainly, and, you know, this is something that we need to grant to all Popes. All Popes come to this institution with their own personal endowments, and personal style of doing things, and personal way of responding to the invitation to live the gospel values. And we had somebody like John Paul II, very popular Pope, you know, for reaching out, and he tackled this issue that we're dealing with, capitalism, where he responded- [LATIN] , he reacted to the fact that, you know, when we talk about capital, we're not simply thinking about land and property, but people's talents, people's ideas, people's innovative thinking, this also is capital-,\nGC: Cardinal-,\nPT: Which can be shared, you know, with other people, to promote development and growth-,\nGC: Cardinal-,\nPT: Yes?\nGC: I'm-, apologies for breaking in-,\nPT: Yes.\nGC: But we're running close to the end of our program-,\nPT: Ah, okay, sure.\nGC: And I just wanted, very quickly, to ask you, what do we need to hear from Donald Trump today-,\nPT: [Laughter].\nGC: To atone for his previous comments, that were criticized so heavily by the Vatican, quite rightly?\nPT: No, I mean, it's difficult to predict. You know, I'm not his speech writer, and I'm not consulted about what he has to say, on all of that?\nGC: Well, if-, if you were, what should he be saying?\nPT: But if-, if-, you know, you know, deciding to come here to Davos, where, you know, business and policymakers gather, and all of that, recognizing that what decisions made over here impact on the conduct of society, I suppose that he would probably also, you know, should have a message that would bring hope. As you know, there was a demonstration in the village downstairs the other day about this event, and that challenge to this event does not simply celebrate the world of economics, and economic leaders, but have a sense for the very many down there, who also need to be heard out. So, if this will probably influence the message of the President, I think it will be a good visit.\nGC: Cardinal Turkson, thank you so much for joining us-,\nPT: Thank you.\nGC: As we wrap up our coverage on Squawk Box.\nPT: Thanks a million. Thanks.\nENDS", "external_links": [], "published": "2018-01-26T08:00:00.000+02:00", "crawled": "2018-01-26T16:54:56.000+02:00", "highlightTitle": ""}