{"organizations": [], "uuid": "eb921dff15db658b2e61d5278e7f8734f6976bc5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/10/104938336-Y2A0133.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/11/meet-the-two-men-who-may-succeed-warren-buffett-at-berkshire-hathaway.html", "country": "US", "domain_rank": 767, "title": "Warren Buffett promoted Gregory Abel, Ajit Jain at Berkshire Hathaway", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.2, "site_type": "news", "published": "2018-01-11T20:57:00.000+02:00", "replies_count": 0, "uuid": "eb921dff15db658b2e61d5278e7f8734f6976bc5"}, "author": "Ali Montag", "url": "https://www.cnbc.com/2018/01/11/meet-the-two-men-who-may-succeed-warren-buffett-at-berkshire-hathaway.html", "ord_in_thread": 0, "title": "Warren Buffett promoted Gregory Abel, Ajit Jain at Berkshire Hathaway", "locations": [], "entities": {"persons": [{"name": "ajit jain", "sentiment": "negative"}, {"name": "gregory abel", "sentiment": "negative"}, {"name": "warren buffett", "sentiment": "negative"}, {"name": "abel", "sentiment": "none"}, {"name": "buffett", "sentiment": "none"}, {"name": "charlie munger", "sentiment": "none"}, {"name": "jain", "sentiment": "none"}], "locations": [{"name": "jain", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "berkshire hathaway david a. grogan", "sentiment": "negative"}, {"name": "berkshire", "sentiment": "none"}, {"name": "wall street journal", "sentiment": "none"}, {"name": "nebraska business", "sentiment": "none"}, {"name": "berkshire hathaway", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "When legendary investor Warren Buffett is looking to fill roles at his $500 billion conglomerate Berkshire Hathaway , he isn't searching for fancy resumes.\n\"I don't care where someone went to school, and that never caused me to hire anyone,\" Buffett tells The Wall Street Journal in 2006.\nInstead, he wants employees who share three traits: \"You look for intelligence, you look for energy and you look for integrity,\" he tells Nebraska Business magazine . Of those three, he says integrity is the most important.\nWednesday, Buffett appointed current Berkshire Hathaway executives Gregory Abel, 55, and Ajit Jain, 66, to the company's board as vice chairs — the same title Buffett's longtime partner Charlie Munger holds — and gave indication that one may eventually land as the leader of the company.\nThe news is \"part of a movement to succession over time,\" Buffett tells CNBC in an interview.\nSo what does Buffett see in Jain and Abel?\nInterestingly, the two seem to be opposites in some ways. Jain, who is responsible for leading Berkshire's reinsurance operations, has become known for taking calculated risks with big pay offs, while Abel, chairman and CEO of Berkshire Hathaway Energy rarely gives press interviews and has quietly developed the company's utility businesses in Des Moines, Iowa.\nHowever, they also share similarities with their boss, Buffett.\n\"[Jain and Abel] take a rational, non-emotional approach to making business decisions, selecting managers and are trustworthy,\" Lawrence Cunningham, author of \"Berkshire Beyond Buffett: The Enduring Value of Values,\" tells USA Today.\nHere's what you need to know about both executives.\nAjit Jain Daniel Acker | Bloomberg | Getty Images Ajit Jain, head of the Berkshire Hathaway reinsurance business. One thing Buffett must appreciate about his protege: Jain \"has made a lot more money for Berkshire than I have,\" Buffett s aid at the company's annual meeting last year.\n\"Ajit has created tens of billions of value for Berkshire shareholders. If there were ever to be another Ajit and you could swap me for him, don't hesitate. Make the trade!\" Buffet wrote in his annual letter last year.\nJain, who grew up in Orissa, India, is a member of the ancient Indian religion Jainism and a vegetarian. He earned an engineering degree from the Indian Institute of Technology and a graduate degree from Harvard Business School, the Omaha World-Herald reports .\nAfter jobs at IBM and McKinsey & Co., Jain began working at Berkshire in 1986 in his mid-30s.\nToday, Jain heads Berkshire Hathaway's reinsurance business, \"providing coverage against major catastrophes and generating tens of billions of dollars of premiums for Berkshire to invest,\" according to Reuters.\nHe's acquired a bit of a reputation for landing on the safe side of risky insurance policies, the kind that other companies won't touch.\nIn 2013, for example, Jain's unit at Berkshire agreed to underwrite a policy for PepsiCo, \"offering protection for a sweepstakes that potentially paid out a $1 billion top prize,\" The Wall Street Journal reports. That meant if someone won the contest, they would have to cover the cost of the prize. No one did.\nBack in 1997, his unit created a policy for the state of California to cover $1.5 billion in earthquake losses should the state be struck by catastrophe. It was coverage that other insurers \"were wary of providing,\" according to The Journal.\nDamages never reached the threshold to trigger the policy, according to the Omaha World-Herald , but Berkshire Hathaway collected, \"$590 million in premiums each year for four years.\"\nHis critical decision-making is not lost on Buffet.\n\"Ajit would have been a star in whatever career he chose; fortunately for us, he enjoys insurance,\" Buffett writes in his 1997 letter to investors. \"Quite simply, he is one of Berkshire's major assets.\"\nGregory Abel Daniel Acker | Bloomberg | Getty Images Greg Abel, chairman and chief executive officer of Berkshire Hathaway Energy Co., center, speaks with attendees before the start of the Berkshire Hathaway Inc. annual meeting in Omaha, Nebraska, U.S., on Saturday, May 6, 2017. Greg Abel has Warren Buffett's ear.\n\"I get a lot of phone calls each day, and I always make time for Greg when he calls because he brings me great ideas and is truly innovative in his thinking and business approach,\" Buffett told the University of Alberta's School of Business Alumni Magazine in 2013.\nBuffett particularly appreciates his abilities as a manager and praised him as a \"dealmaker\" in a 2002 letter to shareholders.\nLike Jain, Abel is an immigrant to the U.S. He grew up in Canada, in Edmonton, Alberta where he loved to play hockey as a kid, according to the Omaha World-Herald. Abel graduated from the University of Alberta in 1984 with a bachelor's degree in commerce, after switching from studying finance.\nNumbers were attractive to Abel, a quality he shares with Buffett.\n\"Accounting took over when I came to realize how critically important it was to understand things such as income and cash flow statements,\" he tells University of Alberta publication New Trail .\nIt served him well. Abel heads up the conglomerate's energy business as the chairman, president and CEO of Berkshire Hathaway Energy. In 2016, he made $17.52 million in compensation — down from a whopping $40.77 million in 2015 thanks to incentive pay tied to the company's performance, Reuters reports .\nIn the industry, he's known as \"an astute deal maker\" who avoids the spotlight, \"with an easygoing manner similar to other senior Berkshire executives,\" according to The Wall Street Journal.\nAnd, just like his boss, Abel holds integrity to be a key to success.\n\"It goes beyond how you conduct yourself,\" he says. \"It's also about how you communicate. You show respect by bringing a lot of candor to situations.\"\nFor Buffett, both men are capable of leading Berkshire Hathaway well.\n\"They both have Berkshire in their blood. They love the company. They know their operations like the back of their hand. So it's very good for Berkshire. And it's even better for me,\" Buffett tells CNBC.\nMunger, also a vice chairman of Berkshire Hathaway, speaks highly of them too.\n\"Ajit Jain and Greg Abel are proven performers who would probably be under-described as world-class,\" he wrote in a 2014 shareholder letter. \"In some important ways, each is a better business executive than Buffett.\"\nBut for now, Buffett says he's still in charge.\n\"I feel terrific. I love what I do. I can't wait to go to the office in the morning,\" he tells CNBC. \"There's nothing I'd rather be doing.\"\nDon't miss: Warren Buffett and Mark Cuban agree this one habit is key to success—and anyone can do it\nLike this story? Like CNBC Make It on Facebook !\nshow chapters Why the secret to your success is who you marry 1:13 PM ET Mon, 30 Oct 2017 | 01:12", "external_links": [], "published": "2018-01-11T20:57:00.000+02:00", "crawled": "2018-01-11T21:05:57.023+02:00", "highlightTitle": ""}