{"organizations": [], "uuid": "3358b16bfacc775f222e52149ae112819f22be76", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224126687&w=1200&r=LYNXMPEE0L0X6", "site_section": "http://feeds.feedburner.com/google/rJLX", "section_title": "ATTACK - Google News", "url": "https://www.reuters.com/article/us-afghanistan-attacks/afghan-officials-search-for-answers-to-deadly-hotel-attack-idUSKBN1FB1AL", "country": "US", "domain_rank": 408, "title": "Afghanistan searches for answers to deadly hotel attack - Reuters", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T16:39:00.000+02:00", "replies_count": 0, "uuid": "3358b16bfacc775f222e52149ae112819f22be76"}, "author": "", "url": "https://www.reuters.com/article/us-afghanistan-attacks/afghan-officials-search-for-answers-to-deadly-hotel-attack-idUSKBN1FB1AL", "ord_in_thread": 0, "title": "Afghanistan searches for answers to deadly hotel attack - Reuters", "locations": [], "entities": {"persons": [{"name": "kam air", "sentiment": "none"}], "locations": [{"name": "afghanistan", "sentiment": "none"}, {"name": "kabul", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "taliban", "sentiment": "none"}, {"name": "min read  kabul", "sentiment": "none"}, {"name": "shalizi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KABUL (Reuters) - The deadly assault on the Hotel Intercontinental in Kabul at the weekend, which devastated one of Afghanistan’s three main airlines with the killing of many of its foreign pilots, has exposed again how vulnerable the city is to militant attacks.\nEven in a country long inured to violence, the attack by five gunmen dressed in army uniforms shocked people, with questions raised about how they were able to penetrate security at one of the capital’s most prominent buildings.\nThe attack was claimed by the Taliban, seeking to re-impose Islamic rule and drive international forces out of Afghanistan.\nMany details of what happened in the attack, which began at around 9 p.m. on Saturday and was not suppressed until the following day, remain unclear.\nAccording to the official toll, at least 20 people were killed, including 13 foreigners, many of them air crew of Kam Air. The airline is one of a handful of Afghan companies that provide links between major cities. Travel by road is often dangerous and unreliable.\nOne of the most deadly attacks on foreigners in Afghanistan in years could discourage expatriate technical specialists from working for Afghan companies who cannot provide the high levels of security provided by the United Nations or embassies.\n“They were first killing Westerners and then laughing at the dead,” said Vassilis Vassileiou, a Greek Kam Air pilot.\nHe told Greece’s Pro Thema newspaper that he cut open a mattress and hid inside it for 13 hours as the fighting went on around him and the gunmen came and went in the darkness after electricity was cut.\n“I was constantly hearing shouts, shots and bangs on the doors,” he said.\nUkraine’s ambassador to Afghanistan, Viktor Nikityuk, who is based in neighboring Tajikistan, said seven Ukrainians living in the hotel had been killed and their bodies would be repatriated.\nVolodymyr Kostenko, a director of Ukrainian Wings, a company that provides services to Kam Air, said that four of its staff, including two women, were among those killed and all of its employees in Afghanistan were being pulled out of the country.\n‘A LOT OF FAILURES’\n“The government is looking at a lot of failures,” said one senior Afghan official, who spoke on condition of anonymity.\nNoorullah (24), an employee of the Intercontinental Hotel, receives treatment at a hospital after an attack in Kabul, Afghanistan January 22, 2018. REUTERS/Mohammad Ismail White House spokeswoman Sarah Sanders told reporters the attack strengthened the resolve of the United States to support Afghan forces.\n“We call on Pakistan to immediately arrest or expel the Taliban’s leaders and prevent the group from using Pakistani territory to support its operations,” Sanders said.\nThe smoke-blackened Intercontinental building, an imposing 1960s structure on a hill overlooking Kabul, remained blocked off on Monday.\nThe final casualty toll is uncertain. Officially, the government says at least 20 people were killed, including 13 foreigners. People who work in the security system say the real figure is certainly above 30, however, and probably many more.\nInterest is likely to focus on the private security company which took over protection duties three weeks ago at the hotel, which is in public ownership and is no longer part of the Intercontinental Hotels Group.\nSlideshow (2 Images) “The security company is being questioned and it has to provide a lot of explanation,” the Afghan official said. “We can’t rule out the possibility the terrorists had inside help.”\nAccording to one account, by a security official who spoke on condition of anonymity, the gunmen got through an initial checkpoint on the approach road before reaching a second checkpoint close to a car park near the hotel entrance.\nAt that point, the official said, they appeared to have shot the checkpoint guards and made their way around the back of the building and into the kitchen before beginning the attack.\nBut there are other versions, which suggest that at least some of the attackers may have come in through the front door.\nAuthorities are looking at security cameras to determine why they entered the hotel so easily and with no resistance, the official said.\nOnce inside, they went through the ground and first floors, opening fire on staff and guests before moving quickly to the upper levels of the six-floor building.\nHassibullah, who was working in the hotel bakery, said he ran upstairs to a fifth-floor room and barricaded himself in with about 12 people, including guests, when the firing started. He survived a jump to the ground, suffering two broken legs, a broken back and internal injuries.\nSpeaking from a hospital bed, he said the attackers began firing into the door, which the guests had barricaded with furniture when the lights went out and he took his only chance.\n“The only thing I could do was open the window and jump out,” he said. He did not know what happened to all the others.\nAdditional reporting by Mirwais Harooni, Mohammad Aziz, Hassib Sayed and Margaryta Chornokondratenko and Natalia Zinets in KIEV and Renee Maltezou in ATHENS; Writing by James Mackenzie; Editing by Nick Macfie, Robert Birsel\n ", "external_links": [], "published": "2018-01-22T16:39:00.000+02:00", "crawled": "2018-01-23T08:23:49.019+02:00", "highlightTitle": ""}