{"organizations": [], "uuid": "4c252e965aa438c164e61c3a4fd04d5c114ed8cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-david-w-graebel-named-chairman-emeritus-of-graebel-companies-inc.html", "country": "US", "domain_rank": 767, "title": "David W. Graebel Named Chairman Emeritus of Graebel Companies, Inc.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.01, "site_type": "news", "published": "2018-01-16T19:14:00.000+02:00", "replies_count": 0, "uuid": "4c252e965aa438c164e61c3a4fd04d5c114ed8cd"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-david-w-graebel-named-chairman-emeritus-of-graebel-companies-inc.html", "ord_in_thread": 0, "title": "David W. Graebel Named Chairman Emeritus of Graebel Companies, Inc.", "locations": [], "entities": {"persons": [{"name": "david w. graebel", "sentiment": "negative"}, {"name": "bill graebel denver", "sentiment": "negative"}, {"name": "w. graebel", "sentiment": "none"}, {"name": "bill graebel", "sentiment": "none"}, {"name": "dave graebel", "sentiment": "none"}, {"name": "david", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "william (bill) graebel", "sentiment": "none"}, {"name": "dave", "sentiment": "none"}], "locations": [{"name": "graebel", "sentiment": "none"}], "organizations": [{"name": "graebel companies, inc", "sentiment": "neutral"}, {"name": "graebel companies, inc.", "sentiment": "none"}, {"name": "business wire", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Founder Succeeded as Chairman of the Board of Directors by Son and Current CEO, Bill Graebel\nDENVER--(BUSINESS WIRE)-- Graebel Companies, Inc., a leading provider of workforce and workplace mobility solutions for Fortune 500 and Global 1000 firms and the largest family-owned, privately held relocation company in the world, recently announced that David (Dave) W. Graebel, 88, has been named Chairman Emeritus. He had served as Chairman of the board of directors since founding the company in 1950. Dave is being succeeded as Chairman of the board of directors by his son, William (Bill) Graebel, 56, SGMS, who continues to hold the position of Chief Executive Officer, a role he has held since 2007.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180116006296/en/\nDave Graebel (left) with son Bill Graebel (right). (Photo: Business Wire)\nAs Chairman, Bill will now guide the six-member board of directors that oversees the strategic direction of Graebel, in addition to serving as the company’s CEO. In the newly created role of Chairman Emeritus, Dave will continue to provide guidance and counsel, lending expertise gained from nearly seven decades in the relocation industry.\n“My father is a larger-than-life presence whose hard work, enthusiasm, determination and dedication to his clients, employees, family and duty of care have defined what Graebel is today,” said Bill, who has worked for the company since 1975. “In this planned board leadership transition, I know he will continue to serve our company with passion and build on his exceptional legacy.”\nDave established Graebel as a local moving company with one truck in Wausau, Wis., in 1950. Since then, Graebel has evolved and expanded into a leading global organization, and introduced best practices to the moving and relocation industry, including 24/7/365 WorldWatch ® customer service accessibility, Value Pricing System ® simplified tariff, performance guarantees, and Web-based technology with real-time reporting for clients. Dave is recognized within the industry for his strategic vision, business acumen and charitable efforts. He has received the highest honors from local and global business organizations, including the Lifetime Achievement Award for Distinguished Service from the Moving and Storage Institute.\nBill, now Chairman and CEO, has served in various executive positions over the past 42 years, including Chief Operating Officer, President, Senior Vice President, Regional Vice President and General Manager. During that time, Graebel has evolved into a leading workforce and workplace mobility solutions provider for some of the world’s top companies and has experienced rapid, sustained growth. Today, Graebel manages nearly 80,000 annual mobility initiations across 165 countries, employs more than 800 people worldwide, and has become synonymous with the highest quality relocation and workplace services.\nBill’s eldest son, David B. Graebel, 26, is continuing the family’s legacy as the third generation of Graebels in the global mobility business. He currently works for the company on the business development team.\n“I have tremendous respect and admiration for my grandfather and father, including their work ethic and dedication to this company and its employees and clients,” said David. “It’s a privilege for me to learn from and work with them while playing a role in the company’s continued growth and evolution.”\nFor more information, visit Graebel.com .\nAbout Graebel\nGraebel Companies, Inc. is a leading provider of global workforce and workplace mobility solutions for Fortune 500 and Global 1000 firms and their employees in 165 countries. Since its founding in 1950, Graebel has evolved, innovated and grown to deliver excellent service and results for clients, all while remaining family-owned and focused on its duty of care. Graebel develops and implements mobility strategies that help companies attract and retain talent; respond faster to global market trends; and maximize return on mobility programs. The company addresses every part of the mobility lifecycle for employers and employees, including services for departure and move management, destination, settling-in and ongoing assignments. For more information, visit Graebel.com . Here’s to the world ahead ® .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180116006296/en/\nLinhart Public Relations For Graebel\nShannon Hughes, 303-951-2560\nshughes@linhartpr.com\nSource: Graebel", "external_links": ["http://www.businesswire.com/news/home/20180116006296/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.graebel.com%2F&esheet=51743869&newsitemid=20180116006296&lan=en-US&anchor=Graebel.com&index=2&md5=e87ba6bb1021743b1c95e982c9abdb84", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.graebel.com%2F&esheet=51743869&newsitemid=20180116006296&lan=en-US&anchor=Graebel.com&index=1&md5=42cf215a330ab2b2703dc3e1e4e55d4e"], "published": "2018-01-16T19:14:00.000+02:00", "crawled": "2018-01-16T21:12:18.002+02:00", "highlightTitle": ""}