{"organizations": [], "uuid": "585f968a856d259e9ddcf1235f9a3d25e163deea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/12/reuters-america-global-markets-dollar-at-3-yr-low-vs-euro-stocks-extend-record-run.html", "country": "US", "domain_rank": 767, "title": "GLOBAL MARKETS-Dollar at 3-yr low vs euro; stocks extend record run", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T22:44:00.000+02:00", "replies_count": 0, "uuid": "585f968a856d259e9ddcf1235f9a3d25e163deea"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/12/reuters-america-global-markets-dollar-at-3-yr-low-vs-euro-stocks-extend-record-run.html", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Dollar at 3-yr low vs euro; stocks extend record run", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "ecb", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "wells fargo", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "jpmorgan chase & co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Euro surges on ECB tapering hopes; sterling jumps\n* Wall St scales record highs on earnings optimism, data\n* U.S. yields up on inflation, 2-year highest since 2008 crisis\n* Oil adds to rally, heads for fourth week of gains (Updates with oil settlements)\nNEW YORK, Jan 12 (Reuters) - The U.S. dollar slumped to a more than three-year low against the euro on Friday, extending recent losses on expectations European Central Bank policymakers are preparing to reduce their stimulus, while a key global stock index was on track for an eighth week of gains.\nU.S. stocks rose with bank shares, which climbed following quarterly results from JPMorgan Chase & Co and Wells Fargo.\nThe euro's rise weighed on the dollar index, which measures the greenback against six rival currencies. The index was down 0.94 percent, after slipping to a four-month low of 90.954.\nThe dollar index was down 1.23 percent for the year, its worst performance over the first nine trading days since 2010, according to Reuters data. \"The latest ECB comments were a bit on the hawkish side, so that's giving more life to the euro,\" said Minh Trang, senior currency trader at Silicon Valley Bank in Santa Clara, California.\nSterling rocketed to its highest level against the dollar since the vote to leave the European Union after a report that the Netherlands and Spain were open to a deal for Britain to remain as close as possible to the trading bloc. Sterling was last trading at $1.373, up 1.43 percent.\nU.S. stock indexes hit all-time highs, along with the MSCI world index. Strong U.S December retail sales data also helped stocks.\nThe S&P financial index was up 0.6 percent. While tax-related costs are expected to weigh on banks' earnings, they are expected to benefit in the long run from a lower tax burden.\n\"The fact all the big money center banks beat on the bottom line is a good omen for the rest of the earnings season,\" said William Lynch, director of investments at Hinsdale Associates, in Hinsdale, Illinois.\nThe Dow Jones Industrial Average rose 185.41 points, or 0.72 percent, to 25,760.14, the S&P 500 gained 15.39 points, or 0.56 percent, to 2,782.95 and the Nasdaq Composite added 40.17 points, or 0.56 percent, to 7,251.95.\nThe pan-European FTSEurofirst 300 index rose 0.23 percent and MSCI's gauge of stocks across the globe gained 0.72 percent.\nA robust U.S. inflation report boosted Treasury yields.\nThe two-year yield, sensitive to traders' views on interest rates, rose to more than 2 percent for the first time since the financial crisis.\nIn commodities, oil prices rose for a sixth day after Russia's oil minister said that global crude supplies were \"not balanced yet,\" alleviating market concerns about a wind-down of the OPEC-led deal to reduce production.\nU.S crude oil rose 50 cents to settle at $64.30 a barrel, while Brent rose 61 cents to settle at $69.87.\nFor the Reuters Live Markets blog on European and UK stock markets, open a news window on Reuters Eikon by pressing F9 and type in 'Live Markets' in the search bar.\n(Additional reporting by Marc Jones in Helen Reid in London and Kate Duguid, Sinead Carew and Saqib Aqbal Ahmed in New York; Editing by Bernadette Baum and Nick Zieminski)", "external_links": [], "published": "2018-01-12T22:44:00.000+02:00", "crawled": "2018-01-13T06:16:16.006+02:00", "highlightTitle": ""}