{"organizations": [], "uuid": "f3d6d424f0f558d8ed1ff561b5825bfb61cbb57f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/03/15/104343658-GettyImages-653526466.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/19/stocks-making-the-biggest-moves-premarket-ibm-axp-acor-low-fl-nke-more.html", "country": "US", "domain_rank": 767, "title": "Stocks making the biggest moves premarket: IBM, AXP, ACOR, LOW, FL, NKE & more", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T14:39:00.000+02:00", "replies_count": 0, "uuid": "f3d6d424f0f558d8ed1ff561b5825bfb61cbb57f"}, "author": "Peter Schacknow", "url": "https://www.cnbc.com/2018/01/19/stocks-making-the-biggest-moves-premarket-ibm-axp-acor-low-fl-nke-more.html", "ord_in_thread": 0, "title": "Stocks making the biggest moves premarket: IBM, AXP, ACOR, LOW, FL, NKE & more", "locations": [], "entities": {"persons": [{"name": "lowe", "sentiment": "none"}], "locations": [{"name": "fl", "sentiment": "none"}], "organizations": [{"name": "ibm", "sentiment": "negative"}, {"name": "axp", "sentiment": "negative"}, {"name": "acorda", "sentiment": "none"}, {"name": "american express", "sentiment": "none"}, {"name": "biogen", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "acorda therapeutics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Check out which companies are making headlines before the bell:\nIBM – IBM broke a long string of revenue declines, chalking up its first gain in 23 quarters. It reported adjusted quarterly profit of $5.18 per share, beating estimates by a penny a share, but the company did warn that a higher tax rate for 2018 would impact its profits.\nAmerican Express – The company earned an adjusted $1.58 per share for the fourth quarter, beating estimates by 4 cents a share. The financial services giant also saw revenue beat forecasts, however, the company reported its first overall quarterly loss in 25 years stemming from charges related to tax law changes. The company will maintain its quarterly dividend but has suspended share buybacks for the first half of 2018.\nAcorda Therapeutics – The drugmaker has reportedly received takeover interest from biotech firm Biogen , according to a Bloomberg report. Separately, Acorda announced a corporate restructuring designed to reduce expenses.\nLowe's – The home improvement chain named two new directors and said it would nominate a third at its annual meeting, following talks with activist investor D.E. Shaw.\nFoot Locker – The athletic footwear and apparel retailer was upgraded to \"outperform\" from \"market perform\" at Telsey Advisory Group, which thinks the worst is behind the industry as a whole and that Foot Locker acted quickly and decisively to adjust expenses and reorganize its business in light of those overall difficulties. Telsey is also positive on Deckers Outdoor , Nike , and Steven Madden .\nNike – In addition to the positive mention at Telsey, Nike was upgraded to \"outperform\" from \"neutral\" at Wedbush, which sees a return to growth in fiscal 2019\nCanadian Pacific Railway – The rail operator reported better than expected profit and revenue for its latest quarter, and said it was considering strategic deals to boost shipments of crude oil by rail. The rail operator is also forecasting higher pricing this year on rising demand.\nTexas Instruments – Texas Instruments will promote chief operating officer Brian Crutcher to Chief Executive Officer in June, succeeding Rich Templeton. Templeton will remain the semiconductor maker's chairman.\nAlphabet – Alphabet's Google unit struck a patent licensing agreement with China's Tencent Holdings in a move to expand its presence in China. This is Google's first such deal with a major Chinese tech company.\nBerkshire Hathaway – Berkshire Vice Chairman Ajit Jain reported an ownership stake of about $109 million in the company's stock. Jain is seen as a possible eventual successor to Warren Buffett.\nADT — ADT priced its initial public offering at $14 per share, well below the original target range of $17 to $19 per share. The home security company's offering values the company at about $10.6 billion.\nOverstock.com – The online retailer may be a takeover target of supermarket giant Kroger , according to sources Quote: d by the New York Post.\nSnap – The Snapchat parent has laid off 24 workers, half from its content team. The affected workers were based in New York and London, with the social media company consolidating its content operations in Los Angeles.\nMellanox Technologies – Mellanox reported better than expected revenue and profit for the fourth quarter, and the Israeli chipmaker also gave upbeat guidance for 2018. Mellanox is in the midst of a proxy fight with activist investor Starboard Value, which considers the company deeply undervalued.", "external_links": [], "published": "2018-01-19T14:39:00.000+02:00", "crawled": "2018-01-19T14:51:28.004+02:00", "highlightTitle": ""}