{"organizations": [], "uuid": "a8e0ec182b1c7d27e1fda668fb4dadbe1af8356e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 76}, "facebook": {"likes": 56, "shares": 56, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223453832&w=1200&r=LYNXMPEE0I1P7", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-timewarner-m-a-at-t-hearing/judge-overseeing-att-time-warner-merger-trial-hears-document-dispute-idUSKBN1F82PB", "country": "US", "domain_rank": 408, "title": "Judge overseeing AT&T, Time Warner merger trial hears document dispute", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T23:46:00.000+02:00", "replies_count": 0, "uuid": "a8e0ec182b1c7d27e1fda668fb4dadbe1af8356e"}, "author": "", "url": "https://www.reuters.com/article/us-timewarner-m-a-at-t-hearing/judge-overseeing-att-time-warner-merger-trial-hears-document-dispute-idUSKBN1F82PB", "ord_in_thread": 0, "title": "Judge overseeing AT&T, Time Warner merger trial hears document dispute", "locations": [], "entities": {"persons": [{"name": "richa", "sentiment": "none"}, {"name": "diane bartz", "sentiment": "none"}, {"name": "daniel petrocelli", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "time warner", "sentiment": "negative"}, {"name": "at&t", "sentiment": "negative"}, {"name": "dish network corp", "sentiment": "none"}, {"name": "justice department", "sentiment": "none"}, {"name": "directv", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 9:59 PM / Updated 14 hours ago Judge overseeing AT&T, Time Warner merger trial hears document dispute Diane Bartz 3 Min Read \nWASHINGTON (Reuters) - AT&T, owner of DirecTV, is asking for documents from a long list of companies as part of preparation for a trial to determine if they will be allowed to buy movie and TV show maker Time Warner, their lawyer Daniel Petrocelli said in a pre-trial hearing on Friday. \nThe Justice Department sued in November to stop AT&T, the No. 2 U.S. wireless company, from buying Time Warner for $85 billion because of concerns that it could raise prices for rivals and pay-TV subscribers as well as hamper the development of online video. Trial is set for March 19. \nDaniel Petrocelli, who represents AT&T and Time Warner, said that his team had been unable to get data requested from third parties, who had said they no longer had some of it. He asked the government, which did have the data, to return it so it could be subpoenaed. \nAn attorney for DISH Network Corp at the hearing identified himself to Judge Richard Leon and offered to discuss the dispute but Leon declined. \nThe third parties included Verizon Communications, Comcast, Cox, DISH, Charter, Disney and Viacom, among others, a source close to the trial said after the hearing. \nLeon expressed surprise at the problem. \n“So, the only copy they had, they turned over to the government?” he said, calling the situation “rather extraordinary.” FILE PHOTO: A screen shows the current price of Time Warner shares, above the floor of the New York Stock Exchange, shortly after the opening bell in New York, U.S. on November 15, 2017. REUTERS/Lucas Jackson/File Photo \nLeon said that if no solution was found by noon on Monday, he would order the government to return the data to the companies so that they could then either comply with the subpoenas or fight them in court. \n“I think that’s a sensible approach,” Petrocelli told the judge. \nFights over data are common during antitrust trials since companies that are subpoenaed frequently fear that their rivals’ executives will gain access to sensitive internal data. \nFor its part, a lawyer for the Justice Department, Peter Schwingler, said the government was barred from giving the data to AT&T under the terms of the subpoena that they used to collect it. \nLeon had given access to confidential information to the court, Justice Department lawyers and staff, service providers and AT&T and Time Warner’s outside counsel. \nA second government lawyer, Craig Conrath, said that he would request a stay if the U.S. Congress failed to fund the government and it shut down. \nLeon said the trial would likely continue. “My natural inclination will be not to grant a stay,” he said. \nThe fate of the deal has been widely followed because U.S. President Donald Trump criticized it on the campaign trail in 2016 and has repeatedly attacked the reporting of Time Warner’s CNN news network. In November, Trump reiterated his opposition to the deal. Reporting by Diane Bartz; Editing by Sandra Maler", "external_links": [], "published": "2018-01-19T23:46:00.000+02:00", "crawled": "2018-01-20T00:03:21.011+02:00", "highlightTitle": ""}