{"organizations": [], "uuid": "3c4a2a3671c19f5d270beae2d7b2a8817a335f25", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-steven-grimberg-joins-nardello-co-as-a-managing-director-and-general-counsel-for-the-americas.html", "country": "US", "domain_rank": 767, "title": "Steven Grimberg Joins Nardello & Co. as a Managing Director and General Counsel for the Americas", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T15:00:00.000+02:00", "replies_count": 0, "uuid": "3c4a2a3671c19f5d270beae2d7b2a8817a335f25"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-steven-grimberg-joins-nardello-co-as-a-managing-director-and-general-counsel-for-the-americas.html", "ord_in_thread": 0, "title": "Steven Grimberg Joins Nardello & Co. as a Managing Director and General Counsel for the Americas", "locations": [], "entities": {"persons": [{"name": "grimberg", "sentiment": "none"}, {"name": "steve", "sentiment": "none"}, {"name": "steven grimberg", "sentiment": "none"}], "locations": [{"name": "americas new york", "sentiment": "none"}, {"name": "americas", "sentiment": "none"}, {"name": "atlanta", "sentiment": "none"}, {"name": "northern district of georgia", "sentiment": "none"}], "organizations": [{"name": "steven grimberg joins nardello & co.", "sentiment": "negative"}, {"name": "nardello & co", "sentiment": "negative"}, {"name": "llc", "sentiment": "negative"}, {"name": "nardello & co.", "sentiment": "none"}, {"name": "u.s. attorney’s office", "sentiment": "none"}, {"name": "economic crimes section", "sentiment": "none"}, {"name": "u.s. department of justice", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- Nardello & Co. LLC, a leading global investigations firm, today announced that Steven Grimberg has joined the firm as a Managing Director and General Counsel – Americas. He is also Head of the firm’s Atlanta office. Mr. Grimberg will lead Nardello & Co.’s efforts to develop and serve clients in the southeast as well as nationally.\nMr. Grimberg joins Nardello & Co. from the U.S. Attorney’s Office for the Northern District of Georgia, where he served as an Assistant United States Attorney and Deputy Chief of the Economic Crimes Section. In addition to prosecuting and supervising complex white-collar criminal cases, Mr. Grimberg developed and led a Cyber-Crime Unit that investigated, disrupted and prosecuted some of the most prolific cyber-criminals in the world. Mr. Grimberg received numerous awards and recognitions during his tenure in public service, including the prestigious U.S. Department of Justice Director’s Award on two occasions, most recently in 2017.\n“Steve’s legal acumen, coupled with his deep understanding of complex financial fraud investigations and crisis management experience in the cybercrime arena will be a tremendous addition to our deep bench of talent,” said Dan Nardello, Founder & Chief Executive Officer of Nardello & Co. “He is a proven leader, having developed one of the leading Cyber-Crime Units in the U.S. Department of Justice and having helped to supervise a section of approximately twenty-five prosecutors and other professionals at the U.S. Attorney’s Office. At all times he has demonstrated his commitment to ethics and integrity, both of which go to the core of Nardello & Co.’s DNA. I am delighted to welcome Steve to the Nardello & Co. team and look forward to his contributions as we continue to grow our practice in Atlanta and beyond.”\n“I am thrilled to join Nardello and Co. and work with such an esteemed group of professionals,” said Mr. Grimberg. “I look forward to leveraging my legal, white-collar and cyber experience to bolster the firm’s strong offerings in the southeast and support Nardello’s clients around the globe.”\nBiography\nSteven Grimberg\nPrior to joining Nardello & Co., Mr. Grimberg served as an Assistant United States Attorney in Atlanta, Georgia, where he investigated and prosecuted numerous complex white collar criminal cases involving corporate fraud, embezzlement, public corruption, insider trading, tax evasion, computer hacking, the theft of intellectual property and trade secrets, bank fraud and health care fraud. Mr. Grimberg served in various capacities at the U.S. Department of Justice for over twelve years, both in Washington D.C. and Atlanta. Mr. Grimberg has seven years of private practice experience, representing Fortune 500 companies in complex civil litigation across the country. He also currently serves as an Adjunct Professor at Emory Law School, where he teaches courses on criminal law, criminal procedure and courtroom advocacy.\nMr. Grimberg holds a BA in English, Political Science and Criminal Justice from the University of Florida, and a JD from Emory Law School.\nAbout Nardello & Co.\nNardello & Co. is a global investigations firm with experienced professionals handling a broad range of issues including the FCPA/UK Bribery Act and other corruption-related investigations, civil and white collar criminal litigation and arbitration support, asset tracing, strategic intelligence and political risk assessment, computer forensics, and reputational due diligence. The firm’s clients include the world’s leading law firms and financial institutions, Fortune 500 and FTSE 100 companies, high-net-worth individuals and family offices, governments, NGOs, sports organizations and academic institutions. With offices in New York, London, Washington DC, Atlanta, Hong Kong, Tokyo, Milan and Dubai, Nardello & Co.’s professional staff includes former US federal prosecutors, former general counsels of multinational corporations, US and international lawyers, former law enforcement personnel and intelligence operatives, licensed investigators, research analysts, former journalists, financial crime specialists, forensic accountants and computer forensic experts.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180108005225/en/\nMedia\nEllen Davis/Kelsey Markovich\nSard Verbinnen & Co.\n212-687-8080\nNardello-SVC@sardverb.com\nSource: Nardello & Co. LLC", "external_links": ["http://www.businesswire.com/news/home/20180108005225/en/"], "published": "2018-01-08T15:00:00.000+02:00", "crawled": "2018-01-08T15:33:02.000+02:00", "highlightTitle": ""}