{"organizations": [], "uuid": "0cabffcc0870e9b25db1cd8d28ee06488181cb07", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/04/104928999-GettyImages-883220374.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100727362/device/rss/rss.html", "section_title": "World News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/18/ai-is-extremely-disruptive-robert-shiller.html", "country": "US", "domain_rank": 767, "title": "AI is 'extremely disruptive': Robert Shiller", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T08:40:00.000+02:00", "replies_count": 0, "uuid": "0cabffcc0870e9b25db1cd8d28ee06488181cb07"}, "author": "Holly Ellyatt", "url": "https://www.cnbc.com/2018/01/18/ai-is-extremely-disruptive-robert-shiller.html", "ord_in_thread": 0, "title": "AI is 'extremely disruptive': Robert Shiller", "locations": [], "entities": {"persons": [{"name": "robert shiller", "sentiment": "negative"}, {"name": "shiller", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "yale university", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Adam Jeffery | CNBC Robert Shiller \nArtificial intelligence (AI) could be the biggest challenge facing the jobs market and even humanity itself, according to Nobel Prize-winning economist Robert Shiller. \nHowever, the Yale University professor told CNBC that he had a radical idea that could be implemented to mitigate AI's potential harm to society. \nSpeaking ahead of the World Economic Forum (WEF) in Davos, Switzerland, which he will be attending, Shiller said: \"What we're seeing is something unprecedented, which is the arrival of artificial intelligence, which has a big impact.\" \nAsked if he was worried about AI, Shiller said it was an unknown entity. \"It creates tremendous uncertainty and impacts different people differently,\" he said. \"And some people could be left out.\" \n\"It might turn out well. It may be that we'll have more school teachers and smaller classes, and people will be taking care of the elderly and we'll be living longer and there'll be people to look after the elderly. We'll see,\" he added. \"But, for me, the big thing is the uncertainty we face because of AI, it could be extremely disruptive.\" \nAI has attracted a lot of attention in recent years amid widespread concern that artificial intelligence, or robots, will replace human workers, causing a seismic shift in society and the economy. \nIn 2013, Oxford University published a study that estimated that 47 percent of U.S. jobs could be replaced by robots and automated technology within 20 years. And that view has been echoed by other high-profile tech leaders. 'Livelihood insurance' \nNot everyone agrees that AI will be such a bad thing, however. Research firm Gartner, for instance, said in a recent report that AI could in fact create 2.3 million jobs by 2020, exceeding the 1.8 million that it could wipe out . \nShiller, who won the Nobel Prize for Economics in 2013 for his work on asset prices and inefficient markets, said he advocated some kind of \"livelihood insurance\" to mitigate against the potential loss of jobs or drop in incomes that AI could cause. \n\"I think that people are facing career risks like never before and what I've advocated in the book 'Finance and the Good Society' is that I think we should think about some kind of insurance program for individuals and their careers, and to prevent inequality from just running its course,\" he said. show chapters 1:23 PM ET Thu, 27 July 2017 | 01:28 \n\"People tend to worry about what's happening now and maybe redistributing income on a government basis now, but I think we should be moving towards other kinds of insurance-type of redistribution.\" \nAsked more about the concept of livelihood insurance, that could insure people against a decline in their occupation or income, Shiller said the idea was already taking root but that it needed more \"figuring out\" for a wider application. \n\"We're starting to see a bit of livelihood insurance (in action). We now have web design academies that teach young people how to program computers to run internet sites and they don't charge anything unless you get a job at a certain level of income. Then they'll tax your first year of income, they'll take 10 percent of your first year's income. They're promising you a job, and if you don't get a job you pay nothing — that's actually happening.\" \nFollow CNBC International on Twitter and Facebook .", "external_links": [], "published": "2018-01-18T08:40:00.000+02:00", "crawled": "2018-01-18T08:44:51.011+02:00", "highlightTitle": ""}