{"organizations": [], "uuid": "8559aee011a15f60482c781340ab8ae26ad50a8a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/uk-ecb-policy-hansson/ecb-could-end-bond-buys-in-one-go-after-sept-hansson-idUSKBN1F4256", "country": "US", "domain_rank": 408, "title": "ECB could end bond buys in one go after Sept - Hansson", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T18:00:00.000+02:00", "replies_count": 0, "uuid": "8559aee011a15f60482c781340ab8ae26ad50a8a"}, "author": "", "url": "https://www.reuters.com/article/uk-ecb-policy-hansson/ecb-could-end-bond-buys-in-one-go-after-sept-hansson-idUSKBN1F4256", "ord_in_thread": 0, "title": "ECB could end bond buys in one go after Sept - Hansson", "locations": [], "entities": {"persons": [{"name": "peter praet", "sentiment": "none"}, {"name": "hansson", "sentiment": "none"}, {"name": "ardo hansson", "sentiment": "none"}], "locations": [{"name": "frankfurt", "sentiment": "none"}, {"name": "estonia", "sentiment": "none"}], "organizations": [{"name": "ecb", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "boersen zeitung", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 29 PM / a few seconds ago ECB could end bond buys in one go after Sept - Hansson Reuters Staff 2 Min Read \nFRANKFURT (Reuters) - The European Central Bank could end its 2.55 trillion euro ($3.13 trillion) bond purchase scheme in one step after September if the economy and inflation develop as now expected, rate setter Ardo Hansson told German newspaper Boersen Zeitung. \nInvestors started to bring forward their rate hike expectations last week and hints of a quick end to the bond buys could further bolster market bet as the ECB has long tied the first rate move to the end of its quantitative easing scheme. \n“If growth and inflation is evolving more or less in line with the projections, it would certainly be conceivable and also appropriate to end the purchases after September,” Boersen Zeitung quoted Estonia’s central bank chief as saying on Monday. \n“I think we can go to zero (monthly purchases) in one step without any problems,” said Hansson, mentioned by analyst as a potential candidate to replace ECB chief economist Peter Praet next year. \nThe ECB has said that the first rate move would come “well past” the end of bond buys, a signal markets have taken to mean around three to six months. \nMinutes of the ECB’s December meeting published on Thursday suggested growing appetite for revising the bank’s communication stance. This sent the euro stronger on expectations that the ECB would start charting the course to the end of stimulus. \n“There is a need for action in our communication,” Hansson said. “We now have to think and discuss intensively how we are gradually changing our communication.” \nThe euro’s gain could worry some policymakers as it could dampen growth and inflation by making exports dearer and imports cheaper, but Hansson played down the move. \n“Up to now, the appreciation of the euro is not a threat to the inflation outlook and does not change our view,” Hansson said. “You should not overdramatize that.” \nHe added that inflation pressure were already building under the surface and while this pressure was still moderate, the signs were still positive. Reporting by Balazs Koranyi; Editing by Francesco Canepa", "external_links": [], "published": "2018-01-15T18:00:00.000+02:00", "crawled": "2018-01-15T18:36:23.007+02:00", "highlightTitle": ""}