{"organizations": [], "uuid": "ef22bb1881e7a522ab127312f6cde5683615048c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/01/22/100397294-switzerland-davos-schatzalp-dusk-gettyp.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/16/davos-wants-to-heal-a-fractured-world-but-what-and-where-are-the-problems.html", "country": "US", "domain_rank": 767, "title": "Davos wants to heal a 'fractured world.' But what and where are the problems?", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T15:50:00.000+02:00", "replies_count": 0, "uuid": "ef22bb1881e7a522ab127312f6cde5683615048c"}, "author": "Holly Ellyatt", "url": "https://www.cnbc.com/2018/01/16/davos-wants-to-heal-a-fractured-world-but-what-and-where-are-the-problems.html", "ord_in_thread": 0, "title": "Davos wants to heal a 'fractured world.' But what and where are the problems?", "locations": [], "entities": {"persons": [{"name": "davos", "sentiment": "neutral"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "world economic forum", "sentiment": "negative"}, {"name": "wef", "sentiment": "none"}, {"name": "forum", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The theme at this year's World Economic Forum (WEF) in Davos, Switzerland, is \"creating a shared future in a fractured world.\"\nThe plan is to bring together global economic and political leaders to find collective actions and collaborative approaches to solving global problems.\nWEF will use the 2018 forum to make the \"case for renewed commitment to international collaboration as a way of solving critical global challenges.\" More than 2,500 leaders from business, government, international organizations, civil society, academia, media and\nthe arts that are expected to attend the conference in the Alpine resort.\n\"The aim of the meeting will be to set an agenda that drives greater multi-stakeholder collaboration to address political, economic and societal challenges of our times,\" WEF said in an online statement.\nIn 2018, the Forum said that \"geostrategic fractures have re-emerged on multiple fronts with wide-ranging political, economic and social consequences.\"\nSumming these fractures up in three main areas will be the focus for this year's meeting, the Forum said. In its own words:\n•\"Politically, governance is being transformed by new and contending strategic narratives.\"\n•\"Economically, policies are being formulated to preserve the singular benefits of global integration while limiting its shared obligations.\"\n•\"Socially, citizens yearn for responsive leadership that addresses local and national concerns; yet, a shared identity and collective purpose remain elusive despite living in an age of social networks.\"\nWEF added that \"the fractures that have emerged politically, economically and socially must not foster intolerance, indecision and inaction. The 48th World Economic Forum Annual Meeting therefore aims to rededicate leaders from all walks of life to developing a shared narrative to improve the state of the world.\"\nLee Howell, WEF's head of global programming and a member of the managing board, explained the organization's thinking behind the theme and said that the fractures were present in many spheres of life, stemming from conflicting systems of ideas and influence.\n\"It's emerging that there are multiple concepts about how that world system should be now, it's not just contending actors in one system but contending actors and contending systems,\" he told CNBC ahead of the Forum.\n\"We think that the world is more fractured than unified but it's incumbent on leaders to find a shared purpose, a shared vision to rally around to get things done and to improve the state of the world. And so those notions are embedded in the theme. That takes people in the room being honest about what the shortcomings of the systems are and to not be caught in the past.\"\nBig names, big issues As in previous forums, 2018's meeting will see some big names in attendance, including U.S. President Donald Trump, Indian Prime Minister Narendra Modi and French President Emmanuel Macron.\nWhile it's an achievement to get such leaders together, and a positive step for those leaders to listen each other's perspective on matters such as globalization, global risks and free trade, it is much harder to get them to agree on a \"shared course of action\" as advocated by the Forum.\nA collaborative effort is not likely to chime with President Trump, however, who is expected to promote his \"America First\" doctrine and an anti-globalization perspective to Davos' attendees, whether they agree with him or not. He is also expected to say that his economic policies are working with robust growth in the U.S. at least in part being attributed to the Trump economy.\nIndeed, it's difficult to argue that the world, as a whole, is in bad shape economically. The global economic outlook for 2018 is looking rosy with the International Monetary Fund (IMF) predicting in its last World Economic Outlook in October a growth rate of 3.7 percent in 2018 .\nHowever, the benefits of economic growth remain elusive for many, WEF founder Klaus Schwab has noted.\n\"Our collective inability to secure inclusive growth and preserve our scarce resources puts multiple global systems at risk simultaneously,\" he wrote in a WEF statement in September 2017.\n\"Our first response must be to develop new models for cooperation that are not based on narrow interests but on the destiny of humanity as a whole.\"\nFollow CNBC International on Twitter and Facebook .", "external_links": ["https://www.facebook.com/cnbcinternational", "https://twitter.com/cnbci", "https://www.imf.org/en/Publications/WEO/Issues/2017/09/19/world-economic-outlook-october-2017"], "published": "2018-01-16T15:50:00.000+02:00", "crawled": "2018-01-20T15:05:44.005+02:00", "highlightTitle": ""}