{"organizations": [], "uuid": "21f894680d6a8220ccb7b4b59026cd6be25ab36c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XD243_3jrNn_TOP_20180123173400.jpg", "site_section": "http://www.wsj.com/xml/rss/3_7014.xml", "section_title": "WSJ.com: US Business", "url": "https://www.wsj.com/articles/a-shortage-of-trucks-is-forcing-companies-to-cut-shipments-or-pay-up-1516789800", "country": "US", "domain_rank": 387, "title": "A Shortage of Trucks is Forcing Companies to Cut Shipments or Pay Up", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T12:30:00.000+02:00", "replies_count": 0, "uuid": "21f894680d6a8220ccb7b4b59026cd6be25ab36c"}, "author": "Jennifer Smith", "url": "https://www.wsj.com/articles/a-shortage-of-trucks-is-forcing-companies-to-cut-shipments-or-pay-up-1516789800", "ord_in_thread": 0, "title": "A Shortage of Trucks is Forcing Companies to Cut Shipments or Pay Up", "locations": [], "entities": {"persons": [{"name": "eric stuch", "sentiment": "none"}], "locations": [], "organizations": [{"name": "michelin north america inc.", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "89 COMMENTS A nationwide truck shortage is forcing thousands of shippers into a tough choice: postpone all but the most important deliveries, or pay dearly to jump to the front of the line.\nMichelin North America Inc. cut its daily shipments of synthetic rubber from one plant by a fifth earlier this month and is at times paying double its usual price for temperature-controlled trucks, said Eric Stuch, a logistics manager at the tire manufacturer. Meal-kit service HelloFresh SE recently enlisted one of its produce suppliers to help move shipments to the airport in a snowstorm.\nRelated Coverage\nTrucking Companies Race to Add Capacity, Drivers as Market Heats Up Why Airfreight Traffic Is Up: Dog Food and Semiconductors Are Vying for Space Teamsters Tell UPS: No Drones or Driverless Trucks Norway Takes Lead in Race to Build Autonomous Cargo Ships Several factors have converged to overwhelm the trucking market. Freight volumes in December hit near-record levels for that time of year, on the back of a strengthening economy. Retailers are replenishing stocks after one of the strongest holiday sales seasons in recent years. Manufacturers are also shipping more cargo; in December, industrial production had the largest year-over-year gain since 2010, according to the Federal Reserve.\nWhat’s more, bad weather and a new federal safety rule that took effect in December have crimped the supply of available trucks. Diesel prices are near a three-year high, adding to transportation costs.\nIn the spot market, where shippers hire trucks on short notice, there were about 10 loads waiting to be moved for every available truck in the week ending Jan. 20, compared with three in the same week last year, according to online freight marketplace DAT Solutions LLC.\nSpot-market prices for dry vans, the most commonly used big rig, are up more than 20% year-over-year. Analysts expect long-term contract rates that shippers negotiate with carriers to rise by between 5% and 8% this year.\nBeer distributor Constellation Brands Inc. and food companies Campbell Soup Co. and the J.M. Smucker Co. have all cited rising freight costs in recent earnings calls.\n“Literally every possible thing that could be going against a shipper is happening right now,” said Michael Redisch, a principal at Chicago-based freight broker Atomic Transport LLC.\nTrucking fleets are adding capacity, but it can take months or even years to catch up with demand. Meanwhile, they are getting pickier about which manufacturers and retailers they work with. Companies sometimes find it hard to convince truckers to pick up cargo at warehouses known for long loading times or traffic jams at the gate.\nMr. Stuch, the Michelin logistics manager, said the company “hit a wall in December,” when some regular carriers didn’t want to haul its cargo because of wait times at a few plants.​\nMichelin pushed employees to speed up receiving and is prioritizing shipments needed to keep production running over less-essential freight. Orders are spread out to avoid overloading carriers at the end of the week.\nThe company can only do so much, particularly when it needs a temperature-controlled truck to keep the synthetic rubber from freezing in transit. For those trucks, loads outstrip available big rigs by a ratio of about 15 to one, according to DAT. In Louisville, Ky., Michelin is paying $2,600 on the spot market for some of those trucks, roughly twice its long-term contract rates. Some nonrefrigerated loads are being shifted over to rail.\nA new federal safety rule in December requiring drivers to track their hours behind the wheel with electronic logging devices, or ELDs, has exacerbated the problem. Prices shot up for some routes that now might take two days instead of one because of stricter timekeeping.\nJanuary is typically a quiet month for freight. But in the first three weeks of January, national average spot truckload rates were higher than during the peak season in 2017, according to DAT.\nExtreme weather has made trucks even harder to come by.\nDuring the “bomb cyclone” that closed roads and ports along the Atlantic seaboard this month, trucks were in such short supply that meal-kit company HelloFresh ended up asking one of its produce suppliers to help truck shipments from its Newark, N.J., warehouse to FedEx Corp.’s nearby regional air hub.\n“We were unable to find trucks,” said Brett Banchek, the company’s vice president of supply chain for the U.S. “It was like trying to get a cab at LaGuardia.”\nLynch Logistics Inc., a Bangor, Me., trucking company that hauls cargo for retailers and companies that make paper goods, is “turning down freight on a daily basis,” said Dana Burleigh, vice president of operations.\nFormer customers are calling back looking for capacity, and some Canadian companies are offering to pay round-trip prices instead of the usual one-way rates if Lynch sends trucks their way, Mr. Burleigh said. The company has raised driver pay and is stepping up recruitment, costs it will eventually pass on to shippers.\nAnalysts expect capacity to become scarcer in April, when produce shipments pick up and full enforcement of the ELD rule kicks in. Vehicles without the devices may be removed from the road.\n“If this is the slow period, what happens when seasonality starts to pick up?” said Ravi Shanker, a transportation analyst with Morgan Stanley.\nMeanwhile, shippers are scouring the freight market in search of available trucks.\n“It’s been tough,” said Candace Holowicki, who manages transportation and logistics for dental-supply firm Metrex Research, a division of science, health-care and technology conglomerate Danaher Corp. “So far in January I’ve had 22 loads that I either had to switch brokers, find a different carrier or pay more money, anywhere from $300 extra to $1,200 extra.”\nAs the container shipping industry continues to boom, companies are adopting new technologies to move cargo faster and shifting to crewless ships. But it’s not all been smooth sailing and the future will see fewer players stay above water. Write to Jennifer Smith at jennifer.smith@wsj.com", "external_links": [], "published": "2018-01-24T12:30:00.000+02:00", "crawled": "2018-01-24T13:22:17.011+02:00", "highlightTitle": ""}