{"organizations": [], "uuid": "85a219250a02b8395ba6eafe1ff037d3f35c7128", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222656424&w=1200&r=LYNXMPEE0G0E1", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-pearson-outlook/pearson-sees-2018-growth-after-fx-impact-and-disposals-idUKKBN1F60PM", "country": "US", "domain_rank": 408, "title": "Pearson sees 2018 growth after FX impact and disposals​", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T09:35:00.000+02:00", "replies_count": 0, "uuid": "85a219250a02b8395ba6eafe1ff037d3f35c7128"}, "author": "", "url": "https://uk.reuters.com/article/uk-pearson-outlook/pearson-sees-2018-growth-after-fx-impact-and-disposals-idUKKBN1F60PM", "ord_in_thread": 0, "title": "Pearson sees 2018 growth after FX impact and disposals​", "locations": [], "entities": {"persons": [{"name": "paul sandle", "sentiment": "none"}, {"name": "pearson", "sentiment": "none"}, {"name": "kate holton", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "pearson", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 7:35 AM / Updated 4 hours ago Pearson hit again as weak U.S. demand weighs on education group Kate Holton 3   Educational publisher Pearson ( PSON.L ) expects pressure from its North American business to weigh on 2018 earnings, the former owner of the Financial Times newspaper warned on Wednesday, sending its shares to three-month lows. \nPearson, which has struggled since turning its focus to education, said retail partners had turned more cautious when ordering books, forecasting 2017 sales in U.S. higher education course materials down 3 percent on an underlying basis. \nThat was at the lower end of its previous guidance and knocked Pearson shares, which fell 5 percent. The company in October had indicated that pressures on the U.S. business were easing. \n“Our higher ed courseware business is about 25 percent of Pearson, the other 75 percent of the business has performed well,” Chief Executive John Fallon said. \n“We have said we are running Pearson on the basis that higher ed courseware is going to decline in underlying terms by about 5 or 6 percent per year through to the end of 2019 at which point we expect it to stabilise and start to grow again.” \nFor 2018 it forecast U.S. higher education courseware revenue to be flat to down by a mid-single digit percent. \nAt the group level, the British company said its restructuring would help protect profit in 2017 and enable it to eke out underlying growth in 2018. \nIt forecast a 2018 adjusted operating profit of 520 million to 560 million pounds which it said would constitute underlying growth when taking account of asset sales and currency moves. \nAnalysts said the forecast was in line with expectations but noted ongoing challenges. \n“There’s still plenty of work to be done if Pearson is to pull off a successful transformation from staid publishing house to trailblazer in the emerging world of digital education,” said George Salmon, equity analyst at Hargreaves Lansdown. \nFor 2017, Pearson forecast an adjusted operating profit of around 570 million to 575 million pounds, lower than an October estimate of 576 million to 606 million hurt by currency moves since. \nHad currency levels stayed the same, its profit would have come in towards the upper end of its forecast, it said. \nPearson has issued a string of profit warnings hit by the cost of moving to digital from paper textbooks and courseware. \nThe 174-year-old firm has sold businesses such as the Financial Times newspaper and the Economist magazine to focus on education but has struggled as the market changed. \nIt has since cut thousands of jobs and launched a rental and online business after students stopped buying expensive text books. \nIn August, Pearson said it would slash its dividend and cut another 3,000 jobs. By 2020, Fallon will have reduced Pearson’s staff by 10,000 from around 39,000 when he took over in 2013. Reporting by Kate Holton; editing by Jason Neely and Keith Weir", "external_links": [], "published": "2018-01-17T09:35:00.000+02:00", "crawled": "2018-01-17T10:04:49.001+02:00", "highlightTitle": ""}