{"organizations": [], "uuid": "f24681e608e072791142d72b620861c2a2038839", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-yukon-supports-upstream-rehabilitation-with-its-acquisition-of-drayer-physical-therapy-institute.html", "country": "US", "domain_rank": 767, "title": "Yukon Supports Upstream Rehabilitation with its Acquisition of Drayer Physical Therapy Institute", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.539, "site_type": "news", "published": "2018-01-08T13:00:00.000+02:00", "replies_count": 0, "uuid": "f24681e608e072791142d72b620861c2a2038839"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-yukon-supports-upstream-rehabilitation-with-its-acquisition-of-drayer-physical-therapy-institute.html", "ord_in_thread": 0, "title": "Yukon Supports Upstream Rehabilitation with its Acquisition of Drayer Physical Therapy Institute", "locations": [], "entities": {"persons": [{"name": "hummel", "sentiment": "none"}], "locations": [{"name": "minneapolis", "sentiment": "none"}, {"name": "revelstoke", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "alabama", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}], "organizations": [{"name": "yukon supports upstream rehabilitation", "sentiment": "negative"}, {"name": "yukon partners", "sentiment": "negative"}, {"name": "acquisition of drayer physical therapy institute", "sentiment": "negative"}, {"name": "revelstoke capital partners", "sentiment": "none"}, {"name": "goldman sachs merchant banking division", "sentiment": "none"}, {"name": "drayer physical therapy institute", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MINNEAPOLIS--(BUSINESS WIRE)-- Yukon Partners (\"Yukon\"), a provider of mezzanine capital for middle market private equity transactions, is pleased to announce its support of Upstream Rehabilitation (“Upstream” or the “Company”), a portfolio company of Revelstoke Capital Partners (“Revelstoke”), in its acquisition of Drayer Physical Therapy Institute, LLC (“DPTI”). Certain DPTI shareholders, including Goldman Sachs Merchant Banking Division, rolled over a portion of their proceeds in exchange for a minority ownership stake in Upstream.\nUpstream, headquartered in Birmingham, Alabama, is a provider of outpatient rehabilitation services, providing care through free-standing physical therapy clinics, outpatient rehabilitation management services, and a member network of rehabilitation service providers. With the DPTI transaction, Upstream is the fourth-largest outpatient physical therapy provider in the U.S. with over 550 clinics across 27 states. The Company is a current portfolio company of Yukon and is led by Revelstoke, a Denver-based private equity firm.\nDPTI, headquartered in Hummelstown, Pennsylvania, is an outpatient physical therapy platform with over 160 locations across 15 states. The acquisition of DPTI provides Upstream with an opportunity to create an industry-leading physical therapy platform with significant density and scale across its markets.\n“Upstream and DPTI share similar cultures and a strong commitment to clinical excellence and compliance. We see a tremendous opportunity to combine the strengths and capabilities of both companies, while maintaining the portfolio of brands from each, to continue to grow and be the provider and employer of choice in the industry,” said David Van Name, CEO and founder of Upstream.\n“Since we invested in Upstream in December 2015, the company has nearly tripled in size driven by above-market same-clinic growth, approximately 100 de novo clinic openings and 12 add-on acquisitions. We have enjoyed a strong partnership with the Upstream management team and look forward to working with them on this transformative acquisition,” said Simon Bachleda, Managing Partner at Revelstoke.\n“Yukon’s extensive healthcare experience and knowledge of the outpatient rehab industry is evidence of their value-add approach as a mezzanine capital partner. We were pleased that Yukon stepped up to play a leading role on this transaction,” added Andrew Welch, Managing Director at Revelstoke.\n“Yukon is excited to support Revelstoke and Upstream management as they continue to grow the Company,” said Michael Hall, Managing Partner of Yukon. “The addition of DPTI provides increased scale and density, and enables the Company to better serve its core markets.”\nAbout Upstream Rehabilitation\nUpstream Rehabilitation is a leading national provider of outpatient rehabilitation services, providing care through free-standing physical therapy clinics, outpatient rehabilitation management services, and a member network of rehabilitation service providers. With corporate offices in Birmingham, Alabama, Upstream currently operates more than 550 owned and managed clinics across 27 states. For more information, please visit www.upstreamrehabilitation.com .\nAbout Yukon Partners\nYukon Partners is an independent and unaffiliated junior capital provider, primarily serving middle market private equity sponsor led business transactions in the U.S. and Canada. The transactions in which Yukon invests include buyouts, growth and platform strategies, recapitalizations, mergers/acquisitions, and public-to-private buyouts. Yukon typically invests $10 to $50 million per transaction. Yukon is based in Minneapolis, Minnesota. For more information, please visit www.yukonpartners.com .\nAbout Revelstoke Capital Partners\nRevelstoke is a private equity firm formed by experienced investors who focus on building industry-leading companies in the healthcare and business services sectors. Revelstoke partners with entrepreneurs and management teams to execute on a disciplined organic and acquisition growth strategy to build exceptional companies. Revelstoke has approximately $1.0 billion of regulatory assets under management and, since the firm’s inception in mid-2013, has completed 40 acquisitions, which includes 10 platform companies and 30 add-on acquisitions. For more information, please visit www.revelstokecp.com .\n //www.businesswire.com/news/home/20180108005629/en/\nYukon Partners\nMichael Hall, 612-435-7802\nManaging Partner\nSource: Yukon Partners", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.upstreamrehabilitation.com%2F&esheet=51739215&newsitemid=20180108005629&lan=en-US&anchor=www.upstreamrehabilitation.com&index=1&md5=c937d2d8657243f01638777e0b1617da", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.yukonpartners.com&esheet=51739215&newsitemid=20180108005629&lan=en-US&anchor=www.yukonpartners.com&index=2&md5=f496df05be5c239bc4c9c995cc0064ba", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.revelstokecp.com&esheet=51739215&newsitemid=20180108005629&lan=en-US&anchor=www.revelstokecp.com&index=3&md5=f3127579b24535e6a6533376c5902bdf", "http://www.businesswire.com/news/home/20180108005629/en/"], "published": "2018-01-08T13:00:00.000+02:00", "crawled": "2018-01-08T15:16:58.000+02:00", "highlightTitle": ""}