{"organizations": [], "uuid": "88e855b98f1b07bcfb41ac322def3aef4ff2dcac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222920998&w=1200&r=LYNXMPEE0H08L", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-muguruza/tennis-muguruza-outfoxed-by-hsieh-in-second-round-defeat-idUKKBN1F70EA", "country": "US", "domain_rank": 408, "title": "Tennis - Hsieh proves too much of a puzzle for beaten Muguruza", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T08:25:00.000+02:00", "replies_count": 0, "uuid": "88e855b98f1b07bcfb41ac322def3aef4ff2dcac"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-muguruza/tennis-muguruza-outfoxed-by-hsieh-in-second-round-defeat-idUKKBN1F70EA", "ord_in_thread": 0, "title": "Tennis - Hsieh proves too much of a puzzle for beaten Muguruza", "locations": [], "entities": {"persons": [{"name": "hsieh", "sentiment": "negative"}, {"name": "garbine muguruza", "sentiment": "none"}, {"name": "hsieh su-wei", "sentiment": "none"}, {"name": "muguruza", "sentiment": "none"}, {"name": "venus williams", "sentiment": "none"}], "locations": [], "organizations": [{"name": "min read  melbourne", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "muguruza", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 4:24 AM / Updated 21 minutes ago Tennis - Hsieh proves too much of a puzzle for beaten Muguruza 4 Min Read \nMELBOURNE (Reuters) - Garbine Muguruza will not forget her first career encounter with Hsieh Su-wei in a hurry. \nFor a minute shy of two hours the Spanish third seed and many people’s Australian Open favourite blazed away in searing heat trying to solve the puzzle set by the 32-year-old, who previously had managed only two wins against players ranked in the top 20 in 17 years on Tour. \nThe trouble was that her main weapon, the sledgehammer groundstrokes that took her past Venus Williams to last year’s Wimbledon title, proved futile as she slumped to a 7-6(1) 6-4 defeat to Hsieh. \nMuguruza, who needed treatment early on for a blister on her foot, found her heaviest hits coming back in unusual places and to make matters worse she was often left flat-footed by her Taiwanese opponent’s punchy and flat double-handed groundstrokes, apparently manufactured with minimum effort. \nIt was all rather perplexing for the 24-year-old as she chalked up 43 unforced errors during the match. Her frustration could have cost her a default when she swiped a ball dangerously close to a line judge when serving at 5-6 in the opening set. \nInstead she received only a warning from the match umpire. \nMuguruza refused to blame the heat, which soared to 39 degrees Celsius, the blister, or a strapped right thigh for her earliest loss in Melbourne since a second-round thrashing by Serena Williams five years ago. \n“She’s definitely a very tricky opponent,” she said. “I think today she played well. I maybe could have done things better, but at the end, she deserves to win. That’s really it.” \nIt was an honest appraisal. \nApart from when she recovered from 5-2 in the first set and a brief rally at the end of the second, she was inferior against the former world doubles number one whose box of tricks featured several shots not found in any tennis textbook. \nHsieh, who wobbled briefly when 5-2 ahead in the second set, was especially productive on the backhand side, guiding 12 winners past her opponent, the last one coming on match point. \n“Today I tried to hit the ball a little bit harder because I didn’t want to let destroy me on the court,” Hsieh, who will face a player very much in her mould in Poland’s 26th seed Agnieszka Radwanska on Saturday, told reporters. \n”I do a lot of different training. I practise topspin, flat balls, slice. I try to practice all the stuff. So against different players, I try to do a little bit different stuff. \n“Not try to play the same game. It helps a lot.” \nMuguruza will rue the first set tiebreak that she allowed to get away from her all too easily, having dug deep to claw herself back into the set. \nShe served a double-fault at 1-4 and then was left standing by a backhand jab down the line as Hsieh moved 6-1 ahead before Muguruza wafted a forehand over the line to concede the set. \nMuguruza unravelled in the second set and looked cooked at 2-5 before some late Hsieh nerves gave her a glimmer of hope. \nHsieh held it together when she served at 5-4, however, as Muguruza joined fellow seeds Venus Williams, Sloane Stephens, Coco Vandeweghe, Kristina Mladenovic and Johanna Konta through the exit door. Editing by Peter Rutherford", "external_links": [], "published": "2018-01-18T08:25:00.000+02:00", "crawled": "2018-01-18T08:42:22.009+02:00", "highlightTitle": ""}