{"organizations": [], "uuid": "813f21b2794a09e0bd7500e90d368f81ec44c674", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-libya-security/armed-group-clashes-shut-airport-in-libyan-capital-idUKKBN1F410J", "country": "US", "domain_rank": 408, "title": "Armed group clashes shut airport in Libyan capital", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T11:40:00.000+02:00", "replies_count": 0, "uuid": "813f21b2794a09e0bd7500e90d368f81ec44c674"}, "author": "", "url": "https://uk.reuters.com/article/uk-libya-security/armed-group-clashes-shut-airport-in-libyan-capital-idUKKBN1F410J", "ord_in_thread": 0, "title": "Armed group clashes shut airport in Libyan capital", "locations": [], "entities": {"persons": [{"name": "ahmed elumami", "sentiment": "none"}, {"name": "aidan lewis", "sentiment": "none"}, {"name": "rada", "sentiment": "none"}, {"name": "william maclean", "sentiment": "none"}], "locations": [{"name": "tripoli", "sentiment": "none"}, {"name": "mitiga", "sentiment": "none"}, {"name": "tajoura", "sentiment": "none"}], "organizations": [{"name": "special deterrence force", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "rada", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 9:44 AM / Updated 3 hours ago Deadly armed group clashes shut airport in Libyan capital Reuters Staff 2 Min Read \nTRIPOLI (Reuters) - Heavy clashes broke out in the Libyan capital Tripoli on Monday, leaving at least nine people dead and forcing the airport to suspend all flights. \nHeavy gunfire and artillery could be heard from the city centre and Mitiga airport said all flights had been suspended until further notice. \nThe fighting pitted the Special Deterrence Force (Rada), one of the most powerful groups in the city, against a rival group based in Tripoli’s Tajoura neighbourhood. \nRada acts as an anti-crime and anti-terrorism unit and controls Mitiga airport and a large prison next to it. It is occasionally targeted by rivals whose members it has arrested. \nThe bodies of at least nine combatants had been brought to a nearby hospital, a health ministry official said. Local media reported that at least 28 people had been wounded. \nMitiga is a military air base near the centre of Tripoli that has been the city’s main airport for civilian flights since the international airport was partly destroyed by fighting in 2014. \nThe international airport remains out of service. \nRada said the airport had been attacked by an individual called “Bashir ‘the Cow’” and others it had been seeking following their escape from a detention facility controlled by Rada elsewhere in Tripoli. \nRada posted pictures of streets around the airport, showing pick-up trucks mounted with guns and a tank. \nTripoli has been controlled by a patchwork of armed groups since a 2011 uprising that toppled long-time leader Muammar Gaddafi and led to the splintering of the country. \nThe factions sometimes clash in turf battles or over killings or detentions of their members, but there has been less open fighting in recent months after several groups aligned with the internationally recognised government, including Rada, consolidated their control of large parts of the capital. Reporting by Ahmed Elumami; Writing by Aidan Lewis; Editing by Catherine Evans", "external_links": [], "published": "2018-01-15T11:40:00.000+02:00", "crawled": "2018-01-15T12:07:37.086+02:00", "highlightTitle": ""}