{"organizations": [], "uuid": "dea17e68381e3bae16f284f2338ed8d17ef05423", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-hill-rom-announces-ceo-retirement-and-transition-plan.html", "country": "US", "domain_rank": 767, "title": "Hill-Rom Announces CEO Retirement And Transition Plan", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T14:51:00.000+02:00", "replies_count": 0, "uuid": "dea17e68381e3bae16f284f2338ed8d17ef05423"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-hill-rom-announces-ceo-retirement-and-transition-plan.html", "ord_in_thread": 0, "title": "Hill-Rom Announces CEO Retirement And Transition Plan", "locations": [], "entities": {"persons": [{"name": "joh", "sentiment": "negative"}, {"name": "hill-rom", "sentiment": "none"}, {"name": "j. greisch", "sentiment": "none"}, {"name": "greisch", "sentiment": "none"}], "locations": [{"name": "hill-rom", "sentiment": "none"}], "organizations": [{"name": "hrc", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "hill-rom holdings, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 26, 2018 /PRNewswire/ -- Hill-Rom Holdings, Inc. (NYSE: HRC), today announced that John J. Greisch, 62, president and chief executive officer, has informed the board of directors of his intention to retire from Hill-Rom during the company's fiscal third quarter. At the effective time of the retirement, Mr. Greisch will also step down from the board of directors of the company. Hill-Rom's board of directors has initiated a search process to identify a successor for Mr. Greisch, which is expected to be completed during Hill-Rom's fiscal third quarter. The process will include a review of both internal and external candidates.\n\"It has been an honor to lead this great company over the last eight years, and I am extremely proud of the value we have created together for patients, customers and shareholders,\" said Mr. Greisch. \"I want to thank each of our 10,000 employees around the world for their support and ongoing commitment to helping people get better care inside and outside the hospital. This is the right time for me personally, and for the company, to transition to the next generation of leadership. Hill-Rom is well positioned for future success with a strong team, solid foundation, and exciting growth prospects, and I look forward to working alongside our tremendous leadership team until we've successfully transitioned to my successor.\"\n\"On behalf of the Board, I would like to thank John for his invaluable leadership and significant contributions to Hill-Rom,\" said Rolf Classon, chairman of the board. \"Under his leadership, Hill-Rom has transformed its business portfolio, expanded globally and enhanced its position as a global medical device leader. John has directed Hill-Rom to record profitability, created significant shareholder value and positioned the company for a great future. Our company and leadership team have never been stronger, and we look forward to a seamless transition.\"\nAbout Hill-Rom Holdings, Inc.\nHill-Rom is a leading global medical technology company whose products, services and more than 10,000 employees worldwide help people get better care inside and outside the hospital. Our innovations in five core areas – Advancing Mobility, Wound Care and Prevention, Patient Monitoring and Diagnostics, Surgical Safety and Efficiency, and Respiratory Health – improve clinical and economic outcomes and ensure caregivers in more than 100 countries have the products they need to protect patients, speed up recoveries and manage conditions. Every day, around the world, we enhance outcomes for patients and their caregivers. Learn more at hill-rom.com .\nDisclosure Regarding Forward-Looking Statements\nCertain statements herein contain forward-looking statements, within the meaning of the Private Securities Litigation Reform Act of 1995, regarding the company's future plans, proposed divestitures, product launches, objectives, beliefs, expectations, representations and projections. It is important to note that forward-looking statements are not guarantees of future performance, and the company's actual results could differ materially from those set forth in any forward-looking statements. For a more in-depth discussion of factors that could cause actual results to differ from those contained in forward-looking statements, see the discussions under the heading \"Risk Factors\" in the company's previously filed most recent Annual Report on Form 10-K and subsequent Quarterly Reports on Form 10-Q. The company assumes no obligation to update or revise any forward-looking statements, unless required by law.\nCONTACT INFORMATION\nInvestor Relations\nContact:\nMary Kay Ladone, Vice President, Investor Relations\nPhone:\n312-819-9387\nEmail:\nMaryKay.Ladone@hill-rom.com\nMedia\nContact:\nHoward Karesh, Vice President, Corporate Communications\nPhone:\n312-819-7268\nEmail:\nHoward.Karesh@hill-rom.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/hill-rom-announces-ceo-retirement-and-transition-plan-300588649.html\nSOURCE Hill-Rom Holdings, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/hill-rom-announces-ceo-retirement-and-transition-plan-300588649.html", "http://www.hill-rom.com/"], "published": "2018-01-26T14:51:00.000+02:00", "crawled": "2018-01-26T16:44:05.002+02:00", "highlightTitle": ""}