{"organizations": [], "uuid": "427bc2d0abe6131cdb61d751124a6cc32e99b118", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224269495&w=1200&r=LYNXMPEE0L21L", "site_section": "http://feeds.reuters.com/reuters/topNews", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-netflix-results/netflix-subscriber-growth-beats-on-strong-original-programming-idUSKBN1FB2WM", "country": "US", "domain_rank": 408, "title": "Netflix subscriber growth beats on strong original programming", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T23:20:00.000+02:00", "replies_count": 0, "uuid": "427bc2d0abe6131cdb61d751124a6cc32e99b118"}, "author": "", "url": "https://www.reuters.com/article/us-netflix-results/netflix-subscriber-growth-beats-on-strong-original-programming-idUSKBN1FB2WM", "ord_in_thread": 0, "title": "Netflix subscriber growth beats on strong original programming", "locations": [], "entities": {"persons": [{"name": "bernard orr", "sentiment": "none"}, {"name": "aishwarya venugopal", "sentiment": "none"}], "locations": [{"name": "bengaluru", "sentiment": "none"}, {"name": "los gatos", "sentiment": "none"}], "organizations": [{"name": "netflix", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "factset", "sentiment": "none"}, {"name": "netflix inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 19 PM / in 4 minutes Netflix crosses $100 billion market cap on subscriber surge Lisa Richwine , Aishwarya Venugopal 4 Min Read \n(Reuters) - Netflix Inc ( NFLX.O ) snagged 8.33 million new streaming customers in the final quarter of last year - 2 million more than Wall Street expected - as the pioneering online video service kept pouring money into programming in a race to dominate internet television around the world. \nThe results cheered investors who drove Netflix shares up 7.8 percent to a record high of $245.16 in after-hours trading on Monday, hitting a market capitalization of more than $100 billion for the first time. Tech companies have been driving much of the U.S. stock market’s record-breaking rally since January, with Netflix shares up 15 percent in 2018 before Monday after rallying 53 percent last year. \nAfter signing up more than half of all U.S. broadband households, Netflix is building its customer base in 190 countries, and investors are expecting that billions in investments can begin delivering steady profits. The company’s quarterly earnings report showed interest is growing. \nNetflix picked up 6.36 million subscribers in international markets from October through December, when it released new seasons of critically acclaimed shows “Stranger Things” and “The Crown” as well as action movie “Bright.” That topped Wall Street expectations of 5.1 million, according to FactSet. \nAlong with 1.98 million customer additions in the United States, the company ended the year with 117.58 million streaming subscribers around the globe. \nNetflix turned a DVD-by-mail business into an online competitor of movie channel HBO. As it grew it began licensing its own original shows to ensure a stream of new offerings if studio suppliers ended deals. \nIn fact, Walt Disney Co ( DIS.N ) is making a major push into online streaming and will pull its first-run shows and movies from Netflix in 2019 as Hollywood fights for audiences. \nNetflix plans to spend up to $8 billion this year on TV shows and movies to fend off Disney, Amazon.com Inc ( AMZN.O ), studios-owned Hulu and local competitors that are jumping into online video. \nIn 2017, Netflix recorded its first full-year profit in international markets. The company has said it is aiming for steady improvements in profitability overseas this year. \nLast October, Netflix raised prices for two of its three main subscription plans to help fund the substantial content investment, helping to drive revenue higher. \nFor the December quarter, Netflix reported diluted earnings-per-share of 41 cents, even with the expectations of analysts polled by Thomson Reuters I/B/E/S. \nRevenue for the three months totaled $3.286 billion, in line with forecasts. \nLooking ahead, Netflix forecast streaming customer additions of 6.35 million for the first quarter, above analysts’ expectation of 5.01 million, according to FactSet. \nInvestors appear confident in Netflix’s ability to grow. Netflix recently traded at 91 times expected earnings for the next 12 months, versus Amazon at 152 times earnings and Disney at 17 times earnings, according to Thomson Reuters data. Reporting by Lisa Richwine in Los Angeles and Aishwarya Venugopal in Bengaluru; Editing by Peter Henderson and Lisa Shumaker", "external_links": [], "published": "2018-01-22T23:20:00.000+02:00", "crawled": "2018-01-22T23:34:45.003+02:00", "highlightTitle": ""}