{"organizations": [], "uuid": "130722b787fc3c01e2a0a7c7cf107b1c27e1db0a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222487497&w=1200&r=LYNXMPEE0F1AE", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-france-bicycles-hydrogen/french-startup-launches-hydrogen-powered-bicyles-idUKKBN1F52AP", "country": "US", "domain_rank": 408, "title": "French startup launches hydrogen-powered bicycles", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T19:58:00.000+02:00", "replies_count": 0, "uuid": "130722b787fc3c01e2a0a7c7cf107b1c27e1db0a"}, "author": "", "url": "https://uk.reuters.com/article/us-france-bicycles-hydrogen/french-startup-launches-hydrogen-powered-bicyles-idUKKBN1F52AP", "ord_in_thread": 0, "title": "French startup launches hydrogen-powered bicycles", "locations": [], "entities": {"persons": [{"name": "pierre forte", "sentiment": "none"}, {"name": "saint lo", "sentiment": "none"}, {"name": "alph", "sentiment": "none"}], "locations": [{"name": "cherbourg", "sentiment": "none"}, {"name": "chambery", "sentiment": "none"}, {"name": "biarritz", "sentiment": "none"}, {"name": "pragma", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "bayonne", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "pragma industries", "sentiment": "none"}, {"name": "duvignau  pragma industries", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 5:52 PM / Updated 25 minutes ago French startup launches hydrogen-powered bicyles Reuters Staff 2 Min Read \nPARIS (Reuters) - A French start-up has become the first company to start factory production of hydrogen-powered bicycles for use in corporate or municipal fleets. Alpha bikes, first industrialised bicycle to use a hydrogen fuel cell, are displayed at the Pragma Industries factory in Biarritz, France, January 15, 2018. REUTERS/Regis Duvignau \nPragma Industries, which is based in Biarritz, France and makes fuel cells for military use, has sold some 60 hydrogen-powered bikes to French municipalities including Saint Lo, Cherbourg, Chambery and Bayonne. \nAt about 7,500 euros per bike, and at least 30,000 euros for a charging station, the bikes are too expensive for the consumer market, but Pragma is working to cut that to 5,000 euros, which would bring their price in line with premium electric bikes. \n“Many others have made hydrogen bike prototypes, but we are the first to move to series production,” said founder and chief executive Pierre Forte. \nThe firm’s Alpha bike runs for about 100 km (62 miles) on a two-litre tank of hydrogen, a range similar to an electric bike, but a refill takes only minutes while e-bikes take hours to charge. One kilo of hydrogen holds about 600 times more energy than a one-kilo lithium battery. Pierre Forte (R), founder and CEO of Pragma Industries, and Alexandre Blanc (L), operations director, check an Alpha bike, first industrialised bicycle to use a hydrogen fuel cell at the Pragma Industries factory in Biarritz, France, January 15, 2018. REUTERS/Regis Duvignau \nPragma also sells refueling stations that produce hydrogen through the electrolysis of water as well cheaper tank-based stations. \nThe bikes, which look and ride the same as any normal bicycle, are aimed at bike-rental operators, delivery companies, and municipal or corporate bicycle fleets with intensive usage. Slideshow (9 Images) \nPragma, which produced 100 hydrogen bikes last year, plans to manufacture 150 this year. It has received demand from Norway, the United States, Spain, Italy and Germany, Forte said. \nWith bike’s range limited by the size of the hydrogen tank, Pragma is also working on a bike that will convert plain water into hydrogen aboard the bike, using a chemical reaction between water and aluminum or magnesium powder to produce hydrogen gas. \n“In the next two-three years we want to enter the consumer market and massively increase the scale of our operations,” said Forte. Reporting by Geert De Clercq; editing by Luke Baker, William Maclean", "external_links": [], "published": "2018-01-16T19:58:00.000+02:00", "crawled": "2018-01-16T20:28:59.013+02:00", "highlightTitle": ""}