{"organizations": [], "uuid": "fadfaa198486b18c253d05625a55e4b163506346", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221482131&w=1200&r=LYNXMPEE0B16K", "site_section": "https://www.reuters.com/breakingviews", "section_title": "Breakingviews | Reuters", "url": "https://www.reuters.com/article/us-review-post-breakingviews/breakingviews-review-the-post-gets-more-relevant-by-the-hour-idUSKBN1F11YE", "country": "US", "domain_rank": 408, "title": "Review: “The Post” gets more relevant by the hour", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T23:43:00.000+02:00", "replies_count": 0, "uuid": "fadfaa198486b18c253d05625a55e4b163506346"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-review-post-breakingviews/breakingviews-review-the-post-gets-more-relevant-by-the-hour-idUSKBN1F11YE", "ord_in_thread": 0, "title": "Review: “The Post” gets more relevant by the hour", "locations": [], "entities": {"persons": [{"name": "spielberg", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "francis ford coppola", "sentiment": "none"}, {"name": "steven spielberg", "sentiment": "none"}, {"name": "daniel ellsberg", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "vietnam", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "america", "sentiment": "none"}], "organizations": [{"name": "washington post", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "department of defense", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK It is probably borderline blasphemous, if not contractually forbidden, for any member of the American press to criticize “The Post,” Steven Spielberg’s cinematic retelling of how the Washington Post managed to catch up to the New York Times, defy the government and publish the Pentagon Papers. The message of the film, which the director scrambled to put together following Donald Trump’s rise to the U.S. presidency, couldn’t be clearer: A functioning democracy requires a free and profitable press.\nYet the rush to bring “The Post” to theaters during the first year of the Trump administration shows through the newsprint. The movie’s preamble feels hasty. One minute, Daniel Ellsberg borrows a helmet in a hot landing zone while Creedence Clearwater Revival’s “Susie Q” plays (presumably a wink to Francis Ford Coppola’s “Apocalyse Now”). The next he pilfers the confidential history of America’s involvement in Vietnam, commissioned by the Department of Defense, and leaks it to the press. Spielberg’s nostalgia for hot-metal typesetting feels overdone. Occasionally his musical score seems more appropriate for a melodrama by Douglas Sirk than something from the creator of “Jaws.”\nHere, however, ends the kvetching. What distinguishes Spielberg’s movie from others of the journalism-thriller genre, including “All the President’s Men” and “Spotlight,” is that at its heart this is a yarn about business. The fundamental tension that pervades the newspaper’s decision to publish confidential information despite the legal threat from the government is whether it will hurt the financial solvency of the Post and the wealth of its controlling shareholder, the Graham family.\nMost who will go to see “The Post” probably take it as an article of faith that the Fourth Estate is critical to a functioning republic. They probably also empathize with the film’s other main message about the difficulty women faced not very long ago in a workplace dominated by men. The painfully talented Meryl Streep conveys the perspicacity with which Katharine Graham led the family media empire she inherited after her husband committed suicide.\nBeyond the themes of democracy and feminism, “The Post” tells how a chief executive struggled to make the right decisions to create wealth for her shareholders and safeguard the welfare of staff without sacrificing the newspaper’s fundamental mission. This corporate and financial story also has currency today – particularly, though not exclusively, for media organizations.\nThe path toward obtaining the “Report of the Office of the Secretary of Defense Vietnam Task Force,” as the Pentagon Papers were officially known, organizing them and making sense of them provides the action for “The Post.” Yet the moral heart of the story is also a commercial one. Graham must decide whether to give the newspaper’s editor Ben Bradlee, played by Tom Hanks, the go-ahead to publish stories based on documents that a federal court has already enjoined the Times from publishing.\nAdding to the corporate story, the paper’s parent is in the middle of an initial public stock offering. Based on contractual language in the prospectus, the underwriters could have been forced to hand back the proceeds to investors in the event of a shift in financial fortunes a week after the deal, which is when the paper obtained the Pentagon Papers. It could be that “The Post” is the only film in history to make dramatic use of what lawyers call a MAC or material adverse change clause.\nThere’s much for finance nerds to like about Spielberg’s capture of the dynamics of dealmaking. Graham, for instance, is seen rehearsing her script for the IPO’s roadshow earlier in the film, delivering a soliloquy on the need for the Post to invest in high-quality journalism at the expense of margins – unlike grubbier peer Gannett. When she later fails to deliver this forceful defense of her paper’s business model in a boardroom full of prospective shareholders in suits, Streep captures Graham’s difficulty in meeting the requisite level of CEO confidence.\nThe underwriting process also raises questions about how a shareholder like the Graham family maintains control while raising funds from public shareholders. Katharine’s son Donald, it’s worth recalling, advised Mark Zuckerberg on the matter as Facebook went public. And in an exchange that will warm the hearts of journalists, when arguing with bankers over the price for the stock offering, Graham and Post Chairman Fritz Beebe (played by Tracy Letts) count the difference in the company’s valuation not in dollars and cents but in the number of reporters it represents.\nThere’s even an obscure nod to Wall Street lore embedded in the film. Though Lazard was the lead underwriter of the Post’s stock sale, the firm was not typically involved in such transactions. It took on the deal as a favor to Graham, whose father Eugene Meyer was a former Lazard partner and acquired the Post out of bankruptcy in 1933 after serving as chairman of the Federal Reserve.\nSpielberg’s primary intention with “The Post” goes beyond commerce, of course. The challenge to Trump’s present-day contempt for a free and factual press is as hard to miss as the scent of popcorn in the theater. A demand from a lawyer for the president that publisher Henry Holt cease and desist from disseminating Michael Wolff’s “Fire and Fury,” a new exposé on the Trump White House, brings the story of “The Post” bang up to date.\n ", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-12T23:43:00.000+02:00", "crawled": "2018-01-12T18:22:29.001+02:00", "highlightTitle": ""}