{"organizations": [], "uuid": "f09546ca38b9ea99ebde2c1704168c828798e5f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226448115&w=1200&r=LYNXMPEE0T01W", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/austria-hungary/hungarys-orban-visits-austrias-right-wing-government-seeking-allies-idINKBN1FJ03H", "country": "US", "domain_rank": 408, "title": "Hungary's Orban visits Austria's right-wing government, seeking allies", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T02:51:00.000+02:00", "replies_count": 0, "uuid": "f09546ca38b9ea99ebde2c1704168c828798e5f7"}, "author": "", "url": "https://in.reuters.com/article/austria-hungary/hungarys-orban-visits-austrias-right-wing-government-seeking-allies-idINKBN1FJ03H", "ord_in_thread": 0, "title": "Hungary's Orban visits Austria's right-wing government, seeking allies", "locations": [], "entities": {"persons": [{"name": "orban", "sentiment": "negative"}, {"name": "kurz", "sentiment": "none"}, {"name": "sebastian kurz", "sentiment": "none"}, {"name": "viktor orban", "sentiment": "none"}], "locations": [{"name": "austria", "sentiment": "none"}, {"name": "hungary", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "vienna", "sentiment": "none"}, {"name": "serbia", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "freedom party", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VIENNA (Reuters) - The Hungarian and Austrian prime ministers - both hardliners on immigration - came away from a meeting on Tuesday with a pledge for close cooperation in Europe if not a formal alliance\nAustrian Chancellor Sebastian Kurz led his conservative party to victory in Austria’s October parliamentary election, then struck a coalition deal with the anti-immigration Freedom Party, making Austria the only western European country with a far-right party in government.\nBoth of Austria’s ruling parties have adopted language similar to Hungarian Prime Minister Viktor Orban’s on immigration and Islam, pledging to cut benefits for refugees and warning darkly that Muslim “parallel societies” are emerging in cities like left-leaning Vienna.\nGiven their similar views, Kurz has said his country could serve as a go-between in the European Union for the West and the Visegrad group of eastern states, which includes Hungary and Poland, two countries that frequently defy Brussels on issues including immigration and fundamental rights.\n“Particularly since the migration crisis, tensions within the European Union have grown more and more,” Kurz told a joint news conference with Orban. “Our big goal is to be a bridge-builder here between the Visegrad states and other, western European states.”\nKurz made immigration the core of his campaign after Austria took in one of the biggest contingents of asylum seekers in Europe’s migration crisis in 2015, relative to its population. Many of those people came via Hungary, until Orban fenced off much of its border with Serbia.\nThe Freedom Party’s leader, Heinz-Christian Strache, who is now vice chancellor and who met Orban later on Tuesday, has said Austria should move away from its usual western European allies, including Germany, by joining Visegrad - but Kurz and Orban said that was not on the agenda.\n“Neither the Visegrad states have the desire to expand the group of Visegrad states nor is there the desire here to join,” Kurz said. “What is needed is good cooperation between neighbouring states, between Austria and Hungary.”\nFOOT IN BOTH CAMPS Kurz has sought to reassure allies that his government will be pro-European, even though he and Strache favour a smaller EU that focuses on fewer tasks, especially securing its external borders.\nHe has sided with Visegrad in saying the EU should stop pushing countries to take quotas of relocated asylum seekers. But he supported the bloc’s steps against Poland for threatening the rule of law and democratic principles. And he has taken steps that could complicate a rapprochement with Orban.\nKurz’s government is continuing Austria’s decades-old policy of opposing nuclear energy, and said this month it would sue the European Commission for allowing Hungary to expand its Paks power plant.\nIt has also decided to curb child benefits for workers whose children live in poorer countries, including Hungary. Visegrad member Slovakia has already objected, and Hungary has said people who pay the same taxes in Austria should be entitled to the same benefits.\nThe two sides repeated their disagreements on those points, but Orban said Budapest would treat them as European rather than bilateral issues and not let them harm the two countries’ ties.\n“Austria understands us, and also understands western European countries. The role it set for itself is very favourable for Hungary,” Orban said. “I am grateful to the Chancellor for defining a bridge role (for Austria).”\nAdditional reporting by Krisztina Than in Budapest and Heinz-Peter Bader in Vienna, editing by Larry King\n ", "external_links": [], "published": "2018-01-30T02:51:00.000+02:00", "crawled": "2018-01-30T03:21:09.020+02:00", "highlightTitle": ""}