{"organizations": [], "uuid": "c3d38f148618456fcfaf7216382d079f9349abbb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/04/13/104403348-GettyImages-633684722.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/05/cramers-game-plan-feeding-the-beast-with-a-bank-earnings-kicker.html", "country": "US", "domain_rank": 767, "title": "Cramer's game plan: Feeding the beast with a bank earnings kicker", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.704, "site_type": "news", "published": "2018-01-06T01:11:00.000+02:00", "replies_count": 0, "uuid": "c3d38f148618456fcfaf7216382d079f9349abbb"}, "author": "Elizabeth Gurdus", "url": "https://www.cnbc.com/2018/01/05/cramers-game-plan-feeding-the-beast-with-a-bank-earnings-kicker.html", "ord_in_thread": 0, "title": "Cramer's game plan: Feeding the beast with a bank earnings kicker", "locations": [], "entities": {"persons": [{"name": "jim cramer cramer", "sentiment": "negative"}, {"name": "cramer", "sentiment": "negative"}, {"name": "jim cramer", "sentiment": "none"}], "locations": [], "organizations": [{"name": "healthcare conference", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "fed", "sentiment": "none"}, {"name": "j.p. morgan", "sentiment": "none"}, {"name": "u.s. labor department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The stock market's bullish reaction to Friday's placid jobs report from the U.S. Labor Department gave CNBC's Jim Cramer pause as he looked ahead to next week.\n\"Once again, this market is downright shocking,\" the \" Mad Money \" host said. \"The bank stocks had been rallying for days because the economy's red-hot, hot enough that the Fed might have to raise rates repeatedly.\"\nCramer has long dubbed the financials as the market's most important leadership sector. But after the labor report showed a distinct decline in retail jobs — which Cramer attributed to the rise of e-commerce — industrial and transport stocks caught fire.\nCramer said that the industrials likely rose because buyers hoped the Fed would be cautious with its rate hike agenda, and the transports popped because of the online shopping boom.\n\"Throw in the big pushes from the analyst community on Amazon and Apple , two of the market's generals, and you get an electric tape full of new winners all plumped up to feed the beast ,\" Cramer said.\nWith that in mind, the \"Mad Money\" host turned to the stocks and events he'll be watching in the second week of the new year:\nMonday: CES, J.P. Morgan Healthcare Conference CES: Formerly known as the Consumer Electronics Show, CES 2018 will dominate Monday's headlines. The stock-moving technology event will feature high-profile speakers like Nvidia CEO Jensen Huang, who will address the conference on Sunday night.\n\"If you only read one thing about tech this year, you need to get a transcript of this speech,\" Cramer said. \"He'll trace a vision of the cloud, of machine learning, of gaming, of cryptocurrencies and data centers [and] just about everything else that matters.\"\nIntel CEO Brian Krzanich will deliver a speech the following day that Cramer hopes will end the firestorm around the security flaws in Intel's chips .\n\"I'm betting many of the doomsday scenarios about Intel that have been floating around will be debunked and over by Tuesday,\" Cramer said.\nJ.P. Morgan Healthcare Conference: Cramer will be paying close attention to Allergan CEO Brent Saunders' speech at the big bank's annual health care convention .\n\"If Brent ... tells a good story, I think it could mark the beginning of a new run for Allergan, which makes Botox along with a bunch of other aesthetic, eye care and central nervous system drugs,\" Cramer said. \"We own this one for my charitable trust ... and while we have gotten singed, I still think there's a ton of hidden value here that maybe he will unlock when he speaks on Monday.\"\nTuesday: Jamie Dimon, Schnitzer Steel Industries Jamie Dimon : The J.P. Morgan CEO will speak at his company's conference on Tuesday. While J.P. Morgan's in quiet period ahead of earnings, Cramer said his speech could still move stocks.\nSchnitzer Steel : Cramer doesn't typically pay attention to small steel plays like Schnitzer, but the company's Tuesday earnings report could shine a light on one of his biggest worries about the steel industry: the brewing tensions between Chinese and U.S. steel producers .\nWednesday: KB Home, Lennar Homebuilders KB Home and Lennar both report earnings on Wednesday, and while Cramer doesn't expect the Fed's rate hikes to affect them yet, he wasn't so bullish about the long term.\n\"I know that eventually we're going to get a rate hike — not the next one, but maybe one later this year — that will finally knock the homebuilders off their pedestals,\" he said.\nEven so, Cramer expected a \"picture of robust demand, limited supply, higher orders, and rising gross margins\" from both companies on Wednesday.\nThursday: Europe On Thursday, Cramer will look across the pond for European industrial production data. He remained bullish on the continent and suggested investors get wide exposure to its comeback.\n\"If you want to play the turn, I recommend the EZU, which is the iShares MSCI Eurozone ETF that, as I tell ActionAlertsPlus.com club members, gives you broad exposure to the continent,\" Cramer said.\nFriday: BlackRock, J.P. Morgan, PNC, Wells Fargo Earnings season kicks off with a bang on Friday with major financial companies BlackRock , J.P. Morgan, PNC and Wells Fargo all reporting their latest quarterly results.\nCramer hoped to get insight on BlackRock's index fund investments, which could be driving the raging bull market, as well as J.P. Morgan's dividend and share buyback plans.\nThe \"Mad Money\" host predicted that the biggest upside surprise would come from PNC — a buyable stock even at $144, he said — and that Wells Fargo would again attempt to brush its cross-selling woes under the rug.\n\"Given that the Fed will be tightening multiple times this year and the tax rates for all these financials are coming down, I think all of these stocks are buys, particularly if they go down anytime next week,\" he said.\nFinal thoughts \"Here's the bottom line: when the market's in beast mode , you need to feed it,\" Cramer concluded. \"You give it a balanced diet of techs from CES, health cares from J.P. Morgan, and bank earnings, and, amazingly, it'll just keep surprising you.\"\nWATCH: Cramer's game plan for tech, health care and banks show chapters Cramer's game plan: Feeding the beast with a bank earnings kicker 21 Hours Ago | 11:20 Disclosure: Cramer's charitable trust owns shares of Apple, Nvidia, J.P. Morgan, Allergan and the iShares MSCI Eurozone ETF.\nQuestions for Cramer?\nCall Cramer: 1-800-743-CNBC\nWant to take a deep dive into Cramer's world? Hit him up!\nMad Money Twitter - Jim Cramer Twitter - Facebook - Instagram - Vine\nQuestions, comments, suggestions for the \"Mad Money\" website? madcap@cnbc.com", "external_links": [], "published": "2018-01-06T01:11:00.000+02:00", "crawled": "2018-01-06T01:26:21.002+02:00", "highlightTitle": ""}