{"organizations": [], "uuid": "5cd2f6072d8a6c4167d11c5f0c8d2f5b70a14648", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.feedburner.com/reuters/UKTennisNews", "section_title": "Reuters: Tennis News", "url": "https://uk.reuters.com/article/tennis-ausopen-wozniacki/tennis-hugs-all-round-as-wozniacki-completes-return-from-wilderness-idUKL4N1PM061", "country": "US", "domain_rank": 408, "title": "Tennis-Hugs all round as Wozniacki completes return from wilderness", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T15:54:00.000+02:00", "replies_count": 0, "uuid": "5cd2f6072d8a6c4167d11c5f0c8d2f5b70a14648"}, "author": "", "url": "https://uk.reuters.com/article/tennis-ausopen-wozniacki/tennis-hugs-all-round-as-wozniacki-completes-return-from-wilderness-idUKL4N1PM061", "ord_in_thread": 0, "title": "Tennis-Hugs all round as Wozniacki completes return from wilderness", "locations": [], "entities": {"persons": [{"name": "wozniacki", "sentiment": "negative"}, {"name": "martyn herman", "sentiment": "none"}, {"name": "rod laver arena", "sentiment": "none"}, {"name": "daphne", "sentiment": "none"}, {"name": "caroline wozniacki", "sentiment": "none"}, {"name": "halep", "sentiment": "none"}, {"name": "simona halep", "sentiment": "none"}, {"name": "caroline", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "wta", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 27, 2018 / 1:55 PM / Updated an hour ago Tennis-Hugs all round as Wozniacki completes return from wilderness Martyn Herman 4 Min Read \nMELBOURNE, Jan 27 (Reuters) - No wonder Caroline Wozniacki could not stop hugging the trophy she referred to affectionately as ‘Daphne’ on Saturday after outlasting Simona Halep to win the Australian Open title. \nIt was an embrace with grand slam silverware, in this case the Daphne Akhurst Memorial Cup, that had been a long time coming and the 27-year-old was going to enjoy it. \nAs “Sweet Caroline” blared out of the sound system on a sweltering Rod Laver Arena, Wozniacki paraded around the blue hardcourt with a smile that spoke a 1,000 words. \nNot only was she celebrating a first grand slam title at the 43rd time of asking (only three players have taken longer), she also toppled Halep from the top of the WTA rankings, six years after relinquishing her 67-week hold on the top spot. \nHer previous stint in that eminent position had always felt hollow because she never rubber-stamped it with a major. \nThis time, however, there can be no doubting that she deserves the title of the world’s best female tennis player. \n“I‘m never going to have to answer that question again,” she told reporters later, with a glass of Champagne and Daphne by her side. “Now they’ll ask me when I’ll get the second one.” \nClose friend, 23-times grand slam champion Serena Williams, who is preparing to return after having a baby, was one of the first to congratulate Wozniacki on her overdue title. \n“I got too nervous to watch but woke up to @CaroWozniacki new number one and Aussie open champ. So awesome. So happy. Are those tears? Yup they are. From a year ago to today I‘m so proud my friend so proud,” the American said on Twitter. \nThe previous six years have witnessed much heartache for the blonde Dane who has been coached by her father Piotr, a former professional footballer, since the age of seven. \nNot just on the court either. \nThere was a U.S. Open final loss to Serena Williams in 2014, five years after a teenaged Wozniacki fell to Kim Clijsters there in her first grand slam final. \nTitles on the WTA Tour slowed to a trickle and a spate of early losses in the grand slams saw her ranking slide down to a lowly 74th in the summer of 2016. \n“At that point you’re thinking is it really worth it to keep going,” Wozniacki told Channel Seven after her battling 7-6(2) 3-6 6-4 victory in Saturday’s Melbourne sweat-fest. \nThere was also the emotional body blow of a high-profile split with former world number one golfer Rory McIlroy who she was due to marry in 2014. \nWozniacki did return to the top 20 by the end of 2016, thanks to a run to the U.S. Open semi-finals. \nBut her steady, safety-first brand of tennis had begun to look obsolete, especially in a world of fearless big hitters like Jelena Ostapenko who bundled her out of last year’s French Open at the quarter-final stage. \nLess than a year later Wozniacki’s dogged professionalism has paid dividends and with new fiance, former NBA star David Lee, leading the applause on Rod Laver Arena on a memorable night for Danish tennis, life could not be better. \nShe might even get to realise another one of her dreams. \n“Maybe I’ll get that Elle (magazine) cover,” part-time model Wozniacki said on court as her agent watched on. (Reporting by Martyn Herman, editing by Pritha Sarkar)", "external_links": [], "published": "2018-01-27T15:54:00.000+02:00", "crawled": "2018-01-27T16:33:24.005+02:00", "highlightTitle": ""}