{"organizations": [], "uuid": "d48d5f45fc1e0924c3f08d84e8d15a85265cdc48", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-two-river-bancorp-reports-2017-fourth-quarter-and-annual-financial-results.html", "country": "US", "domain_rank": 767, "title": "Two River Bancorp Reports 2017 Fourth Quarter and Annual Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T16:00:00.000+02:00", "replies_count": 0, "uuid": "d48d5f45fc1e0924c3f08d84e8d15a85265cdc48"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-two-river-bancorp-reports-2017-fourth-quarter-and-annual-financial-results.html", "ord_in_thread": 0, "title": "Two River Bancorp Reports 2017 Fourth Quarter and Annual Financial Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "fourth quarter", "sentiment": "none"}], "organizations": [{"name": "river bancorp", "sentiment": "negative"}, {"name": "two river community bank", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "the bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TINTON FALLS, N.J., Jan. 30, 2018 (GLOBE NEWSWIRE) -- Two River Bancorp (Nasdaq:TRCB) (the \"Company\"), the parent company of Two River Community Bank (\"the Bank\") , today reported financial results for the fourth quarter and twelve months ended December 31, 2017, highlighted by solid loan growth during the quarter. All share and per share data for all referenced reporting periods have been adjusted for a 5% stock dividend paid on February 28, 2017.\nTax Cuts and Jobs Act\nOn December 22, 2017, the Tax Cuts and Jobs Act (the “Act”) was signed into law. Among the other changes was a permanent reduction in the Federal corporate income tax rate from 34% to 21%, effective January 1, 2018. As a result of this change, the Company had to revalue its net deferred tax asset at December 31, 2017. The Company reduced its net deferred tax asset by $1.78 million, or $0.21 per diluted share, which was recorded as a one-time non-cash charge to income tax expense in the fourth quarter of 2017. The reduction of the Company’s 2018 Federal corporate tax rate to 21% will result in a significant tax benefit in 2018 and beyond and it is anticipated that the majority of this charge will be recouped in 2018. A portion of this tax benefit will be used to reinvest in the Company’s people, fund its growth, and further support the communities it serves. The charge impacted several metrics throughout the quarter and annual results.\nOperating and Financial Highlights\n(all comparisons to the respective prior year’s period unless otherwise noted)\nFourth Quarter 2017\nNet income was $335,000, or $0.04 per diluted share, compared to $2.57 million, or $0.30 per diluted share.\n-- The 2017 fourth quarter included the above-mentioned charge to income tax expense of $1.78 million, or $0.21 per diluted share. Excluding this one-time charge, 2017 fourth quarter net income was $2.11 million, or $0.24 per diluted share. Net interest income increased 12.3% to $8.53 million due to strong loan growth. Total loans increased $34.8 million in the fourth quarter to $850.9 million. As a result of this loan growth, the Company reported a $675,000 loan loss provision, compared to a loan loss recovery of $345,000 in the same prior year period. Total deposits grew by $39.7 million during the quarter to $861.6 million as core checking deposits increased by $28.0 million.\nAnnual 2017\nNet income was $6.50 million, or $0.75 per diluted share, compared to $8.63 million, or $1.01 per diluted share. Net income for 2017 was impacted by the above-mentioned charge to income tax expense of $1.78 million, or $0.21 per diluted share. In 2016, the Company received an $862,000, or $0.10 per diluted share, tax-free BOLI death benefit. Excluding the one-time charge to income tax expense and the BOLI event in the prior year, 2017 net income increased 6.6%. Net interest income increased 10.4% to $32.53 million, largely due to higher interest-earning assets driven by loan growth. Non-interest income decreased 0.5% to $5.46 million, due the impact of the previously announced BOLI death benefit received in 2016. Excluding the BOLI death benefit, non-interest income increased 18.0%. Non-performing assets to total assets decreased to 0.20% at December 31, 2017, from 0.23% at September 30, 2017, and increased from 0.19% at December 31, 2016. Tangible book value per share was $10.44 at December 31, 2017, compared to $10.46 at September 30, 2017 and $9.88 at December 31, 2016. Total assets at December 31, 2017 were a record $1.04 billion, an increase of $99.6 million, or 10.6%, from $940.2 million at December 31, 2016. Total loans as of December 31, 2017 were $850.9 million, an increase of $97.8 million, or 13.0%, from $753.1 million at December 31, 2016. Total deposits as of December 31, 2017 were $861.6 million, an increase of $85.0 million, or 10.9%, compared with $776.6 million as of December 31, 2016.\nManagement Commentary\nWilliam D. Moss, President and CEO, stated, “The Company achieved exceptional loan and deposit growth in the fourth quarter, which fueled a strong finish to the year and provides a very strong base for 2018. Commercial real estate loans remain the strongest catalyst for this growth, as we benefited from a robust loan pipeline across our geographic footprint. The fee income contributions from both our SBA and mortgage business lines were strong throughout 2017, reflected in a 21.1% and 36.2% increase, respectively. We are pleased to have exceeded the $1.0 billion mark in assets during the year, and expect earnings to benefit by loan growth in future quarters, along with the positive impact of the lower tax rate.”\nDividend Information\nOn January 17, 2018, the Company’s Board of Directors declared a quarterly cash dividend of $0.045 per share, payable on February 28, 2018 to shareholders of record as of the close of business on February 7, 2018. This marks the 20 th consecutive quarterly cash dividend, which is in addition to the 5% stock dividend paid in February 2017.\nKey Quarterly Performance Metrics\n4 th Qtr.\n3 rd Qtr.\n2 nd Qtr.\n1 st Qtr.\n4 th Qtr.\n12 Mo.\nEnded\n12 Mo.\nEnded\n2017\n2017\n2017\n2017\n2016\n12/31/2017\n12/31/2016\nNet Income (in thousands) $ 335 $ 2,237 $ 2,128 $ 1,802 $ 2,567 $ 6,502 $ 8,631 Earnings per Common Share – Diluted $ 0.04 $ 0.26 $ 0.25 $ 0.21 $ 0.30 $ 0.75 $ 1.01 Return on Average Assets 0.13 % 0.89 % 0.87 % 0.76 % 1.08 % 0.66 % 0.96 % Return on Average Tangible Assets (1) 0.13 % 0.91 % 0.88 % 0.77 % 1.10 % 0.67 % 0.98 % Return on Average Equity 1.24 % 8.39 % 8.26 % 7.18 % 10.25 % 6.22 % 8.94 % Return on Average Tangible Equity (1) 1.49 % 10.13 % 10.01 % 8.74 % 12.53 % 7.52 % 11.00 % Net Interest Margin 3.56 % 3.62 % 3.49 % 3.45 % 3.43 % 3.53 % 3.53 % Non-Performing Assets to Total Assets 0.20 % 0.23 % 0.32 % 0.18 % 0.19 % 0.20 % 0.19 % Allowance as a % of Loans 1.25 % 1.25 % 1.25 % 1.25 % 1.27 % 1.25 % 1.27 % (1) Non-GAAP Financial Information. See “Reconciliation of Non-GAAP Financial Measures” at end of release. Loan Composition\nThe components of the Company’s loan portfolio at December 31, 2017 and December 31, 2016 are as follows:\n(in thousands) December 31,\n2017\nDecember 31,\n2016 Commercial and industrial $ 101,371 $ 93,697 Real estate – construction 118,094 111,914 Real estate – commercial 537,733 460,685 Real estate – residential 64,238 59,065 Consumer 30,203 28,279 Unearned fees (765 ) (548 ) 850,874 753,092 Allowance for loan losses (10,668 ) (9,565 ) Net Loans $ 840,206 $ 743,527 Deposit Composition\nThe components of the Company’s deposits at December 31, 2017 and December 31, 2016 are as follows:\n(in thousands) December 31,\n2017 December 31,\n2016 Non-interest-bearing $ 167,297 $ 160,104 NOW accounts 232,673 152,771 Savings deposits 242,448 261,438 Money market deposits 59,818 62,495 Listed service CD’s 44,436 47,648 Time deposits / IRA 74,183 56,489 Wholesale deposits 40,702 35,622 Total Deposits $ 861,557 $ 776,567 2017 Fourth Quarter and Year End Financial Review\nNet Income\nNet income for the three months ended December 31, 2017 was $335,000, or $0.04 per diluted common share, compared to $2.57 million, or $0.30 per diluted common share, for the same period last year. The decrease in net income was largely the result of the previously mentioned $1.78 million, or $0.21 per diluted share, write-down of the Company’s deferred tax asset from 34% to 21%, which will be the Company’s new corporate tax rate beginning in 2018. Additionally, the provision for loan losses was $675,000 for the quarter due to strong loan growth, compared to a loan loss recovery of $345,000 in the same prior year period, which was the result of a recovery related to a credit previously charged off.\nOn a linked quarter basis, fourth quarter 2017 net income decreased to $335,000 from $2.24 million for the third quarter of 2017.\nNet income for the twelve months ended December 31, 2017 decreased to $6.50 million, or $0.75 per diluted share, compared to $8.63 million, or $1.01 per diluted share, in the same prior year period. Excluding the effect of the previously mentioned deferred tax asset writedown in 2017 and the BOLI death benefit in 2016, net income increased 6.6% for the twelve months ended December 31, 2017.\nNet Interest Income\nNet interest income for the quarter ended December 31, 2017 was $8.53 million, an increase of 12.3% compared to $7.59 million in the corresponding prior year period. This increase was largely due to an increase of $71.6 million, or 8.4%, in total interest earning assets, primarily attributable to growth in the loan portfolio. On a linked quarter basis, net interest income increased $113,000, or 1.3%, from $8.42 million.\nFor the year ended December 31, 2017, net interest income increased 10.4% to $32.5 million from $29.5 million in the prior year.\nNet Interest Margin\nThe Company reported a net interest margin of 3.56% for the fourth quarter of 2017, compared to 3.62% in the third quarter of 2017 and 3.43% reported for the fourth quarter of 2016. The margin improvement from the prior year was primarily the result of slightly higher yielding interest-earning assets coupled with a higher level of average core checking deposits.\nNet interest margin for the year ended December 31, 2017 was 3.53%, unchanged from the prior year.\nNon-Interest Income\nNon-interest income for the quarter ended December 31, 2017 totaled $1.34 million, a decrease of $104,000, or 7.19%, compared to the same period in 2016. The Company reported lower loan fees and, to a lesser extent, lower gains from the sale of SBA loans. Residential mortgage banking revenue was $325,000 during the quarter, as compared to $331,000 in the prior year period.\nOn a linked quarter basis, non-interest income decreased by $110,000 from the third quarter of 2017, mainly due to decreases in residential mortgage banking income and gains from the sale of SBA loans. Residential mortgage banking revenue decreased $33,000, or 9.2%, from $358,000 during the third quarter of 2017. Gains from the sale of SBA loans decreased $71,000, or 23.2%, from $306,000 during the third quarter of 2017 due to the timing of loan closings.\nFor the year ended December 31, 2017, non-interest income decreased slightly by $30,000, or 0.5%, to $5.46 million from the prior year due to the BOLI death benefit in 2016. Excluding this death benefit, non-interest income increased $832,000, or 18.0%. Mortgage banking revenue increased by 36.2% to $1.58 million, while gains from the sale of SBA loans increased 21.2% to $1.05 million.\nNon-Interest Expense\nNon-interest expense for the quarter ended December 31, 2017 totaled $5.92 million, an increase from the $5.36 million reported in same period in 2016, primarily due to a rise in salaries and employee benefits along with a one-time $144,000 expense recovery in the fourth quarter of 2016 related to a credit previously charged off. On a linked quarter basis, non-interest expense decreased $256,000, or 4.1%, from $6.18 million due to lower salaries and benefits.\nFor the year ended December 31, 2017, non-interest expense increased $2.47 million, or 11.5%, to $23.9 million compared to the prior year. The increase in non-interest expense was largely attributable to a rise in salaries and employee benefits coupled with $394,000 of one-time expense recoveries in 2016 relating to both the settlement of an OREO property and the collection from the above-mentioned credit previously charged off.\nProvision for Loan Losses\nDuring the quarter, the Company expensed a $675,000 loan loss provision, compared to a loan loss recovery of $345,000 in the same prior year period. The loan loss provision was largely due to the $34.8 million of loan growth in the fourth quarter 2017. The Company had net charge-offs of approximately $230,000 for the period.\nFor the year ended December 31, 2017, a loan loss provision of $1.53 million was expensed, compared to $515,000 for the prior year.\nAs of December 31, 2017, the Company's allowance for loan losses was $10.67 million, compared to $9.57 million as of December 31, 2016. The loss allowance as a percentage of total loans was 1.25% at December 31, 2017, compared to 1.27% at December 31, 2016.\nFinancial Condition / Balance Sheet\nAt December 31, 2017, the Company maintained capital ratios that were in excess of regulatory standards for well capitalized institutions. The Company's Tier 1 capital to average assets ratio was 8.85%, common equity Tier 1 to risk weighted assets ratio was 9.68%, Tier 1 capital to risk weighted assets ratio was 9.68%, and total capital to risk weighted assets ratio was 11.93%.\nTotal assets as of December 31, 2017 were $1.04 billion, an increase of 10.6% compared to $940.2 million as of December 31, 2016.\nTotal loans as of December 31, 2017 were $850.9 million, an increase of 13.0% compared to $753.1 million reported at December 31, 2016.\nTotal deposits as of December 31, 2017 were $861.6 million, an increase of 10.9% compared to $776.6 million as of December 31, 2016. Core checking deposits at December 31, 2017 increased to $400.0 million, up $87.1 million, or 27.8%, from December 31, 2016.\nAsset Quality\nThe Company's non-performing assets at December 31, 2017 were $2.07 million compared to $2.35 million at September 30, 2017 and $1.81 million at December 31, 2016. Non-performing assets to total assets at December 31, 2017 declined to 0.20%, compared to 0.23% at September 30, 2017, and remained relatively unchanged compared to 0.19% at December 31, 2016.\nNon-accrual loans decreased to $2.07 million at December 31, 2017, as compared to $2.35 million at September 30, 2017, and increased from $1.55 million at December 31, 2016. There was no OREO at both December 31, 2017 and September 30, 2017, compared to OREO of $259,000 at December 31, 2016.\nTroubled debt restructured loan balances amounted to $7.05 million at December 31, 2017, with all but $994,000 performing. This compared to $8.05 million at September 30, 2017 and $8.23 million at December 31, 2016.\nAbout the Company\nTwo River Bancorp is the holding company for Two River Community Bank, which is headquartered in Tinton Falls, New Jersey. Two River Community Bank operates 14 branches along with two loan production offices throughout Monmouth, Middlesex, Union, and Ocean Counties, New Jersey. More information about Two River Community Bank and Two River Bancorp is available at www.tworiverbank.com .\nThe foregoing contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements are not historical facts and include expressions about management's confidence and strategies and management's current views and expectations about new and existing programs and products, relationships, opportunities, technology and market conditions. These statements may be identified by such forward-looking terminology as \"continue,\" \"expect,\" \"look,\" \"believe,\" \"anticipate,\" \"may,\" \"will,\" \"should,\" \"projects,\" \"strategy\" or similar statements. Actual results may differ materially from such forward-looking statements, and no reliance should be placed on any forward-looking statement. Factors that may cause results to differ materially from such forward-looking statements include, but are not limited to, unanticipated changes in the financial markets and the direction of interest rates; volatility in earnings due to certain financial assets and liabilities held at fair value; competition levels; loan and investment prepayments differing from our assumptions; insufficient allowance for credit losses; a higher level of loan charge-offs and delinquencies than anticipated; material adverse changes in our operations or earnings; a decline in the economy in our market areas; changes in relationships with major customers; changes in effective income tax rates; higher or lower cash flow levels than anticipated; inability to hire or retain qualified employees; a decline in the levels of deposits or loss of alternate funding sources; a decrease in loan origination volume or an inability to close loans currently in the pipeline; changes in laws and regulations; adoption, interpretation and implementation of accounting pronouncements; operational risks, including the risk of fraud by employees, customers or outsiders; and the inability to successfully implement or expand new lines of business or new products and services. For a list of other factors which would affect our results, see the Company's filings with the Securities and Exchange Commission, including those risk factors identified in the \"Risk Factor\" section and elsewhere in our Annual Report on Form 10-K for the year ended December 31, 2016. The statements in this press release are made as of the date of this press release, even if subsequently made available by the Company on its website or otherwise. The Company assumes no obligation for updating any such forward-looking statements at any time, except as required by law.\nInvestor Contact:\nAdam Prior, Senior Vice President\nThe Equity Group Inc.\nPhone: (212) 836-9606\nEmail: aprior@equityny.com\nMedia Contact:\nAdam Cadmus, Marketing Director\nPhone: (732) 982-2167\nEmail: acadmus@tworiverbank.com\nTWO RIVER BANCORP\nCONSOLIDATED STATEMENTS OF OPERATIONS (Unaudited)\nFor the Three Months and Twelve Months Ended December 31, 2017 and 2016\n(in thousands, except per share data)\nThree Months Ended\nDecember 31, Twelve Months Ended\nDecember 31,\n2017 2016 2017 2016 Interest Income: Loans, including fees $ 9,438 $ 8,463 $ 35,801 $ 32,798 Securities: Taxable 273 205 988 776 Tax-exempt 270 253 1,101 917 Interest-bearing deposits 93 49 350 133 Total Interest Income 10,074 8,970 38,240 34,624 Interest Expense: Deposits 1,193 1,029 4,363 3,829 Securities sold under agreements to repurchase 16 17 66 61 Federal Home Loan Bank (\"FHLB\") and other borrowings 171 166 620 618 Subordinated debt 165 164 658 656 Total Interest Expense 1,545 1,376 5,707 5,164 Net Interest Income 8,529 7,594 32,533 29,460 Provision for (Recovery of) Loan Losses 675 (345 ) 1,530 515 Net Interest Income after Provision for (Recovery of) Loan Losses 7,854 7,939 31,003 28,945 Non-Interest Income: Service fees on deposit accounts 237 160 772 587 Mortgage banking 325 331 1,583 1,162 Other loan fees 186 299 588 610 Earnings from investment in bank owned life insurance 133 140 544 477 Death benefit on bank owned life insurance - - - 862 Gain on sale of SBA loans 235 293 1,052 868 Net gain on sale of securities - - - 72 Other income 227 224 920 851 Total Non-Interest Income 1,343 1,447 5,459 5,489 Non-Interest Expenses: Salaries and employee benefits 3,492 3,235 14,046 12,844 Occupancy and equipment 1,026 1,033 4,241 4,117 Professional 395 310 1,497 1,198 Insurance 58 56 216 216 FDIC insurance and assessments 113 88 467 412 Advertising 105 100 450 415 Data processing 147 149 553 554 Outside services fees 126 131 473 500 Amortization of identifiable intangibles - - - 9 OREO expenses, impairment and sales, net 4 (3 ) 48 (274 ) Loan workout expenses 59 (69 ) 233 73 Other operating 394 330 1,718 1,411 Total Non-Interest Expenses 5,919 5,360 23,942 21,475 Income before Income Taxes 3,278 4,026 12,520 12,959 Income Tax Expense 2,943 1,459 6,018 4,328 Net Income $ 335 $ 2,567 $ 6,502 $ 8,631 Earnings Per Common Share: Basic $ 0.04 $ 0.31 $ 0.78 $ 1.04 Diluted $ 0.04 $ 0.30 $ 0.75 $ 1.01 Weighted average common shares outstanding: Basic 8,420 8,322 8,388 8,321 Diluted 8,673 8,565 8,658 8,530\nTWO RIVER BANCORP\nCONSOLIDATED BALANCE SHEETS (Unaudited)\n(in thousands, except share data)\nDecember 31, December 31, 2017 2016 ASSETS Cash and due from banks $ 29,575 $ 19,844 Interest-bearing deposits in bank 18,644 22,233 Cash and cash equivalents 48,219 42,077 Securities available for sale 31,132 34,464 Securities held to maturity 58,002 57,843 Restricted investments, at cost 5,430 4,805 Loans held for sale 2,581 4,537 Loans 850,874 753,092 Allowance for loan losses (10,668 ) (9,565 ) Net loans 840,206 743,527 OREO - 259 Bank owned life insurance 21,573 21,029 Premises and equipment, net 6,239 4,662 Accrued interest receivable 2,554 2,234 Goodwill 18,109 18,109 Other assets 5,753 6,665 Total Assets $ 1,039,798 $ 940,211 LIABILITIES AND SHAREHOLDERS’ EQUITY Liabilities: Deposits: Non-interest-bearing $ 167,297 $ 160,104 Interest-bearing 694,260 616,463 Total Deposits 861,557 776,567 Securities sold under agreements to repurchase 27,120 19,915 FHLB and other borrowings 25,800 25,300 Subordinated debt 9,888 9,855 Accrued interest payable 70 100 Other liabilities 8,792 7,758 Total Liabilities 933,227 839,495 Shareholders’ Equity Preferred stock, no par value; 6,500,000 shares authorized, no shares issued and outstanding - - Common stock, no par value; 25,000,000 shares authorized; Issued – 8,782,124 and 8,677,536 at December 31, 2017 and 2016, respectively Outstanding – 8,470,030 and 8,365,442 at December 31, 2017 and 2016, respectively 79,678 79,056 Retained earnings 29,593 24,447 Treasury stock, at cost; 312,094 shares at December 31, 2017 and 2016, respectively (2,396 ) (2,396 ) Accumulated other comprehensive loss (304 ) (391 ) Total Shareholders' Equity 106,571 100,716 Total Liabilities and Shareholders’ Equity $ 1,039,798 $ 940,211 TWO RIVER BANCORP\nSelected Consolidated Financial Data (Unaudited)\nSelected Consolidated Earnings Data\n(in thousands, except per share data)\nThree Months Ended Twelve Months Ended Dec. 31, Sept. 30, Dec. 31, Dec. 31, Dec. 31, Selected Consolidated Earnings Data: 2017 2017 2016 2017 2016 Total Interest Income $ 10,074 $ 9,824 $ 8,970 $ 38,240 $ 34,624 Total Interest Expense 1,545 1,408 1,376 5,707 5,164 Net Interest Income 8,529 8,416 7,594 32,533 29,460 Provision for (Recovery of) Loan Losses 675 255 (345 ) 1,530 515 Net Interest Income after Provision for (Recovery of) Loan Losses 7,854 8,161 7,939 31,003 28,945 Other Non-Interest Income 1,343 1,453 1,447 5,459 5,489 Other Non-Interest Expenses 5,919 6,175 5,360 23,942 21,475 Income before Income Taxes 3,278 3,439 4,026 12,520 12,959 Income Tax Expense 2,943 1,202 1,459 6,018 4,328 Net Income $ 335 $ 2,237 $ 2,567 $ 6,502 $ 8,631 Per Common Share Data: Basic Earnings $ 0.04 $ 0.27 $ 0.31 $ 0.78 $ 1.04 Diluted Earnings $ 0.04 $ 0.26 $ 0.30 $ 0.75 $ 1.01 Book Value $ 12.58 $ 12.60 $ 12.04 $ 12.58 $ 12.04 Tangible Book Value (1) $ 10.44 $ 10.46 $ 9.88 $ 10.44 $ 9.88 Average Common Shares Outstanding (in thousands): Basic 8,420 8,393 8,322 8,388 8,321 Diluted 8,673 8,656 8,565 8,658 8,530 (1) Non-GAAP Financial Information. See “Reconciliation of Non-GAAP Financial Measures” at end of release. Selected Period End Balances\n(in thousands)\nDec. 31, Sept. 30, June 30, March 31, Dec. 31, 2017 2017 2017 2017 2016 Total Assets $ 1,039,798 $ 1,000,245 $ 983,099 $ 967,073 $ 940,211 Investment Securities and Restricted Stock 94,564 92,641 92,634 94,850 97,112 Total Loans 850,874 816,078 794,908 762,687 753,092 Allowance for Loan Losses (10,668 ) (10,223 ) (9,953 ) (9,567 ) (9,565 ) Goodwill and Other Intangible Assets 18,109 18,109 18,109 18,109 18,109 Total Deposits 861,557 821,872 810,725 799,705 776,567 Repurchase Agreements 27,120 22,576 25,823 21,437 19,915 FHLB and Other Borrowings 25,800 30,300 24,300 24,300 25,300 Subordinated Debt 9,888 9,879 9,871 9,863 9,855 Shareholders' Equity 106,571 106,567 104,524 102,406 100,716 Asset Quality Data (by Quarter) (dollars in thousands) Dec. 31, Sept. 30, June 30, March 31, Dec. 31, 2017 2017 2017 2017 2016 Nonaccrual Loans $ 2,070 $ 2,345 $ 2,946 $ 1,511 $ 1,548 OREO - - 233 259 259 Total Non-Performing Assets 2,070 2,345 3,179 1,770 1,807 Troubled Debt Restructured Loans: Performing 6,053 6,925 6,990 7,754 8,075 Non-Performing 994 1,129 960 405 157 Non-Performing Loans to Total Loans 0.24 % 0.29 % 0.37 % 0.20 % 0.21 % Non-Performing Assets to Total Assets 0.20 % 0.23 % 0.32 % 0.18 % 0.19 % Allowance as a % of Loans 1.25 % 1.25 % 1.25 % 1.25 % 1.27 % Capital Ratios\nDecember 31, 2017\nDecember 31, 2016\nCET 1\nCapital\nto Risk\nWeighted\nAssets\nRatio Tier 1\nCapital\nto\nAverage\nAssets\nRatio\nTier 1\nCapital\nto Risk\nWeighted\nAssets\nRatio\nTotal\nCapital\nto Risk\nWeighted\nAssets\nRatio\nCET 1\nCapital\nto Risk\nWeighted\nAssets\nRatio\nTier 1\nCapital\nto\nAverage\nAssets\nRatio\nTier 1\nCapital\nto Risk\nWeighted\nAssets\nRatio Total\nCapital\nto Risk\nWeighted\nAssets\nRatio Two River Bancorp 9.68 % 8.85 % 9.68 % 11.93 % 10.33 % 8.94 % 10.33 % 12.76 % Two River Community Bank 10.66 % 9.76 % 10.66 % 11.82 % 11.49 % 9.95 % 11.49 % 12.68 % \"Well capitalized\" institution (under prompt corrective action regulations)* 6.50 % 5.00 % 8.00 % 10.00 % 6.50 % 5.00 % 8.00 % 10.00 % *Applies to Bank only. For the Company to be “well capitalized,” the Tier 1 Capital to Risk Weighted Assets has to be at least 6.00%.\nConsolidated Average Balance Sheets & Yields\nWith Resultant Interest and Average Rates\nThree Months Ended Three Months Ended (dollars in thousands) December 31, 2017 December 31, 2016 Interest /\nIncome\nExpense Interest /\nIncome\nExpense ASSETS Average\nBalance Average\nYield /\nRate Average\nBalance Average\nYield /\nRate Interest-Earning Assets: Interest-bearing due from banks $ 28,598 $ 93 1.29 % $ 37,650 $ 49 0.52 % Investment securities 93,841 543 2.31 % 89,828 458 2.04 % Loans, net of unearned fees (1) (2) 828,725 9,438 4.52 % 752,067 8,463 4.48 % Total Interest-Earning Assets 951,164 10,074 4.20 % 879,545 8,970 4.06 % Non-Interest-Earning Assets: Allowance for loan losses (10,326 ) (9,749 ) All other assets 79,802 76,546 Total Assets $ 1,020,640 $ 946,342 LIABILITIES & SHAREHOLDERS' EQUITY Interest-Bearing Liabilities: NOW deposits $ 215,563 276 0.51 % $ 151,543 158 0.41 % Savings deposits 247,655 326 0.52 % 253,281 336 0.53 % Money market deposits 63,284 27 0.17 % 69,303 28 0.16 % Time deposits 147,035 564 1.52 % 141,336 507 1.43 % Securities sold under agreements to repurchase 22,103 16 0.29 % 21,085 17 0.32 % FHLB and other borrowings 31,199 171 2.17 % 34,213 166 1.93 % Subordinated debt 9,885 165 6.68 % 9,852 164 6.66 % Total Interest-Bearing Liabilities 736,724 1,545 0.83 % 680,613 1,376 0.80 % Non-Interest-Bearing Liabilities: Demand deposits 167,945 157,511 Other liabilities 8,593 8,631 Total Non-Interest-Bearing Liabilities 176,538 166,142 Stockholders’ Equity 107,378 99,587 Total Liabilities and Shareholders’ Equity $ 1,020,640 $ 946,342 NET INTEREST INCOME $ 8,529 $ 7,594 NET INTEREST SPREAD (3) 3.37 % 3.26 % NET INTEREST MARGIN (4) 3.56 % 3.43 % (1) Included in interest income on loans are loan fees. (2) Includes non-performing loans. (3) The interest rate spread is the difference between the weighted average yield on average interest-earning and the weighted average cost of average interest-bearing liabilities. (4) The interest rate margin is calculated by dividing annualized net interest income by average interest-earning assets.\nConsolidated Average Balance Sheets & Yields\nWith Resultant Interest and Average Rates\nTwelve Months Ended Twelve Months Ended (dollars in thousands) December 31, 2017 December 31, 2016 Interest /\nIncome\nExpense Interest /\nIncome\nExpense ASSETS Average\nBalance Average\nYield /\nRate Average\nBalance Average\nYield /\nRate Interest Earning Assets: Interest-bearing due from banks $ 33,255 $ 350 1.05 % $ 26,241 $ 133 0.51 % Investment securities 94,052 2,089 2.22 % 84,227 1,693 2.01 % Loans, net of unearned fees (1) (2) 793,671 35,801 4.51 % 724,511 32,798 4.53 % Total Interest-Earning Assets 920,978 38,240 4.15 % 834,979 34,624 4.15 % Non-Interest Earning Assets: Allowance for loan losses (9,933 ) (9,275 ) All other assets 79,850 77,181 Total Assets $ 990,895 $ 902,885 LIABILITIES & SHAREHOLDERS' EQUITY Interest-Bearing Liabilities: NOW deposits $ 201,490 958 0.48 % $ 151,360 649 0.43 % Savings deposits 256,222 1,330 0.52 % 233,514 1,165 0.50 % Money market deposits 63,093 107 0.17 % 72,721 119 0.16 % Time deposits 135,326 1,968 1.45 % 133,842 1,896 1.42 % Securities sold under agreements to repurchase 22,066 66 0.30 % 19,309 61 0.32 % FHLB and other borrowings 26,544 620 2.34 % 27,304 618 2.26 % Subordinated debt 9,872 658 6.67 % 9,840 656 6.67 % Total Interest-Bearing Liabilities 714,613 5,707 0.80 % 647,890 5,164 0.80 % Non-Interest-Bearing Liabilities: Demand deposits 163,707 150,495 Other liabilities 8,003 7,919 Total Non-Interest-Bearing Liabilities 171,710 158,414 Shareholders’ Equity 104,572 96,581 Total Liabilities and Shareholders’ Equity $ 990,895 $ 902,885 NET INTEREST INCOME $ 32,533 $ 29,460 NET INTEREST SPREAD (3) 3.35 % 3.35 % NET INTEREST MARGIN (4) 3.53 % 3.53 % (1) Included in interest income on loans are loan fees. (2) Includes non-performing loans. (3) The interest rate spread is the difference between the weighted average yield on average interest-earning and the weighted average cost of average interest-bearing liabilities. (4) The interest rate margin is calculated by dividing annualized net interest income by average interest-earning assets. Reconciliation of Non-GAAP Financial Measures\nThe press release contains certain financial information determined by methods other than in accordance with generally accepted accounting policies in the United States (GAAP). These non-GAAP financial measures are \"tangible book value per common share,\" \"return on average tangible assets,\" and \"return on average tangible equity.\" This non-GAAP disclosure has limitations as an analytical tool and should not be considered in isolation or as a substitute for analysis of the Company's results as reported under GAAP, nor is it necessarily comparable to non-GAAP performance measures that may be presented by other companies. Our management uses these non-GAAP measures in its analysis of our performance because it believes these measures are material and will be used as a measure of our performance by investors.\n(in thousands, except per share data) As of and for the Three Months Ended As of and for the\nTwelve Months Ended Dec. 31, Sept. 30, June 30, March 31, Dec. 31, Dec. 31, Dec. 31, 2017 2017 2017 2017 2016 2017 2016 Total shareholders' equity $ 106,571 $ 106,567 $ 104,524 $ 102,406 $ 100,716 $ 106,571 $ 100,716 Less: goodwill and other tangibles (18,109 ) (18,109 ) (18,109 ) (18,109 ) (18,109 ) (18,109 ) (18,109 ) Tangible common shareholders’ equity $ 88,462 $ 88,458 $ 86,415 $ 84,297 $ 82,607 $ 88,462 $ 82,607 Common shares outstanding 8,470 8,454 8,429 8,389 8,365 8,470 8,365 Book value per common share $ 12.58 $ 12.60 $ 12.40 $ 12.21 $ 12.04 $ 12.58 $ 12.04 Book value per common share $ 12.58 $ 12.60 $ 12.40 $ 12.21 $ 12.04 $ 12.58 $ 12.04 Effect of intangible assets (2.14 ) (2.14 ) (2.15 ) (2.16 ) (2.16 ) (2.14 ) (2.16 ) Tangible book value per common share $ 10.44 $ 10.46 $ 10.25 $ 10.05 $ 9.88 $ 10.44 $ 9.88 Return on average assets 0.13 % 0.89 % 0.87 % 0.76 % 1.08 % 0.66 % 0.96 % Effect of average intangible assets - 0.02 % 0.01 % 0.01 % 0.02 % 0.01 % 0.02 % Return on average tangible assets 0.13 % 0.91 % 0.88 % 0.77 % 1.10 % 0.67 % 0.98 % Return on average equity 1.24 % 8.39 % 8.26 % 7.18 % 10.25 % 6.22 % 8.94 % Effect of average intangible assets 0.25 % 1.74 % 1.75 % 1.56 % 2.28 % 1.30 % 2.06 % Return on average tangible equity 1.49 % 10.13 % 10.01 % 8.74 % 12.53 % 7.52 % 11.00 %\nSource: Two River Bancorp", "external_links": ["https://www.globenewswire.com/Tracker?data=1zs0HoHUo-42eME3IQr8KOwStyNE5uVnawUh3sXIxNQWnLm2Ude-MG2yEAwL0lA-kA26IUf6TacCH0nUKvJfvWMWCxfRaPk2XXcdsbI4YLw=", "https://www.globenewswire.com/Tracker?data=QZXameeW9h4RESeT9dipAFJJypkMjxYAfRRGehD-HVSL8g2Skh46VA7VvCV30O7RjMkHJSMFUcBGnSK2yyzKTll7DRE_iMpejhbFQk_rnng=", "https://www.globenewswire.com/Tracker?data=xaQV5qRHYb86AIYfqeUoeG-B0Py1G2QbiRbl7ypi5nMem70QuEsPUeGq1Dmfht2scimmB6rstmC7s9YYGfIXKYoktriJY3JpTrhtZEIzJ0s=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/2c2b48ad-e565-4827-a196-0011c37fe48e"], "published": "2018-01-30T16:00:00.000+02:00", "crawled": "2018-01-30T17:51:17.011+02:00", "highlightTitle": ""}