{"organizations": [], "uuid": "4e06db69ad7db54d57b9e1e8bd1a4f328d64d738", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/britain-press-business/press-digest-british-business-jan-15-idUSL3N1PA0SJ", "country": "US", "domain_rank": 408, "title": "PRESS DIGEST- British Business - Jan 15", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T03:10:00.000+02:00", "replies_count": 0, "uuid": "4e06db69ad7db54d57b9e1e8bd1a4f328d64d738"}, "author": "", "url": "https://www.reuters.com/article/britain-press-business/press-digest-british-business-jan-15-idUSL3N1PA0SJ", "ord_in_thread": 0, "title": "PRESS DIGEST- British Business - Jan 15", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "times  gkn plc", "sentiment": "none"}, {"name": "vannin capital", "sentiment": "none"}, {"name": "barclays plc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 15 (Reuters) - The following are the top stories on the business pages of British newspapers. Reuters has not verified these stories and does not vouch for their accuracy.\nThe Times\nGKN Plc is exploring the option of selling its aerospace business to fend off more potential approaches after an unsolicited 7 billion pounds ($9.61 billion) offer for the engineering group last week. ( bit.ly/2B0bMB2 )\nLawsuit funder Vannin Capital is considering an initial public offering, which would give investors a chance to share in the spoils of corporate and class action lawsuits. ( bit.ly/2DazPD3 )\nBarclays Plc has admitted that people wanting to object to its ringfencing plans have been stymied by \"a glitch\" on the High Court's computer system and the bank's own failure to provide enough information. ( bit.ly/2B0mjMq )\nThe Guardian\nThe head of a French dairy giant, Lactalis, at the centre of an international salmonella scandal has promised to withdraw 12 million boxes of powdered baby milk from the supermarket shelves of 83 countries. ( bit.ly/2DacW2O )\nOne of Britain's richest men, the Duke of Westminster, could see the value of his estates plummet this week if a landmark legal challenge is successful. The case could also benefit 2 million households across England and Wales. The court of appeal will on Tuesday rule in the case of Mundy v the Sloane Stanley Estate in a long-running legal battle over the calculation basis for extending a lease. ( bit.ly/2D8nSOi )\nThe Telegraph\n­Advertising agency M&C Saatchi Plc has bolstered its board with the appointment of experienced media banker Lorna Tilbian as a non-executive. ( bit.ly/2DbeXf5 )\nBritain's 7 trillion pound fund industry has gone \"backwards\" on gender diversity and must make a bigger effort to hire female talent, City grandee Sir Philip Hampton has warned. ( bit.ly/2DaxAQu )\nSky News\nDirectors of Carillion Plc were making a final rescue appeal to its lending banks on Sunday night after the Government refused to rescue the ailing construction group, taking it to the brink of collapse. ( bit.ly/2D9K0ry ) ($1 = 0.7281 pounds) (Compiled by Bengaluru newsroom; Editing by Peter Cooney)\n ", "external_links": [], "published": "2018-01-15T03:10:00.000+02:00", "crawled": "2018-01-15T03:31:43.000+02:00", "highlightTitle": ""}