{"organizations": [], "uuid": "e7ecc8af884d1b92a4bb1cc93fc30584c39f1c53", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-virtus-global-dividend-income-fund-inc-declares-distribution-and-discloses-sources-of-distribution--section-19a-notice.html", "country": "US", "domain_rank": 767, "title": "Virtus Global Dividend & Income Fund Inc. Declares Distribution And Discloses Sources Of Distribution - Section 19(a) Notice", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T22:43:00.000+02:00", "replies_count": 0, "uuid": "e7ecc8af884d1b92a4bb1cc93fc30584c39f1c53"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-virtus-global-dividend-income-fund-inc-declares-distribution-and-discloses-sources-of-distribution--section-19a-notice.html", "ord_in_thread": 0, "title": "Virtus Global Dividend & Income Fund Inc. Declares Distribution And Discloses Sources Of Distribution - Section 19(a) Notice", "locations": [], "entities": {"persons": [], "locations": [{"name": "hartford", "sentiment": "none"}, {"name": "conn.", "sentiment": "none"}], "organizations": [{"name": "virtus global dividend & income fund inc.", "sentiment": "neutral"}, {"name": "virtus global dividend & income fund inc", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HARTFORD, Conn., Jan. 2, 2018 /PRNewswire/ -- Virtus Global Dividend & Income Fund Inc. (NYSE: ZTR) announced the following monthly distribution:\nAmount of Distribution\nEx-Date\nRecord Date\nPayable Date\n$0.113\nJanuary 4, 2018\nDecember 29, 2017\nJanuary 9, 2018\nUnder the terms of its managed distribution plan, the fund will seek to maintain a consistent distribution level that may be paid in part or in full from net investment income and realized capital gains, or a combination thereof. Shareholders should note, however, that if the fund's aggregate net investment income and net realized capital gains are less than the amount of the distribution level, the difference will be distributed from the fund's assets and will constitute a return of the shareholder's capital. You should not draw any conclusions about the fund's investment performance from the amount of this distribution or from the terms of the fund's managed distribution plan.\nThe fund estimates that it has distributed more than its income and capital gains; therefore, a portion of your distribution may be a return of capital. A return of capital may occur, for example, when some or all of the money that you invested in the fund is paid back to you. A return of capital distribution does not necessarily reflect the fund's investment performance and should not be confused with \"yield\" or \"income.\"\nThe fund provided this estimate of the sources of the distribution:\nDistribution Estimates\nDecember 2017 (MTD)\nYear-to-date (YTD) (1)\n(Sources)\nPer Share\nAmount\nPercentage\nof Current\nDistribution\nPer Share\nAmount\nPercentage\nof Current\nDistribution\nNet Investment Income\n$0.022\n19.3%\n$0.429\n31.7%\nNet Realized Foreign Currency Gains\n-\n0.0%\n-\n0.0%\nNet Realized Short-Term Capital Gains\n0.051\n45.2%\n0.326\n24.0%\nNet Realized Long-Term Capital Gains\n0.040\n35.5%\n0.319\n23.5%\nReturn of Capital (or other Capital Source)\n-\n0.0%\n0.282\n20.8%\nTotal Distribution\n$0.113\n100.0%\n$1.356\n100.0%\n(1)\nYTD January 11, 2017 to January 9, 2018. (The distribution paid on January 10, 2017 was reportable for tax on Form 1099 in 2016)\nInformation regarding the fund's performance and distribution rates is set forth below. Please note that all performance figures are based on the fund's NAV and not the market price of the fund's shares. Performance figures are not meant to represent individual shareholder performance.\nDecember 29, 2017\nAverage Annual Total Return on NAV for the 5-year period (2)\n8.64%\nCurrent Fiscal YTD Annualized Distribution Rate (3)\n10.39%\nYTD Cumulative Total Return on NAV (4)\n19.02%\nYTD Cumulative Distribution Rate (5)\n10.39%\n(2)\nAverage Annual Total Return on NAV is the annual compound return for the five-year period. It reflects the change in the fund's\nNAV and reinvestment of all distributions.\n(3)\nCurrent Fiscal YTD Annualized Distribution Rate is the current distribution rate annualized as a percentage of the fund's NAV\nat month end.\n(4)\nYTD Cumulative Total Return on NAV is the percentage change in the fund's NAV from the first day of the year to this month end,\nincluding distributions paid and assuming reinvestment of those distributions.\n(5)\nYTD Cumulative Distribution Rate is the dollar value of distributions from the first day of the year to this month end as a\npercentage of the fund's NAV at month end.\nThe amounts and sources of distributions reported in this notice are estimates only and are not being provided for tax reporting purposes. The actual amounts and sources of the distributions will depend on the fund's investment experience during the remainder of its fiscal year and may be subject to changes based on tax regulations. The fund or your broker will send shareholders a Form 1099-DIV for the calendar year that will tell shareholders what distributions to report for federal income tax purposes.\nAbout the Fund\nThe Virtus Global Dividend & Income Fund Inc. is a diversified closed-end fund that seeks to generate total return, consisting of capital appreciation and income. It currently targets an allocation of 60 percent equity securities and 40 percent fixed income. The equity allocation is invested exclusively in what the managers believe are high-quality companies within the high yielding global equity universe. The fixed income allocation is invested primarily in intermediate-term debt securities across 14 fixed income sectors. The fund also pursues an options income strategy whereby it purchases and sells out-of-the money puts and calls, creating an options spread.\nVirtus Investment Advisers has been the investment adviser to the fund and Kayne Anderson Rudnick and Newfleet Asset Management have been subadvisers since September 7, 2016. Performance and characteristics prior to that date were attained by the previous adviser using a different investment strategy.\nFor more information on the fund, contact shareholder services at (866) 270-7788, by email at closedendfunds@virtus.com , or through the closed end fund section on the web at www.virtus.com .\nFund Risks\nAn investment in a fund is subject to risk, including the risk of possible loss of principal. A fund's shares may be worth less upon their sale than what an investor paid for them. Shares of closed-end funds may trade at a discount to their net asset value. For more information about each fund's investment objective and risks, please see the fund's annual report. A copy of the fund's most recent annual report may be obtained free of charge by contacting \"Shareholder Services\" as set forth at the end of this press release.\nAbout Kayne Anderson Rudnick\nKayne Anderson Rudnick (KAR) believes that superior risk-adjusted returns may be achieved through investment in high-quality companies with market dominance, excellent management, financial strength, and consistent growth, purchased at reasonable prices. KAR's investment strategy is to build a portfolio of companies that have strong, consistent growth with low business and financial risk, and hold these companies over the long term based on its conviction that the investment returns of the portfolio will mirror the financial results of these companies.\nAbout Newfleet Asset Management\nNewfleet Asset Management provides comprehensive fixed income portfolio management in multiple strategies. Newfleet leverages the knowledge and skill of a team of investment professionals with expertise in every sector of the bond market, including evolving, specialized, and out-of-favor sectors. The team employs active sector rotation and disciplined risk management to portfolio construction, avoiding interest rate bets, and remaining duration neutral to each strategy's stated benchmark.\nView original content with multimedia: http://www.prnewswire.com/news-releases/virtus-global-dividend--income-fund-inc-declares-distribution-and-discloses-sources-of-distribution--section-19a-notice-300576563.html\nSOURCE Virtus Global Dividend & Income Fund Inc.", "external_links": ["https://www.virtus.com/investment-partners/newfleet-asset-management-llc", "http://www.virtus.com/", "https://www.virtus.com/products/virtus-global-dividend-income-fund-inc", "https://www.virtus.com/our-products/individual-investors/closed-end-funds", "http://kayne.com/", "http://www.prnewswire.com/news-releases/virtus-global-dividend--income-fund-inc-declares-distribution-and-discloses-sources-of-distribution--section-19a-notice-300576563.html"], "published": "2018-01-02T22:43:00.000+02:00", "crawled": "2018-01-03T00:39:23.000+02:00", "highlightTitle": ""}