{"organizations": [], "uuid": "59854975698200220fc7c402651687f3a2db5ba1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/04/12/104400695-GettyImages-667733550.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/15/russias-lavrov-slams-trump-administration-on-iran-syria-north-korea.html", "country": "US", "domain_rank": 767, "title": "Russia’s Lavrov slams Trump administration on Iran, Syria, North Korea", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.22, "site_type": "news", "published": "2018-01-15T17:05:00.000+02:00", "replies_count": 0, "uuid": "59854975698200220fc7c402651687f3a2db5ba1"}, "author": "Natasha Turak", "url": "https://www.cnbc.com/2018/01/15/russias-lavrov-slams-trump-administration-on-iran-syria-north-korea.html", "ord_in_thread": 0, "title": "Russia’s Lavrov slams Trump administration on Iran, Syria, North Korea", "locations": [], "entities": {"persons": [{"name": "lavrov", "sentiment": "negative"}, {"name": "alexander nemenov", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "sergei lavrov", "sentiment": "negative"}, {"name": "rex tillerson", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "ukraine", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "united nations security council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Alexander Nemenov | AFP | Getty Images Russian Foreign Minister Sergei Lavrov (R) and US Secretary of State Rex Tillerson arrive to attend a press conferece after their talks in Moscow on April 12, 2017. \nMoscow will not accept any changes to the Iran nuclear pact made by the United States, Russia's Foreign Minister Sergei Lavrov said during a press conference Monday, accusing the U.S. of fomenting further conflict around the Middle East. \nThe minister fielded questions on a range of topics from Syria to Ukraine, criticizing U.S. activities in Syria and the Israel-Palestine conflict while insisting the Russian government supports peace and reconciliation. \n\"We will not support what the United States is trying to do, changing the wording of the agreement, incorporating things that will be absolutely unacceptable for Iran,\" Lavrov told reporters. \nOn Friday, President Donald Trump agreed to uphold sanctions relief for Iran as part of the Joint Comprehensive Plan of Action (JCPOA), signed in 2015 by all United Nations Security Council members and Germany, which allowed the lifting of sanctions in exchange for sharp restrictions on Iran's nuclear program. \nBut Trump's disapproval of the deal is well known. He announced that this would be the \"last time\" he would waive sanctions and pledged to fix what he called the \"terrible flaws\" in the deal with the help of Congress. Russia, along with EU leaders, have urged the U.S. to respect the integrity of the original arrangement. \nLavrov also disparaged Washington's recently announced plan to implement a 30,000-man border security force in Syria's Kurdish territory. \"This is a very serious issue, which causes concerns that a course was set for the partition of Syria,\" the minister said. He also claimed there was no difference between Trump and former president Barack Obama's policies in Syria, accusing the U.S. of supporting forces that did \"not wish to put an end to the conflict as soon as possible.\" Photo by Mikhail Klimentyev | TASS via Getty Images Latakia, Syria December 11, 2017: Russia's Defense Minister Sergei Shoigu (L) and Russia's President Vladimir Putin at the Russian Hmeimim air base. Putin has ordered Russian troops to start pulling out of Syria. \nIt didn't come as a surprise that Russia's top diplomat would voice his government's aversion to American foreign policy. The two countries have been at opposing ends of some of the most internecine conflicts of the past several years, particularly Syria's civil war and the conflict in eastern Ukraine. In April 2017, Russia's Foreign Ministry described American-Russian relations as going through the \"most difficult period since the end of the Cold War.\" Syria: Conflicting narratives \nRussia has been unwavering in its support of Syrian President Bashar Assad, who has been accused of war crimes and the use of chemical weapons against his own people. The U.S., meanwhile, has provided arms and training to anti-government rebel groups. Human rights activists have urged the UN to charge Russia and Iran, allies of the Syrian regime, with war crimes after thousands of Russian airstrikes were reported to have killed more than 4,000 Syrian civilians. U.S.-led international coalition airstrikes targeting the Islamic State are also reported by rights groups to have killed more than 1,000 civilians. \nAmnesty International has accused Russia of covering up what it calls the indiscriminate nature of its bombing raids, and the Syrian Network for Human Rights in early 2017 said it \"found a similarity between the violations committed by the Russians and the (Syrian) regime.\" \nMoscow has labeled these reports \"provocations\" and denied the figures, maintaining it is targeting Islamic terrorists. Russia has also pushed back on several multilateral attempts to condemn the Syrian president, including vetoing UN resolutions condemning the chemical attack. Alexander Shcherbak | TASS | Getty Images President Donald Trump (L) of the United States shakes hands with Russia's Foreign Minister Sergei Lavrov as they meet for talks in the Oval Office at the White House. \nMeanwhile, Trump's criticism of Russia has been relatively muted, leaving observers puzzled over how the White House views Russia vis-a-vis U.S. interests. \nIn November, Trump and Russian leader Vladimir Putin jointly pledged renewed support for the UN's Geneva Process, which has so far failed to reach a solution to the conflict. Voices from the U.S. national security establishment, including Secretary of Defense James Mattis, have warned against allying with Russia in Syria, which Trump has frequently called for. 'Dead end' for Israel-Palestine peace, North Korea action 'destructive' \nLavrov also slammed Trump's naming of Jerusalem as the capital of Israel , saying it would have a \"detrimental effect and risks regarding this dead end in the Israeli-Palestine settlement.\" The White House motion in December sparked outrage across much of the Middle East over a highly sensitive topic previously left alone by former administrations. Trump defended the move as \"a recognition of reality.\" \nThe minister then went on to lament the upcoming U.S.-led Vancouver meeting on North Korea's nuclear development — to be attended by foreign ministers of 16 countries, predominantly those involved in the 1950-53 Korean War — calling it \"destructive\". \n\"The agenda (of the meeting) is to develop a mechanism of additional pressure on Pyongyang … We and the Chinese were not invited to it.\" He added that Moscow supported direct dialogue with the U.S. concerning the Korean Peninsula. \nRussia has been fairly consistent in resisting international efforts to pressure Pyongyang, vetoing several UN resolutions for strict sanctions on the country. Moscow continues to support the North Korean regime, quietly increasing bilateral trade and oil exports over the last year. Russia also refused to repatriate tens of thousands of North Korean laborers, and in October provided an internet connection to the reclusive state. \nTrump in December described Russia as \"not helping\" with the North Korean situation, adding, \"We'd like to have Russia's help — very important.\"", "external_links": [], "published": "2018-01-15T17:05:00.000+02:00", "crawled": "2018-01-15T17:05:25.009+02:00", "highlightTitle": ""}