{"organizations": [], "uuid": "711d31a502a9de00a3ed3f3350b5f075c8a776b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/sqm-arbitration/update-1-chiles-corfo-sqm-strike-deal-in-lithium-dispute-idUSL1N1PC2D6", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Chile's Corfo, SQM strike deal in lithium dispute", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T01:14:00.000+02:00", "replies_count": 0, "uuid": "711d31a502a9de00a3ed3f3350b5f075c8a776b1"}, "author": "", "url": "https://www.reuters.com/article/sqm-arbitration/update-1-chiles-corfo-sqm-strike-deal-in-lithium-dispute-idUSL1N1PC2D6", "ord_in_thread": 0, "title": "UPDATE 1-Chile's Corfo, SQM strike deal in lithium dispute", "locations": [], "entities": {"persons": [{"name": "eduardo bitran", "sentiment": "none"}, {"name": "felipe iturrieta", "sentiment": "none"}], "locations": [{"name": "albemarle", "sentiment": "none"}, {"name": "u.s.-based albemarle", "sentiment": "none"}, {"name": "santiago", "sentiment": "none"}, {"name": "salar de atacama", "sentiment": "none"}, {"name": "chile", "sentiment": "none"}], "organizations": [{"name": "corfo", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "sqm", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds details of deal, comment by Corfo director, background on dispute)\nBy Felipe Iturrieta\nSANTIAGO, Jan 17 (Reuters) - Chilean development agency Corfo said on Wednesday that it had struck a deal with lithium company SQM , ending a long dispute over royalties in Chile’s Salar de Atacama, home to one of the world’s richest lithium deposits.\nThe deal frees the miner to apply for an increase in its production quota amid a demand boom and surging prices for lithium, which is used in the batteries that power electric cars.\nCorfo chief Eduardo Bitran said SQM had agreed to overhaul its corporate governance board to ensure adherence to global standards, a key condition put forward by Chilean authorities. The deal also hikes the royalties paid by SQM to equal those established in a similar contract between Chile and SQM competitor and lithium producer Albemarle.\nSQM, like the U.S.-based Albemarle, would be required to supply Chile with lithium at a favorable price, a stipulation intended to incentivize value-added production in Chile.\nThe deal also includes an option that would permit SQM to work with state miner Codelco to begin developing the Maricunga lithium deposit. Codelco, one of the world’s largest copper producers, has lithium assets in Chile but is currently not producing the metal.\n“Our intention is to make it available for Codelco so it can ... make viable the development of a new activity in this area,” Bitran told reporters.\nUnder the new contract, SQM would be able to produce up to 216,000 tonnes of lithium carbonate a year through 2025 in the Salar de Atacama, the source of half the company’s revenue, if it makes certain investments and obtains the relevant permits.\nThe arbitration began in May 2014, after Chilean authorities accused SQM of underpaying royalties and violating environmental regulations.\nThe dispute had threatened to complicate Nutrien Ltd’s bid to divest its stake in SQM. The fertilizer company, formed earlier this year by the merger of Canadian Potash Corp of Saskatchewan and Agrium, must sell its shares in the Chilean lithium miner as part of an agreement with Indian regulators.\nAfter talks collapsed in October last year, Corfo announced in December that representatives of SQM and Potash had met with Chilean authorities to reopen negotiations.\nThe deal removes the miner’s former chairman Julio Ponce, who has been fined for market manipulation, from control of the company.\nBitran had previously said Chile could earn up to $7.5 billion in royalties by 2030 from a new contract with SQM. (Reporting by Felipe Iturrieta; Writing by Dave Sherwood; Editing by Lisa Shumaker and Matthew Lewis)\n ", "external_links": [], "published": "2018-01-18T01:14:00.000+02:00", "crawled": "2018-01-18T01:26:37.001+02:00", "highlightTitle": ""}