{"organizations": [], "uuid": "0ad71531659b0898e33d570d844c7beec8035030", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226826570&w=1200&r=LYNXMPEE0U07L", "site_section": "http://feeds.reuters.com/reuters/INtechnologyNews\r", "section_title": "Reuters: Technology News", "url": "https://in.reuters.com/article/sequoia-fundraising/sequoia-capital-plans-8-billion-global-fund-eyes-china-investors-sources-idINKBN1FK0GI", "country": "US", "domain_rank": 408, "title": "Sequoia Capital plans $8 billion global fund, eyes China investors - sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T07:09:00.000+02:00", "replies_count": 0, "uuid": "0ad71531659b0898e33d570d844c7beec8035030"}, "author": "", "url": "https://in.reuters.com/article/sequoia-fundraising/sequoia-capital-plans-8-billion-global-fund-eyes-china-investors-sources-idINKBN1FK0GI", "ord_in_thread": 0, "title": "Sequoia Capital plans $8 billion global fund, eyes China investors - sources", "locations": [], "entities": {"persons": [{"name": "kane wu", "sentiment": "none"}, {"name": "julie zhu", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "hong kong-based", "sentiment": "none"}], "organizations": [{"name": "sequoia capital", "sentiment": "negative"}, {"name": "apple inc", "sentiment": "none"}, {"name": "vision fund", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "sequoia", "sentiment": "none"}, {"name": "softbank group corp", "sentiment": "none"}, {"name": "google inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HONG KONG (Reuters) - Sequoia Capital, an early investor in global tech behemoths like Google Inc and Apple Inc, aims to raise up to $8 billion in its largest-ever fundraising and has set sights on Chinese investors, people familiar with the plan told Reuters.\nMore cash in the bag would help the Silicon Valley venture capital giant diversify its focus from early-and growth-stage investments to pre-IPO funding rounds, at a time when startup valuations are spiking partly due to money pouring in from SoftBank Group Corp’s $93 billion Vision Fund.\n“There is so much money now (in the tech sector). You need to have a bigger war chest,” said a Hong Kong-based investment banker familiar with Sequoia’s strategy.\nFor its new global fund, Sequoia is already trying to attract investors in China, where fund managers are looking to gain from growing sources of capital at wealth management firms, insurers and other large domestic institutional investors that aim to boost returns in alternative assets, the people said.\nSequoia’s China founding partner Neil Shen, one of the best-known venture capitalists in the country, is actively tapping potential investors including state-backed ones for the global fund, said the people, who declined to be named as the fundraising plans were confidential.\nHowever, the size of the fund could also be lower, at $5-6 billion, cautioned one of the sources.\nSequoia declined to comment on the fundraising.\nIn 2016, the venture capital (VC) firm had raised $2 billion for a global growth fund, then the largest-ever raised by the firm, according to data provider Preqin.\nBut VC and private equity firms are now rushing to corner larger cash pools as investment cycles get drawn out, with many tech firms opting to stay privately-held for longer than usual, such as Uber Technologies, Alibaba Group Holdings’ financial affiliate Ant Financial and Airbnb Inc.\nThe average value of late-stage investments alone surged 40 percent last year, Preqin data shows.\nSoftBank’s tech-focused Vision Fund, the world’s largest PE fund, has aided the spike in startup valuations.\nIt has poured more than $9 billion into global start-ups since its inception in 2016, including a $4.9 billion investment in office-sharing startup WeWork and $1.1 billion in Indian e-commerce platform Flipkart, Thomson Reuters data shows.\nSequoia is also tapping investors in the Middle East and Japan among other regions for its new global fund, according to one of the sources. It will continue to focus on sectors ranging from technology, healthcare and consumer to media, notably in the United States, China and India, said another source.\nSequoia’s China arm, founded in 2005 by Shen, is also raising up to 15 billion yuan ($2.37 billion) in its fifth yuan-denominated fund, the largest of its kind, to invest in local start-ups, said two other people.\nSequoia China declined to comment on Shen’s role in the latest global fund or its fifth yuan fund.\nIt has over 300 portfolio investments in China, including internet giant Alibaba, ride-hailing firm Didi Chuxing and on-demand services provider Meituan-Dianping.\n($1 = 6.3410 Chinese yuan renminbi)\nReporting by Julie Zhu and Kane Wu in Hong Kong; Additional reporting by Liana B. Baker in San Francisco; Editing by Himani Sarkar\n ", "external_links": [], "published": "2018-01-31T07:09:00.000+02:00", "crawled": "2018-01-31T07:45:26.000+02:00", "highlightTitle": ""}