{"organizations": [], "uuid": "1d1c84b8a01803ec044a4ca870b56b3ad709caf2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/05/20/100751194-106530780.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/12/d-e-shaw-co-builds-activist-position-in-lowes.html", "country": "US", "domain_rank": 767, "title": "D.E. Shaw & Co builds activist position in Lowe's", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T22:42:00.000+02:00", "replies_count": 0, "uuid": "1d1c84b8a01803ec044a4ca870b56b3ad709caf2"}, "author": "Leslie Picker", "url": "https://www.cnbc.com/2018/01/12/d-e-shaw-co-builds-activist-position-in-lowes.html", "ord_in_thread": 0, "title": "D.E. Shaw & Co builds activist position in Lowe's", "locations": [], "entities": {"persons": [{"name": "lowe", "sentiment": "negative"}, {"name": "d.e. shaw", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "d.e. shaw & co.", "sentiment": "negative"}, {"name": "d.e. shaw & co", "sentiment": "negative"}, {"name": "home depot", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "D.E. Shaw & Co builds activist position in Lowe's Activist investor D.E. Shaw & Co. has built an active stake in Lowe's , sources tell CNBC. The firm is concerned about the home improvement retailer's performance relative its peers, the sources said. D.E. Shaw is not pushing for consolidation with another home retailer at this time. 49 Mins Ago | 00:48 \nActivist investor D.E. Shaw & Co. has built an active stake in U.S. home improvement retailer Lowe's , sources tell CNBC. \nThe firm is concerned about Lowe's performance relative its peers, the sources said. D.E. Shaw is not planning to push for consolidation with another home retailer at this time. \nD.E. Shaw declined to comment on this story, and Lowe's wasn't immediately available to comment. \nShares of Lowe's, which has a market capitalization of $83.6 billion, climbed more than 5 percent Friday afternoon when Bloomberg first reported on the position. Shares of Home Depot also briefly jumped on the news. \nLowe's has by and large lagged behind its biggest rival Home Depot. The company has made efforts to catch up to the Atlanta-based retailer in part by mimicking its strong professional and contracting business. These efforts include two acquisitions worth more than $500 million announced last May . \nLowe's, which some analysts say has weaker real estate than Home Depot, has also seen its same-store sales growth lag behind its rival. \nBoth have benefited from a slew of devastating hurricanes in the U.S., which sent shoppers to their stores in droves to pick up relief supplies and rebuilding materials. Emergencies tend to benefit brick and mortar retailers over online players, because they can offer needed supplies immediately. \nThe two compete with Ikea and and e-retailer Wayfair . Amazon has so far posed less of a threat, in part because of the expense attached to shipping heavy home improvement items. \nLooking ahead, Lowe's has said it expects revenue to increase roughly 5 percent by the end of fiscal 2017, with sales at its established stores rising 3.5 percent. Lowe's is also on track to have added about 25 home improvement and hardware stores before the end of its fiscal fourth quarter. \nIn an attempt to lure younger shoppers, Lowe's has been experimenting with technology and opened up \" smart home centers \" at some locations ahead of the holidays. \nLowe's stock is up more than 40 percent from a year ago, while shares of Home Depot have climbed more than 45 percent over the same period.", "external_links": [], "published": "2018-01-12T22:42:00.000+02:00", "crawled": "2018-01-12T22:56:20.011+02:00", "highlightTitle": ""}