{"organizations": [], "uuid": "d0b32557367be131f6260789587f049ddffd08a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222474796&w=1200&r=LYNXMPEE0F17B", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/usa-trump-russia-manafort/u-s-judge-delays-setting-trial-date-for-trump-ex-aide-manafort-idINKBN1F524E", "country": "US", "domain_rank": 408, "title": "U.S. judge delays setting trial date for Trump ex-aide Manafort", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T18:50:00.000+02:00", "replies_count": 0, "uuid": "d0b32557367be131f6260789587f049ddffd08a2"}, "author": "", "url": "https://in.reuters.com/article/usa-trump-russia-manafort/u-s-judge-delays-setting-trial-date-for-trump-ex-aide-manafort-idINKBN1F524E", "ord_in_thread": 0, "title": "U.S. judge delays setting trial date for Trump ex-aide Manafort", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "manafort", "sentiment": "none"}, {"name": "amy berman jackson", "sentiment": "none"}, {"name": "kevin downing", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "sarah n. lynch", "sentiment": "none"}, {"name": "paul manafort", "sentiment": "none"}, {"name": "richard gates", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "u.s. district court for the district of columbia", "sentiment": "none"}, {"name": "u.s. district court", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - A federal judge on Tuesday delayed setting a trial date for President Donald Trump’s former campaign manager Paul Manafort, who faces charges stemming from the special counsel’s probe of allegations of Russian interference in the U.S. presidential election.\nPresident Trump's former campaign manager Paul Manafort leaves U.S. District Court in Washington, U.S., January 16, 2018. REUTERS/Yuri Gripas Defense lawyers said the government has still not yet produced all of the evidence it has gathered, and they need more time to pore through it and file the necessary motions.\nThe government had sought for a May start to the trial. But Judge Amy Berman Jackson said at Tuesday’s hearing in the U.S. District Court for the District of Columbia that a trial for Manafort and his business partner Richard Gates might not start until the fall of 2018.\n“We have limited resources,” Manafort’s attorney Kevin Downing said Tuesday. “We’re not big law firms.”\nManafort and Gates face charges that include failing to register as foreign agents for political work they did for a pro-Russia Ukrainian political party, as well as conspiracy to launder money and conspiracy against the United States.\nFederal prosecutors said Tuesday they expect they will need at least three weeks to present their case to a jury. This will ensure continuing news coverage of the probe by Special Counsel Robert Mueller, which the Trump administration has repeatedly sought to discredit.\nTrump has denied there was any collusion and Russia has denied meddling in the election.\nManafort, for his part, has also adamantly denied any wrongdoing.\nEarlier this month, his lawyers took the unusual step of filing a civil lawsuit against Mueller, Deputy Attorney General Rod Rosenstein and the Justice Department, accusing them of legal overreach.\nThe suit asks that the indictment be dismissed because it alleges conduct that falls outside the bounds of what Mueller is permitted to investigate.\nProsecutors said Tuesday they intend to file a motion by Feb. 2 to have that civil case dismissed on the grounds that the issues it raises should be addressed in the criminal case.\nMeanwhile, the judge gave Manafort and Gates until Feb. 23 to file motions that seek to address alleged defects in the criminal case.\nThe next status conference in the case will occur on Feb. 14.\nReporting by Sarah N. Lynch; Writing by Susan Heavey; Editing by Chizu Nomiyama and David Gregorio\n ", "external_links": [], "published": "2018-01-16T18:50:00.000+02:00", "crawled": "2018-01-16T19:14:37.020+02:00", "highlightTitle": ""}