{"organizations": [], "uuid": "0cc955f3f38783141e737bee042c30f2f61e8983", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-american-surgical-professionals-announces-acquisition-of-chesapeake-medical-staffing.html", "country": "US", "domain_rank": 767, "title": "American Surgical Professionals Announces Acquisition Of Chesapeake Medical Staffing", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.66, "site_type": "news", "published": "2018-01-19T19:55:00.000+02:00", "replies_count": 0, "uuid": "0cc955f3f38783141e737bee042c30f2f61e8983"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-american-surgical-professionals-announces-acquisition-of-chesapeake-medical-staffing.html", "ord_in_thread": 0, "title": "American Surgical Professionals Announces Acquisition Of Chesapeake Medical Staffing", "locations": [], "entities": {"persons": [{"name": "jeff mcclure", "sentiment": "none"}, {"name": "tom kirk", "sentiment": "none"}], "locations": [{"name": "houston", "sentiment": "none"}, {"name": "tx", "sentiment": "none"}, {"name": "md", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "lutherville-timonium", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}], "organizations": [{"name": "american surgical professionals announces acquisition of chesapeake", "sentiment": "negative"}, {"name": "chesapeake medical staffing", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "cms", "sentiment": "none"}, {"name": "american surgical professionals", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON, Jan. 19, 2018 /PRNewswire/ -- American Surgical Professionals (ASP), a provider of surgical assisting staff support services, announced that it has acquired Chesapeake Medical Staffing, LLC. (CMS), a medical staffing solutions and active managed services provider located in Lutherville-Timonium, MD.\nAmerican Surgical Professionals was founded over twenty-five years ago in Houston, TX and has grown to thirteen states with over 250 clients. \"The acquisition of Chesapeake Medical Staffing marks the next step in our strategy to play a larger role in the provision of clinical outsourced services to US healthcare providers. The founders of CMS have built an outstanding company known for high quality and responsive employees in nursing and a wide variety of clinical roles. Joining together will expand our offerings to each other's existing customers as well as open new geographic opportunities and alternative healthcare venues,\" said Tom Kirk, CEO of ASP.\n\"CMS explored numerous options to enhance our future,\" said Jeff McClure co-founder and CEO of CMS. \"ASP's combination of business strengths and culture were exactly in line with our intended direction.\" Terri Weller, co-founder and CNO said, \"We are excited to be teaming with another high quality Joint Commission certified group of established clinicians. Helping our clients by providing experienced clinical professionals in a user friendly manner has always been my passion. This merging of talent will take us to a new level in meeting the continuum of care needs of our current and future clients.\"\nAbout American Surgical Professionals\nFounded in 1993 and headquartered in Houston, TX, American Surgical is the nation's leading provider of professional surgical assistant services to hospitals, clinics (ASC), surgeons and patients. The Company offers custom tailored solutions to perioperative staffing situations. These include providing surgical specialists on an outsourced, as needed or contract basis. In addition to being Joint Commission certified, ASP's professionals are experienced in all state-of-the-art technologies such as robotics and current medical techniques such as endoscopic vein harvesting. The utilization of ASP's services results in improved outcomes for surgical procedures, enhanced economics and a reduction of staff management complexities. For more information, please visit www.amerisurg.com or call 713-779-9800.\nAbout Chesapeake Medical Staffing\nFounded in 2001 and headquartered in Lutherville-Timonium, MD, Chesapeake Medical Staffing is one of the largest and most respected health care staffing agencies in the mid-Atlantic region. CMS has focused on sourcing the highest quality health care professionals from nurses to administrative personnel to physicians to complete management of the agency process. The Company is Joint Commission certified and their client list includes hospitals, institutional care providers, management services organizations (MSO), home care and individual patients. CMS's impressive range of available medical professionals on a per diem or contract basis combined with customer service that is second to none has been the impetus for a growing list of satisfied customers. For more information, please visit www.cms24-7.com or call 410-321-4267.\nView original content: http://www.prnewswire.com/news-releases/american-surgical-professionals-announces-acquisition-of-chesapeake-medical-staffing-300585317.html\nSOURCE American Surgical Professionals", "external_links": ["http://www.prnewswire.com/news-releases/american-surgical-professionals-announces-acquisition-of-chesapeake-medical-staffing-300585317.html", "http://www.cms24-7.com/", "http://www.amerisurg.com/"], "published": "2018-01-19T19:55:00.000+02:00", "crawled": "2018-01-19T22:54:43.028+02:00", "highlightTitle": ""}