{"organizations": [], "uuid": "28f790fb19fd6d60514cddb5916f01858a80a8f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 71}, "facebook": {"likes": 161, "shares": 161, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226244404&w=1200&r=LYNXMPEE0S0HM", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-ablynx-m-a-sanofi/healthcare-group-sanofi-to-buy-ablynx-for-3-9-billion-euros-idUSKBN1FI0OS", "country": "US", "domain_rank": 408, "title": "France's Sanofi buys Ablynx for $4.8 billion in biotech M&A boom", "performance_score": 1, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T11:07:00.000+02:00", "replies_count": 0, "uuid": "28f790fb19fd6d60514cddb5916f01858a80a8f5"}, "author": "", "url": "https://www.reuters.com/article/us-ablynx-m-a-sanofi/healthcare-group-sanofi-to-buy-ablynx-for-3-9-billion-euros-idUSKBN1FI0OS", "ord_in_thread": 0, "title": "France's Sanofi buys Ablynx for $4.8 billion in biotech M&A boom", "locations": [], "entities": {"persons": [{"name": "ablynx", "sentiment": "negative"}, {"name": "sudip kar-gupta", "sentiment": "none"}, {"name": "ben hirschler", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "denmark", "sentiment": "none"}], "organizations": [{"name": "ablynx", "sentiment": "negative"}, {"name": "sanofi", "sentiment": "negative"}, {"name": "celgene", "sentiment": "none"}, {"name": "novo nordisk", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "novo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 7:47 AM / in 4 hours Sanofi beats Novo to buy Ablynx for $4.8 billion in biotech M&A boom Matthias Blamont , Ben Hirschler 6 Min Read \nPARIS/LONDON (Reuters) - French drugmaker Sanofi has agreed to buy Belgian biotech company Ablynx for 3.9 billion euros ($4.8 billion), beating Novo Nordisk and marking its second big deal this month after buying Bioverativ. \nThe transaction is a further sign of accelerating merger and acquisition (M&A) activity in the global biotech sector and comes after Ablynx rejected a 2.6 billion euro offer from Denmark’s Novo Nordisk. \nSanofi said on Monday it would pay 45 euros per share in cash for Ablynx, a premium of 21 percent over its closing price on Friday, and more than double the price before Novo went public with its initial bid. \nNovo Nordisk conceded defeat, saying it could not justify the knock-out price being paid by Sanofi for Ablynx, which is developing a prized experimental drug for a rare blood disorder. \nThis month has seen a spike in multibillion-dollar deals in biotech, with U.S.-based Celgene paying $9 billion for cancer specialist Juno Therapeutics, and several experts predicting a bumper year for M&A. \nTotal biotech M&A so far this month now stands at $26.3 billion, or more than 80 percent of the value of all deals in 2016 and far ahead of any comparable January tally in over a decade, according to Thomson Reuters data. \nSuch deals are being driven by the need for large drugmakers to tap the promising new medicines being developed by smaller rivals to help revive flagging growth. \nLast week, Sanofi agreed to buy U.S. haemophilia specialist Bioverativ for $11.6 billion, its biggest deal for seven years and a major play to strengthen its presence in treatments for rare diseases. \nSanofi Chief Executive Officer Olivier Brandicourt said the deals expanded the French company’s late-stage pipeline and strengthened its line-up of treatments for rare blood disorders - but did not necessarily mark the end of its M&A ambitions. \n“We have a strong balance sheet. We generate significant cash flow. We are going to look at opportunities on a case-by-case basis,” he told reporters. \n“We also identified CHC (consumer healthcare) previously as an area where we want to sustain a leadership position and therefore you can expect us to evaluate opportunities.” \nBoth Pfizer and Merck KGaA are currently looking to divest consumer health businesses. \nSanofi, which expects the cost of debt to finance the deal to be around 1 percent, said Ablynx would boost long-term shareholder value, while being neutral for business earnings per share in 2018 and 2019. \nThe Belgian group specializes in the research of novel drugs based on so-called nanobodies found in the immune systems of llamas and alpacas, for which it partners with several of the world’s largest pharmaceutical companies. FILE PHOTO: A logo is seen in front of the entrance at the headquarters French drugmaker Sanofi in Paris October 30, 2014. REUTERS/Christian Hartmann/File Photo EXPERIMENTAL DRUG \nSanofi is already one of Ablynx’s big pharma partners, after striking a deal in July 2017 to find new treatments for inflammatory diseases. \nBy buying the company outright it will now get access to Ablynx’s most promising asset, the experimental drug caplacizumab for treating the blood disease acquired thrombotic thrombocytopenic purpura. \nBrandicourt said caplacizumab would complement Sanofi’s line-up of blood products, following the acquisition of Bioverativ and an earlier deal to obtain global rights for fitusiran from Alnylam. \nSanofi will be able to use its existing infrastructure and the recently acquired platform from Bioverativ to help to commercialize caplacizumab. It will also benefit from some of the other drugs Ablynx is working on, such as an infant anti-viral treatment, that would not have fitted within Novo Nordisk. \nBerenberg analysts said Ablynx was a good fit but they estimated the deal would generate no more than a 4 percent return on invested capital, assuming caplacizumab sales of around 400 million euros by 2023. \nAblynx itself has forecast peak caplacizumab sales of 1.2 billion euros, but Sanofi said it was too early to comment. \nThe rare blood drug was also the main attraction for Novo Nordisk. \nThe Danish group has sat out previous rounds of M&A in the drugs sector to focus on its core diabetes business but it now needs to find new products for its struggling smaller biopharmaceutical unit, where Ablynx would have been a good fit. \nThat remains a challenge for CEO Lars Fruergaard Jorgensen, who took over a year ago, and has previously stated that Novo Nordisk needs external innovation to broaden its product line-up. Related Coverage Novo Nordisk remains on hunt for biopharma deals \nChief Financial Officer Jesper Brandgaard told Reuters Novo Nordisk would continue to hunt for promising assets to boost its blood products business. \nShares in Sanofi were little changed, with pricing considerations offset by relief that Sanofi was finally taking action to improve its drugs portfolio, following its past failure to land big deals. \nSanofi lost out on buying California-based cancer specialist Medivation to Pfizer in 2016, and also missed acquiring Swiss biotech company Actelion, which was bought by Johnson & Johnson last year. \nMorgan Stanley and Lazard advised Sanofi on the deal while JP Morgan advised Ablynx. \n($1 = 0.8055 euros) Additional reporting by Sudip Kar-Gupta in Paris, Teis Jensen and Stine Jacobsen in Copenhagen, and Robert-Jan Bartunek in Brussels; Editing by Louise Heavens, Alexander Smith and Jane Merrmiman", "external_links": [], "published": "2018-01-29T11:07:00.000+02:00", "crawled": "2018-01-29T11:13:58.013+02:00", "highlightTitle": ""}