{"organizations": [], "uuid": "71b28b53375a3d19a8d9e62de8c70724dc1ce9a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226916275&w=1200&r=LYNXMPEE0U0PM", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-anthem-results/u-s-health-insurer-anthems-quarterly-profit-soars-idUSKBN1FK1EB", "country": "US", "domain_rank": 408, "title": "U.S. health insurer Anthem's quarterly profit soars", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T13:08:00.000+02:00", "replies_count": 0, "uuid": "71b28b53375a3d19a8d9e62de8c70724dc1ce9a6"}, "author": "", "url": "https://www.reuters.com/article/us-anthem-results/u-s-health-insurer-anthems-quarterly-profit-soars-idUSKBN1FK1EB", "ord_in_thread": 0, "title": "U.S. health insurer Anthem's quarterly profit soars", "locations": [], "entities": {"persons": [{"name": "ankur banerjee", "sentiment": "none"}, {"name": "martina d'couto", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "bengaluru", "sentiment": "none"}], "organizations": [{"name": "anthem", "sentiment": "negative"}, {"name": "reuters) - anthem inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 11:15 AM / in 34 minutes Anthem promises more 2018 growth and long-term drug savings Reuters Staff 4 Min Read \n(Reuters) - Health insurer Anthem Inc ( ANTM.N ) promised investors 2018 earnings above Wall Street estimates on Wednesday and said plans are on track to save at least $4 billion a year on drug costs by building its own pharmacy benefit management company. \nAnthem shares gained 4 percent, recovering from a decline on Tuesday after three large and influential companies - Amazon Inc ( AMZN.O ), JPMorgan Chase ( JPM.N ) and Berkshire Hathaway ( BRKa.N ) - said they would band together to cut healthcare costs for employees. \nAnthem’s new Chief Executive Officer, Gail Boudreaux, confirmed plans during a call with Wall Street analysts for the company to end its contract with Express Scripts Holding Corp ( ESRX.O ) and to build its own company to manage drug contracting for its members starting Jan. 1, 2021. \nAnthem plans to use CVS Health ( CVS.N ) to help it do so, and said that deal is moving ahead despite CVS’ recent $69 billion agreement to buy Anthem insurance rival Aetna Inc ( AET.N ). Anthem plans to return 20 percent of those savings on a pretax basis to customers. The strategic move was announced by Anthem’s previous CEO, who stepped down last fall. \nAnthem reported fourth-quarter earnings that were ahead of expectations, helped by lower than expected medical costs among Obamacare individual customers that swung that business to profitability for the year. \nAnthem halved the number of markets where it will offer Obamacare individual plans in 2018, citing an uncertain regulatory climate. It expects individual enrollment in both Obamacare compliant and non-Obamacare compliant plans to drop by 950,000 in 2018 from 1.6 million people at the end of 2017, it said Wednesday. \nRepublican President Donald Trump’s administration is working to roll back as much as it can of former President Barack Obama’s Affordable Care Act, often called Obamacare. It is working on rules to expand the use of association health plans, which would be able to offer health insurance that does not comply with Obamacare. \nBoudreaux said she sees opportunity there. “I think, quite frankly, there is a positive for expanding access for consumers across the space, so we’re very supportive of that,” she said during the call. \nThe company said that Trump’s tax overhaul, passed late last year, would add a net benefit of about $2 per share in 2018. \n“The individual business did well and for 2018 they are (forecasting) a tailwind on tax reform and a tailwind for 2019,” Leerink research analyst Ana Gupte said. BEATING EXPECTATIONS \nAnthem reported earnings outside of items of $1.29 per share, ahead of analysts’ expectation of $1.27. \nAnthem, which also raised its quarterly dividend by 7.1 percent to 75 cents per share, said it expects 2018 adjusted earnings to be greater than $15 per share. \nAnalysts were expecting earnings of $14.07, according to Thomson Reuters I/B/E/S. \nAnthem said net income rose to $1.23 billion, or $4.67 per share, in the fourth quarter ended Dec. 31, from $368.4 million, or $1.37 per share, a year earlier. \nThe company recorded a one-time benefit of $1.1 billion due to the new U.S. tax law. Related Coverage", "external_links": [], "published": "2018-01-31T13:08:00.000+02:00", "crawled": "2018-01-31T13:25:13.008+02:00", "highlightTitle": ""}