{"organizations": [], "uuid": "9981b99470a138b6cc77daf35e7b41f88720d740", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/business-wire-calstrs-director-of-corporate-governance-set-to-retire.html", "country": "US", "domain_rank": 767, "title": "CalSTRS Director of Corporate Governance Set to Retire", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T01:37:00.000+02:00", "replies_count": 0, "uuid": "9981b99470a138b6cc77daf35e7b41f88720d740"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/business-wire-calstrs-director-of-corporate-governance-set-to-retire.html", "ord_in_thread": 0, "title": "CalSTRS Director of Corporate Governance Set to Retire", "locations": [], "entities": {"persons": [{"name": "anne sheehan", "sentiment": "negative"}, {"name": "christopher j. ailman", "sentiment": "none"}, {"name": "sheehan", "sentiment": "none"}], "locations": [{"name": "calif", "sentiment": "none"}, {"name": "sacramento", "sentiment": "none"}], "organizations": [{"name": "calstrs", "sentiment": "negative"}, {"name": "california state teachers’ retirement system", "sentiment": "none"}, {"name": "lehman brothers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Anne Sheehan was the pension fund’s first ever corporate governance director\nWEST SACRAMENTO, Calif.--(BUSINESS WIRE)-- The California State Teachers’ Retirement System’s Director of Corporate Governance, Anne Sheehan, announced that she will retire March 30, 2018 after 10 years at the helm of the division.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180118006460/en/\nAnne Sheehan, CalSTRS Director of Corporate Governance. (Photo: Business Wire)\nMs. Sheehan was hired in 2008 as CalSTRS’ first director of corporate governance by Chief Investment Officer Christopher J. Ailman—the Monday after Lehman Brothers went over the cliff. Her mission was to both protect and advance shareholder rights as a result of the financial crisis. One of Ms. Sheehan’s first steps was to form a financial reform working group with fellow pension funds. This group set to work securing corporate governance process changes to subsequent Dodd-Frank legislation, passed in 2010.\nMs. Sheehan built a team which manages a $4.1 billion portfolio. While managing a staff and a multi-billion dollar portfolio, she was board chair of the Council of Institutional Investors and served on the boards of the International Corporate Governance Network and the NASDAQ Listing Council. She is currently the chair of the SEC Investor Advisory Committee. Ms. Sheehan is also a founder of the Investor Stewardship Group that launched the Framework for U.S. Stewardship and Governance principles.\n“Anne has been my most unconventional, best hire,” said Mr. Ailman. “She’s conversant in the language of the regulatory, legal, corporate and investment worlds. Her networking and leadership abilities know no bounds. Anne relates well no matter what an individual’s ideology is—labor versus management; conservative versus liberal; Democrat versus Republican—whatever it takes to get the job done.”\n“It has been an honor and a privilege to advance the fight for stronger shareholder rights on behalf of California’s teachers,” said Ms. Sheehan. “The success of our board diversity, majority vote and executive compensation efforts was really the tip of the iceberg in terms of what I wanted to accomplish here. I feel so lucky to have had the opportunity to propel environmental, social and governance disclosure into the mainstream of shareholder issues.”\nMr. Ailman continued, “I am so very proud of all that Anne has done. I gave her a mission and then got out of her way. Anne’s energy, acumen and passion for our mission have not only propelled CalSTRS to the global forefront of corporate governance, it has also trickled down to her staff. She’s leaving behind a solid team ready to step into her shoes—or at least one shoe—she really is irreplaceable. Anne is extraordinary and has positioned CalSTRS at number one in the US and top in the world in corporate governance.”\nCalSTRS will begin a search for Ms. Sheehan’s replacement via a competitive recruitment process.\nAbout CalSTRS\nThe California State Teachers’ Retirement System , with a portfolio valued at $225.3 billion as of December 31, 2017, is the largest educator-only pension fund in the world. CalSTRS serves California’s more than 933,000 public school educators and their families from the state’s 1,700 school districts, county offices of education and community college districts. After more than 25 years of service and with a median retirement age of 62.9, CalSTRS members’ average monthly pension is $4,475—with no Social Security eligibility. CalSTRS administers a hybrid system of a combined traditional defined benefit, cash balance and voluntary defined contribution plan. CalSTRS also provides disability and survivor benefits.\nSee how CalSTRS demonstrates its strong commitment to long-term corporate sustainability principles in its annual Global Reporting Initiative sustainability report: Global Stewardship at Work\nFollow us on Twitter @CalSTRS\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180118006460/en/\nCalifornia State Teachers’ Retirement System\nMichael Sicilia, 916-414-1440\nNewsroom@calstrs.com\nwww.CalSTRS.com\nSource: California State Teachers’ Retirement System", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.calstrs.com%2F&esheet=51745703&newsitemid=20180118006460&lan=en-US&anchor=California+State+Teachers%27+Retirement+System&index=2&md5=560b2896894de2dfa66163de2e47806d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.calstrs.com%2Freport%2F2015-16-sustainability-report&esheet=51745703&newsitemid=20180118006460&lan=en-US&anchor=Global+Stewardship+at+Work&index=3&md5=573b16b616b2e64d6fadab1fedfb261e", "http://www.businesswire.com/news/home/20180118006460/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.CalSTRS.com&esheet=51745703&lan=en-US&anchor=www.CalSTRS.com&index=5&md5=11d6c9c3b6153d59d40ee02aa097cd37", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.isgframework.org%2F&esheet=51745703&newsitemid=20180118006460&lan=en-US&anchor=Investor+Stewardship+Group&index=1&md5=778a4eb4e1ba164b9fc3e5584f91c99c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2FCalSTRS&esheet=51745703&newsitemid=20180118006460&lan=en-US&anchor=%40CalSTRS&index=4&md5=0bd5855132fc1ca537a94ade64ac824e"], "published": "2018-01-19T01:37:00.000+02:00", "crawled": "2018-01-19T02:34:42.005+02:00", "highlightTitle": ""}