{"organizations": [], "uuid": "41545e7b25b76c817b8c481edff5b0deb5c3f0ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/globe-newswire-lsi-industries-inc-to-initiate-quarterly-conference-calls-to-discuss-business-results.html", "country": "US", "domain_rank": 767, "title": "LSI Industries Inc. to Initiate Quarterly Conference Calls to Discuss Business Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-12T16:57:00.000+02:00", "replies_count": 0, "uuid": "41545e7b25b76c817b8c481edff5b0deb5c3f0ae"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/globe-newswire-lsi-industries-inc-to-initiate-quarterly-conference-calls-to-discuss-business-results.html", "ord_in_thread": 0, "title": "LSI Industries Inc. to Initiate Quarterly Conference Calls to Discuss Business Results", "locations": [], "entities": {"persons": [{"name": "james", "sentiment": "none"}, {"name": "jim) e. galeese", "sentiment": "none"}, {"name": "dennis w. wells", "sentiment": "none"}], "locations": [{"name": "cincinnati", "sentiment": "none"}], "organizations": [{"name": "lsi industries inc.", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CINCINNATI, Jan. 12, 2018 (GLOBE NEWSWIRE) -- LSI Industries Inc. (NASDAQ:LYTS) today announced that the Company will initiate quarterly conference calls to discuss business results commencing with the second quarter fiscal 2018 earnings release. Second quarter results will be released on January 25, 2018 prior to market open, followed by the quarterly call at 10:00 a.m. EST.\nDennis W. Wells, Chief Executive Officer and President, and James (Jim) E. Galeese, Executive Vice President and Chief Financial Officer, will host the conference call, which will contain forward looking statements and other material information.\nAccess to the live Webcast will be available via the Investor Relations page of the Company’s website:\nhttp://www.lsi-industries.com\nA replay of the Webcast will be posted to the Investor Relations page of the Company’s website shortly after the completion of the conference call, where it will be archived for twelve months.\n\"Safe Harbor\" Statement under the Private Securities Litigation Reform Act of 1995\nThis document contains certain forward-looking statements that are subject to numerous assumptions, risks or uncertainties. The Private Securities Litigation Reform Act of 1995 provides a safe harbor for forward-looking statements. Forward-looking statements may be identified by words such as “estimates,” “anticipates,” “projects,” “plans,” “expects,” “intends,” “believes,” “seeks,” “may,” “will,” “should” or the negative versions of those words and similar expressions, and by the context in which they are used. Such statements, whether expressed or implied, are based upon current expectations of the Company and speak only as of the date made. Actual results could differ materially from those contained in or implied by such forward-looking statements as a result of a variety of risks and uncertainties over which the Company may have no control. These risks and uncertainties include, but are not limited to, the impact of competitive products and services, product demand and market acceptance risks, potential costs associated with litigation and regulatory compliance, reliance on key customers, financial difficulties experienced by customers, the cyclical and seasonal nature of our business, the adequacy of reserves and allowances for doubtful accounts, fluctuations in operating results or costs whether as a result of uncertainties inherent in tax and accounting matters or otherwise, failure of an acquisition or acquired company to achieve its plans or objectives generally, unexpected difficulties in integrating acquired businesses, the ability to retain key employees of acquired businesses, unfavorable economic and market conditions, the results of asset impairment assessments, the ability to maintain an effective system of internal control over financial reporting, the ability to remediate any material weaknesses in internal control over financial reporting and any other risk factors that are identified herein. You are cautioned to not place undue reliance on these forward-looking statements. In addition to the factors described in this paragraph, the risk factors identified in our Form 10-K and other filings the Company may make with the SEC constitute risks and uncertainties that may affect the financial performance of the Company and are incorporated herein by reference. The Company does not undertake and hereby disclaims any duty to update any forward-looking statements to reflect subsequent events or circumstances.\nAbout the Company\nWe are a customer-centric company that positions itself as a value-added, trusted partner in developing superior image solutions through our world-class lighting, graphics, and technology capabilities. Our core strategy of \"Lighting + Graphics + Technology = Complete Image Solutions\" differentiates us from our competitors.\nWe are committed to advancing solid-state LED technology to make affordable, high performance, energy-efficient lighting and custom graphic products that bring value to our customers. We have a vast offering of innovative solutions for virtually any lighting or graphics application. In addition, we provide sophisticated lighting and energy management control solutions to help customers manage their energy performance. Further, we provide a full range of design support, engineering, installation and project management services to our customers.\nWe are a vertically integrated U.S.-based manufacturer concentrating on serving customers in North America and Latin America. Our major markets include commercial / industrial lighting, petroleum / convenience store and multi-site retail (including automobile dealerships, restaurants and national retail accounts). Headquartered in Cincinnati, Ohio, LSI has facilities in Ohio, California, Kentucky, New York, North Carolina and Texas. The Company’s common shares are traded on the NASDAQ Global Select Market under the symbol LYTS.\nFor further information, contact Dennis Wells, Chief Executive Officer and President, at (513) 793-3200.\nAdditional note: Today’s news release, along with past releases from LSI Industries, is available on the Company’s internet site at www.lsi-industries.com or by email or fax, by calling the Investor Relations Department at (513) 793-3200.\nCONTACT: DENNIS WELLS or JIM GALEESE (513) 793-3200\nSource:LSI Industries Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=q1rRC3eDsBx7pcEtTuf4pwlop-IMjyTk2osPdYEMW7HIVufhREoTRad4ZGJ8ufVvJCnzegdPRG_DjDWnBcuqh98_99rIPpFex_JdTsREIyQ=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/0023f1e7-5543-4c82-83eb-378980391de1", "https://www.globenewswire.com/Tracker?data=6ITx5kGu1ZaSLPupX_DlSoc1cSlh3hjb0qh6XSRlO3nIdzV8_swR66LpnCzFRKr4DikdzYQIRbDuTjEhsqYvS250DnYxVBQXJsZcWodiYHU="], "published": "2018-01-12T16:57:00.000+02:00", "crawled": "2018-01-12T17:56:11.000+02:00", "highlightTitle": ""}