{"organizations": [], "uuid": "3450da327f8fb413d63088e7f85c5cdaffe23f54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/12/09/104157799-GettyImages-460496906.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/19/iea-us-could-topple-russia-saudi-arabia-as-worlds-largest-oil-producer.html", "country": "US", "domain_rank": 767, "title": "IEA: US could topple Russia, Saudi Arabia as world's largest oil producer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T11:00:00.000+02:00", "replies_count": 0, "uuid": "3450da327f8fb413d63088e7f85c5cdaffe23f54"}, "author": "Sam Meredith", "url": "https://www.cnbc.com/2018/01/19/iea-us-could-topple-russia-saudi-arabia-as-worlds-largest-oil-producer.html", "ord_in_thread": 0, "title": "IEA: US could topple Russia, Saudi Arabia as world's largest oil producer", "locations": [], "entities": {"persons": [], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "iea", "sentiment": "none"}, {"name": "international energy agency", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The U.S. is well-placed to overtake the likes of Saudi Arabia and Russia as the world's leading energy producer over the next 12 months, according to the latest monthly report from the International Energy Agency (IEA).\n\"This year promises to be a record-setting one for the U.S.,\" the IEA said in its closely-watched report published Friday.\n\"Relentless growth should see the U.S. hit historic highs above 10 million barrels a day (in production), overtaking Saudi Arabia and rivaling Russia during the course of 2018 — provided OPEC and non-OPEC restraints remain in place,\" the Paris-based organization added.\n'Unchartered waters' The latest monthly report from the IEA comes at a time when crude futures have climbed to highs not seen since the early days of a slump in December 2014. Brent crude futures hit a peak of $70.37 a barrel on Monday, with the global benchmark since paring some of its recent gains to trade at $68.69 on Friday morning.\n\"What we are trying to understand is the responsiveness of the U.S. shale producers. And because of the dynamism of the industry, the innovation and the vast number of players in that space … to some extent, we are in unchartered waters,\" Neil Atkinson, head of the oil industry and markets division at the IEA, told CNBC on Friday.\nAtkinson said that given the recent rally in oil prices, the IEA was expecting a \"wave of new production\" from the U.S. in the coming months. He added OPEC would then need to \"accommodate\" for that and make its own judgment at its next meeting in June as to what its response should be.\nshow chapters IEA’s Atkinson: Low Venezuelan oil production hastens market rebalancing 10 Hours Ago | 02:09 The main price driver has been a supply cut from major oil producing group OPEC and Russia, who started to withhold output in January last year. The production cuts by OPEC and 10 other allied producers, which are scheduled to last throughout 2018, are aimed at clearing a supply overhang and propping up prices.\nOne of the main beneficiaries of these cuts is the producers' major competitor, U.S. shale oil. U.S. oil producers are staging a dramatic comeback amid a recovering oil price that has allowed many of them to restart operations.\nUS 'beat all expectations' in 2017 U.S. crude production stands at 9.9 million barrels a day, according to the IEA, which is the country's highest level in almost 50 years. That level of supply puts the U.S. neck-and-neck with OPEC kingpin Saudi Arabia — the world's second-largest producer after Russia.\n\"The stage was set for a strong expansion last year, when non-OPEC supply, led by the U.S., returned to growth of 0.7 million barrels a day and pushed up world production despite OPEC and non-OPEC cuts,\" the IEA said.\n\"U.S. growth of 0.6 million barrels a day in 2017 beat all expectations, even with a moderate price response to the output deal as the shale industry bounced back — profiting from cost cuts, stepped up drilling activity and efficiency measures enforced during the downturn,\" the group said.\nBrittany Sowacke | Bloomberg | Getty Images A worker prepares to lift drills by pulley in the Permian basin outside of Midland, Texas. In recent years, America's unprecedented oil and gas boom has been driven by one factor above all others — and that's shale. The so-called shale revolution could help to alleviate Washington's reliance on foreign oil, including from turbulent Middle Eastern states, while also supporting a bid to export to more countries around the world.\nThe IEA's estimates of global oil product demand in 2017 and 2018 were left roughly unchanged at 97.8 million barrels a day and 99.1 million barrels a day, respectively.\nThe price of oil collapsed from near $120 a barrel in June 2014 due to weak demand, a strong dollar and booming U.S. shale production. OPEC's reluctance to cut output was also seen as a key reason behind the fall. But, the oil cartel soon moved to curb production — along with other oil producing nations — in late 2016.", "external_links": [], "published": "2018-01-19T11:00:00.000+02:00", "crawled": "2018-01-19T11:32:57.023+02:00", "highlightTitle": ""}