{"organizations": [], "uuid": "090351a545d0dbace5fde250351a72fe5d2946b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-royale-energy-holdings-inc-elects-board.html", "country": "US", "domain_rank": 767, "title": "Royale Energy Holdings, Inc. Elects Board", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T15:44:00.000+02:00", "replies_count": 0, "uuid": "090351a545d0dbace5fde250351a72fe5d2946b2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-royale-energy-holdings-inc-elects-board.html", "ord_in_thread": 0, "title": "Royale Energy Holdings, Inc. Elects Board", "locations": [], "entities": {"persons": [{"name": "harry e. hosmer", "sentiment": "none"}], "locations": [{"name": "san diego", "sentiment": "none"}, {"name": "east los angeles", "sentiment": "none"}, {"name": "sansinena", "sentiment": "none"}, {"name": "royale", "sentiment": "none"}], "organizations": [{"name": "royale energy holdings", "sentiment": "neutral"}, {"name": "royale energy holdings, inc", "sentiment": "neutral"}, {"name": "board", "sentiment": "none"}, {"name": "matrix oil management corporation", "sentiment": "none"}, {"name": "royale energy, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO, Jan. 16, 2018 (GLOBE NEWSWIRE) -- Royale Energy Holdings (“ Holdings ”) (OTCQB:ROYL) has announced that it has elected seven members to its board of directors. The directors were named pursuant to the vote of the respective shareholder as proposed in the merger between Royale Energy, Inc. (“Royale”), and Matrix Oil Management Corporation (“Matrix”), and their related entities. The seating of the directors is the next step toward the conclusion of the approved merger, and the purchase of the remaining 50% non-operated working interest in oil and gas leases in the Sansinena and East Los Angeles fields operated by Matrix. Each of the seven board members were named in the Amended and Restated Merger Agreement between Royale and Matrix, which is now slated to close on January 31, 2018.\nThe following summarizes the business experience of each director and executive officer for the past five years.\nHarry E. Hosmer – Chairman of the Board and Director\nHarry E. Hosmer has served as chairman of Royale since he founded the company in 1986. From inception until June 1995, he also served as president and chief executive officer. Mr. Hosmer will serve as chairman of Holdings until the first annual shareholders meeting, at which time he will retire as chairman and assume the title of chairman emeritus.\nJonathan Gregory – Chief Executive Officer and Director\nMr. Gregory was appointed Royale’s chief executive officer on September 10, 2015. Prior to becoming Royale’s CEO, Mr. Gregory, from March 2014 to July 2015, served as chief financial officer for Americo Energy Resources, a private exploration and production company located in Houston, Texas. Prior to serving as CFO of Americo Energy, Mr. Gregory, from April 2012 to February 2014 was CFO of J&S Oil & Gas, LLC. From December 2004 to April 2012, Mr. Gregory was head of the energy lending group in Houston, Texas for Texas Capital Bank, N.A. Mr. Gregory is a member of Houston Energy Finance Group; and ADAM Houston Energy Network. He is also a co-founder of Bread of Life, Inc., a non-profit organization committed to empowering homeless Houstonians, and a past director of Small Steps Nurturing Center, a non-profit Christian organization that provides early childhood education for economically at-risk children in the inner-city of Houston, Texas. Mr. Gregory graduated from Lamar University in 1986 with a Bachelor’s degree in Finance.\nJohnny Jordan – Chief Operating Officer and Director\nMr. Jordan is a petroleum engineer with expertise in acquisitions, field economics and reserves analysis, bank negotiations, reservoir and field operations, and multi-team interaction. Mr. Jordan serves on the Board of Directors of Matrix. Mr. Jordan has been active in the oil and gas industry since 1980 beginning as a floor hand on a well service rig. He has held various staff and supervisory positions for Exxon, Mack Energy, Enron Oil and Gas and Venoco Corporation. He was the team leader of a multi-discipline team from 1992 to 1996 that added 455 BCF and 79 MMCFD through acquisitions (71 BCF) and field development (365 wells) in the Val Verde Basin in West Texas. Mr. Jordan has managed acquisition evaluations in many of the oil and gas producing basins in the US. He has coordinated field development for various recovery mechanisms that include waterflood, tertiary flood, water drive oil and gas reservoirs, and pressure depletion fields with gas cap expansion or gravity drainage. Mr. Jordan received a B.S. in Chemical Engineering from the University of Oklahoma in 1983 and is currently a member of the Society of Petroleum Engineers and the American Petroleum Institute.\nRonald B. Verdier – Director\nMr. Verdier was appointed to the board in 2015. Mr. Verdier is a retired banker who began his career in banking in 1968. He served as an employee and officer of Mercantile Trust & Savings Bank, Quincy, Illinois, for thirty-three years, ending as Senior Vice President. In 2002, Mr. Verdier retired from Mercantile Trust & Savings Bank and became President of Hannibal National Bank, Hannibal Missouri, where he served until his retirement in 2012. Mr. Verdier is a graduate of the School of Banking at the University of Wisconsin, Madison, and of the School of Banking at the University of Oklahoma.\nRonald L. Buck – Director\nMr. Buck was elected to the board in 2015. Mr. Buck received a Bachelor of Science degree in Marketing and a Minor in Geology and Economics from Northwestern University. After building his business into a large scale distribution company, he sold the company to his two sons in 1992. Since his retirement in 1992, he has been in finance and managing family assets including oil and gas wells and oil gathering pipeline investments. For the past five years, he has actively managed two limited liability companies for his family which are involved in real estate, rental properties, leasing equipment, oil and gas properties and pipelines. In this capacity, he also travels extensively to financial meetings and is a member of the National Association of Financial Advisors.\nRod Eson – Director\nMr. Eson is the chief executive officer of Foothill Energy, LLC, a position he has held since he founded Foothill Energy in 2004. Foothill owns and operates oil and gas properties in the central and northern valleys of California. Mr. Eson has owned and operated oil and gas production companies as well as oilfield service companies since 1979. From 2006 to 2014, he was chairman of the board of Enhanced Oil Resources, Inc. Prior to forming Foothill Energy in June 2004, Mr. Eson was president and chief executive officer of Venoco, Inc., a California based independent oil and gas company he cofounded in 1992. At the time of Mr. Eson’s sale of his interest in Venoco, it held assets in excess of $400 million in California, Texas, Mississippi, Colorado and Argentina.\nMr. Eson is the former chairman of the board of the California Independent Petroleum Association and has been a member of the Society of Petroleum Engineers and American Petroleum Institute for more than three decades. He is also a member of the Texas Independent Producers and Royalty Owners Association and a member of the board of directors of the Independent Petroleum Association of America. He received a B.S. in Mechanical Engineering from California State Polytechnic University in Pomona, California.\nGabriel L. Ellisor – Director\nMr. Ellisor retired from Three Rivers Operating Company II in February 2015, and since that time has managed his private investments. From July 2012 to February 2015, he served as chief financial officer of Three Rivers Operating Company II. Mr. Ellisor also served as the Chief Financial Officer for Three Rivers Operating Company I from 2010 to 2012. Both Three Rivers entities were private equity companies backed by Riverstone Holdings. Built as acquisition vehicles focused in the Permian Basin, both Three Rivers I and II were built and sold in less than five years for aggregate proceeds totaling over $2.25 billon. Prior to joining Three Rivers, Mr. Ellisor was a principal at Rivington Capital Advisors from 2008 to 2010, a boutique investment banking firm that specializes in raising private capital and providing merger and acquisition advisory services for the energy and production sector. From April 2016 to the present, Mr. Ellisor has served as director and chairman of the audit committee of SilverBow Resources (NYSE:SBOW), an independent", "external_links": ["https://www.globenewswire.com/Tracker?data=F_-bDEi88L0jirGwluGm2vUROwdq2zjg76vHI_YxaayTLAnwqmt6x5bhmv3HDS2V", "https://www.globenewswire.com/Tracker?data=ygru9X8E-wWcWz98LUPxcT-uxdAygXhEI54LPLxHN0axkFwjck8j9JOwKJxStY7XBj6K3qyECx4wksZO17_z0g=="], "published": "2018-01-16T15:44:00.000+02:00", "crawled": "2018-01-16T16:15:35.031+02:00", "highlightTitle": ""}