{"organizations": [], "uuid": "2be7053a07a90e75bcbe4a5a4d72505c198a2b16", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/05/gettyimages-454662416.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/17/tiffany-sales-2/", "country": "US", "domain_rank": 1196, "title": "Tiffany Reports Strong Holiday Season but Warns of Big Investments | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.621, "site_type": "news", "published": "2018-01-17T02:00:00.000+02:00", "replies_count": 0, "uuid": "2be7053a07a90e75bcbe4a5a4d72505c198a2b16"}, "author": "Phil Wahba", "url": "http://fortune.com/2018/01/17/tiffany-sales-2/", "ord_in_thread": 0, "title": "Tiffany Reports Strong Holiday Season but Warns of Big Investments | Fortune", "locations": [], "entities": {"persons": [{"name": "tiffany", "sentiment": "none"}, {"name": "brad barket", "sentiment": "none"}, {"name": "phil wahba", "sentiment": "none"}], "locations": [{"name": "soho", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}], "organizations": [{"name": "not enough yet tiffany & co", "sentiment": "negative"}, {"name": "tiffany reports strong holiday season but warns of big investments | fortune tiffany & co", "sentiment": "negative"}, {"name": "tiffany & co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tiffany & Co Had a Sterling Holiday Season but It's Not Enough Yet Tiffany & Co. Soho on September 4, 2014 in New York City. Photograph by Brad Barket—Getty Images By Phil Wahba January 17, 2018 \nTiffany & Co (tif) had a decent holiday season, putting it on track to snap a long sales losing streak, but the jeweler acknowledged it still has work to do. \nThe NewYork-based company, famed for its Fifth Avenue flagship and blue boxes, said on Tuesday that comparable sales excluding the effect of currency rose 3% in November and December, a much better performance than a year earlier when they fell 1%. Most encouraging for Tiffany was that the improvements were broad, from items in its new home and accessories collection such as $450 rulers (which sold out and created a ton of buzz around the brand) to its fashion and high-end jewelry. Business in most regions was also good though wedding jewelry was a weaker point. \nThe results must come as a relief for Tiffany as they put the company on pace to post its first quarter of comparable sales growth in just over two years. (Comparable sales exclude newly closed or open stores and are often a more reliable gauge of a retailer’s sales performance than total sales.) To be sure, Tiffany had some wind in its sails compared to a year earlier such as a more favorable consumer environment—the National Retail Federation said that U.S. retail spending was up 5.5% in the 2017 holiday season, the best performance in almost a decade—and no longer contending with a hit to sales at the Manhattan flagship for a few weeks after President Trump’s election in late 2016. \nAt the same time, Tiffany said in its report that its 2018 profit could be lower than 2017’s despite sales growth because of the need for”increased levels of spending in a number of areas, including technology, marketing communications, visual merchandising, digital, and store presentation.” And that shows keen corporate self-awareness. Indeed, Tiffany shares rose after initial declines early on Wednesday. \nTiffany is emerging from a difficult period of lackluster sales, last summer it hired Alessandro Bogliolo as CEO , replacing a chief who’d been in his post barely more than a year. Tiffany executives had recognized the slow pace at the company, and Bogliolo’s mandate has been to speed up innovation in its jewelry lines and win over more young shoppers with fresher product and product presentation. He is also tasked with building up Tiffany’s e-commerce, which generates only about 6% of sales. But the newfound momentum, stoked by the first real boost from fashion designer Reed Krakoff work to refresh Tiffany’s merchandise, will require the investments Tiffany says it will make to be sustainable. \nThough they are far from being Tiffany rivals, both Walmart (wmt) and Target (tgt) have in recent years taken steps back and sacrificed profit to make investments that so far are proving wise and have lifted their performances. \nAs Bogliolo put it in the sales report. “While we are encouraged with the holiday sales results, we believe that the preceding negative comparable store sales trend can only be reversed on a sustainable basis by continuing to evolve our product offerings and customer experience and also by stepping up certain strategic spending in our business,” he said. \n", "external_links": [], "published": "2018-01-17T02:00:00.000+02:00", "crawled": "2018-01-18T05:28:28.003+02:00", "highlightTitle": ""}