{"organizations": [], "uuid": "1dedfa0c3b4bf3e4621a778464cbf0618552246f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-first-citizens-bancshares-reports-earnings-for-fourth-quarter-2017.html", "country": "US", "domain_rank": 767, "title": "First Citizens BancShares Reports Earnings for Fourth Quarter 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T19:30:00.000+02:00", "replies_count": 0, "uuid": "1dedfa0c3b4bf3e4621a778464cbf0618552246f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-first-citizens-bancshares-reports-earnings-for-fourth-quarter-2017.html", "ord_in_thread": 0, "title": "First Citizens BancShares Reports Earnings for Fourth Quarter 2017", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "RALEIGH, N.C., Jan. 31, 2018 (GLOBE NEWSWIRE) -- First Citizens BancShares Inc. (BancShares) (Nasdaq:FCNCA) reports earnings for the quarter ended December 31, 2017. Net income for the fourth quarter of 2017 was $54.4 million, or $4.53 per share, compared to $52.7 million, or $4.39 per share, for the corresponding period of 2016, and $67.1 million, or $5.58 per share, for the third quarter of 2017, according to Frank B. Holding, Jr., chairman of the board. BancShares’ current quarter results generated an annualized return on average assets of 0.62 percent and an annualized return on average equity of 6.48 percent, compared to respective returns of 0.77 percent and 8.10 percent for the third quarter of 2017 and 0.63 percent and 6.86 percent for the fourth quarter of 2016. Earnings in the fourth quarter of 2017 included income tax expense of $25.8 million due primarily to the re-measurement of deferred taxes as a result of the Tax Cuts and Jobs Act (Tax Act).\nFor the years ended December 31, 2017 and 2016, net income was $323.8 million, or $26.96 per share, and $225.5 million, or $18.77 per share, respectively. Returns on average assets and average equity were 0.94 percent and 10.10 percent during 2017, compared to 0.70 percent and 7.51 percent during 2016. Earnings in 2017 included pre-tax gains of $134.7 million recognized in connection with the FDIC-assisted transactions of Harvest Community Bank (HCB) of Pennsville, New Jersey, and Guaranty Bank (Guaranty) of Milwaukee, Wisconsin. Earnings in 2016 included $26.7 million in investment securities gains, $16.6 million of pre-tax income due to the early termination of certain FDIC shared-loss agreements and pre-tax gains of $5.8 million recognized in connection with the FDIC-assisted transactions of North Milwaukee State Bank (NMSB) of Milwaukee, Wisconsin, and First CornerStone Bank (FCSB) of King of Prussia, Pennsylvania.\nMERGER AGREEMENT WITH HOMEBANCORP INC.\nOn December 18, 2017, BancShares' bank subsidiary, First-Citizens Bank & Trust Company (First Citizens Bank), and HomeBancorp, Inc. (HomeBancorp) entered into a definitive merger agreement. The agreement provides for the acquisition of Tampa, Florida-based HomeBancorp by First Citizens Bank. Under the terms of the agreement, cash consideration of $15.03 will be paid to the shareholders of HomeBancorp for each share of HomeBancorp's common stock. The transaction is expected to close no later than the third quarter of 2018, subject to the receipt of regulatory approvals and the approval of HomeBancorp’s shareholders. As of September 30, 2017, HomeBancorp reported $954.9 million in consolidated assets, $699.4 million in deposits and $637.5 million in loans.\nINCOME TAXES\nIncome tax expense totaled $68.7 million in the fourth quarter of 2017, up from $36.6 million and $28.4 million in the third quarter of 2017 and fourth quarter of 2016, respectively. Effective tax rates were 55.8 percent, 35.3 percent and 35.0 percent during the respective periods. The increases in income tax expense and effective tax rate during the fourth quarter were primarily due to the impact of the Tax Act, which was enacted on December 22, 2017. Earnings in the fourth quarter of 2017 included income tax expense of $25.8 million due primarily to the re-measurement of deferred taxes as a result of the Tax Act reducing the federal tax rate to 21 percent effective January 1, 2018.\nFINANCIAL HIGHLIGHTS\nLoans grew by $447.8 million during the fourth quarter as a result of originated portfolio growth and by $1.86 billion for the year, reflecting originated portfolio growth and the HCB and Guaranty acquisitions. The allowance for loan losses as a percentage of total loans declined to 0.94 percent during the fourth quarter compared to 1.00 percent and 1.01 percent at September 30, 2017 and December 31, 2016, respectively, primarily due to favorable experiences in certain loan loss factors. Net interest income increased $1.6 million, or by 0.6 percent compared to the third quarter of 2017 and $30.9 million, or by 12.6 percent, compared to the fourth quarter of 2016. The increase from the fourth quarter of 2016 was primarily due to originated loan growth and higher interest income earned on non-purchased credit impaired (non-PCI) loans, investment securities and overnight investments. The taxable-equivalent net interest margin was 3.34 percent in the fourth quarter of 2017, an increase of 20 basis points from the same quarter in the prior year, primarily due to improved loan and investment yields and higher loan balances. BancShares remained well-capitalized at December 31, 2017, under Basel III capital requirements with a Tier 1 risk-based capital ratio and common equity Tier 1 ratio of 12.88 percent, total risk-based capital ratio of 14.21 percent and leverage capital ratio of 9.47 percent.\nLOANS AND DEPOSITS\nLoans at December 31, 2017, were $23.60 billion, a net increase of $447.8 million compared to September 30, 2017, representing growth of 7.7 percent on an annualized basis. Originated loan growth was $518.9 million, primarily due to continued growth in the commercial and residential mortgage portfolio. Purchased credit impaired (PCI) loans decreased by $71.1 million, primarily as a result of loan runoff.\nLoan balances during 2017 increased by a net $1.86 billion, or 8.6 percent, since December 31, 2016. This increase was primarily driven by $1.46 billion of organic growth in the non-PCI portfolio and the addition of $447.7 million in non-PCI loans from the Guaranty acquisition. The PCI portfolio declined over this period by $46.2 million, as a result of continued loan runoff of $208.8 million, offset by net loans acquired from Guaranty and HCB, which were $97.6 million and $65.0 million, respectively, at December 31, 2017.\nAt December 31, 2017, deposits were $29.27 billion, a decrease of $67.7 million, or by 0.2 percent, since September 30, 2017. The decrease was due to run-off in time deposits and lower demand deposit account balances, offset by organic growth in money market accounts and interest-bearing savings and checking accounts. Deposits increased by $1.10 billion, or 3.9 percent, since December 31, 2016, due to organic growth of $553.4 million primarily in demand deposit account balances, interest-bearing savings and checking accounts, and the deposit balances from the Guaranty and HCB acquisitions of $541.3 million and $10.3 million, respectively, at December 31, 2017. This increase was offset by continued runoff in time deposits and lower money market account balances.\nALLOWANCE AND PROVISION FOR LOAN AND LEASE LOSSES\nThe allowance for loan and lease losses was $221.9 million at December 31, 2017, a decrease of $9.9 million since September 30, 2017, and a decrease of $3.1 million since December 31, 2016. The allowance as a percentage of total loans at December 31, 2017, was 0.94 percent, compared to 1.00 percent and 1.01 percent at September 30, 2017, and December 31, 2016, respectively.\nBancShares recorded a net provision credit of $2.8 million for loan and lease losses during the fourth quarter of 2017, and net provision expense of $7.9 million and $16.0 million for the third quarter of 2017 and fourth quarter of 2016, respectively.\nNon-PCI loan provision credit was $172 thousand for the fourth quarter of 2017, compared to provision expense of $8.5 million and $13.9 million for the third quarter of 2017 and fourth quarter of 2016, respectively. The PCI loan portfolio provision credit was $2.6 million during the fourth quarter of 2017, compared to a net provision credit of $537 thousand and a provision expense of $2.1 million during the third quarter of 2017 and fourth quarter of 2016, respectively. The total net provision credit in the current quarter was primarily due to favorable experiences in certain loan loss factors.\nNONPERFORMING ASSETS\nAt December 31, 2017, BancShares’ nonperforming assets, including nonaccrual loans and other real estate owned (OREO), were $144.3 million, down from $145.1 million and $147.0 million at September 30, 2017, and December 31, 2016, respectively. The decrease from September 30, 2017, was due to a $2.9 million decline in OREO balances, offset by a $2.1 million increase in nonaccrual loans. The decrease from December 31, 2016, was due to a $10.1 million decline in OREO balances as a result of problem asset resolutions, offset by a $7.4 million increase in nonaccrual loans, primarily in residential and revolving mortgage loans. The ratio of nonperforming assets to total loans, leases and other real estate owned was 0.61 percent, 0.63 percent and 0.67 percent at December 31, 2017, September 30, 2017, and December 31, 2016, respectively.\nNET INTEREST INCOME\nNet interest income increased $1.6 million, or by 0.6 percent, to $274.8 million from the third quarter of 2017. The increase was primarily due to a $1.6 million increase in investment securities interest income due to improved yields and portfolio growth.\nNet interest income increased $30.9 million, or by 12.6 percent, from the fourth quarter of 2016. The increase was primarily due to higher non-PCI loan interest income of $21.0 million as a result of originated loan growth and the contribution from the Guaranty acquisition, a $5.7 million improvement in interest income earned on investments and a $3.7 million increase in interest income earned on excess cash held in overnight investments. Interest income earned on overnight investments was positively impacted by three 25 basis point increases in the federal funds rate since the fourth quarter of 2016. These favorable impacts were offset by an increase in interest expense of $324 thousand primarily related to higher rates paid on short-term borrowings.\nThe taxable-equivalent net interest margin was 3.34 percent in the fourth quarter of 2017, a decrease of 1 basis point from the third quarter of 2017 and an increase of 20 basis points from the same quarter in the prior year. The margin decline compared to the third quarter of 2017 was primarily due to lower interest income earned on PCI loans resulting from continued run-off partially offset by higher loan balances and higher investment yields. The margin improvement compared to the fourth quarter of 2016 was primarily due to improved loan and investment yields and higher loan balances.\nNONINTEREST INCOME\nTotal noninterest income for the fourth quarter of 2017 was $140.2 million, an increase of $14.8 million from the third quarter of 2017. The increase was primarily due to a $12.5 million gain related to the early termination of two forward-starting Federal Home Loan Bank (FHLB) advances and a $1.4 million increase in wealth management fees. Furthering the growth in noninterest income were increases of $1.3 million in service charges on deposit accounts, primarily due to higher individual overdraft charges, and $1.1 million in recoveries of PCI loans previously charged-off. Partially offsetting these increases were declines in mortgage income of $2.8 million, primarily resulting from third quarter mortgage servicing rights gains related to the sale of certain residential mortgage loans as well as lower hedge income and a decrease of $1.7 million in securities gains.\nNoninterest income increased $15.5 million from the fourth quarter of 2016, primarily driven by a gain of $12.5 million related to the early termination of two forward-starting FHLB advances. Noninterest income also benefited from higher merchant and cardholder income of $6.0 million resulting from higher sales volume, a $4.8 million increase in service charges on deposit accounts, primarily related to the Guaranty acquisition, and a $3.2 million increase in wealth management fees. These increases were partially offset by lower securities gains of $9.5 million and a decrease of $3.9 million in mortgage income, primarily due to mortgage servicing rights valuation adjustments in the fourth quarter of 2016.\nNONINTEREST EXPENSE\nNoninterest expense increased by $7.7 million to $294.6 million compared to the third quarter of 2017. The increase was a result of higher personnel expenses of $5.4 million, primarily due to increases in wages, benefits and incentives. Additionally, there were increases in cardholder reward programs of $1.8 million due to updated redemption rate estimates, consultant services of $1.8 million and collection and foreclosure-related expenses of $1.4 million. These increases were partially offset by a $2.4 million reduction in processing fees paid to third parties, primarily related to the Guaranty and HCB acquisitions.\nNoninterest expense increased by $23.1 million from the same quarter last year due to a $16.1 million increase in personnel expenses, primarily due to higher wages from the Guaranty and HCB acquisitions, annual merit increases and higher benefit costs. Noninterest expense also increased due to growth in cardholder and merchant processing expense of $3.0 million resulting from higher sales volume and an increase of $2.4 million and $1.4 million in consultant services and processing fees paid to third parties, respectively.\nABOUT FIRST CITIZENS BANCSHARES\nBancShares is the financial holding company for Raleigh, North Carolina-headquartered First Citizens Bank. First Citizens Bank provides a broad range of financial services to individuals, businesses, professionals and the medical community through branch offices in 21 states, digital banking, ATMs and telephone banking. As of December 31, 2017, BancShares had total assets of $34.5 billion.\nFor more information, visit First Citizens’ website at firstcitizens .com. First Citizens Bank. Forever First ® .\nCONSOLIDATED FINANCIAL HIGHLIGHTS Three months ended Year ended December 31 (Dollars in thousands, except share data; unaudited) December 31,\n2017 September 30,\n2017 December 31,\n2016 2017 2016 SUMMARY OF OPERATIONS Interest income $ 285,958 $ 284,333 $ 254,782 $ 1,103,690 $ 987,757 Interest expense 11,189 11,158 10,865 43,794 43,082 Net interest income 274,769 273,175 243,917 1,059,896 944,675 (Credit) provision for loan and lease losses (2,809 ) 7,946 16,029 25,692 32,941 Net interest income after provision for loan and lease losses 277,578 265,229 227,888 1,034,204 911,734 Gain on acquisitions — — — 134,745 5,831 Noninterest income 140,150 125,387 124,698 506,284 482,240 Noninterest expense 294,617 286,967 271,531 1,131,535 1,048,738 Income before income taxes 123,111 103,649 81,055 543,698 351,067 Income taxes 68,704 36,585 28,365 219,946 125,585 Net income $ 54,407 $ 67,064 $ 52,690 $ 323,752 $ 225,482 Taxable-equivalent net interest income $ 276,002 $ 274,272 $ 245,330 $ 1,064,415 $ 949,768 PER SHARE DATA Net income $ 4.53 $ 5.58 $ 4.39 $ 26.96 $ 18.77 Cash dividends 0.35 0.30 0.30 1.25 1.20 Book value at period-end 277.60 275.91 250.82 277.60 250.82 CONDENSED BALANCE SHEET Cash and due from banks $ 336,150 $ 296,386 $ 539,741 $ 336,150 $ 539,741 Overnight investments 1,387,927 2,432,233 1,872,594 1,387,927 1,872,594 Investment securities 7,180,256 6,992,955 7,006,678 7,180,256 7,006,678 Loans and leases 23,596,825 23,149,073 21,737,878 23,596,825 21,737,878 Less allowance for loan and lease losses (221,893 ) (231,842 ) (218,795 ) (221,893 ) (218,795 ) Other assets 2,248,247 1,945,349 2,052,740 2,248,247 2,052,740 Total assets $ 34,527,512 $ 34,584,154 $ 32,990,836 $ 34,527,512 $ 32,990,836 Deposits 29,266,275 29,333,949 28,161,343 29,266,275 28,161,343 Other liabilities 1,927,173 1,936,374 1,817,066 1,927,173 1,817,066 Shareholders' equity 3,334,064 3,313,831 3,012,427 3,334,064 3,012,427 Total liabilities and shareholders' equity $ 34,527,512 $ 34,584,154 $ 32,990,836 $ 34,527,512 $ 32,990,836 SELECTED PERIOD AVERAGE BALANCES Total assets $ 34,864,720 $ 34,590,503 $ 33,223,995 $ 34,302,867 $ 32,439,492 Investment securities 7,044,534 6,906,345 6,716,873 7,036,564 6,616,355 Loans and leases 23,360,235 22,997,195 21,548,313 22,725,665 20,897,395 Interest-earning assets 32,874,233 32,555,597 31,078,428 32,213,646 30,267,788 Deposits 29,525,843 29,319,384 28,231,477 29,119,344 27,515,161 Interest-bearing liabilities 19,425,404 19,484,663 19,357,282 19,576,353 19,158,317 Shareholders' equity $ 3,329,562 $ 3,284,044 $ 3,056,426 $ 3,206,250 $ 3,001,269 Shares outstanding 12,010,405 12,010,405 12,010,405 12,010,405 12,010,405 SELECTED RATIOS Annualized return on average assets 0.62 % 0.77 % 0.63 % 0.94 % 0.70 % Annualized return on average equity 6.48 8.10 6.86 10.10 7.51 Taxable-equivalent net interest margin 3.34 3.35 3.14 3.30 3.14 Efficiency ratio (1) 73.14 72.24 75.54 73.03 75.79 Tier 1 risk-based capital ratio 12.88 12.95 12.42 12.88 12.42 Common equity Tier 1 ratio 12.88 12.95 12.42 12.88 12.42 Total risk-based capital ratio 14.21 14.34 13.85 14.21 13.85 Leverage capital ratio 9.47 9.43 9.05 9.47 9.05 (1) The efficiency ratio is a non-GAAP financial measure which measures productivity and is generally calculated as noninterest expense divided by total revenue (net interest income and noninterest income). The efficiency ratio removes the impact of BancShares' securities gains, acquisition gains and other non-recurring gains or losses from the calculation. Management uses this ratio to monitor performance and believes this measure provides meaningful information to investors.\nALLOWANCE FOR LOAN AND LEASE LOSSES AND ASSET QUALITY DISCLOSURES Three months ended Year ended December 31 (Dollars in thousands, unaudited) December 31,\n2017 September 30,\n2017 December 31,\n2016 2017 2016 ALLOWANCE FOR LOAN AND LEASE LOSSES (ALLL) ALLL at beginning of period $ 231,842 $ 228,798 $ 211,950 $ 218,795 $ 206,216 (Credit) provision for loan and lease losses: PCI loans (1) (2,637 ) (537 ) 2,137 (3,447 ) (1,929 ) Non-PCI loans (1) (172 ) 8,483 13,892 29,139 34,870 Net charge-offs of loans and leases: Charge-offs (9,994 ) (8,494 ) (11,316 ) (36,682 ) (30,201 ) Recoveries 2,854 3,592 2,132 14,088 9,839 Net charge-offs of loans and leases (7,140 ) (4,902 ) (9,184 ) (22,594 ) (20,362 ) ALLL at end of period $ 221,893 $ 231,842 $ 218,795 $ 221,893 $ 218,795 ALLL at end of period allocated to loans and leases: PCI $ 10,026 $ 12,959 $ 13,769 $ 10,026 $ 13,769 Non-PCI 211,867 218,883 205,026 211,867 205,026 ALLL at end of period $ 221,893 $ 231,842 $ 218,795 $ 221,893 $ 218,795 Net charge-offs of loans and leases: PCI $ 296 $ — $ — $ 296 $ 614 Non-PCI 6,844 4,902 9,184 22,298 19,748 Total net charge-offs $ 7,140 $ 4,902 $ 9,184 $ 22,594 $ 20,362 Reserve for unfunded commitments $ 1,032 $ 1,309 $ 1,133 $ 1,032 $ 1,133 SELECTED LOAN DATA Average loans and leases: PCI $ 799,399 $ 865,580 $ 831,858 $ 845,030 $ 898,706 Non-PCI 22,560,836 22,131,615 20,716,455 21,880,635 19,998,689 Loans and leases at period-end: PCI 762,998 834,167 809,169 762,998 809,169 Non-PCI 22,833,827 22,314,906 20,928,709 22,833,827 20,928,709 RISK ELEMENTS Nonaccrual loans and leases: PCI $ 624 $ 1,017 $ 3,451 $ 624 $ 3,451 Non-PCI 92,534 90,064 82,307 92,534 82,307 Other real estate 51,097 53,988 61,231 51,097 61,231 Total nonperforming assets $ 144,255 $ 145,069 $ 146,989 $ 144,255 $ 146,989 Accruing loans and leases 90 days or more past due $ 61,718 $ 68,250 $ 68,241 $ 61,718 $ 68,241 RATIOS Net charge-offs (annualized) to average loans and leases: PCI 0.15 % — % — % 0.04 % 0.07 % Non-PCI 0.12 0.09 0.18 0.10 0.10 Total 0.12 0.08 0.17 0.10 0.10 ALLL to total loans and leases: PCI 1.31 1.55 1.70 1.31 1.70 Non-PCI 0.93 0.98 0.98 0.93 0.98 Total 0.94 1.00 1.01 0.94 1.01 Ratio of nonperforming assets to total loans, leases and other real estate Covered 0.54 0.35 0.66 0.54 0.66 Noncovered 0.61 0.63 0.67 0.61 0.67 Total 0.61 0.63 0.67 0.61 0.67 (1) Loans and leases are evaluated at acquisition and where a discount is noted at least in part due to credit quality, the loans are accounted for under the guidance in ASC Topic 310-30, Loans and Debt Securities Acquired with Deteriorated Credit Quality . Loans for which it is probable at acquisition that all required payments will not be collected in accordance with the contractual terms are considered purchased credit-impaired (PCI) loans. PCI loans and leases are recorded at fair value at the date of acquisition. No allowance for loan and lease losses is recorded on the acquisition date as the fair value of the acquired assets incorporates assumptions regarding credit risk. An allowance is recorded if there is additional credit deterioration after the acquisition date. Conversely, Non-PCI loans include originated and purchased non-impaired loans.\nAVERAGE BALANCE AND NET INTEREST MARGIN SUMMARY Three months ended December 31, 2017 September 30, 2017 December 31, 2016 Average Yield/ Average Yield/ Average Yield/ (Dollars in thousands, unaudited) Balance Interest Rate (2) Balance Interest Rate (2) Balance Interest Rate (2) INTEREST-EARNING ASSETS Loans and leases (1) $ 23,360,235 $ 248,151 4.22 % $ 22,997,195 $ 247,262 4.27 % $ 21,548,313 $ 226,651 4.19 % Investment securities: U. S. Treasury 1,627,968 4,784 1.17 1,617,153 4,580 1.12 1,593,610 3,328 0.83 Government agency 9,659 69 2.85 41,001 171 1.66 172,037 396 0.92 Mortgage-backed securities 5,233,293 25,351 1.94 5,075,795 23,912 1.88 4,802,198 20,937 1.74 Corporate bonds 63,911 991 6.20 62,338 974 6.25 54,255 772 5.69 Other 109,703 246 0.89 110,058 164 0.59 94,773 253 1.06 Total investment securities 7,044,534 31,441 1.78 6,906,345 29,801 1.72 6,716,873 25,686 1.53 Overnight investments 2,469,464 7,599 1.22 2,652,057 8,367 1.25 2,813,242 3,858 0.55 Total interest-earning assets $ 32,874,233 $ 287,191 3.47 % $ 32,555,597 $ 285,430 3.48 % $ 31,078,428 $ 256,195 3.28 % INTEREST-BEARING LIABILITIES Interest-bearing deposits: Checking with interest $ 5,028,978 $ 262 0.02 % $ 4,981,667 $ 255 0.02 % $ 4,696,279 $ 261 0.02 % Savings 2,337,993 172 0.03 2,320,899 173 0.03 2,080,598 161 0.03 Money market accounts 8,047,691 1,732 0.09 8,053,197 1,690 0.08 8,113,686 1,619 0.08 Time deposits 2,421,749 1,623 0.27 2,559,977 1,721 0.27 2,892,143 2,411 0.33 Total interest-bearing deposits 17,836,411 3,789 0.08 17,915,740 3,839 0.09 17,782,706 4,452 0.10 Repurchase agreements 615,244 622 0.40 594,344 613 0.41 726,318 485 0.27 Other short-term borrowings 107,551 1,031 3.77 86,631 816 3.71 12,749 52 1.63 Long-term obligations 866,198 5,747 2.61 887,948 5,890 2.61 835,509 5,876 2.81 Total interest-bearing liabilities $ 19,425,404 $ 11,189 0.23 % $ 19,484,663 $ 11,158 0.22 % $ 19,357,282 $ 10,865 0.22 % Interest rate spread 3.24 % 3.26 % 3.06 % Net interest income and net yield on interest-earning assets $ 276,002 3.34 % $ 274,272 3.35 % $ 245,330 3.14 % (1) Loans and leases include PCI loans, non-PCI loans, nonaccrual loans and loans held for sale.\n(2) Yields related to loans, leases and securities exempt from both federal and state income taxes, federal income taxes only, or state income taxes only are stated on a taxable-equivalent basis assuming statutory federal income tax rates of 35.0 percent for each period and state income tax rates of 3.1 percent for the three months ended December 31, 2017, September 30, 2017 and December 31, 2016. The taxable-equivalent adjustment was $1,233, $1,097 and $1,413 for the three months ended December 31, 2017, September 30, 2017 and December 31, 2016, respectively. The rate/volume variance is allocated equally between the changes in volume and rate.\nContact:\nBarbara Thompson\nFirst Citizens BancShares\n(919) 716-2716\nSource:First Citizens BancShares, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/1e55819e-39e3-4821-bc95-eccd2596757e"], "published": "2018-01-31T19:30:00.000+02:00", "crawled": "2018-01-31T20:33:55.002+02:00", "highlightTitle": ""}