{"organizations": [], "uuid": "a4d0fc5b1fff3a2180edddd33f8183aa23f28aa9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-malvern-bancorp-inc-appoints-julia-d-corelli-to-its-board.html", "country": "US", "domain_rank": 767, "title": "Malvern Bancorp, Inc. Appoints Julia D. Corelli to its Board", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.059, "site_type": "news", "published": "2018-01-02T16:30:00.000+02:00", "replies_count": 0, "uuid": "a4d0fc5b1fff3a2180edddd33f8183aa23f28aa9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-malvern-bancorp-inc-appoints-julia-d-corelli-to-its-board.html", "ord_in_thread": 0, "title": "Malvern Bancorp, Inc. Appoints Julia D. Corelli to its Board", "locations": [], "entities": {"persons": [{"name": "julia d. corelli", "sentiment": "negative"}, {"name": "howard kent", "sentiment": "none"}, {"name": "corelli", "sentiment": "none"}, {"name": "anthony c. weagley", "sentiment": "none"}], "locations": [{"name": "board paoli", "sentiment": "none"}, {"name": "pa.", "sentiment": "none"}], "organizations": [{"name": "malvern bancorp, inc.", "sentiment": "neutral"}, {"name": "malvern bancorp, inc", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "bank", "sentiment": "none"}, {"name": "board", "sentiment": "none"}, {"name": "northeast regional board of boys & girls clubs of america", "sentiment": "none"}, {"name": "co-chair of pepper’s commercial department", "sentiment": "none"}, {"name": "malvern federal savings bank", "sentiment": "none"}, {"name": "pepper hamilton llp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PAOLI, Pa., Jan. 02, 2018 (GLOBE NEWSWIRE) -- Malvern Bancorp, Inc. (Nasdaq:MLVF) (the \"Company\"), parent company of Malvern Federal Savings Bank (the \"Bank\"), today announced that Julia D. Corelli has been appointed to the boards of directors of the Company and the Bank. Ms. Corelli has been a partner at Pepper Hamilton LLP for more than 23 years, with a practice focusing on counseling all kinds of investment vehicles on formation, regulation and operations, as well as business and transactions counseling to family offices and life science companies. Ms. Corelli served for 12 years on Pepper’s governing body, including as its Vice Chair from 2013 to 2017. She is currently co-Chair of Pepper’s Commercial Department. Ms. Corelli has also served since 2014 on the Board of Directors of BioIncept, LLC, a privately held biotech company, and since 2016 on the Northeast Regional Board of Boys & Girls Clubs of America.\nIn a joint statement, Howard Kent, Chairman of the Board and Anthony C. Weagley, President and CEO of Malvern Bancorp, Inc., and Malvern Federal Savings Bank, indicated that, “Julia is an outstanding addition to Malvern’s board. Julia’s depth of experience and years of leadership in the legal profession, and her breadth of involvement in counseling a wide array of clients across diverse industries, further enhances the diversity of expertise and perspective available to Malvern’s board in leading our growing business.”\nJulia D. Corelli holds a B.A. degree from Yale University, and a J.D. degree and an LL.M degree in Taxation from the Villanova University School of Law. Ms. Corelli is admitted to practice law in Pennsylvania.\nAbout Malvern Bancorp, Inc.\nMalvern Bancorp, Inc. is the holding company for Malvern Federal Savings Bank. Malvern Federal Savings Bank is a federally-chartered, FDIC-insured savings bank that was originally organized in 1887 and now serves as one of the oldest banks headquartered on the Philadelphia Main Line. For more than a century, Malvern has been committed to helping people build prosperous communities as a trusted financial partner, forging lasting relationships through teamwork, respect and integrity.\nThe Bank conducts business from its headquarters in Paoli, Pennsylvania, a suburb of Philadelphia and through its nine other banking locations in Chester, Delaware and Bucks counties, Pennsylvania and Morristown, N.J., its New Jersey regional headquarters. The Bank also recently announced new representative offices in Palm Beach Florida and Montchanin, Delaware. Its primary market niche is providing personalized service to its client base.\nThe Bank, through its Private Banking division and strategic partnership with Bell Rock Capital in Rehoboth Beach, DE, provides personalized wealth management and advisory services to high net worth individuals and families. Bel Rock Capital’s services include banking, liquidity management, investment services, 401(K) accounts and planning, custody, tailored lending, wealth planning, trust and fiduciary services, family wealth advisory services and philanthropic advisory services. The Bank offers insurance services though Malvern Insurance Associates, LLC, which provides clients a rich array of financial services, including commercial and personal insurance and commercial and personal lending.\nFor further information regarding Malvern Bancorp, Inc., please visit our web site at http://ir.malvernfederal.com. For information regarding Malvern Federal Savings Bank, please visit our web site at http://www.malvernfederal.com.\nForward-Looking Statements\nThis press release contains certain forward looking statements. Forward-looking statements can be identified by the fact that they do not relate strictly to historical or current facts. They often include words like \"believe,\" \"expect,\" \"anticipate,\" \"estimate\" and \"intend\" or future or conditional verbs such as \"will,\" \"would,\" \"should,\" \"could\" or \"may.\" Certain factors that could cause actual results to differ materially from expected results include changes in the interest rate environment, changes in general economic conditions, legislative and regulatory changes that adversely affect the business of Malvern Bancorp, Inc., and changes in the securities markets. Except as required by law, the Company does not undertake any obligation to update any forward-looking statements to reflect changes in beliefs, expectations or events.\nInvestor Relations:\nJoseph D. Gangemi\nSVP & CFO\n(610) 695-3676\nInvestor Contact:\nRonald Morales\n(610) 695-3646\nSource:Malvern Bancorp, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/336c2c67-229c-4ee6-9fa4-a1eea4e06235"], "published": "2018-01-02T16:30:00.000+02:00", "crawled": "2018-01-02T16:33:10.022+02:00", "highlightTitle": ""}