{"organizations": [], "uuid": "56fb54a1421f9a5ed61971e9a144982f9be145b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180108.html", "section_title": "Archive News &amp; Video for Monday, 08 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-asia-climatechange-risks/cooperation-to-curb-asias-climate-risks-still-too-rare-scientists-idUSKBN1EX1KY", "country": "US", "domain_rank": 408, "title": "Cooperation to curb Asia’s climate risks still too rare: scientists", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.351, "site_type": "news", "published": "2018-01-08T23:13:00.000+02:00", "replies_count": 0, "uuid": "56fb54a1421f9a5ed61971e9a144982f9be145b2"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-asia-climatechange-risks/cooperation-to-curb-asias-climate-risks-still-too-rare-scientists-idUSKBN1EX1KY", "ord_in_thread": 0, "title": "Cooperation to curb Asia’s climate risks still too rare: scientists", "locations": [], "entities": {"persons": [{"name": "anand sharma", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "kathmandu", "sentiment": "none"}, {"name": "bihar", "sentiment": "none"}, {"name": "myanmar", "sentiment": "none"}, {"name": "afghanistan", "sentiment": "none"}, {"name": "hindu kush-himalaya", "sentiment": "none"}, {"name": "nepal", "sentiment": "none"}, {"name": "west rapti", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "uttar pradesh", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "department of hydrology and meteorology", "sentiment": "none"}, {"name": "indian meteorological department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KATHMANDU (Thomson Reuters Foundation) - When heavy monsoon rains triggered unprecedented flooding last August in the area around western Nepal’s Babai and West Rapti rivers, the swollen waters crossed the border into India within a few hours.\nBut swift warnings from Nepali authorities to the downriver Indian states of Bihar and Uttar Pradesh allowed officials there to move people to safety, Indian officials say.\nWithout that advice from Nepal’s Department of Hydrology and Meteorology, “there would have been no possibility for the Indian authorities to ensure timely evacuation of the people, which (would have) otherwise led to huge loss of lives,” said Anand Sharma of the Indian Meteorological Department.\nAs climate change increases the risk of flooding, glacial lake outbursts and cyclones, as well as droughts and heat waves, experts say that sharing information across borders is crucial to save lives and ensure economic stability in Asia’s Hindu Kush-Himalaya (HKH) region.\nThe region, which stretches from Afghanistan in the west to Myanmar in the east, includes over 1.3 billion people in eight countries.\nThey are connected by 10 river basins, including the Indus, Ganges, Brahmaputra, Salween, Mekong and Yangtse, and some of the world’s largest mountain ranges, the Karakoram, Hindu Kush and Himalayas, which are home to over 54,000 glaciers covering more than 60,000 square kilometres (23,000 square miles).\nBut the cooperation seen between India and Nepal remains too rare in the region, regional officials say.\nAlthough countries face similar climate-related risks, political disagreements between countries, and a lack of legal arrangements for sharing information, are increasing the region’s vulnerability to natural disasters, they say.\nRISKS GROWING David Molden, the director general of the Kathmandu-based International Center for Integrated Mountain Development (ICIMOD), warned in an interview that HKH countries will suffer increasingly severe impacts from climate change-related disasters, particularly floods, cyclones, droughts and land erosion, if they do not cooperate in sharing information and early warnings.\nBut in a bid to boost the region’s climate resilience, political leaders, government policymakers and scientists from the region agreed at a conference in Nepal in December to work harder to boost collaboration to tackle common disaster risks.\nSuch cooperation would likely focus on everything from improving joint management of river basins to better monitoring of glacial melting and glacial lakes prone to outburst floods, Molden said.\nLyonpo Yeshey Dorji, Bhutan’s Minister for Agriculture and Forest, said he was confident that political leaders of the region would “join hands with scientists and policymakers to boost intra-regional collaboration in data sharing, knowledge and technology transfer for enhancing the region’s ability to withstand fallouts of climate change”.\nDorji added that countries needed to better understand the advantages that would be gained by exchanging data, local knowledge and technology.\nYusuf Zafar, chair of the Pakistan Agricultural Research Council, agreed that cooperation between countries was urgently needed.\n“Plugging the gap ... is vital to help people strengthen climate resilience, particularly those 210 million people in mountain areas,” he said.\nCROSS-BORDER FLOOD WARNINGS In the case of India and Nepal, the Indian Meteorological Department, together with India’s National Disaster Management Authority, monitors rainfall during the rainy season in Nepal and receives real-time flood information from its Nepali counterparts.\nCommunities in downriver flood-prone areas in India are able to contact hydrology stations in Nepal for information on potential flooding in that country’s upstream areas, officials said.\nAsit Biswas, a scientist and visiting professor at Singapore-based Lee Kuan Yew School for Public Policy, told the Thomson Reuters Foundation more evidence from science was needed to persuade politicians of the urgent need to invest in national and regional programmes for resilience, focused on everything from food security to protection of water supplies.\n“The goal of a climate-resilient HKH region is unlikely to be achieved as long as regional political leaders’ attention is not drawn to the exacerbating climate vulnerability of the HKH region,” Biswas said.\nIn some regions, cooperation is already improving. India, for example, used not to convey flood warnings to Bangladesh because of difficult political relations between the two countries, the experts said.\nThis made Bangladesh more vulnerable to flooding in the Ganges-Brahamaputra river that flows from India into Bangladesh, they said.\nBut Golam Rasul, a Bangladeshi development economist at ICIMOD, said that India now shares early flood warnings with its smaller neighbor, thanks to normalization of relations between the two countries.\nWhen five Indian rivers that flow into Bangladesh flooded as a result of monsoon rains last August, Indian authorities alerted their Bangladeshi counterparts, enabling them to evacuate vulnerable residents alongside the rivers, he said.\nReporting by Saleem Shaikh and Sughra Tunio; editing by James Baer and Laurie Goering :; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, climate change, resilience, women's rights, trafficking and property rights. Visit news.trust.org/climate\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html", "http://news.trust.org/climate"], "published": "2018-01-08T23:13:00.000+02:00", "crawled": "2018-01-09T17:02:53.012+02:00", "highlightTitle": ""}