{"organizations": [], "uuid": "7857a2f5741861fc8cc5f5409e658f863ab89415", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews/", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-czech-government-confidence/czech-mps-to-resume-debate-ahead-of-confidence-vote-on-pm-babis-idUKKBN1F42PZ", "country": "US", "domain_rank": 408, "title": "Czech MPs to resume debate ahead of confidence vote on PM Babis", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T01:01:00.000+02:00", "replies_count": 0, "uuid": "7857a2f5741861fc8cc5f5409e658f863ab89415"}, "author": "", "url": "https://uk.reuters.com/article/uk-czech-government-confidence/czech-mps-to-resume-debate-ahead-of-confidence-vote-on-pm-babis-idUKKBN1F42PZ", "ord_in_thread": 0, "title": "Czech MPs to resume debate ahead of confidence vote on PM Babis", "locations": [], "entities": {"persons": [{"name": "andrej babis", "sentiment": "none"}, {"name": "babis", "sentiment": "none"}, {"name": "milos zeman", "sentiment": "none"}, {"name": "jiri drahos", "sentiment": "none"}], "locations": [{"name": "prague", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "ano", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "pm babis reuters staff", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 11:05 PM / Updated 13 minutes ago Czech PM Babis to battle police charges; cabinet set to lose confidence vote Robert Muller 4 Min Read \nPRAGUE (Reuters) - Czech Prime Minister Andrej Babis faces a double defeat on Tuesday or later this week: he is almost certain to lose a vote of confidence on his minority cabinet, and police are likely to gain authority to investigate him for suspected subsidy fraud. Czech Prime Minister Andrej Babis attends a parliamentary session during a confidence vote for the newly appointed government he leads, in Prague, Czech Republic January 10, 2018. REUTERS/David W Cerny \nThe billionaire businessman’s pledges to clean up corrupt politics helped him win nearly 30 percent of the vote in an October election. But he has become embroiled in allegations he manipulated ownership of one of his companies a decade ago to win a 2 million-euro subsidy, mostly from European Union funds, meant for small businesses. \nThe energetic Babis remains popular with his message to strengthen the Czech voice in the EU, digitalise government and ease taxes. \nHe calls the investigation, which also targets his wife and grown children, a ploy by adversaries to chase him out of politics, which many Czechs believe is ridden by bribery and favouritism. \n“Citizens are not stupid and know it is a political affair ... ” he told a news conference. “This is a ploy organised by the mafia that had been stealing billions here, for a long time, and I of course bother them.” \nThe political turmoil has had no impact on the Czech economy, which is that is growing strongly, pushing unemployment to all-time lows and driving wages up. \nBabis had been charged before the election, but he won new immunity from prosecution after being re-elected. \nHis ANO party and the far-right SPD had requested additional information on the case, making it uncertain whether the house would lift the immunity shielding Babis and his ANO party deputy Jaroslav Faltynek, who is being investigated in the case and also denies any wrongdoing. Czech Prime Minister Andrej Babis attends a parliamentary session during a confidence vote for the newly appointed government he leads, in Prague, Czech Republic January 10, 2018. REUTERS/David W Cerny \nBut they both declared on Tuesday they would themselves ask for immunity to be lifted - Babis said he never intended otherwise - and the house’s immunity committee then voted to recommend the same verdict to the full house, which may take a vote later on Tuesday or later this week. NO CONFIDENCE \nThe subsidy investigation is the main reason most of the eight other parliamentary parties have refused to join a coalition with ANO, which holds 78 of the 200 seats in the lower house, or back the minority cabinet. Czech President Milos Zeman leaves a parliamentary session during a confidence vote for the newly appointed government led by Czech Prime Minister Andrej Babis, in Prague, Czech Republic January 10, 2018. REUTERS/David W Cerny \nA loss in the confidence vote would leave Babis and his team in office pending another round of talks on a new cabinet. \nGiven ANO’s strength, it is almost impossible to form any administration that would not include the party, formed in 2011 as a protest movement against graft and involving a number of managers from Babis’s chemicals, food, farming and media conglomerate, Agrofert. He moved the company to a trust fund last year. \nOther parties may also fear early elections and some have said they would be willing to enter talks in a second round. \nPresident Milos Zeman, who appoints prime ministers, has said he would give Babis another chance but later added he wanted to see if he has the necessary majority in parliament. \nThe situation could be further complicated by a presidential election that is heading to a tight run-off on Jan. 26-27. It pits Zeman against academic Jiri Drahos, who has said it would be unacceptable to have a sitting prime minister who faces criminal charges. \nIf Zeman were to lose, he would leave office on March 7. That would force Babis to try find a solution and win reappointment still under Zeman if he insists on personally leading the cabinet. Reporting by Jason Hovet and Robert Muller, writing by Jan Lopatka, editing by Larry King; Editing by Larry King", "external_links": [], "published": "2018-01-16T01:01:00.000+02:00", "crawled": "2018-01-16T01:28:13.029+02:00", "highlightTitle": ""}