{"organizations": [], "uuid": "3df398841e2e0a4fc5c3371d0e58f97d6872c5c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 15, "shares": 15, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226769039&w=1200&r=LYNXMPEE0U018", "site_section": "http://feeds.feedburner.com/Reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-global-markets/asia-stocks-slip-as-high-bond-yields-weigh-on-equities-idUKKBN1FK03K", "country": "US", "domain_rank": 408, "title": "Asia stocks slip as high bond yields weigh, dollar steadies", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T05:31:00.000+02:00", "replies_count": 0, "uuid": "3df398841e2e0a4fc5c3371d0e58f97d6872c5c6"}, "author": "", "url": "https://uk.reuters.com/article/uk-global-markets/asia-stocks-slip-as-high-bond-yields-weigh-on-equities-idUKKBN1FK03K", "ord_in_thread": 0, "title": "Asia stocks slip as high bond yields weigh, dollar steadies", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "shinichi saoshiro", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "asia-pacific", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "msci", "sentiment": "none"}, {"name": "ssec", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 12:35 AM / Updated an hour ago Asia stocks poised for best month in nearly 2 years, dollar frail before Fed Shinichi Saoshiro 5 Min Read \nTOKYO (Reuters) - Asia stocks steadied on Wednesday after stuttering in the wake of rising global bond yields, while the dollar came under renewed pressure, slipping to 2-1/2-year lows versus the yuan, ahead of the Federal Reserve’s policy decision. \nIn his first State of the Union address since becoming U.S. President, Donald Trump urged Republicans and Democrats to work toward compromises on immigration and infrastructure and implement legislation that generates at least $1.5 trillion for new infrastructure investment. \nU.S. stock futures ESc1 rose 0.15 percent, though overall market reaction to the speech was limited. \n“Futures lifted a bit because it was not a negative speech. He was calm. He celebrated America. He avoided his own failures,” said Tim Ghriskey, Chief Investment Officer at Cresset Wealth Advisors in Chicago. \nEuropean shares are expected to open higher, with spread-betters looking at gains of 0.2 percent in Germany's Dax .GDAX and 0.1 percent each in Britain's FTSE .FTSE and France's Cac .FCHI . \nMSCI’s broadest index of Asia-Pacific shares outside Japan .MIAPJ0000PUS advanced 0.3 percent, reversing earlier losses. January has so far seen the index gain 6.5 percent, putting it on course for its best month since March 2016. \nJapan's Nikkei .N225 however dropped 0.8 percent, though still capping a monthly gain of 1.5 percent. \nWall Street, which has recently hit a succession of record peaks, has led a global equities rally over the past year thanks to strong world growth fuelling higher corporate earnings and stock valuations. \nBut the recent surge in U.S. long-term bond yields to near four-year highs has tempered the rally. \nU.S. stocks fell for a second straight day on Tuesday, with the Dow registering its biggest two-day drop since September 2016, pressured by healthcare stocks and rising bond yields. [.N] \n“The key point is the speed of the latest rise in yields, which has been very rapid. Until recently the yield rise helped the financial sector, but the pace of the rise is now too rapid and raising worries about corporate borrowing costs,” said Junichi Ishikawa, senior FX strategist at IG Securities in Tokyo. \nHigher yields are seen hurting equities as they increase borrowing costs for companies and reduce their risk appetite. They also present a fresh alternative to investors, who may choose to allocate some of their money from equities to bonds. \nThe U.S. Treasury 10-year note US10YT=RR yield touched its highest in nearly four years overnight at 2.733 percent, while 30-year bond yield US30YT=RR climbed to its highest since May 2017. \nYields rose after the start of the Federal Reserve’s two-day meeting on Tuesday, which could offer more clues on the central bank’s economic and rate hike outlook. \nThe dollar failed to draw much support from higher Treasury yields as the risk-averse mood favoured its peers like the yen. \nThe dollar was flat at 108.72 yen JPY= . It briefly popped up to 109.095 after the Bank of Japan increased its buying of government bonds of three- to five-year maturities at a regular debt-purchasing operation, a move seen as a warning shot against further rises in yields. [JP/] \nThe euro nudged up 0.3 percent to $1.2436 EUR= , adding to modest overnight gains. \nThe dollar index against a basket of six major currencies .DXY was at 88.971, having crawled away from a three-year low of 88.438 set on Friday. \nThe dollar lost 0.4 percent against the Chinese yuan, falling below 6.3 yuan for the first time since August 2015. \nThe risk aversion in the broader markets took a toll on recently bullish crude oil. U.S. crude futures CLc1 stretched overnight losses to slide 0.6 percent to $64.11 per barrel, with data showing a higher-than-expected rise in stocks also weighing. [O/R] \nUnderpinned by the dollar’s recent slide, prices had risen to $66.66 per barrel on Thursday, the highest since December 2014. \nBrent crude LCOc1 was down 0.5 percent at $68.66 per barrel. Additional reporting by Noel Randewich in San Francisco and Hideyuki Sano in Tokyo; Editing by Sam Holmes & Shri Navaratnam", "external_links": [], "published": "2018-01-31T05:31:00.000+02:00", "crawled": "2018-01-31T05:52:59.027+02:00", "highlightTitle": ""}