{"organizations": [], "uuid": "a423dc850bb0725a74a26c0fcbed6d6884daf99e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-hd-supply-enters-into-definitive-agreement-to-acquire-a-h-harris.html", "country": "US", "domain_rank": 767, "title": "HD Supply Enters into Definitive Agreement to Acquire A.H. Harris", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.742, "site_type": "news", "published": "2018-01-03T16:30:00.000+02:00", "replies_count": 0, "uuid": "a423dc850bb0725a74a26c0fcbed6d6884daf99e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-hd-supply-enters-into-definitive-agreement-to-acquire-a-h-harris.html", "ord_in_thread": 0, "title": "HD Supply Enters into Definitive Agreement to Acquire A.H. Harris", "locations": [], "entities": {"persons": [{"name": "a.h. harris", "sentiment": "negative"}, {"name": "john stegeman", "sentiment": "none"}], "locations": [{"name": "atlanta", "sentiment": "none"}, {"name": "connecticut", "sentiment": "none"}, {"name": "hartford", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "a.h. harris construction supplies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA, Jan. 03, 2018 (GLOBE NEWSWIRE) -- HD Supply Holdings, Inc. (Nasdaq:HDS), one of the largest industrial distributors in North America, today announced that it has entered into a definitive agreement to purchase A.H. Harris Construction Supplies, a leading specialty construction distributor serving the northeast and mid-Atlantic regions. The purchase price is approximately $380 million. The transaction is expected to close in HD Supply's first fiscal quarter of 2018 subject to obtaining customary regulatory approvals.\nHeadquartered in Hartford, Connecticut, A.H. Harris Construction Supplies operates more than 50 branches across 12 states and generated annual sales of approximately $380 million over the last twelve months.\n“We are committed to investing in our business to continue to enhance our offering and customer experience,” said John Stegeman, President, HD Supply Construction & Industrial. “The strategic addition of A.H. Harris perfectly aligns with our One Team culture and our commitment to provide the best mix of products, value-added services and expert solutions for our customers across our priority local markets.”\nThe purchase of A.H. Harris Construction Supplies further strengthens HD Supply Construction & Industrial – White Cap’s position as it enhances its market presence in the northeastern United States, deepens its product expertise and increases its penetration of value-add service offerings. The transaction aligns with HD Supply’s focused growth strategy to sell more to existing customers and acquire new customers.\n“HD Supply will continue to focus on extending its position through disciplined organic growth execution and by selectively acquiring complementary companies such as A.H. Harris,” stated Joe DeAngelo, CEO of HD Supply. “We are excited to welcome the A.H. Harris associates to our HD Supply family.”\nKing & Spalding served as legal counsel to HD Supply on the transaction. Houlihan Lokey and Lincoln International acted as financial advisors and Kirkland & Ellis served as legal counsel to A.H. Harris Construction Supplies on the sale transaction.\nAbout HD Supply Construction & Industrial\nWith approximately 220 locations in North America and more than 4,800 knowledgeable full-time associates, HD Supply Construction & Industrial operates as three companies: HD Supply White Cap, HD Supply Brafasco and HD Supply Home Improvement Solutions. HD Supply White Cap is the nation’s leading distributor of specialty hardware, tools and concrete accessories for professional contractors. HD Supply Brafasco is an industrial distributor in Canada that primarily focuses on servicing fasteners/industrial supplies. HD Supply Home Improvement Solutions offers remodeling and construction supplies to small remodeling contractors and trade professionals through local retail outlets. HD Supply Construction & Industrial is part of HD Supply ( www.hdsupply.com ), one of the largest diversified industrial distribution companies in North America.\nAbout A.H. Harris Construction Supplies:\nFounded in 1916, A.H. Harris Construction Supplies, supplies high-quality construction products and equipment for contractors, construction companies and government entities in the concrete construction, repair and restoration, road and bridge, rebar and rebar fabrication, waterproofing and glazing markets. It represents 500+ manufacturers and over 13,000 products. A.H. Harris has over 600 experienced team members, a multitude of delivery options and over 50 convenient locations in 12 states.\nMedia Contact:\nQuiana Pinckney, APR\nHD Supply Public Relations\n770-852-9057\nQuiana.Pinckney@hdsupply.com\nSource:HD Supply Holdings, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/723e319a-7c38-430f-ac10-f46861ae39f4", "https://www.globenewswire.com/Tracker?data=zMnD_MemqAigwrul_x0zmk4LWWV8rLgcuMLk4gGe4DmBXln_CEY1VEfvsGtFpYoO7fn_bO607ehVljUyAJq9CQ==", "https://www.globenewswire.com/Tracker?data=TGzQUQPb6WEI8tNaQcUjl4TMLZxa5780N4HQgnfcrgWyESaKI_es8nkoCu4E94xp1Q55AO-RTif33GbRqb0ScP2_wJLixZ1Ta2DabPUxJSnjV9Lb3vhs7cZQ89N9gHN7"], "published": "2018-01-03T16:30:00.000+02:00", "crawled": "2018-01-03T16:28:47.009+02:00", "highlightTitle": ""}