{"organizations": [], "uuid": "5c57cb3024d32efd54ef5a626f0e1d13b4819439", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/money-taxes-paycheck/rpt-your-money-new-u-s-tax-law-could-impact-paychecks-by-february-idUSL1N1OX1D0", "country": "US", "domain_rank": 408, "title": "RPT-YOUR MONEY-New U.S. tax law could impact paychecks by February", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T14:00:00.000+02:00", "replies_count": 0, "uuid": "5c57cb3024d32efd54ef5a626f0e1d13b4819439"}, "author": "", "url": "https://www.reuters.com/article/money-taxes-paycheck/rpt-your-money-new-u-s-tax-law-could-impact-paychecks-by-february-idUSL1N1OX1D0", "ord_in_thread": 0, "title": "RPT-YOUR MONEY-New U.S. tax law could impact paychecks by February", "locations": [], "entities": {"persons": [{"name": "beth pinsker", "sentiment": "none"}, {"name": "pete isberg", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "adp", "sentiment": "none"}, {"name": "internal revenue service", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 12:00 PM / Updated 36 minutes ago RPT-YOUR MONEY-New U.S. tax law could impact paychecks by February Reuters Staff \n(Repeats story published Tuesday with no changes) \nBy Beth Pinsker \nNEW YORK, Jan 2 (Reuters) - The first paychecks of 2018 will be dispatched soon, but it may be weeks or months before taxpayers and payroll processors know how the new U.S. tax laws will affect your take-home pay. \nThe Internal Revenue Service said it expected to issue guidance in January on how much in taxes employers should withhold based on the new tax rates. Employers and payroll services would then implement those changes starting in February. \nYou might not even notice when it happens because the effect on your paycheck could be relatively small, depending on your income and your tax situation. \n“When the taxes are reduced by 1 to 3 percent, that’s not going to be a huge noticeable difference. It’s not going to be hundreds of dollars,” said Pete Isberg, vice president of government relations at ADP, the largest payroll processor in the United States, servicing the paychecks of one out of every six workers. \nA difference of $1,000, for instance, would be less than $40 a pop for a worker paid biweekly. \nYour paycheck is not actually a clear indicator of whether your overall taxes have gone up or down because of the new tax law. There may be other factors in your tax situation - such as owning a property or having multiple children - that could affect how much you owe Uncle Sam at the end of the year. \nBe prepared for tax uncertainty until you do your taxes for 2018 a year or so from now. You cannot even estimate your taxes until tax professionals and do-it-yourself services like TurboTax update their software. And that cannot happen until the IRS releases the new withholding tables and issues more guidance on the specifics of other tax changes. \n“We will be ready to help our customers. We just need more information,” said David Williams, executive director of the Intuit Tax and Financial Center. WAITING FOR W-4 FORMS \nYou may be tempted to get a jump on the IRS and change how much tax is taken out of your paycheck by adjusting your W-4 form, but that may be premature, warned Isberg. \nThe IRS said in its last note that it would be attempting to work with existing W-4 forms for now. \nThe standard federal W-4, which all employees fill out, is based on the notion of “allowances,” which you could adjust based on your personal situation. \nIn the past, a single person with three children and a home in a high-tax state like New York might have listed themselves as married and claim one allowance per person, plus a few extra because they were likely to itemize their deductions and owe less. A married person with a freelance spouse who owes quarterly taxes might have listed themselves as single to have enough taken out to cover both of them. \nThe goal of people adjusting their withholding was to come as close as possible to paying the correct amount of tax - rather than owing money at the end of the year or ending up with a giant refund. \nBut it will all be different math for 2018. \n“For first few weeks of January stay put, and see what the IRS comes out with,” said Isberg, who also cautioned that employees should keep an eye on tax changes at the state level. \nAbove all, do not panic, said Farsheed Ferdowsi, president and CEO of Inova Payroll, which handles paychecks for more than 3,000 companies. \n“When you have changes in taxes, it usually goes a lot smoother than most people know,” Ferdowsi said. “If the first (paycheck) is wrong, it catches up on the next one.” (Editing by Lauren Young and Lisa Shumaker)", "external_links": [], "published": "2018-01-03T14:00:00.000+02:00", "crawled": "2018-01-03T14:49:27.006+02:00", "highlightTitle": ""}