{"organizations": [], "uuid": "81cd52a5a0c108b7b87ef76675f94a614119f87e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/07/104826818-GettyImages-871359536-GOP-perdue.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/14/republican-senator-insists-trump-didnt-disparage-haiti-african-nations-with-profane-remark.html", "country": "US", "domain_rank": 767, "title": "Republican senator insists Trump didn't disparage Haiti, African nations with profane remark", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-14T21:05:00.000+02:00", "replies_count": 0, "uuid": "81cd52a5a0c108b7b87ef76675f94a614119f87e"}, "author": "Carlos Barria", "url": "https://www.cnbc.com/2018/01/14/republican-senator-insists-trump-didnt-disparage-haiti-african-nations-with-profane-remark.html", "ord_in_thread": 0, "title": "Republican senator insists Trump didn't disparage Haiti, African nations with profane remark", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "dick durbin", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "david perdue", "sentiment": "none"}, {"name": "tom cotton", "sentiment": "none"}, {"name": "carlos barria", "sentiment": "none"}], "locations": [{"name": "haiti", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "arkansas", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "cbs", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Carlos Barria | Reuters President Donald Trump speaks during an announcement on immigration reform accompanied by Senator Tom Cotton (R-AR) (L) and Senator David Perdue (R-GA) (R), in the Roosevelt Room of the White House in Washington, August 2, 2017. A Republican senator is insisting that President Donald Trump did not use a vulgar term in referring to African countries during a closed-door meeting on immigration that he and five other senators attended last week.\nGeorgia Senator David Perdue called reports describing Trump as using vile language in the meeting a \"gross misrepresentation\" and said Democratic Sen. Dick Durbin and Republican Sen. Lindsey Graham were mistaken in indicating that was the case.\nThe Washington Post, citing people brief on the meeting, reported last week that Trump referred to Haiti and African nations as s---thole countries, setting of a political firestorm.\nBut Perdue said Sunday on ABC's \"This Week: \"I am telling you that he did not use that word. And I'm telling you it's a gross misrepresentation.\"\nTweet\nIn a separate televised appearance, Arkansas Senator Tom Cotton also defended the president. Cotton told CBS' Face The Nation that he did not hear Trump call Haiti and African nations s---thole countries.\nTweet\nThe senator then accused Durbin of misrepresenting what happened at the meeting.\nTweet\nPerdue and Cotton had previously issued a statement saying they \"do not recall the President saying those comments specifically.\"\nHowever, Republican Senator Lindsey Graham has declined to defend the president , and in a statement last week did not deny that Trump made disparaging remarks about Haiti and African nations.\nGraham, who was also at the meeting, effectively backed Durbin, who called Trump out for saying \"hate-filled things.\"\nHere's Graham's full statement:\n\"Yesterday Senator Durbin and I met with President Trump at the White House to discuss our bipartisan proposal on border security and immigration.\n\"Following comments by the President, I said my piece directly to him yesterday. The President and all those attending the meeting know what I said and how I feel. I've always believed that America is an idea, not defined by its people but by its ideals.\n\"The American ideal is embraced by people all over the globe. It was best said a long time ago, E Pluribus Unum – Out of Many, One. Diversity has always been our strength, not our weakness. In reforming immigration we cannot lose these American Ideals.\n\"The American people will ultimately judge us on the outcome we achieve, not the process which led to it.\n\"I know the bipartisan proposal discussed at the White House can get a lot of support from both sides. As always, I look forward to considering additional ideas that could make the proposal even better.\n\"I appreciate Senator Durbin's statements and have enjoyed working with him and many others on this important issue. I believe it is vitally important to come to a bipartisan solution to the immigration and border challenges we face today. I am committed to working with Republicans and Democrats to find common ground so we can move forward.\"\nWorld leaders have since denounced Trump's comments as racist and insensitive, with even some in the GOP criticizing his remarks.\nCNBC's Spencer Kimball contributed to this report.", "external_links": [], "published": "2018-01-14T21:05:00.000+02:00", "crawled": "2018-01-14T21:05:27.000+02:00", "highlightTitle": ""}