{"organizations": [], "uuid": "77bee75f2b52f489f99341f83e942dfa691cd732", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/08/04/103845613-GettyImages-542372227.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/08/how-to-rewire-your-brain-for-success-according-to-neuroscience.html", "country": "US", "domain_rank": 767, "title": "How to rewire your brain for success, according to neuroscience", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T19:23:00.000+02:00", "replies_count": 0, "uuid": "77bee75f2b52f489f99341f83e942dfa691cd732"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/08/how-to-rewire-your-brain-for-success-according-to-neuroscience.html", "ord_in_thread": 0, "title": "How to rewire your brain for success, according to neuroscience", "locations": [], "entities": {"persons": [{"name": "michael merzenich", "sentiment": "none"}, {"name": "warren buffett", "sentiment": "none"}, {"name": "elle kaplan", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The way our brains function is critical for every inch of our being. Thanks to recent studies, it has been discovered that rewiring your brain could result to dramatic changes leading to success, as explained by neuroscientist Michael Merzenich .\nThe brain has been proven to filter what we can remember and the information that we want to absorb, hence, a person should direct his/her focus on what is essential to their specific life goals. Furthermore, it has also been confirmed that humans unconsciously continue to create new neurons by performing mental activities.\nMore from Elle Kaplan: \nWhy Warren Buffett's 10/10/10 Rule will make you insanely successful and wealthy \n10 things you should give up if you want to be exceptionally successful \nAdopting this simple habit will make you insanely successful and wealthy, according to studies \nYou have the power in you to improve your brain's performance through mental training that will impact your overall performance. Start developing your brain to make it an essential tool to achieve more success through these mental practices:\n1. Engage in brain aerobics Regardless of your age, there is an appropriate brain activity that will suit you and your lifestyle. It can be as simple as doing crossword puzzles, playing chess, or any activity that will encourage thinking.\nshow chapters This CEO wants to put a computer chip in your brain      10:35 AM ET Wed, 12 April 2017 | 01:15 Based from studies, uber-successful people allot 15 to 30 minutes of their day to think, which has shown a correlation to the amount of success that they have.\n\"What does it take to be a successful entrepreneur? It takes willingness to learn , to be able to focus, to absorb information, and to always realize that business is a 24/7 job…\" — Mark Cuban\nStart your day by exercising your mind to ensure that it stays in shape and is capable of weathering your daily challenges.\n2. Find fresh ideas Feed your mind with fresh new ideas every single day and get involved in things that you find interesting. For instance, you are curious about a certain sport, find time to learn it until it becomes a habit. This will challenge not only your physical limitations, but will also strengthen your mental power.\nContinuous learning equates to personal growth that will teach your mind the focus it needs to be able to function well despite the numerous tasks you have on your to-do list. According to Jack Welch, success is all about growing yourself, so don't settle on what you know and what you have. Find opportunities to improve and develop new skills, and prepare to go further in life.\n3. Envision the person you want to become Spend time visualizing how you want to be by the time you reach a certain age. In doing so, you attract the needed energy to make this vision a reality. Moreover, it also projects the kind of attitude that is required of you to become this person.\nImagining your success empowers you to work towards your goals even on days that you feel discouraged.\nshow chapters Oxford neuroscientist: These futuristic brain enhancements will be available sooner than you think      1:01 PM ET Mon, 11 Dec 2017 | 01:00 Visualizing is a powerful activity that prepares your mind for opportunities that you will encounter in your pursuit of ultimate success.\n4. Focus on your long-term goals The reason why there are people who don't succeed is because they fail to establish a concrete long-term goal .\nIf you don't look forward to anything in this life, it becomes meaningless no matter how excellent you are in what you do. In some cases, there are people who get swayed by present circumstances causing them to change their plans from time to time, which will definitely hinder their success.\nTrain your mind to always be ahead by anticipating what you will gain in the future if you stick to your game plan versus being uncertain in your decisions and actions.\n5. Shift to an exponential mindset Many people don't know that changing one's mindset could lead to significant growth.\nAn exponential mindset takes thinking to the next level as it aspires for greater things (ten times bigger than how a normal person would imagine). You anticipate faster growth because you can already see it coming, even the failures , you consider them part of the equation but you always end up being ten times ahead preparing for anything that you have to deal with in the future, may it be positive or not.\nElle Kaplan is the Founder and CEO of LexION Capital , a fiduciary wealth management firm in New York City serving high-net-worth individuals. She is also the Chief Investment Officer and Founder of LexION Alpha . \nLike this story? Like CNBC Make It on Facebook ! \nDon't miss: Oxford neuroscientist: These futuristic brain enhancements will be available sooner than you think \nThis article originally appeared on Medium. \nshow chapters Entrepreneur: If you're this kind of person you should lead — not follow      3:52 PM ET Thu, 6 Oct 2016 | 01:36", "external_links": [], "published": "2018-01-08T19:23:00.000+02:00", "crawled": "2018-01-08T19:39:47.052+02:00", "highlightTitle": ""}