{"organizations": [], "uuid": "7b73760aa39adda7d64bbd640ca8d7287cb9291b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223801245&w=1200&r=LYNXMPEE0K04Q", "site_section": "http://www.reuters.com/resources/archive/us/20180121.html", "section_title": "Archive News &amp; Video for Sunday, 21 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/india-stock-markets-weekahead/india-markets-weekahead-focus-turns-to-budget-expect-volatility-idUSKBN1FA04F", "country": "US", "domain_rank": 408, "title": "India Markets Weekahead: Focus turns to budget; expect volatility", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T14:24:00.000+02:00", "replies_count": 0, "uuid": "7b73760aa39adda7d64bbd640ca8d7287cb9291b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/india-stock-markets-weekahead/india-markets-weekahead-focus-turns-to-budget-expect-volatility-idUSKBN1FA04F", "ord_in_thread": 0, "title": "India Markets Weekahead: Focus turns to budget; expect volatility", "locations": [], "entities": {"persons": [], "locations": [{"name": "india", "sentiment": "none"}], "organizations": [{"name": "dipp", "sentiment": "none"}, {"name": "fiis", "sentiment": "none"}, {"name": "indian banking association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Markets continued their relentless march upward with the Nifty hitting the 10,900 mark and the Sensex surpassing 35,500 levels. Sentiment was aided by the government’s decision to cut its additional borrowing requirement and a cut in GST rates of 29 goods and 54 services.\nMedia reports that the government was considering raising the FDI cap in banks led to a rally in banking stocks. Also, initial set of corporate results met expectations, showing that an earnings recovery is underway. Overall, the broader market was weak compared to the benchmark indices as the mid-cap and small-cap segments sharply under-performed by falling 2 percent and 2.7 percent respectively.\nFor the week, FIIs were net buyers to the tune of 42 billion rupees ($658 million) while DIIs were net sellers to the tune of 7 billion rupees. On the currency front, the rupee fell, trading at almost 64 against the dollar.\nThe banking sector was in focus after media reports suggested that the finance ministry, DIPP and Indian Banking Association are considering a proposal to increase the FDI limit in state-owned banks to 49 percent from the current 20 percent, and other banks to 100 percent from 74 percent. Subsequent reports where government officials said an increase in FDI limits was not being considered had little impact, with banking stocks maintaining their gains.\nOn the earninsg front, Hindustan Unilever beat market expectations while other heavyweights like HDFC Bank, ITC, Yes Bank and HCL Tech met estimates. Airtel and Hindustan Zinc performed below expectations.\nOn the macro front, India’s trade deficit came in at $14.8 billion in December vs $13.82 billion the previous month. December imports stood at $41.9 billion while exports reached $27 billion. WPI inflation for the month of December eased from eight-month high levels to 3.58 percent from 3.93 percent in November.\nOn Monday, markets are expected to react to Reliance Industries’ results. The conglomerate posted a 25 percent growth in consolidated net profit at 94.23 billion rupees. Its telecom arm Jio turned profitable, showing a profit of 5.2 billion rupees for Q3 FY18 against a loss of 2.71 billion rupees in the previous quarter.\nIn the coming week, prominent companies like Asian Paints, Axis Bank, UPL, Jindal Steel, Biocon, Indiabulls Housing Finance, Dr Reddy’s Labs and Maruti Suzuki will announce their results.\nAs the countdown to the Union Budget begins, expect markets to be volatile. The expiry of derivatives contracts on Thursday will also add to the volatility.\nFinance Minister Arun Jaitley will present the budget on Feb 1 - the first one after implementation of GST and the last before the general election in 2019 – where the government is expected to roll out some populist schemes to appease voters. However, I expect this budget to be a judicious mix of populism and reforms. Some of the broader themes that the markets are currently focussing on are rural and urban consumption, affordable housing and a boost in infrastructure. The possibility of corporate tax rationalisation is also doing the rounds.\nRumours about tax on long-term capital gains have subsided though still a risk for the markets. The government is likely to report a miss on the fiscal front with deficit at 3.4 percent of GDP in FY18 instead of its targeted 3.2 percent.\nThe week ahead will see two major central bank decisions beginning with the Bank of Japan on Tuesday and the European Central Bank on Thursday. Though markets expect a status quo on the long-standing negative interest rates, investors will watch for any indications from the central banks to wind down their massive stimulus programmes. Focus will also be on the U.S., where the federal government officially shut down after Republicans and Democrats failed to agree on a last-minute deal to fund government operations.\nIf the political standoff continues in the U.S., repercussions would be felt in global markets. Additionally, Indian markets would be in pre-budget mode in the penultimate week. The Nifty could attempt to touch the 11,000 mark before the budget despite a weakness in the broader market.\nAbout the Author Ambareesh Baliga has about 25 years of experience in the stock market and has worked with Karvy and Kotak groups in the past. He is a regular market commentator on various business channels. He is a commerce graduate from Calcutta University and a qualified cost accountant.\nThe views expressed in this article are not those of Reuters News.\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-21T14:24:00.000+02:00", "crawled": "2018-01-22T20:43:16.046+02:00", "highlightTitle": ""}