{"organizations": [], "uuid": "7fab06592cfd898e0601339379bda0ffddc892e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180111.html", "section_title": "Archive News &amp; Video for Thursday, 11 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/markets-china-bonds/panda-bond-sales-slump-in-2017-but-modest-bounce-may-beckon-this-year-idUSL8N1P55DI", "country": "US", "domain_rank": 408, "title": "Panda bond sales slump in 2017 but modest bounce may beckon this year", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T20:25:00.000+02:00", "replies_count": 0, "uuid": "7fab06592cfd898e0601339379bda0ffddc892e8"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/markets-china-bonds/panda-bond-sales-slump-in-2017-but-modest-bounce-may-beckon-this-year-idUSL8N1P55DI", "ord_in_thread": 0, "title": "Panda bond sales slump in 2017 but modest bounce may beckon this year", "locations": [], "entities": {"persons": [{"name": "ying gu", "sentiment": "none"}, {"name": "gu", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "jp morgan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON, Jan 11 (Reuters) - Sales of ‘Panda’ bonds in China slumped almost 40 percent last year as Beijing’s tighter money transfer rules and rising market borrowing costs reduced their appeal, but there are some signs sales may get a modest bounce in 2018.\nAccording to data from JP Morgan, Panda issuance dropped to 71 billion yuan ($11 billion) last year from 116 billion yuan in 2016 - when it saw an almost nine-fold increase.\nEmerging market strategist Ying Gu at JP Morgan attributed the plunge to several factors, all related to China’s recent efforts to rein in more unruly areas of credit growth.\nCalling it a “bear market circumstance” Gu said higher bond yields - or borrowing costs - in Chinese debt markets had “trimmed the attractiveness” of Panda bonds for foreign issuers who had previously been drawn in by their low funding costs.\nBenchmark money market rates spiked to almost 5 percent, their highest since 2015, late last year. A clampdown, or in his words some “policy tightening”, on selected Panda bond issuers also had a negative impact, Gu said.\nThe strong growth in the Panda bond market in 2015 and 2016 was driven mostly by banks, real estate companies and overseas subsidiaries of Chinese companies.\nOther than Daimler, HSBC and Standard Chartered, though, few were uniquely foreign. Strict currency outflow controls put in place by Beijing also complicates repatriation of profits for foreign investors, another big minus for Panda bonds.\nThere are some hopes though that the restrictions could be loosened this year if the yuan can avoid the kind of lurches it saw in 2015 and 2016 when worries about the health of China’s economy flared.\nSigns have been tentatively encouraging. The Washington DC-based IIF said this week that net capital outflows from China were expected to have been a relatively modest $60 billion last year compared with $640 billion in 2016.\n“I hear that 2018 is when we are going see a push on that (easing currency control),” said Isabelle Laurent, the head of funding at international development bank, the EBRD, that China is now a shareholder of.\n“The view is 2018 is likely to be the year where there’s going to be greater flexibility.”\nJP Morgan’s Gu also sees some improvement ahead. Hungary sold a 1 billion yuan Panda bond in 2017, following Poland and Korea in 2016. The Philippines has signalled it will do so this year, and Portugal has made similar noises.\n“Going into 2018, we see a modest rebound of Panda bond issuance with full year forecast at 90 billion yuan ($14 billion),” Gu said.\nAlthough the headwinds for the Panda bond market will still be there, he expects more stability in the Chinese bond market which should help rekindle demand.\nBeijing has also started simplifying Panda bond rules for government, financial institution and corporate issuers from countries supporting its ambitious “One Belt, One Road” infrastructure plan. Big development banks could benefit from these changes, too.\n“This could provide further impetus for the development of the Panda bond market this year,” Gu said.\nThe Panda market’s popularity has coincided with a decline in sales of dim sum bonds - yuan debt sold offshore in markets such as Hong Kong or London.\nGu did not provide figures for dim sum bond issuance, but ThomsonReuters data shows sales worth $6.42 billion last year - less than a third of 2016 volumes and a fraction of what they were in 2014. ($1 = 6.5055 Chinese yuan renminbi) (Additional reporting by Fanny Potkin; Editing by Hugh Lawson)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-11T20:25:00.000+02:00", "crawled": "2018-01-12T18:46:35.034+02:00", "highlightTitle": ""}