{"organizations": [], "uuid": "cdddf0c6930e745bd875036176200df9f0c8515d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-health-glaucoma-hot-tea/drinking-hot-tea-linked-to-lowered-glaucoma-risk-idUKKBN1EQ17H", "country": "US", "domain_rank": 408, "title": "Drinking hot tea linked to lowered glaucoma risk", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-01T20:43:00.000+02:00", "replies_count": 0, "uuid": "cdddf0c6930e745bd875036176200df9f0c8515d"}, "author": "", "url": "https://uk.reuters.com/article/us-health-glaucoma-hot-tea/drinking-hot-tea-linked-to-lowered-glaucoma-risk-idUKKBN1EQ17H", "ord_in_thread": 0, "title": "Drinking hot tea linked to lowered glaucoma risk", "locations": [], "entities": {"persons": [{"name": "carolyn crist", "sentiment": "none"}, {"name": "anne coleman", "sentiment": "none"}, {"name": "coleman", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}, {"name": "world health organization", "sentiment": "none"}, {"name": "university of california", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 1, 2018 / 6:44 PM / Updated 2 hours ago Drinking hot tea linked to lowered glaucoma risk Carolyn Crist 4 Min Read \n(Reuters Health) - People who drink hot tea daily may be less likely than others to develop glaucoma symptoms, U.S. researchers say. \nCompared to coffee, soft drink and iced tea drinkers, study participants who consumed a cup or more of hot caffeinated tea daily had 74 percent lower odds of having glaucoma, the study authors report in the British Journal of Ophthalmology. \n“Glaucoma can lead to blindness, and it would be great if it could be prevented because there is no cure,” said lead author Dr. Anne Coleman of the University of California, Los Angeles. \n“The best way to prevent it is to get your eyes checked,” Coleman told Reuters Health in a telephone interview. “But we are also interested in lifestyle habits and what we can do to make a difference.” \nGlaucoma is the second leading cause of blindness worldwide, according to the World Health Organization, affecting an estimated 58 million people. That includes more than three million Americans, only half of whom are aware they have the disease, according to the Glaucoma Research Foundation. \nCoffee, or caffeine in general have previously been linked to increased glaucoma risk, although recent studies don’t agree, Coleman and her colleagues write. \nTo evaluate the relationship between specific caffeinated drinks and glaucoma, Coleman and colleagues analyzed data on a sample of more than 10,000 people in the U.S. who were representative of the entire population. Participants in the National Health and Nutrition Examination Survey during 2005-2006 answered questions about their diets and lifestyles, had medical exams and blood tests and also underwent eye examinations. \nAbout 1,700 participants were over age 40, had no other known eye diseases and had full eye examination results from the survey. In this group, Coleman’s team found that just over 5 percent, 82 people, had glaucoma. \nAlmost half of participants reported drinking coffee often, but less than 10 percent drank hot tea daily. The research team found no associations between coffee, iced tea, decaffeinated tea or soft drink consumption and the likelihood of having glaucoma. \n“Tea drinkers should keep drinking and don’t need to stop because of a fear of glaucoma,” Coleman said. “This makes sense, but we’ll see if it holds up in future studies.” \nFuture studies should look at the habits, activities and nutrition that affect lifestyle and glaucoma risks, said Idan Hecht of Tel-Aviv University in Israel, who wasn’t involved in the research. \n“In the past few years, there has been a tremendous increase in interest, and subsequently research, into the ways lifestyle changes can influence diseases,” Hecht told Reuters Health by email. \nRecent research indicates that vitamins C, E and zinc can help vision. Other studies indicate that antioxidants in tea could have similar effects, he noted. \n“Patients can and should be involved and take an active role in the management of their ailments,” Hecht said. “Exercising, eating healthy and trying novel ways to improve your health is something you should definitely explore and bring up with your physician.” \nEnvironmental factors could play a role in glaucoma risk as well, said Dr. Ahmad Aref at the University of Illinois at Chicago. \n“As our population grows older, we need to think about the other factors that could help, particularly when it comes to the health benefits of physical activity,” he told Reuters Health by phone. \nOverall, both medical and non-medical approaches are key to treating the disease in the future, Aref added. \n“It’s a tough disease because we don’t have a way to bring vision back once it’s lost,” he said. “All we can do is prevent it from getting worse, and we want to help patients do that.” \nSOURCE: bit.ly/2Bszp7c British Journal of Ophthalmology, online December 14, 2017.", "external_links": [], "published": "2018-01-01T20:43:00.000+02:00", "crawled": "2018-01-01T21:23:23.007+02:00", "highlightTitle": ""}