{"organizations": [], "uuid": "6bfa3394d79517d0340aa0c02e2580f95831a313", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-gene-villeneuve-named-svp-of-pythians-tehama-business-unit.html", "country": "US", "domain_rank": 767, "title": "Gene Villeneuve Named SVP of Pythian's Tehama Business Unit", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T18:28:00.000+02:00", "replies_count": 0, "uuid": "6bfa3394d79517d0340aa0c02e2580f95831a313"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-gene-villeneuve-named-svp-of-pythians-tehama-business-unit.html", "ord_in_thread": 0, "title": "Gene Villeneuve Named SVP of Pythian's Tehama Business Unit", "locations": [], "entities": {"persons": [{"name": "gene villeneuve", "sentiment": "negative"}, {"name": "tehama", "sentiment": "none"}, {"name": "villeneuve", "sentiment": "none"}], "locations": [{"name": "tehama", "sentiment": "none"}, {"name": "ottawa", "sentiment": "none"}], "organizations": [{"name": "tehama business unit technology", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Technology leader to drive growth of Tehama cloud-based platform\nOTTAWA, Jan. 30, 2018 /PRNewswire/ - Pythian, a global technology company specializing in data and cloud, today announced the appointment of Gene Villeneuve to the role of Senior Vice President of Tehama, a business unit of Pythian which is launching in 2018. In his new role, Villeneuve will direct the strategy, operations and market growth for Tehama.\nTehama is a service delivery platform enabling Pythian to deliver technology services to the world's most security-conscious businesses, fueling remarkable growth and global access to expert skill sets. Tehama enables any buyer or seller of professional services to take advantage of its fast, easy, compliant and secure means of onboarding, managing and scaling contingent workforces. Leveraging Tehama, buyers and sellers of technology services can take advantage of productive, integrated and secure end-user computing environments in minutes, in the cloud. As a result, Tehama provides organizations—especially those in regulated industries—flexible and secure access to the best expert talent from across the globe.\n\"Gene brings a quarter-century of success in the technology industry and game-changing product and go-to-market know-how to Pythian, making him a tremendous asset to the team,\" said CEO, Paul Vallée. \"With Gene's leadership at work, we expect our acclaimed Tehama platform to permit countless customers and service providers to securely exchange services without compromising productivity and, perhaps most importantly, seamlessly mitigate compliance risks thanks to our ever-improving, robust security posture.\"\nPreviously, Villeneuve held several executive positions at IBM, most recently as Worldwide Director of Lab Services for Financial Crimes Insight Solutions in the Watson Financial Services Solutions division. He has also held executive roles at Cognos, SAP (Business Objects), and OLAP@Work.\n\"I am thrilled to move from one burgeoning technology to a new industry that has the same forward-thinking mentality,\" said Villeneuve. \"This is a tremendous opportunity to apply my knowledge in Artificial Intelligence and bring this innovative and disruptive mindset to lead Tehama. I am honoured to join the Tehama team, and humbled by the quality and value that they have already delivered. Together we will deliver incredible value to businesses looking to build resilience and agility to stay ahead in today's market.\"\nAbout Tehama\nTehama is the fastest, simplest, and most flexible approach to delivering secure and integrated digital end-user computing (EUC) available today. Our service delivery platform enables organizations to easily onboard, manage, and scale their remote your distributed workforce, by providing \"ready to work\" integrated and secured EUC environments with controlled access and monitoring—connecting new workers in minutes, not months. The result is decreased time to value, decreased operational costs, and a flexible work model that lets you move at the speed of today's world.\nThe Tehama platform is currently in private beta and launching publicly in the second half of 2018. For a demo or your early access invitation, visit tehama.io or write us at concierge@tehama.io .\nAbout Pythian\nPythian is a global technology company that helps businesses leverage disruptive technologies to better compete. Our services and software solutions unleash the power of cloud, data and analytics to drive better business outcomes. Our 20 years in data, commitment to hiring the best talent, and our deep technical and business expertise allow us to meet our client promise of using technology to deliver the best outcomes faster.\nSOURCE The Pythian Group Inc", "external_links": [], "published": "2018-01-30T18:28:00.000+02:00", "crawled": "2018-01-30T18:33:08.001+02:00", "highlightTitle": ""}