{"organizations": [], "uuid": "21f4f996baa233f3878470fb24b8474254480bc9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180120&t=2&i=1223662978&w=1200&r=LYNXMPEE0J0N0", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-lei-wat/vardy-penalty-mahrez-strike-help-leicester-beat-watford-idUKKBN1F90W1", "country": "US", "domain_rank": 408, "title": "Vardy penalty, Mahrez strike help Leicester beat Watford", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T19:24:00.000+02:00", "replies_count": 0, "uuid": "21f4f996baa233f3878470fb24b8474254480bc9"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-lei-wat/vardy-penalty-mahrez-strike-help-leicester-beat-watford-idUKKBN1F90W1", "ord_in_thread": 0, "title": "Vardy penalty, Mahrez strike help Leicester beat Watford", "locations": [], "entities": {"persons": [{"name": "vardy", "sentiment": "negative"}, {"name": "mahrez", "sentiment": "negative"}, {"name": "harry maguire", "sentiment": "none"}, {"name": "molla wague", "sentiment": "none"}, {"name": "heurelho gomes", "sentiment": "none"}, {"name": "toby davis", "sentiment": "none"}, {"name": "jamie vardy", "sentiment": "none"}, {"name": "shrivathsa sridhar", "sentiment": "none"}, {"name": "karnezis", "sentiment": "none"}, {"name": "riyad mahrez", "sentiment": "none"}, {"name": "orestis karnezis", "sentiment": "none"}, {"name": "andre gray", "sentiment": "none"}], "locations": [{"name": "leicester city", "sentiment": "none"}, {"name": "watford", "sentiment": "none"}, {"name": "bengaluru", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}], "organizations": [{"name": "leicester", "sentiment": "negative"}, {"name": "watford", "sentiment": "negative"}, {"name": "watford reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "leicester city", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 20, 2018 / 5:29 PM / Updated 21 minutes ago Vardy penalty, Mahrez strike help Leicester beat Watford Reuters Staff 3 Min Read \n(Reuters) - A well-taken first-half penalty from striker Jamie Vardy and an injury-time goal from midfielder Riyad Mahrez gave Leicester City a 2-0 win over Watford in an entertaining Premier League game on Saturday. \nVardy, who was brought down in the Watford box as he looked to skip past Malian defender Molla Wague, picked himself up to neatly place his shot past goalkeeper Orestis Karnezis and give his side the lead in the 39th minute. \nMahrez then slotted a left-footed shot past Karnezis, who replaced the injured Heurelho Gomes, in the first minute of added time as Watford pushed bodies forward in search of an elusive equaliser. \nWatford’s best chance fell to substitute Andre Gray in the 74th minute but the striker’s fierce shot from inside the box was blocked by Leicester defender Harry Maguire. \nLeicester could have gone in front in the fifth minute but Vardy, who chased down forward Shinji Okazaki’s lofted pass and shook off his marker with ease, shot straight at Karnezis from close range. \nKarnezis came to Watford’s rescue again minutes later, saving on the line from Leicester midfielder Wilfred Ndidi after Okazaki headed the ball back across goal from a free kick. Soccer Football - Premier League - Leicester City vs Watford - King Power Stadium, Leicester, Britain - January 20, 2018 Watford's Troy Deeney and Andre Gray applaud the fans after the match Action Images via Reuters/Matthew Childs \nWith Leicester dominating possession, Watford adopted a more direct approach to goal as the match wore on but failed to find a way through the home side’s defence. \n“We’re satisfied... because it’s good reward for the players and their hard work. We knew it would be a difficult game against a powerful team, but we responded well to the battle,” Leicester manager Claude Puel said. Soccer Football - Premier League - Leicester City vs Watford - King Power Stadium, Leicester, Britain - January 20, 2018 Watford manager Marco Silva Action Images via Reuters/Matthew Childs \n”The run of games over Christmas and New Year was hard, but we’re coming through now with clean sheets and victories. If we can maintain a positive attitude, the signs are good. \n“It would have been nice to score more goals because we had a lot of chances, but in the end it’s a good victory against a good team,” Puel added. \nLeicester are level on 34 points with Burnley, who lost 1-0 to Manchester United on Saturday, but climbed above them to seventh in the table with a better goal difference. \nWatford, who have now lost three of their last four league games, remain 10th with 26 points. Reporting by Shrivathsa Sridhar in Bengaluru; Editing by Toby Davis", "external_links": [], "published": "2018-01-20T19:24:00.000+02:00", "crawled": "2018-01-20T19:41:14.006+02:00", "highlightTitle": ""}