{"organizations": [], "uuid": "16fde2b55d5fe6c0b34e92714d8bf4e8a6267ebb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/india-soymeal-exports/indias-soymeal-exports-could-fall-a-fifth-as-prices-rally-dealers-idINKBN1F70NI", "country": "US", "domain_rank": 408, "title": "India's soymeal exports could fall a fifth as prices rally: dealers", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T08:54:00.000+02:00", "replies_count": 0, "uuid": "16fde2b55d5fe6c0b34e92714d8bf4e8a6267ebb"}, "author": "", "url": "https://in.reuters.com/article/india-soymeal-exports/indias-soymeal-exports-could-fall-a-fifth-as-prices-rally-dealers-idINKBN1F70NI", "ord_in_thread": 0, "title": "India's soymeal exports could fall a fifth as prices rally: dealers", "locations": [], "entities": {"persons": [{"name": "rajendra jadhav", "sentiment": "none"}, {"name": "manoj agrawal", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "argentina", "sentiment": "none"}, {"name": "bangladesh", "sentiment": "none"}, {"name": "vietnam", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}], "organizations": [{"name": "min read  mumbai", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "maharashtra oil extractions pvt ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MUMBAI (Reuters) - India’s soymeal exports could fall by at least a fifth in 2017/18 from a year ago as a rally in local soybean prices and a firmer rupee make shipments from the south Asian country pricey for overseas buyers, industry officials said.\nLower exports from India will help major growers like the United States, Argentina and Brazil increase sales of the animal feed to Asian buyers like Bangladesh, Vietnam and Japan.\n“We are not able to sign new export contracts. The price difference is huge between Indian and the U.S. or South American origin crop,” Manoj Agrawal, managing director at exporter Maharashtra Oil Extractions Pvt Ltd told Reuters.\nSoymeal prices in India have risen over 15 percent in the past two months to $405 per tonne on a free-on-board (FOB) basis following a rally in soybean prices. Global soymeal prices edged up about 1 percent over the same period to $324 a tonne.\nThe country’s soymeal exports could fall to 1.4 million tonnes to 1.6 million tonnes in the 2017/18 marketing year started on Oct. 1, down from 2 million tonnes a year ago, three dealers with global trading firms told Reuters.\nIndia has been a major supplier to countries like Japan, Bangladesh, Nepal and Vietnam, where its meal is sought because of lower freight rates and the ability to supply small quantities, said B.V. Mehta, executive director of a Mumbai-based trade body Solvent Extractors’ Association (SEA).\nIndian meal once accounted for nearly a quarter of Southeast Asian imports, but its share has been falling due to rising local soybean consumption and stagnant production. Soymeal output this year is expected at about 7 million tonnes, with local consumption of 5 million tonnes, the Soybean Processors Association of India (SOPA) estimated.\nIndia’s soymeal exports were robust at the start of the year, jumping more than 14 percent from a year ago to 579,294 tonnes from October to December, according to SOPA data, as soybean prices were subdued early in the season.\nHowever, prices have since jumped and shipping 100,000 tonnes a month from February would be a challenge if soybeans remain at current levels, said a Mumbai-based dealer with a global trading firm, who was not authorized to speak to media.\nSoybean prices surged 17 percent in the past two months due to limited supply and robust demand from oil mills after the government nearly doubled an import tax on edible oils, dealers said.\nA rise in the Indian rupee to a nearly 30-month high has slashed exporters’ margins, said D. N. Pathak, SOPA executive director.\nMehta said some relief has come from a government move in December to raise the incentive for soymeal exports to 7 percent from 5 percent, which will help oil mills offset the impact of strong rupee.\nThe poultry industry is the main domestic buyer of soymeal, and while industry demand has been rising over the past few years it is not sufficient to absorb the country’s entire soymeal output, cautioned exporter Agrawal.\n“More exports are required to keep soymeal and soybean prices stable,” he said.\nReporting by Rajendra Jadhav; editing by Richard Pullin\n ", "external_links": [], "published": "2018-01-18T08:54:00.000+02:00", "crawled": "2018-01-18T09:25:52.001+02:00", "highlightTitle": ""}