{"organizations": [], "uuid": "0f44cc450e6b7566ccef0d7a6505f400b5d4c8f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-uhy-advisors-appoints-eight-new-managing-directors.html", "country": "US", "domain_rank": 767, "title": "UHY Advisors Appoints Eight New Managing Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T18:14:00.000+02:00", "replies_count": 0, "uuid": "0f44cc450e6b7566ccef0d7a6505f400b5d4c8f2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-uhy-advisors-appoints-eight-new-managing-directors.html", "ord_in_thread": 0, "title": "UHY Advisors Appoints Eight New Managing Directors", "locations": [], "entities": {"persons": [{"name": "daniel felstow", "sentiment": "none"}, {"name": "michael kirby", "sentiment": "none"}, {"name": "warren zafrin", "sentiment": "none"}, {"name": "anthony frabotta", "sentiment": "none"}, {"name": "jeffrey hare", "sentiment": "none"}, {"name": "corey massella", "sentiment": "none"}, {"name": "thomas bowen", "sentiment": "none"}, {"name": "amy gallagher", "sentiment": "none"}, {"name": "richard david", "sentiment": "none"}, {"name": "bill rausch", "sentiment": "none"}], "locations": [{"name": "il", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "uhy advisors, inc.", "sentiment": "neutral"}, {"name": "uhy advisors", "sentiment": "none"}, {"name": "uhy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Chicago, IL,Jan. 30, 2018(GLOBE NEWSWIRE) --\nUHY Advisors, Inc. (“UHY Advisors”), one of the nation’s leading professional services firms, announced the appointment of eight new managing directors: Thomas Bowen, Daniel Felstow, Amy Gallagher, Jeffrey Hare, Michael Kirby, Corey Massella, Bill Rausch and Warren Zafrin.\n“We are very pleased to welcome one of our largest classes of new managing directors, some of which who have worked their way up through the ranks at UHY. These outstanding individuals epitomize the opportunity we present to all of our employees to take their career to the next level both from a technical and quality perspective,\" said Anthony Frabotta, UHY Advisors’ chief executive officer and chairman of the board.\nRichard David, chief operating officer of UHY Advisors, adds: “We are excited to see our team expand with the strategic hire of executives with significant professional backgrounds. Their alignment with the firm’s commitment to quality client service, paired with their industry expertise, further strengthens our service offering.”\nThomas Bowen is a managing director of UHY Advisors MI, Inc. and partner of UHY LLP. Mr. Bowen manages a team of professionals dedicated to providing high quality attest, tax and consulting services to a diverse client base in the manufacturing and distribution, real estate, construction and professional services industries. He works closely with business owners, CFOs and controllers in developing and implementing innovative business strategies to minimize risk, maximize profits, preserve wealth and reduce taxes. Mr. Bowen received his B.S. in Accounting Information Systems from Eastern Michigan University and is a licensed CPA in the state of Michigan. He has been with the firm and its predecessors since 1990.\nDaniel Felstow is a managing director of UHY Advisors MI, Inc. and partner of UHY LLP. Mr. Felstow built his practice in the manufacturing and construction industries as well as co-leads the firm’s national auto dealership consulting group. He specializes in estate tax and business succession planning, tax strategies, financing assistance and mergers and acquisitions. Mr. Felstow received his B.S. in Accounting from Oakland University and is a licensed CPA in the state of Michigan. He is on the board of directors for the Sterling Heights Regional Chamber of Commerce and Industry and a member of the Kiwanis Club of Utica-Shelby Township. Mr. Felstow is the chairperson for the MICPA’s Automotive Dealers Task Force and actively involved in the Driving Force Auto Dealer Consulting Group, a national network of professional services firms that provide integrated tax, accounting and business consulting solutions to automotive dealers. He has been with the firm and its predecessors since 1988.\nAmy Gallagher is a managing director of UHY Advisors GA, Inc. and leader of the resource solutions group in Atlanta, which provides management level accounting and finance interim support, and direct hire search services. She has a passion for talent recruitment and is committed to client satisfaction that builds a corporate reputation in the consultant marketplace of loyalty and integrity. Ms. Gallagher received her B.S. from Michigan State University. She serves as a mentor with the Kennesaw State University’s Coles Business School Scholars Program, is a member of the Professional Women’s Alliance, and served on the board of APICS, earning the APICS President’s Distinguished Leadership Award and Company of the Year.\nJeffrey Hare is a managing director of UHY Advisors GA, Inc. Mr. Hare has over 25 years of experience implementing business intelligence, activity based costing, and financial systems in corporate and government projects. Mr. Hare is responsible for project management for the firm’s implementations and manages resources to make sure that each client has the right mix of talent and projects are completed on time and within budget. He received his B.S. in Business Administration with a major in Accounting from Pennsylvania State University and M.B.A. from New York University. Mr. Hare is a registered CPA in the state of Connecticut.\nMichael Kirby is a managing director of UHY Advisors Mid-Atlantic MD, Inc. and partner of UHY LLP. Mr. Kirby has over 30 years of financial advisory and tax experience and specializes in providing services to clients in a wide variety of industries with emphasis in construction, technology, government contracting and real estate. He assists government contractors with establishment of cost rates and submission of incurred costs to DCAA, as well as on Federal Acquisition Regulation (FAR) issues. Mr. Kirby received his B.S. in Accounting from Towson State University and is a licensed CPA in the states of Maryland and Virginia.\nCorey Massella is a managing director of UHY Advisors NY, Inc. and partner of UHY LLP. Mr. Massella is focused on business consulting, audit and tax services for clients in a variety of industries with an emphasis in private equity funds, technology and financial services. He has over 25 years of experience, including completing over 300 M&A transactions and advising high profile C-suite executives and boards at public and private companies regarding SEC accounting and audit services. Mr. Massella received his B.S. in Accounting and Finance from the State University of New York at Buffalo, School of Management, and is a licensed CPA in the state of New York.\nBill Rausch is a managing director of UHY Advisors GA, Inc. and a leader in the accounting automation practice which provides transformation technologies for the office of finance. Originally from New Jersey, he received his B.S. from Rutgers University. Prior to joining UHY, Mr. Rausch was the founder and managing director for Bright Point Consulting, a boutique professional services firm focused on enabling technologies for finance and accounting professionals. He has more than 20 years of experience with enterprise performance management, enterprise resource planning solutions, business intelligence and data integration solutions. Mr. Rausch is frequently called upon to speak to finance and accounting professionals about market leading and emerging technologies.\nWarren Zafrin is a managing director of UHY Advisors NY, Inc. and the leader of the firm’s risk advisory services group. Mr. Zafrin has over 20 years of experience advising management teams at multinational organizations in the areas of cybersecurity, technology, infrastructure, block chain, financial crime prevention and cloud infrastructure. He earned his B.A. in Economics at New York University, holds an M.P.A. in Finance and Financial Services from New York University’s Wagner School of Public Policy and an M.B.A., C.I.S. from Baruch Zicklin School of Business. Mr. Zafrin is frequently called upon to lecture on using emerging technology to combat cybercrime, money laundering financial fraud and business resilience.\n# # #\nAbout UHY Advisors\nUHY Advisors provides tax and advisory services to entrepreneurial and other organizations, principally those enterprises in the dynamic middle market. UHY LLP, a licensed CPA firm, provides audit and other attest services to publicly traded, privately owned and nonprofit organizations in a number of industry sectors. UHY Advisors, operating in an alternative practice structure with UHY LLP, forms one of the largest professional services firms in the US. While that scale might provide confidence for some clients, others tell us our greatest value is the way we bring these resources to bear to help address today’s evolving business challenges. It’s a philosophy we call “The Next Level of Service”. To learn more visit www.uhy-us.com .\nAll of the above entities are members of Urbach Hacker Young International Limited (“UHYI”), a worldwide network of independent professional services firms that provide audit, tax and advisory services around the globe. UHYI is ranked among the top international accountancy networks and a proud member in good standing of the Forum of Firms. Collectively, the US operating entities (UHY Advisors and UHY LLP) are the largest independent members of UHYI with significant participation, bringing the power of the international network to serve the individualized needs of US clients.\nUHY Advisors, Inc. provides tax and business consulting services through wholly owned subsidiary entities that operate under the name of “UHY Advisors.” UHY LLP is a licensed independent CPA firm that performs attest services in an alternative practice structure with UHY Advisors, Inc. and its subsidiary entities. UHY Advisors, Inc. and its subsidiary entities are not licensed CPA firms. UHY Advisors, Inc. and UHY LLP are US members of UHYI, a UK company, and form part of the international UHYI network of legally independent accounting and consulting firms. “UHY” is the brand name for the UHYI international network. Any services described herein are provided by UHY Advisors, Inc. and/or UHY LLP (as the case may be) and not by UHYI or any other member firm of UHYI. Neither UHYI nor any member of UHYI has any liability for services provided by other members.\nAttachments:\nA photo accompanying this announcement is available at http://www.globenewswire.com/NewsRoom/AttachmentNg/5944000f-7b00-405a-ad98-e5c0c60617ef\nChris Clark UHY LLP 586-843-2637 CClark@uhy-us.com\nSource:UHY LLP", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/5944000f-7b00-405a-ad98-e5c0c60617ef/en", "https://www.globenewswire.com/Tracker?data=9FjJGsep6tHfPdMgVw5Bwxrrt1Aa8qA5A2JjRcUlswDk9DaWSBoUY1WjPo7OX9cENNh-OBkCSpDryaW5h1eIH1P-jgo_Ul3H1LV21QDiGuveLVwX7BWSU4YDLeYij_J_6kSPlvw7TXhba7FGVaE1EK8tV8MSsIOss2rdKrEENuSXSgmsrz0sZXE3tM67GSOdGcYt7Vxq1b7P5P9DOalCPnBFIXFSBVlu3k8fOmlwcWWKj_VllHQVTBk7Zqyq4r7dS_wBgmPCCsnB2F834nHoww==", "http://www.globenewswire.com/NewsRoom/AttachmentNg/5944000f-7b00-405a-ad98-e5c0c60617ef"], "published": "2018-01-30T18:14:00.000+02:00", "crawled": "2018-01-30T18:32:59.004+02:00", "highlightTitle": ""}