{"organizations": [], "uuid": "21874ef2524ade0b6197a2413044ea431b23b51d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/business-wire-jbg-smith-reports-taxable-composition-of-2017-dividends.html", "country": "US", "domain_rank": 767, "title": "JBG SMITH Reports Taxable Composition of 2017 Dividends", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.009, "site_type": "news", "published": "2018-01-19T00:30:00.000+02:00", "replies_count": 0, "uuid": "21874ef2524ade0b6197a2413044ea431b23b51d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/business-wire-jbg-smith-reports-taxable-composition-of-2017-dividends.html", "ord_in_thread": 0, "title": "JBG SMITH Reports Taxable Composition of 2017 Dividends", "locations": [], "entities": {"persons": [], "locations": [{"name": "md.", "sentiment": "none"}, {"name": "washington, dc", "sentiment": "none"}], "organizations": [{"name": "jbg", "sentiment": "negative"}, {"name": "jbg smith", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHEVY CHASE, Md.--(BUSINESS WIRE)-- JBG SMITH (NYSE: JBGS), a leading owner and developer of high-quality, mixed-use properties in the Washington, DC market, today announced the final tax treatment of the Company's 2017 distributions on its common shares. The final income allocations as they will be reported on Form 1099-DIV are set forth in the following table:\nCommon Shares – CUSIP number 46590V100\nDistribution Per Share 2017 Tax Treatment Record Payable Total Taxable in\nTaxable in Total Qualified Total Capital Date Date 2017 2018 (1) Ordinary Dividends Gain Dividends Distributions Form 1099-DIV Box: 1a 1b 2a 11/20/2017 11/30/2017 $ 0.225 $ 0.225 $ 0.000 $ 0.225 $ 0.000 $ 0.000 12/29/2017 01/08/2018 $ 0.225 $ 0.085 $ 0.140 $ 0.085 $ 0.000 $ 0.000 Totals: $ 0.450 $ 0.310 $ 0.140 $ 0.310 $ 0.000 $ 0.000 (1) The distribution with a record date of December 29, 2017 is partially taxable for federal income tax purposes in 2017 and will be included in Total Ordinary Dividends reported on Form 1099-DIV in Box 1a. The remainder of the distribution will be taxable in 2018.\nShareholders should consult with their tax advisors with respect to the proper tax characterization and reporting of distributions on the Company’s common shares.\nAbout JBG SMITH\nJBG SMITH is an S&P 400 company that owns, operates, invests in and develops assets concentrated in leading urban infill submarkets in and around Washington, DC. Our mixed-use operating portfolio comprises approximately 20 million square feet of high-quality office, multifamily and retail assets, 98% of which are Metro-served. With a focus on placemaking, we drive synergies across the portfolio and create amenity-rich, walkable neighborhoods. JBG SMITH’s future development pipeline includes 17.6 million square feet of potential development density. For additional information on JBG SMITH please visit www.jbgsmith.com .\nForward Looking Statements\nCertain statements contained herein may constitute “forward-looking statements” as such term is defined in Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Forward-looking statements are not guarantees of performance. They represent our intentions, plans, expectations and beliefs and are subject to numerous assumptions, risks and uncertainties. Consequently, the future results of JBG SMITH Properties (“JBG SMITH” or the “Company”) may differ materially from those expressed in these forward-looking statements. You can find many of these statements by looking for words such as “approximate”, “believes”, “expects”, “anticipates”, “estimates”, “intends”, “plans”, “would”, “may” or similar expressions in this press release. We also note the following forward-looking statements: our expected annualized dividend per share and dividend yield, in the case of our construction and near-term development assets, the estimated square feet and units; and in the case of our future development assets, estimated potential development density. Many of the factors that will determine the outcome of these and our other forward-looking statements are beyond our ability to control or predict. These factors include, among others: adverse economic conditions in the Washington, DC metropolitan area, the timing of and costs associated with development and property improvements, financing commitments, and general competitive factors. For further discussion of factors that could materially affect the outcome of our forward looking statements and other risks and uncertainties, see “Risk Factors” and the Cautionary Statement Concerning Forward-Looking Statements in JBG SMITH’s Registration Statement on Form 10, as amended, filed with the Securities and Exchange Commission (the “SEC”) and declared effective on June 26, 2017 as well as the final Information Statement (the “Information Statement”) filed with the SEC as Exhibit 99.1 to our Current Report on Form 8-K filed on June 27, 2017. For these statements, we claim the protection of the safe harbor for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995. You are cautioned not to place undue reliance on our forward-looking statements. All subsequent written and oral forward-looking statements attributable to us or any person acting on our behalf are expressly qualified in their entirety by the cautionary statements contained or referred to in this section. We do not undertake any obligation to release publicly any revisions to our forward-looking statements after the date hereof.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180118005983/en/\nJBG SMITH\nJaime Marcus\nSVP, Investor Relations\n240-333-3643\njmarcus@jbgsmith.com\nSource: JBG SMITH", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.jbgsmith.com&esheet=51745354&newsitemid=20180118005983&lan=en-US&anchor=www.jbgsmith.com&index=1&md5=a87312187c393e949ca45a9181d9c074", "http://www.businesswire.com/news/home/20180118005983/en/"], "published": "2018-01-19T00:30:00.000+02:00", "crawled": "2018-01-19T00:33:27.037+02:00", "highlightTitle": ""}