{"organizations": [], "uuid": "d247bc7e242dae2a8be845d4e02c080a52218a67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1218923552&w=1200&r=LYNXMPEE0200E", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-cuba-religion/cubas-santeria-priests-wax-positive-as-transition-from-castros-begins-idUKKBN1ES00U", "country": "US", "domain_rank": 408, "title": "Cuba's Santeria priests wax positive as transition from Castros begins", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T02:39:00.000+02:00", "replies_count": 0, "uuid": "d247bc7e242dae2a8be845d4e02c080a52218a67"}, "author": "", "url": "https://uk.reuters.com/article/uk-cuba-religion/cubas-santeria-priests-wax-positive-as-transition-from-castros-begins-idUKKBN1ES00U", "ord_in_thread": 0, "title": "Cuba's Santeria priests wax positive as transition from Castros begins", "locations": [], "entities": {"persons": [{"name": "nelson acosta", "sentiment": "none"}, {"name": "víctor betancourt", "sentiment": "none"}, {"name": "raul castro", "sentiment": "none"}], "locations": [{"name": "cuba", "sentiment": "none"}, {"name": "santeria", "sentiment": "none"}, {"name": "havana", "sentiment": "none"}, {"name": "havana", "sentiment": "none"}], "organizations": [{"name": "castros", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 12:40 AM / Updated 4 hours ago Cuba's Santeria priests wax positive as transition from Castros begins Nelson Acosta 3 Min Read \nHAVANA (Reuters) - Priests from Cuba’s Afro-Cuban Santeria religion forecast on Tuesday that the upcoming retirement of President Raul Castro would signify “a moment of change” that accelerates the pace of reform on the Communist-run island. A follower of the Yoruba religion waits for the delivery of the recommendations based on their annual predictions for the New Year during a news conference in Havana, Cuba, January 2, 2018. REUTERS/Alexandre Meneghini \nThe ritual-filled religion, which fuses Catholicism with ancient African beliefs brought to Cuba by slaves, is practiced by millions of Cubans, many of whom eagerly await guidance from its annual forecast. \nVíctor Betancourt, a babalawo or Santeria priest, and member of the commission that writes the “Letter of the Year” containing prophesies and recommendations for followers, was upbeat at a news conference following the release of the letter. \n“I am sure this is a moment of change, a moment that can favour us, first of all because it is under the divinity of Yemaya, the Orisha (goddess) of feeding,” he said, “and really that is what we need.” \nIn a broader sense, Yemaya is goddess of the seas and of water, and is considered one of the most powerful and positive deities. \nCastro, 86, said last month he would step down as president in April. [nL1N1OL1BM] He took over in 2008 after his brother Fidel Castro, who had governed Cuba since leading the 1959 revolution, became seriously ill. Fidel Castro died in 2016. A doorman opens the door of the Yoruba Association during the delivery the recommendations based on their annual predictions for the New Year in Havana, Cuba, January 2, 2018. REUTERS/Alexandre Meneghini \n”We hope that the new leader will bring new reforms,” Betancourt said. “We are betting on reforms of the laws, in the food and health system, in social education that is contaminating the minds of the youth.” \nFirst Vice President Miguel Diaz-Canel, 57, is widely seen as Castro’s successor. Followers of the Yoruba religion perform after the delivery of the recommendations based on their annual predictions for the New Year in Havana, Cuba, January 2, 2018. REUTERS/Alexandre Meneghini \n”It is a moment of change ... to make changes. A time to change schemes that really do us harm,” Betancourt said. \nCuba has been immersed for a decade in efforts to transform its Soviet-style economy in hopes of improving the country’s sluggish performance. \nBut bureaucratic resistance has slowed progress toward a more market-oriented system and the crisis in ally Venezuela has left Cuba hard-pressed to pay for imports and recapitalise infrastructure. \nThe Letter of the Year prophesied “health in the complete sense of the term,” and urged followers to “maintain a good social and moral conduct.”", "external_links": [], "published": "2018-01-03T02:39:00.000+02:00", "crawled": "2018-01-03T03:09:17.008+02:00", "highlightTitle": ""}