{"organizations": [], "uuid": "1125810399645ce123693972c69367a7611d615f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-q-biomed-inc-prices-5-point-5-million-public-offering.html", "country": "US", "domain_rank": 767, "title": "Q BioMed Inc. Prices $5.5 Million Public Offering", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.115, "site_type": "news", "published": "2018-01-30T17:15:00.000+02:00", "replies_count": 0, "uuid": "1125810399645ce123693972c69367a7611d615f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-q-biomed-inc-prices-5-point-5-million-public-offering.html", "ord_in_thread": 0, "title": "Q BioMed Inc. Prices $5.5 Million Public Offering", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "biomed inc", "sentiment": "negative"}, {"name": "biomed inc.", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "cim securities", "sentiment": "none"}, {"name": "roth capital partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, January 30, 2018 /PRNewswire/ --\nQ BioMed Inc. (OTCQB: QBIO) (\"Q BioMed\" or the \"Company\"), a commercial stage biotechnology acceleration development company is pleased to announce pricing of a public offering of an aggregate of 1,711,875 shares of common stock of the Company, together with warrants to purchase up to 1,711,875 shares of common stock of the Company, at a public offering price of $3.20 per share and associated warrant. Each warrant will have an exercise price of $3.20 and will expire five years from the date of issuance. The gross proceeds from the offering are expected to be approximately $5.5 million, before deducting placement agent fees and other estimated offering expenses.\nRoth Capital Partners is acting as lead placement agent and CIM Securities is acting as co-lead placement agent for the offering.\nThe offering is expected to close on or about February 1, 2018, subject to the satisfaction of customary closing conditions.\nThe Company anticipates that the proceeds from the offering will provide Q BioMed the required capital to execute on several significant milestones in the first half of 2018 and beyond. These catalysts include;\nThe commercialization of our licensed FDA approved drug, Strontium Chloride 89 (SR89), a non-opioid therapeutic drug for the treatment of skeletal pain associated with metastatic cancers. Initiating the planning and IND filing for a Phase 4 post-marketing study to expand the indication of the approved SR89, labeling it as chemotherapeutic (a cancer therapy) for skeletal metastases, significantly improving the revenue potential for the drug. The filing of an IND for a pivotal phase ll/lll clinical program to test the efficacy of QBM-001, a pro-drug for the treatment of young children with a rare autistic spectrum disorder that severely inhibits their ability to communicate. Continued R&D on the novel chemotherapeutic drug for liver cancer. Completion of optimization and pre-clinical testing of the first-in-class glaucoma drug Man-01 for the treatment of open angle glaucoma, a disease affecting more than 60,000,000 people around the world.\nDenis Corin, Q BioMed Inc. CEO said, \"2018 is a catalyst-rich year for us. We have several major milestones on the near horizon and this capital provides the means to get there. In addition, given that we settled all our convertible debt at the end last year, this cash will boost our shareholder equity, further progressing us towards an uplisting on a senior national exchange.\"\nQ Biomed is a commercial stage biomedical acceleration and development company. We spent our first two years building a valuable portfolio of assets that we believe have significant upside based on our investment in their development. This year, the return on that investment of strategic resources should start to be realized as we advance those assets along their important commercial paths towards the patients that need them and economically, the billion dollar markets they represent.\nPlease visit http://www.qbiomed.com for more information and sign up to receive regular updates. Follow us on social media @QBioMed .\nMore information on the funding can be found on our form 8k filed with the SEC today.\nA registration statement on Form S-1 (File No. 333-222008) relating to this offering was declared effective by the Securities and Exchange Commission (SEC) on January 12, 2018. The securities may be offered only by means of a prospectus. A copy of the final prospectus is available on the SEC's website located at http://www.sec.gov . Electronic copies of the final prospectus also may be obtained from Roth Capital Partners, LLC, Equity Capital Markets, 888 San Clemente Drive, Newport Beach, CA 92660, at 800-678-9147 and rothecm@roth.com .\nThis press release shall not constitute an offer to sell or the solicitation of an offer to buy these securities, nor shall there be any sale of these securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to the registration or qualification under the securities laws of any such jurisdiction.\nAbout Q BioMed, Inc.\nQ BioMed, Inc. is a biomedical acceleration and development company. We are focused on licensing and acquiring biomedical assets across the healthcare spectrum. Q BioMed is dedicated to providing these target assets the strategic resources, developmental support and expansion capital they need to ensure they meet their developmental potential, enabling them to provide products to patients in need.\nForward-Looking Statements:\nThis press release may contain \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. Such statements include, but are not limited to, any statements relating to our growth strategy and product development programs and any other statements that are not historical facts. Forward-looking statements are based on management's current expectations and are subject to risks and uncertainties that could negatively affect our business, operating results, financial condition and stock price. Factors that could cause actual results to differ materially from those currently anticipated are: risks related to our growth strategy; risks relating to the results of research and development activities; our ability to obtain, perform under and maintain financing and strategic agreements and relationships; uncertainties relating to preclinical and clinical testing; our dependence on third-party suppliers; our ability to attract, integrate, and retain key personnel; the early stage of products under development; our need for substantial additional funds; government regulation; patent and intellectual property matters; competition; as well as other risks described in our SEC filings. We expressly disclaim any obligation or undertaking to release publicly any updates or revisions to any forward looking statements contained herein to reflect any change in our expectations or any changes in events, conditions or circumstances on which any such statement is based, except as required by law.\nContact:\nDenis Corin\nCEO\nQ BioMed Inc.\n+1-888-357-2435\nSOURCE Q BioMed Inc.", "external_links": ["https://twitter.com/qbiomed", "http://www.qbiomed.com/"], "published": "2018-01-30T17:15:00.000+02:00", "crawled": "2018-01-30T18:47:35.000+02:00", "highlightTitle": ""}