{"organizations": [], "uuid": "0a7c7f7d6007625a3effeeb733ce568d6a5c6df0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180124.html", "section_title": "Archive News &amp; Video for Wednesday, 24 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/fevertree-drinks-outlook/update-1-gin-boom-keeps-sales-of-tonic-maker-fevertree-fizzing-idUSL4N1PJ3C0", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Gin boom keeps sales of tonic maker Fevertree fizzing", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T18:43:00.000+02:00", "replies_count": 0, "uuid": "0a7c7f7d6007625a3effeeb733ce568d6a5c6df0"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/fevertree-drinks-outlook/update-1-gin-boom-keeps-sales-of-tonic-maker-fevertree-fizzing-idUSL4N1PJ3C0", "ord_in_thread": 0, "title": "UPDATE 1-Gin boom keeps sales of tonic maker Fevertree fizzing", "locations": [], "entities": {"persons": [{"name": "fevertree", "sentiment": "none"}, {"name": "george salmon", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "hargreaves lansdown", "sentiment": "none"}, {"name": "fevertree drinks", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds analysts, detail, background, shares)\nJan 24 (Reuters) - With Britain’s thirst for gin showing no sign of letting up, upmarket tonic and mixers maker Fevertree Drinks said on Wednesday its 2017 results would beat analysts’ expectations.\nThe company also soothed investor worries about a pick up in competition from bigger rival Schweppes, which has recently increased its presence in premium products. Fevertree said it had gained “significant market share.”\nThe firm’s shares, up about 15-fold since their 2014 listing, jumped more than 10 percent in early trade, before retreating to stand up 2.7 percent at 25 pounds at 1015 GMT.\n“With gin sales soaring, 2017 was the year of the juniper. However, it shouldn’t be forgotten what a good job Fevertree has done in capitalising on this tailwind,” said George Salmon, equity analyst at Hargreaves Lansdown.\nUK gin sales leapt more than 100 percent in the first half of 2017, helped by demand for premium brands.\nFevertree said it expected its 2017 revenues to rise 66 percent to around 169 million pounds ($237 million), ahead of analysts’ forecasts.\n“Reflecting the continued strong performance through to the end of the year, the board expects that the outcome for the full year will be comfortably ahead of market expectations,” it said, without saying what those expectations were.\nInvestec analyst Nicola Mallard said the company overtook Schweppes to become the No.1 mixer brand by value in the UK retail sector.\nA move by Coca-Cola’s Schweppes to compete in premium drinks caused some weakness in Fevertree stock late last year.\nFevertree, named after the colloquial term for the cinchona tree, the bark of which produces quinine - a key ingredient in tonic water - is one of the largest companies on London’s junior AIM market, with a market value of around 2.8 billion pounds.\nIts shares were boosted last week by speculation consumer goods giant Unilever might be looking to buy the company.\nFevertree said UK revenue rose around 96 percent last year, helped by a particularly strong performance over Christmas, while U.S. revenue was up about 39 percent.\nOver the last year, the company has launched mixers that can be used with dark spirits, helping to protect itself from a possible downturn in the popularity of gin.\n$1 = 0.7128 pounds Reporting by Arathy S Nair in Bengaluru; Editing by Amrutha Gayathri and Mark Potter\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-24T18:43:00.000+02:00", "crawled": "2018-01-25T13:14:44.047+02:00", "highlightTitle": ""}