{"organizations": [], "uuid": "c24a47a32ecb3357fb28f48e4203ca4f64f14ec9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-new-york-reit-inc-to-issue-a-2-point-00-per-share-cash-liquidating-distribution.html", "country": "US", "domain_rank": 767, "title": "New York REIT, Inc. to Issue a $2.00 Per Share Cash Liquidating Distribution", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T00:15:00.000+02:00", "replies_count": 0, "uuid": "c24a47a32ecb3357fb28f48e4203ca4f64f14ec9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-new-york-reit-inc-to-issue-a-2-point-00-per-share-cash-liquidating-distribution.html", "ord_in_thread": 0, "title": "New York REIT, Inc. to Issue a $2.00 Per Share Cash Liquidating Distribution", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "nyrt", "sentiment": "negative"}, {"name": "new york reit, inc.", "sentiment": "neutral"}, {"name": "company's board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 5, 2018 /PRNewswire/ -- New York REIT, Inc. (NYSE: NYRT) (the \"Company\" or \"NYRT\"), which is liquidating and winding down pursuant to a plan of liquidation, announced today the Company's Board of Directors has declared a cash liquidating distribution of $2.00 per share to be paid on January 26, 2018 to shareholders of record as of January 19, 2018. The liquidating distribution is being paid from the net proceeds from recent property sales.\nInvestors should note that the ex-dividend date is set by the NYSE. Under the rules of the NYSE, when a distribution is declared in a per share amount that exceeds 25% of a company's stock price, the date on which that company's shares will begin to trade without the dividend, or ex-dividend, is the first business day following the payment date. Accordingly, the NYSE has informed the Company that it will set an ex-dividend date for the cash liquidating distribution of January 29, 2018. On the record date of January 19, 2018, the NYSE will attach a due bill to the shares of NYRT which represents the right to receive the distribution payable on January 26, 2018. Consequently, if a shareholder as of the record date sells shares at any time prior to the ex-dividend date of January 29, 2018, they will also be selling the due bill and will not receive the cash liquidating distribution. Conversely, anyone buying the shares between the record date and the ex-dividend date will also be acquiring the due bill and will be entitled to receive the distribution payable on January 26, 2018.\nSeparately, the Company has announced that it has closed on the previously announced sale of its property located at 333 West 34 th Street in New York, New York for $255.0 million to real estate funds managed by Brookfield Asset Management. The 333 West 34th Street property was part of the collateral for the Company's cross collateralized and secured loan. In connection with the sale, the Company paid approximately $110.6 million on account of the loan as required by the loan documents, resulting in a remaining outstanding principal balance on the loan of approximately $65.6 million. After satisfaction of debt, pro-rations and closing costs, the Company received net proceeds of approximately $134.6 million. The selling price is consistent with the Company's last reported net assets in liquidation as of September 30, 2017.\nAbout NYRT\nNYRT is a publicly traded real estate investment trust listed on the NYSE that owns income-producing commercial real estate, including office and retail properties, located in New York City. NYRT's shareholders recently adopted a plan of liquidation pursuant to which NYRT is liquidating and winding down and, in connection therewith, is seeking to sell its assets in an orderly fashion to maximize shareholder value. For more information, please visit our website at www.nyrt.com .\nForward-Looking Statements\nThe statements in this release that are not historical facts may be forward-looking statements. These forward-looking statements involve substantial risks and uncertainties. Actual results or events could differ materially from the plans, intentions and expectations disclosed in the forward-looking statements the Company makes. Forward-looking statements may include, but are not limited to, statements regarding stockholder liquidity and investment value and returns. The words \"anticipates,\" \"believes,\" \"expects,\" \"estimates,\" \"projects,\" \"plans,\" \"intends,\" \"may,\" \"will,\" \"would,\" and similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these identifying words. Factors that might cause such differences include, but are not limited to: the purchaser consummating the transactions contemplated by the purchase agreement; and other factors, many of which are beyond the Company's control, including other factors included in the Company's reports filed with the Securities and Exchange Commission (\"SEC\"), particularly in the \"Risk Factors\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" sections of the Company's latest Annual Report on Form 10-K for the year ended December 31, 2016, filed with the SEC on March 1, 2017 and the Company's Quarterly Report on Form 10-Q for the quarter ended September 30, 2017 filed with the SEC on November 9, 2017, as such Risk Factors may be updated from time to time in subsequent reports. The Company does not assume any obligation to update any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.\nContacts\nWendy Silverstein, Chief Executive Officer\nNew York REIT, Inc.\nwsilverstein@nyrt.com\n(617) 570-4750\nJohn Garilli, Chief Financial Officer\nNew York REIT, Inc.\njgarilli@nyrt.com\n(617) 570-4750\nJonathan Keehner\nMahmoud Siddig\nJoele Frank, Wilkinson Brimmer Katcher\njkeehner@joelefrank.com\nmsiddig@joelefrank.com\n(212) 355-4449\nView original content: http://www.prnewswire.com/news-releases/new-york-reit-inc-to-issue-a-200-per-share-cash-liquidating-distribution-300578424.html\nSOURCE New York REIT, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/new-york-reit-inc-to-issue-a-200-per-share-cash-liquidating-distribution-300578424.html", "http://www.nyrt.com/"], "published": "2018-01-06T00:15:00.000+02:00", "crawled": "2018-01-06T01:05:39.010+02:00", "highlightTitle": ""}