{"organizations": [], "uuid": "2f39b893c5500009502a7367b42d25196d063e29", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/10/104938113-GettyImages-895175300.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/15837362/device/rss/rss.html", "section_title": "U.S. News", "url": "https://www.cnbc.com/2018/01/10/exclusive-wahlberg-got-1-point-5m-for-all-the-money-reshoot-williams-paid-less-than-1000.html", "country": "US", "domain_rank": 767, "title": "Exclusive: Wahlberg got $1.5M for 'All the Money' reshoot, Williams paid less than $1,000", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.035, "site_type": "news", "published": "2018-01-10T14:32:00.000+02:00", "replies_count": 0, "uuid": "2f39b893c5500009502a7367b42d25196d063e29"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/10/exclusive-wahlberg-got-1-point-5m-for-all-the-money-reshoot-williams-paid-less-than-1000.html", "ord_in_thread": 0, "title": "Exclusive: Wahlberg got $1.5M for 'All the Money' reshoot, Williams paid less than $1,000", "locations": [], "entities": {"persons": [{"name": "wahlberg", "sentiment": "negative"}, {"name": "mark wahlberg", "sentiment": "negative"}, {"name": "williams", "sentiment": "negative"}, {"name": "christopher plummer", "sentiment": "none"}, {"name": "getty", "sentiment": "none"}, {"name": "rose mcgowan", "sentiment": "none"}, {"name": "ridley scott", "sentiment": "none"}, {"name": "michelle williams", "sentiment": "none"}, {"name": "kevin spacey", "sentiment": "none"}, {"name": "spacey", "sentiment": "none"}, {"name": "russell simmons", "sentiment": "none"}, {"name": "j. paul getty", "sentiment": "none"}, {"name": "scott", "sentiment": "none"}], "locations": [{"name": "usa", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "usa today", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Mark Wahlberg was paid $1.5 million for reshooting his scenes in All the Money in the World, three people familiar with the situation but not authorized to speak publicly about it tell USA TODAY, while Michelle Williams was paid an $80 per diem totaling less than $1,000.\nThat works out to Williams being paid less than 1% of her male co-star.\nMore from USA Today:\nWahlberg talks controversy and awards at 'All The money in The World' premiere\nRose McGowan: 'I'm just trying to stop international rapists and child molesters'\nRussell Simmons denies new 'horrific' rape allegations\nRidley Scott's Getty kidnapping drama was hastily reshot the week of Thanksgiving after a cascade of sexual misconduct allegations were made public against Kevin Spacey, who previously starred in the drama as billionaire J. Paul Getty.\nScott transfixed the film world by quickly assembling his actors over the holiday break in Europe, reshooting Spacey's scenes with Christopher Plummer — and still making his Christmas release window.\nThe wave of publicity that followed made All the Money in the World, distributed by Sony and financed by Imperative Entertainment, roll into the Sunday's Golden Globes as a relative triumph.\nBut new information reveals ugly math behind the Hollywood victory. The reshoot cost $10 million (a fee put up by producing arm Imperative). In December, Scott told USA TODAY that the undertaking was aided by the fact that \"everyone did it for nothing.\"\nThe exchange went as follows:\nRIDLEY SCOTT: \"The whole reshoot was — in normal terms was expensive but not as expensive as you think. Because all of them, everyone did it for nothing.\"\nUSA TODAY: \"Really?\"\nSCOTT: \"No, I wouldn't get paid, I refused to get paid.\"\nUSA TODAY: \"You didn't pay the actors more to do it?\"\nSCOTT: \"No, they all came in free. Christopher had to get paid. But Michelle, no. Me, no. I wouldn't do that to — \"\nUSA TODAY: \"The crew, of course, did get paid?\"\nSCOTT: \"Of course. \"\nUSA TODAY has since learned Wahlberg's team actually negotiated a hefty fee, with the actor paid $1.5 million for his reshoots. Williams wasn't told.\nWahlberg and Williams are both represented by the William Morris Endeavor agency. Actors pay a team of agents, managers and lawyers an average of 10% of their salaries to advocate for them.\nRepresentatives for Wahlberg, Williams, WME, Sony, Imperative Entertainment and Scott did not respond to USA TODAY's requests for comment.\nIn August, Forbes named Wahlberg the highest-paid actor of the year, calculating his pretax and pre-fee earnings at $68 million. The Washington Post first reported Wahlberg's reshoot fee, noting that the actor \"along with manager Stephen Levinson and agency WME, have a reputation in Hollywood for driving a tough bargain.\"\nWilliams previously told USA TODAY that when Scott's team called to request her time for the reshoot, \"I said I'd be wherever they needed me, whenever they needed me. And they could have my salary, they could have my holiday, whatever they wanted. Because I appreciated so much that they were making this massive effort.\"\nAll the Money in the World has lagged at the box office, this past weekend coming in 10th place. The drama has grossed $20.2 million since its release two weeks ago.\nThe pay disparity arrives as the entertainment industry continues to be rocked by the downfall of movie mogul Harvey Weinstein, a flood of sexual misconduct allegations against dozens of other powerful Hollywood figures and a rising #MeToo movement.\nTwo days ago at the Golden Globes, male and female stars wore black in solidarity with the newly-established Time's Up initiative, which pushes for protection for victims of sexual harassment and gender equality.\nWilliams, Globe-nominated for her role in All the Money in the World, was one of them.", "external_links": ["https://www.usatoday.com/videos/life/people/2018/01/10/mark-wahlberg-talks-controversy-and-awards-all-money-world-premiere/108739998/", "https://www.washingtonpost.com/news/business/wp/2017/11/28/michelle-williams-is-getting-a-fraction-of-mark-wahlbergs-2-million-payday-in-all-the-money-in-the-world-reshoots/?utm_term=.c64d292dad39", "https://www.usatoday.com/story/life/tv/2018/01/09/rose-mcgowan-fighting-harvey-weinstein-and-her-activist-reality-show/1017915001/", "https://www.usatoday.com/story/life/2018/01/09/russell-simmons-denies-new-horrific-rape-allegations/1017967001/"], "published": "2018-01-10T14:32:00.000+02:00", "crawled": "2018-01-10T17:24:45.000+02:00", "highlightTitle": ""}