{"organizations": [], "uuid": "e70dd58f6e968879eabcf5886efc853a5712093d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-jaanuu-appoints-veteran-marketer-dave-beveridge-as-cmo.html", "country": "US", "domain_rank": 767, "title": "Jaanuu Appoints Veteran Marketer Dave Beveridge as CMO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T15:01:00.000+02:00", "replies_count": 0, "uuid": "e70dd58f6e968879eabcf5886efc853a5712093d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-jaanuu-appoints-veteran-marketer-dave-beveridge-as-cmo.html", "ord_in_thread": 0, "title": "Jaanuu Appoints Veteran Marketer Dave Beveridge as CMO", "locations": [], "entities": {"persons": [{"name": "dave beveridge", "sentiment": "negative"}, {"name": "beveridge", "sentiment": "none"}, {"name": "matt till", "sentiment": "none"}, {"name": "jim harris", "sentiment": "none"}, {"name": "shaan sethi", "sentiment": "none"}, {"name": "olukai", "sentiment": "none"}, {"name": "jaanuu", "sentiment": "none"}], "locations": [{"name": "el segundo", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "jaanuu", "sentiment": "none"}], "organizations": [{"name": "whipclip", "sentiment": "none"}, {"name": "jaanuu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "EL SEGUNDO, Calif., Jan. 8, 2018 /PRNewswire/ -- Seeking to capitalize on strong demand in the wake of record 2017 sales, and in light of significant growth plans for 2018, Jaanuu has expanded its executive team, appointing Dave Beveridge as its first chief marketing officer. The brand has also grown its investor group, to include footwear company, Olukai's Co-Founder, Matt Till and current CEO, Jim Harris. The announcement was made today by Shaan Sethi, founder & CEO of Jaanuu, the most successful and fastest growing direct-to-consumer brand in the medical apparel space.\nHaving served as a marketing advisor to Jaanuu since 2014, Beveridge segues into a senior staff position with the company following nearly three years as VP of eCommerce for Planet Blue, where he was integral in improving topline revenue by 75% and operating profit 100% for the bohemian/beach apparel company. He previously served as VP of marketing for video sharing app maker Whipclip and in a similar capacity for the fashion subscription service ShoeDazzle. From 2010-12 Beveridge worked in the entertainment industry as chief of staff, digital for the media production company BermanBraun (now Whalerock Industries) in the wake of his role as VP of eCommerce & business development for Sportnet, assisting with its merger with GrindTV to form the largest global action-sports community/commerce destination. An MBA graduate of Saint Mary's College, Dave Beveridge is a coveted expert on digital marketing and customer relationship management, among other topics, and has served as a speaker at such industry conclaves as Brand Innovators, Experian Client Summit and Fashion Digital LA.\n\"Dave is a proven leader and one of the most well-respected veterans in eCommerce, having led marketing at both Planet Blue and ShoeDazzle,\" stated Founder & CEO Shaan Sethi, who launched the fashion-forward scrubs lifestyle company five years ago with his sister, Dr. Neela Sethi Young. \"This is the right time to build out our leadership team, and we know that Dave will be integral in reaching new audiences while stoking the loyalty of our existing customers.\"\n\"Dave Beveridge is the guy you bring in when you're ready to kick your marketing into high gear,\" said Brian Lee, founder of ShoeDazzle and co-founder of The Honest Company. \"Having worked with him for over two years at ShoeDazzle, I know he will bring unequaled creativity and tenacity to his new CMO post at Jaanuu.\"\nConcurrently, following the strong success of its July 2017 footwear launch, Jaanuu bolstered its recent strategic investment round with two new members of its investor group: Matt Till and Jim Harris, co-founder and CEO, respectively, of the Hawaii-inspired footwear company Olukai.\nJaanuu's success can be attributed to its disruption of the multi-billion-dollar medical apparel market with its fresh vision of contemporary, fashionable scrubs, lab coats and footwear. The brand's highly coveted runway-inspired styles and products reflect some of today's most popular fashion trends and feature cutting edge proprietary fabrication, Jaanacea™ which stays soft and wrinkle resistant while withstanding the harsh conditions of a hospital or medical environment.\nAbout Jaanuu\nLaunched in 2013, Jaanuu is the leader in contemporary medical workwear, runway-inspired scrubs, lab coats and footwear reflecting some of today's most popular fashion trends. Jaanuu transformed the market upon its launch in 2013 as a direct-to-consumer brand embracing the mission to help professional women look their best and feel confident. Along with its fashion-forward styles, Jaanuu is also distinguished by its proprietary fabrication Jaanacea™, which incorporates moisture-wicking Tencel, anti-odor protection, premium antimicrobial-finished fabric to restrict the growth of bacteria, and a pioneering four-fabric stretch blend manufactured to stay soft and wrinkle resistant in harsh hospital conditions. Visit the website: www.jaanuu.com . Follow on Facebook , Instagram , Twitter and Pinterest .\nView original content with multimedia: http://www.prnewswire.com/news-releases/jaanuu-appoints-veteran-marketer-dave-beveridge-as-cmo-300578574.html\nSOURCE Jaanuu", "external_links": ["https://www.instagram.com/jaanuubydrneela/", "https://www.pinterest.com/jaanuubydrneela/", "https://www.facebook.com/JaanuuByDrNeela", "https://twitter.com/JaanuuByDrNeela", "http://www.prnewswire.com/news-releases/jaanuu-appoints-veteran-marketer-dave-beveridge-as-cmo-300578574.html", "http://www.jaanuu.com/"], "published": "2018-01-08T15:01:00.000+02:00", "crawled": "2018-01-08T15:20:19.010+02:00", "highlightTitle": ""}