{"organizations": [], "uuid": "12b09bbe5c852bb5a2d21a13ebc4aabcea300d8c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 62, "shares": 62, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-motor-f1-gurney/motor-racing-dan-gurney-all-american-racer-dies-at-86-idUSKBN1F400T", "country": "US", "domain_rank": 408, "title": "Motor racing: Dan Gurney, all American racer, dies at 86", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T02:17:00.000+02:00", "replies_count": 0, "uuid": "12b09bbe5c852bb5a2d21a13ebc4aabcea300d8c"}, "author": "", "url": "https://www.reuters.com/article/us-motor-f1-gurney/motor-racing-dan-gurney-all-american-racer-dies-at-86-idUSKBN1F400T", "ord_in_thread": 0, "title": "Motor racing: Dan Gurney, all American racer, dies at 86", "locations": [], "entities": {"persons": [{"name": "dan gurney", "sentiment": "negative"}, {"name": "dan", "sentiment": "none"}, {"name": "gurney", "sentiment": "none"}, {"name": "alan baldwin", "sentiment": "none"}, {"name": "greg stutchbury", "sentiment": "none"}, {"name": "evi", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "motor", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - American racer Dan Gurney, a Formula One and Le Mans 24 Hours winner in the 1960s who started a trend by spraying champagne on the victory podium, died in California on Sunday aged 86.\nThe news was announced by his wife Evi and family in a statement.\n“With one last smile on his handsome face, Dan drove off into the unknown just before noon today, January 14, 2018,” it said.\nThe family said Gurney, whose Formula One career spanned one of the most glamorous and dangerous periods of the sport’s history from 1959 to 1970, had died of complications from pneumonia.\nA winner also in IndyCar and NASCAR, and inventor of the ‘Gurney Flap’ aerodynamic device, he was inducted into the Indianapolis Hall of Fame after finishing second in the 1968 and 1969 Indy 500s and third in 1970.\nThe son of an opera singer, Gurney made his Formula One debut with Ferrari at the 1959 French Grand Prix in Reims and soon established himself racing against some of the sport’s all-time greats.\nHis first grand prix win came with Porsche at the 1962 French Grand Prix in Rouen, followed up by another at the same circuit in 1964 when he took a first championship win for Brabham.\nGurney won again that season in Mexico City and then in 1966 set up his own All American Racers, taking their first and only win at Belgium’s Spa-Francorchamps circuit in 1967 in the beautifully-designed Eagle Weslake Mark I.\nIt was also in 1967, after winning the Le Mans 24 Hours in a Ford GT40 with AJ Foyt, that Gurney famously sprayed the champagne around.\n“Dan’s naughty nature took over and he used the bottle like a firehose on everybody out of sheer exuberance, a relief for finally having won the race after 10 tries,” Evi Gurney recalled to Reuters on the 50th anniversary last year.\n“Thousands have done it since, exactly the way he did.”\nGurney ended his career at McLaren in 1970, stepping in after the death of the team’s founder Bruce McLaren for three races.\nDespite not winning a championship, Gurney remains the second most successful U.S. Formula One driver in terms of race wins (four) after 1978 champion Mario Andretti (12).\nPhil Hill, champion in a 1961 season when Gurney finished third equal with Britain’s Stirling Moss, won only three.\n“I was first inspired by him when I was in midgets dreaming of being like him,” said Andretti, among many expressing condolences on Twitter.\n“He understood me better than anyone else, which is why he wrote the foreword for my book in 2001.”\nReporting by Alan Baldwin in London, editing by Greg Stutchbury\n ", "external_links": [], "published": "2018-01-15T02:17:00.000+02:00", "crawled": "2018-01-15T02:25:31.000+02:00", "highlightTitle": ""}