{"organizations": [], "uuid": "58aba7068376e3701aa2050d63702f165fd682f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/business-wire-evans-bancorp-announces-retirement-of-chairman-john-r-oabrien.html", "country": "US", "domain_rank": 767, "title": "Evans Bancorp Announces Retirement of Chairman John R. O’Brien", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T00:15:00.000+02:00", "replies_count": 0, "uuid": "58aba7068376e3701aa2050d63702f165fd682f1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/business-wire-evans-bancorp-announces-retirement-of-chairman-john-r-oabrien.html", "ord_in_thread": 0, "title": "Evans Bancorp Announces Retirement of Chairman John R. O’Brien", "locations": [], "entities": {"persons": [{"name": "john r. o’brien", "sentiment": "neutral"}, {"name": "o’brien", "sentiment": "none"}], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "hamburg", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "evans bancorp", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "evans bancorp, inc.", "sentiment": "neutral"}, {"name": "western new york", "sentiment": "none"}, {"name": "llp", "sentiment": "none"}, {"name": "financial administration", "sentiment": "none"}, {"name": "board", "sentiment": "none"}, {"name": "roman catholic diocese of buffalo", "sentiment": "none"}, {"name": "kpmg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HAMBURG, N.Y.--(BUSINESS WIRE)-- Evans Bancorp, Inc. (the “Company”) (NYSE American: EVBN), a community financial services company serving Western New York since 1920, announced that John R. O’Brien has informed the Company’s Board of Directors of his intention to retire as Chairman of the Board and as a member of the Board of Directors effective March 31, 2018. This is in advance of the Company’s Annual Meeting of Shareholders, scheduled for April 26, 2018. Mr. O’Brien indicated he will not seek re-election to the Board of Directors in April, as he wishes to spend more time with family and pursue personal interests.\nMr. O’Brien has been a director of the Company since 2003 and has served on all committees of the Board and as Vice-Chairman before being named Chairman in April 2012. He was previously the Executive Director of Financial Administration for the Roman Catholic Diocese of Buffalo, New York, retiring in June 2004. Mr. O’Brien also previously served for 20 years as an audit partner with KPMG, LLP, a national accounting and consulting firm.\nDuring his tenure on the Board, the Company has experienced unprecedented growth. The number of financial centers have nearly doubled to 14, assets and deposits both crossed the one billion mark, and a total of ten insurance agencies were acquired by the Evans Agency, more than doubling its size.\n“John has made monumental contributions to the Company while serving on and leading our Board,” stated David J. Nasca, President & CEO of Evans. “His vision, insight and compassion have created a legacy which will have a long-lasting, positive impact on the Company, as well as the community. John leaves us in a very strong position as Evans continues its evolution as a leading Western New York financial institution.”\nAs part of its succession planning and governance protocols, a successor Board Chair will be appointed by the Board of Directors prior to the Company’s Annual Meeting.\nAbout Evans Bancorp, Inc.\nEvans Bancorp, Inc. is a financial holding company and the parent company of Evans Bank, N.A., a commercial bank with $1.2 billion in assets and $1.0 billion in deposits at September 30, 2017. Evans is a full-service community bank, with 14 branches providing comprehensive financial services to consumer, business and municipal customers throughout Western New York. Evans Bancorp's wholly owned insurance subsidiary, The Evans Agency, LLC, provides life insurance, employee benefits, and property and casualty insurance through nine insurance offices in the Western New York region. Evans Investment Services provides non-deposit investment products, such as annuities and mutual funds.\nEvans Bancorp, Inc. and Evans Bank routinely post news and other important information on their websites, at www.evansbancorp.com and www.evansbank.com .\nSafe Harbor Statement:\nThis news release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Such forward-looking statements include, but are not limited to, statements concerning future business, revenue and earnings. These statements are not historical facts or guarantees of future performance, events or results. There are risks, uncertainties and other factors that could cause the actual results of Evans Bancorp to differ materially from the results expressed or implied by such statements. Factors that may cause actual results to differ materially from those contemplated by such forward-looking statements include competitive pressures among financial services companies, interest rate trends, general economic conditions, changes in legislation or regulatory requirements, effectiveness at achieving stated goals and strategies, and difficulties in achieving operating efficiencies. These risks and uncertainties are more fully described in Evans Bancorp’s Annual and Quarterly Reports filed with the Securities and Exchange Commission. Forward-looking statements speak only as of the date they are made. Evans Bancorp undertakes no obligation to publicly update or revise forward-looking information, whether as a result of new, updated information, future events or otherwise.\n //www.businesswire.com/news/home/20180125006249/en/\nEvans Bancorp, Inc.\nJohn B. Connerton, 716-926-2000\nExecutive Vice President & Chief Financial Officer\njconner@evansbank.com\nor\nKei Advisors LLC\nDeborah K. Pawlowski, 716-843-3908\ndpawlowski@keiadvisors.com\nSource: Evans Bancorp, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fevansbank.com%2F&esheet=51749159&newsitemid=20180125006249&lan=en-US&anchor=Evans+Bancorp%2C+Inc.&index=1&md5=d7266e80f0e4830c34e123f2886e228a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.evansbancorp.com&esheet=51749159&newsitemid=20180125006249&lan=en-US&anchor=www.evansbancorp.com&index=2&md5=03f7a54ad70e33c7df123c6ea02bb0bc", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.evansbank.com&esheet=51749159&newsitemid=20180125006249&lan=en-US&anchor=www.evansbank.com&index=3&md5=5f8cc3113456ff782f74bef0ddc68896", "http://www.businesswire.com/news/home/20180125006249/en/"], "published": "2018-01-26T00:15:00.000+02:00", "crawled": "2018-01-26T02:30:11.000+02:00", "highlightTitle": ""}