{"organizations": [], "uuid": "9b3c94581e59b2c872967a971f7d4dcf79bce829", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180120&t=2&i=1223662016&w=1200&r=LYNXMPEE0J0MY", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-bur-mun/martial-strike-gives-united-points-at-turf-moor-idUKKBN1F90VX", "country": "US", "domain_rank": 408, "title": "Martial strike gives United points at Turf Moor", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T19:19:00.000+02:00", "replies_count": 0, "uuid": "9b3c94581e59b2c872967a971f7d4dcf79bce829"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-bur-mun/martial-strike-gives-united-points-at-turf-moor-idUKKBN1F90VX", "ord_in_thread": 0, "title": "Martial strike gives United points at Turf Moor", "locations": [], "entities": {"persons": [{"name": "romelu lukaku", "sentiment": "none"}, {"name": "anthony martial", "sentiment": "none"}, {"name": "johann berg gudmundsson", "sentiment": "none"}, {"name": "christian radnedge", "sentiment": "none"}, {"name": "nick pope", "sentiment": "none"}, {"name": "simon evans", "sentiment": "none"}], "locations": [{"name": "manchester city", "sentiment": "none"}], "organizations": [{"name": "united", "sentiment": "negative"}, {"name": "manchester united", "sentiment": "none"}, {"name": "newcastle united", "sentiment": "none"}, {"name": "turf moor", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "manchester united", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "burnley", "sentiment": "none"}, {"name": "burnley", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 20, 2018 / 5:24 PM / Updated 19 minutes ago Martial strike gives United points at Turf Moor Simon Evans 3 Min Read \nBURNLEY, England (Reuters) - A superbly taken 54th minute goal from Anthony Martial gave Manchester United a hard-earned 1-0 win over Burnley at Turf Moor in the Premier League on Saturday. \nRomelu Lukaku showed strength and skill as he held off two challenges on the right flank before delivering a perfect cross-field pass to Martial whose powerful shot crashed in off the under-side of the bar. \nBurnley responded well, though, with Johann Berg Gudmundsson hitting the bar with a free kick and the Clarets put United under plenty of pressure throughout the second half. \nHome goalkeeper Nick Pope produced a fine save to deny Martial another goal as second placed United closed the gap on leaders Manchester City to nine points ahead of their rival’s game against Newcastle United later on Saturday. \nIt may not have been thrilling, but it was the kind of disciplined performance that United need to keep delivering if they are to be in position to take advantage of any slip-ups from City. \n“You never know,” said defender Phil Jones, when asked if United could make up the gap. \n“It is not going to be easy, but you never say never.” \nUnited played a fluid formation with Lukaku as the lone central striker, Nemanja Matic the holding midfielder and then a flexible four of Martial, Paul Pogba, Juan Mata and Jesse Lingard. \nThat produced some attractive passing and movement from Mourinho’s side but not always too much to worry a Burnley defence, marshalled by James Tarkowski and Ben Mee. \nLikewise Burnley enjoyed plenty of possession, especially after Martial’s strike, but did not pose enough of a threat in attack and when Gudmundsson did slip the ball across the face of goal, Tarkowski was unable to connect. \n“It was very hard, we played against a brave team, a team that plays with their strength and a team that knows how to get points - that’s why season after season they are in a comfortable position. We were not brilliant, but we were very good,” said Mourinho. \n“I prefer to win 4-0 and to sit on the bench and enjoy the game but it is good to see the way the team fought for it,” he added. \nBurnley manager Sean Dyche, whose team have now gone seven league games without a win and dropped to eighth in the table, was upbeat about his team’s performance. \n“That’s a very good performance and I‘m very pleased with the players,” he said. \n“The challenge of the Premier League, that’s why the top six are the top six, is often they can just about hang in there and find a moment of quality, and they do it enough.” Reporting by Simon Evans; Editing by Christian Radnedge", "external_links": [], "published": "2018-01-20T19:19:00.000+02:00", "crawled": "2018-01-20T19:39:09.009+02:00", "highlightTitle": ""}