{"organizations": [], "uuid": "4174414c456f233cb3949292aa7d2dde08560804", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/lip-synch-battle-spike-tv.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/17/spike-tv-twitter-paramount-network/", "country": "US", "domain_rank": 1196, "title": "Spike TV Goes Nuts on Twitter as Paramount Network Change Looms | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-17T14:16:00.000+02:00", "replies_count": 0, "uuid": "4174414c456f233cb3949292aa7d2dde08560804"}, "author": "Chris Morris", "url": "http://fortune.com/2018/01/17/spike-tv-twitter-paramount-network/", "ord_in_thread": 0, "title": "Spike TV Goes Nuts on Twitter as Paramount Network Change Looms | Fortune", "locations": [], "entities": {"persons": [{"name": "param", "sentiment": "negative"}, {"name": "trae patton", "sentiment": "none"}, {"name": "david spade", "sentiment": "none"}, {"name": "chris morris", "sentiment": "none"}, {"name": "welp", "sentiment": "none"}], "locations": [], "organizations": [{"name": "paramount network change looms | fortune spike tv", "sentiment": "negative"}, {"name": "viacom", "sentiment": "none"}, {"name": "spike tv", "sentiment": "none"}, {"name": "paramount network", "sentiment": "none"}, {"name": "lip sync battle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Spike TV's Twitter Account Is Going Absolutely Bonkers Right Before the Channel Is Replaced by Paramount Network David Spade on Lip Sync Battle, a Spike TV show that will move over to Paramount Network. Trae Patton—Spike By Chris Morris 12:16 PM EST \nWhen you’re an edgy TV network that’s about to go into the void forever, the little decorum you held onto for the past 18 years apparently goes right out the window—especially on social media. Spike TV’s Twitter account erupted in a series of hilarious and often profane tweets Tuesday night, skewering itself, its programming, and the culture it has embraced. Remarkably (and perhaps indicating the “rebellious” act was cleared in advance by the higher-ups at parent company Viacom), the tweets have remained posted. \n“Welp, since I’m outta here anyway I might as well tell you all the things I’ve been holding in for the past 18 years. Brace yourself bros.,” the pinned tweet at the top of the page begins. And from there, it’s off to the races. \nTruth be told, there are a lot of tweets we can’t publish here. So head over to the channel’s Twitter page for the full panoply of salvos. \nHere’s a sampling of the tweets: \n\nSpike will be replaced with the Paramount Network on Thursday. Viacom made the move to differentiate the network and widen its audience. Rather than focusing on reruns and testosterone-driven shows with narrower demographics as Spike often does, Paramount will air shows and specials focused on a wider audience, such as a miniseries about the Waco, Texas tragedy airing in March and a half-hour comedy based on the film Heathers , starting in June. Programs along those lines are more appealing to advertisers, which should boost revenues at the company. \nThe new channel will, however, keep Spike’s most popular shows, to retain some of the existing audience. \nSpike has been having fun with the shutdown on social media for some time now. It all started when the announcement was made last December. Hang on, hang on… what?! #GoodbyeSpike https://t.co/plXL4UcQ9s ", "external_links": [], "published": "2018-01-17T14:16:00.000+02:00", "crawled": "2018-01-17T23:27:27.000+02:00", "highlightTitle": ""}