{"organizations": [], "uuid": "da2b0acbb49fb4184b5b1065f5364f5ea61d78aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223084514&w=1200&r=LYNXMPEE0H1H8", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-pope-chile/shutting-out-immigrants-is-not-christian-pope-says-idUKKBN1F72DI", "country": "US", "domain_rank": 408, "title": "Shutting out immigrants is not Christian, pope says", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T19:08:00.000+02:00", "replies_count": 0, "uuid": "da2b0acbb49fb4184b5b1065f5364f5ea61d78aa"}, "author": "", "url": "https://uk.reuters.com/article/uk-pope-chile/shutting-out-immigrants-is-not-christian-pope-says-idUKKBN1F72DI", "ord_in_thread": 0, "title": "Shutting out immigrants is not Christian, pope says", "locations": [], "entities": {"persons": [{"name": "pope francis", "sentiment": "none"}, {"name": "francis", "sentiment": "none"}, {"name": "philip pullella", "sentiment": "none"}, {"name": "marion giraldo", "sentiment": "none"}], "locations": [{"name": "iquique", "sentiment": "none"}, {"name": "pacific ocean", "sentiment": "none"}, {"name": "chile", "sentiment": "none"}, {"name": "peru", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 5:10 PM / Updated 4 hours ago Shutting out immigrants is not Christian, pope says Philip Pullella , Marion Giraldo 4 Min Read \nIQUIQUE, Chile (Reuters) - Pope Francis said on Thursday that it is not Christian to shut out immigrants, urging nations to welcome people whose lives had been “watered down” by poverty, injustice and exploitation. \nFrancis, whose defence of migrants and refugees has been a key theme of his nearly 5-year-old pontificate, spoke on his last day in Chile before he was due to leave for Peru to start the second and last leg of his Latin American tour. \n“There is no Christian joy when doors are closed; there is no Christian joy when others are made to feel unwanted, when there is no room for them in our midst,” he said in the homily of Mass on a beach in this city in Chile’s far north. \n“The cry of the poor is a kind of a prayer; it opens our hearts and teaches us to be attentive,” he said from an enormous white stage framed by dune-like desert mountains on one side and the hazy blue of the Pacific Ocean on the other. \nThe pope has stepped up his defence of immigrants in recent months as migration has become a hot political issue in many countries. \nIn the United States, lawmakers are still grappling with the fate of so-called dreamers, who were brought to the country illegally as children and now face deportation after decades of living there. \nIn Europe, the German far-right and anti-immigrant Alternative for Germany party became a key force last year, and in Italy, the anti-immigrant Northern League is expected to make gains in national elections in March. \nFrancis urged his listeners to be attentive to “all situations of injustice and to new forms of exploitation” including by those who profit from immigrants’ problems, such as lack of documentation. \nThe trials and difficulties of immigrants trying to keep their families together had left many feeling like “their lives had been watered down,” he said as 50,000 people faced the stage and the ocean. Pope Francis leads a mass at Lobito beach in Iquique, Chile, January 18, 2018. REUTERS/Rodrigo Garrido WAVE OF ARRIVALS \nChile has had much less immigration than other South American nations, but a stable economy and moderate politics since the end of the Pinochet dictatorship in 1990 have made it more attractive to those fleeing economic hardship elsewhere in Latin America. \nA wave of recent arrivals from Haiti and Venezuela has increasingly stoked anti-immigrant sentiment in Chile. Slideshow (6 Images) \nThe region around Iquique, which means “dreams,” in the local indigenous Aymara language, has the country’s highest percentage of migrants, according to official statistics. \nPeople from neighbouring Peru, Argentina, Ecuador and Bolivia have been attracted to Chile’s northern desert region, home to the majority of mines and a booming service and construction industry in the world’s biggest copper exporter. \nBut many who arrive seeking their fortunes have instead found poverty and exclusion. \n“There are many immigrants here who don’t have work, who live with very little, in rooms like animals,” said Dora Reyes, a Peruvian shopkeeper who moved to Chile two decades ago. “There is still a lot of racism and inequality.” \nAlthough immigration remains proportionally low compared with most developed countries, it has grown fivefold over the last 30 years, statistics from the government’s immigration service show. \nArrivals from Haiti surged 144 percent in 2015, while those from recession-hit Venezuela soared 192 percent. Additional reporting by Dave Sherwood; Editing by Lisa Von Ahn", "external_links": [], "published": "2018-01-18T19:08:00.000+02:00", "crawled": "2018-01-18T19:34:37.031+02:00", "highlightTitle": ""}