{"organizations": [], "uuid": "2cd90048d6000823d6370d011cb13aca7ca1b6b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2017/12/31/the-associated-press-star-wars-passes-beauty-and-the-beast-as-top-2017-earner.html", "country": "US", "domain_rank": 767, "title": "'Star Wars' passes 'Beauty and the Beast' as top 2017 earner", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-31T19:46:00.000+02:00", "replies_count": 0, "uuid": "2cd90048d6000823d6370d011cb13aca7ca1b6b3"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2017/12/31/the-associated-press-star-wars-passes-beauty-and-the-beast-as-top-2017-earner.html", "ord_in_thread": 0, "title": "'Star Wars' passes 'Beauty and the Beast' as top 2017 earner", "locations": [], "entities": {"persons": [{"name": "jack black", "sentiment": "none"}, {"name": "dwayne johnson", "sentiment": "none"}, {"name": "kevin hart", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "the rock", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "positive"}, {"name": "columbia pictures", "sentiment": "none"}, {"name": "disney", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES (AP) — On the last day of the calendar year, \"Star Wars: The Last Jedi\" has surpassed \"Beauty and the Beast\" as the top grossing film in North America in 2017. It also topped the charts for the weekend for the third time, but just barely — Dwayne Johnson's \"Jumanji: Welcome to the Jungle\" is close on its tail.\nAccording to studio estimates on Sunday, \"The Last Jedi\" will add $52.4 million over the weekend bringing its domestic total to $517.1 million. \"Beauty and the Beast,\" also a Disney release, netted out with $504 million for the year.\nWith the weekend's earnings, \"The Last Jedi\" will also cross the $1 billion mark globally — even before it opens in China on Jan. 5.\nBut \"Star Wars\" is facing some hefty competition still, from the likes of The Rock, Jack Black and Kevin Hart, whose \"Jumanji\" sequel took in $50.6 million in its second weekend in theaters to take second place. The Columbia Pictures film has earned a stunning $169.8 million to date and could even reach $300 million domestically by the end of its run.\nThe acapella franchise \"Pitch Perfect 3\" took third place in weekend two, with $17.8 million, bringing its total to $64.3 million — still less than what \"Pitch Perfect 2\" earned on its opening weekend alone in May 2015 ($69.2 million).\nAnother musical, \"The Greatest Showman,\" with Hugh Jackman as P.T. Barnum, came in fourth place with $15.3 million after adding 310 screens. The animated kids film \"Ferdinand\" took fifth with $11.7 million.\nIn its first weekend in theaters after debuting on Christmas Day, Ridley Scott's \"All the Money in the World\" took in $5.5 million, bringing its total to $12.6 million. The film got some added recognition when Scott replaced Kevin Spacey with Christopher Plummer and reshot portions of the film only 6 weeks before it was set to hit theaters. But the hype of the impressive feat hasn't translated into big earnings.\nAnother adult-targeted film, Alexander Payne's \"Downsizing,\" is struggling in theaters, taking in $4.6 million in its second weekend in theaters. The Matt Damon-starrer has earned only $17.1 million to date against a $68 million production budget.\nIn limited release, Aaron Sorkin's \"Molly's Game,\" starring Jessica Chastain, earned $2.33 million. The film about the \"poker princess\" Molly Bloom expands on Jan. 5. And Paul Thomas Anderson's \"Phantom Thread\" earned $220,000 from four theaters over the weekend after its Christmas opening. Starring Daniel Day-Lewis as a designer, \"Phantom Thread\" has grossed $531,000 to date.\n\"As end of year marketplaces go, this is a great time to be a moviegoer,\" said Paul Dergarabedian, a senior media analyst for comScore. \"There are so many movies out there, the only trick is how do you see all of them.\"\nThe year as a whole will surpass $11 billion again, with comScore projecting $11.12 billion, which is down 2.3 percent from last year's record-breaking grosses ($11.4 billion), and almost on par with 2015's $11.14 billion.\n\"We actually had a really great end of year surge,\" Dergarabedian said. \"'Star Wars' adding about a half billion dollars didn't hurt. But 'Star Wars' didn't do this alone. It's not just about the big movies at the top, it's also about the smaller movies that provided a really great foundation. Every dollar counts.\"\nEstimated ticket sales for Friday through Sunday at U.S. and Canadian theaters, according to comScore. Where available, the latest international numbers for Friday through Sunday are also included. Final domestic figures will be released Tuesday.\n1.\"Star Wars: The Last Jedi,\" $52.4 million ($68 million international).\n2.\"Jumanji: Welcome to the Jungle,\" $50.6 million ($67 million international).\n3.\"Pitch Perfect 3,\" $17.8 million ($13.1 million international).\n4.\"The Greatest Showman,\" $15.3 million ($28.5 million international).\n5.\"Ferdinand,\" $11.7 million ($23.1 million international).\n6.\"Coco,\" $6.6 million ($21.4 million international).\n7.\"All the Money in the World,\" $5.5 million ($1.4 million international).\n8.\"Darkest Hour,\" $5.3 million.\n9.\"Downsizing,\" $4.6 million ($1.4 million international).\n10.\"Father Figures,\" $3.7 million.\nEstimated ticket sales for Friday through Sunday at international theaters (excluding the U.S. and Canada), according to comScore:\n1. \"Star Wars: The Last Jedi,\" $68 million.\n2. \"Jumanji: Welcome to the Jungle,\" $67 million.\n3. \"Ex-File 3 (Quan Ren 3),\" $41.1 million.\n4. \"Goldbuster (Yao Ling Ling),\" $38.4 million.\n5. \"Youth,\" $28 million.\n6. \"Hanson and the Beast,\" $25.5 million.\n7. \"Ferdinand,\" $23.1 million.\n8. \"Namiya,\" $21.4 million.\n9. \"Coco,\" $21.4 million.\n10. \"Along with the Gods: The Two Worlds,\" $20.1 million.\nUniversal and Focus are owned by NBC Universal, a unit of Comcast Corp.; Sony, Columbia, Sony Screen Gems and Sony Pictures Classics are units of Sony Corp.; Paramount is owned by Viacom Inc.; Disney, Pixar and Marvel are owned by The Walt Disney Co.; Miramax is owned by Filmyard Holdings LLC; 20th Century Fox and Fox Searchlight are owned by 21st Century Fox; Warner Bros. and New Line are units of Time Warner Inc.; MGM is owned by a group of former creditors including Highland Capital, Anchorage Advisors and Carl Icahn; Lionsgate is owned by Lions Gate Entertainment Corp.; IFC is owned by AMC Networks Inc.; Rogue is owned by Relativity Media LLC.\nFollow AP Film Writer Lindsey Bahr on Twitter at: http://twitter.com/ldbahr", "external_links": [], "published": "2017-12-31T19:46:00.000+02:00", "crawled": "2018-01-01T08:01:07.102+02:00", "highlightTitle": ""}