{"organizations": [], "uuid": "330de0e41d263e76b701c5682deec300df06d6ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222152657&w=1200&r=LYNXMPEE0E0YA", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-ukraine-corruption-imf/imf-concerned-by-ukraines-new-anti-corruption-draft-law-paper-idUSKBN1F41QJ", "country": "US", "domain_rank": 408, "title": "IMF concerned by Ukraine's new anti-corruption draft law - paper", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T15:27:00.000+02:00", "replies_count": 0, "uuid": "330de0e41d263e76b701c5682deec300df06d6ce"}, "author": "", "url": "https://www.reuters.com/article/us-ukraine-corruption-imf/imf-concerned-by-ukraines-new-anti-corruption-draft-law-paper-idUSKBN1F41QJ", "ord_in_thread": 0, "title": "IMF concerned by Ukraine's new anti-corruption draft law - paper", "locations": [], "entities": {"persons": [{"name": "ron van rooden", "sentiment": "none"}, {"name": "van rooden", "sentiment": "none"}, {"name": "petro poroshenko", "sentiment": "none"}], "locations": [{"name": "ukraine", "sentiment": "none"}], "organizations": [{"name": "imf", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "min read  kiev", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "international monetary fund", "sentiment": "none"}, {"name": "ukrainska pravda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 1:55 PM / Updated 8 minutes ago IMF concerned by Ukraine's new anti-corruption draft law - paper Reuters Staff 3 Min Read \nKIEV (Reuters) - The International Monetary Fund has told the Ukrainian authorities that it does not support a draft law to create an anti-corruption court because the bill does not guarantee its independence, the newspaper Ukrainska Pravda reported on Monday. \nSlow progress in establishing a court to handle corruption cases while demonstrating independence and transparency has been one of the main obstacles to the disbursement of a long-delayed loan tranche under the aid-for-reforms program. \nIn response to international pressure to speed up the process, President Petro Poroshenko submitted a new draft law to parliament in December. \nBut the IMF mission chief for Ukraine, Ron van Rooden, has since written to the presidential administration to express the Fund’s concerns about parts of the bill, Ukrainska Pravda said, publishing what it said was the text of the letter in full. \n“We have serious concerns about the draft law,” van Rooden said in the letter dated Jan. 11. “Several provisions are not consistent with the authorities’ commitments under Ukraine’s IMF-supported program.” \nHe said parts of the legislation could undermine the independence of the court and the transparent appointment of competent and trustworthy judges. \nThe law could also lead to further delays as an additional bill would need to be submitted by the president for the court to established, he said. \n“In its current form ... we would not be able to support the draft law,” he said. \nResponding to a request for comment, Poroshenko’s office denied an allegation in the letter that the law is not in line with recommendations of a leading European rights watchdog. \n“President Petro Poroshenko has repeatedly emphasized that the country’s leadership has the political will to create an independent anti-corruption court,” it said in an emailed statement. \nThe IMF did not immediately reply to a request for comment. \nThe IMF and Ukraine’s other foreign backers have repeatedly called for Ukraine to improve efforts to root out graft. They see an anti-corruption court as an essential tool for eliminating the power of vested interests. \nReform progress stalled last year, raising concerns the authorities are backtracking on commitments and unpopular policy changes in anticipation of presidential and parliamentary elections in 2019. \nEstablishing the court, sticking to gas price adjustments and implementing sustainable pension reform are the key conditions Ukraine must meet to qualify for the next loan tranche of around $2 billion from the IMF. Reporting by Alessandra Prentice and Natalia Zinets; editing by Matthias Williams and Richard Balmforth", "external_links": [], "published": "2018-01-15T15:27:00.000+02:00", "crawled": "2018-01-15T16:11:22.000+02:00", "highlightTitle": ""}