{"organizations": [], "uuid": "aa51e7308aa01c853dcbcba4775808545c5c64e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 7}, "facebook": {"likes": 9, "shares": 9, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/02/05/103365421-GettyImages-458005108.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/03/holding-silver-in-the-new-year-could-bring-good-luck-to-investors.html", "country": "US", "domain_rank": 767, "title": "Holding silver in the new year could bring good luck to investors", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.015, "site_type": "news", "published": "2018-01-03T14:30:00.000+02:00", "replies_count": 0, "uuid": "aa51e7308aa01c853dcbcba4775808545c5c64e5"}, "author": "Bill Baruch", "url": "https://www.cnbc.com/2018/01/03/holding-silver-in-the-new-year-could-bring-good-luck-to-investors.html", "ord_in_thread": 0, "title": "Holding silver in the new year could bring good luck to investors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sometimes it feels like silver has become the forgotten metal, as gold comes off its best year since 2010 and silver gained merely half as much in 2017. But there's good reason to be bullish on silver at the start of the year.\nSilver's recent setup gives us reason to believe there is a seasonal trade afoot. Just take a look at what's happened in years prior: If you'd bought silver on Jan. 5 and have held through Feb. 14, you've made money in 13 of the last 15 years.\nFor us, this seasonal trade aligns perfectly with a breakout above major three-star resistance, and a run of the same distance as we saw last July. We seem to be seeing a pattern similar to that of last summer unfolding right before our eyes.\nFor the third week in a row, the Commitment of Traders data released on Friday reflected a net short position in silver for the week ending Dec. 26. The last time silver boasted a net short position was the week ending July 18; that month, silver bottomed and kicked off a rally of $3, or 20 percent.\nFast forward: Since bottoming on Dec. 11, silver has rallied about 10 percent; Friday's session settled at major three-star resistance, a trend line from the September highs and its 200-day moving average.\nSince the Commitment of Traders data reflect figures as of Dec. 26, the short-covering rally likely began last Friday. We think the rally is just heating up here, and investors ought to consider silver as 2018 kicks off.\nVote Vote to see results Total Votes: Not a Scientific Survey. Results may not total 100% due to rounding.\nDisclaimer", "external_links": [], "published": "2018-01-03T14:30:00.000+02:00", "crawled": "2018-01-03T14:48:03.008+02:00", "highlightTitle": ""}