{"organizations": [], "uuid": "93fdfd9a39f49da017771071986ec9504da6b21a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 32, "shares": 32, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219503844&w=1200&r=LYNXMPEE0407Z", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-peru-fujimori/perus-pardoned-fujimori-leaves-clinic-starts-life-as-free-man-idUSKBN1EU0DL", "country": "US", "domain_rank": 408, "title": "Peru's pardoned Fujimori leaves clinic, starts life as free man", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T06:43:00.000+02:00", "replies_count": 0, "uuid": "93fdfd9a39f49da017771071986ec9504da6b21a"}, "author": "", "url": "https://www.reuters.com/article/us-peru-fujimori/perus-pardoned-fujimori-leaves-clinic-starts-life-as-free-man-idUSKBN1EU0DL", "ord_in_thread": 0, "title": "Peru's pardoned Fujimori leaves clinic, starts life as free man", "locations": [], "entities": {"persons": [{"name": "fujimori", "sentiment": "negative"}, {"name": "kenji", "sentiment": "none"}, {"name": "alberto fujimori", "sentiment": "none"}, {"name": "pedro pablo kuczynski", "sentiment": "none"}], "locations": [{"name": "peru", "sentiment": "none"}, {"name": "la molina", "sentiment": "none"}], "organizations": [{"name": "min read  lima", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "centenario clinic", "sentiment": "none"}, {"name": "guadalupe pardo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 4:43 AM / in 7 hours Peru's Fujimori leaves clinic as free man, reigniting anger over pardon Guadalupe Pardo 3 Min Read \nLIMA (Reuters) - Peru’s former authoritarian leader Alberto Fujimori left hospital as a free man on Thursday, waving to supporters from a wheelchair and reigniting anger over a pardon he secured from President Pedro Pablo Kuczynski on Christmas Eve. \nThe pardon has polarized Peru, triggering anti-government protests and political resignations that have shaken Kuczynski’s already-weak government. Kuczynski said last week he would unveil a new cabinet soon, but has announced no details yet. \nA corrupt dictator to some and a misunderstood hero to others, Fujimori had been serving a 25-year sentence for graft and human rights crimes during his 1990-2000 rightwing populist government. \n“To the joy of many Peruvians, today Alberto Fujimori is free,” his doctor, and former health minister, Alejandro Aguinaga, said on television channel Canal N, adding that Fujimori was still recovering from heart troubles. \nFujimori, 79, was trailed by police escorts and news cameras as he arrived at a sprawling house in the upscale district of La Molina in Lima, the Peruvian capital. \nIn a snapshot shared by his daughter on social media, Fujimori was seen in a garden surrounded by his four adult children - a sign of unity that fueled speculation he would end a political rivalry between siblings Keiko and Kenji. Former Peruvian president Alberto Fujimori waves as he leaves in a car from the hospital Centenario in Lima, Peru, January 4, 2018. REUTERS/Guadalupe Pardo \nWearing a jacket and blue shirt, a smiling Fujimori appeared alert as he waved to crowds outside the Lima hospital where he had been interned for what his doctor called life-threatening blood-pressure and heart problems on the eve of the pardon. \nKuczynski, a former investment banker who is 79, like Fujimori, cited the latter’s ailing health when he pardoned him nearly two weeks ago. But the decision has been widely seen in Peru as payback after Fujimori enlisted his loyalists to help Kucyznski survive an impeachment bid following a graft scandal. Slideshow (3 Images) \n“You may have benefited improperly from an illegal pardon, but that does not take away your responsibility for the death and corruption of the 1990s,” said human rights activist Gisela Ortiz, whose brother, a university student, was killed in a 1992 death squad massacre Fujimori had been convicted of commanding. \nEarlier on Thursday, Fujimori’s supporters rallied in front of Kuczynski’s house to show support for the pardon, as critics warned Kuczynski that he would be beholden to Fujimori and the rightwing party led by his children Keiko and Kenji that has an absolute majority in Congress. \nFujimori signaled from his hospital bed last week that he would not use his freedom to return to politics, but his loyalists have called for him to become an adviser to Popular Force, which controls a majority of seats in Congress. \n“There’s nothing wrong with receiving advice from him, or counting on his support or counsel for a future presidential candidate,” Popular Force lawmaker Maritza Garcia told Reuters last week. “Because of his health he can’t lead the party, but he can direct it from his bed or wheelchair.” Reporting by Guadalupe Pardo and Reuters TV; Additional reporting by Marco Aquino; Writing by Mitra Taj; Editing by Clarence Fernandez", "external_links": [], "published": "2018-01-05T06:43:00.000+02:00", "crawled": "2018-01-05T06:56:42.095+02:00", "highlightTitle": ""}