{"organizations": [], "uuid": "4ddb2f76ca186725de82e71608652b4957105985", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226177934&w=1200&r=LYNXMPEE0S06X", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/mexico-violence/mexico-to-send-troops-to-stem-violence-after-record-25000-murders-idINKBN1FI09J", "country": "US", "domain_rank": 408, "title": "Mexico to send troops to stem violence after record 25,000 murders", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T05:27:00.000+02:00", "replies_count": 0, "uuid": "4ddb2f76ca186725de82e71608652b4957105985"}, "author": "", "url": "https://in.reuters.com/article/mexico-violence/mexico-to-send-troops-to-stem-violence-after-record-25000-murders-idINKBN1FI09J", "ord_in_thread": 0, "title": "Mexico to send troops to stem violence after record 25,000 murders", "locations": [], "entities": {"persons": [{"name": "enrique pena nieto", "sentiment": "none"}, {"name": "renato sales", "sentiment": "none"}], "locations": [{"name": "mexico", "sentiment": "none"}, {"name": "mexico city", "sentiment": "none"}], "organizations": [{"name": "national security", "sentiment": "none"}, {"name": "institutional revolutionary party", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MEXICO CITY (Reuters) - Mexican officials said on Sunday the government was set to unleash a new wave of troops to crack down on criminal groups in regions where a surge in violence led to more than 25,000 murders last year.\nNational Security Commissioner Renato Sales said federal police troops will work with local officials to round up known major criminals and bolster investigations.\nThe aim was “to recover peace and calm for all Mexicans,” he said. He did not provide details on the number of federal police to be deployed.\nMore than 25,000 murders were recorded last year as rival drug gangs increasingly splintered into smaller, more blood-thirsty groups after more than a decade of a military-led campaign to battle the cartels.\nViolence is a central issue ahead of the presidential election in July. Mexican President Enrique Pena Nieto’s ruling Institutional Revolutionary Party is trailing in third place in recent polls.\nA soldier stands guard next to a crime scene, where men were killed inside a home by unknown assailants, in the municipality of San Nicolas de los Garza, Mexico, January 27, 2018.REUTERS/Jorge Lopez Sales said federal police troops would be deployed in the states of Colima and Baja California Sur, the resort town of Cancun and the border city of Ciudad Juarez, among others. He said more details would be forthcoming within days.\nEarlier this month, the United States slapped its most stringent travel warnings on the states of Colima, Michoacan, Sinaloa, Tamaulipas and Guerrero, ranking them as bad as war-ravaged Syria, Afghanistan and Iraq.\nA soldier and a police officer stand guard as a forensic technician works at a crime scene, where men were killed inside a home by unknown assailants, in the municipality of San Nicolas de los Garza, Mexico, January 27, 2018.REUTERS/Jorge Lopez At least 25 people were murdered in Mexico this weekend, according to officials and local media, including nine men who were executed at a house party in a suburb of the wealthy northern industrial city of Monterrey.\nMasked gunmen burst into a home in San Nicholas de los Garza as a group watched a local soccer team play on television, according to state prosecutors. Seven were killed at the scene and two more died later at a hospital.\nThere were a wave of attacks in night spots late Saturday and early Sunday. A group of armed men killed three people in a bar in the resort city of Cancun, a Chilean tourist was killed in the Pacific beach resort of Acapulco, and two more were killed in a bar in the capital of Veracruz state.\nSix more were killed in the border city of Ciudad Juarez and four more died in the border state of Tamaulipas, where at least 10 were killed during the week at outlaw road blockades and in shootouts, local media reported.\nReporting by Michael O'Boyle and Diego Ore; Editing by Jeffrey Benkoe\n ", "external_links": [], "published": "2018-01-29T05:27:00.000+02:00", "crawled": "2018-01-29T06:08:15.016+02:00", "highlightTitle": ""}