{"organizations": [], "uuid": "68252e46c09bcc82ce4d050970571a4d9311711e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/08/gettyimages-637305646.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/30/cybersecurity-startups-venture-capital-tenable/", "country": "US", "domain_rank": 1196, "title": "Cybersecurity Firm Tenable Reveals $189M in Revenue | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.995, "site_type": "news", "published": "2018-01-30T10:39:00.000+02:00", "replies_count": 0, "uuid": "68252e46c09bcc82ce4d050970571a4d9311711e"}, "author": "Jeff John Roberts", "url": "http://fortune.com/2018/01/30/cybersecurity-startups-venture-capital-tenable/", "ord_in_thread": 0, "title": "Cybersecurity Firm Tenable Reveals $189M in Revenue | Fortune", "locations": [], "entities": {"persons": [{"name": "jeff john roberts", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Jeff John Roberts 8:39 AM EST \nTenable, a Maryland-based firm that helps companies assess cybersecurity vulnerabilities, disclosed 2017 revenues on Tuesday of $189 million, which it says reflects year-over-year growth of 50 percent. \nThe disclosure is significant in part because the overall cyber industry, which has seen hundreds of companies raise massive amounts of venture capital funding in recent years, is facing doubts about its viability. \nAccording to a report last week by Reuters , the ongoing threat of hacking and espionage means the sector is attractive to investors. But some firms are nonetheless struggling to fulfill expectations: \nVenture capital continues to pour into the industry, driven by the belief that there is no end in sight to cyber attacks or companies’ need to protect themselves. Yet only a handful of startups have successfully sold themselves or floated in the stock market in recent years. \nThe result is a number of these start-ups have become corporate “zombies” with little prospect of fetching a good price in an initial public offering (IPO) or becoming acquisition targets, experts said. Their early investors have been left without an easy or profitable exit. \nIn the case of Tenable, which raised an eye-popping $250 million from Insight Venture Partners and others in 2015, the decision to disclose its revenues to Fortune is likely an effort to rebut that narrative and make the case the company is on track for an IPO. \n“There’s been a lot of overfunding by an under-educated investor base in cyber, which has led to confusion. Tenable is in a very different category. We have one of most widely used pieces of tech in industry,” says CEO Amit Yoran. \nGet Data Sheet , Fortune’s technology newsletter. \nThe company—whose clients include the likes of Starbucks (sbux) , NASA, and Stanford University—did not disclose specific earnings numbers but says it is breaking even, and pointed to a news release that described a rapid global expansion. \n“The fourth quarter of 2017 also marks the seventh consecutive quarter of greater than 40 percent year-over-year billings growth for the company,” said Tenable in the release. \nTenable’s announcement comes a day after Cylance , another well-funded cyber security giant, told WSJ Pro that it brought in $100 million of revenue last year, and said the company is taking steps to become cash flow positive. \nInvestors may be anxious to see exits by cybersecurity in companies this year, following a disappointing 2017 in which threat response firm Forescout was the only firm to conduct an IPO. The public offering saw Forescout raise $116 million but at a valuation of $800 million, which was below the $1 billion valuation it reached earlier in private markets. \nMeanwhile, another once high-flying cyber firm, Carbon Black, filed for an IPO in late 2016 but quietly shelved the offering the following year. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-30T10:39:00.000+02:00", "crawled": "2018-01-30T18:15:19.002+02:00", "highlightTitle": ""}