{"organizations": [], "uuid": "b93dcc437dd765db10509a432a6da648d8ad0ec0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-growth-leads-to-management-appointments-at-heidenhain-corporation.html", "country": "US", "domain_rank": 767, "title": "Growth Leads to Management Appointments at HEIDENHAIN CORPORATION", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.015, "site_type": "news", "published": "2018-01-16T15:47:00.000+02:00", "replies_count": 0, "uuid": "b93dcc437dd765db10509a432a6da648d8ad0ec0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-growth-leads-to-management-appointments-at-heidenhain-corporation.html", "ord_in_thread": 0, "title": "Growth Leads to Management Appointments at HEIDENHAIN CORPORATION", "locations": [], "entities": {"persons": [{"name": "john thormodsgard", "sentiment": "none"}, {"name": "robert setbacken", "sentiment": "none"}, {"name": "chris weber", "sentiment": "none"}], "locations": [{"name": "schaumburg", "sentiment": "none"}, {"name": "ill.", "sentiment": "none"}, {"name": "il", "sentiment": "none"}, {"name": "schaumburg", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "san jose", "sentiment": "none"}], "organizations": [{"name": "heidenhain corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SCHAUMBURG, Ill., Jan. 16, 2018 /PRNewswire/ -- Significant company growth and key initiatives lead to important management changes at HEIDENHAIN CORPORATION in North America. These exciting changes include the formation of two regional field sales teams located in Schaumburg, IL, and San Jose, CA, as well as the formation of an overall sales coordination team focused on North American customer satisfaction metrics. Three of the newly defined senior positions are appointments of highly experienced HEIDENHAIN leadership personnel, each with tenures in excess of 20 years, or 75 years combined. A fourth recent appointment strengthens the service organization leadership and was announced in October 2017.\nSpecifically, Chris Weber, was appointed as Senior Eastern Field Sales Director and Robert Setbacken as Senior Western Field Sales and Business Development Director. John Thormodsgard, appointed as the new group formed within the company as Sales Operations Director - North America, will manage the collective sales operations functions located in Schaumburg, IL, supporting the regional customer sales and support teams directly. Each will manage teams supporting all product groups and markets that HEIDENHAIN serves.\nDavid Fuson, an external appointment made in August 2017, also now leads the technical service group headquartered in Schaumburg, IL, supporting all North American territories, including Canada and Mexico. As HEIDENHAIN's Service Operations Manager, David brings extensive field support and management experience to the group.\n\"Our recent investments in west coast personnel and executive presence, combined with our organizational changes, will facilitate geographical and operational infrastructure to optimize the proximity of staff to our customer base and focus on growth market segments. The changes are designed to enhance our customers' experience and our responsiveness to business demand,\" said President and Managing Director David Doyle, now also located in San Jose, CA. \"We worked on these and other staff changes throughout 2017 and all have become fully effective as of January 1, 2018.\"\nThe changes come as HEIDENHAIN CORPORATION executes integration of the AMO product line, integrates its ACU-RITE manufacturing operations, and establishes a more significant west coast sales and support presence, with office locations including San Jose, Fremont, Santa Barbara and Irvine, CA. HEIDENHAIN CORPORATION also recently established an office in Houston, TX, and expects to add presence in Tacoma, WA, and Charlotte, NC, in Q1 2018.\n\"Our staff has executed extremely well throughout 2017 which was an outstanding year for HEIDENHAIN CORPORATION,\" Rick Korte, CEO added. \"Our new business development initiatives have created promising momentum in multiple areas and we have established a 'Customer First' ethos throughout the team. Continuous improvement with a total quality approach is the core to the company mission.\"\nAbout HEIDENHAIN\nDr. Johannes HEIDENHAIN GmbH, headquartered in Traunreut, Germany, develops and supports motion control feedback solutions for the machine tool, semiconductor, electronics assembly and test, metrology, automation, medical, energy, biotechnology and other global markets. The North American subsidiary is HEIDENHAIN CORPORATION, headquartered in Schaumburg, IL, and San Jose, CA, and has been serving the U.S. industry for over 50 years. www.heidenhain.us\nFor more information, contact HEIDENHAIN's North American Public Relations Manager Kathleen Stoneski at 847-519-4702 or kstoneski@heidenhain.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/growth-leads-to-management-appointments-at-heidenhain-corporation-300583076.html\nSOURCE HEIDENHAIN CORPORATION", "external_links": ["http://www.prnewswire.com/news-releases/growth-leads-to-management-appointments-at-heidenhain-corporation-300583076.html", "http://www.heidenhain.us/"], "published": "2018-01-16T15:47:00.000+02:00", "crawled": "2018-01-16T16:16:32.006+02:00", "highlightTitle": ""}