{"organizations": [], "uuid": "4faf4a985451f272089417300ea4e3973b9f6613", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-navios-maritime-partners-l-p-announcesa22-point-0-million-acquisition-of-two-2006-built-panamax-vessels.html", "country": "US", "domain_rank": 767, "title": "Navios Maritime Partners L.P. Announces $22.0 million Acquisition of Two 2006-built Panamax Vessels", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.026, "site_type": "news", "published": "2018-01-25T17:00:00.000+02:00", "replies_count": 0, "uuid": "4faf4a985451f272089417300ea4e3973b9f6613"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-navios-maritime-partners-l-p-announcesa22-point-0-million-acquisition-of-two-2006-built-panamax-vessels.html", "ord_in_thread": 0, "title": "Navios Maritime Partners L.P. Announces $22.0 million Acquisition of Two 2006-built Panamax Vessels", "locations": [], "entities": {"persons": [{"name": "clarksons", "sentiment": "none"}], "locations": [], "organizations": [{"name": "navios maritime partners l.p.", "sentiment": "negative"}, {"name": "acquisition of two 2006-built panamax vessels monaco", "sentiment": "negative"}, {"name": "navios partners", "sentiment": "none"}, {"name": "ebitda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MONACO, Navios Maritime Partners L.P. (\"Navios Partners\") (NYSE:NMM), an international owner and operator of drybulk and container vessels, announced today that it has agreed to acquire two 2006-built Panamax vessels with a capacity of approximately 74,500 dwt each, for a total purchase price of $22.0 million. The vessels are expected to be delivered to Navios Partners' owned fleet within Q1 2018.\nBased on the existing charters of the vessels ($9,375 net per day until May/November 2018 and $9,844 until March/August 2018, respectively) and the current rate environment (Clarksons’ 1-year time charter rate for Panamax vessels as of January 19, 2018), the vessels are expected to generate approximately $4.8 million of EBITDA for the first year, assuming midpoint of redelivery from charterers, operating expenses approximating current operating costs and 360 revenue days.\nNavios Partners is expected to finance the acquisition with cash on its balance sheet and $14.3 million bank debt maturing in 2023 and bearing interest at LIBOR plus 300 bps per annum.\nFleet Update\nFollowing this acquisition, Navios Partners controls 38 vessels.\nAbout Navios Maritime Partners L.P.\nNavios Partners (NYSE:NMM) is a publicly traded master limited partnership which owns and operates container and dry bulk vessels. please visit our website at www.navios-mlp.com .\nForward-Looking Statements\nThis press release contains forward-looking statements (as defined in Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended) concerning future events including Navios Partners’ 2018 cash flow generation, future contracted revenues, future distributions and its ability to have a dividend going forward, opportunities to reinvest cash accretively in a fleet renewal program or otherwise, potential capital gains, our ability to take advantage of dislocation in the market and Navios Partners’ growth strategy and measures to implement such strategy; including expected vessel acquisitions and entering into further time charters. Words such as “may”, “expects”, “intends”, “plans”, “believes”, “anticipates”, “hopes”, “estimates”, and variations of such words and similar expressions are intended to identify forward-looking statements. Such statements include comments regarding expected revenue and time charters. These forward-looking statements are based on the information available to, and the expectations and assumptions deemed reasonable by Navios Partners at the time these statements were made. Although Navios Partners believes that the expectations reflected in such forward-looking statements are reasonable, no assurance can be given that such expectations will prove to have been correct. These statements involve known and unknown risks and are based upon a number of assumptions and estimates which are inherently subject to significant uncertainties and contingencies, many of which are beyond the control of Navios Partners. Actual results may differ materially from those expressed or implied by such forward-looking statements. Factors that could cause actual results to differ materially include, but are not limited to, uncertainty relating to global trade, including prices of seaborne commodities and continuing issues related to seaborne volume and ton miles, our continued ability to enter into long-term time charters, our ability to maximize the use of our vessels, expected demand in the dry cargo shipping sector in general and the demand for our Panamax, Capesize, Ultra-Handymax and Container vessels in particular, fluctuations in charter rates for dry cargo carriers and container vessels, the aging of our fleet and resultant increases in operations costs, the loss of any customer or charter or vessel, the financial condition of our customers, changes in the availability and costs of funding due to conditions in the bank market, capital markets and other factors, increases in costs and expenses, including but not limited to: crew wages, insurance, provisions, port expenses, lube oil, bunkers, repairs, maintenance and general and administrative expenses, the expected cost of, and our ability to comply with, governmental regulations and maritime self-regulatory organization standards, as well as standard regulations imposed by our charterers applicable to our business, general domestic and international political conditions, competitive factors in the market in which Navios Partners operates; risks associated with operations outside the United States; and other factors listed from time to time in Navios Partners’ filings with the Securities and Exchange Commission, including its Form 20-Fs and Form 6- Ks. Navios Partners expressly disclaims any obligations or undertaking to release publicly any updates or revisions to any forward-looking statements contained herein to reflect any change in Navios Partners’ expectations with respect thereto or any change in events, conditions or circumstances on which any statement is based. Navios Partners makes no prediction or statement about the performance of its common units.\nPublic & Investor Relations Contact:\nNavios Maritime Partners L.P.\n+1.212.906.8645\nInvestors@navios-mlp.com\nNicolas Bornozis Capital Link, Inc.\n+1.212.661.7566\nnaviospartners@capitallink.com\nSource:Navios Maritime Partners L.P.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/c78a5586-78a9-4365-8976-0f74d7be183f", "https://www.globenewswire.com/Tracker?data=A2LJ_ugHLS8Q1ZMdFlMdPjOy70k5EMiJfh7197oRF7WeWHls8JGQEKKvLsfVCLDv1LKY_rOyo2nkwYBxJwvYMe59kZYzlgn6Fi0Wx65S5CA=", "https://www.globenewswire.com/Tracker?data=P2nRl-XJ_K3tdzeccM-7DhglddsvgacUtDK-USGitkQBtVcH3sYRXY1dMtn5pB5gQviv_qgPrmja9GSrMbdDvryvws2rKUZ-GB7RsDdLpB6SSEoiGkZdfRpDM4LQv37a", "https://www.globenewswire.com/Tracker?data=tK7Pp1QURbHOqZ8tzsfISu_vWFfy7JU8WWgrYt75AClugZefhSo7Bk_rNr72R_ELWsHNWk7f5nPpwKluoIs1ssKgo8uj5aR6qPke7qg5mtg="], "published": "2018-01-25T17:00:00.000+02:00", "crawled": "2018-01-25T18:34:01.000+02:00", "highlightTitle": ""}