{"organizations": [], "uuid": "0a15d97d468c5b9d8e1a135a74819f5fc2cdefd3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180122.html", "section_title": "Archive News &amp; Video for Monday, 22 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/column-russell-coal-asia/rpt-column-coal-delays-seasonal-price-decline-on-robust-asia-demand-russell-idUSL4N1PH1W6", "country": "US", "domain_rank": 408, "title": "RPT-COLUMN-Coal delays seasonal price decline on robust Asia demand: Russell", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-22T20:01:00.000+02:00", "replies_count": 0, "uuid": "0a15d97d468c5b9d8e1a135a74819f5fc2cdefd3"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/column-russell-coal-asia/rpt-column-coal-delays-seasonal-price-decline-on-robust-asia-demand-russell-idUSL4N1PH1W6", "ord_in_thread": 0, "title": "RPT-COLUMN-Coal delays seasonal price decline on robust Asia demand: Russell", "locations": [], "entities": {"persons": [{"name": "russell", "sentiment": "positive"}, {"name": "clyde russell", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "launceston", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Repeats with no changes to text. The opinions expressed here are those of the author, a columnist for Reuters.)\n* GRAPHIC: China seaborne coal imports vs Newcastle price: reut.rs/2DVJUkH\nBy Clyde Russell\nLAUNCESTON, Australia, Jan 22 (Reuters) - It’s getting to the time of year when a seasonal decline in thermal coal prices in Asia is to be expected as winter’s demand peak passes - but so far the power station fuel is defying gravity.\nThe price of spot cargoes of thermal coal from Australia’s Newcastle port, a regional benchmark, ended at $108.75 a tonne on Jan. 19, within touching distance of the $109.50 reached on Jan. 17, which was the highest in a year.\nThe price has rallied 5.8 percent since the end of last year and by 18 percent since the most recent trough of $92.20 a tonne on Nov. 23.\nThe first port of call when looking at moves in thermal coal prices in the seaborne market is China, given its status as the largest importer of the fuel.\nWhile China’s demand from the seaborne market does appear to have picked up in January, it also seems that Asia’s other top importers have been taking more cargoes.\nVessel-tracking and port data compiled by Thomson Reuters Supply Chain and Commodity Forecasts suggest China will import around 20.9 million tonnes of coal, both thermal and coking, in January, up from 17.2 million in December and 19.1 million in November.\nThe January estimate accounts only for vessels that have already discharged their cargoes, are currently discharging or awaiting discharge, or are under way and expected to arrive prior to the end of the month.\nIf the January estimate is accurate, it would represent China’s biggest monthly seaborne imports since September last year.\nJapan, the third-largest coal importer in Asia, is also ramping up imports, with 18.2 million tonnes expected to arrive in January, up from 16.3 million in December and November’s 15.2 million.\nImports by fourth-ranked South Korea are also likely to stay at elevated levels in January, with 11.1 million tonnes expected from the seaborne market, just lower than December’s 11.8 million but well up on November’s 9.7 million.\nIndia’s January figure of 16.1 million tonnes looks like a softer outcome in the world’s second-biggest coal importer when compared to December’s 18 million. But it’s worth noting that last month’s figure was the highest since June 2016.\nAUSTRALIA EXPORTS SURGE On the supply side, vessel-tracking figures show top exporter Australia on track for a record month in January, with shipment of 38.5 million tonnes of both thermal and coking coal, the highest in shipping data records going back to January 2015.\nThe January number is up from 31.3 million tonnes in December and 28.1 million in November.\nNumber two exporter Indonesia also looks to be having a strong start to 2018, with January shipments estimated at 27.7 million tonnes, up from December’s 26.1 million and level with November’s 27.8 million.\nOverall, the picture that emerges is one of strength in Asia’s seaborne coal markets for not only this month, but also December and November.\nIt’s little surprise, then, that the Newcastle thermal coal price hasn’t yet started a post-winter correction, given the strength of demand in Asia’s top importers.\nIn 2016, which was the first year coal prices rallied after five consecutive years of decline, the Newcastle spot contracts peaked in November, before retreating about 38 percent to a low in May of 2017.\nWhile the current market dynamics aren’t a mirror of what prevailed last year, it would be logical to expect thermal coal prices to drop once peak winter demand passes.\nThe question is by how much should they decline? The forward curve of Newcastle futures traded on the Intercontinental Exchange suggests a mild correction, with all contracts currently above $100 a tonne until June.\nThis may prove optimistic as there seem to be more bearish factors than bullish for Asian coal demand currently.\nChina’s ongoing battle against air pollution is likely to result in continued curbs on coal use, and demand for imported coal may also suffer as domestic output recovers, with production rising 3.2 percent to 3.45 billion tonnes in 2017 from a year earlier.\nIndia is also maintaining a policy of lowering coal imports to an eventual zero while simultaneously boosting domestic output - as well as increasing the installation of renewable energy sources such as wind and solar.\nJapan has boosted coal use given its ongoing nuclear shutdowns, but there does appear to be mounting opposition to replacing unpopular nuclear power with polluting coal.\nWhile coal has enjoyed a stellar start to 2018, with strong demand growth, the key will become the extent of any pullbacks in the seaborne markets once the bumper January ends.\nEditing by Kenneth Maxwell\n ", "external_links": ["http://reut.rs/2DVJUkH", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T20:01:00.000+02:00", "crawled": "2018-01-23T18:10:23.000+02:00", "highlightTitle": ""}