{"organizations": [], "uuid": "0fe0147356c8c165d2451212de1cfdbfabe392f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/05/104930902-GettyImages-849939458.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/05/florida-iguanas-are-freezing-and-falling-out-of-trees.html", "country": "US", "domain_rank": 767, "title": "Florida iguanas are freezing and falling out of trees", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-05T22:04:00.000+02:00", "replies_count": 0, "uuid": "0fe0147356c8c165d2451212de1cfdbfabe392f5"}, "author": "Vw Pics", "url": "https://www.cnbc.com/2018/01/05/florida-iguanas-are-freezing-and-falling-out-of-trees.html", "ord_in_thread": 0, "title": "Florida iguanas are freezing and falling out of trees", "locations": [], "entities": {"persons": [{"name": "frank cerabino", "sentiment": "none"}, {"name": "kristen sommers", "sentiment": "none"}], "locations": [{"name": "florida", "sentiment": "none"}, {"name": "south america", "sentiment": "none"}, {"name": "palm beach county", "sentiment": "none"}, {"name": "south florida", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}], "organizations": [{"name": "national weather service", "sentiment": "none"}, {"name": "wpec-tv", "sentiment": "none"}, {"name": "palm beach post", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "It's so cold in Florida that iguanas are falling from their perches in suburban trees.\nTemperatures dipped below 40 degrees Fahrenheit early Thursday in parts of South Florida, according to the National Weather Service in Miami.\nThat's chilly enough to immobilize green iguanas common in Miami's suburbs.\nPalm Beach Post columnist Frank Cerabino tweeted a photograph of an iguana lying belly-up next to his swimming pool. WPEC-TV posted images of an iguana on its back on a Palm Beach County road.\n@FranklyFlorida tweet \nThe cold-blooded creatures native to Central and South America start to get sluggish when temperatures fall below 50 degrees, said Kristen Sommers, who oversees the nonnative fish and wildlife program for the Florida Fish and Wildlife Conservation Commission.\nIf temperatures drop below that, iguanas freeze up. \"It's too cold for them to move,\" Sommers said.\nThey're not the only reptiles stunned by this week's cold snap: Sea turtles also stiffen up when temperatures fall. The wildlife commission's biologists have been rescuing cold-stunned sea turtles found floating listlessly on the water or near shore, but no such rescue is planned for iguanas.\nWell-meaning residents finding stiffened iguanas are advised to leave them alone, as they may feel threatened and bite once they warm up.\n\"Don't assume that they're dead,\" Sommers said.\nGreen iguanas are an invasive species in Florida known for eating through landscaping and digging burrows that undermine infrastructure. They can grow over 5 feet long, and their droppings can be a potential source of salmonella bacteria, which causes food poisoning.\nThe wildlife commission has begun holding workshops to train homeowners and property managers to trap or manage iguanas. The reptiles may be easier to catch this week, Sommers said.\n\"This provides an opportunity to capture some, but I'm not sure it's going to be cold enough for long enough to make enough of a difference,\" she said. \"In most cases, they're going to warm back up and move around again, unless they're euthanized.\"\nA two-week cold snap with temperatures below 40 degrees (5 degrees Celsius) in 2010 killed off many iguanas, along with Burmese pythons and other invasive pests that thrive in South Florida's subtropical climate. Those populations have since rebounded.\nElsewhere in Florida, the effects of a brutal winter storm rolling up the East Coast were less exotic. It snowed briefly Wednesday in the state's capital, Tallahassee, for the first time in 28 years.", "external_links": [], "published": "2018-01-05T22:04:00.000+02:00", "crawled": "2018-01-05T22:19:40.001+02:00", "highlightTitle": ""}