{"organizations": [], "uuid": "a7f6953175804b1fcf8befd0bccbeaddd9d6faac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/05/06/103612900-GettyImages-121393158.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/19/trump-to-address-anti-abortion-rally-march-for-life-cementing-his-u-turn-on-the-issue.html", "country": "US", "domain_rank": 767, "title": "Trump to address anti-abortion rally March for Life, cementing his U-turn on the issue", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T13:46:00.000+02:00", "replies_count": 0, "uuid": "a7f6953175804b1fcf8befd0bccbeaddd9d6faac"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/19/trump-to-address-anti-abortion-rally-march-for-life-cementing-his-u-turn-on-the-issue.html", "ord_in_thread": 0, "title": "Trump to address anti-abortion rally March for Life, cementing his U-turn on the issue", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "ronald reagan", "sentiment": "none"}, {"name": "george w. bush", "sentiment": "none"}, {"name": "sarah sanders", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "white house rose garden", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Donald Trump will become the third sitting U.S. president to address anti-abortion activists at the annual March for Life on Friday, highlighting his shift in recent years from a supporter of women's access to abortion to a powerful opponent.\nTrump is due to address the march in Washington via satellite from the White House Rose Garden on Friday afternoon. Ronald Reagan, Trump's fellow Republican, made supportive remarks to the march in 1987 via telephone, while George W. Bush , another Republican, twice did the same, in 2003 and 2004.\n\"The President is committed to protecting the life of the unborn, and he is excited to be part of this historic event,\" Sarah Sanders , the White House press secretary, told reporters on Wednesday.\nOrganizers of the march, the largest anti-abortion event in the country, praised Trump for his policies on restricting abortion access. These policies include efforts to eliminate federal funding to groups providing abortions. Trump sent Vice President Mike Pence , a vocal abortion opponent, to speak at last year's march, a few days after the presidential inauguration.\nTrump has also pledged to appoint more judges that support the overturning of Roe v. Wade, the 1973 Supreme Court decision that affirmed a woman's right to an abortion at most stages of a pregnancy, effectively legalizing the procedure nationwide.\nThe March for Life, where tens of thousands of people seeking to overturn that decision gather at the National Mall before rallying at the Supreme Court steps, is held close to the anniversary of the Roe v. Wade ruling.\nPaul Ryan , the Republican speaker of U.S. House of Representatives, will also address the march, now in its 45th year.\nTrump was previously a supporter of women's access to abortion, saying in an interview in 1999, when he was still a celebrity real-estate tycoon in New York City, that while he \"hated the concept of abortion\" he was \"very pro-choice.\"\nAs a Republican candidate for the presidency in 2016, Trump said his position had \"evolved,\" describing himself as \"pro-life with exceptions,\" such as in cases of rape or incest.\nTrump has said he hopes Roe v. Wade will eventually be overturned and that each state would instead be allowed to decide whether to ban the procedure.\nAmericans tend to split roughly down the middle on abortion access, with 49 percent saying they supported it and 46 percent saying they opposed it in a 2017 Gallup poll.", "external_links": [], "published": "2018-01-19T13:46:00.000+02:00", "crawled": "2018-01-19T14:09:54.012+02:00", "highlightTitle": ""}