{"organizations": [], "uuid": "c800ac214c773bc8c07e8e9bb1d827982fb790c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-prime-therapeutics-pharmacist-elected-to-academy-of-managed-care-pharmacy-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Prime Therapeutics Pharmacist Elected to Academy of Managed Care Pharmacy Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.456, "site_type": "news", "published": "2018-01-08T20:47:00.000+02:00", "replies_count": 0, "uuid": "c800ac214c773bc8c07e8e9bb1d827982fb790c1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-prime-therapeutics-pharmacist-elected-to-academy-of-managed-care-pharmacy-board-of-directors.html", "ord_in_thread": 0, "title": "Prime Therapeutics Pharmacist Elected to Academy of Managed Care Pharmacy Board of Directors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ST. PAUL, Minn., Jan. 8, 2018 /PRNewswire/ -- The Academy of Managed Care Pharmacy (AMCP) has elected Patrick Gleason, PharmD, senior director of health outcomes at Prime Therapeutics LLC (Prime), a leading pharmacy benefit manager, to its 2018 board of directors. Dr. Gleason's 2-year term will begin at the AMCP Annual Meeting in April.\nThe AMCP board of directors provides leadership that will prepare the organization's members to improve access to affordable medicines, improve patient outcomes and follow best practices in the management of biosimilars and other specialty pharmaceuticals.\nDr. Gleason leads a clinical health outcomes assessment team in the development and improvement of pharmacy benefit management programs. He has authored more than 40 peer-reviewed articles in medical and health policy journals or publications. Dr. Gleason completed his Bachelor of Science and Pharmacy Doctorate degrees at the University of Minnesota. He also completed an Ambulatory Care Pharmacy Practice Residency at the University of Pittsburgh Medical Center followed by a Fellowship in Outcomes Research through the University of Pittsburgh, School of Pharmacy. Dr. Gleason also serves as an Adjunct Professor at the University of Minnesota, College of Pharmacy, and he has been recognized for his excellence in the practice and science of clinical pharmacy as an elected Fellow of the American College of Clinical Pharmacy (FCCP). In 2016, AMCP named Dr. Gleason a Fellow in recognition of his managed care pharmacy research contribution, commitment to the organization and excellence in his field.\n\"As a board member, I will have the privilege of listening to the membership needs and working to deliver solutions in collaboration with the AMCP leadership,\" said Dr. Gleason. \"AMCP plays an essential role in developing medication affordability solutions and clinical programs, so all can receive the benefits medications provide while avoiding harm. I'm grateful for the opportunity to participate in its leadership.\"\nPrime now has two employees with leadership ties to AMCP. Richard Zabinski, PharmD, senior director of utilization management, served as AMCP president from 2007-2008.\nAbout Prime Therapeutics\nPrime Therapeutics LLC (Prime) helps people get the medicine they need to feel better and live well. Prime manages pharmacy benefits for health plans, employers, and government programs including Medicare and Medicaid. The company processes claims and offers clinical services for people with complex medical conditions. Prime serves more than 20 million people. It is collectively owned by 18 Blue Cross and Blue Shield Plans, subsidiaries or affiliates of those plans.\nFor more information, visit www.primetherapeutics.com or follow @Prime_PBM on Twitter.\nContact:\nDenise Lecher\nManager, Corporate Communications\n612.777.5763\ndenise.lecher@primetherapeutics.com\nView original content: http://www.prnewswire.com/news-releases/prime-therapeutics-pharmacist-elected-to-academy-of-managed-care-pharmacy-board-of-directors-300579086.html\nSOURCE Prime Therapeutics", "external_links": ["http://www.prnewswire.com/news-releases/prime-therapeutics-pharmacist-elected-to-academy-of-managed-care-pharmacy-board-of-directors-300579086.html", "http://www.primetherapeutics.com/"], "published": "2018-01-08T20:47:00.000+02:00", "crawled": "2018-01-09T09:40:35.510+02:00", "highlightTitle": ""}