{"organizations": [], "uuid": "c584ab5a635f665d4eeed88c502948d6e081d140", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225409146&w=1200&r=LYNXMPEE0P0D2", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-germany-politics/the-final-straight-party-leaders-launch-german-coalition-talks-idUSKBN1FF0R0", "country": "US", "domain_rank": 408, "title": "The final straight: party leaders launch German coalition talks", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T09:57:00.000+02:00", "replies_count": 0, "uuid": "c584ab5a635f665d4eeed88c502948d6e081d140"}, "author": "", "url": "https://www.reuters.com/article/us-germany-politics/the-final-straight-party-leaders-launch-german-coalition-talks-idUSKBN1FF0R0", "ord_in_thread": 0, "title": "The final straight: party leaders launch German coalition talks", "locations": [], "entities": {"persons": [{"name": "angela merkel", "sentiment": "none"}, {"name": "merkel", "sentiment": "none"}, {"name": "thomas escritt", "sentiment": "none"}, {"name": "horst seehofer", "sentiment": "none"}, {"name": "martin schulz", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "cdu", "sentiment": "none"}, {"name": "spd", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 7:58 AM / in 37 minutes Leaders promise swift end to Germany's four-month limbo Thomas Escritt 4 Min Read \nBERLIN (Reuters) - German Chancellor Angela Merkel’s conservatives opened coalition talks with their Social Democrat (SPD) partners on Friday, promising swift progress in negotiations aimed at ending four months of political limbo in Europe’s largest economy. \nArriving at her Christian Democrat (CDU) party’s headquarters, Merkel said she was optimistic and determined about the discussions aimed at renewing the “grand coalition” that governed for the past four years. \n“People expect us to move towards forming a government and that’s why I‘m very optimistic and very determined,” she said. The talks are her best hope of securing a fourth term after the failure of an earlier attempt to form a three-way coalition. \n“I believe it is achievable within a reasonable timeframe,” she added. \nWhile most experts expect talks to succeed, many in the SPD are reluctant, seeing a repeat coalition as at best a painful sacrifice by their party for the sake of stability in Europe’s economic and political behemoth. \nAppealing to them, leader Martin Schulz stressed their party’s global responsibility. \n“Given the challenges from China and the U.S., the European Union needs a strong, pro-European Germany,” he said. “And that you will only get if the SPD is in government.” \nUnderlining the stakes for the SPD, one of two “people’s parties” that dominated post-war German history, a poll for ARD television showed only 19 percent would vote for it in repeat elections, placing it just seven points ahead of the far-right Alternative for Germany (AfD). \nRiven by division over whether it would not be better to rebuild in opposition, the SPD’s leadership is under pressure from its radical youth wing to win concessions from the conservatives, on immigration in particular. \nThe conservatives are wary. They are under pressure from the AfD, which burst into parliament for the first time on Sept. 24, propelled by public concerns over Merkel’s decision to open Germany’s doors to more than a million refugees in 2015. \nIn a draft agreement the two camps hammered out this month, the parties agreed a soft ceiling of 220,000 immigrants a year, one the Christian Social Union (CSU), arch-conservative Bavarian sister party to Merkel’s CDU, refuses to compromise on. \nDespite the tensions, leader Horst Seehofer was positive. “The CSU wants this coalition,” he told reporters on the gloomy Berlin winter morning. \nSenior SPD member Democrat Andrea Nahles told broadcaster ARD her party would also push its agenda of eliminating fixed-term contracts without substantive grounds and improving conditions for citizens who pay into the public rather than private healthcare system, seeking concessions on those issues. \nNegotiators hope to wrap talks up before carnival season starts in earnest on Feb. 8, which would allow a government to be in place by Easter. \nBut time presses. The SPD membership has been promised a vote on a final coalition deal. With new members thronging to the party in the hope of casting a vote against a new coalition, chances of securing membership consent diminish by the day. Additional reporting by Michelle Martin; Editing by Ralph Boulton, William Maclean", "external_links": [], "published": "2018-01-26T09:57:00.000+02:00", "crawled": "2018-01-26T10:03:32.029+02:00", "highlightTitle": ""}