{"organizations": [], "uuid": "94ea3c900c8a72071c8cf4361e4b84cb30504e61", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/06/104822585-RTS1IMQX-trump.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/02/trump-claims-democrats-are-doing-nothing-to-protect-daca-dreamers.html", "country": "US", "domain_rank": 767, "title": "Trump claims Democrats are 'doing nothing' to protect DACA 'dreamers'", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.185, "site_type": "news", "published": "2018-01-02T18:03:00.000+02:00", "replies_count": 0, "uuid": "94ea3c900c8a72071c8cf4361e4b84cb30504e61"}, "author": "Jacob Pramuk", "url": "https://www.cnbc.com/2018/01/02/trump-claims-democrats-are-doing-nothing-to-protect-daca-dreamers.html", "ord_in_thread": 0, "title": "Trump claims Democrats are 'doing nothing' to protect DACA 'dreamers'", "locations": [], "entities": {"persons": [{"name": "kiyoshi ota", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "deferred action for childhood arrivals", "sentiment": "none"}, {"name": "daca", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump claimed Tuesday that Democrats \"are doing nothing\" to protect hundreds of thousands of young immigrants.\nThe president's tweet further inflames sensitive congressional talks on legislation to shield those individuals from deportation.\nIn September, Trump ended the Obama-era Deferred Action for Childhood Arrivals program with a six-month delay to force congressional action. If lawmakers cannot reach a solution by March 5, those immigrants brought to the U.S. illegally as children will no longer be protected from deportation or have the ability to work in the country.\nOn Wednesday, bipartisan congressional leaders plan to meet with Office of Management and Budget Director Mick Mulvaney and White House legislative affairs director Marc Short to discuss DACA and the looming Jan. 19 government funding deadline. Republicans have pushed for more border security funding in exchange for immigrant protections.\nWhile Democrats have signaled they could support such a deal, Trump complicated matters last week by insisting on including money for his proposed wall on the U.S.-Mexico border in an agreement. Democrats have said they will not vote for funding for the proposed barrier.\nshow chapters Trump: No DACA deal without border wall 1:24 PM ET Fri, 29 Dec 2017 | 00:59 Neither Senate Minority Leader Chuck Schumer , D-N.Y., nor House Minority Leader Nancy Pelosi , D-Calif., immediately responded to requests for comment. Both lawmakers will attend the meeting Wednesday.\nIn his tweet Tuesday, Trump contended that Democrats are \"just in interested in politics\" while Republicans \"are about RESULTS.\" He claimed that \"DACA activists and Hispanics will go hard against Dems\" and \"will start 'falling in love' with Republicans and their President!\"\nTrump tweet: Democrats are doing nothing for DACA - just interested in politics. DACA activists and Hispanics will go hard against Dems, will start \"falling in love\" with Republicans and their President! We are about RESULTS.\nFor about a decade, Democrats and some Republicans have pushed for legislation to enshrine legal protections for the young immigrants. Versions of the DREAM Act, championed by Sen. Dick Durbin, D-Ill., and frequently co-sponsored by GOP lawmakers, have failed to gain traction in the GOP-held Congress in recent years.\nThe Obama-era program shielded nearly 800,000 undocumented immigrants.\nTrump ran on a platform of cracking down on immigration and constructing a physical barrier on the southern U.S. border. Months before announcing his decision to end DACA, the president said he was \"going to show great heart\" toward the immigrants.", "external_links": [], "published": "2018-01-02T18:03:00.000+02:00", "crawled": "2018-01-02T18:06:00.006+02:00", "highlightTitle": ""}