{"organizations": [], "uuid": "6ddf802880b843a18370c96936313a14333c26ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226609507&w=1200&r=LYNXMPEE0T0X6", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-olympics-2018-iceh-goaltenders/olympics-burke-brodeur-now-calling-the-shots-not-stopping-pucks-idUKKBN1FJ1U4", "country": "US", "domain_rank": 408, "title": "Olympics - Burke, Brodeur now calling the shots not stopping pucks", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T15:33:00.000+02:00", "replies_count": 0, "uuid": "6ddf802880b843a18370c96936313a14333c26ea"}, "author": "", "url": "https://uk.reuters.com/article/uk-olympics-2018-iceh-goaltenders/olympics-burke-brodeur-now-calling-the-shots-not-stopping-pucks-idUKKBN1FJ1U4", "ord_in_thread": 0, "title": "Olympics - Burke, Brodeur now calling the shots not stopping pucks", "locations": [], "entities": {"persons": [{"name": "burke", "sentiment": "negative"}, {"name": "brodeur", "sentiment": "negative"}, {"name": "steve keating", "sentiment": "negative"}, {"name": "sean burke", "sentiment": "none"}, {"name": "martin brodeur", "sentiment": "none"}], "locations": [{"name": "brodeur", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}], "organizations": [{"name": "national hockey league", "sentiment": "none"}, {"name": "nhl", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "new jersey devils", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  Olympics - Burke, Brodeur now calling the shots not stopping pucks Steve Keating 4 Min Read \nTORONTO (Reuters) - In Martin Brodeur and Sean Burke the Canadian men’s ice hockey team heads to the Pyeongchang Winter Games with one of the greatest goaltending combinations ever seen at the Olympics. \nWith over a combined 1,000 National Hockey League career wins the thought of Brodeur or Burke manning the crease would inspire confidence among hockey crazed Canadians that a third consecutive gold medal was an almost certainty. \nAfter all, statistically Brodeur is the best to ever play the position and a certain first ballot Hall of Famer. \nHe played 22 years in the NHL racking up more wins (691) and shutouts (125) and more games as a goaltender (1,266) than anyone else. \nHe also won three Stanley Cups with the New Jersey Devils and participated in four Winter Games winning gold in 2002 and 2010. \nBurke’s resume may not match Brodeur’s but is impressive by every other standard having played 820 games (13th on the NHL all-time list) and amassed 324 wins. He also played in two Olympics winning silver in 1992. \nBut for these Olympics Brodeur and Burke will be standing behind the bench where their job is not stopping pucks but finding the players who can. \nWith the NHL refusing to release players for the tournament, Brodeur and Burke have had to look hard for netminders to play at Pyeongchang. \nJustin Peters (83 NHL games and 25 wins spread over seven seasons with three teams), Kevin Poulin (50 games, 18 wins in five seasons) and Ben Scrivens (144 games and 47 wins over five seasons) do not inspire the same confidence as their vaunted coaches, but Brodeur believes they have found the right men. FILE PHOTO: Dec 8, 2014; St. Louis, MO, USA; St. Louis Blues goalie Martin Brodeur (30) kisses the back of his helmet before the game between the St. Louis Blues and the Florida Panthers at Scottrade Center. Mandatory Credit: Jasen Vinlove-USA TODAY Sports/File Photo \n”We don’t have the pick of the litter here,“ Brodeur told Reuters. ”There are not many Canadian goalies out there if we have to make sure whoever we select he is going to be solid and right now we are pretty comfortable with what we have. \n“The fact the NHL players aren’t playing I think will really level the playing field for a lot of these countries that never aspired to win a medal and now they see that they have a chance.” \nAsked if he had thought about putting the pads on one more time Brodeur, who retired in 2015, broke into laughter. \nBurke pondered the idea for the briefest of moments then with an equally hearty chuckle passed the buck. \n“Maybe Marty could but I’ve got two bionic hips now so I think those days are done,” said Burke. \nDespite their goaltenders’ lack of top-level experience, Burke said hockey’s great equaliser, be it a best-of-seven Stanley Cup final or Olympics, is a netminder who can suddenly strike a rich vein of form that may last a period, game or an entire tournament. \n“The format of an Olympic event lends itself to be more successful if you have a hot goaltender for a two week period,” Burke said. \n”A hot goaltender for two weeks in an NHL season really probably doesn’t do that much over the course of 82 games but a hot goalie at an Olympic event can win you the gold medal. \n“No doubt if we get to the Olympics with what we feel is really good goaltending I think that gives you a chance to compete every game.” Editing by Greg Stutchbury", "external_links": [], "published": "2018-01-30T15:33:00.000+02:00", "crawled": "2018-01-30T15:50:14.032+02:00", "highlightTitle": ""}