{"organizations": [], "uuid": "51a836b8aa9a9ae431e636c8bc15fe083c5a0777", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-purepower-technologiesa-names-noel-ranka-chief-sales-and-marketing-officer.html", "country": "US", "domain_rank": 767, "title": "PurePower Technologies® Names Noel Ranka Chief Sales and Marketing Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.145, "site_type": "news", "published": "2018-01-22T19:30:00.000+02:00", "replies_count": 0, "uuid": "51a836b8aa9a9ae431e636c8bc15fe083c5a0777"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-purepower-technologiesa-names-noel-ranka-chief-sales-and-marketing-officer.html", "ord_in_thread": 0, "title": "PurePower Technologies® Names Noel Ranka Chief Sales and Marketing Officer", "locations": [], "entities": {"persons": [{"name": "noel ranka", "sentiment": "negative"}, {"name": "jerry sweetland", "sentiment": "none"}, {"name": "ranka", "sentiment": "none"}, {"name": "jac", "sentiment": "none"}, {"name": "noel", "sentiment": "none"}], "locations": [{"name": "s.c.", "sentiment": "none"}, {"name": "columbia", "sentiment": "none"}, {"name": "mich.", "sentiment": "none"}, {"name": "pontiac", "sentiment": "none"}], "organizations": [{"name": "purepower technologies", "sentiment": "negative"}, {"name": "jac products inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "COLUMBIA, S.C., Jan. 22, 2018 /PRNewswire/ -- PurePower Technologies ® , a leader in the engineering and manufacturing of new and remanufactured diesel fuel injectors and turbochargers for OEMs and the aftermarket, today announced Noel Ranka as its new chief sales and marketing officer.\nReporting to President and CEO Jerry Sweetland, Ranka will be responsible for leading all sales, marketing and business development activities to expand PurePower's growing customer base.\nRanka joins PurePower after a long career at JAC Products Inc., Pontiac, Mich., where he held senior leadership positions in sales, marketing, advanced product development and business development since 2004. Most recently, he served as JAC's chief marketing and sales officer, where he created and led a global sales team and developed and implemented corporate strategies for global growth. He also led a team of advanced engineers working on future products to market and sell.\n\"Noel's decades of experience, not just in sales and marketing, but also product engineering, will provide us with a diverse background and understanding of the OEM and aftermarket commercial vehicle markets, which will help us fuel our continued growth,\" Sweetland said.\nPrior to joining JAC Products, Ranka worked in various product engineering roles for Ford Motor Company from 1997 – 2004.\nRanka holds a Bachelor of Science degree in mechanical engineering from Western Michigan University, along with Master's degrees in business administration and industrial and systems engineering from the University of Michigan, Dearborn.\n\"This is an exciting time for PurePower. I look forward to the challenges of serving our customers and growing our business. There is a momentum here and I am pleased to join the team and start contributing,\" Ranka said.\nAbout PurePower Technologies:\nPurePower Technologies, Inc. is the leader in engineering and remanufacturing of diesel fuel injectors and turbochargers for OEMs and the aftermarket. Headquartered in Columbia, S.C., the company is the authority for all precision fuel, air management, and after-treatment systems for light, medium, and heavy-duty diesel engines, having produced more than 30 million precision diesel fuel injectors since 1999. With more than 350 world-class engineers and technical specialists, PurePower offers a complete portfolio of design, engineering, manufacturing, and remanufacturing capabilities allows us to achieve levels of quality and precision that outpace the industry. For more information, visit purepowertech.com .\nView original content: http://www.prnewswire.com/news-releases/purepower-technologies-names-noel-ranka-chief-sales-and-marketing-officer-300585933.html\nSOURCE PurePower Technologies", "external_links": ["http://www.purepowertech.com/", "http://www.prnewswire.com/news-releases/purepower-technologies-names-noel-ranka-chief-sales-and-marketing-officer-300585933.html"], "published": "2018-01-22T19:30:00.000+02:00", "crawled": "2018-01-22T20:11:05.020+02:00", "highlightTitle": ""}