{"organizations": [], "uuid": "b1ff15d954b724334005138ecf2e9f100a82c9c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222663744&w=1200&r=LYNXMPEE0G0F9", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-france-windpower/france-plans-to-accelerate-wind-power-projects-idUSKBN1F60TE", "country": "US", "domain_rank": 408, "title": "France plans to accelerate wind power projects", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T10:00:00.000+02:00", "replies_count": 0, "uuid": "b1ff15d954b724334005138ecf2e9f100a82c9c1"}, "author": "", "url": "https://www.reuters.com/article/us-france-windpower/france-plans-to-accelerate-wind-power-projects-idUSKBN1F60TE", "ord_in_thread": 0, "title": "France plans to accelerate wind power projects", "locations": [], "entities": {"persons": [{"name": "bate", "sentiment": "negative"}, {"name": "marion", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "gw", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 8:13 AM / in 12 hours France plans to accelerate wind power projects Bate Felix 7 Min Read \nPARIS (Reuters) - France is expected to announce measures this week to accelerate the installation of wind turbines and overcome long-running opposition from activists who have frustrated the country’s attempts to hit renewable energy targets. \nA working group formed in October to make approvals easier has finalised plans that include removing one legal avenue for blocking projects and paying a portion of wind farm taxes directly to affected communities, an industry official said. \nFrench onshore wind projects delivering 22 gigawatts (GW) have been authorized, but only 12.9 GW has been installed because of legal challenges, according to official data, leaving France struggling to meet its target of producing 26 GW by 2023. \nIndustry officials say it can take over a decade to get French wind farm projects up and running because of systematic legal objections by opponents whereas in Germany, Europe’s biggest wind power producer, it can be as short as three years. \nMarion Lettry, deputy head of the French renewable energy lobby SER and part of the working group, said Administrative Tribunals were set to be removed from the legal options open to those campaigning against wind farms in France. \n“This will not automatically reduce systematic appeals against projects, but will hopefully accelerate the process and thereby cut by at least two years off the time it takes for projects to be connected to the grid,” she told Reuters. \nA spokesman for the Ministry of Ecology declined to comment on specific measures, saying the conclusions would be announced on Thursday. The government has said previously it would adopt the working group’s proposals as soon as possible. \nFrance had been hoping growth in renewable energy sources such as wind, solar and hydro power would reduce its dependence on nuclear energy to 50 percent of its electricity needs by 2025 from more than 75 percent now. \nBut the government postponed that deadline in November after grid operator RTE warned that without a massive increase in renewables the country risked power shortages. \nAlmost all the wind turbines in France have been installed by companies from other European countries, according to data from industry lobby group France Energie Eolienne (FEE). \nDenmark’s Vestas Wind Systems has installed the most followed by German companies Enercon, Senvion and Nordex and then German-Spanish firm Siemens Gamesa Renewable Energy. \n‘GUERRILLA CAMPAIGN’ \nThe origin of the countrywide campaign against French wind farms dates back to 2004 when retired physicist Jean-Louis Butre attended a public hearing on a planned project near his house in the Poitou region of western France. \n“It was supposed to be one turbine. But they lied. It was six,” he told Reuters in a phone interview, saying the promoters glossed over concerns raised by residents. \nButre formed an association to fight back and the project was abandoned some years later. His success spawned associations in villages and towns that coalesced into the Federation Environment Durable (FED) with more than 1,000 local groups. \n“In principle we are against all wind projects. We are a sort of guerrilla campaign against a financially powerful wind lobby and companies,” Butre said. FILE PHOTO: Cattle gather in a field near an ECO 110 wind turbine manufactured Alstom in the Landes de Couesme wind farm near La Gacilly, western France, April 26, 2014. Picture taken April 26, 2014. REUTERS/Stephane Mahe/File Photo \nUsing how-to kits with step-by-step guides on starting legal procedures against projects, from inception through the approval phases in councils and courts, FED members launch appeal after appeal against wind projects. \nThe activists have scored notable wins. They have blocked wind farms near historic sites such as Mont Saint Michel in Normandy and energy company Engie was forced to abandon a project near a World War One battlefield in November. \n“The filing of appeal after appeal against projects has become a French pastime,” said Gwenaelle Huet, renewables energy director at the French company, the biggest wind power producer in France. \n“This does not provide visibility to investors and it is made worse by the increasing number of abusive appeals,” she said, adding that some were filed on technicalities which stalled projects even without prolonged hearings. \nHuet said it can take six to eight years - and sometimes more than a decade - for wind projects to come online in France compared with three to four years in Germany. Slideshow (2 Images) \nThe Administrative Tribunals targeted by the working group are usually the first place a legal appeal is filed and it can take two years to hear a case. If that fails, campaigners can go to the Court of Appeal which can take another two years. \nIf one side is still not satisfied the case can go to the highest administrative court, the Council of State. Once it has heard the case it would go back to the Appeals Court for a final decision, adding several more years to the process. BLINKING BEACONS \nOne of the key challenges for the wind power industry is how to soften local community objections to wind projects and get early buy-in from residents. \nLettry at SER (Syndicat des Energies Renouvelables) said another proposal set to be announced by the government this week would be for 20 percent of a business tax (IFER) on wind farms to go directly to communities where turbines have been built. \nLettry said, however, that a proposal to make blinking warning beacons on the top of turbines constant was still under consideration. \n“The blinking red lights are annoying to many. It is one of the reasons that is systematically mentioned as a nuisance in appeals,” Engie’s Huet said. \nGermany has more than 45 gigawatts of capacity. A spokesman for the German Wind Energy Association (BWE) said communities affected by projects were consulted early in the process and it took three to five years to get wind farms up and running. \nSpain is also ahead of France with 23 GW of capacity. A spokeswoman for the Spanish Wind Energy Association (AEE) said the main reason for project delays was red tape, not activists. \nCampaigners in Britain have successfully prevented scores of onshore projects being approved by local authorities. Like France, Britain has 12 GW of onshore wind power but it has 6 GW of offshore farms and is now focusing on large projects at sea. \nGraphic: Europe's wind power capacity - tmsnrt.rs/2zPjhiw Additional reporting by Vera Eckert in Frankfurt, Jose Elías Rodríguez in Madrid, Susanna Twidale in London and Stine Buch Jacobsen in Copenhagen; editing by David Clarke", "external_links": [], "published": "2018-01-17T10:00:00.000+02:00", "crawled": "2018-01-17T10:16:32.005+02:00", "highlightTitle": ""}