{"organizations": [], "uuid": "75b8b9ddf060eb988802ec5bda301a27fd7b1f1f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180125.html", "section_title": "Archive News &amp; Video for Thursday, 25 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/france-benelux-markets/french-and-benelux-stocks-factors-to-watch-on-january-25-idUSL8N1PJ6I8", "country": "US", "domain_rank": 408, "title": "French and Benelux stocks-Factors to watch on January 25", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T14:29:00.000+02:00", "replies_count": 0, "uuid": "75b8b9ddf060eb988802ec5bda301a27fd7b1f1f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/france-benelux-markets/french-and-benelux-stocks-factors-to-watch-on-january-25-idUSL8N1PJ6I8", "ord_in_thread": 0, "title": "French and Benelux stocks-Factors to watch on January 25", "locations": [], "entities": {"persons": [{"name": "elior", "sentiment": "none"}, {"name": "elior", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "cgg", "sentiment": "none"}, {"name": "stmicroelectronics", "sentiment": "none"}, {"name": "electro power systems", "sentiment": "none"}, {"name": "labour ministry", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 25 (Reuters) - Below are company-related news and stories from French and Benelux media which could have an impact on the region’s markets or individual stocks.\nFrench CAC futures were flat at 0702 GMT.\nCASINO: Casino announced on Wednesday it added 200 million euros to an existing bond due June 2022. Following the transaction, the nominal of this bond will amount to 750 million euros.\nCGG: CGG announced a trading halt for convertible bonds and senior notes as from Feb. 1\nELIOR: Elior confirmed its full year guidance and announed a rise in Q1 revenues.\nENGIE: French gas and power group said in a statement it had agreed to acquire a majority stake in French hydrogen-based power storage firm Electro Power Systems (EPS).\nFRENCH UNEMPLOYMENT: France’s jobless total dipped in December by 2,700 to the lowest level in more than three years, Labour Ministry data showed on Wednesday in further evidence of a job market recovery.\nSTEF: The company announced on Wednesday consolidated sales for the fourth quarter of the year of 783.7 million euros.\nSTMICRO: STMicroelectronics capped its best year since 2010 with strong, broad-based revenue growth and rising margins during 2017, and the chipmaker expected solid auto and industrial demand to offset a seasonal smartphone dip in the first quarter.\nTF1: TF1 announced it renewed partnership on agreement with the French national football team to broadcast its matches for four additional years, including World cup 2022 in Qatar.\nPan-European market data: European Equities speed guide FTSE Eurotop 300 index DJ STOXX index Top 10 STOXX sectors Top 10 EUROSTOXX sectors Top 10 Eurotop 300 sectors Top 25 European pct gainers Top 25 European pct losers Main stock markets: Dow Jones Wall Street report Nikkei 225 Tokyo report FTSE 100 London report Xetra DAX Frankfurt items CAC-40 Paris items World Indices Reuters survey of world bourse outlook European Asset Allocation Reuters News at a glance: Top News Equities Main oil report Main currency report\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T14:29:00.000+02:00", "crawled": "2018-01-26T21:06:51.000+02:00", "highlightTitle": ""}