{"organizations": [], "uuid": "1a28358cc7b831438ed95ca78f686507796ada6c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-philippines-drugs/fewer-killings-in-philippine-drug-war-make-u-s-cautiously-optimistic-official-idUKKBN1FK0ZB", "country": "US", "domain_rank": 408, "title": "Fewer killings in Philippine drug war make U.S. \"cautiously optimistic\" - official", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T10:58:00.000+02:00", "replies_count": 0, "uuid": "1a28358cc7b831438ed95ca78f686507796ada6c"}, "author": "", "url": "https://uk.reuters.com/article/uk-philippines-drugs/fewer-killings-in-philippine-drug-war-make-u-s-cautiously-optimistic-official-idUKKBN1FK0ZB", "ord_in_thread": 0, "title": "Fewer killings in Philippine drug war make U.S. \"cautiously optimistic\" - official", "locations": [], "entities": {"persons": [{"name": "walsh", "sentiment": "none"}, {"name": "james walsh", "sentiment": "none"}, {"name": "rodrigo duterte", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "philippine", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "philippines", "sentiment": "none"}, {"name": "manila", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "philippine national police", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 9:01 AM / Updated 18 minutes ago Fewer killings in Philippine drug war make U.S. \"cautiously optimistic\" - official Reuters Staff 3 Min Read \nMANILA (Reuters) - The U.S. government is “cautiously optimistic” on Philippine President Rodrigo Duterte’s war on drugs after it saw a decline in “extrajudicial killings,” a U.S. senior narcotics official said. \nWashington has shifted away millions of dollars in funding for law enforcement from a drug control programme of the Philippine National Police since the bloody anti-narcotics campaign started in July 2016. \nBut there are positive signs and the United States remains supportive of the Philippines’ effort to battle illicit drugs, said James Walsh, a deputy assistant state secretary in the international narcotics and law enforcement bureau. \n“I would describe the United States as being cautiously optimistic,” Walsh told a telephonic news conference late on Tuesday. \n“Many folks have been tracking the extrajudicial killings in the Philippines and the trends are going down, so there is some encouragement that we are seeing in some of our human rights training working.” \nNearly 4,000 people have been killed in shootouts with the police in raids and sting operations since Duterte came to power in July 2016, government data shows. But human rights groups put the figure higher, accusing police of executing drug users and peddlers in cold blood. \nOn Wednesday, Duterte’s spokesman, Harry Roque, said there were no “extrajudicial killings” in the war on drugs. \nBut he welcomed the comments as a reflection of Washington’s growing appreciation of the campaign’s benefits. \n“These efforts are anchored on respect for human rights, cognizant of our obligation to protect our people’s right to life and to live in peace and security,” Roque said in a statement. \nPolice resumed their anti-drug campaign on Monday with visits to the homes of users and dealers to convince them to surrender, and police chief Ronald dela Rosa offered an assurance it would be free of violence. \nDela Rosa there were no deaths reported in the first 24 hours after operations resumed. \nWalsh also said Washington has been cooperating with Cambodia, China, Indonesia and the Philippines and has seen traffickers now use bitcoin to flood the U.S. market with synthetic drugs from China and Mexico. \nBut he gave no details of the use of virtual currencies in the narcotics trade. Reporting by Manuel Mogato; Editing by Clarence Fernandez", "external_links": [], "published": "2018-01-31T10:58:00.000+02:00", "crawled": "2018-01-31T11:22:44.004+02:00", "highlightTitle": ""}