{"organizations": [], "uuid": "37e17a6afd01b26c5537ed12e80af95e3a3fdeff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/02/104923171-GettyImages-879967418.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/02/south-korea-offers-high-ranking-government-talks-with-north-korea-next-week.html", "country": "US", "domain_rank": 767, "title": "South Korea offers high-ranking government talks with North Korea next week", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.04, "site_type": "news", "published": "2018-01-02T08:10:00.000+02:00", "replies_count": 0, "uuid": "37e17a6afd01b26c5537ed12e80af95e3a3fdeff"}, "author": "Korea Pool", "url": "https://www.cnbc.com/2018/01/02/south-korea-offers-high-ranking-government-talks-with-north-korea-next-week.html", "ord_in_thread": 0, "title": "South Korea offers high-ranking government talks with North Korea next week", "locations": [], "entities": {"persons": [{"name": "kim jong un", "sentiment": "none"}, {"name": "cho myong-gyon", "sentiment": "none"}, {"name": "cho", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "koreas", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "south", "sentiment": "none"}, {"name": "panmunjom", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "pyongyang", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "South Korea offers talks with defiant North ahead of Olympics South Korea offers talks with North Korea on Jan. 9 at border village. North Korea is keen to talk, but remains steadfast on its nuclear program. Seoul seeks to allow North Korean athletes at Winter Olympics. Published 11 Hours Ago 1 Hour Ago | 00:50 \nSouth Korea on Tuesday offered talks with North Korea amid a standoff over its weapons programs, a day after North Korean leader Kim Jong Un said he was open to negotiations but that his country would push ahead with \"mass producing\" nuclear warheads. \nThe offer for high-level talks next Tuesday had been discussed with the United States, the South's unification minister said, while a decision on whether to push back a massive joint military drill between South Korea and the United States until after the Winter Olympics was pending. \nTension has been rising over North Korea's nuclear and missile programmes, which it pursues in defiance of years of U.N. Security Council resolutions, with bellicose rhetoric coming from both Pyongyang and the White House. The North sees the regular war drills between the South and the United States as preparations for war. \n\"We look forward to candidly discussing interests from both sides face-to-face with North Korea along with the North's participation in the Pyeongchang Winter Olympics,\" Unification Minister Cho Myong-gyon told reporters. \n\"I repeat: The government is open to talking with North Korea, regardless of time, location and form.\" \nCho said he expects the dialogue at the border village of Panmunjom, if it happens, to be focused on North Korea's participation at the Olympics in February, but other issues would likely arise, including the denuclearization of North Korea. \nShould the talks be held on Jan. 9, it would be the first such dialogue since a vice-ministerial meeting in December 2015. \nThe offer landed after a New Year's Day speech by Kim who said he was \"open to dialogue\" with Seoul, and for North Korean athletes to possibly take part in the Winter Games, but he persistently declared North Korea a nuclear power. \nAfter welcoming Kim's address, South Korean President Moon Jae-in had asked his government earlier in the day to move as quickly as possible to bring North Korea to the Olympics. \nChinese Foreign Ministry spokesman Geng Shuang said the recent positive comments from both sides about improving relations, and Kim's remarks about participating in the upcoming Olympics, were a \"good thing\". \n\"China welcomes and supports North Korea and South Korea taking earnest efforts to treat this as an opportunity to improve mutual relations, promote the alleviation of the situation on the Korean peninsula and realize denuclearisation on the peninsula.\" \nU.S. President Donald Trump said on Tuesday that sanctions and other pressures were starting to have a big impact on North Korea but he withheld judgment on Pyongyang's offer to talk. \n\"Rocket man now wants to talk to South Korea for first time,\" Trump wrote in a Twitter post, using his nickname for Kim. \"Perhaps that is good news, perhaps not - we will see!\" 'Deep breath' needed \nAnalysts said Kim's address was an attempt to weaken the U.S.-South Korean alliance. \nChun Yung-woo, a former South Korean national security adviser, said Seoul should have taken more time before reacting to Kim's comments. \n\"I regret the government had even lost the flexibility to spend one day or two taking a deep breath and meticulously analysing Kim Jong Un's ulterior motive before hastily issuing a welcoming statement,\" he said. \n\"The government will have to strive more to come up with a countermeasure not to get caught in a trap set by Kim Jong Un.\" \nChoi Moon-soon, governor of Gangwon Province where the Olympics are to be held next month, has proposed South Korea send cruise ships to bring North Korean athletes and officials to Pyeongchang, according to South Korean media. \nChoi met North Korean sports official Mun Woong in China on Dec. 18 on the sidelines of a international youth football tournament where North and South Korea soccer teams competed, the Dong-A Ilbo newspaper reported. \nThe governor did not immediately respond to a request by Reuters for comment. \nThis week's exchanges follow a year dominated by fiery threats from Kim and Trump, who vowed to destroy North Korea if threatened, even as U.S. diplomats pushed for a diplomatic solution. \nNorth Korea, which regularly threatens to destroy the United States, South Korea and Japan, tested its most powerful intercontinental ballistic missile in November, which it said was capable of delivering a warhead to anywhere in the United States. \nKim said in a New Year's Day speech on Monday he would consider sending a delegation to the Olympics. \n\"North Korea's participation in the Winter Games will be a good opportunity to showcase the national pride and we wish the Games will be a success. Officials from the two Koreas may urgently meet to discuss the possibility,\" Kim said. \nNorth Korea would focus in 2018 on \"mass-producing nuclear warheads and ballistic missiles for operational deployment\". \n\"The whole territory of the U.S. is within the range of our nuclear strike and a nuclear button is always on the desk of my office and this is just a reality, not a threat,\" he said, while emphasising that the weapons would only be used if North Korea was threatened. \nThe Commerce Ministry in China, North Korea's lone major ally, also said it would continue to fully implement United Nations sanctions on North Korea. \nTrump said on Twitter last week that China has been \"caught\" allowing oil into North Korea and said such moves would prevent \"a friendly solution\" to the crisis. Playing", "external_links": [], "published": "2018-01-02T08:10:00.000+02:00", "crawled": "2018-01-02T08:10:28.002+02:00", "highlightTitle": ""}