{"organizations": [], "uuid": "76c451ba6b7b8ea0eb4b2f32f30f041a0fcb819e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/12/04/103218325-IMG_7945rrr2.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/19/la-times-levinsohn-under-investigation-after-report-on-sex-harassment.html", "country": "US", "domain_rank": 767, "title": "LA Times' Levinsohn under investigation after report on sex harassment", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T16:12:00.000+02:00", "replies_count": 0, "uuid": "76c451ba6b7b8ea0eb4b2f32f30f041a0fcb819e"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/19/la-times-levinsohn-under-investigation-after-report-on-sex-harassment.html", "ord_in_thread": 0, "title": "LA Times' Levinsohn under investigation after report on sex harassment", "locations": [], "entities": {"persons": [{"name": "levinsohn", "sentiment": "negative"}, {"name": "jarl mohn", "sentiment": "none"}, {"name": "ross levinsohn", "sentiment": "none"}], "locations": [{"name": "tronc", "sentiment": "none"}, {"name": "alta vista", "sentiment": "none"}], "organizations": [{"name": "la times", "sentiment": "negative"}, {"name": "los angeles times", "sentiment": "negative"}, {"name": "news corp", "sentiment": "none"}, {"name": "npr", "sentiment": "none"}, {"name": "national public radio", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The parent company of the Los Angeles Times is investigating allegations of inappropriate behavior by Ross Levinsohn, the newspaper's CEO and publisher.\nThe company, Tronc, began the investigation Thursday after a National Public Radio story detailed two sexual harassment lawsuits that named Levinsohn while he worked at Alta Vista and News Corp , as well as complaints from employees who said he fostered a fraternity-like atmosphere.\n\"We are immediately launching an investigation so that we have a better understanding of what's occurred,\" a company statement said. \"At Tronc, we expect all employees to act in a way that supports a culture of diversity and inclusion. We will take appropriate action to address any behavior that falls short of these expectations.\"\nLevinsohn, who was given the job in August, has not been suspended.\nHe did not comment to NPR for its story but the network said Levinsohn called NPR CEO Jarl Mohn on Wednesday and said the allegations against him are lies. He declined comment to The Associated Press.\nOne of the sexual harassment lawsuits named Levinsohn and other executives at internet search engine Alta Vista, NPR reported. In testimony, Levinsohn acknowledged that when he was a vice president there in 2001 he rated the relative \"hotness\" of female colleagues during office banter with other male employees, and speculated aloud about whether a woman who worked for him was a stripper on the side.\nAnother lawsuit, filed in 2007, alleged that Levihnson and other executives at News Corp, then the parent company of several Fox television properties, allowed a culture of sexual harassment to flourish.\nBoth lawsuits were settled for undisclosed amounts.\nFormer colleagues also told NPR that in 2013 Levinsohn used a gay slur to describe the crowd at a luncheon for Hollywood stylists to an executive at the Hollywood Reporter.\nThe investigation comes a day before the National Labor Relations Board is set to announce the results of a vote by Times employees on forming the newspaper's first union.\nMembers of the union organizing committee said they were \"appalled\" by NPR's findings.\n\"Ross Levinsohn should resign or be fired immediately,\" a committee statement said. \"Tronc and its board of directors must be held accountable for their failure to properly vet Levinsohn for one of the most important positions at the company and in American journalism.\"\nLevinsohn was Yahoo 's interim CEO in 2012, succeeding Scott Thompson, who left after four months amid reports that he embellished his academic record. Levinsohn was succeeded by Marisssa Mayer.\n--CNBC.com contributed to this story.", "external_links": [], "published": "2018-01-19T16:12:00.000+02:00", "crawled": "2018-01-19T16:26:37.001+02:00", "highlightTitle": ""}