{"organizations": [], "uuid": "1775a338ec3205953c3914a156e30ec3d54a2bd2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/06/the-associated-press-pot-industry-frets-then-shrugs-off-sessions-new-policy.html", "country": "US", "domain_rank": 767, "title": "Pot industry frets, then shrugs off Sessions' new policy", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T18:44:00.000+02:00", "replies_count": 0, "uuid": "1775a338ec3205953c3914a156e30ec3d54a2bd2"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/06/the-associated-press-pot-industry-frets-then-shrugs-off-sessions-new-policy.html", "ord_in_thread": 0, "title": "Pot industry frets, then shrugs off Sessions' new policy", "locations": [], "entities": {"persons": [{"name": "jeff sessions", "sentiment": "none"}, {"name": "patrick moen", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "u.s. justice department", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "justice department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO (AP) — This week's announcement that the U.S. Justice Department was ditching its hands-off approach to states that have legalized marijuana initially sent some in the industry into a tailspin, just days after California's $7 billion recreational weed market opened for business.\nBut for long-term pot purveyors accustomed to changing regulatory winds, the decision was just another bump in a long and winding road to proving their business legitimacy.\nMany in the industry said they're keeping a wait-and-see attitude because the effect of Attorney General Jeff Sessions' announcement depends on whether federal prosecutors crack down on marijuana businesses operating legally under state laws. Sessions provided no details other than saying individual U.S. attorneys are authorized to prosecute marijuana operators as they choose.\nStocks of publicly traded marijuana-related companies plunged Thursday after Sessions announced the Justice Department's new policy. On Friday, though, many of those stocks recovered.\n\"The announcement was largely symbolic,\" said Patrick Moen, general counsel of Privateer Holdings, a Seattle-based venture capital firm that invests in marijuana businesses. \"This kind of stunt will not have a substantial effect on the industry.\"\nMoen noted Sessions' action doesn't change federal law, which includes a congressional provision barring authorities from spending federal money to prosecute medical marijuana operations that abide by state laws.\nHe conceded that the action would have a \"near-term chilling effect\" on the industry's lobbying effort to compel banks and insurance companies to accept its business. Banks and insurance companies refuse to do business with cannabis companies because marijuana is illegal under federal law and most financial institutions are federally insured, forcing marijuana businesses to operate in cash.\nMost of Seattle-based Privateer's $150 million in investments are in companies based outside the United States, and Moen conceded that Sessions' action Thursday would keep it that way for the short term because of regulatory uncertainty in the United States. Online news and marijuana information site Leafly is the firm's biggest U.S. investment.\nIn San Francisco, a city long known for embracing weed, sales of recreational marijuana began Saturday as planned. Six pot shops confirmed they were selling recreational marijuana Saturday after receiving their state licenses the day before.\nShabnam Malek, a 44-year-old lawyer and mother of three, waited in line for a half hour for Apothecarium to open its doors in San Francisco.\nShe marveled at the difference between buying a legal bag of weed from the times in her 20s when she was buying marijuana on the streets, a situation she said exposed her to contaminated products and unsafe situations.\nShe said she thinks Sessions' announcement will backfire on him.\n\"If anything I feel more galvanized,\" she said. \"I think he's going to see a lot of us come out and be even more vocal about our support for legal cannabis.\"\nSessions' action also was on the mind of Kevin Johnson, director of operations at Grass Roots, which also opened its doors for recreational pot in San Francisco on Saturday.\n\"It's certainly a concern,\" Johnson said. \"It may be more difficult for us to do proper banking but when we opened up, George W. Bush was president and the DEA was doing raids on dispensaries. We're in this for the long haul.\"\nGrass Roots opened 13 years ago to sell medical marijuana.\nIn Colorado, CEO Andy Williams said the announcement that he's open to prosecution could turn years of work and millions of dollars of investment in his store Medicine Man Denver into a criminal enterprise. He said Sessions' action goes against the will of Colorado voters, who legalized marijuana in 2014.\n\"Any action by the attorney general goes against the public sentiment,\" he said. \"I don't think it's a smart move. Of course, we haven't seen what it is yet, so we'll wait and see.\"\nThe share price of Medicine Man dropped nearly 40 percent Thursday, from $3.18 to $2.11. The stock closed up Friday at $2.28 a share.\nColorado's U.S. attorney, Bob Troyer, said his office won't change its approach to prosecution, despite Sessions' guidance. Prosecutors there have always focused on marijuana crimes that \"create the greatest safety threats\" and will continue to be guided by that, he said.\nDon Morse, director of the Oregon Cannabis Business Council, said he expects \"business as usual\" in Oregon's marijuana industry despite Sessions' policy.\nThe U.S. Attorney for Oregon, Billy J. Williams, indicated he would maintain the same level of enforcement with state and local authorities by focusing on unlicensed production of marijuana and smuggling to other states.\n\"Legal marijuana has become so entrenched in the U.S. — it's a multibillion-dollar industry — and I don't see the people who are behind this, people like myself, rolling over for the Justice Department, which means Congress will have to act,\" Morse said. He said Congress should declassify marijuana as a Schedule 1 dangerous drug.\nMorse said he believes the same federal provision that bars prosecution of medicinal marijuana operators also protects the recreational side to some extent, because \"it is difficult to distinguish one from the other.\"\nCannabinniers, a San Diego maker of marijuana-infused food and drink also expects slower investor interest in the short term.\n\"At this point, we have no details about what the attorney general plans to do or what is going to happen, but regardless this is going to slow down investment in one of the fastest-growing industries,\" said Jeffrey Paul, vice president of sales for Cannabinniers.\nAssociated Press writers Peter Banda in Denver, Andrew Selsky in Portland, Oregon, and Amanda Lee Myers in Los Angeles contributed to this report.", "external_links": [], "published": "2018-01-06T18:44:00.000+02:00", "crawled": "2018-01-07T03:41:24.003+02:00", "highlightTitle": ""}