{"organizations": [], "uuid": "010dce386ce93ed3519a9db7ec670ed24935ee6d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/30/104871433-RTX3KCDG.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/12/gm-is-seeking-approval-for-an-autonomous-car-that-has-no-steering-wheel-or-pedals.html", "country": "US", "domain_rank": 767, "title": "GM is seeking approval for an autonomous car that has no steering wheel or pedals", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.025, "site_type": "news", "published": "2018-01-12T11:09:00.000+02:00", "replies_count": 0, "uuid": "010dce386ce93ed3519a9db7ec670ed24935ee6d"}, "author": "Phil Lebeau", "url": "https://www.cnbc.com/2018/01/12/gm-is-seeking-approval-for-an-autonomous-car-that-has-no-steering-wheel-or-pedals.html", "ord_in_thread": 0, "title": "GM is seeking approval for an autonomous car that has no steering wheel or pedals", "locations": [], "entities": {"persons": [{"name": "elijah nouvelage", "sentiment": "none"}, {"name": "dan ammann", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "gm", "sentiment": "negative"}, {"name": "tech guide gm", "sentiment": "negative"}, {"name": "general motors", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Would you get in a self-driving car that has no steering wheel and no pedals? General Motors thinks so, and wants to test its newest autonomous-driving vehicle on public roads and highways starting in 2019.\n\"When you see this image for the first time it's quite striking,\" said Dan Ammann, president of GM.\n\"That's why we believe this is a notable moment on the journey to full AV (autonomous vehicle) deployment.\"\nThe automaker has petitioned the federal government for approval to adjust 16 motor vehicle standards so it can test cars that have no steering wheel, pedals and other driver controls.\nIf regulators in Washington approve, GM plans to test up to 2,500 of these modified Chevy Bolts on public roads in at least seven states.\nThe move comes as Waymo, formerly known as the Google Self-Driving Car Project, prepares to launch a ride-hailing program outside of Phoenix using driverless Chrysler Pacifica Minivans.\nThose vehicles have been modified with sensors, cameras and radar equipment so the minivans can operate without a driver.\nUnlike, General Motors, Waymo has not petitioned the federal government to allow it to test vehicles without steering wheels and pedals.\nLast year, Ford said it plans to develop self-driving vehicles without steering wheels, though those vehicles are not expected to be ready until 2021.\nFreeing up another seat Elijah Nouvelage | Reuters Two self-driving Chevy Bolt EV cars are seen during a media event by Cruise, GM’s autonomous car unit, in San Francisco, California, U.S. November 28, 2017. So why would GM want self-driving cars without a steering wheel and pedals? Mainly because the equipment frees up space and weight in vehicles that will be the heart of an autonomous vehicle ride-hailing program. Since there will not be a driver in the cars, GM is taking the next logical step of removing the steering wheel and pedals, freeing up another seat for a passenger.\nWhat happens if there is an emergency or the car is not moving to the side of the road when it should? Each of the new steering-wheel free Chevy Bolts feature an emergency stop button passengers can press if they need to stop the car.\nAmmann understands some riders will be curious the first time they see these cars, but he's confident they will ultimately be embraced.\n\"We think people will look at that (car) and think it's a pretty important development,\" said Ammann.", "external_links": [], "published": "2018-01-12T11:09:00.000+02:00", "crawled": "2018-01-12T11:13:41.036+02:00", "highlightTitle": ""}