{"organizations": [], "uuid": "6a817c8a61500da548b93bfed485903d2ec79f65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/05/104929956-GettyImages-181854031.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/19836768/device/rss/rss.html", "section_title": "Energy", "url": "https://www.cnbc.com/2018/01/05/charge-on-coffee-cups-to-boost-recycling-proposed-by-uk-lawmakers.html", "country": "US", "domain_rank": 767, "title": "Charge on coffee cups to boost recycling proposed by UK lawmakers", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.061, "site_type": "news", "published": "2018-01-05T14:47:00.000+02:00", "replies_count": 0, "uuid": "6a817c8a61500da548b93bfed485903d2ec79f65"}, "author": "Anmar Frangoul", "url": "https://www.cnbc.com/2018/01/05/charge-on-coffee-cups-to-boost-recycling-proposed-by-uk-lawmakers.html", "ord_in_thread": 0, "title": "Charge on coffee cups to boost recycling proposed by UK lawmakers", "locations": [], "entities": {"persons": [{"name": "mary creagh", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}], "organizations": [{"name": "environmental audit committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A 25 pence (34 cents) levy on disposable coffee cups should be introduced and all disposable coffee cups should be recycled by 2023, according to the U.K. parliament's Environmental Audit Committee.\n\nIn a statement Friday, the committee said that revenue from the levy should be invested in reprocessing facilities and recycling \"binfrastructure\". The charge on disposable cups would be paid by consumers on top of the price of their coffee, and would be lowered as the recycling rate improves, it said.\n\nIf the target for recycling all disposable coffee cups by 2023 was not met, then the government should ban them altogether, the committee added.\n\nAdditionally, it said that producers needed to pay more for packaging that proved difficult to recycle, and that labeling needed to be improved so that consumers knew how to properly dispose of their cups.\n\nWhile some coffee shops did offer discounts to customers who brought their own cups, the committee said that uptake of such offers was between just 1 and 2 percent of coffee purchases.\n\nThe chair of the Environmental Audit Committee, Mary Creagh, said that 2.5 billion disposable coffee cups were thrown away in the U.K. every year, with almost none recycled and 500,000 per day littered.\n\n\"The U.K.'s coffee shop market is expanding rapidly, so we need to kick start a revolution in recycling,\" she said. \"We're calling for action to reduce the number of single-use cups, promote reusable cups over disposable cups and to recycle all coffee cups by 2023.\"\n\nSince 2015, English consumers have been charged five pence for single use plastic bags at large shops. The government says that plastic bag usage in England has fallen by over 80 percent as a result. Similar charges exist in Scotland, Northern Ireland and Wales.\n\nThe Marine Conservation Society (MCS) said it welcomed Friday's recommendations from the Environmental Audit Committee.\n\n\"Just like the plastic bag charge we are all now familiar with, a charge added to our coffee at the point of purchase will help consumers think about whether to take a refillable cup to the cafe,\" Laura Foster, head of clean seas at the MCS, said in a statement.\n\nFoster added that it would also encourage cafes to use \"traditional cups and mugs rather than hand out single-use cups.\"", "external_links": [], "published": "2018-01-05T14:47:00.000+02:00", "crawled": "2018-01-05T14:16:52.001+02:00", "highlightTitle": ""}