{"organizations": [], "uuid": "a7471d4b88cc9c601deb2716f77c2a7a7a9c3d07", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/business-wire-northwoods-energy-a-portfolio-company-of-funds-affiliated-with-apollo-global-management-announces-its-acquisition-of-sm.html", "country": "US", "domain_rank": 767, "title": "Northwoods Energy, a Portfolio Company of Funds Affiliated with Apollo Global Management, Announces Its Acquisition of SM Energy’s Powder River Basin Assets for $500 Million", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-11T00:43:00.000+02:00", "replies_count": 0, "uuid": "a7471d4b88cc9c601deb2716f77c2a7a7a9c3d07"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/business-wire-northwoods-energy-a-portfolio-company-of-funds-affiliated-with-apollo-global-management-announces-its-acquisition-of-sm.html", "ord_in_thread": 0, "title": "Northwoods Energy, a Portfolio Company of Funds Affiliated with Apollo Global Management, Announces Its Acquisition of SM Energy’s Powder River Basin Assets for $500 Million", "locations": [], "entities": {"persons": [{"name": "johnson", "sentiment": "none"}, {"name": "tyree", "sentiment": "none"}, {"name": "tom tyree", "sentiment": "none"}, {"name": "marcellus shale", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "powder river basin", "sentiment": "none"}, {"name": "rocky mountains", "sentiment": "none"}, {"name": "wyoming", "sentiment": "none"}], "organizations": [{"name": "northwoods energy llc", "sentiment": "neutral"}, {"name": "sm energy", "sentiment": "neutral"}, {"name": "northwoods energy", "sentiment": "neutral"}, {"name": "apollo global management", "sentiment": "neutral"}, {"name": "bill barrett corporation", "sentiment": "none"}, {"name": "campbell", "sentiment": "none"}, {"name": "converse energy", "sentiment": "none"}, {"name": "bonanza creek energy", "sentiment": "none"}, {"name": "barnett shale", "sentiment": "none"}, {"name": "vantage energy", "sentiment": "none"}, {"name": "apollo investment fund viii", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DENVER & NEW YORK--(BUSINESS WIRE)-- Northwoods Energy LLC (“Northwoods” or the “Company”) (formerly known as Converse Energy), a portfolio company of certain funds managed by affiliates of Apollo Global Management, LLC (NYSE:APO) (“Apollo”), today announced it has agreed to acquire SM Energy’s core Powder River Basin assets. The acquisition is comprised of over 112,200 predominantly contiguous net acres of leasehold in Converse, Campbell, and Johnson counties in Wyoming.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180110006269/en/\nNorthwoods is led by Chief Executive Officer Tom Tyree, who has extensive experience in the acquisition and development of upstream oil and gas properties in the Rocky Mountains, Marcellus Shale, and Barnett Shale. Mr. Tyree was Co-Founder, President, and CFO of Vantage Energy from 2006 to 2016. He is currently on the board of directors of Bonanza Creek Energy and served as CFO of Bill Barrett Corporation prior to Vantage Energy. The Apollo funds, including Apollo Investment Fund VIII and Apollo Natural Resources Partners II, have committed to invest up to an aggregate of $850 million in Northwoods.\nMr. Tyree said, “Northwoods is excited to be working with Apollo to build a leading Powder River Basin-focused independent E&P business. We believe the basin has some of the best geology of any play in the Lower 48 and that Northwoods has a tremendous opportunity to develop this highly contiguous, core acreage position.”\nGeoff Strong, Senior Partner at Apollo, said, “We look forward to working with Tom as Northwoods seeks to become a best-in-class Powder River Basin operator. Northwoods’ acreage position creates a solid foundation from which the Company can build significant scale in the region.”\nTudor, Pickering, Holt & Co. advised the buyer. Vinson & Elkins acted as legal advisor to the buyer.\nAbout Northwoods Energy LLC\nNorthwoods Energy LLC is an upstream oil & gas company based in Denver, CO and focused on the Powder River Basin. Northwoods is backed by investment funds affiliated with Apollo Global Management and the Northwoods management team, and is led by Chairman and Chief Executive Officer Tom Tyree.\nAbout Apollo Global Management, LLC\nApollo is a leading global alternative investment manager with offices in New York, Los Angeles, Houston, Chicago, St. Louis, Bethesda, Toronto, London, Frankfurt, Madrid, Luxembourg, Mumbai, Delhi, Singapore, Hong Kong and Shanghai. Apollo had assets under management of approximately $242 billion as of September 30, 2017 in private equity, credit and real estate funds invested across a core group of nine industries where Apollo has considerable knowledge and resources. Apollo’s team has extensive experience investing in the Natural Resources industry and, since 2001, certain of Apollo’s flagship private equity funds, have invested or committed to invest approximately $12.2 billion in 34 natural resources-related opportunities (as of September 30, 2017). Greg Beard, Apollo’s Head of Natural Resources, leads a team of approximately 20 private equity professionals focused on identifying value-oriented corporate carve-outs, asset acquisitions/build-ups and distressed investments across the energy and metals and mining markets globally. For more information about Apollo, please visit www.agm.com .\nForward Looking Statements\nThis press release may contain forward looking statements with respect to Apollo that are within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. These statements include, but are not limited to, discussions related to Apollo's expectations regarding the performance of its business, its liquidity and capital resources and the other non-historical statements contained herein. These forward-looking statements are based on management’s beliefs, as well as assumptions made by, and information currently available to, management. When used in this press release, the words “believe,” “anticipate,” “estimate,” “expect,” “intend” and similar expressions are intended to identify forward-looking statements. Although management believes that the expectations reflected in these forward-looking statements are reasonable, it can give no assurance that these expectations will prove to have been correct. These statements are subject to certain risks, uncertainties and assumptions. We believe these factors include but are not limited to those described under the section entitled “Risk Factors” in Apollo's Form 10-K filed with the Securities and Exchange Commission (“SEC”) on February 13, 2017, as such factors may be updated from time to time in Apollo's periodic filings with the SEC, which are accessible on the SEC’s website at www.sec.gov . These factors should not be construed as exhaustive and should be read in conjunction with the other cautionary statements that are included in this press release and in other SEC filings. We undertake no obligation to publicly update or review any forward-looking statements, whether as a result of new information, future developments or otherwise, except as required by applicable law. This press release does not constitute an offer of any Apollo fund.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180110006269/en/\nFor investor inquiries regarding Apollo:\nApollo Global Management, LLC\nGary M. Stein, 212-822-0467\nHead of Corporate Communications\ngstein@apollolp.com\nor\nApollo Global Management, LLC\nNoah Gunn, 212-822-0540\nInvestor Relations Manager\nngunn@apollolp.com\nor\nFor media inquiries regarding Apollo:\nRubenstein Associates, Inc.\nCharles Zehren, 212-843-8590\nczehren@rubenstein.com\nSource: Apollo Global Management, LLC", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51741562&newsitemid=20180110006269&lan=en-US&anchor=www.sec.gov&index=2&md5=50de10ee75c01d41eddc29110c8e509a", "http://www.businesswire.com/news/home/20180110006269/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.agm.com&esheet=51741562&newsitemid=20180110006269&lan=en-US&anchor=www.agm.com&index=1&md5=6f44b22d5ac7c8e08e3b1ace7281e0ad"], "published": "2018-01-11T00:43:00.000+02:00", "crawled": "2018-01-11T01:34:14.055+02:00", "highlightTitle": ""}