{"organizations": [], "uuid": "3f45811ad59fef6a7e8d3513e27327ad96e0c379", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/australia-stocks-midday/australian-shares-recover-as-miners-rally-nz-hits-record-high-idUSL4N1OY04W", "country": "US", "domain_rank": 408, "title": "Australian shares recover as miners rally; NZ hits record high", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T03:05:00.000+02:00", "replies_count": 0, "uuid": "3f45811ad59fef6a7e8d3513e27327ad96e0c379"}, "author": "", "url": "https://www.reuters.com/article/australia-stocks-midday/australian-shares-recover-as-miners-rally-nz-hits-record-high-idUSL4N1OY04W", "ord_in_thread": 0, "title": "Australian shares recover as miners rally; NZ hits record high", "locations": [], "entities": {"persons": [{"name": "mathan somasundaram", "sentiment": "none"}, {"name": "chris thomas", "sentiment": "none"}], "locations": [{"name": "nz", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "asx", "sentiment": "none"}, {"name": "blue ocean equities", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 1:07 AM / Updated an hour ago Australian shares recover as miners rally; NZ hits record high Chris Thomas 3 Min Read \nJan 3 (Reuters) - Miners gave Australian shares a jump-start on Wednesday, supported by rallying metal prices, while investors were also cheered by Wall Street’s strong start to 2018. \nThe S&P/ASX 200 index rose 0.2 percent, or 11 points, to 6,072.3 by 0026 GMT. The benchmark had closed marginally lower on its first day of trade in the year. \n“We saw pretty strong Chinese data yesterday... so commodity prices are strong, with a weak U.S. dollar, and that’s pretty positive for resources,” said Mathan Somasundaram, market portfolio strategist at Blue Ocean Equities. \nGrowth in China’s manufacturing sector unexpectedly picked up to a four-month high in December as factories cranked up production to meet a surge in new orders, a private business survey showed on Tuesday. \nU.S. stocks rose in the first session of the new year and the Nasdaq closed above 7,000 for the first time on Tuesday as investors were optimistic that 2018 will bring more gains for the market. \nIn Australia, bellwethers of the mining sector led the climb, with BHP Billiton and Rio Tinto gaining 2.3 percent to 2.4 percent, respectively. \nBHP rose to its highest level since May 2015 and was headed for its seventh straight session of gains, while Rio clocked a near six-and-a-half year high and looked set to post its 11th session in positive territory. \nChinese steel futures rose on the first trading day of the new year, while London copper was pushed higher on bets that demand in top consumer China will improve in 2018. \nThe Australian metals and mining index rallied for a 15th consecutive session, rising 2 percent to its best position in nearly five years. \nStrong gold prices drove miners of the metal higher, with the gold index touching its best level in over a year. \nMeanwhile, shares of Insurance Australia Group Ltd posted its sharpest drop in four weeks after the company cut its catastrophe reinsurance coverage for the 2018 calendar year. \nNew Zealand’s benchmark S&P/NZX 50 index ushered in the new year with a bang, with dairy and industrial stocks pushing the bourse to a record high on its first day of trade in 2018. \nThe index posted a 22 percent gain in 2017 - its best year since 2012, largely carried by solid gains in dairy company A2 Milk, which climbed 278.9 percent in its strongest ever year. \nA2 Milk rose 2.5 percent to a four-week high on Wednesday, while Auckland International Airport Ltd logged its biggest intraday percentage gain in more than two weeks. (Reporting by Chris Thomas in Bengaluru; Editing by Sam Holmes)", "external_links": [], "published": "2018-01-03T03:05:00.000+02:00", "crawled": "2018-01-03T03:44:44.037+02:00", "highlightTitle": ""}