{"organizations": [], "uuid": "af397b64064455cdf5c2dec4a91ffd5d7e54794d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/02/104923691-hearing_aid.1910x1000.JPG", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/02/hearing-loss-drug-breakthroughs-attract-big-pharma-venture-capital.html", "country": "US", "domain_rank": 767, "title": "Hearing loss drug breakthroughs attract big pharma, venture capital", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.074, "site_type": "news", "published": "2018-01-02T16:20:00.000+02:00", "replies_count": 0, "uuid": "af397b64064455cdf5c2dec4a91ffd5d7e54794d"}, "author": "Bob Woods", "url": "https://www.cnbc.com/2018/01/02/hearing-loss-drug-breakthroughs-attract-big-pharma-venture-capital.html", "ord_in_thread": 0, "title": "Hearing loss drug breakthroughs attract big pharma, venture capital", "locations": [], "entities": {"persons": [{"name": "cobb", "sentiment": "negative"}, {"name": "decibel", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "tarrytown", "sentiment": "none"}], "organizations": [{"name": "regeneron", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Nobel-winning sleep research shows dangers of phone use in bed \nCobb was referring to the very small spiral tube encased within the inner ear, which contains the nerve endings that transmit sound vibrations from the middle ear to the auditory nerve. \"It's a poorly understood organ in the middle of one of the hardest bones in the body,\" Cobb said. Noise-induced damage to the nearly 15,000 tiny hair cells and neurons in the cochlea or to the auditory nerve is by far the leading cause of what's known as sensorineural hearing loss . \nIn order to develop drugs to accurately target either the auditory nerve or hair cells, Decibel's researchers delve into the anatomy of the inner ear, down to the cellular level. \"If you don't do the fundamental work to understand what you're trying to achieve and actually getting the drug in there, it's shooting in the dark in terms of doing clinical development,\" Cobb said. \nIn late November, Decibel entered into a partnership with Regeneron, a biotech drug developer in Tarrytown, New York. Besides accessing Regeneron 's robust research tools, particularly in genetics, Decibel also will benefit from its financial support. Decibel, however, retains worldwide development and commercialization rights to any products discovered in the collaboration and will pay Regeneron tiered royalties based on net sales. Building a solution that uses the body's organic design \nJust north of Boston, in Woburn, Massachusetts, Frequency Therapeutics was founded in 2015 by biomedical engineers Bob Langer of MIT and Jeffrey Karp of Harvard Medical School. Frequency's focus is on developing small molecule drugs that activate dormant progenitor cells, types of stem cells, to repair damaged cochlear hair cells and restore hearing. \"It's important to do it in an organic way, as the body had originally designed it to be done,\" said David Lucchino, co-founder, president and CEO of Frequency. \nHe likens the process to immunotherapy, which activates the body's immune system, an increasingly successful approach in treating cancer. \"We are reactivating the body's system and letting it do the work,\" Lucchino said. Boston Globe | Getty Images Frequency Therapeutics founders Bob Langer, David Lucchino, and Jeff Karp in Cambridge, Massachusetts, April 10, 2017. The company is developing disease-modifying treatment for hearing loss. \nDelivering its drugs to the hard-to-reach hair cells has been a limiting factor. One of Frequency's key breakthroughs was figuring out how to grow cochlear tissue outside the body to do proper drug screening, thereby allowing researchers to identify the small molecules that have this effect. \"The challenge is to translate that to inside the body and show you can get the biological response in humans,\" Lucchino said. \"That's what we're doing in the clinic now.\" \nIn December the company announced the successful completion of a Phase 1 human study of FX-322, Frequency's lead progenitor cell activation drug, demonstrating its safety and tolerability. \"We expect to start a Phase 2 clinical study in the second half of 2018,\" Lucchino said. The company has previously raised $32 million in Series A funding from CoBro Ventures, Morningside Ventures, Alexandria Real Estate Equities and other investors, and expects to begin a Series B round later this year. A few small publicly traded firms also pursuing breakthroughs \nTwo publicly traded companies are making noise in this space. Auris Medical , a Swiss biopharmaceutical firm, is in advanced clinical development of drugs to treat inner-ear hearing loss and tinnitus, the condition of ringing or buzzing in the ears. \nSan Diego-based Otonomy , founded in 2008, has taken a three-pronged approach in its drug R&D. The first targets chemotherapy-induced hearing loss, a side effect of some cancer-fighting medicines, in particular platinum-based agents. \"We've conducted preliminary clinical research in that area and are working to develop a product,\" said CEO and president David Weber. \nOtonomy also concentrates on treating sensorineural destruction of the ribbon synapse connections that connect hair cells to the auditory nerve bundle, which results in earlier-stage hearing loss. That condition might not be profound enough to be detected in a hearing test, Weber said, \"but is contributing to what I'll call 'cocktail noise' hearing loss: You can't distinguish sounds at a cocktail party where there's a lot of background sound.\" \nOtonomy has developed a drug therapy, which has shown proof of concept in an animal model, to restore synapse connections and functional hearing. Otonomy also is developing medicines to restore the loss of hair cells. All three programs are in the preclinical stages, Weber said, and he declined to predict how soon any would move to the human clinical trial stage. \nAlthough one or more drugs that might temporarily or permanently repair inner-ear damage and restore hearing loss is still several years away from commercial availability, Decibel's Cobb offered some sound advice on how to prevent hearing problems. \"The best way to handle noise damage,\" she said, \"is to wear earplugs.\" \n— Bob Woods, special to CNBC.com Bob Woods Special to CNBC.com Related Securities", "external_links": [], "published": "2018-01-02T16:20:00.000+02:00", "crawled": "2018-01-02T16:26:23.000+02:00", "highlightTitle": ""}