{"organizations": [], "uuid": "a199299d81aeaeea5dd2f345489c0e1639803a16", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-dominos-ceo-patrick-doyle-plans-to-leave-company-in-june-board-names-richard-allison-as-ceo-russell-weiner-as-coo.html", "country": "US", "domain_rank": 767, "title": "Domino's CEO Patrick Doyle Plans to Leave Company in June; Board Names Richard Allison as CEO; Russell Weiner as COO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T01:15:00.000+02:00", "replies_count": 0, "uuid": "a199299d81aeaeea5dd2f345489c0e1639803a16"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-dominos-ceo-patrick-doyle-plans-to-leave-company-in-june-board-names-richard-allison-as-ceo-russell-weiner-as-coo.html", "ord_in_thread": 0, "title": "Domino's CEO Patrick Doyle Plans to Leave Company in June; Board Names Richard Allison as CEO; Russell Weiner as COO", "locations": [], "entities": {"persons": [{"name": "patrick doyle", "sentiment": "negative"}, {"name": "russell weiner", "sentiment": "negative"}, {"name": "j. patrick doyl", "sentiment": "negative"}, {"name": "richard allison", "sentiment": "negative"}, {"name": "doyle", "sentiment": "none"}], "locations": [{"name": "mich.", "sentiment": "none"}, {"name": "coo ann arbor", "sentiment": "none"}, {"name": "domino's usa", "sentiment": "none"}, {"name": "americas", "sentiment": "none"}], "organizations": [{"name": "leave company", "sentiment": "negative"}, {"name": "nyse", "sentiment": "none"}, {"name": "domino's international", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ANN ARBOR, Mich., Jan. 9, 2018 /PRNewswire/ -- President and Chief Executive Officer J. Patrick Doyle announced today his intention to depart Domino's (NYSE: DPZ) on June 30 after more than eight years at the helm of what is now the world leader in pizza.\nAt the same time, Domino's Board of Directors announced the promotion of Richard Allison , 50, President of Domino's International, to the role of Chief Executive Officer, succeeding Doyle; and the promotion of Russell Weiner , 49, President of Domino's USA, to the newly-created role of Chief Operating Officer of Domino's and President of the Americas. Both appointments will be effective as of July 1, 2018.\n\"One of the great honors and opportunities of my professional life was being named CEO of this incredible brand in early 2010,\" Doyle said. \"At that time, I set three goals for myself: I wanted us to become the #1 pizza company in the world; I wanted Domino's to provide our franchisees with the best possible return on their investment by creating a dramatically better experience for our customers; and I wanted to have a Leadership Team in place that would be ready to create even better results into the future. I'm proud to say that we've accomplished all of those goals, and I will leave Domino's knowing that it is in great hands.\"\nCommented Domino's Chairman of the Board David Brandon : \"Patrick excelled at every role he served at Domino's for more than 20 years and during the past eight, he distinguished himself as one of the best leaders in the restaurant industry. Under his leadership, the brand opened more than 5,500 stores, launched in more than a dozen new countries, and Domino's became one of the top-performing stocks of the decade. As important, though, is the fact that he developed an outstanding leadership team, which has allowed the Board to select a successor from that team.\"\nRichard Allison Becomes Chief Executive Officer on July 1, 2018\nRichard (\"Ritch\") Allison will officially take over as Domino's Chief Executive Officer on July 1, 2018. As President – Domino's International, Allison currently oversees more than 9,000 stores and all franchise relationships outside the United States.\nAllison joined Domino's in March 2011 as executive vice president of International, joining the brand from Bain & Company, Inc., a leading global business consulting firm, where he was partner and co-leader of Bain's restaurant practice.\n\"Under Ritch's leadership, Domino's international division grew by more than 4,500 stores in more than 85 markets in six years. Domino's International has achieved 95 consecutive quarters of same store sales growth and accounts for more than one-half of the company's global retail sales,\" Brandon said. \"The Board is confident Ritch is well-prepared to lead the company to the next level. And he could not have a more talented and capable leader than Russell Weiner to assume the critical new role of Chief Operating Officer of Domino's and President of the Americas.\"\n\"I am honored and humbled by this opportunity, as well as the trust and faith the Board of Directors has in me to lead this incredible global brand,\" Allison said. \"Patrick Doyle inspired us with the vision to become the world's market share leader in pizza, and we've done that. Now, we're looking to continue accelerating our growth with the support of our tremendous franchisees, managers and team members the world over. We want to become the dominant player in pizza everywhere in the world. I can't wait to get started.\"\nAllison received his degree in business administration from the University of North Carolina at Chapel Hill, and later earned an MBA from UNC's Kenan-Flagler Business School, where he was named a Dean's Scholar and received the Norman Block Award. He currently serves on the Kenan-Flagler Business School Board of Advisors.\nWeiner Named Chief Operating Officer of Domino's and President of the Americas\nRussell Weiner, currently serving as President – Domino's USA, will take over in the newly-created role of Chief Operating Officer of Domino's and President of the Americas on July 1, 2018.\n\"As we continue to globalize our business, it is important that we create synergies and centers of excellence across the Domino's system,\" Brandon said. \"In his role as COO of Domino's, Russell will be leading this effort. As President of the Americas, he will oversee marketing, operations, store growth and development, franchise relationships, strategy and insights and e-commerce for Domino's in the Americas - markets that account for 50 percent of Domino's global retail sales.\"\nWeiner was responsible for the reinvention of Domino's U.S. menu, which led to record-setting sales increases and the turnaround of the Domino's brand. Weiner is also credited for the creation of Domino's \"Pizza Theater\" store design, the redesign of the brand logo, and creation of the DXP pizza delivery vehicle, as well as many product and technology innovation launches.\n\"Joining Domino's as CMO in 2008 was the thrill of a lifetime for me,\" Weiner said. \"We had an opportunity to take a 'legacy' brand that was almost 50 years old and make it fresh again. Any marketer would love to have that chance. But then to become president of the U.S. business and now, to serve as Chief Operating Officer and to lead the Americas, is an honor that is difficult to describe. I'm looking forward to working closely with Ritch as we set our sights even higher than ever.\"\nA graduate of Cornell University, Weiner earned his MBA in marketing and international business from the New York University Stern School of Business. He currently serves on the Board of The Clorox Company.\nAbout Domino's Pizza ®\nFounded in 1960, Domino's Pizza is the recognized world leader in pizza delivery, with a significant business in carryout pizza. It ranks among the world's top public restaurant brands with a global enterprise of more than 14,400 stores in over 85 international markets. Domino's had global retail sales of nearly $10.9 billion in 2016, with more than $5.3 billion in the U.S. and more than $5.5 billion internationally. In the third quarter of 2017, Domino's had global retail sales of more than $2.8 billion, with nearly $1.4 billion in the U.S. and over $1.4 billion internationally. Its system is comprised of independent franchise owners who accounted for over 97% of Domino's stores as of the third quarter of 2017. Emphasis on technology innovation helped Domino's reach an estimated $5.6 billion in global digital sales in 2016, and has produced several innovative ordering platforms, including Google Home, Facebook Messenger, Apple Watch, Amazon Echo, Twitter and text message using a pizza emoji. Domino's is the creator of the DXP ® , a purpose-built pizza delivery vehicle, and the Piece of the Pie Rewards™, its first digital customer loyalty program.\nOrder – dominos.com\nAnyWare Ordering – anyware.dominos.com\nCompany Info – biz.dominos.com\nTwitter – twitter.com/dominos\nFacebook – facebook.com/dominos\nInstagram – instagram.com/dominos\nYouTube – youtube.com/dominos\nView original content with multimedia: http://www.prnewswire.com/news-releases/dominos-ceo-patrick-doyle-plans-to-leave-company-in-june-board-names-richard-allison-as-ceo-russell-weiner-as-coo-300580332.html\nSOURCE Domino’s", "external_links": ["http://twitter.com/dominos", "http://www.youtube.com/dominos", "http://www.instagram.com/dominos", "http://biz.dominos.com/", "http://www.dominos.com/", "http://www.prnewswire.com/news-releases/dominos-ceo-patrick-doyle-plans-to-leave-company-in-june-board-names-richard-allison-as-ceo-russell-weiner-as-coo-300580332.html", "http://www.facebook.com/dominos", "http://anyware.dominos.com/"], "published": "2018-01-10T01:15:00.000+02:00", "crawled": "2018-01-10T02:13:03.010+02:00", "highlightTitle": ""}