{"organizations": [], "uuid": "0ab6760d8ac881515e8f92edda98110ce7cab1a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223342731&w=1200&r=LYNXMPEE0I0U0", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-afghanistan-taliban-analysis/could-taliban-finally-return-to-afghan-peace-talks-obstacles-abound-idUKKBN1F81HC", "country": "US", "domain_rank": 408, "title": "Could Taliban finally return to Afghan peace talks? Obstacles abound", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T17:06:00.000+02:00", "replies_count": 0, "uuid": "0ab6760d8ac881515e8f92edda98110ce7cab1a1"}, "author": "", "url": "https://uk.reuters.com/article/uk-afghanistan-taliban-analysis/could-taliban-finally-return-to-afghan-peace-talks-obstacles-abound-idUKKBN1F81HC", "ord_in_thread": 0, "title": "Could Taliban finally return to Afghan peace talks? Obstacles abound", "locations": [], "entities": {"persons": [{"name": "nikki haley", "sentiment": "none"}, {"name": "hamid shalizi", "sentiment": "none"}, {"name": "james mackenzie", "sentiment": "none"}], "locations": [{"name": "afghanistan", "sentiment": "none"}, {"name": "pakistan", "sentiment": "none"}, {"name": "murree", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "islamabad", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "could taliban", "sentiment": "negative"}, {"name": "taliban", "sentiment": "negative"}, {"name": "united nations", "sentiment": "none"}, {"name": "min read  kabul", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 1:25 PM / Updated 30 minutes ago Could Taliban finally return to Afghan peace talks? Obstacles abound James Mackenzie , Hamid Shalizi 6 Min Read \nKABUL (Reuters) - Exploratory meetings in Pakistan between a high-level Taliban delegation and a representative of a prominent Afghan politician have fuelled speculation of a revival of long-stalled talks on ending Afghanistan’s 16-year war that kills thousands each year. \nSimilar hopes have repeatedly been dashed since the first direct talks between the Western-backed Afghan government and the Taliban broke down almost as soon as they began in the Pakistani hill station of Murree, outside Islamabad, in 2015. \nBut U.S. ambassador to the United Nations Nikki Haley’s remarks this week that talks were closer than ever - coming after Monday’s unofficial meeting in Islamabad - have renewed interest in a process that had seemed completely stalled. \nA statement from the Russian foreign ministry on Wednesday called for urgent direct talks between the Taliban and the government, adding that Russia, which has maintained contacts with the insurgent movement, could host them. \n“I think something is cooking,” said Mohammad Ismail Qasimyar, a senior adviser to Afghanistan’s High Peace Council, which was established to oversee the peace process. “The situation around us in Afghanistan is developing in such a way that we need peace even more today than we did yesterday.” \nLow-level contacts between the Afghan government, international groups including the UN and groups close to the Taliban have continued even as the insurgency has escalated over the past three years. \nBut progress has always been blocked by the deep mistrust between the government and the Taliban, as well as uncertainty about the position of neighbours including Pakistan, which Afghanistan has long accused of aiding the insurgents. \nPakistan rejects accusations that it sponsors the Taliban, pointing to the heavy casualty toll militant violence has inflicted on its citizens as well as the efforts it has made to fight radical groups on its territory. \nStill, many in Afghanistan argue that Pakistan, which has come under heavy pressure from Washington, is simply encouraging hopes of progress in order to buy time. \nOne senior government official in Kabul, noted that speculation about peace talks regularly surfaces in the winter, while the Taliban regroups ahead of its spring offensive. \n“None of these meetings or talks about talks will help achieve peace,” he said. \nPakistan’s foreign office spokesman Mohammad Faisal declined to comment on Afghan accusations that Pakistan may have pushed recent meetings to deflect U.S. pressure, but he added Islamabad was in favour of a political solution to the long war. \n”A stable and prosperous Afghanistan is our aim, he said. “And we would wish that we would arrive at the through negotiations, a talks-based process.” FILE PHOTO - Taliban new leader Mullah Haibatullah Akhundzada is seen in an undated photograph, posted on a Taliban twitter feed on May 25, 2016, and identified separately by several Taliban officials, who declined be named. Social Media/File Photo \n“U.S. POLICY WORKING” \nThe UN Security Council is due to hold a debate on Afghanistan’s future later on Friday following a visit to Kabul by council members this week, and is expected to call for a stronger regional partnership between Afghanistan and Central Asian neighbours. \nIt is the latest in a series of steps aimed at building agreement among Afghanistan’s neighbours. \nUnder a new strategy announced last year by U.S. President Donald Trump, the United States has stepped up its assistance to Afghan security forces, particularly through air strikes, with the aim of preventing any Taliban military victory and forcing the insurgents to accept peace talks. \n“The U.S. policy in Afghanistan is working,” Hayley told reporters. “We’re closer to talks with the Taliban and the peace process than we’ve seen before.” \nThe Taliban itself, which controls or disputes government control over more than a third of the country, says it wants a peaceful solution but says negotiations would depend on international troops leaving Afghanistan. \n“Islamic Emirate has a clear agenda for peace in Afghanistan and that is the end of invasion and an overall Islamic regime,” its spokesman Zabihullah Mujahid said in a statement this week. \nAccording to sources in the Taliban and an Afghan political party, a delegation from the movement’s political office in Qatar visited Islamabad for exploratory talks with Afghan politician Pir Hamid Gilani. \nA senior Taliban official based near the Afghanistan-Pakistan border said on Friday that the insurgents were “defining a new peace strategy” after the Islamabad meeting, which he described as the “most serious contacts since Murree”. \nThe movement’s spokesman denied any involvement in a separate meeting in Turkey that included figures linked to a breakaway Taliban faction and a representative of Hizb-i Islami, a party led by Gulbuddin Hekmatyar, a former Taliban ally who came over to the government side last year. \nEven if contacts are at no more than “pre-negotiation” stage, where the two sides try to establish the basis for talks, considerable obstacles remain. \nThe government in Kabul is deeply divided, with increasing hostility between rival ethnic and party groups that will make it difficult to establish a unified negotiating stance. \nThe Taliban has its own divisions and the ability of its leader Mullah Haibatullah Akhundzada to command the affiliated Haqqani network, blamed for major attacks on civilian targets in cities such as Kabul, may be tested. Additional reporting by Sami Yousafzai in KABUL and Kay Johnson in ISLAMABAD; Writing by James Mackenzie; Editing by Alex Richardson", "external_links": [], "published": "2018-01-19T17:06:00.000+02:00", "crawled": "2018-01-19T17:24:33.011+02:00", "highlightTitle": ""}