{"organizations": [], "uuid": "adb006e57819b5a81f8b162935a24cba6caa2f40", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/04/reuters-america-update-1-canada-sends-ministers-to-u-s-to-boost-nafta-as-key-talks-loom.html", "country": "US", "domain_rank": 767, "title": "UPDATE 1-Canada sends ministers to U.S. to boost NAFTA as key talks loom", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T23:21:00.000+02:00", "replies_count": 0, "uuid": "adb006e57819b5a81f8b162935a24cba6caa2f40"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/04/reuters-america-update-1-canada-sends-ministers-to-u-s-to-boost-nafta-as-key-talks-loom.html", "ord_in_thread": 0, "title": "UPDATE 1-Canada sends ministers to U.S. to boost NAFTA as key talks loom", "locations": [], "entities": {"persons": [{"name": "trudeau", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "montreal", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "nafta", "sentiment": "negative"}, {"name": "awa", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds details of when ministers visiting the United States and quotes by Prime Minister Trudeau)\nOTTAWA, Jan 4 (Reuters) - The Canadian government is sending three cabinet ministers to the United States to stress the merits of NAFTA, officials said on Thursday, paving the way for key talks that could either sink or save the trade pact.\nCanada and Mexico object to major changes that Washington wants to make to the North American Free Trade Agreement, and time is running out to settle differences before the negotiations are scheduled to wrap up at the end of March.\nOfficials will hold the sixth and penultimate round of talks in Montreal from Jan. 23-28.\nTwo Canadian cabinet ministers are already in the United States and one more will travel this weekend.\nCanada, which sends 75 percent of its goods exports to the United States, has been reaching out to U.S. politicians and the business community for almost two years to bolster support for free trade.\n\"We recognize we are heading into an important period. We are certainly preparing for all scenarios, and we're hopeful that we can make progress,\" a spokesman for Foreign Minister Chrystia Freeland said when asked about the latest visits.\n\"That's what we're focused on achieving, including in Montreal,\" Alex Lawrence, the spokesman, said in an e-mailed statement.\nNews releases announcing the ministerial trips make clear the cabinet members have been instructed to \"promote trade and NAFTA.\"\nPublic Safety Minister Ralph Goodale wraps up a two-day trip to Kentucky on Friday, the same day that Environment Minister Catherine McKenna finishes a visit to San Francisco. Officials initially indicated McKenna would travel this weekend but later clarified her trip had already started.\nAgriculture Minister Lawrence MacAulay is due to visit Tennessee from Friday to Monday.\nCanadian officials are increasingly pessimistic about the prospects for the 1994 trade treaty, which U.S. President Donald Trump blames for the loss of hundreds of thousands of U.S. manufacturing jobs and a big trade deficit with Mexico.\nPrime Minister Justin Trudeau, citing \"a level of unpredictability that's out of our control,\" told Global Television late last month that \"no deal is better than a bad deal for Canadians.\"\nIn a meeting held in Washington last month between the fifth and sixth rounds, negotiators left untouched the thorniest subjects of the sourcing of auto parts, dispute settlement and an expiry clause.\nTrade experts predict that unless Canada and Mexico make some concessions in Montreal, Trump will be more tempted to issue a notice of withdrawal from NAFTA. (Reporting by David Ljunggren; Editing by Leslie Adler)", "external_links": [], "published": "2018-01-04T23:21:00.000+02:00", "crawled": "2018-01-05T00:03:24.004+02:00", "highlightTitle": ""}