{"organizations": [], "uuid": "eac938ebe611b096a94daa70d7f51e63765d1535", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222302840&w=1200&r=LYNXMPEE0F042", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/eurozone-economy-trade/euro-zone-widens-trade-surplus-despite-strong-euro-idINKBN1F506O", "country": "US", "domain_rank": 408, "title": "Euro zone widens trade surplus despite strong euro", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T05:03:00.000+02:00", "replies_count": 0, "uuid": "eac938ebe611b096a94daa70d7f51e63765d1535"}, "author": "", "url": "https://in.reuters.com/article/eurozone-economy-trade/euro-zone-widens-trade-surplus-despite-strong-euro-idINKBN1F506O", "ord_in_thread": 0, "title": "Euro zone widens trade surplus despite strong euro", "locations": [], "entities": {"persons": [], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "france", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "eurostat", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BRUSSELS (Reuters) - The trade surplus in the 19 countries sharing the euro expanded in November to its highest point in eight months, as a rise in exports of goods outpaced increasing imports, despite a stronger euro, official estimates released on Monday showed.\nA money changer counts Euro banknotes at a currency exchange office in Nice, France November 17, 2017. REUTERS/Eric Gaillard/Files The European statistics office Eurostat said the euro zone’s surplus in goods trade rose in unadjusted terms to 26.3 billion euros in November, up from 18.9 billions in October. It was also higher than the 23.8 billion surplus recorded a year earlier.\nThe November trade expansion, which coincided with a new rise of the euro against the dollar, brought the bloc’s surplus to its highest monthly level since March when it stood at 28.7 billion euros.\nAdjusting to seasonal patterns, the bloc’s trade surplus expanded to 22.5 billion euros in November from 19 billions a month earlier, Eurostat said.\nThe boost was caused by an increased demand for euro zone goods from the rest of the world, which more than offset the higher volume of imports into the bloc.\nIn unadjusted terms, euro zone exports grew to a volume of 197.5 billion euros in November from 187.8 billions a month earlier. In the same period, imports increased to 171.2 billions from 168.9 billion euros.\nIn November exports rose 7.7 percent on the year, while imports increased by 7.3 percent.\nIn the period between January and November, euro zone exports increased 7.5 percent, compared with the same period in the previous year. Imports were up by 10.1 percent.\nTrade among the 19 euro zone countries also expanded in November to a volume of 165.5 billion euros, a 6.9 percent rise from a year earlier.\nReporting by Francesco Guarascio; editing by Robert-Jan Bartunek\n ", "external_links": [], "published": "2018-01-16T05:03:00.000+02:00", "crawled": "2018-01-16T05:20:21.029+02:00", "highlightTitle": ""}