{"organizations": [], "uuid": "34a2a484aa3758a31690baf3469749fd61a8083a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226479573&w=1200&r=LYNXMPEE0T05I", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-cuba-usa-tourism/cuba-tourism-slides-in-wake-of-hurricane-irma-trump-idUSKBN1FJ0CH", "country": "US", "domain_rank": 408, "title": "Cuba tourism slides in wake of Hurricane Irma, Trump", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T05:37:00.000+02:00", "replies_count": 0, "uuid": "34a2a484aa3758a31690baf3469749fd61a8083a"}, "author": "", "url": "https://www.reuters.com/article/us-cuba-usa-tourism/cuba-tourism-slides-in-wake-of-hurricane-irma-trump-idUSKBN1FJ0CH", "ord_in_thread": 0, "title": "Cuba tourism slides in wake of Hurricane Irma, Trump", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HAVANA (Reuters) - Tourism to Cuba, one of the few bright spots in its ailing economy, has slid in the wake of Hurricane Irma and the Trump administration’s tighter restrictions on travel to the Caribbean island, a Cuban tourism official said on Monday.\nAlthough the number of visitors rose nearly 20 percent in 2017, it fell 10 percent on the year in December, and is down 7-8 percent this month, Jose Manuel Bisbe York, the president of Cuban state travel agency conglomerate Viajes Cuba, said.\nArrivals from the United States, which had surged in the wake of the U.S.-Cuban detente in 2014, took the worst hit, dropping 30 percent last December, he told Reuters.\n“Since Hurricane Irma, we’ve seen arrivals shrink,” Bisbe York said on the sidelines of the event organized by U.S. travel agency insightCuba to dispel tourist misperceptions about Cuba.\nIrma hit in September, just as the tourism sector was taking reservations for its high season from November to March.\nImages of destruction put many would-be visitors off although Cuba had fixed its tourism installations within two months, said Bisbe York. Arrivals of Canadians, the largest group of tourists to Cuba, were down 4-5 percent.\n“But we see this as a temporary thing and what we are seeing is that arrivals are recovering from month to month,” said Bisbe York, adding that Cuba would go ahead with its plans to launch more than 15 hotels island-wide this year.\n“The first trimester will be the most difficult, because logically the change in the public perception takes time.”\nOccupancy rates at the hotels in Cuba managed by Spain’s Meliá Hotels International S.A. were down around 20 percent on the year in December and January, said Francisco Camps, Melia’s Cuba deputy general manager.\nTourists walk past an image of Cuba's late president Fidel Castro in downtown Havana, Cuba, November 11, 2017. REUTERS/Alexandre Meneghini “From February though, we are already reaching figures similar to those we had in previous years,” he said.\nRepublican President Donald Trump’s more hostile stance towards Cuba than his Democratic predecessor Barack Obama looks set to have a more lasting impact than Irma.\nThe number of U.S. visitors had surged since the Obama administration created greater exemptions to a ban on tourism to the Caribbean’s largest island and restored regular commercial flights and cruises.\nTourists sit in the garden of a hotel in Havana, Cuba, January 29, 2018. REUTERS/Stringer Arrivals reached a record 619,523 last year, up from 91,254 in 2014.\nBut the Trump administration in September issued a warning on travel there due to a spate of alleged health attacks on U.S. diplomats in Havana. In November, tighter travel regulations also went into effect.\nThe double whammy seriously depressed U.S. visits, American tour operators and a cruise line said at Monday’s event, although in reality the restrictions remain looser than before the detente and travel easier.\nCuba is also still one of the safest destinations worldwide, they said.\n“While the regulations he changed very little the perception in the U.S. was that you no longer could travel to Cuba legally,” said insightCuba’s Tom Popper, noting his agency’s reservations were down 50 percent this year.\n“Part of hosting this event was to communicate that it is 100 percent legal to travel to Cuba.”\nReporting by Sarah Marsh; Editing by Michael Perry\n ", "external_links": [], "published": "2018-01-30T05:37:00.000+02:00", "crawled": "2018-01-30T05:50:38.001+02:00", "highlightTitle": ""}