{"organizations": [], "uuid": "495ffd422841b369cb52f9fc2a3d834e27f2a842", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-freight-farms-acquires-cabbige-with-plans-to-introduce-seed-to-sale-farm-management-tools.html", "country": "US", "domain_rank": 767, "title": "Freight Farms Acquires Cabbige with Plans to Introduce Seed-to-Sale Farm Management Tools", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-24T17:00:00.000+02:00", "replies_count": 0, "uuid": "495ffd422841b369cb52f9fc2a3d834e27f2a842"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-freight-farms-acquires-cabbige-with-plans-to-introduce-seed-to-sale-farm-management-tools.html", "ord_in_thread": 0, "title": "Freight Farms Acquires Cabbige with Plans to Introduce Seed-to-Sale Farm Management Tools", "locations": [], "entities": {"persons": [{"name": "cabbige", "sentiment": "none"}, {"name": "brad mcnamara", "sentiment": "none"}, {"name": "jessica angell", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BOSTON, Jan. 24, 2018 /PRNewswire/ -- Freight Farms —the leading manufacturer of smart hydroponic container farms and developer of the farmhand ® automation and remote control suite—today announced the acquisition of Boston-based Cabbige , an online business management application for small-scale farmers. Cabbige's inventory, crop, and financial management software will be integrated into farmhand®.\nFreight Farms is as much a software developer as a hardware manufacturer. Today, farmhand® supports farms in over 35 states and 10 countries. Growers using farmhand® can already monitor their operations, control environment settings, track production, and replenish supplies using the mobile or web app . With upcoming Cabbige software integration, farmhand® users will have greater business management capabilities and the the tools to run both their farm and business from a single application.\nFreight Farms and Cabbige both have roots in the Boston AgTech scene. CEOs Brad McNamara (Freight Farms) and Jessica Angell (Cabbige) have always shared the goal of creating a more distributed, sustainable food system.\n\"Brad and I came to realize that our two technologies would do more for small business farmers together than independently. Cabbige has been acquired by Freight Farms to expand its impact to indoor growers and to give small-scale farmers an end-to-end solution for growing and selling fresh, local produce,\" says Jessica Angell, CEO of Cabbige.\n\"Cabbige's pricing algorithms and farm management software are powerful tools for any grower seeking to optimize their business. We saw a clear opportunity to bring that power onto the farmhand® platform to make managing farm operations, production, inventory, and pricing data easier. Our farmhand® users will now get full seed-to-sale visibility and value optimization,\" says Brad McNamara, CEO of Freight Farms.\nWith the integration of Cabbige's business technology, Freight Farms plans to release a paid version of farmhand® to a broader farming audience in 2018. For more information about the Cabbige acquisition, please visit the Freight Farms blog .\nAbout Freight Farms\nFounded in 2010 in Boston, Freight Farms has established itself as a leader in the agriculture technology industry. The company was the first to bring farming into a shipping container to create their flagship product: The Leafy Green Machine™. To date, there are over 180 Leafy Green Machines in the U.S., Canada, Caribbean, Middle East, Europe, and Asia. For more information about Freight Farms, visit www.freightfarms.com/media-kit .\nAbout Cabbige\nCabbige is an online business management application designed for small-scale farmers. While diversified and small-scale farms play a crucial role in providing fresh, nourishing food for local communities, they are difficult businesses to manage. Cabbige is designed to make management—record-keeping, number-crunching, and analysis—easier for small business farms. The proprietary pricing tool, reporting suite, and inventory management tools allow farmers to easily and confidently make data-driven decisions to improve the profitability of their business.\nMedia Contact\nElizabeth Yekhtikian\nelizabeth@inkhouse.com\nView original content: http://www.prnewswire.com/news-releases/freight-farms-acquires-cabbige-with-plans-to-introduce-seed-to-sale-farm-management-tools-300586677.html\nSOURCE Freight Farms", "external_links": ["http://www.cabbige.com/", "https://www.freightfarms.com/farmhand/", "http://cabbige.com/", "http://freightfarms.com/", "http://www.prnewswire.com/news-releases/freight-farms-acquires-cabbige-with-plans-to-introduce-seed-to-sale-farm-management-tools-300586677.html", "https://www.myfarmhand.com/", "http://www.freightfarms.com/blog/farmhand-gets-even-smarter-with-cabbige", "http://www.freightfarms.com/media-kit"], "published": "2018-01-24T17:00:00.000+02:00", "crawled": "2018-01-24T16:54:36.007+02:00", "highlightTitle": ""}