{"organizations": [], "uuid": "b9e4a99124db6c242a370fdf00395cce8271ede2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/business-wire-washington-federal-promotes-bryan-lutz-as-its-new-northern-washington-regional-president.html", "country": "US", "domain_rank": 767, "title": "Washington Federal Promotes Bryan Lutz as Its New Northern Washington Regional President", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T01:00:00.000+02:00", "replies_count": 0, "uuid": "b9e4a99124db6c242a370fdf00395cce8271ede2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/business-wire-washington-federal-promotes-bryan-lutz-as-its-new-northern-washington-regional-president.html", "ord_in_thread": 0, "title": "Washington Federal Promotes Bryan Lutz as Its New Northern Washington Regional President", "locations": [], "entities": {"persons": [{"name": "bryan lutz", "sentiment": "negative"}, {"name": "bryan", "sentiment": "none"}, {"name": "brent beardall", "sentiment": "none"}, {"name": "tom kenney", "sentiment": "none"}], "locations": [{"name": "seattle", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "ballard", "sentiment": "none"}, {"name": "seattle", "sentiment": "none"}, {"name": "northern washington", "sentiment": "none"}, {"name": "washington region", "sentiment": "none"}, {"name": "northern washington region", "sentiment": "none"}], "organizations": [{"name": "washington federal, inc.", "sentiment": "neutral"}, {"name": "washington federal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEATTLE--(BUSINESS WIRE)-- Washington Federal, Inc. (NASDAQ: WAFD) today announced that effective February 2, 2018, Bryan Lutz will lead its Northern Washington Region as Senior Vice President and Regional President. Tom Kenney, its current Northern Washington Regional President, is retiring effective February 2, 2018, after serving in this capacity over the last eight years. Bryan is well known to many of Washington Federal clients as he has been serving as one of the bank’s division managers since 2012.\nWashington Federal President & CEO, Brent Beardall, said, “We are pleased to see Bryan step up to this well-deserved leadership role. Our Washington roots go all the way back to 1917 with our original branch in Ballard, Washington. Over the decades, via both organic growth and acquisition, Washington Federal’s presence north of Seattle has grown steadily. Today, the Northern Washington Region is one of our top performers, with forty-four retail offices, $1.2 billion in deposits, and $1.35 billion in loans. I am confident Bryan is the right leader to continue to grow our customer base, raise our visibility and take us to the next level.\nLutz shared, “I am honored and excited about this opportunity and believe that Washington Federal is well positioned in Northern Washington to help clients achieve their goals and our communities to flourish.”\nEffective February 2, 2018, Bob Peters, Washington Federal’s Executive Vice President and Group Manager of Commercial Banking will lead the commercial banking teams in Bellingham. Peters has more than thirty years of commercial banking experience in the Puget Sound area and is familiar with many of the bank’s commercial clients and prospective clients. Both Grace Peschek, Vice President and Division Manager, and Jonathan Ensch, Vice President and Senior Relationship Manager, as well as the other commercial bankers based in Bellingham, will be reporting to Peters.\nPrior to joining Washington Federal in 2008, Lutz held mortgage leadership positions with several financial institutions in the Northwest and Midwest. In 2010, Bryan assumed leadership of Washington Federal’s Tucson, Arizona Retail Banking Division as Vice President and Division Manager. After two very successful years in Tucson, Lutz returned to Western Washington to assume the role of Senior Vice President and Manager of Washington Federal’s Mid-Sound Retail Banking Division. Under his leadership, the division was consistently one of the top producing divisions of the bank.\nWashington Federal is a national bank that operates 237 branches in Washington, Oregon, Idaho, Utah, Arizona, Texas, Nevada and New Mexico. Publicly traded since 1982, the bank recently marked its 139 th consecutive quarter of paying dividends. Washington Federal provides consumer and commercial deposit accounts, financing for small to middle market businesses, commercial real estate and residential real estate, including consumer mortgages, home equity lines of credit and insurance products through a subsidiary. As of September 30, 2017, the Company reported $15.3 billion in assets, $10.8 billion in deposits and $2 billion in stockholders’ equity.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180105005749/en/\nWashington Federal, Inc.\nBrad Goode 206-626-8178\nBrad.Goode@wafd.com\nSource: Washington Federal, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180105005749/en/"], "published": "2018-01-06T01:00:00.000+02:00", "crawled": "2018-01-06T00:54:54.019+02:00", "highlightTitle": ""}