{"organizations": [], "uuid": "0f935a1239261776ca6a0ac751f9a185d08c6d71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/italy-factors-jan-8/italy-factors-to-watch-on-jan-8-idUSL8N1P023Z", "country": "US", "domain_rank": 408, "title": "Italy - Factors to watch on Jan. 8", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T09:41:00.000+02:00", "replies_count": 0, "uuid": "0f935a1239261776ca6a0ac751f9a185d08c6d71"}, "author": "", "url": "https://www.reuters.com/article/italy-factors-jan-8/italy-factors-to-watch-on-jan-8-idUSL8N1P023Z", "ord_in_thread": 0, "title": "Italy - Factors to watch on Jan. 8", "locations": [], "entities": {"persons": [], "locations": [{"name": "italy", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "economy  bank of italy", "sentiment": "none"}, {"name": "debt  treasury", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The following factors could affect Italian markets on Monday.\nReuters has not verified the newspaper reports, and cannot vouch for their accuracy. New items are marked with (*).\nFor a complete list of diary events in Italy please click on .\nECONOMY Bank of Italy releases December data on Target 2 liabilities and European Central Bank funding to Italian banks.\nPOLITICS A coalition between Italy’s main left- and right-wing parties cannot be ruled out if no clear winner emerges from the upcoming general election, the country’s economy minister was Quote: d on Sunday as saying.\nDEBT Treasury announces sale of BTP bonds, with relative amounts to be auctioned on Jan. 11.\nItaly’s Treasury said on Friday it would offer 7.5 billion euros in 12-month BOT bills at auction on Jan. 10.\nCOMPANIES ATLANTIA A deadline expires on Monday for Spain’s financial authority CNMV to rule over the Madrid government’s request the regulator revokes the approval it granted in October to the Italian group’s bid for rival Abertis.\nCNMV is very likely to hand the issue over to the Spanish government as Atlantia in the meantime has sought Madrid’s approval for its bid, Il Sole 24 Ore reported on Sunday.\nFIAT CHRYSLER AUTOMOBILES Shares in the car maker rose 6.35 percent on Friday, following an upgrade to “overweight” from JPMorgan. Overall gains in the first week of the year topped 20 percent and 5.7 percent of the company’s capital changed hands in the period, Reuters data showed. The stock closed at 17.92 euros - just shy of a new record high hit earlier on Friday and up 94 percent over the past 12 months - compared with JPMorgan’s target price of 21 euros.\nCorriere della Sera on Saturday said it would be a mistake to see the gains as being fuelled by the prospect of a merger as there was nothing concrete at present in that respect. Other newspapers over the weekend also reported merger rumours were unfounded.\nTELECOM ITALIA A restructuring plan for the phone group drawn up by consultancy McKinsey targets 400 million euros a year in savings and would entail 550 million euros in extraordinary charges, Il Messaggero reported on Saturday. The paper cited union sources as saying up to 10,000 jobs could be cut over three years and that a meeting between unions and the company was scheduled for Jan. 18.\nAlso La Stampa spoke of 6,000-10,000 job cuts in the three years through 2020 quoting a Radiocor Plus report based on union sources.\n(*) YNAP HSBC has cut the target price to 35.50 euros from 37 euros.\n(*) UNICREDIT RBC has raised the target price to 23.50 euros from 21 euros.\n(*) DIASORIN The company said on Monday it had signed a partnership with Qiagen to offer fully automated solution for diagnosis of Tuberculosis.\nINTESA SANPAOLO The bank saw strong demand Friday for a three-part bond offering, amassing $10.6bn of orders for the $2.5bn deal.\nBANCA CARIGE, CREDEM, UNIPOL Top shareholder Vittorio Malacalza’s decision to announce last week that he may further raise his stake in the bank was driven by cracks in his relationship with CEO Paolo Fiorentino and fears that some of the banks’ shareholders, including state-owned SGA and Credito Fondiario, may team up to have more sway over Carige’s future, Il Messaggero wrote on Saturday. The paper mentioned Cariparma, Unipol and Credem as possible M&A partners from 2019, adding Malacalza would favour a merger with Credem.\nAZIMUT HOLDING CEO Sergio Albarelli ruled out the group could be up for sale in an interview with Milano Finanza on Saturday, adding Italy did not offer interesting acquisition targets while there could be more of them abroad.\nMONCLER The luxury outerwear maker is about to enter Thailand’s market, Il Messaggero reported on Sunday, confirming the group expects low double-digit growth in 2018.\nRETAIL Italians made 51 million purchases on e-commerce platforms on Dec. 1-24, up 34 percent from a year earlier, la Repubblica reported on Saturday quoting data by payments group SIA. Amazon Italia received 2 million orders on Black Friday, up more than 80 percent from 2016, the paper said.\nMARR Sales at the food group are expected to have risen by 50-60 million euros last year over 2016 with an EBITDA margin of around 7 percent, in line with the company’s guidance, Il Sole 24 Ore reported on Sunday.\nJUVENTUS The Serie A football club said on Friday it had finalised an accord with FC Schalke 04 to lend player Marko Pjaca until June 30, 2018.\nBANCA SISTEMA The lender said on Friday the Bank of Italy had set a minimum CET1 requirement of 7.125 percent for 2018. That compares with the bank’s CET1 ratio of 12.4 percent as of Sept. 30.\nBRUNELLO CUCINELLI Board meeting on FY preliminary results (net revenues).\nCREDITO VALTELLINESE Reverse stock split of one new ordinary share every 10 shares owned takes effect.\nFor Italian market data and news, click on codes in brackets:\n20 biggest gainers (in percentage)\n20 biggest losers (in percentage)\nFTSE IT allshare index\nFTSE Mib index\nFTSE Allstars index...\nFTSE Mid Cap index....\nBlock trades\nStories on Italy IT-LEN\nFor pan-European market data and news, click on codes in brackets: European Equities speed guide FTSEurofirst 300 index DJ STOXX index Top 10 STOXX sectors Top 10 EUROSTOXX sectors Top 10 Eurofirst 300 sectors Top 25 European pct gainers Top 25 European pct losers Main stock markets: Dow Jones Wall Street report Nikkei 225 Tokyo report FTSE 100 London report Xetra DAX Frankfurt market stories CAC-40 Paris market stories... World Indices Reuters survey of world bourse outlook Western European IPO diary European Asset Allocation Reuters News at a Glance: Equities Main currency report:\n ", "external_links": [], "published": "2018-01-08T09:41:00.000+02:00", "crawled": "2018-01-08T09:57:27.023+02:00", "highlightTitle": ""}