{"organizations": [], "uuid": "27937e1e624f4040aa25a33d598b6686c57e7f96", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/15/104902081-RTX3MBBU.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/investors-clamor-into-new-etfs-with-focus-on-blockchain.html", "country": "US", "domain_rank": 767, "title": "Investors clamor into new ETFs with focus on blockchain", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.219, "site_type": "news", "published": "2018-01-26T17:23:00.000+02:00", "replies_count": 0, "uuid": "27937e1e624f4040aa25a33d598b6686c57e7f96"}, "author": "Evelyn Cheng", "url": "https://www.cnbc.com/2018/01/26/investors-clamor-into-new-etfs-with-focus-on-blockchain.html", "ord_in_thread": 0, "title": "Investors clamor into new ETFs with focus on blockchain", "locations": [], "entities": {"persons": [{"name": "todd rosenbluth", "sentiment": "none"}], "locations": [{"name": "vilnius", "sentiment": "none"}, {"name": "lithuania", "sentiment": "none"}], "organizations": [{"name": "venture capital investors", "sentiment": "negative"}, {"name": "factset", "sentiment": "none"}, {"name": "blok", "sentiment": "none"}, {"name": "taiwan semiconductor manufacturing and overstock.com", "sentiment": "none"}, {"name": "cfra", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The cryptocurrency craze is finally flowing into the exchange-traded funds business.\nInvestors poured about $240 million into two blockchain-focused ETFs since their launch last week, according to the latest available data from FactSet. Blockchain is the technology behind bitcoin and other cryptocurrencies.\nThe surge of interest came even as bitcoin, the largest digital currency by market capitalization, stagnated in price in the last week. Bitcoin has fallen nearly 7 percent in the last week to about $10,800 Friday on Coinbase, the leading U.S. exchange for major cryptocurrencies.\nBitcoin performance in the last week \n\nSource: Coinbase \n\"It is rare for new ETFs to pull in such a large amount of cash,\" Todd Rosenbluth, CFRA's director of ETF and mutual fund research, wrote in an email, \"but there has been pent-up demand for a thematic approach to gain exposure to Blockchain.\"\nAmplify Transformation Data Sharing ETF (BLOK) , whose top holdings include Taiwan Semiconductor Manufacturing and Overstock.com , saw assets under management leap to $164.9 million Wednesday from just $2 million a week ago, according to FactSet. Chipmakers such as Taiwan Semiconductor have reported a sales surge due to demand from cryptocurrency \"miners.\" E-commerce company Overstock.com has a division focused on developing and investing in blockchain-related businesses.\nThe Reality Shares Nasdaq NexGen Economy ETF (BLCN) holds stocks such as IBM, which is developing a number of enterprise blockchain projects, and SBI Holdings , which is a prominent Japanese financial services company working with cryptocurrencies. The BLCN ETF's assets under management multiplied just over nine times in a week to $86.27 million, FactSet data showed.\n\"It's the first in a series of products we're going to be pushing into the space,\" said Eric Ervin, CEO of Reality Shares, who estimates the BLCN ETF assets will top $100 million in the next day or so.\nErvin said the closest thing to the massive growth in BLCN was a surge of fund flows into the ETFMG Prime Cyber Security ETF (HACK) , which launched just over a week before news broke that Sony Pictures was hacked.\nReality Shares' BLCN is up about 1.3 percent in the last week, while Amplify's BLOK is up about 1 percent.\nThe rush of fund flows into the blockchain ETFs is the latest case of hot money rushing into crypto-related assets.\nDigital currency bitcoin leaped 2,000 percent in the 12 months leading up to mid-December, amid a surge of interest in cryptocurrencies that sent their total market value above $800 billion earlier this month, according to CoinMarketCap.\nFollowing the meteoric price increases, several tiny stocks have skyrocketed hundreds of percent after announcing they were adding \"blockchain\" to their names, or making some kind of investment in the technology. The U.S. Securities and Exchange Commission has also temporarily halted trading in some stocks due to questions about claims related to investments in token sales.", "external_links": [], "published": "2018-01-26T17:23:00.000+02:00", "crawled": "2018-01-26T17:23:45.012+02:00", "highlightTitle": ""}