{"organizations": [], "uuid": "cef490cb6dcf35c0f7b049b7d90b2f601130bea3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180122.html", "section_title": "Archive News &amp; Video for Monday, 22 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/mideast-crisis-syria-turkey-germany/update-1-germany-calls-turkey-with-concerns-about-escalation-in-syria-idUSL8N1PH5XE", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Germany calls Turkey with concerns about escalation in Syria", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.09, "site_type": "news", "published": "2018-01-23T02:01:00.000+02:00", "replies_count": 0, "uuid": "cef490cb6dcf35c0f7b049b7d90b2f601130bea3"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/mideast-crisis-syria-turkey-germany/update-1-germany-calls-turkey-with-concerns-about-escalation-in-syria-idUSL8N1PH5XE", "ord_in_thread": 0, "title": "UPDATE 2-Germany calls Turkey with concerns about escalation in Syria", "locations": [], "entities": {"persons": [{"name": "reu", "sentiment": "negative"}, {"name": "andrea shalal", "sentiment": "negative"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "gabriel", "sentiment": "none"}, {"name": "tayyip erdogan", "sentiment": "none"}, {"name": "turke", "sentiment": "none"}, {"name": "sigmar gabriel", "sentiment": "none"}, {"name": "mevlut cavusoglu", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "ankara", "sentiment": "none"}], "organizations": [{"name": "rheinmetall", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds conservative politician urging end to planned arms sales)\nBy Andrea Shalal\nBERLIN, Jan 22 (Reuters) - German Foreign Minister Sigmar Gabriel on Monday called his Turkish counterpart to express concerns about the possible impact on civilians of a Turkish offensive in northern Syria, as pressure mounted for him to reject arms sales sought by Ankara.\nGabriel told Turkey’s Mevlut Cavusoglu he worried about the humanitarian consequences of an escalation in Syria, and both men agreed the Syrian political process should now be continued in an intensive manner, a ministry official said.\nTurkish President Tayyip Erdogan on Monday said there would be “no stepping back” from a Turkish air and ground push across the border aimed at crushing U.S.-backed Kurdish YPG fighters who control Syria’s Afrin region.\nGabriel is under fire from opposition lawmakers and even members of Chancellor Angela Merkel’s conservatives for failing to speak up earlier, and for moving toward approving Ankara’s request to have German arms maker Rheinmetall upgrade its German-built tanks.\nGerman concerns about Turkey’s advance could complicate an emerging rapprochement between the NATO allies that gathered momentum when Gabriel and Cavusoglu met in Germany this month.\nThe two countries last week resumed bilateral government consultations, which had been suspended after Ankara’s arrest of German-Turkish journalist Deniz Yucel in February 2017, although the Yucel case remains a major irritant.\nNorbert Roettgen, a conservative foreign policy expert and lawmaker, told Sueddeutsche Zeitung newspaper the Turkish military operation was in violation of international law, and Gabriel should halt any plans to approve the tank upgrades.\nHe said it was “completely obvious” that Germany could not provide Turkey with tank upgrades at such a time.\nAgnieszka Brugger, a Greens lawmaker, said the Turkish military operation demonstrated the devastating impact that German weapons sales could have overseas.\n“An immediate halt to all arms exports to Turkey is long overdue,” she told the Heilbronner Stimme newspaper. “This intense situation should be a wake-up call for the German government.”\nA German defence ministry spokesman on Monday confirmed that Turkey had purchased over 750 tanks from Germany in the 1980s, 1990s and late 2000s, but said he had no direct knowledge aside from photographs circulating in the media that the tanks were being used in Syria.\nForeign Ministry spokeswoman Maria Adebahr declined comment on a report in the magazine Der Spiegel that Germany was moving toward approval of a Turkish request for Rheinmetall to upgrade and modernise its Leopard tanks.\nGabriel had told reporters after meeting Cavusoglu that major arms sales to Turkey would remain off limits until Yucel’s case was resolved, but signalled that Berlin would review Ankara’s request to add protective gear to its existing tanks.\nTurkey wants to reinforce the tanks against improvised explosive devices and mines, and is also seeking a sensor system to protect them against anti-tank projectiles. (Reporting by Andrea Shalal, Editing by William Maclean)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T02:01:00.000+02:00", "crawled": "2018-01-23T17:54:08.001+02:00", "highlightTitle": ""}