{"organizations": [], "uuid": "6089cca66edc365dfe43dcfb6155606af1a894d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-aiy-executes-binding-term-sheet-to-acquire-interest-in-box-digital-media-pty-ltd.html", "country": "US", "domain_rank": 767, "title": "AIY Executes Binding Term Sheet to Acquire Interest in Box Digital Media Pty Ltd", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.935, "site_type": "news", "published": "2018-01-19T13:04:00.000+02:00", "replies_count": 0, "uuid": "6089cca66edc365dfe43dcfb6155606af1a894d2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-aiy-executes-binding-term-sheet-to-acquire-interest-in-box-digital-media-pty-ltd.html", "ord_in_thread": 0, "title": "AIY Executes Binding Term Sheet to Acquire Interest in Box Digital Media Pty Ltd", "locations": [], "entities": {"persons": [{"name": "limi", "sentiment": "negative"}, {"name": "jessica alba", "sentiment": "none"}, {"name": "angelina jolie", "sentiment": "none"}, {"name": "john ilio", "sentiment": "none"}, {"name": "scarlett johannsen", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}], "organizations": [{"name": "box digital media pty ltd", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "bdm", "sentiment": "none"}, {"name": "digital media box magazine", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MELBOURNE, Australia, Jan. 19, 2018 /PRNewswire/ -- The Directors of Authorised Investment Fund Limited ACN 068 793 322 (AIY or the Company) are pleased to announce that the Company has entered into a binding Term Sheet with Box Digital Media Pty Ltd ACN 605 098 539 (BDM) and its largest shareholder, for the acquisition of a 10 percent interest in BDM.\nAbout Box Digital Media\nBox Magazine print publishing was created in 2003 as a luxury lifestyle magazine. Targeting affluent and discerning consumers with a preference for premium lifestyle products but also a strong sense of social and ethical responsibility, the unique concept resulted in the venture growing from a humble 24 pages to the 240-page full colour glossy success that is Box Magazine today.\nBox Magazine after 12 years and 47 publications, featuring the likes of Scarlett Johannsen, Angelina Jolie, and Jessica Alba to name a few, and working with some of the world's leading luxury brands, has earned its rightful place in the luxury publishing market and is now expanding through its state-of-the-art digital platform.\nJohn Iliopoulos, Australian based entrepreneur, has spearheaded delivery of this exciting new platform, which is arguably the world's most interactive and user- friendly digital magazine.\nBox Digital Media and Authorised Investment Fund enter ground breaking 'always on' partnership.\nIn breaking news, Box Digital Media Group, one of Australia's leading publishers of luxury and lifestyle magazines, has entered into an investment agreement with Authorised Investment Fund (ASX: AIY) to expand and roll out its disruptive, immersive and interactive digital magazine platform.\nE-MERSION, by the Box Digital Media division, is a unique and pioneering technology that fully immerses consumers across a brand's ecosystem. Delivering 'always on content', in real time, E-MERSION is designed and built for multi-sensory engagement on each and every page across digital magazine platforms.\nCreating vast, new real-time revenue channels for advertisers while delivering always on and immersive content that engages consumers through tailored entertainment, education, inspiration and the ability to immediately transact, securely, when, where and how the customer chooses.\nWhether it's delivering a fully immersive and switched on digital magazine in-flight air travel with products that are delivered to your door, opening the door to a limitless world of entertainment and content beyond traditional magazines, CRM programs and in-flight channels, or partnering real time with like-minded brands, E-MERSION will revolutionise how consumers interact with brands in the digital publishing space.\nAll backed by a comprehensive analytics platform, empowering client partners and advertisers to monitor and measure the effectiveness of individual advertising, content placement and distribution within the brand's complete ecosystem.\nIn summary, E-MERSION offers:\n- Fully interactive and immersive technology\n- Page isolated content\n- Page isolated advertising\n- A powerful, yet easy to use platform\n- Video and audio capabilities throughout\n- Compatible with all IOS and Android mobile devices\n- Tailored branded apps for partner brands\n- Seamless connectivity to social media\n- Secure, real time transaction\n- Purchases recognised across multiple devices\n- Detailed monitoring of content and publication performance\nQuote: : John Iliopoulos, Managing Director/Founder, Box Digital Media\n\"Box Digital Media and AIY's new partnership will expand on the already long history of Box Publishing working with some of the world's leading brands. The investment will allow greater focus and expansion capabilities of our graphic designers and publishers working with programmers, data analysts, coders and client service executives across a greater network\".\nQuote: : Ben Genser, Chairman AIY\n\"No current digital magazine platform can achieve the level of engagement provided through the E-MERSION platform. Already, we're in discussions with some of the world's leading sporting clubs and eCRM programs to assist Box Digital Media roll this exciting new platform out\".\nTerm Sheet\nPursuant to the Term Sheet, it is proposed that BDM will subscribe for and AIY will issue and allot 30 million fully paid ordinary shares in AIY (AIY Shares) to BDM (Placement), in consideration for a parcel of shares in BDM equal to 10 percent of the issued share capital in BDM.\nThe Placement will be made in two tranches, with the first tranche of 20 million AIY Shares to be placed under the Company's existing 15 percent placement capacity in accordance with Listing Rule 7.1, and the second tranche of 10 million AIY Shares to be placed is subject to shareholder approval. The AIY Shares issued under the Placement will rank equally with existing shares on issue.\nFollowing the issue and allotment of shares in BDM to AIY, AIY will undertake a non-renounceable rights issue to eligible shareholders.\nThe proposed transaction as set out in the Term Sheet (Proposed Transaction) is subject to certain conditions including completion of due diligence, execution of legally binding documentation and all shareholder and regulatory approvals.\nThe Company will keep the market fully informed as to progress of the Proposed Transaction and the timing of its implementation, as required.\nFor and on behalf of the Board\nCathy Lin\nCompany Secretary\nAuthorised Contact:\nFor information regarding the above announcement. Please contact:\nMr Ben Genser\nMobile: +61-(0)418-382-543\nEmail: beng@genser.com.au\nView original content: http://www.prnewswire.com/news-releases/aiy-executes-binding-term-sheet-to-acquire-interest-in-box-digital-media-pty-ltd-300585179.html\nSOURCE Authorised Investment Fund Ltd", "external_links": ["http://www.prnewswire.com/news-releases/aiy-executes-binding-term-sheet-to-acquire-interest-in-box-digital-media-pty-ltd-300585179.html"], "published": "2018-01-19T13:04:00.000+02:00", "crawled": "2018-01-19T13:51:35.005+02:00", "highlightTitle": ""}