{"organizations": [], "uuid": "db564d7bb5208f942f38cde689698f5f6df93980", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180129.html", "section_title": "Archive News &amp; Video for Monday, 29 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/dr-pepper-snapp-ma-keurig-factbox/factbox-jabs-empire-expands-in-soda-with-dr-pepper-snapple-deal-idUSL2N1PO10I", "country": "US", "domain_rank": 408, "title": "FACTBOX-JAB's empire expands in soda with Dr Pepper Snapple deal", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T04:22:00.000+02:00", "replies_count": 0, "uuid": "db564d7bb5208f942f38cde689698f5f6df93980"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/dr-pepper-snapp-ma-keurig-factbox/factbox-jabs-empire-expands-in-soda-with-dr-pepper-snapple-deal-idUSL2N1PO10I", "ord_in_thread": 0, "title": "FACTBOX-JAB's empire expands in soda with Dr Pepper Snapple deal", "locations": [], "entities": {"persons": [{"name": "reimann", "sentiment": "negative"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "plano", "sentiment": "none"}], "organizations": [{"name": "dr pepper snapple", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "jab holding co", "sentiment": "negative"}, {"name": "cadbury plc", "sentiment": "none"}, {"name": "keurig green mountain inc", "sentiment": "none"}, {"name": "snapple", "sentiment": "none"}, {"name": "dr pepper snapple group", "sentiment": "none"}, {"name": "krispy kreme and panera bread co", "sentiment": "none"}, {"name": "jab", "sentiment": "none"}, {"name": "jacobs douwe egberts", "sentiment": "none"}, {"name": "mondelez international inc", "sentiment": "none"}, {"name": "keurig green mountain", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan 29 (Reuters) - JAB Holding Co, the private holding company of Germany’s Reimann family, is taking on juice and soda in its latest acquisition, as its Keurig Green Mountain business scoops up U.S. beverage maker Dr Pepper Snapple Group .\nThe deal, worth more than $21 billion, is the latest in a buying frenzy that has expanded JAB into a coffee empire and beyond with companies like Krispy Kreme and Panera Bread Co.\nBelow are recent deals done by JAB, which became the world’s largest pure-play coffee maker by volume in 2015, when it created the Jacobs Douwe Egberts joint venture by combining its D.E. Master Blenders 1753 business with the coffee business of Mondelez International Inc.\nThe information below is compiled from JAB statements and company websites.\nDR PEPPER SNAPPLE GROUP Location: Plano, Texas Founded: Spun off from Cadbury Plc in 2008 Transaction: Keurig Green Mountain Inc said it would buy the soda maker in a deal worth more than $21 billion, with Dr Pepper Snapple retaining 13 percent of the new company. JAB will be the controlling shareholder of the new, publicly-traded Keurig Dr Pepper, while Keurig shareholder Mondelez will own about 13-14 percent. Market presence: In addition to its namesake brands, Dr Pepper Snapple sells 7UP, Canada Dry, Schweppes, Hawaiian Punch, Mott’s and Vita Coco coconut water. It has a market capitalization of $17.3 billion, as of Friday’s close.\nAU BON PAIN Location: Boston Founded: 1981 Transaction: Panera Bread said in November 2017 it had entered an agreement to buy Au Bon Pain Holdings Co. Market presence: The bakery-cafe chain has 304 units worldwide, and will be part of Panera’s initiative to intensify growth in new real estate channels, including hospitals, universities, transportation centers and urban locations, Panera said when it announced the deal.\nPanera’s founder and now former chief created Au Bon Pain Co and the two companies separated in 1999.\nPANERA BREAD Location: St. Louis, Missouri Founded: Early 1980s Transaction: JAB bought Panera Bread Company in July 2017 through an investor group for $7.2 billion, expanding its coffee and breakfast empire through the biggest-ever U.S. restaurant deal. Panera had previously been publicly traded. Market presence: The company includes about 2,000 owned and franchise-operated bakery-cafe locations in 46 states, the District of Columbia, and Ontario, Canada with an annual revenue of $5 billion in sales, according to its website. BRUEGGER‘S ENTERPRISES INC Location: Dallas Founded: 1983 Transaction: Caribou Coffee agreed to buy the Bruegger’s Bagels chain from the Dallas-based parent company of la Madeleine French Bakery & Cafe. Market presence: The chain operates nearly 260 bakeries nationwide, according to its website.\nBALZAC COFFEE Location: Hamburg Founded: 1998 Transaction: JAB’s Espresso House agreed to buy the German gourmet coffee brand in June 2017. Market presence: 43 retail locations\nKRISPY KREME DOUGHNUTS Location: Winston-Salem, North Carolina Founded: 1937 Transaction: A JAB subsidiary bought the doughnut retailer in mid-2016 for about $1.3 billion. Krispy Kreme had previously been publicly traded. Market presence: Krispy Kreme sells doughnuts, other sweets and coffee at about 1,100 shops in about 26 countries, according to its website.\nKEURIG GREEN MOUNTAIN Location: Waterbury, Vermont Founded: 1981 Transaction: JAB and a team of minority investors, including Mondelez, bought Keurig Green Mountain Inc in March 2016 for $13.9 billion. Keurig had previously been publicly traded. Market presence: Keurig’s 2017 global retail sales totaled about $1.1 billion, with the bulk of those in the United States, according to data firm Euromonitor International. INTELLIGENTSIA COFFEE Location: Chicago Founded: 1995 Transaction: Peet’s Coffee & Tea purchased a majority stake in Intelligentsia for an undisclosed amount in October 2015. Market presence: 11 coffee bars in Chicago, New York, Los Angeles and surrounding area, and Watertown, Massachusetts, according to the company website STUMPTOWN COFFEE ROASTERS Location: Portland, Oregon Founded: 1999 Transaction: Peet’s Coffee & Tea purchased Stumptown for an undisclosed amount in 2015. Market presence: Stumptown, a leader of the “third wave” of specialty coffee roasters, operates 11 stores across the United States and sells its wholesale beans and cold brew at grocery stores, restaurants and coffee shops. JACOBS DOUWE EGBERTS (JDE) Location: Amsterdam Founded: 1753 Transaction: Mondelez International sold its coffee business to D.E. Master Blenders 1753 B.V., owned by JAB, for 3.8 billion euros in cash in 2013.\nMondelez retained a 44 percent stake in the new joint venture after selling its Carte Noire brand to Italian roaster Lavazza to appease antitrust regulators. Market presence: The joint venture is the largest pure-play coffee company in the world with $8.9 billion in retail sales last year, Euromonitor data showed. Brands include Jacobs, Senseo and Douwe Egberts, and it trails Nestle SA, maker of Nescafe and Nespresso, for the title of world’s largest coffee roaster. BARESSO COFFEE Location: Denmark Founded: 2000 Transaction: Purchased by JAB in 2015 for an undisclosed amount Market presence: Over 40 shops across Denmark ESPRESSO HOUSE Location: Sweden Founded: 1996 Transaction: JAB purchased Espresso House from Herkules Capital for an undisclosed amount in June. Market presence: Over 255 shops across Sweden, Norway, Finland and Denmark, according to the company’s website CARIBOU COFFEE Location: Minneapolis, Minnesota Founded: 1992 Transaction: Purchased by JAB in December 2012 for $340 million; had previously been publicly traded Market presence: Over 485 cafes across the United States PEET‘S COFFEE & TEA Location: Emeryville, California Founded: 1966 Transaction: Purchased by JAB, then called Joh. A. Benckiser, for $973.9 million in cash in July 2012; had previously been publicly traded Market presence: About 250 retail stores across the United States, according to the company’s website\nReporting by Chris Prentice; editing by Diane Craft\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T04:22:00.000+02:00", "crawled": "2018-01-30T19:11:13.000+02:00", "highlightTitle": ""}