{"organizations": [], "uuid": "2519c5c501361fbcd7a5b0af003d20297c60f37f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKTennisNews/", "section_title": "Reuters: Tennis News", "url": "https://uk.reuters.com/article/tennis-ausopen-halep/tennis-no-escapes-for-brave-halep-in-third-grand-slam-final-idUKL8N1PM0G6", "country": "US", "domain_rank": 408, "title": "Tennis-No escapes for brave Halep in third grand slam final", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T16:13:00.000+02:00", "replies_count": 0, "uuid": "2519c5c501361fbcd7a5b0af003d20297c60f37f"}, "author": "", "url": "https://uk.reuters.com/article/tennis-ausopen-halep/tennis-no-escapes-for-brave-halep-in-third-grand-slam-final-idUKL8N1PM0G6", "ord_in_thread": 0, "title": "Tennis-No escapes for brave Halep in third grand slam final", "locations": [], "entities": {"persons": [{"name": "halep", "sentiment": "negative"}, {"name": "caroline wozniacki", "sentiment": "none"}, {"name": "wozniacki", "sentiment": "none"}, {"name": "ian ransom", "sentiment": "none"}, {"name": "simona halep", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "melbourne park", "sentiment": "none"}], "organizations": [{"name": "rod laver arena", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 27, 2018 / 2:15 PM / Updated 2 hours ago Tennis-No escapes for brave Halep in third grand slam final Ian Ransom 3 Min Read \nMELBOURNE, Jan 27 (Reuters) - A series of great escapes underpinned Simona Halep’s brave Australian Open campaign but the exhausted Romanian hit a dead end in the final as she crumbled in a thriller against Caroline Wozniacki. \nHaving saved five match points during her run to Saturday’s title decider, she surrendered on the first against the Dane at Rod Laver Arena, a netted backhand condemning her to a 7-6(2) 3-6 6-4 defeat, her third in three grand slam finals. \nThe disappointment of missing out again on a long-awaited major trophy was compounded by the loss of the world number one ranking to Wozniacki, a sting in the tail of a taxing tournament that began with a rolled ankle. \nThe 26-year-old leaves Melbourne Park sore and sorry, but with another legion of admirers and with hope her day will come eventually. \n“I can still smile. It’s fine. I cried, but now I‘m smiling,” she told reporters with a tinge of regret. \n”It’s just a tennis match in the end. But, yeah, I‘m really sad I couldn’t win it. I was close again, but the gas was over in the end. \n”I did 100 percent what I could today. That’s why I can say that I‘m not sad for that. \n“I‘m still losing and I‘m still waiting (smiling). Maybe the fourth one will be with luck.” \nAching ankle and all, Halep saved three match points against American Lauren Davis in an epic third round encounter, then another two against 2016 champion Angelique Kerber in another three-set marathon in the semi-finals. \nBy the time she entered Rod Laver Arena on a stiflingly hot evening, she had clocked up nearly two more hours on court than second seed Wozniacki. \nShe already felt spent by the turn of the first set, with both feet hurting. \n“I had so many problems at my feet, pain everywhere,” she said ... No energy, no power. \n“But I think I did pretty well with all the things that were going on.” \nShe suffered a dizzy spell and a headache early in the second set and took a medical time-out to have her blood pressure checked. \nLater, she grabbed at her left thigh repeatedly. It was as if all her body parts were gradually breaking down. \nYet she lifted to take the game to Wozniacki. She battled back from 2-0 down in the third set to break the Danish counter-puncher three times in succession to nudge in front. \nBut even her coach Darren Cahill had said she was playing the final “on fumes” minutes before the match, and it ultimately showed as her serve flagged in the final exchanges. \nThrough it all, her mind remained bullet-proof, an improvement, she said, since her meek and rueful loss to Jelena Ostapenko at last year’s French Open final. \n“The mental part was okay,” added Halep, also a runner-up at Roland Garros in 2014. \n”So I think I have improved a lot this tournament. \n“I‘m leaving Australia with many good thoughts and many positive things because what I’ve done these two weeks I never did in the past.” (Editing by Pritha Sarkar)", "external_links": [], "published": "2018-01-27T16:13:00.000+02:00", "crawled": "2018-01-27T16:59:25.002+02:00", "highlightTitle": ""}