{"organizations": [], "uuid": "c6905ea5ce5eac33336ae2b18276e7f3c6074d27", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224231042&w=1200&r=LYNXMPEE0L1T1", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-soccer-england-mun-sanchez/manchester-united-sign-sanchez-from-arsenal-in-swap-deal-for-mkhitaryan-idUSKBN1FB2JT", "country": "US", "domain_rank": 408, "title": "Manchester United sign Sanchez from Arsenal in swap deal for Mkhitaryan", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T20:20:00.000+02:00", "replies_count": 0, "uuid": "c6905ea5ce5eac33336ae2b18276e7f3c6074d27"}, "author": "", "url": "https://www.reuters.com/article/us-soccer-england-mun-sanchez/manchester-united-sign-sanchez-from-arsenal-in-swap-deal-for-mkhitaryan-idUSKBN1FB2JT", "ord_in_thread": 0, "title": "Manchester United sign Sanchez from Arsenal in swap deal for Mkhitaryan", "locations": [], "entities": {"persons": [{"name": "sanchez", "sentiment": "negative"}, {"name": "ken ferris", "sentiment": "none"}, {"name": "matthew mpoke bigg", "sentiment": "none"}, {"name": "alexis sanchez", "sentiment": "none"}, {"name": "henrikh mkhitaryan", "sentiment": "none"}], "locations": [{"name": "manchester", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "chile", "sentiment": "none"}], "organizations": [{"name": "manchester united", "sentiment": "negative"}, {"name": "manchester city", "sentiment": "none"}, {"name": "arsenal", "sentiment": "none"}, {"name": "united", "sentiment": "none"}, {"name": "mkhitaryan reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 6:25 PM / in 19 minutes Manchester United sign Sanchez from Arsenal in swap deal for Mkhitaryan Simon Evans 4 Min Read \nMANCHESTER, England (Reuters) - Manchester United signed Chile forward Alexis Sanchez from Arsenal in a swap deal with midfielder Henrikh Mkhitaryan after a protracted transfer saga finally ended on Monday. \nThe 29-year-old Sanchez, who was out of contract at Arsenal at the end of the season, has joined the Old Trafford club after local rivals Manchester City had pulled out of the race. \nBritish media reported that Sanchez, who will wear United’s iconic No. 7 shirt, has joined the club on a 4-1/2-year deal, while Arsenal announced that Armenia captain Mkhitaryan, who turned 29 on Sunday, had signed a long-term contract. \nSanchez said: “I am thrilled to be joining the biggest club in the world. The chance to play in this historic stadium and to work with Jose Mourinho was something I could not turn down. \n“I am very proud to be the first Chilean player ever to play for United’s first team and I hope I can show our fans all around the world why the club wanted to bring me here.” \nSanchez missed Arsenal’s 4-1 win over Crystal Palace on Saturday to have a medical in Manchester on Sunday. \nHe would have been available on a free transfer when his contract expired in four months’ time but once City baulked at the amount of money involved in a mid-season deal, United manager Mourinho urged his club to step in. WORLD CLASS \n“Alexis is one of the best attacking players in the world and he will complete our very young and talented group of attacking players,” said Mourinho. \n“He will bring his ambition, drive and personality, qualities that make a Manchester United player and a player that makes the team stronger and the supporters proud of their club’s dimension and prestige.” \nSanchez almost joined City at the end of the August transfer window but that deal fell through as Arsenal manager Arsene Wenger was unable to sign a replacement in time. Soccer Football - Premier League - Manchester United vs Burnley - Old Trafford, Manchester, Britain - December 26, 2017 Manchester United's Henrikh Mkhitaryan during the warm up before the match REUTERS/Andrew Yates \nHe scored 80 goals in 166 appearances after the London club paid 35 million pounds ($48.83 million) for him in July 2014, and won the FA Cup in 2015 and 2017, scoring in both finals. \nMissing out on the Champions League this season was a bitter disappointment, however, followed by another blow when Chile failed to qualify for this year’s World Cup finals. \nA move to either of the Manchester clubs became a preferable option to signing a new contract. Arsenal wanted Mkhitaryan in exchange and he was delighted to join the London club. \n‘COMPLETE PLAYER’ \nMkhitaryan joins Arsenal after an 18-month spell at United in which he made 39 appearances but scored only five goals. \n“I’m very happy that we could finish this deal and I’m very happy to be here. It’s a dream come true because I’ve always dreamed of playing for Arsenal. Now that I’m here, I’ll do my best for this club to create history,” said Mkhitaryan. \nWenger added: “Henrikh is a very complete player. He creates chances, he defends well, he can absorb distances and he’s very committed as well. I must say he’s a player who has all the attributes.” \nMkhitaryan was a regular in United’s first XI at the start of this season but fell out of favor under Mourinho and had started only one of their past 13 league games. \nHe joined United on a four-year deal in July 2016 for an undisclosed fee from Borussia Dortmund, where he had become one of the most highly regarded attacking midfielders in Europe. \nBefore joining Dortmund in 2013, Mkhitaryan spent four years in Donetsk, Ukraine, first with Metalurh and later with Shakhtar, whom he helped win the Ukrainian league and cup double in three successive seasons between 2011 and 2013. \nHe continues to be the talisman of the Armenia team and is their all-time top scorer with 25 goals from 70 games. Reporting by Simon Evans; Writing by Ken Ferris, addtional reporting by Steve Tongue and Matt Westby in London, Editing by Pritha Sarkar", "external_links": [], "published": "2018-01-22T20:20:00.000+02:00", "crawled": "2018-01-22T20:40:59.008+02:00", "highlightTitle": ""}