{"organizations": [], "uuid": "16d4f2217d13a2be4c219b66ba2f2a721e43e58b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/08/09/103855912-GettyImages-200354831-003.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2017/12/29/in-retirement-a-1-million-nest-egg-isnt-enough.html", "country": "US", "domain_rank": 767, "title": "In retirement, a $1 million nest egg isn't enough", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.012, "site_type": "news", "published": "2018-01-01T19:01:00.000+02:00", "replies_count": 0, "uuid": "16d4f2217d13a2be4c219b66ba2f2a721e43e58b"}, "author": "Jessica Dickler", "url": "https://www.cnbc.com/2017/12/29/in-retirement-a-1-million-nest-egg-isnt-enough.html", "ord_in_thread": 0, "title": "In retirement, a $1 million nest egg isn't enough", "locations": [], "entities": {"persons": [{"name": "mark avallone", "sentiment": "none"}, {"name": "avallone", "sentiment": "none"}], "locations": [], "organizations": [{"name": "potomac wealth advisors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A $1 million nest egg has long been considered the benchmark for a secure retirement.\nSadly, these days, it's only a fraction of what you will really need.\nFor instance, a 67-year-old baby boomer retiring now with $1 million in the bank will generate $40,000 to live on in the first year, adjusted for inflation and assuming a sustainable withdrawal rate of 4 percent, said Mark Avallone, president of Potomac Wealth Advisors and author of \"Countdown to Financial Freedom.\" (In subsequent years, portfolio gains and losses could affect those numbers.)\nIt's even worse for a 42-year-old Gen Xer, whose $1 million at retirement will only generate an inflation-adjusted $19,000 in year one after all is said and done. And a 32-year-old millennial planning to retire at 67 with $1 million would be below the poverty line. \nThat's what Avallone, a certified financial planner, calls \"million-dollar poverty.\"\n\"For most Americans, there's been a serious lack of proper investment income and planning.\" -Mark Avallone, Potomac Wealth Advisors For most Americans, there's been a serious lack of proper investment income and planning, Avallone said. That, coupled with inflation, a looming pension crisis and longer life expectancy , is \"a toxic formula for successful retirement,\" he said — one that will result in a dramatic drop-off in lifestyle for retirees.\n\"Today's generation of working people grew up in an era where their parents went to a mailbox, and a check appeared. But pensions are almost extinct,\" Avallone said. \"People have to self-fund their retirement, and the enormity of that challenge is underestimated.\"\nGoBankingRates conducted a study this year to determine how long a nest egg of $1 million would really last . The personal finance site compared average expenses for people age 65 and older, including groceries, housing, utilities, transportation and health care.\nNaturally, depending on where in the U.S. you live, the longevity of a $1 million nest egg varies. Those dollars stretched furthest in states like Mississippi, Arkansas and Tennessee, where retirees could live a life of leisure for at least a quarter of a century.\nHowever, in Hawaii, where residents pay roughly 30 percent more for household items across the board, that same amount will only get you just shy of a dozen years — largely because of that higher cost of living and pricey real estate.", "external_links": [], "published": "2018-01-01T19:01:00.000+02:00", "crawled": "2018-01-01T19:04:13.052+02:00", "highlightTitle": ""}