{"organizations": [], "uuid": "25bf7614516a18af12309cdcb759c624429799e4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225217162&w=1200&r=LYNXMPEE0O1DP", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-boeing-bombardier-canada/bombardier-expected-to-lose-u-s-trade-dispute-canadian-government-source-idUSKBN1FE2JU", "country": "US", "domain_rank": 408, "title": "Bombardier expected to lose U.S. trade dispute -Canadian government source", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T19:17:00.000+02:00", "replies_count": 0, "uuid": "25bf7614516a18af12309cdcb759c624429799e4"}, "author": "", "url": "https://www.reuters.com/article/us-boeing-bombardier-canada/bombardier-expected-to-lose-u-s-trade-dispute-canadian-government-source-idUSKBN1FE2JU", "ord_in_thread": 0, "title": "Bombardier expected to lose U.S. trade dispute -Canadian government source", "locations": [], "entities": {"persons": [{"name": "canadi", "sentiment": "neutral"}, {"name": "david ljunggren", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "bombardier", "sentiment": "neutral"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "boeing co", "sentiment": "none"}, {"name": "min read  montreal", "sentiment": "none"}, {"name": "nafta", "sentiment": "none"}, {"name": "itc", "sentiment": "none"}, {"name": "international trade commission", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "bombardier inc", "sentiment": "none"}, {"name": "u.s. commerce department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MONTREAL (Reuters) - Planemaker Bombardier Inc is expected to lose a hotly contested U.S. trade dispute this week, a Canadian government source told Reuters on Thursday, likely inflaming tensions between the two countries during talks to modernize NAFTA.\nTrade lawyers and industry experts largely predict the International Trade Commission (ITC) will back the U.S. Commerce Department’s recommendation to slap Bombardier’s CSeries with a near 300-percent duty on sales to American carriers on Friday.\nThis is the first time a Canadian official has acknowledged that is the most likely outcome.\nBoeing Co, the world’s largest maker of jetliners, accuses the Canadian firm of dumping the planes in the U.S. market. An ITC spokeswoman declined to comment.\n“We think Bombardier is going to lose because the process is designed that way,” said the Canadian source, who requested anonymity because of the sensitivity of the situation.\n“It is not a multilateral or independent or unbiased tribunal. It’s an American tribunal,” the source added.\nBombardier was not immediately available for comment.\nOther industry experts, however, argue the ITC could still side with Bombardier, which has struck a deal with Airbus SE to give the European planemaker a majority stake in the CSeries.\nThe fate of the CSeries and the well-paid jobs associated with the plane is important both to Ottawa and the British government. The company is a big employer in Northern Ireland, where a political party is helping keep Prime Minister Theresa May in power.\nMay spoke to U.S. President Donald Trump on Thursday and reiterated the importance of the Bombardier jobs in Northern Ireland, her office said.\nAmid anger over the Boeing challenge, Canada last year scrapped plans to buy the planemaker’s 18 Super Hornet fighter jets.\nBoeing argues its business was hurt because Bombardier received illegal government subsidies and dumped the CSeries through the 2016 sale of 75 jets to Delta Air Lines.\nBombardier says Boeing never used its smallest plane, the 737 MAX 7, to compete for the order. No C Series planes have been delivered yet.\n“How can you have an outcome that assesses injury when there is no export even taking place?” the Canadian source asked.\nOttawa has yet to work out how it will react to the expected ruling, the source added, citing the number of different actors involved.\nThe ITC is expected to make a decision on Friday. For Bombardier to win, at least three of the body’s four commissioners would have to rule for the Canadian planemaker.\nReporting by David Ljunggren and Allison Lampert; Editing by Denny Thomas, Bill Rigby and Susan Thomas\n ", "external_links": [], "published": "2018-01-25T19:17:00.000+02:00", "crawled": "2018-01-25T19:32:42.050+02:00", "highlightTitle": ""}