{"organizations": [], "uuid": "5797a478b40d5e07e56eded012d12eb640722828", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-innovest-global-inc-continues-diversification-into-high-growth-businesses-beginning-revenue-growth-generation--spotlight.html", "country": "US", "domain_rank": 767, "title": "Innovest Global, Inc. Continues Diversification Into High-Growth Businesses, Beginning Revenue Growth Generation - Spotlight Growth", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T14:30:00.000+02:00", "replies_count": 0, "uuid": "5797a478b40d5e07e56eded012d12eb640722828"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-innovest-global-inc-continues-diversification-into-high-growth-businesses-beginning-revenue-growth-generation--spotlight.html", "ord_in_thread": 0, "title": "Innovest Global, Inc. Continues Diversification Into High-Growth Businesses, Beginning Revenue Growth Generation - Spotlight Growth", "locations": [], "entities": {"persons": [], "locations": [{"name": "sacramento", "sentiment": "none"}, {"name": "ca", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "innovest global", "sentiment": "negative"}, {"name": "innovest global, inc", "sentiment": "neutral"}, {"name": "innovest global, inc.", "sentiment": "none"}, {"name": "inc.", "sentiment": "none"}, {"name": "frost & sullivan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sacramento, CA, Jan. 11, 2018 (GLOBE NEWSWIRE) -- A new report has been published on Innovest Global, Inc. (OTC Pink: IVST). Innovest Global, Inc. is a diversified holding company that focuses on acquiring niche, high-growth businesses that are capable of generating significant annual revenue. The company’s planned subsidiaries operate across telehealth, commercial energy, business-to-business distribution, and auto sales.\nThe report provides an overview of Innovest Global, Inc., its subsidiaries, financials, industry analysis and more. The content also covers the outlook of the high-growth telehealth and commercial energy industries, which the company operates within.\nTelehealth and Commercial Energy Subsidiaries Key To Strong Growth Outlook\nTechnological innovations have pumped life into the healthcare and energy efficiency industries. These new technologies will assist in upgrading operational efficiencies, cost savings, and will benefit from the current U.S. political landscape.\nAccording to a report from market research firm, Frost & Sullivan , the telehealth industry is expected to become fully mainstream within the next five to seven years. Furthermore, the telehealth industry is forecast to see a massive compound annual growth rate (CAGR) of 29.30% between 2016 and 2021. This represents the fastest growing segment of the heath care sector.\nTelehealth is the next generation of healthcare that empowers patients and keeps professional health care advice with you as long as you have an internet connection. Rather than physically going to a doctors’ office and being around other sick patients, patients will soon have the ability to receive professional health care advice and consultation right over the web. Aside from virtual healthcare visits and advice, telehealth also includes remote patient monitoring, mobile healthcare platforms, remote health records management and personal emergency response systems (PERS).\nAccording to the 2017 Power and Utilities Trend report by PwC, analysts concluded that the vast majority of growth and changes will likely come from a “blueprint for a service-based model.” Essentially, this will include energy management, emerging technologies, monitoring equipment, and other energy management equipment.\nThe recent U.S. tax overhaul provides the opportunity for commercial energy efficiency providers to see a strong uptick in business. Under the old tax code , businesses would recognize depreciation on equipment over a number of years. However, the new tax law now allows businesses to increase their deductible cap on business investments up to $1 million. This allows businesses to receive tax credits on their business investments in the first year, rather than depreciating over time. Businesses now have more incentive to take on enterprise upgrades and investments.\nKey Accomplishments Have Innovest Global Positioned For Success In 2018\nInnovest Global, Inc. made several key accomplishments in 2017 that included strategic acquisitions in key industries, expanding its management team, and laying the groundwork for significant revenue growth in 2018. The company completed its acquisitions of Chagrin Safety Supply, Sanavida, Shepherd Energy Solutions, and is in talks to complete a major acquisition in auto retail that generates annual revenue greater than $150 million.\nChagrin Safety Supply is Innovest’s business-to-business safety distribution company, which is currently generating revenue for the company. As the company has stated in numerous press releases, the first revenues from Chagrin will be posted in the fourth quarter 2017 and annual earnings releases.\nSanavida is Innovest Global, Inc.’s telehealth subsidiary, which operates a comprehensive platform that is available in both English and Spanish. Furthermore, the platform is available as a low-cost subscription and offers a wide range of services: face-to-face online health visits, 24/7 medical assistance, discounted medical visits, prescriptions, medical supplies, and mental health services.\nAs the United States’ healthcare insurance laws remain under threat from sky-high premiums, limited coverage options, and radical changes in government funding, millions of Americans face losing their health coverage. Luckily, Innovest Global’s Sanavida appears to be a potential solution and a viable alternative to lofty health care premiums or even no coverage at all.\nSanavida is currently undergoing test marketing and more updates are likely to follow in the coming months. Overall, the company also hopes to lead the telehealth expansion into Mexico and South America through its Spanish language-capable platform.\nShepherd Energy Solutions is Innovest’s most recent acquisition and entry into the lucrative commercial energy business. Shepherd provides a wide range of services that seeks to provide energy efficiency, management, and cost reduction services for enterprises and governments. Ultimately, management sees Shepherd Energy Solutions as a perfect fit within PwC’s “blueprint for a service-based model” forecast for the power and utilities market.\nFor more information on Innovest Global, Inc., please visit http://innovestglobal.com and http://spotlightgrowth.com/index.php/2018/01/10/one-overlooked-stock-watch-2018-isnt-cannabis-crypto...\nSpotlightGrowth.com is a digital hub for micro-caps, small-caps, crowdfunding, cryptocurrency, and other emerging growth investors. SpotlightGrowth.com serves as our media subsidiary and provides insights on small cap companies.\nDisclaimer:\nSpotlight Growth is compensated, either directly or via a third party, to provide investor relations services for its clients. Spotlight Growth creates exposure for companies through a customized marketing strategy, including design of promotional material, the drafting and editing of press releases and media placement.\nAll information on featured companies is provided by the companies profiled, or is available from public sources. Spotlight Growth and its employees are not a Registered Investment Advisor, Broker Dealer or a member of any association for other research providers in any jurisdiction whatsoever and we are not qualified to give financial advice. The information contained herein is based on external sources that Spotlight Growth believes to be reliable, but its accuracy is not guaranteed. Spotlight Growth may create reports and content that has been compensated by a company or third-parties, or for purposes of self-marketing. Spotlight Growth was compensated five hundred dollars cash and fifty thousand restricted shares for the creation and dissemination of this content.\nThis material does not represent an investment solicitation. Certain statements contained herein constitute “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements may include, without limitation, statements with respect to the Company’s plans and objectives, projections, expectations and intentions. These forward-looking statements are based on current expectations, estimates and projections about the Company’s industry, management’s beliefs", "external_links": ["https://www.globenewswire.com/Tracker?data=cE613oN9ti9bzOhTCPrgQE1cQ5qtEJCf8rEeGqMa5CJ48AfY0gJNfdvBMga77RS2RcfwK_bDzW6tJCFNWkQLemhDYzMAPxKthDUlTBuQ8O4=", "https://www.globenewswire.com/Tracker?data=cE613oN9ti9bzOhTCPrgQGvKTI92bRcyc4pCcl6ITsxKztfMYruc7CyQq9zK1RsoMhA8xKRO1YeLqKuzQ1Nedj9htUQXJcFqGXEc4afd4TglzqHpF1gtKatztuoGH-Oh9ukXnRu6kxBJ5LtrUjUErmmHo7Is2z18i6XO92-MSYM=", "https://www.globenewswire.com/Tracker?data=X-isWC5O3cbnDKB0Tbr0dVoO0axWt3rzWHsF5esvyBYMxcR0_DUM1WarIVbUFhO_NdflJ2ky_enOHS3LPi4P0i6wQ5W1jMi6hmMWD-P-5cA=", "https://www.globenewswire.com/Tracker?data=xq1fI8neGfB-xkX7pP5FFLaM1hED0ZCqaRLo0BhAVswcInYPrjDTQD8QRMf1RPdQgxPVvejGCnf7YAAYZPKUhcwJGOHfoh-oms-VTbJrN1ORreohKLGHHt0Gr8VTcpx75tfZlXrwO_fFzKj9msgfwOq1q5G6r8gk3ZAirC4KqLICNigMDaIAqTwehOX69woZ", "https://www.globenewswire.com/Tracker?data=0-d6Ih-oVn1MIpHORjKAfYIB-4lxcUlhmRUKnWG8tlH6KPQyuj4uGMUJCWiN-XJxwjMJWBYJg3OCZlxRL7nmFo8PRsWwiKMpOfEcH6NiBKCqlU8xhEWHGzgbwPvu0n9aSTqO5rNSxYGi1JhDj1KKn2yU_9ZnhMEPOSP8MwNxJ2g7bF6IWHtDRdYtikWD8UFuyV1L44YjFR1_WKNck4RzvV8cExavu6rRMc5ji_PTmWs=", "https://www.globenewswire.com/Tracker?data=cE613oN9ti9bzOhTCPrgQGvKTI92bRcyc4pCcl6ITsw8s7_IpVDTajo_Nanz9e5L5NJ2fC6VM69fSKK8G6RTgrLtn78QDXwutlk1gVJwpomL4dmajMppIY-IZSglJZ_9wjVF_07ucfwopsfzp42veDVxk8xgNkEpEjUaFSja3f2LzyONDjufaBtVLkh-q4sOOUs6g9t-e7nKGZIjNaY2qm6SBuCJdSPCs7OMfRpEgwXQh3OveaJk4h980xBszNi0jFlezviecaj5F1s5QvCW8wUrw3_TJ3WrAYDLKO-RJKk4lTEEPIULhpkf8gZM71GL", "https://www.globenewswire.com/Tracker?data=qKmLNK95zbTqQDknJ2-UNLrzGZ9ESyGqNsxrVkPGVnXVFegwxna8yoxmpyvv2LzOt035oNh3bxoEUQizGX4xb4VjBudk0d19B0mS07TTrglXVio2mgUEcYPOwTgBXIuP", "https://www.globenewswire.com/Tracker?data=_CixxVrjbL2_3zf0BZdilIe0rowYjkWV0fP4jU6xKIGfLkA0ydo-MB9g6RXwr56RUjPGWtwhOIWlw51VHckoR8f58VrE2qun-Qem5vVQR6E=", "https://www.globenewswire.com/Tracker?data=_CixxVrjbL2_3zf0BZdilBrT0sqDGrb4YpiJYpqdoRQ0odImm_bnqDmh1cEfbyQTOwnh-ng0ccP6l8C16DkybN0mTwkjotrvLB_aVXIIHTY=", "https://www.globenewswire.com/Tracker?data=BoDmF4LgylSjFDeQNawY8BoRjPh94kbiSN0mya6ZqpswYvE6Y9zA9Kc-F1oOqX_R1t2cJMjZO5yoO2OTTal5k8V0SblXbZvc7UVvbtKTNbPD-_kAjgf8NTG4moeMM9VmAAZLAm1RP8mNPHfomgR460SrCmWgFh0wN69cK353AZqDaJhKBt2Ng7LoFstOds_kIW7fTCKaQl4OAdiId1VeUNVdHx6ybXSRAsNjD8WLIzg=", "https://www.globenewswire.com/Tracker?data=16KHyfasPYuLK3PL5ANgrS4Xfy2YwN-_KU4Tizn3_-MziPbQ9HG7CjB_Y793v7O9lR77bE9qZJD-FH2u1O-ftgq6bLO0_b4DYCJIf-Cb7qFl-FlJXcEPW7VKf1ZlnPdp", "https://www.globenewswire.com/Tracker?data=HH8xuzAYrmeXM9yZLo3VpzMKcV9EFJ0uSIp4CnsYvk3lAq4ZmkqSIC0ZLX_aJcW_mF_yKOyzifIGD4jp4lPMlblRn7vQNbDWBCJIYAclX1nBQmxdNH9BdRVq43oDVnEs7mTsgTvsruiPaeG1uLVXzupRI5_QOHbKTUU60aMn-V1cUIgQktI1XA2WUuQ23HVqZBZBRcs2UgetQpTstFru7IiGGLtRmQzUQLPdj753IH0=", "http://spotlightgrowth.com/index.php/disclosures/"], "published": "2018-01-11T14:30:00.000+02:00", "crawled": "2018-01-11T15:14:28.004+02:00", "highlightTitle": ""}