{"organizations": [], "uuid": "04444e1c9e63fcfe0c80815ab06dc38808184132", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221435659&w=1200&r=LYNXMPEE0B0SZ", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-hongkong-politics-youth/new-face-emerges-in-hong-kong-democracy-movement-as-others-face-court-idUSKBN1F11G1", "country": "US", "domain_rank": 408, "title": "New face emerges in Hong Kong democracy movement, as others face court", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T14:24:00.000+02:00", "replies_count": 0, "uuid": "04444e1c9e63fcfe0c80815ab06dc38808184132"}, "author": "", "url": "https://www.reuters.com/article/us-hongkong-politics-youth/new-face-emerges-in-hong-kong-democracy-movement-as-others-face-court-idUSKBN1F11G1", "ord_in_thread": 0, "title": "New face emerges in Hong Kong democracy movement, as others face court", "locations": [], "entities": {"persons": [{"name": "agnes chow", "sentiment": "none"}, {"name": "venus wu", "sentiment": "none"}, {"name": "chow", "sentiment": "none"}], "locations": [{"name": "hong kong", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "hong kong island", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "communist party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HONG KONG (Reuters) - Having seen a court disqualify her friend from holding a seat in Hong Kong’s legislature, 21-year-old Agnes Chow stands ready to step into the breach by contesting his seat for a pro-democracy movement that has provoked China’s wrath.\n“We can’t afford to be scared,” said the soft-spoken university student, who will announce her candidacy on Saturday.\n“People think if they don’t touch politics they will be fine but this is not the case anymore,” Chow told Reuters, referring to what she perceived as creeping interference by Beijing’s Communist Party rulers in the city’s freedoms.\nIf she wins the Hong Kong Island constituency in March, Chow will become Hong Kong’s youngest ever lawmaker.\nThe by-election is one of several necessitated after the Chinese parliament issued a legal interpretation that eventually led to the debarring of six opposition lawmakers, leaving the pro-democracy camp with 24 seats in the 70-seat legislature and also effectively taking away some of its veto powers under Hong Kong’s complex system.\nChow’s friend Nathan Law, 24, was one of the disqualified lawmakers.\nDuring the coming week, Law, along with several other opposition leaders like 21-year-old Joshua Wong, will return to the courts, defending their role in the largely peaceful protests that blocked major roads in the former British colony for 79 days in 2014.\nThe High Court could jail Wong and 19 other protesters, with sentencing expected on Wednesday, while in a separate hearing Law is appealing an eight-month jail term that he has already partially served before being released on bail.\n“When my friends are going to jail for defending democracy ... I keep thinking, ‘how can I do more and take up more responsibility?',” said Chow, who has been a student leader since 2012.\n“It forces us to grow.”\nUniversity of Hong Kong Student Union President Wong Ching-tak, 20, chats inside the university campus in Hong Kong, China January 4, 2018. Picture taken January 4, 2018. REUTERS/Bobby Yip ANXIOUS TIMES Hong Kong has been governed under a “one country, two systems” formula since its return from British to Chinese rule in 1997, allowing freedoms not enjoyed on mainland China that include an independent judiciary but not a fully democratic vote.\nThe failure of the “Umbrella Movement” protests to wrestle concessions on democracy from Beijing, coupled with prosecutions of at least 100 protesters, mostly youths, discouraged many young people from going back out on the streets.\nThe street occupations also prompted the Chinese government to tighten control of the city, and there is little sign that Beijing is winning favor with Hong Kong’s young.\nSlideshow (8 Images) In the latest survey conducted by the University of Hong Kong of 130 youths, only 0.3 percent identified themselves as “Chinese,” a new low since polling began in 1997.\nOn the flip side, around 70 percent of respondents - the highest ever - saw themselves as “Hong Kongers”.\nSeveral civil disobedience leaders from 2014 studied or taught at the university, but while the survey showed where sentiments lay its student body has become less politically active, to a point where no one wants to lead the student union.\n“Everyone feels numb,” said incumbent union president Wong Ching-tak. “The issues keep coming but you can’t do anything, and if you do something you face imprisonment.”\nWhile recent protests have failed to garner huge numbers, some activists say the pressure for change is slowly brewing beneath the surface.\n“I don’t necessarily think we’ll see a revolution with big fanfare, but an underground community that slowly expands,” said Yau Wai-ching, 26, who was ousted from the legislature.\n“And this community takes a different stance against the government ... This can be a revolution too.”\nReporting by Venus Wu; Editing by James Pomfret & Simon Cameron-Moore\n ", "external_links": [], "published": "2018-01-12T14:24:00.000+02:00", "crawled": "2018-01-12T14:38:07.000+02:00", "highlightTitle": ""}