{"organizations": [], "uuid": "d7bf1d342ffc94888d638558c64f17b8475c14bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-platform-specialty-products-corporation-announces-preliminary-2018-financial-guidance.html", "country": "US", "domain_rank": 767, "title": "Platform Specialty Products Corporation Announces Preliminary 2018 Financial Guidance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T15:00:00.000+02:00", "replies_count": 0, "uuid": "d7bf1d342ffc94888d638558c64f17b8475c14bb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-platform-specialty-products-corporation-announces-preliminary-2018-financial-guidance.html", "ord_in_thread": 0, "title": "Platform Specialty Products Corporation Announces Preliminary 2018 Financial Guidance", "locations": [], "entities": {"persons": [{"name": "rakesh sachdev", "sentiment": "none"}], "locations": [{"name": "fla", "sentiment": "none"}], "organizations": [{"name": "platform specialty products corporation", "sentiment": "negative"}, {"name": "ebitda", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Announcing 2018 Adjusted EBITDA guidance range of $860 million to $890 million\nWEST PALM BEACH, Fla., Jan. 10, 2018 (GLOBE NEWSWIRE) -- Platform Specialty Products Corporation (NYSE:PAH) (\"Platform\"), a global specialty chemicals company, announced today preliminary 2018 financial guidance. Platform expects adjusted EBITDA for 2018 to be in the range of $860 million to $890 million, representing a mid-to-high single digit increase from the mid-point of its 2017 guidance range. Platform also reaffirms its 2017 adjusted EBITDA guidance range of $810 million to $830 million. Platform expects free cash flow growth in excess of adjusted EBITDA growth and issued guidance for 2018 interest expense of approximately $300 million and capital expenditures of approximately $100 million.\nExecutive Commentary\nChief Executive Officer Rakesh Sachdev said, “We are pleased to announce our expected adjusted EBITDA guidance range for 2018. This guidance is consistent with our objective of a mid-to-high single digit EBITDA growth rate and reflects our expectation for continued strong performance from both of our businesses in 2018. Both businesses are expected to enjoy robust organic growth, which will make for a strong foundation for their previously announced separation into independent companies.”\nSachdev continued, “We expect our adjusted EBITDA growth, reduction in interest expense in 2017, and other cash flow improvements to translate into substantial free cash flow generation and adjusted earnings per share growth in 2018. Our free cash flow generation and earnings growth, in turn, are expected to leave the company with net debt of less than 5.5x adjusted EBITDA at the end of 2018 – before considering any equity capital that may be raised in connection with the separation of our businesses. This is an exciting outlook for the company and compelling objectives in terms of growth in earnings, improved cash flow generation and reduced leverage.”\nNon-GAAP Financial Measures\nThis release contains non-GAAP financial measures within the meaning of Regulation G promulgated by the Securities and Exchange Commission, including adjusted EBITDA guidance, adjusted earnings per share, free cash flow growth and net debt to adjusted EBITDA ratio. Platform only provides adjusted EBITDA guidance and free cash flow growth potential on a non-GAAP basis and does not provide reconciliations of such forward-looking non-GAAP measures to GAAP due to the inherent difficulty in forecasting and quantifying certain amounts that are necessary for such reconciliations, including adjustments that could be made for restructuring, integration and acquisition-related expenses, share-based compensation amounts, adjustments to inventory and other charges reflected in Platform’s reconciliation of historic numbers, the amount of which, based on historical experience, could be significant.\nAdjusted Earnings Per Share\nAdjusted earnings per share is defined as net loss attributable to common stockholders adjusted to reflect adjustments consistent with Platform’s definition of adjusted EBITDA. Additionally, Platform eliminates the amortization associated with (i) intangible assets recognized in purchase accounting for acquisitions and (ii) costs capitalized in connection with obtaining regulatory approval of Platform’s products (“registration rights”) as part of its ongoing operations, and deducts capital expenditures associated with obtaining these registration rights. Further, Platform adjusts the effective tax rate to 35%. The resulting adjusted net income available to stockholders is divided by the number of shares of outstanding common stock as of the period end plus the number of shares that would be issued if all of Platform’s convertible stock were converted to common stock, vested stock options were exercised, and awarded equity grants were vested as of the period end. Adjusted earnings per share is a key metric used by management to measure operating performance and trends. In particular, the exclusion of certain expenses in calculating adjusted earnings per share facilitates operating performance comparisons on a period-to-period basis.\nEBITDA and Adjusted EBITDA\nEBITDA represents earnings before interest, provision for income taxes, depreciation and amortization. Adjusted EBITDA is defined as EBITDA, excluding the impact of additional items, which are not representative or indicative of Platform’s ongoing business. Management believes adjusted EBITDA and adjusted EBITDA margin provide investors with a more complete understanding of the long-term profitability trends of Platform’s business, and facilitate comparisons of its profitability to prior and future periods. However, these measures, which do not consider certain cash requirements, should not be construed as an alternative to net income or cash flow from operations as a measure of profitability or liquidity.\nFree Cash Flow\nFree cash flow is defined as net cash flows provided by operating activities less net capital expenditures. Net capital expenditures include capital expenditures and investments in registrations of products less proceeds from disposal of property, plant and equipment.\nNet Debt to Adjusted EBITDA Ratio\nNet Debt to Adjusted EBITDA Ratio is defined as consolidated indebtedness, as defined in Platform’s credit agreement, less cash divided by Adjusted EBITDA.\nAbout Platform\nPlatform is a global, diversified producer of high-technology specialty chemicals and a provider of technical services. The business involves the formulation of a broad range of solutions-oriented specialty chemicals, which are sold into multiple industries, including automotive, agriculture, animal health, electronics, graphic arts, and offshore oil and gas production and drilling. More information on Platform is available at www.platformspecialtyproducts.com .\nForward-Looking Statements\nThis release is intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995 as it contains \"forward-looking statements\" within the meaning of the federal securities laws. These statements will often contain words such as \"expect,\" \"anticipate,\" \"project,\" \"will,\" \"should,\" \"believe,\" \"intend,\" \"plan,\" \"estimate\" and similar expressions, and relate, without limitation, to Platform's 2018 adjusted EBITDA guidance, adjusted earnings per share, free cash flow growth and net debt to adjusted EBITDA ratio . These projections and statements are based on management's estimates and assumptions with respect to future events and financial performance, and are believed to be reasonable, though are inherently uncertain and difficult to predict. Actual results could differ materially from those projected as a result of certain factors, which include, among others, Platform's ability to successfully complete the proposed separation of its Agricultural Solutions business and realize the anticipated benefits from the proposed separation, the final structure and timing for completion of the proposed separation, adverse effects on the two companies' business operations or financial results and the market price of Platform's", "external_links": ["https://www.globenewswire.com/Tracker?data=70sBt30EBdQf0dTYgiN7FubJCKIra6xnyCkw4VTnABKJ27Be1Aq-EJNCewft6CJ_iy2xWvEaMugAhSh86Gwli5kaGSpBjXPwCghDDh_pFaG3A1YHtVEdU-l61vLR0CFsw8OYlpwIepGJdA6VLqiCut9gaETRvBKimEGkKyXbdvIL-qfyjTjv8uXgxnfSFC_H1q8Ce259mKJKhOf1-9IzejXYOi9R3LcDQC-EX_V9qq8sFoAOUM9Vd9ANkbpVxUud5XaJcMjzUEHNStYPZRO-u_1FUDyHRYXtbKjO81SUKOiZc8fRZIGbk4nYbWAQh2hGC3DjtvkKLaCWvnyWUF3IFY2R19fB4pIMVWWjGyNIoiay0IR8tg--dF8mrGxNRKKXWdjTQPbNxSMQ66yDbMilFqIDqovo-f5d-J-MZ8ifkf41OhXyw3vwR9tYDNuj3sDrK-KAR040BOjWNVruuFArU0dUENE2IuAsHwbAxYy", "https://www.globenewswire.com/NewsRoom/AttachmentNg/d23bd49e-03de-49a8-9257-19c9fcf1607f"], "published": "2018-01-10T15:00:00.000+02:00", "crawled": "2018-01-10T16:19:41.010+02:00", "highlightTitle": ""}