{"organizations": [], "uuid": "0bae32b16a925e08cb8008d35f24289b569950eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/12/104943003-GettyImages-903940954.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/17/italy-election-whos-leading-with-taxes-debt-and-more-on-the-line.html", "country": "US", "domain_rank": 767, "title": "Italy election: Who’s leading with taxes, debt and more on the line", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.212, "site_type": "news", "published": "2018-01-17T08:46:00.000+02:00", "replies_count": 0, "uuid": "0bae32b16a925e08cb8008d35f24289b569950eb"}, "author": "Silvia Amaro", "url": "https://www.cnbc.com/2018/01/17/italy-election-whos-leading-with-taxes-debt-and-more-on-the-line.html", "ord_in_thread": 0, "title": "Italy election: Who’s leading with taxes, debt and more on the line", "locations": [], "entities": {"persons": [{"name": "alessandra benedetti", "sentiment": "negative"}, {"name": "matteo renzi", "sentiment": "none"}, {"name": "paolo gentiloni", "sentiment": "none"}], "locations": [{"name": "italy", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "porta", "sentiment": "none"}], "organizations": [{"name": "corbis", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "raiõs broadcasting", "sentiment": "none"}, {"name": "rza italia party silvio berlusconi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "There's a key moment coming up in Italian politics that could have repercussions for the entire European Union.\nItaly is holding a general election on March 4, but it is unclear whether it will manage to form a solid government, which is raising concerns among market participants.\nWhy does this election matter? Italy has been under the caretaker leadership of Paolo Gentiloni since December of 2016 — when Matteo Renzi resigned from the position after his proposals to reform the Italian Senate were not approved in a referendum.\nThere are deep concerns that increasing support for populist ideas will make Italy derail from a sustainable fiscal path in the coming years — a problem for its own finances but also for Europe.\n\"The election signals the return of serious political risk to the euro area's third largest economy, which has a debt stock of around 2.3 trillion euros ($ 2.77 trillion) — by our estimate, 133 percent of gross domestic product (GDP) in 2017, and over 20 percent of the euro-area total,\" Peter Ceretti, analyst at the Economist Intelligence Unit, told CNBC via email.\n\"The vote also comes at a time when the economy is gaining pace, but real GDP is still nearly 6 percent below its pre-crisis peak. The next government is unlikely to implement reforms that will raise productivity and potential growth,\" he added.\nAdding to the pile of problems is the European Central Bank' s plan to gradually reduce its stimulus, meaning that there could be an uptick in market volatility, making it more expensive for the Italian government to borrow from capital markets. Such a risk could spread to other euro zone countries, due to the interlinks between the 19-member economy.\nFurthermore, if the outcome of the election produced a weak Italian government, unable to pass major legislation, current efforts from France and Germany to integrate the euro zone further could be at risk. Such integration would probably be at a slower pace or even blocked.\nWhat are the main issues at stake? \"The main campaign issues in the election are all related to tax – flat tax, television tax, or university fees (which are also a form of tax). We should hear a lot about pensions as well,\" Erik Jones, director of European and Eurasian Studies at Johns Hopkins University, told CNBC via email.\n\"We will hear less about participation in the euro , although there is still some ambiguity on the side of the M5S (Five Star Movement) and admitting that the LN (Northern League) remains in favor of some kind of withdrawal. European issues are not really central in the debate. This is a domestic contest,\" he said.\nshow chapters The US wants to lower corporate tax rates, so does Italy 6:52 PM ET Tue, 5 Dec 2017 | 01:15 The populist Five Star Movement previously campaigned for the Italian withdrawal from the single currency, but a recent leadership change has eased the party's stance on the country's euro membership. On the other side of the political spectrum the Northern League, an Euroskeptic party, running in a three-party coalition, believes that Italy would be better off without the euro.\nWho's leading the polls? The current caretaker government managed to approve some reforms over the last year, including a new electoral law, which means Italy's system is now a mix of proportional representation and first-past-the-post. It's expected to benefit parties that form pre-election coalitions and reduces the chances of the populist Five Star Movement leading the country by themselves.\n\"We have seen a change in the electoral law, so that's a positive as far as if you have concerns about the Five Star Movement, maybe that's a positive indicator that you can hold on to, but nonetheless if you look at the polls and you agree with the polls, we do see them as the strongest party,\" John Raines, head of political risk at IHS Markit, told CNBC Wednesday.\nAlessia Pierdomenico | Bloomberg | Getty Images According to polling agency Termometropolitico, which released a poll on January 11, the Five Star Movement is the most likely to win the upcoming election, with 29 percent of the vote, followed by Renzi's Democratic Party with 24 percent of the support and former Prime Minister Silvio Berlusconi's Forza Italia with 15.3 percent. However, none of them seem well placed to get a majority and form a solid one-party government.\n\"Our baseline forecast is that the election will yield a hung parliament. The center-right will be the largest coalition and the (Five Star Movement) will be the largest party, but no formation will win an outright majority,\" Ceretti from the EIU told CNBC, adding that Berlusconi's party will be a key player in any workable coalition.\nBerlusconi's conservative party is running in this election with two coalition partners – the Eurosceptic Northern League and the far-right Brothers of Italy party. However, the media mogul cannot become prime minister once again, as he is currently barred from public office.\nNonetheless, his influence in the election cannot be discarded. According to Francesco Filia, chief executive officer at Fasanara Capital, \"Berlusconi has always been very popular in Italy in the last 20 years and more. His approval ratings have always been very, very strong and I wouldn't be surprised if this was another hat trick from him this time around again.\"\nBerlusconni has previously won three elections.\n\"Government formation talks will be difficult but should eventually yield an unstable, left-right government centered on the Democratic Party and Forza Italia. The administration will be weak, and we do not expect it to pass any major structural reforms,\" Ceretti warned.", "external_links": [], "published": "2018-01-17T08:46:00.000+02:00", "crawled": "2018-01-17T08:46:31.035+02:00", "highlightTitle": ""}