{"organizations": [], "uuid": "69a1d2ecd18e415d9e1fb09f6628c53e4775dfbd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-centerpoint-energy-elects-to-make-a-zens-reference-share-offer-adjustment.html", "country": "US", "domain_rank": 767, "title": "CenterPoint Energy elects to make a ZENS Reference Share Offer Adjustment", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T14:30:00.000+02:00", "replies_count": 0, "uuid": "69a1d2ecd18e415d9e1fb09f6628c53e4775dfbd"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-centerpoint-energy-elects-to-make-a-zens-reference-share-offer-adjustment.html", "ord_in_thread": 0, "title": "CenterPoint Energy elects to make a ZENS Reference Share Offer Adjustment", "locations": [], "entities": {"persons": [], "locations": [{"name": "houston", "sentiment": "none"}], "organizations": [{"name": "cnp", "sentiment": "negative"}, {"name": "centerpoint energy", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "centerpoint energy, inc.", "sentiment": "neutral"}, {"name": "securities and exchange commission", "sentiment": "none"}, {"name": "meredith", "sentiment": "none"}, {"name": "time inc.", "sentiment": "none"}, {"name": "zens", "sentiment": "none"}, {"name": "time inc", "sentiment": "none"}, {"name": "meredith corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON, Jan. 3, 2018 /PRNewswire/ -- CenterPoint Energy, Inc. (NYSE: CNP) has elected to make a Reference Share Offer Adjustment and distribute Additional Interest, if any, in accordance with the terms of CenterPoint Energy's 2.0 percent Zero-Premium Exchangeable Subordinated Notes due 2029 (ZENS) rather than electing to increase the Early Exchange Ratio to 100 percent during the pendency of Meredith Corporation's tender offer for all outstanding shares of common stock of Time Inc.\nAccording to the terms of Meredith's tender offer provided in Meredith's Schedule TO filed with the Securities and Exchange Commission on Dec. 12, 2017, (a) the tender offer is being made solely for cash and expires one minute after 11:59 p.m. (Eastern Time) on January 10, 2018, unless the offer is extended or earlier terminated; and (b) Meredith expects to acquire all remaining shares of common stock of Time Inc. for the same cash price in the subsequent merger of Time Inc. with a subsidiary of Meredith, if Meredith consummates its tender offer.\nDistributions of Additional Interest on the ZENS are therefore expected to be made by CenterPoint Energy in connection with the consummation of Meredith's tender offer and the subsequent merger of Time Inc. with a subsidiary of Meredith. CenterPoint Energy's distribution of Additional Interest in connection with the Reference Share Offer is expected to be proportionate to the percentage of eligible shares that are validly tendered by Time Inc. stockholders in Meredith's tender offer.\nAs of the date of this press release, the Reference Shares for each ZENS note consist of 0.5 share of Time Warner Inc. common stock, 0.0625 share of Time Inc. common stock and 0.061382 share of Charter Communications, Inc. common stock. After the tender offer and subsequent merger of Time Inc. with a subsidiary of Meredith, the Reference Shares for each ZENS note will consist of 0.5 share of Time Warner Inc. common stock and 0.061382 share of Charter Communications, Inc. common stock.\nCapitalized terms not otherwise defined in this press release have the meanings given to such terms in the indenture governing the ZENS.\nCenterPoint Energy, headquartered in Houston, Texas, is a domestic energy delivery company that includes electric transmission & distribution, natural gas distribution and energy services operations. The company serves more than five million metered customers primarily in Arkansas, Louisiana, Minnesota, Mississippi, Oklahoma, and Texas. The company also owns 54.1 percent of the common units representing limited partner interests in Enable Midstream Partners, a publicly traded master limited partnership it jointly controls with OGE Energy Corp., which owns, operates and develops natural gas and crude oil infrastructure assets. With more than 7,700 employees, CenterPoint Energy and its predecessor companies have been in business for more than 150 years. For more information, visit the website at www.CenterPointEnergy.com .\nThis news release includes within the meaning of the Private Securities Litigation Reform Act of 1995. These are based upon assumptions of management which are believed to be reasonable at the time made and are subject to significant risks and uncertainties. Actual events and results may differ expressed or implied by these Any statements in this news release regarding future events, including the consummation of Meredith Corporation's tender offer and subsequent acquisition of Time Inc., and other statements that are not historical facts are that involve risks and uncertainties including market conditions and other factors discussed in CenterPoint Energy's Form 10-K for the fiscal year ended December 31, 2016, CenterPoint Energy's Form 10-Q for the quarters ended March 31, 2017, June 30, 2017, and September 30, 2017, and CenterPoint Energy's other filings with the Securities and Exchange Commission. Each forward-looking statement contained in this news release speaks only as of the date of the release.\nFor more information contact\nMedia:\nLeticia Lowe\nPhone 713.207.7702\nInvestors:\nDavid Mordy\nPhone 713.207.6500\nView original content with multimedia: http://www.prnewswire.com/news-releases/centerpoint-energy-elects-to-make-a-zens-reference-share-offer-adjustment-300576895.html\nSOURCE CenterPoint Energy, Inc.", "external_links": ["http://www.centerpointenergy.com/", "http://www.prnewswire.com/news-releases/centerpoint-energy-elects-to-make-a-zens-reference-share-offer-adjustment-300576895.html"], "published": "2018-01-03T14:30:00.000+02:00", "crawled": "2018-01-03T13:58:25.019+02:00", "highlightTitle": ""}