{"organizations": [], "uuid": "616a921163e3592c3915f57888b77ca7f66d0027", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/04/reuters-america-update-8-national-guard-responds-to-blizzard-pounding-u-s-northeast.html", "country": "US", "domain_rank": 767, "title": "UPDATE 8-National Guard responds to blizzard pounding U.S. Northeast", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T03:15:00.000+02:00", "replies_count": 0, "uuid": "616a921163e3592c3915f57888b77ca7f66d0027"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/04/reuters-america-update-8-national-guard-responds-to-blizzard-pounding-u-s-northeast.html", "ord_in_thread": 0, "title": "UPDATE 8-National Guard responds to blizzard pounding U.S. Northeast", "locations": [], "entities": {"persons": [{"name": "williams", "sentiment": "none"}, {"name": "valentine williams", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "jfk airport", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}, {"name": "northeast", "sentiment": "none"}], "organizations": [{"name": "u.s. northeast", "sentiment": "negative"}, {"name": "national guard", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds flights to resume at JFK Airport in New York Friday morning, parts of New Jersey received nearly foot and a half of snow)\nBOSTON/NEW YORK, Jan 4 (Reuters) - A powerful blizzard battered the U.S. Northeast on Thursday, knocking out power for tens of thousands of people and snarling travel amid a cold snap that has gripped much of the United States for over a week and killed more than a dozen people.\nThousands of flights were canceled, firefighters scrambled to rescue motorists from flooded streets in Boston, National Guard troops were mobilized in the Northeast and New York City's two main airports halted flights because of whiteout conditions.\n\"Today, I thought Manhattan was going to have the streets cleaned up, but I see not,\" said Valentine Williams, who usually operates an electric scooter to deliver food in New York City.\nThe snow forced Williams, 28, to make deliveries on foot. No customers complained that he was slower than usual. \"They're just surprised that I'm out here,\" he added.\nOfficials feared fast-dropping temperatures after the storm passed would turn snow on roadways to ice.\nAhead of that threat, snow plows and salt trucks were dispatched along streets and highways, and schools were closed through much of the region. In Boston, Mayor Marty Walsh said schools would remain closed on Friday.\nBlizzard warnings were in effect along the East Coast from North Carolina to Maine. The U.S. National Weather Service measured wind gusts of more than 70 miles per hour (113 kph), which downed power lines.\nAlmost 80,000 homes and businesses in the Northeast and Southeast, where the storm struck on Wednesday, were without power.\nThe Boston area received 12 inches of snow, with more on the way, according to the National Weather Service. Parts of New Jersey were buried under nearly a foot and a half of powder.\nThe storm was powered by a rapid plunge in barometric pressure that some weather forecasters called a bombogenesis, or a \"bomb cyclone.\" It brought high winds and swift, heavy snowfall.\nThe wintry weather has been blamed for at least 14 deaths in the past few days, including four in North Carolina traffic accidents and three in Texas because of the cold.\nNearly 500 members of the National Guard were activated along the East Coast to assist with emergency response, including 200 in New York state, the U.S. Department of Defense said in a statement.\nTRAVEL WOES\nMore than 5,000 U.S. airline flights were canceled. At New York's John F. Kennedy (JFK) and LaGuardia airports, all flights were temporarily halted because of whiteout conditions, the Federal Aviation Administration said. LaGuardia on Thursday evening announced on Twitter that the suspension had been lifted. But the Port Authority of New York and New Jersey said flights at JFK would not resume until 7 a.m. Friday.\nPassenger train operator Amtrak ran reduced service in the Northeast. Sporadic delays were reported on transit systems, including New York's Long Island Rail Road and Metro-North commuter lines, as well as the Boston area's Massachusetts Bay Transportation Authority system.\n\"Years of Band-Aid solutions create nightmare situations when storm damage occurs,\" said Joseph Schwieterman, a professor of public policy and specialist in transportation systems at DePaul University in Chicago. \"Replacement parts are tough to find and maintenance process turns into major headache.\"\nIn New York's Fort Greene neighborhood, Mohammed Farid Khan said his morning commute took three times as long as usual because of train woes.\n\"There were only local trains, no express,\" Khan, 30, said as he hunched with an electric drill trying to fix the handle of his snow shovel inside the convenience store where he works.\nICY RESCUES\nA 3-foot (0.9-metre) tidal surge flooded the area around Boston's historic Long Wharf with icy seawater. Firefighters used an inflatable raft to rescue one motorist from a car submerged in water up to its door handles, Boston Fire Commissioner Joseph Finn told reporters.\nThe flooding tied a 40-year record, the National Weather Service said.\nBoston officials briefly thought they would need to a evacuate a shelter near the flooded areas, Walsh said.\nOfficials reported traffic accidents throughout the Northeast and the storm's reach extended to eastern Canada.\nOn Wednesday, the same storm brought historic cities in the Southeastern United States their heaviest snowfall in three decades.\n(Additional reporting by Colleen Jenkins in Winston-Salem, N.C., Brian Snyder in Boston, Brendan O'Brien in Milwaukee, Gina Cherelus and Scott DiSavino in New York and Alex Dobuzinskis in Los Angeles; Editing by Peter Cooney and Leslie Adler)", "external_links": [], "published": "2018-01-05T03:15:00.000+02:00", "crawled": "2018-01-05T06:33:43.007+02:00", "highlightTitle": ""}