{"organizations": [], "uuid": "abce6c333876c7410ecc122a52dc1c8277879fed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180118.html", "section_title": "Archive News &amp; Video for Thursday, 18 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/qatar-natl-bank-outlook/qatar-national-banks-loan-growth-seen-slipping-to-7-9-pct-in-2018-analysts-idUSL8N1PD1Y7", "country": "US", "domain_rank": 408, "title": "Qatar National Bank's loan growth seen slipping to 7-9 pct in 2018 -analysts", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-18T18:19:00.000+02:00", "replies_count": 0, "uuid": "abce6c333876c7410ecc122a52dc1c8277879fed"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/qatar-natl-bank-outlook/qatar-national-banks-loan-growth-seen-slipping-to-7-9-pct-in-2018-analysts-idUSL8N1PD1Y7", "ord_in_thread": 0, "title": "Qatar National Bank's loan growth seen slipping to 7-9 pct in 2018 -analysts", "locations": [], "entities": {"persons": [], "locations": [{"name": "dubai", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "gulf", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "qatar national bank", "sentiment": "negative"}, {"name": "qnb", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DUBAI, Jan 18 (Reuters) - Qatar National Bank’s (QNB) loan growth is expected to fall back to between 7 and 9 percent in 2018, analysts said after an investor relations conference call with executives of the Middle East’s largest lender.\nThe analysts speculated that the drop in lending growth, from around 12 percent in 2017, would likely be because of a fall in state spending on new projects in the Gulf state.\nQNB is the top lender to the public sector and has for years benefitted from government spending on infrastructure, including preparations for the soccer World Cup in 2022. QNB estimates around $177.4 billion of projects will be delivered across oil and gas, transport and construction between 2018 and 2028.\nBut the government is projected to grow total spending only slightly in 2018, it announced in its budget plan last month.\nQNB, which earlier this week announced 6 percent growth in annual profit, is forecasting profit growth of between 6 and 7 percent in 2018, the analysts said after the call.\nA QNB spokesman declined to comment, saying information discussed on the call was not for media circulation.\nQatar’s economy has largely recovered from a boycott imposed by other Arab states in June 2017 and is again growing at one of the fastest rates in the region. But the small size of the domestic economy means Qatari companies have increasingly been looking at expanding their footprints abroad.\nQNB, the largest lender in the Middle East and Africa by assets, in 2016 completed the takeover of Turkey’s Finansbank and also owns a business in Egypt and a 23.5 percent stake in pan-African lender Ecobank International.\nThe bank will not change its growth strategy and will continue to assess opportunities as they arise, the analysts said, citing the executives.\nThe bank’s board recommended a cash dividend of 6 riyals per share for 2017, up from the proposal for the previous year of 3.5 riyals per share plus a bonus share dividend which would award one free share for every 10 shares currently owned.\nThe reason for the dividend hike was to reward investors who stayed with the bank after the boycott, the analysts said. (Additional reporting by Saeed Azhar; Editing by Andrew Torchia)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T18:19:00.000+02:00", "crawled": "2018-01-19T12:28:55.004+02:00", "highlightTitle": ""}