{"organizations": [], "uuid": "52108117be24213bccb8deb0fc50c17862c70433", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/globe-newswire-guard-dog-inc-otc-grdo-announces-new-management-team.html", "country": "US", "domain_rank": 767, "title": "Guard Dog Inc (OTC: GRDO) Announces New Management Team", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.025, "site_type": "news", "published": "2018-01-05T22:00:00.000+02:00", "replies_count": 0, "uuid": "52108117be24213bccb8deb0fc50c17862c70433"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/globe-newswire-guard-dog-inc-otc-grdo-announces-new-management-team.html", "ord_in_thread": 0, "title": "Guard Dog Inc (OTC: GRDO) Announces New Management Team", "locations": [], "entities": {"persons": [{"name": "bill schaefer", "sentiment": "none"}, {"name": "brian estrada", "sentiment": "none"}], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "park", "sentiment": "none"}, {"name": "nevada update", "sentiment": "none"}], "organizations": [{"name": "guard dog inc", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "guard dog, inc", "sentiment": "none"}, {"name": "grdo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WINTER PARK, Fla., Jan. 05, 2018 (GLOBE NEWSWIRE) -- via OTC PR WIRE -- Guard Dog, Inc. (OTC Pink:GRDO) announced today that Bill Schaefer is stepping down from his position as President and CEO of the Company simultaneously with the appointment of Brian Estrada as the new President and CEO of Guard Dog, Inc.\nImmediately, the Company intends to actively pursue adapting a policy of updating its corporate governance and reporting standards both of which are aimed at restoring and increasing shareholder confidence and value.\nAction items include but are not limited to the following:\nUpdate and bring current the Company’s status with the State of Nevada Update and bring current the Company’s financial reporting and disclosure status Open up new communications channels in which to provide shareholders timely, relevant and regular Company communications Assemble a fresh, dynamic and innovative team of professionals on which to grow Company and shareholder value\n“There are many GRDO shareholders that have been with the Company for an extended period of time, we greatly value those shareholders and their commitment to the Company. Shareholders are a great asset and the foundational building block on which the Company is formed. The Company intends to build upon that foundational shareholder block in an effort to provide rewards for shareholders, clients and all involved with the Company. We look forward to providing additional Company updates in the near term,” stated Brian Estrada, President of Guard Dog Inc.\nGuard Dog Inc. has opened a new twitter channel, the Company’s only official Twitter Channel is located at @GRDO411. Follow us Twitter: @GRDO411\nThe Company’s has registered a new domain name on which to build a corporate website. The new corporate website, which has yet to be constructed, will be located at http://www.guarddogGRDO.com\nAbout Guard Dog, Inc.\nGuard Dog, Inc. is a publicly traded company (OTC PINK:GRDO).\nForward-Looking Statements Certain statements in this news release may contain forward-looking information within the meaning of Rule 175 under the Securities Act of 1933 and Rule 3b-6 under the Securities Exchange Act of 1934, and are subject to the safe harbor created by those rules. All statements, other than statements of fact, included in this release, including, without limitation, statements regarding potential future plans and objectives of the company, are forward-looking statements that involve risks and uncertainties. There can be no assurance that such statements will prove to be accurate and actual results and future events could differ materially from those anticipated in such statements. Technical complications, which may arise, could prevent the prompt implementation of any strategically significant plan(s) outlined above. The Company undertakes no duty to revise or update any forward- looking statements to reflect events or circumstances after the date of this release.\nWebsite: http://www.guarddogGRDO.com\nEmail: info@guarddogGRDO.com\nSource:Guard Dog, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=YHZv-GioqzrMA1pCd43v1qCuxAj3llqdBx9MZ6-LsS9AjrmsMP-6vQ7-yTnYPQzNUpPtLNAt75lV2yCXdQs1mCAZ7_zwHIgB2X2hi9xdFrQ=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/5e180321-eaf5-44b9-a100-4a418be9ba0f"], "published": "2018-01-05T22:00:00.000+02:00", "crawled": "2018-01-05T23:24:45.005+02:00", "highlightTitle": ""}