{"organizations": [], "uuid": "af4af2b76bdd5d4a91e9af9c7109a7697bbe2f18", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 47, "shares": 47, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/africa", "section_title": "Reuters.com | Africa", "url": "https://www.reuters.com/article/us-somaliland-rape-law/for-the-first-time-rapists-may-face-30-years-in-jail-in-somaliland-idUSKBN1EZ1Z7", "country": "US", "domain_rank": 408, "title": "For the first time, rapists may face 30 years in jail in Somaliland", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.178, "site_type": "news", "published": "2018-01-10T23:26:00.000+02:00", "replies_count": 0, "uuid": "af4af2b76bdd5d4a91e9af9c7109a7697bbe2f18"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-somaliland-rape-law/for-the-first-time-rapists-may-face-30-years-in-jail-in-somaliland-idUSKBN1EZ1Z7", "ord_in_thread": 0, "title": "For the first time, rapists may face 30 years in jail in Somaliland", "locations": [], "entities": {"persons": [{"name": "ayan mahamoud", "sentiment": "none"}, {"name": "mahamoud", "sentiment": "none"}], "locations": [{"name": "somaliland nairobi", "sentiment": "none"}, {"name": "somaliland", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "horn of africa", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "house of elders", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NAIROBI (Thomson Reuters Foundation) - Somaliland has passed its first law against rape, in a bid by the new government of the breakaway region to crack down on violence against women, a senior official said on Wednesday.\nRape is not a criminal offense and perpetrators do not face any penalty in the self-declared republic of Somaliland, a conservative Islamic region in the Horn of Africa.\nInstead, victims’ families are paid off or they are forced to marry their rapists to avoid public shame. The new law will punish rapists with up to 30 years imprisonment.\nAyan Mahamoud, Somaliland’s representative in Britain, said the law passed by the lower house of parliament on Monday still needed approval from the more conservative upper house.\n“The bill had been languishing for some years and the newly elected government, which is very serious about tackling violence against women, saw it as a priority to bring it before parliament,” Mahamoud told the Thomson Reuters Foundation.\n“It is however possible that it will face resistance when it comes before the House of Elders in the coming weeks, as members in the upper house tend to be more traditional.”\nSomaliland - with a population of about 4 million - declared independence from Somalia in 1991 following a bloody civil war, but is not internationally recognized as a country. Somalia does not have any legislation against sexual violence.\nMahamoud said President Musa Bihi Abdi’s government, which came to power in November, was shocked by reports of gang rape and wanted to take action against it.\nHe refuted claims the move was part of a strategy to show Somaliland as a functioning democracy with the aim of gaining recognition on the global stage.\nThe United Nations hailed the law as a milestone, but said much more needed to be done.\n“Once it is signed into law, there is need to develop the capacities of the national justice and security actors, non-state actors and service providers and to create awareness among the public,” said Fadumo Dayib, head of UN Women in Somalia.\n“Every woman and girl has the right to live her life without the threat and fear of violence. This law will make a substantial contribution in curtailing sexual violence against women and girls.”\nReporting by Nita Bhalla @nitabhalla, Editing by Katy Migiro. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-10T23:26:00.000+02:00", "crawled": "2018-01-11T03:49:27.003+02:00", "highlightTitle": ""}