{"organizations": [], "uuid": "a8a2f1b50ba0073fc907b5890a220d9bf838ef71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218838147&w=1200&r=LYNXMPEE010QE", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-uganda-polititcs/ugandas-museveni-signs-law-removing-age-cap-for-president-idUKKBN1ER1BO", "country": "US", "domain_rank": 408, "title": "Uganda's Museveni signs law removing age cap for president", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T18:01:00.000+02:00", "replies_count": 0, "uuid": "a8a2f1b50ba0073fc907b5890a220d9bf838ef71"}, "author": "", "url": "https://uk.reuters.com/article/uk-uganda-polititcs/ugandas-museveni-signs-law-removing-age-cap-for-president-idUKKBN1ER1BO", "ord_in_thread": 0, "title": "Uganda's Museveni signs law removing age cap for president", "locations": [], "entities": {"persons": [{"name": "museveni", "sentiment": "negative"}, {"name": "yoweri museveni", "sentiment": "none"}, {"name": "elias biryabarema", "sentiment": "none"}], "locations": [{"name": "uganda", "sentiment": "none"}, {"name": "kampala", "sentiment": "none"}], "organizations": [{"name": "national resistance movement", "sentiment": "none"}, {"name": "nrm", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  kampala", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 3:54 PM / Updated 24 minutes ago Uganda's Museveni signs law removing age cap for president Elias Biryabarema 3 Min Read \nKAMPALA (Reuters) - Uganda’s President Yoweri Museveni has signed a law that scraps a 75-year age cap for presidential candidates, a spokesman for parliament said on Tuesday, a move critics say will allow him to remain in power indefinitely. FILE PHOTO: Uganda's President and ruling party National Resistance Movement (NRM) presidential candidate Yoweri Museveni speaks during a campaign rally in capital Kampala February 11, 2016 ahead of the February 18 presidential election. REUTERS/James Akena/File Photo \nMuseveni, 73, has ruled Uganda for 31 years and could now stand again in the next election, due in 2021, despite increased public anger over corruption, human rights violations and poor social services. \nParliament, controlled by Museveni’s ruling National Resistance Movement (NRM), approved the constitutional amendment on Dec. 22 amid heavy security deployments across the capital Kampala and outside parliament. \n“It has been signed into law,” spokesman Chris Obore said, adding that the president had done so on Dec. 27. \nMuseveni’s move quickly drew criticism from his political opponents, religious leaders, human rights activists and even some members of the ruling party. \nProtests in September by opposition activists against the proposed amendment were quickly put down with detentions, teargas and beatings. At least two people were killed. \nSome legislators opposed to the law tried unsuccessfully at various stages to filibuster it and some were suspended from proceedings. During the final debate on the amendment last month, some lawmakers scuffled with police. \nMuseveni is the latest of a growing list of African leaders who have either changed the law or used other tactics to thwart opponents and hold onto power long after their tenure has ended. \nIn Burundi, Democratic Republic of Congo and South Sudan, such moves have provoked instability. \nLast month’s vote by parliament was the second time the Ugandan legislature has amended the constitution to allow Museveni to stay in power. In 2005 they voted to remove a limit of two five-year terms, which had blocked him from standing again. \nDespite the growing cries of autocracy against Museveni, Washington has backed him as a strongman who has turned Uganda into a bulwark of stability in Africa’s troubled Great Lakes region. \nThe landlocked East African country is eyeing commencement of crude production in 2020 and the construction of a pipeline to export it via neighbouring Tanzania is underway. Reporting by Elias Biryabarema; Editing by Maggie Fick and Gareth Jones", "external_links": [], "published": "2018-01-02T18:01:00.000+02:00", "crawled": "2018-01-02T18:21:58.017+02:00", "highlightTitle": ""}