{"organizations": [], "uuid": "a6afed82395ddd56d2f5576f861788328d3cd067", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/carpetright-outlook/update-1-uks-carpetright-warns-on-profit-blames-reduced-consumer-confidence-idUSL8N1PE0Y2", "country": "US", "domain_rank": 408, "title": "UPDATE 3-Weak start to 2018 floors UK retailer Carpetright", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.021, "site_type": "news", "published": "2018-01-19T15:50:00.000+02:00", "replies_count": 0, "uuid": "a6afed82395ddd56d2f5576f861788328d3cd067"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/carpetright-outlook/update-1-uks-carpetright-warns-on-profit-blames-reduced-consumer-confidence-idUSL8N1PE0Y2", "ord_in_thread": 0, "title": "UPDATE 3-Weak start to 2018 floors UK retailer Carpetright", "locations": [], "entities": {"persons": [{"name": "james davey", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "carpetright", "sentiment": "negative"}, {"name": "dignity", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Slashes full-year profit guidance\n* Blames post-Christmas drop in UK consumer confidence\n* Company seen as leading economic indicator\n* Underlying UK sales down 3.6 pct in 11 weeks to Jan. 13\n* Shares slump as much as 48 pct (Repeats to link to pictures. Adds detail, analyst comment, updates shares)\nBy James Davey\nLONDON, Jan 19 (Reuters) - Britain’s biggest floor coverings retailer Carpetright lost almost half of its stock market value on Friday after it warned on full-year profit, blaming a post-Christmas drop in sales on waning consumer confidence.\nWith official data confirming 2017 as the weakest year for UK retail since 2013, Carpetright’s profit alert will stoke fears Britons have further reined-in spending on big ticket items at the start of 2018.\nShares in British funeral services company Dignity also halved in value on Friday after it issued a profit warning and said customers were becoming “increasingly price-conscious.”\nCarpetright’s fortunes are closely tied to the strength of the UK housing market and it is regarded by analysts as a lead indicator on the health of the economy, historically being “first in, first out” of a recession.\nFriday’s profit warning, the second in two months, knocked as much as 54 million pounds ($75 million) off the retailer’s market value.\nCompany trading updates, surveys and data this month have shown Britons, under pressure from slow wage growth and higher inflation since the 2016 vote to leave the European Union, cut back on almost everything other than food purchases in the run-up to Christmas.\nOfficial figures published on Friday showed British shop sales slid by much more than expected in December.\nCarpetright highlighted a sharp deterioration in trading in the important post-Christmas period, with sales significantly behind expectations.\n“The number of customer transactions since Christmas was sharply down, which we believe is indicative of reduced consumer confidence,” said Chief Executive Wilf Walsh.\nBIG TICKET MARKET Walsh had bought 31,250 Carpetright shares at 160 pence on Jan. 5.\nBut the shares tumbled as much as 48 percent in early trade on Friday and at 1115 GMT were down 43 percent at 92.5 pence, with the profit warning also felt across the retail sector.\nShares in DFS Furniture were down 3.7 percent, home improvement retailer Kingfisher fell 3.8 percent, and electricals groups Dixons Carphone lost 2.5 percent.\nCarpetright, which trades from 416 UK stores and also sells beds, said like-for-like sales in its home market fell 3.6 percent in the 11 weeks to Jan. 13.\nIn the key post Christmas period like-for-like sales in the core flooring category slumped 7.1 percent.\n“Footfall is down, which is likely to have an impact on the wider big ticket market, most notably upholstery,” said Peel Hunt analysts, who cut their stock rating to “hold” from “buy”.\nTrading in Carpetright’s Rest of Europe division, comprising the Netherlands, Belgium and Ireland, was “volatile”, though it said like-for-like sales rose 4.3 percent over the 11 weeks.\nCarpetright cut its 2017-18 full-year underlying pretax profit guidance to 2-6 million pounds ($2.8-$8.3 million). Analysts’ consensus forecast had been for 14.1 million pounds, compared with the 14.4 million pounds delivered in 2016-17.\n$1 = 0.7179 pounds Editing by David Goodman and Mark Potter\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T15:50:00.000+02:00", "crawled": "2018-01-20T17:48:03.030+02:00", "highlightTitle": ""}