{"organizations": [], "uuid": "3b21457df3a35577c30a7d59f76d3746252fbf33", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223087181&w=1200&r=LYNXMPEE0H1IH", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-philippines-media/philippine-investigators-summon-boss-of-news-site-derided-by-duterte-idUKKBN1F72HD", "country": "US", "domain_rank": 408, "title": "Philippine investigators summon boss of news site derided by Duterte", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T19:20:00.000+02:00", "replies_count": 0, "uuid": "3b21457df3a35577c30a7d59f76d3746252fbf33"}, "author": "", "url": "https://uk.reuters.com/article/uk-philippines-media/philippine-investigators-summon-boss-of-news-site-derided-by-duterte-idUKKBN1F72HD", "ord_in_thread": 0, "title": "Philippine investigators summon boss of news site derided by Duterte", "locations": [], "entities": {"persons": [{"name": "duterte", "sentiment": "none"}, {"name": "rappler", "sentiment": "none"}, {"name": "rodrigo duterte", "sentiment": "none"}], "locations": [{"name": "manila", "sentiment": "none"}, {"name": "rappler", "sentiment": "none"}], "organizations": [{"name": "duterte reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 5:24 PM / Updated 3 hours ago Philippine investigators summon boss of news site derided by Duterte Reuters Staff 3 Min Read \nMANILA (Reuters) - A Philippine law enforcement agency has summoned the head of Rappler, a news site known for challenging President Rodrigo Duterte, to answer a complaint related to cyber crime, adding to problems for an outlet central to a row over press freedom. \nThe country’s corporate regulator last week revoked the site’s operating licence for violating the constitution’s restrictions on foreign ownership of media, while the justice minister on Wednesday ordered an investigation into Rappler’s possible criminal liability. \nKnown for its investigative reporting, Rappler has repeatedly drawn the ire of the volatile Duterte, who on Tuesday called it a “fake news outlet”, but he denied influencing the regulator, or going after journalists. \nRappler is permitted to operate pending an appeal. It denies violating the constitution and has accused the Duterte administration of harassment. \nOn Thursday, Rappler confirmed it had received a subpoena by the National Bureau of Investigation (NBI), a copy of which seen by Reuters, ordering its chief executive Maria Ressa, one of the site’s investors, and one of its former journalists to appear at the NBI offices on Monday to “give your side in a certain investigation”. \nRappler Managing Editor Glenda Gloria told Reuters the subpoena, dated Jan. 10, was received only on Thursday afternoon, eight days after the date of issue. A guard opens a door at the office of Rappler in Pasig, Metro Manila, Philippines January 15, 2018. REUTERS/Dondi Tawatao \nThe subpoenas were based on a complaint from a businessman who featured in a Rappler story in 2012. Neither the nature of the complaint, nor the date in which it was filed, were stated in the subpoena. \nMedia and human rights groups have expressed alarm at what they say is an attempt by the Duterte administration to intimidate the media. Illustration of the Rappler website January 16, 2018. REUTERS/Thomas White/Illustration \nThe government denies it is cracking down on journalists, and says Rappler broke the law by granting an American investor the power to have a say in its operations. Rappler insists that is not the case. \nRappler’s reporting has included close scrutiny of Duterte’s deadly war on drugs and a series of investigative reports into what it says is his government’s strategy to “weaponise” the internet, using bloggers on its payroll to stir up anger among online supporters who threaten and discredit Duterte’s critics. \nThe government denies that. \nJustice Secretary Vitaliano Aguirre on Thursday defended his decision to order probes into Rappler. \n“Rappler should welcome this investigation so that it will have the chance to prove the innocence it claims to have,” he said in a statement, responding to what Rappler calling that investigation a “fishing expedition”. Reporting by Manuel Mogato and Martin Petty; Editing by Alison Williams", "external_links": [], "published": "2018-01-18T19:20:00.000+02:00", "crawled": "2018-01-18T19:44:56.005+02:00", "highlightTitle": ""}