{"organizations": [], "uuid": "1b81af76b15403607330dc48ed43eaa1794aab47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/business-wire-wisercare-appoints-daniel-j-castillo-md-mba-as-chief-executive-officer.html", "country": "US", "domain_rank": 767, "title": "WiserCare Appoints Daniel J. Castillo, MD, MBA as Chief Executive Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T17:44:00.000+02:00", "replies_count": 0, "uuid": "1b81af76b15403607330dc48ed43eaa1794aab47"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/business-wire-wisercare-appoints-daniel-j-castillo-md-mba-as-chief-executive-officer.html", "ord_in_thread": 0, "title": "WiserCare Appoints Daniel J. Castillo, MD, MBA as Chief Executive Officer", "locations": [], "entities": {"persons": [{"name": "daniel j. castillo", "sentiment": "negative"}, {"name": "castillo", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "evanston", "sentiment": "none"}, {"name": "illinois", "sentiment": "none"}], "organizations": [{"name": "envision healthcare", "sentiment": "none"}, {"name": "northshore university health system", "sentiment": "none"}, {"name": "joint commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES--(BUSINESS WIRE)-- WiserCare , a leading digital patient decision support platform, announced today the appointment of Daniel J. Castillo, MD, MBA, as the company’s CEO. Dr. Castillo joins WiserCare after spending three years as the Chief Strategy Officer at Evolution Health, a division of Envision Healthcare, and prior to that, as National Medical Director of Healthcare Quality Evaluation at the Joint Commission. Dr. Castillo is also a practicing emergency physician, currently at NorthShore University Health System in Evanston, Illinois.\nWiserCare’s patient decision support solution helps patients and their families express their values and preferences, review personalized risks and benefits of treatment options, prepare for meetings with clinicians and make personal healthcare decisions. It helps clinicians better understand their patients’ goals and preferences, enabling them to have more productive and satisfying visits. WiserCare’s platform covers the entire patient journey, from primary and specialty care to advance care planning, and has improved financial and clinical outcomes with health systems nationwide. In addition, researchers using WiserCare have submitted nearly two dozen abstracts and presentations.\n“WiserCare’s ability to drive clinical and financial results for all actors through better treatment decisions made this opportunity particularly compelling for me,” said Dr. Castillo. “As a practicing physician, I’ve seen many well-intentioned products that don’t scale in clinical practice. WiserCare is a rare find – designed to work for patients and for physicians, reflecting the way we actually practice.”\nDr. Castillo joins WiserCare at a time of significant momentum. Last month, the company announced a strategic relationship with Elsevier, which now offers WiserCare as part of its Patient Engagement Suite of solutions. “WiserCare has built significant traction in the market, as patient goals and preferences have emerged as a critical – and often deciding – factor to consider when making treatment decisions,” said Ted Meisel, WiserCare’s co-founder and executive chairman. “As we work with key leaders at health systems, health plans and other solutions companies to increase access to the personalized guidance that WiserCare provides, Daniel’s strong network, deep expertise in population health and quality, and experience in driving growth will prove instrumental to our continued success.”\nAbout WiserCare\nWiserCare’s patient decision support platform uses a patented intelligent agent to analyze a patient's clinical situation, goals, preferences and barriers to provide personalized, evidence-based guidance on what treatments fit best. This equips patients and physicians with new insight in advance of the visit, and helps them make smarter, more confident decisions in less time. The company works with health systems across the U.S. to improve clinical and financial outcomes by increasing the quality of treatment decisions at scale.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180117005896/en/\nWiserCare\nLaurie Smith\nVice President, Marketing and Business Development\n310.625.6688\nlauriesmith@wisercare.com\nSource: WiserCare", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.globenewswire.com%2FTracker%3Fdata%3D8tIubbgILLTJ4dCG3ju60FrwPQlV1doLLREII9_TRB11GD2GePlIBcTQiJdT3SVL-AAlrjBO5NG8sU3pjq9r_A%3D%3D&esheet=51744584&newsitemid=20180117005896&lan=en-US&anchor=WiserCare&index=1&md5=cee06f9bd8613b3a18d2e2faa13340ab", "http://www.businesswire.com/news/home/20180117005896/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.wisercare.com%2F&esheet=51744584&newsitemid=20180117005896&lan=en-US&anchor=WiserCare%27s+patient+decision+support+platform&index=2&md5=80402485c742a57016d36523d6e6baf8"], "published": "2018-01-17T17:44:00.000+02:00", "crawled": "2018-01-17T19:18:15.011+02:00", "highlightTitle": ""}