{"organizations": [], "uuid": "1f21a0e53e32297dba6fbb48a7a45d5e678ccd0c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-shareholder-group-calls-on-avon-products-board-to-explore-the-sale-of-the-company.html", "country": "US", "domain_rank": 767, "title": "Shareholder Group Calls On Avon Products Board To Explore The Sale Of The Company", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T15:30:00.000+02:00", "replies_count": 0, "uuid": "1f21a0e53e32297dba6fbb48a7a45d5e678ccd0c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-shareholder-group-calls-on-avon-products-board-to-explore-the-sale-of-the-company.html", "ord_in_thread": 0, "title": "Shareholder Group Calls On Avon Products Board To Explore The Sale Of The Company", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "avon", "sentiment": "none"}], "organizations": [{"name": "avon products board", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "avon products, inc.", "sentiment": "neutral"}, {"name": "barington capital group", "sentiment": "none"}, {"name": "nuorion partners", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "board", "sentiment": "none"}, {"name": "shareholder group", "sentiment": "none"}, {"name": "shah capital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 29, 2018 /PRNewswire/ -- A group of shareholders of Avon Products, Inc. (NYSE: AVP) led by Shah Capital, Barington Capital Group, L.P., and NuOrion Partners that collectively beneficially owns approximately 3.5% of the outstanding common stock of the Company (the \"Shareholder Group\"), announced today that it has sent a letter to the Board of Directors of Avon calling on the Board to promptly retain a financial advisor to explore all strategic alternatives to maximize shareholder value, including a sale of the Company in whole or in parts.\nThe Shareholder Group is extremely disappointed with the deteriorating operating and share price performance that has occurred under the stewardship of the current Board. The Shareholder Group is also dismayed by the Board's failure to act quickly and decisively on the past recommendations its members have made to improve the long-term performance of the Company, including promptly hiring a new chief executive officer – a step that has been long overdue and members of the Shareholder Group recommended over two years ago.\nAs a result, the Shareholder Group has lost confidence in the ability of Avon's current Board to create meaningful long-term value for its public shareholders, and sees no reason why shareholders should continue to wait for a turnaround from a Board that has overseen a tremendous destruction of shareholder value. The Shareholder Group therefore believes that the best course of action is for the Board to retain a financial advisor to explore the sale of the Company.\nThe Shareholder Group believes that Avon would be highly attractive to a range of buyers due to its many positive attributes, including its well-known 130-year old brand; its vast product offering generating over $5.7 billion in sales; its strong market positions in developing countries such as Brazil, Russia and Mexico; its owned manufacturing operations; and its six million direct sales representatives. In addition, a multinational acquirer would immediately benefit from its ability to improve Avon's capital structure and the tax efficiency of its operations. The Shareholder Group is convinced that a better capitalized strategic buyer would do a much better job of unlocking Avon's tremendous value potential than the Company's current Board.\nThe full text of the Shareholder Group's letter is available for viewing at the following link: www.Barington.com/Avon.html\nAbout Shah Capital\nShah Capital is a global investment firm focusing primarily on deep value, turn-around, and special situations. The firm launched its flagship investment vehicle, Shah Capital Opportunity Fund, in 2006, which incorporated its philosophy of spotting trends early, acting with speed, and maintaining strict discipline, all built on a foundation of deep fundamental research.\nAbout Barington Capital Group, L.P.\nBarington Capital Group, L.P. is a fundamental, value-oriented activist investment firm that was established by James A. Mitarotonda in January 2000. Barington invests in undervalued publicly traded companies that Barington believes can appreciate significantly in value as a result of a change in corporate strategy or improvements in operations, capital allocation or corporate governance. Barington's investment team, advisors and network of industry experts draw upon their extensive strategic, operating and boardroom experience to assist companies in designing and implementing initiatives to improve long-term shareholder value. Barington has significant experience investing in consumer-focused companies, with prior investments in companies such as The Children's Place, Darden Restaurants, Dillard's, The Jones Group, Warnaco, Lone Star Steakhouse, Nautica, The Pep Boys and Steven Madden.\nAbout NuOrion Partners\nNuOrion Partners is a private investment firm that makes direct investments in undervalued corporate fallen angels that can regain their economic strength. NuOrion has an active industrial approach to investing, built on management-centric investment partnerships.\nImportant Disclosures\nAny views expressed in the letter represent the opinion of the members of the Shareholder Group, whose analysis is based solely on publicly available information. No representation or warranty, express or implied, is made as to the accuracy or completeness of any information contained therein. The members of the Shareholder Group expressly disclaim any and all liability based, in whole or in part, on such information, any errors therein or omissions therefrom. The Shareholder Group also reserves the right to modify or change its views or conclusions at any time in the future without notice.\nThe information contained in the letter does not recommend the purchase or sale of any security nor is it an offer to sell or a solicitation of an offer to buy any security. Furthermore, the information contained in the letter is not intended to be, nor should it be construed or used as, investment, tax or legal advice. No representation or warranty is made that the Shareholder Group's investment process or investment objectives will or are likely to be achieved or successful or that the Shareholder Group's investments will make any profit or will not sustain losses. Past performance is not indicative of future results.\nNothing contained in the letter should be taken as any form of commitment on the part of the Shareholder Group or any member thereof to take any action in connection with any particular security. The members of the Shareholder Group and their affiliates are in the business of buying and selling securities. They have, and may in the future, buy, sell or change the form of their position in any security for any or no reason whatsoever.\nMEDIA CONTACT :\nNathaniel Garnick/Amanda Klein\nGasthalter & Co.\n(212) 257-4170\nng@gasthalter.com\nak@gasthalter.com\nView original content: http://www.prnewswire.com/news-releases/shareholder-group-calls-on-avon-products-board-to-explore-the-sale-of-the-company-300589330.html\nSOURCE Barington Capital Group, L.P.", "external_links": ["http://www.barington.com/avon.html", "http://www.prnewswire.com/news-releases/shareholder-group-calls-on-avon-products-board-to-explore-the-sale-of-the-company-300589330.html"], "published": "2018-01-29T15:30:00.000+02:00", "crawled": "2018-01-29T16:36:42.115+02:00", "highlightTitle": ""}