{"organizations": [], "uuid": "193abf0bec1171fbb15789bd0ad8f85add8ab0f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/eurozone-banks-npls/update-1-eu-says-banks-bad-loan-woes-ease-but-they-need-capital-buffer-hikes-idUSL8N1PD2YM", "country": "US", "domain_rank": 408, "title": "UPDATE 1-EU says banks' bad loan woes ease but they need capital buffer hikes", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T14:31:00.000+02:00", "replies_count": 0, "uuid": "193abf0bec1171fbb15789bd0ad8f85add8ab0f7"}, "author": "", "url": "https://www.reuters.com/article/eurozone-banks-npls/update-1-eu-says-banks-bad-loan-woes-ease-but-they-need-capital-buffer-hikes-idUSL8N1PD2YM", "ord_in_thread": 0, "title": "UPDATE 1-EU says banks' bad loan woes ease but they need capital buffer hikes", "locations": [], "entities": {"persons": [{"name": "francesco guarascio", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european central bank", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 12:33 PM / in 29 minutes UPDATE 1-EU says banks' bad loan woes ease but they need capital buffer hikes Reuters Staff \n(adds banks’ reactions, details, context) \nBy Francesco Guarascio \nBRUSSELS, Jan 18 (Reuters) - There are fewer bad loans on the balance sheets of European banks but they remain high, the European Commission said on Thursday as it prepares to push through measures to force higher provisioning for soured debt despite the opposition of big lenders. \nThe 2008-2009 global financial crisis left European banks saddled with piles of non-performing loans (NPLs) which they struggled to recoup from distressed firms and households. \nBut as the bloc’s economy recovers, the amount of bad debt is slowly receding, the European Commission said in a report. \nUsing data from the European Central Bank, the EU executive said NPLs accounted for 4.6 percent of banks’ total loans in the period between April and June, a 1 percentage point drop from a year earlier. \nDespite the trend, bad loans were still worth 950 billion euros ($1.16 trillion) in the 28 EU countries and accounted for 5.4 percent of total loans in the euro zone, the European 19-country currency area. \nThey are also unevenly spread across the bloc, with Greece having nearly half of all loans classified as NPLs, while in Germany and the Netherlands they account for less than 3 percent. \nTo tackle the problem, the Commission is planning new legislative measures in March, to speed up banks’ unloading of bad debts and to prevent a future build-up of NPLs. \nAn overhaul of insolvency rules and a strengthening of the secondary market for bad loans are among the measures planned to reduce the existing stock of soured debt. BUFFERS \nAgainst a future growth of NPLs, the Commission plans to introduce “statutory prudential backstops to prevent the risk of under-provisioning of NPLs,” the Commission said in a document, stressing that this would apply only to “newly originated loans that later turn non-performing”. \nThe move clarifies the Commission’s intentions. It had previously said legislative measures on buffers were possible but not certain. \nBanks have long opposed new capital buffers, fearing this could reduce their lending capacity and increase costs. \nSpecific measures for banks with higher exposures would be enough to address the problem of NPLs rather than a “blunt one-size-fits-all approach,” Simon Lewis, Chief Executive at AFME, a lobbying group for large financial companies said. \nThe Commission will still need to decide what could constitute a new loan and when the requirements would apply, EU officials said. \nThere is still debate on whether new loans should include restructured debt and new payments of instalments on old loans. \nThe cut-off date for new loans is also under discussion, the commission’s vice-president Valdis Dombrovskis told a news conference. \nThe Commission is considering four options: last November; the date of publication of the new proposals, likely to be in March; the date of the entry into force of the new measures, which could be two years away; or an even later date. \nDombrovskis stressed the new requirements will only apply to new loans, discarding concerns that this could set a benchmark that may later be imposed on the existing stock of bad debt. \nItaly, one of the EU countries with the highest level of bad loans, has long called for a gradual reduction of NPLs to avoid fire sales that would leave huge holes in banks’ balance sheets. \nOther states, led by Germany, have called for a faster offloading of bad loans to reduce risks in the banking sector, which could lead to euro zone’s deeper financial integration. ($1 = 0.8177 euros) (Editing by Philip Blenkinsop and Matthew Mpoke Bigg)", "external_links": [], "published": "2018-01-18T14:31:00.000+02:00", "crawled": "2018-01-18T15:15:53.006+02:00", "highlightTitle": ""}