{"organizations": [], "uuid": "eccfe4d440a8e174230e7027f08933cdbb8932e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180130.html", "section_title": "Archive News &amp; Video for Tuesday, 30 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/navitas-ltd-results/update-1-australias-navitas-h1-profit-plunges-over-50-pct-shares-drop-idUSL4N1PO5XL", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Australia education firm Navitas' profit hit by college closures, U.S. policy", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.482, "site_type": "news", "published": "2018-01-30T08:32:00.000+02:00", "replies_count": 0, "uuid": "eccfe4d440a8e174230e7027f08933cdbb8932e7"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/navitas-ltd-results/update-1-australias-navitas-h1-profit-plunges-over-50-pct-shares-drop-idUSL4N1PO5XL", "ord_in_thread": 0, "title": "UPDATE 2-Australia education firm Navitas' profit hit by college closures, U.S. policy", "locations": [], "entities": {"persons": [{"name": "tom westbrook", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}], "organizations": [{"name": "navitas", "sentiment": "negative"}, {"name": "deutsche bank", "sentiment": "none"}, {"name": "navitas ltd", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Earnings hit by college closures, contract loss in Australia\n* Trump rhetoric hurts U.S. enrolments\n* Shares drop almost 10 percent to lowest since Nov. 3 (Recasts, adds Quote: s from CEO and analyst)\nBy Tom Westbrook\nSYDNEY, Jan 30 (Reuters) - Australian education provider Navitas Ltd’s first-half net profit halved, hit by college closures at home and a hard-line immigration policy in the United States that spooked student enrolments in the world’s largest education market.\nThe nation’s largest listed private education company, which provides English proficiency courses for foreign students, warned on Tuesday it now expects a “medium term” downturn in U.S. enrolments as students sign up to study elsewhere.\nThe downbeat outlook contrasts with past statements that promoted the United States as Navitas’ next growth leg. Its shares slumped almost 10 percent to a near three-month low.\nNet profit for the six-months ended Dec. 31 was A$24.7 million ($20 million), versus A$53.3 million a year ago. That was below a Deutsche Bank estimate of A$34.4 million.\n“I was expecting the company to go backwards before it moved forwards, but it was actually a little weaker than I had ,” said Philip Pepe, an analyst at stockbroker Blue Ocean Equities, who had expected A$36.4 million.\nNavitas’ revenue was down 4.6 percent to A$456.7 million and the company booked a one-off A$7.5 million charge after it cut the carrying value of its U.S. assets as a result of tax law changes there.\nIn Australia, earnings were hit by the loss of lucrative government contracts for teaching migrants English and the closure of two colleges, which although previously flagged bit deeper than the market anticipated.\nWith operations in Australia, North America and Britain, the West Australian-based company’s international footprint makes it vulnerable to changes in student visa regulations and currency volatility, which can quickly change a country’s attractiveness to foreign students.\nDuring the 2016 presidential race, U.S. President Donald Trump campaigned for “a total and complete shutdown” of Muslims entering the United States. Since his election tighter enforcement of immigration rules has lifted visa rejection rates for students and Navitas last year reported a 23 percent drop in enrolments.\n“The rhetoric from Trump has created a whole lot of uncertainly and people are a little bit more nervous about making a commitment,” Navitas’ Chief Executive Officer Rod Jones told Reuters in a phone interview.\nHe declined to quantify the drop in enrolments though U.S earnings fell A$6.9 million for the period. That was partially offset by a rise in Canadian earnings, though Navitas’ two colleges there are nearing capacity, so the scope for future enrolments is limited. ($1 = 1.2350 Australian dollars) (Reporting by Tom Westbrook in SYDNEY; Additional reporting by Rushil Dutta and Aaron Saldanha in BENGALURU; Editing by Himani Sarkar and Muralikumar Anantharaman)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T08:32:00.000+02:00", "crawled": "2018-01-31T16:15:36.009+02:00", "highlightTitle": ""}