{"organizations": [], "uuid": "9c2d01c7844a5acd064ce7739680e4d603f3a89d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-champion-completes-33-point-6m-deal-for-two-value-add-acquisitions-in-glendale.html", "country": "US", "domain_rank": 767, "title": "Champion Completes $33.6M Deal For Two Value-Add Acquisitions In Glendale", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T19:30:00.000+02:00", "replies_count": 0, "uuid": "9c2d01c7844a5acd064ce7739680e4d603f3a89d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-champion-completes-33-point-6m-deal-for-two-value-add-acquisitions-in-glendale.html", "ord_in_thread": 0, "title": "Champion Completes $33.6M Deal For Two Value-Add Acquisitions In Glendale", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES, Jan. 31, 2018 /PRNewswire/ -- Champion Real Estate Company (\"Champion\") recently completed the acquisition of two multifamily buildings for $33.6 million in the city of Glendale, California, which buildings are owned by a subsidiary of Champion, Champion Glendale Property, LLC. This purchase is an off-market acquisition that was negotiated simultaneously for the two buildings, totaling 104 market rate apartment units.\nThe two properties are located less than two miles apart. Princess Louise (\"Louise\") was built in 1970 with 42 units, and Windsor Real (\"Windsor\") was built in 1972 with 62 units. The properties include a large percentage of multi-bedroom units with an average size of 951 square feet.\nGlendale and the cities of Burbank and Pasadena comprise the Tri-Cities of the eastern San Fernando Valley/Western San Gabriel Valley. The Tri-Cities are highly sought-after locations with strong schools, clean and accessible community parks, renowned shopping and restaurants, as well as relative affordability in the Los Angeles metro area.\n\"The Glendale apartment market is largely bifurcated with the vast majority of units either being new construction or dated and untouched 1960's and 1970's product. With a comprehensive improvement plan, Louise and Windsor will provide an upgraded, clean and professionally managed living experience at a steep discount to the new construction,\" states Parker Champion, Executive Vice President.\n\"Providing larger-sized homes in an updated apartment community while maintaining affordability in such convenient and desirable locations will offer the Glendale community with more options to enjoy the desired lifestyle,\" comments Parker.\nChampion has over 30 years of experience in the multifamily market and previously completed similar value-add investment acquisitions including Villa Olive in Burbank, Casa Laguna in Los Angeles, Union Bay Apartments in Seattle, and Ancelle in Koreatown.\nLouise is located at 720 N Louise St and Windsor at 1377 E Windsor Rd.\nAbout Champion Real Estate Company\nChampion Real Estate Company (\"Champion\") was founded in 1987 by veteran investor, developer and CEO, Bob Champion. Based in West Los Angeles, Champion's strategy is to acquire infill properties in \"A\" locations within markets that are core, core adjacent or gentrifying to core and implement value accretive improvements.\nFor more information, visit www.ChampionRealEstateCompany.com .\nPress Contact:\nRebecca Binny\nC: (310) 334 9942\nrbinny@championdev.com\nView original content: http://www.prnewswire.com/news-releases/champion-completes-336m-deal-for-two-value-add-acquisitions-in-glendale-300590882.html\nSOURCE Champion Real Estate Company", "external_links": ["http://www.championrealestatecompany.com/", "http://www.prnewswire.com/news-releases/champion-completes-336m-deal-for-two-value-add-acquisitions-in-glendale-300590882.html"], "published": "2018-01-31T19:30:00.000+02:00", "crawled": "2018-01-31T20:34:27.000+02:00", "highlightTitle": ""}