{"organizations": [], "uuid": "34155f6e8e7ad56463cd64cb747884450b5c1623", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-fieldman-rolapp-associates-names-partner-anna-v-sarabian-to-vice-chair.html", "country": "US", "domain_rank": 767, "title": "Fieldman, Rolapp & Associates Names Partner Anna V. Sarabian To Vice Chair", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.958, "site_type": "news", "published": "2018-01-30T16:00:00.000+02:00", "replies_count": 0, "uuid": "34155f6e8e7ad56463cd64cb747884450b5c1623"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-fieldman-rolapp-associates-names-partner-anna-v-sarabian-to-vice-chair.html", "ord_in_thread": 0, "title": "Fieldman, Rolapp & Associates Names Partner Anna V. Sarabian To Vice Chair", "locations": [], "entities": {"persons": [{"name": "anna v. sarabian", "sentiment": "negative"}, {"name": "lora carpenter", "sentiment": "none"}, {"name": "fieldman", "sentiment": "none"}, {"name": "jason chung", "sentiment": "none"}, {"name": "anna", "sentiment": "none"}], "locations": [{"name": "calif.", "sentiment": "none"}, {"name": "irvine", "sentiment": "none"}], "organizations": [{"name": "fieldman, rolapp & associates", "sentiment": "neutral"}, {"name": "rolapp & associates", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "IRVINE, Calif., Jan 30, 2018 /PRNewswire/ -- Fieldman, Rolapp & Associates (\"FRA\"), a leading municipal advisory firm specializing in supporting cities, counties, water agencies, municipal utilities, special districts, school districts, and other complex industry sectors has promoted its partner, Anna V. Sarabian, to Vice Chair effective immediately. The firm also announces the promotions of Jason Chung to Vice President assisting the firm's school practice, and Lora Carpenter to Assistant Vice President for the firm's water practice.\n\"It is an honor to be named Fieldman, Rolapp & Associates' Vice Chair,\" said Anna V. Sarabian. \"Our firm will continue to provide innovative solutions for our clients to address the needs of their communities in 2018 and beyond. As municipal interest rates are expected to increase and changes from the recent passing of the tax bill are imminent, we are prepared to lead our clients through this important time of transition securely into the future.\"\nAnna is an integral part of Fieldman, Rolapp & Associates. She has been with the firm since 2003, contributing to its significant growth and success over the last fourteen years.\nThe firm has experienced a 71 percent increase in transactions from 2012 to 2017, with a 92 percent increase in Orange County-based transactions during that same time period.\nWith the help of Anna's leadership, the firm's city and special district practice has grown substantially and expanded geographically by increasing its client base in Northern California. Anna assisted the firm to complete assignments for several city clients including: Costa Mesa, Mission Viejo, Lake Forest, Los Angeles, Oakland, Santa Ana, Seal Beach, San Francisco and Tustin; special districts such as Hayward Area Recreation and Park District and East Bay Regional Park District; as well as water districts including Eastern Municipal Water District.\nIn her expanded role, Anna will continue to report to Fieldman, Rolapp & Associates CEO, Adam Bauer, supporting strategic initiatives and managing the firm.\n\"I am confident in Anna's ability to keep leading Fieldman, Rolapp & Associates towards a bright future as our partner and Vice Chair with an incredible leadership team including Jason Chung and Lora Carpenter who assist two of our vital practice areas,\" said Fieldman, Rolapp & Associates CEO, Adam Bauer. \"At our firm, we often talk about our values of Experience, Integrity and Service. Anna, Jason and Lora are the full package as they are role models of our E.I.S. values and are highly accomplished financial services professionals who embody our firm's commitment to serving clients with excellence.\"\nThe recent promotions are also examples of Fieldman, Rolapp & Associates commitment to providing an inclusive workplace culture that inspires its employees to grow into leadership. \"We will continue to support developing more leaders in our firm, and provide all of our employees with equal access to the tools and environment they need to thrive. I am proud that our firm represents the future of the financial services industry by celebrating and acknowledging the accomplishments and talent of great people who possess a drive for leading with excellence, integrity and service,\" continued Adam Bauer.\nABOUT FIELDMAN, ROLAPP & ASSOCIATES\nWith a 50-year legacy in providing independent financial advice and services to all levels of government and non-profits regarding intricate financing and investment activities, FRA is a trusted resource for financial services that are effective and practical. The firm has proven success supporting client with land-based, utility and school financings and other complex scenarios, and is continually expanding its support for water agencies, cities and counties, school districts, utilities and continuing disclosure/aftermarket services. FRA is a founding member of the National Association of Municipal Advisors (NAMA), the trade association which fosters standards and best practices for municipal financial advisors and is a Registered Municipal Advisor with the Securities and Exchange Commission (SEC) and the Municipal Securities Rulemaking Board (MSRB). Founded in 1966, FRA is headquartered in Irvine, California and maintains an office in Walnut Creek, Calif. For more information visit www.fieldman.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/fieldman-rolapp--associates-names-partner-anna-v-sarabian-to-vice-chair-300589936.html\nSOURCE Fieldman, Rolapp & Associates", "external_links": ["http://www.prnewswire.com/news-releases/fieldman-rolapp--associates-names-partner-anna-v-sarabian-to-vice-chair-300589936.html"], "published": "2018-01-30T16:00:00.000+02:00", "crawled": "2018-01-30T17:47:14.001+02:00", "highlightTitle": ""}