{"organizations": [], "uuid": "5c16b3a8f3bda7bf3a125d86e47a2cfefb21cd46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180118.html", "section_title": "Archive News &amp; Video for Thursday, 18 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/usa-healthcare-religion/update-1-u-s-government-creates-health-division-for-religious-freedom-idUSL1N1PD1IS", "country": "US", "domain_rank": 408, "title": "UPDATE 2-U.S. government creates health division for 'religious freedom'", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T01:57:00.000+02:00", "replies_count": 0, "uuid": "5c16b3a8f3bda7bf3a125d86e47a2cfefb21cd46"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-healthcare-religion/update-1-u-s-government-creates-health-division-for-religious-freedom-idUSL1N1PD1IS", "ord_in_thread": 0, "title": "UPDATE 2-U.S. government creates health division for 'religious freedom'", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "eric hargan", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "hhs", "sentiment": "none"}, {"name": "u.s. department of health and human services", "sentiment": "none"}, {"name": "office of civil rights", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds outside expert comments)\nBy Reuters Staff\n(Reuters) - The U.S. government is seeking to further protect the “conscience and religious freedom” of health workers whose beliefs prevent them from carrying out abortions and other procedures, in an effort likely to please conservative Christian activists and other supporters of President Donald Trump.\nThe U.S. Department of Health and Human Services said on Thursday it will create a division within its Office of Civil Rights to give it “the focus it needs to more vigorously and effectively enforce existing laws protecting the rights of conscience and religious freedom.”\nHealthcare workers, hospitals with religious affiliations, and medical students among others have been “bullied” by the federal government to provide these services despite existing laws on religious and conscience rights, the top HHS official said.\n“The federal government has hounded religious hospitals . . . forcing them to provide services that violate their consciences,” Acting HHS Secretary Eric Hargan said. “Medical students too have learned to do procedures that violate their consciences.”\nSome of the services at issue include abortion and euthanasia, according to HHS documents. Politico reported on Wednesday that the protections would extend to care for transgender patients seeking to transition.\nDemocrats criticized the move as a denial of healthcare for women and others, while legal and medical ethics experts said that such exemptions have legal limits and would be challenged in court.\nDemocratic Senator Patty Murray said in a statement she was “deeply troubled” by reports of the new division and that “any approach that would deny or delay health care to someone and jeopardize their well being for ideological reasons is unacceptable.”\nLEGAL AND ETHICAL QUESTIONS The division would enforce the legal protection and conduct compliance reviews, audits and other enforcement actions to ensure that health care providers are allowing workers with religious or moral objections to opt out.\nAs the division seeks to back exemptions, it is likely to face legal and ethical challenges.\n“There will be challenges to any step along the way for any expansion of religious exceptions,” said Marci Hamilton, a professor at the University of Pennsylvania. She said such challenges would be “pretty strong.”\nHamilton said that while courts had frequently upheld religious exemptions in recent years, they have recognized limits. For example, she said, courts have rejected a church’s bid to be exempt from federal marijuana laws, and a Pennsylvania order of nun’s effort to avoid eminent domain.\nProfessionals take an oath to serve people who are sick, Alta Charo, a professor of law and bioethics at the University of Wisconsin in Madison explained. They are also the only ones licensed to provide those services and must do so without discrimination, she said.\n“When the director of the office of civil rights is Quote: d as saying that ‘No physician should have to choose between helping a sick person or following their personal conscience,’ the director is simply wrong. That choice was made the moment they became physicians,” she said.\nIt is unclear how broad such exemptions could be.\nAsma Uddin, a fellow at the UCLA Burkle Center for International Relations and a Muslim, spoke at an HHS press conference about the need for protection against what she said was a variety of ways women are forced to violate their conscience.\nFor Muslim women, she said, this is an issue in respect to modesty, particularly as patients.\nTRUMP ORDER The creation of the division is in accordance with an executive order signed by Trump last May called “Promoting Free Speech and Religious Liberty.” The order was followed by new rules aimed at removing a legal mandate that health insurance provide contraception.\nSeveral proponents of the changes cited the Little Sisters of the Poor, an order of Roman Catholic nuns which runs care homes for the elderly, which had challenged a legal mandate under Obamacare, the common name for former President Barack Obama’s 2010 healthcare law.\nIn October, HHS introduced rules that would let businesses or non-profit organizations lodge religious or moral objections to obtain an exemption from that mandate that employers provide contraceptives coverage in health insurance with no co-payment.\nPlanned Parenthood said the move was the latest example of the Trump administration’s efforts to block women, transgender people and other communities from access to care.\nAmericans United for Life, a group that opposes abortion rights, said the HHS had taken a strong step forward to allow individuals and organization to exclude abortions or other services that violate their conscience.\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T01:57:00.000+02:00", "crawled": "2018-01-19T12:39:49.035+02:00", "highlightTitle": ""}