{"organizations": [], "uuid": "a8e36e0cbd0172f383d3a4d52eb2eedd02a1c0a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-epicor-announces-two-new-executive-leadership-appointments-to-take-company-through-next-phase-of-growth.html", "country": "US", "domain_rank": 767, "title": "Epicor Announces Two New Executive Leadership Appointments to Take Company through Next Phase of Growth", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-23T19:21:00.000+02:00", "replies_count": 0, "uuid": "a8e36e0cbd0172f383d3a4d52eb2eedd02a1c0a2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-epicor-announces-two-new-executive-leadership-appointments-to-take-company-through-next-phase-of-growth.html", "ord_in_thread": 0, "title": "Epicor Announces Two New Executive Leadership Appointments to Take Company through Next Phase of Growth", "locations": [], "entities": {"persons": [{"name": "david mehok", "sentiment": "none"}, {"name": "clarke", "sentiment": "none"}, {"name": "epicor", "sentiment": "none"}, {"name": "steve murphy", "sentiment": "none"}, {"name": "david", "sentiment": "none"}, {"name": "pich", "sentiment": "none"}, {"name": "murphy", "sentiment": "none"}, {"name": "clarke pich", "sentiment": "none"}], "locations": [{"name": "austin", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}], "organizations": [{"name": "epicor software corporation", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AUSTIN, Texas, Jan. 23, 2018 /PRNewswire/ -- Epicor Software Corporation, a global provider of industry-specific enterprise software to promote business growth, today announced two new appointments to the executive leadership team. David Mehok joins Epicor as chief financial officer and Clarke Pich takes on a new role as head of global professional services for the company. Both Mehok and Pich will assume their roles effective immediately and report directly to Epicor Chief Executive Officer Steve Murphy.\n\"These new additions to our executive leadership team will be instrumental in driving the culture of growth, investment and customer centricity that is our focus,\" Murphy said. \"The Epicor board of directors and I are confident that David's strong background leading global finance organizations and Clarke's expertise in enterprise software services sales and cloud implementations will position Epicor to achieve our objectives. The business skills they both bring will help Epicor on our next phase of growth and strategy to make it easy for our customers to stay current on technology upgrades, move to the cloud, and drive digital transformation as we help them grow.\"\nMehok is a highly driven finance executive with more than 20 years of experience leading global finance organizations. He brings to the CFO role a proven track record of dramatically improving business results, leading large and small teams, formulating and driving critical business strategies, and improving controls. Mehok most recently was the CFO for Austin-based CLEAResult, the largest provider of energy efficiency programs and services in North America. Prior to that he spent 18 years at Dell in a variety of finance roles including head of investor relations and the finance leader for one of the largest customer business segments at the company. Mehok holds an MBA from the University of Texas at Austin, and a Bachelor of Science in Accounting from Villanova University.\nAs the head of global professional services at Epicor, Pich brings over 20 years of experience in professional services sales and delivering of enterprise solutions to the role. Pich is a proven leader, most recently running the North American cloud consulting sales team at Oracle for the commercial segment as group vice president. He implemented go-to-market strategies at Oracle to focus on the IaaS and PaaS business on alignment with product sales to optimize the annual recurring revenue and cloud revenue streams and improve customer satisfaction. Pich has held various leadership positions with Hitachi Consulting, Arthur Anderson, Momentum Software, Dr. Pepper Bottling Company, and SAP America. Pich holds an MBA in Finance from Baylor University and a Bachelor of Business Administration in Management Information Systems from Texas Tech University.\nAbout Epicor Software Corporation\nEpicor Software Corporation drives business growth. We provide flexible, industry-specific software designed around the needs of our manufacturing, distribution, retail, and service industry customers. More than 40 years of experience with our customers' unique business processes and operational requirements are built into every solution―in the cloud, hosted, or on premises. With this deep understanding of your industry, Epicor solutions manage complexity, increase efficiency, and free up resources so you can focus on growth. For more information, connect with Epicor or visit www.epicor.com .\nEpicor and the Epicor logo are trademarks of Epicor Software Corporation, registered in the United States and other countries. Other trademarks referenced are the property of their respective owners. The product and service offerings depicted in this document are produced by Epicor Software Corporation.\nContact:\nLisa Preuss\nVice President, Corporate Communications\nEpicor Software Corporation\n+1 949.585.4235\nlpreuss@epicor.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/epicor-announces-two-new-executive-leadership-appointments-to-take-company-through-next-phase-of-growth-300586748.html\nSOURCE Epicor Software Corporation", "external_links": ["http://www.epicor.com/", "http://www.prnewswire.com/news-releases/epicor-announces-two-new-executive-leadership-appointments-to-take-company-through-next-phase-of-growth-300586748.html", "http://www.epicor.com/industries/default.aspx", "http://www.epicor.com/company/connect-with-epicor.aspx"], "published": "2018-01-23T19:21:00.000+02:00", "crawled": "2018-01-23T20:19:24.000+02:00", "highlightTitle": ""}