{"organizations": [], "uuid": "2772d03f4e07d1a0fba185374e45e7e1b5d36dd4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222405300&w=1200&r=LYNXMPEE0F0QJ", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-ge-restructuring/ge-to-take-6-2-billion-charge-in-its-finance-arm-in-fourth-quarter-idUSKBN1F51AP", "country": "US", "domain_rank": 408, "title": "GE to take $6.2 bln charge in its finance arm in fourth quarter", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T13:47:00.000+02:00", "replies_count": 0, "uuid": "2772d03f4e07d1a0fba185374e45e7e1b5d36dd4"}, "author": "", "url": "https://www.reuters.com/article/us-ge-restructuring/ge-to-take-6-2-billion-charge-in-its-finance-arm-in-fourth-quarter-idUSKBN1F51AP", "ord_in_thread": 0, "title": "GE to take $6.2 bln charge in its finance arm in fourth quarter", "locations": [], "entities": {"persons": [{"name": "ankit ajmera", "sentiment": "none"}, {"name": "saumyadeb chakrabarty", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "bengaluru", "sentiment": "none"}], "organizations": [{"name": "ge", "sentiment": "negative"}, {"name": "general electric co", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ge capital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - General Electric Co again raised the prospect of breaking up the conglomerate on Tuesday as it announced more than $11 billion in charges from its long-term care insurance portfolio and new U.S. tax laws.\nChief Executive John Flannery has previously raised the idea of selling pieces of the largest U.S. industrial company, as he slashes thousands of jobs and moves to cut $3.5 billion in costs to counter a plunge in profits and cash flow.\nFlannery inherited a host of problems when he became CEO on Aug. 1, such as falling sales of power turbines, a build-up of inventory and declining profit margins in some businesses.\nHis statements on Tuesday showed that the idea of a break-up remains part of GE’s thinking, though not a certainty.\n“I would categorize it as an examination of options and it’s (the) kind of thing that could result in many, many different permutations, including separately traded assets really in any one of our units, if that’s what made sense,” he said in response to an analyst question on a conference call, without giving any details.\nGE said it will provide another update on its review in the spring. A decision could come then, CNBC reported, citing sources close to GE, adding that a break-up was “likely.”\nEarlier on Tuesday, GE said its finance arm, GE Capital, would take a $7.5 billion after-tax charge in the fourth quarter from a reevaluation of its insurance assets. It will also take a $1.8 billion charge for non-cash impairments at GE Capital.\n“We’ve seen this movie before” with GE, said Deane Dray, an analyst at RBC Capital Markets. “They say they’re adequately reserved until they’re not. And then you see a parade of incremental reserve charges.”\nGE shares were down 3.9 percent at $18.03 in afternoon trading. At that level, the company has a market capitalization of about $156 billion.\nINSURANCE RETHINK The insurance charge is the latest sign of problems with the modeling and funding of nursing home and other long-term care in the United States.\nGE said it reviewed policy assumptions with actuaries and accountants after seeing that payouts had begun to exceed premiums on a portfolio of about 300,000 policies that stem from businesses GE acquired in the 1980s and 1990s. GE sold most of those business last decade and has not written such policies since 2006.\nThe review, concluded a week ago, showed GE needed to set aside $15 billion through 2024, including $3 billion in the current quarter, to cover potential payouts on the policies it retained.\nFILE PHOTO - The ticker and logo for General Electric Co. is displayed on a screen at the post where it is traded on the floor of the New York Stock Exchange (NYSE) in New York City, U.S. on June 30, 2016. REUTERS/Brendan McDermid/File Photo “Clearly, in hindsight, we under-appreciated the risk,” Flannery said.\nGE Capital last year temporarily suspended paying dividends to GE. Now, GE Capital will suspend its dividend for the “foreseeable future” to help fund the reserve, GE said.\nThe problem was flagged in July when GE said “adverse claims” were appearing in part of its long-term care portfolio and it was assessing how much policy-holders would likely pay.\nTAX CHANGE CHARGE FILE PHOTO: The General Electric logo is pictured on the General Electric offshore wind turbine plant in Montoir-de-Bretagne, near Saint-Nazaire, western France, November 21, 2016. REUTERS/Stephane Mahe/File Photo Tax changes recently passed by the U.S. Congress raised GE’s fourth-quarter charge to $7.5 billion, more than twice an initial indication of more than $3 billion that GE had noted in November. GE also will record a $3.4-billion impact from tax reform and $1.8 billion in goodwill and other non-cash impairments, all in the fourth quarter.\nThe charges means GE’s 2017 profit will be at the bottom end of its forecast, GE said.\nFlannery said in November that GE would pare its operations to three main businesses - power, healthcare and aviation - and seek to dispose of $20 billion in operations. He also said further major portfolio changes were being considered. Asked how his strategy had evolved since November, Flannery said:\n“We’ve been taking a comprehensive look at every aspect of the company and that everything was on the table. So that’s been, I’d say, a hallmark of our approach from day one.”\nGE said the Kansas Insurance Department - the primary regulator for North American Life & Health, GE Capital’s insurance portfolio - had approved the phased $15 billion reserve payments through 2024.\nThe set-aside highlights long-running difficulties for long-term care insurers and re-insurers who are struggling to make good on policies dating back decades that underestimated projected health-care costs and life spans.\nThe cost of nursing home or home-based elderly care tends not to be covered by Medicare, the U.S. government insurance program, and can be extremely expensive out of pocket.\nGE was the worst performer on the Dow in 2017 and it has already cut its planned annual dividend for 2018 in half, only the third cut in the company’s 125-year history.\nEven after the stock’s declines, it trades at only a slight discount to industrial peers, trading at about 18 times this year’s expected earnings.\nReporting by Ankit Ajmera in Bengaluru; Editing by Saumyadeb Chakrabarty and Nick Zieminski\n ", "external_links": [], "published": "2018-01-16T13:47:00.000+02:00", "crawled": "2018-01-16T14:03:55.007+02:00", "highlightTitle": ""}