{"organizations": [], "uuid": "7b8d9c52875e2a58db4145567d0f1407cc17d1c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224153795&w=1200&r=LYNXMPEE0L16X", "site_section": "http://feeds.reuters.com/reuters/INformulaOne", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/cricket-test-zaf-ind/cricket-ruthless-south-africa-take-aim-at-series-sweep-against-india-idINKBN1FB1MG", "country": "US", "domain_rank": 408, "title": "Cricket: Ruthless South Africa take aim at series sweep against India", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T15:08:00.000+02:00", "replies_count": 0, "uuid": "7b8d9c52875e2a58db4145567d0f1407cc17d1c9"}, "author": "", "url": "https://in.reuters.com/article/cricket-test-zaf-ind/cricket-ruthless-south-africa-take-aim-at-series-sweep-against-india-idINKBN1FB1MG", "ord_in_thread": 0, "title": "Cricket: Ruthless South Africa take aim at series sweep against India", "locations": [], "entities": {"persons": [{"name": "faf du plessis", "sentiment": "none"}, {"name": "du plessis", "sentiment": "none"}], "locations": [{"name": "ruthless south africa", "sentiment": "none"}, {"name": "johannesburg", "sentiment": "none"}, {"name": "cape town", "sentiment": "none"}, {"name": "pretoria", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "international cricket council", "sentiment": "none"}, {"name": "india nick said 3 min read  johannesburg", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JOHANNESBURG (Reuters) - South Africa have promised a ruthless approach as they seek to inflict an historic series sweep when they host India for the third and final test at The Wanderers in Johannesburg on Wednesday, says captain Faf du Plessis.\nThe Proteas can complete a first clean-sweep of a three-test series against the sub-continent side, having already secured wins in Cape Town and Pretoria earlier this month.\nA 3-0 series victory would not see South Africa take over from India at the top of the International Cricket Council’s rankings, but would move them to within decimal points of doing so. With a four-test series to come against Australia in March, top spot would be tantalisingly close.\n“I don’t think we’ll make changes for the third test just for the sake of giving opportunities. We want to keep our foot on the gas and apply as much pressure as possible,” Du Plessis told reporters.\n”It doesn’t happen a lot that you get the chance to beat a team 3-0 and I would favour dominating India and being ruthless.\n“We can use the ODIs and T20s to try and rotate players. We have an amazing opportunity as a team to win 3-0, and that makes us even more hungry to go where no team has gone before.”\nCricket - India v South Africa - Second Test match - Centurion Stadium, Pretoria, South Africa - January 16, 2018. South Africa's Faf Du Plessis plays a shot. REUTERS/James Oatway South Africa will on Tuesday hand a fitness test to in-form opening batsman Aiden Markram, who injured his thigh in the second test.\nIf he is ruled out, his replacement is likely to be Theunis de Bruyn, with Temba Bavuma already out for four weeks with a fractured finger.\nCricket - India v South Africa - Second Test match - Centurion Stadium, Pretoria, South Africa - January 17, 2018. South Africa's Lungi Ngidi celebrates taking the wicket of India’s Mohammed Shami. REUTERS/James Oatway India had high hopes of a first ever test series success in South Africa when they arrived for the tour, but have fallen short in two hard-fought matches.\nCaptain Virat Kohli, the only player to score a century in the series, was especially disappointed with their display in Pretoria on a wicket that was more suited to their game than South Africa‘s.\nAnother defeat would be devastating for him as skipper, and he believes his side can get the better of their hosts.\n“We have to believe that we are the best side (in the world),” he told reporters.\n“We are not complaining about pitches, we are not complaining about conditions. We have come here to play. We have had equal opportunities to win in both games, and that’s the positive we can take out of it.”\nReporting By Nick Said; Editing by Christian Radnedge\n ", "external_links": [], "published": "2018-01-22T15:08:00.000+02:00", "crawled": "2018-01-22T15:43:04.010+02:00", "highlightTitle": ""}