{"organizations": [], "uuid": "3040883b1e541fcf3d9c58ab335c85cd2624f41b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-mplx-lp-increases-quarterly-distribution.html", "country": "US", "domain_rank": 767, "title": "MPLX LP increases quarterly distribution", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T15:00:00.000+02:00", "replies_count": 0, "uuid": "3040883b1e541fcf3d9c58ab335c85cd2624f41b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-mplx-lp-increases-quarterly-distribution.html", "ord_in_thread": 0, "title": "MPLX LP increases quarterly distribution", "locations": [], "entities": {"persons": [], "locations": [{"name": "findlay", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "mplx lp", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "mplx", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FINDLAY, Ohio, Jan. 26, 2018 /PRNewswire/ -- MPLX LP (NYSE: MPLX) today announced that the board of directors of its general partner has declared a cash distribution of $0.6075 per common unit for the fourth quarter of 2017. This represents an increase of $0.02 per unit, or 3.4 percent, over the third-quarter 2017 distribution; an increase of $0.0875 per unit, or 16.8 percent, over the fourth-quarter 2016 distribution; and a 12.1 percent increase on a full-year basis over 2016 distributions. Since the partnership's initial public offering in October 2012, the MPLX board has authorized distribution increases for 20 consecutive quarters, representing a compound annual growth rate of 18.3 percent over the minimum quarterly distribution established at the partnership's formation. The distribution will be paid Feb. 14, 2018, to common unitholders of record as of Feb. 5, 2018.\nOn Feb. 1, MPLX will provide an update on its 2017 fourth-quarter and full-year results through an earnings release, to be followed by a conference call scheduled for 11 a.m. EST that day. Interested parties may listen to the conference call by dialing 1-888-606-5719 (confirmation number 6033306) or by visiting MPLX's website at http://www.mplx.com and clicking on the \"2017 Fourth-Quarter and Full-Year Financial Results\" link in the \"News & Headlines\" section.\nThis release is intended to be a qualified notice under Treasury Regulation Section 1.1446-4(b). Brokers and nominees should treat 100 percent of MPLX's distributions to foreign investors as being attributable to income that is effectively connected with a United States trade or business. Accordingly, MPLX's distributions to non-United States investors are subject to federal income tax withholding at the highest applicable effective tax rate.\nAbout MPLX LP\nMPLX is a diversified, growth-oriented master limited partnership formed in 2012 by Marathon Petroleum Corporation to own, operate, develop and acquire midstream energy infrastructure assets. We are engaged in the gathering, processing and transportation of natural gas; the gathering, transportation, fractionation, storage and marketing of NGLs; and the transportation, storage and distribution of crude oil and refined petroleum products through a marine fleet and approximately 10,000 miles of crude oil and light product pipelines. Headquartered in Findlay, Ohio, MPLX's assets consist of a network of crude oil and products pipeline assets located in the Midwest and Gulf Coast regions of the United States; 62 light-product terminals with approximately 24 million barrels of storage capacity; an inland marine business; storage caverns with approximately 2.8 million barrels of storage capacity; crude oil and product storage facilities (tank farms) with approximately 5 million barrels of available storage capacity; a barge dock facility with approximately 78,000 barrels per day of crude oil and product throughput capacity; and gathering and processing assets that include approximately 5.9 billion cubic feet per day of gathering capacity, 8.2 billion cubic feet per day of natural gas processing capacity and 610,000 barrels per day of fractionation capacity.\nView original content: http://www.prnewswire.com/news-releases/mplx-lp-increases-quarterly-distribution-300588749.html\nSOURCE MPLX LP", "external_links": ["http://www.mplx.com/", "http://www.prnewswire.com/news-releases/mplx-lp-increases-quarterly-distribution-300588749.html"], "published": "2018-01-26T15:00:00.000+02:00", "crawled": "2018-01-26T16:43:38.034+02:00", "highlightTitle": ""}