{"organizations": [], "uuid": "79a6d584bd64c132a0a0040b79d8f178603d547a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225420485&w=1200&r=LYNXMPEE0P0FQ", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-europe-stocks/european-shares-set-for-weekly-fall-as-strong-euro-weighs-idUKKBN1FF0WB", "country": "US", "domain_rank": 408, "title": "European shares set for weekly fall as strong euro weighs", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T10:45:00.000+02:00", "replies_count": 0, "uuid": "79a6d584bd64c132a0a0040b79d8f178603d547a"}, "author": "", "url": "https://uk.reuters.com/article/us-europe-stocks/european-shares-set-for-weekly-fall-as-strong-euro-weighs-idUKKBN1FF0WB", "ord_in_thread": 0, "title": "European shares set for weekly fall as strong euro weighs", "locations": [], "entities": {"persons": [{"name": "kepler cheuvre", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "steven mnuchin", "sentiment": "none"}], "locations": [{"name": "milan", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "temenos", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "lvmh", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 49 AM / a few seconds ago European shares set for weekly fall as strong euro weighs   \nMILAN (Reuters) - European shares edged up in early deals on Friday, helped by a well-received update from LVMH, although they were set for their first weekly drop this year as a rally in the euro weighed. \nLVMH rose 3.4 percent after the world’s biggest luxury goods maker reported higher sales and profits and said it had made a favorable start to 2018. \nIt buoyed shares of other luxury goods companies, helping the pan-European STOXX 600 index edge 0.2 percent higher by 0828 GMT, while Germany’s DAX was flat and the UK’s FTSE was up 0.4 percent. \nThe euro was up on Friday, though below the December 2014 high it hit on Thursday, after   said he wanted a “strong dollar”, contradicting earlier comments made by Treasury Secretary Steven Mnuchin. \nTemenos was the biggest gainer on the STOXX 600, up 6 percent. The Swiss software company, which is subject to regular takeover speculation, jumped as much as 18 percent in the previous session. \nKepler Cheuvreux raised its price target on Temenos on Friday, pointing to positive comments by Nordic bank Nordea regarding the integration of a Temenos banking platform. Kepler said takeover speculation had also pushed up Temenos shares. A Temenos spokesman could not be reached for comment on Thursday. \nAmong other gainers were Telia, up 2 percent, after the telecom operator lifted its dividend, while shares in Michelin and Thales were buoyed by upbeat broker comments. \nA disappointing update however sent Norwegian insurer Gjensidige down 6 percent. The company posted below-forecast profits for the fourth quarter and proposed a lower-than-expected full-year dividend. \nSpeciality baker Aryzta fell 5.5 percent as some brokers downgraded the stock following a profit warning that wiped out one fifth of its market value on Thursday. \nThe STOXX 600 was down 0.4 percent so far this week, having gained almost 3 percent in the previous three weeks. Reporting by Danilo Masoni; editing by Tom Pfeiffer", "external_links": [], "published": "2018-01-26T10:45:00.000+02:00", "crawled": "2018-01-26T11:03:46.002+02:00", "highlightTitle": ""}