{"organizations": [], "uuid": "2d639213af28b65d07d3266b66987f208c1e090a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-euro-stumbles-after-recent-rally-though-outlook-bullish-idUSL4N1P33JL", "country": "US", "domain_rank": 408, "title": "FOREX-Euro stumbles after recent rally though outlook bullish", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T20:40:00.000+02:00", "replies_count": 0, "uuid": "2d639213af28b65d07d3266b66987f208c1e090a"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-euro-stumbles-after-recent-rally-though-outlook-bullish-idUSL4N1P33JL", "ord_in_thread": 0, "title": "FOREX-Euro stumbles after recent rally though outlook bullish", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Sell dollar theme remains alive in currency markets\n* Graphic: World FX rates in 2017 tmsnrt.rs/2egbfVh\nBy Saikat Chatterjee\nLONDON, Jan 8 (Reuters) - The euro slipped a third of a percent on Monday as investors took profits after a recent rally though currency markets remained bullish about the outlook for the single currency on the backdrop of a strengthening economic recovery.\nWith foreign exchange markets extending the “sell dollar” theme from late last year and Asian stocks creeping towards all-time peaks, the euro’s dip was taken as an opportunity to buy the single currency by some investors.\n“The outlook for the Fed has been already priced into the market so the uncertainty is around ECB’s policy stance though the low inflation and the strong euro will certainly be a concern for policymakers,” said Kenneth Broux, an FX strategist at Societe Generale in London.\nFlash inflation estimates for December across the eurozone area printed at 1.4 percent last week, slightly slower than 1.5 percent in the previous month and well below an ECB target.\nLackluster inflation pressure in Europe has been accompanied by a strengthening economic recovery across the continent and improvement in China and the United States, fueling risk appetite.\n“The overall economic trend is minutely supportive for the U.S. dollar as we are seeing a global recovery led by China and Europe and there is a lot of cash sitting on the sidelines waiting to buy European assets,” said Peter Chatwell, head of European rates strategy at Mizuho International in London.\nFriday’s headline U.S. nonfarm payrolls increased by 148,000 jobs last month, against broader expectations of an increase of 190,000 jobs, though an unchanged unemployment rate holding stable at a decade low of 4.1 percent pointed to a solid jobs market.\nPositioning data showed net dollar positions against a broader basket of currencies, including some emerging market currencies, not far away from a 5-year low hit in October.\nThe euro slipped 0.3 percent to $1.19890 after rising more than 2 percent over the last three months. It wasn’t far away from a four-month high of $1.2092 hit in September.\nThe U.S. currency had begun 2018 on the defensive, after the dollar index fell about 9.9 percent in 2017, its weakest performance since 2003.\nA synchronized global recovery has prompted other countries’ central banks to start moving towards tighter monetary policy in recent months, helping bolster their currencies.\nAfter the U.S. jobs data, traders of U.S. short-term interest rate futures continued to bet the Fed would raise rates two times this year, including a probable increase in March.\nComments by some Fed officials on Friday and over the weekend suggested the U.S. central bank remained on track to raise interest rates in 2018.\nSan Francisco Fed President John Williams told Reuters in an interview on Saturday that the Fed should raise rates three times this year given the already strong economy will get a boost from tax cuts, and can tighten more or less aggressively if needed.\nAgainst a broad-basket of currencies, the dollar edged 0.3 percent higher on the day.\nFor Reuters Live Markets blog on European and UK stock markets see reuters://realtime/verb=Open/url=http://emea1.apps.cp.extranet.thomsonreuters.biz/cms/?pageId=livemarkets (Reporting by Saikat Chatterjee; Editing by Peter Graff)\n ", "external_links": ["http://emea1.apps.cp.extranet.thomsonreuters.biz/cms/?pageId=livemarkets", "http://tmsnrt.rs/2egbfVh", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-08T20:40:00.000+02:00", "crawled": "2018-01-09T09:40:36.579+02:00", "highlightTitle": ""}