{"organizations": [], "uuid": "ea9a35a8d33b4d758d9cbdcb5a2475acd842728f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-mexico-politics/andres-manuelovich-mexican-leftist-laughs-off-russia-election-jabs-idUSKBN1F735X", "country": "US", "domain_rank": 408, "title": "'Andres Manuelovich': Mexican leftist laughs off Russia election jabs", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T06:03:00.000+02:00", "replies_count": 0, "uuid": "ea9a35a8d33b4d758d9cbdcb5a2475acd842728f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-mexico-politics/andres-manuelovich-mexican-leftist-laughs-off-russia-election-jabs-idUSKBN1F735X", "ord_in_thread": 0, "title": "'Andres Manuelovich': Mexican leftist laughs off Russia election jabs", "locations": [], "entities": {"persons": [{"name": "andres manuelovich", "sentiment": "negative"}, {"name": "andres manuel lo", "sentiment": "negative"}, {"name": "lopez obrador", "sentiment": "none"}, {"name": "peje", "sentiment": "none"}, {"name": "jose antonio meade", "sentiment": "none"}, {"name": "obrador", "sentiment": "none"}], "locations": [{"name": "mexico city", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "mexico city", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "pri", "sentiment": "none"}, {"name": "institutional revolutionary party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MEXICO CITY (Reuters) - The leftist frontrunner for Mexico’s presidential election, Andres Manuel Lopez Obrador, on Thursday made light of allegations that his campaign may have Russian backing, joking that he would henceforth be known as “Andres Manuelovich.”\nIn contrast with previous presidential campaigns, in which Lopez Obrador’s shrill replies to critics’ jibes cost him votes, he has shown himself to be more relaxed ahead of the July 1 election, while toning down some policies to broaden his appeal.\nA spokesman for Jose Antonio Meade, his rival from the ruling Institutional Revolutionary Party (PRI), warned on Wednesday about possible Russian interference in the July vote, with the aim of benefiting Lopez Obrador, a two-time runner-up.\nThe former Mexico City mayor, who is widely known as “Peje” after a thick-skinned fish prevalent in his home state of Tabasco, responded with a tongue-in-cheek video shot at a port, where he said he was waiting for a Russian submarine to surface laden with gold.\n“I am no longer ‘Peje,’ now I‘m Andres Manuelovich,” he grinned.\nAndres Manuel Lopez Obrador, presidential pre-candidate of the National Regeneration Movement (MORENA), interacts with supporters after a rally in Medellin, on the outskirts of Veracruz, Mexico January 18, 2018. REUTERS/Yahir Ceballos NO RESALES. NO ARCHIVES. Russia has been accused of interfering in the 2016 U.S. election won by President Donald Trump, and some in Mexico have voiced fears that the country led by Vladimir Putin could unleash Kremlin-backed hackers to sow chaos in the July vote.\nAt a joint news conference in Moscow in November with his Russian counterpart Sergei Lavrov, Mexico’s Foreign Minister Luis Videgaray said there was no evidence Russia was trying to influence Mexico’s election. Lavrov denied any interference.\nSlideshow (4 Images) In an earlier video, AMLO, as he is also known, responded to a dig from President Enrique Pena Nieto by suggesting the Mexican leader should take an “Amlodipine” pill, a medication for high blood pressure.\nLopez Obrador, who maintains a strong lead in opinion polls, has also softened his image with videos of him at home with his wife and children, and engaged in everyday activities such as getting his haircut.\nLopez Obrador’s detractors have long compared him to former Venezuelan leader Hugo Chavez, suggesting he would seek to usher in a socialist revolution in Mexico, Latin America’s No. 2 economy.\nLopez Obrador says his movement draws its influence only from Mexican historical leaders.\nReporting by Ana Isabel Martinez; Writing by Gabriel Stargardter; Editing by Frank Jack Daniel\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T06:03:00.000+02:00", "crawled": "2018-01-19T00:41:02.031+02:00", "highlightTitle": ""}