{"organizations": [], "uuid": "8a6a9b95b3a538934b87551ebf675a7edbe4fc7a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-ingenico-group-reaches-an-agreement-to-acquire-paymark-a-new-zealand-leader-in-payment-processing.html", "country": "US", "domain_rank": 767, "title": "Ingenico Group reaches an agreement to acquire Paymark, a New Zealand leader in payment processing", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-17T09:31:00.000+02:00", "replies_count": 0, "uuid": "8a6a9b95b3a538934b87551ebf675a7edbe4fc7a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-ingenico-group-reaches-an-agreement-to-acquire-paymark-a-new-zealand-leader-in-payment-processing.html", "ord_in_thread": 0, "title": "Ingenico Group reaches an agreement to acquire Paymark, a New Zealand leader in payment processing", "locations": [], "entities": {"persons": [], "locations": [{"name": "new zealand", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "paymark", "sentiment": "none"}, {"name": "bambora", "sentiment": "none"}, {"name": "pacific", "sentiment": "none"}, {"name": "auckland", "sentiment": "none"}], "organizations": [{"name": "ing", "sentiment": "neutral"}, {"name": "ingenico group", "sentiment": "neutral"}, {"name": "paymark", "sentiment": "neutral"}, {"name": "asb", "sentiment": "none"}, {"name": "westpac", "sentiment": "none"}, {"name": "ingenico", "sentiment": "none"}, {"name": "anz", "sentiment": "none"}, {"name": "bnz", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Press Release Paris,\nJanuary 17, 2018 Ingenico Group (Euronext: FR0000125346 - ING), the global leader in seamless payment, today announced the signing of an agreement in order to acquire Paymark, a leading New Zealand payment network, for a global consideration of NZD 190 million.\nBased in Auckland and employing over 150 people in New Zealand, Paymark has been processing secure transactions on behalf of banks and acquirers for over 25 years, allowing merchants to accept a broad range of card-based payment. With over 1 billion transactions processed annually, the Paymark network is connected to all major card issuers and merchant acquirers and to more than 80,000 merchants.\nThe sale agreement, signed between Ingenico Group and the shareholders of Paymark (ANZ, ASB, BNZ and Westpac), includes the extension of the service agreement currently in force between Paymark and the four leading acquiring banks.\nBy combining its historical terminals assets with Paymark and Bambora in the Pacific region, Ingenico will be well positioned to create great value for New Zealand retailers and financial institutions with a complete omnichannel offering including POS and terminal management, in-store and online processing capabilities and valued-added services such as analytics and loyalty.\nNew Zealand's electronic retail payments environment is one of the more advanced worldwide, enjoying a solid growth of electronic transaction volumes, on the back of a number of secular trends including adoption of contactless technology.\n\"The acquisition of Paymark represents a great addition to the company's portfolio and is fully aligned with Ingenico Group's strategy to provide payment solutions and services across all channels. It is a strong springboard to deploy that strategy in the Pacific region\" said Patrice Le Marre, Banks & Acquirers Business Unit EVP of Ingenico Group. \"We will continue to invest in Paymark in order to keep providing the best payment solutions to serve our customers including ANZ, ASB, BNZ and Westpac, with whom we have built strong relationships in the region.\"\n\"Building on the recent acquisition of Bambora, Ingenico will now be able to expand its offering in New Zealand, delivering services and solutions in all areas of payments for small and large businesses and financial institutions alike\" said Dominic White, VP Pacific Region for Ingenico Group. \" I am looking forward to welcoming Paymark's team to Ingenico Group.\"\n\"We are delighted to become part of the Ingenico Group. Our strong offering in transaction services coupled with Ingenico's extensive experience throughout the payment value chain will definitely be a game changer in the growing New Zealand market.\" said Liam O'Reilly, Chief Executive Officer of Paymark.\nClosing is expected to occur during the second quarter of 2018. The transaction is subject to relevant regulatory consents. Paymark will be integrated within the Banks & Acquirers business unit.\nIngenico Group has been advised by FNZC, Credit Suisse, Allens, Chapman Tripp and Deloitte.\nAbout Ingenico Group\nIngenico Group (Euronext: FR0000125346 - ING) is the global leader in seamless payment, providing smart, trusted and secure solutions to empower commerce across all channels, in-store, online and mobile. With the world's largest payment acceptance network, we deliver secure payment solutions with a local, national and international scope. We are the trusted world-class partner for financial institutions and retailers, from small merchants to several of the world's best known global brands. Our solutions enable merchants to simplify payment and deliver their brand promise.\nStay in touch with us:\nwww.ingenico.com twitter.com/ingenico\nFor more experts' views, visit our blog .\nAbout Paymark\nPaymark is New Zealand's leading electronic payments company. For over 25 years, the company has served the vast majority of New Zealand retailers and businesses through its safe, secure and reliable infrastructure. Paymark covers more than 140,000 terminals accounting for in excess of 75% of New Zealand payments landscape. The company processes around 60 transactions every second of the day and completed its 16 billionth transaction in May 2017.\nContacts / Ingenico Group\nInvestors\nLaurent Marie\nVP Investor Relations &\nFinancial Communication\nlaurent.marie@ingenico.com\n(T) / (+33) (0)1 58 01 92 98 Investors\nKevin Woringer\nInvestor Relations Manager\nkevin.woringer@ingenico.com\n(T) / (+33) (0)1 58 01 85 09\nCommunication\nCoba Taillefer\nExternal Communication Manager\ncoba.taillefer@ingenico.com\n(T) / (+33) (0)1 58 01 89 62 Upcoming events\nFull year 2017 results: 22 nd February 2018\nAttachments:\nhttp://www.globenewswire.com/NewsRoom/AttachmentNg/f0c877cf-326c-4e40-91ae-4d7efcd8fdcd\nSource:INGENICO GROUP SA", "external_links": ["https://www.globenewswire.com/Tracker?data=hV6y1FxyZSnMTvIJ8LnIjVhux88coAwLBSimfevBQOKxMOc808bHbrxlWweiC97U39KQb3wZDW6d0RI_FBZfCKWVh26ya1njPRH0no1l0-pcfOk_7fpgAqvvMpRIxLbVZXeDLAFVA33z_2teUOiOCxkd9h7il5_PcUrku1hCMGkhszoyKvW-3Leo-6Cvrpr3gfWEvu4pwEBSyxqyAQTnhlqH_ArFHBcbqc7rcM-J_prgjbKHFleoMJvrJWmBap3w11R8Ukm7UkZJJsnApDVlWg==", "https://www.globenewswire.com/Tracker?data=-ENbmfT99vMJjQVgZCc23nZZz13SAxf9_3tVQnwUUtzE_xmevfUTOh_tyVEtkCcYhhAKqqHJaG5thWEu-hGUOw==", "https://www.globenewswire.com/Tracker?data=s3iahuowuOwTcGy0GbF-fhrhwkLB5XaUbVTlg_3PiX851TMzJFigfOLH7YB9f7L2Vh9i6oy2KFOtJVZKPSDa5VQWTI8NEnQv7iXEkaZyifI=", "https://www.globenewswire.com/Tracker?data=312lK3J4R5RnaLIMtGW7r6pEUhwaEq-49CSoL-WbC_doL8vmuenjGnCASrE2RDkbyJ39KTQjxH0YNhXr4mGc6Q==", "http://www.globenewswire.com/NewsRoom/AttachmentNg/f0c877cf-326c-4e40-91ae-4d7efcd8fdcd"], "published": "2018-01-17T09:31:00.000+02:00", "crawled": "2018-01-17T11:34:21.004+02:00", "highlightTitle": ""}