{"organizations": [], "uuid": "47c5d236edf6c5756dd81d0eb251d5e9f52b6309", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-environment-business/global-business-group-lit-a-flame-for-long-term-u-n-goals-chair-idUSKBN1FB1A3", "country": "US", "domain_rank": 408, "title": "Global business group \"lit a flame\" for long-term UN goals -chair", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T13:04:00.000+02:00", "replies_count": 0, "uuid": "47c5d236edf6c5756dd81d0eb251d5e9f52b6309"}, "author": "", "url": "https://www.reuters.com/article/us-environment-business/global-business-group-lit-a-flame-for-long-term-u-n-goals-chair-idUSKBN1FB1A3", "ord_in_thread": 0, "title": "Global business group \"lit a flame\" for long-term UN goals -chair", "locations": [], "entities": {"persons": [{"name": "malloch-brown", "sentiment": "none"}, {"name": "aviva", "sentiment": "none"}, {"name": "alister doyle", "sentiment": "none"}, {"name": "mark malloch-brown", "sentiment": "none"}], "locations": [{"name": "mars", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "un", "sentiment": "negative"}, {"name": "global", "sentiment": "negative"}, {"name": "min read  oslo", "sentiment": "none"}, {"name": "davos world economic forum", "sentiment": "none"}, {"name": "unilever", "sentiment": "none"}, {"name": "business and sustainable development commission", "sentiment": "none"}, {"name": "alibaba", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.n.", "sentiment": "none"}, {"name": "merck", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OSLO (Reuters) - Many companies are looking past quarterly results to discover long-term economic opportunities in U.N. goals to end poverty and protect the planet, the head of an international business commission has said.\nMark Malloch-Brown’s Business and Sustainable Development Commission has contacted 1,500 CEOs over two years to persuade them that embracing development can boost their bottom line, and will wrap up its work at the Davos World Economic Forum on Tuesday.\n“We feel we’ve lit a flame here,” said Malloch-Brown, a British former U.N. deputy secretary-general who will now spearhead campaigning to keep Britain in the European Union.\nHis 37-strong group included leaders of firms such as Unilever, Merck, Mars, Alibaba, Safaricom and Aviva as well as academics and civil society leaders, urging businesses to adopt U.N. goals for 2030 such as ending poverty and hunger and to slow climate change.\nIn a report last year, the commission said companies could unlock at least $12 trillion in market opportunities by 2030 and create up to 380 million jobs by focusing on transport, energy, cities, agriculture, food and health.\nMalloch-Brown told Reuters the biggest barrier was CEOs’ mindsets.\n“CEOs are still terribly preoccupied by quarterly results,” he said. “The hardest argument is to persuade them to persuade their shareholders to let them think - at least in a portion of their business - in the long term.”\nCompanies such as Unilever and Mars found it was much better to pay African farmers fair, stable prices for cocoa and focus on quality chocolate rather than risk putting farmers out of business with low prices, he said.\nAnd insurer Aviva is developing benchmarks so that investors “can judge whether a company is having an impact” in terms of the sustainable development goals, he said.\nAnother initiative was to develop more “blended finance” for the global development goals involving both public and private sources.\nMalloch-Brown said construction firms could tap a vast market for low-cost houses in cities such as Mumbai or Lagos rather than building a “few mansions in Weybridge”, a prosperous English town.\nCommission member Amy Jadesimi, managing director of Nigeria’s Lagos Deep Offshore Logistics Base, said the opportunities in emerging economies were huge.\nA 330-metre (1080 ft) long Floating Production, Storage and Offshore vessel built for Total will arrive in Nigeria this week from South Korea for completion work before deployment at Nigeria’s 200,000 barrel per day Egina field.\n“We’re sending a signal to the world that you can do the most expensive industrial projects in the world here in Africa,” Jadesimi said.\nReporting By Alister Doyle\n ", "external_links": [], "published": "2018-01-22T13:04:00.000+02:00", "crawled": "2018-01-22T13:25:34.022+02:00", "highlightTitle": ""}