{"organizations": [], "uuid": "3a5854b23987ace5f0842a05bbcb77376a3bfd2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/10/104938509-GettyImages-887139972.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/16/the-four-big-fights-trump-and-congress-must-resolve-to-avert-a-government-shutdown.html", "country": "US", "domain_rank": 767, "title": "The four big fights Trump and Congress must resolve to avert a government shutdown", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T14:08:00.000+02:00", "replies_count": 0, "uuid": "3a5854b23987ace5f0842a05bbcb77376a3bfd2a"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/16/the-four-big-fights-trump-and-congress-must-resolve-to-avert-a-government-shutdown.html", "ord_in_thread": 0, "title": "The four big fights Trump and Congress must resolve to avert a government shutdown", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "david letterman", "sentiment": "none"}, {"name": "ralph northam", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "capitol hill", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}, {"name": "usa today", "sentiment": "none"}, {"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON — Congress has until Friday to reach an agreement on a thicket of thorny issues, and the talks don't appear to be going very smoothly right now.\nThat means President Trump and lawmakers on Capitol Hill are hurtling toward a government shutdown, with funding set to run out at midnight on Jan. 19.\nHere's a look at the four key obstacles lawmakers face in their efforts to forge a deal by Friday.\nSpending caps \nLawmakers are currently faced with tight budget caps, agreed to in 2011, that limit how much they can spend for the rest of fiscal year 2018 and beyond.\nMore from USA Today:\nRalph Northam pledges less toxic politics as Virginia's governor\nObama tells David Letterman: People no longer agree on what facts are\nHere are the members of Congress retiring at the end of 2018 \nBoth Republicans and Democrats want to lift those caps — GOP leaders want a big boost for defense; Democrats say any defense increase should be paired with an equal hike for domestic programs.\nHouse and Senate leaders have been negotiating for weeks over how much to increase the caps and how to divide the pot between defense and domestic spending. They insist the talks are going well, while offering no details.\n\"We think the solution is in sight,\" House Minority Leader Nancy Pelosi , D-Calif., told reporters on Thursday.\nHouse Speaker Paul Ryan , R-Wis., offered a similarly rosy assessment. But he noted that once they have settled on a top-line number, lawmakers on the appropriations committees in the House and Senate will need time to craft a spending bill that sets specific funding levels for every government agency and program.\nIn other words, Congress will almost certainly have to pass another short-term measure before Jan. 19 to buy themselves more time. Whether such a stop-gap funding bill could pass is unclear; opposition to a short-term deal is bubbling up from conservatives and liberals alike.\nThe Dreamers \nThe partisan debate over how to deal with the Dreamers — the 800,000 immigrants who were brought to the U.S. illegally as children — grew more acrimonious last week after President Trump allegedly called Haiti, El Salvador, and other African nations \"s__hole countries\" and suggested the U.S. should instead encourage more immigration from Norway, a predominately white country.\nGetty Images People protest in front of the U.S. Capitol to urge Congress to save the Deferred Action for Childhood Arrivals (DACA) program, on Dec. 6, 2017, in Washington, D.C. The remarks sparked a political uproar, with condemnation pouring in from Capitol Hill and around the globe even as Trump denied saying it and several Republicans who were in meeting also denied he said it or couldn't recall his exact words. Trump said he used \"tough\" language during the session, while Sen. Richard Durbin , D-Ill., said Trump's comments were \"vile\" and \"racist.\"\nOn Sunday, Trump tweeted that any deal to extend the Deferred Action for Childhood Arrivals program that protected Dreamers \"is probably dead because Democrats really don't want it.\" Trump charged Democrats were trying to take money away from the military.\n@realDonald Trump tweet \nDurbin and several other lawmakers had gone to the White House last Thursday to pitch an agreement they'd reached on immigration—granting the Dreamers a path to citizenship, allocating $2.7 billion for border security and tweaking a visa program open to applicants from countries with low immigration rates to the U.S.\nTrump rejected the deal, declaring it \"outlandish\" and a \"setback\" in a series of tweets on Friday morning. He accused Democrats of wanting to shut down the government over the immigration issue.\nSenate Democratic Leader Charles Schumer has insisted on attaching a Dreamers compromise to the spending bill, saying it's the only viable path to getting it done. Otherwise, he said, it will never pass the House, where many conservatives are opposed to extending protections to the Dreamers.\nSenate Republican Leader Mitch McConnell , R-Ky., said on Thursday that any immigration measure \"will not be a part of any overall spending agreement.\"\nThat leaves the two sides divided over substance as well as process — not to mention reeling over the \"shithole\" brouhaha.\nRead more: \nWhy Congress can't agree on how to fund the government \nDisaster aid \nAs if the negotiations weren't fraught enough, there are also sharp disagreements over a disaster aid package for Texas, Florida and other places devastated by hurricanes Harvey, Irma, and Maria.\nThe House approved an $81 billion bill last month to help western states recover from wildfires and southern states and U.S. territories rebuild from the hurricanes. But the Senate declined to take it up after concerns from Democrats that, among other issues, it did not go nearly far enough to help Puerto Rico, where more than a third of the island remains without electricity.\nEmily Kask | AFP | Getty Images Jenna Fountain carries a bucket down Regency Drive to try to recover items from their flooded home in Port Arthur, Texas, September 1, 2017. Lawmakers from Florida and Texas have been particularly adamant that a disaster aid bill must move soon and their support for a spending bill to keep the government open could ,be contingent on a deal that helps their battered region recover.\nHealth programs \nThe least controversial part of the negotiations: funding for community health centers and a children's health insurance program called CHIP.\nCHIP is a federal-state matching program that serves nearly nine million children whose families would otherwise not be able to afford insurance. Funding for the program expired on Sept. 30; Congress approved a short-term patch to prevent states from running out of cash, but it's not clear how long that money will last.\nLawmakers agree on the need for a long-term reauthorization of CHIP, but they disagree over how to cover the $14.5 billion annual cost.\nThe same goes for community health center funding. It ran out Sept. 30, and lawmakers have been bickering ever since about how to pay for a reauthorization that both parties say they want.\nThe centers provide health care to low-income Americans, charging for services on a sliding scale. There are 1,400 centers across the country, and they serve about 25 million Americans.\nIf Congress doesn't act soon, the National Association of Community Health Centers says 28,000 sites could close, more than 50,000 staff could be laid off, and 9 million individuals could close access to care.\nContributing: Ledyard King and Nicole Gaudiano, USA TODAY", "external_links": [], "published": "2018-01-16T14:08:00.000+02:00", "crawled": "2018-01-16T14:46:10.024+02:00", "highlightTitle": ""}