{"organizations": [], "uuid": "07cba607fdb0593508506f9505d2d6475c47d71d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180120&t=2&i=1223625812&w=1200&r=LYNXMPEE0J0GC", "site_section": "http://feeds.feedburner.com/reuters/UKTennisNews", "section_title": "Reuters: Tennis News", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-federer/federer-eases-past-gasquet-into-fourth-round-idUKKBN1F90LO", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Tennis-Federer eases past Gasquet into fourth round", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T15:35:00.000+02:00", "replies_count": 0, "uuid": "07cba607fdb0593508506f9505d2d6475c47d71d"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-federer/federer-eases-past-gasquet-into-fourth-round-idUKKBN1F90LO", "ord_in_thread": 0, "title": "UPDATE 1-Tennis-Federer eases past Gasquet into fourth round", "locations": [], "entities": {"persons": [{"name": "gasquet", "sentiment": "negative"}, {"name": "rod laver", "sentiment": "none"}, {"name": "federer", "sentiment": "none"}, {"name": "richard gasquet", "sentiment": "none"}, {"name": "roger federer", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "reuter", "sentiment": "negative"}, {"name": "federer   reuters staff", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 20, 2018 / 1:49 PM / a few seconds ago Federer eases past Gasquet into fourth round Reuters Staff 3 Min Read \nMELBOURNE (Reuters) - Roger Federer eased into the second week of the Australian Open for the 16th time after beating Richard Gasquet 6-2 7-5 6-4 in just under two hours on Saturday to remain on track for a 20th grand slam title. \nGasquet played a fine match, studded with his trademark occasional moments of shot-making brilliance, but a tally of 27 winners against 16 unforced errors was still not enough to put sustained pressure on the Swiss master. \nWatched from the stands by his hero Rod Laver, Federer shifted up the gears as and when required to outwit his French opponent on the main showcourt named in honour of the Australian 11-times grand slam champion. \nThe 36-year-old second seed was rather fortunate to clinch the match with a backhand winner after Gasquet had fired his shot off the net cord but he was undoubtedly a worthy winner, reaching the fourth round without conceding a set so far. \n“The match was close, tough games, the end could have gone to a tiebreaker then you never know,” Federer said on court. \n“I was able to be a bit more on the offensive than he was, maybe I was protecting my second serve a bit better than him.” \nFederer returned from a lengthy injury layoff to claim his fifth Australian Open title last year and 12 months on he was moving as freely and dominating much as he did in his heyday. DIFFERENT EXPECTATIONS Tennis - Australian Open - Rod Laver Arena, Melbourne, Australia, January 20, 2018. Richard Gasquet of France waves as he leaves after losing against Roger Federer of Switzerland. REUTERS/Thomas Peter \n“My expectations are a little different because I had a great season last year,” he added. \n“I‘m coming in this year well-equipped, fully fit, I know that five sets is not an issue this year, while last year that was a bit of a question mark.” Slideshow (4 Images) \nWhile a break for 3-1 with a forehand winner was enough for Federer to go on and secure the opening set after a Gasquet double fault, he bided his time in the second before striking at 6-5 up to break again and double his lead. \nGasquet had some misfortune with Hawkeye in the second set, having what looked like a decent challenge turned down because the system was not working before going down 2-0 when the rebooted technology showed he had gone long on set point. \nA Federer break in the second game of the third set was canceled out in the seventh when Gasquet grabbed his first break points, but once again the Swiss pounced to take the match by the scruff of the neck at the key moment. \nHe served out to love for 5-4 and, although Gasquet saved his first match point with a ninth glorious backhand winner, there was no denying Federer’s progress on his second. \nHe will next face his first career meeting with Hungarian Marton Fucsovics   \n“He came to train with me in Switzerland last year,” said Federer. “He was great, super nice guy, hard-working, he’s a great baseliner, really strong, so I‘m happy I know him a little bit.” Reporting by Nick Mulvenney in Sydney, Editing by Ken Ferris", "external_links": [], "published": "2018-01-20T15:35:00.000+02:00", "crawled": "2018-01-20T15:56:56.018+02:00", "highlightTitle": ""}