{"organizations": [], "uuid": "d13400d26fbafc120c8642f99d078b061f5c7ff3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/19/104955721-20180119-1688-2544.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/2018-might-be-the-year-of-the-great-crypto-rotation-tom-lee.html", "country": "US", "domain_rank": 767, "title": "2018 might be the year of the ‘Great Crypto Rotation:' Tom Lee", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.127, "site_type": "news", "published": "2018-01-30T02:10:00.000+02:00", "replies_count": 0, "uuid": "d13400d26fbafc120c8642f99d078b061f5c7ff3"}, "author": "Kellie Ell", "url": "https://www.cnbc.com/2018/01/29/2018-might-be-the-year-of-the-great-crypto-rotation-tom-lee.html", "ord_in_thread": 0, "title": "2018 might be the year of the ‘Great Crypto Rotation:' Tom Lee", "locations": [], "entities": {"persons": [{"name": "tom lee", "sentiment": "negative"}, {"name": "lee", "sentiment": "none"}], "locations": [{"name": "wall street", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "fundstrat global advisors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Bitcoin bull and Wall Street investor Tom Lee said this year is the beginning of the \"Great Crypto Rotation.\"\n\"We think 2018 is going to be a story about rotation,\" Lee told CNBC on \" Fast Money \" Monday night. \"But the rotation we're referring to is among the smaller alt -coins and the large platform tokens.\"\nLee, who is co-founder and head of research at Fundstrat Global Advisors and one of Wall Street's earliest investors in bitcoin, points to alt-coins, or smaller coins with a market cap of less than $3 billion, that have rallied more than 300 percent in the last four years, as evidence of the crypto-rotation trend.\n\"That generally marks a peak and then we start to see rotation into large cap-quality tokens,\" said Lee, who pointed out that in January 78 percent of small caps tokens rallied at least 300 percent in the last three months. \"We're starting to see this move into the top 10 tokens and that should actually help large caps rally.\"\nWhile bitcoin has been the market leader in digital currency, the popular cryptocurrency took a hit earlier this month when it lost more than a third of its value, plunging from its December high of $19,500 to less than $10,000. Meanwhile, other cryptocurrencies have done quite well during the same period.\nAlt-coin raiblocks, which has a market cap of less than $3 billion, is up nearly 600 percent. Other cryptocurrencies with higher market caps, including stellar, neo, ripple and ethereum, have also outperformed during the same period.\nThe rotation of cryptocurrencies allows investors who missed the initial wave of digital currency investment with bitcoin to invest in other digital currency assets, Lee said. And while bitcoin's specialty is \"digital gold,\" other digital coins dive into the larger crypto market, offering other options, such as that of payment systems.\nIn a note Lee said his firm considers bitcoin's fluctuating prices, \"very healthy given the strength of the gains seen in 2017.\"\nStill, bitcoin's value, Lee said, should reach $25,000 by the end of 2018.\nBitcoin was priced at more than $11,000 Thursday evening, where it has remained for more than a week.", "external_links": [], "published": "2018-01-30T02:10:00.000+02:00", "crawled": "2018-01-30T02:10:16.021+02:00", "highlightTitle": ""}