{"organizations": [], "uuid": "e8deb4d90c02773e8fe1b3de29cd2219b5d21c54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223395357&w=1200&r=LYNXMPEE0I1AZ", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-france-germany/merkel-and-macron-look-to-turn-warm-ties-into-reform-goals-idUKKBN1F81BE", "country": "US", "domain_rank": 408, "title": "Merkel upbeat SPD will approve talks with her conservatives", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T19:19:00.000+02:00", "replies_count": 0, "uuid": "e8deb4d90c02773e8fe1b3de29cd2219b5d21c54"}, "author": "", "url": "https://uk.reuters.com/article/uk-france-germany/merkel-and-macron-look-to-turn-warm-ties-into-reform-goals-idUKKBN1F81BE", "ord_in_thread": 0, "title": "Merkel upbeat SPD will approve talks with her conservatives", "locations": [], "entities": {"persons": [{"name": "merkel", "sentiment": "negative"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "macron", "sentiment": "none"}, {"name": "emmanuel macron", "sentiment": "none"}, {"name": "luke baker", "sentiment": "none"}], "locations": [{"name": "macron", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 12:15 PM / Updated 2 hours ago Merkel and Macron play up euro zone reform plans Luke Baker 4 Min Read \nPARIS (Reuters) - Chancellor Angela Merkel and President Emmanuel Macron talked up the prospect of agreeing reforms to the euro zone on Friday, saying they were committed to strengthening the single currency bloc and Europe as a whole. \nMerkel is in Paris for an evening of talks with Macron, after the two agreed at a European Union summit last month to draw up joint plans for the euro area by March. \nMacron has talked in the past about the need for a standalone budget and a single finance minister for the currency bloc, but he played down any technical discussions on Friday, saying the priority was to agree on the end-goal first. \n“If you begin by discussing the instruments without knowing what you want to do with them, there’s little chance of success,” he said. “That’s not how we in France have historically drawn up our budgets.” \nThe prospect of France and Germany, the economic and political drivers of Europe, agreeing reforms has risen on expectations Merkel will soon clinch another grand coalition with the centre-left Social Democrats (SPD). \n“Germany and France can and should take the lead on many questions (related to Europe) and therefore I understand that France is waiting that we have a new government,” said Merkel. \nWithout agreement between the two, whose nations account for 50 percent of euro zone output, any ambition to upgrade Europe’s economic and monetary union and help the bloc withstand future crises is unlikely to get off the ground. \nThis year is seen as a critical but narrow window, with the European Parliament holding elections and Britain’s exit from the European Union reaching its deadline in 2019. DETAILS TO BE WORKED OUT \nYet while Macron and Merkel have met and spoken by phone repeatedly in recent weeks, there is some way to go before a common position on the core issues can be reached. \nFrench Finance Minister Bruno Le Maire held talks with his German counterpart Peter Altmaier in Paris on Thursday, and said afterwards that an agreement may be difficult by March. French President Emmanuel Macron (R) greets German Chancellor Angela Merkel upon her arrival at the Elysee Palace in Paris, France, January 19, 2018. REUTERS/Charles Platiau \n“We have ... an immediate priority, which is the completion of the banking union, the completion of the capital markets union and tax convergence with Germany,” Le Maire said. \n“On these three issues, our goal is to reach a final joint position between March and June.” \nGermany and France often put on a show of political unity when it comes to the euro zone, but the devil is in the detail. \nMacron, elected in May on an avowedly pro-Europe platform, has set out grand plans, including suggesting at one point that the zone should have its own budget worth hundreds of billions of euros, an idea that does not sit well with Germany. Slideshow (5 Images) \nTalk of some sort of budget for the 19-country bloc remains, but its size - if it is ever agreed - is likely to be much smaller and it remains unclear how it would be established. \nThe idea of a single finance minister now appears to be a discussion for the future, and the suggestion that the euro zone’s 500-billion-euro ESM rescue fund be turned into a European Monetary Fund to stabilise member states facing economic shocks still needs to be fleshed out. \nMerkel, however, remained upbeat. \n“On a broad basis, there is absolutely no difference that I see,” she said, pointing out that the long-term ambition was a continent with strong finances, defences and foreign policy. \n”There are areas where France and Germany can take the lead, for example by creating a common corporate tax structure. \n“When I see what the United States is doing, time is pressing for such a project. We also want a stable euro zone and strong external border protection ... The euro zone must be avantgarde when it comes to competitiveness.” \nMacron struck a similar note. \n“We still have to define the details,” Macron said of the reform agenda. “That will be the subject of our discussions today and in the weeks and months to come, to define a path that will take us in that direction.” Additional reporting by Joseph Nasr in Berlin and Matthias Blamont in Paris; Editing by Andrew Roche and Richard Balmforth", "external_links": [], "published": "2018-01-19T19:19:00.000+02:00", "crawled": "2018-01-19T20:12:21.007+02:00", "highlightTitle": ""}