{"organizations": [], "uuid": "f59f9ba1df9633379a529bdef3923dcdf303440a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XF176_CWAND0_SOC_20180129100349.jpg", "site_section": "https://www.wsj.com/europe", "section_title": "The Wall Street Journal &amp; Breaking News, Business, Financial and Economic News, World News and Video", "url": "https://www.wsj.com/articles/chinas-tencent-jd-buy-into-wandas-shopping-empire-1517240215", "country": "US", "domain_rank": 387, "title": "China’s Tencent, JD Buy Into Wanda’s Shopping Empire", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-29T19:43:00.000+02:00", "replies_count": 0, "uuid": "f59f9ba1df9633379a529bdef3923dcdf303440a"}, "author": "Wayne Ma", "url": "https://www.wsj.com/articles/chinas-tencent-jd-buy-into-wandas-shopping-empire-1517240215", "ord_in_thread": 0, "title": "China’s Tencent, JD Buy Into Wanda’s Shopping Empire", "locations": [], "entities": {"persons": [{"name": "wang jianlin", "sentiment": "none"}, {"name": "wanda", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}], "organizations": [{"name": "tencent holdings ltd.", "sentiment": "negative"}, {"name": "jd.com inc.", "sentiment": "negative"}, {"name": "jd buy into wanda", "sentiment": "negative"}, {"name": "tencent", "sentiment": "negative"}, {"name": "alibaba group holding ltd.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS An investor group that includes China’s Tencent Holdings Ltd. and online retailer JD.com Inc. JD -1.82% is spending 34 billion yuan ($5.37 billion) for a 14% stake in Chinese billionaire Wang Jianlin’s commercial-property company as he faces a deadline to relist the business in China.\nWanda, China’s largest mall developer, is benefiting from an escalating war for consumers and data between Tencent and Alibaba Group Holding Ltd. BABA -1.92% , the country’s two largest internet companies. \nAlibaba has already established several partnerships with department-store and supermarket chains in China, and is seeking to integrate online retail with physical stores.\nTencent has invested in Alibaba’s online shopping rival JD.com, and the deal announced Monday gives both a partner in China’s shopping-mall business as they seek to blunt Alibaba’s move into physical stores. The traditional stores are seen as a way to attract new customers and, for Tencent and Alibaba, as a means to expand their mobile payment platforms.\n“The deal represents one of the world’s largest single strategic investments between internet companies and brick-and-mortar commercial giants,” parent company Dalian Wanda Group and the others said in a joint release. Other investors include electronics retailer Suning Commerce Group and fellow property developer Sunac Holdings Ltd.\nRead More \nU.S. Works on Foreign Deal Curbs Chinese Solar Firm to Build U.S. Plant U.S. Firms Say China’s Business Climate Is Warming, Survey Finds This month, Tencent signed a partnership agreement with French retailer Carrefour S.A. and a local supermarket chain, agreeing to take a stake in Carrefour’s Chinese entity. In Shanghai, it also is testing an unmanned pop-up store with consumers using mobile payments to complete the sale.\nJD will invest 5 billion yuan into Wanda Commercial Properties Co., the company said in a regulatory filing. JD took part in the deal to create multichannel approaches to shopping, a JD spokesman said.\nIn announcing the investment, Wanda said the aim was to speed up the adoption of its “asset-light” model that would allow it to earn income from managing properties instead of owning them.\nWanda Commercial raised 34.5 billion Hong Kong dollars ($4.34 billion) from private investors to delist the company’s Hong Kong shares in 2016, in the biggest take-private deal on the city’s exchange. Wanda’s aim was to relist the company in China, where big appetite from retail investors helps companies fetch higher valuations.\nLast year, Wanda came under fire from Beijing for its aggressive overseas deal-making, which curtailed the company’s ability to pay for overseas acquisitions and repay debt. To shore up its balance sheet, the company since has sold billions of dollars in assets both in China and abroad. Wanda’s Hong Kong-listed unit said Monday in a regulatory filing that it was selling two Australian real-estate projects as part of those efforts.\nWanda faced a September deadline to relist Wanda Commercial or repay investors in full plus interest of up to 10%, a person familiar with the transaction said.\nThe investors’ stake, which collectively equals 14%, will be transferred to the new group and could clear a path for regulators to approve Wanda Commercial’s relisting in Shanghai. The sale also represents a 22% premium over what investors originally paid to delist the stake.\nWrite to Wayne Ma at wayne.ma@wsj.com and Liza Lin at Liza.Lin@wsj.com", "external_links": [], "published": "2018-01-29T19:43:00.000+02:00", "crawled": "2018-01-30T00:31:13.003+02:00", "highlightTitle": ""}