{"organizations": [], "uuid": "67c8c212f071b5924a369c32b2139d1696df3bbf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219527018&w=1200&r=LYNXMPEE040CB", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/global-oil/oil-dips-away-from-2015-highs-as-doubts-emerge-over-rally-idINKBN1EU0K1", "country": "US", "domain_rank": 408, "title": "Oil dips away from 2015 highs as doubts emerge over rally", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T08:51:00.000+02:00", "replies_count": 0, "uuid": "67c8c212f071b5924a369c32b2139d1696df3bbf"}, "author": "", "url": "https://in.reuters.com/article/global-oil/oil-dips-away-from-2015-highs-as-doubts-emerge-over-rally-idINKBN1EU0K1", "ord_in_thread": 0, "title": "Oil dips away from 2015 highs as doubts emerge over rally", "locations": [], "entities": {"persons": [{"name": "henning gloystein", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "oklahoma", "sentiment": "none"}, {"name": "guthrie", "sentiment": "none"}], "organizations": [{"name": "min read  singapore", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}, {"name": "devon energy production company", "sentiment": "none"}, {"name": "organization of the petroleum exporting countries", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 6:55 AM / Updated an hour ago Oil dips away from 2015 highs as doubts emerge over rally Henning Gloystein 3 Min Read \nSINGAPORE (Reuters) - Oil prices fell on Friday, dropping away from highs last seen in 2015, as soaring U.S. production undermined a 10-percent rally from lows hit in December that was driven by tightening supply and political tensions in OPEC member Iran. A pump jack operates at a well site leased by Devon Energy Production Company near Guthrie, Oklahoma, U.S., September 15, 2015. REUTERS/Nick Oxford/Files \nU.S. West Texas Intermediate (WTI) crude futures were at $61.95 a barrel at 0619 GMT. That was 6 cents below their last close, though still near the $62.21-high reached the previous day, which was their strongest since May, 2015. \nBrent crude futures were at $67.99 a barrel, 8 cents below their last settlement, but still not far off the $68.27-peak from the day before, also the highest since May, 2015. \nTraders said political tensions in Iran, the third-largest producer in the Organization of the Petroleum Exporting Countries (OPEC), had pushed prices higher. \n“The protests in Iran add more fuel to the already bullish oil market mood,” said Norbert Ruecker, head of commodity research at Swiss bank Julius Baer. \nOil prices have received general support from production cuts led by OPEC and by Russia, which started in January last year and are set to last through 2018, as well as from strong economic growth and financial markets. \nThat has helped tighten markets. U.S. commercial crude inventories fell by 7.4 million barrels in the week to Dec. 29, to 424.46 million barrels, according to data from the Energy Information Administration (EIA). \nThat is down 20 percent from their historic peaks last March and close to the five-year average of 420 million barrels. CAN THE BULL-RUN LAST? \nYet given Iran’s oil production has not been affected by the unrest, and that U.S. output will likely break through 10 million barrels per day (bpd) soon, a level so far only reached by Saudi Arabia and Russia, doubts are emerging whether the bull-run can last. \nU.S. investment bank Jefferies said in a note on Friday that the oil price “upside from here is not obvious to us”, although it added that “we believe the oil market will remain undersupplied through 2018”. \nRuecker of Julius Baer said crude prices above $60 per barrel project an “overly rosy picture (as) oil production disruptions (in Iran) remain a very distant threat ... disruptions in the North Sea have been removed ... (and) U.S. oil production surpassed the 2015 highs in October and is set to climb to historic highs this year.” \nLukman Otunuga, analyst at futures brokerage FXTM, struck a similarly cautious tone. \n“Oil started the New Year on an incredibly bullish note ... in part due to ongoing tensions in Iran ... (and) over OPEC’s supply cut rebalancing the markets,” he said. \n“While the current momentum suggests that further upside is on the cards, it must be kept in mind that U.S. shale remains a threat to higher oil prices.” Reporting by Henning Gloystein; Editing by Christian Schmollinger and Joseph Radford", "external_links": [], "published": "2018-01-05T08:51:00.000+02:00", "crawled": "2018-01-05T09:18:06.000+02:00", "highlightTitle": ""}