{"organizations": [], "uuid": "5a96fac99b9b02ad87d0ca3cb204dee4f733a684", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222634056&w=1200&r=LYNXMPEE0G09I", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-tennis-ausopen-wozniacki/tennis-second-seed-wozniacki-fights-back-from-the-brink-idUSKBN1F60H5", "country": "US", "domain_rank": 408, "title": "Tennis: Second seed Wozniacki fights back from the brink", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T07:34:00.000+02:00", "replies_count": 0, "uuid": "5a96fac99b9b02ad87d0ca3cb204dee4f733a684"}, "author": "", "url": "https://www.reuters.com/article/us-tennis-ausopen-wozniacki/tennis-second-seed-wozniacki-fights-back-from-the-brink-idUSKBN1F60H5", "ord_in_thread": 0, "title": "Tennis: Second seed Wozniacki fights back from the brink", "locations": [], "entities": {"persons": [{"name": "wozniacki", "sentiment": "negative"}, {"name": "kiki bertens", "sentiment": "none"}, {"name": "jana fett", "sentiment": "none"}, {"name": "peter rutherford", "sentiment": "none"}, {"name": "nicole gibbs", "sentiment": "none"}, {"name": "caroline wozniacki", "sentiment": "none"}, {"name": "nick mulvenney", "sentiment": "none"}, {"name": "fett", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "rod laver arena", "sentiment": "none"}, {"name": "melbourne park", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 5:38 AM / Updated 9 hours ago Second seed Wozniacki battles back from the brink Reuters Staff 3 Min Read \nMELBOURNE (Reuters) - Second seed Caroline Wozniacki saved two match points as she battled back from 5-1 down in the deciding set to beat Melbourne Park debutante Jana Fett 3-6 6-2 7-5 in the second round of the Australian Open on Wednesday. \nFormer world number one Wozniacki was simply outplayed by the Croatian for large parts of the match but rallied when the 21-year-old blinked and knocked off six straight games on the trot avert the upset and claim her place in the third round. \n“That was crazy, I don’t know how I got back into the match,” said a relieved Wozniacki. \n”I‘m very proud of the way I came back. It was definitely very difficult. Definitely wasn’t my best match, especially in the beginning. \n“All of a sudden seeing myself down, almost out of the tournament, I started playing better and started really playing the tennis that I wanted to play.” \nFett, ranked 119th in the world, played some brilliant shots throughout the contest and rattled off eight straight points to win the opening set in 33 minutes. \nFired by the first of two rows with umpire Richard Haigh over delayed challenges, Wozniacki worked her way back into the contest to take the second stanza when Fett hit a return long. \nThe Croatian refused to fade away, though, and Wozniacki threw her racket to the ground in disgust after being broken for 3-1 with Fett driving home her advantage to stand on the brink of the third round at 5-1 40-15 up. \n“I was thinking at that point she still has to win four more balls to win this match,” said Wozniacki. \n”I felt like I was one foot out of the tournament. She served a great serve down the T, as well. It was just slightly out. I was kind of lucky. \n“Then I felt her tighten up just slightly. I thought to myself ... ‘make her win it, don’t give it to her’.” \nFett twice served for the match but nerves got the better of her both times and Wozniacki took full advantage to set up a third-round meeting with Belgian Kiki Bertens. \nThe Dane looked every inch the world number two as she briskly served out for victory, which came when a crestfallen Fett dumped a backhand into the net after a shade over two and a half hours in the sun on Rod Laver Arena. \n“Tennis is a very mental game,” said Wozniacki, playing her 11th straight Australian Open as she continues her quest for a maiden grand slam title. \n”Throughout my career (I’ve tried to) keep playing one point at a time. It gets old, but that’s really how I’ve tried to go through my career. \n“It’s going to be ups and downs, rough patches, and everything. But I feel like if you really work hard, you stay focused on your own path, eventually it’s going to turn.” Reporting by Nick Mulvenney in Sydney, editing by Peter Rutherford/Amlan Chakraborty", "external_links": [], "published": "2018-01-17T07:34:00.000+02:00", "crawled": "2018-01-17T07:40:49.030+02:00", "highlightTitle": ""}