{"organizations": [], "uuid": "4bd899ab956f6b449977eff1a8ac012a1c56c6d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/02/104924785-GettyImages-886861120.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/coinbase-investor-todd-chaffee-ivp-avoiding-icos.html", "country": "US", "domain_rank": 767, "title": "Coinbase investor Todd Chaffee of IVP is avoiding ICOs", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.198, "site_type": "news", "published": "2018-01-26T23:37:00.000+02:00", "replies_count": 0, "uuid": "4bd899ab956f6b449977eff1a8ac012a1c56c6d6"}, "author": "Ari Levy", "url": "https://www.cnbc.com/2018/01/26/coinbase-investor-todd-chaffee-ivp-avoiding-icos.html", "ord_in_thread": 0, "title": "Coinbase investor Todd Chaffee of IVP is avoiding ICOs", "locations": [], "entities": {"persons": [{"name": "todd chaffee", "sentiment": "negative"}, {"name": "alain pitton", "sentiment": "negative"}, {"name": "coinbase", "sentiment": "none"}, {"name": "chaffee", "sentiment": "none"}], "locations": [{"name": "san fran", "sentiment": "none"}], "organizations": [{"name": "ivp", "sentiment": "negative"}, {"name": "sec", "sentiment": "none"}, {"name": "ico", "sentiment": "none"}, {"name": "ecb", "sentiment": "none"}, {"name": "us federal reserve", "sentiment": "none"}, {"name": "institutional venture partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "After leading Coinbase's $100 million financing round last year, venture capitalist Todd Chaffee is closely eyeing other blockchain companies, but he's less inclined to bet on cryptocurrencies.\nCoinbase is a crypto trading platform that provides a place for investors to store their digital currencies. According to a story earlier this week from Recode , Coinbase surpassed $1 billion in revenue in 2017, thanks to the surging popularity of bitcoin, ethereum and other digital tokens.\nLast year also saw the rise of initial coin offerings , with hundreds of blockchain project raising billions of dollars in total by selling niche unregulated tokens that, in some cases, the SEC shut down because they looked too much like securities.\n\"We do have a real bubble situation with the ICO,\" said Chaffee, a partner at Institutional Venture Partners, in a session on Friday at the Blockchain Connect Conference in San Francisco. \"We're careful with the cryptocurrency aspect. We're much more interested in the infrastructure.\"\nChaffee compared the current state of blockchain to the early days of the Internet, when companies like AOL, Amazon , Google and Yahoo were creating the building blocks for further development and when Verisign was establishing a way for people to buy and secure domains.\nIVP, which has backed companies including Twitter , Snap and Netflix , invested in Coinbase in August at a $1.6 billion valuation. Chaffee said that the company, like other start-ups in IVP's portfolios, was in the top 1 percent of deals the firm has seen. He said that 90 percent of companies the firm meets \"don't make the cut,\" and about 9 percent are interesting but may not be the right fit.\nshow chapters Trading temporarily goes down at Coinbase      5:31 PM ET Fri, 22 Dec 2017 | 00:37 \"The top 1 percent is where it's very clearly a fantastic company,\" he said. \"It's not so much should we invest, but more a question of can we invest.\"\nCoinbase has had its share of problems. The network has been overloaded with transactions at times, including one day in December when trades were shut down for two hours. \nWith blockchain, Chaffee said it's possible that someday we get to a point where there's a working peer-to-peer network that doesn't require centralized institutions to manage transactions and provide security and financial tools. People may eventually just trust the code and not need intermediaries or private companies backed by venture capitalists.\n\"We're a long way away from that,\" he said.", "external_links": [], "published": "2018-01-26T23:37:00.000+02:00", "crawled": "2018-01-26T23:39:26.003+02:00", "highlightTitle": ""}