{"organizations": [], "uuid": "e05d976b52bdcf0d260db127f0ece5e01376f998", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/02/104748027-GettyImages-158924758.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100727362/device/rss/rss.html", "section_title": "World News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/19/opec-oil-price-rally-wont-persuade-cartel-to-end-output-cuts-analyst-says.html", "country": "US", "domain_rank": 767, "title": "OPEC: Oil price rally won't persuade cartel to end output cuts, analyst says", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T17:26:00.000+02:00", "replies_count": 0, "uuid": "e05d976b52bdcf0d260db127f0ece5e01376f998"}, "author": "Sam Meredith", "url": "https://www.cnbc.com/2018/01/19/opec-oil-price-rally-wont-persuade-cartel-to-end-output-cuts-analyst-says.html", "ord_in_thread": 0, "title": "OPEC: Oil price rally won't persuade cartel to end output cuts, analyst says", "locations": [], "entities": {"persons": [{"name": "richard mallinson", "sentiment": "none"}, {"name": "mallinson", "sentiment": "none"}], "locations": [], "organizations": [{"name": "opec", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "energy aspects", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The recent uptick in oil prices is not likely to be enough to persuade OPEC to end production cuts this summer, Richard Mallinson, geopolitical analyst at Energy Aspects, told CNBC on Friday.\nCrude futures have climbed to highs not seen since the early days of a slump in December 2014, prompting some analysts to suggest the recent price rally could hasten the process of OPEC devising an exit strategy. Brent crude futures hit a peak of $70.37 a barrel on Monday, with the global benchmark since paring some of its recent gains to trade at $68.90 on Friday afternoon.\nHowever, when asked at what stage oil traders could expect OPEC to begin phasing out the current level of production cuts, Mallinson said the major oil producing group would need to wait until the middle of 2018 before it could \"confidently\" feel the market had leveled out.\nNonetheless, he did not expect the 14-member cartel to end its deal with 10 other allied producers in June.\n\"We will see compliance drop in the second half of the year (so) they are going to want to really cement the gains they have made and the rebalancing they have achieved,\" he added.\nBig banks raise oil price targets In recent weeks, big investment banks have raised their target price for oil as crude futures have risen to multi-year highs.\nBank of America Merrill Lynch and Morgan Stanley both upped their forecasts for crude prices this week, while Goldman Sachs said the risks of prices overshooting its current targets are mounting.\nPaul Giamou | Aurora | Getty Images Pumpjacks in an oil field. The main price driver has been a supply cut from OPEC and Russia, who started to withhold output in January last year. The OPEC-led production cuts , that are scheduled to last throughout 2018, are aimed at clearing a supply overhang and propping up prices.\nOPEC is next scheduled to meet in Vienna, Austria, on June 22.\nMallinson said that while it was understandable for oil traders to be wary of the group's summer meeting, he emphasized they would be mistaken in thinking the major oil producing group's only options were to either stick with the current level of supply cuts or to allow flat-out global production.\nThe price of oil collapsed from near $120 a barrel in June 2014 due to weak demand, a strong dollar and booming U.S. shale production. OPEC's reluctance to cut output was also seen as a key reason behind the fall. But, the oil cartel soon moved to curb production — along with other oil-producing nations — in late 2016.\n— CNBC's Tom DiChristoper contributed to this report.", "external_links": [], "published": "2018-01-19T17:26:00.000+02:00", "crawled": "2018-01-19T16:52:25.028+02:00", "highlightTitle": ""}