{"organizations": [], "uuid": "b8d573046c4053009b7d5ea94bde32bde33e1305", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-viking-group-announces-plans-for-new-global-headquarters-and-rd-center-in-west-michigan.html", "country": "US", "domain_rank": 767, "title": "Viking Group Announces Plans for New Global Headquarters and R&D Center in West Michigan", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.135, "site_type": "news", "published": "2018-01-22T22:00:00.000+02:00", "replies_count": 0, "uuid": "b8d573046c4053009b7d5ea94bde32bde33e1305"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-viking-group-announces-plans-for-new-global-headquarters-and-rd-center-in-west-michigan.html", "ord_in_thread": 0, "title": "Viking Group Announces Plans for New Global Headquarters and R&D Center in West Michigan", "locations": [], "entities": {"persons": [{"name": "james golinveaux", "sentiment": "none"}], "locations": [{"name": "mich.", "sentiment": "none"}, {"name": "west michigan grand rapids", "sentiment": "none"}, {"name": "grand rapids", "sentiment": "none"}, {"name": "hastings", "sentiment": "none"}, {"name": "caledonia township", "sentiment": "none"}, {"name": "west michigan", "sentiment": "none"}], "organizations": [{"name": "viking group announces plans for new global headquarters", "sentiment": "negative"}, {"name": "viking group", "sentiment": "none"}, {"name": "viking group , inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GRAND RAPIDS, Mich., Jan. 22, 2018 /PRNewswire/ -- As part of an overall strategy for its sustained and long-term growth, fire protection product manufacturer and distributor Viking Group , Inc. announced plans today to build a new facility in Caledonia Township, situated between the company's existing facilities in Hastings and Grand Rapids. Slated for completion in early 2019, the new global headquarters will feature a modern, professional work environment designed to promote creativity, innovation and collaboration, and will also include an expanded, state-of-the-art research and development center.\n\"The expansion of our West Michigan footprint is an investment not only in the communities we are proud to call home, but in our employees, who are the key to our continued success,\" said Viking Group President and CEO James Golinveaux. \"The new facility will free up space in our Hastings location, which will continue to house manufacturing operations, and will be conducive to the future expansion of our manufacturing footprint.\"\nThe yet-to-be-finalized site, located near M-6 and M-37 in Caledonia, will provide a significant upgrade to Viking Group's R&D infrastructure, including cutting-edge design, engineering and testing capabilities, paving the way for future product innovation. Additionally, the new building will feature a high-tech training facility to support the organization's goal of becoming the recognized leader in fire protection training.\nViking Group expects nearly 100 people will move from its Grand Rapids and Hastings offices into the Caledonia location once the new building is completed. To accommodate anticipated future growth, the company also expects to add at least 50 new jobs in the next few years to support its expanding business both in the U.S. and internationally. Viking's commercial and residential products, including industry leading fire sprinklers, valves and fire protection devices, are currently sold in more than 90 countries.\nThe Right Place assisted Viking Group in identifying the M-37 corridor in Caledonia Township due to its close proximity to both its Hastings campus and Grand Rapids offices. \"We want to thank The Right Place for their assistance with this strategic project. Their guidance and knowledge provided the support we needed to fulfill this vision,\" said Golinveaux.\n\"We knew that Viking wanted to stay close to its Hastings operations while maintaining its presence in the Grand Rapids area, so we felt that the Southeast Grand Rapids area, with M-37 access, would be ideal,\" said Thad Rieder, Senior Business Development Manager, The Right Place. \"We're excited to see what this state-of-the-art headquarters facility, with world-class R&D and training facilities, will do for the forward-thinking Viking.\"\n\"As our organization and industry continue to grow, and we develop more sophisticated technology to precisely detect and suppress fires, it's crucial that our manufacturing capacity keeps pace,\" Golinveaux added. \"Viking Group considers West Michigan the ideal region to support our future expansion and to attract and retain world-class talent, and this investment is a demonstration of that belief.\"\nFor more information on Viking Group, visit www.vikinggroupinc.com .\nAbout Viking Group, Inc.\nViking is a global leader in the manufacture and distribution of innovative fire protection and life safety systems. For nearly 100 years the company's products and services have protected lives and property worldwide from the devastating effects of fire. For more information on Viking's complete line of fire protection products and services, please visit www.vikinggroupinc.com or call 800-968-9501.\nAbout The Right Place, Inc.\nThe Right Place, Inc., is a regional nonprofit economic development organization founded in 1985 and supported through investments from the private and public sector. Its mission is to promote economic growth in the areas of quality employment, productivity, and technology in West Michigan by developing jobs through leading business retention, expansion and attraction efforts. For more information, visit: www.rightplace.org .\nView original content with multimedia: http://www.prnewswire.com/news-releases/viking-group-announces-plans-for-new-global-headquarters-and-rd-center-in-west-michigan-300585594.html\nSOURCE Viking Group, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/viking-group-announces-plans-for-new-global-headquarters-and-rd-center-in-west-michigan-300585594.html", "http://www.vikinggroupinc.com/", "http://www.rightplace.org/"], "published": "2018-01-22T22:00:00.000+02:00", "crawled": "2018-01-22T23:22:54.038+02:00", "highlightTitle": ""}