{"organizations": [], "uuid": "954520e7463e8ebb13e3cfd3b197e7b0493ca041", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/britain-stocks-factors/update-1-uk-stocks-factors-to-watch-on-jan-11-idUSL4N1P62ON", "country": "US", "domain_rank": 408, "title": "UPDATE 1-UK Stocks-Factors to watch on Jan 11", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T09:43:00.000+02:00", "replies_count": 0, "uuid": "954520e7463e8ebb13e3cfd3b197e7b0493ca041"}, "author": "", "url": "https://www.reuters.com/article/britain-stocks-factors/update-1-uk-stocks-factors-to-watch-on-jan-11-idUSL4N1P62ON", "ord_in_thread": 0, "title": "UPDATE 1-UK Stocks-Factors to watch on Jan 11", "locations": [], "entities": {"persons": [{"name": "barratt", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}], "organizations": [{"name": "tesco", "sentiment": "none"}, {"name": "marks & spencer", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "jupiter fund management", "sentiment": "none"}, {"name": "tesco", "sentiment": "none"}, {"name": "barratt", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds company news items and futures)\nJan 11 (Reuters) - Britain’s FTSE 100 futures were up 0.20 percent ahead of the cash market open.\n* TESCO: Tesco reported a 1.9 percent rise in like-for-like sales in its home market for the Christmas period, falling short of market forecasts after strong growth in fresh food was offset by lower demand for general merchandise.\n* MARKS & SPENCER: British retailer Marks & Spencer reported a slightly better than expected fall in clothing and homeware sales in the key Christmas quarter and said its overall guidance for its full 2017-18 year was unchanged.\n* JUPITER FUND MANAGEMENT: Jupiter Fund Management said on Thursday that its total assets rose 3.7 percent in the fourth quarter, boosted by market gains and net inflows of new money.\n* BARRATT: Britain’s biggest housebuilder Barratt said its sales rate remained flat in the last six months of 2017 compared to the same period a year earlier.\n* PREMIER OIL: Premier Oil said on Thursday it expects to output to rise by more than 10 percent in 2018 to up to 85,000 barrels of oil equivalent per day (boe/d) as the Catcher oilfield in the North Sea ramps up.\n* ULTRA ELECTRONICS: British defence contractor Ultra Electronics, which has warned of lower defence orders in the country, said on Thursday it had significant exposure to a rising U.S. defence budget, and had seen growing demand for advanced technologies.\n* HAYS: British staffing company Hays Plc reported higher quarterly net fees on Thursday, helped by strong performance in its international businesses.\n* GVC HOLDINGS: Online gambling firm GVC Holdings, which sealed a deal to buy Ladbrokes Coral last month, said it expects 2017 core earnings to be at the top end of its internal expectations on strong trading in the fourth quarter.\n* BOOHOO.COM: British online fashion retailer Boohoo.com Plc on Thursday raised its full-year sales forecast after doubling its revenue for the four months ended December.\n* CARILLION: The UK government revealed it has drawn up contingency plans to deal with the possible collapse of Carillion, as the company was locked in emergency talks with creditors, the Financial Times reported on Thursday. on.ft.com/2AQpeYg\n* BRITAIN EMPLOYMENT: Britain’s forthcoming exit from the European Union was the main reason for a 37 percent decline in new jobs available in London’s financial sector last month, according to a report from recruiting firm Morgan McKinley released on Thursday.\n* BRITAIN ENERGY: A record number of British energy customers switched supplier last year, data from industry group Energy UK showed on Thursday.\n* GOLD: Gold prices rose for a second day on Thursday, extending the gains in the previous session when prices climbed to the highest since September, as dollar weakness and a flagging rally in equities enticed investors to buy the yellow metal.\n* OIL: Oil prices held near three-year highs on Thursday, supported by a surprise drop in U.S. production and lower crude inventories, although analysts increasingly warned of signs that fuel markets have overheated.\n* EX-DIVS: Sky Plc will trade without entitlement to their latest dividend pay-out on Thursday, trimming 0.40 points off the FTSE 100 according to Reuters calculations.\n* The UK blue chip FTSE 100 index closed up 0.2 percent at 7,748.51 points on Wednesday, as a rise in banks and oil stocks boosted the index to a fresh record as climbing bond yields supported financials across Europe.\n* For more on the factors affecting European stocks, please click on: cpurl://apps.cp./cms/?pageId=livemarkets\nTODAY‘S UK PAPERS\n> Financial Times\n> Other business headlines Multimedia versions of Reuters Top News are now available for: * 3000 Xtra : visit topnews.session.rservices.com * For Top News : topnews.reuters.com (Reporting by Siju Varghese)\n ", "external_links": [], "published": "2018-01-11T09:43:00.000+02:00", "crawled": "2018-01-11T10:10:24.019+02:00", "highlightTitle": ""}