{"organizations": [], "uuid": "c2e804169783de6e0be12f23e9e9659de89732b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222441526&w=1200&r=LYNXMPEE0F105", "site_section": "https://www.reuters.com/places/africa", "section_title": "Reuters.com | Africa", "url": "https://www.reuters.com/article/uk-europe-migrants-macron/ahead-of-uk-summit-macron-visits-migrants-in-port-of-calais-idUSKBN1F515Y", "country": "US", "domain_rank": 408, "title": "Macron promises steps on Calais migration, acknowledges Brexit worries", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.013, "site_type": "news", "published": "2018-01-16T19:05:00.000+02:00", "replies_count": 0, "uuid": "c2e804169783de6e0be12f23e9e9659de89732b1"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/uk-europe-migrants-macron/ahead-of-uk-summit-macron-visits-migrants-in-port-of-calais-idUSKBN1F515Y", "ord_in_thread": 0, "title": "Macron promises steps on Calais migration, acknowledges Brexit worries", "locations": [], "entities": {"persons": [{"name": "emmanuel macron", "sentiment": "neutral"}, {"name": "macron", "sentiment": "neutral"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "calais", "sentiment": "none"}, {"name": "calais", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "hauts-de-france", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CALAIS, France (Reuters) - French President Emmanuel Macron promised to stem the flow of migrants through the port of Calais on Tuesday, saying there would be no return to the “jungle” migrant camp, and said he understood the region’s concerns about the threat from Brexit.\nAddressing security forces in Calais, which has borne the brunt in France of an influx of migrants and refugees from Africa and the Middle East in recent years, Macron said he would bolster resources to ensure police had what they needed to maintain security while enforcing a “fair” migration policy.\n“There will be no return to ‘the jungle’,” said Macron, referring to the squalid tented encampment on the outskirts of Calais that once housed up to 8,000 migrants before it was bulldozed by the French authorities in October 2016.\nMacron earlier visited a migrant reception centre near Calais and spoke to both refugees and local officials to hear about the pressures on the town and its surrounding Hauts-de-France region, one of the poorest in the country.\nThe visit comes ahead of a summit with Prime Minister Theresa May in Britain on Thursday, when the two are expected to address Brexit, migration and the 2003 Le Touquet accord, a reciprocal border agreement that has drawn criticism in France.\nMacron is expected to push Britain to provide further money and resources to tackle the migrant flow since many of those assembling in Calais are ultimately trying to enter Britain, just 33 km (20 miles) across the English Channel.\nUnder the Le Touquet treaty, Britain has its border in France and France runs border checks in Britain, a deal that French officials feel favours the United Kingdom. Both parties can withdraw from the treaty, which would mean a return to hard national borders, a move that would symbolically cut Britain off from the continent just as it is implementing Brexit.\nBREXIT IMPACT Pro-Brexit lawmakers from Britain’s governing Conservative Party have dismissed as “absurd” suggestions that London should pay more, saying Britain already provides extra security to France, including border infrastructure.\nFrench President Emmanuel Macron delivers a speech to police officers and gendarmes in the Gendarmerie headquarters in Calais, northern France, January 16, 2018. REUTERS/Benoit Tessier The issue is a sensitive one in France, too, since Calais and the region around have benefited from close ties between Britain and France since the Channel Tunnel was built.\nWith unemployment in the area well above France’s average, the concern is that Brexit and tighter borders could have a further negative impact on jobs and growth.\nMacron acknowledged those concerns, saying he was aware of local fears over Britain’s exit from the EU in March 2019.\nSlideshow (2 Images) “I know how worried many business sectors are about the possible consequences of Brexit, from fisheries to industry and logistics,” he said. “The region’s interests will be fully taken into account in the talks and negotiations France will have.”\nWhile trying to stem the flow of migrants to Calais and find a way to share the burden of asylum applications with Britain and other EU states, Macron plans to tighten French immigration rules via new legislation in the coming weeks.\nCatholic groups and migration charities have criticised his government for taking a hard line, accusing policymakers of planning “mass deportations”. Far-right groups, which have gained ground in Hauts-de-France, point out that asylum applications touched 100,000 in 2017, a new high.\nMacron struck a tough tone in response, saying he would punish excessive use of force by police if proven true, but dismissed some of the allegations as “lies” and said the government would sue for slander any unfounded claim.\nMeeting migrants from Sudan who had reached France via Italy and Libya, Macron sympathised with their plight and said France needed to find a balance between humanitarian care and a firm application of the law.\n“We have a responsibility to protect those who are in danger,” he was Quote: d as saying by BFMTV. “(But) we can’t welcome millions of people who live in peace in their countries.”\nReporting by Marine Pennetier in Calais; Additional reporting by Matthias Blamont and Michel Rose in Paris; Writing by Luke Baker; Editing by Richard Lough and Alison Williams\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-16T19:05:00.000+02:00", "crawled": "2018-01-16T23:06:03.001+02:00", "highlightTitle": ""}