{"organizations": [], "uuid": "7ecd1936703ba62c9c7dde1bd298c1c463ebcc0e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/20/104786223-RTS1GPZB.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/trump-and-senators-talk-immigration-after-government-shutdown-deal.html", "country": "US", "domain_rank": 767, "title": "Trump and senators talk immigration after government shutdown deal", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.473, "site_type": "news", "published": "2018-01-23T00:44:00.000+02:00", "replies_count": 0, "uuid": "7ecd1936703ba62c9c7dde1bd298c1c463ebcc0e"}, "author": "Jacob Pramuk", "url": "https://www.cnbc.com/2018/01/22/trump-and-senators-talk-immigration-after-government-shutdown-deal.html", "ord_in_thread": 0, "title": "Trump and senators talk immigration after government shutdown deal", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "david perdue", "sentiment": "negative"}, {"name": "thom tillis", "sentiment": "negative"}, {"name": "john kelly", "sentiment": "none"}, {"name": "chuck schumer", "sentiment": "none"}, {"name": "manchin", "sentiment": "none"}, {"name": "schumer", "sentiment": "none"}, {"name": "stephen miller", "sentiment": "none"}, {"name": "joe manchin", "sentiment": "none"}, {"name": "doug jones", "sentiment": "none"}], "locations": [{"name": "d-w.v.", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "none"}, {"name": "democrats", "sentiment": "none"}, {"name": "nbc news", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump started fresh immigration talks with senators on Monday as bipartisan lawmakers struck a deal to end the U.S. government shutdown that hinged largely on their ability to reach an immigration compromise.\nTrump \"continued conversations on the next steps on responsible immigration reform\" during a lunch with Republican senators Monday, White House press secretary Sarah Huckabee Sanders said in a statement. The president will work with bipartisan lawmakers \"committed to fixing our broken immigration system,\" she said.\nHere's who attended the first meeting, according to Sanders:\nSenate Majority Whip John Cornyn, R-Texas Sen. Tom Cotton, R-Ark. Sen. Chuck Grassley, R-Iowa Sen. James Lankford, R-Okla. Sen. David Perdue, R-Ga. Sen. Thom Tillis, R-N.C. Trump had a second meeting on immigration later in the day with Sens. Joe Manchin, D-W.V., and Doug Jones, D-Ala. Those Democrats are notable because they represent two of the deepest red states in the country. Manchin is up for re-election this year.\nIt is unclear what specifically Trump discussed with the senators at either meeting. White House chief of staff John Kelly and policy aide Stephen Miller — two officials who even some Republicans have criticized for their tough immigration stances — attended both meetings, according to NBC News.\nEarlier Monday, Senate Minority Leader Chuck Schumer said Democrats would vote to fund the government until Feb. 8 under the assurance that the chamber would take up an immigration bill by that date, even if lawmakers cannot reach a compromise. Schumer said he was \"confident\" a bipartisan immigration bill could win 60 votes in the Senate.\nWhether such a plan would get the blessing of the White House and more conservative House is more doubtful.\nDemocrats have pushed to pass a bill to protect hundreds of thousands of young undocumented immigrants from deportation in tandem with government funding, which partly led to Congress' failure to approve a spending plan before Saturday's government shutdown deadline. In an immigration bill, Republicans want increased border security funding and changes to extended family migration and the visa \"lottery\" system.\nThe Obama-era Deferred Action for Childhood Arrivals, which shielded certain immigrants brought to the U.S. illegally as children and allowed them to work, will start to phase out on March 5. Trump announced his decision to end the program in September.\nEarlier this month, Trump told bipartisan lawmakers to strike an immigration deal that he would subsequently sign. Two days later, Sens. Lindsey Graham, R-S.C., and Dick Durbin, D-Ill., presented him a deal they brokered, but he rejected it.\nOn Friday, Schumer attempted to negotiate an immigration deal with Trump, to no avail. Kelly called the New York Democrat to tell him his terms were too liberal for the GOP.\nSchumer later said he put funding for Trump's proposed border wall on the table. It was previously a dealbreaker for many Democrats, but they have warmed to the proposal as the prospects of an immigration deal became dimmer.\nThe Republican attendees of Trump's lunch meeting are notable. Cotton has publicly ripped the terms of the Durbin-Graham deal.\nBoth Cotton and Perdue, Trump allies in the Senate, also stood up for the president after Durbin said he called African nations \"s---hole\" countries during one of the immigration meetings earlier this month. Graham, on the other hand, did not dispute Durbin's account.\nThe South Carolina Republican spoke up when Trump made the comments, according to Durbin.\nGraham has in recent days torn into White House officials for what he calls Trump's shifting stance on immigration terms.\nWATCH: WH says priorities on immigration deal have not changed show chapters White House: Priorities on immigration deal have not changed 17 Hours Ago | 03:26", "external_links": [], "published": "2018-01-23T00:44:00.000+02:00", "crawled": "2018-01-23T00:53:19.008+02:00", "highlightTitle": ""}