{"organizations": [], "uuid": "12f16e5aa7dbe0c873c6c7476958fff1112195ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180116.html", "section_title": "Archive News &amp; Video for Tuesday, 16 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/palladium-threats/palladium-risks-tripping-up-as-prices-stampede-higher-idUSL8N1PA49Z", "country": "US", "domain_rank": 408, "title": "Palladium risks tripping up as prices stampede higher", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-16T23:03:00.000+02:00", "replies_count": 0, "uuid": "12f16e5aa7dbe0c873c6c7476958fff1112195ad"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/palladium-threats/palladium-risks-tripping-up-as-prices-stampede-higher-idUSL8N1PA49Z", "ord_in_thread": 0, "title": "Palladium risks tripping up as prices stampede higher", "locations": [], "entities": {"persons": [{"name": "jan harvey", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Palladium at record highs after 2017’s 56 pct surge\n* NYMEX palladium net longs also at record levels\n* GRAPHIC-2018 asset returns: tmsnrt.rs/2jvdmXl\nBy Jan Harvey\nLONDON, Jan 16 (Reuters) - Palladium, the hottest property in the precious metals deck last year, is tipped for a record performance in 2018 even among bearish forecasters, but the metal could become a victim of its own success.\nThe prospect of sharply higher prices could well prompt substitution of the metal for cheaper platinum in autocatalysts and higher recycling volume.\nThe metal has posted a string of deficits in recent years, fuelled by strong gains in autocatalyst demand. That helped send prices above $1,000 an ounce last year for the first time since 2001, and to a record $1,138 this week.\nCarmakers, who use the metal in catalytic converters, are expected to account for some 80 percent of palladium offtake this year, up from 56 percent in 2007. That leaves palladium particularly exposed to shifts in auto demand.\nSo far, pressure on palladium’s two most important car markets - the first drop in U.S. auto sales since the financial crisis last year, and slower car sales growth in China after tax cuts on small vehicles were phased out - has been offset by a move away from diesel engines in Europe and growth elsewhere.\nHowever, while catalyst demand is strong, manufacturers faced with sky-high palladium prices and a still-sluggish platinum market - which has suffered from the move away from diesel - may find substituting away from palladium makes sense.\n“Certainly carmakers who can use both will try to use more platinum,” Capital Economics analyst Simona Gambarini said. “For many purposes, it’s actually a better catalyst, it’s just always been more expensive.”\nThis will take time to have an impact on actual demand volumes - catalyst manufacturer Johnson Matthey estimates that it will be at least two years before substitution starts to have a significant impact on palladium demand - but it could affect sentiment in the market long before.\nIn recent months, a wave of speculative investment has taken the net long position on NYMEX palladium to record levels, leaving palladium prices - which have also hit a series of record highs - looking prone to a correction.\nFor the time being, a sharp drop in the dollar is giving a boost to all metals prices. When that fades, palladium could once again face profit-taking, especially if confidence in the demand picture wanes.\n“In the near term I‘m cautious because of positioning,” UBS analyst Joni Teves said. “It looks pretty stretched right now, and that positions the market for a near-term washout.”\nIt is not just the demand side of the market that has the power to crimp palladium’s run. Recycling levels are also expected to rebound, with material drawn out by scorching prices. “High prices always tease out more recycling, and these are super-high prices,” Macquarie analyst Matthew Turner said.\nVolumes of recycled palladium hitting the market are expected to reach record levels again this year, before breaking above 2 million ounces for the first time in 2019, according to GFMS. That will cut the physical palladium deficit to 1.545 million ounces in that year, from 1.661 million ounces in 2017.\nBut with that deficit firmly in place, palladium prices are hardly looking at a crash. UBS Wealth Management, which named palladium as its least preferred precious metal this year, still sees prices pulling back only to the $1,000 an ounce level by year-end. Capital Economics’ average price view, of $986 in the full year, is still a record average high.\nIn the longer run, its strength could be far more vulnerable to a deeper structural shift in the car market away from internal combustion engines and towards electric vehicles (EVs), which do not need catalytic converters.\nIHS Markit estimates that vehicles powered solely by gasoline or diesel will make up less than half of new car sales by 2031 -- though plug-in hybrid cars will still use catalytic converters.\nFew forecasters are prepared to look so far ahead when divvying up what that could mean for palladium demand - but it is unlikely to be good news.\n“Right now it’s really bullish,” Citi analyst Max Layton said. “Palladium is clearly in deficit and at the same time there’s a lot of speculative interest. Momentum filters and all that stuff will still tell you it’s a buy. We think so.”\nThis could, however, be palladium’s “last hurrah”, he said. “If you’re looking really bullish EVs, it’s the same thing as saying you are really bearish palladium,” he said. “It’s much more bearish for palladium than it is for oil and the turn in palladium will happen well before the oil turn.”\n“It’ll be like the canary in the coalmine.”\nReporting by Jan Harvey; additional reporting by Peter Hobson; Editing by Veronica Brown and Adrian Croft\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html", "http://tmsnrt.rs/2jvdmXl"], "published": "2018-01-16T23:03:00.000+02:00", "crawled": "2018-01-17T20:08:29.009+02:00", "highlightTitle": ""}