{"organizations": [], "uuid": "04e8c0b6ad971cd6c6cc8a92905e8932952fdba4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/business-wire-senseonics-announces-pricing-of-50-million-convertible-notes-offering.html", "country": "US", "domain_rank": 767, "title": "Senseonics Pricing of $50 Million Convertible Notes Offering", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T16:15:00.000+02:00", "replies_count": 0, "uuid": "04e8c0b6ad971cd6c6cc8a92905e8932952fdba4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/business-wire-senseonics-announces-pricing-of-50-million-convertible-notes-offering.html", "ord_in_thread": 0, "title": "Senseonics Pricing of $50 Million Convertible Notes Offering", "locations": [], "entities": {"persons": [{"name": "senseonics", "sentiment": "none"}], "locations": [{"name": "germantown", "sentiment": "none"}, {"name": "md.", "sentiment": "none"}, {"name": "senseonics", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "senseonics holdings, inc.", "sentiment": "neutral"}, {"name": "cgm", "sentiment": "none"}, {"name": "btig", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GERMANTOWN, Md.--(BUSINESS WIRE)-- Senseonics Holdings, Inc. (NYSE American: SENS) a medical technology company focused on the development and commercialization of Eversense®, a long-term, implantable continuous glucose monitoring (CGM) system for people with diabetes, today announced the pricing of an underwritten offering of $50.0 million aggregate principal amount of 5.25% convertible senior subordinated notes due 2023 (the Notes). In connection with the offering, Senseonics has also granted the underwriter a 30-day option to purchase up to an additional $7.5 million aggregate principal amount of Notes, solely to cover over-allotments. The sale of the Notes is expected to close on January 30, 2018, subject to the satisfaction of customary closing conditions.\nBTIG is acting as the sole manager for the offering.\nThe Notes will be general, unsecured, senior subordinated obligations of Senseonics with an interest rate of 5.25% per year, payable semiannually in arrears on February 1 and August 1 of each year, commencing on August 1, 2018. The Notes will mature on February 1, 2023, unless earlier repurchased or converted in accordance with their terms. The Notes will be convertible into shares of Senseonics’ common stock (the common stock). The conversion rate will initially be 294.1176 shares of common stock per $1,000 principal amount of Notes (equivalent to an initial conversion price of approximately $3.40 per share of common stock), subject to customary adjustments. Prior to the close of business on the business day immediately preceding February 1, 2023, the Notes will be convertible at the option of holders. Holders of the Notes may require the Company to repurchase their Notes upon the occurrence of a fundamental change prior to maturity for cash at a repurchase price equal to 100% of the principal amount of the Notes to be repurchased plus accrued and unpaid interest, if any, to, but excluding, the repurchase date. Holders who convert on or after the date that is six months after the last date of original issuance of the notes but prior to February 1, 2021, may also be entitled to receive, under certain circumstances, an interest make-whole payment payable in shares of our common stock.\nThe estimated net proceeds from this offering will be approximately $48.0 million (or $55.3 million if the underwriter exercises its over-allotment option in full), after deducting underwriting discounts and commissions and estimated offering expenses payable by Senseonics. Senseonics intends to use a portion of the net proceeds from the offering of the Notes to begin commercialization of Eversense in the United States, if approved, to fund continued research and development of future configurations of Eversense, and for working capital and general corporate purposes.\nThe Notes will be issued and sold pursuant to an effective shelf registration statement (including a base prospectus) on Form S-3, which was filed with the Securities and Exchange Commission (the SEC) on April 3, 2017 and became effective on April 17, 2017, and a preliminary prospectus supplement, filed with the SEC on January 25, 2018. The final prospectus supplement relating to the offering will be filed with the SEC and will be available on the SEC’s website at http://www.sec.gov . A copy of the final prospectus supplement and the accompanying prospectus relating to the offering may also be obtained, when available, from BTIG, LLC, 825 Third Avenue, 6th Floor, New York, NY 10022, or by telephone at (212) 588-6500 or by e-mail at convertiblecapitalmarkets@btig.com .\nThis press release shall not constitute an offer to sell or a solicitation of an offer to buy the Notes or any other securities, and will not constitute an offer, solicitation or sale in any state or jurisdiction in which such an offer, solicitation or sale would be unlawful. The offering of the Notes will be made only by means of the prospectus supplement and the accompanying prospectus.\nAbout Senseonics\nSenseonics Holdings, Inc. is a medical technology company focused on the design, development and commercialization of glucose monitoring products designed to help people with diabetes confidently live their lives with ease. Senseonics’ first generation CGM system, Eversense, includes a small sensor, smart transmitter and mobile application. Based on fluorescence sensing technology, the sensor is designed to be inserted subcutaneously and communicate with the smart transmitter to wirelessly transmit glucose levels to a mobile device. After insertion, the sensor is designed to continually and accurately measure glucose levels.\nForward-Looking Statements\nAny statements in this press release about future expectations, plans and prospects for Senseonics, including statements about the potential U.S. launch of Eversense, closing of this offering, anticipated use of proceeds and other statements containing the words “expect,” “intend,” “may,” “will,” and similar expressions, constitute forward-looking statements within the meaning of The Private Securities Litigation Reform Act of 1995. Actual results may differ materially from those indicated by such forward-looking statements as a result of various important factors, including: the uncertainties related to market conditions and the completion of the underwritten public offering on the anticipated terms or at all, uncertainties inherent in the FDA approval process and such other factors as are set forth in the risk factors detailed in Senseonics’ Annual Report on Form 10-K for the year ended December 31, 2016, Senseonics’ Quarterly Report on Form 10-Q for the quarter ended September 30, 2017 and Senseonics’ other filings with the SEC under the heading “Risk Factors.” In addition, the forward-looking statements included in this press release represent Senseonics’ views as of the date hereof. Senseonics anticipates that subsequent events and developments will cause Senseonics’ views to change. However, while Senseonics may elect to update these forward-looking statements at some point in the future, Senseonics specifically disclaims any obligation to do so except as required by law. These forward-looking statements should not be relied upon as representing Senseonics’ views as of any date subsequent to the date hereof.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180126005287/en/\nSenseonics Holdings, Inc.\nINVESTOR CONTACT\nR. Don Elsey\nChief Financial Officer\n301-556-1602\ndon.elsey@senseonics.com\nSource: Senseonics Holdings, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51749486&newsitemid=20180126005287&lan=en-US&anchor=http%3A%2F%2Fwww.sec.gov&index=1&md5=06db00f74583ea06f14812d79123890d", "http://www.businesswire.com/news/home/20180126005287/en/"], "published": "2018-01-26T16:15:00.000+02:00", "crawled": "2018-01-26T18:10:30.014+02:00", "highlightTitle": ""}