{"organizations": [], "uuid": "4b6c83cb48fd848088b27c79b468636eb83e2883", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-in-shape-health-clubs-hires-doris-thews.html", "country": "US", "domain_rank": 767, "title": "In-Shape Health Clubs Hires Doris Thews", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-18T15:03:00.000+02:00", "replies_count": 0, "uuid": "4b6c83cb48fd848088b27c79b468636eb83e2883"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-in-shape-health-clubs-hires-doris-thews.html", "ord_in_thread": 0, "title": "In-Shape Health Clubs Hires Doris Thews", "locations": [], "entities": {"persons": [{"name": "doris thews", "sentiment": "negative"}, {"name": "doris", "sentiment": "none"}], "locations": [{"name": "stockton", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "in-shape health clubs", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "STOCKTON, Calif., Jan. 18, 2018 /PRNewswire/ -- In-Shape Health Clubs, California's top destination for fitness and recreation, announced today as part of its fitness innovation strategy, that it hired industry leader, Doris Thews as vice president of group fitness, innovation and motivation signaling a renewed focus on advancing its fitness offerings.\nThews, a decorated fitness industry expert, will lead In-Shape's group fitness team made up of over 1,100 instructors, group fitness managers and directors. Thews will also develop strategy for future fitness products, programs and experience. In this newly created role, Thews will create training and signature programming and use her talent for motivating to energize her team to deliver best in class group fitness experiences.\n\"In-Shape is constantly evolving to offer members a fitness experience they can't get anywhere else, at an incredible value. We're thrilled to have Doris leading our team of inspired group fitness instructors, creating new programs and fitness experiences, and bringing her incredible energy and personality to the leadership team,\" said In-Shape CEO, Rich Nelsen.\n\"We offer over 3,000 group fitness classes a week throughout our Californian locations. With Ms. Thews leading the charge, we can elevate our group fitness experience with new work out programs which will not only be unique to In-Shape, but in our markets as well,\" Nelsen finished.\nIn the fitness industry for over 30 years, Thews was a divisional director for 24 Hour Fitness and ran her own fitness consulting business prior to joining In-Shape. She is an award winning, fitness educator and international master trainer for ShockWave, Indo-Row, Schwinn, and Bosu. She's a Lead Ryka Fit Pro Brand Ambassador and a Power Music Advisory Board Member and in 2017 was a finalist for IDEA Fitness Instructor of the Year and won Empower Fitness Conference Presenter of the Year.\nABOUT IN-SHAPE HEALTH CLUBS\nIn-Shape Health Clubs operates over 70 full-service fitness clubs throughout California. For over 35 years, In-Shape has built communities where members are motivated to be healthy, fit and happy. With free weights, group fitness classes, indoor and outdoor pools, cardio equipment, basketball, tennis, racquetball and personal training, In-Shape has something for everyone. So, when members are here, they know they're surrounded by people who always have their back... even if it's a little sweaty. That's the #inshapeattitude. Learn more at www.inshape.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/in-shape-health-clubs-hires-doris-thews-300584420.html\nSOURCE In-Shape Health Clubs", "external_links": ["http://www.inshape.com/", "http://www.prnewswire.com/news-releases/in-shape-health-clubs-hires-doris-thews-300584420.html"], "published": "2018-01-18T15:03:00.000+02:00", "crawled": "2018-01-18T16:20:27.005+02:00", "highlightTitle": ""}