{"organizations": [], "uuid": "a676e12200c59c4863f648bd5b5791f58f8d3fca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/24/reuters-america-california-to-sue-trump-administration-for-repeal-of-fracking-rules.html", "country": "US", "domain_rank": 767, "title": "California to sue Trump administration for repeal of fracking rules", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T20:57:00.000+02:00", "replies_count": 0, "uuid": "a676e12200c59c4863f648bd5b5791f58f8d3fca"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/24/reuters-america-california-to-sue-trump-administration-for-repeal-of-fracking-rules.html", "ord_in_thread": 0, "title": "California to sue Trump administration for repeal of fracking rules", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "barack obama", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "xavier becerra", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "blm", "sentiment": "none"}, {"name": "bureau of land management", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES, Jan 24 (Reuters) - California's attorney general on Wednesday said the state plans to sue the Trump administration over its repeal of Obama-era rules meant to address public safety concerns in hydraulic fracturing, or fracking, on federal lands.\nThe suit, which Attorney General Xavier Becerra said would be filed on Wednesday, marks the latest in a string of court challenges by California against the administration of Republican U.S. President Donald Trump's policies on a range of issues from immigration to the environment.\nThe federal government's Bureau of Land Management (BLM) in 2015, under Democratic President Barack Obama, issued rules that would have required companies to provide data on chemicals used in fracking and to take steps to prevent leakage from oil and gas wells on federally-owned land.\nFracking involves the injection of large amounts of water, sand and chemicals underground at high pressure to extract oil or natural gas trapped in rock formations. Most fracking takes place on private lands.\nHowever, the rules for federal and tribal lands were never implemented because oil and gas industry groups sued to block them, arguing that they were unnecessary and would slow the country's path to energy independence. That litigation ended when the Trump administration repealed the regulations last year.\nOn a conference call with reporters, California's Becerra said the new litigation \"is going to stand on its own.\"\n\"They did nothing at BLM to undo the rule with any justification or factual basis. There is plenty of reason to doubt that the fracking repeal engaged in by the Trump administration would withstand scrutiny in a court,\" he added.\nSeveral of the environmental groups involved in that earlier litigation, including the Sierra Club, Earthjustice and the Center for Biological Diversity, also planned to file a lawsuit on Wednesday.\nA BLM spokeswoman declined to comment on the threat of litigation. (Reporting by Nichola Groom, editing by G Crosse)", "external_links": [], "published": "2018-01-24T20:57:00.000+02:00", "crawled": "2018-01-25T02:52:01.009+02:00", "highlightTitle": ""}