{"organizations": [], "uuid": "665184fadb7ca36b161eafe92dc5030f51c206c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/pr-newswire-sagacious-research-strengthens-its-board-with-addition-of-umesh-amin.html", "country": "US", "domain_rank": 767, "title": "Sagacious Research Strengthens Its Board With Addition of Umesh Amin", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T01:00:00.000+02:00", "replies_count": 0, "uuid": "665184fadb7ca36b161eafe92dc5030f51c206c3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/pr-newswire-sagacious-research-strengthens-its-board-with-addition-of-umesh-amin.html", "ord_in_thread": 0, "title": "Sagacious Research Strengthens Its Board With Addition of Umesh Amin", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SEATTLE, Jan. 12, 2018 /PRNewswire/ -- Sagacious Research, a global leader in end-to-end human and technology-driven intellectual asset management solutions, adds Umesh Amin , a well-known expert in Intellectual Property Business and wireless technology, to its Board.\nMr. Amin brings two decades of executive leadership experience, having worked in global technology giants like AT&T Wireless, world leading IP development and monetization companies like Intellectual Ventures, and University-IP monetization players like TekCapital, among others. ( LinkedIn Profile of Umesh Amin )\nSagacious foresees Mr. Amin's experience will be instrumental in us serving our clients better. Umesh's decades of IP experience will also help Sagacious improve current, and develop newer, business-success solutions for its clients encompassing IP creation, IP management, business intelligence, IP research, IP-related compliances and effective patent licensing programs.\n\"We are very excited to have Mr. Umesh Amin join our board,\" states Vaibhav Henry , SBU Head, IP Commercialization & Licensing. \"His prior experience with intellectual property practices and business growth strategies are in line with our group and will further boost our efforts in providing the best services for each IP player, creating strategies that meet their unique goals.\"\nMr. Amin will focus on building high level business strategies over Sagacious' technical research, facilitating Sagacious in providing comprehensive solutions to its clients and helping them to be market leaders.\n\"Sagacious Research is one of the fastest growing customer focused IP Services companies. I am delighted to have this opportunity to help them shape new products and services strategies for their continued customer focused growth in the IP services market,\" said Umesh Amin.\nSagacious' Co-founder and CEO Anant Kataria says \"We face a growing demand of high-value solutions for IP asset management from prominent companies on the west coast. With Umesh's diversified experience, solution-oriented approach and intellectual proximity to clients, his joining our board at the time when we are setting up our Seattle office will create a desirable situation for our clients. We are very excited about the things to come.\"\nAbout Sagacious Research:\nSagacious Research, an award-winning and leading Intellectual Property Research and Consulting Company , has helped corporates and their internal/external counsels in many areas including successfully defending patent litigations, monetization/counter assertion of patents, augmenting R&D strategy by patent studies, etc.\nSagacious was founded in 2008 and since then it has served over 1,200 clients from 46+ countries with more than 10,000 assignments in 16+ languages. Its team of over 225 techno-legal professionals spans over its global offices in India, USA, China and now recently in Canada. Its services and solutions span across the IP life-cycle – from developing an IP strategy, to creation of IP and right up to its maintenance and monetization.\nFor more information about Sagacious Research, visit: https://www.sagaciousresearch.com/\nMedia Contact:\nBrandon Jenkins\nPhone: 213.286.6088\nEmail: brandon.jenkins@sagaciousresearch.com\nRelated Images\nimage1.png\nUmesh Amin\nimage2.png\nSagacious Research Logo\nimage3.jpg\nAnant Kataria\nimage4.jpg\nVaibhav Henry\nRelated Links\nGlobal Patent Search & Information Solutions - by Sagacious IP\nPatent Monetization and Licensing Solutions - by Sagacious IP\nView original content with multimedia: http://www.prnewswire.com/news-releases/sagacious-research-strengthens-its-board-with-addition-of-umesh-amin-300582014.html\nSOURCE Sagacious Research", "external_links": ["https://www.linkedin.com/in/umesh-amin-5a36301/", "http://www.prnewswire.com/news-releases/sagacious-research-strengthens-its-board-with-addition-of-umesh-amin-300582014.html", "https://sagaciousresearch.com/services/global-patent-search-information-solutions.php", "https://sagaciousresearch.com/our-team.php", "https://sagaciousresearch.com/services/patent-monetization-licensing-solutions.php", "https://www.sagaciousresearch.com/"], "published": "2018-01-13T01:00:00.000+02:00", "crawled": "2018-01-13T03:04:00.055+02:00", "highlightTitle": ""}