{"organizations": [], "uuid": "a455198361ca6d22e52682b690ae45660f3237c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/business-wire-new-mountain-capital-agrees-to-sell-aca-compliance-to-starr-investment-holdings.html", "country": "US", "domain_rank": 767, "title": "New Mountain Capital Agrees to Sell ACA Compliance to Starr Investment Holdings", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T17:00:00.000+02:00", "replies_count": 0, "uuid": "a455198361ca6d22e52682b690ae45660f3237c4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/business-wire-new-mountain-capital-agrees-to-sell-aca-compliance-to-starr-investment-holdings.html", "ord_in_thread": 0, "title": "New Mountain Capital Agrees to Sell ACA Compliance to Starr Investment Holdings", "locations": [], "entities": {"persons": [{"name": "robert l. stype", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "new mountain", "sentiment": "none"}], "organizations": [{"name": "starr investment holdings aca", "sentiment": "negative"}, {"name": "starr investment holdings", "sentiment": "none"}, {"name": "aca compliance group holdings", "sentiment": "none"}, {"name": "aca", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ACA’s Enterprise Value Increased More than Four Times During New Mountain’s Four-Year Majority Ownership\nIncrease in Value Driven by Growth in Revenues, Earnings, and New Products, as well as Strategic Acquisitions\nNEW YORK--(BUSINESS WIRE)-- New Mountain Capital, LLC (“New Mountain”), a growth-oriented investment firm that currently manages more than $20 billion in assets, today announced that it has agreed to sell ACA Compliance Group Holdings, LLC (“ACA”) to Starr Investment Holdings, LLC. New Mountain acquired majority control of ACA in December 2013. ACA is the leading provider of risk management and technology solutions to the financial services industry in the U.S. and Europe.\n“Since taking a majority stake in ACA four years ago, New Mountain exceeded my expectations for partnership and value-creation,” said Robert L. Stype, CEO of ACA and one of ACA’s founders. “This is an exciting time for ACA as we enter our next phase of growth with our new partnership with Starr Investment Holdings. We have enjoyed working with the New Mountain team and thank them for helping us to significantly expand and solidify our leading industry position. We look forward to building upon this momentum with Starr.”\nFounded in 2002 by former SEC examiners and a state regulator, ACA services and develops its products with a team comprised of former SEC, FINRA, FSA, FCA, NYSE, CFTC, NFA, and state regulators, as well as former senior in-house compliance professionals and technologists from prominent financial institutions. ACA serves a diversified base of leading investment advisers, private fund managers, commodity trading advisors, investment companies and broker-dealers, including 81 of the top 100 hedge fund managers, 68 of the world’s top 100 private equity firms, and 76 of the top 100 U.S. money managers. 1 ACA offers a suite of complementary solutions to address mission-critical, ongoing client needs, including a diverse set of services and technology products relating to the following areas:\nRegulatory compliance; Cybersecurity; Financial crimes; Performance services, including GIPS ® verifications; and A wide variety of technology solutions for financial services firms.\nSince New Mountain’s December 2013 investment, ACA has grown significantly and tripled its employee headcount. The company also has made substantial investments into new capabilities and product solutions to drive additional value for its customers and enable continued growth well into the future.\n“We are proud of our successful partnership with ACA. We saw great potential in ACA when we began our partnership four years ago, and have been continuously impressed with its management team and talented employees,” said Peter Masucci, Chairman of the Board of ACA and Managing Director at New Mountain. “We implemented a number of strategic initiatives to accelerate ACA’s growth and global potential, and look forward to seeing ACA continue to thrive moving forward. This new partnership will create significant value for all ACA stakeholders and we are confident that ACA is well positioned to continue on its impressive trajectory with Starr.”\n“ACA’s more than fourfold growth in enterprise value since 2013 demonstrates New Mountain’s commitment to partnership and business building through organic growth and acquisitions,” said Robert Mulcare, Managing Director at New Mountain. “We thank the founding partners, as well as ACA’s leadership and employees, for their tremendous efforts and collaboration over the past four years.”\nACA Compliance Group is receiving legal counsel from DLA Piper. New Mountain Capital is receiving legal counsel from Kirkland & Ellis LLP. Raymond James & Associates, Inc. and Credit Suisse Securities (USA) LLC are acting as financial advisors to ACA and New Mountain.\nAbout New Mountain Capital\nNew Mountain Capital is a New York based investment firm that emphasizes business building and non-cyclical growth, rather than debt, as it pursues long-term capital appreciation. The firm currently manages private equity, public equity, and credit funds with approximately $20 billion in aggregate capital commitments. New Mountain seeks out what it believes to be the highest quality growth leaders in carefully selected industry sectors and then works intensively with management to build the value of these companies.\nwww.newmountaincapital.com\nAbout ACA Compliance Group\nACA Compliance Group is a leading provider of risk management and technology solutions that focus on regulatory compliance, performance, financial crime, and cybersecurity. ACA serves a diverse base of leading investment advisers, private fund managers, commodity trading advisors, investment companies, broker-dealers, and banks.\nhttps://www.acacompliancegroup.com/\n1 As noted in the May 2017 PEI 300, the May 2017 PERE 50, the April 2017 edition of Hedge Fund Alert, and the September 2017 edition of Institutional Investor.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180109005679/en/\nACA Compliance Group\nKrissy Kennedy, +1 857-214-1740\nkkennedy@acacompliancegroup.com\nor\nNew Mountain Capital\nAbernathy MacGregor\nDana Gorman, +1 212-371-5999\ndtg@abmac.com\nSource: New Mountain Capital, LLC", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.acacompliancegroup.com%2F&esheet=51739981&newsitemid=20180109005679&lan=en-US&anchor=https%3A%2F%2Fwww.acacompliancegroup.com%2F&index=2&md5=b53e18c099b1c42546b685aa1b1dd5ce", "https://www.acacompliancegroup.com/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.newmountaincapital.com&esheet=51739981&newsitemid=20180109005679&lan=en-US&anchor=www.newmountaincapital.com&index=1&md5=056da7c401e8ab4ba2401e412d4ded61", "http://www.businesswire.com/news/home/20180109005679/en/"], "published": "2018-01-09T17:00:00.000+02:00", "crawled": "2018-01-09T19:04:18.045+02:00", "highlightTitle": ""}