{"organizations": [], "uuid": "f109f4bc11e7e60450fec0ac8b8b9e7457ad1455", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220132316&w=1200&r=LYNXMPEE07015", "site_section": "http://feeds.reuters.com/reuters/topNews", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-usa-fed-tax-insight/in-possible-boon-for-white-house-fed-ready-to-lay-low-as-tax-plan-kicks-in-idUSKBN1EX012", "country": "US", "domain_rank": 408, "title": "In possible boon for White House, Fed ready to lay low as tax plan kicks in", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T03:09:00.000+02:00", "replies_count": 0, "uuid": "f109f4bc11e7e60450fec0ac8b8b9e7457ad1455"}, "author": "", "url": "https://www.reuters.com/article/us-usa-fed-tax-insight/in-possible-boon-for-white-house-fed-ready-to-lay-low-as-tax-plan-kicks-in-idUSKBN1EX012", "ord_in_thread": 0, "title": "In possible boon for White House, Fed ready to lay low as tax plan kicks in", "locations": [], "entities": {"persons": [{"name": "howard schneider", "sentiment": "none"}, {"name": "jonathan spicer", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "white house", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}], "organizations": [{"name": "fed", "sentiment": "negative"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "congress’ joint committee on taxation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 1:08 AM / Updated 19 hours ago In possible boon for White House, Fed ready to lay low as tax plan kicks in Howard Schneider , Jonathan Spicer 6 Min Read \nPHILADELPHIA (Reuters) - U.S. Federal Reserve policymakers have come to view Donald Trump’s tax overhaul as a short-term economic boost that will neither permanently supercharge the economy, as the president says, or cause an immediate disruption that would require a central bank response, as some analysts have warned. \nThat view emerged in recent interviews with four central bankers across the policy spectrum, from those eager to keep interest rates low, to those more inclined to raise rates as a guard against asset bubbles or any unexpected inflation jolt. \nThe interviews offer the most detailed look yet at a key issue -- whether the changes in the tax code might prompt the Fed to raise rates more quickly and thus blunt the new law’s impact. The issue has divided analysts, with even staff at Congress’ Joint Committee on Taxation assuming an “aggressive” Fed reaction to the new law. \nBut all four of those interviewed by Reuters shared a common conclusion that the law would provide some short-term benefit without raising any near-term risks. \nThey predict that the combination of corporate and household tax cuts will raise growth by up to half a percentage point annually for the next couple of years, and help keep unemployment at near record lows and thus perhaps raise wages. \nIn addition, depending on how companies respond in terms of increased investment, the plan might raise long-run potential growth by a small amount. \nWhat they do not see is any great risk that the tax stimulus will fuel inflation or a run-up in asset prices that would prompt the Fed to raise interest rates any faster than it already plans. Though not an endorsement of the legislation, it is an important sign the Fed will not stand in its way. \n“I don’t feel any urgency to do something preemptively,” Federal Reserve Bank of Cleveland President Loretta Mester said in an interview with Reuters on the sidelines of the American Economic Association annual conference in Philadelphia. \nMester has been among those more inclined to lift rates from crisis-era levels, but sees no reason to rush because of the tax overhaul, which she predicts will raise annual growth as much as a half a percentage point for the next few years. \nThe Federal Reserve’s most recent economic projections forecast three interest rate rises in 2018. Market pricing currently indicates two. \nSome private-sector economists recently penciled in four rises, partly because of the tax plan’s impact and how it might affect the Fed. \nCentral bankers, however, seem poised to stick with their current plans, confident that inflation will stay tame and that the recent record run on U.S. stock markets is largely the result of economic fundamentals, not dangerous speculation. \nThe view is not universal, with some officials cautioning that the corporate tax cut in particular may be funneled into share buybacks or other financial maneuvers that could drive asset prices to unreasonable levels. The increase in the deficit is also a long-term concern. \nBut the overall wait-and-see stance was implicit in the policy statement and economic projections the Fed issued in December after it raised its target interest rate. \nPolicymakers upped their forecast for economic growth at the time but held steady their expectation on rate rises. NEW FED CHAIR \nThe tax cuts will kick in just as the Federal Reserve transitions to a new leadership, with former banker Jerome Powell taking over from Janet Yellen, who over four years as Fed chair focused on lowering the jobless rate in hopes of healing household finances after the 2007-2009 financial crisis and recession. \nWith the fiscal stimulus, some policymakers say the unemployment rate could now drop as low as 3.5 percent next year, in what World Bank Chief Economist Paul Romer said amounts to an important “experiment” in determining just how low unemployment can go in a post-crisis, low-inflation world. \n“The balance of risks right now suggests that it would be a good idea to experiment with pushing employment a lot harder,” Romer said in Philadelphia. \nThe unemployment rate is currently 4.1 percent, well below the 4.5 percent to 5 percent level that standard economic models say should lead to higher inflation. But so far, inflation remains tame. \n“We keep our powder dry,” said Philadelphia Fed President Patrick Harker, who, far from accelerating the pace of rate hikes, on Friday indicated he was ready to slow them down because wage growth remained weak. CONSUMER PULL OR INVESTMENT PUSH \nThe tax cuts are split between a deep reduction to 21 percent on corporate profits, changes in the personal income tax that will shave what many households pay, and an increase in the value of the child tax credit, among other changes. [nL1N1OK0BB] \nHow that affects the economy will depend on the degree to which it fuels consumption by putting more money in people’s pockets, versus “supply side” changes that could cause companies to invest more as a result of the lower tax rates. \nPolicymakers like St. Louis Fed President James Bullard and John Williams of the San Francisco Fed said in interviews those changes would raise short-term growth and could possibly raise longer-term potential - though not by as much as the Trump administration expects. \n“You’re doing it in an environment where you have very low inflation already so you probably don’t have to worry as much about the monetary policy push-back that you would get in some other environments,” Williams told Reuters. \nBullard noted the tax cut “is actually not that big in the big scheme,” parceling out to about $150 billion a year in a more than $18 trillion economy. \nThe more important effect, he said, may only become apparent over the long term if it does in fact raise potential, or “trend,” growth. If that happens by increasing productivity, for example, and compounding over time, “even a couple tenths means a lot,” he said. Reporting by Howard Schneider and Jonathan Spicer; Editing by Lisa Shumaker", "external_links": [], "published": "2018-01-08T03:09:00.000+02:00", "crawled": "2018-01-08T03:19:02.014+02:00", "highlightTitle": ""}