{"organizations": [], "uuid": "0e099b6913c55b0c48d99fa87c3363f57e4ea162", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/china-stocks-midday/china-and-hong-kong-stocks-extend-fall-as-wall-street-stumbles-idUSL4N1PP1VY", "country": "US", "domain_rank": 408, "title": "China and Hong Kong stocks extend fall as Wall Street stumbles", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T06:24:00.000+02:00", "replies_count": 0, "uuid": "0e099b6913c55b0c48d99fa87c3363f57e4ea162"}, "author": "", "url": "https://www.reuters.com/article/china-stocks-midday/china-and-hong-kong-stocks-extend-fall-as-wall-street-stumbles-idUSL4N1PP1VY", "ord_in_thread": 0, "title": "China and Hong Kong stocks extend fall as Wall Street stumbles", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* SSEC -0.7 pct, CSI300 -0.7 pct, HSI -0.8 pct\n* HK->Shanghai Connect daily quota used 2.7 pct, Shanghai->HK daily quota used 10.9 pct\n* FTSE China A50 -1.0 pct, BNY Mellon ADR China Select Index -1.5 pct\nSHANGHAI, Jan 30 (Reuters) - China and Hong Kong stocks extended losses on Tuesday morning, with the benchmark Hang Seng index retreating from a life-time high, as investors pocketed gains after a selloff in Apple shares knocked Wall Street. ** At 04:04 GMT, the Shanghai Composite index was down 26.00 points or 0.74 percent at 3,497.00. ** China’s blue-chip CSI300 index pulled back 0.7 percent, with its financial sector sub-index lower by 1.24 percent, the consumer staples sector up 0.05 percent, the real estate index down 3.06 percent and healthcare sub-index down 0.18 percent. ** Chinese H-shares listed in Hong Kong fell 1.68 percent to 13,429.77, while the Hang Seng Index was down 0.83 percent at 32,693.43. ** The smaller Shenzhen index was down 0.42 percent and the start-up board ChiNext Composite index was off 0.56 percent. ** Around the region, MSCI’s Asia ex-Japan stock index was 0.94 percent lower while Japan’s Nikkei index was down 1.37 percent . ** The yuan was Quote: d at 6.3335 per dollar, 0.2 percent firmer than the previous close of 6.346. ** The largest percentage gainers in the main Shanghai Composite index were Shanghai Join Buy Co Ltd up 10.03 percent, followed by Tianjin Quanyechang Group Co Ltd gaining 9.97 percent and Beijing Hualian Hypermarket Co Ltd up 7.65 percent. ** The largest percentage losses in the Shanghai index were Fujian Furi Electronics Co Ltd down 9.98 percent, followed by CMST Development Co Ltd losing 9.97 percent and Lawton Development Co Ltd down by 9.97 percent. ** So far this year, the Shanghai stock index is up 6.53 percent, while China’s H-share index is up 16.7 percent. Shanghai stocks have risen 6.53 percent this month. ** The top gainers among H-shares were Great Wall Motor Co Ltd up 2.08 percent, followed by Guangzhou Automobile Group Co Ltd gaining 1.49 percent and China Merchants Bank Co Ltd up by 0.95 percent. ** The three biggest H-shares percentage decliners were Bank of China Ltd down 3.96 percent, China Construction Bank Corp off 3.3 percent and Agricultural Bank of China Ltd down 3.3 percent. ** About 10.53 billion shares have traded so far on the Shanghai exchange, roughly 54.3 percent of the market’s 30-day moving average of 19.38 billion shares a day. The volume traded was 23.60 billion as of the last full trading day. ** As of 04:04 GMT, China’s A-shares were trading at a premium of 27.91 percent over the Hong Kong-listed H-shares. ** The Shanghai stock index is above its 50- and 200-day moving average. ** The price-to-earnings ratio of the Shanghai index was 16.03 as of the last full trading day while the dividend yield was 1.8 percent. ** So far this week, the market capitalisation of the Shanghai stock index has fallen by 0.99 percent to 31.00 trillion yuan. ** In Hong Kong, the sub-index of the Hang Seng index tracking energy shares dipped 2 percent while the IT sector fell 1.3 percent. The top gainer on Hang Seng was CLP Holdings Ltd up 1.72 percent, while the biggest loser was Bank of China Ltd which was down 3.96 percent.\nReporting by Luoyan Liu and John Ruwitch; Editing by Shri Navaratnam\n ", "external_links": [], "published": "2018-01-30T06:24:00.000+02:00", "crawled": "2018-01-30T07:10:15.419+02:00", "highlightTitle": ""}