{"organizations": [], "uuid": "8e09d0ebc0dd6753df2b28df6af8263edd21ed53", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180110.html", "section_title": "Archive News &amp; Video for Wednesday, 10 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/easteurope-markets/cee-markets-zloty-steadies-central-bank-seen-keeping-loose-stance-idUSL8N1P52AE", "country": "US", "domain_rank": 408, "title": "CEE MARKETS-Zloty steadies, central bank seen keeping loose stance", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.934, "site_type": "news", "published": "2018-01-10T18:48:00.000+02:00", "replies_count": 0, "uuid": "8e09d0ebc0dd6753df2b28df6af8263edd21ed53"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/easteurope-markets/cee-markets-zloty-steadies-central-bank-seen-keeping-loose-stance-idUSL8N1P52AE", "ord_in_thread": 0, "title": "CEE MARKETS-Zloty steadies, central bank seen keeping loose stance", "locations": [], "entities": {"persons": [{"name": "sandor peto", "sentiment": "none"}, {"name": "pawel florkiewicz budapest/warsaw", "sentiment": "none"}, {"name": "adam glapinski", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "bz wbk", "sentiment": "none"}, {"name": "nbp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Dollar retreat buoys zloty vs euro, but it is near 2-week low * Polish central bank seen retaining loose policy stance * Polish govt reshuffle, Czech confidence vote ignored in markets By Sandor Peto and Pawel Florkiewicz BUDAPEST/WARSAW, Jan 10 (Reuters) - A weaker dollar helped the zloty firm slightly even though the Polish central bank (NBP) is expected to reaffirm its loose policy stance after its meeting on Wednesday. Central Europe's most liquid currencies have tracked the dollar's movements this year. Dollar weakness helped the zloty hit a 2-1/2-year high on Friday but it subsequently retreated as the dollar firmed in global markets. The zloty, trading at 4.181 against the euro at 0918 GMT, is still near two-week lows set on Tuesday at 4.2003. \"The rhetoric of the NBP governor will most likely stay very dovish, given that the recent macro readings have not induced him to change his view,\" analysts at BZ WBK said in a note. After the central bank's rate decision at around 1200 GMT, Governor Adam Glapinski is expected to reiterate that the bank's interest rates are unlikely to change this year. Analysts in a Reuters poll projected hikes to start late this year, even though annual inflation slowed to 2 percent in December. A surge in wages has fuelled a rebound in inflation in the region since 2016, but so far only the Czech and the Romanian central banks have started to raise interest rates from record-low levels. The Romanian bank's (NBR) first hike in a decade, delivered on Tuesday, gave a short-lived lift to the leu, but its comments indicating leniency on some weakness sent the currency lower. It consolidated on Wednesday, trading at 4.6435 against the euro, up 0.1 percent. The crown eased slightly after Czech National Bank Governor Jiri Rusnok said he expected at least two more rate hikes by 25 basis points each this year, and December data showed 2.4 percent annual inflation, in line with forecasts. New Czech Prime Minister Andrej Babis, battling allegations his business empire illegally tapped EU subsidies a decade ago, looks certain to lose a parliamentary confidence vote on Wednesday. Politics, however, rarely influence Czech markets. The country's 10-year bond yields rose by 2 basis points, in line with Polish and Hungarian peers. Some early selling pressure quickly passed, a Budapest-based trader said. Polish markets also remained unaffected by political developments. New Prime Minister Mateusz Morawiecki fired several senior ministers and visited Brussels on Tuesday in an effort to patch up relations with the European Union, but said he would not unwind the most-contested judicial reforms. The reshuffle is unlikely to change Poland's relatively expansionary fiscal policy, analysts at Bank Millennium said in a note. ING analysts said \"the change in the position of the head of the Ministry of Foreign Affairs and the Minister of the Environment may signal a desire to mitigate conflicts with the European Union.\" CEE SNAPSHO AT MARKETS T 1018 CET CURRENC IES Latest Previou Daily Change s bid close change in 2018 Czech <EURCZK 25.5600 25.5500 -0.04% -0.07% crown => Hungary <EURHUF 309.570 309.570 +0.00% +0.43% forint => 0 0 Polish <EURPLN 4.1810 4.1830 +0.05% -0.11% zloty => Romanian <EURRON 4.6430 4.6470 +0.09% +0.79% leu => Croatian <EURHRK 7.4470 7.4475 +0.01% -0.22% kuna => Serbian <EURRSD 118.590 118.710 +0.10% -0.08% dinar => 0 0 Note: calculated from 1800 daily CET change Latest Previou Daily Change s close change in 2018 Prague 1104.93 1104.48 +0.04% +2.48% 00 Budapest 39726.8 39869.5 -0.36% +0.89% 8 6 Warsaw <.WIG20 2520.94 2528.38 -0.29% +2.43% > Buchares 8037.35 8034.76 +0.03% +3.66% t Ljubljan <.SBITO 815.46 813.90 +0.19% +1.13% a P> Zagreb <.CRBEX 1859.45 1859.99 -0.03% +0.90% > Belgrade <.BELEX 771.41 770.64 +0.10% +1.53% 15> Sofia <.SOFIX 688.72 688.11 +0.09% +1.66% > BONDS Yield Yield Spread Daily (bid) change vs Bund change in Czech spread Republic 2-year <CZ2YT= 0.6290 0.0870 +125bp +9bps RR> s 5-year <CZ5YT= 0.9330 0.0260 +114bp +3bps RR> s <CZ10YT 1.7100 0.0620 +124bp +5bps 10-year =RR> s Poland 2-year <PL2YT= 1.6350 -0.0050 +225bp +0bps RR> s 5-year <PL5YT= 2.5690 -0.0090 +277bp -1bps RR> s <PL10YT 3.3320 0.0210 +286bp +1bps 10-year =RR> s FORWARD RATE AGREEME NT 3x6 6x9 9x12 3M interba nk Czech <CZKFRA 1.03 1.20 1.33 #N/A Rep ><PRIBO Access R=> Denied: User req to PE(9762 ) Hungary <HUFFRA 0.09 0.13 0.10 0.03 ><BUBOR => Poland <PLNFRA 1.77 1.80 1.88 1.72 ><WIBOR => Note: are for ask FRA prices Quote: s", "external_links": [], "published": "2018-01-10T18:48:00.000+02:00", "crawled": "2018-01-11T12:46:51.012+02:00", "highlightTitle": ""}