{"organizations": [], "uuid": "6bc7e789caa31c26e311e0b9f46ce930d5644fa9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218825993&w=1200&r=LYNXMPEE010NN", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-nigeria-security-barter/boko-haram-displaced-barter-to-survive-idUKKBN1ER16A", "country": "US", "domain_rank": 408, "title": "Boko Haram displaced barter to survive", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T16:42:00.000+02:00", "replies_count": 0, "uuid": "6bc7e789caa31c26e311e0b9f46ce930d5644fa9"}, "author": "", "url": "https://uk.reuters.com/article/uk-nigeria-security-barter/boko-haram-displaced-barter-to-survive-idUKKBN1ER16A", "ord_in_thread": 0, "title": "Boko Haram displaced barter to survive", "locations": [], "entities": {"persons": [{"name": "boko haram", "sentiment": "negative"}, {"name": "aisha umaru", "sentiment": "none"}, {"name": "umari usman kaski", "sentiment": "none"}, {"name": "bakasi", "sentiment": "none"}], "locations": [{"name": "maiduguri", "sentiment": "none"}, {"name": "bakasi", "sentiment": "none"}, {"name": "abuja", "sentiment": "none"}, {"name": "nigeria", "sentiment": "none"}], "organizations": [{"name": "united nations", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "bakasi idp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 2:45 PM / Updated 22 minutes ago Boko Haram displaced barter to survive 3 Min Read \nABUJA (Reuters) - Cash cannot be king for the people of Bakasi camp. Aisha Umaru (L) holds a basin of milk as Umari Usman Kaski holds up firewood at the Bakasi IDP camp, Maiduguri, Nigeria, November 22, 2017. REUTERS/Afolabi Sotunde \nInstead, a small bundle of firewood can be traded for some milk. An unwanted bowl of baby fish is good in exchange for cooking oil. Peanuts are always in high demand. \nWith little money to hand at the best of times, and struggling to find the goods they need, bartering is key to getting by for Bakasi’s more than 21,000 displaced people. \nThe eight-year Boko Haram insurgency in Nigeria’s northeast has displaced around 2 million people, some in Nigeria and some overseas. The United Nations calls it one of the world’s worst humanitarian crises. \nMore than 670,000 of those people live in camps in Nigeria’s northeast, where cash is hard to come by, opportunities for work are rare and the food and aid they get is often not what they want. \nThe dusty Bakasi camp sits on the outskirts of the city of Maiduguri in Borno, the spiritual home of the Islamist Boko Haram movement, which wants to establish a caliphate in the region surrounding Lake Chad. \nIn Bakasi, the displaced frequently swap the little they have for their preferred goods, whether it’s herbs and spices to make soup, groundnut to help a breastfeeding mother produce milk or laundry detergent for a family’s clothes. \n“We don’t get money, that’s why we do this,” said Umaru Usman Kaski, hoping to trade a small bundle of firewood worth about 50 naira (0.12 pounds) to support his family of eight. Binta Lawal holds up a bowl of poultry feed with Aisha Buba at the Bakasi camp Borno, Nigeria, Nigeria, November 23, 2017. REUTERS/Afolabi Sotunde \nWhile many would prefer money, cash distribution in Nigeria’s northeast is fraught with risk. \nReports of corruption in the humanitarian crisis relief efforts are rife. Those involved, such as government officials, aid workers and soldiers, are alleged to skim from the top before distributing aid. \nMany of those responding to the crisis are also concerned that with economic prospects dim for the foreseeable future, millions of people will become dependent on the aid, the vast majority of it coming from overseas. Slideshow (12 Images) \nUntil then, Nigeria’s displaced are finding their own ways to balance what they receive with their needs. \nAbdulwahal Abdulla, a 50-year-old living in Bakasi for three years, hoped to trade his bowl of young tilapia worth roughly 150 naira for cooking oil. \nAbdulla, no fan of the fish, had bought them because products were scarce and it was the only thing he could buy at the time, he said. \nNasiru Buba was trading packets of laundry detergent. He had bought them after working as a porter in the city, pushing a cart loaded with people’s belongings, and wanted to trade them for groundnuts. \n“My wife has just delivered a baby and the breast is not coming out with milk,” said Buba. \n“I needed to get groundnuts for her to eat so she will produce sufficient breast milk, and I don’t have any money. When I got the detergent I was not in need of anything, but that changed.” Reporting by Paul Carsten, eiting by Larry King", "external_links": [], "published": "2018-01-02T16:42:00.000+02:00", "crawled": "2018-01-02T16:51:48.016+02:00", "highlightTitle": ""}