{"organizations": [], "uuid": "49096170f41c4cbd3e80c2c043edc70c74b7b9b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-namely-welcomes-graham-younger-former-executive-at-box-as-president-chief-revenue-officer.html", "country": "US", "domain_rank": 767, "title": "Namely Welcomes Graham Younger, former Executive at Box, as President & Chief Revenue Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T17:00:00.000+02:00", "replies_count": 0, "uuid": "49096170f41c4cbd3e80c2c043edc70c74b7b9b3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-namely-welcomes-graham-younger-former-executive-at-box-as-president-chief-revenue-officer.html", "ord_in_thread": 0, "title": "Namely Welcomes Graham Younger, former Executive at Box, as President & Chief Revenue Officer", "locations": [], "entities": {"persons": [{"name": "graham younger", "sentiment": "negative"}, {"name": "younger", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "new york stock exchange", "sentiment": "none"}, {"name": "sap", "sentiment": "none"}, {"name": "dwa nova", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 17, 2018 /PRNewswire/ -- Namely, the leading HR platform for mid-sized companies, today announced that Graham Younger has joined as President and Chief Revenue Officer. Younger has a proven record of leadership in high-growth SaaS companies and has lead multiple companies into the next phase of expansion. At Namely, Younger will oversee key growth areas, including Sales, Marketing, Client Success, and Benefits. His appointment, on the heels of the company's 6th anniversary, is an important step as Namely embarks on an ambitious growth strategy.\nYounger has a track record of driving explosive growth. Prior to Namely, he held senior executive positions at DWA NOVA, SAP SuccessFactors, Oracle, and Box. At SuccessFactors, Younger played a key role in driving revenue—leading to the $3.4B acquisition by SAP, the highest valuation multiple for a SaaS company at the time. At Box, as EVP, Worldwide Field Operations, Younger scaled annual recurring revenues from $100M to $380M and helped take the company public on the New York Stock Exchange.\n\"The opportunity Namely represents within the HR market is tremendous. No other company is approaching the midmarket from a pure SaaS employee-centric approach,\" says Younger. \"I've been impressed by Namely's ability to give companies insight into their biggest investment: human capital. We're in the midst of a talent war, and companies that are able to better serve and understand their talent will win.\"\nYounger will oversee Namely's expansion into new markets, as the company opens offices in both Atlanta and LA—rounding out existing offices in NYC, San Francisco, and Austin. In honor of becoming local in these cities, Namely has turned to its data to uncover how salaries in Atlanta and LA stack up. The complete findings can be found here .\n\"Over the past six years, Namely has emerged as the clear leader in mid-market HR software,\" adds Pat Grady, partner at Sequoia and board member at Namely. \"Graham is a powerful addition to the leadership team as Namely steps into the next phase of growth.\"\nAbout Namely\nNamely is the first HR platform that employees actually love to use. Namely's powerful, easy-to-use technology allows companies to handle all of their HR, payroll, time management, and benefits in one place. Coupled with dedicated account support, every Namely client gets the software and service they need to deliver great HR and a strong, engaged company culture.\nNamely is used by over 1,000 clients with over 150,000 employees globally. Headquartered in New York City, the company has raised $157.8 MM from leading investors, including Altimeter Capital, Scale Capital, Sequoia Capital, Matrix Partners, and True Ventures. , visit www.Namely.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/namely-welcomes-graham-younger-former-executive-at-box-as-president--chief-revenue-officer-300583774.html\nSOURCE Namely", "external_links": ["http://www.namely.com/", "https://blog.namely.com/blog/state-of-work-in-atlanta-and-la", "http://www.prnewswire.com/news-releases/namely-welcomes-graham-younger-former-executive-at-box-as-president--chief-revenue-officer-300583774.html"], "published": "2018-01-17T17:00:00.000+02:00", "crawled": "2018-01-17T19:14:52.000+02:00", "highlightTitle": ""}