{"organizations": [], "uuid": "f53e22cc6f9b3cfcd1120f3b29838acf94c83e3b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219070185&w=1200&r=LYNXMPEE020RB", "site_section": "http://feeds.feedburner.com/reuters/topNews/", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-libya-security-benghazi/wounded-libyans-struggle-as-fighting-in-benghazi-draws-to-close-idUSKBN1ES13R", "country": "US", "domain_rank": 408, "title": "Wounded Libyans struggle as fighting in Benghazi draws to close", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T21:57:00.000+02:00", "replies_count": 0, "uuid": "f53e22cc6f9b3cfcd1120f3b29838acf94c83e3b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-libya-security-benghazi/wounded-libyans-struggle-as-fighting-in-benghazi-draws-to-close-idUSKBN1ES13R", "ord_in_thread": 0, "title": "Wounded Libyans struggle as fighting in Benghazi draws to close", "locations": [], "entities": {"persons": [{"name": "mutassim al-misrati", "sentiment": "negative"}, {"name": "haftar", "sentiment": "none"}, {"name": "khalifa haftar", "sentiment": "none"}, {"name": "misrati", "sentiment": "none"}], "locations": [{"name": "benghazi", "sentiment": "none"}, {"name": "benghazi", "sentiment": "none"}, {"name": "libya", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 2:57 PM / Updated 5 hours ago Wounded Libyans struggle as fighting in Benghazi draws to close Ayman al-Warfalli 3 Min Read \nBENGHAZI, Libya (Reuters) - Economics student Mutassim al-Misrati lost his leg in an RPG attack in April 2014 while fighting in Benghazi, his home city. \nBack then Misrati had joined the forces that were beginning to coalesce around Libyan commander Khalifa Haftar, who weeks later would launch a campaign to take control of Benghazi, Libya’s second city. \nHaftar, now the dominant figure in eastern Libya and a likely candidate in elections that may happen by the end of the year, finally declared victory in Benghazi in July 2017, though fighting continued in one area of the city until last week. \nThe win has come at the cost of thousands of dead and many more wounded who receive little care. \nSince 2014, Libya has been split between rival military factions and governments, causing an economic decline and collapse in health services that have left many veterans to fend largely for themselves. \nMisrati received medical care the year he was wounded, and has a prosthetic leg that allowed him to return to studying for an economics degree and working at a fish market. \n”In 2014, I received care but at the present moment in time there is neglect when it comes to all of those wounded,” Misrati said. Mutassim al-Misrati, a Benghazi-local who lost his leg during a three-year war in the city, walks at Benghazi port, Libya December 27, 2017. Picture taken December 27, 2017. REUTERS/Esam Omran Al-Fetori \nHe is still a supporter of Haftar, whose campaign in Benghazi, “Operation Dignity”, battled Islamists and other opponents, some of them former rebels who had fought to topple Muammar Gaddafi in 2011. \n“I fought and dedicated myself to my country. Thank God, I was spared and now I am back with my work and my people,” Misrati said. \n“There are amputees who have not received prosthetic legs, though some received prosthetics. Some are able to run, just like I am able to run, and to live.” Slideshow (7 Images) \nThere are no independent estimates for overall casualties from the conflict in Benghazi, though Ahmed al-Mismari, a spokesman for Haftar’s Libyan National Army (LNA), said about 6,000 of their men had died. \nThe LNA special forces, which played a leading role in the fighting, lost about 1,500 men and had some 2,500 wounded, said Colonel Milad al-Zawi, a spokesman. \nVeterans get a one-off payment of 2,000 dinars, currently the equivalent of just $225 at black market rates that set the price of many goods in Libya. Though foreign governments have flown some wounded fighters abroad for treatment, seeking medical treatment outside the country has become prohibitively expensive for most. \nIn Benghazi, daily struggles with liquidity shortages and inflation have dampened hopes brought by an end to the fighting. \n“Benghazi is full of the blood of martyrs,” said Misrati. “It wants the nation to be at rest, it wants cash, it wants uncrowded bakeries, petrol, electricity.” Writing by Aidan Lewis; Editing by Raissa Kasolowsky", "external_links": [], "published": "2018-01-03T21:57:00.000+02:00", "crawled": "2018-01-03T17:20:27.023+02:00", "highlightTitle": ""}