{"organizations": [], "uuid": "4edcf3dedb0eb455d8a3f9394aa239a9524ea140", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INgolf", "section_title": "Reuters: Golf News", "url": "https://in.reuters.com/article/golf-laquinta/golf-rahm-returns-to-california-a-year-older-and-much-wiser-idINKBN1F704C", "country": "US", "domain_rank": 408, "title": "Golf-Rahm returns to California a year older and much wiser", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T02:54:00.000+02:00", "replies_count": 0, "uuid": "4edcf3dedb0eb455d8a3f9394aa239a9524ea140"}, "author": "", "url": "https://in.reuters.com/article/golf-laquinta/golf-rahm-returns-to-california-a-year-older-and-much-wiser-idINKBN1F704C", "ord_in_thread": 0, "title": "Golf-Rahm returns to California a year older and much wiser", "locations": [], "entities": {"persons": [{"name": "phil mickelson", "sentiment": "none"}, {"name": "seve ballesteros", "sentiment": "none"}, {"name": "jon rahm", "sentiment": "none"}, {"name": "rahm", "sentiment": "none"}, {"name": "sergio garcia", "sentiment": "none"}, {"name": "jose maria olazabal", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "rahm", "sentiment": "negative"}, {"name": "careerbuilder", "sentiment": "none"}, {"name": "asu", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "arizona state university", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 1:01 AM / Updated 19 hours ago Golf: Rahm returns to California a year older and much wiser Reuters Staff 3 Min Read \n(Reuters) - Jon Rahm and Phil Mickelson head into this week’s CareerBuilder Challenge with their careers heading in opposite directions. \nRahm was bright-eyed and inexperienced when he arrived in the California desert last January for the event previously known as the Bob Hope Classic. \nHe returns ranked third in the world, a three-times winner (twice on the European Tour and once in the United States) and seemingly on a trajectory to become the next great Spanish player after Seve Ballesteros, Jose Maria Olazabal and Sergio Garcia. \nRahm loves playing in California, not far away from where he settled after finishing his time at Arizona State University (ASU). \n“When I came here last year I think it was my fourth event as a PGA Tour member,” Rahm told reporters on Wednesday. \n”Everything was new to me. I did feel like a rookie. I was trying to learn as I went. \n“Right now, after a year, I feel a lot more comfortable. I feel like I have what I didn’t have then, which is a developed routine of what to do each week.” \nThe 23-year-old has learnt not to overdo things during a tournament, keeping practice to a minimum. He is also learning how to balance an international schedule without wearing himself out. \nHe has resisted the lure of heading to the Middle East this week or next for lucrative European Tour events, instead focussing on the PGA Tour’s West Coast swing. \n“I want to play both tours,” he said. “I need to pace myself.” \nMickelson, 24 years Rahm’s senior, is serving as something of a mentor to the Spaniard and the pair often play practice rounds together. \nMickelson’s brother Tim was Rahm’s coach at ASU, as well as his former agent before he began caddying for Phil last year. \nMickelson is winless since his 2013 British Open victory at Muirfield, having accrued five runner-up finishes since then without lifting a trophy. \nHe starts his 2018 campaign after more than two months off, seeking his third victory at a tournament he previously won in 2002 and 2004, albeit at different courses. \nThe format uses three courses, with the field playing three rounds -- one on each course -- before the cut is made for the final round at the host PGA West Stadium Course in La Quinta. Reporting by Andrew Both in Cary, North Carolina; Editing by Peter Rutherford", "external_links": [], "published": "2018-01-18T02:54:00.000+02:00", "crawled": "2018-01-18T03:26:28.015+02:00", "highlightTitle": ""}