{"organizations": [], "uuid": "a72876a356bfb337d80883f8123b4a187ad2dbd4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/business-wire-guild-mortgage-acquiring-cornerstone-mortgage-st-louis-based-firm-with-19-offices-in-three-states.html", "country": "US", "domain_rank": 767, "title": "Guild Mortgage Acquiring Cornerstone Mortgage, St. Louis-Based Firm with 19 Offices in Three States", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.915, "site_type": "news", "published": "2018-01-11T21:00:00.000+02:00", "replies_count": 0, "uuid": "a72876a356bfb337d80883f8123b4a187ad2dbd4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/business-wire-guild-mortgage-acquiring-cornerstone-mortgage-st-louis-based-firm-with-19-offices-in-three-states.html", "ord_in_thread": 0, "title": "Guild Mortgage Acquiring Cornerstone Mortgage, St. Louis-Based Firm with 19 Offices in Three States", "locations": [], "entities": {"persons": [{"name": "mary ann mcgarry", "sentiment": "none"}, {"name": "mcgarry", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "san diego", "sentiment": "none"}, {"name": "missouri", "sentiment": "none"}, {"name": "st. louis", "sentiment": "none"}, {"name": "mo.", "sentiment": "none"}], "organizations": [{"name": "cornerstone mortgage, inc.", "sentiment": "none"}, {"name": "guild", "sentiment": "none"}, {"name": "ceo of guild", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fast-Growing Regional Firm had Loan Volume of $1.0 billion in 2017; Recognized as Top Place to Work Six Straight Years\nSAN DIEGO--(BUSINESS WIRE)-- Guild Mortgage , one of the largest independent mortgage lenders in the U.S., has reached an agreement to acquire Cornerstone Mortgage, Inc. , of St. Louis, Mo., a fast-growing independent with 19 offices in three states and loan volume of $1.0 billion in 2017.\nMary Ann McGarry, president and CEO of Guild, said the acquisition of Cornerstone fits with Guild’s strategic plan to grow in existing markets and also acquire firms with a strong presence in new markets and proven histories of exemplary customer service and entrepreneurial cultures.\n\"Cornerstone is an exceptional company and a close culture match to Guild with its strong values and experienced loan professionals averaging more than 15 years in the business,” said McGarry. “It has been the fastest growing mortgage banker in Missouri for six straight years and ranked as a Top 25 place to work in local surveys during the same period. We have been admiring their organization for several years and are pleased to enter 2018 with such a strong new presence in the Midwest.”\nCornerstone was founded in 1996 by Angi Stevenson, current president and CEO, and the late Jim Dean. Stevenson has more than 30 years of senior management and operational experience in mortgage lending. Under her leadership, Cornerstone has risen to become the 10th largest woman-owned company in St. Louis as rated by the St. Louis Business Journal and No. 2 in mortgage lending volume for the past three years. She will join Guild as regional vice president of its newly established Midwest Region.\n“We are confident that we will achieve significant growth and gain market share in the Midwest because of the quality of the Cornerstone people and their entrepreneurial spirit, which matches ours,” said McGarry. “Guild will add our proprietary technology to support their growth, starting with our MyMortgage digital platform, combining a paperless loan application with a personalized mortgage experience to help every customer move more easily from application to close. Guild is working on additional enhanced technologies to improve customer service and we look forward to introducing them soon to support our Cornerstone team in the Midwest.”\nCornerstone has 19 branches and more than 200 employees in Missouri, Illinois and Kansas. The acquisition will give Guild a major presence in Missouri. Cornerstone has been No. 2 in mortgage volume in St. Louis the past three years, according to media surveys. The acquisition is expected to close by March 1, 2018.\nStevenson said Cornerstone has grown by striving to put its clients first, a philosophy that aligns with Guild.\n“They have been a leader in adding new technology and systems to improve every step in the lending process and have been recognized for setting national standards in customer satisfaction,” Stevenson said. “They retain more than 85 percent of their loans for servicing. Joining Guild will enhance all that we do. We are looking forward to entering a new era of growth and better serving our customers with such a dynamic organization.”\nGuild recently earned the J.D. Power award for “ Highest in Customer Satisfaction with Primary Mortgage Sales in the U.S. ,” based on results from its 2017 Primary Mortgage Origination Satisfaction Study SM . For the fifth straight year, Guild was named as a best place to work among large companies in an annual survey by The San Diego Union-Tribune.\nGuild Mortgage, which has built a culture of customer service since its founding in 1960, had loan volume of $15.9 billion in 2017. It has grown four-fold since 2010, when loan volume was $4.1 billion and it had 75 branches and satellites in 16 states. Guild has expanded from its base in the West to the Southwest, Southeast and Midwest, and now has some 4,000 employees nationwide and more than 250 branches in 27 states. Servicing volume also grew more than six-fold during the same period, from $6.4 billion to $38.5 billion.\nA top-10 national lender by purchase loan volume, Guild offers first-time homebuyers a wide range of loan options and personalized service. Its mortgage loan officers can serve the needs of any homebuyer, from helping first-time homebuyers achieve home ownership, often through government loan programs, to jumbo home loans. Guild also specializes in helping active duty and retired military personnel to secure VA loans, with 100-percent financing and flexible qualifying standards.\nAbout Guild Mortgage\nFounded in 1960 when the modern U.S. mortgage industry was just forming, Guild Mortgage Co. is a nationally recognized independent mortgage lender offering a wide range of residential mortgage products and local in-house processing, underwriting and funding. Its collegial and entrepreneurial culture enables it to deliver unsurpassed levels of customer service. Having been through every economic cycle, the company has grown 15-fold since 2007, and now has more than 4,000 employees and 250 branch and satellite offices in 27 states. Guild’s highly trained loan professionals are experienced in government-sponsored programs such as FHA, VA, USDA, low down payment assistance programs and other specialized loan programs. The company generated $15.9 billion in loan volume in 2017, as compared to $1.2 billion in 2007. In addition, Guild services more than 190,000 loans, which totaled $38.5 billion in 2017. It has correspondent banking relationships with credit unions and community banks in 47 states. (Equal Housing Lender- Company NMLS #3274).\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180111005703/en/\nMedia Contacts at Nuffer, Smith, Tucker Public Relations (619-296-0605)\nRyan Hall\nrch@nstpr.com\nCell: 949-280-4704\nor\nTom Gable\ntg@nstpr.com\nCell: 619-251-3881\nSource: Guild Mortgage", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.guildmortgage.com%2F&esheet=51741835&newsitemid=20180111005703&lan=en-US&anchor=Guild+Mortgage+Co.&index=5&md5=716a5084f675bcf561b83e3baf8f659e", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.guildmortgage.com%2F&esheet=51741835&newsitemid=20180111005703&lan=en-US&anchor=Guild+Mortgage&index=1&md5=dd1cc7a22f28162ed2709f23e50aa199", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.jdpower.com%2F&esheet=51741835&newsitemid=20180111005703&lan=en-US&anchor=J.D.+Power&index=3&md5=ae4f0ba93241458d8377661edbe1f612", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.guildmortgage.com%2Fpress-release%2Fguild-mortgage-receives-j-d-power-award-ranking-highest-customer-satisfaction%2F&esheet=51741835&newsitemid=20180111005703&lan=en-US&anchor=Highest+in+Customer+Satisfaction+with+Primary+Mortgage+Sales+in+the+U.S.&index=4&md5=0aec414c45a1f6d46f7d0349eafa57bd", "http://www.businesswire.com/news/home/20180111005703/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.cornerstonemortgage.com%2F&esheet=51741835&newsitemid=20180111005703&lan=en-US&anchor=Cornerstone+Mortgage%2C+Inc.&index=2&md5=f04ecc0e213306c4659ba266db1dcc19"], "published": "2018-01-11T21:00:00.000+02:00", "crawled": "2018-01-11T21:33:14.002+02:00", "highlightTitle": ""}