{"organizations": [], "uuid": "66150f17840b3a0d560ca70332e50e65b622f824", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-netscout-systems-reports-financial-results-for-third-quarter-fiscal-year-2018.html", "country": "US", "domain_rank": 767, "title": "NETSCOUT SYSTEMS Reports Financial Results for Third Quarter Fiscal Year 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T15:30:00.000+02:00", "replies_count": 0, "uuid": "66150f17840b3a0d560ca70332e50e65b622f824"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-netscout-systems-reports-financial-results-for-third-quarter-fiscal-year-2018.html", "ord_in_thread": 0, "title": "NETSCOUT SYSTEMS Reports Financial Results for Third Quarter Fiscal Year 2018", "locations": [], "entities": {"persons": [{"name": "anil singhal", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "westford", "sentiment": "none"}], "organizations": [{"name": "netscout", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WESTFORD, Mass.--(BUSINESS WIRE)-- NETSCOUT SYSTEMS, INC. (NASDAQ: NTCT), a leading provider of business assurance, a powerful combination of service assurance, cybersecurity, and business intelligence solutions, today announced financial results for its third quarter of fiscal year 2018 ended December 31, 2017.\n“As previously disclosed on January 10, NETSCOUT’s third-quarter fiscal year 2018 results were primarily impacted by unanticipated reductions in spending by North American carriers, funding delays for a range of Federal projects and longer-than-expected sales cycles for our enterprise offerings,” stated Anil Singhal, NETSCOUT’s president and CEO. “Although we expect these dynamics will continue to create revenue challenges in the fourth quarter, we move forward with a strong competitive position underpinned by a compelling value proposition, an expansive global customer base and many promising new, high-margin products progressing through our sales funnels. We are advancing our planning processes for fiscal year 2019 with a focus on initiatives that we believe will help us strengthen our revenue performance, support continued gross margin gains, improve operating profitability and drive EPS expansion.”\nNotable developments and highlights:\nOn January 16, 2018, NETSCOUT entered into an amended Credit Agreement, which provides for a new five-year $1 billion senior secured revolving credit facility (increased from $800 million under the Original Credit Agreement), as well as better pricing and more favorable terms and conditions compared with the original agreement. This amended Credit Agreement will support the Company’s previously disclosed intentions to execute an Accelerated Share Repurchase (ASR) of up to $300 million within the next several days. The planned ASR will be initiated under the Company’s previously disclosed 25 million share repurchase program. NETSCOUT is continuing to advance its planning processes for fiscal year 2019. As part of this activity, the Company is focused on initiatives that are aimed at strengthening its revenue performance, supporting continued gross margin gains, improving overall operating profitability and driving EPS expansion. The Company is advancing plans to hold its annual Engage Technology and User Summit from May 14-17 in Dallas, Texas.\nQ3 FY18 Financial Results\nTotal revenue (GAAP) for the third quarter of fiscal year 2018 was $268.9 million, compared with $302.2 million in the same quarter one year ago. Non-GAAP total revenue for the third quarter of fiscal year 2018 was $272.0 million versus $311.4 million in the same quarter one year ago. A reconciliation of GAAP and non-GAAP results is included in the attached financial tables.\nProduct revenue (GAAP) for the third quarter of fiscal year 2018 was $153.2 million, which was approximately 57% of total revenue. This compares with third-quarter fiscal year 2017 product revenue (GAAP) of $192.0 million, which was approximately 64% of total revenue. On a non-GAAP basis, product revenue for the third quarter of fiscal year 2018 was $153.9 million, which was approximately 57% of total non-GAAP revenue. This compares with third-quarter fiscal year 2017 non-GAAP product revenue $196.4 million, which was approximately 63% of total non-GAAP revenue.\nService revenue (GAAP) for the third quarter of fiscal year 2018 was $115.8 million, or approximately 43% of total revenue versus service revenue (GAAP) of $110.2 million, or approximately 36% of total revenue, for the same period one year ago. On a non-GAAP basis, service revenue for fiscal year 2018’s third quarter was $118.1 million, or approximately 43% of total non-GAAP revenue, versus non-GAAP service revenue of $115.0 million, or approximately 37% of total non-GAAP revenue, for the same quarter one year ago.\nNETSCOUT’s income from operations (GAAP) was $38.3 million in the third quarter of fiscal year 2018, compared with $33.4 million in the comparable quarter one year ago. The Company’s third-quarter fiscal year 2018 (GAAP) operating margin was 14.2% versus 11.0% in the prior fiscal year’s third quarter. Third-quarter fiscal year 2018 non-GAAP EBITDA from operations was $93.6 million, or 34.4% of non-GAAP quarterly revenue, which compares with $92.8 million, or 29.8% of non-GAAP quarterly revenue in the third quarter of fiscal year 2017. Third-quarter fiscal year 2018 non-GAAP income from operations was $83.9 million with a non-GAAP operating margin of 30.9%. This compares with third-quarter fiscal year 2017 non-GAAP income from operations of $84.3 million and a non-GAAP operating margin of 27.1%.\nNet income (GAAP) for the third quarter of fiscal year 2018 was $89.7 million, or $1.02 per share (diluted) versus $21.2 million, or $0.23 per share (diluted), for the third quarter of fiscal year 2017. On a non-GAAP basis, net income for the third quarter of fiscal year 2018 was $60.7 million, or $0.69 per share (diluted), which compares with $55.2 million, or $0.60 per share (diluted), for the third quarter of fiscal year 2017.\nAs of December 31, 2017, cash and cash equivalents, and short and long-term marketable securities were $383.0 million, compared with $313.4 million as of September 30, 2017 and $464.7 million as of March 31, 2017. During the third quarter of fiscal year 2018, NETSCOUT did not repurchase any of its common stock.\nNine-Months FY18 Financial Results\nFor the first nine months of fiscal year 2018, total revenue (GAAP) was $751.6 million and non-GAAP total revenue was $760.8 million versus total revenue (GAAP) of $843.2 million and non-GAAP total revenue of $872.6 million for the comparable nine-month period of fiscal year 2017. Product revenue (GAAP) for the first three quarters of fiscal year 2018 was $417.3 million compared with $525.5 million in the year-ago period. Non-GAAP product revenue for the first nine months of fiscal year 2018 was $419.4 million compared with $540.1 million in the same period one year ago. For the first nine months of fiscal year 2018, service revenue (GAAP) was $334.3 million versus $317.7 million in the same period last year. Non-GAAP service revenue for the first nine months of fiscal year 2018 was $341.4 million, compared with $332.5 million for the comparable period of fiscal year 2017. NETSCOUT’s income from operations (GAAP) during the first nine months of fiscal year 2018 was $3.5 million, compared with $23.4 million for the comparable nine-month period of fiscal year 2017. The Company’s operating margin (GAAP) for the first nine months of fiscal year 2018 was 0.5% versus 2.8% in the comparable period of fiscal year 2017. During the first three quarters of fiscal year 2018, the Company’s non-GAAP EBITDA from operations was $169.4 million, or 22.3% of non-GAAP total revenue versus non-GAAP EBITDA from operations of $210.8 million, or 24.2% of non-GAAP total revenue, in the first nine months of fiscal year 2017. The Company’s non-GAAP income from operations for the first three quarters of fiscal year 2018 was $140.9 million with a non-GAAP operating margin of 18.5%, compared with non-GAAP income from operations for the same period of fiscal year 2017 of $185.5 million and a non-GAAP operating margin of 21.3%. For the first nine months of fiscal year 2018, NETSCOUT’s net income (GAAP) was $63.0 million, or $0.70 per share (diluted) compared with net income of $11.0 million, or $0.12 per share (diluted) in the same nine-month period one year ago. Non-GAAP net income for the first nine months of fiscal year 2018 was $94.5 million, or $1.05 per share (diluted) versus non-GAAP net income for the same period of fiscal year 2017 of $118.0 million, or $1.27 per share (diluted). During the first three quarters of fiscal year 2018, NETSCOUT repurchased a total of 5,802,788 shares of its common stock at an average price of $34.47 per share, totaling approximately $200.0 million in the aggregate.\nGuidance:\nOn January 10, 2018, NETSCOUT updated its full fiscal year 2018 outlook. Please note that certain new assumptions regarding the magnitude of the planned ASR have no impact on this guidance:\nThe Company’s fiscal year 2018 GAAP revenue is expected to be in the range of approximately $985 million and $1.015 billion. The Company expects fiscal year 2018 non-GAAP revenue will be in the range of approximately $1.0 billion to $1.025 billion. Due to the impact of recently enacted tax legislation, NETSCOUT’s effective (GAAP) tax rate for fiscal year 2018 is expected to be in the range of -5000 percent to -5500 percent. The Company’s fiscal year 2018 non-GAAP effective tax is anticipated to be around 28 percent. Assuming completion of the Accelerated Share Repurchase for $300 million at a price of approximately $27.00 per share, the Company still expects fourth-quarter fiscal year 2018 shares outstanding (diluted) to be approximately 83.6 million shares, thereby reducing fiscal year 2018 shares outstanding (diluted) to approximately 89.3 million. Taking all of the aforementioned items into account, NETSCOUT expects that fiscal year 2018’s GAAP net income per share (diluted) to range from $0.53 to $0.84. NETSCOUT anticipates non-GAAP net income per share (diluted) in the range of approximately $1.30 to $1.45. A reconciliation between GAAP and non-GAAP revenue and net income per share (diluted) for NETSCOUT’s guidance is included in the attached financial tables.\nConference Call Instructions:\nNETSCOUT will host a conference call to discuss its third-quarter fiscal year 2018 financial results, its outlook for fiscal year 2018 and other matters today at 8:30 a.m. ET. This call will be webcast live through NETSCOUT’s website at http://ir.netscout.com/phoenix.zhtml?c=92658&p=irol-irhome . Alternatively, people can listen to the call by dialing (785) 424-1877. The conference call ID is NTCTQ318. A replay of the call will be available after 12:00 p.m. ET on January 30, 2018 for approximately one week. The number for the replay is (800) 283-8486 for U.S./Canada and (402) 220-0869 for international callers.\nUse of Non-GAAP Financial Information:\nTo supplement the financial measures presented in NETSCOUT's press release in accordance with accounting principles generally accepted in the United States (\"GAAP\"), NETSCOUT also reports the following non-GAAP measures: non-GAAP total revenue, non-GAAP product revenue, non-GAAP service revenue, non-GAAP income from operations, non-GAAP operating margin, non-GAAP earnings before interest and other expense, income taxes, depreciation and amortization (EBITDA) from operations, non-GAAP EBITDA from operations margin, non-GAAP net income, and non-GAAP net income per share (diluted). Non-GAAP revenue (total, product and service) eliminates the GAAP effects of acquisitions by adding back revenue related to deferred revenue revaluation, as well as revenue impacted by the amortization of intangible assets. Non-GAAP income from operations includes the aforementioned revenue adjustments and also removes expenses related to the amortization of acquired intangible assets, stock-based compensation, and certain expenses relating to acquisitions including depreciation costs, compensation for post-combination services and business development and integration costs. Non-GAAP EBITDA from operations, which has been presented herein as a measure of NETSCOUT’s performance, includes the aforementioned items related to non-GAAP income from operations and also removes non-acquisition-related depreciation expense. Non-GAAP operating margin is calculated based on the non-GAAP financial metrics discussed above. Non-GAAP net income includes the aforementioned items related to non-GAAP income from operations, net of related income tax effects in addition to the provisional one-time impacts of the U.S. Tax Cuts and Jobs Act. Non-GAAP diluted net income per share also excludes these expenses as well as the related impact of all these adjustments on the provision for income taxes. Investors are encouraged to review the related GAAP financial measures and the reconciliation of these non-GAAP financial measures to their most directly comparable GAAP financial measures included in the attached tables within this press release.\nThese non-GAAP measures are not in accordance with GAAP, should not be considered an alternative for measures prepared in accordance with GAAP (revenue, gross profit, operating profit, net income and diluted net income per share), and may have limitations because they do not reflect all of NETSCOUT’s results of operations as determined in accordance with GAAP. These non-GAAP measures should only be used to evaluate NETSCOUT’s results of operations in conjunction with the corresponding GAAP measures. The presentation of non-GAAP information is not meant to be considered superior to, in isolation from or as a substitute for results prepared in accordance with GAAP.\nNETSCOUT believes these non-GAAP financial measures will enhance the reader’s overall understanding of NETSCOUT’s current financial performance and NETSCOUT's prospects for the future by providing a higher degree of transparency for certain financial measures and providing a level of disclosure that helps investors understand how the Company plans and measures its own business. NETSCOUT believes that providing these non-GAAP measures affords investors a view of NETSCOUT’s operating results that may be more easily compared to peer companies and also enables investors to consider NETSCOUT’s operating results on both a GAAP and non-GAAP basis during and following the integration period of NETSCOUT’s acquisitions. Presenting the GAAP measures on their own, without the supplemental non-GAAP disclosures, might not be indicative of NETSCOUT’s core operating results. Furthermore, NETSCOUT believes that the presentation of non-GAAP measures when shown in conjunction with the corresponding GAAP measures provides useful information to management and investors regarding present and future business trends relating to its financial condition and results of operations.\nNETSCOUT management regularly uses supplemental non-GAAP financial measures internally to understand, manage and evaluate its business and to make operating decisions. These non-GAAP measures are among the primary factors that management uses in planning and forecasting.\nAbout NETSCOUT SYSTEMS, INC.\nNETSCOUT SYSTEMS, INC. (NASDAQ: NTCT) assures digital business services against disruptions in availability, performance, and security. Our market and technology leadership stems from combining our patented smart data technology with smart analytics. We provide real-time, pervasive visibility, and insights customers need to accelerate, and secure their digital transformation. Our approach transforms the way organizations plan, deliver, integrate, test, and deploy services and applications. Our nGenius service assurance solutions provide real-time, contextual analysis of service, network, and application performance. Arbor security solutions protect against DDoS attacks that threaten availability, and advanced threats that infiltrate networks to steal critical business assets. To learn more about improving service, network, and application performance in physical or virtual data centers, or in the cloud, and how NETSCOUT’s performance and security solutions, powered by service intelligence can help you move forward with confidence, visit www.netscout.com or follow @NETSCOUT and @ArborNetworks on Twitter, Facebook, or LinkedIn.\nSafe Harbor\nForward-looking statements in this release are made pursuant to the safe harbor provisions of Section 21E of the Securities Exchange Act of 1934 and other federal securities laws. Investors are cautioned that statements in this press release, which are not strictly historical statements, including without limitation, the statements related to fourth-quarter revenue challenges, fiscal year 2018 financial guidance and related performance trends for NETSCOUT, the Company’s strong competitive position, initiatives that will help strengthen the Company’s revenue performance, support continued gross margin gains, improve operating profitability and drive EPS expansion, and the timing and magnitude of the Company’s Accelerated Stock Repurchase constitute forward-looking statements which involve risks and uncertainties. Actual results could differ materially from the forward-looking statements due to known and unknown risk, uncertainties, assumptions and other factors. Such factors include potential differences between NETSCOUT’s preliminary results and the final results for the quarter ended December 31, 2017 as a result of the completion of financial reporting processes and review, slowdowns or downturns in economic conditions generally and in the market for advanced network, service assurance and cybersecurity solutions specifically; the volatile foreign exchange environment; the Company’s relationships with strategic partners and resellers; dependence upon broad-based acceptance of the Company’s network performance management solutions; the presence of competitors with greater financial resources than we have, and their strategic response to our products; our ability to retain key executives and employees; lower than expected demand for the Company’s products and services; and the timing and magnitude of stock buyback activity based on market conditions, corporate considerations, debt agreements, and regulatory requirements. For a more detailed description of the risk factors associated with the Company, please refer to the Company’s Annual Report on Form 10-K for the fiscal year ended March 31, 2017 and the Company’s subsequent Quarterly Reports on Form 10-Q, which are on file with the Securities and Exchange Commission. NETSCOUT assumes no obligation to update any forward-looking information contained in this press release or with respect to the announcements described herein.\n©2018 NETSCOUT SYSTEMS, INC. All rights reserved. NETSCOUT and the NETSCOUT logo are registered trademarks or trademarks of NETSCOUT SYSTEMS, INC. and/or its subsidiaries and/or affiliates in the USA and/or other countries.\nNETSCOUT SYSTEMS, INC. Condensed Consolidated Statements of Operations (In thousands, except per share data) (Unaudited) Three Months Ended Nine Months Ended December 31, December 31, 2017 2016 2017 2016 Revenue: Product $ 153,179 $ 192,010 $ 417,282 $ 525,472 Service 115,765 110,182 334,281 317,720 Total revenue 268,944 302,192 751,563 843,192 Cost of revenue: Product 41,327 55,296 125,013 171,770 Service 23,182 26,382 80,301 81,452 Total cost of revenue 64,509 81,678 205,314 253,222 Gross profit 204,435 220,514 546,249 589,970 Operating expenses: Research and development 44,287 58,084 161,762 179,681 Sales and marketing 77,270 83,212 239,897 241,506 General and administrative 23,033 28,540 82,400 90,994 Amortization of acquired intangible assets 18,221 17,515 54,902 52,646 Restructuring charges 3,363 (199 ) 3,821 1,730 Total operating expenses 166,174 187,152 542,782 566,557 Income from operations 38,261 33,362 3,467 23,413 Interest and other expense, net (3,107 ) (2,748 ) (9,565 ) (8,082 ) Income (loss) before income tax expense (benefit) 35,154 30,614 (6,098 ) 15,331 Income tax expense (benefit) (54,531 ) 9,369 (69,093 ) 4,350 Net income $ 89,685 $ 21,245 $ 62,995 $ 10,981 Basic net income per share $ 1.03 $ 0.23 $ 0.71 $ 0.12 Diluted net income per share $ 1.02 $ 0.23 $ 0.70 $ 0.12 Weighted average common shares outstanding used in computing: Net income per share - basic 87,210 91,762 88,985 92,337 Net income per share - diluted 87,860 92,402 89,882 92,997\nNETSCOUT SYSTEMS, INC. Consolidated Balance Sheets (In thousands) December 31, March 31, 2017 2017 (unaudited) Assets Current assets: Cash, cash equivalents and marketable securities $ 379,807 $ 442,772 Accounts receivable and unbilled costs, net 249,939 294,374 Inventories 36,592 40,002 Prepaid expenses and other current assets 47,169 77,318 Total current assets 713,507 854,466 Fixed assets, net 53,646 61,393 Goodwill and intangible assets, net 2,575,531 2,649,431 Long-term marketable securities 3,187 21,933 Other assets 13,148 14,290 Total assets $ 3,359,019 $ 3,601,513 Liabilities and Stockholders' Equity Current liabilities: Accounts payable $ 32,469 $ 37,407 Accrued compensation 54,010 77,607 Accrued other 33,575 34,579 Deferred revenue and customer deposits 299,271 310,594 Total current liabilities 419,325 460,187 Other long-term liabilities 7,412 8,765 Deferred tax liability 177,598 277,599 Accrued long-term retirement benefits 35,589 32,117 Long-term deferred revenue 87,747 86,595 Long-term debt 300,000 300,000 Total liabilities 1,027,671 1,165,263 Stockholders' equity: Common stock 117 116 Additional paid-in capital 2,735,387 2,693,846 Accumulated other comprehensive loss 46 (3,472 ) Treasury stock, at cost (783,878 ) (570,921 ) Retained earnings 379,676 316,681 Total stockholders' equity 2,331,348 2,436,250 Total liabilities and stockholders' equity $ 3,359,019 $ 3,601,513\nNETSCOUT SYSTEMS, INC. Reconciliation of Current GAAP to Current and Historical Non-GAAP Financial Measures (In thousands, except per share data) (Unaudited) Three Months Ended Three Months Ended Nine Months Ended December 31, September 30, December 31, 2017 2016 2017 2017 2016 Product Revenue (GAAP) $ 153,179 $ 192,010 $ 149,281 $ 417,282 $ 525,472 Product deferred revenue fair value adjustment 719 1,514 719 2,154 5,989 Amortization of acquired intangible assets (2) 3 2,851 2 7 8,597 Non-GAAP Product Revenue $ 153,901 $ 196,375 $ 150,002 $ 419,443 $ 540,058 Service Revenue (GAAP) $ 115,765 $ 110,182 $ 107,582 $ 334,281 $ 317,720 Service deferred revenue fair value adjustment 2,345 4,797 2,361 7,081 14,798 Non-GAAP Service Revenue $ 118,110 $ 114,979 $ 109,943 $ 341,362 $ 332,518 Revenue (GAAP) $ 268,944 $ 302,192 $ 256,863 $ 751,563 $ 843,192 Product deferred revenue fair value adjustment 719 1,514 719 2,154 5,989 Service deferred revenue fair value adjustment 2,345 4,797 2,361 7,081 14,798 Amortization of acquired intangible assets (2) 3 2,851 2 7 8,597 Non-GAAP Revenue $ 272,011 $ 311,354 $ 259,945 $ 760,805 $ 872,576 Gross Profit (GAAP) $ 204,435 $ 220,514 $ 182,620 $ 546,249 $ 589,970 Product deferred revenue fair value adjustment 719 1,514 719 2,154 5,989 Service deferred revenue fair value adjustment 2,345 4,797 2,361 7,081 14,798 Share-based compensation expense (1) 1,588 1,270 1,587 4,404 3,774 Amortization of acquired intangible assets (2) 9,314 13,816 9,309 27,864 40,315 Business development and integration expense (3) (405 ) 91 (340 ) 244 181 Compensation for post-combination services (5) - 27 - - 552 Acquisition related depreciation expense (6) 33 43 36 111 196 Non-GAAP Gross Profit $ 218,029 $ 242,072 $ 196,292 $ 588,107 $ 655,775 Income (Loss) from Operations (GAAP) $ 38,261 $ 33,362 $ (1,239 ) $ 3,467 $ 23,413 Product deferred revenue fair value adjustment 719 1,514 719 2,154 5,989 Service deferred revenue fair value adjustment 2,345 4,797 2,361 7,081 14,798 Share-based compensation expense (1) 12,425 10,461 12,598 35,254 30,271 Amortization of acquired intangible assets (2) 27,535 31,331 27,607 82,766 92,961 Business development and integration expense (3) (2,335 ) 2,252 (1,244 ) 2,577 8,898 New standard implementation expense (4) 903 - 431 1,334 - Compensation for post-combination services (5) 225 256 404 866 4,838 Restructuring charges 3,363 (199 ) 291 3,821 1,730 Acquisition related depreciation expense (6) 498 556 506 1,559 2,581 Non-GAAP Income from Operations $ 83,939 $ 84,330 $ 42,434 $ 140,879 $ 185,479 Net Income (Loss) (GAAP) $ 89,685 $ 21,245 $ (2,468 ) $ 62,995 $ 10,981 Product deferred revenue fair value adjustment 719 1,514 719 2,154 5,989 Service deferred revenue fair value adjustment 2,345 4,797 2,361 7,081 14,798 Share-based compensation expense (1) 12,425 10,461 12,598 35,254 30,271 Amortization of acquired intangible assets (2) 27,535 31,331 27,607 82,766 92,961 Business development and integration expense (3) (2,335 ) 2,252 (1,244 ) 2,577 8,898 New standard implementation expense (4) 903 - 431 1,334 - Compensation for post-combination services (5) 225 256 404 866 4,838 Restructuring charges 3,363 (199 ) 291 3,821 1,730 Acquisition related depreciation expense (6) 498 556 506 1,559 2,581 Income tax adjustments (7) (74,640 ) (17,006 ) (15,001 ) (105,861 ) (55,078 ) Non-GAAP Net Income $ 60,723 $ 55,207 $ 26,204 $ 94,546 $ 117,969 Diluted Net Income (Loss) Per Share (GAAP) $ 1.02 $ 0.23 $ (0.03 ) $ 0.70 $ 0.12 Share impact of non-GAAP adjustments identified above (0.33 ) 0.37 0.32 0.35 1.15 Non-GAAP Diluted Net Income Per Share $ 0.69 $ 0.60 $ 0.29 $ 1.05 $ 1.27 Shares used in computing non-GAAP diluted net income per share 87,860 92,402 89,525 89,882 92,997 NETSCOUT SYSTEMS, INC. Reconciliation of Current GAAP to Current and Historical Non-GAAP Financial Measures - Continued (In thousands, except per share data) (Unaudited) Three Months Ended Three Months Ended Nine Months Ended December 31, September 30, December 31, 2017 2016 2017 2017 2016 (1) Share-based compensation expense included in these amounts is as follows:\nCost of product revenue $ 301 $ 255 $ 293 $ 807 $ 716 Cost of service revenue 1,287 1,015 1,294 3,597 3,058 Research and development 3,730 3,456 3,915 10,820 9,961 Sales and marketing 4,022 3,367 4,147 11,613 9,704 General and administrative 3,085 2,368 2,949 8,417 6,832 Total share-based compensation expense $ 12,425 $ 10,461 $ 12,598 $ 35,254 $ 30,271 (2) Amortization expense related to acquired software and product technology, tradenames, customer relationships included in these amounts is as follows:\nTotal revenue adjustment $ 3 $ 2,851 $ 2 $ 7 $ 8,597 Cost of product revenue 9,311 10,965 9,307 27,857 31,718 Operating expenses 18,221 17,515 18,298 54,902 52,646 Total amortization expense $ 27,535 $ 31,331 $ 27,607 $ 82,766 $ 92,961 (3) Business development and integration expense included in these amounts is as follows:\nCost of product revenue $ (107 ) $ 91 $ (106 ) $ 226 $ 181 Cost of service revenue (298 ) - (234 ) 18 - Research and development (661 ) 11 (401 ) 61 11 Sales and marketing (620 ) 7 (199 ) 357 41 General and administrative (649 ) 2,143 (304 ) 1,915 8,665 Total business development and integration expense $ (2,335 ) $ 2,252 $ (1,244 ) $ 2,577 $ 8,898 (4) New standard implementation expense included in these amounts is as follows:\nGeneral and administrative $ 903 $ - $ 431 $ 1,334 $ - Total new standard implementation expense $ 903 $ - $ 431 $ 1,334 $ - (5) Compensation for post-combination services included in these amounts is as follows:\nCost of product revenue $ - $ 1 $ - $ - $ 156 Cost of service revenue - 26 - - 396 Research and development 193 219 325 702 1,780 Sales and marketing 13 6 62 128 1,732 General and administrative 19 4 17 36 774 Total compensation for post-combination services $ 225 $ 256 $ 404 $ 866 $ 4,838 (6) Acquisition related depreciation expense included in these amounts is as follows:\nCost of product revenue $ 13 $ 27 $ 16 $ 55 $ 112 Cost of service revenue 20 16 20 56 84 Research and development 307 344 311 962 1,704 Sales and marketing 42 54 44 140 267 General and administrative 116 115 115 346 414 Total acquisition related depreciation expense $ 498 $ 556 $ 506 $ 1,559 $ 2,581 (7) Total income tax adjustment included in these amounts is as follows:\nTax effect of non-GAAP adjustments above $ (74,640 ) $ (17,006 ) $ (15,001 ) $ (105,861 ) $ (55,078 ) Total income tax adjustments $ (74,640 ) $ (17,006 ) $ (15,001 ) $ (105,861 ) $ (55,078 )\nNETSCOUT SYSTEMS, INC. Reconciliation of Current GAAP to Current and Historical Non-GAAP Financial Measures - Non-GAAP EBITDA (In thousands, except per share data) (Unaudited) Three Months Ended Three Months Ended Nine Months Ended December 31, September 30, December 31, 2017 2016 2017 2017 2016 Income (loss) from operations (GAAP) $ 38,261 $ 33,362 $ (1,239 ) $ 3,467 $ 23,413 Previous adjustments to determine non-GAAP income from operations 45,678 50,968 43,673 137,412 162,066 Non-GAAP Income from operations 83,939 84,330 42,434 140,879 185,479 Depreciation excluding acquisition related 9,617 8,421 9,383 28,534 25,347 Non-GAAP EBITDA from operations $ 93,556 $ 92,751 $ 51,817 $ 169,413 $ 210,826\nNETSCOUT SYSTEMS, INC. Reconciliation of GAAP Financial Guidance to Non-GAAP Financial Guidance (Unaudited) (FY'17 In millions, except net income per share - diluted)\nFY'17 FY'18 Updated (1/30/18) GAAP revenue $ 1,162.1 ~$985 million to ~$1,015 million Deferred service revenue fair value adjustment $ 19.5 ~$8 million to ~$10 million Deferred product revenue fair value adjustment $ 6.8 ~$2 million to ~$4 million Amortization of intangible assets $ 11.4 Non-GAAP revenue $ 1,199.8 $1,000 million to $1,025 million FY'17 FY'18 GAAP Net Income $ 33.3 $47 million to $75 million Deferred service revenue fair value adjustment $ 19.5 ~$7 million to ~$9 million\nDeferred product revenue fair value adjustment $ 6.8 ~$2 million to ~$4 million Amortization of intangible assets $ 123.6 ~$110 million to ~$112 million Share-based compensation expenses $ 39.2 ~$45 million to ~$47 million Business development & integration expenses* $ 20.3 ~$4 million to ~$5 million New accounting standard implementation $ - ~$2 million to ~$3 million Restructuring costs $ 4.0 ~$4 million to ~$5 million Other income $ (0.4 ) - Total Adjustments $ 212.9 ~$174 million to ~$185 million Related impact of adjustments on income tax** $ (67.7 ) (~$119 million to ~$116 million) Non-GAAP Net Income $ 178.5 $116 million to $130 million GAAP net income per share (diluted) $ 0.36 $0.53 to $0.84 Non-GAAP net income per share (diluted) $ 1.92 $1.30 to $1.45 Average Weighted Shares Outstanding (diluted)*** 92.9 89.3 million * Business development & integration expenses include compensation for post-combination services and acquisition-related depreciation expense\n** Assumes a non-GAAP annual effective tax rate of 28% *** Assumes execution of an Accelerated Stock Repurchase of $300 million\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180130005256/en/\nNETSCOUT SYSTEMS, INC.\nInvestors\nAndrew Kramer, 978-614-4279\nVice President of Investor Relations\nIR@netscout.com\nor\nMedia\nDonna Candelori, 408-571-5226\nSenior Public Relations Manager\nDonna.Candelori@netscout.com\nSource: NETSCOUT SYSTEMS, INC.", "external_links": ["http://ir.netscout.com/phoenix.zhtml?c=92658&p=irol-irhome", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.netscout.com%2Fengage18%2Findex.html&esheet=51750228&newsitemid=20180130005256&lan=en-US&anchor=Engage+Technology+and+User+Summit&index=2&md5=f3dff5bad8e048a779f749ab630f9ddc", "http://www.businesswire.com/news/home/20180130005256/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.netscout.com%2F&esheet=51750228&newsitemid=20180130005256&lan=en-US&anchor=NETSCOUT+SYSTEMS%2C+INC.&index=1&md5=da1c9cd4a4316675fb40c73e836c9a32", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fir.netscout.com%2Fphoenix.zhtml%3Fc%3D92658%26p%3Dirol-irhome&esheet=51750228&newsitemid=20180130005256&lan=en-US&anchor=http%3A%2F%2Fir.netscout.com%2Fphoenix.zhtml%3Fc%3D92658%26p%3Dirol-irhome&index=3&md5=0f2671c159029320b22f91431c9b14c4", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.netscout.com&esheet=51750228&newsitemid=20180130005256&lan=en-US&anchor=www.netscout.com&index=4&md5=8de6a8887e96b3ba40b46218e2b8d5b6"], "published": "2018-01-30T15:30:00.000+02:00", "crawled": "2018-01-30T15:21:08.011+02:00", "highlightTitle": ""}