{"organizations": [], "uuid": "0628b53fe39ad4aa189cbd73ddfc7e4162848a47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XF148_3bR69_TOP_20180129053221.jpg", "site_section": "http://online.wsj.com/xml/rss/3_7031.xml", "section_title": "WSJ.com: Markets", "url": "https://www.wsj.com/articles/chinas-big-car-makers-are-driving-at-different-speeds-1517223640", "country": "US", "domain_rank": 387, "title": "China’s Big Car Makers Are Driving at Different Speeds", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T13:00:00.000+02:00", "replies_count": 0, "uuid": "0628b53fe39ad4aa189cbd73ddfc7e4162848a47"}, "author": "Anjani Trivedi", "url": "https://www.wsj.com/articles/chinas-big-car-makers-are-driving-at-different-speeds-1517223640", "ord_in_thread": 0, "title": "China’s Big Car Makers Are Driving at Different Speeds", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "geely automobile holdings", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS As China’s car market cools, some auto makers are hitting speed traps. \nGreat Wall Motors, China’s largest SUV maker, warned late Friday its earnings last year likely fell 50% from a year earlier, thanks largely to its high spending on marketing and R&D. That was a stark contrast to a more welcome announcement from rival Geely Automobile Holdings GELYY -2.38% earlier this month: It expects its profit to have more-than doubled last year thanks largely to higher sales volume and a varied and well-targeted product mix. \nThe fates of the two companies are diverging as China’s once-booming car sales become more pedestrian, and Beijing goes green . Best-case estimates put the industry’s growth at around 4% this year, up a touch from last year’s mediocre 2% rise, but a far cry from 16% growth in 2016. \nGreat Wall’s travails illustrate the looming challenges in China’s hypercompetitive car industry, which churns out more than 20 million cars a year. The building regulatory pressure to comply with tougher fuel-economy standards means it is having to spend heavily on electric-vehicle development. In 2016, it fell short of fuel-consumption targets and looks like it will for 2017 as well. The SUV and truck maker’s spending on selling and other nonproduction costs has continued to rise—to more than 40% of gross profits in the 12 months to September. \nGeely has been spending even more on such items: The difference is, it’s been selling more vehicles and its profits are rising much faster , partly thanks to its success in tapping China’s obsession for new models and premium cars. It has been quicker than rivals to cotton on to the country’s push for greener cars too: Volvo, the Swedish car maker Geely owns , said last summer it would only make fully electric or hybrid cars by 2019. Within China, Geely plans to launch at least eight new SUVs, sedans and crossovers this year, including three premium models. Meanwhile, Great Wall has seven SUVs in the pipeline.\nHaval SUV models are parked outside the Great Wall Motors assembly plant in Baoding, China. Photo: Andy Wong/Associated Press Geely has been an investor darling for over a year now; some investors who may have missed the boat jumped into Great Wall last autumn, giving its stock a boost. As result, the valuation gap between the two companies on a price-to-earnings basis has narrowed: Great Wall now trades at a 40% discount to its peer, down from 100% at Geely’s peak valuation last October. \nWhether or not investors now have the two companies’ relative values more right than wrong, their recent performance shows that as China’s car market slows, not everyone can stay in the fast lane. \nWrite to Anjani Trivedi at anjani.trivedi@wsj.com", "external_links": [], "published": "2018-01-29T13:00:00.000+02:00", "crawled": "2018-01-29T13:08:14.002+02:00", "highlightTitle": ""}