{"organizations": [], "uuid": "2d3cc508b81eead0b38f4c696bb5f01d74c445a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/23/reuters-america-update-3-oil-rises-on-imf-world-growth-outlook-opec-led-supply-curbs.html", "country": "US", "domain_rank": 767, "title": "UPDATE 3-Oil rises on IMF world growth outlook, OPEC-led supply curbs", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T12:41:00.000+02:00", "replies_count": 0, "uuid": "2d3cc508b81eead0b38f4c696bb5f01d74c445a5"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/23/reuters-america-update-3-oil-rises-on-imf-world-growth-outlook-opec-led-supply-curbs.html", "ord_in_thread": 0, "title": "UPDATE 3-Oil rises on IMF world growth outlook, OPEC-led supply curbs", "locations": [], "entities": {"persons": [], "locations": [{"name": "russia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}], "organizations": [{"name": "imf", "sentiment": "negative"}, {"name": "opec", "sentiment": "negative"}, {"name": "commerzbank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "international monetary fund", "sentiment": "none"}, {"name": "wti", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* IMF lifts growth outlook for 2018, 2019 to 3.9 percent\n* Strong demand comes as OPEC, Russia withhold oil supplies\n* Crumbling refinery profits could dent crude orders (Updates throughout, adds comment, changes dateline from SINGAPORE)\nLONDON, Jan 23 (Reuters) - Oil prices rose on Tuesday, lifted by healthy world economic growth prospects and production curbs by OPEC, Russia and their allies.\nBrent crude futures were up 28 cents at $69.31 a barrel at 1018 GMT, not far off the three-year high of $70.37 reached on Jan. 15.\nU.S. West Texas Intermediate (WTI) crude futures rose 33 cents to $63.90 a barrel. WTI reached its highest since December 2014 on Jan. 16 at $64.89.\nThe International Monetary Fund on Monday revised upward its forecast for world economic growth to 3.9 percent for both 2018 and 2019, a 0.2 percentage point increase from its last update in October.\n\"The IMFs upward revision of its growth forecast is generating tailwind,\" Commerzbank analysts said. \"This further improves the already fairly rosy demand prospects on the oil market.\"\nThe demand growth comes at a time of supply curbs by the Organization of the Petroleum Exporting Countries, Russia and other producers, which began in January 2017 and that are due to run until the end of 2018.\n\"The outlook for 2018 is roughly balanced for most of the year, but inventories are set to rise in Q4 2018,\" French bank BNP Paribas said.\nThe bank said it had hiked its 2018 oil price forecasts by $10 a barrel, expecting WTI to average $60 and Brent $65.\nBut there have been signs of a possible price correction.\nCrumbling refinery profits, first in Asia and now also in Europe and the United States, as a result of rising feedstock prices and plentiful availability of fuel products, point to lower crude orders going forward.\nBarclays said it expected Brent to average $60 a barrel this year, $5 above its previous forecast, due to strong demand growth and falling output from OPEC-member Venezuela.\nBut the British bank said it had \"a bearish view on oil prices for the quarters ahead.\"\nIn the long-term, investors are preparing for a fall in oil demand due to the rise of electric vehicles. Bank of America Merrill Lynch said it saw \"peak oil demand\" by 2030, with electric vehicles replacing conventional ones by 2050.\nThe bank said that when gasoline demand peaked by 2025 and oil demand overall peaked by 2030, \"refinery utilisation rates may decline permanently and refining margins suffer heavily.\"\n(Additional reporting by Henning Gloystein in Singapore; Editing by Edmund Blair)", "external_links": [], "published": "2018-01-23T12:41:00.000+02:00", "crawled": "2018-01-24T09:16:47.019+02:00", "highlightTitle": ""}