{"organizations": [], "uuid": "2250567429d330ce8e1875260e9197b4143982b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226321618&w=1200&r=LYNXMPEE0S0XY", "site_section": "https://www.reuters.com/places/japan", "section_title": "World News | Reuters.com", "url": "https://www.reuters.com/article/us-newsnow-jan29/monday-morning-briefing-idUSKBN1FI1M2", "country": "US", "domain_rank": 408, "title": "Monday Morning Briefing", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-29T21:22:00.000+02:00", "replies_count": 0, "uuid": "2250567429d330ce8e1875260e9197b4143982b5"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-newsnow-jan29/monday-morning-briefing-idUSKBN1FI1M2", "ord_in_thread": 0, "title": "Monday Morning Briefing", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "none"}], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "tennessee", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Japan is set to inspect its cryptocurrency exchanges after Tokyo-based Coincheck suffered one of the largest cyber heists on record; the Grammys’ glitterati were out in full force bearing white roses in support for women’s equality, and it’s déjà vu for a Tennessee city where jobs are at risk following Trump’s washer tariffs.\nTech\nThe United States is considering throwing its hat into the ring of the 5G race , but not just for the tech bragging rights . “We want to build a network so the Chinese can’t listen to your calls,” a senior official told Reuters, elaborating on plans by President Trump’s national security team to build a super-fast wireless network to counter the threat of Chinese espionage.\nThe spotlight is on Japan’s regulation of cryptocurrencies after Tokyo-based Coincheck suffered one of the largest cyber heists on record. After hackers stole $530 million worth of digital money from its exchange, Japan’s financial regulator ordered Coincheck to get its act together and said it would inspect all cryptocurrency exchanges.\nUnited States\nOfficials in a north Tennessee city are experiencing a \"Not again\" moment now jobs are at risk following Trump’s steep tariffs on imported washing machines. Clarksville has been hung out to dry before by international trade disputes, but at stake this time is an appliance manufacturing complex that could eventually employ thousands of workers and which the state of Tennessee and the local community supported with some $23 million in grants.\nA Reuters/Ipsos poll revealed that two percent of U.S. adults said they had gotten a raise, bonus or other additional benefits due to the recent U.S. tax reform enacted a month ago by Trump. While the full impact of the U.S. tax reform will not be known for some time, Republicans hailed the measure as a middle class boost, and praised businesses as such as Wal-Mart and JPMorgan for announcing wage and benefit increases in response to the tax plan.\nBusiness\nFrench drugmaker Sanofi has agreed to buy Belgian biotech company here for 3.9 billion euros ($4.8 billion), beating Novo Nordisk and marking its second big deal this month after buying Bioverativ.\nFacebook said it was publishing its privacy principles for the first time and rolling out educational videos to help users control who has access to their information, as it prepares for the start of a tough new EU data protection law.\nThe revolution in U.S. shale oil has battered Canada’s energy industry in recent years, ending two decades of rapid expansion and job creation in the nation’s vast oil sands. Now Canada is looking to its own shale fields to repair the economic damage .\nBreakingviews : Beware the Davos bubble’s dubious emissions\nVolkswagen is grappling with further disgrace as details emerged of company tests where people and monkeys were exposed to toxic fumes. Volkswagen’s supervisory board called for an immediate inquiry and the German government denounced the study, whose revelation is the latest aftershock from the Volkswagen emissions-rigging scandal, which continues to rock the auto industry.\nWorld\nMilitants raided a military academy in Kabul killing 11 soldiers , the fourth major attack in a spate of violence in Afghanistan that is putting a new, more aggressive U.S. strategy under the spotlight.\nIn Saudi Arabia, Prince Alwaleed bin Talal’s freedom has sent shares of his flagship company soaring , but banks will remain cautious about dealing with his company until they have more clarity about the circumstances of his release from a corruption probe.\nPolice in the Philippines resumed President Rodrigo Duterte’s war on drugs, making visits to the homes of users and dealers to convince them to surrender, but the national police chief declined to guarantee that blood would not be shed .\nReuters TV : Russian police detain Putin-critic Navalny at a protest.\nKim Jong Nam, the estranged half-brother of North Korean’s leader, met a United States national at a Malaysian island hotel days before his sensational killing last February, a police official told a court hearing.\nNearly 1,500 people have been evacuated from homes in the Paris region, with authorities on alert for any major flood risk after the levels of the swollen River Seine rose further on Sunday.\nSinger Miley Cyrus at the 60th Annual Grammy Awards in New York, U.S., 28/01/2018 REUTERS/Andrew Kell Entertainment\nEven the most outrageous outfits of feathers, sequins or lace included a simple white rose at the Grammy Awards show’s red carpet as the glitterati of the music world showed support for women’s equality and freedom from sexual harassment.\nR&B artist Bruno Mars won the top prize at the awards in another victory for pop-driven music over rap, now the most popular genre in the United States. However, the surprise star of the night was former Democratic presidential candidate Hillary Clinton, who took part in a parody sketch with John Legend, Cher, Cardi B and Snoop Dogg who read aloud from Michael Wolff’s controversial book “Fire and Fury.”\nCommentary\nIn a much-anticipated speech at the World Economic Forum in Davos, U.S. President Donald Trump took his “America First” message global, arguing that his tax cuts will boost profits and create jobs far beyond U.S. borders. However, “globalization is a political as much as an economic movement,” writes columnist John Lloyd . If ordinary people throughout the world do not see more of the fruits of globalization, “the angry challenge to mainstream politics, to free markets and to capitalism itself will continue.”\n ", "external_links": ["https://www.reuters.tv/v/5cX/2017/12/29/predictions-china-will-lead-the-digital-charge-to-5g", "http://thomsonreuters.com/en/about-us/trust-principles.html", "https://www.reuters.tv/v/wNs/2018/01/28/russian-police-detain-putin-critic-navalny-at-protest"], "published": "2018-01-29T21:22:00.000+02:00", "crawled": "2018-01-30T03:26:31.009+02:00", "highlightTitle": ""}