{"organizations": [], "uuid": "701f5d7bfe720a82ee4fd798b2178f2ad7b48433", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/business-wire-spirits-membership-club-flaviar-acquires-caskers-com.html", "country": "US", "domain_rank": 767, "title": "Spirits Membership Club Flaviar Acquires Caskers.com", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.048, "site_type": "news", "published": "2018-01-10T22:48:00.000+02:00", "replies_count": 0, "uuid": "701f5d7bfe720a82ee4fd798b2178f2ad7b48433"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/business-wire-spirits-membership-club-flaviar-acquires-caskers-com.html", "ord_in_thread": 0, "title": "Spirits Membership Club Flaviar Acquires Caskers.com", "locations": [], "entities": {"persons": [{"name": "flaviar", "sentiment": "negative"}, {"name": "caskers", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "spirits membership club flaviar acquires caskers.com new deal increases spirits membership club", "sentiment": "negative"}, {"name": "e.u.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "New Deal Increases Spirits Membership Club’s Global Reach\nNEW YORK--(BUSINESS WIRE)-- Flaviar, the leading members club for fine spirits enthusiasts, has announced the acquisition of Caskers.com for an undisclosed sum. The deal is Flaviar’s answer to a growing market demand for online spirit discovery and will support Flaviar’s continued E.U. and U.S. growth and accelerate entry into new markets.\nThe two brands will continue to operate in the market as independent brands and will be able to deliver increased efficiencies to the end consumer. The partnership, aimed to further improve the consumer experience, will allow Flaviar to double the size of its audience of spirits enthusiasts providing access to even more high quality spirits from around the world for U.S. based customers. The acquisition will also strengthen the company's position as a market leader. While both Flaviar and Caskers will continue to trade under their respective names, the co-branding will align with Flaviar to highlight and emphasize complementary and supporting services across the two businesses.\n\"Both businesses have grown rapidly this year, Flaviar more than 100% and Caskers more than 30%, and our aim is to continue to accelerate that growth even further as we establish a leading role in online spirits,\" said Jugoslav Petkovic, co-founder and CEO of Flaviar. \"Synergies in technology and fulfillment will benefit both our customers, as well as our partners.\"\n\"Caskers' customers stand to benefit a great deal from this new relationship with Flaviar,\" said Steve Abt, co-founder and CEO of Caskers. \"The online spirits market is growing and I'm confident that with Flaviar's help Caskers will be able to better respond to customers' needs and accelerate growth.\"\nThe timing of the announcement also coincides with the additional growth news as Flaviar recently launched its first private label whisky: Son of a Peat, which was met with acclaim from Flaviar members with a sold out first batch. The private label offerings continue to showcase the company’s commitment to expanding in the marketplace and increasing its exclusive offerings for Flaviar members.\nAbout Flaviar\nFlaviar was born out of frustration about how inaccessible the world of fine spirits is today. Not only is it impractical and prohibitively expensive for consumers to explore fine spirits through full size bottles, brands also struggle to affordably reach larger audiences. This inspired a spirits aficionado and craft distiller to launch a service in 2012 which would enable large-scale discovery driven by side-by-side sample tasting. Today Flaviar is a community & Membership Club with the mission to help each and every person build their dream home bar. Flaviar Members can experience five main benefits: digital Home Bar, receive themed Tasting Boxes, access to an exclusive selection of extremely rare and hard-to-find spirits from The Vault, access to exclusive bottlings including private label brands created exclusively for the members, and tickets to live events granting access to distillers, bars and various brands. The community is designed to help members navigate a vast landscape of distilled flavors and terroirs to find their spirit in the spirit world. Visit their website at www.flaviar.com .\nAbout Caskers\nCaskers allows consumers to discover unique and extraordinary craft spirits from around the world for delivery to their door. Members can choose from the curated selection updated daily or click autopilot by joining one of the clubs that delivers three full-size bottles every three months. Co-founders Steven Abt and Moiz Ali met at Harvard Law School, where they quickly bonded over a shared passion for well-made spirits and cocktails. The site launched in June 2012, developed to help people discover craft spirits and take pride in what they drink.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180110006150/en/\nMedia:\nExposure\nVicki Loo, 646-895-7015\nvicki.loo@exposure.net\nSource: Flaviar", "external_links": ["http://www.businesswire.com/news/home/20180110006150/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.flaviar.com%2F&esheet=51741501&newsitemid=20180110006150&lan=en-US&anchor=www.flaviar.com&index=1&md5=75d03d3fd03d3601c3f7e2029b5474cb"], "published": "2018-01-10T22:48:00.000+02:00", "crawled": "2018-01-10T23:23:20.027+02:00", "highlightTitle": ""}