{"organizations": [], "uuid": "01e3530d536cdbc21aed945a1175ae1b617d2e32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180128.html", "section_title": "Archive News &amp; Video for Sunday, 28 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/basketball-ncaa-umd-msu-recap/no-6-michigan-state-comes-back-to-best-maryland-idUSMTZEE1SA95P8C", "country": "US", "domain_rank": 408, "title": "No. 6 Michigan State comes back to best Maryland", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.089, "site_type": "news", "published": "2018-01-29T04:47:00.000+02:00", "replies_count": 0, "uuid": "01e3530d536cdbc21aed945a1175ae1b617d2e32"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/basketball-ncaa-umd-msu-recap/no-6-michigan-state-comes-back-to-best-maryland-idUSMTZEE1SA95P8C", "ord_in_thread": 0, "title": "No. 6 Michigan State comes back to best Maryland", "locations": [], "entities": {"persons": [{"name": "josh langford", "sentiment": "none"}, {"name": "lou anna simon", "sentiment": "none"}, {"name": "tom izzo", "sentiment": "none"}, {"name": "mark hollis", "sentiment": "none"}], "locations": [{"name": "michigan state", "sentiment": "none"}, {"name": "maryland", "sentiment": "none"}, {"name": "michigan", "sentiment": "none"}], "organizations": [{"name": "michigan state", "sentiment": "negative"}, {"name": "cbs", "sentiment": "none"}, {"name": "spartans", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sixth-ranked Michigan State surged in the second half to post a 74-68 Big Ten win at Maryland on Sunday afternoon.\nJosh Langford led the Spartans (20-3, 8-2 Big Ten) with 19 points, and Michigan State rolled to a fourth straight win thanks to a second half that saw the Spartans turn it on and outscore Maryland 50-31 in the final 20 minutes.\nThe win was a brief respite from the turmoil swirling about the Michigan State program, rocked by charges of failure to properly deal with sexual assault, violence and discrimination complaints. University president Lou Anna Simon and athletic director Mark Hollis have already resigned this week.\n”I’ve got a lot of pride in those guys, and I think they were playing for a lot of people today,“ Michigan State coach Tom Izzo said in his on-court interview with CBS. ”My heart still goes over to the survivors, and I think we showed that we’re going to try to be part of the healing process.\n“I‘m going to try to figure out how to celebrate this win and still pray for the people who have gone through a lot more than I went through. ... This was a big win for us, but it’s going to be a grind. We’ve got a lot of things to cover, a lot of things to go over. I just hope that everyone rallies behind this team a little bit, and rallies behind the survivors to make our community a better place.”\nThe Terrapins (15-8, 4-6) lost for just the second time at home this season but had led by 13 in the first half. Kevin Huerter had 17 to lead Maryland, which shot just 34.6 percent (9-of-26) in the second half and got outrebounded 46-29 by Michigan State on the afternoon. The Terrapins have lost four of their last five games, and their NCAA postseason hopes are fading.\nNick Ward’s short shot put Michigan State ahead for good, 50-48, at 10:52. The Spartans had run off 20 of the first 24 points in the second half, hitting 8 of 9 shots as they took their first lead at 14:45 on a tip-in by Gavin Schilling to make it 42-41. The Michigan State blitz was similar to a surge that buried Maryland a couple of weeks ago in East Lansing, the Terrapins playing well early before bowing 91-61.\nA 10-2 Maryland run had allowed the Terrapins to lead 28-18 with 4:43 left in the first half when Michal Cekovsky scored inside, and Maryland would take a 37-24 lead to the locker room as Jared Nickens hit a 3-pointer at seven seconds. Maryland hit 5 of 8 from 3-point range in the first half.\nThe Terrapins shot out to an 8-0 lead before an exuberant, sell-out crowd of 17,950 at Xfinity Center. Dion Wiley, making his first start in six games, hit two 3-pointers in the early run. When Huerter joined in with a 3-pointer at 15:35, Maryland led 11-3. The Spartans missed eight of their first nine shots before asserting themselves inside against the shorter Terrapins.\nThe 6-foot-11 Jaren Jackson, often guarded by 6-foot-4 Darryl Morsell, got free for a couple of dunks and hit two free throws. By the 10:10 mark, Michigan State was within 18-16 when Miles Bridges hit a baseline 3-pointer.\n--Field Level Media\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-29T04:47:00.000+02:00", "crawled": "2018-01-29T21:56:10.011+02:00", "highlightTitle": ""}