{"organizations": [], "uuid": "8fc733f3bf10e04b7d5f5afab8656b37d49bd263", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/18/the-associated-press-is-it-news-ansari-story-triggers-media-ethics-debate.html", "country": "US", "domain_rank": 767, "title": "Is it news? Ansari story triggers media ethics debate", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T23:58:00.000+02:00", "replies_count": 0, "uuid": "8fc733f3bf10e04b7d5f5afab8656b37d49bd263"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/18/the-associated-press-is-it-news-ansari-story-triggers-media-ethics-debate.html", "ord_in_thread": 0, "title": "Is it news? Ansari story triggers media ethics debate", "locations": [], "entities": {"persons": [{"name": "ansari", "sentiment": "positive"}, {"name": "aziz ansari", "sentiment": "none"}, {"name": "ed wasserman", "sentiment": "none"}, {"name": "brook", "sentiment": "none"}], "locations": [], "organizations": [{"name": "university of california, berkeley", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What makes a private sexual encounter newsworthy? A little-known website raised that very question after publishing an unidentified woman's vivid account of comedian Aziz Ansari's sexual advances while the two were on a date.\nThe story on Babe.net threw a wrench into the #MeToo movement, with some feminist writers dismissing the incident as a bad date that should have remained private. Others welcomed the piece for spurring a debate over deeper cultural attitudes that normalize aggressive behavior toward women.\nMedia ethics experts say it's not easy to determine what constitutes a legitimate story of sexual misconduct in the midst of a social movement that has emboldened people to speak out on subjects once considered taboo.\n\"What takes this out of the realm of a really bad date and into the realm of something that is publicly significant?\" asked Ed Wasserman, dean of the journalism school at the University of California, Berkeley. \"It's a little borderline.\"\nThe story, which appeared Saturday, offers a detailed 3,000-word account of a night out between Ansari and a 23-year-old Brooklyn photographer that ended at the comedian's home. The woman told the site that the actor repeatedly initiated sexual activity despite what she later called \"clear non-verbal cues\" indicating her discomfort and lack of interest. She also reportedly told Ansari that she didn't want to \"feel forced\" in the encounter.\nThe woman told Babe.net that she eventually decided the incident was a sexual assault and said she was angered when she saw Ansari wearing a \"Time's Up\" pin at the Golden Globe Awards. The pin referred to a movement against sexual misconduct in Hollywood.\nThe website published screenshots of what it said were text messages between the two the next day. The woman told Ansari the encounter had made her uncomfortable; he texted back with an apology. The story was initially published with no comment from Ansari because, the website said, his representatives did not get back to them by its deadline.\nMany major news organizations reacted cautiously. The Associated Press and other media outlets did not report on the story until Ansari issued a public statement addressing the claim the next day. The actor, who stars on the Netflix hit \"Master of None,\" acknowledged that he apologized to a woman last year when she told him about her discomfort during a sexual encounter in his apartment that he believed to be consensual.\nFeminist writers, other actors and media commentators were left to debate the public value of an anonymous tale about a confusing encounter at a time when more women are speaking publicly about sexual assault.\nSome prominent women, including Whoopi Goldberg and Ashleigh Banfield, a host on the CNN spinoff HLN, concluded that the story didn't describe sexual misconduct of any kind and lacked newsworthiness. The feminist writer Jill Filipovic, in a column for The Guardian , said the piece touched on the need for more stories about \"how pervasive power imbalances benefit men and make sex worse for women.\" But she said Babe.net squandered that opportunity by failing to \"tell this particular story with the care it called for\" and muddying the line between sexual assault and misogynistic behavior. \nThe story's reporter and editors at Babe.net , which is less than two years old and says it has 3 million readers, have publicly defended their news judgment. \"We stand by our story,\" said site editor Amanda Ross. Babe.net is published by Tab Media, a company that has received funding from Rupert Murdoch.\nHelen Benedict, a Columbia journalism professor, said the story's one-sided, anonymous account was difficult to judge. But that, she said, encapsulates the tension between the public's need to know and the obligation of the media to protect sources, particularly people who say they are victims of sexual assault and request anonymity.\nBenedict said the story didn't sufficiently press the woman on her motivations and took a flippant approach as to whether the incident constituted sexual assault. \"I don't feel that the reporters asked enough about what the goal was,\" she said. \"What does she want?\"\nRyan Thomas, an assistant professor at the Missouri School of Journalism, said the piece lacked the rigor of other stories that used multiple sources to establish a clear pattern of abuse by prominent men like Harvey Weinstein and Louis C.K.\n\"Most of the journalism has been very methodical in identifying a catalog of incidents to build a picture of a pattern of behavior,\" Thomas said. By contrast, he said, the Babe.net story \"focuses on a single case against a named individual by an anonymous individual,\" thus raising questions about its newsworthiness and the care with which it was reported.\nFew have called into question the veracity of the report, particularly because Ansari himself did not dispute it.\nWasserman, the Berkeley professor, said he finds it difficult to criticize the piece for crossing any lines of journalistic integrity. After wrestling with the question of whether the article addressed an issue of legitimate public concern, he said, he \"reluctantly\" sided with Babe.net .", "external_links": [], "published": "2018-01-18T23:58:00.000+02:00", "crawled": "2018-01-20T19:03:28.008+02:00", "highlightTitle": ""}