{"organizations": [], "uuid": "8766c41757ae04fae94a7b747ccd20cf46728395", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/business-wire-lict-corporation-reports-preliminary-fourth-quarter-2017-results.html", "country": "US", "domain_rank": 767, "title": "LICT Corporation Reports Preliminary Fourth Quarter 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T20:23:00.000+02:00", "replies_count": 0, "uuid": "8766c41757ae04fae94a7b747ccd20cf46728395"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/business-wire-lict-corporation-reports-preliminary-fourth-quarter-2017-results.html", "ord_in_thread": 0, "title": "LICT Corporation Reports Preliminary Fourth Quarter 2017 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.y.", "sentiment": "none"}], "organizations": [{"name": "ebitda", "sentiment": "negative"}, {"name": "lict corporation reports preliminary fourth", "sentiment": "negative"}, {"name": "lict corporation", "sentiment": "none"}, {"name": "alternative connect america cost model", "sentiment": "none"}, {"name": "clec", "sentiment": "none"}, {"name": "lict", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Revenues climbed almost 15% to $27 million from $24 million EBITDA grew 28% to $12.9 million from $10.0 million EPS surged to $179 per share from $103 per share from operations before deferred tax benefit\nRYE, N.Y.--(BUSINESS WIRE)-- LICT Corporation (“LICT” or the “Company”; OTC Pink ® : LICT) reports preliminary unaudited results for the fourth quarter ended December 31, 2017.\nFOURTH QUARTER RESULTS – In 2017, LICT’s fourth quarter revenues increased by $3.5 million, or 14.6%, to $27.3 million compared to $23.8 million for the corresponding quarter in 2016. Non-regulated revenues gained 9.5%, to $12.0 million from the prior year’s $11.0 million due to increased broadband and competitive local exchange carrier (“CLEC”) revenues. Regulated revenues, bolstered by the federal Alternative Connect America Cost Model (“A-CAM”) revenues, jumped 18.9%, to $15.2 million in the fourth quarter of 2017 from the prior year’s $12.8 million.\nEBITDA before corporate costs was approximately $12.9 million as compared to roughly $10.0 million in the previous year’s fourth quarter, a 28.1% increase. Non-regulated EBITDA, including affiliate distributions, decreased slightly to $5.1 million, from $5.2 million, while regulated EBITDA increased to $7.7 million, from $4.9 million.\nFULL YEAR RESULTS – For the year ended December 31, 2017, the Company recorded revenues of $106.5 million, as compared to $90.7 million in 2016, and EBITDA before corporate costs of $49.1 million, as compared to $36.7 million in 2016. The Company is currently expecting that revenues for 2018 will approximate $109 million and EBITDA before corporate costs will match the $49 million of 2017. Of note, the Company is expecting that the lower Federal income tax rate, which was part of the Tax Cuts and Jobs Act that was passed by Congress in December 2017, will reduce 2018 income tax expense by approximately $3 million, or about $150 per share. Also of note, for LICT operations that earn a rate of return on investment, regulated revenues are affected by the lower federal tax rates as their rate of return is adjusted by federal and state income taxes. Therefore, a lower tax rate results in a lower rate of return. This effect will impact the Company’s 2018 revenues by approximately $0.4 million and has been incorporated in the above 2018 revenue projection.\nEARNINGS PER SHARE – Diluted earnings per share during the fourth quarter were $468 per share in 2017 as compared to $103 per share in 2016. 2017’s earnings per share includes a $6 million estimated reduction of the Company’s deferred tax liabilities, or $290 per share. Accordingly, excluding this deferred tax reduction, diluted earnings during the fourth quarter were $179 in 2017 as compared to $103 in the corresponding quarter of 2016. Shares outstanding at December 31, 2017, were 20,509 versus 21,282 at December 31, 2016.\nPlease note, the reduction in net deferred tax liabilities is based on reasonable estimates made by the Company. The estimate may be subject to further revision or adjustments as additional guidance from the U.S. Department of the Treasury is provided, the Company completes its year end closing process, the Company’s independent auditors complete the audit of the Company’s 2017 financial results, and as further information and interpretations become available.\nCAPITAL EXPENDITURES – In 2017, capital expenditures were $22.3 million, of which $9.8 million was for non-regulated activities and $12.5 million for regulated activities. In order to expand the Company’s non-regulated fiber initiatives and provide a high level of broadband to our customers in the rural areas of the United States, we are expecting capital expenditures of $21 million in 2018. This capital, bolstered by A-CAM support, enables us to offer enhanced broadband speeds and will increase the overall fiber route miles in our network. As of December 31, 2017, LICT operations deployed 4,424 miles of fiber optic cable, 11,438 miles of copper cable, and 681 miles of coaxial cable.\nLIQUIDITY EVENT FROM INVESTMENT IN SPECTRUM ACQUISITION COMPANY - On May 9, 2017 and September 19, 2017, LICT noted a liquidity event with regard to an investment in PTPMS Communications, LLC (“PTPMS”). By way of background, a subsidiary of LICT has a 49% limited liability company interest in PTPMS, which acquired 22 spectrum licenses at auction from the Federal Communications Commission (“FCC”). In 2012, PTPMS sold all its licenses to the predecessor-in-interest of a subsidiary of Straight Path Communications, Inc. (“Straight Path”). In that transaction, PTPMS received an interest of 20% in the net proceeds. In May 2017, Straight Path announced that it had entered into a transaction to sell itself for gross proceeds of $3.1 billion. In public filings with the SEC relating to this transaction, Straight Path expressly recognized that PTPMS continues to hold a financial interest in PTPMS’ former licenses. The Straight Path transaction has now received FCC approval and closing is expected in late February 2018.\nBALANCE SHEET – Our net debt was $23.9 million at December 31, 2017, as compared to $22.6 million on December 31, 2016. Of note, during, LICT purchased $8.9 million of its shares.\nREFINANCING THE COMPANY – The Board of Directors and management have implemented measures which have improved liquidity and reduced the Company’s debt position. At this time, the Board continues to re-evaluate its refinancing alternatives.\nSHARE REPURCHASES – During the twelve months ended December 31, 2017, the Company repurchased 808 shares for $8.9 million, of which 295 shares for $3.5 million were purchased in the fourth quarter of 2017. As of December 31, 2017, 20,509 shares were outstanding.\nOPERATING STATISTICS – As of December 31, 2017, the Company’s DSL penetration in its franchised telephone service territories, based on its total Incumbent Local Exchange Carrier (“ILEC”) voice lines, was 80.9%, compared to 78.5% as of December 31, 2016. Our summary operating statistics are as follows:\nDec. 31, Percent Dec. 31, Increase Increase 2017 2016 (Decrease) (Decrease) Broadband lines\n31,507 30,193 1,314 4.4% Voice Lines ILEC 25,485 26,680 (1,195) (4.5%) CLEC 7,006 6,243 763 12.2% Total 32,491 32,923 (432) (1.3%) Video Subscribers 5,985 6,219 (234) (3.8%) Revenue Generating Units 69,983 69,335 648 0.9% This release contains certain forward-looking information within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, including without limitation anticipated financial results, financing, capital expenditures and corporate transactions. It should be recognized that such information is based upon certain assumptions, projections and forecasts, including without limitation, business conditions and financial markets, regulatory and other approvals, and the cautionary statements set forth in documents filed by LICT on its website, www.lictcorp.com . As a result, there can be no assurance that any possible transactions will be accomplished or be successful, or that financial targets will be met. Such forward-looking information is subject to uncertainties, risks and inaccuracies, which could be material.\nLICT Corporation is a holding company with subsidiaries in broadband and other telecommunications services that actively seeks acquisitions, principally in its existing business areas.\nLICT Corporation is listed on the OTC Pink ® under the symbol LICT. For further information visit our website at http://www.lictcorp.com .\nRelease: 18-2\nLICT CORPORATION\nExhibit A Statements of Operations and Selected Balance Sheet Data\nPage 1 of 2\n(In Thousands, Except Per Share Data) STATEMENTS OF OPERATIONS Three Months Ended Twelve Months Ended December 31, December 31, 2017 2016 2017 2016 Revenues $27,267 $23,792 $106,531 $90,740 Cost and Expenses: Cost of revenue, excluding depreciation 12,353 11,563 48,034 44,783 Selling, general and administration 2,676 2,848 11,410 11,167 Corporate Office Expenses 1,038 1,066 3,965 3,833 Depreciation and amortization 4,687 4,819 17,888 17,9872 Total Costs and Expenses 20,754 20,296 81,297 77,755 Operating profit 6,513 3,496 25,234 12,985 Other Income (Expense) Investment income 49 46 423 480 Interest expense (477) (597) (2,123) (2,542) Equity in earnings of affiliated companies 527 667 2,277 2,075 Other, includes shareholder designated contributions of\n$1,139 in 2017 and $991 in 2016\n(24) (108) (1,151) (1,091) 75 8 (574) (1,078) Income Before Income Tax Provision 6,588 3,504 24,660 11,907 Benefit (Provision) For Income Taxes 3,107 (1,305) (4,026) (4,634) Net Income $9,695 $2,199 $20,634 $7,273 Capital Expenditures $8,038 $4,276 $22,273 $16,434 Weighted Average Shares: Basic 20,663.64 21,212.33 20,982.25 21,384.48 Diluted 20,695.58 21,335.33 21,046.30 21,497.64 Actual shares outstanding at end of period 20,509.37 21,282.37 20,509.37 21,282.37 Earnings Per Share: Basic\nNet Income $469.18 $103.67 $983.40 $340.11 Deduct: Reduction of deferred tax liabilities due to Federal\nincome tax rate\n(290.36) -- (285.96) Add: Net After-Tax effect of charitable contributions -- -- 36.36 32.82 Adjusted Net Income $178.82 $103.67 $733.80 $372.93 Dilutive Earnings Per Share\nNet Income $468.46 $103.07 $980.41 $338.32 Reduction of deferred tax liabilities due to FIT rate (289.92) (285.08) -- Net After-Tax effect of charitable contributions -- -- 36.25 32.65 Adjusted Net Income $178.54 $103.07 $731.58 $370.97 See EBITDA on page 2 LICT Corporation\nStatements of Operations and Selected Balance Sheet Data-Continued\nPreliminary and Un-Audited\n(in thousands, Except Per Share Data)\nExhibit A\nPage 2 of 2\nSELECTED BALANCE SHEET DATA\nDec. 31, Dec. 31, 2017 2016 Cash and Cash Equivalents $7,055 $8,470 Auction 1002 Deposit -- 11,000 Note receivables and other deposits 3,250 3,250 Long-Term Debt (including current portion) 31,001 42,084 Liabilities, including taxes, other than debt\n$34,358 $34,283 Shareholders' Equity $114,584 $108,476 Shares Outstanding at Date 20,509.37 21,282.37 EBITDA EBITDA is an established measure of operating performance and liquidity that is commonly reported and widely used by analysts, investors, and other interested parties in the telecommunications industry because it eliminates many differences in financial, capitalization, and tax structures, as well as non-cash and non-operating charges to earnings. We believe that EBITDA trends are a valuable indicator of whether our operations are able to produce sufficient operating cash flow to fund working capital needs, service debt obligations, and fund capital expenditures. EBITDA equals net income (loss), before interest expense, income tax expense (benefit), depreciation and amortization expense, investment income, equity in earnings of affiliated companies, gain (loss) on sale of investment, impairment charges, and net income from discontinued operations. EBITDA also now includes the cash distributions we receive from the equity in earnings of affiliated companies. Although we do not have majority voting control of such companies, we have the ability to significantly influence financial and accounting policies. The inclusion of cash received from equity companies is a change from past practice. Three Months Ended Twelve Months Ended December 31, December 31, 2017 2016 2017 2016 EBITDA Operating Subsidiaries $12,238 $9,381 $47,087 $34,740 Cash received from equity affiliates 613 650 1,988 1,950 12,851 10,031 49,075 36,740 Corporate Office Expense (1,038) (1,066) (3,965) (3,833) Total EBITDA 11,813 8,965 45,100 32,907 Depreciation and amortization (4,687) (4,819) (17,888) (17,972) Less Cash received from equity affiliates, above (625) (650) (2,000) (1,950) Operating profit $6,513 $3,496 $25,234 $12,985\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180125005995/en/\nLICT Corporation\nRobert E. Dolan\nExecutive Vice President and Chief Financial Officer\n914-921-8821\nSource: LICT Corporation", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.lictcorp.com&esheet=51748976&newsitemid=20180125005995&lan=en-US&anchor=www.lictcorp.com&index=1&md5=7c37d9f9be55f8373d4bc29a973c14f3", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.lictcorp.com&esheet=51748976&newsitemid=20180125005995&lan=en-US&anchor=http%3A%2F%2Fwww.lictcorp.com&index=2&md5=b425f6ff95856ced25a9fd57be38622a", "http://www.businesswire.com/news/home/20180125005995/en/"], "published": "2018-01-25T20:23:00.000+02:00", "crawled": "2018-01-25T20:36:23.003+02:00", "highlightTitle": ""}