{"organizations": [], "uuid": "152f4b561ccdb02eea98c7b65c4184afdc406954", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-rising-medical-solutions-appoints-new-c-suite-executives-to-impact-customer-experience.html", "country": "US", "domain_rank": 767, "title": "Rising Medical Solutions Appoints New C-Suite Executives to Impact Customer Experience", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T14:00:00.000+02:00", "replies_count": 0, "uuid": "152f4b561ccdb02eea98c7b65c4184afdc406954"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-rising-medical-solutions-appoints-new-c-suite-executives-to-impact-customer-experience.html", "ord_in_thread": 0, "title": "Rising Medical Solutions Appoints New C-Suite Executives to Impact Customer Experience", "locations": [], "entities": {"persons": [{"name": "huth", "sentiment": "none"}, {"name": "jason beans", "sentiment": "none"}, {"name": "timothy howlin", "sentiment": "none"}, {"name": "david", "sentiment": "none"}, {"name": "david huth", "sentiment": "none"}], "locations": [], "organizations": [{"name": "rising medical solutions", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 30, 2018 /PRNewswire/ -- Two members of Rising Medical Solutions' executive leadership team have assumed new, elevated positions as the company enhances its customer experience practice. Vice President of Product Design and Development, David Huth, has been promoted to Chief Operating Officer (COO) and Senior Vice President of Sales and Marketing, Timothy Howlin, has transitioned to a newly created Chief Sales Officer (CSO) role. These appointments come three months into Huth's tenure with the organization and within a year of Howlin joining the company.\nOriginally tapped to drive product innovation at Rising, Huth's extensive industry, managed care, and consulting experience will be applied more broadly across the organization. He will now oversee the full lifecycle of product development through customer delivery for all of Rising's medical cost containment and medical care management offerings. Says Rising CEO Jason Beans, \"When David joined us last year, he quickly gained the trust of our team and it became clear he could impact the organization and create customer value in a much greater capacity.\"\nHowlin's C-suite appointment includes the addition of account management to his existing sales and marketing departmental oversight. Taking a cross-functional team approach, Howlin will lead all customer acquisition and retention activities, unify the customer champion function within the organization, and create a more integrated customer experience. \"Rising has always been a customer-centric organization,\" said Beans. \"Working together, Tim and Dave are strengthening a single vision across all methods of customer contact and service delivery to enhance the total relationship with Rising customers.\"\nPrior to joining Rising, both Huth and Howlin held leadership roles in the industry as Vice President of Strategy and Senior Vice President of National Sales respectively.\nAbout Rising Medical Solutions\nRising Medical Solutions ( www.risingms.com ) is a national medical-financial solutions firm that provides medical cost containment and medical care management services to the workers' compensation, auto, liability, and group health markets. Rising also directs and publishes the annual Workers' Compensation Benchmarking Study, a national research program examining the complex forces impacting claims management in workers' compensation today.\nCONTACT:\nRachel Fikes\nrachel.fikes@risingms.com\n312-224-5893\nView original content with multimedia: http://www.prnewswire.com/news-releases/rising-medical-solutions-appoints-new-c-suite-executives-to-impact-customer-experience-300589812.html\nSOURCE Rising Medical Solutions", "external_links": ["http://www.risingms.com/", "http://www.prnewswire.com/news-releases/rising-medical-solutions-appoints-new-c-suite-executives-to-impact-customer-experience-300589812.html"], "published": "2018-01-30T14:00:00.000+02:00", "crawled": "2018-01-30T15:33:46.005+02:00", "highlightTitle": ""}