{"organizations": [], "uuid": "6c891054f89d5ad1d3d4c4f828b4e50a20bdaa7a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-niit-acquires-eagle-productivity-solutions.html", "country": "US", "domain_rank": 767, "title": "NIIT Acquires Eagle Productivity Solutions", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T23:08:00.000+02:00", "replies_count": 0, "uuid": "6c891054f89d5ad1d3d4c4f828b4e50a20bdaa7a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-niit-acquires-eagle-productivity-solutions.html", "ord_in_thread": 0, "title": "NIIT Acquires Eagle Productivity Solutions", "locations": [], "entities": {"persons": [], "locations": [{"name": "atlanta", "sentiment": "none"}, {"name": "rochester usa", "sentiment": "none"}], "organizations": [{"name": "niit limited", "sentiment": "negative"}, {"name": "niit acquires eagle productivity solutions", "sentiment": "negative"}, {"name": "usa) inc", "sentiment": "none"}, {"name": "niit", "sentiment": "none"}, {"name": "eagle productivity solutions", "sentiment": "none"}, {"name": "eagle", "sentiment": "none"}, {"name": "eagle international institute, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA, Jan. 3, 2018 /PRNewswire/ -- NIIT Limited (\"NIIT\"), a global skills and talent development company and leading provider of managed training services, announced today that it has acquired Eagle International Institute, Inc. doing business as Eagle Productivity Solutions (\"Eagle\") through its wholly owned subsidiary, NIIT (USA) Inc. Headquartered in Rochester USA, Eagle is a top-rated global provider that specializes in training solutions for companies adopting sophisticated cloud-based applications in the Pharmaceutical and Life sciences industry.\nThe blending of these two companies will further help NIIT expand its capabilities in global application rollouts of enterprise applications requiring high adoption and deepen its domain expertise in the pharmaceutical and life sciences domain. In turn, Eagle's clients will gain access to more evolved service models, expanded capabilities including a richer variety in training content, and a stable and established global structure.\nUnder the NIIT umbrella, Eagle will continue to exist as an individual practice and maintain its mission to deliver quality, innovation, and above all, results. Eagle also intends to honor all contracts and commitments to all existing customers with no interruption in service.\n\"This is a major event for Eagle. It allows us to expand,\" said Bob Cannan, majority shareholder and CEO of Eagle since 1994. \"We're being purchased as a practice with expertise intact. It's the ideal fit for Eagle. We see this as a major opportunity to support the explosive growth of cloud software - introduced with expertise, maintained with thoughtful attention. No single company will be more capable of this than this new combination. We can service this market extraordinarily well. We have some of the finest methods and a strong track record.\"\n\"The Life Sciences domain and Software Application Adoption expertise have been of keen interest to NIIT. Learning plays a key role as a key enabler of change in both these areas. Eagle's unique mastery learning pedagogy enables their customers to rapidly achieve greater than 90% adoption of new processes and applications. This is a distinguishing reason why Eagle has a loyal and strong list of customers in the Life Sciences space. The coming together of Eagle's expertise and penetration in the Life Sciences space creates great opportunity for NIIT in both the Life Sciences and the Software Application domains. I am deeply excited by what we can achieve together. I look forward to welcoming the Eagle Team and their customers to the NIIT family,\" said Sapnesh Lalla, CEO, NIIT Limited.\nAbout NIIT\nEstablished in 1981, NIIT Limited, a global leader in Skills and Talent Development, offers multi-disciplinary learning management and training delivery solutions to corporations, institutions, and individuals in over 40 countries. NIIT has three main lines of business across the globe- Corporate Learning Group, Skills and Careers Group, and School Learning Group.\nNIIT's Corporate Learning Group (CLG) offers Managed Training Services (MTS) to market-leading companies in North America, Europe, Asia, and Oceania. Our comprehensive suite of Managed Training Services includes custom Curriculum Design and Content Development, Learning Administration, Learning Delivery, Strategic Sourcing, Learning Technology, and Advisory Services. With a team of some of the world's finest learning professionals, NIIT is dedicated to helping customers increase the business value of learning and development (L&D). Built on the sound principles of 'Running Training like a Business', NIIT's Managed Training Services and best-in-class training processes enable customers to align business goals with L&D, reduce costs, realize measurable value, benefit from rock-solid operations, and increase business impact.\nVisit us at www.niit.com or write to us at businessimpact@niit.com . Follow us on twitter @NIITMTS .\nFor more information, visit www.niit.com\nAbout Eagle Productivity Solutions\nFounded in 1988, Eagle International (dba Eagle Productivity Solutions) specializes in providing training solutions for companies launching sophisticated cloud-based applications across commercial and medical audiences. Eagle creates custom designs for diverse markets - delivering high-adoption results in over 40 countries, 20 languages. Eagle has offices in Rochester, New York and Malaga, Spain.\nEagle is a top-rated global provider specializing in custom training design, development and delivery. Since 1988, we've delivered measurable, high-adoption results to our customers across diverse market segments – government, finance, retail, life sciences – in 40 countries, 20 languages.\nView original content: http://www.prnewswire.com/news-releases/niit-acquires-eagle-productivity-solutions-300577140.html\nSOURCE NIIT", "external_links": ["http://www.niit.com/#_blank", "http://www.niit.com/", "http://www.prnewswire.com/news-releases/niit-acquires-eagle-productivity-solutions-300577140.html", "https://twitter.com/NIITMTS"], "published": "2018-01-03T23:08:00.000+02:00", "crawled": "2018-01-04T00:23:01.000+02:00", "highlightTitle": ""}