{"organizations": [], "uuid": "de7acb68606cba8a6ac9dcddea00381951683395", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/01/104874317-Trump_Delivers_Remarks_on_Tax_Reform.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/12/ey-on-us-tax-reform-donald-trump-trade-policies-on-nafta-korus-could-offset-benefits.html", "country": "US", "domain_rank": 767, "title": "EY on US tax reform: Donald Trump trade policies on NAFTA, KORUS could offset benefits", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.204, "site_type": "news", "published": "2018-01-12T07:42:00.000+02:00", "replies_count": 0, "uuid": "de7acb68606cba8a6ac9dcddea00381951683395"}, "author": "Yen Nee Lee", "url": "https://www.cnbc.com/2018/01/12/ey-on-us-tax-reform-donald-trump-trade-policies-on-nafta-korus-could-offset-benefits.html", "ord_in_thread": 0, "title": "EY on US tax reform: Donald Trump trade policies on NAFTA, KORUS could offset benefits", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "mark weinberger", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "korus", "sentiment": "negative"}, {"name": "nafta", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tax reforms may help the United States score more investments from both local and foreign companies, but those benefits could be offset by the Trump administration's protectionist trade policies, a major accounting firm said Friday.\nSince President Donald Trump took office, the U.S. has pulled out of the Trans-Pacific Partnership and is re-negotiating the North American Free Trade Agreement and the Korea-United States Free Trade Agreement .\n\"(What) everyone has to keep an eye on is the trade issue. A lot of it is also dependent on NAFTA and KORUS and all these trade deals keeping the supply chain to be able to invest that way, and that's a big issue for 2018,\" Mark Weinberger, global chairman and CEO of EY, told CNBC.\nPulling out of those trade deals or setting more stringent requirements for the entry of foreign goods and services could reduce the incentive for companies to invest in the U.S. — which is the opposite of the intended impact of tax reform.\nThe restructuring of the U.S. tax code — the largest in 30 years — reduces the corporate tax rate to 21 percent from 35 percent. Companies including Fiat Chrysler and Foxconn have announced billion-dollar investments in the U.S. to take advantage of lower taxes.\nShawn Thew-Pool | Getty Images President Donald Trump delivers remarks on tax cuts to the National Association of Manufacturers at the Mandarin Oriental Hotel. Still, the tax reforms have not made the U.S. a tax haven, which is why the benefits also hinge on how open the world's largest economy remains, Weinberger said.\n\"This isn't a huge tax haven now, the United States, it just brings it in line with the rest of the world so what it's really going to do is take away that incentive to move your business offshore, to keep your money offshore,\" he said.\n\"If you're going to invest that next dollar, if you're going to enter into an M&A transaction, now it's cheaper to invest in the United States because the corporate rate is down, you will think more about making that incremental investment in the United States as opposed to somewhere else,\" he added.", "external_links": [], "published": "2018-01-12T07:42:00.000+02:00", "crawled": "2018-01-12T07:44:04.016+02:00", "highlightTitle": ""}