{"organizations": [], "uuid": "33ee202aeefcb52ee843e90d756536753666a1bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220431753&w=1200&r=LYNXMPEE08071", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-thailand-politics-yingluck/thai-foreign-minister-says-fugitive-former-pm-yingluck-in-london-idUKKBN1EY0B9", "country": "US", "domain_rank": 408, "title": "Thai foreign minister says fugitive former PM Yingluck in London", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T05:54:00.000+02:00", "replies_count": 0, "uuid": "33ee202aeefcb52ee843e90d756536753666a1bb"}, "author": "", "url": "https://uk.reuters.com/article/uk-thailand-politics-yingluck/thai-foreign-minister-says-fugitive-former-pm-yingluck-in-london-idUKKBN1EY0B9", "ord_in_thread": 0, "title": "Thai foreign minister says fugitive former PM Yingluck in London", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 3:55 AM / Updated 2 hours ago Thai foreign minister says fugitive former PM Yingluck in London Reuters Staff 3 Min Read \nBANGKOK (Reuters) - Thailand’s former Prime Minister Yingluck Shinawatra, who fled the country to avoid being jailed over a rice subsidy scheme that lost billions of dollars, is in Britain, Thailand’s foreign minister said on Tuesday. FILE PHOTO: Ousted former Thai Prime Minister Yingluck Shinawatra arrives at the criminal court in Bangkok, Thailand, September 29, 2015. REUTERS/Chaiwat Subprasom/File Picture \nHis comments come after two photographs purporting to be of Yingluck were widely shared on social media. \nOne shows Yingluck posing with a woman wearing a red coat accompanied by a caption saying that the picture was taken outside London’s Harrods department store. The other is allegedly of Yingluck at London’s Westfield shopping mall. \nThai police said they have verified the photograph of Yingluck with a woman in a red coat and have confirmed Yingluck’s identity. They have yet to confirm the identity of the woman in the photograph allegedly taken at Westfield. \nReuters has not independently verified either photo. \nYingluck was sentenced in September in absentia to five years in prison for mismanaging the rice scheme. \nShe has not commented publicly since fleeing Thailand in August ahead of a verdict in a criminal negligence case against her and her location has been the source of intense speculation. \nYingluck and her brother, ousted former Prime Minister Thaksin Shinawatra, have been at the centre of a power struggle that has dominated Thai politics for more than a decade. The crisis broadly pits the country’s traditional elite, including the military, against the Shinawatra family and its supporters. \nThailand’s Foreign Minister Don Pramudwinai told reporters in Bangkok on Tuesday that Yingluck was in London and that Thai authorities were in touch with their British counterparts to try to locate her. \n“We knew about this since September. Britain’s foreign minister told us Yingluck was in London, England,” Don told reporters. “We have communicated consistently but we haven’t found her.” \nHe declined to comment specifically on whether Thailand would seek Yingluck’s extradition. Thailand and the United Kingdom have an extradition treaty. \nThe British Embassy in Bangkok did not immediately respond to a Reuters request for comment on Yingluck’s whereabouts. Reporting by Pracha Hariraksapitak; Additional reporting by Amy Sawitta Lefevre and Panarat Thepgumpanat; Writing by Amy Sawitta Lefevre; Editing by Michael Perry", "external_links": [], "published": "2018-01-09T05:54:00.000+02:00", "crawled": "2018-01-09T09:42:35.314+02:00", "highlightTitle": ""}