{"organizations": [], "uuid": "14502d5af96a4d3c7c6eca41583bad08d4ee060e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224441399&w=1200&r=LYNXMPEE0M0OW", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-usa-israel-pence/timetable-for-unveiling-u-s-peace-plan-depends-on-palestinians-pence-idUSKBN1FC1A9", "country": "US", "domain_rank": 408, "title": "Timetable for unveiling U.S. peace plan depends on Palestinians: Pence", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T13:10:00.000+02:00", "replies_count": 0, "uuid": "14502d5af96a4d3c7c6eca41583bad08d4ee060e"}, "author": "", "url": "https://www.reuters.com/article/us-usa-israel-pence/timetable-for-unveiling-u-s-peace-plan-depends-on-palestinians-pence-idUSKBN1FC1A9", "ord_in_thread": 0, "title": "Timetable for unveiling U.S. peace plan depends on Palestinians: Pence", "locations": [], "entities": {"persons": [{"name": "jeffrey heller", "sentiment": "none"}, {"name": "jeff mason", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "pence", "sentiment": "none"}, {"name": "maayan lubell", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "palest", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "jerusalem", "sentiment": "none"}], "organizations": [{"name": "pence reuters staff", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 11:11 AM / in 4 hours Timing of Trump peace plan depends on Palestinians: Pence Jeff Mason 5 Min Read \nJERUSALEM (Reuters) - U.S. Vice President Mike Pence said on Tuesday the timing of a long-awaited U.S. Middle East peace initiative depended on the return of Palestinians to negotiations. \nPresident Donald Trump’s advisers have been working on the outlines of a plan for some time. But Palestinians ruled out Washington as a peace broker after the U.S. president’s Dec. 6 recognition of Jerusalem as Israel’s capital. \n“The White House has been working with our partners in the region to see if we can develop a framework for peace,” Pence told Reuters in an interview in Jerusalem on the last leg of a three-day Middle East trip. “It all just depends now on when the Palestinians are going to come back to the table.” \nTrump’s Jerusalem move angered the Palestinians, sparked protests in the Middle East and raised concern among Western countries that it could further destabilize the region. Palestinians see East Jerusalem as capital of a future state. \nA White House official told reporters he hoped the plan would be announced in 2018. \n“It’ll come out both when it’s ready and when both sides are actually willing to engage on it,” said the White House official, speaking on condition of anonymity. \nThe official acknowledged that the United States and the Palestinian leadership had not had any direct diplomatic contact since Trump’s Jerusalem declaration. \nPence said in the interview that he and the president believed the decision, under which the United States also plans to move its embassy to Israel from Tel Aviv to Jerusalem, would improve peacemaking prospects. \nHanan Ashrawi, a senior official at the Palestine Liberation Organization (PLO), said the Trump administration had dealt a death blow to any prospect for peace. \n“The extremist positions of this U.S. administration and the biblical messianic message of Pence not only disqualified the U.S. as a peace broker but created conditions of volatility and instability in the region and beyond,” Ashrawi said in the West Bank city of Ramallah. \nPence discussed the Jerusalem issue during talks with Egypt’s President Abdel Fattah al-Sisi on Saturday and Jordan’s King Abdullah on Sunday. He said the two leaders had agreed to convey to the Palestinians that the United States was eager to resume peace talks. \n“We want them (the Palestinians) to know the door is open. We understand they’re unhappy with that decision but the president wanted me to convey our willingness and desire to be a part of the peace process going forward,” Pence said. U.S. Vice President Mike Pence touches the Western Wall, Judaism's holiest prayer site, in Jerusalem's Old City January 23, 2018. REUTERS/Ronen Zvulun \nAsked if the Egyptians and Jordanians had agreed to pressure the Palestinians to return to talks, Pence said: “I wouldn’t characterize it as that.” SUPPORTER OF NETANYAHU \nThe Palestinians want to establish an independent state in the Israeli-occupied West Bank and in the Gaza Strip with East Jerusalem as its capital. \nIsrael captured East Jerusalem in the 1967 Middle East war and annexed it in a move not recognized internationally. It says the entire city is its eternal and indivisible capital. Slideshow (5 Images) \nPence said the U.S. State Department would spell out details in the coming weeks about a plan to move the U.S. embassy to Jerusalem by the end of 2019. \nIsraeli media have speculated that a 2019 embassy move could help Israeli Prime Minister Benjamin Netanyahu win reelection in a vote scheduled for November of that year. \nPence said he admired Netanyahu’s leadership and appreciated his friendship. Asked if he hoped for the prime minister’s reelection, Pence said: “I‘m a strong supporter of Benjamin Netanyahu, but I don’t get a vote here.” \nPence toured Israel’s Yad Vashem Holocaust memorial with Netanyahu on Tuesday before visiting the Western Wall, one of Judaism’s holiest sites. He stood solemnly with his hand on the wall and left a note, as people who pray there traditionally do. \nThe vice president also pressed European leaders to heed Trump’s call to forge a follow-up agreement to the Iran nuclear deal established under President Barack Obama’s administration. \n“At the end of the day, this is going to be a moment where the European community has to decide whether they want to go forward with the United States or whether they want to stay in this deeply flawed deal with Iran,” he said. \nAsked if he thought the United States would succeed in getting that kind of agreement with its European allies, Pence said: “We’ll see.” \nTrump said earlier this month the United States would withdraw from the agreement unless its flaws were fixed. Reporting by Jeff Mason; Editing by Maayan Lubell and Ralph Boulton", "external_links": [], "published": "2018-01-23T13:10:00.000+02:00", "crawled": "2018-01-23T13:23:27.000+02:00", "highlightTitle": ""}