{"organizations": [], "uuid": "d45294f55d4595c83e9ceadf07fe6176a86763a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224802312&w=1200&r=LYNXMPEE0N169", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-saudi-corruption/saudi-still-holding-95-people-as-it-aims-to-wind-down-corruption-probe-idUKKBN1FD1O2", "country": "US", "domain_rank": 408, "title": "Saudi still holding 95 people as it aims to wind down corruption probe", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T14:43:00.000+02:00", "replies_count": 0, "uuid": "d45294f55d4595c83e9ceadf07fe6176a86763a7"}, "author": "", "url": "https://uk.reuters.com/article/uk-saudi-corruption/saudi-still-holding-95-people-as-it-aims-to-wind-down-corruption-probe-idUKKBN1FD1O2", "ord_in_thread": 0, "title": "Saudi still holding 95 people as it aims to wind down corruption probe", "locations": [], "entities": {"persons": [], "locations": [{"name": "ritz carlton", "sentiment": "none"}, {"name": "riyadh", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "al arabiya", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 12:46 PM / Updated 2 hours ago Saudi still holding 95 people as it aims to wind down corruption probe Reuters Staff 3 Min Read \nRIYADH (Reuters) - Saudi Arabian authorities are still holding 95 people in an anti-corruption campaign launched by the crown prince in November, according to the kingdom’s attorney general. \nIn an info graphic cited by Saudi-owned Al Arabiya on Wednesday, the attorney general said 90 detainees had been released after having their charges dropped while others had traded cash, real estate and other assets for their freedom. \n“Only a couple of days till cases of corruption-related settlements are closed in preparation for referring remaining defendants to the Public Prosecution,” the graphic said. \nSaudi security forces have rounded up members of the political and business elite, including princes and tycoons, holding them in Riyadh’s opulent Ritz Carlton hotel in what was billed as a war on rampant corruption. \nThe purge has caused concern about damage to the economy especially among foreign investors the kingdom is seeking to attract to develop its economy away from oil. But the government has insisted it is respecting due process and that the companies of detained businessmen will continue operating normally. FILE PHOTO: Saudi Arabia's Crown Prince Mohammed Bin Salman and Saudi Prince Miteb bin Abdullah take part in the Annual Horse Race ceremony, in Riyadh, Saudi Arabia, December 30, 2017. Picture taken December 30, 2017. Bandar Algaloud/Courtesy of Saudi Royal Court/Handout via REUTERS \nThe allegations, which could not be verified, include kickbacks, inflating government contracts, extortion and bribery. \nThe Ritz is expected to reopen for business next month, and official sources have told Reuters that the authorities were close to winding up a major part of the crackdown. Riyadh hopes to recover about $100 billion (£70.6 billion) of illicit funds and expects a small number to be prosecuted. \nIn late November, senior Saudi Prince Miteb bin Abdullah, once seen as a leading contender to the throne, was freed after reaching a settlement with authorities that involved paying more than $1 billion, according to a Saudi official. \nAnother top businessman who has been held at the Ritz-Carlton is billionaire Prince Alwaleed bin Talal, chairman and owner of global investment firm Kingdom Holding 4280.SE. A Saudi official told Reuters this week that he was negotiating a possible settlement but so far had not agreed on terms. \nThe attorney general’s statement said those who were released are free to move without restrictions. Reporting By Stephen Kalin, Editing by William Maclean", "external_links": [], "published": "2018-01-24T14:43:00.000+02:00", "crawled": "2018-01-24T15:14:08.007+02:00", "highlightTitle": ""}