{"organizations": [], "uuid": "2a4c506d79dc87dc52d97bd482ca84e8886389a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221235506&w=1200&r=LYNXMPEE0A1RC", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-usa-corpbonds-sec/blackrock-vanguard-tapping-more-into-electronic-bond-trading-idUSKBN1F02S7", "country": "US", "domain_rank": 408, "title": "BlackRock, Vanguard tapping more into electronic bond trading", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T22:24:00.000+02:00", "replies_count": 0, "uuid": "2a4c506d79dc87dc52d97bd482ca84e8886389a2"}, "author": "", "url": "https://www.reuters.com/article/us-usa-corpbonds-sec/blackrock-vanguard-tapping-more-into-electronic-bond-trading-idUSKBN1F02S7", "ord_in_thread": 0, "title": "BlackRock, Vanguard tapping more into electronic bond trading", "locations": [], "entities": {"persons": [{"name": "jim switzer", "sentiment": "none"}, {"name": "john mccrank", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "blackrock", "sentiment": "negative"}, {"name": "vanguard", "sentiment": "negative"}, {"name": "vanguard group inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "blackrock inc", "sentiment": "none"}, {"name": "u.s. securities and exchange commission’s fixed income market structure advisory committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 8:32 PM / Updated 12 minutes ago BlackRock, Vanguard tapping more into electronic bond trading John McCrank 3 Min Read \nNEW YORK (Reuters) - Electronic trading is becoming increasingly important when it comes to corporate debt as fund management firms try to knit together sources of liquidity in a fragmented market, executives from Vanguard Group Inc and BlackRock Inc said on Thursday. \n“Our goal by the end of the year is that every trade we do is going to be done electronically,” Jim Switzer, global head of credit trading at Vanguard, said at the inaugural meeting of the U.S. Securities and Exchange Commission’s Fixed Income Market Structure Advisory Committee. \nThat does not mean traders will not pick up the phone to make a trade anymore, but it does mean that all of those trades will be processed electronically, he said. \nPutting the information together electronically gives Vanguard, a $5 trillion mutual fund manager, a much better picture of the liquidity available in the market, making it easier to get the next trade done quickly, he said. \nBlackRock also aims to capture all of its bond trades electronically, said Richie Prager, head of trading, liquidity and investments platform at the world’s largest fund manager, which oversees $6 trillion in assets. \nAround two-thirds of BlackRock’s corporate debt transactions are now done electronically, Prager said at the SEC meeting. By volume, however, that number drops to around 30 percent, pointing to the lasting importance of large block trades done by voice, especially for less standardized offerings, he added. \nBut electronic trading venues do help marry up the fragmented liquidity across the market, Prager said. \nElectronic trading platforms have proliferated in recent years in the over-the-counter debt market as big banks have scaled back their bond dealing in response to post-financial crisis rules that make such activity more expensive. \nThe pullback by banks has raised concerns about a liquidity crunch as U.S. interest rates rise and the market heats up. That has helped drive the shift to more electronic trading, as well as automation, to make sense of an often opaque market that has exploded in size over years of cheap borrowing rates. \nVanguard gets around 3 million unique trading messages a day and it is vital to be able to aggregate that information, especially as volatility begins to increase, Switzer said. \n“How do you have a trading desk ... of four guys with eight eyes that can look at 3 million messages and actually make any sense in rapidly changing and dynamic markets? That’s where we’re headed,” he said. Reporting by John McCrank, Editing by Rosalba O'Brien", "external_links": [], "published": "2018-01-11T22:24:00.000+02:00", "crawled": "2018-01-11T22:47:11.000+02:00", "highlightTitle": ""}