{"organizations": [], "uuid": "30bb4e3b2388989c02e218a758444a8222217e38", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 26, "shares": 26, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223020553&w=1200&r=LYNXMPEE0H0YM", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-morgan-stanley-results/morgan-stanley-quarterly-profit-tanks-adjusted-profit-beats-view-idUSKBN1F71LR", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Morgan Stanley quarterly profit tanks; adjusted profit beats view", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T14:30:00.000+02:00", "replies_count": 0, "uuid": "30bb4e3b2388989c02e218a758444a8222217e38"}, "author": "", "url": "https://www.reuters.com/article/us-morgan-stanley-results/morgan-stanley-quarterly-profit-tanks-adjusted-profit-beats-view-idUSKBN1F71LR", "ord_in_thread": 0, "title": "UPDATE 1-Morgan Stanley quarterly profit tanks; adjusted profit beats view", "locations": [], "entities": {"persons": [{"name": "reu", "sentiment": "negative"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "stanley", "sentiment": "negative"}, {"name": "morgan stanley", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 12:39 PM / in 3 hours Morgan Stanley tops estimates on underwriting, wealth management Catherine Ngai , Aparajita Saxena 5 Min Read \n(Reuters) - Morgan Stanley’s adjusted quarterly profit topped Wall Street estimates on Thursday as strength in underwriting and wealth management offset a sharp but expected decline in bond trading revenue. \nThe lender issued new targets that showed it will continue to focus on making wealth management more profitable while also bringing overall costs down, moves aimed at ironing out the swings of its more volatile businesses. \nLike most other big U.S. banks, Morgan Stanley took a fourth-quarter charge due to a U.S. tax overhaul signed into law in December, but analysts have been looking past those one-time hits to focus on the long-term benefits of lower tax rates. \nMorgan Stanley’s underwriting business was a bright spot, particularly in equities, which was helped by the bank’s leading position in initial public offerings. Underwriting revenue rose 42 percent to $915 million, while revenue from other parts of the institutional securities unit declined. \nWealth management also posted revenue gains and its 26 percent pretax profit margin topped Chief Executive Officer James Gorman’s targeted range for the year. Morgan Stanley lifted that target to 26 percent to 28 percent for this year and next. \nGorman has for years been shifting Morgan Stanley away from risky, volatile businesses that crippled the bank during the 2007-2009 financial crisis, and expanding areas that generate consistent fees, like investment banking and wealth management. \nOn a call to discuss the results, Gorman noted Morgan Stanley has met or exceeded all the goals he laid out in early 2016. \nBut analysts appeared disappointed by some of his new targets, repeatedly characterizing his latest wealth management goal as conservative and asking why he would not aim higher. \nGorman became exasperated at one point, responding, “Oh my God,” before going through his rationale again. \nShares of the sixth-largest U.S. bank rose 1 percent to $55.89 in morning trade. FILE PHOTO: The corporate logo of financial firm Morgan Stanley is pictured on the company's world headquarters in New York, U.S. April 17, 2017. REUTERS/Shannon Stapleton/File Photo \nOverall, Morgan Stanley’s fourth-quarter earnings fell 66 percent to $516 million, or 29 cents per share, from $1.7 billion or 81 cents per share, in the same period a year earlier. \nExcluding the tax charge and other items, adjusted profit was $1.68 billion, or 84 cents per share. Analysts on average were looking for 77 cents per share, according to Thomson Reuters I/B/E/S. \nTotal revenue rose 5 percent to $9.5 billion from $9.02 billion in the year-ago quarter. Analysts were expecting $9.2 billion. \nMorgan Stanley’s $1.2 billion tax hit was smaller than other banks that have reported results, and most of it came from changes in deferred tax assets, which are future tax benefits that drop in value when the corporate rate falls. \nThe bank expects a 22 percent to 25 percent tax rate this year, down from 31 percent last year. \nMorgan Stanley has been paying residual taxes on profits held abroad, Chief Financial Officer Jonathan Pruzan said in an interview, and so did not have a one-time mandatory tax charge on those earnings the way rivals including Citigroup Inc, JPMorgan Chase & Co and Goldman Sachs Group Inc did. \nBeyond wealth management, Morgan Stanley also reached Gorman’s annual goals for return on equity and average quarterly bond trading revenue. \nExcluding the tax charge, its return on equity was 9.4 percent last year. The lender wants to continue improving how well it generates profits from shareholder capital, and now has a medium-term target of 10 percent to 13 percent. \nAnd while Morgan Stanley’s bond trading revenue plunged 45 percent in the quarter, the business still delivered more than $1 billion in average quarterly revenue for the full year. Gorman has said the business needs to generate at least that much to be sustainable. \nMorgan Stanley is also working to keep its efficiency ratio, which measures expenses relative to revenue, to less than 73 percent, down one percentage point from its prior target. Last year it posted an efficiency ratio of 72.6 percent. \nAll Wall Street banks, particularly Goldman Sachs, have faced big declines in bond trading due to historically low market volatility. Reporting by Catherine Ngai in New York and Aparajita Saxena in Bengaluru; Additional reporting by Elizabeth Dilts; Writing by Lauren Tara LaCapra; Editing by Bernard Orr and Meredith Mazzilli", "external_links": [], "published": "2018-01-18T14:30:00.000+02:00", "crawled": "2018-01-18T14:48:11.016+02:00", "highlightTitle": ""}