{"organizations": [], "uuid": "e508bca87a808fb3dbecf9faed1de4dd28c4da8b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223324022&w=1200&r=LYNXMPEE0I0OT", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-spain-politics-catalonia/no-reason-why-i-cant-rule-catalonia-remotely-former-leader-says-idUSKBN1F81A8", "country": "US", "domain_rank": 408, "title": "No reason why I can't rule Catalonia remotely, former leader says", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T20:02:00.000+02:00", "replies_count": 0, "uuid": "e508bca87a808fb3dbecf9faed1de4dd28c4da8b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-spain-politics-catalonia/no-reason-why-i-cant-rule-catalonia-remotely-former-leader-says-idUSKBN1F81A8", "ord_in_thread": 0, "title": "No reason why I can't rule Catalonia remotely, former leader says", "locations": [], "entities": {"persons": [{"name": "carles puigdemont", "sentiment": "none"}, {"name": "puigdemont", "sentiment": "none"}, {"name": "mariano rajoy", "sentiment": "none"}], "locations": [{"name": "catalonia", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "catalunya radio", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 12:02 PM / Updated 16 minutes ago Former Catalan leader says he can rule from abroad, Madrid says no Sonya Dowsett , Ingrid Melander 5 Min Read \nMADRID (Reuters) - The sacked former leader of Catalonia said on Friday he could be re-elected as the region’s president and rule remotely from his self-imposed exile in Brussels, but the Spanish government said it would not let that happen. \nSupporters of Carles Puigdemont, who faces arrest for charges including sedition and rebellion if he returns to Spain, have suggested he could rule via video link -- earning him the sobriquet “the hologram president” from detractors. \n“I am a member of parliament who is perfectly eligible as president,” Puigdemont told Catalunya Radio. “These days many big projects are handled with the use of new technologies.” \nReferring to the charges against him, he added: “You can’t rule from prison.” \nBut the Spanish government said he could not rule from Brussels either. \n“He won’t be president (of Catalonia),” Inigo Mendez de Vigo, who is government spokesman and Minister of Education, Culture and Sport, told Reuters. \nThe government would immediately appeal to the courts if parliament leaders allowed the election of “a fugitive in Brussels”, Mendez de Vigo said. \nPuigdemont’s administration was dismissed by the central government in Madrid after he spearheaded a drive for the northeastern region, which is already semi-autonomous, to split from Spain that culminated in a unilateral declaration of independence in October. \nHe regained his seat in the Catalan parliament in a Dec. 21 election that was called by Spanish Prime Minister Mariano Rajoy in the hope that pro-unity parties would win and resolve Spain’s worst political crisis in decades. That ploy backfired, with parties in favor of a split gaining a slim majority. \nPuigdemont moved to Brussels shortly after he was fired by Madrid but has said he would return to Catalonia if the Spanish government gave him certain unspecified guarantees -- probably a promise not to arrest him. \nOther Catalan independence leaders including Oriol Junqueras, leader of the second-biggest separatist party in the regional parliament, are serving custodial sentences in Madrid for their roles in planning a banned independence referendum. \nThe Spanish government has been ruling Catalonia directly since it sacked Puigdemont. \nMendez de Vigo said the government would continue to directly rule Catalonia as long as necessary and that if the situation remained deadlocked as it is, there would be a new regional election in Catalonia. \n“This is not what we want but that’s what will happen if they act outside the law,” he said. LULL OVER \nThe new Catalan parliament met for the first time on Wednesday and picked a separatist politician as speaker, \nsignaling Puigdemont’s possible return. The appointment of Roger Torrent to the role ended a relative lull in the crisis since the election in December. \nThe Catalan parliamentary committee, which has a pro-independence majority, must decide by Jan. 31 if it will allow presidential candidates to act remotely. \nPrime Minister Rajoy has dismissed the possibility of long-distance rule by Puigdemont as absurd and Madrid has said it will contest any such decision in the courts. \nA first vote to choose a new leader is likely on Jan. 31, \nand Catalonia’s two main pro-independence parties have said they back Puigdemont. \nPuigdemont would not clarify in Friday’s radio interview whether he would continue with plans to unilaterally construct an independent republic if elected regional president. But he said he planned to restore the previous administration. \n“There is no plan B: plan A is restoration because that is what the people have entrusted us with.” \nThe independence drive has deeply divided people in the wealthy region and caused resentment in much of the rest of Spain. \nUncertainty over the future of Catalonia, which has Spain’s second-biggest city Barcelona and factories for global brands like Volkswagen ( VOWG_p.DE ) and Nestle, worried investors and led to thousands of companies moving their registered headquarters to elsewhere in Spain. Additional reporting by Immaculada Sanz; Editing by Jesús Aguado and Angus MacSwan", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T20:02:00.000+02:00", "crawled": "2018-01-19T14:13:01.016+02:00", "highlightTitle": ""}