{"organizations": [], "uuid": "08626adf3f8132876a58c6436c5bcecb6182c826", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-fidelity-national-financial-announces-4th-quarter-2017-earnings-release-and-conference-call.html", "country": "US", "domain_rank": 767, "title": "Fidelity National Financial Announces 4th Quarter 2017 Earnings Release and Conference Call", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T16:29:00.000+02:00", "replies_count": 0, "uuid": "08626adf3f8132876a58c6436c5bcecb6182c826"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-fidelity-national-financial-announces-4th-quarter-2017-earnings-release-and-conference-call.html", "ord_in_thread": 0, "title": "Fidelity National Financial Announces 4th Quarter 2017 Earnings Release and Conference Call", "locations": [], "entities": {"persons": [], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "jacksonville", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}], "organizations": [{"name": "fidelity national financial", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "fidelity national financial, inc.", "sentiment": "neutral"}, {"name": "fidelity national financial, inc", "sentiment": "none"}, {"name": "fnf", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JACKSONVILLE, Fla., Jan. 9, 2018 /PRNewswire/ -- Fidelity National Financial, Inc. (NYSE: FNF), a leading provider of title insurance and transaction services to the real estate and mortgage industries, will release 4 th quarter 2017 earnings after the close of regular market trading on Tuesday, January 30, 2018. A conference call will follow at 11:30 a.m. Eastern Time on Wednesday, January 31, 2018. Those wishing to participate via the webcast should access the call through FNF's Investor Relations website at www.fnf.com . Those wishing to participate via the telephone may dial-in at 800-230-1092 (USA) or 612-234-9960 (International). The conference call replay will be available via webcast through FNF's Investor Relations website at www.fnf.com . The telephone replay will be available from 1:30 p.m. Eastern Time on January 31, 2018, through February 7, 2018, by dialing 800-475-6701 (USA) or 320-365-3844 (International). The access code will be 442706.\nAbout Fidelity National Financial, Inc.\nFidelity National Financial, Inc. is (NYSE: FNF) is a leading provider of title insurance and transaction services to the real estate and mortgage industries. FNF is the nation's largest title insurance company through its title insurance underwriters - Fidelity National Title, Chicago Title, Commonwealth Land Title, Alamo Title and National Title of New York - that collectively issue more title insurance policies than any other title company in the United States. More information about FNF can be found at www.fnf.com .\nForward-Looking Statements\nThis press release contains forward-looking statements that involve a number of risks and uncertainties. Statements that are not historical facts, including statements regarding our expectations, hopes, intentions or strategies regarding the future are forward-looking statements. Forward-looking statements are based on management's beliefs, as well as assumptions made by, and information currently available to, management. Because such statements are based on expectations as to future financial and operating results and are not statements of fact, actual results may differ materially from those projected. We undertake no obligation to update any forward-looking statements, whether as a result of new information, future events or otherwise. The risks and uncertainties which forward-looking statements are subject to include, but are not limited to: changes in general economic, business and political conditions, including changes in the financial markets; weakness or adverse changes in the level of real estate activity, which may be caused by, among other things, high or increasing interest rates, a limited supply of mortgage funding or a weak U. S. economy; our potential inability to find suitable acquisition candidates; our dependence on distributions from our title insurance underwriters as a main source of cash flow; significant competition that our operating subsidiaries face; compliance with extensive government regulation of our operating subsidiaries; and other risks detailed in the \"Statement Regarding Forward-Looking Information,\" \"Risk Factors\" and other sections of the Company's Form 10-K and other filings with the Securities and Exchange Commission.\nFNF-E\nView original content: http://www.prnewswire.com/news-releases/fidelity-national-financial-announces-4th-quarter-2017-earnings-release-and-conference-call-300579901.html\nSOURCE Fidelity National Financial, Inc.", "external_links": ["http://www.fnf.com/", "http://www.prnewswire.com/news-releases/fidelity-national-financial-announces-4th-quarter-2017-earnings-release-and-conference-call-300579901.html"], "published": "2018-01-09T16:29:00.000+02:00", "crawled": "2018-01-09T17:40:51.000+02:00", "highlightTitle": ""}