{"organizations": [], "uuid": "228daa64e3f264112efe207dec00858cbe6dc2f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1218983062&w=1200&r=LYNXMPEE02089", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-poland-politics-farright-analysis/polands-far-right-opportunity-and-threat-for-ruling-pis-idUKKBN1ES0BO", "country": "US", "domain_rank": 408, "title": "Poland's far-right: opportunity and threat for ruling PiS", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T09:11:00.000+02:00", "replies_count": 0, "uuid": "228daa64e3f264112efe207dec00858cbe6dc2f8"}, "author": "", "url": "https://uk.reuters.com/article/uk-poland-politics-farright-analysis/polands-far-right-opportunity-and-threat-for-ruling-pis-idUKKBN1ES0BO", "ord_in_thread": 0, "title": "Poland's far-right: opportunity and threat for ruling PiS", "locations": [], "entities": {"persons": [{"name": "lucjusz nadberezny", "sentiment": "none"}, {"name": "beata szydlo", "sentiment": "none"}, {"name": "justyna pawlak", "sentiment": "none"}, {"name": "stalowa wola", "sentiment": "none"}, {"name": "jaroslaw kaczynski", "sentiment": "none"}, {"name": "lidia kelly", "sentiment": "none"}], "locations": [{"name": "poland", "sentiment": "none"}, {"name": "warsaw", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "justice", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  warsaw", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 7:11 AM / Updated 10 minutes ago Poland's far-right: opportunity and threat for ruling PiS Lidia Kelly , Justyna Pawlak 7 Min Read \nWARSAW (Reuters) - When activists from eastern Poland travelled to Warsaw to join a far-right march, the local mayor from the ruling Law and Justice party (PiS) paid for some of their travel. Jaroslaw Kaczynski, leader of the ruling party Law and Justice, speaks during a joint news conference with Prime Minister Beata Szydlo at the party headquarters in Warsaw, Poland November 14, 2017. REUTERS/Kacper Pempel \nThe march caught the attention of the world’s media because some of the 60,000 participants carried banners bearing racist and xenophobic slogans such as “pure blood, clear mind” and “Europe will be white or uninhabited”. \nStalowa Wola’s PiS mayor, Lucjusz Nadberezny, does “not regret the decision to support the trip”. His office said in a statement the November Independence Day march was a “safe and joyous manifestation of patriotism” and that people from his town did not participate in any “provocations”. \nA resurgence of far-right sentiment poses a dilemma for the PiS - a socially conservative group with a nationalist agenda. \nFar-right voters are a threat and an opportunity. The party tapped into frustration with western liberal values, when it won the 2015 election with the biggest majority by any party since the end of communism. \nIn other European states where anti-establishment right-wing slogans are also increasingly resonant, several far-right groups have got a foothold in power. \nBut in Poland they have had little success, or desire, to compete for office. This is in large part because the PiS has tailored its message across the spectrum of right-wing voters. \nThe activists from Stalowa Wola said they were going to Warsaw to express their opposition to “an invasion of immigrants and atheism in Europe”. \nWhile several PiS officials said any racist slogans were few and unrepresentative, they also praised the march. \nForeign Minister Witold Waszczykowski said afterwards it fuelled “patriotic behaviour of Poles” and any displays of xenophobia were “incidents” that were “of course, reprehensible.” \nHis comments were a typical PiS mix of patriotism with a general condemnation of racism and anti-Semitism. \nJaroslaw Kaczynski, the powerful leader of the PiS who has no formal position in government, said in 2015 that Middle East migrants could bring parasites and diseases to Poland. \nBut he also said that the racist banners at the march were “disgraceful rubbish” and that the “Polish tradition” has nothing to do with racism or anti-Semitism. RISK OF BREAKAWAY GROUP \nThe PiS is mindful of the need to retain the support of all right-wing voters, including far-right, for elections in each of the next three years. \nIt is also wary of the risk of a breakaway, ultraconservative group emerging to challenge its majority in parliament. \nTadeusz Cymanski, deputy head of the PiS parliamentary caucus said it is better if far-right organisations such as ONR, which helped organise the Warsaw march, do not feel threatened by the PiS. \n“It is in the interest of democracy, in the interest of our state that extreme groups, either left or right-wing, have no representation in parliament,” he told Reuters. \n“Any association (of ONR with PiS) is painful and unpleasant, I reject it with shame, but I think it would be better even if I, or my faction, were associated with them rather than these forces were to gain in force.” \nHe said the PiS is mindful that its 2015 election victory was fuelled in part by the fact that several smaller groups did not cross the election threshold, earning PiS extra seats in parliament. \nAnother outspoken PiS member, Ryszard Czarnecki, said the party gave all right-leaning voters a sense of belonging, in contrast to the previous centrist government which was seen as “cosmopolitan”. \n“Right-wing voters have the feeling ... that we are a serious group, which has power, fulfils the right-wing agenda, so there is no need to escape towards the far right,” he said. \n“A number of young people now prefer to vote for PiS. If (centrist) rule continued, then I think radical movements would have been stronger in Poland.” \nThe party’s more centrist electorate has stuck with it despite the move to embrace the right, partly because of generous social policies. But any stronger association with the far-right could turn those voters away, analysts say. XENOPHOBIA RISING \nONR and other far-right Polish groups such as Mlodziez Wszechpolska refuse to release membership figures but analysts say acceptance of xenophobic slogans as well as violence against Muslims is on the rise. \nIn a November 2016 survey by CBOS, a pollster overseen by the government, 95 percent of Poles said they did not know anyone from a far-right group. However, more than one in three said they supported far-right activities. \nHate crimes committed against Muslims have grown by more than 300 percent between 2013 and 2016, according to data from the Warsaw University’s Center for Research on Prejudice. \nONR, which calls for “ethnic homogeneity” in Poland in its official literature, says it has helped the PiS. \n“PiS has copied some of our rhetoric, for example referring to migrants from Muslim states,” said ONR deputy chief Tomasz Dorosz. “This has assured their victory in the last election.” \nPoland, like Hungary, has refused to take in any of its European Union quota of refugees from Syria and elsewhere on the grounds that Muslim immigrants are a threat to national security and stability. \nNew PiS Prime Minister Mateusz Morawiecki told the state-run television TVP on Monday that the government’s stance on migrants is not going to change “in years to come”. \n“We will not accept refugees, migrants from the Middle East and Africa. This is our sovereign decision,” Morawiecki said. \nIn 2016 the PiS government disbanded the Council for the Prevention of Racial Discrimination, Xenophobia and Intolerancee, an advisory body to the government, and a unit at the interior ministry responsible, among others, for monitoring hate crimes. \n“While the PiS governs increasingly as a far-right party, it didn’t campaign as such and it wasn’t elected as such,” said Cas Mudde, an expert on the far-right at the University of Georgia. \nBut with local elections expected in late 2018, a parliamentary vote in 2019 and presidential elections in 2020, this tactic is expected to continue. Polls expect the PiS to do better in the local elections than four years ago. \n“Kaczynski is probably disgusted (by the far right),” said Konstanty Gebert, a liberal analyst with the European Council for Foreign Relations think tank. \n“But it won’t cloud his perspective on election interests.” Additional reporting by Pawel Sobczak, Anna Wlodarczak-Semczuk, Pawel Goraj, Anna Koper in Warsaw, Matt Robinson in Belgrade and Kriszta Than in Budapest; editing by Anna Willard", "external_links": [], "published": "2018-01-03T09:11:00.000+02:00", "crawled": "2018-01-03T09:24:31.015+02:00", "highlightTitle": ""}