{"organizations": [], "uuid": "9cc9cfe3d704d29a1f410d72db31d8d7befbe42f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224335557&w=1200&r=LYNXMPEE0M038", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-olympics-2018-northkorea/south-korea-government-rejects-pyongyang-olympics-criticism-idUSKBN1FC07X", "country": "US", "domain_rank": 408, "title": "South Korea government rejects 'Pyongyang Olympics' criticism", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T04:40:00.000+02:00", "replies_count": 0, "uuid": "9cc9cfe3d704d29a1f410d72db31d8d7befbe42f"}, "author": "", "url": "https://www.reuters.com/article/us-olympics-2018-northkorea/south-korea-government-rejects-pyongyang-olympics-criticism-idUSKBN1FC07X", "ord_in_thread": 0, "title": "South Korea government rejects 'Pyongyang Olympics' criticism", "locations": [], "entities": {"persons": [{"name": "hyonhee shin", "sentiment": "none"}, {"name": "kim jong un", "sentiment": "none"}, {"name": "park soo-hyun", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "pyongyang olympi", "sentiment": "none"}, {"name": "pyongyang", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "blue house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEOUL (Reuters) - Seoul’s presidential Blue House rejected criticism on Tuesday that next month’s Winter Games had been hijacked by North Korea, saying the event will help defuse tensions over Pyongyang’s nuclear and missile programs.\nSome opposition politicians and conservatives in South Korea have criticized North Korea’s participation in the Games to be held in the South Korean alpine resort town of Pyeongchang, dubbing them the “Pyongyang Olympics”.\n“Just one month ago, acute tensions gripped the Korean peninsula, but the administration’s efforts to tackle the crisis through dialogue has led to North Korea’s participation in the Olympics,” Blue House spokesman Park Soo-hyun told a news conference.\n“We’re confident that the Olympics will be a stepping stone to bring peace to the Korean peninsula, to Northeast Asia and the world.”\nAfter a months-long standoff over the North’s nuclear and missile tests, the two Koreas agreed during their first formal talks in nearly two years that the South will help arrange for the North to join in the Games.\nSome specific plans, however, including fielding a joint women’s ice hockey team and marching under a united flag, have proven controversial, with conservatives and younger South Koreans upset that North Korean leader Kim Jong Un is stealing the spotlight.\nThe administration of South Korea’s liberal president, Moon Jae-in, is under pressure over its offer to send athletes to a North Korean ski resort for joint training. Experts say the move risks giving Kim’s regime legitimacy and some much needed cash.\nSeoul officials are on a three-day trip to the North starting Tuesday to inspect the resort’s facilities and the newly built Kalma Airport nearby that may be used to fly in the South Korean skiers, who are not expected to attend the Games.\nMoon’s approval rating has fallen to a four-month low at 66 percent, a poll showed on Monday, due to a backlash over the decision regarding the combined hockey team.\nPROTEST Later Tuesday, the North said it would send a 15-strong ice hockey team to the South on Thursday for joint training with South Korean players, together with a group of officials who are due to inspect Olympics facilities, Seoul’s Unification Ministry said.\nThe Olympic Cauldron for the upcoming 2018 Pyeongchang Winter Olympic Games is pictured at the Alpensia resort in Pyeongchang, South Korea, January 23, 2018. REUTERS/Fabrizio Bensch The two Koreas also finalised venues for joint orchestra performances which will take place on Feb. 8 at Gangneung, near Pyeongchang, and on Feb. 11 in Seoul, according to the ministry.\nSmall but vocal groups of demonstrators staged a protest at Seoul’s central train station on Monday where a North Korean delegation had arrived to see the concert venues, burning a picture of Kim. One sign at the protest read: “We’re opposed to Kim Jong Un’s Pyongyang Olympics!”.\nNorth Korea’s Committee for the Peaceful Reunification of the Country, in charge of inter-Korean affairs, called the picture-burning protest a “shuddering, hideous crime”, urging Seoul to apologize and punish those involved.\nSlideshow (9 Images) “We will never tolerate hideous acts of the conservative hooligans who insulted the sacred dignity and symbol of the DPRK, and the dishonest behavior of the South Korean authorities who connived at such acts,” said a spokesman of the organization via the official KCNA news agency on Tuesday.\nThe official was referring to North Korea by its full name, the Democratic People’s Republic of Korea.\n“We cannot but take a serious consideration of our follow-up measures regarding the Winter Olympics.”\nSeparately, North Korea announced on Tuesday it will mark Feb. 8 as a new anniversary for the founding of its military.\nThe anniversary, previously held on April 25 and marked with a large military parade, will now take place just one day before the Olympics begins.\nThe South Korean military said a detailed analysis was needed to understand the North’s intention behind the date change.\nCheong Seong-chang, a senior fellow at the Sejong Institute south of Seoul, said the anniversary change may be an effort by Kim to distinguish himself from his father and grandfather, emboldened by last year’s progress on the nuclear and missile programs.\n“He could also be seeking to steal the show from the South by holding a grand anniversary event just before the Olympics begin, and unveiling weapons like new intercontinental ballistic missiles”, Cheong said.\nReporting by Hyonhee Shin; Editing by Lincoln Feast and Janet Lawrence\n ", "external_links": [], "published": "2018-01-23T04:40:00.000+02:00", "crawled": "2018-01-23T05:01:11.006+02:00", "highlightTitle": ""}