{"organizations": [], "uuid": "536cdcc0f07cfb5028db50fb69d927dfe8560f74", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180115.html", "section_title": "Archive News &amp; Video for Monday, 15 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/canada-forex/canada-fx-debt-c-rises-vs-weaker-greenback-ahead-of-potential-rate-hike-idUSL1N1PA0JE", "country": "US", "domain_rank": 408, "title": "CANADA FX DEBT-C$ rises vs weaker greenback ahead of potential rate hike", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.426, "site_type": "news", "published": "2018-01-15T22:41:00.000+02:00", "replies_count": 0, "uuid": "536cdcc0f07cfb5028db50fb69d927dfe8560f74"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/canada-forex/canada-fx-debt-c-rises-vs-weaker-greenback-ahead-of-potential-rate-hike-idUSL1N1PA0JE", "ord_in_thread": 0, "title": "CANADA FX DEBT-C$ rises vs weaker greenback ahead of potential rate hike", "locations": [], "entities": {"persons": [], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "european central bank", "sentiment": "none"}, {"name": "bank of canada", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Canadian dollar at C$1.2428, or 80.46 U.S. cents * Loonie touches its strongest since Tuesday at C$1.2405 * Bond prices higher across the yield curve TORONTO, Jan 15 (Reuters) - The Canadian dollar strengthened to a nearly one-week high against its U.S. counterpart on Monday as the greenback broadly fell and investors braced for a potential interest rate increase by the Bank of Canada this week. The central bank will kick off 2018 by hiking interest rates, buoyed by robust job growth, even as uncertainty around the fate of the North American Free Trade Agreement lingers, a Reuters poll found. Chances of a rate hike on Wednesday stand at nearly 90 percent, the overnight index swaps market indicated. The U.S. dollar fell against a basket of major currencies as growing economic optimism in the euro zone and expectations that the European Central Bank will tighten monetary policy helped boost the euro. At 9:18 a.m. EST (1418 GMT), the Canadian dollar was trading at C$1.2428 to the greenback, or 80.46 U.S. cents, up 0.2 percent. The currency touched its strongest since Tuesday at C$1.2405. Speculators have raised bullish bets on the Canadian dollar for the first time in three weeks, data from the U.S. Commodity Futures Trading Commission and Reuters calculations showed on Friday. As of Jan. 9, net long positions had increased to 17,461 contracts from 14,739 a week earlier. Lending to Canadian small businesses perked up in November after declining for the past six months on gains in the construction and transportation sectors, which could bode well for economic momentum heading into the end of 2017, data showed. Resales of Canadian homes rose 4.5 percent in December from November, the fifth straight monthly rise, likely because activity was pulled forward to avoid mortgage rule changes that hit in January, the Canadian Real Estate Association said on Monday. The price of oil, one of Canada's major exports, hovered near a three-year high on signs that production cuts by OPEC and Russia are tightening supplies. U.S. crude prices were up 0.14 percent at $64.39 a barrel. Canadian government bond prices were higher across the yield curve, with the two-year up 0.5 Canadian cent to yield 1.757 percent and the 10-year rising 7 Canadian cents to yield 2.167 percent. (Reporting by Fergal Smith; Editing by Nick Zieminski)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T22:41:00.000+02:00", "crawled": "2018-01-16T13:26:27.000+02:00", "highlightTitle": ""}