{"organizations": [], "uuid": "90c0db26f08bccf689b1970bfa5666dbcbbf5036", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/business-wire-bio-rad-gains-additional-u-s-fda-clearances-for-blood-typing-products-expanding-its-offering-for-the-blood-testing-market.html", "country": "US", "domain_rank": 767, "title": "Bio-Rad Gains Additional U.S. FDA Clearances for Blood Typing Products, Expanding its Offering for the Blood Testing Market", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.888, "site_type": "news", "published": "2018-01-23T00:15:00.000+02:00", "replies_count": 0, "uuid": "90c0db26f08bccf689b1970bfa5666dbcbbf5036"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/business-wire-bio-rad-gains-additional-u-s-fda-clearances-for-blood-typing-products-expanding-its-offering-for-the-blood-testing-market.html", "ord_in_thread": 0, "title": "Bio-Rad Gains Additional U.S. FDA Clearances for Blood Typing Products, Expanding its Offering for the Blood Testing Market", "locations": [], "entities": {"persons": [{"name": "john hertia", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "hercules", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "bio-rad", "sentiment": "neutral"}, {"name": "bio-rad laboratories, inc.", "sentiment": "neutral"}, {"name": "nyse", "sentiment": "neutral"}, {"name": "fda", "sentiment": "none"}, {"name": "u.s. food and drug administration", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HERCULES, Calif.--(BUSINESS WIRE)-- Bio-Rad Laboratories, Inc. (NYSE: BIO and BIOb), a global leader of life science research and clinical diagnostic products, today announced that it has received 510(k) clearance from the U.S. Food and Drug Administration (FDA) for the IH -Incubator L and IH -Centrifuge L instruments to be used with the full range of Bio-Rad’s IH -System Gel Reagents for manual blood typing methods.\nWith the addition of the IH -Centrifuge L and IH -Incubator L to Bio-Rad’s portfolio of blood typing platforms, transfusion medicine laboratories of any size can standardize automated and manual typing with one method and supplier. The unique design of the two instruments maximizes efficiency and space in the laboratory by accommodating both conventional tube and gel blood typing.\n“We are pleased to receive FDA clearance for our IH -Incubator L and IH -Centrifuge L instruments for use with our IH -System Gel Reagents and look forward to extending our reach in the U.S. transfusion medicine market,” said John Hertia, Bio-Rad Executive Vice President and President, Clinical Diagnostics Group. \"This addition rounds out our offering, specifically benefitting smaller laboratories that use manual methods to test blood.”\nBio-Rad provides a wide variety of platforms, reagents, data management, and connectivity solutions to address different blood typing needs, offering efficient and reliable results for blood grouping, phenotyping, crossmatching, antibody screening and identification, direct antiglobulin tests, and single antigen typing.\nAbout Bio-Rad\nBio-Rad Laboratories, Inc. (NYSE: BIO and BIOb) is a global leader in developing, manufacturing, and marketing a broad range of innovative products and solutions for the life science research and clinical diagnostic markets. With a focus on quality and customer service for over 65 years, our products advance the discovery process and improve healthcare. Our customers are university and research institutions, hospitals, public health and commercial laboratories, biotechnology, pharmaceutical, as well as applied research laboratories that include food safety and environmental quality testing. Founded in 1952, Bio-Rad is based in Hercules, California, and has a global network of operations with more than 8,000 employees worldwide. Bio-Rad had revenues exceeding $2 billion in 2016. For more information, please visit www.bio-rad.com .\nBio-Rad Forward-Looking Statements\nThis release may be deemed to contain certain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements include, without limitation, statements we make regarding plans to introduce new products and the opportunities that may result from such new products. Forward-looking statements generally can be identified by the use of forward-looking terminology such as “plan”, “believe,” “expect,” “anticipate,” “may,” “will,” “intend,” “estimate,” “offers,” or similar expressions or the negative of those terms or expressions, although not all forward-looking statements contain these words. Such statements involve risks and uncertainties, which could cause actual results to vary materially from those expressed in or indicated by the forward-looking statements. These risks and uncertainties include our ability to develop and market new or improved products, our ability to compete effectively, international legal and regulatory risks, and product quality and liability issues. For further information regarding our risks and uncertainties, please refer to the “Risk Factors” and “Management’s Discussion and Analysis of Financial Condition and Results of Operation” in Bio-Rad’s public reports filed with the Securities and Exchange Commission, including our most recent Annual Report on Form 10-K and our Quarterly Reports on Form 10-Q. Bio-Rad cautions you not to place undue reliance on forward-looking statements, which reflect an analysis only and speak only as of the date hereof. We disclaim any obligation to update these forward-looking statements.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180122006450/en/\nBio-Rad Laboratories, Inc.\nTina Cuccia, 510-724-7000\nCorporate Communications\ntina_cuccia@bio-rad.com\nSource: Bio-Rad Laboratories, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180122006450/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.bio-rad.com&esheet=51746982&newsitemid=20180122006450&lan=en-US&anchor=www.bio-rad.com&index=1&md5=19b837c4c8484308687d436e962527cb"], "published": "2018-01-23T00:15:00.000+02:00", "crawled": "2018-01-23T02:18:25.010+02:00", "highlightTitle": ""}