{"organizations": [], "uuid": "3da380376e4ae49c5223e3fd7c6725c0b8fde813", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/globe-newswire-core-mark-updates-2017-outlook-and-provides-2018-guidance.html", "country": "US", "domain_rank": 767, "title": "Core-Mark Updates 2017 Outlook and Provides 2018 Guidance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T16:30:00.000+02:00", "replies_count": 0, "uuid": "3da380376e4ae49c5223e3fd7c6725c0b8fde813"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/globe-newswire-core-mark-updates-2017-outlook-and-provides-2018-guidance.html", "ord_in_thread": 0, "title": "Core-Mark Updates 2017 Outlook and Provides 2018 Guidance", "locations": [], "entities": {"persons": [{"name": "thomas b. perkins", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "nasd", "sentiment": "negative"}, {"name": "core-mark holding company, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SOUTH SAN FRANCISCO, Calif., Jan. 05, 2018 (GLOBE NEWSWIRE) -- Core-Mark Holding Company, Inc. (NASDAQ:CORE) (the “Company”), one of the largest marketers of fresh and broad-line supply solutions to the convenience retail industry in North America, today announced preliminary financial results for the year-ended December 31, 2017.\n“We continued to execute on our core strategies during the fourth quarter resulting in growth of approximately 7% in our non-cigarette same store sales. Unfortunately, many of our customers did not see an overall retail sales lift, particularly in California, driven primarily by cigarette carton volume declines,” said Thomas B. Perkins, Chief Executive Officer. “We do not expect to meet our previous expectations for Adjusted EBITDA, primarily due to the performance of our two recovering divisions and not realizing our operational cost reduction initiatives at the pace we expected. We are, however, making progress in reducing expense levels across the organization, and are confident that our two troubled divisions are on a path to profitability in 2018. With this momentum, we are well positioned to improve our profitability as we enter 2018.”\nThe Company expects to report 2017 full-year net sales of $15.7 billion for 2017, consistent with the Company’s previous guidance. Adjusted EBITDA (non-GAAP) for 2017 is now expected to be between $136 million and $141 million, compared to previous guidance of $152 million to $156 million. The Company expects to report diluted earnings per share (“Diluted EPS”) for the year in the range of $0.66 to $0.73, lowered from $0.93 to $0.97 in the Company’s prior guidance. The Company expects diluted EPS, excluding LIFO expense (non-GAAP), to be reported between $0.94 and $1.01 per diluted share, compared with previous guidance from $1.20 and $1.24 per diluted share.\nThe key assumptions for the Company’s updated projections are an expected tax rate of 36.0%, $20 million in LIFO expense and $11 million in interest expense, with approximately 46.4 million diluted shares outstanding for the year. The Company expects to realize a non-cash pension settlement charge of approximately $18 million in the fourth quarter of 2017 related to the termination of its legacy pension plan, which is not included in the estimates above. In addition, these preliminary results do not include the impact of the recently enacted tax legislation. The Company estimates a tax benefit between $8 million and $10 million, or $0.17 to $0.21 per diluted share for 2017, due primarily to the revaluation of its net deferred tax liabilities under the new legislation.\nThe above information is unaudited and subject to completion of the year-end financial reporting processes. The Company expects to release fourth quarter and year-end results on or about February 27, 2018.\n2018 Guidance\nThe Company expects 2018 annual net sales to be between $16.6 billion and $16.8 billion. This growth in sales is expected to be driven by increases in same store sales and incremental market share gains; it assumes no new acquisitions.\nAdjusted EBITDA for 2018 is expected to be between $157.0 million and $167.0 million. Diluted earnings per-share for the full year are expected to be between $0.84 and $1.00, which assumes $18.0 million of estimated LIFO expense. Our diluted per-share estimates, excluding LIFO expense, are between $1.13 and $1.29. EPS estimates assume a tax rate of 25% based on preliminary assessment of the new tax legislation and 46.4 million diluted shares outstanding. Capital expenditures for 2018 are expected to be approximately $30 million.\nICR Conference\nThe Company is planning on presenting at the upcoming ICR Conference 2018 on Tuesday, January 9 th of 2018. Its presentation, which will be webcast, is scheduled to begin at 2:30 p.m. Eastern time and will be available at the Company’s website in the Investors- Events & Presentations section.\nCore-Mark\nCore-Mark is one of the largest marketers of fresh and broad-line supply solutions to the convenience retail industry in North America. Founded in 1888, Core-Mark offers a full range of products, marketing programs and technology solutions to approximately 46,000 customer locations in the U.S. and Canada through 32 distribution centers (excluding two distribution facilities the Company operates as a third party logistics provider). Core-Mark services traditional convenience retailers, grocers, drug, liquor and specialty stores, and other stores that carry convenience products. For more information, please visit www.core-mark.com .\nForward-Looking Statements\nStatements in this press release that are not statements of historical fact are forward-looking statements made pursuant to the safe-harbor provisions of the Securities Exchange Act of 1934 and the Securities Act of 1933. These statements include statements regarding Adjusted EBITDA, Diluted EPS, Diluted EPS excluding LIFO expense and related disclosures, which are subject to year-end financial reporting processes and audit review. Forward-looking statements in some cases can be identified by the use of words such as “may,” “will,” “should,” “potential,” “intend,” “expect,” “seek,” “anticipate,” “estimate,” “believe,” “could,” “would,” “project,” “predict,” “continue,” “plan,” “propose” or other similar words or expressions. Forward-looking statements are made only as of the date of this press release and are based on our current intent, beliefs, plans and expectations. They involve risks and uncertainties that could cause actual results to differ materially from historical results or those described in or implied by such forward-looking statements.\nRefer to the “Risk Factors” section of our Annual Report on Form 10-K for the year ended December 31, 2016 filed with the SEC on March 1, 2017 and Part II, Item 1A, “Risk Factors” of any quarterly report on Form 10-Q subsequently filed by us for a comprehensive discussion of risk factors. We undertake no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.\nNon-GAAP Financial Measures\nThis press release includes non-GAAP financial measures including Adjusted EBITDA, and Diluted EPS excluding LIFO expense. We believe these non-GAAP financial measures provide meaningful supplemental information for investors regarding the performance of our business and facilitate a meaningful period-to-period evaluation. We also believe these measures allow investors to view results in a manner similar to the method used by our management. We use these non-GAAP financial measures in order to have comparable financial results to analyze changes in our underlying business. These non-GAAP measures should be considered as a supplement to, and not as a substitute for, or superior to, financial measures calculated in accordance with GAAP. These measures may be defined differently than other companies and therefore such measures may not be comparable to ours. We strongly encourage investors and stockholders to review our financial statements and publicly filed reports in their entirety and not to rely on any single financial measure.\nAdjusted EBITDA is a measure used by us to measure operating performance. Adjusted EBITDA is also among the prim", "external_links": ["https://www.globenewswire.com/Tracker?data=dwPRQ73MuSkff-1qUFdT_j1B1LckBmHY_SimFzfdXhtO_4dlmWmUuc6EarKo_-ncTW3lhr92iFQpMqeeNJESXy3Ib3k3v6mrqrybfbJFPvs=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/c39bb0c9-e735-4a0c-91ef-0f5efedb7e21"], "published": "2018-01-05T16:30:00.000+02:00", "crawled": "2018-01-05T18:05:25.009+02:00", "highlightTitle": ""}