{"organizations": [], "uuid": "aae03f1d46d62c272b5523f37a3f10fff63a4c70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-greeley-and-hansen-appoints-two-new-principals.html", "country": "US", "domain_rank": 767, "title": "Greeley and Hansen Appoints Two New Principals", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T16:13:00.000+02:00", "replies_count": 0, "uuid": "aae03f1d46d62c272b5523f37a3f10fff63a4c70"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-greeley-and-hansen-appoints-two-new-principals.html", "ord_in_thread": 0, "title": "Greeley and Hansen Appoints Two New Principals", "locations": [], "entities": {"persons": [{"name": "hansen", "sentiment": "negative"}, {"name": "greeley", "sentiment": "negative"}, {"name": "joseph dinkel", "sentiment": "none"}, {"name": "michael j. hope", "sentiment": "none"}, {"name": "dinkel", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}, {"name": "delaware", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}], "organizations": [{"name": "north atlantic operating group", "sentiment": "none"}, {"name": "electrical", "sentiment": "none"}, {"name": "instrumentation & control", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 23, 2018 /PRNewswire/ -- Greeley and Hansen, a leading global civil and environmental engineering, architectural, and management consulting firm, has named Joseph Dinkel and Michael J. Hope as principals. Both are accomplished engineers and leaders that exemplify Greeley and Hansen's core values of client commitment and dedication to providing quality service.\nDinkel is the Manager of the firm's Mechanical, Electrical, Plumbing, and Instrumentation & Control (MEPIC) Group with overall responsibility for directing staff and providing high-level project delivery oversight. He has broad experience in management, engineering, construction, and project execution for a wide range of water, wastewater, and other infrastructure projects with special expertise in complex HVAC, plumbing, and fire protection systems.\nHope currently serves as Co-Managing Director of the North Atlantic Operating Group, leading the firm's day-to-day business operations as well as business development and strategic growth efforts in Pennsylvania, Delaware, and New Jersey. He has extensive experience in managing a diverse range of large, complex water and wastewater programs and facility projects for utility clients in the northeast.\n\"In addition to their depth of technical experience, Joe and Mike have consistently demonstrated the strong leadership and management skills that will help us advance our long-range business goals,\" said Chairman and Chief Executive Officer Andy Richardson . \"Greeley and Hansen is focused on achieving sustained future growth, and Joe and Mike are both highly qualified and motivated professionals who can help accelerate the firm's ongoing efforts to achieve our growth objectives.\"\nDinkel is a registered professional engineer with a B.S. in mechanical engineering from Michigan Technological University. He is Certified in Plumbing Design (CPD) and is also a member of the American Society of Plumbing Engineers and the American Society of Heating, Refrigerating, and Air Conditioning Engineers.\nHope is a registered professional engineer and a New Jersey Certified Municipal Engineer with a B.S. in civil engineering from Widener University. He is actively involved in a number of professional organizations, including the American Water Works Association, American Society of Civil Engineers, and New Jersey Water Environment Association. He is a Past President of the New Jersey Society of Professional Engineers and has served in officer and committee roles for other organizations, including the New Jersey Department of Environmental Protection Advisory Committee for Standards for Individual Subsurface Disposal Systems.\nAbout Greeley and Hansen\nGreeley and Hansen is a leader in developing innovative engineering, architecture, and management solutions for a wide array of complex water, wastewater, and related infrastructure challenges. The firm has built upon over 100 years of proven civil and environmental engineering experience in all phases of project development and implementation to become a premier global provider of comprehensive services in the water sector. Greeley and Hansen is dedicated to designing better urban environments worldwide. http://www.greeley-hansen.com/new.htm\nFor more information, contact:\nNancy Stankus\n312-558-9000\nnstankus@greeley-hansen.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/greeley-and-hansen-appoints-two-new-principals-300586324.html\nSOURCE Greeley and Hansen", "external_links": ["http://www.prnewswire.com/news-releases/greeley-and-hansen-appoints-two-new-principals-300586324.html", "http://www.greeley-hansen.com/new.htm"], "published": "2018-01-23T16:13:00.000+02:00", "crawled": "2018-01-23T17:32:36.036+02:00", "highlightTitle": ""}