{"organizations": [], "uuid": "e5d0c08905c4097bc146aa2d02a4730cb466ea5e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/business-wire-celgene-reports-fourth-quarter-and-full-year-2017-operating-and-financial-results.html", "country": "US", "domain_rank": 767, "title": "Celgene Reports Fourth Quarter and Full-Year 2017 Operating and Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T15:30:00.000+02:00", "replies_count": 0, "uuid": "e5d0c08905c4097bc146aa2d02a4730cb466ea5e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/business-wire-celgene-reports-fourth-quarter-and-full-year-2017-operating-and-financial-results.html", "ord_in_thread": 0, "title": "Celgene Reports Fourth Quarter and Full-Year 2017 Operating and Financial Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "celgene", "sentiment": "negative"}, {"name": "gaap", "sentiment": "none"}, {"name": "celgene corporation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "- Finished 2017 with strong operating and financial momentum\n- Celgene recently announced two strategic transactions enhancing long-term growth prospects\nSUMMIT, N.J.--(BUSINESS WIRE)-- Celgene Corporation (NASDAQ:CELG) reported operating results for the fourth quarter and full year of 2017. For the fourth quarter of 2017, net product sales were $3,479 million, an increase of 17 percent, year-over-year. Fourth quarter total revenue increased 17 percent to $3,483 million.\nNet product sales for the full year of 2017 were $12,973 million, an increase of 16 percent year-over-year. Total revenue for the full year of 2017 was $13,003 million, an increase of 16 percent year-over-year.\nBased on U.S. GAAP (Generally Accepted Accounting Principles), Celgene reported a net loss of $81 million and diluted earnings per share (EPS) of ($0.10) for the fourth quarter of 2017. For the fourth quarter of 2016, GAAP net income was $429 million and diluted EPS was $0.53. The decrease was primarily due to the impact of the Tax Cuts and Jobs Act. Full-year GAAP net income for 2017 was $2,940 million and diluted EPS was $3.64. Full-year GAAP net income for 2016 was $1,999 million and diluted EPS was $2.49.\nAdjusted net income for the fourth quarter of 2017 increased 23 percent to $1,592 million compared to $1,290 million in the fourth quarter of 2016. For the same period, adjusted diluted EPS increased 24 percent to $2.00 from $1.61.\nAdjusted net income for the full year 2017 increased 26 percent to $6,016 million. Adjusted diluted EPS increased 25 percent to $7.44 from $5.94 for the full year of 2016.\n“Our 2017 commercial, regulatory and clinical execution lay the foundation for success in 2018 and beyond,\" said Mark J. Alles, Chief Executive Officer of Celgene Corporation. \"Our operating momentum enables us to continue expanding our portfolio, as demonstrated by the two strategic transactions announced this year.\"\nFourth Quarter and Full-Year 2017 Financial Highlights\nUnless otherwise stated, all comparisons are for the fourth quarter and full year of 2017 compared to the fourth quarter and full year of 2016. The adjusted operating expense categories presented below exclude share-based employee compensation expense, collaboration-related upfront expense, research and development asset acquisition expense, IPR&D asset impairment charges, clinical trial and development activity wind-down costs and a litigation-related loss contingency accrual expense. Please see the attached Use of Non-GAAP Financial Measures and Reconciliation of GAAP to Adjusted Net Income for further information relevant to the interpretation of adjusted financial measures and reconciliations of these adjusted financial measures to the most comparable GAAP measures, respectively.\nNet Product Sales Performance\nREVLIMID ® sales for the fourth quarter increased 21 percent to $2,188 million. Fourth quarter U.S. sales of $1,473 million and international sales of $715 million increased 24 percent and 15 percent, respectively. Full-year REVLIMID ® sales were $8,187 million, an increase of 17 percent year-over-year. Sales growth was driven primarily by higher volume due to increases in duration and market share. POMALYST ® /IMNOVID ® sales for the fourth quarter were $442 million, an increase of 17 percent year-over-year. Fourth quarter U.S. sales of $283 million increased 29 percent and international sales were unchanged at $159 million. Full-year POMALYST ® /IMNOVID ® sales were $1,614 million, an increase of 23% year-over-year. Sales growth was driven primarily by increased volume due to increases in market share and duration. OTEZLA ® sales in the fourth quarter were $371 million, a 22 percent increase year-over-year. Fourth quarter U.S. sales of $303 million and international sales of $68 million increased 13 percent and 84 percent, respectively. Full-year OTEZLA ® sales were $1,279 million, an increase of 26 percent year-over-year. OTEZLA ® sales were primarily driven by volume gains in the U.S. and strong uptake in key international markets. ABRAXANE ® sales for the fourth quarter were $251 million, a decrease of 6 percent year-over-year. U.S. sales were $155 million and international sales were $96 million, a decrease of 10 percent and an increase of 2 percent, respectively. Full-year ABRAXANE ® sales were $992 million, an increase of 2 percent year-over-year. ABRAXANE ® market shares in pancreatic cancer, first-line advanced non-squamous lung cancer and metastatic breast cancer in the U.S. have remained stable. Growth in Europe was from market share gains for ABRAXANE ® in pancreatic cancer. In the fourth quarter, all other product sales, which include IDHIFA ® , THALOMID ® , ISTODAX ® , VIDAZA ® and an authorized generic version of VIDAZA ® drug product primarily sold in the U.S., were $227 million compared to $220 million in the fourth quarter of 2016. Full-year sales for these products were $901 million compared to $910 million in full-year 2016. Total net product sales for the fourth quarter of 2017 increased 17 percent year-over-year, driven by operational growth. Net product sales growth also includes a 1.4 percent negative impact from currency exchange effects.\nResearch and Development (R&D)\nOn a GAAP basis, R&D expenses were $2,738 million for the fourth quarter of 2017 versus $1,135 million for the same period in 2016. Full-year 2017 R&D expenses were $5,915 million compared to $4,470 million for 2016. Both the fourth-quarter and full-year 2017 increases in R&D expenses on a GAAP basis were primarily due to the charges related to the discontinuation of the GED-0301 clinical trials in Crohn’s disease, including impairment of an IPR&D asset and other one-time charges related to wind-down costs associated with the GED-0301 clinical trials in Crohn’s disease and certain development activities.\nAdjusted R&D expenses were $766 million for the fourth quarter of 2017 compared to $673 million for the fourth quarter of 2016. For the full year 2017, adjusted R&D expenses were $2,749 million compared to $2,508 million for the full year 2016. Both the fourth quarter and full-year 2017 increases in adjusted R&D expenses were primarily due to increased spending related to clinical trial and other R&D activity.\nSelling, General, and Administrative (SG&A)\nOn a GAAP basis, SG&A expenses were $774 million for the fourth quarter of 2017 compared to $685 million for the same period in 2016. Full-year SG&A expenses were $2,941 million for 2017 compared to $2,658 million for 2016. The full-year 2017 increase in SG&A expenses was primarily due to an increase in litigation-related loss contingency accrual expense.\nAdjusted SG&A expenses were $687 million for the fourth quarter of 2017 compared to $533 million for the fourth quarter of 2016. For full-year 2017, adjusted SG&A expenses were $2,279 million versus $2,139 million in 2016.\nCash, Cash Equivalents, and Marketable Securities\nOperating cash flow was $5,246 million for 2017, an increase of 26 percent compared to 2016. For the full-year 2017, Celgene purchased approximately $3,911 million of its common shares. As of December 31, 2017, the Company had $822 million remaining under the existing share repurchase program. The Company ended the year with $12,042 million in cash and marketable securities.\nCelgene Expects Volume-Driven Product Sales and Earnings Growth in 2018\nYear-over-Year\nChange\nTotal Revenue $14.4B to $14.8B 12% * REVLIMID ® Net Product Sales Approximately $9.4B 15% POMALYST ® / IMNOVID ® Net Product Sales Approximately $1.9B 18% OTEZLA ® Net Product Sales Approximately $1.5B 17% ABRAXANE ® Net Product Sales Approximately $1.0B 1% GAAP operating margin *** Approximately 46.5% N/M** Adjusted operating margin *** Approximately 60.0% ~ +200 bps Adjusted Tax Rate ~18% ~ +210 bps GAAP diluted EPS *** $7.26 to $7.66 N/M ** Adjusted diluted EPS *** $8.70 to $8.90 18% * Weighted average diluted shares 775M -34M *Year-over-year percentage change based on the mid-point of the range. **Not meaningful as the 2018 measures exclude the impact of any strategic transactions, impairments, loss contingencies, changes in the fair value of equity investments and non-operating tax adjustments that have not yet occurred. *** 2018 guidance does not include the impact of our recently announced pending acquisition of Juno Therapeutics Inc., which is expected to be dilutive to adjusted diluted EPS in 2018 by approximately $0.50. Product and Pipeline Updates\nHematology & Oncology\nAt the 59th American Society of Hematology (ASH) Annual Meeting in December, data were presented on Celgene’s marketed and pipeline hematology assets. Select data presentations included: Celgene and partner bluebird bio presented updated data from the phase I trial evaluating bb2121 in patients with relapsed and/or refractory multiple myeloma (RRMM). In November, bb2121 was granted Breakthrough Therapy Designation (BTD) by the U.S. Food and Drug Administration (FDA) and PRIority MEdicines (PRIME) eligibility by the European Medicines Agency (EMA). In December, the pivotal KarMMa™ trial evaluating bb2121 in RRMM was initiated. Celgene and partner Juno Therapeutics presented updated data from the phase I TRANSCEND trial evaluating JCAR017 in patients with relapsed or refractory aggressive non-Hodgkin lymphoma (NHL). The pivotal TRANSCEND program in the U.S. with JCAR017 in diffuse large B-cell lymphoma (DLBCL) is under way and the TRANSCEND WORLD cohort is on-track to initiate in the first half of 2018. Celgene and partner Acceleron Pharma presented updated data from the ongoing phase II trials with luspatercept in patients with lower-risk myelodysplastic syndromes (MDS). Data from the phase III MEDALIST ™ and BELIEVE ™ trials are expected in mid-2018. Additionally, Celgene plans to initiate the phase III COMMANDS ™ trial with luspatercept in front-line MDS during the first half of 2018. Updated data were presented from the phase Ib trial evaluating CC-122 in combination with obinutuzumab in patients with DLBCL, follicular lymphoma (FL) or marginal zone lymphoma (MZL). A pivotal program with CC-122 in NHL is expected to initiate in 2018. Updated data were presented from the phase I trial evaluating CC-486 in combination with rituximab plus chemotherapy (R-CHOP) in patients with DLBCL, FL or transformed lymphoma. Data from the phase III QUAZAR ® AML-001 trial evaluating CC-486 as maintenance therapy in post-induction acute myeloid leukemia (AML) is expected in the second half of 2018. Celgene and partner Agios Pharmaceuticals presented data from the phase I trial evaluating ivosidenib or IDHIFA ® combined with standard induction chemotherapy (7+3 regimen) in patients with newly diagnosed AML with an isocitrate dehydrogenase-1 (IDH1) or isocitrate dehydrogenase-2 (IDH2) mutation. In December, Celgene disclosed top-line results from the phase III RELEVANCE ® trial evaluating REVLIMID ® in combination with rituximab (R 2 ) in first-line FL. This investigational study evaluated REVLIMID ® plus R 2 followed by R 2 maintenance compared to the standard of care with rituximab plus chemotherapy (R-CHOP, R-bendamustine or R-CVP) followed by rituximab maintenance in patients with previously untreated FL. The R 2 treatment arm did not achieve superiority in the co-primary endpoints of complete response or unconfirmed complete response (CR/CRu) at 120 weeks and progression-free survival (PFS) during the pre-planned analysis (final analysis of CR/CRu and interim analysis of PFS). Neither arm was superior for either of the co-primary endpoints. The safety findings were consistent with the known profiles of the regimens investigated. The full data set will be presented at a future medical congress.\nInflammation & Immunology\nIn December, a New Drug Application (NDA) was submitted with the FDA for ozanimod in relapsing multiple sclerosis (RMS) based on data from the phase III RADIANCE ™ Part B and SUNBEAM ™ trials evaluating ozanimod in patients with RMS. The data were presented at the MSParis2017-7th Joint European Committee for Treatment and Research in Multiple Sclerosis (ECTRIMS)-American Committee for Treatment and Research in Multiple Sclerosis (ACTRIMS) Meeting in October. Celgene plans to submit a Marketing Authorization Application (MAA) with the EMA in the first quarter of 2018. A robust life-cycle plan for ozanimod is advancing and a phase III pivotal trial evaluating ozanimod in Crohn’s disease was initiated. In addition, the phase III TRUE NORTH ™ trial with ozanimod in ulcerative colitis (UC) is ongoing and on-track to complete enrollment in the second half of 2018. In 2018, Celgene plans to initiate a phase III trial with OTEZLA ® in UC based on the efficacy and safety results demonstrated in a phase II randomized, double-blind, placebo-controlled proof of concept study evaluating OTEZLA ® in UC (n=170). The full phase II data set will be presented at the 13th Congress of the European Crohn's and Colitis Organization (ECCO) in February.\nBusiness Update Summary\nIn January 2018, Celgene entered into an agreement to acquire Impact Biomedicines, Inc., a privately-held biotechnology company developing fedratinib, a highly selective JAK2 kinase inhibitor, for myelofibrosis and polycythemia vera.\nUnder the terms of the agreement, Celgene will pay approximately $1.1 billion upfront and up to $1.25 billion in contingent payments based on regulatory approval milestones for myelofibrosis. Additional future payments for regulatory approvals in additional indications and sales-based milestones are also possible. This acquisition will strengthen Celgene’s commitment to myelofibrosis, a disease with high unmet medical need, and will expand strategic development options within Celgene’s myeloid portfolio of assets. The transaction is expected to close in the first quarter of 2018. In January 2018, Celgene entered into an agreement to acquire Juno Therapeutics, Inc., an integrated biopharmaceutical company focused on developing innovative cellular immunotherapies for the treatment of cancer.\nUnder the terms of the merger agreement, Celgene will pay $87 per share in cash, or a total of approximately $9 billion, net of cash and marketable securities acquired and Juno shares already owned by Celgene (approximately 9.7% of outstanding shares). Adding to Celgene's lymphoma program, JCAR017 represents a potentially best-in-class CD19-directed CAR T currently in a pivotal program for relapsed and/or refractory DLBCL. This acquisition will complement Celgene’s leadership in hematology and oncology as well as advance Celgene’s global leadership in cellular immunotherapy.\nThe transaction is subject to customary closing conditions, including the tender of a number of shares of Juno common stock that represent at least a majority of outstanding shares, and expiration of the applicable waiting period under the Hart-Scott-Rodino Antitrust Improvements Act of 1976. Celgene expects to fund the transaction through a combination of existing cash and new debt. The transaction is expected to close in the first quarter of 2018.\nQ4 and Full-year 2017 Conference Call and Webcast Information\nCelgene will host a conference call to discuss the fourth quarter and full-year of 2017 operational and financial performance on Thursday, January 25, 2018, at 9 a.m. ET. The conference call will be available by webcast at www.celgene.com . An audio replay of the call will be available from noon January 25, 2018, until midnight ET February 1, 2018. To access the replay in the U.S., dial 1-855-859-2056; outside the U.S. dial 404-537-3406. The participant passcode is 2175246.\nAbout Celgene\nCelgene Corporation, headquartered in Summit, New Jersey, is an integrated global biopharmaceutical company engaged primarily in the discovery, development and commercialization of innovative therapies for the treatment of cancer and inflammatory diseases through next-generation solutions in protein homeostasis, immuno-oncology, epigenetics, immunology and neuro-inflammation. For more information, please visit www.celgene.com . Follow Celgene on Social Media: @Celgene , Pinterest , LinkedIn , Facebook and YouTube .\nForward-Looking Statement\nThis press release contains forward-looking statements, which are generally statements that are not historical facts. Forward-looking statements can be identified by the words \"expects,\" \"anticipates,\" \"believes,\" \"intends,\" \"estimates,\" \"plans,\" \"will,\" \"outlook\" and similar expressions. Forward-looking statements are based on management's current plans, estimates, assumptions and projections, and speak only as of the date they are made. We undertake no obligation to update any forward-looking statement in light of new information or future events, except as otherwise required by law. Forward-looking statements involve inherent risks and uncertainties, most of which are difficult to predict and are generally beyond our control. Actual results or outcomes may differ materially from those implied by the forward-looking statements as a result of the impact of a number of factors, many of which are discussed in more detail in our Annual Report on Form 10-K and our other reports filed with the Securities and Exchange Commission.\nThe tender offer described herein has not yet commenced. The description contained herein is for informational purposes only and is not an offer to buy or the solicitation of an offer to sell any shares of Juno. At the time the tender offer is commenced, Celgene and Blue Magpie Corporation (“Purchaser”) intend to file with the U.S. Securities and Exchange Commission (the “SEC”) a Tender Offer Statement on Schedule TO containing an offer to purchase, a form of letter of transmittal and other documents relating to the tender offer, and Juno intends to file a Solicitation/Recommendation Statement on Schedule 14D-9 with respect to the tender offer. Celgene, Purchaser and Juno intend to mail these documents to the stockholders of Juno. THESE DOCUMENTS, AS EACH MAY BE AMENDED OR SUPPLEMENTED FROM TIME TO TIME, WILL CONTAIN IMPORTANT INFORMATION ABOUT THE TENDER OFFER AND JUNO STOCKHOLDERS ARE URGED TO READ THEM CAREFULLY WHEN THEY BECOME AVAILABLE. STOCKHOLDERS OF JUNO WILL BE ABLE TO OBTAIN A FREE COPY OF THESE DOCUMENTS (WHEN THEY BECOME AVAILABLE) AND OTHER DOCUMENTS FILED BY JUNO, CELGENE OR PURCHASER WITH THE SEC AT THE WEBSITE MAINTAINED BY THE SEC AT WWW.SEC.GOV .\nHyperlinks are provided as a convenience and for informational purposes only. Celgene bears no responsibility for the security or content of external websites.\nUse of Non-GAAP Financial Measures\nIn addition to financial information prepared in accordance with U.S. GAAP, this document also contains certain non-GAAP financial measures based on management’s view of performance including:\nAdjusted research and development expense Adjusted selling, general and administrative expense Adjusted operating margin Adjusted net income Adjusted earnings per share\nManagement uses such measures internally for planning and forecasting purposes and to measure the performance of the Company. We believe these adjusted financial measures provide useful and meaningful information to us and investors because they enhance investors’ understanding of the continuing operating performance of our business and facilitate the comparison of performance between past and future periods. These adjusted financial measures are non-GAAP measures and should be considered in addition to, but not as a substitute for, the information prepared in accordance with U.S. GAAP. When preparing these supplemental non-GAAP financial measures we typically exclude certain GAAP items that management does not consider to be normal, recurring, cash operating expenses but that may not meet the definition of unusual or non-recurring items. Other companies may define these measures in different ways. The following categories of items are excluded from adjusted financial results:\nAcquisition and Divestiture-Related Costs: We exclude the impact of certain amounts recorded in connection with business combinations and divestitures from our adjusted financial results that are either non-cash or not normal, recurring operating expenses due to their nature, variability of amounts, and lack of predictability as to occurrence and/or timing. These amounts may include non-cash items such as the amortization of acquired intangible assets, amortization of purchase accounting adjustments to inventories, intangible asset impairment charges and expense or income related to changes in the estimated fair value measurement of contingent consideration. We also exclude transaction and certain other cash costs associated with business acquisitions and divestitures that are not normal recurring operating expenses, including severance costs which are not part of a formal restructuring program.\nShare-based Compensation Expense: We exclude share-based compensation from our adjusted financial results because share-based compensation expense, which is non-cash, fluctuates from period to period based on factors that are not within our control, such as our stock price on the dates share-based grants are issued.\nCollaboration-related Upfront Expenses: We exclude collaboration-related upfront expenses from our adjusted financial results because we do not consider them to be normal, recurring operating expenses due to their nature, variability of amounts, and lack of predictability as to occurrence and/or timing. Upfront payments to collaboration partners are made at the commencement of a relationship anticipated to continue for a multi-year period and provide us with intellectual property rights, option rights and other rights with respect to particular programs. The variability of amounts and lack of predictability of collaboration-related upfront expenses makes the identification of trends in our ongoing research and development activities more difficult. We believe the presentation of adjusted research and development, which does not include collaboration-related upfront expenses, provides useful and meaningful information about our ongoing research and development activities by enhancing investors’ understanding of our normal, recurring operating research and development expenses and facilitates comparisons between periods and with respect to projected performance. All expenses incurred subsequent to the initiation of the collaboration arrangement, such as research and development cost-sharing expenses/reimbursements and milestone payments up to the point of regulatory approval are considered to be normal, recurring operating expenses and are included in our adjusted financial results.\nResearch and Development Asset Acquisition Expense: We exclude costs associated with acquiring rights to pre-commercial compounds because we do not consider such costs to be normal, recurring operating expenses due to their nature, variability of amounts, and lack of predictability as to occurrence and/or timing. Research and development asset acquisition expenses includes expenses to acquire rights to pre-commercial compounds from a collaboration partner when there will be no further participation from the collaboration partner or other parties. The variability of amounts and lack of predictability of research and development asset acquisition expenses makes the identification of trends in our ongoing research and development activities more difficult. We believe the presentation of adjusted research and development, which does not include research and development asset acquisition expenses, provides useful and meaningful information about our ongoing research and development activities by enhancing investors’ understanding of our normal, recurring operating research and development expenses and facilitates comparisons between periods and with respect to projected performance.\nRestructuring Costs: We exclude costs associated with restructuring initiatives from our adjusted financial results. These costs include amounts associated with facilities to be closed, employee separation costs and costs to move operations from one location to another. We do not frequently undertake restructuring initiatives and therefore do not consider such costs to be normal, recurring operating expenses.\nCertain Other Items: We exclude certain other significant items that may occur occasionally and are not normal, recurring, cash operating expenses from our adjusted financial results. Such items are evaluated on an individual basis based on both the quantitative and the qualitative aspect of their nature and generally represent items that, either as a result of their nature or magnitude, we would not anticipate occurring as part of our normal business on a regular basis. While not all-inclusive, examples of certain other significant items excluded from adjusted financial results would be: impairment charges for significant fair value adjustments to equity investments, significant litigation-related loss contingency accruals and expenses to settle other disputed matters, and changes in the carrying value of our equity investments beginning in 2018.\nEstimated Tax Impact From Above Adjustments: We exclude the net income tax impact of the non-tax adjustments described above from our adjusted financial results. The net income tax impact of the non-tax adjustments includes the impact on both current and deferred income taxes and is based on the taxability of the adjustment under local tax law and the statutory tax rate in the tax jurisdiction where the adjustment was incurred.\nNon-Operating Tax Adjustments: We exclude the net income tax impact of certain other significant income tax items, which are not associated with our normal, recurring operations (“Non-Operating Tax Items”), from our adjusted financial results. Non-Operating Tax Items include items which may occur occasionally and are not normal, recurring operating expenses (or benefits), including adjustments related to acquisitions, divestitures, collaborations, certain adjustments to the amount of unrecognized tax benefits related to prior year tax positions, the impact of tax reform legislation commonly referred to as the Tax Cuts and Jobs Act, the impact resulting from intra-entity transfers of assets other than inventory beginning in 2018, and other similar items. We also exclude excess tax benefits and tax deficiencies that arise upon vesting or exercise of share-based payments recognized as income tax benefits or expenses due to their nature, variability of amounts, and lack of predictability as to occurrence and/or timing.\nLong-Term Targets\nA reconciliation of long-term adjusted financial targets to the most comparable GAAP measures cannot be provided because we are unable to forecast with reasonable certainty many of the items necessary to calculate such comparable GAAP measures, including share-based compensation expense, collaboration-related upfront expense, research and development asset acquisition expense, acquisition-related expenses, fair value adjustments to contingent consideration, the ultimate outcome of legal proceedings and unusual gains and losses, as well as unforeseen events, risks and developments. These items are uncertain, depend on various factors, and could be material to our results computed in accordance with GAAP. We believe the inherent uncertainties in reconciling our long-term non-GAAP measures to the most comparable GAAP measures would make the forecasted comparable GAAP measures nearly impossible to predict with reasonable certainty and therefore inherently unreliable.\nSee the attached Reconciliations of GAAP to Adjusted Net Income for explanations of the amounts excluded and included to arrive at the adjusted measures for the three- and twelve-month periods ended December 31, 2017 and 2016, and for the projected amounts for the twelve-month period ending December 31, 2018.\nCelgene Corporation and Subsidiaries Condensed Consolidated Statements of Operations (Unaudited) (In millions, except per share data) Three-Month Periods Ended Twelve-Month Periods Ended December 31, December 31, 2017 2016 2017 2016 Net product sales $ 3,479 $ 2,977 $ 12,973 $ 11,185 Other revenue 4 3 30 44 Total revenue 3,483 2,980 13,003 11,229 Cost of goods sold (excluding amortization of acquired intangible assets) 119 113 461 438 Research and development 2,738 1,135 5,915 4,470 Selling, general and administrative 774 685 2,941 2,658 Amortization of acquired intangible assets 79 105 329 459 Acquisition related (gains) charges and restructuring, net (1,425 ) 13 (1,350 ) 38 Total costs and expenses 2,285 2,051 8,296 8,063 Operating income 1,198 929 4,707 3,166 Interest and investment income, net 33 9 105 30 Interest (expense) (142 ) (127 ) (522 ) (500 ) Other income (expense), net 42 (312 ) 24 (324 ) Income before income taxes 1,131 499 4,314 2,372 Income tax provision 1,212 70 1,374 373 Net (loss) income $ (81 ) $ 429 $ 2,940 $ 1,999 Net (loss) income per common share: Basic $ (0.10 ) $ 0.55 $ 3.77 $ 2.57 Diluted $ (0.10 ) $ 0.53 $ 3.64 $ 2.49 Weighted average shares: Basic 773.5 776.8 779.2 777.2 Diluted 773.5 802.2 808.7 803.3 December 31, December 31, 2017 2016 Balance sheet items: Cash, cash equivalents & marketable securities $ 12,042 $ 7,970 Total assets 30,141 28,086 Long-term debt, including current portion 15,838 14,290 Total stockholders' equity 6,921 6,600 Celgene Corporation and Subsidiaries Reconciliation of GAAP to Adjusted Net Income (In millions, except per share data) Three-Month Periods Ended Twelve-Month Periods Ended December 31, December 31, 2017 2016 2017 2016 Net (loss) income - GAAP $ (81 ) $ 429 $ 2,940 $ 1,999 Before tax adjustments: Cost of goods sold (excluding amortization of acquired intangible assets): Share-based compensation expense (1) 7 8 29 33 Research and development: Share-based compensation expense (1) 68 64 268 253 Collaboration-related upfront expense (2) 96 128 765 816 Research and development asset acquisition expense (3) - 270 325 893 IPR&D asset impairment charge (4) 1,620 - 1,620 - Clinical trial & development activity wind-down charge (4) 188 - 188 - Selling, general and administrative: Share-based compensation expense (1) 87 83 347 320 Litigation-related loss contingency accrual expense (5) - 69 315 199 Amortization of acquired intangible assets (6) 79 105 329 459 Acquisition related (gains) charges and restructuring, net: Change in fair value of contingent consideration (7) (1,425 ) 9 (1,350 ) 22 Restructuring charges (8) - 3 - 16 Other income (expense), net: Impairment of equity investment (9) - 272 - 272 Income tax provision: Estimated tax impact from above adjustments (10) (299 ) (74 ) (686 ) (432 ) Non-operating tax adjustments (11) 1,252 (76 ) 926 (80 ) Net income - Adjusted $ 1,592 $ 1,290 $ 6,016 $ 4,770 Net income per common share - Adjusted Basic $ 2.06 $ 1.66 $ 7.72 $ 6.14 Diluted (12) $ 2.00 $ 1.61 $ 7.44 $ 5.94 Explanation of adjustments: (1) Exclude share-based compensation expense totaling $162 for the three-month period ended December 31, 2017 and $155 for the three-month period ended December 31, 2016. Exclude share-based compensation expense totaling $644 for the twelve-month period ended December 31, 2017 and $606 for the twelve-month period ended December 31, 2016. (2) Exclude upfront payment expense for research and development collaboration arrangements. (3) Exclude research and development asset acquisition expenses. (4) Exclude charges associated with the discontinuance of GED-0301 clinical trials in Crohn’s disease (Trials), including impairment of an IPR&D asset and other one-time charges related to wind-down costs associated with discontinuing the Trials and certain development activities. (5) Exclude loss contingency accrual expenses related to a civil litigation matter in 2017 and contractual dispute in 2016. (6) Exclude amortization of intangible assets acquired in the acquisitions of Pharmion Corp., Gloucester Pharmaceuticals, Inc. (Gloucester), Abraxis BioScience, Inc. (Abraxis), Celgene Avilomics Research, Inc. (Avila) and Quanticel Pharmaceuticals, Inc. (Quanticel). (7) Exclude changes in the fair value of contingent consideration related to the acquisitions of Gloucester, Abraxis, Avila, Nogra Pharma Limited (Nogra) and Quanticel, including the impact to the Nogra contingent consideration liabilities related to the discontinuance of the Trials. (8) Exclude restructuring charges related to our relocation of certain operations into our two Summit, NJ locations as well as costs associated with certain headcount reductions. (9) Fair value adjustment to our equity investment in Juno Therapeutics, Inc. (Juno) per ASC 320 \"Investments - Debt and Equity Securities.\" (10) Exclude the estimated tax impact of the above adjustments. (11) Exclude other non-operating tax expense items. The adjustments for the three-month period ended December 31, 2017 are to exclude expense of $1,269 as a result of the implementation of tax reform legislation (2017 Tax Act) and excess tax benefits related to the adoption of ASU 2016-09 (Compensation-Stock Compensation) of $17. The adjustments for the twelve-month period ended December 31, 2017 are to exclude expense of $1,269 as a result of the implementation of the 2017 Tax Act, excess tax benefits related to the adoption of ASU 2016-09 (Compensation-Stock Compensation) of $290, prior year tax benefits arising from a U.S. research and development and orphan drug tax credits study of $55 and to exclude other adjustments totaling tax expense of $2. The adjustments for the three- and twelve-month periods ended December 31, 2016 are to exclude the tax benefit of a tax loss incurred on our investment in Avila of $80 in both periods, with the three-month period also including other adjustments totaling tax expense of $4. (12) Diluted net income per share for the three-month period ended December 31, 2017 was determined using diluted weighted-average shares of 797.4 million. Celgene Corporation and Subsidiaries Reconciliation of Full-Year 2018 Projected GAAP to Adjusted Net Income (In millions, except per share data) Range Low High Projected net income - GAAP (1) $ 5,629 $ 5,934\nBefore tax adjustments: Cost of goods sold (excluding amortization of acquired intangible assets): Share-based compensation expense 30 27 Research and development: Share-based compensation expense 268 247 Research and development asset acquisition expense 1,115 1,115 Selling, general and administrative: Share-based compensation expense\n348 321 Amortization of acquired intangible assets 260 235 Acquisition related (gains) charges and restructuring, net:\nChange in fair value of contingent consideration 3 3 Other income (expense), net: Changes in fair value of equity investments (780 ) (780 ) Income tax provision: Estimated tax impact from above adjustments (130 ) (204 ) Non-operating tax adjustments - - Projected net income - Adjusted $ 6,743 $ 6,898 Projected net income per diluted common share - GAAP $ 7.26 $ 7.66 Projected net income per diluted common share - Adjusted $ 8.70 $ 8.90 Projected weighted average diluted shares 775.0 775.0 (1) Our projected 2018 earnings do not include the effect of any business combinations (including the effect of our recently announced pending acquisition of Juno), collaboration agreements, asset acquisitions, asset impairments, additional litigation-related loss contingency accruals, changes in the fair value of our CVRs issued as part of the acquisition of Abraxis, changes in the fair value of equity investments due to the adoption of ASU 2016-01 (Financial Instruments-Overall: Recognition and Measurement of Financial Assets and Financial Liabilities) or non-operating tax adjustments that may occur after the day prior to the date of this press release. Celgene Corporation and Subsidiaries Net Product Sales (In millions) Three-Month Periods Ended December 31, % Change 2017 2016 Reported Operational (1) Currency (2) REVLIMID ® U.S. $ 1,473 $ 1,187 24.1 % 24.1 % 0.0 % International 715 621 15.1 % 18.7 % (3.6 )% Worldwide 2,188 1,808 21.0 % 22.2 % (1.2 )% POMALYST ® /IMNOVID ® U.S. 283 219 29.2 % 29.2 % 0.0 % International 159 159 0.0 % 3.9 % (3.9 )% Worldwide 442 378 16.9 % 18.5 % (1.6 )% OTEZLA ® U.S. 303 268 13.1 % 13.1 % 0.0 % International 68 37 83.8 % 85.4 % (1.6 )% Worldwide 371 305 21.6 % 21.8 % (0.2 )% ABRAXANE ® U.S. 155 172 (9.9 )% (9.9 )% 0.0 % International 96 94 2.1 % 7.2 % (5.1 )% Worldwide 251 266 (5.6 )% (3.8 )% (1.8 )% IDHIFA ® (3) U.S. 13 - N/A N/A N/A International - - N/A N/A N/A Worldwide 13 - N/A N/A N/A VIDAZA ® U.S. 3 2 50.0 % 50.0 % 0.0 % International 160 151 6.0 % 10.3 % (4.3 )% Worldwide 163 153 6.5 % 10.7 % (4.2 )% azacitidine for injection U.S. 4 10 (60.0 )% (60.0 )% 0.0 % International - - N/A N/A N/A Worldwide 4 10 (60.0 )% (60.0 )% 0.0 % THALOMID ® U.S. 16 22 (27.3 )% (27.3 )% 0.0 % International 12 13 (7.7 )% (4.4 )% (3.3 )% Worldwide 28 35 (20.0 )% (18.7 )% (1.3 )% ISTODAX ® U.S. 16 19 (15.8 )% (15.8 )% 0.0 % International 2 2 0.0 % (1.9 )% 1.9 % Worldwide 18 21 (14.3 )% (14.5 )% 0.2 % All Other U.S. - - N/A N/A N/A International 1 1 N/A N/A N/A Worldwide 1 1 N/A N/A N/A Total Net Product Sales U.S. 2,266 1,899 19.3 % 19.3 % 0.0 % International 1,213 1,078 12.5 % 16.3 % (3.8 )% Worldwide $ 3,479 $ 2,977 16.9 % 18.3 % (1.4 )% (1) Operational includes impact from both volume and price (2) Currency includes the impact from both foreign exchange rates and hedging activities (3) IDHIFA ® was approved in August 2017 in the U.S. for the treatment of adult patients with R/R AML with an isocitrate dehydrogenase-2 (IDH2) mutation as detected by an FDA approved test.\nCelgene Corporation and Subsidiaries Net Product Sales (In millions) Twelve-Month Periods Ended December 31, % Change 2017 2016 Reported Operational (1) Currency (2) REVLIMID ® U.S. $ 5,426 $ 4,417 22.8 % 22.8 % 0.0 % International 2,761 2,557 8.0 % 10.2 % (2.2 )% Worldwide 8,187 6,974 17.4 % 18.2 % (0.8 )% POMALYST ® /IMNOVID ® U.S. 1,008 778 29.6 % 29.6 % 0.0 % International 606 533 13.7 % 16.9 % (3.2 )% Worldwide 1,614 1,311 23.1 % 24.4 % (1.3 )% OTEZLA ® U.S. 1,058 904 17.0 % 17.0 % 0.0 % International 221 113 95.6 % 94.3 % 1.3 % Worldwide 1,279 1,017 25.8 % 25.7 % 0.1 % ABRAXANE ® U.S. 607 634 (4.3 )% (4.3 )% 0.0 % International 385 339 13.6 % 17.5 % (3.9 )% Worldwide 992 973 2.0 % 3.4 % (1.4 )% IDHIFA ® (3) U.S. 20 - N/A N/A N/A International - - N/A N/A N/A Worldwide 20 - N/A N/A N/A VIDAZA ® U.S. 8 12 (33.3 )% (33.3 )% 0.0 % International 620 596 4.0 % 6.6 % (2.6 )% Worldwide 628 608 3.3 % 5.9 % (2.6 )% azacitidine for injection U.S. 35 66 (47.0 )% (47.0 )% 0.0 % International 1 - N/A N/A N/A Worldwide 36 66 (45.5 )% (45.5 )% 0.0 % THALOMID ® U.S. 80 97 (17.5 )% (17.5 )% 0.0 % International 52 55 (5.5 )% (2.7 )% (2.8 )% Worldwide 132 152 (13.2 )% (12.2 )% (1.0 )% ISTODAX ® U.S. 67 72 (6.9 )% (6.9 )% 0.0 % International 9 8 12.5 % 10.3 % 2.2 % Worldwide 76 80 (5.0 )% (5.2 )% 0.2 % All Other U.S. 1 1 N/A N/A N/A International 8 3 N/A N/A N/A Worldwide 9 4 N/A N/A N/A Total Net Product Sales U.S. 8,310 6,981 19.0 % 19.0 % 0.0 % International 4,663 4,204 10.9 % 13.2 % (2.3 )% Worldwide $ 12,973 $ 11,185 16.0 % 16.9 % (0.9 )% (1) Operational includes impact from both volume and price (2) Currency includes the impact from both foreign exchange rates and hedging activities (3) IDHIFA ® was approved in August 2017 in the U.S. for the treatment of adult patients with R/R AML with an isocitrate dehydrogenase-2 (IDH2) mutation as detected by an FDA approved test.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180125005562/en/\nCelgene Corporation\nInvestors:\nPatrick E. Flanigan III, 908-673-9969\nCorporate Vice President\nInvestor Relations\nor\nMedia:\nBrian P. Gill, 908-673-9530\nVice President\nCorporate Communications\nSource: Celgene Corporation", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.facebook.com%2FCelgene&esheet=51748721&newsitemid=20180125005562&lan=en-US&anchor=Facebook&index=6&md5=35b16aeaf0276e92c1dc632e70a2cf10", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Fcelgene&esheet=51748721&newsitemid=20180125005562&lan=en-US&anchor=LinkedIn&index=5&md5=d158fb21172bbbd5bd251fc738fb7738", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.pinterest.com%2Fcelgene%2F&esheet=51748721&newsitemid=20180125005562&lan=en-US&anchor=Pinterest&index=4&md5=39d30b07e61a7c1b54eacb5f9ef1fe7d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2FWWW.SEC.GOV&esheet=51748721&newsitemid=20180125005562&lan=en-US&anchor=WWW.SEC.GOV&index=8&md5=7dabb08fc2894352fe25737ee1db27c7", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.celgene.com%2F&esheet=51748721&newsitemid=20180125005562&lan=en-US&anchor=www.celgene.com&index=2&md5=58c3cebd8185b81ec831335840443647", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.celgene.com&esheet=51748721&newsitemid=20180125005562&lan=en-US&anchor=www.celgene.com&index=1&md5=01ea5c355b2672fbfe4f694af3ebb256", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2Fcelgene&esheet=51748721&newsitemid=20180125005562&lan=en-US&anchor=%40Celgene&index=3&md5=ae66fa5021fe94c1ad07724a94fe1fd6", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.youtube.com%2Fcelgene&esheet=51748721&newsitemid=20180125005562&lan=en-US&anchor=YouTube&index=7&md5=71b64ac1dce0a5abb698d45fe08458db", "http://www.businesswire.com/news/home/20180125005562/en/"], "published": "2018-01-25T15:30:00.000+02:00", "crawled": "2018-01-25T16:59:26.017+02:00", "highlightTitle": ""}