{"organizations": [], "uuid": "fabde65ea04f699ec20c58c8fe7f8495c4ba0b63", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225124055&w=1200&r=LYNXMPEE0O0R4", "site_section": "http://www.reuters.com/resources/archive/us/20180125.html", "section_title": "Archive News &amp; Video for Thursday, 25 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-germany-politics/merkels-bloc-rules-out-immigration-concessions-on-eve-of-talks-with-spd-idUSKBN1FE1H6", "country": "US", "domain_rank": 408, "title": "Merkel's bloc rules out immigration concessions on eve of talks with SPD", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T19:44:00.000+02:00", "replies_count": 0, "uuid": "fabde65ea04f699ec20c58c8fe7f8495c4ba0b63"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-germany-politics/merkels-bloc-rules-out-immigration-concessions-on-eve-of-talks-with-spd-idUSKBN1FE1H6", "ord_in_thread": 0, "title": "Merkel's bloc rules out immigration concessions on eve of talks with SPD", "locations": [], "entities": {"persons": [{"name": "merkel", "sentiment": "negative"}, {"name": "angela merkel", "sentiment": "negative"}, {"name": "julia kloeckner", "sentiment": "none"}, {"name": "horst seehofer", "sentiment": "none"}, {"name": "martin schulz", "sentiment": "none"}], "locations": [{"name": "germany", "sentiment": "none"}], "organizations": [{"name": "spd berlin", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "csu", "sentiment": "none"}, {"name": "spd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BERLIN (Reuters) - Senior members of Chancellor Angela Merkel’s conservative bloc said on Thursday they would not give ground to the Social Democrats (SPD) on immigration as the two parties prepare to launch make-or-break negotiations on forming a government.\nThe SPD voted by a whisker on Sunday to start coalition talks with the conservatives, but many members are skeptical about a re-run of the “grand coalition” that has ruled Germany since 2013. The SPD got its worst election result in the post-war era in September and many members fear a further fall in votes.\nImmigration will be one of the most controversial issues in the talks, with the conservatives keen to take a tough line to prevent further losses to the far-right Alternative for Germany (AfD) while the SPD takes a more migrant-friendly approach.\nMerkel, SPD leader Martin Schulz and Horst Seehofer, leader of the CSU Bavarian conservatives, are due to meet at 0800 GMT on Friday morning to kick off coalition talks after four months of political deadlock since a Sept. 24 election.\nJulia Kloeckner, deputy of Merkel’s Christian Democrats (CDU), said the benchmark of 180,000 to 220,000 refugees per year laid out in a coalition blueprint agreed between the parties after exploratory talks earlier this month was crucial.\n“We don’t want more immigration and certainly not uncontrolled immigration - the Jusos must accept that,” Kloeckner told Focus magazine, responding to the SPD’s youth wing, which dismisses the benchmark as being equivalent to a migrant cap and opposes a repeat of the grand coalition.\nDorothee Baer, deputy chair of Merkel’s Bavarian CSU allies, said her party could not give the SPD any concessions on family reunification for refugees, with all possible wiggle room for this exploited during exploratory talks.\nShe told broadcaster ARD the parties had already negotiated that issue, adding: “We won’t reopen issues that have already been negotiated.”\nThe coalition blueprint said the parties would cap at 1,000 a month the number of people allowed to join their family now living as refugees in Germany. But the SPD wants to add a “hardship provision” to that.\nThe SPD was meeting on Thursday to prepare for the coalition negotiations that are expected to last for around two weeks.\nOn her way into that meeting, senior SPD member Manuela Schwesig said: “We want to have good, detailed negotiations now. They need to be swift but we also need to take the time we need so something good comes out of it.”\nThe aim is to strike a deal before the carnival season gets underway in earnest on Feb. 8 and some regions take public holidays. A new government is expected to be place by Easter but that is dependent on the SPD getting backing from its 443,000 members who will vote on a final deal.\nThe SPD is facing strong internal opposition and new members are flocking to the party in the hope they can reject a renewed coalition in that vote.\nKevin Kuehnert, head of the Jusos who is spearheading attempts to prevent a grand coalition, told broadcaster n-tv: “We’ve had some extremely bad experiences working with the conservatives.”\nHe added that some of the projects laid out in the coalition blueprint had already been agreed on by the parties in 2013 but not carried out during the last legislative period.\nAdditional reporting by Reuters Television, Holger Hansen, Thorsten Severin and Andreas Rinke; Writing by Michelle Martin; Editing by Alison Williams\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T19:44:00.000+02:00", "crawled": "2018-01-26T21:41:36.001+02:00", "highlightTitle": ""}