{"organizations": [], "uuid": "bc9988cacbff410b43bd540a23c9deffb2335dce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.topix.com/rss/wire/world/europe", "section_title": "", "url": "https://www.reuters.com/article/us-portugal-politics-psd/portugals-struggling-opposition-party-elects-new-leader-idUSKBN1F30HY", "country": "US", "domain_rank": 408, "title": "Portugal's struggling opposition party elects new leader", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T15:25:00.000+02:00", "replies_count": 0, "uuid": "bc9988cacbff410b43bd540a23c9deffb2335dce"}, "author": "", "url": "https://www.reuters.com/article/us-portugal-politics-psd/portugals-struggling-opposition-party-elects-new-leader-idUSKBN1F30HY", "ord_in_thread": 0, "title": "Portugal's struggling opposition party elects new leader", "locations": [], "entities": {"persons": [{"name": "rui rio", "sentiment": "none"}, {"name": "andrei khalip", "sentiment": "none"}, {"name": "pedro passos coelho", "sentiment": "none"}, {"name": "pedro santana lopes", "sentiment": "none"}], "locations": [{"name": "portugal", "sentiment": "none"}, {"name": "porto", "sentiment": "none"}], "organizations": [{"name": "min read  lisbon", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LISBON (Reuters) - Portugal’s main opposition Social Democrats have elected Rui Rio, former mayor of the country’s second-largest city of Porto, as their new leader who will face the daunting task of boosting the center-right party’s lowly ratings ahead of a 2019 election.\nRio, 60, replaces former Prime Minister Pedro Passos Coelho, whose center-right government imposed painful austerity measures under the terms of an international bailout in 2011-14, which helped the debt-laden country emerge from its economic and debt crisis. He stepped down as party leader after two terms.\nRio, an economist who was a popular mayor for three terms in 2001-2013, beat former premier Pedro Santana Lopes to the party leadership on Saturday night, by 54 to 46 percent.\nIn his victory speech, he said he wanted to build “an alternative government to the current leftist front that has formed in parliament... capable of providing more stable and courageous governance to confront the country’s major structural problems”.\nDespite the unpopular austerity, the Social Democratic Party (PSD) won the most votes in the last parliamentary election in 2015, but fell short of a majority even jointly with their allies to form a second-term government.\nAs a result, a minority Socialist government took over, backed by the two far-left parties in parliament.\nThe administration has reversed most of the austerity measures while promoting growth and sticking to budget discipline, which allowed it to post the lowest deficit in Portugal’s democratic history last year.\nSince the election, the Socialists have long overtaken the PSD in opinion polls, with the latter dropping to 26-28 percent of voting intentions from 37 percent in the ballot. The Socialists are on 40 percent according to most polls.\nWith the economy in its best growth cycle in a decade, analysts see few chances for the PSD to win in 2019, saying that the opposition party, which has done little lately but criticize the administration, needs new ideas and has to focus on not losing more support to preserve its political relevance.\nDuring his campaign, Rio sounded a conciliatory tone, arguing that the PSD should allow the Socialists to govern if they win the next election without parliament majority, while expecting reciprocity in case of a PSD win.\nIn his victory speech he did not refer to such hypotheses, but said he wanted the party to be “a firm and watchful opposition, but never demagogical and populist, never against the national interest”.\nReporting by Andrei Khalip; Editing by Dale Hudson\n ", "external_links": [], "published": "2018-01-14T15:25:00.000+02:00", "crawled": "2018-01-14T16:02:55.000+02:00", "highlightTitle": ""}