{"organizations": [], "uuid": "6d4f5aec8a86ca50ac6a7af2d0d1bb344504d8c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 62, "shares": 62, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews/", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-indonesia-stock-exchange/people-evacuated-from-indonesia-stock-exchange-after-reports-of-collapsed-structure-metro-tv-idUKKBN1F40FP", "country": "US", "domain_rank": 408, "title": "People evacuated from Indonesia Stock Exchange after reports of collapsed structure - Metro TV", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T07:42:00.000+02:00", "replies_count": 0, "uuid": "6d4f5aec8a86ca50ac6a7af2d0d1bb344504d8c5"}, "author": "", "url": "https://uk.reuters.com/article/uk-indonesia-stock-exchange/people-evacuated-from-indonesia-stock-exchange-after-reports-of-collapsed-structure-metro-tv-idUKKBN1F40FP", "ord_in_thread": 0, "title": "People evacuated from Indonesia Stock Exchange after reports of collapsed structure - Metro TV", "locations": [], "entities": {"persons": [{"name": "kanupriya kapoor", "sentiment": "none"}, {"name": "fransiska nangoy", "sentiment": "none"}], "locations": [{"name": "jakarta", "sentiment": "none"}, {"name": "jakarta", "sentiment": "none"}], "organizations": [{"name": "indonesia stock exchange", "sentiment": "negative"}, {"name": "metro tv", "sentiment": "negative"}, {"name": "alpino kianjaya", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "metro tv reuters", "sentiment": "none"}, {"name": "starbucks", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 5:44 AM / Updated an hour ago Scores injured as Indonesia stock exchange building lobby floor collapses Agustinus Beo Da Costa , Fergus Jensen 3 Min Read \nJAKARTA (Reuters) - A mezzanine floor overlooking the main lobby of the Indonesian Stock Exchange building collapsed on Monday, injuring scores of people, many of them students, under slabs of concrete and other debris, officials and witnesses said. Ambulances are seen following reports of a collapsed structure inside the Indonesian Stock Exchange building in Jakarta, Indonesia, January 15, 2018. REUTERS/Darren Whiteside \nThe high-rise building, constructed in the late 1990s, is part of a two-tower complex also housing offices of the World Bank and the International Finance Corporation. It was the target of a car bombing by Islamist militants in September 2000. \nPolice ruled out a bomb as a cause of Monday’s collapse. They said at least 77 people had been injured. \nNo deaths had been reported, said Triana Tambunan, business development manager at MRCC Siloam hospital, one of the hospitals near the stock exchange. \n“Up to now we’ve registered 30 people,” Tambunan told reporters. \n“The bone fractures may be serious. We need to carry out further evaluations,” she said, adding there were at least three suspected fractures. \nSafety standards are often loosely enforced in Indonesia. Last year, a fire that ripped through a fireworks factory on the outskirts of Jakarta killed around 50 people in one of the country’s worst industrial accidents. A police investigation found multiple safety violations. FILE PHOTO: A view of the Indonesia Stock Exchange building in Jakarta, Indonesia June 23, 2016. REUTERS/Iqro Rinaldi/File Photo \nPolice cordoned off the complex as people fled the building, and the injured, including visiting university students, were taken away by stretcher. \nStock exchange president director Tito Sulistio said their treatment would be paid for by the exchange. Injured people are treated outside the Indonesian Stock Exchange building following reports of a collapsed structure inside the building in Jakarta, Indonesia January 15, 2018. REUTERS/Darren Whiteside \nImages aired on television and circulated on social media showed a concrete and metal structure that had collapsed around a Starbucks cafe near the entrance to the lobby of the building with blue-tinted windows. \n“The second floor of the building has collapsed,” said Vindy, a personal assistant to Sulistio, who was in the building at the time. \n“Slabs of concrete started to fall, there was lots of dust. Water pipes had burst,” said Megha Kapoor, who works in the building and was in the lobby at the time. \n“I heard a loud cracking sound. I saw a lady unconscious stuck under a slab of concrete,” she said, adding that the collapsed level was just above the reception desk. \nFinance Minister Sri Mulyani Indrawati said she hoped the collapse would not affect investor confidence in the tropical Southeast Asian archipelago. The exchange resumed business in the afternoon as per schedule. Additing reporting by Cindy Silviana, Kanupriya Kapoor, Maikel Jefriando and Fransiska Nangoy; Writing by Ed Davies; Editing by Nick Macfie", "external_links": [], "published": "2018-01-15T07:42:00.000+02:00", "crawled": "2018-01-15T08:11:24.004+02:00", "highlightTitle": ""}