{"organizations": [], "uuid": "af3b97c3a4ea2b686f9c2a7a11b6645b79a243dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226327835&w=1200&r=LYNXMPEE0S143", "site_section": "http://feeds.reuters.com/reuters/INtopNews\r", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/uk-britain-eu-ministers/eu-warns-britain-their-divorce-is-not-yet-resolved-idINKBN1FI1VF", "country": "US", "domain_rank": 408, "title": "EU warns Britain their divorce is not yet resolved", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T17:04:00.000+02:00", "replies_count": 0, "uuid": "af3b97c3a4ea2b686f9c2a7a11b6645b79a243dd"}, "author": "", "url": "https://in.reuters.com/article/uk-britain-eu-ministers/eu-warns-britain-their-divorce-is-not-yet-resolved-idINKBN1FI1VF", "ord_in_thread": 0, "title": "EU warns Britain their divorce is not yet resolved", "locations": [], "entities": {"persons": [{"name": "ekaterina zaharieva", "sentiment": "none"}, {"name": "gabriela baczynska", "sentiment": "none"}, {"name": "londo", "sentiment": "none"}, {"name": "michel barnier", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "bulgaria", "sentiment": "none"}, {"name": "eu brexit", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  brussels", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BRUSSELS (Reuters) - The European Union on Monday denied Britain any vote on EU policy issues during its transition out of the bloc and warned London not to fall behind on outstanding divorce matters.\nBritain is set to leave the EU in March 2019 and the remaining 27 member states have now prepared their joint stance on what they expect of London during a transition period until the end of 2020.\nBritish Prime Minister Theresa May has come under fire over her Brexit strategy again in recent days, with rivals criticising her for largely accepting the EU push for a status quo transition during which, however, London would not have any vote on EU affairs.\nEU ministers took just two minutes endorse a position drafted by European Commission officials to offer Britain a 21-month transition period during which it would follow all EU rules but “without institutional representation”.\n“I think it is rather difficult... If you leave, you leave,” Italy’s EU affairs minister, Sandro Gozzi, said before 27 ministers meeting in Brussels agreed the transition mandate for their negotiator, Michel Barnier.\n“If you decided democratically to get out of the decision-making process, as Britain decided to do with (its 2016) referendum, then you can’t be in the decision-making process,” Gozzi said.\nCOLLISION COURSE? Negotiators may be on a collision course as Britain’s Brexit Minister David Davis said London wanted to have a say over EU laws passed during the transition out of the bloc.\nBulgaria's Foreign Minister Ekaterina Zaharieva and French Minister attached to the Foreign Affairs Minister, Nathalie Loiseau attend a meeting of European Union Home/European affairs ministers in Brussels, Belgium January 29, 2018. REUTERS/Francois Lenoir “The sooner the Brits are clear about the future, it would be better for everyone... The more the transition is similar to the current situation, the better for everybody. We have to use our time and energy not in shaping the transition but in shaping the future relationship,” Gozzi said.\nThe ministers also warned London should not take for granted the settlement of Britain’s divorce package with the EU, with outstanding issues involving the EU nuclear agency Euratom, customs arrangements, and protection of personal data.\nEuropean Union's chief Brexit negotiator Michel Barnier arrives to attend a meeting of European Union Home/European affairs ministers in Brussels, Belgium January 29, 2018. REUTERS/Francois Lenoir The EU said in December that “sufficient progress” was made in the divorce talks to launch parallel transition negotiations.\nBut it says they can go on only as long as London swiftly puts what has already been agreed into legal texts, especially on safeguarding the rights of some three million EU citizens in Britain, and on the Irish border conundrum.\n“Before Christmas there was an agreement that ... there would be full regulatory alignment on the island of Ireland,” said Helen McEntee, Ireland’s minister of state for EU affairs. “We’re obviously keen to see what that will look like.”\nRelated Coverage Britain must be bound by EU changes during transition - EU's Barnier Britain welcomes EU agreement on transition terms Britain has said it wants out of the EU’s single market and customs union while keeping an open border between its province of Northern Ireland and the Irish Republic, an apparent contradiction that has yet to be fully addressed.\nWhile the bloc is open in principle to extending Britain’s transition period, the ministers made clear they did not want to get stuck in protracted trade negotiations to fix London’s future relationship with the bloc.\n“I don’t think that there is any good thing in having a too-prolonged transition arrangement. I think it’s very important that we come to a new agreement as soon as possible,” said Sweden’s EU affairs minister, Ann Linde.\nAdditional reporting by Robert-Jan Bartunek, Samantha Koester, Philip Blenkinsop and Alastair Macdonald; editing by Mark Heinrich\n ", "external_links": [], "published": "2018-01-29T17:04:00.000+02:00", "crawled": "2018-01-29T17:37:51.002+02:00", "highlightTitle": ""}