{"organizations": [], "uuid": "663791cde6b018419264c13cf5801101d40a17b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/sri-lanka-stocks/sri-lankan-shares-climb-to-near-7-week-high-keells-leads-idUSL4N1P3365", "country": "US", "domain_rank": 408, "title": "Sri Lankan shares climb to near 7-week high; Keells leads", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T13:35:00.000+02:00", "replies_count": 0, "uuid": "663791cde6b018419264c13cf5801101d40a17b1"}, "author": "", "url": "https://www.reuters.com/article/sri-lanka-stocks/sri-lankan-shares-climb-to-near-7-week-high-keells-leads-idUSL4N1P3365", "ord_in_thread": 0, "title": "Sri Lankan shares climb to near 7-week high; Keells leads", "locations": [], "entities": {"persons": [{"name": "kee", "sentiment": "negative"}, {"name": "keells", "sentiment": "negative"}, {"name": "dimantha mathew", "sentiment": "none"}], "locations": [{"name": "colombo", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "john keells holdings plc", "sentiment": "none"}, {"name": "first capital holdings", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 11:35 AM / Updated 41 minutes ago Sri Lankan shares climb to near 7-week high; Keells leads Reuters Staff 3 Min Read \nCOLOMBO, Jan 8 (Reuters) - Sri Lankan shares rose on Monday to a near seven-week high as blue chip shares such as John Keells Holdings Plc gained, while foreign investors continued to buy the island nation’s risky assets. \nThe Colombo Stock Index ended 0.4 percent firmer at 6,540.51, its highest close since Nov. 10. \nThe bourse rose 2.3 percent last week, in its second straight weekly gain. \nForeign buying accounted for 61.2 percent of the day’s turnover of 1.7 billion rupees. \nForeign investors net bought shares worth 33.9 million Sri Lankan rupees ($220,559.53) on Monday, extending the net foreign inflow in this year to 2.0 billion rupees. \nThey had net bought 18.5 billion rupees worth equities in 2017 and 633.5 million rupees in 2016. \n“The buying interest is continuing as investors are quite bullish,” said Dimantha Mathew, head of research at First Capital Holdings. \n“There was a lot of foreign trading and investors are buying blue chip shares like John Keells. We expect the market to settle at 6,600 levels and there could be some profit-taking at those levels.” \nShares in conglomerate John Keells Holdings Plc rose 3.1 percent, Nestle Lanka Plc gained 3.5 percent and Lion Brewery Plc climbed 4.6 percent. \nAnalysts said the positive trend will continue due to declining market interest rates. \nTreasury bill rates fell 188 basis points to 216 basis points between March and end-December 2017, mainly driven by foreign buying in treasury bonds, resulting in declining market interest rates. \nThe country’s 2018 economic growth trajectory is likely to help boost market sentiment, analysts said. \nSri Lanka’s economic growth in 2018 is forecast at 5-5.5 percent, against an anticipated four-year low of less than 4 percent last year, central bank Governor Indrajit Coomaraswamy said on Wednesday. \nThe central bank kept its benchmark interest rates unchanged last week, saying inflation and private sector credit growth have cooled to manageable levels as policy makers focus on supporting a slowing economy. ($1 = 153.7000 Sri Lankan rupees) (Reporting by Ranga Sirilal and Shihar Aneez; Editing by Vyas Mohan)", "external_links": [], "published": "2018-01-08T13:35:00.000+02:00", "crawled": "2018-01-08T14:31:09.000+02:00", "highlightTitle": ""}