{"organizations": [], "uuid": "013181baea47de3f2ae7befc5191afa6477682bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/business-wire-apartment-list-secures-50-million-series-c-funding-to-take-over-u-s-rental-market.html", "country": "US", "domain_rank": 767, "title": "Apartment List Secures $50 Million Series C Funding To Take Over U.S. Rental Market", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-18T15:30:00.000+02:00", "replies_count": 0, "uuid": "013181baea47de3f2ae7befc5191afa6477682bb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/business-wire-apartment-list-secures-50-million-series-c-funding-to-take-over-u-s-rental-market.html", "ord_in_thread": 0, "title": "Apartment List Secures $50 Million Series C Funding To Take Over U.S. Rental Market", "locations": [], "entities": {"persons": [{"name": "chris erickson", "sentiment": "none"}, {"name": "john kobs", "sentiment": "none"}, {"name": "john burbank", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "san franc", "sentiment": "none"}], "organizations": [{"name": "allen & company llc", "sentiment": "none"}, {"name": "industry ventures", "sentiment": "none"}, {"name": "quantum partners lp", "sentiment": "none"}, {"name": "isco", "sentiment": "none"}, {"name": "tenaya capital", "sentiment": "none"}, {"name": "soros fund management llc", "sentiment": "none"}, {"name": "canaan partners", "sentiment": "none"}, {"name": "matrix partners", "sentiment": "none"}, {"name": "board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Leading Marketplace Grows to Capture 10% of all Rentals; Plans to Double Headcount in 2018\nSAN FRANCISCO--(BUSINESS WIRE)-- Apartment List, the fastest growing rental marketplace, today announced it has raised $50 million in Series C funding. John Burbank, Founder of Passport Capital, led the round and will join the company’s Board of Directors. The financing, which brings Apartment List’s total funding to $110 million, included participation from Allen & Company LLC, Canaan Partners, Industry Ventures, Matrix Partners, Quantum Partners LP, a private investment fund managed by Soros Fund Management LLC, Tenaya Capital, and WTI.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180118005377/en/\nApartment List Co-Founders: CEO John Kobs and COO Chris Erickson (Photo: Business Wire)\n“Apartment List exists to make sure renters have an equal place in today’s housing market,” said John Kobs, CEO and co-founder of Apartment List. “Renters deserve the same personalized, seamless, white-glove experience that buyers get. We’re innovating our marketplace and scaling our business to help people make better, smarter decisions about where they live and we won't stop until we've won this market. This investment brings us one step closer to that goal.”\nIn the last year, Apartment List has grown the number of properties on its marketplace by 50 percent and now powers nearly 4 million listings or 10 percent of U.S. rentals today. The company will use the new funding to expand its market share by growing its property inventory to include smaller apartment buildings and single-family homes in addition to its current footprint of large apartment communities. In 2018, the company expects to double its headcount.\n“Today’s rental market is experiencing a major shift, as more and more people delay homeownership. There is a huge opportunity to capitalize on this underserved segment,” said John Burbank, Founder of Passport Capital. “Apartment List is the most innovative and user-focused platform for renters today. I look forward to working closely with John, Chris and the entire team as they grow and scale their business.\"\nApartment List is changing how people find a place to live by offering a highly customized experience that is built on personal priorities: renters are informed of new listings based on desired amenities and real-time price shifts while booking tours and communicating directly with landlords within the platform. Unlike other rental platforms, landlords only pay Apartment List when a lease is signed, saving them time and money.\n“We expect to help 1 out of every 64 renters that move this year in the U.S. find a home,” said Chris Erickson, COO and co-founder of Apartment List. “By listening to the needs of renters, we plan continue improving the overall renting experience from first search to lease signing.”\nLast year, Apartment List more than doubled the number of leases signed on its platform. The company also recently announced a number of notable partnerships to expand its reach, including a major partnership with Facebook Marketplace to power rental listings on the site as well as exclusive partnerships with realtor.com®, Homes.com and Doorsteps.com®.\nAbout Apartment List\nApartment List is the fastest-growing online apartment rental marketplace on a mission to make finding a home an easy and delightful process. The company currently has over four million units on the platform and has reached more than 150 million users in over 40 cities since launch. Since inception, Apartment has raised $110M in funding from investors including Allen & Company LLC, Canaan Partners, Industry Ventures, Matrix Partners, Passport Capital, Quantum Partners LP, a private investment fund managed by Soros Fund Management LLC, Tenaya Capital, and WTI. Apartment List launched in September 2011 and was founded by CEO John Kobs and COO Chris Erickson. The company has been named one of Forbes’ “Top 25 Most Promising Companies” and one of Inc.’s “Fastest Growing Private Companies in the U.S.” Learn more at www.apartmentlist.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180118005377/en/\nContact SutherlandGold for Apartment List\nKatie Warmuth\npr@apartmentlist.com\nSource: Apartment List", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.apartmentlist.com&esheet=51745052&newsitemid=20180118005377&lan=en-US&anchor=www.apartmentlist.com&index=1&md5=6804871ef6b60f84d95c7b743f7071a0", "http://www.businesswire.com/news/home/20180118005377/en/"], "published": "2018-01-18T15:30:00.000+02:00", "crawled": "2018-01-18T16:28:55.003+02:00", "highlightTitle": ""}