{"organizations": [], "uuid": "14cdf0b8621dd1f79856313949e1fe4049c20c1f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/12/gettyimages-6477264381.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/23/elon-musk-boring-company-transit-tunnels-under-los-angeles/", "country": "US", "domain_rank": 1196, "title": "Elon Musk's Boring Company Proposes Public Transit Tunnels Under LA | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.53, "site_type": "news", "published": "2018-01-23T02:00:00.000+02:00", "replies_count": 0, "uuid": "14cdf0b8621dd1f79856313949e1fe4049c20c1f"}, "author": "Sarah Gray", "url": "http://fortune.com/2018/01/23/elon-musk-boring-company-transit-tunnels-under-los-angeles/", "ord_in_thread": 0, "title": "Elon Musk's Boring Company Proposes Public Transit Tunnels Under LA | Fortune", "locations": [], "entities": {"persons": [{"name": "hawthorne", "sentiment": "none"}, {"name": "ng tesla", "sentiment": "none"}, {"name": "jehn balajadia", "sentiment": "none"}], "locations": [{"name": "west los angeles", "sentiment": "none"}, {"name": "culver city", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "sepulveda boulevard", "sentiment": "none"}], "organizations": [{"name": "elon musk", "sentiment": "negative"}, {"name": "elon musk's boring company proposes public transit tunnels under la | fortune by sarah gray", "sentiment": "neutral"}, {"name": "spacex", "sentiment": "none"}, {"name": "musk’s boring company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Sarah Gray January 23, 2018 \nElon Musk’s name is synonymous with ambitious transportation including Tesla’s electric vehicles and SpaceX’s reusable rockets. On Monday, one of his companies presented a plan for yet a third way of getting around—shuttling cars at race track speeds through tunnels beneath Los Angeles. \nJehn Balajadia, from Musk’s Boring Company, “proposed a privately funded human transportation tunnel that would run underneath the Westside of Los Angeles,” according to the municipal government of Culver City, near Los Angeles. \nThe proposed 6.5 mile-long tunnel would connect Hawthorne, home to SpaceX, to West Los Angeles, under Sepulveda Boulevard and through Culver City. The goal is to alleviate Los Angeles’ notorious traffic, according to the city. \n“Electric skates will carry between 8 and 16 passengers (mass transit), or a single passenger vehicle,” the city report stated. Unlike a subway, the pods would have a single destination and would travel on “autonomous electric skates traveling at 125-150 miles per hour.” \nThe project, according to the presentation, would involve no taxpayer funding and complement Los Angeles’s public transportation systems. The cost of using the system would be comparable to current public transportation costs in the region, according to BBC (a new light rail line that passes through Culver City costs $1.75 to ride.) \nCulver City council member Meghan Sahli-Wells was concerned with how this project would impact public transportation. “It looks super sexy and super easy but it’s half-baked from a public perspective,” she said, according to the BBC . \nThe city council made no decision about the proposal. “I think there’s still so much to vet out and so much technology that’s going to move forward, but we’re a very forward thinking city,” Mayor Jeffrey Cooper told Wired . “I think it would be foolhardy of us to just say no.” \nIn 2016, Musk, who lives in Bel Air, tweeted his desire to build tunnels under Los Angeles , after being stuck in traffic. And the Boring Company is his effort to come up with a solution. \n“To solve the problem of soul-destroying traffic, roads must go 3D, which means either flying cars or tunnels,” the Boring Company’s website says. \nThe Boring Company is already building a two-mile test tunnel in Hawthorne and reimbursing that city for any expenses. The company said it would also pay for any staff or consultants that Culver City may need to hire. \nMusk is in talks to build another sci-fi transportation project known as a hyperloop—train-like pods that transport people at fast speeds in tunnels that are like pneumatic tubes—from Washington, D.C. to Baltimore. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-23T02:00:00.000+02:00", "crawled": "2018-01-24T06:45:02.017+02:00", "highlightTitle": ""}