{"organizations": [], "uuid": "4c5194a33c3fa69eb53ed9da64c1b0e36d5b497f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219494656&w=1200&r=LYNXMPEE0405E", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-golf-sentry/golf-new-year-same-as-old-for-first-round-leader-leishman-idUKKBN1EU0AX", "country": "US", "domain_rank": 408, "title": "Golf - New year same as old for first-round leader Leishman", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T05:53:00.000+02:00", "replies_count": 0, "uuid": "4c5194a33c3fa69eb53ed9da64c1b0e36d5b497f"}, "author": "", "url": "https://uk.reuters.com/article/uk-golf-sentry/golf-new-year-same-as-old-for-first-round-leader-leishman-idUKKBN1EU0AX", "ord_in_thread": 0, "title": "Golf - New year same as old for first-round leader Leishman", "locations": [], "entities": {"persons": [{"name": "leishman", "sentiment": "negative"}, {"name": "leishman reuters s", "sentiment": "negative"}, {"name": "spieth", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "dustin johnson", "sentiment": "none"}, {"name": "marc leishman", "sentiment": "none"}, {"name": "brian spurlock-usa", "sentiment": "none"}, {"name": "brian harman", "sentiment": "none"}], "locations": [{"name": "kapalua", "sentiment": "none"}, {"name": "kapalua plantation", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "il", "sentiment": "none"}, {"name": "hawaii", "sentiment": "none"}, {"name": "lake forest", "sentiment": "none"}, {"name": "jordan spieth", "sentiment": "none"}, {"name": "maui", "sentiment": "none"}], "organizations": [{"name": "conway farms golf club", "sentiment": "none"}, {"name": "venezuelan jhonattan vegas", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 3:54 AM / Updated 17 minutes ago Golf - New year same as old for first-round leader Leishman Reuters Staff 3 Min Read \n(Reuters) - Marc Leishman rang in the new year much the same way that he ended the old, with a sizzling performance that earned him the first-round lead at the Sentry Tournament of Champions in Hawaii on Thursday. FILE PHOTO: Sep 17, 2017; Lake Forest, IL, USA; Marc Leishman tees off on the fourth hole during the final round of the BMW Championship golf tournament at Conway Farms Golf Club. Mandatory Credit: Brian Spurlock-USA TODAY Sports \nThe Australian set the tone for his day with a five-foot birdie at the first hole en route to a six-under-par 67 at the Kapalua Plantation course on the island of Maui. \nLeishman heads Venezuelan Jhonattan Vegas and American Brian Harman by one stroke, with world number one Dustin Johnson among a trio two behind. \nWhile Johnson started solidly, some of the big names in the 34-man field battled to dust off Christmas rust, none more so than Jordan Spieth. \nWorld number two Spieth recorded his first ever over-par score at Kapalua, a 75 that left him ahead of only three players in the small but elite 34-man field. \nSpieth said he had made some “significant changes” in his putting set-up over the past month that he expects will take several rounds to feel comfortable. \nWhile Spieth struggled, Leishman offered a reminder that behind the superstars lurk a bunch of players capable of winning any given week. \n“Played well, drove ball pretty well with exception of a couple of drives and putter was really solid,” Leishman told Golf Channel. “Happy with eight birdies, good start to a nice tournament.” \nHe starts 2018 the highest-ranked Australian, 12th in the world, after a hot finish to 2017 that included a victory, a second, a third and a fourth-placing in his final six global starts. \nLeishman won the BMW Championship in September, and his runner-up finish was a playoff loss to Thomas at the CJ Cup @ Nine Bridges in South Korea in October. \n“Really high,” he said of his confidence level. “Good results help with that obviously. I know I‘m not owed anything but confidence certainly make it easier to play well.” \nVegas is also coming off a good year during which he climbed into the top 50 in the world, with he hopes more to come. \nLike Leishman, he knows he can beat the best when he hits it straight. \n“It’s a big key for my game to drive it well,” Vegas said. \n”I hit my irons as well as some of the best on tour and if I‘m able to keep it in play, and give myself good positions to attack hole locations I‘m going to get a lot of birdie opportunities. \n“Last year was pretty good year for me, moved into top 50 in the world. This year I want to move even higher, somewhere in the 20s.” Reporting by Andrew Both in Cary, North Carolina; editing by Amlan Chakraborty", "external_links": [], "published": "2018-01-05T05:53:00.000+02:00", "crawled": "2018-01-05T06:11:51.001+02:00", "highlightTitle": ""}