{"organizations": [], "uuid": "8a078c6fe9203dd49d9cc96fd3a864ab873f9302", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-wealthengine-board-appoints-dennis-ainge-as-interim-ceo.html", "country": "US", "domain_rank": 767, "title": "WealthEngine Board Appoints Dennis Ainge as Interim CEO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.274, "site_type": "news", "published": "2018-01-02T22:05:00.000+02:00", "replies_count": 0, "uuid": "8a078c6fe9203dd49d9cc96fd3a864ab873f9302"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-wealthengine-board-appoints-dennis-ainge-as-interim-ceo.html", "ord_in_thread": 0, "title": "WealthEngine Board Appoints Dennis Ainge as Interim CEO", "locations": [], "entities": {"persons": [{"name": "dennis ainge", "sentiment": "negative"}, {"name": "ainge", "sentiment": "none"}, {"name": "wealthengine chairman", "sentiment": "none"}, {"name": "dennis", "sentiment": "none"}, {"name": "bobby yazdani", "sentiment": "none"}], "locations": [{"name": "md.", "sentiment": "none"}, {"name": "bethesda", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "wealthengine board", "sentiment": "negative"}, {"name": "neustar", "sentiment": "none"}, {"name": "equifax nds", "sentiment": "none"}, {"name": "information service", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BETHESDA, Md., Jan. 2, 2018 /PRNewswire/ -- Dennis Ainge is no stranger to the world of data and analytics. With over 30 years of experience, Ainge has led sales, product, data strategy and operations for Information Service leaders Neustar, TARGUSinfo, and Equifax NDS.\nBobby Yazdani, WealthEngine Chairman stated, \"We were so fortunate that Dennis could step into WealthEngine as our interim CEO. I can't think of anyone more qualified to help put WealthEngine on an accelerated growth path than Dennis. His entrepreneurial spirit and drive as well as his track record of creating unique and disruptive data solutions for so many industries make him the perfect leader for this next phase of our growth. Nonprofits has been and will always be the foundation for our \"Engine,\" but Dennis can help us expand into other commercial markets.\"\nAinge stated, \"WealthEngine is one of the great niche data companies in the U.S. I was excited to join the BoD earlier this year because WealthEngine has a census of wealth that goes back 20+ years. Other data and analytic companies talk about \"propensity to buy/spend/donate\" etc., but WealthEngine has something no one else has – \"capacity\" based intelligence. They also have authoritative data assets that are unique to them and that are just waiting to be tapped for new and existing product solutions.\"\n\"WealthEngine's data platform is being leveraged by nearly 3,000 nonprofit and commercial customers. They recently started to provide real-time API access and will be supporting strategic clients with an on-premise census of their wealth insights.\" Ainge states, \"whether a small nonprofit looking to identify donors or a major commercial client looking to understand the impact wealth has on the behavior of their customers and prospects, WealthEngine has the accuracy and granularity of data down to the individual level that helps organizations target their customers and prospects via traditional or digital marketing efforts. I can't wait to roll up my sleeves and help WealthEngine show the marketplace why \"capacity\" is the differentiator in the world of customer analytics.\"\nAbout WealthEngine\nWealthEngine is a leading provider of predictive marketing analytics, audience development, and wealth intelligence services. Named a Cool Vendor in Data-Driven Marketing by Gartner, marketing, sales, and fundraising professionals use WealthEngine's comprehensive insights to find, understand, and engage with their clients and prospects. Headquartered in Bethesda, MD, WealthEngine provides clients in the United States with solutions that provide a more complete picture of the people they already know and tools to find new people they need to know. WealthEngine provides solutions and services to financial services firms, luxury organizations, nonprofits, hospitals, institutions of higher education, political campaigns, advocacy groups of all sizes, and any other organization looking to use wealth data to enhance their efforts. For more information, please visit wealthengine.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/wealthengine-board-appoints-dennis-ainge-as-interim-ceo-300576479.html\nSOURCE WealthEngine", "external_links": ["http://www.wealthengine.com/", "http://www.prnewswire.com/news-releases/wealthengine-board-appoints-dennis-ainge-as-interim-ceo-300576479.html"], "published": "2018-01-02T22:05:00.000+02:00", "crawled": "2018-01-02T23:41:31.049+02:00", "highlightTitle": ""}