{"organizations": [], "uuid": "581f11be95be5561011fbbfe77523848a217b6a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-deloitte-adds-former-fbi-executive-james-turgal-to-growing-cybersecurity-incident-response-practice.html", "country": "US", "domain_rank": 767, "title": "Deloitte Adds Former FBI Executive James Turgal to Growing Cybersecurity Incident Response Practice", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T17:30:00.000+02:00", "replies_count": 0, "uuid": "581f11be95be5561011fbbfe77523848a217b6a4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-deloitte-adds-former-fbi-executive-james-turgal-to-growing-cybersecurity-incident-response-practice.html", "ord_in_thread": 0, "title": "Deloitte Adds Former FBI Executive James Turgal to Growing Cybersecurity Incident Response Practice", "locations": [], "entities": {"persons": [{"name": "deloitte", "sentiment": "negative"}, {"name": "james turgal", "sentiment": "negative"}, {"name": "james", "sentiment": "none"}, {"name": "chuck saia", "sentiment": "none"}, {"name": "turgal", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "deloitte", "sentiment": "none"}], "organizations": [{"name": "fbi", "sentiment": "negative"}, {"name": "bureau of investigation information and technology branch", "sentiment": "none"}, {"name": "deloitte & touche llp", "sentiment": "none"}, {"name": "deloitte's cyber risk services", "sentiment": "none"}, {"name": "fbi information and technology branch", "sentiment": "none"}, {"name": "deloitte risk and financial advisory", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 9, 2018 /PRNewswire/ -- James Turgal , former executive assistant director for the Federal Bureau of Investigation Information and Technology Branch, has joined Deloitte Risk and Financial Advisory 's Cyber Risk Services practice as managing director, Deloitte & Touche LLP. Turgal recently retired from the FBI after 21 years of service.\nAt Deloitte, Turgal will primarily focus on advising clients on cyber incident response, cyber war-gaming and cyber resilience. As a former member of the FBI's C-suite, he is the highest ranking and the second former-FBI leader to join Deloitte's Cyber Risk Services practice in a managing director role in the past year.\n\"James' strategic, forward-thinking approach to incident response will be invaluable as we continue to provide world-class, comprehensive cybersecurity services to our clients,\" said Chuck Saia, CEO, Deloitte Risk and Financial Advisory.\nAs executive assistant director for the FBI Information and Technology Branch (CIO), Turgal was responsible for all global applications, corporate systems, infrastructure and operations for the bureau's worldwide information and technology needs. During this time, he also led the FBI's efforts to transform cybersecurity areas including digital forensics and investigations, data privacy, identity management and cyber resiliency.\nEarlier, while serving as chief human capital officer and head of the FBI's human resources (HR) division, Turgal focused on aligning staffing resources with emerging risks, streamlining systems and processes, designing a cyber skill and recruiting program, as well as maximizing HR budgets. In addition to having received numerous awards for his professional experience, including the Presidential Rank Award for Meritorious Executive, Turgal brings a wealth of broad-based experience to his new role at Deloitte.\nBefore joining the FBI, Turgal was co-owner and litigation partner at Jacobs & Turgal, P.C., a Phoenix, Arizona, area law firm.\n\"Deloitte recognizes that a comprehensive understanding of the cybersecurity landscape is critical to helping organizations stay ahead of emerging threats,\" said Turgal. \"Finding the right balance between technology and talent, and knowing when and how to best utilize each, can significantly strengthen cyber incident response programs.\"\nTurgal maintains close ties to the law enforcement and intelligence communities and is frequently consulted for his knowledge in global cyber, counterterrorism, intelligence, criminal and security issues.\nBased in Washington, D.C., Turgal holds a bachelor's degree in business and economics from Northern Arizona University, a law degree from Western Michigan University's Thomas M. Cooley School of Law, and a master's of law degree from Georgetown University Law Center.\nAbout Deloitte\nDeloitte provides industry-leading audit, consulting, tax and advisory services to many of the world's most admired brands, including more than 85 percent of the Fortune 500 and more than 6,000 private and middle market companies. Our people work across more than 20 industry sectors to make an impact that matters — delivering measurable and lasting results that help reinforce public trust in our capital markets, inspire clients to see challenges as opportunities to transform and thrive, and help lead the way toward a stronger economy and a healthy society. Deloitte is proud to be part of the largest global professional services network serving our clients in the markets that are most important to them.\nContact\nLauren Hallman\nPublic Relations\nDeloitte Services LP\n+1 215 282 1213\nlahallman@deloitte.com\nDeloitte refers to one or more of Deloitte Touche Tohmatsu Limited, a UK private company limited by guarantee (\"DTTL\"), its network of member firms, and their related entities. DTTL and each of its member firms are legally separate and independent entities. DTTL (also referred to as \"Deloitte Global\") does not provide services to clients. In the United States, Deloitte refers to one or more of the US member firms of DTTL, their related entities that operate using the \"Deloitte\" name in the United States and their respective affiliates. Certain services may not be available to attest clients under the rules and regulations of public accounting. Please see www.deloitte.com/about to learn more about our global network of member firms.\nView original content with multimedia: http://www.prnewswire.com/news-releases/deloitte-adds-former-fbi-executive-james-turgal-to-growing-cybersecurity-incident-response-practice-300579826.html\nSOURCE Deloitte", "external_links": ["http://www2.deloitte.com/us/en/pages/about-deloitte/articles/press-releases/linda-walsh-joins-deloitte-cyber-risk-services.html?id=us:2el:3pr:crsjturgal:awa:adv:010918:walsh", "https://www2.deloitte.com/us/en/legal/about-deloitte.html", "http://www2.deloitte.com/us/en/services/advisory?id=us:2el:3pr:crsjturgal:awa:adv:010918:drfa", "http://www2.deloitte.com/us/en/profiles/csaia.html?id=us:2el:3pr:crsjturgal:awa:adv:010918:csbio", "http://www2.deloitte.com/us/en/profiles/jturgal.html?id=us:2el:3pr:crsjturgal:awa:adv:010918:jtbio", "http://www.prnewswire.com/news-releases/deloitte-adds-former-fbi-executive-james-turgal-to-growing-cybersecurity-incident-response-practice-300579826.html"], "published": "2018-01-09T17:30:00.000+02:00", "crawled": "2018-01-09T18:52:13.000+02:00", "highlightTitle": ""}