{"organizations": [], "uuid": "6e354364bebd83ea0d29e57eca987c3216fc9f3f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220723766&w=1200&r=LYNXMPEE0906K", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-china-france/french-president-macron-downplays-lack-of-big-deals-during-china-visit-idUKKBN1EZ0BY", "country": "US", "domain_rank": 408, "title": "French President Macron downplays lack of big deals during China visit", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T06:33:00.000+02:00", "replies_count": 0, "uuid": "6e354364bebd83ea0d29e57eca987c3216fc9f3f"}, "author": "", "url": "https://uk.reuters.com/article/uk-china-france/french-president-macron-downplays-lack-of-big-deals-during-china-visit-idUKKBN1EZ0BY", "ord_in_thread": 0, "title": "French President Macron downplays lack of big deals during China visit", "locations": [], "entities": {"persons": [{"name": "macron", "sentiment": "negative"}, {"name": "stephen coates", "sentiment": "none"}, {"name": "michel rose", "sentiment": "none"}, {"name": "reuters/charles platiau", "sentiment": "none"}, {"name": "charles de gaulle", "sentiment": "none"}, {"name": "emmanuel macron", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "china academy of space technology", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 4:36 AM / Updated an hour ago In China, Macron presses EU for united front on foreign takeovers Michel Rose 5 Min Read \nBEIJING (Reuters) - Europe should to be more united in protecting strategic assets from foreign takeovers if it wants Beijing’s respect, French President Emmanuel Macron said on Wednesday as he wrapped up a visit to China that brought no eye-catching trade deals. \nThe 40-year-old has deployed a mix of charm and threats on his first state visit since taking office in May. Accompanied by 50 business leaders, he has sought to recalibrate bilateral relations and narrow a gaping trade deficit. \nAs president, Macron has pushed for the EU to screen foreign investments in its strategic sectors and, signalling French annoyance at China’s reluctance to open some of its domestic markets, that issue has been a focal point of the three-day visit. \nOn Wednesday, he sounded a warning to less wealthy EU states that have taken a softer line due to their perceived reliance on Chinese investment. \n“Europe has often shown itself divided about China,” Macron told representatives of the French community in Beijing. “And China won’t respect a continent, a power, when some member states let their doors freely open.” CHINA SURGE \nForeign direct investment in the European Union traced back to mainland China has surged in recent years, to a record 35 billion euros (£31 billion) in 2016 from 1.6 billion euros in 2010, according to the Mercator Institute for China Studies. \nFrance, like Germany, has generally welcomed Chinese investment as a boost to its economy and an opportunity to expand into fast-growing Asian markets. \nBut the euro zone’s top two economies have been reluctant to cede control of strategic assets, notably in transport, defence, telecoms, tech and engineering - sectors in which China’s footprint is expanding fast. \nThe EU hopes negotiations on an investment pact with China will reach a “decisive stage” this year, the bloc’s ambassador to China said separately, calling on Beijing to honour a pledge to open its economy to the world. \nMacron did not say which EU countries he thought should needed to shield their assets more vigorously but, after struggling under strict austerity rules imposed by its European partners, Greece for one has embraced China’s cash. French President Emmanuel Macron shakes hands with high school students of the French international school Charles de Gaulle of Beijing during a visit to the China Academy of Space Technology in Beijing, China, January 10, 2018. REUTERS/Charles Platiau \nIt sold a majority stake in Piraeus port, the country’s largest, to China’s COSCO Shipping in 2016. The port has been referred to as the “dragon head” of China’s new Silk Road into Europe, a network of rail and shipping links designed to whisk commodities and goods between China and Europe. \n“China, which is a great power, does not respect a country that sells its essential infrastructures to the lowest bidder,” Macron said. PLAYING A LONGER GAME? \nIn Xian, an eastern departure point for the ancient Silk Road, Macron said on Monday that China’s equivalent modern-day “Belt and Road” trade initiative could not be one way -- a clear suggestion that Europe expected to be able to sell into China just as smoothly. \nYet two days later he concluded his trip without securing any major deals. \nAirbus ( AIR.PA ), he announced, would soon finalise a contract for 184 narrow-body jets, while nuclear group Areva failed to finalise a decade of negotiations with a contract to build a fuel reprocessing plant, securing only another protocol agreement. \nFrench officials said they were not disappointed, pointing to a sales contract for CFM jet engines by France’s Safran ( SAF.PA ) and General Electric ( GE.N ), and the lifting of a Chinese embargo on French beef, among other deals. \nMacron, who travelled with senior executives from Airbus, BNP Paribas ( BNPP.PA ), AccorHotels ( ACCP.PA ), EDF ( EDF.PA ) and LVMH ( LVMH.PA ), played down the absence of blockbuster deals. He said other countries had trumpeted big figures in the past that masked more modest realities. \n“I don’t want to give the impression that we made this trip to obtain as many contracts as possible,” Macron told reporters. \n“We have secured unprecedented openings ... which are the result of much hard work.” \nJean Pierre Cabestan, professor of political science at Hong Kong Baptist University, said while France would like a larger share of the market, Macron was playing a longer game. \n“Macron’s visit was to set new rules,” Cabestan said. “The idea wasn’t we should expect results, because we’re laying the ground to make our relationship more sound, more balanced.” Reporting by Michel Rose; additional reporting by Philip Wen in Beijing and John Ruwitch in Shanghai; Writing by Richard Lough; editing by John Stonestreet", "external_links": [], "published": "2018-01-10T06:33:00.000+02:00", "crawled": "2018-01-10T07:23:59.005+02:00", "highlightTitle": ""}