{"organizations": [], "uuid": "d9289a086c74c29e0486dd45bcd335e5bed6db8b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/business-wire-decisionpoint-systems-adds-two-key-leaders-focused-on-growth-in-retail-supply-chain-industry.html", "country": "US", "domain_rank": 767, "title": "DecisionPoint Systems Adds Two Key Leaders Focused on Growth in Retail & Supply Chain Industry", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.025, "site_type": "news", "published": "2018-01-12T17:01:00.000+02:00", "replies_count": 0, "uuid": "d9289a086c74c29e0486dd45bcd335e5bed6db8b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/business-wire-decisionpoint-systems-adds-two-key-leaders-focused-on-growth-in-retail-supply-chain-industry.html", "ord_in_thread": 0, "title": "DecisionPoint Systems Adds Two Key Leaders Focused on Growth in Retail & Supply Chain Industry", "locations": [], "entities": {"persons": [{"name": "danny yapaola", "sentiment": "none"}, {"name": "doug bachrach", "sentiment": "none"}, {"name": "angelo", "sentiment": "none"}, {"name": "mike heffernan", "sentiment": "none"}, {"name": "angelo rosati", "sentiment": "none"}, {"name": "doug", "sentiment": "none"}], "locations": [{"name": "calif.", "sentiment": "none"}, {"name": "irvine", "sentiment": "none"}], "organizations": [{"name": "retail & supply chain industry company recruits top tier industry veterans", "sentiment": "negative"}, {"name": "decisionpoint", "sentiment": "none"}, {"name": "east coast customers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Company Recruits Top Tier Industry Veterans to its Customer-facing Team\nIRVINE, Calif.--(BUSINESS WIRE)-- DecisionPoint™ Systems, Inc. (Other OTCBB DPSI), a leading provider and integrator of enterprise mobility and wireless application solutions, announced today that Angelo Rosati and Doug Bachrach have joined the company’s sales leadership team. Angelo and Doug will serve as Senior Account Executives. Both have deep experience, and strong track records of driving customer success and business growth in the retail market, including retail logistics supply chain. In addition, Danny Yapaola and Mike Heffernan PMP have also joined DecisionPoint and will bring their 25+ years of technical expertise and project management support to Angelo, Doug and their East Coast Customers.\nAngelo and Doug were most recently at another industry reseller, but prior to that, both leaders spent over a decade at DecisionPoint and are extremely familiar with the company, its product offerings and its customer base.\n“Angelo and Doug have the industry experience and leadership talent required to bring innovative solutions and offerings to our retail customers and partners, while creating new opportunities and driving growth for our company. I’m very excited to have both senior executives join our DecisionPoint team,” said Steve Smith, chief executive officer, DecisionPoint. “Both leaders have the industry knowledge, awareness of new trends in retail, the customer relationships and intimacy to make an immediate impact for DecisionPoint, our customers and the Northeast region they will support. The fact that they will be supported by Danny and Mike make it a complete team in the East that our customers can depend on.”\nDecisionPoint exclusively uses field-based teams comprised of seasoned account executives and pre-sale solution architects in a face-to-face selling model. The company’s selling teams are experienced in all areas of wireless and mobile computing and their focus is to identify customers’ enterprise wireless and mobility needs to propose problem-solving solutions and ultimately close the business fulfilling those requirements.\nOver the years, DecisionPoint has primarily focused on retailers’ in-store and logistics systems. The company has been instrumental in the adoption of barcode scanning, mobile computing and wireless technologies inside the retail store environment from its inception in the 1990’s, and it continues to be involved with these line-of-business solutions. Today, DecisionPoint is expanding its reach into Omni-channel, customer self-service and customer-facing applications as the use of mobile retail applications continues to rise.\n“Transportation and logistics and field services are an increasing market for automation and field mobility solutions. Applications such as repair and maintenance, delivery and inspections will continue to grow and create additional opportunities for mobility solution sales. DecisionPoint is excited to be at the forefront of supporting these opportunities for our customers by hiring experienced, talented and trusted advisors like Angelo and Doug,” added Smith.\nThe addition of these sales leaders, and technical and project support personnel to the DecisionPoint team of employees will enable the company to further expand its rapidly growing position in retail and other vertical markets, diversifying its customer portfolio-- a critical facet of the company’s strategy.\nAbout DecisionPoint Systems, Inc.\nDecisionPoint Systems, Inc. delivers improved productivity and operational advantages to its clients by helping them move their business decision points closer to their customers. We do this by making enterprise software applications accessible to the front-line worker anytime, anywhere. DecisionPoint utilizes all the latest wireless, mobility, and RFID technologies. For more information about DecisionPoint Systems, Inc., visit www.decisionpt.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180112005279/en/\nFor DecisionPoint\nErin Farrell Talbot, 917-232-9309\nerin@farrelltalbot.com\nSource: DecisionPoint Systems, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.decisionpt.com&esheet=51742312&newsitemid=20180112005279&lan=en-US&anchor=www.decisionpt.com&index=1&md5=d76248f42d92b93091f009fff5f70fcb", "http://www.businesswire.com/news/home/20180112005279/en/"], "published": "2018-01-12T17:01:00.000+02:00", "crawled": "2018-01-12T17:42:14.003+02:00", "highlightTitle": ""}