{"organizations": [], "uuid": "c4c1fbea169cce7befb7475d794f474de38cc173", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/10/104938547-GettyImages-120766265.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100727362/device/rss/rss.html", "section_title": "World News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/10/why-the-bond-market-sell-off-could-be-very-different-this-time-round.html", "country": "US", "domain_rank": 767, "title": "Why the bond market sell-off could be very different this time round", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T18:33:00.000+02:00", "replies_count": 0, "uuid": "c4c1fbea169cce7befb7475d794f474de38cc173"}, "author": "Joumanna Bercetche", "url": "https://www.cnbc.com/2018/01/10/why-the-bond-market-sell-off-could-be-very-different-this-time-round.html", "ord_in_thread": 0, "title": "Why the bond market sell-off could be very different this time round", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "u.s. treasury", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "With 10-year U.S. Treasury yields breaking through 2.5 percent , the question many investors are asking (not for the first time) is whether this is the end of the bull run for fixed income.\nFixed-income heavyweights are also wading into the discussion with investors such as Bill Gross suggesting the bond bear market is indeed here .\nWhile the 10-year note has still not breached March 2017 levels, it's worth cautioning that once it hit 2.6 percent last year, contrary to expectations at the time, it then started a downward trend almost breaching 2 percent back in September before easing up towards the end of the year.\nThis, as the two-year yield rose to levels not reached since 2008 as the Federal Reserve continued with its hiking cycle, telegraphing more to come.\nSo what's different this time? Fixed-income specialists point the recent sell-off to multiple factors:\nLoss of one of its biggest buyers? Bloomberg news reported that China is considering lower, or even stopping the amount of U.S. bonds it purchases , as the debt has become \"less attractive to own\" and trade tensions have risen. This could have substantial consequence for the U.S. Treasury market that could be losing not one (China) but two (the Fed) of its largest buyers.\nThe fiscal impact from the US tax bill The bill has been estimated to add anything from 0.3 to 0.5 percent to growth in the short term, but many fixed-income investors are focused on what the unfunded tax bill means for Treasury issuance in coming years. The U.S. Treasury will release its updated refunding announcement in February and is widely expected to increase bond sales as deficits are set to widen.\nQuantitative tightening As the Fed expanded its balance sheet via quantitative easing, the interest rates on long-term bonds broadly declined, as well as the embedded term premium in those bonds — or the extra yield investors are compensated for holding longer-duration instruments.\nshow chapters Rates are surging, will bonds be to blame for the end of the bull market? 21 Hours Ago | 06:37 But now, Goldman Sachs analysts estimate that the planned reduction of the Fed's balance sheet via quantitative tightening will exert upward pressure on the term premium to the tune of 15 to 25 basis points.\nCiti's rates strategist Harvinder Sian also estimates that a 1 percent global decline in its balance sheet ($500 billion) should lead to a 11 to 22 basis point impact on U.S. Treasurys and 25 to 40 basis points on German sovereign bonds (known as bunds).\nPositioning Investors are also finally turning bearish. The CFTC (Commodity Futures Trading Commission) report in December showed that for the first time since April 2017, bearish (or short) positions had exceeded bullish positions. Traders have also recently noted a big jump in open interest in Treasury futures in the last five sessions, which means that a base of traders willing to bet against the market is being built up built up as yields rise.\nInflation and commodity prices While key underlying measures of inflation are still below 2 percent, commodity prices are in another bullish channel. Oil prices are now at more than three-year highs and have helped boost inflation expectations.\nshow chapters All assets except for cash and bonds to rise in 2018: Porta Advisors 6 Hours Ago | 02:38 The 10-year breakeven level — which is used to see what the bond market is implying inflation will average at over the next 10 years — has now breached 2 percent. Earlier this week, Goldman Sachs's Francesco Garzarelli told CNBC that much of the move upwards in this metric can be attributed back to the price of oil.\nHowever, Deutsche Bank analysts have cautioned that it will probably still take better-than-expected inflation data to \"turbo charge any sell-offs.\" So while the commodity upswing has boosted inflation expectations, unless core consumer prices begin to rise the sell-off may still be capped.\nAs of yet, no panic warranted Where 10-year yields go from here will be a major determinant for all investors in both equities and credit (which as an asset class has also benefited from record inflows).\nArguably though, what matters more for the real economy and for the growth trajectory is what actually happens to U.S. real yields (the nominal yield that is adjusted for inflation). The U.S. 10-year real yield is still only around 0.50 percent, a historically low level. When compared to the average dividend yield of around 2.2 percent in the S&P, equities do not look rich relatively. That may change as bond yields move higher.\nNon-fixed income investors wanting to gauge whether the selloff in 10-year U.S. treasuries will start to bite may be better off watching 10-year treasury real yields for flashing red signals.\nAs of yet, no panic warranted.\nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": ["http://www.twitter.com/CNBCopinion"], "published": "2018-01-10T18:33:00.000+02:00", "crawled": "2018-01-10T17:39:21.020+02:00", "highlightTitle": ""}