{"organizations": [], "uuid": "27cc8733c499624cfed40b65a9b3f9a3753eeaf6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-haven-tower-group-expands-client-service-capabilities-with-launch-of-marketing-brand-strategy-team.html", "country": "US", "domain_rank": 767, "title": "Haven Tower Group Expands Client Service Capabilities With Launch Of Marketing & Brand Strategy Team", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T19:00:00.000+02:00", "replies_count": 0, "uuid": "27cc8733c499624cfed40b65a9b3f9a3753eeaf6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-haven-tower-group-expands-client-service-capabilities-with-launch-of-marketing-brand-strategy-team.html", "ord_in_thread": 0, "title": "Haven Tower Group Expands Client Service Capabilities With Launch Of Marketing & Brand Strategy Team", "locations": [], "entities": {"persons": [{"name": "ryan mcclune", "sentiment": "none"}, {"name": "mcclune", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "haven tower", "sentiment": "none"}], "organizations": [{"name": "haven tower group", "sentiment": "negative"}, {"name": "haven tower group expands client service capabilities with launch of marketing & brand strategy team", "sentiment": "negative"}, {"name": "marketing & brand strategy", "sentiment": "none"}, {"name": "haven tower", "sentiment": "none"}, {"name": "principal, marketing & brand strategy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES, Jan. 29, 2018 /PRNewswire/ -- Haven Tower Group, LLC (\"Haven Tower\"), a public relations agency focused on the retail financial services space, today announced a comprehensive expansion of its client service capabilities with the launch of its Marketing & Brand Strategy team. The newly formed team will develop and execute brand strategies, and traditional and digital marketing programs, including corporate social media campaigns, and make them available to clients on a stand-alone basis or as part of Haven Tower's broader public relations offerings.\nTo lead the team, Haven Tower has hired Ryan McClune to serve in the newly created position of Principal, Marketing & Brand Strategy. In this role, Mr. McClune will work closely with the agency's other senior professionals to manage existing client relationships and projects, while spearheading business development efforts related to the new team's area of focus.\nPreviously, Mr. McClune served as a marketing executive with HD Vest Financial Services, an independent broker-dealer focused on supporting tax-savvy independent wealth managers, where he led the firm's digital marketing efforts. Prior to that, Mr. McClune led the Interactive Marketing team at LPL Financial, the nation's largest independent broker-dealer, where he developed and implemented digital marketing campaigns to support advisor recruitment and retention, as well as brand elevation and lead generation efforts for the company's affiliated financial advisor businesses.\nRuth Papazian, Chairman of Haven Tower, said, \"Having worked closely with Ryan McClune in my former role as Chief Marketing Officer at LPL Financial, and later as CMO and Head of Business Development at HD Vest, I'm confident he is the perfect choice to spearhead this new team. Haven Tower, under the leadership of its founding partner, Joe Kuo, has established itself as the top strategic PR agency in the retail financial advice space. The launch of marketing and brand strategy capabilities is a logical next step in Haven Tower's development, and I look forward to continuing to provide active strategic guidance to the agency as we embark on an exciting new stage of growth together.\"\nAs part of this team's launch, Haven Tower also announced the hiring of Leo Bottary, the former head of brand communication and peer advantage for Vistage Worldwide, to serve as Principal for Influencer & Peer Marketing, and the appointment of veteran ad agency professional Ted Gersten to the role of Principal and Creative Director.\nGoing forward, the Marketing & Brand Strategy team's services will orient around the following key areas:\nComprehensive brand launch and marketing architecture creation for newly-formed businesses; Rebranding campaigns for established companies seeking to strategically reposition themselves, or otherwise refresh their image; Corporate social media campaigns to drive brand elevation and greater public domain visibility; and Digital marketing campaigns to drive financial advisor recruiting, as well as client and advisor lead generation and inbound lead capture.\nJoseph Kuo, President & Managing Partner of Haven Tower, said, \"Since our founding seven years ago, Haven Tower has devoted itself to providing exceptional client service, combining an intense work ethic with a conviction that there is no substitute for strategic focus, intellectual depth and a clear bias for action. Ryan McClune, Leo Bottary and Ted Gersten not only have the skills and expertise to successfully expand our capabilities, they bring the same passion for client service that defines who we are as a firm. We're thrilled to welcome these seasoned executives to Haven Tower, and we're looking forward to partnering with them to deliver an even greater level of value to our clients than ever before.\"\nHaven Tower announced the launch of its Marketing & Brand Strategy team during OneVoice 2018, the Financial Services Institute's (FSI) annual conference, where Mr. Kuo is moderating the event's Marketing, Growth & Development session titled \"Doing More with Less – Effectively Leveraging Strategic Partnerships for Marketing Success.\" OneVoice is the largest annual gathering of executives and leaders from across the independent financial advice industry.\nAbout Haven Tower Group, LLC\nHaven Tower Group, LLC is a strategic public relations and marketing solutions agency focused on supporting the retail financial services industry. Headquartered in Los Angeles, with a satellite presence in San Diego and Seattle, Haven Tower encompasses 15 professionals who provide comprehensive PR, marketing and branding services to companies across the retail financial services space, with a particular focus on the independent retail financial advice space. While the agency's clients range from some of the largest firms in the nation, to smaller and mid-sized enterprises, they all share in common a recognition of the importance of effective reputation management, strategic communications and public visibility to business growth and success.\nHaven Tower's clients include independent broker-dealers, custodian / clearing companies, Super-OSJ and hybrid RIA firms, independent wealth managers, and a wide spectrum of industry associations, asset managers, third party consultancies, fintech enterprises and other related businesses. For more information, please visit www.haventower.com .\nContact :\nMichael Dugan / Jessica Caris\nHaven Tower Group, LLC\nPhone: 424 652 6520 ext. 106 or ext. 104\nEmail: mdugan@haventower.com or jcaris@haventower.com\nView original content: http://www.prnewswire.com/news-releases/haven-tower-group-expands-client-service-capabilities-with-launch-of-marketing--brand-strategy-team-300589282.html\nSOURCE Haven Tower Group", "external_links": ["http://www.haventower.com/", "http://www.prnewswire.com/news-releases/haven-tower-group-expands-client-service-capabilities-with-launch-of-marketing--brand-strategy-team-300589282.html"], "published": "2018-01-29T19:00:00.000+02:00", "crawled": "2018-01-29T20:52:21.000+02:00", "highlightTitle": ""}