{"organizations": [], "uuid": "44d444129c35e7415d87eda7385c7b057b9cc358", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKTennisNews/", "section_title": "Reuters: Tennis News", "url": "https://uk.reuters.com/article/tennis-ausopen-kyrgios/update-1-tennis-kyrgios-keeps-cool-to-fly-into-third-round-idUKL8N1PC2RT", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Tennis-Kyrgios keeps cool to fly into third round", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T14:17:00.000+02:00", "replies_count": 0, "uuid": "44d444129c35e7415d87eda7385c7b057b9cc358"}, "author": "", "url": "https://uk.reuters.com/article/tennis-ausopen-kyrgios/update-1-tennis-kyrgios-keeps-cool-to-fly-into-third-round-idUKL8N1PC2RT", "ord_in_thread": 0, "title": "UPDATE 1-Tennis-Kyrgios keeps cool to fly into third round", "locations": [], "entities": {"persons": [{"name": "martyn herman", "sentiment": "none"}, {"name": "viktor troicki", "sentiment": "none"}, {"name": "nick kyrgios", "sentiment": "none"}, {"name": "andreas seppi", "sentiment": "none"}, {"name": "jo-wilfried tsonga", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "serbia", "sentiment": "none"}], "organizations": [{"name": "troicki", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 12:18 PM / Updated 18 minutes ago UPDATE 1-Tennis-Kyrgios keeps cool to fly into third round Reuters Staff \n* Kyrgios shows maturity to beat Troicki \n* Distracted by fan and helicopter in second set \n* Suffers late wobble but wins in straight sets (Adds details, quotes) \nBy Martyn Herman \nMELBOURNE, Jan 17 (Reuters) - Nick Kyrgios’s new-found focus remained intact despite a night of distractions as the fiery home favourite outplayed Serbia’s Viktor Troicki to reach the Australian Open third round without conceding a set on Wednesday. \nThe 17th seed dealt with a bellowing fan, a malfunctioning umpire’s microphone and was distracted by a helicopter early in the second set but remained in firm control to claim an impressive 7-5 6-4 7-6(2) victory. \nA year after the 22-year-old was jeered by home fans after surrendering a two-set lead against Italian Andreas Seppi to crash out in the second round, he produced more evidence that a run deep into the second week is possible. \nFrenchman Jo-Wilfried Tsonga, the 2008 Australian Open runner-up, is next up for Kyrgios who is shouldering his nation’s hopes of a first home men’s champion since Mark Edmondson in 1976. \nThe 31-year-old Troicki provided a useful gauge of Kyrgios’s form and fitness, but it was the Australian’s relative calmness in the face of adversity that stood out. \nHe was already a set in front when a fan decided to make a name for himself by standing up in the front row in the Hisense Arena and began bellowing while filming himself. \nThen a couple of games later a red helicopter hovered above the court, drowning out the sound of the ball being struck. \nThere was plenty of chuntering from Kyrgios but apart from “freaking out” after a late lapse when he dropped serve at 5-4 in the third, he stuck diligently to his task. ODD INCIDENTS \n”I think obviously it’s pretty easy to think, ‘Why me?'“ Kyrgios said of the odd incidents. ”The guy in the crowd was crazy. I didn’t really know what was going on. \n“The helicopter, that’s when I was thinking like, of course, it’s at my match. It’s just hovering there. Of course, it is.” \n“Hearing the ball actually come off the racket is a pretty big thing. I missed four returns. I‘m blaming the helicopter.” \nKyrgios got a helping hand at 5-5 when Troicki served two consecutive double faults to go 0-40 down and he rifled away a backhand winner after a ferocious baseline exchange. \nTwo unforced errors from Troicki gifted Kyrgios a break at the start of the second set and he then dipped into his bag of dinks and chips and fizzing winners to take a two-set lead. \nKyrgios broke in the third game of the third set but what looked like being a routine victory when he served at 5-4 hit a snag as, out of nowhere, he dropped serve. \n“When he (Troicki) broke back in the third set, I started freaking out a little bit,” Kyrgios said. \nTroicki saved one match point at 1-6 in the tiebreak with a deft volley but Kyrgios punched a backhand into the corner a point later to complete a good night’s work and supply further evidence that he is harnessing his unique talent. \n“I think last year, the year before, I probably would have been probably still out on the court right now, could be losing that match,” Kyrgios said. (Reporting by Martyn Herman; Editing by Christian Radnedge and Ken Ferris)", "external_links": [], "published": "2018-01-17T14:17:00.000+02:00", "crawled": "2018-01-17T14:46:09.012+02:00", "highlightTitle": ""}