{"organizations": [], "uuid": "7f293d105562e9fd3b87b18d5857c94989ff9c3e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-discover-financial-services-reports-fourth-quarter-net-income-of-387-million-or-0-point-99-per-diluted-share.html", "country": "US", "domain_rank": 767, "title": "Discover Financial Services Reports Fourth Quarter Net Income of $387 Million or $0.99 Per Diluted Share", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T00:21:00.000+02:00", "replies_count": 0, "uuid": "7f293d105562e9fd3b87b18d5857c94989ff9c3e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-discover-financial-services-reports-fourth-quarter-net-income-of-387-million-or-0-point-99-per-diluted-share.html", "ord_in_thread": 0, "title": "Discover Financial Services Reports Fourth Quarter Net Income of $387 Million or $0.99 Per Diluted Share", "locations": [], "entities": {"persons": [], "locations": [{"name": "riverwoods", "sentiment": "none"}, {"name": "ill.", "sentiment": "none"}], "organizations": [{"name": "dfs", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Net Income Included One-Time Charges of $189 Million Resulting from Actions Taken by the Company in Connection with the Tax Cuts and Jobs Act\nRIVERWOODS, Ill.--(BUSINESS WIRE)-- Discover Financial Services (NYSE: DFS) today reported net income of $387 million or $0.99 per diluted share for the fourth quarter of 2017, as compared to $563 million or $1.40 per diluted share for the fourth quarter of 2016. The company’s return on equity for the fourth quarter of 2017 was 14%. Net income included non-recurring charges of $189 million resulting from actions taken by the company in connection with the Tax Cuts and Jobs Act (\"Tax Act\"). These charges had the effect of reducing diluted earnings per share by $0.52.\nFourth Quarter Highlights\nTotal loans grew $7.0 billion (9%) from the prior year to $84.2 billion. Credit card loans grew $5.8 billion (9%) to $67.3 billion, on Discover card sales volume of $35.3 billion. Total net charge-off rate excluding PCI loans increased 53 basis points from the prior year to 2.92% and the total 30+ day delinquency rate excluding PCI loans increased 23 basis points from the prior year to 2.20%. Consumer deposits grew $3.4 billion (9%) from the prior year to $39.4 billion. Payment Services transaction dollar volume was $54.0 billion, up 17% from the prior year. Income tax expense includes a one-time adjustment of $179 million to reflect the impact of the Tax Act.\n“Our earnings in the fourth quarter and full year were driven by strong loan and revenue growth across our businesses, the result of continued execution of our strategy,” said David Nelms, chairman and CEO of Discover. “As we move forward in 2018, this strong momentum, enhanced by the favorable economic environment, should position us well for sustained growth, strong ROE and continued return of excess capital to shareholders. While the new tax law impacted the current quarter, I am excited about the opportunity it provides to further invest in growth, our people and our communities.\"\nSegment Results:\nDirect Banking\nDirect Banking pretax income of $870 million in the quarter rose by $2 million from the prior year as increased revenue was largely offset by higher provision for loan losses and operating expenses.\nTotal loans ended the quarter at $84.2 billion, up 9% compared to the prior year. Credit card loans ended the quarter at $67.3 billion, up 9% from the prior year. Personal loans increased $893 million (14%) from the prior year. Private student loans increased $183 million (2%) year-over-year, and grew $683 million (11%) excluding purchased student loans.\nNet interest income increased $228 million (12%) from the prior year, driven by loan growth and a higher net interest margin. Net interest margin was 10.28%, up 21 basis points from the prior year. Card yield was 12.79%, an increase of 17 basis points from the prior year because of increases in the prime rate, partially offset by higher interest charge-offs and a change in portfolio mix. Interest expense as a percent of total loans increased 16 basis points from the prior year, as higher market rates were partially offset by tighter credit spreads on refinanced long-term debt.\nOther income increased $22 million (5%) from the prior year, driven by higher discount and interchange revenue.\nThe delinquency rate for credit card loans over 30 days past due was 2.28%, up 24 basis points from the prior year and 14 basis points from the prior quarter. The credit card net charge-off rate for the fourth quarter was 3.03%, up 56 basis points from the prior year and 23 basis points from the prior quarter. The student loan net charge-off rate excluding purchased credit-impaired (\"PCI\") loans was 1.34%, down 8 basis points from the prior year. The personal loans net charge-off rate of 3.62% increased by 92 basis points from the prior year. Net charge-off rates were generally higher because of supply-driven credit normalization and the seasoning of loan growth from the last few years.\nProvision for loan losses of $678 million increased $99 million from the prior year due to higher net charge-offs, partially offset by a smaller reserve build. The reserve build for the fourth quarter of 2017 was $94 million, compared to a reserve build of $144 million in the fourth quarter of 2016.\nExpenses increased $149 million from the prior year as a result of higher employee compensation, marketing and professional fees. Employee compensation increased as a result of higher staffing levels and higher average salaries. In addition, employee compensation includes a $16 million charge associated with a one-time bonus granted to eligible employees following passage of the new tax legislation. Marketing expenses increased as a result of higher acquisition costs and brand advertising relative to the fourth quarter of 2016. The increase in professional fees is primarily due to investments in technology and analytic capabilities.\nPayment Services\nPayment Services pretax income was $29 million in the quarter, up $14 million from the prior year, primarily driven by lower operating expenses as well as higher transaction processing and interchange revenue.\nPayment Services transaction dollar volume was $54.0 billion, up 17% versus the prior year. PULSE transaction dollar volume was up 19% year-over-year. Diners Club volume increased 14% year-over-year driven by continued strength of newer franchise relationships.\nShare Repurchases\nDuring the fourth quarter of 2017, the company repurchased approximately 8.1 million shares of common stock for $555 million. Shares of common stock outstanding declined by 2.2% from the prior quarter.\nConference Call and Webcast Information\nThe company will host a conference call to discuss its fourth quarter results on Wednesday, January 24, 2018, at 4:00 p.m. Central time. Interested parties can listen to the conference call via a live audio webcast at https://investorrelations.discover.com .\nAbout Discover\nDiscover Financial Services (NYSE: DFS) is a direct banking and payment services company with one of the most recognized brands in U.S. financial services. Since its inception in 1986, the company has become one of the largest card issuers in the United States. The company issues the Discover card, America's cash rewards pioneer, and offers private student loans, personal loans, home equity loans, checking and savings accounts and certificates of deposit through its direct banking business. It operates the Discover Network, with millions of retail and cash access locations; PULSE, one of the nation's leading ATM/debit networks; and Diners Club International, a global payments network with acceptance in more than 185 countries and territories. For more information, visit www.discover.com/company .\nA financial summary follows. Financial, statistical, and business related information, as well as information regarding business and segment trends, is included in the financial supplement filed as Exhibit 99.2 to the company's Current Report on Form 8-K filed today Commission (“SEC”). Both the earnings release and the financial supplement are available online at the SEC's website ( http://www.sec.gov ) and the company's website ( https://investorrelations.discover.com ).\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements, which speak to our expected business and financial performance, among other matters, contain words such as “believe,” “expect,” “anticipate,” “intend,” “plan,” “aim,” “will,” “may,” “should,” “could,” “would,” “likely,” and similar expressions. Such statements are based upon the current beliefs and expectations of the company's management and are subject to significant risks and uncertainties. Actual results may differ materially from those set forth in the forward-looking statements. These forward-looking statements speak only as of the date of this press release, and there is no undertaking to update or revise them as more information becomes available.\nThe following factors, among others, could cause actual results to differ materially from those set forth in the forward-looking statements: changes in economic variables, such as the availability of consumer credit, the housing market, energy costs, the number and size of personal bankruptcy filings, the rate of unemployment, the levels of consumer confidence and consumer debt, and investor sentiment; the impact of current, pending and future legislation, regulation, supervisory guidance, and regulatory and legal actions, including, but not limited to, those related to tax reform, financial regulatory reform, consumer financial services practices, anti-corruption, and funding, capital and liquidity; the actions and initiatives of current and potential competitors; the company's ability to manage its expenses; the company's ability to successfully achieve card acceptance across its networks and maintain relationships with network participants; the company's ability to sustain and grow its non-card products; difficulty obtaining regulatory approval for, financing, closing, transitioning, integrating or managing the expenses of acquisitions of or investments in new businesses, products or technologies; the company's ability to manage its credit risk, market risk, liquidity risk, operational risk, compliance and legal risk, and strategic risk; the availability and cost of funding and capital; access to deposit, securitization, equity, debt and credit markets; the impact of rating agency actions; the level and volatility of equity prices, commodity prices and interest rates, currency values, investments, other market fluctuations and other market indices; losses in the company's investment portfolio; limits on the company's ability to pay dividends and repurchase its common stock; limits on the company's ability to receive payments from its subsidiaries; fraudulent activities or material security breaches of key systems; the company's ability to remain organizationally effective; the company's ability to increase or sustain Discover card usage or attract new customers; the company's ability to maintain relationships with merchants; the effect of political, economic and market conditions, geopolitical events and unforeseen or catastrophic events; the company's ability to introduce new products or services; the company's ability to manage its relationships with third-party vendors; the company's ability to maintain current technology and integrate new and acquired systems; the company's ability to collect amounts for disputed transactions from merchants and merchant acquirers; the company's ability to attract and retain employees; the company's ability to protect its reputation and its intellectual property; and new lawsuits, investigations or similar matters or unanticipated developments related to current matters. The company routinely evaluates and may pursue acquisitions of or investments in businesses, products, technologies, loan portfolios or deposits, which may involve payment in cash or the company's debt or equity securities.\nAdditional factors that could cause the company's results to differ materially from those described in the forward-looking statements can be found under “Risk Factors,” “Business - Competition,” “Business - Supervision and Regulation” and “Management's Discussion and Analysis of Financial Condition and Results of Operations” in the company's Annual Report on Form 10-K for the 2016, and \"Management's Discussion & Analysis of Financial Condition and Results of Operations\" in the company's Quarterly Report on Form 10-Q for the quarters ended September 30, 2017, June 30, 2017, and March 31, 2017, which are filed with the SEC and available at the SEC's internet site ( http://www.sec.gov ).\nDISCOVER FINANCIAL SERVICES (unaudited, in millions, except per share statistics) Quarter Ended December September December\n31, 2017 30, 2017 31, 2016\nEARNINGS SUMMARY\nInterest Income $2,556 $2,476 $2,258 Interest Expense 436 426 366 Net Interest Income 2,120 2,050 1,892 Discount/Interchange Revenue 717 675 665 Rewards Cost\n434 417 411 Discount and Interchange Revenue, net 283 258 254 Protection Products Revenue 54 55 59 Loan Fee Income 96 95 93 Transaction Processing Revenue 43 43 40 Other Income 18 24 20 Total Other Income 494 475 466 Revenue Net of Interest Expense 2,614 2,525 2,358 Provision for Loan Losses 679 674 578 Employee Compensation and Benefits 411 371 352 Marketing and Business Development 213 203 176 Information Processing & Communications 80 78 81 Professional Fees 189 163 152 Premises and Equipment 26 25 23 Other Expense 117 108 113 Total Other Expense 1,036 948 897 Income Before Income Taxes 899 903 883 Tax Expense 512 301 320 Net Income $387 $602 $563 Net Income Allocated to Common Stockholders $359 $589 $550 PER SHARE STATISTICS\nBasic EPS $0.99 $1.59 $1.40 Diluted EPS $0.99 $1.59 $1.40 Common Stock Price (period end) $76.92 $64.48 $72.09 Book Value per share $30.43 $30.56 $29.13 SEGMENT- INCOME BEFORE INCOME TAXES\nDirect Banking $870 $867 $868 Payment Services 29 36 15 Total $899 $903 $883 BALANCE SHEET SUMMARY\nTotal Assets $100,087 $97,608 $92,308 Total Liabilities 89,195 86,421 80,985 Total Equity 10,892 11,187 11,323 Total Liabilities and Stockholders' Equity $100,087 $97,608 $92,308 TOTAL LOAN RECEIVABLES\nEnding Loans 1, 2 $84,248 $80,443 $77,254 Average Loans 1, 2 $81,802 $79,189 $74,775 Interest Yield 12.14% 12.15% 11.88% Gross Principal Charge-off Rate 3.45% 3.26% 2.91% Gross Principal Charge-off Rate excluding PCI Loans 3 3.54% 3.35% 3.02% Net Principal Charge-off Rate 2.85% 2.63% 2.31% Net Principal Charge-off Rate excluding PCI Loans 3 2.92% 2.71% 2.39% Delinquency Rate (over 30 days) excluding PCI Loans 3 2.20% 2.05% 1.97% Delinquency Rate (over 90 days) excluding PCI Loans 3 0.99% 0.91% 0.87% Gross Principal Charge-off Dollars $711 $651 $548 Net Principal Charge-off Dollars $583 $527 $435 Net Interest and Fee Charge-off Dollars $119 $107 $94 Loans Delinquent Over 30 Days 3 $1,806 $1,605 $1,469 Loans Delinquent Over 90 Days 3 $815 $709 $652 Allowance for Loan Loss (period end) $2,621 $2,531 $2,167 Reserve Change Build/ (Release) 4 $96 $147 $143 Reserve Rate 3.11% 3.15% 2.80% Reserve Rate excluding PCI Loans 3 3.15% 3.20% 2.86% CREDIT CARD LOANS\nEnding Loans $67,291 $63,475 $61,522 Average Loans $64,791 $62,647 $59,121 Interest Yield 12.79% 12.83% 12.62% Gross Principal Charge-off Rate 3.73% 3.53% 3.19% Net Principal Charge-off Rate 3.03% 2.80% 2.47% Delinquency Rate (over 30 days) 2.28% 2.14% 2.04% Delinquency Rate (over 90 days) 1.12% 1.02% 0.97% Gross Principal Charge-off Dollars $612 $555 $474 Net Principal Charge-off Dollars $496 $439 $369 Loans Delinquent Over 30 Days $1,532 $1,359 $1,252 Loans Delinquent Over 90 Days $751 $646 $597 Allowance for Loan Loss (period end) $2,147 $2,091 $1,790 Reserve Change Build/ (Release) $56 $111 $129 Reserve Rate 3.19% 3.29% 2.91% Total Discover Card Volume $38,574 $35,581 $35,440 Discover Card Sales Volume $35,339 $32,161 $32,486 Rewards Rate 1.23% 1.30% 1.26% NETWORK VOLUME\nPULSE Network $42,386 $39,828 $35,554 Network Partners 3,280 3,811 3,235 Diners Club International 5 8,373 7,989 7,334 Total Payment Services 54,039 51,628 46,123 Discover Network - Proprietary 36,267 33,576 34,029 Total $90,306 $85,204 $80,152 1 Total Loans includes Home Equity and other loans. 2 Purchased Credit Impaired (\"PCI\") loans are loans that were acquired in which a deterioration in credit quality occurred between the origination date and the acquisition date. These loans were initially recorded at fair value and accrete interest income over the estimated lives of the loans as long as cash flows are reasonably estimable, even if the loans are contractually past due. PCI loans are private student loans and are included in total loan receivables.\n3 Excludes PCI loans (described above) which are accounted for on a pooled basis. Since a pool is accounted for as a single asset with a single composite interest rate and aggregate expectation of cash flows, the past-due status of a pool, or that of the individual loans within a pool, is not meaningful. Because the Company is recognizing interest income on a pool of loans, it is all considered to be performing.\n4 Allowance for loan loss includes the net change in reserves on PCI pools having no remaining non-accretable difference which does not impact the reserve change build/(release) in provision for loan losses.\n5 Volume is derived from data provided by licensees for Diners Club branded cards issued outside of North America and is subject to subsequent revision or amendment.\nNote: See Glossary for definitions of financial terms in the financial supplement which is available online at the SEC's website ( http://www.sec.gov ) and the Company's website ( http://investorrelations.discoverfinancial.com ).\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124006230/en/\nDiscover Financial Services\nInvestors:\nCraig Streem, 224-405-5923\ncraigstreem@discover.com\nor\nMedia:\nJon Drummond, 224-405-1888\njondrummond@discover.com\nSource: Discover Financial Services", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Finvestorrelations.discover.com&esheet=51747928&newsitemid=20180124006230&lan=en-US&anchor=https%3A%2F%2Finvestorrelations.discover.com&index=4&md5=ef318e5a7f641cbdf7f0ffb632961aa7", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51747928&newsitemid=20180124006230&lan=en-US&anchor=http%3A%2F%2Fwww.sec.gov&index=3&md5=9ce219f1a17a4ea0a9df99414360ba64", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51747928&newsitemid=20180124006230&lan=en-US&anchor=http%3A%2F%2Fwww.sec.gov&index=6&md5=7fcbc76ce0aa8c34669779da4483a5bd", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.discover.com%2Fcompany&esheet=51747928&newsitemid=20180124006230&lan=en-US&anchor=www.discover.com%2Fcompany&index=2&md5=06fb34257c151218bc6844af73b7cd61", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestorrelations.discoverfinancial.com&esheet=51747928&newsitemid=20180124006230&lan=en-US&anchor=http%3A%2F%2Finvestorrelations.discoverfinancial.com&index=7&md5=17aa32436d3792a86804ce140756b1ac", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Finvestorrelations.discover.com&esheet=51747928&newsitemid=20180124006230&lan=en-US&anchor=https%3A%2F%2Finvestorrelations.discover.com&index=1&md5=5428f171fa8605632d81db83a4dc0ef6", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51747928&newsitemid=20180124006230&lan=en-US&anchor=http%3A%2F%2Fwww.sec.gov&index=5&md5=2298f7b2dedff47fca5d36e92fafc6eb", "http://www.businesswire.com/news/home/20180124006230/en/"], "published": "2018-01-25T00:21:00.000+02:00", "crawled": "2018-01-25T01:36:31.000+02:00", "highlightTitle": ""}