{"organizations": [], "uuid": "968979e26ab4cde2c6c158188a6deaf85afe03ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222287552&w=1200&r=LYNXMPEE0F01P", "site_section": "http://feeds.feedburner.com/reuters/UKTennisNews", "section_title": "Reuters: Tennis News", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-konta/tennis-aggressive-konta-makes-light-work-of-brengle-idUKKBN1F503G", "country": "US", "domain_rank": 408, "title": "Tennis-Aggressive Konta makes light work of Brengle", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T03:33:00.000+02:00", "replies_count": 0, "uuid": "968979e26ab4cde2c6c158188a6deaf85afe03ee"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-konta/tennis-aggressive-konta-makes-light-work-of-brengle-idUKKBN1F503G", "ord_in_thread": 0, "title": "Tennis-Aggressive Konta makes light work of Brengle", "locations": [], "entities": {"persons": [{"name": "konta", "sentiment": "negative"}, {"name": "tennis-aggressive konta", "sentiment": "negative"}, {"name": "brengle", "sentiment": "negative"}, {"name": "johanna konta", "sentiment": "none"}, {"name": "madison brengle", "sentiment": "none"}], "locations": [{"name": "hisense arena", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "melbourne park", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 1:46 AM / Updated 8 hours ago Aggressive Konta makes light work of Brengle Reuters Staff 3 Min Read \nMELBOURNE (Reuters) - Johanna Konta skipped past Madison Brengle into the second round of the Australian Open on Tuesday, the Briton overpowering her American opponent 6-3 6-1 in 66 minutes on Hisense Arena. Tennis - Australian Open - Hisense Arena, Melbourne, Australia, January 16, 2018. Johanna Konta of Britain celebrates winning her match against Madison Brengle of the U.S. REUTERS/Toru Hanai \nAustralia-born Konta, who reached the semi-finals at Melbourne Park two years ago, brushed off an early exit in her Sydney International title defence last week with an aggressive display that removed any doubts about her fitness. \nThe 26-year-old ninth seed hammered down eight aces and 37 winners, feasting on Brengle’s powderpuff serve and converting five of eight break points over the brief contest. \n“I am very happy with that match,” said a smiling Konta, who will meet another American, Bernarda Pera, in the second round. \n”I knew it would be tough, she gets a lot of balls back and makes her opponents work for it. \n“So really happy I was able to stick to the style of play I wanted.” \nBrengle had won three of their four previous meetings but grabbed her only break when already two down in the opening set and continued the exodus of American women that was a feature of day one at the year’s first grand slam. \nKonta started the match at a brisk pace and was soon carving out opportunities, grabbing her first break in the third game with a backhand winner down the line from the net. Tennis - Australian Open - Hisense Arena, Melbourne, Australia, January 16, 2018. Johanna Konta of Britain hits a shot to Madison Brengle of the U.S. REUTERS/Toru Hanai \nA thumping volley earned her a second for 5-2 and while Brengle broke straight back, a third break, secured when the American went long with a backhand, sealed the set. \n“I knew I had to stay very strong in my identity of how I wanted to play,” Konta added. \n“I wanted to make sure I was trusting in my shots regardless of where she was in the court and looking to move forward. I knew that was how I was going to give myself the best chance of creating opportunities.” \nThe world number 10 was hitting the ball well, particularly off the forehand, and the second set became a bit of a procession. \nShe needed five match points to finish off her 90th ranked opponent but finally sealed victory when Brengle ballooned a shot wide. \nKonta started working with Maria Sharapova’s former coach Michael Joyce in December and she said his perspective had already had a positive impact on her. \n“He understands pre-match jitters, he understands different thoughts that might go through your head at different stages of a match or leading into a tournament,” Konta said. \n“So I think he’s quite in tune with ebbs and flows of those sorts of things, so he’s able to guide me in a positive direction.” Reporting by Nick Mulvenney in Sydney, editing by Peter Rutherford", "external_links": [], "published": "2018-01-16T03:33:00.000+02:00", "crawled": "2018-01-16T03:55:55.005+02:00", "highlightTitle": ""}