{"organizations": [], "uuid": "288bfdbb6202379448bc0df72c8a7ff02a20b385", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-digipath-hires-molecular-biologist-biochemist-dr-kimberly-ross-phd-as-director-of-quality-systems.html", "country": "US", "domain_rank": 767, "title": "Digipath Hires Molecular Biologist|BioChemist Dr. Kimberly Ross, PhD, As Director of Quality Systems", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-29T17:00:00.000+02:00", "replies_count": 0, "uuid": "288bfdbb6202379448bc0df72c8a7ff02a20b385"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-digipath-hires-molecular-biologist-biochemist-dr-kimberly-ross-phd-as-director-of-quality-systems.html", "ord_in_thread": 0, "title": "Digipath Hires Molecular Biologist|BioChemist Dr. Kimberly Ross, PhD, As Director of Quality Systems", "locations": [], "entities": {"persons": [{"name": "kimberly ross", "sentiment": "negative"}, {"name": "cindy orser", "sentiment": "none"}, {"name": "ross", "sentiment": "none"}], "locations": [{"name": "las vegas", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "digipath, inc.", "sentiment": "neutral"}, {"name": "department of taxation", "sentiment": "none"}, {"name": "digipath labs", "sentiment": "none"}, {"name": "national environmental laboratory accreditation program) institute", "sentiment": "none"}, {"name": "quality systems", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LAS VEGAS, Jan. 29, 2018 /PRNewswire/ -- Digipath, Inc. (OTCQB: DIGP), a service-oriented independent cannabis testing laboratory and media firm focused on the developing cannabis market, announced that it has hired Dr. Kimberly Ross, PhD, a seasoned molecular microbiologist and biochemist, as its Director of Quality Systems for its wholly owned subsidiary, Digipath Labs.\nDr. Ross will lead the team responsible for implementing quality systems ensuring that all testing is conducted in compliance with Good Laboratory Practices, ISO-17205 standards and the regulations set by Nevada's Department of Taxation. Dr. Ross will also work directly with Chief Science Officer, Dr. Cindy Orser, PhD, in overseeing the proper training of all new lab personnel.\nDr. Ross brings to Digipath Labs experience as a Technical Director under the NELAC (National Environmental Laboratory Accreditation Program) Institute's rigorous accreditation program, where she was responsible for all aspects of data realization, client report generation, and laboratory operations within a compliant Quality Management System. Dr. Ross received her Ph.D. in Molecular, Cellular, and Developmental Biology from the University of Colorado, Boulder and her Bachelor of Science degree in Biochemistry from Montana State University in Bozeman and is an author of five peer-reviewed publications. Her previous work combining traditional water quality testing with molecular methodology to elucidate genomic microbial signatures across the nation's drinking water distribution systems is uniquely applicable to the frontier of cannabis science, where she sees great potential for the utility of cannabis genomic content.\nTodd Denkin, President and COO of Digipath said, \"We are thrilled that Dr. Ross has joined our team and I am confident that she will work with our current talented staff to prepare us for our ISO-17205 accreditation that is now mandatory for cannabis labs in Nevada.\"\nAbout Digipath, Inc. (OTCQB: DIGP)\nDigipath, Inc., supports the cannabis industry's best practices for reliable cannabis testing and education and brings unbiased cannabis news coverage to the cannabis industry.\nDigipath Labs provides pharmaceutical-grade analysis and testing to the cannabis industry to ensure producers, consumers and patients know exactly what is in the cannabis they ingest and to help maximize the quality of its client's products through analysis, research, development, and standardization.\nInformation about Forward-Looking Statements\nThis press release contains \"forward-looking statements\" that include information relating to future events. Forward-looking statements should not be read as a guarantee of future performance or results, and will not necessarily be accurate indications of the times at, or by, which that performance or those results will be achieved. Forward-looking statements are based on information available at the time they are made and/or management's good faith belief as of that time with respect to future events, and are subject to risks and uncertainties that could cause actual performance or results to differ materially from those expressed in, or suggested by, the forward-looking statements. Important factors that could cause these differences include, but are not limited to: the Company's need for additional funding, the demand for the Company's products, governmental regulation of the cannabis industry, the Company's ability to maintain customer and strategic business relationships, the impact of competitive products and pricing, growth in targeted markets, the adequacy of the Company's liquidity and financial strength to support its growth, and other risks that may be detailed from time-to-time in the Company's filings with the United States Securities and Exchange Commission. For a more detailed description of the risk factors and uncertainties affecting Digipath, please refer to the Company's recent Securities and Exchange Commission filings, which are available at www.sec.gov . The Company undertakes no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events, or otherwise.\nContact\nHarrison Phillips\nViridian Capital Advisors, LLC\n(212) 209-3086\nhphillips@viridianca.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/digipath-hires-molecular-biologistbiochemist-dr-kimberly-ross-phd-as-director-of-quality-systems-300589326.html\nSOURCE Digipath, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/digipath-hires-molecular-biologistbiochemist-dr-kimberly-ross-phd-as-director-of-quality-systems-300589326.html", "http://www.nelac-institute.org/content/CSDP/standards.php", "http://www.digipathlabs.com/", "http://www.digipath.com/"], "published": "2018-01-29T17:00:00.000+02:00", "crawled": "2018-01-29T19:36:03.000+02:00", "highlightTitle": ""}