{"organizations": [], "uuid": "7c0ecfb4f62c4508f082fd018c03ff437052931a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2016/03/gettyimages-509523378.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/05/google-play-flashlight-security/", "country": "US", "domain_rank": 1196, "title": "Google: 'LightsOut' Android Malware Removed From Google Play | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.119, "site_type": "news", "published": "2018-01-05T11:00:00.000+02:00", "replies_count": 0, "uuid": "7c0ecfb4f62c4508f082fd018c03ff437052931a"}, "author": "Jonathan Vanian", "url": "http://fortune.com/2018/01/05/google-play-flashlight-security/", "ord_in_thread": 0, "title": "Google: 'LightsOut' Android Malware Removed From Google Play | Fortune", "locations": [], "entities": {"persons": [{"name": "jonathan vanian", "sentiment": "negative"}, {"name": "padon", "sentiment": "none"}, {"name": "daniel padon", "sentiment": "none"}], "locations": [{"name": "check point", "sentiment": "none"}], "organizations": [{"name": "google", "sentiment": "negative"}, {"name": "check point software", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Jonathan Vanian 9:00 AM EST \nGoogle booted a number of apps from its online store that fooled people into believing they were helpful services, like flashlights and call recording apps, while spreading malware. \nCybersecurity company Check Point Software revealed the findings on Friday after discovering the fraudulent apps in November and notifying Google (goog) , which promptly removed the software from the Google Play store, said Check Point security researcher Daniel Padon. Although Check Point routinely notifies the search giant of malicious apps it discovers on the Google Play store in private, it will publicly reveal more egregious forms of malware that the company believes warrants more attention, he explained. \nPadon estimates that the malware, called LightsOut because if affects several flashlight apps, has been downloaded between 1.5 million to 7.5 million times. He based those numbers on publicly available download estimates from Google Play on each of the 22 different affected apps. \nTo trick people into installing the shady software, hackers gave the apps legitimate sounding names like “Voice Recorder Pro,” “WiFi Password Pro,” “Super Flashlight Lite,” and “Brightest LED Flashlight-Pro.” \nOnce downloaded and opened by users, the apps display a “settings” screen in which people can choose for the software to display online advertising. But this choice is merely an illusion, since the apps can be controlled from outside servers to display unwanted ads, Padon said. \nThe deceiving apps then disappear from people’s home screens, making them hard to remove for those without technical skills. \n“My mother was infected by a similar adware once,” Padon recalled of older phony phantom apps. “She didn’t understand how to remove it in the first place.” \nGet Data Sheet , Fortune’s technology newsletter. \nA number of actions can cause unwanted ads to display on screens, including ending a phone call, locking the screen, or even plugging in a phone charger. \nAlthough the malware does not represent a “significant step forward” in technical complexity, it highlights “another step in the way adware manages to infiltrate Google Play,” said Padon. \nLightsOut shows that hackers “are becoming more sophisticated in the way they are managing to bypass Google Plays’ detections and continue to serve fraudulent ads,” he said. \nPadon praised Google’s (goog) overall security efforts in filtering shady apps from Google Play, especially so-called ransomware , in which the apps, once downloaded, can immediately block people from accessing their smartphone or scramble their documents unless they pay up. \nWhat Google struggles in, however, is discovering apps that perform covert tasks over a period of time in order to remain undetected instead of immediately engaging in fraud or other nefarious activities. And hackers are increasingly distributing malicious apps in the Google Play store, Padon said. \nBased on Check Point’s research, and not counting similar efforts by other security vendors , Padon estimates that from 2016 through 2017, the amount of malware downloads “at the very least doubled” on Google Play. In 2017, Check Point estimated between 35.5 and 106 million malicious app downloads from Google Play, compared to 15.5 to 20.5 million malicious app downloads in 2016. \n“It’s important to note that these numbers refer only to malware first discovered by Check Point, and do not include all malware we’ve detected, or malware detected by other vendors, so the total numbers probably exceed this by far,” he later added in an email. \nPadon recommends that Android phone users install some form of security software on their smartphones that can screen for bad apps. People should generally avoid installing flashlight apps too, because they appear to be a common way that hackers routinely spread malware . \n“I can’t really think of a good reason to install a flashlight app, but people continue to do so,” said Padon. “It is the cliché that keeps on giving.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-05T11:00:00.000+02:00", "crawled": "2018-01-05T19:46:28.004+02:00", "highlightTitle": ""}