{"organizations": [], "uuid": "087f52ff6c93738f955521b1b831f4a3bd6f685c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/usa-healthcare-charity/drug-charity-halts-patient-aid-after-u-s-health-agency-pulls-approval-idINKBN1EU1XI", "country": "US", "domain_rank": 408, "title": "Drug charity halts patient aid after U.S. health agency pulls approval", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T21:55:00.000+02:00", "replies_count": 0, "uuid": "087f52ff6c93738f955521b1b831f4a3bd6f685c"}, "author": "", "url": "https://in.reuters.com/article/usa-healthcare-charity/drug-charity-halts-patient-aid-after-u-s-health-agency-pulls-approval-idINKBN1EU1XI", "ord_in_thread": 0, "title": "Drug charity halts patient aid after U.S. health agency pulls approval", "locations": [], "entities": {"persons": [{"name": "nate raymond", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "caring voice coalition", "sentiment": "none"}, {"name": "medicare", "sentiment": "none"}, {"name": "u.s. department of health and human services office of inspector general", "sentiment": "none"}, {"name": "u.s. department of justice", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "hhs oig", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOSTON (Reuters) - One of the largest patient assistance charities in the United States said it will not provide financial aid in 2018 after the government revoked its approval to do so because of concerns that drugmakers had improper influence over the charity.\nCaring Voice Coalition’s decision prompted the U.S. Department of Health and Human Services Office of Inspector General on Friday to announce it would allow drugmakers to provide free drugs in 2018 to patients the charity had helped.\nThe HHS OIG had in November told the charity that it would rescind a favourable advisory opinion issued to the nonprofit that essentially gave it approval to help Medicare patients pay for drug co-payments.\nThe U.S. Department of Justice is investigating several drugmakers’ financial support of charities that offer assistance to people seeking help with covering out-of-pocket costs.\nDrug companies are prohibited from subsidizing co-payments for patients enrolled in the government healthcare program Medicare for people 65 and older. But companies may donate to non-profits providing co-pay assistance as long as the charities are independent.\nIn December, United Therapeutics Corp ( UTHR.O ) agreed to pay $210 million to resolve claims it used Caring Voice Coalition as a conduit to cover Medicare patients’ out-of-pocket drug costs in order to eliminate price sensitivity and to boost sales.\nIn a statement on Thursday announcing its 2018 policy, Caring Voice Coalition President Greg Smiley cited the step taken by the HHS OIG in November.\n“We are grateful to have been able to assist thousands of patients suffering with numerous chronic illnesses and remain committed to fulfilling our charitable mission of improving the lives of patients with chronic illnesses,” Smiley said.\nThe Mechanicsville, Virginia-based charity says it has provided support to more than 100,000 people since its founding in 2003. It raised $153 million from corporate donors in 2016.\nIn a letter released on Friday, Gregory Demske, HHS OIG’s chief counsel, said given the announcement, the agency would not pursue sanctions against drugmakers who in 2018 provide free drugs to patients the charity supported who were covered by federal health care programs.\n“We understand that some patients affected by this decision may face significant barriers to obtaining critical drugs,” Demske wrote to the Pharmaceutical Research and Manufacturers of America, the drug industry’s biggest lobbying group.\nThe agency has in the past taken the position that free drug programs, when not properly structured, can violate an anti-kickback statute.\nReporting by Nate Raymond in Boston; editing by Grant McCool\n ", "external_links": [], "published": "2018-01-05T21:55:00.000+02:00", "crawled": "2018-01-05T22:15:58.002+02:00", "highlightTitle": ""}