{"organizations": [], "uuid": "5854fc867c65f95a5ab9d16507e4388d74ff8a15", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180122.html", "section_title": "Archive News &amp; Video for Monday, 22 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-climatechange-geoengineering-nature/artificially-cooling-planet-may-pose-threat-to-plants-animals-idUSKBN1FB285", "country": "US", "domain_rank": 408, "title": "Artificially cooling planet may pose threat to plants, animals", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.751, "site_type": "news", "published": "2018-01-23T00:22:00.000+02:00", "replies_count": 0, "uuid": "5854fc867c65f95a5ab9d16507e4388d74ff8a15"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-climatechange-geoengineering-nature/artificially-cooling-planet-may-pose-threat-to-plants-animals-idUSKBN1FB285", "ord_in_thread": 0, "title": "Artificially cooling planet may pose threat to plants, animals", "locations": [], "entities": {"persons": [{"name": "alan robock", "sentiment": "none"}], "locations": [{"name": "rome", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "department of environmental sciences", "sentiment": "none"}, {"name": "rutgers university-new brunswick", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ROME (Thomson Reuters Foundation) - Spraying chemicals into the earth’s upper atmosphere to reflect more sunlight away from the planet could be one means of coping with runaway climate change, some scientists say.\nBut employing the controversial “geoengineering” technique carries a range of risks - including that if such spraying was unexpectedly stopped, a rapid surge in heat on the planet would have “devastating” effects on plants and animals, according to a study published Monday.\n”If geoengineering ever stopped abruptly, it would be devastating. So you would have to be sure that it could be stopped gradually, and it is easy to think of scenarios that would prevent that,” said co-author Alan Robock of the Department of Environmental Sciences at Rutgers University-New Brunswick.\nThose might include war, a terrorist attack on facilities that carry out the spraying or political changes of heart, the study noted.\n“Imagine large droughts or floods around the world that could be blamed on geoengineering, and demands that it stop. Can we ever risk that?” the climate scientist added.\nResearch into “geoengineering” - technologies that could potentially deal with runaway climate change by artificially modifying how reflective the earth is, or sucking excess carbon dioxide out of the atmosphere - is on the upswing as the world edges closer to moving beyond what are seen as relatively safe levels of climate change.\nUnder the Paris agreement on climate change, countries have pledged to keep global warming to well below 2 degrees Celsius above industrial levels, with an aim of 1.5 degrees.\nBut unless national plans to curb emissions are ramped up quickly, the Earth is expected to warm by at least 3 degrees Celsius by the end of the century - a level expected to melt much of the world’s ice and spur worsening crop failures, extreme weather and sea level rise.\nThe earth has already warmed more than 1 degree Celsius above pre-industrial levels, and this warming has been blamed for last year’s devastating hurricanes, droughts and floods.\nSpraying sulphur dioxide and other particles into the planet’s upper atmosphere would create a cloud of sulphuric acid that reflects some of the sun’s rays, cooling the planet, researchers say.\nThe largely untested technology mimics the effects of volcanic eruptions, and could be deployed with modified airplanes, balloons or other delivery devices, they say.\nBut critics warn that it could change fundamental earth processes in hard-to-predict and potentially hugely problematic ways, such as shifting the focus of Asia’s monsoons.\nSupporters of the technology say countries will not curb their emissions fast enough to keep global warming within relatively safe levels, so solutions need to be prepared and tested in order found to protect lives.\nBesides increasingly the reflectivity of the earth, other technological proposals to deal with dangerous climate change include sucking greenhouse gases from the air and storing them underground - or planting huge areas of the earth to forests, which would then be burned for energy with emissions also stored underground.\nMore research urgently needs to be done into the different impacts of geoengineering, including its impacts on plants and animals, Robock said.\n“(We need to) evaluate both the benefits and the risks to see whether this would ever make sense to do. And if the answer is no, we need to know that sooner rather than later so we can put even more emphasis on mitigation,” Robock told the Thomson Reuters Foundation.\nThe study was published online in the journal Nature Ecology & Evolution.\nReporting by Alex Whiting; editing by Laurie Goering :; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, climate change, resilience, women's rights, trafficking and property rights. Visit news.trust.org/climate\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html", "http://news.trust.org/climate"], "published": "2018-01-23T00:22:00.000+02:00", "crawled": "2018-01-23T18:06:58.007+02:00", "highlightTitle": ""}