{"organizations": [], "uuid": "940a0f59388e8995dffa4e88156c1b0b742b07a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220948620&w=1200&r=LYNXMPEE091JR", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-canada-funds-rates/caisse-boss-urges-bank-of-canada-to-be-cautious-on-rate-rises-idUSKBN1EZ2VV", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Caisse boss says U.S. NAFTA pullout would lead to more talks", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T00:46:00.000+02:00", "replies_count": 0, "uuid": "940a0f59388e8995dffa4e88156c1b0b742b07a5"}, "author": "", "url": "https://www.reuters.com/article/us-canada-funds-rates/caisse-boss-urges-bank-of-canada-to-be-cautious-on-rate-rises-idUSKBN1EZ2VV", "ord_in_thread": 0, "title": "UPDATE 1-Caisse boss says U.S. NAFTA pullout would lead to more talks", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "michael sabia", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "quebec", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "nafta", "sentiment": "negative"}, {"name": "u.s. nafta", "sentiment": "negative"}, {"name": "reuters breakingviews", "sentiment": "none"}, {"name": "bank of canada", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO (Reuters) - Caisse de Depot et Placement du Quebec’s [CDPDA.UL] Chief Executive Michael Sabia said he believes that if U.S. President Donald Trump abandons the North American Free Trade Agreement with Canada and Mexico, the United States would then negotiate a new deal with Canada.\nSabia was speaking at a Thomson Reuters Breakingviews event in Toronto discussing predictions for 2018 alongside Brookfield Asset Management ( BAMa.TO ) Chief Executive Bruce Flatt, who said he believed the number of jobs leaving the UK financial services industry following Brexit would be less than 7,000.\nCanada is increasingly convinced that Trump will soon announce the United States intends to pull out of NAFTA, Reuters reported on Wednesday, sending the Canadian and Mexican currencies lower and hurting stocks.\n“If that happens, my view is that is just a prelude to another negotiation,” Sabia said. “We need to think about that in the context of making sure that we handle things in a way that we are well positioned for the subsequent negotiation because it’s hard to imagine that there is never another trade agreement.”\nSabia said other factors, such as entrepreneurial activity, could help mitigate the impact of the NAFTA talks failing.\nSlideshow (5 Images) “The future sources of jobs and growth in the Canadian economy are going to come from elsewhere,” he said. “It’s not as though Canada is some baby seal waiting to be slaughtered.”\nSabia urged the Bank of Canada on Wednesday to take a cautious approach to interest rate rises, however, saying the country’s economy faced future headwinds.\n“The Bank of Canada needs to be very careful about being too aggressive. I think there are longer-term structural headwinds in the Canadian economy,” he said.\nThe Caisse and Brookfield are big investors in the UK. Flatt said there were increased opportunities due to lower valuations following the Brexit vote, particularly in real estate with firms still looking to open offices and employ more staff in London.\nHe cited an example of a new office Brookfield has recently built for Amazon in Shoreditch, close to the City of London, in which it is housing 7,000 new staff, having had none in Britain’s capital ten years ago.\n“There will not be 7,000 jobs in financial services lost in London (after Brexit). On balance, one company has added more jobs than will be lost,” he said.\nReporting by Matt Scuffham; Editing by Lisa Shumaker and Diane Craft\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-11T00:46:00.000+02:00", "crawled": "2018-01-11T01:08:12.001+02:00", "highlightTitle": ""}