{"organizations": [], "uuid": "a1529fbc98488390a42ced65f6b896508a6e145a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222447383&w=1200&r=LYNXMPEE0F11D", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews/", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-yemen-security-un/u-n-hopes-imports-will-help-stave-off-famine-in-yemen-as-diphtheria-spreads-idUKKBN1F516M", "country": "US", "domain_rank": 408, "title": "U.N. hopes imports will help stave off famine in Yemen as diphtheria spreads", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T16:49:00.000+02:00", "replies_count": 0, "uuid": "a1529fbc98488390a42ced65f6b896508a6e145a"}, "author": "", "url": "https://uk.reuters.com/article/us-yemen-security-un/u-n-hopes-imports-will-help-stave-off-famine-in-yemen-as-diphtheria-spreads-idUKKBN1F516M", "ord_in_thread": 0, "title": "U.N. hopes imports will help stave off famine in Yemen as diphtheria spreads", "locations": [], "entities": {"persons": [{"name": "abdullah  yemen", "sentiment": "none"}, {"name": "stephanie nebehay", "sentiment": "none"}], "locations": [{"name": "yemen", "sentiment": "none"}, {"name": "geneva", "sentiment": "none"}, {"name": "riyadh", "sentiment": "none"}, {"name": "sanaa", "sentiment": "none"}], "organizations": [{"name": "u.n.", "sentiment": "negative"}, {"name": "united nations", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 11:06 AM / Updated 5 hours ago U.N. hopes imports will help stave off famine in Yemen as diphtheria spreads Stephanie Nebehay 3 Min Read \nGENEVA (Reuters) - United Nations aid agencies called on Tuesday for the Yemeni port of Hodeidah to remain open beyond Friday, the date set by a Saudi-led military coalition, to permit continued delivery of life-saving goods. A nurse holds a premature baby in an incubator at the child care unit of a hospital in Sanaa, Yemen January 16, 2018. REUTERS/Khaled Abdullah \nYemen is the world’s worst humanitarian crisis, where 8.3 million people are entirely dependent on external food aid and 400,000 children suffer from severe acute malnutrition, a potentially lethal condition, they said. \nThe Arab coalition, under international pressure, eased a three-week blockade which was imposed on Yemeni ports and airports in November in response to a ballistic missile fired by the Houthi movement toward the Saudi capital Riyadh. \nFour mobile cranes arrived in the important Houthi-controlled Hodeidah port, the U.N. said on Monday, after the coalition agreed to let them into Yemen, where nearly three years of war have pushed it to the verge of famine. \n“The port in theory is going be open to the 19th of this month. Then we don’t know if the coalition will close or (leave) it open,” Meritxell Relano, U.N. Children’s Fund (UNICEF) Representative in Yemen, told a news briefing in Geneva. \n“Obviously the feeling is that they extend this period so that the commercial goods can come in, but especially the fuel,” she said, speaking from the capital Sanaa. \nBefore the conflict, Hodeidah port handled around 70 percent of Yemen’s imports, including food and humanitarian supplies. Children sit with their mothers in beds at a hospital in Sanaa, Yemen January 16, 2018. REUTERS/Khaled Abdullah \nFuel is vital to power water and sanitation stations to provide clean water and help avoid diseases, she said. \nMore than 11 million Yemeni children - virtually all - need humanitarian assistance, Relano said. UNICEF figures show 25,000 Yemeni babies die at birth or before the age of one month. \n“Yemen is in the grips of the world’s biggest hunger crisis,” World Food Programme (WFP) spokeswoman Bettina Luescher said. “This is a nightmare that is happening right now.” A child lies in a bed at a hospital in Sanaa, Yemen January 16, 2018. REUTERS/Khaled Abdullah \n“We appeal to parties on (the) ground in order to stave off famine that we can continue regularly to get food in, to get medicines in, to get fuel in, be it from the humanitarian or the commercial side,” she said. \nLuescher, asked about prospects for the Hodeidah port lifeline to remain open, replied: “Obviously since the cranes were imported and are operational, we are hopeful and optimistic that our work can continue.” \nA diphtheria outbreak in Yemen is “spreading quickly”, with 678 cases and 48 associated deaths in four months, Fadela Chaib of the World Health Organisation said. \nThe number of cases has doubled since Dec 22, when the WHO reported 333 people affected by the highly-contagious disease, with 35 deaths. Ibb and Hodeidah are the worst-hit of the 19 affected governorates, Chaib said. \n“We can stop the outbreak by providing antibiotics and also vaccinating,” she said. Some 2.5 million doses have been imported for a planned immunization campaign, she said. Reporting by Stephanie Nebehay; Editing by Larry King, William Maclean", "external_links": [], "published": "2018-01-16T16:49:00.000+02:00", "crawled": "2018-01-16T19:57:34.018+02:00", "highlightTitle": ""}