{"organizations": [], "uuid": "090fa1bc127fc841988b4aae951269f4c5a8dd54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-atara-biotherapeutics-announces-proposed-offering-of-common-stock.html", "country": "US", "domain_rank": 767, "title": "Atara Biotherapeutics Announces Proposed Offering of Common Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T00:01:00.000+02:00", "replies_count": 0, "uuid": "090fa1bc127fc841988b4aae951269f4c5a8dd54"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-atara-biotherapeutics-announces-proposed-offering-of-common-stock.html", "ord_in_thread": 0, "title": "Atara Biotherapeutics Announces Proposed Offering of Common Stock", "locations": [], "entities": {"persons": [], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "atara biotherapeutics", "sentiment": "negative"}, {"name": "atara biotherapeutics, inc.", "sentiment": "neutral"}, {"name": "cowen", "sentiment": "none"}, {"name": "j.p. morgan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SOUTH SAN FRANCISCO, Calif., Jan. 02, 2018 (GLOBE NEWSWIRE) -- Atara Biotherapeutics, Inc. (Nasdaq:ATRA), a leading off-the-shelf T-cell immunotherapy company developing novel treatments for patients with cancer, autoimmune and viral diseases, today announced that it has commenced an underwritten public offering of $100,000,000 of its shares of common stock. In addition, Atara Biotherapeutics expects to grant the underwriters a 30-day option to purchase up to an additional $15,000,000 of shares of its common stock at the public offering price, less the underwriting discounts and commissions. All of the shares in the offering will be sold by Atara Biotherapeutics. The offering is subject to market and other conditions, and there can be no assurances as to whether or when the offering may be completed, or as to the actual size or terms of the offering.\nJ.P. Morgan and Cowen are acting as joint book-running managers for the proposed offering.\nThe shares described above are being offered by Atara Biotherapeutics pursuant to a shelf registration statement on Form S-3, including a base prospectus, that was previously filed by Atara Biotherapeutics with the Securities and Exchange Commission (the “SEC”) on November 9, 2015 and became effective on November 23, 2015. A preliminary prospectus supplement and accompanying prospectus relating to the offering will be filed with the SEC and will be available on the SEC’s website located at http://www.sec.gov . Copies of the preliminary prospectus supplement and the accompanying prospectus related to this offering, when available, may be obtained from J.P. Morgan, by mail at J. P. Morgan Securities LLC, c/o Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, NY 11717 or by telephone at 866-803-9204; or from Cowen, by mail at Cowen and Company, LLC, c/o Broadridge Financial Services, Attention: Prospectus Department, 1155 Long Island Avenue, Edgewood, NY 11717 or by telephone at 631-274-2806. The final terms of the offering will be disclosed in a final prospectus supplement to be filed with the SEC.\nThis press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to the registration or qualification under the securities laws of any such jurisdiction.\nAbout Atara Biotherapeutics, Inc.\nAtara Biotherapeutics, Inc. ( @Atarabio ) is a leading T-cell immunotherapy company developing novel treatments for patients with cancer, autoimmune and viral diseases.\nForward-Looking Statements\nThis press release contains or may imply “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. For example, forward-looking statements include statements regarding: the completion, timing and size of its proposed public offering. These statements are subject to various risks and uncertainties, actual results could differ materially from those projected and Atara Biotherapeutics cautions investors not to place undue reliance on the forward-looking statements in this press release. These risks and uncertainties include, without limitation, risks and uncertainties related to market conditions and satisfaction of customary closing conditions related to the public offering. There can be no assurance that Atara Biotherapeutics will be able to complete the public offering on the anticipated terms, or at all. Risks and uncertainties relating to Atara Biotherapeutics and its business can be found under the heading “Risk Factors” in Atara Biotherapeutics’ quarterly report on Form 10-Q filed with the SEC on November 9, 2017, and in the preliminary prospectus supplement related to the proposed offering to be filed with the SEC. Except as otherwise required by law, Atara Biotherapeutics disclaims any intention or obligation to update or revise any forward-looking statements, which speak only as of the date hereof, whether as a result of new information, future events or circumstances or otherwise.\nINVESTOR & MEDIA CONTACTS:\nInvestors:\nJohn Craighead, Atara Biotherapeutics\n650-410-3012\njcraighead@atarabio.com\nSteve Klass, Burns McClellan\n212-213-0006 x331\nsklass@burnsmc.com\nMedia:\nJustin Jackson, Burns McClellan\n212-213-0006 x327\njjackson@burnsmc.com\nSource:Atara Biotherapeutics, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=uv4kZysbVEBuZPfWBPUDpecgR6TAPKEk4DxeuUDJtEOIrQ5aMin84HKGBZ-8YyWD68EZLA8J1S09BGAL5IXf0DPjU1fYf9JlVZYkNzirZRQ=", "https://www.globenewswire.com/Tracker?data=-aedKkAXyhHm2RiUihwurDBuZXoeki9x0saiK0JJ0DR7ybKsBbHTR7xpidvT_T7rwejzMhBvPwFuseGFxE0kkr5Y88-ZNDaQ7j3VFp53Sa4Lv2W_6xMGUbZ7dhiLvrlVC5QDZIQq4UHzxrCeni3QMc11V8KzTc5Ajnu-taqMDLFK9oLfNjAurM7nxvSTHj3wzCRGfm1Z8Ymps8nQbFNwV0w_9lisFvmQ_7vmot8GhI4=", "https://www.globenewswire.com/Tracker?data=XjSIYhVk56aHOz7Yt_UDrFdtkgTS2toaVvvnoGjBKIDW2oux01Bi2EaylAvfl3kDNaEHPjjiX0Tg5rlLUho-mWnk2OvKBCE02c1h4g6mU5HEvlw-NC7gOZ_QpXDdY4LEGAaAPZ1yb1Wdbi6FLf8Xqqz5eDWNxYIJePGFYSu3yeNiKoxg6COvMLCXUWC1Oo5Dagky9mNpE1BvFiHBBiJKG3Jlx40TmqRuwZhqLB_0sFBSTVOoj2rddfsorDmGNKRJz8-gB29EOSeHwMlJ58SeYg==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/2db0dc4b-aeb8-4fb6-abeb-92c8c6fcc4a3", "https://www.globenewswire.com/Tracker?data=-ZlUmiBOGH-BvTwe-Wgl6OYhjv8T86GvY6LX4GQs3ApWTtGbfeHBjZWM9LhpkiIT2Lj3AiGN5RvZNIzFnBbBQzNTH2qUcfwZc5imc4roi1c=", "https://www.globenewswire.com/Tracker?data=CfyFPeq7N1crv7gphEHGsoeqPnykRkKHmnly6xGnmUm5MK2-nYbkuthHw9FXnBBSSbkq9q74d6N6c7zvOjwXkhKzQjs2e9x7T8MlPPDqsXs="], "published": "2018-01-03T00:01:00.000+02:00", "crawled": "2018-01-03T02:07:32.001+02:00", "highlightTitle": ""}