{"organizations": [], "uuid": "5a9a1050d09ad51eac79bc9ed4575b0f7dd9cb3c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/13/104838605-GettyImages-531139300.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/11/richard-branson-and-elon-musks-mothers-taught-them-this-life-lesson.html", "country": "US", "domain_rank": 767, "title": "Richard Branson and Elon Musk's mothers taught them this life lesson", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.79, "site_type": "news", "published": "2018-01-11T20:30:00.000+02:00", "replies_count": 0, "uuid": "5a9a1050d09ad51eac79bc9ed4575b0f7dd9cb3c"}, "author": "Zameena Mejia", "url": "https://www.cnbc.com/2018/01/11/richard-branson-and-elon-musks-mothers-taught-them-this-life-lesson.html", "ord_in_thread": 0, "title": "Richard Branson and Elon Musk's mothers taught them this life lesson", "locations": [], "entities": {"persons": [{"name": "elon musk", "sentiment": "neutral"}, {"name": "richard branson", "sentiment": "neutral"}, {"name": "michael kovac", "sentiment": "neutral"}, {"name": "musk", "sentiment": "none"}, {"name": "tesla", "sentiment": "none"}, {"name": "branson", "sentiment": "none"}, {"name": "eve branson", "sentiment": "none"}, {"name": "ricky", "sentiment": "none"}], "locations": [{"name": "beverly wilshire four seasons hotel", "sentiment": "none"}], "organizations": [{"name": "spacex", "sentiment": "none"}, {"name": "elon musk", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CNBC.com Michael Kovac | Getty Images Entertainment | Getty Images Richard Branson (L) and honoree Eve Branson attend the AltaMed Power Up, We Are The Future Gala at the Beverly Wilshire Four Seasons Hotel on May 12, 2016 SHARES \nSelf-made billionaires Richard Branson and Elon Musk are both at the forefront of transforming the way we travel. While Musk builds electric vehicles through Tesla and plans for humans to one day colonize space through SpaceX, Branson plans to offer the world's first commercial space flights through Virgin Galactic and high-speed underground railways through Virgin Hyperloop One. \nAlthough Branson, 67, and Musk, 46, have taken different paths to achieve success, both of their mothers taught them a crucial lesson while growing up: To get the results you want, you need to work hard and take risks. \n\"When I was younger, if I wasn't pulling my weight my mum would always say 'pull your socks up, Ricky!'\" Branson wrote in a recent blog post . Eve Branson: 'Life is too short to fear flying higher' \nEve Branson is a 95-year-old British philanthropist and author who's had an appetite for adventure since she was a young woman enlisted in the Women's Royal Naval Service (WRENS) to provide help during World War II. \n\"My mum always told me how life is too short to fear flying higher,\" Branson said. \nInstead of spoiling him as a child, Branson said his mother would challenge him to keep his feet on the ground and work at what he wanted. tweet \n\"My mum is a very adventurous person. She very much felt that she wanted us to stand on our own two feet and not to be 'mollycoddled,' as she would call it,\" the founder of Virgin Group told CNBC's \"The Brave Ones.\" \nIn another blog post , Branson said he is \"often flabbergasted by the amount of time some people waste dwelling on their past failures, rather than directing that energy into new projects,\" because his mother always taught him to \"never look back in regret, but to immediately move on to the next thing.\" \nBranson added that he felt extremely fortunate having supportive parents. show chapters 9:39 AM ET Thu, 19 Oct 2017 | 00:52 \n\"She has always inspired me to try new thin gs and to never be afraid of what comes next,\" Branson said. \nIn order to motivate others to be unafraid in their journeys, Branson recommended that other leaders follow his parents' lead. \n\"The next generation of entrepreneurs need to be nurtured and encouraged to allow them to fulfill their potential,\" he said. Maye Musk: 'The harder you work, the better you do and the luckier you get' \nAlthough Musk has stated in the past that he was \" raised by books \" and then his parents, he still receives plenty of support from his mother Maye Musk. \nMaye is a model, nutritionist and full-time fan of her three entrepreneurial kids Elon, Kimbal and Tosca Musk. The Musk siblings have their mom to thank for teaching them at a young age the importance of creating your own opportunities. tweet \n\"They grow up knowing you work hard, and the harder you work, the better you do and the luckier you get,\" Maye told Vanity Fair in 2015. \"They also had to be responsible for themselves, because they had to help me.\"", "external_links": [], "published": "2018-01-11T20:30:00.000+02:00", "crawled": "2018-01-11T20:36:31.015+02:00", "highlightTitle": ""}