{"organizations": [], "uuid": "4bf5532254c4e403735beb4081903f2d9598e056", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-ethixbase-appoints-new-chief-operating-officer.html", "country": "US", "domain_rank": 767, "title": "ethiXbase Appoints New Chief Operating Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T12:00:00.000+02:00", "replies_count": 0, "uuid": "4bf5532254c4e403735beb4081903f2d9598e056"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-ethixbase-appoints-new-chief-operating-officer.html", "ord_in_thread": 0, "title": "ethiXbase Appoints New Chief Operating Officer", "locations": [], "entities": {"persons": [{"name": "leas bachatene", "sentiment": "none"}, {"name": "richard", "sentiment": "none"}, {"name": "richard russell", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON, Jan. 24, 2018 /PRNewswire/ -- ethiXbase, a leading RegTech third party due diligence and risk management solutions provider today announced the appointment of Richard Russell as Chief Operating Officer, a new position based in the London operations of the rapidly growing company.\n\"Business communities today have never been more challenged by the risk of corruption within their supply chains. The time is now for organisations to know who they are doing business with, not just for those deemed high risk, but for all third parties across their entire business network,\" said Leas Bachatene, Chief Executive Officer of ethiXbase. \"Against this backdrop, we have made tremendous progress since launching the ethiXbase 2.0 100% third party compliance platform – helping our customers to leverage technology to monitor and manage every single third party relationships throughout their supply chain for effective anti-corruption compliance.\"\n\"Richard has an impressive track record in advancing business growth while ensuring operational excellence. Having him on board as COO is a key appointment to strengthen our senior executive leadership team. This will ensure we have the right organisational structure in place as we accelerate the technology-led transformation of our solutions to better serve and shape the business community as part of our collective mission to enhance business ethics and anti-corruption compliance,\" said Bachatene.\nEffective immediately, Richard will spearhead ethiXbase's roadmap of next generation product development, innovation and technology while heading up our London operations as the company expands its global footprint.\nFollowing his tenure with Lexis Nexis, Richard started his extensive career with Complinet UK Limited in 2004 as Business Solutions Director. He was a significant stakeholder in successfully developing Complinet's KYC/screening business, advancing technology, data and clients' acquisition for the organisation. By the time Richard left Complinet in 2011 (acquired by Thomson Reuters in 2010), he was Group Managing Director, Global Screening. He has since held various senior executive positions at Euromoney, Optimus Education and IFRS Foundation.\nAbout ethiXbase\nHeadquartered in Singapore, ethiXbase is a rapidly growing RegTech company driven by innovation and focused on achieving customer satisfaction. Known for making a difference with ethiXbase 2.0, the industry's leading end-to-end third party compliance and risk management platform, ethiXbase helps small businesses to major Fortune 500 brands achieve 100% third party compliance through advancements in technology, data, services and due diligence.\nFor more information on ethiXbase's third party due diligence solutions, visit www.ethiXbase.com/2-0\nContact\nNatasha Martin\n+65 6536 0084\nmarketing@ethiXbase.com\nRelated Links\nethiXbase 2.0\nView original content with multimedia: http://www.prnewswire.com/news-releases/ethixbase-appoints-new-chief-operating-officer-300586729.html\nSOURCE ethiXbase", "external_links": ["http://www.ethixbase.com/2-0", "http://www.prnewswire.com/news-releases/ethixbase-appoints-new-chief-operating-officer-300586729.html"], "published": "2018-01-24T12:00:00.000+02:00", "crawled": "2018-01-24T11:30:43.023+02:00", "highlightTitle": ""}