{"organizations": [], "uuid": "d5e0b833d928c360aec5bcee1856dc770f4b53ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/849890494.jpg", "site_section": "http://bizdailies.com/News/Rss", "section_title": "Biz Dailies: Business and Financial News Feed", "url": "http://fortune.com/2018/01/10/warren-buffett-tax-cut-companies-value/", "country": "US", "domain_rank": 1196, "title": "Warren Buffett: Tax Cut Will Make Companies More Valuable - Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T21:01:00.000+02:00", "replies_count": 0, "uuid": "d5e0b833d928c360aec5bcee1856dc770f4b53ea"}, "author": "", "url": "http://fortune.com/2018/01/10/warren-buffett-tax-cut-companies-value/", "ord_in_thread": 0, "title": "Warren Buffett: Tax Cut Will Make Companies More Valuable - Fortune", "locations": [], "entities": {"persons": [{"name": "warren buffe", "sentiment": "negative"}, {"name": "warren buffett warren buffett", "sentiment": "negative"}, {"name": "warren buffett", "sentiment": "negative"}, {"name": "forbes", "sentiment": "none"}, {"name": "daniel zuchnik", "sentiment": "none"}, {"name": "buffett", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "bnsf", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "bnsf railway", "sentiment": "none"}, {"name": "berkshire hathaway inc.", "sentiment": "none"}, {"name": "berkshire hathaway", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Warren Buffett Warren Buffett: Tax Cut Will Make Companies More Valuable Philanthropist Warren Buffett is joined onstage by 24 other philanthropist and influential business people featured on the Forbes list of 100 Greatest Business Minds during the Forbes Media Centennial Celebration at Pier 60 on September 19, 2017 in New York City. Daniel Zuchnik—WireImage/Getty Images By Bloomberg Updated: January 10, 2018 2:02 PM ET \nWarren Buffett said the U.S. tax cut will make companies more valuable by giving owners a bigger share of profits. \n“People who own the businesses, they now own 20 percent more of the domestic earnings,” Buffett, chief executive of Berkshire Hathaway Inc., said in an interview on CNBC Wednesday. \nDescribing the change as a “big deal,” he gave as an example Berkshire Hathaway’s BNSF Railway. \n“The government doesn’t own the assets of the business,” Buffett said. “We own 100 percent of the assets of BNSF, but we don’t own 100 percent of the profits. And we went from 65 to 79 percent of the profits of BNSF and that is a more than 20 percent increase.” \nStill, when asked about whether he would have pushed lawmakers to vote for or against the legislation, he chose another route. \n“I would have had a different bill,” he said. “If I did it as a representative of Berkshire shareholders, I would have had to vote for it.” \nHere are some of his other comments: On bitcoin: \nBuffett said he’s no fan of cryptocurrencies and is confident that the run up in their value is fleeting. “In terms of cryptocurrencies, generally, I can say almost with certainty that they will come to a bad ending. Now when it happens, or how or anything else, I don’t know. But I know this: If I could buy a five year put on every one of the cryptocurrencies, I’d be glad to do it but I would never short a dime’s worth.” On the stock market: \nStocks “are not richly valued relative to interest rates.” “Net we’re buying,” he said. “We’re basically buyers over time. There could be conditions under which we’re sellers. For one thing, the money keeps coming so we basically keep buying.” On IBM: \nBuffett was asked whether he’s been a buyer or seller of the stock. Berkshire owned 37 million shares of the company as of the end of September. “It was advantageous if you had a loss in shares and we did in some of IBM , it was advantageous to sell last year rather than this year,” he said. “It would certainly mean that if we had a high cost of IBM that we were selling, we would have sold it last year, and if we had low cost, we would have waited until this year. And we had some of both.” \nBerkshire Vice Chairman Charles Munger joined Buffett in the interview and also addressed succession at the conglomerate, saying shareholders probably have “seven or more good years coming out of Warren.” \nAsked how many they had for him, Munger, 94, said: “Not very many.” SPONSORED FINANCIAL CONTENT", "external_links": [], "published": "2018-01-10T21:01:00.000+02:00", "crawled": "2018-01-10T22:20:01.001+02:00", "highlightTitle": ""}