{"organizations": [], "uuid": "22c1bc1fe5eb7a405d0aa9ab7be5058b5a42986e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/06/gettyimages-669225524.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/09/california-legal-marijuana-coachella/", "country": "US", "domain_rank": 1196, "title": "Coachella Still Won't Allow Marijuana This Year | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.573, "site_type": "news", "published": "2018-01-09T02:00:00.000+02:00", "replies_count": 0, "uuid": "22c1bc1fe5eb7a405d0aa9ab7be5058b5a42986e"}, "author": "Tom Huddleston Jr.", "url": "http://fortune.com/2018/01/09/california-legal-marijuana-coachella/", "ord_in_thread": 0, "title": "Coachella Still Won't Allow Marijuana This Year | Fortune", "locations": [], "entities": {"persons": [{"name": "tom huddleston jr", "sentiment": "negative"}], "locations": [{"name": "coachella", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "indio", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Tom Huddleston Jr. January 9, 2018 \nWhat a buzzkill. Recreational marijuana has been legal under California law since Jan. 1 , but that doesn’t mean the newly-legit drug will be welcome at one of the state’s biggest music festivals this spring. \nGoldenvoice, the concert and festival promoter that operates the annual Coachella Valley Music and Arts Festival in Indio, Calif., has a message for concertgoers ahead of this year’s festival in April: leave the legal pot at home. The Frequently Asked Questions section of the Coachella website includes a boilerplate response about whether festival attendees can bring marijuana to the festival now that the drug is legal in all forms in California for anyone over the age of 21. \n“Sorry, bro,” reads that page of the website. “Marijuana or marijuana products aren’t allowed inside the Coachella Valley Music and Arts Festival. Even in 2018 and beyond.” \nThe website does leave open some possibility that the concert promoters’ policy could change someday, noting that if the marijuana rules at Coachella change, “we will update this answer.” The lineup at this year’s Coachella festival includes big-name musical acts such as Beyoncé, rapper Eminem, and singer The Weeknd. \nGoldenvoice’s stance may be especially deflating for marijuana-friendly Coachella attendees due to the fact that the final week of this year’s festival includes the date of April 20 (a Friday), which is the unofficial holiday for marijuana users worldwide. To be fair, though, medical marijuana has been legal in California for nearly two decades, but past Coachella festivals also have prohibited attendees with medical clearance to use the drug or bring it onto the festival grounds. \nLegal recreational marijuana sales kicked off in California in January, giving a boost to cannabis company stocks while promising a massive industry in the state that could bring in $1 billion in annual tax revenue. Meanwhile, marijuana remains illegal on the federal level, and Attorney General Jeff Sessions has recently taken steps that would allow federal prosecutors in states where weed is legal to decide whether to prosecute people over marijuana sales in a development that could threaten the burgeoning industry (or, at the very least, spur litigation from some of the states in question looking to keep the federal government from interfering with statewide legislation). SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-09T02:00:00.000+02:00", "crawled": "2018-01-10T07:11:01.000+02:00", "highlightTitle": ""}