{"organizations": [], "uuid": "ddcfa510dcd21246a7171ec2c2e160f6ddd225ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 46}, "facebook": {"likes": 81, "shares": 81, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/28/104972996-Strava_heatmap.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/28/global-heat-map-for-joggers-exposing-sensitive-us-military-information.html", "country": "US", "domain_rank": 767, "title": "Global heat map for joggers exposing sensitive US military information", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.591, "site_type": "news", "published": "2018-01-29T05:42:00.000+02:00", "replies_count": 0, "uuid": "ddcfa510dcd21246a7171ec2c2e160f6ddd225ae"}, "author": "Saheli Roy Choudhury", "url": "https://www.cnbc.com/2018/01/28/global-heat-map-for-joggers-exposing-sensitive-us-military-information.html", "ord_in_thread": 0, "title": "Global heat map for joggers exposing sensitive US military information", "locations": [], "entities": {"persons": [{"name": "strava", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "washington post", "sentiment": "none"}, {"name": "post", "sentiment": "none"}, {"name": "et sun", "sentiment": "none"}, {"name": "u.s. central command", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "An online heat map that shows where some people exercise could have revealed sensitive information about the locations and activities of soldiers at U.S. military bases, The Washington Post reported. \nSource: Strava A screenshot of the Strava heat map, which the company said comprised one billion recorded activities on its platform. Strava, the company behind the heat map, calls itself a \"social network for athletes.\" Users connect a GPS device to its service that allows them to upload their workout logs online. Those without a device can directly record their activities on Strava's mobile app. \nThe firm said the map was created using one billion recorded activities through September 2017 across 3 trillion latitude and longitude points. Data reflected on the map was not live, according to the Post. \nMost parts of the United States and Western Europe lit up on the map with plenty of recorded activities. But parts of Africa and the Middle East were entirely dark except for scattered dots of light in those areas.\nThe Post reported that by zooming in on war zones and deserts in countries like Iraq and Syria , locations and outlines of known U.S. military bases could be seen — along with other unknown and potentially sensitive sites. \nA spokesman for U.S. Central Command said Sunday that the U.S. military is looking into the implications of the map, according to the Post. But the military, the news outlet reported, did not respond to a question about existing regulations for using fitness-tracking apps. \nTo be clear, Google maps and public satellite images have previously showed the presence of military installations to the world, tech news outlet The Verge reported. It added that Strava's map provided additional context such as how people were moving about in those areas and how frequently they were doing so. \nMultiple news outlets reported that the map, which was posted online late last year, received widespread attention after a Twitter user pointed out it could contain potentially sensitive information. The user theorized that some of the tracks could be regular jogging routes for soldiers. \nNathan Ruser tweet: Strava released their global heatmap. 13 trillion GPS points from their users (turning off data sharing is an option). https://t.co/hA6jcxfBQI ... It looks very pretty, but not amazing for Op-Sec. US Bases are clearly identifiable and mappable. \nNathan Ruser tweet 2: If soldiers use the app like normal people do, by turning it on tracking when they go to do exercise, it could be especially dangerous. This particular track looks like it logs a regular jogging route. I shouldn't be able to establish any Pattern of life info from this far away. \nThe Post added that other journalists on Twitter were also weighing in on what they identified to be U.S. military bases. \nBen Taub tweet: Especially effective (as in dangerous?) in the Sahel. In Niger, you can instantly spot the French base in Madama, the U.S. base in Agadez ... I even found a base I didn't know about, just outside of Arlit—and Nigerian troops aren't jogging around with Fitbits. \nStrava urged users in a statement to check the firm's website to understand the privacy settings. \"Our global heatmap represents an aggregated and anonymized view of over a billion activities uploaded to our platform,\" a spokesman for the firm told CNBC, adding the map excluded activities that have been \"marked as private and user-defined privacy zones.\"\nClick here to read the full report from The Washington Post. \nClick here to read the full report from The Verge.", "external_links": [], "published": "2018-01-29T05:42:00.000+02:00", "crawled": "2018-01-29T05:42:17.000+02:00", "highlightTitle": ""}