{"organizations": [], "uuid": "100c52a52d325822be2df43da053ade416c42352", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-carboa-announces-fourth-quarter-and-fiscal-year-2017-results.html", "country": "US", "domain_rank": 767, "title": "CARBO® Announces Fourth Quarter and Fiscal Year 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-25T14:30:00.000+02:00", "replies_count": 0, "uuid": "100c52a52d325822be2df43da053ade416c42352"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-carboa-announces-fourth-quarter-and-fiscal-year-2017-results.html", "ord_in_thread": 0, "title": "CARBO® Announces Fourth Quarter and Fiscal Year 2017 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "houston", "sentiment": "none"}], "organizations": [{"name": "carbo", "sentiment": "negative"}, {"name": "carbo ceramics inc.", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON, Jan. 25, 2018 /PRNewswire/ -- CARBO Ceramics Inc. (NYSE: CRR) today reported financial results for the fourth quarter and fiscal year 2017.\nRevenue for the fourth quarter of 2017 of $60.3 million, an increase of 108% year-over-year and 20% sequentially. Revenue total for 2017 grew 83% compared to 2016. Revenue generated from the Oil and Gas sector grew 84% and revenue generated from the Industrial sector grew 76%. Our progress on the company's transformation strategy was substantial in 2017. We are building a more enduring company, with a more diversified product offering. Continued to improve net cash (used in) / provided by operating activities throughout 2017, which was ($19.1) million, ($15.8) million, ($5.2) million and $1.3 million in Q1'17, Q2'17, Q3'17, and Q4'17 respectively. Expect revenue and operating cash will continue to show improvement in the first half of 2018 compared to the first half of 2017.\nLogo - https://mma.prnewswire.com/media/128186/carbo_logo.jpg\nThe Company reported revenues of $60.3 million for the quarter ended December 31, 2017 compared to revenue of $29.1 million in the same period of 2016. Fourth quarter net cash provided by operations was $1.3 million compared to cash used in operations of ($12.7) million last year.\nCEO Gary Kolstad commented, \"Revenue for 2017 increased 83% compared to 2016 as we accelerated growth in oilfield ceramic technology products, industrial ceramics, oilfield sand and environmental product revenues. We set out on a multi-year strategy to transform the Company and emerge from the significant and prolonged oil and gas industry downturn, as a more diversified company with multiple revenue streams coming from both the Oil and Gas and Industrial sectors. Our Industrial business growth opportunities should lead to continued increases in their contribution to our overall revenue. We are executing on this transformation strategy by leveraging our leading technology, experienced operating personnel, marketing and sales expertise, and existing asset base.\n\"While we pioneered base ceramic proppant 38 years ago and expect to continue to be the industry leader, diversification away from our historical reliance of approximately 80% of our revenue being generated from base ceramic is necessary given the changing proppant buying habits of our clients during this last oil and gas downturn. I am very proud of our efforts in 2017, when we grew the Company's total revenue 83% and base ceramic proppant shrank to approximately 30% of our total revenue.\n\"We were pleased with the fourth quarter results as revenues increased 20% sequentially despite seeing a slowdown in oil and gas activity in December. Oilfield ceramic technology products and industrial ceramic products revenues increased significantly. Fourth quarter increases in base ceramic proppant demand resulted in the best quarter of the year for base ceramic sales after adjusting for the Russia proppant business, which we sold in the third quarter.\n\"We made many achievements in our industrial ceramics business during 2017. New products were launched successfully, and we achieved client growth in several end markets. New clients accounted for roughly one quarter of industrial sales in 2017. For example, in the foundry market we continue to see increased client interest in our industrial ceramic products as the new OSHA silica Permissible Exposure Limits (PEL) requirements are set to take effect in mid-2018. In addition to meeting OSHA requirements and improving worker safety, our ceramic media also provides our clients value through higher quality castings and reduction in operating costs.\n\"As noted last quarter, due to client demand we announced additional sand capacity utilizing an 'asset-lite' business model. First production from this project has commenced and we expect to ramp to a maximum annual rate of 600,000 tons as we enter the second quarter. This project increases our total available sand capacity to over 1.3 million tons per year.\n\"As previously mentioned, increasing the utilization of our manufacturing plants through mineral processing is important to the company's future profitability. In December, we signed a multi-year toll manufacturing agreement to be the exclusive toll processor for a product in the agricultural industry. This is a milestone for CARBO and we are pursuing additional opportunities to further increase utilization at our manufacturing plants.\n\"As part of our effort to drive cost efficiencies, we continue to optimize both our inventoried product levels and our logistics infrastructure; we have also redistributed production across our manufacturing plants. As a result of the redistribution of production, we will incur a severance charge during the first quarter of 2018.\n\"Solid revenue growth and operational execution during the fourth quarter allowed us to achieve our target of a cash neutral position compared to the third quarter of 2017. Maintaining cash at strong levels will allow us the freedom to continue to execute on our transformation strategy in 2018 and provide flexibility to increase resources to grow our business,\" Mr. Kolstad said.\nFourth Quarter 2017 Results\nRevenues for the fourth quarter of 2017 increased 108%, or $31.3 million, compared to the same period of 2016. The increase was primarily attributable to increases in oilfield ceramic technology products, industrial ceramics, oilfield sand and environmental product revenues.\nOperating loss for the fourth quarter of 2017 decreased to $17.3 million as compared to $29.3 million in the same period of 2016. The decrease in operating loss was primarily attributable to increased sales combined with a reduction in certain fixed structural costs, and a decrease in slowing and idling expenses.\nFull Year Results\nRevenues for the year ended December 31, 2017, increased 83%, or $85.7 million, compared to 2016. The increase was primarily attributable to increases in oilfield ceramic technology products, industrial ceramics, oilfield sand and environmental product revenues.\nWorldwide ceramic and sand proppant sales volumes totaled 2.6 billion pounds for the full year 2017, an increase of 287% compared to 2016.\nTechnology and Business Highlights\nIn a unique application, KRYPTOSPHERE® was used by a pre-packed screen (PPS) manufacturer as the internal media within its slotted liner/screen design. The PPS is deployed to prevent fines migration associated with hydrocarbon production. KRYPTOSPHERE technology was selected due to its uniform, single-mesh-size that creates more uniform pore throats and more space for hydrocarbon flow. SCALEGUARD®, a proppant-delivered scale-inhibiting technology, experienced a record quarter, driven by several new clients in the Permian basin and the international market. The technology was also used along with KRYPTOSPHERE HD in a Lower Tertiary deepwater completion by a super major. A single scale inhibition treatment with SCALEGUARD can prevent production losses during the life of the well and dramatically reduce lease operating expenses. A previous well completion that included SALTGUARD® continues to perform as designed and has outperformed the initial anticipated treatment life. SALTGUARD inhibits salt formation in the frac and wellbore, preventing production decreases, lowering lease operating expenses and eliminating the need for costly fresh water injection and the associated disposal of the resulting saltwater. A project utilizing FUSION® technology for Stimulation and Proppant Pack Consolidation was selected for the BP 2017 Helios Award. The technology creates a bonded, high integrity proppant pack without closure stress. This provides the well integrity critical to inject and produce at the ultra-high rates required to improve well economics and increase EUR in mature, depleting fields. FUSION deployment on this project won the \"Excellence\" award with over 600 competing BP project submissions from around the globe. The technology was successfully used on two Gulf of Mexico ultra-deepwater water injector wells, one of which achieved the highest water injection rate in soft sand formations globally. During the quarter, Northern White sand production commenced from a North East sand processing facility. The facility is strategically located to service the Marcellus and Utica Basins with high quality sand. An update to FRACPRO® 2017 software was released that added a new Layer Sensitive fracture model, allowing engineers using FRACPRO to more precisely investigate fracture propagation through multiple layers. It also enhances and extends the transfer of information from FRACPRO to third party data information systems, such as OpenWells® and WellView®. Two foundries, one in the Pacific Northwest and one in the Great Lakes region, each made a 100% conversion to ACCUCAST®, high-performance ceramic casting media, from silica sand. The ACCUCAST product created castings that were much cleaner than those produced in silica sand, thereby, significantly reducing the cleaning hours and associated costs. Moreover, ACCUCAST substantially outperformed silica sand in recycle and reuse creating additional savings and value for the client. Lastly, the ACCUCAST technology produces no silica dust and meets the newly established OSHA Permissible Exposure Limits (PEL) to improve worker safety. A large European mining operation tested our new CARBOGRIND products against two major competitors. These tests showed CARBO product outperformed the competition by over 30%. Savings realized by the mining company resulted in an annual supply contract with CARBO. A large manufacturing company based in the Middle East, approved CARBOBEAD™ ceramic media as a replacement for silica sand in its production of pigments. CARBOBEAD LT delivered a significant reduction in scour equipment wear that will translate into less equipment repair, less down time, and extended equipment life. The CARBOBEAD ceramic product more than doubled the scour media cycle life in comparison to silica sand scour media, which dramatically lowers media consumption, media transportation costs and spent material disposal costs. Moreover, the CARBOBEAD LT product achieved world class pigment brightness levels, a critical measurement for pigment quality.\nOutlook\nCEO Gary Kolstad commented on the outlook for CARBO stating, \"A key goal in 2018 is continued progress on our transformation strategy to diversify revenue streams. It is our belief that execution on this transformation strategy will result in profitable growth and positive cash from operating activities. Although seasonality will impact the first half of 2018, we believe our revenue and operating cash will show improvement in the first half of 2018 compared to the first half of 2017.\n\"We believe revenues from the Oil and Gas and Industrial sectors will grow in 2018. Looking at them separately, revenue from the Oil and Gas sector should follow industry activity while revenue from the Industrial sector should see strong double-digit growth year over year.\n\"If the recent strengthening in oil price continues in 2018, we believe base ceramic demand could improve in 2018. In addition, early indications from clients point to increased ceramic technology sales in our KRYPTOSPHERE and GUARD TM family of products. We anticipate KRYPTOSPHERE HD sales will be down slightly in 2018 due to a decrease in Gulf of Mexico activity, while KRYPTOSPHERE LD sales should exhibit solid growth globally. SCALEGUARD, a scale inhibiting production assurance product, continues to see success through its ability to prevent scale buildup and lower lease operating expense for E&P operators. The pipeline of opportunities is promising and we have been awarded additional work in 2018 for a client's Permian basin wells, which should result in increased revenues compared to 2017.\n\"Regarding our sand business, first sales for our North East project have begun in January. We will continue to utilize various business models, including an 'asset-lite' model like this, to serve client demand.\n\"We achieved solid growth in our industrial ceramics business during 2017, and we believe we will significantly grow this business in 2018 and in the foreseeable future. It is important that we continue to expand in the markets we serve today as well as develop new markets. We expect to add additional resources in 2018 to meet our objectives to grow this business by strong double digits again in 2018.\n\"We expect to develop additional opportunities in mineral processing during 2018, for our underutilized manufacturing plants. Our recent signing of a multi-year agreement to toll process an agricultural product is a positive step forward.\n\"ASSETGUARD TM , our environmental business, bounced back from the weather impacts of the third quarter. Given the majority of this business is related to the Oil and Gas sector, we believe it should also follow industry activity in 2018. However, we are targeting revenue streams in the Industrial sector and expect strong year-over-year growth in those sales.\n\"Over multiple decades CARBO has found new and innovative ways to bring value to our clients. We believe 2018 will be an exciting year, filled with meeting the challenges of our existing clients as well as those of new clients. Execution on our transformation strategy continues, and we expect it will result in an enduring, diversified company,\" Mr. Kolstad concluded.\nConference Call\nAs previously announced, a conference call to discuss CARBO's fourth quarter 2017 results is scheduled for today at 10:30 a.m. Central Time (11:30 a.m. Eastern). Due to historical high call volume, CARBO is offering participants the opportunity to register in advance for the conference by accessing the following website:\nhttp://dpregister.com/10115898\nRegistered participants will immediately receive an email with a calendar reminder and a dial-in number and PIN that will allow them immediate access to the call.\nParticipants who do not wish to pre-register for the call may dial in using (877) 232-2832 (for U.S. callers), (855) 669-9657 (for Canadian callers) or (412) 542-4138 (for international callers) and ask for the \"CARBO Ceramics\" call. The conference call also can be accessed through CARBO's website, www.carboceramics.com .\nA telephonic replay of the earnings conference call will be available through February 1st, 2018 at 9:00 a.m. Eastern Time. To access the replay, please dial (877)-344-7529 (for U.S. callers), (855) 669-9658 (for Canadian callers) or (412) 317-0088 (for international callers). Please reference conference number 10115898. Interested parties may also access the archived webcast of the earnings teleconference through CARBO's website approximately two hours after the end of the call.\nAbout CARBO\nCARBO (NYSE: CRR) is a global technology company that provides products and services to the oil and gas and industrial markets to enhance value for its clients.\nCARBO Oilfield Technologies - is a global leader that provides engineered solutions in its Design, Build, and Optimize the Frac® technology businesses, delivering important value to E&P operators by increasing well production and EUR. Oilfield Technologies is the world's largest producer of high quality ceramic proppant, provides one of the industry's most widely used fracture simulation software, has proprietary technology that provides fracture diagnostics and production assurance, and offers consulting services for fracture design and completion optimization. The Company also provides a range of technology solutions for spill prevention and containment.\nIts products and services are sold to operators of oil and natural gas wells and to oilfield service companies for use in the hydraulic fracturing of natural gas and oil wells.\nCARBO Industrial Technologies - is a leading provider of high-performance industrial ceramic media products that are engineered to increase process efficiency, improve end-product quality and reduce operating costs.\nIts products and services are primarily sold to industrial companies that work in manufacturing and mineral processing.\nFor more information, please visit www.carboceramics.com .\nForward-Looking Statements\nThe statements in this news release that are not historical statements, including statements regarding our future financial and operating performance and liquidity and capital resources, are forward-looking statements within the meaning of the U.S. Private Securities Litigation Reform Act of 1995. Forward-looking statements describe future expectations, plans, results or strategies and can often be identified by the use of terminology such as \"may\", \"will\", \"estimate\", \"intend\", \"continue\", \"believe\", \"expect\", \"anticipate\", \"should\", \"could\", \"potential\", \"opportunity\", or other similar terminology. All forward-looking statements are based on management's current expectations and estimates, which involve risks and uncertainties that could cause actual results to differ materially from those expressed in forward-looking statements. Among these factors are changes in overall economic conditions, changes in the demand for, or price of, oil and natural gas, changes in the cost of raw materials and natural gas used in manufacturing our products, risks related to our ability to access needed cash and capital, our ability to meet our current and future debt service obligations, including our ability to maintain compliance with our debt covenants, our ability to manage distribution costs effectively, changes in demand and prices charged for our products, risks of increased competition, technological, manufacturing and product development risks, our dependence on and loss of key customers and end users, changes in foreign and domestic government regulations, including environmental restrictions on operations and regulation of hydraulic fracturing, changes in foreign and domestic political and legislative risks, risks of war and international and domestic terrorism, risks associated with foreign operations and foreign currency exchange rates and controls, weather-related risks and other risks and uncertainties. Additional factors that could affect our future results or events are described from time to time in our reports filed with the Securities and Exchange Commission (the \"SEC\"). Please see the discussion set forth under the caption \"Risk Factors\" in our most recent annual report on Form 10-K, and similar disclosures in subsequently filed reports with the SEC. We assume no obligation to update forward-looking statements, except as required by law.\nNote on Non-GAAP Financial Measures\nThis press release includes unaudited non-GAAP financial measures, including EBITDA and Adjusted EBITDA. We present non-GAAP measures when our management believes that the additional information provides useful information about our operating performance. Non-GAAP financial measures do not have any standardized meaning and are therefore unlikely to be comparable to similar measures presented by other companies. The presentation of non-GAAP financial measures is not intended to be a substitute for, and should not be considered in isolation from, the financial measures reported in accordance with GAAP. See the table entitled \"Reconciliation of Reported Net Loss to EBITDA and Adjusted EBITDA\" below and the accompanying text for an explanation of the non-GAAP financial measures and a reconciliation of the non-GAAP financial measures to the comparable GAAP measures.\n-tables follow –\nThree Months Ended\nTwelve Months Ended\nDecember 31,\nDecember 31,\n2017\n2016\n2017\n2016\n(In thousands except per share)\n(In thousands except per share)\nRevenues\n$\n60,341\n$\n29,058\n$\n188,756\n$\n103,051\nCost of sales (see Cost of Sales Detail table below)\n66,252\n49,553\n242,081\n188,065\nGross loss\n(5,911)\n(20,495)\n(53,325)\n(85,014)\nSG&A expenses and start-up costs\n11,336\n8,851\n42,533\n39,999\nLoss (gain) on disposal or impairment of assets\n40\n(21)\n125,778\n889\nLoss on sale of Russian proppant business\n19\n—\n26,747\n—\nOperating loss\n(17,306)\n(29,325)\n(248,383)\n(125,902)\nOther expense, net\n(1,578)\n(1,580)\n(6,760)\n(5,306)\nLoss before income taxes\n(18,884)\n(30,905)\n(255,143)\n(131,208)\nIncome tax benefit\n(1,500)\n(15,708)\n(2,027)\n(51,081)\nNet loss\n$\n(17,384)\n$\n(15,197)\n$\n(253,116)\n$\n(80,127)\nLoss per share:\nBasic\n$\n(0.65)\n$\n(0.57)\n$\n(9.49)\n$\n(3.29)\nDiluted\n$\n(0.65)\n$\n(0.57)\n$\n(9.49)\n$\n(3.29)\nAverage shares outstanding:\nBasic\n26,692\n26,542\n26,664\n24,378\nDiluted\n26,692\n26,542\n26,664\n24,378\nDepreciation and amortization\n$\n9,532\n$\n11,952\n$\n45,337\n$\n48,451\nCost of Sales Detail\nThree Months Ended\nTwelve Months Ended\n(In thousands)\nDecember 31,\nDecember 31,\n2017\n2016\n2017\n2016\nPrimary cost of sales\n$\n58,202\n$\n37,185\n$\n200,213\n$\n133,431\nSlowing and idling production\n7,765\n11,251\n40,664\n47,318\nLoss (gain) on derivative instruments\n1\n(1,799)\n917\n(1,886)\nRailcar lease termination fee\n—\n1,500\n—\n1,500\nLower of cost or market inventory adjustment\n—\n1,400\n—\n1,515\nSeverance and other charges\n284\n16\n287\n6,187\nTotal Cost of Sales\n$\n66,252\n$\n49,553\n$\n242,081\n$\n188,065\nProduct Sales Volumes\n(in million lbs)\nThree Months Ended\nTwelve Months Ended\nDecember 31,\nDecember 31,\n2017\n2016\n2017\n2016\nCeramic\n104\n96\n389\n356\nNorthern White Sand\n706\n150\n2,190\n311\nTotal\n810\n246\n2,579\n667\nReconciliation of Reported Net Loss to EBITDA and\nAdjusted EBITDA\nThree Months Ended\nTwelve Months Ended\n(In thousands)\nDecember 31,\nDecember 31,\n2017\n2016\n2017\n2016\nNet loss\n$\n(17,384)\n$\n(15,197)\n$\n(253,116)\n$\n(80,127)\nInterest expense, net\n2,070\n1,577\n7,700\n5,435\nIncome tax benefit\n(1,500)\n(15,708)\n(2,027)\n(51,081)\nDepreciation and amortization (1)\n9,359\n11,952\n44,282\n48,451\nEBITDA\n$\n(7,455)\n$\n(17,376)\n$\n(203,161)\n$\n(77,322)\nLoss (gain) on disposal or impairment of assets\n40\n(21)\n125,778\n889\nLoss on sale of Russian proppant business\n19\n—\n26,747\n—\nSeverance and other charges\n284\n16\n287\n6,426\nLoss (gain) on derivative instruments\n1\n(1,799)\n917\n(1,886)\nLower of cost or market inventory adjustment\n—\n1,400\n—\n1,515\nAdjusted EBITDA\n$\n(7,111)\n$\n(17,780)\n$\n(49,432)\n$\n(70,378)\nAdjusted EBITDA is used by management to evaluate and assess our operational results, and we believe that Adjusted EBITDA allows investors to evaluate and assess our operational results. Adjusted EBITDA excludes various charges primarily related to the downturn in the energy industry and the sale of our Russian proppant business.\n(1)\nDepreciation and amortization for the three and twelve months ended December 31, 2017 excludes $173 and $1,055, respectively, of amortization of debt issuance costs and debt discount, which is included in interest expense, net, above.\nBalance Sheet Information\nDecember 31,\nDecember 31,\n2017\n2016\n(in thousands)\nAssets\nCash and cash equivalents\n$\n68,169\n$\n91,680\nRestricted cash (current)\n6,935\n—\nOther current assets\n120,693\n125,543\nRestricted cash (long-term)\n3,281\n—\nProperty, plant and equipment, net\n324,186\n494,103\nGoodwill\n3,500\n3,500\nIntangible and other assets, net\n13,834\n8,631\nTotal assets\n$\n540,598\n$\n723,457\nLiabilities and Shareholders ' Equity\nLong-term debt, current\n$\n—\n$\n13,000\nDerivative instruments\n2,537\n1,599\nOther current liabilities\n39,894\n20,205\nDeferred income taxes\n230\n1,236\nLong-term debt and related parties notes payable\n87,738\n67,404\nOther long-term liabilities\n4,434\n3,443\nShareholders' equity\n405,765\n616,570\nTotal liabilities and shareholders ' equity\n$\n540,598\n$\n723,457\nContact:\nMark Thomas, Director, Investor Relations\n(281) 921-6458\nView original content: http://www.prnewswire.com/news-releases/carbo-announces-fourth-quarter-and-fiscal-year-2017-results-300588016.html\nSOURCE CARBO Ceramics Inc.", "external_links": ["http://dpregister.com/10115898", "http://www.carboceramics.com/", "http://www.prnewswire.com/news-releases/carbo-announces-fourth-quarter-and-fiscal-year-2017-results-300588016.html"], "published": "2018-01-25T14:30:00.000+02:00", "crawled": "2018-01-25T14:17:18.043+02:00", "highlightTitle": ""}