{"organizations": [], "uuid": "507b67d7791bddcd1a7b4bf089e3cc97152a28ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-gkn-m-a-melrose-inds-pensions/gkn-pension-trustees-say-any-potential-buyer-faces-big-pension-deficit-idUSKBN1F51X8", "country": "US", "domain_rank": 408, "title": "GKN pension trustees say any potential buyer faces big pension deficit", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T17:29:00.000+02:00", "replies_count": 0, "uuid": "507b67d7791bddcd1a7b4bf089e3cc97152a28ca"}, "author": "", "url": "https://www.reuters.com/article/us-gkn-m-a-melrose-inds-pensions/gkn-pension-trustees-say-any-potential-buyer-faces-big-pension-deficit-idUSKBN1F51X8", "ord_in_thread": 0, "title": "GKN pension trustees say any potential buyer faces big pension deficit", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "gkn", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "elliott advisors", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Any potential buyer of British engineering company GKN ( GKN.L ) should be aware of its billion pound-plus pension deficit, its pension trustees said on Tuesday, a day after Melrose ( MRON.L ) appealed directly to GKN investors to back its 7 billion pound takeover offer.\nGKN is under pressure from U.S. activist investor Elliott Advisors to open talks with Melrose despite having rebuffed the company’s 405 pence per share cash-and-stock offer this month.\n“Any material change to the corporate and capital structure of GKN would lead the Trustees to reassess the strength of covenant going forward and determine appropriate funding plans based on that covenant and its associated level of risk,” the GKN trustees said in a statement.\nThe covenant is an employer’s legal obligation and financial ability to support its defined benefit scheme now and in the future. The trustees can ask for more money or some other asset to strengthen the covenant.\nMelrose told Reuters it had an “impeccable track record of safeguarding and improving pensioners’ rights in every acquisition we have made”.\n“We look forward to meeting the trustees as soon as is appropriate,” a spokeswoman said.\nThe trustees said the GKN pension schemes had an aggregate deficit at end-September on a so-called gilts flat basis of 1.1 billion pounds ($1.51 billion) and on a solvency basis of 1.9 billion pounds.\nThe gilts flat basis is an indication of the funding position if the GKN pension schemes were invested entirely in gilt assets, a commonly used yardstick in the pensions industry.\nSolvency basis refers to the cost of asking an insurance company to manage a scheme and its deficit if it took them over.\nThe Melrose spokeswoman said the trustees’ figures on GKN’s pension exposure were in line with Melrose’s own readings.\nA GKN spokesman said on Tuesday the company looked forward to “continuing our close working relationship with the pension fund trustees”.\nGKN shares ended Tuesday up 1.1 percent while Melrose shares were up 1.61 percent.\nElliott, which has a 1.7 percent interest in GKN, also holds a short position in Melrose, which it increased on Tuesday to 0.7 percent, from 0.51 percent.\nHedge funds that bet on mergers and acquisitions often seek to play both sides of a transaction by shorting the acquirer on the expectation that its shares will fall while the company that is being acquired will enjoy a boost.\nA London-based event-driven hedge fund manager betting on a potential GKN transaction with Melrose told Reuters that hedge funds that bet on deals were “all over” the trade.\nA spokeswoman for Elliott declined to comment on Tuesday’s statement from the trustees and on the short position in Melrose.\nThe GKN pension schemes comprise 5,105 active employees, 9,899 deferred members and 17,333 pensioners.\nReporting by Noor Zainab Hussain in Bengaluru and Maiya Keidan and Carolyn Cohn in London; editing by Gareth Jones\n ", "external_links": [], "published": "2018-01-16T17:29:00.000+02:00", "crawled": "2018-01-16T17:53:30.008+02:00", "highlightTitle": ""}