{"organizations": [], "uuid": "c39706f973654cd4286f8b1a9dc1a6c40042747d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226583973&w=1200&r=LYNXMPEE0T0PV", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-philippines-militants/philippines-files-murder-kidnap-charges-against-doctor-linked-to-planned-new-york-attacks-idUSKBN1FJ1JJ", "country": "US", "domain_rank": 408, "title": "Philippines files murder, kidnap charges against doctor linked to planned New York attacks", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T13:59:00.000+02:00", "replies_count": 0, "uuid": "c39706f973654cd4286f8b1a9dc1a6c40042747d"}, "author": "", "url": "https://www.reuters.com/article/us-philippines-militants/philippines-files-murder-kidnap-charges-against-doctor-linked-to-planned-new-york-attacks-idUSKBN1FJ1JJ", "ord_in_thread": 0, "title": "Philippines files murder, kidnap charges against doctor linked to planned New York attacks", "locations": [], "entities": {"persons": [{"name": "salic", "sentiment": "none"}, {"name": "russel salic", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "philippines", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "manila", "sentiment": "none"}, {"name": "manila", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 11:59 AM / Updated 37 minutes ago Philippines files murder, kidnap charges against doctor linked to planned New York attacks Reuters Staff 3 Min Read \nMANILA (Reuters) - The Philippine justice ministry has filed charges of murder and kidnapping against a doctor linked to a foiled plot to mount gun and bomb attacks in the heart of New York City, over his role in the abduction of six sawmill workers in a southern province. \nProsecutors had set aside the alibi of Russel Salic, who said he was at a doctors’ convention in another Philippine province when pro-Islamic State Maute militants kidnapped six sawmill workers and beheaded two of them in April 2016. \n“Criminal liability exists, notwithstanding non-participation in every detail in the execution of the crime,” prosecutors said in a document recommending charges against Salic and Maute militants. \nReuters could not immediately reach Salic, his lawyer or other representatives by telephone or email to seek comment. \nThe 37 year-old doctor has been detained at a maximum security facility in the capital, Manila, after he surrendered to authorities last year. \nIn sworn statements, four sawmill workers said that while in captivity, they had seen Salic cleaning guns in a room full of weapons and that he had asked some of the militants to give them food and coffee. \nIn his defense, Salic disputed the sawmill workers’ story, insisting he was at an orthopedic convention and showing pictures to back up his account. But prosecutors ignored his alibi, saying the workers had no reason to fabricate stories. \nAt about the time of the 2016 abduction, Salic, who had expressed support for Islamic State on social media, sent about $423 from the Philippines to an FBI undercover officer to help pay for the attacks in New York, documents unsealed in a U.S. federal court show. \nU.S. authorities filed criminal charges against the 37-year-old doctor in October last year and wanted him extradited along with Pakistani Talha Haroon, who was also linked to the bomb plot in Manhattan’s Times Square. \nBut Salic could not immediately be sent to the United States because he faced charges of murder and kidnapping, along with 53 other pro-Islamic State militants, in the regional trial court in the southern Philippines. \nThe justice department said the mother of the Maute brothers who led the militants’ takeover of Marawi City for five months from May last year, was also charged. Some of Salic’s co-accused had been killed in Marawi, including seven Maute brothers. \nReuters could not immediately reach Omita Maute for comment. Reporting by Manuel Mogato; Editing by Clarence Fernandez", "external_links": [], "published": "2018-01-30T13:59:00.000+02:00", "crawled": "2018-01-30T14:37:13.001+02:00", "highlightTitle": ""}