{"organizations": [], "uuid": "8787f9c39d7763ddd58cda8a6bd5ab2402049b3c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226987648&w=1200&r=LYNXMPEE0U16N", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/uk-britain-eu-may-spokesman/british-government-willing-to-release-brexit-studies-pm-mays-spokesman-idUSKBN1FK1XG", "country": "US", "domain_rank": 408, "title": "UK government will hand over Brexit analysis after damaging leak", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T21:41:00.000+02:00", "replies_count": 0, "uuid": "8787f9c39d7763ddd58cda8a6bd5ab2402049b3c"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/uk-britain-eu-may-spokesman/british-government-willing-to-release-brexit-studies-pm-mays-spokesman-idUSKBN1FK1XG", "ord_in_thread": 0, "title": "UK government will hand over Brexit analysis after damaging leak", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "robin walker", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Britain’s government said on Wednesday it would hand over to parliament a leaked report that suggested Brexit would hurt the economy, trying to deflect accusations that ministers are badly prepared for leaving the European Union.\nThe report has struck at the heart of government Brexit strategy, with one minister suggesting that analysis by officials should be discounted and another urging the government to reconsider its stance.\nIt has piled pressure on Prime Minister Theresa May, who is under fire from some in her own Conservative Party for lacking leadership and a clear Brexit plan, as she negotiates a deal to end more than 40 years of union.\nThe main opposition Labour Party forced the government into handing over the report, entitled “EU Exit Analysis - Cross Whitehall Briefing” and dated January 2018, by using an ancient parliamentary procedure. Parliament’s treasury committee called on the government to publish immediately.\n“In seeing this analysis, members of the House will be sharing in the responsibility and obligation that the government has to ensure the security of negotiation-sensitive materials,” junior Brexit minister Steve Baker told parliament.\nHe said the report, which he denied was any kind of impact assessment, would be kept “strictly confidential” and unpublished during the Brexit negotiations.\nThe report leaked to BuzzFeed News said the economy would be worse off after Brexit whether Britain left the EU with a free trade deal, single market access, or with no deal at all. The government has called it a partial piece of work that had yet to be signed-off by ministers.\nBritain's Prime Minister Theresa May walks out of 10 Downing Street to greet the Prime Minister of Estonia, Juri Ratas in London, January 30, 2018. REUTERS/Toby Melville How to deal with its leak has exposed divisions in government.\nEarlier on Wednesday, May, on a visit to China, said lawmakers would be given official analysis on any Brexit deal before they are asked to approve it.\nOn Tuesday, Baker rebuffed calls for the government to release the full report by saying it was not ready, while Phillip Lee, a minister at the justice department, suggested the government change tack in the talks.\nLee was rebuked on Wednesday for expressing on Twitter his suggestion that if the report were true “there would be a serious question over whether a government could legitimately lead a country along a path that the evidence and rational consideration indicate would be damaging”.\nGovernment aides say the paper had not even considered the government’s preferred goal of a bespoke future relationship with the EU after leaving.\nBut it has raised further questions over how prepared the government is for the complicated negotiations to end Britain’s membership of the EU.\n“This is a victory for parliament and for our country,” said Labour’s Brexit policy chief Keir Starmer. “Labour ... expects ministers to hand these documents over by the end of the week. To not do so would obstruct the will of parliament.”\nAdditional reporting by David Milliken and Andrew MacAskill; editing by Stephen Addison\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-31T21:41:00.000+02:00", "crawled": "2018-01-31T17:42:46.012+02:00", "highlightTitle": ""}