{"organizations": [], "uuid": "22abad6fb43909baa7b154aa9e6104860d046a24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/10/01/101076898-180143070r.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/ceo-of-embattled-retailer-neiman-marcus-to-step-down-replacement-identified.html", "country": "US", "domain_rank": 767, "title": "CEO of embattled retailer Neiman Marcus to step down, replacement identified", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T18:42:00.000+02:00", "replies_count": 0, "uuid": "22abad6fb43909baa7b154aa9e6104860d046a24"}, "author": "Lauren Hirsch", "url": "https://www.cnbc.com/2018/01/04/ceo-of-embattled-retailer-neiman-marcus-to-step-down-replacement-identified.html", "ord_in_thread": 0, "title": "CEO of embattled retailer Neiman Marcus to step down, replacement identified", "locations": [], "entities": {"persons": [{"name": "neiman marcus", "sentiment": "negative"}, {"name": "neiman ma", "sentiment": "negative"}, {"name": "karen katz", "sentiment": "none"}, {"name": "katz", "sentiment": "none"}], "locations": [{"name": "cana", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "wall street journal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Getty Images \nAs Neiman Marcus continues to grapple with a steep debt load and industry headwinds, CEO Karen Katz is stepping down, sources familiar with the matter told CNBC on Thursday. \nThe luxury retailer has already identified her replacement, the sources added. The successor could be named as soon as Friday, some of the sources said. \nKatz's plans to step aside were first reported by The Wall Street Journal earlier on Thursday. \nThe sources asked not to be named because the information is confidential. Neiman Marcus did not have an immediate comment. \nThe high-end retailer is one of many that has struggled to cope with leverage left behind from a flurry of private equity interest in the retail industry. The firms were buoyed by low interest rates and the attraction of recognizable names, but have found themselves financially hindered as they need to make necessary investments to adjust to the rapidly changing landscape. \nNeiman Marcus was acquired by TPG Capital and Warburg Pincus in 2005 for $5.1 billion. It was sold to Ares Management and Canada Pension Plan Investment Board in 2013 for $6 billion. \nLast year the retailer hired investment bank Lazard to help cope with its roughly $4.4 billion in long-term net debt. At one point it flirted with the idea of selling to Hudson's Bay Company, but the challenge of combining heavily indebted companies proved too steep. \nSome of Neiman's challenges have been specific to the retailer: It made its name in large part on high-end clothing and personal shopping, but the younger generation spends less on, and seemingly cares less about, clothes. The stronger U.S. dollar has also been negative for Neiman Marcus, curbing spending at its Bergdorf Goodman department stores, which are popular with New York tourists. \nDepartment stores across the board have struggled as brands increasingly look to reach their shoppers without a middleman, and they deal with excess real estate no longer in sync with how consumers shop. \nDepartment stores J.C. Penney and Macy's both saw their stocks rattled on Thursday, despite a relatively strong holiday performance, a sign of investor skittishness toward the industry at large. \nIn its search for a new leader, Neiman Marcus finds itself in a position similar to that of its peers, which must consider whether outside influences can help them change course. The retail industry is infamously insular in its hiring practices, and the industry has evolved such that the expertise required by a retailer 10 years ago may no longer be relevant . \nStill, the very challenges that retailers are facing have made it harder to entice outsiders, industry sources have told CNBC. Lauren Hirsch Retail Reporter for CNBC.com Related Securities", "external_links": [], "published": "2018-01-04T18:42:00.000+02:00", "crawled": "2018-01-04T18:42:36.007+02:00", "highlightTitle": ""}