{"organizations": [], "uuid": "4a7bcbbfa8ebb6dfdf2a52444f330fb0d19f29ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/kazakhstan-kashagan/update-1-moldovan-businessman-to-seek-forced-sale-of-kazakh-oil-field-stake-idUSL8N1P40KE", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Moldovan businessman to seek forced sale of Kazakh oil field stake", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T08:47:00.000+02:00", "replies_count": 0, "uuid": "4a7bcbbfa8ebb6dfdf2a52444f330fb0d19f29ee"}, "author": "", "url": "https://www.reuters.com/article/kazakhstan-kashagan/update-1-moldovan-businessman-to-seek-forced-sale-of-kazakh-oil-field-stake-idUSL8N1P40KE", "ord_in_thread": 0, "title": "UPDATE 1-Moldovan businessman to seek forced sale of Kazakh oil field stake", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Moldovan businessman seeks to collect $500 mln arbitration award\n* Has filed lawsuits in several European countries\n* Courts have ordered multiple Kazakh assets frozen\n* Assets include stakes in oil, mining firms, Swedish equities (Adds context, analyst comment)\nALMATY, Jan 9 (Reuters) - Moldovan businessman Anatolie Stati will ask bailiffs to sell a $5.2 billion stake in the Kashagan oil field owned by a Kazakh sovereign wealth fund if Astana refuses to pay a $500 million arbitration award, Stati’s spokeswoman said on Tuesday.\nAsked if the stake in the giant oil field - now frozen by a Dutch court - could be foreclosed, Stati’s spokeswoman said: ”This is the expected course of action.\n“We will aggressively pursue enforcement in all relevant jurisdictions until the Republic of Kazakhstan complies with its treaty commitment to the award.”\nSamruk-Kazyna, the sovereign wealth fund which holds half of Kazakhstan’s 16.88 percent Kashagan stake through a Dutch company, said it was making “all necessary arrangements to protect its interest in accordance with the applicable procedure and will continue to vigorously defend its rights”.\nSamruk-Kazyna said in a statement the freeze had no effect on the day-to-day management of its stake in Kashagan and payments “save for payment of dividends to Samruk-Kazyna”.\nKazakhstan’s sovereign dollar bonds fell across the curve on Tuesday.\nStati, his son Gabriel and two family-controlled companies have been involved in legal battles with the Kazakh government of President Nursultan Nazarbayev for several years. They invested in Kazakhstan’s oil and gas industry and have asserted that they were subjected to harassment from the state aimed at forcing them to sell their investments cheaply.\nThey and two of their companies won an arbitration award of around $500 million in Sweden against the government. Kazakhstan denies the allegations, says the arbitration was won through fraud, and has countersued in several countries.\nStati’s victories so far are a rare example of Western courts ordering large-scale freezes of sovereign fund assets, and such moves could alarm the managers of other funds in the $7 trillion industry.\nStati’s press office said in a statement that he had secured “attachments” of other Kazakh assets, including Kazakhstan’s stake in a Luxembourg-based company, Eurasian Resources Group, and trade receivables due Kazakhstan from some Luxembourg firms.\nA Swedish court has also frozen shares in 33 Swedish public companies worth about $100 million owned by Kazakhstan, Stati said, adding Swedish bailiffs had already begun a foreclosure process on some shares.\nSimon Quijano-Evans, emerging markets strategist at Legal & General Investment Management wrote in a note to clients that the saga “really should raise alarm bells amongst all sovereign wealth funds and central banks globally about the assumed ‘immunity’ of their assets that are mainly held in ‘safe-havens’ such as US Treasuries, European Government bonds and the like.”\nKashagan, operated by Eni, Total, Shell , ExxonMobil, Kazakh state firm KazMunayGaz , China’s CNPC and Japan’s Inpex, is Kazakhstan’s biggest oil field.\nKazakhstan has refused to pay the Swedish arbitration award. In October it filed a civil racketeering lawsuit in the U.S. District Court in Washington, D.C., against the Statis and their two firms.\nLast October, Bank of New York Mellon froze $22.6 billion in assets held by Kazakhstan’s National Fund, another sovereign wealth fund, following a lawsuit by Stati. (Reporting by Olzhas Auyezov; Additional reporting by Raushan Nurshayeva in Astana and Karin Strohecker in London; Editing by Andrey Ostroukh)\n ", "external_links": [], "published": "2018-01-09T08:47:00.000+02:00", "crawled": "2018-01-09T09:42:56.268+02:00", "highlightTitle": ""}