{"organizations": [], "uuid": "17f32152d1472223e925e6eb7a48540086b38aa4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-bassett-announces-fiscal-fourth-quarter-results.html", "country": "US", "domain_rank": 767, "title": "Bassett Announces Fiscal Fourth Quarter Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T17:00:00.000+02:00", "replies_count": 0, "uuid": "17f32152d1472223e925e6eb7a48540086b38aa4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-bassett-announces-fiscal-fourth-quarter-results.html", "ord_in_thread": 0, "title": "Bassett Announces Fiscal Fourth Quarter Results", "locations": [], "entities": {"persons": [{"name": "bassett", "sentiment": "negative"}], "locations": [{"name": "va.", "sentiment": "none"}], "organizations": [{"name": "bassett furniture industries, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BASSETT, Va., Jan. 18, 2018 (GLOBE NEWSWIRE) -- Bassett Furniture Industries, Inc. (Nasdaq:BSET) announced today its results of operations for its fiscal quarter ended November 25, 2017.\nFiscal 2017 Fourth Quarter Highlights\nConsolidated sales were $118.2 million for the fourth quarter of 2017 compared to $113.9 million for the fourth quarter of 2016, an increase of 3.9%. Operating income for the quarter was $7.5 million or 6.3% of sales as compared to $9.0 million or 7.9% of sales for the prior year quarter. Wholesale sales were $63.2 million for the fourth quarter of 2017 compared to $62.6 million for the third quarter of 2016, an increase of 1.0%. Wholesale operating income for the quarter was $4.0 million or 6.3% of sales as compared to $4.3 million or 6.9% of sales for the prior year quarter. Company-owned store sales were $72.1 million for the fourth quarter of 2017 compared to $69.9 million for the fourth quarter of 2016, an increase of 3.2%. This included a comparable store sales decrease of 1.7% compared to the prior year quarter. Comparable store operating income was $3.5 million or 5.5% of sales for the current year quarter as compared to $3.3 million or 5.0% of sales for the prior year quarter. Total retail operating income was $2.1 million or 2.9% of sales for the quarter as compared to $2.9 million or 4.1% of sales for the prior year quarter. Comparable store written sales for the quarter increased 2.7%. Revenue for Zenith was $25.7 million for the fourth quarter of 2017 compared to $24.2 million for the fourth quarter of 2016, a 6.1% increase. Zenith’s operating income for the quarter was $1.2 million or 4.8% of sales as compared to $1.4 million or 5.9% of sales for the prior year quarter. Net income for the quarter was $5.0 million or $0.46 per diluted share as compared to $5.0 million or $0.47 per diluted share for the prior year quarter.\n“We were pleased to finish our fourth quarter with a 4% gain in consolidated revenue, thus capping fiscal 2017 as a solid year for Bassett,” observed Rob Spilman, Chairman and CEO. “Despite the sales gain, however, quarterly operating income decreased to $7.5 million, or 17% less than last year. The opening of stores in Pittsburgh, Pennsylvania and Wichita, Kansas during the quarter ushered in a period of robust expansion for our corporate store network as we plan to open at least 10 new locations and reposition 2 to 3 others over the next 18 months. Indeed, we have already opened a second Phoenix store and have entered the Oklahoma City market since closing our fiscal year on November 25, 2017. Suffice it to say that this amount of new store startup activity produces detrimental short term effects on our profitability as witnessed in this most recent reporting period. Nevertheless, we strongly believe that expanding our store network is the best way for us to grow and coupled with other planned initiatives, these investments will make Bassett a larger and more profitable enterprise as a result. Furthermore, we believe that increasing our store count, which will benefit our wholesale, retail and logistics segments in the long run, is an appropriate use of our strong balance sheet.”\n“A centerpiece of our store expansion strategy is the new “Generation 3” prototype that will debut in Frisco, Texas during the third quarter of 2018,” continued Spilman. “Two years in the making, the new store will showcase Bassett’s interior design and customizable home furnishings competencies through a technology laden fixturing package designed to easily navigate the many options that we offer to create personalized space for our consumers. We have engaged a group of experts to work with our internal team to architect the Generation 3 store and to unify the Bassett shopping experience from our website to our store to the ultimate delivery of our furniture and accessory offerings to the home. The corresponding foundational investments in systems and customer experience enhancements that we began in 2017 will accelerate in 2018 and will result in higher levels of SG&A spending for the next several quarters. The end result of these investments will:\nelevate digital brand awareness through heightened social media outreach,\neducate and inspire more consumers to experience the Bassett brand digitally or through our brick and mortar stores,\nenhance in store collaboration through the introduction of an upholstery sectional configurator and 3-D room planning capabilities, and\ndeliver smarter, faster customer service that allows transactions to be tracked via mobile devices from purchase, to manufacture of the goods, to delivery to the home.\nThe fusion of our brick and mortar experience, our custom manufacturing platform, and our digital strategy will definitely sharpen in fiscal 2018. Although we acknowledge that there are accompanying operational costs with this vision and with our store expansion, we believe that charting this course now is prudent, exciting, and indeed necessary to provide Bassett its own space amidst the much discussed disruptive forces that in part define the U.S. retail landscape today.”\nWholesale Segment\nNet sales for the wholesale segment were $63.2 million for the fourth quarter of 2017 as compared to $62.6 million for the fourth quarter of 2016, an increase of $0.6 million or 1.0%. This increase was driven by an 8.7% increase in furniture shipments to the open market (outside the Bassett Home Furnishings network) partially offset by a 5.5% decrease in furniture shipments to the Bassett Home Furnishings network compared to the prior year period. Wholesale shipments of accessories, a much smaller component of the Company’s wholesale revenues, increased 77% over the prior year quarter. Gross margins for the wholesale segment were 34.1% for the fourth quarter of 2017 as compared to 35.5% for the prior year quarter. This decrease was primarily driven by lower margins in the Bench Made operation from inefficiencies in starting up the production of the new solid oak line, imported wood operation resulting from higher container freight costs and domestic upholstery operation from higher material and labor costs. Wholesale SG&A for the fourth quarter of 2017 was $17.6 million as compared to $17.9 million for the prior year period. SG&A as a percentage of sales decreased to 27.8% as compared to 28.6% for the fourth quarter of 2016. This decrease in SG&A as a percentage of sales was primarily driven by lower incentive compensation costs. Operating income was $4.0 million or 6.3% of sales as compared to $4.3 million or 6.9% of sales in the prior year.\n“Wholesale sales increased 1% for the quarter and 4% for the year,” said Spilman. “The quarter was a mixed bag as sales to customers outside the store network grew nicely while shipments to the store network actually declined. The primary reasons for the retail shipment shortfall were the effects of hurricanes on the Houston and Puerto Rico stores and an overall written sales decrease in the licensed store network.”\n“Trends in the wholesale segment that were prevalent during the year continued in the quarter,” added Spilman. “In the wood division, shipments of domestically produced products increased although at a less robust level than experienced earlier in the year. Our Bench Made product line grew by 40% in 2017. We encountered production inefficiencies in the startup of our new Bench Made Oak line that began shipping at year end and is about to be ", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/281ad1a3-e994-4911-a6e6-d8f089d81580"], "published": "2018-01-18T17:00:00.000+02:00", "crawled": "2018-01-18T19:53:04.004+02:00", "highlightTitle": ""}