{"organizations": [], "uuid": "44739cbcc1faa51e98a9646357edce97d177b352", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-metavention-inc-closes-65-million-in-series-c-funding-appoints-new-chief-executive-officer.html", "country": "US", "domain_rank": 767, "title": "Metavention, Inc., Closes $65 Million in Series C Funding, Appoints New Chief Executive Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.451, "site_type": "news", "published": "2018-01-08T21:00:00.000+02:00", "replies_count": 0, "uuid": "44739cbcc1faa51e98a9646357edce97d177b352"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-metavention-inc-closes-65-million-in-series-c-funding-appoints-new-chief-executive-officer.html", "ord_in_thread": 0, "title": "Metavention, Inc., Closes $65 Million in Series C Funding, Appoints New Chief Executive Officer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Capital to enable Phase 2 trials for Metabolic Neuromodulation Therapy, an important new treatment for Type 2 diabetes.\nMINNEAPOLIS--(BUSINESS WIRE)-- Metavention, Inc., today announced the completion of $65 million in Series C financing. The financing was led by New Enterprise Associates (NEA) and included participation from new investors Sanderling Ventures, RK Mellon and Horowitz Group, plus existing investors Versant Ventures and a corporate investor.\nMetavention will use the funds to optimize its novel transcatheter based Metabolic Neuromodulation Therapy (MNT) for glucose control in patients with Type 2 diabetes (T2D) and commence preparations for a Phase 2 study in the United States. MNT has the potential to provide physicians a fundamentally new tool, advancing the management of T2D. Overactive sympathetic nervous system (SNS) activity is associated with elevated blood glucose levels in T2D patients, and modulation of SNS activity has been shown to reduce glucose levels.\nIn conjunction with the financing, the company also announced that it has appointed Todd Berg as Chief Executive Officer. Berg most recently served as the CEO of Torax Medical, which was acquired by Ethicon, a division of Johnson & Johnson, in 2017. Berg has more than 25 years of experience in successfully developing and commercializing medical technologies.\nSaid Berg, \"The Metavention mission to provide improved control of elevated glucose, in a single minimally invasive procedure, is very exciting. The approach represents a new frontier in medicine in which Metavention is uniquely positioned to provide the enabling technology and supporting science. I am honored to be joining the accomplished Metavention team at this pivotal stage.\"\nBerg joins an experienced team including Founder, President and Chief Medical Officer Bobak Azamian, M.D., Ph.D.\nCommented Azamian, “This financing by a leading investor syndicate and our recruitment of a highly experienced, successful CEO further validates the transformative potential of MNT as the first procedure targeting one of the underlying causes of Type 2 diabetes.”\nAdded Justin Klein, M.D., J.D., Partner at New Enterprise Associates “NEA is proud to partner with the Metavention team to advance a highly innovative medical device solution for diabetes. Metavention has laid an impressive foundation in its translational and early clinical development, and we believe MNT has the potential to be a safe, effective, and widely accessible approach to address the Type 2 diabetes pandemic.”\nSaid Timothy Mills, Ph.D., Managing Director Sanderling Ventures, “There is an urgency to more effectively address the clinical needs in diabetes. Innovation and investments are critical to advance how our healthcare system better serves patients with Type 2 diabetes. We are pleased to be part of this important work to enable this technology to be fully developed.”\nAbout Type 2 Diabetes\nType 2 Diabetes (T2D) is a chronic, often progressive disease that has created a global epidemic affecting more than 350 million people worldwide, resulting in an overwhelming economic burden on healthcare systems. Diabetes is associated with significantly increased cardiovascular risks due to damage of the vasculature from elevated glucose levels. First-line therapy for T2D relies on oral antidiabetic drugs; however, disease progression to dependence on insulin injections is common. Despite decades of drug refinement for T2D, many patients remain at high risk of cardiovascular events due to uncontrolled and elevated glucose levels.\nMetabolic Neuromodulation Therapy\nMetabolic Neuromodulation Therapy (MNT) provides physicians and patients with a fundamentally new tool in the management of T2D, potentially improving cardiovascular health and reducing the economic burden associated with this uncontrolled chronic disease. MNT utilizes standard interventional vascular techniques to target sympathetic nervous system (SNS) activity in patients with Type 2 diabetes. MNT was developed based on extensive scientific data linking SNS activity with increased blood glucose levels and abnormal liver function, and thus has the potential to provide substantial benefits in metabolic diseases such as T2D and nonalcoholic fatty liver disease.\nAbout Metavention Inc.\nMetavention, Inc. is a privately held medical device company headquartered in Minneapolis, Minn., that develops transcatheter devices to treat over active sympathetic nerves associated with elevated glucose and abnormal liver function. For more information, please visit www.metavention.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180108006325/en/\nMetavention Contact\nTodd Berg\nChief Executive Officer\ntberg@metavention.com\nSource: Metavention, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.toraxmedical.com&esheet=51739627&newsitemid=20180108006325&lan=en-US&anchor=www.metavention.com&index=1&md5=ac00515fec4969666aa7a6c5a5373cf3", "http://www.businesswire.com/news/home/20180108006325/en/"], "published": "2018-01-08T21:00:00.000+02:00", "crawled": "2018-01-09T09:36:42.529+02:00", "highlightTitle": ""}