{"organizations": [], "uuid": "749790853f36724b15bb52427fa372c3247ebf37", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/domesticNews", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-usa-municipals-water/in-push-to-cut-permits-u-s-must-still-protect-water-quality-ceo-idUSKBN1FK325", "country": "US", "domain_rank": 408, "title": "In push to cut permits, U.S. must still protect water quality: CEO", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T22:50:00.000+02:00", "replies_count": 0, "uuid": "749790853f36724b15bb52427fa372c3247ebf37"}, "author": "", "url": "https://www.reuters.com/article/us-usa-municipals-water/in-push-to-cut-permits-u-s-must-still-protect-water-quality-ceo-idUSKBN1FK325", "ord_in_thread": 0, "title": "In push to cut permits, U.S. must still protect water quality: CEO", "locations": [], "entities": {"persons": [{"name": "susan story", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "hilary russ", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "america", "sentiment": "none"}], "organizations": [{"name": "american water works company inc", "sentiment": "none"}, {"name": "american water", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 8:53 PM / in 26 minutes In push to cut permits, U.S. must still protect water quality: CEO Hilary Russ 3 Min Read \nNEW YORK (Reuters) - The CEO of America’s largest water utility warned that a federal push to streamline permits for infrastructure projects could stymie stronger water quality standards. \n“We’ve got to make sure we maintain water quality standards and actually in some cases increase them,” American Water Works Company Inc CEO Susan Story said in an interview with Reuters on Wednesday. \nHer remarks came a day after President Donald Trump said in his State of the Union address that he aims to reduce the time it takes to get permits for projects. \nTrump’s plan to create $1.5 trillion of infrastructure investment is meant to boost the nation’s crumbling roads, bridges, transit, airports, water and other infrastructure. \nAmerican Water, which owns regulated drinking and wastewater systems in 16 states, is targeting long-term earnings per share growth of 7 percent to 10 percent, with up to 2 percent of that coming from the acquisition of municipal water systems. \nSome U.S. towns, facing tight budgets or hefty long-term costs to keep their systems up to environmental standards, have privatized their water utilities. \n“We have a pipepline (of deals) right now that’s more robust than we’ve had ever in our company,” Story said. \nInvestor-owned utilities are fiercely competing with each other to buy municipal systems. Aqua America Inc, American Water’s closest rival, has said interest among municipalities in selling off assets has never been so high. \nWhile lead contamination has dominated headlines and fears, particularly after the Flint, Michigan disaster, Story believes the next threat is from substances that are not even monitored. \nThere are 1,400 microbes alone that can affect drinking water, but the Environmental Protection Agency only regulates 90 contaminants, she said. \nWorking with the EPA, American Water is now starting voluntary tests for 40 “emerging contaminants” that are not yet regulated, Story said. \nWhether any new federal infrastructure program spurs private investment in infrastructure, U.S. tax reform is already becoming “an infrastructure plan for regulated utilities,” Story said. \nThat is because the sector’s profits are regulated by state public service commissions, which can direct how the utilities will spend their new tax savings. \n“Every dollar of the reduction of our tax goes back to our customers, not to our bottom line,” Story said. \nThe utility is working with each state’s regulators to determine whether to return savings to customers, accelerate capital projects or some combination. \nShe said she would not disclose the company’s total tax savings until its Feb. 21 earnings call. Reporting by Hilary Russ; Editing by Cynthia Osterman", "external_links": [], "published": "2018-01-31T22:50:00.000+02:00", "crawled": "2018-01-31T23:08:25.004+02:00", "highlightTitle": ""}