{"organizations": [], "uuid": "ca8b1ab058c4bc2495bc6f9239eb12c504b803c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221458298&w=1200&r=LYNXMPEE0B10H", "site_section": "https://www.reuters.com/finance/commodities", "section_title": "Commodities News, Commodity Trading Prices &amp; Data | Reuters.com", "url": "https://www.reuters.com/article/us-indonesia-freeport-papua/indonesia-lays-groundwork-for-transfer-of-grasberg-mine-to-local-control-idUSKBN1F11OR", "country": "US", "domain_rank": 408, "title": "Indonesia lays groundwork for transfer of Grasberg mine to local control", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T21:59:00.000+02:00", "replies_count": 0, "uuid": "ca8b1ab058c4bc2495bc6f9239eb12c504b803c9"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-indonesia-freeport-papua/indonesia-lays-groundwork-for-transfer-of-grasberg-mine-to-local-control-idUSKBN1F11OR", "ord_in_thread": 0, "title": "Indonesia lays groundwork for transfer of Grasberg mine to local control", "locations": [], "entities": {"persons": [{"name": "sri mulyani indrawati", "sentiment": "none"}], "locations": [{"name": "jakarta", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}, {"name": "mimika", "sentiment": "none"}, {"name": "grasberg", "sentiment": "none"}, {"name": "pt freeport indonesia", "sentiment": "none"}, {"name": "papua", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "freeport", "sentiment": "none"}, {"name": "freeport-mcmoran inc", "sentiment": "none"}, {"name": "pt inalum", "sentiment": "none"}, {"name": "papua", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JAKARTA (Reuters) - Indonesian regional and central government officials on Friday signed an agreement with state holding company PT Inalum that lays the foundation for transfer of Freeport-McMoRan Inc’s giant Grasberg copper mine to local control.\nIndonesia and Papua have long pushed for greater control over Grasberg and the new ownership structure may ease tensions over spoils from the world’s second-biggest copper mine, a focal point for local separatists.\nIndonesia and Freeport agreed in principle in August to set up Freeport’s rights to Grasberg according to a new mine license that replaces an existing contract of work. The American miner also said it would divest up to 51 percent of its local unit to “Indonesia interests”.\nUnder the agreement signed Friday, Papua provincial government and Mimika regency will jointly own rights to a 10 percent share in PT Freeport Indonesia (PTFI) once they have been divested, Finance Minister Sri Mulyani Indrawati said at a press briefing.\n“This portion of share ownership rights is for the interests for the indigenous land owners and members of the community facing permanent impacts (from the mine),” she said.\n“The government hopes to improve the performance of PTFI and give maximum benefits to the Papuan and Indonesian people,” Indrawati said.\nThe agreement allows the Indonesian parties to act as a consortium in the acquisition, funding for which will be provided by Inalum and will not be taken from the central or regional government budgets, Indrawati said.\nA Jakarta-based spokesman for Freeport Indonesia declined to comment on the matter.\nInalum, which holds ownership of all state-owned mining companies, has been nominated to acquire an additional 41.64 percent in Freeport Indonesia, which would take Indonesia’s share of PTFI to 51 percent, up from 9.36 percent now.\nThe 10 percent to be held by Papua and Mimika will be part of this Inalum holding, Inalum chief executive Budi Gunadi Sadikin said.\nDisagreement on the valuation of Grasberg may hold up a deal, analysts have said.\nCoal and Minerals Director General Bambang Gatot said on Thursday the Indonesia is targeting to complete contract talks with Freeport by June.\n“The process to obtain 51 percent including the Rio Tinto participating interest that will be converted to a shareholding is still being discussed and negotiated with related parties,” Indrawati said, referring to a joint venture Freeport formed with Rio Tinto in 1996.\nUnder that venture, Rio has a 40 percent interest in PTFI’s Grasberg contract, which entitles them to a 40 percent share of all production after 2022. Rio has held talks with Indonesia about a possible exit to the venture.\nIndonesia’s proposal could see Rio’s interest in Grasberg output being converted to shares in PTFI to make up the lion’s portion of the government purchase, provided all parties can agree to the structure and price of the deal, Mining Minister Ignasius Jonan said in December.\nA Melbourne-based spokesman for Rio declined to comment.\nReporting by Cindy Silviana and Wilda Asmarini in JAKARTA; Additional reporting by Jim Regan in SYDNEY; Writing by Fergus Jensen; Editing by Tom Hogue\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T21:59:00.000+02:00", "crawled": "2018-01-12T18:17:17.013+02:00", "highlightTitle": ""}