{"organizations": [], "uuid": "c7eb5ee6fae690b7ea0abc231a6b324f1323dc3e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220766643&w=1200&r=LYNXMPEE090ET", "site_section": "http://feeds.reuters.com/reuters/UKPersonalFinanceNews/", "section_title": "Reuters: Money", "url": "https://uk.reuters.com/article/us-britain-regulator-cfd/uk-watchdog-warns-on-spreadbetting-knocking-shares-idUKKBN1EZ0QM", "country": "US", "domain_rank": 408, "title": "UK watchdog flags 'serious risk of harm' from spreadbetting", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T17:44:00.000+02:00", "replies_count": 0, "uuid": "c7eb5ee6fae690b7ea0abc231a6b324f1323dc3e"}, "author": "", "url": "https://uk.reuters.com/article/us-britain-regulator-cfd/uk-watchdog-warns-on-spreadbetting-knocking-shares-idUKKBN1EZ0QM", "ord_in_thread": 0, "title": "UK watchdog flags 'serious risk of harm' from spreadbetting", "locations": [], "entities": {"persons": [{"name": "noor zainab hussain", "sentiment": "none"}, {"name": "reuters/chris helgren", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "canary wharf", "sentiment": "none"}], "organizations": [{"name": "financial conduct authority", "sentiment": "none"}, {"name": "fca", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 8:32 AM / Updated 21 minutes ago UK watchdog flags 'serious risk of harm' from spreadbetting Noor Zainab Hussain 5 Min Read \n(Reuters) - Britain’s financial regulator told spreadbetting firms to properly warn retail investors of the risks involved in contracts for differences (CFDs) or face action, knocking shares in the sector on Wednesday. The logo of the new Financial Conduct Authority (FCA) is seen at the agency's headquarters in the Canary Wharf business district of London April 1, 2013. REUTERS/Chris Helgren \n“There is a high risk that firms across the sector are not meeting our rules and expectations when providing and distributing CFDs,” the Financial Conduct Authority (FCA) said following a year-long review of the industry. \nThe majority of retail customers who bought CFD products lost money, the FCA said after assessing firms that provide CFDs to intermediaries who in turn distribute them to retail consumers on either an advisory or discretionary basis. \nThat involves customers putting their money into the hands of a firm that manages transactions on their behalf. \n“In our view, none of the 19 providers in our review were acting in line with our guidance,” said the FCA, which had warned at the end of 2016 it had serious concerns about retail buying of CFD products. \nThe watchdog said it would take action against one unnamed CFD provider because its arrangements were so poor. \nCFDs, financial instruments which have long been used by professional investors, let investors bet on both the direction of a share price, currency or other financial product move, and the extent of the change in price. \n\"Consumers may be at serious risk of harm from poor practices in this sector,\" the FCA said, adding it had sent a letter to all providers and distributors of CFDs to retail investors to ensure they \"pay due regard to the interests of customers and treat them fairly\". ( bit.ly/2mfRCxD ) \nShares in CMC Markets ( CMCX.L ), IG Group ( IGG.L ) and Plus500 ( PLUSP.L ) all fell by more than 7 percent on the FCA warning, in which it expressed concerns over the way CFDs were marketed across the industry. \nIt also identified flawed due diligence processes, conflicts of interest and poor remuneration practices. \nPlus500 said in an email that it did not offer retail customers CFDs on either an advisory or discretionary basis. \n“The guidance contained in the (FCA) letter is not directly applicable to its (Plus500‘s) business model. Plus500 continues to ensure best practice compliance with the current regulatory regimes in all its jurisdictions.” it said. \nIG Group said in a statement that it complies with the applicable rules and FCA guidance and that the FCA’s latest review has no new financial implications for its business. \nCMC Markets said in a statement that it had already taken steps to address points raised in an individual letter from the FCA last year and in conjunction with its preparations for new MiFID II regulations. \nAnalysts at Peel Hunt also said the FCA’s concerns had been addressed by CMC in advance of the European Union’s MiFID II rules which took effect last week to enhance investor protection and transparency in the bloc. They said the regulatory impact on the spreadbetting sector’s largest players was limited. CONFLICTS \nOther agencies are also scrutinising the market and last month the European Securities and Markets Authority said it was considering restricting the marketing, distribution or sale to retail clients of CFD products. \nThe FCA also revealed that several providers had said they intend to stop providing CFDs to firms that distribute CFDs on an advisory or discretionary basis, while others have already stopped distributing CFDs to retail consumers on this basis. \nThe FCA said firms should define their target market precisely and not rely on broad investor descriptions such as ‘experienced’, ‘sophisticated’ and ‘financially literate’. \nThey should also look at how they communicate with clients and due diligence around taking on new distributors, it said, adding that many firms failed to provide satisfactory evidence that they complied with the FCA’s remuneration code and some companies were not properly managing conflicts of interest. \n“At some firms, senior staff held several roles; for example, at one firm the CEO was also head of compliance. This amounts to a conflict and so should require the firm to put in place relevant controls,” it said. Reporting by Noor Zainab Hussain in Bengaluru; additional reporting by Huw Jones in London; editing by Jason Neely, Alexander Smith and Keith Weir", "external_links": [], "published": "2018-01-10T17:44:00.000+02:00", "crawled": "2018-01-10T18:09:48.024+02:00", "highlightTitle": ""}