{"organizations": [], "uuid": "6cb6664a8ad0d745aaaded4524cd82e7e198c9ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-sally-miller-joins-kleinfelder-as-health-and-safety-director.html", "country": "US", "domain_rank": 767, "title": "Sally Miller Joins Kleinfelder as Health and Safety Director", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.052, "site_type": "news", "published": "2018-01-16T21:05:00.000+02:00", "replies_count": 0, "uuid": "6cb6664a8ad0d745aaaded4524cd82e7e198c9ba"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-sally-miller-joins-kleinfelder-as-health-and-safety-director.html", "ord_in_thread": 0, "title": "Sally Miller Joins Kleinfelder as Health and Safety Director", "locations": [], "entities": {"persons": [{"name": "denver", "sentiment": "negative"}, {"name": "sally miller", "sentiment": "negative"}, {"name": "sally miller joins kleinfelder", "sentiment": "negative"}, {"name": "klei", "sentiment": "negative"}, {"name": "miller", "sentiment": "none"}, {"name": "kleinfelder", "sentiment": "none"}], "locations": [{"name": "denver", "sentiment": "none"}], "organizations": [{"name": "cih", "sentiment": "negative"}, {"name": "health and safety director", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DENVER--(BUSINESS WIRE)-- Kleinfelder is pleased to announce that Sally Miller, CIH, has joined Kleinfelder as the firm’s Health and Safety Director based in our Denver office. Miller brings to Kleinfelder over 35 years of experience managing loss prevention and safety programs. This includes developing, implementing, and communicating comprehensive safety programs for large engineering consulting firms, including country/region-specific policy and procedures, dynamic training programs, reporting processes, and strategic management metrics.\nAs an impassioned Health, Safety and Environment (HSE) leader in the A/E/C industry, Miller has had impressive measurable impacts on the safety culture of consulting engineering businesses. Supporting a region of over 2,500 employees that service environmental, transportation, water, geotechnical, and architectural business lines, Miller reduced, in one year, the total recordable incident rate for the region by more than 60% and improved safety performance, as measured by leading indicators, by more than 55%. She also reduced losses associated with project management by 10% as a result of identifying potential HSE risks such as inadequate subcontractor management, engaging higher levels of review earlier, and sharing lessons learned to prevent similar losses.\nIn addition to serving in corporate HSE roles, Miller has provided extensive technical consulting for clients. This experience includes directing client-specific safety programs, providing industrial hygiene services and conducting hundreds of HSE audits. Miller has also provided health and safety training to clients, having designed over 30 classroom and web-based training programs tailored to each client organization’s needs.\n“Kleinfelder is excited to have such a results-driven safety professional join the firm. We are confident her experience and knowledge will enhance Kleinfelder’s safety ethos to improve safety performance across the firm,” said CEO George Pierson.\nMiller is a Certified Industrial Hygienist (CIH), a Safety Trained Supervisor (certified by the Board of Certified Safety Professionals), and an MSHA Mine Safety Instructor (approved by the US Department of Labor). She has completed numerous specialized trainings including OSHA Hazwoper 40-hour and annual refresher training; MSHA surface and underground mine safety training; Hazardous Material Transport training [in accordance with Department of Transportation (DOT), International Civil Aviation Organization (ICAO), and International Air Transport Association (IATA)]; Loss Prevention System training; Radiation Safety training; Asbestos Building Inspector and Management Planner training; and Investigation and Root Cause Analysis training. Miller holds a Master of Science in Environmental Health, Industrial Hygiene, from Colorado State University, and a Bachelor of Science in Geology from Northern Illinois University.\nAbout Kleinfelder\nKleinfelder has been connecting great people to the best work since 1961. We are engineers, scientists, and construction professionals providing solutions that improve our clients’ transportation, water, energy, and other private infrastructure. As an integrated, cross-disciplinary team of bright, curious, and innovative problem-solvers, we are dedicated to doing the right thing, every day, on every project from over 60 offices in the US, Canada and Australia.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180116006513/en/\nKleinfelder\nDustin Esposito, 617-498-4627\nMarketing and Communications Manager\nDEsposito@Kleinfelder.com\nSource: Kleinfelder", "external_links": ["http://www.businesswire.com/news/home/20180116006513/en/"], "published": "2018-01-16T21:05:00.000+02:00", "crawled": "2018-01-16T21:02:04.000+02:00", "highlightTitle": ""}