{"organizations": [], "uuid": "8c4a7d0aee25d7c36a1e180e77fe5ea3cd4c58e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/03/104925612-GettyImages-858499220_1.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/03/diageo-pulls-snapchat-adverts-globally-as-uk-bans-captain-morgan-ad.html", "country": "US", "domain_rank": 767, "title": "Diageo pulls Snapchat adverts globally as UK bans Captain Morgan ad", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T15:54:00.000+02:00", "replies_count": 0, "uuid": "8c4a7d0aee25d7c36a1e180e77fe5ea3cd4c58e3"}, "author": "Lucy Handley", "url": "https://www.cnbc.com/2018/01/03/diageo-pulls-snapchat-adverts-globally-as-uk-bans-captain-morgan-ad.html", "ord_in_thread": 0, "title": "Diageo pulls Snapchat adverts globally as UK bans Captain Morgan ad", "locations": [], "entities": {"persons": [{"name": "morgan", "sentiment": "negative"}, {"name": "snap", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}], "organizations": [{"name": "diageo", "sentiment": "negative"}, {"name": "committees of advertising practice", "sentiment": "none"}, {"name": "advertising standards authority", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Drinks-maker Diageo has removed all of its advertising on Snapchat globally as it looks into how it can avoid potentially targeting people who are under 18 via the image-sharing app.\nThe decision comes as a Snapchat ad for its Captain Morgan rum brand was banned by the U.K.'s Advertising Standards Authority (ASA) for appealing to under-18s, the legal drinking age in the country.\nIn June, Diageo used an image of a Captain Morgan cartoon-like character as a Snapchat lens, with an animated seagull flying across the screen and voices cheering \"Captain.\" On Wednesday, the ASA ruled that it must not appear again in its current form. The Committees of Advertising Practice, which writes the U.K.'s ad rules, states that no medium should be used to advertise alcohol if more than 25 percent of its audience is under 18.\nEven though Snapchat is sometimes thought of as being loved by younger teens, parent company Snap said in February 2017 that the majority of its users are 18 to 34 years old . Snap told Diageo that 77 percent of U.K. Snapchat users were registered as being over 18, in Diageo's response to the ASA's investigation.\nHowever, even though Snap told the ASA that it uses data to verify users' ages, and that it now has the means to target ads to more specific audiences using \"audience lenses,\" the authority ruled that at the time the Captain Morgan ad ran it was using unverified age information supplied by users.\nSnap said it was \"disappointed\" with the ASA ruling, in an emailed statement. It said that when someone signs up to the platform, they have to state their age, and Snap uses various \"signals\" such as behavioral and interest-based information to verify their claimed age, as other platforms do.\n\"While more options for age targeting on Snapchat have been added since July, we disagree that Diageo intentionally directed its lens to an underage audience when it applied the accurate 18-plus targeting available at the time. The ASA acknowledges the evidence we provided showing that ages supplied by Snapchatters are a robust way to age-restrict ads,\" the statement said.\nshow chapters Snap's $4 million party shows tech is the new Wall Street? 12:16 PM ET Tue, 2 Jan 2018 | 02:25 The ASA also considered augmented reality (AR) elements of the Snapchat lens, such as cheering voices and clinking glasses, to appeal to a younger age group, but a Snap spokesperson disagreed that AR is primarily attractive to children. Google, for example, expects AR applications to be available on \"hundreds of millions\" of Android devices this year .\nSnapchat is in hot competition with platforms like Instagram for ad dollars, and announced a redesign in November 2017 after facing criticism for being hard to use. Losing Diageo as an advertiser – even if temporarily – could be a blow. The drinks-maker spent £1.798 billion ($2.438 billion) on all marketing in 2017.\nA Diageo spokesperson said in an emailed statement: \"We have a strict marketing code, take our role as a responsible marketer very seriously and acknowledge the ASA's ruling. We took all reasonable steps to ensure the content we put on Snapchat was not directed at under-18s — using the data provided to us by Snapchat and applying an age filter.\n\"We have now stopped all advertising on Snapchat globally whilst we assess the incremental age verification safeguards that Snapchat are implementing.\"\nDisclosure: CNBC parent NBCUniversal is an investor in Snap.", "external_links": [], "published": "2018-01-03T15:54:00.000+02:00", "crawled": "2018-01-03T15:51:33.018+02:00", "highlightTitle": ""}