{"organizations": [], "uuid": "ba383ff96175e9b38eeed3a0d9c6adbdf90a2e5c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222424285&w=1200&r=LYNXMPEE0F0VJ", "site_section": "http://feeds.reuters.com/reuters/UKRugbyNews", "section_title": "Reuters: Rugby News", "url": "https://uk.reuters.com/article/uk-rugby-union-nations-scotland/scotland-name-four-uncapped-players-in-six-nations-squad-idUKKBN1F51K3", "country": "US", "domain_rank": 408, "title": "Rugby-Scotland name four uncapped players in Six Nations squad", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T13:11:00.000+02:00", "replies_count": 0, "uuid": "ba383ff96175e9b38eeed3a0d9c6adbdf90a2e5c"}, "author": "", "url": "https://uk.reuters.com/article/uk-rugby-union-nations-scotland/scotland-name-four-uncapped-players-in-six-nations-squad-idUKKBN1F51K3", "ord_in_thread": 0, "title": "Rugby-Scotland name four uncapped players in Six Nations squad", "locations": [], "entities": {"persons": [{"name": "blair kinghorn", "sentiment": "none"}, {"name": "townsend", "sentiment": "none"}, {"name": "murray mccallum", "sentiment": "none"}, {"name": "gray", "sentiment": "none"}, {"name": "scott lawson", "sentiment": "none"}, {"name": "richie gray", "sentiment": "none"}, {"name": "nathan fowles", "sentiment": "none"}, {"name": "gregor townsend", "sentiment": "none"}, {"name": "greig laidlaw", "sentiment": "none"}, {"name": "mark bennett", "sentiment": "none"}], "locations": [{"name": "scotland", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "laidlaw", "sentiment": "none"}, {"name": "rugby union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "bt murrayfield", "sentiment": "none"}, {"name": "reuters/craig brough  fullback blair kinghorn", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 1:17 PM / Updated 5 hours ago Scotland name four uncapped players in Six Nations squad Reuters Staff 3 Min Read \n(Reuters) - Scotland coach Gregor Townsend named four uncapped players and recalled several experienced ones in his 40-man squad for the Six Nations championship. Rugby Union - Autumn Internationals - Scotland vs Australia - BT Murrayfield, Edinburgh, Britain - November 25, 2017 Scotland head coach Gregor Townsend during the warm up before the match Action Images via Reuters/Craig Brough \nFullback Blair Kinghorn, scrumhalf Nathan Fowles, and props Murray McCallum and D‘Arcy Rae were called up with long-serving scrumhalf Greig Laidlaw and lock Richie Gray among those returning to the fold. \nLaidlaw, Gray and centre Mark Bennett, who have 142 caps between them, last played for Scotland in the 2017 Six Nations before suffering injury problems. \n“We welcome Blair Kinghorn into our group for the first time... and also three of our most experienced players in Richie Gray, Greig Laidlaw and Scott Lawson,” Townsend said. \n“We are looking forward to working with them and the rest of the squad to ensure that we build on the momentum the players generated in 2017.” \nBack-row forward John Barclay will continue to captain Scotland, who will be confident ahead of the tournament after victories over Australia and Samoa in November along with a narrow defeat by New Zealand. \nScotland begin their Six Nations campaign against Wales in Cardiff on Feb. 3. \nSquad: \nBacks \nMark Bennett (Edinburgh Rugby), Alex Dunbar (Glasgow Warriors), Nick Grigg (Glasgow Warriors), Chris Harris (Newcastle Falcons), Stuart Hogg (Glasgow Warriors), Pete Horne (Glasgow Warriors), Ruaridh Jackson (Glasgow Warriors), Huw Jones (Glasgow Warriors), Lee Jones (Glasgow Warriors), Blair Kinghorn (Edinburgh Rugby), Greig Laidlaw (ASM Clermont Auvergne), Sean Maitland (Saracens), Byron McGuigan (Sale Sharks), Ali Price (Glasgow Warriors), Henry Pyrgos (Glasgow Warriors), Finn Russell (Glasgow Warriors), Tommy Seymour (Glasgow Warriors), Duncan Taylor (Saracens), Nathan Fowles (Edinburgh Rugby) \nForwards \nJohn Barclay (captain, Scarlets), Simon Berghan (Edinburgh Rugby), Jamie Bhatti (Glasgow Warriors), Magnus Bradbury (Edinburgh Rugby), David Denton (Worcester Warriors), Cornell Du Preez (Edinburgh Rugby), Grant Gilchrist (Edinburgh Rugby), Jonny Gray (Glasgow Warriors), Richie Gray (Toulouse), Luke Hamilton (Leicester Tigers), Rob Harley (Glasgow Warriors), Scott Lawson (Newcastle Falcons), Murray McCallum (Edinburgh Rugby), Stuart McInally (Edinburgh Rugby), Gordon Reid (London Irish), D‘Arcy Rae (Glasgow Warriors), Ben Toolis (Edinburgh Rugby), George Turner (Glasgow Warriors), Hamish Watson (Edinburgh Rugby), Jon Welsh (Newcastle Falcons), Ryan Wilson (Glasgow Warriors) Reporting by Aditi Prakash in Bengaluru, editing by Ed Osmond", "external_links": [], "published": "2018-01-16T13:11:00.000+02:00", "crawled": "2018-01-16T20:47:13.047+02:00", "highlightTitle": ""}