{"organizations": [], "uuid": "b0a024fa9119828f74def4f1f5517531b6486b3a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-ad-tech-company-calldorado-acquires-app-publishing-house-ciamedia.html", "country": "US", "domain_rank": 767, "title": "Ad-tech Company Calldorado Acquires App Publishing House CIAmedia", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T17:00:00.000+02:00", "replies_count": 0, "uuid": "b0a024fa9119828f74def4f1f5517531b6486b3a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-ad-tech-company-calldorado-acquires-app-publishing-house-ciamedia.html", "ord_in_thread": 0, "title": "Ad-tech Company Calldorado Acquires App Publishing House CIAmedia", "locations": [], "entities": {"persons": [{"name": "claudia dreier-poepperl", "sentiment": "none"}], "locations": [{"name": "austria", "sentiment": "none"}, {"name": "enhagen", "sentiment": "none"}, {"name": "denmark", "sentiment": "none"}, {"name": "vienna", "sentiment": "none"}, {"name": "calldorado", "sentiment": "none"}], "organizations": [{"name": "ad-tech company calldorado acquires app publishing house", "sentiment": "negative"}, {"name": "calldorado", "sentiment": "negative"}, {"name": "ciamedia", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Exponentially growing Calldorado makes first major brand acquisition in second year of operation\nCOPENHAGEN, Denmark--(BUSINESS WIRE)-- Danish-based ad tech firm Calldorado has expanded its reach in the app economy by acquiring the Austrian app publisher CIAmedia for an undisclosed amount. The acquisition comes after a successful period of cooperation between the two companies and is a natural next step on Calldorado’s path of accelerated growth.\n“By acquiring CIAmedia and its portfolio of high quality apps, we are extending the Calldorado value chain. Calldorado and CIAmedia have been in cooperation before, and CIAmedia’s focus on Android apps within the Communication and Tools categories is a perfect fit with our mobile advertising technology,” says Claudia Dreier-Poepperl, CEO and Founder of Calldorado. “Calldorado’s vision is to be the world’s number one provider of call-based advertising technology, and by owning and operating a portfolio of relevant apps we are better positioned to realize this vision.”\nCIAmedia was established 2013 in Vienna, Austria. CIAmedia owns and operates the highly successful app acquisition brand Appsbuyout.vc and has built up a strong portfolio of 80 high quality apps with high user engagement and very good LTV (life time value). Appsbuyout has a proven track record of efficient app M&A, and app portfolio management.\nCalldorado’s acquisition of CIAmedia, and subsequently Appsbuyout.vc, has a deeper strategic significance than simply acquiring a formidable app portfolio. Calldorado now covers the full app value chain, from conception and development, through monetization and growth, to trading. Calldorado’s business model has been so successful that it was in a position to acquire CIAmedia within its second year of operation despite being a self-funded company with no backing from Venture Capital.\nAbout Calldorado\nCalldorado is the global leader in call-based advertising technology.\nThe company offers its mobile advertising SDK to app owners free of charge. With their patented technology, Calldorado enables publishers to put their app features into the spotlight with every phone call a user makes or receives as well as to generate substantial revenue. Calldorado was founded in 2016 and is headquartered in Copenhagen, Denmark.\n###\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123005940/en/\nCalldorado ApS\nChristopher Humphrey, VP of Marketing\n+45 31 15 98 88\nchu@calldorado.com\nSource: Calldorado ApS", "external_links": ["http://www.businesswire.com/news/home/20180123005940/en/"], "published": "2018-01-23T17:00:00.000+02:00", "crawled": "2018-01-23T17:51:12.010+02:00", "highlightTitle": ""}