{"organizations": [], "uuid": "c8e250fc3a461af1d8bed4285e17fc92dd18acb7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223874035&w=1200&r=LYNXMPEE0K0HI", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-britain-pensions-may/british-pm-may-says-will-stop-companies-abusing-pension-schemes-idUKKBN1FA0N1", "country": "US", "domain_rank": 408, "title": "PM May says will stop companies abusing pension schemes", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T15:29:00.000+02:00", "replies_count": 0, "uuid": "c8e250fc3a461af1d8bed4285e17fc92dd18acb7"}, "author": "", "url": "https://uk.reuters.com/article/us-britain-pensions-may/british-pm-may-says-will-stop-companies-abusing-pension-schemes-idUKKBN1FA0N1", "ord_in_thread": 0, "title": "PM May says will stop companies abusing pension schemes", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "observer", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 21, 2018 / 1:41 PM / Updated 7 hours ago British PM May says will stop companies abusing pension schemes Reuters Staff 3 Min Read \nLONDON (Reuters) - British Prime Minister Theresa May said she would clamp down on bosses who try to “line their own pockets” while not protecting workers’ pensions, after the collapse of outsourcer Carillion with a 900-million-pound hole in its pension scheme. \nWriting in Sunday’s Observer newspaper, the Prime Minister said private companies could help deliver better public services, but the system needed to be rebalanced in favor of ordinary working people. \n“In the spring, we will set out tough new rules for executives who try to line their own pockets by putting their workers’ pensions at risk - an acceptable abuse that we will end,” she said. \nConstruction and outsourcing services group Carillion was put into liquidation on Monday, swamped by debt and pension liabilities of at least 2.2 billion pounds ($3 billion), and forcing the government to step in to guarantee public services from school meals to roadworks. \nIts more than a dozen pension schemes, which collectively have 27,500 members are on course to transfer to the lifeboat Pension protection Fund, leaving many members who are below retirement age facing a cut in their pensions. [nL8N1PB3VV] \nMay had previously pledged to tackle corporate abuses, and she said in May 2017 she would protect pensions from “irresponsible behaviour by company bosses”, a reference to the public outcry to the demise of department store group BHS after it was sold by billionaire Philip Green. [nL8N1IH40L] \nShe said on Sunday she had taken action on boardroom excesses, for example giving shareholders a greater say in the pay awarded to bosses, and she was determined that the government would stand up to the small amount of businesses that give the majority a bad name. \nBut she also defended the role of the private sector in providing government services, and the action it had taken after the collapse of Carillion. \n“The state also has a role to play when things go wrong and companies fail, as Carillion did last week,” she said. \n“Not by bailing out the directors with a blank cheque - it will be the shareholders of Carillion, not taxpayers, who pay the price for the company’s collapse - but by stepping in and supporting those affected.” \nOpposition Labour Party leader Jeremy Corbyn last week called for the end of the “costly racket” of outsourcing public services to private companies after Carillion’s failure. Reporting by Paul Sandle; Editing by Matthew Mpoke Bigg", "external_links": [], "published": "2018-01-21T15:29:00.000+02:00", "crawled": "2018-01-21T15:54:20.008+02:00", "highlightTitle": ""}