{"organizations": [], "uuid": "87150a07093aa2b23dc955fa38ed7facbae3667b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/buck2.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/03/hersheys-ceo-michele-buck/", "country": "US", "domain_rank": 1196, "title": "Hershey's First Female CEO Is Making Big Changes | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.012, "site_type": "news", "published": "2018-01-03T02:00:00.000+02:00", "replies_count": 0, "uuid": "87150a07093aa2b23dc955fa38ed7facbae3667b"}, "author": "Susie Gharib", "url": "http://fortune.com/2018/01/03/hersheys-ceo-michele-buck/", "ord_in_thread": 0, "title": "Hershey's First Female CEO Is Making Big Changes | Fortune", "locations": [], "entities": {"persons": [{"name": "susie gharib", "sentiment": "negative"}, {"name": "michele buck", "sentiment": "negative"}], "locations": [{"name": "hershey", "sentiment": "none"}], "organizations": [{"name": "hershey", "sentiment": "negative"}, {"name": "kraft", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Susie Gharib January 3, 2018 \nWhen Michele Buck was tapped to run Hershey (hsy) in March 2017, she became the first female CEO in the company’s 123-year history. Fortune included her on our 2017 list of the 50 Most Powerful Women in Business for the first time. And she is now a member of the elite club of women CEOs running Fortune 500 companies—there are just 32 of them. \nSo what is the secret to her success? “Hard work,” she tells Fortune. “I grew up in a very humble family,” Buck says. “My mother lived on a farm with no indoor plumbing. My father was the first in his family to graduate from high school and I learned very early, the values and virtues of hard work. I think there is no substitute for hard work.” \nBuck certainly has been a hard worker in her 12 years at Hershey and the 17 years before that at Kraft. She says she always accepted tough assignments even though she didn’t feel prepared for them. “The times I learned the most and developed the most are when I took those opportunities that were outside my wheelhouse,” she recalls. “I grew so much as an individual and learned that I had something in me that I didn’t realize before.” She is credited with leading Hershey to make several strategic acquisitions outside its traditional confectionary product, including the purchase of Krave beef jerky. \nWhat is Buck’s advice to working women? “Make an impact in every single assignment that you are given. Look at it as how can I take this to the next level. And be confident in yourself,” she says. “I think women just don’t have as much inherent confidence in themselves. They tend to be harsher critics of themselves than they need to be. So go for it.” \nWatch the video above for more of our conversation with Buck. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-03T02:00:00.000+02:00", "crawled": "2018-01-06T22:45:20.001+02:00", "highlightTitle": ""}