{"organizations": [], "uuid": "adbc5a74bfdcacf70bf16e8e504be62193d1d1a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224495971&w=1200&r=LYNXMPEE0M16K", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-britain-banks-payments/regulator-says-ready-to-block-uk-changes-to-cashpoint-fees-idUKKBN1FC1XT", "country": "US", "domain_rank": 408, "title": "Regulator says ready to block UK changes to cashpoint fees", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T16:41:00.000+02:00", "replies_count": 0, "uuid": "adbc5a74bfdcacf70bf16e8e504be62193d1d1a6"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-banks-payments/regulator-says-ready-to-block-uk-changes-to-cashpoint-fees-idUKKBN1FC1XT", "ord_in_thread": 0, "title": "Regulator says ready to block UK changes to cashpoint fees", "locations": [], "entities": {"persons": [{"name": "huw jones", "sentiment": "none"}, {"name": "nicky morgan", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "treasury select committee", "sentiment": "none"}, {"name": "rbs", "sentiment": "none"}, {"name": "barclays", "sentiment": "none"}, {"name": "hsbc", "sentiment": "none"}, {"name": "lloyds", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 2:39 PM / Updated 7 hours ago Regulator says ready to block UK changes to cashpoint fees Huw Jones 3 Min Read \nLONDON (Reuters) - Regulators should block reductions in fees by Britain’s LINK cash machines network if they threatened access to free-to-use ATMs across the country, a senior lawmaker said on Tuesday. \nLINK, used by high street banks like HSBC, Barclays, Lloyds and RBS, is to unveil changes to how it collects one billion pounds a year in fees to pay for its network of 70,000 cash machines, or ATMs, a cost that is ultimately paid by customers. \nLINK’s network is funded by an “interchange” fee that banks say is too high in urban areas where there are many ATMs. They want fee cuts phased in over four years. But small shopkeepers, who often host ATMs in rural areas, say reducing the fees could make it too costly to run free machines in their stores. \nThe move to cut fees follows proposals put to public consultation in November, partly aimed at cutting costs for big banks which have many of their own cash machines. \nNicky Morgan, chair of parliament’s Treasury Select Committee, told the Payment Systems Regulator (PSR) to block the move if it risked cutting availability of ATMs in rural areas. \n“Any significant reduction in free access to cash would be an unacceptable outcome,” she said. “We think a moratorium will be needed if those concerns do not disperse.” \nLawmakers would take a “dim view” if regulators and the industry failed to find a solution, she added. \nConcern about the availability of ATMs has become more acute as banks have shut thousands of branches in recent years, leaving some communities without a branch, as more people bank online and make “contactless” payments using cards. \nPSR Chief Executive Hannah Nixon said the impact of LINK’s proposals on consumers from November had not been thought through. \n“We expect them to continue to fill the gaps in the network and put more money on the table to do just that. If that is not what we see, we will intervene,” Nixon told lawmakers. \nThe PSR has powers to suspend changes, if need be, she said. \nPSR Chairman John Griffith-Jones said banks needed cash machines, and it was in their interest to have a broad geographic spread for current account holders to use. \n“Moral pressure will probably work pretty well, especially if it is understood it’s backed by powers that actually work,” Griffith-Jones said. \nLINK Chief Executive John Howells told Reuters the final version of the reform would be published at the end of January, with the focus on maintaining a broad, free-to-use network. \n“We are expecting that our proposals will deliver that, and also deal with the rapidly declining use of cash by consumers,” he said. Reporting by Huw Jones; Editing by Edmund Blair", "external_links": [], "published": "2018-01-23T16:41:00.000+02:00", "crawled": "2018-01-23T16:54:39.018+02:00", "highlightTitle": ""}