{"organizations": [], "uuid": "d93f31dc3c956472103621e07a9de38934bb22f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180114&t=2&i=1221796248&w=1200&r=LYNXMPEE0D003", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-britain-eu-scotland/sturgeon-sees-golden-chance-to-argue-for-uk-to-remain-in-single-market-idUKKBN1F3007", "country": "US", "domain_rank": 408, "title": "Sturgeon sees \"golden\" chance to argue for UK to remain in single market", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T13:27:00.000+02:00", "replies_count": 0, "uuid": "d93f31dc3c956472103621e07a9de38934bb22f7"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-eu-scotland/sturgeon-sees-golden-chance-to-argue-for-uk-to-remain-in-single-market-idUKKBN1F3007", "ord_in_thread": 0, "title": "Sturgeon sees \"golden\" chance to argue for UK to remain in single market", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "elisabeth o'leary", "sentiment": "none"}, {"name": "nicola sturgeon", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}], "organizations": [{"name": "sturgeon", "sentiment": "neutral"}, {"name": "eu", "sentiment": "none"}, {"name": "snp", "sentiment": "none"}, {"name": "min read  edinburgh", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 14, 2018 / 12:10 AM / Updated 4 minutes ago Sturgeon sees \"golden\" chance to argue for UK to remain in single market Elisabeth O'Leary 3 Min Read \nEDINBURGH (Reuters) - Scottish leader Nicola Sturgeon said on Sunday there was a “golden opportunity” to argue for Britain to remain in the European single market after Brexit, as no-one had yet demonstrated the benefit of loosening trade ties with the EU. FILE PHOTO: Scotland's First Minister Nicola Sturgeon arrives to offer her reaction to the attack in Manchester to journalists in Edinburgh, Britain May 23, 2017. REUTERS/David Cheskin/Pool/File Photo \nBefore publishing a study of the economic impact of Brexit on Scotland on Monday, Sturgeon, whose nationalist SNP runs the devolved Scottish government, said there was no alternative to EU membership that could deliver the same economic benefits. \nShe said Prime Minister Theresa May must defend whatever trade option the UK government chose to pursue with hard evidence, damaging the economy as little as possible. \n“There is zero credible evidence to suggest leaving the Single Market will bring any benefit to our economy. Indeed, as our analysis will show – the harder the Brexit, the worse will be the outcome,” Sturgeon said. \nMay is preparing for the start of talks about Britain’s trade relationship with the EU once it is no longer a member. \nAgreeing a united stance has been made harder by infighting in May’s cabinet and Conservative Party over their vision for the new relationship with the EU, while the biggest opposition party, Labour, is also split on the best way forward. \nSpeaking to the BBC’s Andrew Marr, Sturgeon again urged for Labour to sign up for Britain to remain in the single market, but leader Jeremy Corbyn said membership of the market was dependent on being a member of the EU. \n“So I don’t quite understand why she would keep saying join the single market when leaving the EU means you leave the single market,” Corbyn told the ITV’s Peston on Sunday programme. \n“You have to make a special relationship with the EU,” he said, adding that there were “aspects of the single market” he would want to challenge such as state aid rules. \nMay has said she is targeting the closest possible economic ties with the EU after Brexit to reduce future problems for companies, but also wants to reduce immigration and restore sovereignty by ending the jurisdiction of the European court. \nThe British government has also said it is seeking a one-size-fits-all Brexit that would suit all parts of the UK, ruling out the possibility of a second referendum on independence, a vote Sturgeon said she would be able to have a view on by the end of the year. \nBut Sturgeon’s party says continued single market membership would be the option that best reflects the fact that a majority of Scots vote in the 2016 referendum to stay in the EU. \n“(Those defending Brexit) have completely failed to explain how their approach could even remotely come close to replacing the enormous lost trade and investment,” Sturgeon said. \n“That means there is now a golden opportunity for those moderate voices who are making the case for Scotland and the UK to remain in the single market.” additional reporting by Elizabeth Piper in London; Editing by Kevin Liffey and Raissa Kasolowsky", "external_links": [], "published": "2018-01-14T13:27:00.000+02:00", "crawled": "2018-01-14T13:39:49.006+02:00", "highlightTitle": ""}