{"organizations": [], "uuid": "79eacd50e23c0035c4b7c7a95385d2f649442c38", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-investcorp-appoints-phil-yeates-as-managing-director-in-credit-management.html", "country": "US", "domain_rank": 767, "title": "Investcorp Appoints Phil Yeates as Managing Director in Credit Management", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T18:18:00.000+02:00", "replies_count": 0, "uuid": "79eacd50e23c0035c4b7c7a95385d2f649442c38"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-investcorp-appoints-phil-yeates-as-managing-director-in-credit-management.html", "ord_in_thread": 0, "title": "Investcorp Appoints Phil Yeates as Managing Director in Credit Management", "locations": [], "entities": {"persons": [{"name": "phil yeates", "sentiment": "negative"}, {"name": "jeremy ghose", "sentiment": "none"}, {"name": "phil", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "credit management", "sentiment": "negative"}, {"name": "investcorp", "sentiment": "negative"}, {"name": "global credit management", "sentiment": "none"}, {"name": "natwest markets", "sentiment": "none"}, {"name": "investcorp credit management", "sentiment": "none"}, {"name": "hill samuel merchant bank", "sentiment": "none"}, {"name": "european credit funds", "sentiment": "none"}, {"name": "rothschild & co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 9, 2018 /PRNewswire/ -- Investcorp, a leading global provider and manager of alternative investments, today announces the appointment of Phil Yeates as Managing Director to head its European Credit Funds business, a newly created business vertical for Investcorp Credit Management (ICM). Phil will be based in London and will oversee the structuring and fundraising for closed ended credit funds and separately managed accounts in Europe. Phil will report to Jeremy Ghose, Head of Investcorp Credit Management, the firm's global credit investment business.\nPhil joins ICM following 24 years at Rothschild & Co, where he was instrumental in establishing and developing the Global Credit Management business. He brings with him over three decades' experience in debt capital markets having started his career in Corporate Debt at Hill Samuel Merchant Bank and NatWest Markets.\nCommenting on the appointment, Jeremy Ghose, Head of Investcorp Credit Management, said: \"We are delighted to welcome Phil Yeates to the team, who has extensive market experience and a strong track record. Since our business was acquired by Investcorp in March, 2017, ICM has continued to show stability and growth as a well-established, diverse global alternative credit manager. We look forward to expanding our platform and product offering, creating new opportunities for our investors as part of Investcorp's long-term growth strategy.\"\nAbout Investcorp Credit Management\nInvestcorp Credit Management is a leading global credit investment platform with assets under management of over $11 billion. ICM manages funds which invest primarily in senior secured corporate debt issued by mid and large-cap corporates in Western Europe and the US. The business has a strong track record of consistent performance and growth, employing approximately 50 people in London, New York and Singapore.\nAbout Investcorp\nInvestcorp is a leading global provider and manager of alternative investments, offering such investments to its high-net-worth private and institutional clients on a global basis. Led by a new vision, Investcorp has embarked on an ambitious, albeit prudent, growth strategy. The Firm continues to focus on generating investor and shareholder value through a disciplined investment approach in four lines of business: corporate investment, real estate, alternative investment solutions and credit management.\nAs at June 30, 2017, the Investcorp Group had $21.3 billion in total AUM, including assets managed by third party managers and assets subject to a non-discretionary advisory mandate where Investcorp receives fees calculated on the basis of AUM.\nSince its inception in 1982, Investcorp has made over 170 corporate investments in the U.S., Europe and the Middle East and North Africa region, including Turkey, across a range of sectors including retail and consumer products, technology, business services and industrials, and more than 450 commercial and residential real estate investments in the US, for in excess of $55 billion in transaction value.\nInvestcorp employs approximately 390 people across its offices in Bahrain, New York, London, Abu Dhabi, Riyadh, Doha, and Singapore. It is publicly traded on the Bahrain Bourse (INVCORP). For further information, including our most recent periodic financial statements, which details our assets under management, please visit: www.investcorp.com .\nMedia Contacts:\nInvestcorp\nProsek Partners\nFiras El Amine\nCatherine Wooters\n+973 3998 7838\n212.279.3115 x 287\nfelamine@investcorp.com\ncwooters@prosek.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/investcorp-appoints-phil-yeates-as-managing-director-in-credit-management-300579996.html\nSOURCE Investcorp", "external_links": ["http://www.investcorp.com/", "http://www.prnewswire.com/news-releases/investcorp-appoints-phil-yeates-as-managing-director-in-credit-management-300579996.html"], "published": "2018-01-09T18:18:00.000+02:00", "crawled": "2018-01-09T21:28:00.000+02:00", "highlightTitle": ""}