{"organizations": [], "uuid": "b5aeadc0b0d5fa130ca77a7e5a3fdbde69d76446", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/healthNews", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-health-suicide-drug-overdose/drug-overdose-suicides-may-be-going-undetected-idUSKBN1F0319", "country": "US", "domain_rank": 408, "title": "Drug-overdose suicides may be going undetected", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T06:20:00.000+02:00", "replies_count": 0, "uuid": "b5aeadc0b0d5fa130ca77a7e5a3fdbde69d76446"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-health-suicide-drug-overdose/drug-overdose-suicides-may-be-going-undetected-idUSKBN1F0319", "ord_in_thread": 0, "title": "Drug-overdose suicides may be going undetected", "locations": [], "entities": {"persons": [{"name": "ian rockett", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "morgantown", "sentiment": "none"}], "organizations": [{"name": "reuters health", "sentiment": "negative"}, {"name": "west virginia university school of public health", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters Health) - - Deaths by drug overdose are more likely to be classified as accidental or of undetermined cause, compared to deaths by gunshot or hanging, say U.S. researchers who conclude that drug suicides may be underestimated.\nWith drug overdoses, there are often few clues to suggest suicide, such as a suicide note, according to the first large study of U.S. death investigations and inherent biases in determining the manner of death.\n“The opioid epidemic is killing more people every year at a higher rate,” said lead author Ian Rockett, a professor of epidemiology at the West Virginia University School of Public Health in Morgantown. “Death investigation systems are highly stressed. It’s going to make it very difficult to do the kind of assessments we need to do about their intentionality.”\nHe believes the 32 percent rise in the national suicide rate from 2000 to 2015 is a “serious underestimate,” but it’s impossible to know how many drug intoxication deaths have been written off as accidents.\n“The problem with inaccurate suicide accounting is that it impedes our understanding and prevention of suicide and drug deaths,” Rockett said in a telephone interview.\nThe researchers scrutinized 36,190 suicides and 4,391 undetermined deaths among people 15 years of age and older, using data from 17 states in the U.S. National Violent Death Reporting System (NVDRS) from 2011 to 2013.\nThey looked at the demographics, precipitating circumstances and investigation characteristics of each case. They also explored whether information about a suicide note, knowledge of a prior suicide attempt or a psychiatric history of depression or bipolar disorder increased the odds that a death would be classified as a suicide.\nThis kind of corroborative evidence was much more important for helping medical examiners and coroners detect drug intoxication suicides than it was in for deaths by shooting or hanging, the study found.\nThe existence of a suicide note increased the odds 45-fold that a drug overdose death would be classified as a suicide, whereas a note only raised the odds of classifying gunshot or hanging deaths as suicides by eight-fold, the researchers report in PLoS ONE.\n“The bigger story here is not that death investigations are a really important way we understand how people die,” said Margaret Warner, an injury epidemiologist at the National Center for Health Statistics, a division of the Center for Disease Control and Prevention (CDC).\n“The impact of this work is that it points out the inconsistencies in how deaths are certified,” Warner, who wasn’t involved in the study, said in a phone interview.\nDrug intoxication deaths are among the hardest for determining manner of death, she said. The CDC is looking at death investigation systems around the country and working with medical examiners and coroners on determining the manner of drug overdose deaths.\nEach state is in charge of their death investigation system; it is not a federal program, Warner said, “but we want consistent investigations and comparable stats between states.”\nOverall, the research team found, gunshot and hanging deaths are 41 times more likely to be classified as a suicide by medical examiners and coroners than drug intoxication deaths.\nDeaths where a suicide note was found were 34 times more likely to be classified as a suicide than cases with no note or unknown note status.\nWhen the deceased had a prior suicide attempt, death investigation teams were 2.4 times more likely to classify it as a suicide than without such a history. When decedents had documented unipolar depression or bipolar disorder, they were 61 percent and 41 percent, respectively, more likely to be classified as a suicide than someone without a psychiatric disorder.\n“I want to caution about everything being called a potential suicide because if we make it a very heterogeneous group, it stops having meaning and it’s hard to understand the factors that contribute to suicide,” said Jill Harkavy-Friedman, vice president of research at the American Foundation for Suicide Research in New York, who wasn’t involved in the study.\n“Not every overdose is a suicide. We want to be as clear as we can when you’re calling something a death by suicide,” she said in a phone interview.\nSOURCE: bit.ly/2D3GPlt PLoS ONE, online January 10, 2018.\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html", "http://bit.ly/2D3GPlt"], "published": "2018-01-12T06:20:00.000+02:00", "crawled": "2018-01-12T00:32:50.026+02:00", "highlightTitle": ""}