{"organizations": [], "uuid": "889b068640fe6a38d28220ced898a62cb4dde3d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-dime-community-bank-announces-the-appointment-of-new-chief-risk-officer.html", "country": "US", "domain_rank": 767, "title": "Dime Community Bank Announces the Appointment of New Chief Risk Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.2, "site_type": "news", "published": "2018-01-10T21:00:00.000+02:00", "replies_count": 0, "uuid": "889b068640fe6a38d28220ced898a62cb4dde3d5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-dime-community-bank-announces-the-appointment-of-new-chief-risk-officer.html", "ord_in_thread": 0, "title": "Dime Community Bank Announces the Appointment of New Chief Risk Officer", "locations": [], "entities": {"persons": [{"name": "kenneth j. mahon", "sentiment": "negative"}, {"name": "timothy king", "sentiment": "none"}, {"name": "christopher porzelt", "sentiment": "none"}, {"name": "chris", "sentiment": "none"}, {"name": "mahon", "sentiment": "none"}, {"name": "porzelt", "sentiment": "none"}], "locations": [{"name": "brooklyn", "sentiment": "none"}, {"name": "n.y.", "sentiment": "none"}, {"name": "dcom", "sentiment": "none"}], "organizations": [{"name": "dime community bank", "sentiment": "negative"}, {"name": "eisneramper llp", "sentiment": "none"}, {"name": "dime community bancshares, inc.", "sentiment": "none"}, {"name": "consulting services group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BROOKLYN, N.Y., Jan. 10, 2018 (GLOBE NEWSWIRE) -- Kenneth J. Mahon, President and Chief Executive Officer of Dime Community Bancshares, Inc. (the “Company” or “Dime”) (NASDAQ:DCOM), the parent company of Dime Community Bank (the “bank”), is pleased to announce that Christopher Porzelt has been appointed as Executive Vice President and Chief Risk Officer of the bank. Mr. Porzelt, who joined the bank on November 1, 2017, fills the role vacated by Timothy King, who retired on December 31, 2017.\n\"We are excited about having someone of Chris's caliber join Dime and further build out and strengthen our already robust risk culture,\" said Mr. Mahon. \"The changing nature of risk in our industry and throughout the bank requires a highly integrated and proactive approach to enterprise risk management (\"ERM\"), and having a leader such as Chris, with his depth and diversity of experience, will be highly valuable.\"\nMr. Porzelt has over 25 years of audit and financial services experience and joins the bank from EisnerAmper LLP, where he was Managing Director of the Consulting Services Group. In this role, Mr. Porzelt engaged with financial services companies to protect value and enhance outcomes and performance through practical and cost-effective solutions, including the coordination and utilization of people, processes and technology, as well as the translation of complex challenges and regulatory requirements into sound strategies. Prior to this, he was Managing Director and Global Head of American International Group’s Property Casualty Global Financial Controls Unit. Previously, Mr. Porzelt was an Audit Partner in the Financial Services Practice at both Deloitte and Arthur Andersen where he led audit and consulting engagements for a broad group of companies, ranging in size from de novos to Fortune 100 companies. Mr. Porzelt holds a Bachelor of Science degree in Accounting from St. John's University and is a Certified Public Accountant.\nMr. Porzelt, who will report to the Risk Committee of the Board of Directors, will be responsible for continuing the buildout of the ERM function to effectively manage risk throughout the bank and integrate risk management with corporate strategy. The ERM group was further strengthened by two recent additions, Kevin Corbett and Alex Leon. Mr. Corbett, who serves as Chief Credit Officer, was most recently Chief Credit Officer of Astoria Bank and Chairman of the Executive Loan Committee. Mr. Leon, who serves as Chief Information Security Officer, was previously at Mitsubishi UFJ Trust and Banking Corporation as Head of Information Technology/Information Security Business Management.\nABOUT DIME COMMUNITY BANCSHARES, INC.\nThe Company had $6.44 billion in consolidated assets as of September 30, 2017, and is the parent company of the bank. The bank was founded in 1864, is headquartered in Brooklyn, New York, and currently has twenty-eight branches located throughout Brooklyn, Queens, the Bronx, Nassau County and Suffolk County, New York. More information on the Company and the bank can be found on Dime's website at www.dime.com .\nContact: Anthony Rose, Executive Vice President and Director of Investor Relations. 718-782-6200 extension 5260\nSource:Dime Community Bancshares, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/62df8943-672c-4844-903e-0d57b8e91cda"], "published": "2018-01-10T21:00:00.000+02:00", "crawled": "2018-01-10T20:05:39.004+02:00", "highlightTitle": ""}