{"organizations": [], "uuid": "8b2866b9e9906aabb808ba4309670f1653fed389", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-finisar-announces-retirement-of-co-founder-and-ceo-jerry-rawls-and-appointment-of-michael-hurlston-as-chief-executive.html", "country": "US", "domain_rank": 767, "title": "Finisar Announces Retirement of Co-Founder and CEO Jerry Rawls and Appointment of Michael Hurlston as Chief Executive Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T00:21:00.000+02:00", "replies_count": 0, "uuid": "8b2866b9e9906aabb808ba4309670f1653fed389"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-finisar-announces-retirement-of-co-founder-and-ceo-jerry-rawls-and-appointment-of-michael-hurlston-as-chief-executive.html", "ord_in_thread": 0, "title": "Finisar Announces Retirement of Co-Founder and CEO Jerry Rawls and Appointment of Michael Hurlston as Chief Executive Officer", "locations": [], "entities": {"persons": [{"name": "jerry rawls", "sentiment": "neutral"}, {"name": "michael hurlston", "sentiment": "neutral"}, {"name": "michael", "sentiment": "none"}, {"name": "hurlston", "sentiment": "none"}, {"name": "robert stephens", "sentiment": "none"}, {"name": "jerry", "sentiment": "none"}, {"name": "rawls", "sentiment": "none"}], "locations": [{"name": "sunnyvale", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "finisar", "sentiment": "neutral"}, {"name": "finisar corporation", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SUNNYVALE, Calif., Jan. 11, 2018 (GLOBE NEWSWIRE) -- Finisar Corporation (NASDAQ:FNSR), a global technology leader for subsystems and components for fiber optic communications, today announced the retirement of Chairman and Chief Executive Officer Jerry Rawls and the appointment of Michael Hurlston as Chief Executive Officer and a director of the Company effective today. Mr. Hurlston and Mr. Rawls will work together to ensure a smooth transition. Mr. Rawls will continue to serve as a Director of the Company. The Company’s Lead Director Robert Stephens has been appointed Chairman of the Board of Directors.\n“After a thorough and thoughtful search process, we are pleased to welcome Michael Hurlston to Finisar as Chief Executive Officer and a member of the Board of Directors,” said Robert Stephens, Finisar’s Chairman of the Board of Directors. “Michael has broad experience as a highly-successful technology industry executive and we know Michael is the right leader to build on our success and market-leading position.”\n“On behalf of the Board of Directors, I want to thank Jerry for his tireless and inspired leadership of Finisar over the past nearly 30 years,” continued Mr. Stephens. “Under Jerry’s leadership, Finisar has grown from its founding in Quonset hut in Menlo Park, California to a world-leading optics company with cutting-edge products and approximately $1.4 billion in revenues in its most recently completed fiscal year. We are deeply grateful to Jerry for his innumerable contributions to Finisar’s growth and success to-date and are confident that he has positioned the Company solidly for the great opportunities in our industry today.”\n“I’m thrilled that Michael is going to lead Finisar into the future,” said Jerry Rawls, Finisar’s co-founder and outgoing Chief Executive Officer. “Michael’s experience, proven technical skills, and leadership abilities will serve Finisar, our customers, employees, and stockholders very well. At Finisar, we have built a great company with fantastic employees dedicated to serving our customers’ needs and developing world-leading, cutting-edge technology products. I am confident that Michael is the right person to lead us to even greater success.”\nMichael Hurlston most recently served as a Senior Vice President and General Manager of the Mobile Connectivity Products/Wireless Communications and Connectivity Division at Broadcom Limited. Previously, he held senior leadership positions in sales, marketing and general management at Broadcom. Prior to joining Broadcom in 2001, Mr. Hurlston held senior marketing and engineering positions at Oren Semiconductor, Inc., Avasem, Integrated Circuit Systems, Micro Power Systems, Exar and IC Works. Mr. Hurlston is also a Director of Ubiquiti Networks, Inc. and a member of the Board of Advisors of Vilynx Inc. Mr. Hurlston received a B.S.E.E., an M.S.E.E. and an M.B.A. from the University of California, Davis.\n“I am very excited to join Finisar and lead the great company that Jerry and his fellow employees have built,” said Mr. Hurlston. “Finisar has world-leading products and technology, engineering talent, and manufacturing capabilities and a reputation for excellence in the industry and with its customers. The optical communications and components industry is rapidly advancing and there are many new exciting customer opportunities. I look forward to getting to work.”\nABOUT FINISAR\nFinisar Corporation (NASDAQ:FNSR) is a global technology leader for fiber optic subsystems and components that enable high-speed voice, video and data communications for telecommunications, networking, storage, wireless, and cable TV applications. For more than 25 years, Finisar has provided critical optics technologies to system manufacturers to meet the increasing demands for network bandwidth and storage. Finisar is headquartered in Sunnyvale, California, USA with R&D, manufacturing sites, and sales offices worldwide. For additional information, visit www.finisar.com .\nFinisar-G\nInvestor Contact:\nKurt Adzema\nChief Financial Officer\n408-542-5050 or Investor.relations@finisar.com\nSource:Finisar Corporation", "external_links": ["https://www.globenewswire.com/Tracker?data=kO8x26IM7_1gHiTkquuu1ht4DQ8bT9Cq0QNROvyGB09XFlcZUG57qLM0BbhpoPOGvqx6JnXV2aCDYEyrKnEUZXKkTBiNVJbKEShCJUbfSGsB7Vpl7blRK9MrFxO7oRZP", "https://www.globenewswire.com/NewsRoom/AttachmentNg/f09e8e7b-bf48-4b41-99b9-ae8cc43c032e"], "published": "2018-01-12T00:21:00.000+02:00", "crawled": "2018-01-12T02:09:31.018+02:00", "highlightTitle": ""}