{"organizations": [], "uuid": "fbab388517422e8df7c5a9c8ed1c89c129b7c3a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/10/the-associated-press-las-vegas-hotels-bet-on-technology-to-attract-dazzle-guests.html", "country": "US", "domain_rank": 767, "title": "Las Vegas hotels bet on technology to attract, dazzle guests", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T21:05:00.000+02:00", "replies_count": 0, "uuid": "fbab388517422e8df7c5a9c8ed1c89c129b7c3a7"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/10/the-associated-press-las-vegas-hotels-bet-on-technology-to-attract-dazzle-guests.html", "ord_in_thread": 0, "title": "Las Vegas hotels bet on technology to attract, dazzle guests", "locations": [], "entities": {"persons": [], "locations": [{"name": "las vegas", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}, {"name": "sin city", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "diet coke", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LAS VEGAS (AP) — It takes just minutes for a room service attendant to respond to a text message asking for a soda, bringing the Diet Coke on a tray with a glass of ice and lime wedges, no need for the modern hassle of placing a phone call.\nThousands of guests at some of Las Vegas' casino-hotels also can get towels, food and toiletries delivered with just a few taps on their smartphone. It comes as the staples of hotel room technology — a phone on a nightstand and a flat-screen TV — aren't cutting it anymore in the hypercompetitive world of Sin City tourism.\nGuests can use tablets to control room features like lights and temperature. Shower infusers and special lights promise travelers a chance to recharge. And a 4-foot-tall (1-meter-tall) robot can point visitors to the nearest ATM. In the battle for millions of Las Vegas' tourists, voice-assisted speakers and purification systems also are part of the push to attract ever-more-demanding customers and keep them coming back.\n\"The hotel brands or the casino brands are trying to make themselves evolve to become more relevant to a younger audience that is highly technologically enabled,\" said Robert Rippee, director of the Hospitality Lab at the University of Nevada, Las Vegas.\nLas Vegas hotels are not the only ones using such technology. The Acme Hotel Co. in Chicago put an Amazon Echo in every room and the Waldorf Astoria in Beverly Hills, California, has equipped rooms with iPads. But what sets Sin City properties apart is the volume of guests they handle, which can test the technology that must be easy to understand.\n\"Let's say the tablet is a Microsoft Surface, but the tablet you use is an iPad, so you immediately have a gap,\" Rippee said. \"You, as the user, now have to learn to use a product an operating system you are unfamiliar with. If you are here for two nights, you are going to discard it.\"\nCaesars Entertainment launched a texting service at its 3,976-room Caesars Palace casino-hotel on the Las Vegas Strip in August, months after rolling it out at two boutique hotels. Senior vice president and chief experience officer Michael Marino said the service aims to improve guests' stay after the company noticed a dip in phone calls.\n\"It's not like they have less needs, it's just that something has happened over the last couple of years where people just don't like to call people anymore,\" Marino said.\nFour properties now have the service named Ivy, which the company credits for higher scores of two of its hotels on travel review website TripAdvisor.\nThe service uses artificial intelligence to automatically answer common questions and requests, such as gym location and hours of operation. But trained staffers type back responses to more complex inquiries such as where Muslims should face to pray in the direction of the Kaaba in Mecca.\n\"The window of your room faces to the East. If you pray facing the window, you will be oriented towards Mecca,\" Ivy answered within two minutes.\nThe Cosmopolitan casino-hotel also launched a chatbot a year ago, around the same time Wynn Resorts announced that an Amazon Echo would be installed in every room of the Wynn Las Vegas casino-hotel.\nAt the Aria and Vdara hotels, each room is equipped with a tablet with applications that allow guests to schedule breakfast delivery, access thousands of publications and adjust temperature and lights. Travelers also can choose special rooms at the MGM Grand and The Mirage with several lighting options, including one that helps the body's internal clock, and a device that infuses the shower's water with vitamin C.\nMeanwhile, a shiny white, wide-eyed standing robot named Pepper in the lobby of the luxury Mandarin Oriental hotel can answer a set of preprogrammed questions, including checkout time, how to connect to the Wi-Fi network and the location of the spa.\n\"I've seen robots on TV, but never in person. It's so cute,\" said Ana Rosa Santiago, a Miami resident who took a selfie with Pepper. \"I already sent it to all my family.\"\nFollow Regina Garcia Cano on Twitter at https://twitter.com/reginagarciakNO .", "external_links": [], "published": "2018-01-10T21:05:00.000+02:00", "crawled": "2018-01-11T03:56:56.009+02:00", "highlightTitle": ""}