{"organizations": [], "uuid": "06e6ad61b4d2f4c35e0b62523b083c6d5c288441", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-aehr-test-systems-reports-88-percent-revenue-growth-in-second-quarter-of-fiscal-2018-and-reiterates-full-year-guidance.html", "country": "US", "domain_rank": 767, "title": "Aehr Test Systems Reports 88% Revenue Growth in Second Quarter of Fiscal 2018 and Reiterates Full Year Guidance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.816, "site_type": "news", "published": "2018-01-05T00:06:00.000+02:00", "replies_count": 0, "uuid": "06e6ad61b4d2f4c35e0b62523b083c6d5c288441"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-aehr-test-systems-reports-88-percent-revenue-growth-in-second-quarter-of-fiscal-2018-and-reiterates-full-year-guidance.html", "ord_in_thread": 0, "title": "Aehr Test Systems Reports 88% Revenue Growth in Second Quarter of Fiscal 2018 and Reiterates Full Year Guidance", "locations": [], "entities": {"persons": [], "locations": [{"name": "fremont", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "gaap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FREMONT, Calif. , Aehr Test Systems (NASDAQ:AEHR), a worldwide supplier of semiconductor test and burn-in equipment, today announced financial results for its second quarter of fiscal 2018 ended November 30, 2017.\nFiscal Second Quarter Financial Results:\nNet sales were $7.9 million, up 88% from $4.2 million in the second quarter of fiscal 2017. GAAP net income was $60,000, or $0.00 per diluted share, compared to a GAAP net loss of $1.5 million, or $0.09 per diluted share, in the second quarter of fiscal 2017. Non-GAAP net income was $424,000, or $0.02 per diluted share, compared to a non-GAAP net loss of $1.2 million, or $0.08 per diluted share, in the second quarter of fiscal 2017. Backlog as of November 30, 2017 was $12.2 million.\nFiscal First Six Months Financial Results:\nNet sales were $14.9 million, up 56% from $9.5 million in the first six months of fiscal 2017. GAAP net income was $70,000, or $0.00 per diluted share, compared to a GAAP net loss of $2.2 million, or $0.15 per diluted share, in the first six months of fiscal 2017. Non-GAAP net income was $650,000, or $0.03 per diluted share, compared to a non-GAAP net loss of $1.7 million, or $0.11 per diluted share, in the first six months of fiscal 2017.\nAn explanation of the use of non-GAAP financial information and a reconciliation of the non-GAAP financial measures to the most directly comparable GAAP financial measures can be found in the accompanying tables.\nSecond Quarter and Recent Business Highlights:\nAnnounced today an initial order of over $2 million from a new customer for the FOX-XP™ test and burn-in system for singulated bare die testing and burn-in of silicon photonics devices for data communications applications. This order is from a leader in the photonics market, representing Aehr Test’s fourth customer for its FOX-XP system and an additional application for its FOX-XP singulated die / module test configuration. Announced last month a follow-on order from one of its lead FOX-XP Test and Burn-in System customers for an additional multi-wafer test and burn-in system to provide additional test capacity to meet the customer’s increasing silicon photonics device production requirements. Announced during the quarter a follow-on order from the subcontractor of one of its lead customers for a partially populated FOX-XP system, multiple DiePak® Carriers for their next generation devices, and multiple FOX DiePak Loader / Unloaders to increase their current production capacity. Announced during the quarter an order for an Advanced Burn-in and Test System (ABTS™) from a new customer in China, representing Aehr Test’s 10th ABTS customer in China and continued expansion and success in the growing China market. Finished the quarter with a strong pick up in shipments and revenue for ABTS products including initial shipments to the company’s ABTS Chamber OEM customer.\nGayn Erickson, President and CEO of Aehr Test Systems, commented:\n“We continue to see good momentum in the first year of availability of our new FOX-P platform, and are generating increased interest and new opportunities both within our initial lead customers as well as with multiple potential new customers.\n“Today we are excited to announce a new customer for the FOX-XP test and burn-in system. This initial production order is from an industry leader in the photonics market space, and not only further expands our FOX-XP customer base, but also represents an additional application for our FOX-XP test cell with a singulated bare die test configuration. This first application at this customer is for integrated silicon photonics devices where the customer will now be able to do both production burn-in and final test of their bare die with our DiePak carriers, thereby reducing costs and improving quality. This expanded applicability of our DiePak carriers could significantly expand our market for highly parallel bare die test and burn-in of devices where safety, security, or consumer confidence is critical.\n“So far this fiscal year, we have received additional orders from our two lead customers for FOX-XP systems for additional capacity and capability to address new devices. We continue to be very happy with our relationship and partnership with both of these customers and their subcontractors / suppliers. We are also actively engaged with several additional opportunities related to our FOX-XP and FOX-1P wafer level and singulated die / module test and burn in systems, and we are seeing good traction with these potential new customers. This added visibility adds to our confidence that we can continue to add new customers and applications to our FOX-P family of products going forward.\n“We continue to maintain our confidence in our revenue growth forecast for this fiscal year, and reiterate our previously provided financial guidance for the fiscal year ending May 31, 2018 of full year total revenue growth of at least 50% over fiscal 2017 and to be profitable for the year. With nearly $15 million in revenue on the books for the first half of the fiscal year, a healthy backlog of $12.2 million at the end our fiscal first half, and the additional orders announced since the start of our second half, we believe we are well positioned to achieve this expectation.”\nManagement Conference Call and Webcast\nAehr Test Systems will host a conference call and webcast today at 5:00 p.m. Eastern (2:00 p.m. PT) to discuss its second quarter fiscal 2018 operating results. To access the call dial 877-723-9521 (+1 719-325-4901 outside the United States) and give the participant pass code 5514558 . In addition, a live and archived webcast of the conference call will be available over the Internet at www.aehr.com in the Investor Relations section. A replay of the conference call will also be available via telephone beginning approximately two hours after conclusion of the call through 8:00 p.m. ET on January 11, 2018. To access the replay dial-in information, please click here .\nAbout Aehr Test Systems\nHeadquartered in Fremont, California, Aehr Test Systems is a worldwide provider of test systems for burning-in and testing logic and memory integrated circuits and has an installed base of more than 2,500 systems worldwide. Increased quality and reliability needs of the Automotive and Mobility integrated circuit markets are driving additional test requirements, capacity needs and opportunities for Aehr Test products in package and wafer level test. Aehr Test has developed and introduced several innovative products, including the ABTS and FOX families of test and burn-in systems, WaferPak contactors, and DiePak carriers. The ABTS systems are used in production and qualification testing of packaged parts for both low-power and high-power logic as well as memory devices. The FOX family of systems includes single and multi-wafer full wafer contact test and burn-in systems used for burn-in and functional test of complex devices, such as leading-edge memories, digital signal processors, microprocessors, microcontrollers and systems-on-a-chip. The WaferPak contactor contains a unique full wafer probe card capable of testing wafers up to 300mm that enable", "external_links": ["https://www.globenewswire.com/Tracker?data=kKZQIm4_ySkEclj5t9OQaEkbcdgqReujyWsk0BQoyM4Ym9peIU6cX8_qki6lbCZzeZxBYdnF7RLv0XYzw-nMvQ==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/c898020f-f5ac-4121-836a-8b1d1cbae16c", "https://www.globenewswire.com/Tracker?data=-Ro8434xhAknH4tRVCWh5BVq2z50BxcHx3MlLZRtzHdf1pd7d5Ii23-1QSeI70rtepy91xG0bOUP7qIHtU6k6FrdqLaLhphqAHgynnAF8ye_a1Yw894FkFZ9WjmWN8lkGFvF0ezQXJFA7WR6SiW63XfIpfQE4JUUGW7sfl9loj_gBAnO9khlEzX0QE4TiFErDbtEbyXVRrcEh38_C7AE6w==", "https://www.globenewswire.com/Tracker?data=kKZQIm4_ySkEclj5t9OQaPbMwir__8kVrTZMIZlaI8sBiCnvKBWBN3pha9u5BM5oHGEK0V0Ph8SVYj_uAdPvuw=="], "published": "2018-01-05T00:06:00.000+02:00", "crawled": "2018-01-05T01:33:25.069+02:00", "highlightTitle": ""}