{"organizations": [], "uuid": "f9f0421411f2d29f6dd9234730d3735826ebec8f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 8, "shares": 8, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222899837&w=1200&r=LYNXMPEE0H05I", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england/after-anfield-blow-city-look-to-restore-smooth-progress-idUKKBN1F708S", "country": "US", "domain_rank": 408, "title": "After Anfield blow, City look to restore smooth progress", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T04:24:00.000+02:00", "replies_count": 0, "uuid": "f9f0421411f2d29f6dd9234730d3735826ebec8f"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england/after-anfield-blow-city-look-to-restore-smooth-progress-idUKKBN1F708S", "ord_in_thread": 0, "title": "After Anfield blow, City look to restore smooth progress", "locations": [], "entities": {"persons": [{"name": "pep guardiola", "sentiment": "none"}, {"name": "guardiola", "sentiment": "none"}, {"name": "simon evans", "sentiment": "none"}, {"name": "rafa benitez", "sentiment": "none"}], "locations": [{"name": "city", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "manchester city", "sentiment": "none"}, {"name": "england", "sentiment": "none"}], "organizations": [{"name": "anfield", "sentiment": "negative"}, {"name": "liverpool", "sentiment": "none"}, {"name": "etihad", "sentiment": "none"}, {"name": "united", "sentiment": "none"}, {"name": "newcastle united", "sentiment": "none"}, {"name": "manchester united", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "burnley", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 2:29 AM / Updated 6 hours ago After Anfield blow, City look to restore smooth progress Simon Evans 3 Min Read \nMANCHESTER, England (Reuters) - Manchester City will be aiming to resume business as usual when they face Newcastle United at the Etihad stadium in the Premier League on Saturday. \nCity’s 4-3 loss to Liverpool at Anfield on Sunday allowed Manchester United to close the gap to 12 points and ended Pep Guardiola’s team’s 22-match unbeaten run in the league this season. \nLiverpool’s relentless, energetic high pressing and sharp and decisive finishing exposed weaknesses in City’s defence but it would be a major surprise if Newcastle were to even attempt to replicate such an approach, let alone upset Guardiola’s men. \nRafa Benitez’s side, 15th in the league and without a win in their last three games, have only managed 21 goals in 23 games and are more likely to try to frustrate City rather than engage in an open match. \nCity’s lead remains a comfortable one and all United, who travel to seventh-placed Burnley, can do is to keep collecting the points and hope for an unlikely slump. \nUnited’s 3-0 win over Stoke City, with Paul Pogba impressive, showed they have recovered from their festive wobble, and the prospect of Alexis Sanchez arriving from Arsenal is giving their fans cause for optimism. \nBurnley secured a 2-2 draw at Old Trafford on Boxing Day but they have not won in their last six league games and in losing at Crystal Palace last week showed signs of tiredness setting in. \nAntonio Conte has frequently complained of his team feeling the pace but they will expect three points from their trip to the south coast to face 16th placed Brighton & Hove Albion. \nPromoted Brighton have picked up just two points from their last four games and are three points off the relegation zone. \nHowever, Chelsea had not won in their last four games and had failed to score in three before Wednesday’s FA Cup third-round replay victory on penalties over Norwich City following a 1-1 draw after extra time. \nJuergen Klopp’s Liverpool are at bottom club Swansea City on Monday and after their vibrant display against City will be looking to extend a run of four straight wins. \nTheo Walcott, fresh from his move from Arsenal, is in line to make his debut for Sam Allardyce’s Everton at home to West Bromwich Albion. \nThe Gunners, smarting from last week’s loss to Bournemouth and the possible departure of Sanchez, have a tricky home game against Roy Hodgson’s revitalised Crystal Palace who have risen to 12th. \nTottenham Hotspur travel to Southampton having crushed Mauricio Pellegrino’s side 5-2 when the teams met at Wembley on Boxing Day. Editing by Ed Osmond", "external_links": [], "published": "2018-01-18T04:24:00.000+02:00", "crawled": "2018-01-18T04:50:36.027+02:00", "highlightTitle": ""}