{"organizations": [], "uuid": "0f3e144dfa6af7008428a259662e6725a459a03d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000336/device/rss", "section_title": "Janet Yellen", "url": "https://www.cnbc.com/2018/01/31/what-to-expect-when-youre-expecting-a-change-in-fed-leadership.html", "country": "US", "domain_rank": 767, "title": "What to expect when you’re expecting a change in Fed leadership", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T21:00:00.000+02:00", "replies_count": 0, "uuid": "0f3e144dfa6af7008428a259662e6725a459a03d"}, "author": "Keris Lahiff", "url": "https://www.cnbc.com/2018/01/31/what-to-expect-when-youre-expecting-a-change-in-fed-leadership.html", "ord_in_thread": 0, "title": "What to expect when you’re expecting a change in Fed leadership", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This week ushers out the first female Federal Reserve chair, Janet Yellen , and ushers in Donald Trump pick Jerome Powell . \nExpect an adjustment period as the Fed changes hands, says Sven Henrich, founder of NorthmanTrader. \n\"When a new Fed chair comes in, markets kind of want to test this new Fed chair, see if there's a change in policy and positioning,\" Henrich told CNBC's \" Trading Nation \" on Tuesday, adding that some investors see the change as a good time to take \"some money off the table.\" \nA change in Fed leadership generally fogs the outlook for rates and historically pressures the market. On average, the Dow has been negative in the 6 months after a new Fed chair assumed the position. \nPowell will assume the seat from Yellen when her term ends on Feb. 3. He will be the 16th Fed chair in the more than 100 years of the central bank. \nPowell's nomination in November was largely applauded by Wall Street punditry. Having served as a Fed governor since 2012 and frequently backing Yellen's decisions, he was taken as a pick likely to continue the Fed's current monetary policy. \nBut low interest rates are increasingly seen as out of sync with an improving economy and a tight labor market. The Fed might have no choice but to make more aggressive moves to normalize policy than it did under Yellen's watch, according to Henrich. \nConsider this: In 2000, the U.S. unemployment rate hit a low of 3.8 percent, while the Fed funds rate held at 6 percent through the middle of the year. Then, in 2007, unemployment fell to 4.4 percent, while the fed funds rate sat at 5.25 percent. \nIn 2018, unemployment has not budged from 4.1 percent in several months, its lowest since the turn of the century, but the fed funds rate remains at its crisis-era level of 1.25 percent. \n\"There's a huge gap in narrative between what we've seen in past cycles and what we've seen now,\" he said. \nUnder Yellen's leadership, the Fed moved off near-zero interest rates put in place by former Fed chair Ben Bernanke during the financial crisis. Yellen also clearly telegraphed the central bank's expected moves and made changes gradually so as not to shock the market. \nSince December 2015, the Fed has raised rates by a quarter-percent just five times. The fed funds rate of 1.25 to 1.5 percent is the same level as in October 2008, toward the end of a string of cuts implemented during the financial crisis. The Federal Open Market Committee unanimously decided to leave rates unchanged at their January meeting, the last under Yellen leadership. \nA rising fed funds rate and its spillover into the broader financial system this year could have a large impact on consumer loans and liabilities, says Henrich. \n\"Interest payments for consumers and for the U.S. government are already rising rapidly at this point despite rates being still historically low,\" he added. \"We have these tax cuts and we have benefits from that. But how much are consumers prepared to spend their tax-cut money on basically paying off their credit card?\" \nThe markets are pricing in an average three rate hikes from the Fed this year, with the first likely to come in March. At least three rate hikes would see the fed funds rate end the year at 2.25 to 2.5 percent, still more than half the levels seen before the financial crisis. show chapters", "external_links": [], "published": "2018-01-31T21:00:00.000+02:00", "crawled": "2018-01-31T21:04:52.021+02:00", "highlightTitle": ""}