{"organizations": [], "uuid": "d47c4fa50883e78fcbb73da4dff835414850099a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/08/ap_17210438661304.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/03/why-tesla-model-3-deliveries-missed-the-mark/", "country": "US", "domain_rank": 1196, "title": "Why Tesla Missed Its Model 3 Production Goals Again | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.158, "site_type": "news", "published": "2018-01-03T02:00:00.000+02:00", "replies_count": 0, "uuid": "d47c4fa50883e78fcbb73da4dff835414850099a"}, "author": "Kirsten Korosec", "url": "http://fortune.com/2018/01/03/why-tesla-model-3-deliveries-missed-the-mark/", "ord_in_thread": 0, "title": "Why Tesla Missed Its Model 3 Production Goals Again | Fortune", "locations": [], "entities": {"persons": [{"name": "andrej sokolow/picture-alliance/dpa", "sentiment": "none"}, {"name": "andrej sokolow", "sentiment": "none"}, {"name": "tesla", "sentiment": "none"}, {"name": "jeffrey osborne", "sentiment": "none"}, {"name": "colin rusch", "sentiment": "none"}, {"name": "kirsten korosec", "sentiment": "none"}], "locations": [{"name": "fremont", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "evercore", "sentiment": "none"}, {"name": "oppenheimer", "sentiment": "none"}, {"name": "cowen & co.", "sentiment": "none"}, {"name": "elon musk", "sentiment": "none"}, {"name": "bloomberg news", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tesla Why Tesla Model 3 Deliveries Missed the Mark First cars of the more reasonable Tesla vehicle Model 3 can be seen during the delivery on the company grounds in Fremont, US, 28 July 2017. Tesla plans on making the Model 3 also completely automotive in the course of time. Photo by: Andrej Sokolow/picture-alliance/dpa/AP Images Andrej Sokolow — picture-alliance/dpa/AP By Kirsten Korosec January 3, 2018 \nTesla produced 2,425 of its new Model 3 electric cars in the fourth quarter and delivered 1,550, missing Wall Street expectations as the company led by Elon Musk tries to solve production bottlenecks that have forced the company to dial back its own mass manufacturing goals. \nEstimates for Model 3 deliveries varied wildly, coming in as low as 800 from Colin Rusch of Oppenheimer all the way up to 2,250 from Jeffrey Osborne of Cowen & Co., and about 5,800 from analysts at Evercore. Analysts’ average estimate for the model 3 deliveries was about 2,900 units, according to a Bloomberg News survey . \nDespite making “major progress” addressing Model 3 production bottlenecks, the company has pushed back its target of producing 5,000 Model 3 sedans per week to the end of the second quarter. This is the second time Tesla has punted on its 5,000-per-week milestone. \nShares were down 1.65% in after-hours trading. \nTesla said it will have a more gradual ramp through the first quarter “to focus on quality and efficiency rather than simply pushing for the highest possible volume in the shortest period of time.” The company will likely end the first quarter at a weekly rate of about 2,500 Model 3 vehicles. “We intend to achieve the 5,000 per week milestone by the end of Q2,” Tesla said in its report. \nThere is some evidence that the ramp up lately has not been so gradual, or that perhaps some bottlenecks have been removed, causing a sudden increase in production. Of the 2,425 Model 3 vehicles produced in the fourth quarter, 793 of them (or nearly 33%) were made in the last seven working days of the quarter, according to Tesla. \n“As a result of the significant growth in our production rate, we made as many Model 3’s since Dec. 9 as we did in the more than four months of Model 3 production up to that point,” Tesla said, explaining that this is why it wasn’t able to deliver many of these cars during the holiday season, just before the quarter ended. \nTesla said it reduced production of its Model S and Model X in the fourth quarter to put more of its workers on the Model 3. \n“Tesla would have been better served had it not announced such lofty plans for its production ramp-up,” Michelle Krebs, executive analyst for Autotrader said in an email. “The company has now said it is focused on quality versus volume, which is the right focus. The Model 3 must be right in terms of quality. Ramping up production levels with a flawed product is foolish.” \nHere’s a quick production breakdown for Q4 : Total: 24,565 vehicles Model S and X (the company didn’t break these out): 22,140 Model 3: 2,425 \nDespite continued headwinds with the Model 3, Tesla did manage to deliver more of its Model X, Model S, and Model 3 vehicles than in previous quarters. It also surpassed its 100,000-vehicle goal for 2017. Tesla reported it delivered 101,312 Model S and X vehicles in 2017, a 33% increase over 2016. \nTesla delivered 29,870 vehicles in the fourth quarter, a 27% increase over the same quarter in 2016 and 9% more than the third quarter. \nHere’s a quick delivery breakdown for Q4 : Total: 29,870 vehicles Model X: 13,120 Model 3: 1,550 \nThe company said another 2,520 Model S and X vehicles and 860 Model 3 vehicles were in transit to customers at the end of the quarter. These will be counted as deliveries in Q1 2018, Tesla said. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-03T02:00:00.000+02:00", "crawled": "2018-01-04T02:15:23.001+02:00", "highlightTitle": ""}