{"organizations": [], "uuid": "d21e9a9392079d2cecbdaf1f69f59ee205b51dc5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/25/104796768-wilbur-ross-1.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/trump-gets-recommendations-to-fight-steel-aluminum-dumping.html", "country": "US", "domain_rank": 767, "title": "Trump gets recommendations to fight steel, aluminum dumping", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.183, "site_type": "news", "published": "2018-01-22T18:44:00.000+02:00", "replies_count": 0, "uuid": "d21e9a9392079d2cecbdaf1f69f59ee205b51dc5"}, "author": "Lori Ann Larocco", "url": "https://www.cnbc.com/2018/01/22/trump-gets-recommendations-to-fight-steel-aluminum-dumping.html", "ord_in_thread": 0, "title": "Trump gets recommendations to fight steel, aluminum dumping", "locations": [], "entities": {"persons": [{"name": "wilbur ross", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "david a. grogan", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "ross", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "taxes commerce", "sentiment": "negative"}, {"name": "cnbc wilbur ross  commerce", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "David A. Grogan | CNBC Wilbur Ross \nCommerce Secretary Wilbur Ross has recommended to President Donald Trump a wide range of options to deal with aluminum and steel dumping in the U.S., including potentially higher tariffs, sources told CNBC. \nThe options also include specifically targeting \"bad actors\" in other countries that are active in imports of the metals. \nTrump has 90 days to review the the so-called 232 reports' findings and recommendations. The president would then decide on what course of action to take. \nWhen he nominated Ross to be Commerce secretary, Trump put the former investor at the forefront of his ambitious, nationalist trade policy. During the election, Trump scored points with an array of working-class voters by saying he would renegotiate trade deals, such as the North American Free Trade Agreement, or NAFTA, which the president has said favored other countries over the U.S. \nDuring his confirmation hearing last year, Ross told senators he considered himself \"an activist\" for U.S. industries and would be willing to provide \"people power\" to enable the department to self-initiate anti-dumping and countervailing duty cases. \n\"By picking strategic cases and initiating them, it will send a message to the people on the other side that we are getting more serious about this,\" he said at the time. \nThe Aluminum Association, a trade group, applauded Ross's report. \n\"Persistent aluminum overcapacity in China is making it impossible for the U.S. aluminum industry to compete on a level playing field,\" said Heidi Brock, president and CEO of the group. \"We very much appreciate the efforts by President Trump and Secretary Ross to advance fair trade and address this long-standing challenge for the aluminum industry.\" \nTrump and his administration announced the Section 232 investigation into steel and aluminum in April 2017. The investigation was to determine whether the imports posed a threat to the country's national security. \nSince Trump's inauguration just over a year ago, the Commerce department has initiated 84 antidumping and countervailing duty investigations – up from 52 in the previous year. \nThe news comes a day after Axios, citing sources , reported that Ross had fallen out of favor with Trump , who sidelined the Commerce secretary as the lead voice for the U.S. in trade negotiations. The White House pushed back on that characterization, however. \n\"The president is excited with the actions that Secretary Ross will be taking on trade in the future,\" a White House official told CNBC.", "external_links": [], "published": "2018-01-22T18:44:00.000+02:00", "crawled": "2018-01-22T18:44:51.002+02:00", "highlightTitle": ""}