{"organizations": [], "uuid": "9647d53dcd651ada421adca0c8856898af7ef3dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222367504&w=1200&r=LYNXMPEE0F0IK", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-britain-eu-johnson/uks-saving-after-brexit-even-bigger-than-350-million-pounds-johnson-says-idUKKBN1F50SY", "country": "US", "domain_rank": 408, "title": "UK's saving after Brexit even bigger than 350 million pounds, Johnson says", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T10:40:00.000+02:00", "replies_count": 0, "uuid": "9647d53dcd651ada421adca0c8856898af7ef3dc"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-eu-johnson/uks-saving-after-brexit-even-bigger-than-350-million-pounds-johnson-says-idUKKBN1F50SY", "ord_in_thread": 0, "title": "UK's saving after Brexit even bigger than 350 million pounds, Johnson says", "locations": [], "entities": {"persons": [{"name": "johnson", "sentiment": "neutral"}, {"name": "brexiteers", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "truro", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "brexit", "sentiment": "neutral"}, {"name": "eu", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 8:40 AM / Updated an hour ago UK's saving after Brexit even bigger than 350 million pounds, Johnson says Reuters Staff 3 Min Read \nLONDON (Reuters) - Britain will have even more money to spend on public services than the disputed 350 million pounds a week Brexiteers promised after the country leaves the European Union, Foreign Secretary Boris Johnson said in an interview published on Tuesday. FILE PHOTO: Former London Mayor Boris Johnson speaks at the launch of the Vote Leave bus campaign, in favour of Britain leaving the European Union, in Truro, Britain May 11, 2016. REUTERS/Darren Staples \nThe 350 million pound figure was a central and controversial part of the pro-Leave campaign’s “Take back control” message in the runup to the 2016 referendum. Last September government statisticians accused Johnson of misusing state data by repeating it. \nBritain’s theoretical gross contribution to the EU in 2016 was 18.9 billion pounds -- more than 360 million per week -- but this was automatically lowered to 13.9 billion pounds by a rebate arrangement that has been in place since 1984. \nThe government received a further 4.4 billion pounds back to spend mostly on farm subsidies and infrastructure in poorer regions. Overall, Britain’s net payment to the EU worked out at 181 million pounds a week. \nBrexit opponents say Johnson and other pro-Leave campaigners deliberately misled the public by saying 350 million pounds a week could be spent on the state-run National Health Service (NHS), a claim emblazoned on a campaign bus, and it has become symbolic of the divisions caused by the referendum. \nBut in the Guardian interview Johnson said the UK’s weekly gross contribution to the EU would rise to 438 million pounds by the time Britain left the bloc. Britain's Foreign Secretary Boris Johnson, arrives in Downing Street, London, January 9, 2018. REUTERS/Peter Nicholls \n“There was an error on the side of the bus,” Johnson told the Guardian newspaper. “We grossly underestimated the sum over which we would be able to take back control. As and when the cash becomes available – and it won’t until we leave – the NHS should be at the very top of the list.” \nJohnson has previously said the 350 million pound figure referred to the gross payments to the EU, rather than the net amount. It also does not take account of EU funds given directly to other British bodies such as universities. \nIn the last week, a number of senior Brexit campaigners such as Nigel Farage, the former head of the UK Independence Party (UKIP), suggested there needed to be another referendum to reaffirm the 2016 result of 52-48 percent in favour of leaving the EU. \nThey fear Prime Minister Theresa May’s approach has led to the watering down of several of their demands, including the ability to reduce immigration and to reclaim sovereignty by leaving the jurisdiction of the European Court of Justice. \nMay has ruled out another vote and Johnson also told the paper he did not think there should be another referendum. \n“We’ve just had one, and I think it went pretty well but it was something that caused an awful lot of heartache and soul-searching, and everybody went through the wringer on it,” he said. “I‘m not convinced that the public is absolutely gagging for another Brexit referendum.” Reporting by Michael Holden; Editing by Hugh Lawson", "external_links": [], "published": "2018-01-16T10:40:00.000+02:00", "crawled": "2018-01-16T11:03:52.038+02:00", "highlightTitle": ""}