{"organizations": [], "uuid": "6412e85be5bb74b766ad0af4325927076ff5cca3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225146019&w=1200&r=LYNXMPEE0O0YH", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews/", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-mideast-crisis-syria-un/syrian-peace-talks-start-in-vienna-as-russian-meeting-looms-idUKKBN1FE1PW", "country": "US", "domain_rank": 408, "title": "Syrian peace talks start in Vienna as Russian meeting looms", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T14:59:00.000+02:00", "replies_count": 0, "uuid": "6412e85be5bb74b766ad0af4325927076ff5cca3"}, "author": "", "url": "https://uk.reuters.com/article/uk-mideast-crisis-syria-un/syrian-peace-talks-start-in-vienna-as-russian-meeting-looms-idUKKBN1FE1PW", "ord_in_thread": 0, "title": "Syrian peace talks start in Vienna as Russian meeting looms", "locations": [], "entities": {"persons": [{"name": "bashar al-assad", "sentiment": "none"}], "locations": [{"name": "vienna", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "damascus", "sentiment": "none"}, {"name": "vienna", "sentiment": "none"}, {"name": "idlib", "sentiment": "none"}, {"name": "ankara", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 1:02 PM / Updated 28 minutes ago Syrian peace talks start in Vienna as Russian meeting looms Reuters Staff 3 Min Read \nVIENNA (Reuters) - U.N.-brokered peace talks with the Syrian government and opposition began in Vienna on Thursday, days before Syria’s close ally Russia was due to host separate negotiations to end the war. \nPrevious rounds of U.N.-sponsored peace talks have made little progress while Syrian government forces backed by Russia and Iran have continued to gain ground for years, recovering swathes of the country from rebel fighters. \nGovernment forces recently escalated offensives against two remaining rebel pockets, Idlib in the northwest and eastern Ghouta near Damascus. Turkey has also poured troops into the north to fight Kurdish militias that have established regional autonomy and are seen by Ankara as a menace to its security. \nHaving regained the upper hand in the almost seven-year civil war, President Bashar al-Assad appears far from ready to negotiate with his enemies at all, let alone step down as part of any peaceful solution as rebel groups have demanded. \nFew expect a breakthrough at these two-days talks aimed at addressing issues related to a new constitution, but their host, U.N. Special Envoy for Syria Staffan de Mistura, has continued to express optimism, adding on Wednesday: “It’s a very critical moment. Very, very critical.” \nRussia, Turkey and Iran convened eight Syria meetings in Astana last year, with the stated aim of agreeing “de-escalation” zones to ease hostilities in western Syria where the three states wield influence. \nThe Sochi peace congress was announced after their last meeting in December. De Mistura has acknowledged the Sochi congress but it remains unclear how he plans to address it. \nWestern and some Arab states believe that Moscow’s initiative would lay groundwork for a solution more favourable to the government in Damascus and its allies. \nThe opposition will decide in the next two days whether to attend Sochi, its chief negotiator Nasr Hariri, said on Wednesday. He added that the talks would be a test of all sides’ commitment to a political solution rather than a military one. \nPrevious rounds have taken place sporadically in Geneva, with a mandate to discuss new elections, reformed governance, a new constitution and the fight against terrorism. \nBut De Mistura has not managed to coax the warring sides into speaking face to face, and it was only at the eighth round in December that the rebel opposition united in one delegation, raising modest hopes for direct talks. \nDespite that, the Syrian government delegation objected to the opposition’s tough line on the future of Assad, and those talks achieved nothing. \nThe Syrian government delegation arrived at the U.N. offices for a meeting with De Mistura at 11:40 a.m. (1040 GMT), with the opposition due to follow in the afternoon after it had left. Neither De Mistura nor the head of the government delegation, Bashar al-Ja‘afari, commented to reporters as they arrived. Reporting by Shadia Nasralla and Francois Murphy; Editing by Raissa Kasolowsky", "external_links": [], "published": "2018-01-25T14:59:00.000+02:00", "crawled": "2018-01-25T15:16:25.030+02:00", "highlightTitle": ""}