{"organizations": [], "uuid": "682408e1752dc8b8cac84d70a1467ecfb173e783", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/08/24/102942912-GettyImages-500797301.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/how-to-ace-the-curveball-interview-question-you-never-saw-coming.html", "country": "US", "domain_rank": 767, "title": "How to ace the curveball interview question you never saw coming", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.119, "site_type": "news", "published": "2018-01-23T16:00:00.000+02:00", "replies_count": 0, "uuid": "682408e1752dc8b8cac84d70a1467ecfb173e783"}, "author": "Courtney Connley", "url": "https://www.cnbc.com/2018/01/22/how-to-ace-the-curveball-interview-question-you-never-saw-coming.html", "ord_in_thread": 0, "title": "How to ace the curveball interview question you never saw coming", "locations": [], "entities": {"persons": [{"name": "suzy welch", "sentiment": "none"}, {"name": "welch", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A well-prepared interview candidate knows the answer to the most common questions — things like \"What are your strengths and weaknesses?\" and \"Where do you see yourself in five years?\" — like the back of their hand. But even the sharpest candidates can be stumped by an unexpected curveball question.\nAccording to bestselling management author and CNBC contributor Suzy Welch, these questions are designed to knock you off your game in order to see how you respond to the unexpected.\nWelch tells CNBC Make It that the key to answering curveball questions like \"How many tennis balls can fit into this room?\" or \"If you could have any superpower, what would it be?\" is to understand what the interviewer is trying to learn about you.\nCNBC Contributor Suzy Welch. No one, she says, expects an exact answer like, \"I, Suzy Welch, could fit 3,435 tennis balls in this room deflated and 1,115 inflated.\" Instead, hiring managers want to see how well you can think in unexpected circumstances and how creative you can get with your response.\nHere are four things she says to consider when you're pitched a curveball:\n1. Answer with poise Regardless of how thrown you are by the question, you want to prove to a potential employer that you can thrive under pressure.\n\"Every job has moments where people are blindsided,\" Welch says. \"A curveball is just trying to simulate that. So, no matter where your answer takes you in terms of content, don't stumble over your words, panic or start babbling.\"\nRather than blurting out anything, take a moment to collect your thoughts and then deliver your response.\n\"A great go-to line for starters is, 'That's an interesting question, let me think about it for a moment,'\" says Welch.\nshow chapters Suzy Welch: How to make a great first impression 8:57 AM ET Tue, 2 Jan 2018 | 01:39 2. Answer with confidence Curveball questions can zap your confidence. But no matter how uncertain you are about how to answer, keep your cool. Consider how you might buy yourself some more time to respond, and walk the interviewer through your thought process.\nWelch says it's OK to confidently say, \"I don't know,\" to a hiring manager. In that case you'll want to immediately pivot to talking about how you would find the answer.\n\"Lift back the veil on how your brain works, especially under pressure,\" she says.\n3. Be authentic You may be tempted to overthink your response in an effort to impress the interviewer. However, Welch says, it's important to keep in mind that many of these questions are meant to elicit an answer from your gut, rather than your head.\nIf asked about your desired superpowers, Welch says you should respond by saying something like, \"The superpower I wish I had was curing blindness, because I've seen how that affliction has taken its toll on my dad in the past 10 years.\"\nShe says an honest answer is always better than \"cooking up something slick and phony on the spot.\"\nshow chapters Suzy Welch: Here's how to answer the interview question, \"Where do you see yourself in five years?\" 8:51 AM ET Tue, 31 Oct 2017 | 01:38 4. Show a sense of humor Job interviews can be tense. Welch says you shouldn't be afraid to be the one to lighten the mood.\n\"If you've got a sense of humor — and I hope you do — let it out,\" she says. \"Humor is a great asset at work to diffuse tough situations.\"\nShe adds that when you get a curveball question it's fine to admit that you're taken aback, but you never want to freeze up and deliver a completely dull response.\n\"Say something witty,\" she says. \"Ask if you can consult your crystal ball, whatever, just don't be a stiff.\"\nYou may not encounter a totally unexpected question in every single interview, but when you do, don't panic. This is your chance to demonstrate that you can roll with the punches.\n\"Curveballs are pretty rare in the interview gambit, but if one finds you, don't freak,\" says Welch. \"Your answer, delivered the right way, may be just the thing that gets you the job.\"\nSuzy Welch is the co-founder of the Jack Welch Management Institute and a noted business journalist, TV commentator and public speaker.\nVideo by Richard Washington\nLike this story? Like CNBC Make It on Facebook !\nMore from Suzy Welch:\nHere's why everything you've been told about mentors is wrong\nHere's how long you should stay at a job you hate for your resume's sake\nA 4-step strategy for instantly impressing everyone you meet\nshow chapters Suzy Welch: Here's why everything you've been told about mentors is wrong 8:55 AM ET Tue, 16 Jan 2018 | 01:45", "external_links": [], "published": "2018-01-23T16:00:00.000+02:00", "crawled": "2018-01-23T16:47:39.007+02:00", "highlightTitle": ""}