{"organizations": [], "uuid": "26952c5466772728996566d60f4e4c3f2e7751cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-saudi-reforms-arrests/eleven-saudi-princes-detained-following-protest-media-idUSKBN1EV09B", "country": "US", "domain_rank": 408, "title": "Eleven Saudi princes detained following protest: media", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T17:22:00.000+02:00", "replies_count": 0, "uuid": "26952c5466772728996566d60f4e4c3f2e7751cf"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-saudi-reforms-arrests/eleven-saudi-princes-detained-following-protest-media-idUSKBN1EV09B", "ord_in_thread": 0, "title": "Eleven Saudi princes detained following protest: media", "locations": [], "entities": {"persons": [{"name": "sabq.org", "sentiment": "none"}, {"name": "sabq", "sentiment": "none"}], "locations": [{"name": "riyadh", "sentiment": "none"}, {"name": "saudi arabia", "sentiment": "none"}, {"name": "riyadh", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 6, 2018 / 9:22 AM / in 16 minutes Eleven Saudi princes detained following protest over utility bills Reuters Staff 3 Min Read \nRIYADH (Reuters) - Saudi authorities have detained 11 princes after they gathered at a royal palace in Riyadh in a rare protest against austerity measures that included suspending payment of their utility bills, Saudi media reported on Saturday. \nThe government information service, the Centre for International Communication, said it was checking the report. \nSaudi Arabia, the world’s top oil exporter, has introduced reforms that included cutting subsidies, introducing value added tax (VAT) and cutting perks to royal family members to try to cope with a drop in crude prices that has caused a budget deficit estimated at 195 billion riyals in 2018. \nNews website sabq.org said the princes had gathered at the Qasr a-Hokm, a historic royal palace, demanding the cancellation of a royal decree that stopped state payment of water and electricity bills for royal family members. \nThey were also demanding compensation for a death sentence issued against a cousin, Sabq.org said, without naming him. \n“They were informed of the error of their demands, but they refused to leave Qasr al-Hokm,” Sabq said, quoting unidentified sources. “A royal order was issued to the royal guards ... to intervene and they were detained and put into al-Hayer prison in preparation to put them on trial.” \nSabq said the guards who arrested the princes were from a unit comprising more than 5,000 members linked to Crown Prince Mohammed bin Salman, who is leading a campaign of reforms that involved rounding up more than 200 senior officials, including some royal family member, suspected of corruption. \nIt gave no details on the identity of the princes but said the leader of the group had been identified by the initials S.A.S. \n“Everybody is equal before the law and anyone who does not implement regulations and instructions will be held accountable, no matter who he is,” the website added. \nArabic-language Okaz daily carried a similar report. Reuters could not immediately verify the report. \nSaudi Arabia last year rounded up dozens of royal family members, current and former senior officials in the crackdown on corruption that has also strengthened the power of the heir to the Saudi throne, Prince Mohammed bin Salman. \nThey were held at the five-star Ritz Hotel in the capital Riyadh while government officials negotiated financial settlements. Reporting by Aziz El Yaakoubi; Writing by Sami Aboudi; Editing by Mark Potter", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-06T17:22:00.000+02:00", "crawled": "2018-01-06T11:37:11.004+02:00", "highlightTitle": ""}