{"organizations": [], "uuid": "d08ce0a89798ce852ec395c557cbc5d53b2cb04e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-immucell-appoints-two-new-members-to-its-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "ImmuCell Appoints Two New Members to its Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-30T14:30:00.000+02:00", "replies_count": 0, "uuid": "d08ce0a89798ce852ec395c557cbc5d53b2cb04e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-immucell-appoints-two-new-members-to-its-board-of-directors.html", "ord_in_thread": 0, "title": "ImmuCell Appoints Two New Members to its Board of Directors", "locations": [], "entities": {"persons": [{"name": "rosgen", "sentiment": "none"}, {"name": "steven t. rosgen", "sentiment": "none"}, {"name": "bobbi jo brockmann", "sentiment": "none"}], "locations": [{"name": "portland", "sentiment": "none"}, {"name": "maine", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "alberta", "sentiment": "none"}, {"name": "calgary", "sentiment": "none"}], "organizations": [{"name": "immucell corporation", "sentiment": "negative"}, {"name": "immucell", "sentiment": "negative"}, {"name": "university of calgary", "sentiment": "none"}, {"name": "strategem research inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PORTLAND, Maine, Jan. 30, 2018 (GLOBE NEWSWIRE) -- ImmuCell Corporation (Nasdaq:ICCC) (“ImmuCell” or the “Company”), a growing animal health company that develops, manufactures and markets scientifically-proven and practical products that improve the health and productivity of dairy and beef cattle, today announced that Mr. Steven T. Rosgen and Ms. Bobbi Jo Brockmann were appointed to its Board of Directors effective immediately.\nMr. Rosgen, based in Calgary, Alberta, Canada, has more than 28 years of experience building brand strategies for products, services and organizations in a range of industries including working with leading global agricultural brands. Currently, he is President of Strategem Research Inc., a company he founded in 2005 to integrate consumer insights into clients’ pricing and branding strategies. Previously, he was a senior partner with Street Smart Strategic Planning. He holds a Bachelor of Commerce Degree from the University of Calgary.\n“I’m pleased to be appointed to the Board of Directors of ImmuCell at a time when the Company is introducing major new technologies for livestock producers. As a marketer there is nothing more exciting than the chance to disrupt markets with innovative products,” said Mr. Rosgen. “In my role as a board member, I look forward to helping align the Company’s core competencies with market needs to drive customer satisfaction and stockholder value.”\nIn addition to her appointment to the board, Ms. Brockmann will continue to serve the Company as Vice President of Sales and Marketing. She first joined ImmuCell as Director of Sales and Marketing in 2010. “Our portfolio is expanding with one-of-a-kind products that can provide meaningful economic benefit to dairy and beef producers. That’s something that I’m excited to be a part of,” added Ms. Brockmann. “I look forward to increasing my contribution to ImmuCell as a member of the board.”\n“We recently launched First Defense ® Tri-Shield ™, the only USDA approved calf-level scours preventative providing immediate immunity against E. coli , coronavirus, and rotavirus pathogens, and we are fast approaching the anticipated launch of our intramammary treatment for subclinical mastitis, which will not require a milk discard,” commented Michael F. Brigham, President and CEO. “Expanding the sales and marketing expertise of our board will help us execute our growth plan.”\nThe Company’s Board of Directors is now comprised of four independent directors and three non-independent directors. All directors are subject to re-election by the Company’s stockholders at the 2018 Annual Meeting of Stockholders.\nAbout ImmuCell\nImmuCell Corporation's ( Nasdaq:ICCC ) purpose is to create scientifically-proven and practical products that improve the health and productivity of dairy and beef cattle. ImmuCell has developed products that provide significant, immediate immunity to newborn dairy and beef livestock. The Company is developing a novel treatment for mastitis, the most significant cause of economic loss to the dairy industry. Press releases and other information about the Company are available at: http://www.immucell.com .\nSafe Harbor Statement:\nThis Press Release contains “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. Such statements include, but are not limited to, any statements relating to: projections of future financial performance; the scope and timing of ongoing and future product development work and commercialization of our products; future costs of product development efforts; the estimated prevalence rate of subclinical mastitis; the expected efficacy of new products; future market share of and revenue generated by current products and products still in development; future sources of financial support for our product development, manufacturing and marketing efforts; the future adequacy of our own manufacturing facilities or those of third parties with which we have contractual relationships to meet demand for our products on a timely basis; the future adequacy of our working capital and the availability and cost of third party financing; timing and future costs of a facility to produce the Drug Substance (our active pharmaceutical ingredient, Nisin); the timing and outcome of pending or anticipated applications for regulatory approvals; future regulatory requirements relating to our products; future expense ratios and margins; future compliance with bank debt covenants; costs associated with sustaining compliance with cGMP regulations in our current operations and attaining such compliance for the facility to produce the Drug Substance; factors that may affect the dairy and beef industries and future demand for our products; our effectiveness in competing against competitors within both our existing and our anticipated product markets; the cost-effectiveness of additional sales and marketing expenditures and resources; the accuracy of our understanding of our distributors’ ordering patterns; anticipated changes in our manufacturing capabilities and efficiencies; anticipated competitive and market conditions; and any other statements that are not historical facts. Forward-looking statements can be identified by the use of words such as “expects”, “may”, “anticipates”, “aims”, “intends”, “would”, “could”, “should”, “will”, “plans”, “believes”, “estimates”, “targets”, “projects”, “forecasts” and similar words and expressions. In addition, there can be no assurance that future developments affecting us will be those that we anticipate. Such statements involve risks and uncertainties, including, but not limited to, those risks and uncertainties relating to difficulties or delays in development, testing, regulatory approval, production and marketing of our products, competition within our anticipated product markets, customer acceptance of our new and existing products, product performance, alignment between our manufacturing resources and product demand, the uncertainties associated with product development and Drug Substance manufacturing, actual as compared to expected or estimated costs of expanding our manufacturing facilities, our potential reliance upon third parties for financial support, products and services, changes in laws and regulations, decision making by regulatory authorities, possible dilutive impacts on existing stockholders from any equity financing transactions in which we may engage, currency values and fluctuations and other risks detailed from time to time in filings we make with the Securities and Exchange Commission, including our Quarterly Reports on Form 10-Q, our Annual Reports on Form 10-K and our Current Reports on Form 8-K. Such statements are based on our current expectations, but actual results may differ materially due to various factors, including the risk factors discussed above.\nContacts: Michael F. Brigham, President and CEO\nImmuCell Corporation\n(207) 878-2770\nJoe Diaz, Robert Blum and Joe Dorame\nLytham Partners, LLC\n(602) 889-9700\niccc@lythampartners.com\nSource:ImmuCell Corporation", "external_links": ["https://www.globenewswire.com/Tracker?data=rsciAJGoFpz-Gz3tkXMfGBH8QqACV5di-EePYkWOH3zBdMSbk2BA4ymC9Xl6zLH8_8_HoCx5w-dZZrVMjBRLRhGHPllK9w1_H9ueZrGoyQ8=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/680330c2-368b-4abc-9429-878b0c9fb1a2"], "published": "2018-01-30T14:30:00.000+02:00", "crawled": "2018-01-30T15:33:30.000+02:00", "highlightTitle": ""}