{"organizations": [], "uuid": "18b321550db78c72bf3ea1111d0c32731398f0c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/03/27/104367170-GettyImages-648471036.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/west-virginia-saw-drop-in-opioid-painkillers-prescribed-deaths-rose.html", "country": "US", "domain_rank": 767, "title": "West Virginia saw drop in opioid painkillers prescribed, deaths rose", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.723, "site_type": "news", "published": "2018-01-23T00:54:00.000+02:00", "replies_count": 0, "uuid": "18b321550db78c72bf3ea1111d0c32731398f0c1"}, "author": "Dan Mangan", "url": "https://www.cnbc.com/2018/01/22/west-virginia-saw-drop-in-opioid-painkillers-prescribed-deaths-rose.html", "ord_in_thread": 0, "title": "West Virginia saw drop in opioid painkillers prescribed, deaths rose", "locations": [], "entities": {"persons": [{"name": "west virg", "sentiment": "negative"}], "locations": [{"name": "west virginia", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "west viriginia", "sentiment": "none"}], "organizations": [{"name": "backyardproduction | getty images senate", "sentiment": "negative"}, {"name": "west virginia board of pharmacy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "West Virginia just had its biggest annual drop ever in the number of prescription painkillers and other powerful drugs dispensed — but the number of fatal drug overdoses in the state continued to rise.\nThat's because an increase in the use of illegal opioids — including heroin, fentanyl and carfentanil — has more than made up for the decrease in prescription opioid-based painkiller use in West Viriginia.\nAnd the state remains the leader in overdose deaths per capita in the United States, which is dealing with an epidemic of abuse of prescription painkillers and illegal opioids.\n\"The 884 drug overdose deaths reported in 2016 was a record high for the state, but 2017 numbers are on pace to surpass that total,\" said the West Virginia Board of Pharmacy's annual report.\nIn 2017, the total number of doses of prescribed controlled substances — which includes opioid-based painkillers such as oxycodone — dispensed in West Virginia fell by a whopping 31.3 million compared with 2016.\nBut even after that 12 percent decrease in doses, there were still almost 236 million doses of controlled substances dispensed in West Virginia, according to the pharmacy board's report.\nThe drop first was reported by the Charleston Gazette-Mail newspaper .\nHalf of the controlled substance doses detailed in the report — more than 118 million — are opioids. The other substances included anti-anxiety medications and amphetamine products.\nWest Virginia has just 1.8 million people. The means the doses of legal opioids dispensed in the state last year were equivalent to 65 doses for every man, woman and child.\nStill, the state has made big strides in decreasing the number of prescription opioid-based painkillers dispensed. Last year, there were 18 million combined fewer dispensed doses of oxycodone and hydrocodone, which were the biggest factors in the overall decrease seen in the dispensing of controlled substances.\nAnd since 2011, there have been 61 million fewer combined doses of those two types of painkillers dispensed in the state.\nBut in a sign of how prevalent painkiller abuse remains in the state, there was an increase of about 1 million doses of buprenorphine, a medication used to treat opioid dependency.\nMichael Goff, acting executive director of the pharmacy board, attributed the big decreases in opioids dispensed to the fact that \"the word's out\" about the drugs.\n\"There's a lot of articles dealing with, doctors and pharmacies are concerned, there's lawsuits everywhere,\" Goff said.\nWest Virginia's struggles with the opioid epidemic have received considerable attention from the media. And the state's high rate of prescriptions for the drugs have been cited in lawsuits against makers of opioids and distributors.\nThe state pharmacy board, for its part, sends out letters to pharmacies and health providers when a person who was prescribed or dispensed drugs by those entities fatally overdoses.\n\"We've sent out hundreds\" of letters, Goff noted.\nThe board also is notified when an individual sees eight or more doctors and visits five different pharmacies within a six-month period, and sends out a letter to providers in such cases, he said.\nWhile such actions and an overall increase in awareness of the problems with prescription medication may have driven down the dispensing rate, and fatal ODs from those drugs, the death rate from illegal opioids has spiked considerably.\nIn 2016, there were about 250 fatal ODs linked to heroin in West Virginia — almost five times the number seen in 2012. The increase in fatal ODs from fentanyl, a synthetic opioid often illegally sold, was even more dramatic.\nFentanyl-linked deaths reached about 350 in 2016, or about seven times the number seen just two years before that. Fentanyl is now responsible for more OD deaths in West Virginia than any other controlled substance.\nThe Gazette-Mail noted that West Virginia lawmakers are now considering legislation that would seek to reduce the number of painkillers that doctors can prescribe.\nThat proposed law would restrict the first prescription a person received for short-term pain to just a seven-day supply.\nLast week, a study published in Becker's Hospital Review found that refilling prescriptions for opioids — as opposed to the amount of opioids taken after first being prescribed — significantly boosted the risk of abuse.\nThe risk \"increased 20 percent with each additional week of opioid use and 44 percent with each additional prescription refill,\" the study found.\n\"Additionally, researchers found dosage — the amount of opioids taken over a 24-hour period — had minimal correlation to the risk of misuse when compared to prescription length,\" the study said.\n\"For patients taking opioids for two weeks or less, the risk of misuse was not influenced by dosage levels, even when the dose was twice as high. However, high opioid dosage did display a significant correlation to misuse in patients taking opioids for nine weeks or more.\"\nWATCH: Opioid epidemic driving down US life expectancy show chapters Surge in opioid overdoses cuts life expectancy for the second year in a row 11:46 AM ET Thu, 21 Dec 2017 | 00:43", "external_links": [], "published": "2018-01-23T00:54:00.000+02:00", "crawled": "2018-01-23T00:58:30.009+02:00", "highlightTitle": ""}