{"organizations": [], "uuid": "dba09aa0c82ace9336edd4f090cfa53b3308962b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222153714&w=1200&r=LYNXMPEE0E0YT", "site_section": "http://www.reuters.com/resources/archive/us/20180115.html", "section_title": "Archive News &amp; Video for Monday, 15 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-olympics-2018-alps-kenya/alpine-skiing-kenyas-first-speed-skier-aiming-for-professional-career-idUSKBN1F41S2", "country": "US", "domain_rank": 408, "title": "Alpine skiing: Kenya's first speed skier aiming for professional career", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.025, "site_type": "news", "published": "2018-01-15T22:01:00.000+02:00", "replies_count": 0, "uuid": "dba09aa0c82ace9336edd4f090cfa53b3308962b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-olympics-2018-alps-kenya/alpine-skiing-kenyas-first-speed-skier-aiming-for-professional-career-idUSKBN1F41S2", "ord_in_thread": 0, "title": "Alpine skiing: Kenya's first speed skier aiming for professional career", "locations": [], "entities": {"persons": [{"name": "simader", "sentiment": "none"}, {"name": "sabrina wanjiku simader", "sentiment": "none"}], "locations": [{"name": "st moritz", "sentiment": "none"}, {"name": "kenya", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "austria", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "fis", "sentiment": "none"}, {"name": "st moritz", "sentiment": "none"}, {"name": "international ski federation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ST MORITZ, Switzerland (Reuters) - Skiers from African nations are usually looked on as a novelty at the Olympic Games but Kenya’s Sabrina Wanjiku Simader is deadly serious about her career.\nThe 19-year-old, born in Kenya and raised in Austria, has already taken her first steps on the World Cup Alpine skiing circuit and harbors ambitions to establish herself as a professional.\nSignificantly, Simader competes in the more challenging and dangerous speed disciplines, downhill and Super G. Usually, racers from outside the traditional Alpine skiing nations do not venture beyond the less risky slalom and giant slalom.\n“Because I‘m a Kenyan, that makes me exotic and some people think I can’t ski well,” she told Reuters after competing in the Super G at St Moritz, the second World Cup race of her career.\n“I want to give a good performance that helps me to become a professional.”\nSimader, more comfortable speaking German than English, said she was already winning respect on the International Ski Federation (FIS) circuit.\n“At the beginning, people looked at me -- okay, a black skier always gets looked at -- but when your performances get better and you improve, you win them over,” she said.\nSimader will become only the second Kenyan to compete at the Winter Games after Philip Boit, a former middle distance runner who participated in cross-country skiing at the 1998, 2002 and 2006 Games.\nFILE PHOTO: Alpine Skiing - FIS Alpine Skiing World Cup - Women's Alpine Super G - St. Moritz, Switzerland - December 9, 2017 - Sabrina Simader of Kenya reacts at the finish line. REUTERS/Arnd Wiegmann/File Photo While other teams on the FIS circuit boast an impressive staff of coaches, fitness trainers, doctors, physiotherapists and media officers, the Kenya team consists of three members: Simader, her mother Sarah and coach Christian Reif.\n“We can’t work as professionally as the big teams who have three of four trainers, physiotherapists and so on,” said Reif, who works full-time for the team.\n“Sometimes we cooperate with other teams such as Austria and Germany. We also have some partners (sponsors), without them our program would not be possible.”\nSarah Simader, who effectively does the work of the Kenya ski federation, emphasized the importance of Reif’s multiple roles.\n“In our small team, it’s not easy, because our trainer is training, he services the skis, he organizes everything,” she said.\nSabrina Simader, who has lived in Austria since the age of three when her mother moved there, has already competed at the Winter Youth Games in 2016 and last year’s world skiing championships in St Moritz.\n“My roots are Kenyan but I have the Austrian mentality,” she said.\n“I didn’t live there but I‘m very proud of my Kenyan roots. I‘m looking forward to representing Kenya enormously. The Olympics have been my dream since I was small.”\nWriting by Brian Homewood; Editing by Toby Davis\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T22:01:00.000+02:00", "crawled": "2018-01-16T13:16:06.004+02:00", "highlightTitle": ""}