{"organizations": [], "uuid": "5cb85301229bbadac30815d932d67c2963559f93", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/15/pr-newswire-darling-ingredients-inc-announces-appointment-of-new-chief-financial-officer-and-new-chief-adminstrative-officer.html", "country": "US", "domain_rank": 767, "title": "Darling Ingredients Inc. Announces Appointment Of New Chief Financial Officer And New Chief Adminstrative Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T00:41:00.000+02:00", "replies_count": 0, "uuid": "5cb85301229bbadac30815d932d67c2963559f93"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/15/pr-newswire-darling-ingredients-inc-announces-appointment-of-new-chief-financial-officer-and-new-chief-adminstrative-officer.html", "ord_in_thread": 0, "title": "Darling Ingredients Inc. Announces Appointment Of New Chief Financial Officer And New Chief Adminstrative Officer", "locations": [], "entities": {"persons": [{"name": "john muse", "sentiment": "none"}, {"name": "stuewe", "sentiment": "none"}, {"name": "john", "sentiment": "none"}, {"name": "randall c. stuewe", "sentiment": "none"}, {"name": "phillips", "sentiment": "none"}, {"name": "brad", "sentiment": "none"}, {"name": "muse", "sentiment": "none"}, {"name": "john o. muse", "sentiment": "none"}], "locations": [{"name": "texas", "sentiment": "none"}, {"name": "irving", "sentiment": "none"}], "organizations": [{"name": "darling ingredients inc", "sentiment": "negative"}, {"name": "darling ingredients inc.", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "brad phillips", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "IRVING, Texas, Jan. 15, 2018 /PRNewswire/ -- Darling Ingredients Inc. (NYSE: DAR) today announced that Brad Phillips has become its Executive Vice President – Chief Financial Officer and John O. Muse has become its Executive Vice President – Chief Administrative Officer. Both Mr. Phillips and Mr. Muse will report to Randall C. Stuewe, the Company's Chairman and Chief Executive Officer.\n\"We are pleased to have Brad lead our financial team at Darling,\" said Mr. Stuewe. \"His 28 years of experience are invaluable, and he knows our business well. Additionally, we are glad that John Muse decided to forgo his previously planned retirement. In his new role, John will focus on helping us further integrate and streamline our global administrative organization.\"\nMr. Phillips has served in a number of different capacities for the Company since 1988. Most recently he served as the Vice President – Treasurer since May 2014. Previously, he held the positions of Treasurer from January 1993 to May 2014, Assistant Treasurer from January 1991 to January 1993, and Assistant Controller from October 1988 to January 1991. Prior to Darling, he was the Corporate Accounting Manager at Republic Health Corporation from 1984 to 1988, and from 1982 to 1984 he served in the audit group at Arthur Andersen.\nMr. Muse has also served in a number of different capacities for the Company since 1997. Most recently, he served as Chief Financial Officer from December 2014 to March 2017. Prior to that, he served as Chief Synergy Officer from January 2014 to December 2014, Executive Vice President—Chief Administrative Officer from September 2012 to December 2013, Executive Vice President—Finance and Administration from February 2000 to September 2012 and Vice President and Chief Financial Officer from October 1997 to February 2000. Prior to that, he was Vice President and General Manager at Consolidated Nutrition, L.C. from 1994 to 1997. He also held the position of Vice President of Premiere Technologies, a wholly-owned subsidiary of Archer-Daniels Midland Company from 1992 to 1994. From 1971 to 1992, Mr. Muse was Assistant Treasurer and Assistant Secretary at Central Soya Company, Inc.\nABOUT DARLING\nDarling Ingredients Inc. is the world's largest publicly-traded developer and producer of sustainable natural ingredients from edible and inedible bio-nutrients, creating a wide range of ingredients and specialty products for customers in the food, pet food, pharmaceutical, feed, industrial, fuel, bioenergy, and fertilizer industries. With operations on five continents, the Company collects and transforms all aspects of animal by-product streams into broadly used and specialty ingredients, such as gelatin, edible fats, feed-grade fats, animal proteins and meals, plasma, pet food ingredients, organic fertilizers, yellow grease, fuel feedstocks, green energy, natural casings and hides. The Company also recovers and converts used cooking oil and commercial bakery residuals into valuable feed and fuel ingredients. In addition, the Company provides grease trap services to food service establishments, environmental services to food processors and sells restaurant cooking oil delivery and collection equipment. For additional information, visit the Company's website at http://ir.darlingii.com .\nFor More Information, contact:\nMelissa A. Gaither, VP Investor Relations and\n251 O'Connor Ridge Blvd., Suite 300\nGlobal Communications\nIrving, Texas 75038\nPhone: 972-717-0300\nView original content: http://www.prnewswire.com/news-releases/darling-ingredients-inc-announces-appointment-of-new-chief-financial-officer-and-new-chief-adminstrative-officer-300582759.html\nSOURCE Darling Ingredients Inc.", "external_links": ["http://ir.darlingii.com/", "http://www.prnewswire.com/news-releases/darling-ingredients-inc-announces-appointment-of-new-chief-financial-officer-and-new-chief-adminstrative-officer-300582759.html"], "published": "2018-01-16T00:41:00.000+02:00", "crawled": "2018-01-16T03:08:00.008+02:00", "highlightTitle": ""}