{"organizations": [], "uuid": "08d04bdd6f8034d2222fc313823cc7fccabfe7be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/15/business-wire-leslie-gibbs-joins-western-dental-as-chief-marketing-officer.html", "country": "US", "domain_rank": 767, "title": "Leslie Gibbs Joins Western Dental as Chief Marketing Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.655, "site_type": "news", "published": "2018-01-15T21:01:00.000+02:00", "replies_count": 0, "uuid": "08d04bdd6f8034d2222fc313823cc7fccabfe7be"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/15/business-wire-leslie-gibbs-joins-western-dental-as-chief-marketing-officer.html", "ord_in_thread": 0, "title": "Leslie Gibbs Joins Western Dental as Chief Marketing Officer", "locations": [], "entities": {"persons": [{"name": "leslie gibbs", "sentiment": "negative"}, {"name": "intoxalock", "sentiment": "none"}, {"name": "gibbs", "sentiment": "none"}, {"name": "daniel d. crowley", "sentiment": "none"}, {"name": "leslie", "sentiment": "none"}, {"name": "bonne bell", "sentiment": "none"}], "locations": [{"name": "calif.", "sentiment": "none"}, {"name": "iowa", "sentiment": "none"}, {"name": "western dental", "sentiment": "none"}], "organizations": [{"name": "western dental & orthodontics", "sentiment": "negative"}, {"name": "digital branding partners", "sentiment": "none"}, {"name": "proctor & gamble", "sentiment": "none"}, {"name": "lenscrafters", "sentiment": "none"}, {"name": "brident dental & orthodontics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ORANGE, Calif.--(BUSINESS WIRE)-- Western Dental & Orthodontics, one of the nation’s leaders in accessible, affordable, high-quality oral health care, today announced the appointment of Leslie Gibbs as Chief Marketing Officer.\nMs. Gibbs joins Western Dental with more than 20 years of global brand management success, generating growth for iconic brands in health and beauty, retail optical, non-profit, consumer electronics, and consumer packaged goods, with a proven ability to lead departments and create positive, measurable results. Most recently, she was chief marketing officer for Intoxalock, a national leader in ignition interlock breathalyzer devices based in Iowa. She previously held positions with Digital Branding Partners, Bonne Bell, LensCrafters, and Proctor & Gamble.\n“Leslie brings extensive knowledge, experience, and leadership skills for our marketing team at a time of rapid growth for our Company,” said Daniel D. Crowley, Chairman and Chief Executive Officer of Western Dental and its affiliate, Brident Dental & Orthodontics. “We have recently completed several acquisitions as part of our growth strategy, becoming a leader in pediatric dentistry in the process, so it’s an exciting time to be here. Leslie will have a great opportunity to define and promote Western Dental as we continue to grow, and we welcome her to our team.”\n“I’m very pleased to be joining the team at Western Dental and Brident,” said Ms. Gibbs. “It’s exciting to be working with talented people who share a vision of building an integrated dental company – a Dental Home – that provides convenient and affordable access to the best dental care possible.”\nMs. Gibbs has a Master of Business Administration from Northwestern University – Kellogg School of Management; a Bachelor of Science in Marketing from Ohio University; and she attended the University of California, Los Angeles, where she studied Digital Marketing and Advertising.\nABOUT WESTERN DENTAL\nWestern Dental (with its affiliates, including Brident Dental & Orthodontics) is one of the nation’s largest dental providers and is the leader in accessible, affordable oral healthcare, serving approximately 2.5 million patient visits annually in 244 affiliated offices throughout California, Arizona, Nevada, and Texas. In addition to general dentistry, it offers orthodontics, oral surgery, pedodontics, periodontics and endodontics in its offices, creating a convenient full service “Dental Home.”\nIn California, Western Dental is the leading provider of services to both adults and children in the Denti-Cal program – part of the Medi-Cal public insurance program that provides health care benefits for more than 13 million low-income individuals and families. Western Dental dentists provided care to more than a half-million Denti-Cal beneficiaries in 2016 and is committed to continuing to partner with the State to help improve the program.\nAll of Western Dental’s services are backed by a unique quality assurance system that electronically monitors all patient visits, treatments, dental staff and clinical performance to enable high-quality care. To learn more about Western Dental or inquire about an office in your community, visit www.westerndental.com or call 1-800-6-DENTAL.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180115005162/en/\nfor Western Dental\nJeffrey Weidel, 916-781-0616 (Office)\n916-402-7132 (Cell)\njeff@halldinpr.com\nSource: Western Dental & Orthodontics", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.westerndental.com&esheet=51742937&newsitemid=20180115005162&lan=en-US&anchor=www.westerndental.com&index=1&md5=7ebe9c377b1b6b384eb5c605d906b5cc", "http://www.businesswire.com/news/home/20180115005162/en/"], "published": "2018-01-15T21:01:00.000+02:00", "crawled": "2018-01-15T22:59:36.007+02:00", "highlightTitle": ""}