{"organizations": [], "uuid": "106bea2e6c09fd500f1441737963ff9dde3dd4cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.feedburner.com/reuters/UKTennisNews", "section_title": "Reuters: Tennis News", "url": "https://uk.reuters.com/article/tennis-ausopen/highlights-tennis-australian-open-day-11-idUKL4N1PK08U", "country": "US", "domain_rank": 408, "title": "HIGHLIGHTS-Tennis-Australian Open day 11", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T03:27:00.000+02:00", "replies_count": 0, "uuid": "106bea2e6c09fd500f1441737963ff9dde3dd4cb"}, "author": "", "url": "https://uk.reuters.com/article/tennis-ausopen/highlights-tennis-australian-open-day-11-idUKL4N1PK08U", "ord_in_thread": 0, "title": "HIGHLIGHTS-Tennis-Australian Open day 11", "locations": [], "entities": {"persons": [{"name": "mertens", "sentiment": "none"}, {"name": "pliskova  chung", "sentiment": "none"}, {"name": "halep", "sentiment": "none"}], "locations": [{"name": "hawkeye", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}, {"name": "rod laver arena", "sentiment": "none"}, {"name": "melbourne park", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "wozniacki  factbox-tennis-marin cilic", "sentiment": "none"}, {"name": "kyle edmund  factbox-tennis-caroline wozniacki", "sentiment": "none"}, {"name": "elise mertens  factbox-tennis-simona halep", "sentiment": "none"}, {"name": "angelique kerber  wary federer", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 1:31 AM / Updated 4 hours ago WRAPUP 1-HIGHLIGHTS-Tennis-Australian Open day 11 Reuters Staff 4 Min Read \n(Adds men’s doubles result) \nMELBOURNE, Jan 25 (Reuters) - World number one Simona Halep edged out 2016 champion Angelique Kerber 6-3 4-6 9-7 in a thrilling semi-final encounter to reach her first Australian Open final on Thursday. \nKerber, seeded 21st, fought off two match points in the 10th game of the final set before seeing two of her own go begging two games later. \nHalep came back and broke serve, before edging through to victory in a two hour and 20 minute classic. \nIt was the second time Halep had saved match points this fortnight, as she also came back from the brink in her third round victory over American Lauren Davis, which went to 15-13 in the final set. \n“I just had confidence in myself, I told myself to fight for every point and then rest afterwards,” Halep said in an on-court interview. \n“I tried to stay calm but today I was like a rollercoaster. I didn’t give up, though and, if you don’t give up, you can win matches. I am proud of myself.” \nThe 26-year-old Romanian set up a Saturday final with second seed Caroline Wozniacki, who defeated surprise Belgian semi-finalist Elise Mertens 6-3 7-6(2). \nWozniacki showed her experience in saving two set points in the second set before winning the tiebreak to secure victory. \nWorld number 49 Kyle Edmund’s remarkable run at Melbourne Park came to an end with a 6-2 7-6(4) 6-2 defeat by Croatian sixth seed Marin Cilic in the semi-finals. \nCilic reached his third grand slam final, where he will face defending champion Roger Federer or South Korea’s Chung Hyeon. READ MORE \nRuthless Cilic routs ailing Edmund to reach final \nEdmund baffled by media spotlight after Melbourne exploits \nChung’s frightening, but won’t scare Federer - Wilander \nHalep reaps reward for aggressive approach \nChung can end ‘Big Four’ era with semi-final win \nMelbourne run pushes Chung towards cult status back home \nHalep outlasts Kerber in thriller to reach final \nWozniacki survives scare to reach maiden Melbourne final \nCornet charged with anti-doping violation \nWary Federer through to semis after Hawkeye hiccup \nChung blazes trail into Australian Open semi-finals \nOrder of play on Friday \nHighlights of Thursday’s 11th day of the Australian Open, the first grand slam tournament of the year (times in GMT): 1400 CABAL-FARAH STUN BRYAN BROTHERS \nJuan Sebastian Cabal and Robert Farah advanced to their maiden men’s doubles grand slam final, defeating six-times Australian Open champions Bob and Mike Bryan 7-6(1) 7-5. \nThe 11th-seeded Colombian pair will meet Austrian Oliver Marach and Mate Pavic of Croatia in Saturday’s final. 1100 CILIC STORMS INTO FINAL \nCilic reached his third grand slam final with a 6-2 7-6(4) 6-2 victory over Briton Edmund. Cilic fired 32 winners, including 11 aces, to seal the victory in two hours and 18 minutes. 0740 HALEP OUTLASTS GUTSY KERBER, REACHES FINAL \nWorld number one Halep saved two match points in the deciding set before outlasting Kerber 6-3 4-6 9-7 to reach the final. Halep, who prevailed in two hours and 20 minutes, takes on Wozniacki in the title clash. \n“I‘m shaking now, I‘m really emotional. I‘m really glad I could resist and win this match,” Halep, who like Wozniacki is targeting her first grand slam title, said. 0454 WOZNIACKI HOLDS NERVE TO MAKE FINAL \nWozniacki staved off a late fightback from Mertens to advance to the final with a 6-3 7-6(2) victory. \n0441 MARACH-PAVIC PAIR INTO MEN‘S DOUBLES FINAL \nAustrian Oliver Marach and Croatia’s Mate Pavic came from behind to beat Japan’s Ben McLachlan and German Jan-Lennard Struff 4-6 7-5 7-6(4) to make the men’s doubles final. 0110 DOUBLES UNDER WAY AT MELBOURNE PARK \nThe temperature was 24 degrees Celsius and forecast to reach a high of 26. (Compiled by Nick Mulvenney, Shrivathsa Sridhar and Hardik Vyas; Editing by Greg Stutchbury, Jon Boyle and Pritha Sarkar)", "external_links": [], "published": "2018-01-25T03:27:00.000+02:00", "crawled": "2018-01-25T03:55:28.025+02:00", "highlightTitle": ""}