{"organizations": [], "uuid": "224107e6d6bbf07c4d8a78466cbc0bb1edda8c99", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224851928&w=1200&r=LYNXMPEE0N1LB", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-davos-meeting-europe/ahead-of-trumps-davos-visit-european-leaders-warn-against-nationalism-idUSKBN1FD28T", "country": "US", "domain_rank": 408, "title": "Ahead of Trump's Davos visit, European leaders warn against nationalism", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T17:40:00.000+02:00", "replies_count": 0, "uuid": "224107e6d6bbf07c4d8a78466cbc0bb1edda8c99"}, "author": "", "url": "https://www.reuters.com/article/us-davos-meeting-europe/ahead-of-trumps-davos-visit-european-leaders-warn-against-nationalism-idUSKBN1FD28T", "ord_in_thread": 0, "title": "Ahead of Trump's Davos visit, European leaders warn against nationalism", "locations": [], "entities": {"persons": [{"name": "davos", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "merkel", "sentiment": "none"}, {"name": "yara bayoumy", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "noah barkin", "sentiment": "none"}, {"name": "emmanuel macron", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "swiss alps", "sentiment": "none"}], "organizations": [{"name": "ahead of trump", "sentiment": "negative"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DAVOS, Switzerland (Reuters) - European leaders warned at the World Economic Forum in Davos on Wednesday against a return to nationalism, with France’s Emmanuel Macron and Germany’s Angela Merkel calling for more global cooperation to harness the forces of globalization.\nThe speeches by Merkel, Macron and Italy’s Paolo Gentiloni -- leaders of the continent’s three biggest economies -- came one day before U.S. President Donald Trump arrives at the annual summit in the Swiss Alps to promote his America First policies.\nSince taking power one year ago, Trump has pulled the United States out of international agreements on trade and climate, and threatened to torpedo a deal to curb Iran’s nuclear program, unsettling partners who have looked to Washington to help shape global rules since World War Two.\nMacron spoke for a full hour, receiving a standing ovation from the crowd of CEOs, bankers and top academics, after he called for a “global compact” to address the economic forces that have led to rising inequality and a surge in populism.\n“We have a situation where people are being told, on social and financial issues, that the answer is to do less, to cut our taxes, there is no limit, it’s a race to the bottom,” Macron said, weeks after Trump pushed through a large cut in corporate taxes that is expected to lure investment to the United States.\n“If we aren’t able to agree a standard of international cooperation, we will never convince the middle class, the working class that globalization is good for them.”\nLESSONS OF HISTORY Merkel, in her return to the world stage after months of political limbo in Germany, evoked the two world wars and questioned whether the West had learned the lessons from those conflicts.\n“We are seeing nationalism, populism and in a lot of countries a polarized atmosphere,” Merkel told the packed auditorium where Trump will speak on Friday.\nGerman Chancellor Angela Merkel addresses a speech during the World Economic Forum (WEF) annual meeting in Davos, Switzerland January 24, 2018. REUTERS/Denis Balibouse “We believe that isolation won’t help us. We believe we need to cooperate, that protectionism is not the answer,” she said, asking: “Have we really learned from history, or haven’t we?”\nPressed on what his message to Trump would be, Italian Prime Minister Paolo Gentiloni said it was legitimate to defend one’s own citizens, companies and economic, but “there is a limit”.\nAfter suffering a series of crises over the past decade -- from euro turmoil, to Ukraine, refugees and Brexit -- Europe is feeling confident again.\nSlideshow (2 Images) Its economy has rebounded and the election of pro-European centrist Macron in France has injected new momentum into efforts to reform the European Union.\n“Europe has been a phenomenal story this year,” Harvard economist Kenneth Rogoff told the forum this week.\nMacron, switching between English and French, took several tongue-in-cheek swipes at Trump, with whom he’s formed an odd bond since the two engaged in a bone-crushing macho handshake in their first meeting back in May.\nAt the outset of his speech, the 40-year-old French president joked about heavy snowfall in Davos, saying it might lead some people to question whether global warming was really a problem.\n“Fortunately you didn’t invite anybody skeptical of global warming this year,” Macron, glancing over at WEF founder Klaus Schwab, said to laughs.\nMerkel, weakened by an inconclusive German election in September, appeared days after the Social Democrats (SPD) agreed to enter coalition talks with her conservatives.\n“Europe must take its fate into its own hands,” she said, echoing a message she sent after a contentious Group of Seven summit with Trump back in May.\nEditing by Mark Bendeich\n ", "external_links": [], "published": "2018-01-24T17:40:00.000+02:00", "crawled": "2018-01-24T17:56:10.023+02:00", "highlightTitle": ""}