{"organizations": [], "uuid": "d625d916d15296da132ec47f2e5e5518af9f5a4f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-kenya-sport/kenya-betting-firm-pulls-600-million-shillings-sports-sponsorship-over-tax-row-idUKKBN1ES0Y8", "country": "US", "domain_rank": 408, "title": "Kenya betting firm pulls 600 million shillings sports sponsorship over tax row", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T14:31:00.000+02:00", "replies_count": 0, "uuid": "d625d916d15296da132ec47f2e5e5518af9f5a4f"}, "author": "", "url": "https://uk.reuters.com/article/uk-kenya-sport/kenya-betting-firm-pulls-600-million-shillings-sports-sponsorship-over-tax-row-idUKKBN1ES0Y8", "ord_in_thread": 0, "title": "Kenya betting firm pulls 600 million shillings sports sponsorship over tax row", "locations": [], "entities": {"persons": [{"name": "sportpesa", "sentiment": "none"}, {"name": "ronald karauri", "sentiment": "none"}], "locations": [{"name": "kenya", "sentiment": "none"}, {"name": "sportpesa", "sentiment": "none"}], "organizations": [{"name": "min read  nairobi", "sentiment": "none"}, {"name": "miriri", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 12:31 PM / a few seconds ago Kenya betting firm pulls 600 million shillings sports sponsorship over tax row Duncan Miriri 3 Min Read \nNAIROBI (Reuters) - A Kenyan online sports betting firm has cancelled 600 million shillings (£4.27 million) in direct annual sponsorship for the country’s main football league and other sports, after the government hiked taxes for such firms by more than four times. \nThe government increased the tax rate on gross profits for sports betting firms, lotteries and casinos to 35 percent last year, from 7.5 percent, to create a fund for sports, culture and the arts. It says the rapid growth of betting in a loosely regulated environment has hurt the young and vulnerable. \nRonald Karauri, the chief executive of Sportpesa, one of the biggest firms, said they were left with no choice but to cut costs in order to survive. \n“All we will have to do is manage our expenditure in terms of our marketing expenses,” he told Reuters on Wednesday. \n“We had really committed ourselves to sports in the country so it is a very huge burden for us as a cost.” \nSportpesa has been sponsoring the Kenyan football federation, the country’s premier league, various clubs including last year’s league champions Gor Mahia, the national rugby union and boxing. \nAmbrose Rachier, the chairman of Gor Mahia, said the club might be forced to pull out of this year’s Confederation Champions League Cup, a regional competition, due to lack of funds. The team was getting 60 million shillings a year from Sportpesa. \n“It is devastating ... We are in mourning,” Rachier said. \nThe situation was the same at the Kenya Rugby Union, which is losing 120 million shillings a year, used to prepare squads for the international rugby sevens series. \nIt was also using the cash to pay training and match allowances to its 15-a-side teams, said Richard Omwela, the chairman of the rugby union. \n“It is a total shutdown,” he said. “Unless the government steps in and says we will underwrite that, what we possibly will do is tell our suppliers and partners that we can’t meet our obligations.” \nKenyan sports teams have long been beset by poor management and corruption, which have hindered their performance abroad and discouraged fans at home. \nIn 2016, sports officials were investigated after the team to that year’s Olympic games in Brazil complained of mismanagement of flight and hotel bookings, theft of kits and even the mishandling of the list of accredited participants. \nDespite problems in the build up to Rio, the East African nation enjoyed its most successful Olympics, winning six gold medals, six silvers and one bronze, all in track and field. Reporting by Duncan Miriri; Editing by Catherine Evans", "external_links": [], "published": "2018-01-03T14:31:00.000+02:00", "crawled": "2018-01-03T14:46:29.003+02:00", "highlightTitle": ""}