{"organizations": [], "uuid": "d2458a6d0b50ae2daa9b8efb0b42b08ca7320379", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/26/104970540-GettyImages-872126236.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/starbucks-schultz-a-digital-currency-is-coming-but-wont-be-bitcoin.html", "country": "US", "domain_rank": 767, "title": "Starbucks' Schultz: A digital currency is coming, but won't be bitcoin", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.017, "site_type": "news", "published": "2018-01-26T18:58:00.000+02:00", "replies_count": 0, "uuid": "d2458a6d0b50ae2daa9b8efb0b42b08ca7320379"}, "author": "Berkeley Lovelace Jr.", "url": "https://www.cnbc.com/2018/01/26/starbucks-schultz-a-digital-currency-is-coming-but-wont-be-bitcoin.html", "ord_in_thread": 0, "title": "Starbucks' Schultz: A digital currency is coming, but won't be bitcoin", "locations": [], "entities": {"persons": [{"name": "schultz", "sentiment": "negative"}, {"name": "howard schultz", "sentiment": "negative"}, {"name": "kevin johnson", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}], "organizations": [{"name": "starbucks", "sentiment": "negative"}, {"name": "bitcoin starbucks", "sentiment": "negative"}, {"name": "lincoln center", "sentiment": "none"}, {"name": "the new york times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\"One or a few legitimate\" cryptocurrencies are coming, but bitcoin is not one of them, according to Starbucks ' executive chairman and former CEO, Howard Schultz .\n\"I don't believe that bitcoin is going to be a currency today or in the future,\" Schultz said, during a post-earnings conference call Thursday after the closing bell on Wall Street. (Shares of Starbucks were under pressure on Friday after another quarter of disappointing sales growth as holiday offerings failed to draw in customers.)\nInstead, Schultz told investors he sees potential in blockchain, the online ledger technology underlying digital currencies. \"I'm talking about ... the possibility of what could happen — not in the near term, but in a few years from now — with a consumer application in which there's trust and legitimacy with regard to a digital currency.\"\n\"I'm not bringing this up because Starbucks is announcing that we are forming a digital currency or we're investing in this,\" Schultz said, according to audio of the call on the Starbucks website. \"I'm bringing this up ... as we think about the future of our company and the future of consumer behavior.\"\nLast month, Schultz told CNBC he could see a future in which the U.S.-based coffee chain would be cashless one day. He joined Starbucks in 1982 as director of operations and marketing. He served twice as CEO, a role he turned over to Kevin Johnson last April.\nshow chapters Starbucks CEO Kevin Johnson talks earnings and future of the brand      1 Hour Ago | 11:12 Reacting to Schultz's comments, Johnson reiterated that the company has no specific project or investment in blockchain. But he did say on CNBC's \"Squawk on the Street\" on Friday the coffee giant is testing a cashless store in Seattle. \"Payment and payment platforms are continuing to evolve,\" and Starbucks wants to stay ahead of the curve, he added.\nBitcoin as an investment was relatively steady Friday, trading around $11,000. The world's largest cryptocurrency saw a massive price surge last year but has had a rough start in 2018.\nDespite bitcoin's popularity, there are also big-name naysayers.\nAt the World Economic Forum in Davos, Switzerland, this week, bitcoin was hammered by many top business leaders.\nJ.P. Morgan Chase Chairman and CEO Jamie Dimon has said virtual currencies would never be a major competitor to the dollar. But he's indicated blockchain could be used for more efficient transactions. Dimon recently said that he regrets calling bitcoin a \"fraud\" back in September.\nEarlier this month, billionaire investor Warren Buffett told CNBC he believes the recent craze over bitcoin and other cryptocurrencies won't end well. \nMorning Squawk: CNBC's before the bell news roundup Sign up to get Morning Squawk each weekday\nJob Industry Advertising/Marketing Automotive Communications/PR Construction/Manufacturing Education Finance/Banking/Insurance Legal Media/Entertainment Medical/Health Care Mining/Oil/Gas/Utilities Gov't/Non-Profit Real Estate Retail Technology/IT Transportation/Shipping Travel/Hospitality Other Get this delivered to your inbox, and more info about about our products and service. Privacy Policy . Submit Please enter a valid email address", "external_links": [], "published": "2018-01-26T18:58:00.000+02:00", "crawled": "2018-01-26T18:57:57.020+02:00", "highlightTitle": ""}