{"organizations": [], "uuid": "13b7b2f738d5124f697e9ed02223eb7ab6484171", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-hpm-partners-announces-sale-of-emigrant-bankas-interest-to-lightyear-capital.html", "country": "US", "domain_rank": 767, "title": "HPM Partners Announces Sale of Emigrant Bank’s Interest to Lightyear Capital", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.059, "site_type": "news", "published": "2018-01-16T17:00:00.000+02:00", "replies_count": 0, "uuid": "13b7b2f738d5124f697e9ed02223eb7ab6484171"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-hpm-partners-announces-sale-of-emigrant-bankas-interest-to-lightyear-capital.html", "ord_in_thread": 0, "title": "HPM Partners Announces Sale of Emigrant Bank’s Interest to Lightyear Capital", "locations": [], "entities": {"persons": [{"name": "kurt miscinski", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "bloomfield hills", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "orange county", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "cleveland", "sentiment": "none"}], "organizations": [{"name": "hpm partners llc", "sentiment": "negative"}, {"name": "hpm partners announces sale of emigrant bank’s interest to lightyear capital", "sentiment": "neutral"}, {"name": "new york private bank & trust corporation", "sentiment": "none"}, {"name": "emigrant bank", "sentiment": "none"}, {"name": "hpm partners", "sentiment": "none"}, {"name": "lightyear capital llc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- HPM Partners LLC (“HPM Partners” or the “Firm”), a New York-based investment and wealth management firm with over $9 billion in assets under management, announced that an affiliated investment fund of Lightyear Capital LLC (“Lightyear”), a private equity firm focused on financial services investing, has acquired Emigrant Bank’s, an affiliate of New York Private Bank & Trust Corporation (“NYPB&T”), majority interest in the Firm.\nHPM Partners is a national registered investment advisor serving over 1,700 clients from offices in Bloomfield Hills, Chicago, Cleveland, Los Angeles, New York, and Orange County. The Firm provides investment and wealth management services to wealthy individuals and their families, businesses and their employees and nonprofit organizations.\nKurt Miscinski, President and Chief Executive Officer of HPM Partners, said, “We selected Lightyear due to its strong business acumen and deep knowledge of our business and services.” He further commented, “Lightyear’s investment will enable us to continue our growth as an employee-owned firm.”\nMark F. Vassallo, Lightyear’s Managing Partner, added, “HPM Partners is a leader in providing important wealth management, executive financial counseling and financial wellness coaching services to individuals across the U.S. We are pleased to work with the management and employee owners of HPM Partners to help build on their successful track record.”\nHoward Milstein, Chairman and Chief Executive Officer of NYPB&T, noted, “We are very proud of our partners in HPM Partners and could not be more pleased that we found such a good investor for them with Lightyear.”\nLightyear, through its affiliated private equity funds, invests primarily in control investments in North America-based middle-market companies across the financial services industry, including asset and wealth management, banking, brokerage, insurance, payments and processing, and specialty finance. Lightyear seeks to invest in companies where it can work with management to help implement growth strategies aimed at enhancing value. Lightyear’s investment in HPM Partners builds on its history of investing in asset and wealth management businesses.\nAbout HPM Partners LLC\nHPM Partners is a national, award-winning investment and wealth management firm offering customized financial advice to individuals and their families, companies and their employees, and non-profit organizations. For more information, please visit www.hpmpartners.com .\nAbout New York Private Bank & Trust Corporation\nNYPB&T and its affiliated businesses, including Emigrant Bank, New York Private Bank & Trust, New York Private Trust Company, and Fiduciary Network offer banking, lending, investment management, and trust services to wealthy families and their businesses. Through these affiliated businesses, NYPB&T’s wealth management activities encompass $40 billion in assets for clients. Founded in 1850 by members of the Irish Emigrant Society to support the financial needs of a growing immigrant community, Emigrant Bank is the largest family-owned and run bank in the country. NYPB&T continues to serve both its traditional client base as well as new generations seeking a better way of life for themselves and their families.\nAbout Lightyear Capital LLC\nLightyear Capital is a financial services-focused private equity firm based in New York. Lightyear, through its affiliated private equity funds, makes primarily control investments in North America-based, middle-market financial services companies. Lightyear targets investments across the financial services spectrum, including asset and wealth management, banking, brokerage, insurance, payments and processing, and specialty finance. The firm brings strengths and discipline to its investment process, as well as operating, transaction, and strategic management experience, along with significant contacts and resources beyond capital. For more information, please visit www.lycap.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180116005611/en/\nSloane & Company\nJanet Reinhardt, 212-446-1877\njreinhardt@sloanepr.com\nSource: Lightyear Capital LLC", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.lycap.com%2F&esheet=51742788&newsitemid=20180116005611&lan=en-US&anchor=www.lycap.com&index=2&md5=029b68e7f219921edb149f89190e4d37", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.hpmpartners.com&esheet=51742788&newsitemid=20180116005611&lan=en-US&anchor=www.hpmpartners.com&index=1&md5=e944a6b4074c3d5a521d142675ed1aa9", "http://www.businesswire.com/news/home/20180116005611/en/"], "published": "2018-01-16T17:00:00.000+02:00", "crawled": "2018-01-16T19:11:18.021+02:00", "highlightTitle": ""}