{"organizations": [], "uuid": "2fb3f777886ee87848820c26014a38bdc3a727fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222144331&w=1200&r=LYNXMPEE0E0R1", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-shell-northsea/shell-oks-first-uk-north-sea-project-in-six-years-idUKKBN1F41HL", "country": "US", "domain_rank": 408, "title": "Shell OKs first UK North Sea project in six years", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T15:14:00.000+02:00", "replies_count": 0, "uuid": "2fb3f777886ee87848820c26014a38bdc3a727fc"}, "author": "", "url": "https://uk.reuters.com/article/uk-shell-northsea/shell-oks-first-uk-north-sea-project-in-six-years-idUKKBN1F41HL", "ord_in_thread": 0, "title": "Shell OKs first UK North Sea project in six years", "locations": [], "entities": {"persons": [{"name": "ron bousso", "sentiment": "none"}, {"name": "andy brown", "sentiment": "none"}], "locations": [{"name": "uk north sea", "sentiment": "none"}, {"name": "torzhok", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "tver", "sentiment": "none"}, {"name": "north sea", "sentiment": "none"}], "organizations": [{"name": "shell", "sentiment": "negative"}, {"name": "royal dutch shell", "sentiment": "none"}, {"name": "fpso", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "penguins", "sentiment": "none"}, {"name": "royal dutch shell plc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 12:17 PM / Updated 8 hours ago Shell OKs first UK North Sea project in six years Ron Bousso 3 Min Read \nLONDON (Reuters) - Royal Dutch Shell ( RDSa.L ) gave the green light on Monday for an expansion of the Penguins oil and gas field in the UK North Sea, its first major new project in the ageing basin in six years. FILE PHOTO - Filled oil drums are seen at Royal Dutch Shell Plc's lubricants blending plant in the town of Torzhok, north-west of Tver, November 7, 2014. REUTERS/Sergei Karpukhin/File Photo \nShell said the development, which includes the construction of a floating production, storage and offloading (FPSO) vessel, reaffirmed the Anglo-Dutch company’s commitment to the region after it sold around half of its assets there last year. \n“Penguins demonstrates the importance of Shell’s North Sea assets to the company’s upstream portfolio,” said Andy Brown, director of Shell’s oil and gas production, known as upstream. \nThe FPSO is expected to produce up to 45,000 barrels of oil equivalent per day (boe/d). \nShell shares were 0.3 percent lower at 1145 GMT. \nThe Shell-operated Penguins redevelopment is the first major project Shell has announced since 2012, when it made a final investment decision for the Fram field in the central North Sea. \nThe project will generate a profit even with oil prices below $40 a barrel, Shell said in a statement, making it competitive against other offshore basins and most of North America’s shale production. \n“We struggled to make it economic until the last couple of years when we closely worked with supply to redefine and redesign the development to reduce costs,” Steve Phimister, head of Shell Upstream in the UK and Ireland, told Reuters. \nAfter Penguins, Shell is expected to decide on a number of new projects in the central North Sea in the next year or two, Phimister said. \nShell gave no details on the cost of the project, which analysts at Bernstein last September estimated would be up to $2.5 billion. \nProduction in the UK North Sea has steadily declined since the late 1990s but has seen a modest recovery in recent years thanks to a number of new projects, including the BP-operated ( BP.L ) Quad 204 field in the western Shetlands last year, in which Shell holds a 55 percent stake. \nOperators have drastically reduced operating costs as a sharp drop in oil prices since 2014 forced companies to become more efficient and service providers to slash costs. \nShell’s production is currently around 135,000 boe/d in the UK North Sea after completing the sale of a $3 billion package of assets to private-equity-backed Chrysaor last November, Phimister said. \nThe company intends to maintain its production at this level into 2030, he added. \nThe Penguins field was discovered in 1974 and first developed in 2002. It is a 50-50 joint venture with Exxon Mobil ( XOM.N ). Reporting by Ron Bousso; Editing by Dale Hudson, Mark Potter and David Evans", "external_links": [], "published": "2018-01-15T15:14:00.000+02:00", "crawled": "2018-01-15T15:42:52.072+02:00", "highlightTitle": ""}