{"organizations": [], "uuid": "fef530b6420599b7cdb9a23ad947325c8beb5a18", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/18/104952068-Toy-Con_Piano.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19854910/device/rss/rss.html", "section_title": "Tech", "url": "https://www.cnbc.com/2018/01/18/nintendo-introduces-new-physical-accessories-for-switch-consoles.html", "country": "US", "domain_rank": 767, "title": "Nintendo introduces new physical accessories for Switch console", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T09:31:00.000+02:00", "replies_count": 0, "uuid": "fef530b6420599b7cdb9a23ad947325c8beb5a18"}, "author": "Saheli Roy Choudhury", "url": "https://www.cnbc.com/2018/01/18/nintendo-introduces-new-physical-accessories-for-switch-consoles.html", "ord_in_thread": 0, "title": "Nintendo introduces new physical accessories for Switch console", "locations": [], "entities": {"persons": [{"name": "nintendo labo", "sentiment": "none"}, {"name": "reggie fils-aime", "sentiment": "none"}], "locations": [{"name": "america", "sentiment": "none"}], "organizations": [{"name": "nintendo", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Japanese game maker Nintendo on late Wednesday announced new interactive cardboard accessories for its Switch consoles.\nThe line of accessories, called Nintendo Labo, contain modular cardboard sheets that can be folded into a variety of playthings — such as motorbikes, fishing rods, pianos, houses or robots. The Japanese gaming giant deems those creations \"Toy-Cons.\"\nPlayers can then insert their Switch consoles, and the detachable Joy-Con controllers, into those cardboard models to play various games. Sensors built into the controllers can detect movement and update the game on the screen accordingly.\n\"It is an exciting evolution of the Nintendo Switch platform — one designed to inspire curiosity, creativity and imagination in people of all ages,\" Reggie Fils-Aime, Nintendo of America's president and chief operating officer, said in a statement about the new accessories.\nAn accompanying video also showed a cardboard gas pedal, steering wheel, and a camera hinting that more such accessories could be in development.\nThe do-it-yourself cardboard kits are poised to be an additional revenue source for the Japanese firm. Investors appeared to have welcomed the announcement as Nintendo shares closed up 2.36 percent in Tokyo on Thursday, beating the broader market.\nNintendo Labo will launch on April 20 and will sell a variety kit and a robot kit costing about $70 and $80, respectively.\nSwitch is a hybrid system that is part gaming console, part handheld device and part tablet — and it was launched last March. By December, Nintendo said it had sold more than 10 million Switch game console units and predicted it would sell 14 million units by the end of March 2018. Analysts have said the Switch's flexible form factor made it attractive to more users.\nPreviously, the storied game maker struggled in the console market, following a disappointing run of its Wii U device.\nThat said, this is not the first time Nintendo is launching physical accessories that can integrate with games.\nPreviously, Nintendo launched amiibo figurines and cards based on popular characters like Super Mario. Those figurines could be tapped on compatible consoles, affecting certain games.", "external_links": [], "published": "2018-01-18T09:31:00.000+02:00", "crawled": "2018-01-18T09:53:34.007+02:00", "highlightTitle": ""}