{"organizations": [], "uuid": "1e98b49d86804e6971b452abfe813e936ad2ed25", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-kastle-systems-expands-into-high-end-single-family-residential-security-and-enhances-its-small-commercial-and-nicet-certified.html", "country": "US", "domain_rank": 767, "title": "Kastle Systems Expands into High-End, Single-Family Residential Security and Enhances its Small Commercial and NICET Certified Fire & Life Safety Services Through the Acquisition of DC-Based Urban Alarm", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T15:03:00.000+02:00", "replies_count": 0, "uuid": "1e98b49d86804e6971b452abfe813e936ad2ed25"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-kastle-systems-expands-into-high-end-single-family-residential-security-and-enhances-its-small-commercial-and-nicet-certified.html", "ord_in_thread": 0, "title": "Kastle Systems Expands into High-End, Single-Family Residential Security and Enhances its Small Commercial and NICET Certified Fire & Life Safety Services Through the Acquisition of DC-Based Urban Alarm", "locations": [], "entities": {"persons": [], "locations": [{"name": "va.", "sentiment": "none"}, {"name": "woodland normanstone", "sentiment": "none"}, {"name": "dc", "sentiment": "none"}], "organizations": [{"name": "nicet certified fire & life safety services through the acquisition of dc-based urban alarm", "sentiment": "neutral"}, {"name": "kastle systems international", "sentiment": "neutral"}, {"name": "kastle systems", "sentiment": "neutral"}, {"name": "urban alarm", "sentiment": "none"}, {"name": "kastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FALLS CHURCH, Va., Jan. 3, 2018 /PRNewswire/ -- Kastle Systems International, the industry leader in innovative managed security solutions and services, today announced that they have acquired Urban Alarm, a local DC-based security provider.\nFounded in 2003, Urban Alarm's clients include a mix of high-end, single-family residential homeowners, as well as commercial, institutional, and property management organizations throughout the metro DC area. Urban Alarm is the security provider and patrol service to several of the area's most prestigious single-family residential neighborhoods, such as Woodland Normanstone, and is responsible for many specialized security environments including embassies and ambassador residences. The company has also completed security projects for several large developers and properties including, in partnership with Kastle, The Wharf's 3 million square foot mixed-use development. Urban Alarm has grown quickly due to its reputation for exemplary security service providing access control, video surveillance, guard patrol services, remote video monitoring and NICET certified fire and life safety services.\n\"We are thrilled to bring Urban Alarm into the Kastle family and to expand our business into several new areas including the single-family residential market. Our customer bases, product offerings and geographic coverage are extremely complementary, which will provide significant growth opportunities going forward,\" said Mark Ein, Chairman of Kastle Systems. \"Above all and most importantly, Kastle and Urban Alarm share a culture, passion and reputation for providing the highest levels of service for clients with sophisticated security needs.\"\nBecause of this acquisition, Kastle now has a unique opportunity to take its innovations in technology and service, developed for commercial and multifamily real estate owners, into DC's single-family residential homeowner market. Kastle has consistently earned the distinction of being named DC's #1 Security Company by the Washington Business Journal. With this acquisition, Kastle will not only expand its market presence and skilled workforce but also enable a unified, seamless security experience for customers, who will now be able to use a single electronic credential for both their home and their office.\nThe acquisition includes several important synergies including the ability to leverage Kastle's UL listed, TMA Five Diamond-certified central stations for alarm and video monitoring of Urban Alarm's customers and providing Urban Alarm's NICET certified fire and life safety services to Kastle's extensive local customer base. Additionally, the combination of key talent and intellectual property will provide both companies the ability to comprehensively address the growing security needs across all sectors of the metro DC market.\n\"This is a great opportunity for our business, our employees and our clients,\" said Miles Fawcett, CEO of Urban Alarm. \"By joining Kastle, we are part of an organization with a long-term perspective that will enable us to offer the same premium customer experience, and introduce new, innovative offerings that I know our clients will love.\"\nFor more information about Kastle Systems or Urban Alarm, contact Jennifer Graham, Vice President of Marketing at 703-247-0298 or jennifer@kastle.com . Follow Kastle Systems on LinkedIn at www.linkedin.com/company/kastle-systems , visit www.kastle.com , or call 1-855-527-8531 to learn more about all of Kastle Systems' security solutions.\nAbout Kastle Systems\nKastle Systems has been leading the security industry for more than 45 years with new technologies and advanced security solutions. Named the 2015 Systems Integrator of the Year for outstanding innovation and customer experience by SDM, the industry's leading trade publication, Kastle operates and manages sophisticated security systems for its clients remotely, around-the-clock. Kastle protects more than 10,000 locations nationwide and internationally with the most innovative security solutions available including access control, video surveillance, visitor management and integrated identity management. Kastle's expert outsourced security services significantly reduce costs and improve the critically important, 24x7 performance of security systems for building owners, developers, property managers, and enterprise tenants. Headquartered in Falls Church, Virginia, Kastle is consistently ranked the #1 Security Provider in DC by the Washington Business Journal and is on CIOReview's 2018 List of Top Physical Security Providers in the US. Kastle also has offices in Los Angeles, San Francisco, Houston, Dallas, Chicago, New York, Philadelphia and Sydney, Australia.\nAbout Urban Alarm\nUrban Alarm was founded in 2003 by Miles Fawcett, a lifetime resident of Northwest DC. He set out to create a different kind of security company -- one that is invested in the community and the lives of the people in it. Urban Alarm leverages the best systems and technologies, maintaining high standards for training and customer service, filling the gap between large multi-national integrators and small regional providers. In order to offer superior quality of service, Urban Alarm focuses on a limited geographic area in and around Washington, DC. Their customers are a mix of commercial, institutional, and property management organizations, as well as homeowners. Urban Alarm's services include security system design and installation, access control systems for offices, campuses, commercial and residential properties, and video monitoring applications. For more information, visit http://www.urbanalarm.com .\nMedia Inquiries\nJennifer Graham\n703-247-0298\njennifer@kastle.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/kastle-systems-expands-into-high-end-single-family-residential-security-and-enhances-its-small-commercial-and-nicet-certified-fire--life-safety-services-through-the-acquisition-of-dc-based-urban-alarm-300576625.html\nSOURCE Kastle Systems", "external_links": ["http://www.urbanalarm.com/", "http://www.kastle.com/", "http://www.prnewswire.com/news-releases/kastle-systems-expands-into-high-end-single-family-residential-security-and-enhances-its-small-commercial-and-nicet-certified-fire--life-safety-services-through-the-acquisition-of-dc-based-urban-alarm-300576625.html", "http://www.linkedin.com/company/kastle-systems"], "published": "2018-01-03T15:03:00.000+02:00", "crawled": "2018-01-03T17:07:52.015+02:00", "highlightTitle": ""}