{"organizations": [], "uuid": "f39d4b6fe83352943f8730e551f8278d85eedb1a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/southeast-asia-stocks/se-asia-stocks-most-gain-philippines-thailand-hit-fresh-records-idUSL4N1P01TC", "country": "US", "domain_rank": 408, "title": "SE Asia Stocks-Most gain; Philippines, Thailand hit fresh records", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T06:08:00.000+02:00", "replies_count": 0, "uuid": "f39d4b6fe83352943f8730e551f8278d85eedb1a"}, "author": "", "url": "https://www.reuters.com/article/southeast-asia-stocks/se-asia-stocks-most-gain-philippines-thailand-hit-fresh-records-idUSL4N1P01TC", "ord_in_thread": 0, "title": "SE Asia Stocks-Most gain; Philippines, Thailand hit fresh records", "locations": [], "entities": {"persons": [{"name": "fio dejesus", "sentiment": "none"}, {"name": "inve", "sentiment": "none"}], "locations": [{"name": "philippines", "sentiment": "none"}, {"name": "thailand", "sentiment": "none"}, {"name": "asia stocks-most", "sentiment": "none"}, {"name": "asia-pacific", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "msci", "sentiment": "none"}, {"name": "aditya soni jan", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "rcbc securities", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 4:10 AM / Updated 29 minutes ago SE Asia Stocks-Most gain; Philippines, Thailand hit fresh records Reuters Staff 4 Min Read \nBy Aditya Soni Jan 5 (Reuters) - Most Southeast Asian stock markets rose on Friday as Asian equities drew heart from record-setting gains on Wall Street overnight, with the Philippines and Thailand climbing to fresh all-time highs. U.S. stocks extended their strong start to the new year on Thursday, with the Dow industrials breaking above the 25,000 level for the first time and other major indexes hitting record closing highs again, propelled by strong global economic data. Asian shares inched closer to their record 2007 peak on Friday as U.S. jobs data pointed to firm economic growth. MSCI's broadest index of Asia-Pacific shares outside Japan rose 0.2 percent in early trade. The gains on Wall Street have had a positive impact as most global asset managers are willing to take on risk, especially in the emerging markets, said Fio Dejesus, equity research analyst at RCBC Securities. Philippine shares rose more than 1 percent, with industrials accounting for half of the gains. SM Investments Corp scaled an all-time peak, while JG Summit Holdings Inc climbed to its highest since Nov. 3. The Philippines' annual inflation rate held steady in December, bringing the average for 2017 to 3.2 percent, well within the central bank's target rate, the statistics agency said on Friday. Thai shares ticked up 0.3 percent, on track to register four consecutive winning sessions, with utilities and financials accumulating most of the gains. Mobile network operator Advanced Info Service led the charge, while Bangkok Bank climbed to a near three-and-a-half-year high. Malaysian shares rose 0.7 percent, with telecommunication services and industrials leading the gainers Axiata Group surging 5 percent to a near one-and-a-half-year high, while Sime Darby rose 9 percent. Malaysia's November exports rose 14.4 percent from a year earlier, slower than the previous month, on lower shipments of commodities, but above the 13.9 percent rise forecast by a Reuters poll, government data showed on Friday. Indonesian shares gained slightly, while Singapore was largely steady. Vietnam shares fell 0.3 percent, on track to snap nine sessions of consecutive gains. For Asian Companies click; SOUTHEAST ASIAN STOCK MARKETS Change as of 0402 GMT Market Current Previous close Pct Move Singapore 3501 3501.16 0.00 Bangkok 1796.69 1791.02 0.32 Manila 8830.76 8739.83 1.04 Jakarta 6295.452 6292.321 0.05 Kuala Lumpur 1815.66 1803.45 0.68 Ho Chi Minh 1016.97 1019.75 -0.27 Change on year Market Current End prev yr Pct Move Singapore 3501 3402.92 2.88 Bangkok 1796.69 1753.71 2.45 Manila 8830.76 8,558.42 3.18 Jakarta 6295.452 6,355.65 -0.95 Kuala Lumpur 1815.66 1796.81 1.05 Ho Chi Minh 1016.97 984.24 3.33 (Reporting by Aditya Soni in Bengaluru; Editing by Amrutha Gayathri)", "external_links": [], "published": "2018-01-05T06:08:00.000+02:00", "crawled": "2018-01-05T06:45:17.023+02:00", "highlightTitle": ""}