{"organizations": [], "uuid": "bbc75e5e8da3a7b0f5af85d4383e16a65dd7afae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-live-ventures-enters-into-agreement-to-acquire-65m-per-year-appliancesmart.html", "country": "US", "domain_rank": 767, "title": "Live Ventures Enters Into Agreement to Acquire $65M Per Year ApplianceSmart", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T16:30:00.000+02:00", "replies_count": 0, "uuid": "bbc75e5e8da3a7b0f5af85d4383e16a65dd7afae"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-live-ventures-enters-into-agreement-to-acquire-65m-per-year-appliancesmart.html", "ord_in_thread": 0, "title": "Live Ventures Enters Into Agreement to Acquire $65M Per Year ApplianceSmart", "locations": [], "entities": {"persons": [{"name": "appliancesmart", "sentiment": "none"}], "locations": [{"name": "las vegas", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "minnesota", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}], "organizations": [{"name": "vintage stock", "sentiment": "none"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LAS VEGAS, Jan. 08, 2018 (GLOBE NEWSWIRE) -- Live Ventures Incorporated (Nasdaq:LIVE), a diversified holding company, today announces that it has entered into an agreement to acquire 100 percent of the outstanding stock of ApplianceSmart , a 17-store chain specializing sales and service of new and out-of-the-box appliances with annualized revenues of approximately $65 million.\nApplianceSmart maintains stores in Minnesota, Ohio, Texas and Georgia. It is estimated that Live Ventures revenues will rise approximately 42 percent on an annualized basis as a result of this acquisition.\nNet assets acquired as part of this transaction are estimated to be valued at purchase price or greater, resulting in no recording of goodwill. In addition, no stock was issued by the company in connection with this transaction.\nThe Company believes the acquisition will be synergistic because it anticipates the transaction may provide opportunities for its other subsidiaries, including award-winning entertainment retailer Vintage Stock, to expand into new markets. Additionally, management anticipates improving ApplianceSmart’s financial position by expanding its current product offering and increasing operational efficiencies.\n“We welcome ApplianceSmart and its approximately 150 employees to the Live Ventures family,” said Jon Isaac, president and CEO of Live Ventures Incorporated .\n“We are excited for this transaction and believe ApplianceSmart will thrive under the Live Ventures umbrella,” said Akram Mohamad, president of ApplianceSmart. “We look forward to continuing to grow in our current markets with an eye toward additional expansion.”\nAbout Live Ventures Incorporated\nLive Ventures Incorporated is a diversified holding company with several wholly owned subsidiaries and a strategic focus on acquiring profitable companies that have demonstrated a strong history of positive revenues. Live Ventures Incorporated provides, among other businesses, marketing solutions that boost customer awareness and merchant visibility on the Internet. The company operates a deal engine, which is a service that connects merchants and consumers via an innovative platform that uses geo-location, enabling businesses to communicate real-time and provide instant offers to nearby consumers. Through its subsidiary, Marquis Industries, the company operates as a specialty, high-performance yarns manufacturer and hard-surfaces re-seller. Marquis Industries, which is a top-10 high-end residential carpet manufacturer in the United States, utilizes its state-of-the-art yarn extrusion capacity to market monofilament textured yarn products to the artificial turf industry. Marquis is the only manufacturer in the world that can produce certain types of yarn prized by the industry. Through its subsidiary Vintage Stock, Inc., an award-winning entertainment retailer, the company sells new and pre-owned movies, classic and current generation video games and systems, music on CD and LP, collectible comics, books, toys, and more. Vintage Stock, through its stores and website, ships product worldwide directly to the customer’s doorstep.\nForward-Looking and Cautionary Statements .\nThis press release may contain \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. In accordance with the safe harbor provisions of this Act, statements contained herein that look forward in time that include everything other than historical information, involve risks and uncertainties that may affect the Company’s actual results. These forward-looking statements can be identified by terminology such as \"will,\" \"expects,\" \"anticipates,\" \"future,\" \"intends,\" \"plans,\" \"believes,\" \"estimates\" and similar statements. The Company may also make written or oral forward-looking statements in its periodic reports to the U.S. Securities and Exchange Commission on Forms 10-K, 10-Q and 8-K, in its annual report to stockholders, in press releases and other written materials and in oral statements made by its officers, directors or employees to third parties. There can be no assurance that such statements will prove to be accurate and there are a number of important factors that could cause actual results to differ materially from those expressed in any forward-looking statements made by the Company, including, but not limited to, plans and objectives of management for future operations or products, the market acceptance or future success of our products, and our future financial performance. The Company cautions that these forward-looking statements are further qualified by other factors including, but not limited to, those set forth in the Company’s Form 10-K for the fiscal year ended September 30, 2016 and other filings with the U S. Securities and Exchange Commission (available at http://www.sec.gov ). The Company undertakes no obligation to publicly update or revise any statements in this release, whether as a result of new information, future events, or otherwise.\nContact:\nLive Ventures Incorporated\nTim Matula, investor relations\n425-836-9035\ntmatula@live-ventures.com\nhttp://www.live-ventures.com\nSource:Live Ventures Incorporated", "external_links": ["https://www.globenewswire.com/Tracker?data=2rhBgenKQsRt3v43AdmWpcFywEIiElVSxnrkNoG6LKM5PSKzppOf0aKCrgakVI_7DcbtaBg9kGs8PShUfvE10udTLGSYtOCpPWFH4OcLCjU=", "https://www.globenewswire.com/Tracker?data=T3GpB82Z7RHIlAFqXs5F133GkvuPjUE8W0P3vr3cYJ6JoV4iqJILmds3DUwkPeAHQ97bQ4ZSl0iTmwbn4ak2Z7D_MAO4RtrP7hQ_e7Diouw="], "published": "2018-01-08T16:30:00.000+02:00", "crawled": "2018-01-08T18:51:01.022+02:00", "highlightTitle": ""}