{"organizations": [], "uuid": "d6893d7f2208477a1d8ec4c07a76bd30d219c8f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-massroots-retires-convertible-debt.html", "country": "US", "domain_rank": 767, "title": "MassRoots Retires Convertible Debt", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-17T20:33:00.000+02:00", "replies_count": 0, "uuid": "d6893d7f2208477a1d8ec4c07a76bd30d219c8f1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-massroots-retires-convertible-debt.html", "ord_in_thread": 0, "title": "MassRoots Retires Convertible Debt", "locations": [], "entities": {"persons": [{"name": "isaac dietrich", "sentiment": "none"}], "locations": [{"name": "denver", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "massroots, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DENVER, Jan. 17, 2018 /PRNewswire/ -- MassRoots, Inc. (\"MassRoots\" or the \"Company\") (OTCQB:MSRT), one of the leading technology platforms for the regulated cannabis industry, today announced all notes issued pursuant to the Company's August 2017 debt offering have been retired and the Company has no further obligations under the notes of that offering. More information is available on the Company's Current Report on Form 8-K filed on January 17, 2018.\n\"We're excited to have this convertible debt fully retired as we continue to strengthen MassRoots' balance sheet and drive shareholder value,\" stated MassRoots Chief Executive Officer Mr. Isaac Dietrich. \"With California's recreational cannabis market recently coming online and our expansion into blockchain technology, we believe MassRoots is well positioned to deliver growth in 2018.\"\nPowered by more than one million registered users, MassRoots enables consumers to rate products and strains based on their efficacy (i.e., effectiveness for treating ailments such back-pain or epilepsy) and then presents this information in easy-to-use formats for consumers to make educated purchasing decisions at their local dispensary. Businesses are able to leverage MassRoots by strategically advertising to consumers based on their preferences and tendencies. More information on MassRoots' blockchain expansion is available at www.MassRootsBlockchain.com .\nAbout MassRoots\nMassRoots, Inc. is one of the leading technology platforms for the regulated cannabis industry. Powered by more than one million registered users, the Company's mobile apps empower consumers to make educated cannabis purchasing decisions through community-driven reviews. Its compliance and point-of-sale system, MassRoots Retail, enables cannabis-related businesses to streamline their retail operations and manage compliance reporting to state regulators. With a significant market share of medical cannabis patients in certain markets and more than 25,000 shareholders, the Company believes it is uniquely positioned to best serve the needs of the cannabis industry. For more information, please visit MassRoots.com/Investors and review MassRoots's filings with the U.S. Securities and Exchange Commission.\nForward-looking Statements\nThis press release contains certain forward-looking statements within the meaning of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These statements are identified by the use of the words \"could,\" \"believe,\" \"anticipate,\" \"intend,\" \"estimate,\" \"expect,\" \"may,\" \"continue,\" \"predict,\" \"potential,\" \"project\" and similar expressions that are intended to identify forward-looking statements. All forward-looking statements speak only as of the date of this press release. You should not place undue reliance on these forward-looking statements. Although we believe that our plans, objectives, expectations and intentions reflected in or suggested by the forward-looking statements are reasonable, we can give no assurance that these plans, objectives, expectations or intentions will be achieved. Forward-looking statements involve significant risks and uncertainties (some of which are beyond our control) and assumptions that could cause actual results to differ materially from historical experience and present expectations or projections. Actual results to differ materially from those in the forward-looking statements and the trading price for our common stock may fluctuate significantly. Forward-looking statements also are affected by the risk factors described in the Company's filings with the U.S. Securities and Exchange Commission. Except as required by law, we undertake no obligation to update or revise publicly any forward-looking statements, whether as a result of new information, future events or otherwise, after the date on which the statements are made or to reflect the occurrence of unanticipated events.\nView original content with multimedia: http://www.prnewswire.com/news-releases/massroots-retires-convertible-debt-300584034.html\nSOURCE MassRoots, Inc.", "external_links": ["http://www.massroots.com/Investors", "http://www.massrootsblockchain.com/", "http://www.prnewswire.com/news-releases/massroots-retires-convertible-debt-300584034.html"], "published": "2018-01-17T20:33:00.000+02:00", "crawled": "2018-01-17T21:27:40.000+02:00", "highlightTitle": ""}