{"organizations": [], "uuid": "1a07955eabf3fd6cf4e5167197042adb7a990ebd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/europe-stocks/update-1-dealmaking-drives-sharp-moves-as-european-shares-steady-idUSL8N1P71IT", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Dealmaking drives sharp moves as European shares steady", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T11:22:00.000+02:00", "replies_count": 0, "uuid": "1a07955eabf3fd6cf4e5167197042adb7a990ebd"}, "author": "", "url": "https://www.reuters.com/article/europe-stocks/update-1-dealmaking-drives-sharp-moves-as-european-shares-steady-idUSL8N1P71IT", "ord_in_thread": 0, "title": "UPDATE 1-Dealmaking drives sharp moves as European shares steady", "locations": [], "entities": {"persons": [{"name": "angela merkel", "sentiment": "none"}, {"name": "danilo masoni", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "milan", "sentiment": "none"}], "organizations": [{"name": "european central bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "gkn", "sentiment": "none"}, {"name": "social democrats", "sentiment": "none"}, {"name": "puma", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 9:24 AM / Updated 31 minutes ago UPDATE 2-Dealmaking drives sharp moves as European shares rise Reuters Staff \n* STOXX 600 ends 0.2 pct higher \n* GKN surges after rejecting unsolicited takeover \n* Puma drops on Kering spin off to shareholders \n* Europe posts consecutive weekly inflows - EPWR (Adds detail, updates prices at close) \nBy Danilo Masoni and Kit Rees \nMILAN/LONDON, Jan 12 (Reuters) - Dealmaking activity drove sharp share price moves in Europe on Friday with British engineer GKN leaping after it rejected an unsolicited offer from rival Melrose. \nA gain of over 26 percent in GKN and strength in the auto sector led a broad-based rally, helping the pan-European STOXX 600 benchmark end 0.3 percent higher following losses in the previous two sessions. \nWhile the STOXX posted its second week of gains in a row with a 0.3 percent rise, it was a far cry from the 2 percent rally in the opening week of 2018 as a strengthening euro and expectations that the European Central Bank could reduce its stimulus sooner than expected cooled down the new year’s euphoria. \nA rise in the euro on news that German Chancellor Angela Merkel’s conservatives and the Social Democrats had agreed a blueprint for formal coalition negotiations held back gains but the German talks had little other impact. \nThe index however remained near 2-1/2 year highs as solid economic data had fuelled inflows into the region’s equities. \n“Europe Equity Funds posted consecutive weekly inflows for the first time since late October, helped by the first retail commitments in nearly two months, as investors responded to some rosy forecasts for the region’s economic growth,” said Cameron Brandt, Research Director at U.S.-based EPFR, in a note. \nAfter rejecting Melrose, GKN set out plans to split into separate aerospace and automotive businesses, which follows problems at GKN’s U.S. business making aircraft components. \nKering briefly hit a record high after the French luxury goods group announced plans to spin off German sports brand Puma to its shareholders to focus squarely on its more upmarket brands. \nPuma fell nearly 6 percent, while Kering gained just 0.1 percent. Minority Puma shareholders had been hoping for a tie-up between Puma and another industry player rather than a spin-off, one trader said. \nElsewhere, earnings updates drove price action on Friday. \nVivendi fell 3.8 percent after the acquisitive media conglomerate lowered its 2017 full-year guidance for core operating profit and revenues, penalized by higher restructuring costs tied to its pay-TV unit Canal Plus. \nDanish food ingredients developer Chr Hansen dropped 7.4 percent, leading losers on the STOXX, after first-quarter results fell short of analyst estimates. \nAutos were the biggest sectoral gainer, up 1.2 percent, boosted by GKN and a rise to a fresh record high for Fiat Chrysler, which has been recently supported by fresh speculation of possible strategic deals. (Reporting by Danilo Masoni and Kit Rees; Editing by Tom Pfeiffer and Toby Chopra)", "external_links": [], "published": "2018-01-12T11:22:00.000+02:00", "crawled": "2018-01-12T12:09:33.005+02:00", "highlightTitle": ""}