{"organizations": [], "uuid": "bee22dea17f75943f878b856626db8bd0fdd8522", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-fsis-recall-release-004-2018-misbranding-and-undeclared-allergen.html", "country": "US", "domain_rank": 767, "title": "FSIS Recall Release 004-2018 Misbranding and Undeclared Allergen", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-19T01:50:00.000+02:00", "replies_count": 0, "uuid": "bee22dea17f75943f878b856626db8bd0fdd8522"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-fsis-recall-release-004-2018-misbranding-and-undeclared-allergen.html", "ord_in_thread": 0, "title": "FSIS Recall Release 004-2018 Misbranding and Undeclared Allergen", "locations": [], "entities": {"persons": [{"name": "felicia thompson", "sentiment": "none"}], "locations": [{"name": "washington, dc", "sentiment": "none"}, {"name": "n.y.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "new windsor", "sentiment": "none"}], "organizations": [{"name": "fsis", "sentiment": "negative"}, {"name": "café spice gct inc.", "sentiment": "none"}, {"name": "u.s. department of agriculture’s food safety and inspection service", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Washington, DC,Jan. 18, 2018(GLOBE NEWSWIRE) --\nRecall Release CLASS I RECALL\nHEALTH RISK: HIGH Congressional and Public Affairs\nFelicia Thompson (202) 720-9113\nPress@fsis.usda.gov\nFSIS-RC-004-2018\nCAFÉ SPICE GCT INC., RECALLS READY-TO-EAT CHICKEN SALAD PRODUCTS DUE TO MISBRANDING AND AN UNDECLARED ALLERGEN\nWASHINGTON, Jan. 18, 2018 – Café Spice GCT Inc., a New Windsor, N.Y. establishment, is recalling approximately 289 pounds of chicken salad products due to misbranding and an undeclared allergen, the U.S. Department of Agriculture’s Food Safety and Inspection Service (FSIS) announced today. The chicken salad was packaged with a chicken wrap label. The chicken salad contains milk, a known allergen, which is not declared on the chicken wraps’ product labels.\nThe ready-to-eat chicken salads were produced on Jan. 12, 2018. The following products are subject to recall:\n15-oz. clamshell containers labeled “southwest-style chicken wrap” but containing southwest-style chicken salad products, with a “best by” date of “Jan. 20, 2018” on the labels.\nThe products subject to recall bear establishment number “EST. P-34641” inside the USDA mark of inspection. These items were shipped to retail locations nationwide.\nThe problem was discovered by a retail customer, who then notified the company. Following the company’s internal investigation, they contacted FSIS.\nThere have been no confirmed reports of adverse reactions due to consumption of these products. Anyone concerned about an injury or illness should contact a healthcare provider.\nConsumers who have purchased these products are urged not to consume them. These products should be thrown away or returned to the place of purchase.\nFSIS routinely conducts recall effectiveness checks to verify recalling firms notify their customers of the recall and that steps are taken to make certain that the product is no longer available to consumers. When available, the retail distribution list(s) will be posted on the FSIS website at www.fsis.usda.gov/recalls .\nConsumers and media with questions about the recall can contact Ms. Lucero Dedios, Café Spice’s customer representative, at (845) 863-0910 or at orders@cafespice.com .\nConsumers with food safety questions can \"Ask Karen,\" the FSIS virtual representative available 24 hours a day at AskKaren.gov or via smartphone at m.askkaren.gov . The toll-free USDA Meat and Poultry Hotline 1-888-MPHotline (1-888-674-6854) is available in English and Spanish and can be reached from 10 a.m. to 6 p.m. (Eastern Time) Monday through Friday. Recorded food safety messages are available 24 hours a day. The online Electronic Consumer Complaint Monitoring System can be accessed 24 hours a day at: http://www.fsis.usda.gov/reportproblem .\n### NOTE: Access news releases and other information at FSIS’ website at http://www.fsis.usda.gov/recalls .\nFollow FSIS on Twitter at twitter.com/usdafoodsafety or in Spanish at: twitter.com/usdafoodsafe_es .\nUSDA RECALL CLASSIFICATIONS Class I This is a health hazard situation where there is a reasonable probability that the use of the product will cause serious, adverse health consequences or death. Class II This is a health hazard situation where there is a remote probability of adverse health consequences from the use of the product. Class III This is a situation where the use of the product will not cause adverse health consequences.\nUSDA is an equal opportunity provider, employer and lender. To file a complaint of discrimination, write: USDA, Director, Office of Civil Rights, 1400 Independence Avenue, SW, Washington, DC 20250-9410 or call (800) 795-3272 (voice), or (202) 720-6382 (TDD).\nUSDA FSIS USDA Food Safety and Inspection Service press@fsis.usda.gov\nSource: USDA Food Safety and Inspection Service", "external_links": ["http://www.fsis.usda.gov/reportproblem", "http://www.fsis.usda.gov/recalls", "http://twitter.com/usdafoodsafety", "http://twitter.com/usdafoodsafe_es"], "published": "2018-01-19T01:50:00.000+02:00", "crawled": "2018-01-19T05:29:04.004+02:00", "highlightTitle": ""}