{"organizations": [], "uuid": "f8634343bb5641e131fd6734917793984fcd3a40", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XE763_012917_SOC_20180126140501.jpg", "site_section": "https://www.wsj.com/europe", "section_title": "The Wall Street Journal &amp; Breaking News, Business, Financial and Economic News, World News and Video", "url": "https://www.wsj.com/articles/the-robot-revolution-humanoid-potential-moving-upstream-1517221862", "country": "US", "domain_rank": 387, "title": "The Robot Revolution: Humanoid Potential | Moving Upstream", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-29T13:31:00.000+02:00", "replies_count": 0, "uuid": "f8634343bb5641e131fd6734917793984fcd3a40"}, "author": "Moving Upstream", "url": "https://www.wsj.com/articles/the-robot-revolution-humanoid-potential-moving-upstream-1517221862", "ord_in_thread": 0, "title": "The Robot Revolution: Humanoid Potential | Moving Upstream", "locations": [], "entities": {"persons": [{"name": "yann lecunn", "sentiment": "none"}, {"name": "hanson", "sentiment": "none"}, {"name": "david hanson", "sentiment": "none"}, {"name": "sophia", "sentiment": "none"}, {"name": "hiroshi ishiguro", "sentiment": "none"}], "locations": [], "organizations": [{"name": "hong kong-based hanson robotics", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "ibm watson", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "53 COMMENTS Robots are getting better at walking, talking and looking like humans.\nBut big questions remain: Will we want to spend time with them on a regular basis? And how useful to humans could they become?\nDavid Hanson, the founder of Hong Kong-based Hanson Robotics, thinks the true beauty of his creation, Sophia, lies beneath the surface: in her machine-learning capabilities.\n“We are building the AI architecture for genuine love,” Mr. Hanson says.\nEarlier this month, Facebook’s chief AI scientist, Yann LeCunn, took to Twitter to accuse Mr. Hanson of promoting “Wizard-of-Oz AI,” and compared Sophia’s cognitive abilities to those of a puppet.\n“Yann LeCunn’s crude words sadden me,” responded Mr. Hanson, whose team has advanced to the second round of the $5 million IBM Watson AI XPrize, a four-year competition that aims to accelerate adoption of AI technologies. “While Sophia is not yet fully alive or conscious, she is a solid research platform for the pursuit of general intelligence, creativity, and wisdom in machines.”\nFellow roboticist, Hiroshi Ishiguro, director of the Intelligent Robotics Laboratory at Osaka University, has comparably great expectations for his humanoid, Erica. He says his life’s goal is to provide her with “independent consciousness.”\nRelated\nJournal Reports: To Make People Work Better With Robots, Make the Robots Imperfect Three Things Robots Need to Be Your Ideal Home Companion Tiny Robot Marks a Step Toward Using Devices Inside Humans More Videos From Moving Upstream Chinese consumers are adopting mobile payments in a way that’s making U.S. tech companies green with envy. Above, tech inventor and social influencer Naomi Wu in Shenzhen. Erica and Sophia’s responses during my “conversations” with them were sometimes on point, and at other times non sequiturs. In the case of both these humanoids, the responses triggered by my words sounded scripted.\nMr. Hanson says a substantial portion of what Sophia comes up with is generated by algorithms and “some of what she says is actually written by writers.”\nMr. Ishiguro told The Journal in December that Erica is going to become a newscaster on Japanese television sometime in 2018. According to a source familiar with the plan, she will be making her on-air debut nationwide in Japan in April.\nMr. Ishiguro says Erica’s voice will also be used for interactions with passengers in autonomous vehicles made by a Japanese auto maker. He wouldn’t say which one, only that it began with the letter “N.”\nNissan declined to comment on the matter.\n—Miho Inada and Sean McLain in Tokyo contributed to this article.", "external_links": ["https://twitter.com/ylecun/status/949029930976862209?ref_src=twsrc^tfw&ref_url=https://www.theverge.com/2018/1/18/16904742/sophia-the-robot-ai-real-fake-yann-lecun-criticism"], "published": "2018-01-29T13:31:00.000+02:00", "crawled": "2018-01-30T00:45:22.000+02:00", "highlightTitle": ""}