{"organizations": [], "uuid": "ac4da4be701a057817b2215a13afcdc5860e8e24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219372469&w=1200&r=LYNXMPEE03169", "site_section": "http://feeds.reuters.com/reuters/INtopNews\r", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/india-economy-biometric/india-probes-report-on-breach-of-aadhaar-database-idINKBN1ET20F", "country": "US", "domain_rank": 408, "title": "India probes report on breach of Aadhaar database", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T15:48:00.000+02:00", "replies_count": 0, "uuid": "ac4da4be701a057817b2215a13afcdc5860e8e24"}, "author": "", "url": "https://in.reuters.com/article/india-economy-biometric/india-probes-report-on-breach-of-aadhaar-database-idINKBN1ET20F", "ord_in_thread": 0, "title": "India probes report on breach of Aadhaar database", "locations": [], "entities": {"persons": [{"name": "kumar", "sentiment": "none"}], "locations": [{"name": "aadhaar", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "merta", "sentiment": "none"}, {"name": "rajasthan", "sentiment": "none"}, {"name": "new delhi", "sentiment": "none"}], "organizations": [{"name": "unique identification authority of india", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "tribune", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 5:20 PM / Updated 3 hours ago India probes report on breach of Aadhaar database Manoj Kumar 3 Min Read \nNEW DELHI (Reuters) - India on Thursday began investigating a report that access to its database of the identity details of more than 1 billion citizens was being sold for just $8 on social media, in what could be one of the giant programme’s biggest security breaches. A villager goes through the process of a fingerprint scanner for the Unique Identification (UID) database system at an enrolment centre at Merta district in the desert Indian state of Rajasthan February 22, 2013 REUTERS/Mansi Thapliyal/File Photo \nThe Tribune newspaper said it had been able to buy login credentials to the Aadhaar database, allowing it to acquire information such as the names, telephone numbers and home addresses of millions of people. \nThe paper said it bought access for as little as 500 rupees ($7.89) from someone on a WhatsApp social media group. \nThe “case appears to be an instance of misuse,” said the Unique Identification Authority of India (UIDAI), which runs the biometric identity card scheme, the world’s largest. \nThe agency said it had initiated a police complaint against the people responsible for selling the access, but did not identify them. \nCrucial data, “including biometric information, is fully safe and secure,” the agency said in a statement. The database incorporates fingerprints and iris scans, besides basic information details. Village women stand in a queue to get themselves enrolled for the Unique Identification (UID) database system at Merta district in the desert Indian state of Rajasthan February 22, 2013. REUTERS/Mansi Thapliyal/File Photo \n“Mere display of demographic information can’t be misused without biometrics,” it added, ruling out financial fraud, saying access to bank accounts required further authentication that involved fingerprint and iris scans. \nBut the breach is the latest in a programme facing increasing scrutiny over privacy concerns and is likely to prompt further questions about data safety. An operator works on his table while enrolling villagers for the Unique Identification (UID) database system at an enrolment centre at Merta district in the desert Indian state of Rajasthan February 21, 2013.REUTERS/Mansi Thapliyal/File Photo \nThe Supreme Court is holding hearings to decide if a drive by the administration of Prime Minister Narendra Modi to link Aadhaar to private and public services infringes the privacy rights of individuals. \n“The perils of making Aadhaar mandatory and linking it to bank accounts, as insisted upon by the Modi government, are visible here,” Sitaram Yechury, a leader of the communist party, said in a Twitter post. \n“Do we need more proof to stop this madness?” \nLast month, the agency barred telecoms firm Bharti Airtel and its Airtel Payments Bank from using Aadhaar details to verify customers’ identities, because the facility was being misused to open accounts on its payment platform. \n($1=63.3925 Indian rupees)", "external_links": [], "published": "2018-01-04T15:48:00.000+02:00", "crawled": "2018-01-04T22:30:42.016+02:00", "highlightTitle": ""}