{"organizations": [], "uuid": "6d606715e9bb26436c3126c94e1001436336fccd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-asure-software-acquires-sheakley-paysystems.html", "country": "US", "domain_rank": 767, "title": "Asure Software Acquires Sheakley PaySystems", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.555, "site_type": "news", "published": "2018-01-02T17:00:00.000+02:00", "replies_count": 0, "uuid": "6d606715e9bb26436c3126c94e1001436336fccd"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-asure-software-acquires-sheakley-paysystems.html", "ord_in_thread": 0, "title": "Asure Software Acquires Sheakley PaySystems", "locations": [], "entities": {"persons": [{"name": "pat goepel", "sentiment": "none"}, {"name": "goepel", "sentiment": "none"}, {"name": "sheakley", "sentiment": "none"}], "locations": [{"name": "austin", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "iowa", "sentiment": "none"}, {"name": "tennessee", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "workers comp risk management", "sentiment": "none"}, {"name": "human capital management", "sentiment": "none"}, {"name": "sheakley group inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AUSTIN, Texas, Asure Software (NASDAQ:ASUR), a leading provider of Human Capital Management (HCM) and workplace management software, announced today that it has acquired Sheakley PaySystems, a division of Sheakley Group Inc, an Ohio based provider of Workers Comp, Risk Management, HR, Payroll and employee benefits services with locations in Ohio, Tennessee and Iowa. Since 1963, Sheakley’s family-operated, HR and Workers Comp Risk Management outsourcing firm has met the growing needs of employers and their employees through a blend of practical and innovative HR and Workers Comp Risk Management solutions.\nAsure Software’s CEO Pat Goepel commented, “The acquisition of Sheakley PaySystems will help solidify Asure’s expansion in the central US. Asure will be able to deliver our expanded employee engagement solutions to Sheakley PaySystems current customers by offering access to Asure’s complete suite of solutions for the modern workforce.” Goepel continues, “With the opportunity to leverage a variety of new products and services, including powerful digital workspace solutions, Sheakley PaySystems clients and prospects will ensure the success of their most valuable resources - their people.”\nSheakley President Matt Sheakley said, “This is an exciting time as we begin to write the next chapter in our company’s history. Sheakley PaySystems clients will enjoy the same customer support experience that they have always valued and expected. As a result of this acquisition, Sheakley PaySystems will be able to offer our clients even more solutions to better manage their people and their space. The Asure brand will make our offering a truly comprehensive employer solution.”\nAt Asure Software, we are continuing to provide exceptional workspace and workforce management solutions that increase employee productivity and engagement. We deliver on this promise every day by providing our clients with an innovative suite of SaaS solutions that take integral business processes to the next level, creating mobile, digital, agile organizations.\nAbout Asure Software\nAsure Software, Inc., headquartered in Austin, Texas, offers intuitive and innovative solutions designed to help organizations of all sizes and complexities build companies of the future. Our cloud platforms enable more than 80,000 clients worldwide to better manage their people and space in a mobile, digital, multi-generational, and global workplace. Asure Software’s offerings include a fully-integrated HCM platform, flexible benefits and compliance administration, HR consulting, and time and labor management as well as a full suite of workspace management solutions for conference room scheduling, desk sharing programs, and real estate optimization. Visit us at www.asuresoftware.com .\nContact:\nStacy Zellner\nDirector of Marketing, Asure Software\nTelephone: 888-323-8835 x 3111\nE-mail: szellner@asuresoftware.com\nSource:Asure Software Inc", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/f0d54d70-d9a3-484b-ae82-9a5fe9935c75", "https://www.globenewswire.com/Tracker?data=BylE1HUZc2pm90xAJebaZhMp26LNGjUubxtyy4woxfq9GYGpozaHGnRrVTFSGG5nAhJzOSZvjzmM8hywjnFZ7DQexrPY5bETerSkdBoPjxLEZnCA95vlK3ZI_RsqTYuO", "https://www.globenewswire.com/Tracker?data=-ls7uqJDIW2AsGtWxbHxgaxjn96LVhRCz8qShsnTUlYYGoeMn4dMod21Esg00xyX6h-b4Ujj-Tjx7bwpuQiPsJs1xxD-GETjXvQYfgcniTg="], "published": "2018-01-02T17:00:00.000+02:00", "crawled": "2018-01-02T16:22:31.001+02:00", "highlightTitle": ""}