{"organizations": [], "uuid": "e1dc6f2967e92eaa7803b7a4726cc9a7d5b2a6cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/jumanji-the-rock-kevin-hart.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/07/jumanji-tops-weekend-box-office/", "country": "US", "domain_rank": 1196, "title": "'Jumanji' Tops 'Insidious' and 'Star Wars' at Box Office | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.189, "site_type": "news", "published": "2018-01-07T17:46:00.000+02:00", "replies_count": 0, "uuid": "e1dc6f2967e92eaa7803b7a4726cc9a7d5b2a6cd"}, "author": "Reuters", "url": "http://fortune.com/2018/01/07/jumanji-tops-weekend-box-office/", "ord_in_thread": 0, "title": "'Jumanji' Tops 'Insidious' and 'Star Wars' at Box Office | Fortune", "locations": [], "entities": {"persons": [{"name": "jessica chastain", "sentiment": "none"}, {"name": "disney-lucasfilm", "sentiment": "none"}, {"name": "fox", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "sony", "sentiment": "negative"}, {"name": "box office | fortune by reuters", "sentiment": "negative"}, {"name": "universal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Reuters 3:46 PM EST \n(Los Angeles) — Sony’s “Jumanji: Welcome to the Jungle” handily won the first box office weekend of 2018 over the launch of “Insidious: The Last Key” and “Star Wars: The Last Jedi” with $36 million at 3,801 North American locations. \nThe fourth installment of the “Insidious” horror franchise scared up a surprisingly strong $29.3 million at 3,116 sites for Universal. Disney-Lucasfilm’s “The Last Jedi” followed in third with a 55% decline to $23.6 million at 4,232 venues for a 24-day total of $572.5 million — the sixth-largest of all-time. \nFox’s third weekend of “The Greatest Showman” held nicely in fourth, declining only 12% to $13.6 million at 3,342 theaters for a 19-day total of about $77 million. It was followed in fifth by Universal’s third session of “Pitch Perfect 3” with $10.2 million at 3,458 sites, lifting its 17-day take to a solid $86 million. \nFox’s fourth weekend of animated comedy “Ferdinand” finished sixth with $7.7 million at 3,156 venues, followed by Jessica Chastain’s “Molly’s Game” from STXfilms, which brought in $7 million after expanding to 1,608 sites from 271. Chastain received a Golden Globe nomination for best actress in a drama for her work in the film — whether or not she wins will be determined Sunday. The film also received a Producers Guild Award nomination on Friday for best film, a day after Aaron Sorkin’s script received a Writers Guild nom for adapted screenplay. \nThe “Jumanji” sequel has taken in $244.4 million in its first 19 days domestically. It’s the first weekend box office win for “Jumanji”— which has gone past “Justice League” as the ninth-largest domestic grosser among 2017 titles. “Jumanji: Welcome to the Jungle” is also topping the $500 million mark worldwide. \nDwayne Johnson, Kevin Hart, Jack Black, and Karen Gillan star in “Jumanji: Welcome to the Jungle,” a sequel to Robin Williams’ original, which was a 1995 hit with $262 million worldwide. “Welcome to the Jungle” follows four high schoolers in detention who wind up as video game characters facing an array of challenges. \n“Insidious: The Last Key” came in far above expectations, which had been in the $16 million to $19 million range. It’s the latest horror title from Blumhouse Productions, which delivered low-cost horror hits last year for Universal with “Split,”“Get Out,” and “Happy Death Day.” The franchise dates back to 2010 with “Insidious,” followed by “Insidious: Chapter 2” in 2013 and “Insidious: Chapter 3” in 2015 — which have grossed a collective $357 million worldwide. \nLin Shaye, who has starred in all three films, returns in “Insidious: The Last Key” as a parapsychologist whose haunted childhood comes to threaten her family and home in a follow-up to the events in “Insidious: Chapter 3.” It’s produced by “Insidious” regulars Jason Blum, Oren Peli, and co-creator James Wan and by Sony Pictures (through Stage 6 Films) with Blumhouse. Universal is the U.S. theatrical distributor with Sony releasing in the rest of the world. \nOverall domestic business was up 18.1% to $165 million, according to comScore — a welcome sign after 2017 saw a 2.3% decline in total grosses. \n“2018 is off to a rollicking start with ‘Jumanji’s’ unexpected strength boosting the overall marketplace nearly 20% ahead of the comparable weekend a year ago as the box office new year gives the industry cause to celebrate with an incredibly diverse lineup of titles driving patrons to theaters and a red hot awards season in full swing,” noted Paul Dergarabedian, senior media analyst with comScore. “Two years ago was not even as strong with a ‘Force Awakens’ driven marketplace ringing up sales of $159.1 million for the same weekend in 2016.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-07T17:46:00.000+02:00", "crawled": "2018-01-07T23:16:24.000+02:00", "highlightTitle": ""}