{"organizations": [], "uuid": "ad654238fa7aa9bf0c9f0e6d6f838f18dd506016", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/bitcoin-pic.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/10/blockchain-pivot-investors-day-traders/", "country": "US", "domain_rank": 1196, "title": "Day-Traders Profit As Companies Pivot to Blockchain | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.187, "site_type": "news", "published": "2018-01-10T13:54:00.000+02:00", "replies_count": 0, "uuid": "ad654238fa7aa9bf0c9f0e6d6f838f18dd506016"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/10/blockchain-pivot-investors-day-traders/", "ord_in_thread": 0, "title": "Day-Traders Profit As Companies Pivot to Blockchain | Fortune", "locations": [], "entities": {"persons": [{"name": "jim deporre", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "11:54 AM EST \nWho the heck buys into this crypto-mania in the stock market? \nThe answer just might surprise you. Turns out, some experienced day-traders are trying to ride the surge of buying that invariably follows companies that suddenly reinvent themselves as blockchain ventures. That’s enough, market watchers say, to bring in high-frequency traders and computer algos. \nAnd to these players, what really matters isn’t so much that crypto is real, but that the share-price moves — and the quick profits — are. \n“The interest in these stocks is so strong because many traders like me are so hungry for the increased volatility,” said Jim DePorre, a professional day trader and founder of sharkinvesting.com. “I know that there are still traders willing to jump in, so who cares if the stock has questionable value?” \nDePorre, who dispenses trading advice and market color using the @RevShark handle on Twitter, says the fly-by-the-seat-of-your-pants excitement surrounding anything vaguely tied to cryptocurrencies is just the kind of buzz that attracts short-term traders like him. \nWhen buying begets more buying, there’s easy money to be made — as long as you’re not the one left holding the bag. The frenzy was on full display Tuesday, when shares of Eastman Kodak Co. more than doubled after the longtime maker of photographic film said it will start issuing its own alt-coin. Kodak’s stock kept soaring today, almost doubling again in early trading. \nDePorre’s mum on how much he’s made on the trades, but says he’s been in-and-out of a number of blockchain names, including the company formerly known as Long Island Iced Tea Corp. and Riot Blockchain Inc., often multiple times in a single day. Greater Fool? \n“Everyone is on a crypto-binge right now,” said Larry Tabb, the founder of research firm Tabb Group. “Anything associated with it is getting bought up.” \nThe greater fool theory can be a dangerous game. After changing its name to Long Blockchain Corp. in mid-December, the sugary drink seller turned aspiring crypto miner saw its shares surge from roughly $2 to over $9 in a single day. It then quickly fell below $4, and has been wildly fluctuating ever since. The stock closed at $5.80 on Tuesday, which is still good for a 138 percent gain from its pre-blockchain days. \n“It’s a technology with great potential, but investors need to be extremely skeptical,” said Steve Sosnick, chief options strategist at Interactive Brokers, “because these companies are flashing a big, red caveat emptor.” \nDePorre, who does his day trading the old-fashioned way, says his wits and experience have kept him from sustaining painful missteps vis-a-vis other traders. But the popularity and durability of the crypto craze has almost certainly lured ultrafast computer trading firms as well, according to Jim Kyung-Soo Liew, an assistant finance professor at Johns Hopkins University and founder of machine-learning consultancy SoKat Consulting. \n“High frequency traders know certain words can make stocks move,” he said. “They can definitely key in on that and try to get in front.” \nThe spikes in volume have probably also attracted various algorithmic buyers that weren’t necessarily looking for the next crypto-related trade, according to Tucker Balch, co-founder of Lucena Research. \n“My hypothesis is that momentum is initiated by retail traders or pump and dump and then algos are hopping on the bandwagon.” Wild West \nThat may leave investors vulnerable to bad actors trying to game the system and the market feeling a little like the Wild West, according to Michael Covel, author of “Trend Following” and “The Complete Turtle Trader.” But it’s a small price to pay if cryptos ultimately prove to be legit. \n“Con artists will always try to ride the new new thing,” he said. “But if cryptos are for real, and keep growing into dynamic liquid markets, honest players, including momentum, will jump in to ride trends up and down.” \nIn the mean time, traders like DePorre couldn’t care less what kind of money is in on the blockchain name-change game — dumb money, fast money or otherwise — as long as there’s enough money willing to bet on it. \n“As long as there is confidence that other traders are still willing to trade them,” he said, “there is no reason to stay away.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-10T13:54:00.000+02:00", "crawled": "2018-01-10T22:02:19.011+02:00", "highlightTitle": ""}