{"organizations": [], "uuid": "bf1c2b6c7a32f25a313dabd2880ad88f02e39a12", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222104087&w=1200&r=LYNXMPEE0E0HT", "site_section": "http://feeds.reuters.com/reuters/businessNews", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-jd-com-logistics-fundraising-exclusiv/exclusive-chinas-jd-com-targets-2-billion-fundraising-at-logistics-unit-sources-idUSKBN1F4109", "country": "US", "domain_rank": 408, "title": "Exclusive: China's JD.com targets $2 billion fundraising at logistics unit - sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T11:41:00.000+02:00", "replies_count": 0, "uuid": "bf1c2b6c7a32f25a313dabd2880ad88f02e39a12"}, "author": "", "url": "https://www.reuters.com/article/us-jd-com-logistics-fundraising-exclusiv/exclusive-chinas-jd-com-targets-2-billion-fundraising-at-logistics-unit-sources-idUSKBN1F4109", "ord_in_thread": 0, "title": "Exclusive: China's JD.com targets $2 billion fundraising at logistics unit - sources", "locations": [], "entities": {"persons": [{"name": "kane wu", "sentiment": "none"}, {"name": "julie zhu", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}], "organizations": [{"name": "sequoia capital china", "sentiment": "none"}, {"name": "alibaba group holding ltd", "sentiment": "none"}, {"name": "jd logistics", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "hillhouse capital group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HONG KONG (Reuters) - China’s second-biggest e-commerce firm JD.com ( JD.O ) has kicked off a fundraising round at its logistics unit with a target of at least $2 billion, and eventually plans to list the business overseas, people with direct knowledge of the matter said.\nJD.com, which only trails Alibaba Group Holding Ltd ( BABA.N ) in China’s e-commerce market, has invited a select group of investors to join the funding round that values its logistics business, JD Logistics, at around $10 billion, two of the people told Reuters.\nThe move comes as China’s major e-commerce companies are looking to bulk up their logistics businesses to support their global expansion ambitions and boost revenues by offering services to third-party entities.\nChinese investment firm Hillhouse Capital Group and Sequoia Capital China will likely be lead investors of JD Logistics’ funding round, while a number of state-owned and international investors have also shown strong interest in the deal, according to the people.\nDemand could be strong enough that smaller investors putting up just $100 million - the floor for investments, according to two people - would have to prove they could help the logistics unit to bring in new business, one of them said.\nJD.com declined to comment. Hillhouse and Sequoia did not respond to requests for comment. The sources could not be named as the information is confidential.\nJD Logistics is currently 100 percent owned by JD.com. It is not clear when and where the IPO process will be undertaken.\nHillhouse Capital is the second-biggest equity investor in JD.com, according to Thomson Reuters data. Alibaba rival Tencent Holdings ( 0700.HK ) is also a top-10 investor in JD.com, the data shows.\nThe fundraising and any ensuing spin-off would give JD Logistics - set up as a separate entity within the company last April - some independence and help it offer services to third-party clients as well as to compete with Alibaba’s logistics network Cainiao and delivery services firms such as SF Express, the people said.\nLogistics groups have increasingly sought investments to fund work on solutions to supply-chain issues, including autonomous driving, automated warehousing, cross-border logistics and smart logistics services. JD.com, being aggressive in that push, was the first one in China to invest in drones.\nLast year, JD.com invested in logistics infrastructure in Southeast Asia, expanding from existing commitments in Indonesia. It also announced a partnership with Japanese delivery firm Yamato Holdings ( 9064.T ) last month to ship products from Japanese retailers to China.\nJD.com posted net earnings of 1 billion yuan ($151 million), its highest-ever quarterly profit, in the three months to September 30, confounding analysts’ forecasts of a 213 million yuan loss.\nThe company has a current market cap of $66 billion.\nReporting by Julie Zhu and Kane Wu in Hong Kong; Additional reporting by Cate Cadell in Beijing; Editing by Jennifer Hughes and Muralikumar Anantharaman\n ", "external_links": [], "published": "2018-01-15T11:41:00.000+02:00", "crawled": "2018-01-15T11:47:00.012+02:00", "highlightTitle": ""}