{"organizations": [], "uuid": "c0ad1db590ed393fedfa82ebc775f41818aa234b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-eagleforce-health-appoints-director-of-operations-pbm-and-pharmacy-services.html", "country": "US", "domain_rank": 767, "title": "EagleForce Health Appoints Director of Operations, PBM, and Pharmacy Services", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.6, "site_type": "news", "published": "2018-01-22T22:29:00.000+02:00", "replies_count": 0, "uuid": "c0ad1db590ed393fedfa82ebc775f41818aa234b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-eagleforce-health-appoints-director-of-operations-pbm-and-pharmacy-services.html", "ord_in_thread": 0, "title": "EagleForce Health Appoints Director of Operations, PBM, and Pharmacy Services", "locations": [], "entities": {"persons": [{"name": "townsend", "sentiment": "none"}, {"name": "diona townsend", "sentiment": "none"}], "locations": [{"name": "va.", "sentiment": "none"}, {"name": "herndon", "sentiment": "none"}], "organizations": [{"name": "llc", "sentiment": "negative"}, {"name": "operations", "sentiment": "negative"}, {"name": "eagleforce health", "sentiment": "negative"}, {"name": "pbm", "sentiment": "negative"}, {"name": "operations for pbm", "sentiment": "none"}, {"name": "new albertson's, inc", "sentiment": "none"}, {"name": "eagleforce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HERNDON, Va., Jan. 22, 2018 /PRNewswire/ -- EagleForce Health, LLC, a leading provider of big data interoperability and advanced analytics, announced today that Ms. Diona Townsend has joined its team as Director of Operations for PBM and Pharmacy services. Ms. Townsend brings a strong pharmaceutical background from her experiences at OptumRx and New Albertson's, Inc.\nAt OptumRx, Ms. Townsend was instrumental in establishing business relationships throughout retail pharmacy as well as innovating retail network solutions with a specific focus on the reduction of client costs, increased client retention, profit, governance and security. As Director of PBM and Pharmacy services, Ms. Townsend will work across the nation to connect PBM and Pharmacy businesses to EagleForce's technology and professional services teams to include precision health and predictive analytics resources in the market. Her responsibilities include addressing local priorities in pharmacy enterprise governance and helping to build strong technical communities within the \"Big Pharma\" industry. In this new capacity, she will continue to assist numerous Pharmaceutical Manufactures, PBM's and commercial Point of Sale Pharmacies in their efforts of staying in compliance with the Anti-Kickback Act and other federal regulations.\nHer leadership capabilities in this domain will serve to ensure that EagleForce will continue to maintain the highest standards for its clients as the federal government continues to hold companies accountable for improper billing and product steering of medications. Ms. Townsend serves as a vital resource for those enterprises within the health care industry who have a sincere focus on governance. \"Ms. Townsend brings a valuable set of technical and operational talents that will continue to move EagleForce's market leadership in governance and client profitability,\" said Stanley Campbell, Chief Executive Officer of EagleForce.\nIn her role as Director of Operations, PBM, and pharmacy services, Ms. Townsend will be responsible for implementing and executing business developments as well as operational strategies. She will utilize her experience to help establish and maintain business partnerships. \"I appreciate the wealth of knowledge in advanced analytics and attention to detail that EagleForce brings to the pharmacy industry. This move serves as the most relevant and honored step in the advancement of my career as we strive to better the average Americans prospective and position with the large pharmacy players,\" stated Diona Townsend, \"I am excited to utilize my capabilities to help solve some of the biggest challenges we face in healthcare today.\"\nExternally, she is an active leader in the community, serving as the proud mom of a graduating high school senior.\nAbout EagleForce Health, LLC\nEagleForce Health is an Advanced Analytics Company that established its pedigree in the Defense and Intelligence sector of the government solving some of the country's biggest challenges. The Company has many patents in the area of eligibility and predictive analytics which it employs in solving some of healthcare's most difficult problems with respect to disparate data interoperability by utilizing artificial intelligence, neural computing and enhanced data modeling. For more information, please contact us or visit our website:\nwww.TheEagleForce.net\nView original content: http://www.prnewswire.com/news-releases/eagleforce-health-appoints-director-of-operations-pbm-and-pharmacy-services-300586099.html\nSOURCE EagleForce Health, LLC", "external_links": ["http://www.theeagleforce.net/", "http://www.prnewswire.com/news-releases/eagleforce-health-appoints-director-of-operations-pbm-and-pharmacy-services-300586099.html"], "published": "2018-01-22T22:29:00.000+02:00", "crawled": "2018-01-22T23:22:43.080+02:00", "highlightTitle": ""}