{"organizations": [], "uuid": "80a3408186c2e8940bd8770337a2f26a5af5dc06", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-castle-brands-announces-bourbon-inventory-acquisitions.html", "country": "US", "domain_rank": 767, "title": "Castle Brands Announces Bourbon Inventory Acquisitions", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.879, "site_type": "news", "published": "2018-01-04T16:30:00.000+02:00", "replies_count": 0, "uuid": "80a3408186c2e8940bd8770337a2f26a5af5dc06"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-castle-brands-announces-bourbon-inventory-acquisitions.html", "ord_in_thread": 0, "title": "Castle Brands Announces Bourbon Inventory Acquisitions", "locations": [], "entities": {"persons": [{"name": "jefferson", "sentiment": "none"}, {"name": "john glover", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "jefferson", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "castle brands", "sentiment": "negative"}, {"name": "castle brands inc.", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 4, 2018 /PRNewswire/ -- Castle Brands Inc. (NYSE American: ROX), a developer and international marketer of premium and super-premium drinks brands, today announced that it has purchased, or agreed to purchase, an additional $4.2 million of aging and new-fill bourbon. These additional purchases bring Castle Brands total purchases of aging and new fill bourbon to $9.6 million for the current fiscal year.\nJohn Glover, Executive Vice President and Chief Operating Officer of Castle Brands, said, \"The continued investment in our aging bourbon inventory demonstrates our commitment to the Jefferson's brand. Jefferson's is one of the top five selling premium small batch bourbons and the only leading small batch brand not owned by a major spirits company. Growing our barrel inventory through opportunistic purchases, combined with our two new-fill programs, allows us to accelerate the growth of our Jefferson's portfolio. We continue to build on the success of Jefferson's and Jefferson's Reserve through innovation and the introduction of new expressions, including the expansion of our wine finishes program and the launch of the next voyages of our Jefferson's Ocean Aged at Sea® bourbon, including Cask Strength and a 'Wheated' Ocean.\"\nAbout Castle Brands\nCastle Brands is a developer and international marketer of premium and super-premium brands including: Jefferson's ® , Jefferson's Presidential Select™, Jefferson's Reserve ® , Jefferson's Ocean Aged at Sea Bourbon, Jefferson's Wine Finish Collection and Jefferson's Wood Experiments, Goslings ® Rums, Goslings ® Stormy Ginger Beer, Knappogue Castle Whiskey ® , Clontarf ® Irish Whiskey, Pallini ® Limoncello, Boru ® Vodka, Brady's ® Irish Cream, The Arran Malt ® Single Malt Scotch Whisky, The Robert Burns Scotch Whisky and Machrie Moor Scotch Whisky. Additional information concerning the Company is available on the Company's website, www.castlebrandsinc.com .\nForward Looking Statements\nThis press release includes statements of our expectations, intentions, plans and beliefs that constitute \"forward looking statements\" within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934 and are intended to come within the safe harbor protection provided by those sections. These statements, which involve risks and uncertainties, relate to the discussion of our business strategies and our expectations concerning future operations, margins, sales, new products and brands, potential joint ventures, potential acquisitions, expenses, profitability, liquidity and capital resources and to analyses and other information that are based on forecasts of future results and estimates of amounts not yet determinable. You can identify these and other forward-looking statements by the use of such words as \"may,\" \"will,\" \"should,\" \"expects,\" \"intends,\" \"plans,\" \"anticipates,\" \"believes,\" \"thinks,\" \"estimates,\" \"seeks,\" \"predicts,\" \"could,\" \"projects,\" \"potential\" and other similar terms and phrases, including references to assumptions. These forward looking statements are made based on expectations and beliefs concerning future events affecting us and are subject to uncertainties, risks and factors relating to our operations and business environments, all of which are difficult to predict and many of which are beyond our control, that could cause our actual results to differ materially from those matters expressed or implied by these forward looking statements. These risks include our history of losses and expectation of further losses, our ability to expand our operations in both new and existing markets, our ability to develop or acquire new brands, our relationships with distributors, the success of our marketing activities, the effect of competition in our industry and economic and political conditions generally, including the current economic environment and markets. More information about these and other factors are described under the caption \"Risk Factors\" in Castle Brands' Annual Report on Form 10-K for the year ended March 31, 2017 and other reports we file with the Securities and Exchange Commission. When considering these forward looking statements, you should keep in mind the cautionary statements in this press release and the reports we file with the Securities and Exchange Commission. New risks and uncertainties arise from time to time, and we cannot predict those events or how they may affect us. We assume no obligation to update any forward looking statements after the date of this press release as a result of new information, future events or developments, except as required by the federal securities laws.\nCastle Brands Inc.\nInvestor Relations, 646-356-0200\ninfo@castlebrandsinc.com\nwww.castlebrandsinc.com\nView original content: http://www.prnewswire.com/news-releases/castle-brands-announces-bourbon-inventory-acquisitions-300577267.html\nSOURCE Castle Brands Inc.", "external_links": ["http://www.prnewswire.com/news-releases/castle-brands-announces-bourbon-inventory-acquisitions-300577267.html", "http://www.castlebrandsinc.com/"], "published": "2018-01-04T16:30:00.000+02:00", "crawled": "2018-01-04T16:42:24.005+02:00", "highlightTitle": ""}