{"organizations": [], "uuid": "d2195d5536d57a9b2c0e7b6a460f19d4d9140799", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226562897&w=1200&r=LYNXMPEE0T0KU", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-china-security/chinese-military-paper-urges-increase-in-nuclear-deterrence-capabilities-idUKKBN1FJ1AI", "country": "US", "domain_rank": 408, "title": "Chinese military paper urges increase in nuclear deterrence capabilities", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T12:26:00.000+02:00", "replies_count": 0, "uuid": "d2195d5536d57a9b2c0e7b6a460f19d4d9140799"}, "author": "", "url": "https://uk.reuters.com/article/uk-china-security/chinese-military-paper-urges-increase-in-nuclear-deterrence-capabilities-idUKKBN1FJ1AI", "ord_in_thread": 0, "title": "Chinese military paper urges increase in nuclear deterrence capabilities", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "pla", "sentiment": "none"}, {"name": "pla daily", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "people’s liberation army", "sentiment": "none"}, {"name": "huffington post", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 10:30 AM / Updated an hour ago Chinese military paper urges increase in nuclear deterrence capabilities Reuters Staff 3 Min Read \nBEIJING (Reuters) - China must strengthen its nuclear deterrence and counter-strike capabilities to keep pace with the developing nuclear strategies of the United States and Russia, the official paper of the People’s Liberation Army (PLA) said on Tuesday. \nU.S. President Donald Trump’s administration may be pursuing the development of new nuclear weaponry and could explicitly leave open the possibility of nuclear retaliation for major non-nuclear attacks, according to a draft of a pending Nuclear Posture Review leaked by the Huffington Post. \nThis “unprecedented” move by the United States, combined with continuous quality improvements of nuclear arsenals in both the U.S. and Russia, means that both countries place greater importance on deterrence and real combat usability, the commentary in the PLA Daily said. \n“In the roiling unpredictability of today’s world, to upgrade the capability of our country’s deterrence strategy, to support our great power position... we must strengthen the reliability and trustworthiness of our nuclear deterrence and nuclear counterstrike capabilities,” it said. \nThe article was written by two researchers from the PLA Academy of Military Science, a top research institute directly responsible to China’s Central Military Commission. \nA change was necessary despite China having developed nuclear weapons to avoid bullying from nuclear powers, the paper said, adding that China would always stick to the principle of “no first use” and a final goal of eliminating nuclear weapons. \nNeither Russia nor the United States is abandoning nuclear weapons as each adopts new high-tech weapons capabilities, the paper said, pointing to the U.S. Congressional Budget Office’s estimate of maintenance and modernisation of the U.S. nuclear arsenal over the next 30 years costing more than $1.2 trillion. \nThis spend, the paper said, has led to a corresponding Russian military modernisation program, aiming to boost the share of advanced armaments in its nuclear triad to at least 90 percent by 2021. \nChinese President Xi Jinping is overseeing an ambitious military modernisation programme, including developing advanced nuclear-capable missiles. China carried out its first nuclear weapons test only in 1964. \nTrump’s strong embrace of his predecessor President Barack Obama’s nuclear modernisation programme has led some former senior U.S. government officials, legislators and arms control specialists to warn of risks from the U.S. stoking a new arms race. \nA U.S. national defence strategy released on Jan. 19 shifted priorities to put what Defense Secretary Jim Mattis called a “great power competition” with China and Russia at the heart of the country’s military strategy. Reporting by Christian Shepherd; Editing by Clarence Fernandez", "external_links": [], "published": "2018-01-30T12:26:00.000+02:00", "crawled": "2018-01-30T12:55:11.000+02:00", "highlightTitle": ""}