{"organizations": [], "uuid": "027e14a4af722dac005000d4117d6da6afd3bb7d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/04/27/103583954-GettyImages-517885250r.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/the-fed-will-cause-a-stock-market-correction-this-quarter-investment-bank-stifel-predicts.html", "country": "US", "domain_rank": 767, "title": "The Fed will cause a stock market correction this quarter, investment bank Stifel predicts", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.242, "site_type": "news", "published": "2018-01-29T19:32:00.000+02:00", "replies_count": 0, "uuid": "027e14a4af722dac005000d4117d6da6afd3bb7d"}, "author": "Fred Imbert", "url": "https://www.cnbc.com/2018/01/29/the-fed-will-cause-a-stock-market-correction-this-quarter-investment-bank-stifel-predicts.html", "ord_in_thread": 0, "title": "The Fed will cause a stock market correction this quarter, investment bank Stifel predicts", "locations": [], "entities": {"persons": [{"name": "stifel", "sentiment": "negative"}, {"name": "michael nagle", "sentiment": "none"}, {"name": "barry bannister", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "stifel", "sentiment": "negative"}, {"name": "fed", "sentiment": "negative"}, {"name": "venture capital the fed", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Stocks will experience a correction this quarter as the Federal Reserve leads other central banks in tightening global monetary policy, a strategist at Stifel predicts.\n\"With late cycle U.S. tax cuts occurring after GDP has recovered, the Fed must tighten to offset loose fiscal policy,\" Barry Bannister, the firm's head of institutional equity strategy, said in a note Friday. He also said other central banks will follow the Fed's lead.\n\"Although it is fashionable to believe in Davos-man cooperation, the Fed is the pace setter for all the world's central banks,\" Bannister said. \"The U.S. was first-in/first-out of the Global Financial Crisis, … and the Fed will be the first central bank to shed politicized rescue efforts and lead other central banks back to independence, in our view.\"\nBannister isn't the only strategist predicting a pullback. Goldman Sachs strategist Peter Oppenheimer said Monday a correction could be heading the stock market's way in coming months . Michael Hartnett of Bank of America Merrill Lynch said a \"sell\" signal was triggered in the week ending last Wednesday as investors poured $33.2 billion into stock-based funds.\nThe S&P 500 is on its longest stretch without a 5 percent pullback since 1929. The index last fell at least 5 percent in June 2016.\nThe Fed's latest interest rate decision will come Wednesday. Fed policymakers meet again on March 20-21.\n\"Investors have traded a 'competitive game' among central banks for the past five years, but we see central banks transitioning to a 'cooperative game' in which they reassert independence and move to neuter potentially destructive bubbles,\" Bannister said. \"Such a strategy could come into focus by the March Fed press conference, implying a correction within the quarter.\"\nCentral banks around the world implemented unprecedented easy monetary policy following the financial crisis. The purpose of these policies was to reignite the global economy. The biggest economies in the world all grew at once last year for the first time since the crisis . The global synchronous growth gives central banks more leeway to tighten monetary policy.\nGlobal interest rates have already started to move higher. The U.S. 10-year Treasury note yield hit its highest level in nearly four years on Monday. The 10-year German bund yield reached a level not seen since 2015, while the 10-year Japanese note yield rose to its highest level since July.\nWATCH: Interest rates most likely to cause market correction show chapters Interest rates moving up the most likely to cause a market correction: Portfolio manager      2:19 PM ET Wed, 24 Jan 2018 | 02:26", "external_links": [], "published": "2018-01-29T19:32:00.000+02:00", "crawled": "2018-01-29T19:34:51.002+02:00", "highlightTitle": ""}