{"organizations": [], "uuid": "de590021676ead95ff2c446f0981eab01d4a560e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/rbs-grg/update-1-rbs-restructuring-arm-did-not-turn-around-vast-majority-of-businesses-ceo-idUSL8N1PP6O4", "country": "US", "domain_rank": 408, "title": "UPDATE 1-RBS restructuring arm did not turn around \"vast majority\" of businesses -CEO", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T19:28:00.000+02:00", "replies_count": 0, "uuid": "de590021676ead95ff2c446f0981eab01d4a560e"}, "author": "", "url": "https://www.reuters.com/article/rbs-grg/update-1-rbs-restructuring-arm-did-not-turn-around-vast-majority-of-businesses-ceo-idUSL8N1PP6O4", "ord_in_thread": 0, "title": "UPDATE 1-RBS restructuring arm did not turn around \"vast majority\" of businesses -CEO", "locations": [], "entities": {"persons": [{"name": "nicky morgan", "sentiment": "none"}, {"name": "ross mcewan", "sentiment": "none"}, {"name": "howard davies", "sentiment": "none"}, {"name": "emma rumney", "sentiment": "none"}, {"name": "mcewan", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}], "organizations": [{"name": "treasury select committee", "sentiment": "none"}, {"name": "rbs", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "global restructuring group", "sentiment": "none"}, {"name": "fca", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "grg", "sentiment": "none"}, {"name": "clifford chance", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 5:28 PM / in 7 minutes UPDATE 1-RBS restructuring arm did not turn around \"vast majority\" of businesses -CEO Reuters Staff \n(Adds FCA to publish report in full) \nBy Emma Rumney \nLONDON, Jan 30 (Reuters) - Royal Bank of Scotland’s restructuring business did not turn around the “vast majority” of small businesses it worked with, Chief Executive Ross McEwan said on Tuesday in response to lawmakers’ questions. \nMcEwan and RBS Chairman Howard Davies were being grilled by members of the Treasury Select Committee, which has challenged state-backed RBS on its treatment of troubled small businesses during and after the financial crisis. \nRBS’s Global Restructuring Group (GRG) handled around 12,000 struggling firms between 2007 and 2012, some of which accuse the bank of pushing them into bankruptcy to pick up their assets on the cheap. \nNicky Morgan, who chairs the Treasury committee, asked McEwan about a statement he made in 2014 after the publication of a report into GRG’s conduct by law firm Clifford Chance. \n“I want to take you back Mr McEwan to a statement you made following the publication of the Clifford Chance report into GRG ... In that statement you said, and I quote, that GRG ‘turns around the vast majority of businesses that it works with’. That isn’t true, that wasn’t true, was it?” Morgan said. \n“In 2014, absolutely, when you look at the stats that have come through ... it is not true,” McEwan said in response. \nHe was referring to figures from a subsequent report into GRG conducted by consultants Promontory, which was commissioned by the Britain’s financial regulator the Financial Conduct Authority. \nTo date, the FCA has refused to publish the Promontory report in full. Instead it has published a summary, which a committee-appointed barrister said was an accurate reflection of the report’s full contents. \nMorgan said the summary of the report represented a “litany of poor conduct”, but while it recognised numerous failings it did not uphold the most serious accusations against the bank. \nMcEwan, who took up his job at RBS in 2013, told the committee he would inform Andrew Bailey, chief executive of the FCA, that if the regulator wished to publish the full report RBS would not object. \nThe FCA said after the hearing it would publish the Promontory report in full once it has obtained the consent of those who provided information and any individuals who are identified. \nThe watchdog is already using information from the report to see if it should take further action. \n“We will approach these individuals, once the work on the focused investigation is completed, to ask for their consent to publish,” the FCA said in a statement. \nRBS has set aside 400 million pounds ($565.88 million) to cover the bill for complaints made by customers over their treatment by GRG. \n“ is not a cap, it’s an estimate of what we think this process will cost, and if it costs more it costs more,” Davies told the committee. \nThe FCA in 2016 effectively cleared RBS of many of the allegations by customers. RBS has admitted some wrongdoing over its handling of small businesses, but stopped short of saying they were deliberately pushed into administration. \nThe scandal has hampered RBS’s efforts to reform its image and move on from the financial crisis. The British government is preparing to sell down its 70 percent stake in the bank. $1 = 0.7069 pounds Additional reporting by Huw Jones, Editing by Jane Merriman", "external_links": [], "published": "2018-01-30T19:28:00.000+02:00", "crawled": "2018-01-30T19:41:04.016+02:00", "highlightTitle": ""}