{"organizations": [], "uuid": "4a02e4645bc00ac82fda9618cb1aea3301939ddb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 1}, "linkedin": {"shares": 4}, "facebook": {"likes": 335, "shares": 335, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/10/104939114-msci.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/10/global-stocks-see-longest-streak-without-a-5-percent-correction.html", "country": "US", "domain_rank": 767, "title": "Global stocks see longest streak without a 5 percent correction", "performance_score": 3, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.012, "site_type": "news", "published": "2018-01-10T23:31:00.000+02:00", "replies_count": 0, "uuid": "4a02e4645bc00ac82fda9618cb1aea3301939ddb"}, "author": "Keris Lahiff", "url": "https://www.cnbc.com/2018/01/10/global-stocks-see-longest-streak-without-a-5-percent-correction.html", "ord_in_thread": 0, "title": "Global stocks see longest streak without a 5 percent correction", "locations": [], "entities": {"persons": [{"name": "gina sanchez", "sentiment": "none"}, {"name": "sanchez", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "chantico global", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "msci", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "show chapters Global markets are doing something they’ve never done before      5:48 PM ET Tue, 9 Jan 2018 | 03:31 Stocks around the world are surging, and just passed an incredible milestone.\nThe MSCI World Index has gone 19 straight months without a 5 percent pullback, its longest on record. The group had its best returns since 2013 last year, thanks largely to a record-breaking stretch in U.S. equities that has made for Wall Street's second-longest bull market. The U.S. stock market is weighted at nearly 60 percent in the MSCI index.\n\nBut, for 2018, the real value could come from overseas, says Gina Sanchez , CEO of Chantico Global.\n\"Valuations matter and if you look at where the real opportunities are right now, they're not in the U.S., they are abroad,\" Sanchez told CNBC's \" Trading Nation \" on Tuesday. \"We're rooting for the rest of the world right now.\"\nEmerging markets rocketed higher in 2017 and could see further gains this year, noted Sanchez, whose firm is overweight those equities. The emerging markets ETF, the EEM , gained nearly 35 percent in 2017, its best annual percentage increase in almost a decade.\n\"Global trade has been expanding all through last year and it's continuing to expand at the beginning of this year and that's actually driving a story around emerging markets and the potential for more out of that area,\" said Sanchez.\nOutside of emerging markets, the global equity environment remains an inviting one for traders, at least in the short term, according to Chad Morganlander, portfolio manager at Washington Crossing Advisors.\n\"In the short run for [the first quarter], everything looks positive,\" Morganlander said Wednesday on \"Trading Nation.\" \"Credit trends look positive, U.S. economic trends OK. ... Critical drivers are global growth, earnings, revenue growth.\"\nBut, Morganlander remains aware of the risks that could put a pin in stocks' upward march, including \"overextended\" valuations and monetary policy that may prove a \"fly in the ointment\" over the second half of the year.\nThe Federal Reserve 's willingness to tighten monetary conditions, in particular, might prove challenging to U.S. equities which have traded in an environment of historically low rates since the beginning of the financial crisis. Most traders and economists anticipate the Fed to raise its federal funds rate three times in 2018, the first as soon as its March meeting.\nStill, for the first half of the year, Morganlander is optimistic.\n\"We're overweight equities in the short run right now but we'd be somewhat more cautious in the long run,\" he said. Morganlander targets 5 to 6 percent returns for the S&P 500 over the next three to five years.\nA recent report from Goldman Sachs targets a more bullish outlook of 5.8 percent returns for the benchmark index over the next 12 months.\nVote Vote to see results Total Votes: Not a Scientific Survey. Results may not total 100% due to rounding.\nDisclaimer", "external_links": [], "published": "2018-01-10T23:31:00.000+02:00", "crawled": "2018-01-11T00:21:33.013+02:00", "highlightTitle": ""}