{"organizations": [], "uuid": "ff3d74c5344654d58bd95da4379020366c4d88b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221540530&w=1200&r=LYNXMPEE0B1HC", "site_section": "http://feeds.reuters.com/reuters/politicsNews", "section_title": "Reuters: Politics", "url": "https://www.reuters.com/article/us-usa-court-texas/supreme-court-takes-up-fight-over-texas-electoral-districts-idUSKBN1F12IR", "country": "US", "domain_rank": 408, "title": "Supreme Court takes up fight over Texas electoral districts", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T21:58:00.000+02:00", "replies_count": 0, "uuid": "ff3d74c5344654d58bd95da4379020366c4d88b4"}, "author": "", "url": "https://www.reuters.com/article/us-usa-court-texas/supreme-court-takes-up-fight-over-texas-electoral-districts-idUSKBN1F12IR", "ord_in_thread": 0, "title": "Supreme Court takes up fight over Texas electoral districts", "locations": [], "entities": {"persons": [{"name": "lawrence hurley", "sentiment": "none"}, {"name": "will dunham", "sentiment": "none"}], "locations": [{"name": "texas", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "supreme court", "sentiment": "negative"}, {"name": "u.s. supreme court", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 7:58 PM / Updated 21 minutes ago Supreme Court takes up fight over Texas electoral districts Lawrence Hurley 5 Min Read \n  The U.S. Supreme Court on Friday agreed to hear a bid by Texas to revive Republican-drawn electoral districts for state legislative and U.S. congressional seats that were thrown out by a lower court for diminishing black and Hispanic voters’ clout. \nThe high court in September put both lower court rulings that had invalidated the Republican-drawn districts on hold in September. The justices were divided 5-4, with the five conservatives backing the Texas Republicans and the four liberals dissenting, suggesting they could be similarly divided when they issue their eventual ruling on the merits of the case. \nThe case is the latest in which the justices will ponder a practice known as gerrymandering in which state electoral districts are drawn in a way that amplifies the power of certain voters -- in this case white voters -- at the expense of others. It is the latest voting rights dispute taken up by the justices. \nThe lower court rulings in the Texas case found fault with state legislative districts and U.S. House of Representatives districts drawn by the Republican-controlled state legislature in 2013. \nIn one of the decisions under review, a three-judge panel sitting in San Antonio struck down two Republican-drawn U.S. House districts as discriminatory and ordered new maps to be drawn ahead of this year’s elections. \nThat court ruled that the 27th and 35th congressional districts were drawn in violation of the Voting Rights Act, a 1965 law that protects minority voters and was enacted to address a history of racial discrimination in voting, especially in Southern states. Texas has 36 U.S. House districts, with Republicans holding 25 of them and Democrats 11. \nRepublican Blake Farenthold, who announced in December that he would not seek re-election this year amid a scandal over sexual harassment allegations, currently represents the 27th district. Democrat Lloyd Doggett represents the 35th district. \nA separate decision also issued in August by the same three-judge panel found similar faults with maps drawn for the Texas House of Representatives. \nWith both decisions on hold, no new districts will be drawn in the interim while the high court considers the Texas appeal in the cases. The electoral maps being challenged remain in use. \nVoting rights advocates accused Republican lawmakers of drawing districts to undermine the influence of racial minority voters, who tend to favor Democratic candidates. The state said the redistricting plan was largely based on a map drawn by a federal court in 2012 when it threw out the state’s 2011 maps. \nRace can be considered in redrawing boundaries of voting districts only in certain instances, such as when states are seeking to comply with the Voting Rights Act. NORTH CAROLINA RULING \nIn its most recent case on racial gerrymandering, the Supreme Court in May 2017 ruled that Republicans in North Carolina unlawfully took race into consideration when drawing congressional district boundaries, concentrating black voters in an improper bid to diminish their statewide political clout. \nIn a similar case, the justices in March 2017 ordered a lower court to reassess whether Virginia’s Republican-led legislature unlawfully tried to weaken the power of black voters. The justices threw out the lower court’s decision upholding 12 state legislature districts. \nThe Supreme Court is currently weighing two other cases on the legality of electoral districts, involving legislative maps drawn by Republicans in Wisconsin and Democrats in Maryland. Those cases differ from the Texas dispute because they do not focus on claims of racial discrimination but rather on whether districts drawn with the aim of entrenching one party in power violate the U.S. Constitution. \nGerrymandering is generally accomplished by concentrating voters who tend to favor a particular party in a small number of districts to reduce their statewide voting power while scattering others in districts in numbers too small to be a majority. \nThe court is likely to decide the case by the end of June, when its current term ends. Reporting by Lawrence Hurley; Editing by Will Dunham", "external_links": [], "published": "2018-01-12T21:58:00.000+02:00", "crawled": "2018-01-12T22:10:42.014+02:00", "highlightTitle": ""}