{"organizations": [], "uuid": "6ea8c00fa62c2788d72f5d5084ada8ceab7c8cd5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226493793&w=1200&r=LYNXMPEE0T071", "site_section": "http://feeds.reuters.com/reuters/sportsNews/", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-football-nfl-superbowl-wentz/wentz-left-to-wonder-what-could-have-been-at-super-bowl-idUSKBN1FJ0G8", "country": "US", "domain_rank": 408, "title": "Wentz left to wonder what could have been at Super Bowl", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T06:52:00.000+02:00", "replies_count": 0, "uuid": "6ea8c00fa62c2788d72f5d5084ada8ceab7c8cd5"}, "author": "", "url": "https://www.reuters.com/article/us-football-nfl-superbowl-wentz/wentz-left-to-wonder-what-could-have-been-at-super-bowl-idUSKBN1FJ0G8", "ord_in_thread": 0, "title": "Wentz left to wonder what could have been at Super Bowl", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MINNEAPOLIS (Reuters) - While his team mates soaked up the Super Bowl Opening Night spotlight, injured Philadelphia Eagles quarterback Carson Wentz sat alone on Monday wondering what could have been if not for a late-season knee injury.\nWentz’s MVP-caliber season was cut short with a knee injury that forced him to take a back seat to close friend Nick Foles and he said not being able to face the New England Patriots on the NFL’s biggest stage on Sunday was crushing.\n“It’s tough knowing that could be you. I had my sights set on this thing since I knew we weren’t making the playoffs last year,” Wentz, who tore his ACL in December, told reporters.\n“I had my sights set on playing in Minneapolis, it’s right down the road from home and it’s just meant to be and here we are. It just looks different for me.”\nUnlike his Eagles team mates, who were on the floor of the arena surrounded by hordes of media from around the world, Wentz went mostly unnoticed sitting in an empty section overlooking all the action.\nThe second-year quarterback, who grew up in North Dakota, was the face of the Eagles team he led to an 11-2 record at the time of his injury, which immediately prompted questions about how far they could go without their starter.\nJan 29, 2018; St. Paul, MN, USA; Philadelphia Eagles quarterback Carson Wentz (11) during Super Bowl LII Opening Night at Xcel Energy Center. Mandatory Credit: Brad Rempel-USA TODAY Sports While the 25-year-old knows it will be tough to watch as his team chase their first Super Bowl title, Wentz said he would do all he can to help Foles get the better of the Patriots defense.\n“I don’t know many people more competitive than I am, that want to have the ball in their hand, want to be making the plays. So it’ll be tough, especially when the offense runs out on the field the first time,” said Wentz.\n“But I am going to be right there, have my headset on and doing what I can to help Nick and hopefully go win this thing.”\nWentz, who said his rehabilitation was going well, also felt not being able to play in this year’s Super Bowl would give him an edge in his comeback.\n“Last year just being at (the Super Bowl) ticked me off when I was down there doing media and things, just knowing that I don’t want to be here in that capacity again,” said Wentz.\n“And now here I am with the team, and I am stoked for the team but on a personal level I want to be playing in this thing and I will definitely use it as motivation throughout the offseason and throughout my rehab.”\nEditing by Peter Rutherford\n ", "external_links": [], "published": "2018-01-30T06:52:00.000+02:00", "crawled": "2018-01-30T07:09:59.500+02:00", "highlightTitle": ""}