{"organizations": [], "uuid": "e413e0ae0da2badf4df3915f0b3a657a3ce407e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221459777&w=1200&r=LYNXMPEE0B10X", "site_section": "https://www.reuters.com/finance/commodities", "section_title": "Commodities News, Commodity Trading Prices &amp; Data | Reuters.com", "url": "https://www.reuters.com/article/us-oil-opec-emirates/opec-need-not-rush-into-changing-oil-pact-uae-idUSKBN1F11PC", "country": "US", "domain_rank": 408, "title": "OPEC need not rush into changing oil pact: UAE", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.04, "site_type": "news", "published": "2018-01-12T22:04:00.000+02:00", "replies_count": 0, "uuid": "e413e0ae0da2badf4df3915f0b3a657a3ce407e7"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-oil-opec-emirates/opec-need-not-rush-into-changing-oil-pact-uae-idUSKBN1F11PC", "ord_in_thread": 0, "title": "OPEC need not rush into changing oil pact: UAE", "locations": [], "entities": {"persons": [{"name": "abu dhabi", "sentiment": "negative"}, {"name": "mazroui", "sentiment": "none"}, {"name": "suhail al-mazroui", "sentiment": "none"}], "locations": [{"name": "uae", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "opec", "sentiment": "negative"}, {"name": "united arab emirates energy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ABU DHABI (Reuters) - OPEC need not respond to a rise in oil prices by rushing to change a global supply-cutting pact, United Arab Emirates Energy Minister Suhail al-Mazroui said on Friday.\nThis year’s rapid rise in oil prices, which hit $70 this week, is backed by strong demand growth and a fall in oversupply on the back of the OPEC and non-OPEC pact, not only by political tensions, Mazroui said.\n“We don’t look at the price in a day and say we are in a point where we need to do changes. We need to give the market time,” Mazroui, who holds the OPEC presidency, added.\n“I don’t think any fundamentals have changed for us to consider (a change in the output agreement) or panic... There is no need to rush and put assumptions (about) what are we going to do,” Mazroui told an industry conference.\nBrent crude futures traded 20 cents lower at $69.06 a barrel at 1129 GMT, after breaking above $70 on Thursday for the first time since December 2014. [O/R]\nMazroui said that draining the oil glut needed time to bring global oil inventories down to the industry’s five-year average.\n“There is no panic,” OPEC Secretary-General Mohammad Barkindo told reporters in Abu Dhabi when asked about oil prices at the $70 a barrel level.\nOman’s oil minister Mohammed bin Hamad al-Rumhi also said on Friday he was not concerned about the current rise in oil prices and that he expected prices to trade within a “healthy” range of $65 to $70 a barrel for a few weeks.\nAnalysts and traders have warned about the risk of a price correction since the start of 2018, but they say overall market conditions remain strong, mainly due to output cuts led by the Organization of the Petroleum Exporting Countries and Russia.\nIn addition to the OPEC and non-OPEC production cuts of 1.8 million barrels per day (bpd) that are due to last until the end of 2018, oil prices have found support from eight consecutive weeks of U.S. crude inventory drops.\nU.S. commercial crude stocks fell by almost 5 million barrels in the week to Jan. 5, to 419.5 million barrels. That was slightly below the five-year average of just over 420 million barrels, the target for OPEC and others cutting output.\nBut Fatih Birol, head of the International Energy Agency, warned on Friday that while oil prices at $65 to $70 per barrel are good for oil producers now, there is a risk that such a level would encourage more oversupply from U.S. shale drillers.\nBirol also said that there might be a further decline in oil production from OPEC member Venezuela in 2018 as its economic crisis hits output.\nReporting by Rania El Gamal, Maha El Dahan, Stanley Carvalho; editing by Jason Neely and Alexander Smith\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T22:04:00.000+02:00", "crawled": "2018-01-12T18:17:13.018+02:00", "highlightTitle": ""}