{"organizations": [], "uuid": "776d0b6adbca73a9acc554fb4e41d21d334f1e43", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/netherlands-gas-groningen/dutch-could-cut-groningen-gas-output-by-a-fifth-analysts-idUSL8N1PE4AC", "country": "US", "domain_rank": 408, "title": "Dutch could cut Groningen gas output by a fifth- analysts", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T17:57:00.000+02:00", "replies_count": 0, "uuid": "776d0b6adbca73a9acc554fb4e41d21d334f1e43"}, "author": "", "url": "https://www.reuters.com/article/netherlands-gas-groningen/dutch-could-cut-groningen-gas-output-by-a-fifth-analysts-idUSL8N1PE4AC", "ord_in_thread": 0, "title": "Dutch could cut Groningen gas output by a fifth- analysts", "locations": [], "entities": {"persons": [{"name": "bart h. meijer", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "netherlands", "sentiment": "none"}, {"name": "groningen", "sentiment": "none"}, {"name": "amsterdam", "sentiment": "none"}], "organizations": [{"name": "groningen", "sentiment": "negative"}, {"name": "royal dutch shell", "sentiment": "none"}, {"name": "gasunie", "sentiment": "none"}, {"name": "exxon mobil", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 3:58 PM / in 5 minutes Dutch could cut Groningen gas output by a fifth- analysts Reuters Staff \n* The Netherlands is most gas-reliant EU nation \n* Groningen gas output already 60 pct below 2013 peak \n* Government to cut production as much as possible \n* Falling export obligations ease demand pressure \nBy Bart H. Meijer \nAMSTERDAM, Jan 30 (Reuters) - The Netherlands can cut gas output from the Groningen field by roughly a fifth after this month’s tremors but it will need to fill some of the gap with increased imports to meet domestic needs and honour its export contracts, analysts say. \nGroningen’s output, now capped at 21.6 billion cubic metres (bcm), has been cut by 60 percent from its 2013 peak to prevent tremors in the area caused by the production process. But more cuts are now required after strong seismic activity this month. \nGas regulator SodM and gas transport company Gasunie will issue recommendations to the government on Thursday on the level of cuts needed at Groningen field, which is run by a venture of Royal Dutch Shell and Exxon Mobil. \n“Production could be lowered by a few billion cubic metres in the short run,” gas expert Rene Peters of Dutch research firm TNO told Reuters. “Production of at least 18 bcm per year looks needed to guarantee supply for now.” \nBMI Research analyst Richard Taylor said a cut of 18 bcm would be feasible but said deeper cuts were also possible. \n“We see a buffer of around 5 to 6 bcm which could potentially be used for lowering production”, Taylor said. “But we would expect the government to take more incremental steps.” \nAnalysts said the Netherlands would still need to fill at least some of the shortfall from a further production cut by increasing imports, which now stand at about 25 bcm a year. \nBut falling export obligations to buyers, which include Germany, Belgium and France, would relieve some pressure. \n“Export obligations shrink by around 2 bcm per year and the contracts will have expired completely by 2030,” Peters said. “That means we are only looking at a problem for the next five years in Groningen.” CONVERSION CAPACITY \nIn the meantime, the Netherlands can import more gas from Norway and Russia by pipeline or from further afield in the form of liquefied natural gas (LNG). \nImported gas needs to be adapted to match the specifications of low calorific Groningen gas in order to be used in the Netherlands, which depends on gas for 40 percent of its energy needs and is the most reliant on gas in the European Union. \nAlthough conversion facilities for imported gas are running near capacity, analysts said there was still enough room to fill the shortfall left by lower Groningen output. \nDutch Economy Minister Eric Wiebes, who faces rising political pressure to reduce seismic risks, said output would be cut “by as much as reasonably possible”, after the strongest tremor in decades hit villages on Jan. 8. \n“So far, gas prices have shown little reaction to the Groningen debate. This seems to imply that only a modest cut is expected,” ABN Amro analyst Hans van Cleef said. \nGasunie, which transports Groningen gas, previously put the minimum production needed to meet supply at 21 bcm. It is now reviewing its numbers after the government promised new cuts. \n“We are turning all the levers in our models to determine the level needed to guarantee supply, but is too early to give any indication of the outcome,” Gasunie spokesman Michiel Bal said. \nThe Netherlands aims to shut all production at Groningen in the coming decade in its shift away from fossil fuels. \nTo reduce gas demand, the government has proposed keeping new houses off the gas grid, and has told large industrial users that they will have to stop using low caloric gas by 2022. Reporting by Bart Meijer; Editing by Edmund Blair", "external_links": [], "published": "2018-01-30T17:57:00.000+02:00", "crawled": "2018-01-30T18:17:10.005+02:00", "highlightTitle": ""}