{"organizations": [], "uuid": "561eecf5d984804375720512761aa5449f4a5d68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-advanced-accelerator-applications-receives-us-fda-approval-for-lutatheraa-for-treatment-of-gastroenteropancreatic.html", "country": "US", "domain_rank": 767, "title": "Advanced Accelerator Applications Receives US FDA Approval for LUTATHERA® for Treatment of Gastroenteropancreatic Neuroendocrine Tumors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-26T20:00:00.000+02:00", "replies_count": 0, "uuid": "561eecf5d984804375720512761aa5449f4a5d68"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/globe-newswire-advanced-accelerator-applications-receives-us-fda-approval-for-lutatheraa-for-treatment-of-gastroenteropancreatic.html", "ord_in_thread": 0, "title": "Advanced Accelerator Applications Receives US FDA Approval for LUTATHERA® for Treatment of Gastroenteropancreatic Neuroendocrine Tumors", "locations": [], "entities": {"persons": [{"name": "lu", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "midgut", "sentiment": "none"}, {"name": "france", "sentiment": "none"}], "organizations": [{"name": "aaa", "sentiment": "none"}, {"name": "fda", "sentiment": "none"}, {"name": "us food and drug administration", "sentiment": "none"}, {"name": "nda", "sentiment": "none"}, {"name": "novartis", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "First-in-class Therapy Demonstrated 79% Improvement in Progression Free Survival in NETTER-1 Phase 3 Study in Midgut NET Patients\nLutathera (lutetium Lu 177 dotatate) vial picture\nPFS graphic\nLutathera (lutetium Lu 177 dotatate) mechanism of action picture\nLUTATHERA ® marks first FDA Approval for a Peptide Receptor Radionuclide Therapy (PRRT)\nSAINT-GENIS-POUILLY, France, Jan. 26, 2018 (GLOBE NEWSWIRE) -- Advanced Accelerator Applications S.A. (NASDAQ:AAAP) (AAA or the Company), a Novartis company and leader in nuclear medicine theragnostics, today announced that it has received US Food and Drug Administration (FDA) approval of its new drug application (NDA) for LUTATHERA ® (lutetium Lu 177 dotatate*) for the treatment of somatostatin receptor positive gastroenteropancreatic neuroendocrine tumors (GEP-NETs), including foregut, midgut, and hindgut neuroendocrine tumors in adults. LUTATHERA ® , which received orphan drug designation from the FDA, is a first-in-class drug and the first available FDA-approved Peptide Receptor Radionuclide Therapy (PRRT), a form of targeted treatment comprising a targeting molecule that carries a radioactive component.\nNETs are rare tumors originating in the neuroendocrine cells of numerous organs, including the gastrointestinal tract, pancreas and lung. Some patients develop symptoms arising from the excessive production of hormones by neuroendocrine tumor cells, while others remain clinically silent for years. The estimated incidence, or rate of new cases of NETs, in the United States is approximately 6.98/100,000 per year, while the estimated prevalence for 2014, based on the National Cancer Institute’s Surveillance, Epidemiology, and End Results (SEER) database, was 171,321. 1 Patient survival with advanced GEP-NETs depends on stage and histology. Patients with well- and moderately-differentiated tumors and distant metastases have a 5-year survival probability of 35%. 2\n“The approval of LUTATHERA ® marks an important achievement and innovation for the NET community,” said Susanne Schaffert, PhD, Chairperson and President of Advanced Accelerator Applications. “As the first PRRT ever approved in the US, LUTATHERA ® is introducing a major advancement in the treatment paradigm for these patients that we hope will improve many lives. We believe nuclear medicine has the potential to offer many benefits to cancer patients and will use this approval as a foundation for the development of additional targeted cancer treatments utilizing radiolabeled ligands.”\nStefano Buono, Advisor and former Chief Executive Officer of Advanced Accelerator Applications, stated, “The approval of LUTATHERA ® is the culmination of years of hard work and partnership with numerous physicians and patients. With this approval, AAA’s first theragnostic pairing, based on radiolabeling the same targeting molecule with either lutetium 177 or gallium 68, respectively for therapeutic or diagnostic purposes is complete. The theragnostic complement to LUTATHERA ® in the US is another first-in-class drug, NETSPOT ® (gallium Ga 68 dotatate) which was approved by the FDA for localization of NETs using Positron Emission Tomography (PET) in 2016.”\nThe approval of LUTATHERA ® is based on results of a randomized pivotal Phase 3 study, NETTER-1 that compared treatment using LUTATHERA ® plus best standard of care (octreotide LAR 30mg every four weeks) to 60 mg of octreotide LAR alone (also dosed every four weeks) in patients with inoperable midgut NETs progressing under standard dose octreotide LAR treatment and overexpressing somatostatin receptors, as well as a subset of efficacy and safety data from an international, single-institution, single-arm, open-label trial conducted by Erasmus Medical Center in Rotterdam, Netherlands in more than 1,200 patients with somatostatin receptor positive tumors.\nJonathan Strosberg, MD, Associate Professor, Section Head, Neuroendocrine Tumor Program at Moffitt Cancer Center, and NETTER-1 lead investigator, commented “There are very few effective treatment options for patients with inoperable, advanced GEP-NETs who are progressive on somatostatin analogues. As a medical oncologist seeing more than 500 patients with NETs each year, I am grateful to have another tool in my arsenal.”\nJosh Mailman, President of the Northern California Carcinoid / Neuroendocrine Community, noted, “The approval of LUTATHERA ® marks an exciting day for the NET community in the United States. Due to the rarity of NETs and the challenges that many face in obtaining a diagnosis, many patients are not diagnosed until their disease has become quite advanced and is much more difficult to manage. The approval of every new therapy offers hope to these patients and their families.”\nThe NETTER-1 study met its primary endpoint, showing a 79% reduction in risk of disease progression or death in the LUTATHERA ® arm compared to the 60 mg octreotide LAR arm (hazard ratio 0.21, 95% CI: 0.13-0.32; p<0.0001). 3 Median PFS was not reached in the LUTATHERA ® arm compared to 8.5 months for the 60 mg octreotide LAR arm. 3 A pre-planned interim overall survival analysis determined that LUTATHERA ® treatment lead to a 48% reduction in the estimated risk of death (hazard ratio 0.52, 95% CI: 0.32-0.84) compared to treatment with 60 mg octreotide LAR. 3 The objective response rate, composed of complete and partial responses, was 13% for the LUTATHERA ® arm compared to 4% in the Octreotide LAR 60mg arm (p<0.0148). 3\nThe most common Grade 3-4 adverse reactions occurring with a greater frequency among patients in the NETTER-1 study receiving LUTATHERA ® with octreotide compared to patients receiving high-dose octreotide include: lymphopenia (44%), increased gamma-glutamyl transferase (20%), vomiting (7%), nausea and elevated aspartate aminotransferase (5% each), and increased alanine aminotransferase, hyperglycemia and hypokalemia (4% each). 3\nAbout LUTATHERA ® (lutetium Lu 177 dotatate) and How it Works\nLUTATHERA ® is a lutetium Lu 177-labeled somatostatin analog peptide. This first-in-class drug belongs to a class of treatments called Peptide Receptor Radionuclide Therapy (PRRT). PRRT is a form of targeted treatment comprised of a targeting molecule which carries a radioactive component. Once administered through infusion drip into the bloodstream, the targeting molecule binds to a specific receptor on tumor cells, and is then internalized into the target cells, where the radioactive component destroys the tumor cells from within. LUTATHERA ® has received orphan drug designation from the FDA and the European Medicines Agency (EMA). LUTATHERA ® has been administered to more than 2,000 patients on a compassionate use and named patient basis for the treatment of NETs and other tumors over-expressing somatostatin receptors in 10 European countries and in the US under an Expanded Access Program (EAP).\n* USAN: lutetium Lu 177 dotatate/INN: lutetium ( 177 Lu) oxodotreotide\nReferences\n1 Dasari A, et al. Trends in the incidence, prevalence, and survival outcomes in patients with neuroendocrine tumors in the United States. JAMA Oncol . 2017; 3(10):1335-1342.\n2 Yao JC, et al. One hundred years after “carcinoid”: epidemiology of and prognostic factors for neuroendocrine tumors in 35,825 cases in the United States. J Clin Oncol . 2008;26:3063–3072.\n3 LUTATHERA ® [prescribing information]. Millburn, NJ: Advanced Accelerator Applications USA, Inc.; January 2018. http://www.adacap.com/wp-content/uploads/2018/01/Lutathera_lutetium_Lu_-177_dotatate_PI_2018_01.pdf\nLUTATHERA ® ( lutetium Lu 177 dotatate) Important Safety Information 3\n1. INDICATION\nLUTATHERA ® is indicated for the treatment of somatostatin receptor positive gastroenteropancreatic neuroendocrine tumors (GEP-NETs), including foregut, midgut and hindgut neuroendocrine tumors in adults.\n2. WARNINGS AND PRECAUTIONS\nRadiation exposure: Treatment with LUTATHERA ® contributes to a patient’s overall long-term cumulative radiation exposure and is associated with an increased risk for cancer. Radiation can be detected in the urine for up to 30 days following LUTATHERA ® administration. Minimize radiation exposure to patients, medical personnel, and household contacts during and after treatment with LUTATHERA ® consistent with institutional good radiation safety practices and patient management procedures. Myelosuppression: Hematological adverse reactions occurred more frequently in patients receiving LUTATHERA in clinical trials (all grades/grade 3 or 4): anemia (81%/0), thrombocytopenia (53%/1%), and neutropenia (26%/3%). Blood cell counts must be monitored prior to, during, and after treatment. Dose modification or cessation of treatment may be necessary. Secondary Myelodysplastic Syndrome and Leukemia: With a median follow-up time of 24 months, myelodysplastic syndrome (MDS) was reported in 2.7% of patients receiving LUTATHERA ® with long-acting octreotide compared to no patients receiving high-dose long-acting octreotide. In a Phase I/II clinical study, 15 patients (1.8%) developed MDS and 4 (0.5%) developed acute leukemia. The median time to the development of MDS was 28 months (9 to 41 months) for MDS and 55 months (32 to 155 months) for acute leukemia. Renal toxicity: Treatment with LUTATHERA ® will expose kidneys to radiation, which may impair renal function. In a Phase I/II clinical trial <1% of patients developed renal failure 3 to 36 months following LUTATHERA ® . Monitor serum creatinine and creatinine clearance to assess changes in renal function. A concomitant intravenous infusion of amino acids during LUTATHERA ® administration is mandatory for renal protection. Patients with baseline renal impairment may be at greater risk of toxicity. Perform more frequent assessments of renal function in patients with mild or moderate impairment. Withhold, reduce dose, or permanently discontinue based on severity of reaction. Hepatotoxicity: In LUTATHERA ® clinical trials, <1% of patients were reported to have hepatic tumor hemorrhage, edema, or necrosis, with one patient experiencing intrahepatic congestion and cholestasis. Patients with hepatic metastasis may be at increased risk of hepatotoxicity due to radiation exposure. Monitor transaminases, bilirubin, and serum albumin during treatment. Withhold, reduce dose, or permanently discontinue based on severity of reaction. Neuroendocrine hormonal crises , manifesting with flushing, diarrhea, bronchospasm and hypotension, occurred in 1% of patients and typically occurred during or within 24 hours following the initial LUTATHERA ® dose. Monitor patients for flushing, diarrhea, hypotension, bronchoconstriction or other signs and symptoms of tumor-related hormonal release. Administer intravenous somatostatin analogs, fluids, corticosteroids, and electrolytes as indicated. Embryo-Fetal Toxicity: LUTATHERA ® can cause fetal harm. Advise females and males of reproductive potential of the potential risk to a fetus. Advise females and males of reproductive potential to use effective contraception during treatment and after. Verify pregnancy status of females of reproductive potential prior to initiating LUTATHERA ® . Risk of Infertility: Radiation absorbed by testis and ovaries from the recommended cumulative LUTATHERA ® dose falls within the range in which temporary or permanent infertility can be expected following external beam radiotherapy.\n3. ADVERSE REACTIONS\nThe most common Grade 3-4 adverse reactions observed in LUTATHERA ® clinical trials were lymphopenia (44%), increased GGT (20%), vomiting (7%), nausea (5%), elevated AST (5%), increased ALT (4%), hyperglycemia (4%), and hypokalemia (4%).\nThe following serious adverse reactions have been observed with a median follow-up time of more than 4 years after treatment with LUTATHERA ® : myelodysplastic syndrome (2%), acute leukemia (1%), renal failure (2%), hypotension (1%), cardiac failure (2%), myocardial infarction (1%), and neuroendocrine hormonal crisis (1%). Patients should be counseled and monitored in accordance with the LUTATHERA ® Prescribing Information.\n4. DRUG INTERACTIONS\nSomatostatin and its analogs competitively bind to somatostatin receptors and may interfere with the efficacy of LUTATHERA ® . Discontinue long-acting somatostatin analogs at least 4 weeks and short-acting octreotide at least 24 hours prior to each LUTATHERA ® dose. Administer short- and long-acting octreotide during LUTATHERA ® treatment as recommended.\nPlease see full Prescribing Information at: http://www.adacap.com/wp-content/uploads/2018/01/Lutathera_lutetium_Lu_-177_dotatate_PI_2018_01.pdf\nTo report SUSPECTED ADVERSE REACTIONS, contact Advanced Accelerator Applications USA, Inc. at 1-844-863-1930, or us-pharmacovigilance@adacap.com , or FDA at 1-800-FDA-1088 or www.fda.gov/medwatch .\nAbout Advanced Accelerator Applications S.A.\nAdvanced Accelerator Applications (NASDAQ:AAAP), a Novartis company, is an innovative radiopharmaceutical company developing, producing and commercializing molecular nuclear medicine theragnostics. AAA’s theragnostic platform is based on radiolabeling a targeting molecule with either gallium Ga 68 for diagnostic use, or lutetium Lu 177 for therapy. AAA’s first theragnostic pairing for neuroendocrine tumors includes diagnostic drugs NETSPOT ® in the US and SomaKit TOC™ in Europe; and therapeutic LUTATHERA ® (USAN: lutetium Lu 177 dotatate/INN: lutetium ( 177 Lu) oxodotreotide). Additional theragnostics in development target gastrointestinal stromal tumors (GIST), and prostate and breast cancer. AAA is also an established leader in molecular nuclear diagnostic radiopharmaceuticals for PET and SPECT, mainly used in clinical oncology, cardiology and neurology. Headquartered in Saint-Genis-Pouilly, France, AAA currently has 20 production and R&D facilities, and more than 600 employees in 13 countries (France, Italy, the UK, Germany, Switzerland, Spain, Poland, Portugal, The Netherlands, Belgium, Israel, the US and Canada). AAA reported sales of €109.3 million in 2016 (+23% vs. 2015) and €106.4 million for the first 9 months of 2017 (+31% vs. first 9 months of 2016). AAA is listed on the Nasdaq Global Select Market under the ticker “AAAP”. For more information, please visit: www.adacap.com .\nDisclaimer\nThis press release contains forward-looking statements within the meaning of the United States Private Securities Litigation Reform Act of 1995. Forward-looking statements can generally be identified by words such as “potential,” “can,” “will,” “plan,” “expect,” “anticipate,” “look forward,” “believe,” “committed,” “investigational,” “pipeline,” “launch,” or similar terms, or by express or implied discussions regarding marketing approvals or labeling for the products described in this press release, or regarding potential future revenues from such products. You should not place undue reliance on these statements. Such forward-looking statements are based on our current beliefs and expectations regarding future events, and are subject to significant known and unknown risks and uncertainties. Should one or more of these risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially from those set forth in the forward-looking statements. There can be no guarantee that the products described in this press release will be commercially successful in the future. In particular, our expectations regarding such products could be affected by, among other things, the uncertainties inherent in research and development, including clinical trial results and additional analysis of existing clinical data; regulatory actions or delays or government regulation generally; our ability to obtain or maintain proprietary intellectual property protection; the particular prescribing preferences of physicians and patients; global trends toward health care cost containment, including government, payor and general public pricing and reimbursement pressures; general economic and industry conditions, including the effects of the persistently weak economic and financial environment in many countries; safety, quality or manufacturing issues, and other risks and factors referred to in Novartis AG’s current Form 20-F on file with the US Securities and Exchange Commission. Novartis is providing the information in this press release as of this date and does not undertake any obligation to update any forward-looking statements contained in this press release as a result of new information, future events or otherwise.\nContacts:\nAAA Corporate Communications\nRachel Levine\nDirector of Communications\nrachel.levine@adacap.com\nTel: + 1-212-235-2395\nAAA Investor Relations\nJordan Silverstein\nHead of Investor Relations\njordan.silverstein@adacap.com\nTel: + 1-212-235-2394\nPhotos accompanying this announcement are available at\nhttp://www.globenewswire.com/NewsRoom/AttachmentNg/c0e0ed62-0e8e-4202-a78a-a65d05ad37a7\nhttp://www.globenewswire.com/NewsRoom/AttachmentNg/58409115-f75f-40b7-9e6c-244f08a21a22\nhttp://www.globenewswire.com/NewsRoom/AttachmentNg/3110e28f-fd8c-438d-9ae5-378c3e162813\nA video accompanying this announcement is available at\nhttp://www.globenewswire.com/NewsRoom/AttachmentNg/c0e0ed62-0e8e-4202-a78a-a65d05ad37a7\nPDFs accompanying this announcement is available at\nhttp://resource.globenewswire.com/Resource/Download/2e3a48a4-0314-4b33-8f27-22690cdd62e2\nhttp://resource.globenewswire.com/Resource/Download/5d09b5af-da50-47ec-84aa-1312386a7af2\nSource:Advanced Accelerator Applications", "external_links": ["https://www.globenewswire.com/Tracker?data=Ayfv6XBfYY7D5RYUpy66L-lXvdhzptXWniNPiKENAe4v8AOcM_jk2UfZYfm3Og34KVvjzbRAG5-HRxLWd0QwX7j3RTYqUYZCaYyevcceeeiVQbbVDt6Z3W_SyCNFx4coKZJoII2KyDV80ck-GsHrpw25FygzkXLh1uEzHJXSTietJ-LEdC_V02vbTexvKfsnx3L5NPtnHo8caAncVfEWDUcYvZURRXNJiLDAPy08xY2X2i7pmNJj_DEvx9EnpAM4fmonbf1h4d5tp4_9GZE2dA==", "https://www.globenewswire.com/Tracker?data=W-YeyURVhP0USUHLomKEhVtuPMVs_atJ90u2Go7w1Sk5cSBVzTebzZOwkdvpo2yICJIorVNKPbr5GiA54BpSUIiKUa4Ns82gP-LSsfkVTLk=", "https://www.globenewswire.com/Tracker?data=Ayfv6XBfYY7D5RYUpy66L0t770cLQG1HtUgO0bH2BrwdWKwAcTT1hY0rKEsiSnfX2vl4gwRYV_uzrvFQNElLqI6OJUMIdeyVjPzL-dnobU1kuLF9OTO5alaqAX6zSjitljdGZz0D1J-wclzFWyCA3poBUmCMI3edNfcRxfsWTl0EZ06dAuHIM71JnVTzhCxKpSIyRRczQ42KYMaEWtKUuTVKQ8wOX5qJBjuysXz8rynx7xsMPDYZPTHoDFL2wABCIKt7ihKH5CY0qxAoSW6VhA==", "http://www.globenewswire.com/NewsRoom/AttachmentNg/58409115-f75f-40b7-9e6c-244f08a21a22", "https://www.globenewswire.com/Tracker?data=Ayfv6XBfYY7D5RYUpy66L0t770cLQG1HtUgO0bH2BrwdWKwAcTT1hY0rKEsiSnfXgucFxITHvdLju-rPc1VOB_65yvrGY3txsUzRetkyNHRkoyIx_KBjiYqkhCTQ4f9LsJWNXtA5Gw659dz0jRCmtvzOGnlpFbV6jmmMTG8lrzT9ClVwxMSIbR1Nrfk3AGRX4qZwLhEvtQxGuEe4hIVg3hDb56hrkW_NumKt_eFdzTePesuREzh1_sK_VCi0L04_vpZM3Nb0smGlh5aXa3AxPw==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/5090d574-4b03-4d09-89e5-c8da6b630c18", "https://www.globenewswire.com/Tracker?data=Ayfv6XBfYY7D5RYUpy66L68jo4zYCJBMU1vAVxRnehHyvjLnCeAntRndikmZw8KqzEgbfZ6KDeOGlUJjfOy4FKTf90nCRQu6PJwr7-oqFlJng3fzZcK0ErMU-M8iobKkwOl5iWqcX1P-0lkhrTg-Tq5FZIlTViK9CQxF2PRn0s5oL1a3rDHYLYI71LkysgX0dbVGPFwh2cjE_84J2jhWEXJ4Gg-GqQM7vamAdlrYKM9fuv_J_0keXnyvS84ZSSyZxNip6n_zW-v6VaSUUFTAQ9Zd81uZUpDyy3Vk50oqbwI=", "https://www.globenewswire.com/Tracker?data=c15V-8_sai_BCU5rKmL9z7gDK5kntQbK_JMXz4SGH6M4qLjU4KmWXg2znvSegtGseIMugiQguopY9uIUrIEqdw==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/ef71ecaf-cc9b-4a20-9239-131e2a145a0b/en", "http://resource.globenewswire.com/Resource/Download/2e3a48a4-0314-4b33-8f27-22690cdd62e2", "https://www.globenewswire.com/Tracker?data=Ayfv6XBfYY7D5RYUpy66L68jo4zYCJBMU1vAVxRnehHyvjLnCeAntRndikmZw8KqzEgbfZ6KDeOGlUJjfOy4FKTf90nCRQu6PJwr7-oqFlJng3fzZcK0ErMU-M8iobKkF8B66XytHedSKEVb1wqlXRkBbQPsaAGCUpuN_-DJwtHLtLODJ8CqYx4wTtDvaUfVIzeUq5eaiyLZx-kUWFUuwCiHgPv-P6nG871R46Gbz-VVCmQK4nqxbEfYoZePhwjDoc04rc21JtgS1AAK-c_HANIYIjFI1a_629oK8v6mbjk=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/58409115-f75f-40b7-9e6c-244f08a21a22/en", "https://www.globenewswire.com/Tracker?data=Ayfv6XBfYY7D5RYUpy66L-lXvdhzptXWniNPiKENAe4v8AOcM_jk2UfZYfm3Og34DJUN-nAWtjcWzdqguVFfTlz9MtPacadJKn33v2xPdWBRRBavybBJVwYhWWlykbZ9yo3snBuHL_eObulYJB7tSUBkrgeRf7foy96hY4q82mE48MizVly9R-ndx19dTbmbTG-7rXJKLYXdR3tAvPVD9JdNM7BUtxB2RIGuR5dR1_aLSL0bfW1VrTR2uEzpad_JwM0fOC7uOHMzgxEoolR2sg==", "http://www.globenewswire.com/NewsRoom/AttachmentNg/c0e0ed62-0e8e-4202-a78a-a65d05ad37a7", "http://www.adacap.com/wp-content/uploads/2018/01/Lutathera_lutetium_Lu_-177_dotatate_PI_2018_01.pdf", "https://www.globenewswire.com/NewsRoom/AttachmentNg/3110e28f-fd8c-438d-9ae5-378c3e162813/en", "http://www.globenewswire.com/NewsRoom/AttachmentNg/3110e28f-fd8c-438d-9ae5-378c3e162813", "http://resource.globenewswire.com/Resource/Download/5d09b5af-da50-47ec-84aa-1312386a7af2", "https://www.globenewswire.com/Tracker?data=Ayfv6XBfYY7D5RYUpy66L0t770cLQG1HtUgO0bH2BrwdWKwAcTT1hY0rKEsiSnfXPo7FGKMJKPb5uNbyKYtlB9bBdtiJJ5b1OyoX8qbWDCGul7vDfgvkjMiVCCaACvCL3NZcx-wvbzJI1a6EVe2tMIBGntK9CH9Vzl5GJoRe_ZyDjsNFsavdEfAIFpy-EaQZHYZak3vp-TPk_JGfMl-aFobl46d91HSCNUNQTsneq2ZOliMyCDLfOX9N-FiX_C5VkgJLyiGocqKB6FPtODauYQ==", "https://www.globenewswire.com/Tracker?data=n5bAJRH26RRO-7KK0m6zxWPFx9WNMCv2y-E6XRB8t2feYiOFFfI3rjsI4C6pivY_Jwt87m_mJZAfkHlMLs3MNRXkobeBmzQ5JpXaZ8CDmkHQ7eAipM3dDqDhoGzHKczi", "http://www.fda.gov/medwatch", "https://www.globenewswire.com/Tracker?data=Ayfv6XBfYY7D5RYUpy66L0t770cLQG1HtUgO0bH2BrwdWKwAcTT1hY0rKEsiSnfXgucFxITHvdLju-rPc1VOB_65yvrGY3txsUzRetkyNHRkoyIx_KBjiYqkhCTQ4f9Li5UToVu-jC8T7KYIT5gsxqvUtFHLpIvRQZoh1vSkb9X2p5lK-bbTZi2f9foeKvZrdqdhSw0MooDRGvd_YexM-z1zQqLU1mABjLzAGijEcgQzQrZyjhgTHzLIWVjtElN8Qnmp2gwvJ74ftMKPSvVFLg=="], "published": "2018-01-26T20:00:00.000+02:00", "crawled": "2018-01-26T20:03:12.000+02:00", "highlightTitle": ""}