{"organizations": [], "uuid": "34547153647e2f630003dd599b3f7148d5c9d684", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-htg-announces-preliminary-fourth-quarter-and-full-year-2017-unaudited-financial-resultsaand-provides-initial-2018-revenue.html", "country": "US", "domain_rank": 767, "title": "HTG Announces Preliminary Fourth Quarter and Full Year 2017 Unaudited Financial Results and Provides Initial 2018 Revenue Guidance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.985, "site_type": "news", "published": "2018-01-04T16:00:00.000+02:00", "replies_count": 0, "uuid": "34547153647e2f630003dd599b3f7148d5c9d684"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-htg-announces-preliminary-fourth-quarter-and-full-year-2017-unaudited-financial-resultsaand-provides-initial-2018-revenue.html", "ord_in_thread": 0, "title": "HTG Announces Preliminary Fourth Quarter and Full Year 2017 Unaudited Financial Results and Provides Initial 2018 Revenue Guidance", "locations": [], "entities": {"persons": [], "locations": [{"name": "tucson", "sentiment": "none"}, {"name": "ariz.", "sentiment": "none"}], "organizations": [{"name": "htg molecular diagnostics , inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fourth quarter 2017 revenue expected to be between $6.9 and $7.2 million\nFull year 2017 revenue expected to be between $13.8 and $14.1 million\nInitial full year 2018 revenue guidance of $20.0 to $25.0 million\nTUCSON, Ariz., Jan. 04, 2018 (GLOBE NEWSWIRE) -- HTG Molecular Diagnostics , Inc. (NASDAQ:HTGM) (HTG), a provider of instruments, reagents and services for molecular profiling applications, today announced preliminary and unaudited financial results for the fourth quarter and full year ended December 31, 2017, and provided initial full year 2018 revenue guidance.\nPreliminary 4th Quarter and Full Year 2017 Unaudited Financial Results and Revenue Guidance for 2018:\nTotal revenue for the fourth quarter of 2017 is expected to be between $6.9 and $7.2 million, an increase of 373% to 394% over the fourth quarter of 2016. Total revenue for the full year 2017 is expected to be between $13.8 and $14.1 million, an increase of 169% to 175% over total revenue for the full year 2016. Collaboration revenue drove fourth quarter and full year 2017 revenue. Operating expenses for the fourth quarter are expected to be slightly higher than operating expenses in the third quarter of 2017 on an absolute dollar basis. Gross margin and net loss in the fourth quarter are expected to be improved over the third quarter of 2017, primarily as a result of collaboration profit-sharing revenue expected to be recognized in the fourth quarter. Cash and cash equivalents are expected to be approximately $10.0 million as of December 31, 2017. HTG is providing initial revenue guidance for the year ending December 31, 2018 in the range of $20.0 to $25.0 million.\n“Our strategy of developing high value diagnostic tests through our collaborations with Qiagen and top-tier biopharmaceutical companies is a primary reason for the strong revenue growth we saw in 2017, and helped propel us to a strong year end,” said TJ Johnson, President and CEO of HTG. “We expect this momentum to continue and believe our clinical and pre‑clinical collaborations, along with our independent development programs, will support continued revenue growth in 2018.”\nThe preliminary results set forth above are based on management's initial review of the Company’s operations for the quarter and year ended December 31, 2017 and are subject to revision based upon the Company’s year-end closing procedures and the completion and external audit of the Company’s year-end financial statements. Actual results may differ materially from these preliminary results as a result of the completion of year-end closing procedures, final adjustments and other developments arising between now and the time that the Company’s financial results are finalized, and such changes could be material. In addition, these preliminary results are not a comprehensive statement of the Company’s financial results for the fourth quarter or full year ended December 31, 2017, should not be viewed as a substitute for full, audited financial statements prepared in accordance with generally accepted accounting principles, and are not necessarily indicative of the Company’s results for any future period. The Company expects to announce full 2017 financial results in advance of its quarterly conference call, currently planned for Thursday, March 22, 2018.\nAbout HTG:\nHeadquartered in Tucson, Arizona, the mission of HTG is to empower precision medicine at the local level. The company’s HTG EdgeSeq technology, which automates highly multiplexed molecular profiling of small samples for next-generation sequencing, received its first US patent in 2014. Continuous improvements led to the 2017 launch of HTG’s new direct-target sequencing chemistry for DNA analysis offered in the company’s VERI/O services laboratory. Additional information is available at www.htgmolecular.com .\nSafe Harbor Statement:\nStatements contained in this press release regarding matters that are not historical facts are “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995, including statements regarding our revenue expectations, including collaboration profit-sharing revenue expected to be recognized in the fourth quarter of 2017, and other expected financial results as of and for the fourth quarter and year ended December 31, 2017, our initial revenue guidance for the year ending December 31, 2018 and the expected benefits of our collaborations to our future revenues. Words such as “believes,” “anticipates,” “plans,” “expects,” “intends,” “will,” “goal,” “potential” and similar expressions are intended to identify forward-looking statements, although not all forward-looking statements necessarily contain these identifying words. These forward-looking statements are based upon management’s current expectations, are subject to known and unknown risks, and involve assumptions that may never materialize or may prove to be incorrect. Actual results and the timing of events could differ materially from those anticipated in such forward-looking statements as a result of various risks and uncertainties, including, without limitation, the risk that we may not realize the benefits expected under our collaboration agreements with Qiagen or other biopharmaceutical companies; the risk that our actual revenue or other financial results for the fourth quarter and/or full year 2017, including collaboration profit-sharing revenue, may differ materially from our estimated results for these periods as a result of the completion of year-end closing procedures, final adjustments, final profit-sharing reconciliation with Qiagen, or other developments arising between now and the time that our financial results are finalized; the risk that we may not achieve our revenue expectations for 2018 (including, without limitation, due to variations from our expectations in the amount or timing of work we perform under one or more companion diagnostic development programs with large pharma customers, which development programs comprise an increasing portion of our business and therefore have the ability to significantly impact the timing and amount of revenue recognized in one or more fiscal periods); risks associated with our ability to successfully commercialize our products; the risk that our products and services may not be adopted by biopharmaceutical companies or other customers as anticipated, or at all; our ability to manufacture our products to meet demand; the level and availability of first party payor reimbursement for our products; our ability to effectively manage our anticipated growth; our ability to protect our intellectual property rights and proprietary technologies; our ability to operate our business without infringing the intellectual property rights and proprietary technology of first parties; competition in our industry; our ability to attract and retain qualified personnel; and product liability claims. These and other factors are described in greater detail in our filings with the Securities and Exchange Commission, including without limitation our Quarterly Report on Form 10-Q for the quarter ended September 30, 2017. All forward-looking ", "external_links": ["https://www.globenewswire.com/Tracker?data=Y8vJRIrqDEhGbX_1-PMBC0ruq5H26iO4t9r9Hzl7kOzaHgfrO_lH370Lyqy_er6tRL46B-P1Dko-u5qYJRIVR52jiY0uztOwTVeua-o9A38=", "https://www.globenewswire.com/Tracker?data=l2_dlFGhQ-XzMd3mfIvzEJzPjEcKa1ZuZH_3o4jnT_2lkhEipqjly20-5AHNNV-cVTTtaUbnRJoDsFzYEfFwoSw20aVuAGRXooTMz3FXVpk=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/2ab311fb-aa9c-4505-adce-ed9ce3bb6490"], "published": "2018-01-04T16:00:00.000+02:00", "crawled": "2018-01-04T16:41:57.000+02:00", "highlightTitle": ""}