{"organizations": [], "uuid": "f5ad124721587a4de08c1a41aae9ab09ad7f2199", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-bank-of-montreal-announces-specific-share-repurchase-program-as-part-of-its-normal-course-issuer-bid.html", "country": "US", "domain_rank": 767, "title": "Bank of Montreal Announces Specific Share Repurchase Program as Part of its Normal Course Issuer Bid", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T01:30:00.000+02:00", "replies_count": 0, "uuid": "f5ad124721587a4de08c1a41aae9ab09ad7f2199"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-bank-of-montreal-announces-specific-share-repurchase-program-as-part-of-its-normal-course-issuer-bid.html", "ord_in_thread": 0, "title": "Bank of Montreal Announces Specific Share Repurchase Program as Part of its Normal Course Issuer Bid", "locations": [], "entities": {"persons": [], "locations": [{"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "bank of montreal", "sentiment": "negative"}, {"name": "bank of montreal announces specific share repurchase program", "sentiment": "negative"}, {"name": "bmo", "sentiment": "none"}, {"name": "ontario securities commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO, Jan. 5, 2018 /PRNewswire/ - Bank of Montreal (\"BMO\") (TSX:BMO)(NYSE:BMO) today announced that it will purchase common shares under a specific share repurchase program (the \"Program\"). BMO will enter into an agreement (the \"Agreement\") with a third party to repurchase common shares through daily purchases that will take place between January 10, 2018, and February 2, 2018, subject to a maximum of 3,000,000 common shares. The Program will form part of BMO's Normal Course Issuer Bid for up to 15,000,000 common shares (the \"NCIB\") announced on April 27, 2017.\nPursuant to the terms of the Agreement and subject to the terms of an issuer bid exemption order issued by the Ontario Securities Commission (the \"Order\"), the third party will purchase BMO's common shares on Canadian markets for the purpose of fulfilling its delivery obligations to BMO under the Agreement. The price that BMO will pay for common shares purchased by it from the third party under such Agreement will be negotiated by BMO and the third party and will be at a discount to the prevailing market price of BMO's common shares on the Canadian markets at the time of the purchase. BMO currently intends to purchase the maximum of 3,000,000 common shares under the Program, however the number of common shares purchased pursuant to the Program may be less than the Program maximum if, among other things, it is not possible to purchase common shares within the price range established prior to commencement of the Program, if trading is suspended, or as a result of market factors. In accordance with the terms of the Order, immediately following the completion of the Program, BMO will issue a news release providing information regarding the purchases made pursuant to the Program including the number of common shares purchased and aggregate purchase price paid.\nPursuant to the terms of the Agreement and the Order, all purchases made by the third party or its agents on the TSX and other Canadian markets pursuant to the Program will be made in accordance with the TSX rules applicable to the NCIB, subject to limited exceptions as provided in the Order. BMO will acquire common shares from the third party pursuant to the Agreement as part of the NCIB and such common shares will be cancelled upon purchase by BMO.\nCaution Regarding Forward-Looking Statements\nBank of Montreal's public communications often include written or oral forward-looking statements. Statements of this type are included in this document, and may be included in other filings with Canadian securities regulators or the U.S. Securities and Exchange Commission, or in other communications. All such statements are made pursuant to the \"safe harbor\" provisions of, and are intended to be forward-looking statements under, the United States Private Securities Litigation Reform Act of 1995 and any applicable Canadian securities legislation. Forward-looking statements may involve, but are not limited to, comments with respect to our objectives and priorities for fiscal 2018 and beyond, our strategies or future actions, our targets, expectations for our financial condition or share price, and the results of or outlook for our operations or for the Canadian, U.S. and international economies.\nBy their nature, forward-looking statements require us to make assumptions and are subject to inherent risks and uncertainties. There is significant risk that predictions, forecasts, conclusions or projections will not prove to be accurate, that our assumptions may not be correct and that actual results may differ materially from such predictions, forecasts, conclusions or projections. We caution readers of this document not to place undue reliance on our forward-looking statements as a number of factors could cause actual future results, conditions, actions or events to differ materially from the targets, expectations, estimates or intentions expressed in the forward-looking statements.\nThe future outcomes that relate to forward-looking statements may be influenced by many factors, including but not limited to: general economic and market conditions in the countries in which we operate; weak, volatile or illiquid capital and/or credit markets; interest rate and currency value fluctuations; changes in monetary, fiscal, or economic policy and tax legislation and interpretation; the level of competition in the geographic and business areas in which we operate; changes in laws or in supervisory expectations or requirements, including capital, interest rate and liquidity requirements and guidance, and the effect of such changes on funding costs; judicial or regulatory proceedings; the accuracy and completeness of the information we obtain with respect to our customers and counterparties; our ability to execute our strategic plans and to complete and integrate acquisitions, including obtaining regulatory approvals; critical accounting estimates and the effect of changes to accounting standards, rules and interpretations on these estimates; operational and infrastructure risks; changes to our credit ratings; political conditions, including changes relating to or affecting economic or trade matters; global capital markets activities; the possible effects on our business of war or terrorist activities; outbreaks of disease or illness that affect local, national or international economies; natural disasters and disruptions to public infrastructure, such as transportation, communications, power or water supply; technological changes; information and cyber security; and our ability to anticipate and effectively manage risks arising from all of the foregoing factors.\nWe caution that the foregoing list is not exhaustive of all possible factors. Other factors and risks could adversely affect our results. For more information, please see the discussion in the Risks That May Affect Future Results section on page 79, and the sections related to credit and counterparty, market, insurance, liquidity and funding, operational, model, legal and regulatory, business, strategic, environmental and social, and reputation risk, which begin on page 86, of BMO's 2017 Annual MD&A and outline certain key factors and risks that may affect Bank of Montreal's future results. Investors and others should carefully consider these factors and risks, as well as other uncertainties and potential events, and the inherent uncertainty of forward-looking statements. Bank of Montreal does not undertake to update any forward-looking statements, whether written or oral, that may be made from time to time by the organization or on its behalf, except as required by law. The forward-looking information contained in this document is presented for the purpose of assisting our shareholders in understanding our financial position as at and for the periods ended on the dates presented, as well as our strategic priorities and objectives, and may not be appropriate for other purposes.\nAssumptions about the performance of the Canadian and U.S. economies, as well as overall market conditions, and their combined effect on our business, are material factors we cons", "external_links": [], "published": "2018-01-06T01:30:00.000+02:00", "crawled": "2018-01-06T00:56:02.023+02:00", "highlightTitle": ""}