{"organizations": [], "uuid": "a2250a940b4bb4c4fd0f42b55bf5d4c5f806c254", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-sight-sciences-expands-surgical-portfolio-with-fda-clearance-of-the-omnia-surgical-system.html", "country": "US", "domain_rank": 767, "title": "Sight Sciences Expands Surgical Portfolio with FDA Clearance of the OMNI™ Surgical System", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.042, "site_type": "news", "published": "2018-01-04T18:45:00.000+02:00", "replies_count": 0, "uuid": "a2250a940b4bb4c4fd0f42b55bf5d4c5f806c254"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-sight-sciences-expands-surgical-portfolio-with-fda-clearance-of-the-omnia-surgical-system.html", "ord_in_thread": 0, "title": "Sight Sciences Expands Surgical Portfolio with FDA Clearance of the OMNI™ Surgical System", "locations": [], "entities": {"persons": [], "locations": [{"name": "menlo park", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "fda", "sentiment": "negative"}, {"name": "omni", "sentiment": "negative"}, {"name": "sight sciences, inc.", "sentiment": "neutral"}, {"name": "omni system", "sentiment": "none"}, {"name": "cpt", "sentiment": "none"}, {"name": "u.s. food and drug administration", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MENLO PARK, Calif., Jan. 4, 2018 /PRNewswire/ -- Sight Sciences, Inc., a venture-backed, commercial stage ophthalmic device company, today announced U.S. Food and Drug Administration (FDA) 510(k) clearance for its OMNI™ Surgical System, a surgical tool dually indicated for the delivery of controlled volumes of viscoelastic fluid as well as the cutting of trabecular meshwork tissue. In addition, the company announced three key hires who possess proven leadership capabilities and industry experience to advance the commercial strategy and build out its senior leadership team.\nThe OMNI System is a next-generation technology that combines two distinct functions into one device: (1) controlled viscoelastic delivery anywhere within the anterior segment, including in up to 360 degrees of Schlemm's canal; and (2) controlled, customizable trabeculotomy. Each of these canal procedures is sufficiently established to have its own Category 1 CPT code, and the OMNI System can be used on a standalone basis or in conjunction with cataract surgery.\n\"The OMNI System is uniquely designed to target both sources of resistance in the conventional outflow pathway with a single integrated device,\" said Nathan Radcliffe, MD, Microincisional Surgery Center of Excellence of New York Eye and Ear Infirmary. \"It offers a new, sophisticated solution for two well-established procedures, canaloplasty and trabeculotomy. It will be a welcome and exciting addition to my surgical armamentarium.\"\n\"This is a major milestone for Sight Sciences and further expands our portfolio of solutions for ophthalmologists performing angle surgery,\" said Shawn O'Neil, Sr. Vice President of Sales and Marketing at Sight Sciences. \"Our R&D team designed the OMNI System based on feedback from our customers, and we are excited to bring this innovative, multi-procedure technology to the surgical glaucoma market.\"\nSight Sciences also announced three key hires who have joined O'Neil to establish the company's commercial leadership team. Patrick Smale joined as Vice President of Marketing, Surgical Glaucoma, Jeff Francis joined as Vice President of Sales, Surgical Glaucoma and Todd Love joined as Vice President of Marketing, Dry Eye. The commercial leadership team has already started hiring marketing talent and sales professionals to build out and execute the company's commercial strategy.\nPatrick Smale will lead the marketing program for Sight Sciences' surgical portfolio, which includes the OMNI System. Most recently, Smale was Global Product Director, Surgical Glaucoma at Alcon Laboratories, a global leader in ophthalmology, where he was responsible for the global launch of the CyPass Micro-stent. Prior, he held positions of increasing responsibility and leadership in market research and business analytics for over 10 years at Alcon covering the pharmaceutical, surgical and vision care businesses.\nJeff Francis will build and lead the sales force for Sight Sciences' surgical devices. Francis brings nearly 20 years of experience in the pharmaceutical, medical device and surgical arenas. He joined Sight Sciences from Nestle Skin Health, and prior to that, Alcon, where he began his career and held positions of increasing responsibility in sales training, sales leadership, marketing and hospital/corporate accounts.\nTodd Love will lead the marketing program for Sight Sciences' dry eye product portfolio. Love joined Sight Sciences from Bausch + Lomb where he was Director, Professional Strategy and led the development of key opinion leaders, optometric institutions and professional programs. Prior, Love held positions of increasing responsibility at Alcon in market development, global marketing and brand management where he led the company's global contact lens care franchise.\n\"We are pleased that Patrick, Jeff and Todd have joined our commercial team to advance development and launch efforts for our surgical glaucoma and dry eye product portfolios,\" said Paul Badawi, CEO of Sight Sciences. \"Our core commercial leadership team now holds more than 70 years of collective experience in commercial excellence in the ophthalmology and optometry spaces and is poised to lead Sight Sciences' strategic objectives.\"\nAbout Sight Sciences\nSight Sciences is a medical device company dedicated to the development of intelligently designed and engineered products that address the underlying physiology of ophthalmic diseases. The company operates two business lines: surgical and non-surgical devices. Its surgical product portfolio consists of the VISCO360®, TRAB®360 and OMNI™ surgical devices. Its non-surgical product portfolio consists of technologies in the advanced stages of development for dry eye disease.\nView original content: http://www.prnewswire.com/news-releases/sight-sciences-expands-surgical-portfolio-with-fda-clearance-of-the-omni-surgical-system-300577679.html\nSOURCE Sight Sciences, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/sight-sciences-expands-surgical-portfolio-with-fda-clearance-of-the-omni-surgical-system-300577679.html"], "published": "2018-01-04T18:45:00.000+02:00", "crawled": "2018-01-04T19:23:39.011+02:00", "highlightTitle": ""}