{"organizations": [], "uuid": "9c647b990f846a5509b7895bd670417a52bc34c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/business-wire-pelican-biothermal-hires-dominic-hyde-as-new-vp-of-cradoa-on-demand.html", "country": "US", "domain_rank": 767, "title": "Pelican BioThermal Hires Dominic Hyde as New VP of Crēdo™ on Demand", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-04T12:00:00.000+02:00", "replies_count": 0, "uuid": "9c647b990f846a5509b7895bd670417a52bc34c6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/business-wire-pelican-biothermal-hires-dominic-hyde-as-new-vp-of-cradoa-on-demand.html", "ord_in_thread": 0, "title": "Pelican BioThermal Hires Dominic Hyde as New VP of Crēdo™ on Demand", "locations": [], "entities": {"persons": [{"name": "dominic hyde", "sentiment": "negative"}, {"name": "hyde", "sentiment": "none"}, {"name": "pelican biothermal", "sentiment": "none"}, {"name": "envirotainer", "sentiment": "none"}], "locations": [{"name": "puerto rico", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}, {"name": "crēdo", "sentiment": "none"}, {"name": "minneapolis", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Radical expansion of global rental program includes adding staff, locations and doubling their container inventory\nMINNEAPOLIS--(BUSINESS WIRE)-- Pelican BioThermal , the global name in temperature controlled packaging, announced the appointment of Dominic Hyde as its new Vice President of Crēdo on Demand. With more than 23 years engineering expertise and leadership experience, Hyde will manage the worldwide expansion of Pelican BioThermal’s Crēdo on Demand rental program . The rapidly expanding program offers a high performance, flexible rental option for temperature controlled pallet shippers, with global reach.\nPrior to Pelican BioThermal Hyde held previous positions of managing director at va-Q-tec and chief operating officer of Envirotainer. In his new role as part of the Pelican BioThermal leadership team, Hyde will oversee the company’s growing rental operations.\nOngoing worldwide expansion for Crēdo on Demand follows the recent launch of new service centers , offering conditioning and repair of passive bulk containers, in Puerto Rico and Belgium. An additional 12 service centers are slated for 2018, including key locations such as Tokyo, Seoul, Mexico City and San Diego. The company also plans to launch additional drop-off hubs for passive temperature controlled containers (including Crēdo™ Cargo and Crēdo™ Xtreme) at over 50 new locations spanning Europe, Asia and the Americas over the next year.\n“Dominic is the right leader for our expansion of Crēdo on Demand,” explained David Williams, president of Pelican BioThermal. “His experience is proven for successfully growing rental programs for temperature controlled pharmaceutical distribution worldwide. We’re excited he has joined our team to lead this important global growth initiative.”\nHyde joins the leadership team to oversee the company’s latest exciting developments, which include doubling the size of its Crēdo on Demand fleet leading to the creation of multiple new staff positions globally to support the Crēdo on Demand expansion.\n“ I am very excited about my appointment and delighted to lead the development of the global service business,” said Hyde. “Pelican BioThermal has developed a product portfolio I believe is capable of achieving new levels of cost efficiency and performance.”\nVisit pelicanbiothermal.com to learn more about the wide range of Pelican BioThermal products and global network of service centers.\nPelican BioThermal is a division of Pelican Products, Inc., which is a portfolio company of Behrman Capital, a private equity investment firm based in New York and San Francisco.\nAbout Pelican Products\nPelican Products, Inc. is the global leader in the design and manufacture of high performance protective cases, temperature controlled packaging solutions, advanced portable lighting systems and rugged gear for professionals and outdoor enthusiasts. Their products are used by professionals in the most demanding markets including fire safety, law enforcement, defense / military, aerospace, entertainment, industrial and consumer. Pelican™ products are designed and built to last a lifetime. The company operates in 21 countries, with 22 international sales offices and six manufacturing facilities around the globe. In Europe, the company does business under the name Peli Products, S.LU. For more information, visit pelican.com or behrmancap.com .\nAbout Pelican BioThermal\nPelican BioThermal LLC offers the widest range of thermally protected, temperature controlled packaging and service solutions to the global life sciences industry. The company’s products ensure that delicate biological materials arrive intact and effective, despite exterior environments. Pelican BioThermal is dedicated to developing innovative products designed to fulfill the complex needs of the global life sciences industry. The company’s customers benefit from its extensive expertise in ensuring that temperature stability is maintained throughout the distribution chain. The company also offers a complete portfolio of services and software to support end-to-end temperature controlled packaging asset management. In Europe, the company does business under the name Peli BioThermal Limited. For more information, visit pelicanbiothermal.com .\nAll trademarks are registered and/or unregistered trademarks of Pelican Products, Inc., its subsidiaries and/or affiliates and others.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180104005211/en/\nBLASTmedia for Pelican BioThermal\nAnna Julow Roolf, 317-806-1900 x134\nanna@BLASTmedia.com\nSource: Pelican BioThermal", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.behrmancap.com%2F&esheet=51737488&newsitemid=20180104005211&lan=en-US&anchor=behrmancap.com&index=6&md5=71975b57b6e95e700634d7a7c397a975", "http://www.businesswire.com/news/home/20180104005211/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fpelicanbiothermal.com%2Fcredo-rental&esheet=51737488&newsitemid=20180104005211&lan=en-US&anchor=Cr%C4%93do+on+Demand+rental+program&index=2&md5=63f840380b22b1cc36bd8b98578266d1", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fpelicanbiothermal.com%2Fnews%2Fbelgium-service-center-grand-opening&esheet=51737488&newsitemid=20180104005211&lan=en-US&anchor=new+service+centers&index=3&md5=7d5d8b775a738769934e9290cc597f1e", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.pelicanbiothermal.com%2F&esheet=51737488&newsitemid=20180104005211&lan=en-US&anchor=pelicanbiothermal.com&index=7&md5=62abc9b62578b5c403d629db96cb7851", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fpelican.com%2F&esheet=51737488&newsitemid=20180104005211&lan=en-US&anchor=pelican.com&index=5&md5=a46d29d81f1a7a57ebe19ffd3d282a5d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fpelicanbiothermal.com&esheet=51737488&newsitemid=20180104005211&lan=en-US&anchor=pelicanbiothermal.com&index=4&md5=b5ad8b0d3126c0b0c8ea2cb92f32d934", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fpelicanbiothermal.com%2F&esheet=51737488&newsitemid=20180104005211&lan=en-US&anchor=Pelican+BioThermal&index=1&md5=4dd7f0dd5a5f41068f6f89cb74da9fdb"], "published": "2018-01-04T12:00:00.000+02:00", "crawled": "2018-01-04T12:02:52.007+02:00", "highlightTitle": ""}