{"organizations": [], "uuid": "3c7a08c5764fcb253aa2e80d4290476c96769fde", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/04/09/101567610-482145477.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/high-schools-stock-up-on-narcan-to-combat-teen-opioid-crisis-in-us.html", "country": "US", "domain_rank": 767, "title": "High schools stock up on Narcan to combat teen opioid crisis in US", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.366, "site_type": "news", "published": "2018-01-30T16:31:00.000+02:00", "replies_count": 0, "uuid": "3c7a08c5764fcb253aa2e80d4290476c96769fde"}, "author": "Susan Caminiti", "url": "https://www.cnbc.com/2018/01/30/high-schools-stock-up-on-narcan-to-combat-teen-opioid-crisis-in-us.html", "ord_in_thread": 0, "title": "High schools stock up on Narcan to combat teen opioid crisis in US", "locations": [], "entities": {"persons": [{"name": "joseph occhino", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "bergen county", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}], "organizations": [{"name": "us modern medicine high", "sentiment": "negative"}, {"name": "northern highlands regional high school", "sentiment": "none"}, {"name": "centers for disease control and prevention", "sentiment": "none"}, {"name": "allendale", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump swore in Alex Azar, the newest Health and Human Services Secretary, on Monday, charging him with the task of combating the nation's opioid epidemic. Meanwhile, high schools aren't waiting.\nJoseph Occhino, principal of Northern Highlands Regional High School in Allendale, New Jersey, said he has seen lots of changes during his 34 years as an educator. But last year he witnessed something he never could have imagined. His school, which draws students from four affluent towns in northwest Bergen County, was approved to administer the lifesaving drug Narcan (the commercial name for naloxone hydrochloride) to any student who overdoses on an opioid on school grounds.\nThree faculty members — the school nurse, athletic trainer and the supervisor of health and wellness — were trained offsite earlier last year and are now authorized to administer the drug, which, when given as a nasal spray, can quickly revive someone who is not breathing.\nThe measures at Northern Highlands come as America enters the deadliest drug overdose crisis in the country's history . The opioid crisis is so severe, President Donald Trump declared it a \"public health emergency\" in October but stopped short of asking Congress for additional emergency funding. Many are hopeful Trump will call for more efforts to combat the U.S. opioid epidemic in Tuesday's State of the Union Address.\nStatistics tell the story. In 2016 nearly 64,000 people died of drug overdoses in the United States — a record high — and at least two-thirds of those deaths were linked to opioids, including heroin and the synthetic opioid fentanyl . (Opioids are a class of drugs that include heroin and prescription pain relievers, such as oxycodone, hydrocodone, codeine, morphine and fentanyl.)\nSource: Northern Highlands Regional High School From left to right: Joseph Occhino, the principal of Northern Highlands Regional High School in Allendale, New Jersey, with school nurse Anne Rutkowski and supervisor of health and wellness Steve Simonetti. All have been trained to administer the lifesaving drug Narcan in case of an overdose on school grounds. Occhino says there hasn't been a need to use Narcan at his school since its approval, but having it on hand just makes sense. \"We all saw what was happening in Bergen County and how widespread the opioid crisis is here and across the country,\" he said. \"I hope we never have to use it, but if we do, we're prepared.\"\nNorthern Highlands is just one of a growing number of high schools across the country that is stocking the opioid antidote. Adapt Pharma , the company that makes Narcan, says it has distributed more than 3,300 doses of the drug to high schools around the country for free and in April expanded the program to include colleges and universities. Though there is no comprehensive data that shows how many students overdose while actually on school grounds, the statistics reveal the grip these powerful painkillers have on teenagers.\nAccording to the Centers for Disease Control and Prevention, overdose deaths for teens age 15 to 19 jumped 19 percent between 2014 and 2015 , with the majority coming from opioids, specifically heroin.\nA few facts about prescription-drug misuse among teens\nAfter marijuana and alcohol, prescription drugs are the most commonly misused substances by Americans age 14 and older.\nTeens misuse prescription drugs for a number of reasons, such as to get high, to stop pain, or because they think it will help them with school work.\nMany teens get prescription drugs they misuse from friends and relatives, sometimes without the person knowing.\nBoys and girls tend to misuse some types of prescription drugs for different reasons. For example, boys are more likely to misuse prescription stimulants to get high, while girls tend to misuse them to stay alert or to lose weight.\nSource: NIH's National Institute on Drug Abuse\nThe 21 st Century Cures Act , signed into law by President Barack Obama in December 2016, included nearly $1 billion for opioid prevention and treatment programs for all 50 states. Half of the money was released last year, and the rest will be administered this year.\nThe teen opioid pipeline Health and addiction experts say the ease with which teens can get access to prescription painkillers is helping to fuel the epidemic. In fact, a recent study presented to the American Academy of Pediatrics shows that common surgeries may be leading teenagers to abuse these powerful painkillers long after they leave the hospital.\nDr. Calista Harbaugh is a pediatric surgery researcher at the University of Michigan's C.S. Mott Children's Hospital and a member of the Michigan Opioid Engagement Network, an advocacy group that works to reduce the opioid epidemic in the state. Her study looked at the persistent use of opioids among teens after common surgeries, such as tonsil removal and hernia repair.\nShe and her team examined the data of nearly 90,000 privately insured patients between the ages of 13 and 21 who had never used opioids before. What she found was that 4,343 of these patients — almost 1 in 20 — were still getting prescriptions refilled for these drugs anywhere from three to six months after surgery. That figure is not much different than in the adult population over the same time period, Harbaugh said.\nshow chapters President Trump declares the opioid epidemic a public health emergency 3:03 PM ET Thu, 26 Oct 2017 | 02:03 \"Doctors have to be more aware of how much they're prescribing to teens, because of the risk of opioid addiction and the chance that they will share these drugs,\" she said. \"There's been this perception out there that doctors don't prescribe opioids to teens, but that isn't the case.\"\nIndeed, doctors are prescribing these powerful painkillers to younger patients well before they even hit puberty. In August 2015 the Food and Drug Administration gave approval for Purdue Pharma's powerful, extended-release opioid, OxyContin, to be used by children as young as 11. The decision provoked fierce criticism by those who worried about children that young being exposed — and potentially addicted — to the drug.\n\"There's been this perception out there that doctors don't prescribe opioids to teens, but that isn't the case.\" -Dr. Calista Harbaugh, pediatric surgery researcher at the University of Michigan's C.S. Mott Children's Hospital The FDA, in its defense, said that it didn't approve the drug to expand its use among children but rather to give doctors better guidelines on how to prescribe it to pediatric patients whose pain could not be controlled with other medications.\nStates stepping in Still, these studies and others are leading to a growing belief that too much medication is getting into teenagers' hands — and for too long. In response, a growing number of states have enacted laws that limit the number of painkillers a doctor can prescribe. At least 19 states, including New Jersey, Ohio, New York, Maine, New Hampshire, and Arizona, now limit an initial opioid prescription to five or seven days.\nIn New Jersey the limit is five days, with the law also mandating that doctors must have a conversation with patients about the risks of developing a physical or psychological dependence on the drug. The ultimate goal, said Dr. Deepa Camenga, a member of the American Academy of Pediatrics' committee on substance use and prevention and an assistant professor of emergency medicine at Yale School of Medicine, is for \"doctors to expose kids to the least amount of these drugs for the shortest period of time and still have effective pain relief.\"\nSource: Adapt Pharma Narcan nasal spray quickly reverses an overdose from heroin and prescription painkillers. Adapt Pharma, the maker of the drug, is offering it to high schools across the country for free. Ultimately, the most effective response to the opioid crisis among teens will involve multiple fronts, researchers say. In addition to physicians taking greater care in how they prescribe the drugs and for how long, experts say there must be more candid conversations with younger patients and parents about the potential for abuse.\nDr. Camenga said she rarely prescribes opioids for pain, opting instead to give her teen patients medications that are effective but less habit forming. And she notes that a growing number of parents are in agreement with that approach. \"In my clinical work over the past two years, I've had more parents tell me that they want their kids to try other medications first, because they don't even want to start with opioids,\" she said. \"That's a commentary on the growing awareness of this epidemic and a step in the right direction.\"\nMore from Modern Medicine:\nApple urged to act on smartphone addiction some call 'digital heroin'\n6 amazing medical advancements to expect in 2018\nAfter Trump's Twitter blasts, demand for radiation pills spikes\n— By Susan Caminiti, special to CNBC.com", "external_links": [], "published": "2018-01-30T16:31:00.000+02:00", "crawled": "2018-01-30T16:31:05.005+02:00", "highlightTitle": ""}