{"organizations": [], "uuid": "2cbadede180c6ad6884cf8c13863c900a7d41ffb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-cohen-steers-reit-and-preferred-income-fund-inc-rnp-notification-of-sources-of-distribution-under-section-19a.html", "country": "US", "domain_rank": 767, "title": "Cohen & Steers REIT and Preferred Income Fund, Inc. (RNP) Notification of Sources of Distribution Under Section 19(a)", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T02:12:00.000+02:00", "replies_count": 0, "uuid": "2cbadede180c6ad6884cf8c13863c900a7d41ffb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-cohen-steers-reit-and-preferred-income-fund-inc-rnp-notification-of-sources-of-distribution-under-section-19a.html", "ord_in_thread": 0, "title": "Cohen & Steers REIT and Preferred Income Fund, Inc. (RNP) Notification of Sources of Distribution Under Section 19(a)", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "rnp", "sentiment": "negative"}, {"name": "cohen & steers r", "sentiment": "negative"}, {"name": "cohen & steers", "sentiment": "negative"}, {"name": "securities and exchange commission", "sentiment": "none"}, {"name": "fund", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, This press release provides shareholders of Cohen & Steers REIT and Preferred Income Fund, Inc. (NYSE: RNP) (the \"Fund\") with information regarding the sources of the distribution to be paid on January 31, 2018 and cumulative distributions paid fiscal year-to-date.\nIn December 2017, the Fund implemented a managed distribution policy in accordance with exemptive relief issued by the Securities and Exchange Commission. The managed distribution policy seeks to deliver the Fund's long-term total return potential through regular monthly distributions declared at a fixed rate per common share. The policy gives the Fund greater flexibility to realize long-term capital gains throughout the year and to distribute those gains on a regular monthly basis to shareholders. The Board of Directors of the Fund may amend, terminate or suspend the managed distribution policy at any time, which could have an adverse effect on the market price of the Fund's shares.\nThe Fund's monthly distributions may include long-term capital gains, short-term capital gains, net investment income and/or return of capital for federal income tax purposes. Return of capital includes distributions paid by the Fund in excess of its net investment income and net realized capital gains and such excess is distributed from the Fund's assets. A return of capital is not taxable; rather, it reduces a shareholder's tax basis in his or her shares of the Fund. The amount of monthly distributions may vary depending on a number of factors, including changes in portfolio and market conditions.\nAt the time of each monthly distribution, information will be posted to cohenandsteers.com and mailed to shareholders in a concurrent notice. However, this information may change at the end of the year because the final tax characteristics of the Fund's distributions cannot be determined with certainty until after the end of the calendar year. Final tax characteristics of all of the Fund's distributions will be provided on Form 1099-DIV, which is mailed after the close of the calendar year.\nThe following table sets forth the estimated amounts of the current distribution and the cumulative distributions paid this fiscal year-to-date from the sources indicated. All amounts are expressed per common share.\nDISTRIBUTION ESTIMATES\nJanuary 2018\nYEAR-TO-DATE (YTD)\nJanuary 31, 2018*\nSource\nPer Share\nAmount\n% of Current\nDistribution\nPer Share\nAmount\n% of 2018\nDistributions\nNet Investment Income\n$0.0000\n0.00%\n$0.0000\n0.00%\nNet Realized Short-Term Capital Gains\n$0.0000\n0.00%\n$0.0000\n0.00%\nNet Realized Long-Term Capital Gains\n$0.1240\n100.00%\n$0.1240\n100.00%\nReturn of Capital (or other Capital Source)\n$0.0000\n0.00%\n$0.0000\n0.00%\nTotal Current Distribution\n$0.1240\n100.00%\n$0.1240\n100.00%\nYou should not draw any conclusions about the Fund's investment performance from the amount of this distribution or from the terms of the Fund's managed distribution policy. The amounts and sources of distributions reported in this Notice are only estimates, are likely to change over time, and are not being provided for tax reporting purposes. The actual amounts and sources of the amounts for accounting and tax reporting purposes will depend upon the Fund's investment experience during the remainder of its fiscal year and may be subject to changes based on tax regulations. The amounts and sources of distributions year-to-date may be subject to additional adjustments.\n* THE FUND WILL SEND YOU A FORM 1099-DIV FOR THE CALENDAR YEAR THAT WILL TELL YOU HOW TO REPORT THESE DISTRIBUTIONS FOR FEDERAL INCOME TAX PURPOSES\nThe Fund's Year-to-date Cumulative Total Return for fiscal year 2017 (January 1, 2017 through December 31, 2017) is set forth below. Shareholders should take note of the relationship between the Year-to-date Cumulative Total Return with the Fund's Cumulative Distribution Rate for 2018. In addition, the Fund's Average Annual Total Return for the five-year period ending December 31, 2017 is set forth below. Shareholders should note the relationship between the Average Annual Total Return with the Fund's Current Annualized Distribution Rate for 2018. The performance and distribution rate information disclosed in the table is based on the Fund's net asset value per share (NAV). The Fund's NAV is calculated as the total market value of all the securities and other assets held by the Fund minus the total liabilities, divided by the total number of shares outstanding. While NAV performance may be indicative of the Fund's investment performance, it does not measure the value of a shareholder's individual investment in the Fund. The value of a shareholder's investment in the Fund is determined by the Fund's market price, which is based on the supply and demand for the Fund's shares in the open market.\nFund Performance and Distribution Rate Information:\nYear-to-date January 1, 2017 to December 31, 2017\nYear-to-date Cumulative Total Return 1\n12.65%\nCumulative Distribution Rate 2\n0.54%\nFive-year period to December 31, 2017\nAverage Annual Total Return 3\n12.45%\nCurrent Annualized Distribution Rate 4\n6.53%\n1.\nYear-to-date Cumulative Total Return is the percentage change in the Fund's NAV over the year-to-date time period including distributions paid and assuming reinvestment of those distributions.\n2.\nCumulative Distribution Rate for the Fund's current fiscal period (January 1, 2018 through January 31, 2018) measured on the dollar value of distributions in the year-to-date period as a percentage of the Fund's NAV as of December 31, 2017.\n3.\nAverage Annual Total Return represents the compound average of the Annual NAV Total Returns of the Fund for the five-year period ending December 31, 2017. Annual NAV Total Return is the percentage change in the Fund's NAV over a year including distributions paid and assuming reinvestment of those distributions.\n4.\nThe Current Annualized Distribution Rate is the current fiscal period's distribution rate annualized as a percentage of the Fund's NAV as of December 31, 2017.\nInvestors should consider the investment objectives, risks, charges and expense of the fund carefully before investing. You can obtain the fund's most recent periodic reports, when available, and other regulatory filings by contacting your financial advisor or visiting cohenandsteers.com . These reports and other filings can be found on the Securities and Exchange Commission's EDGAR Database. You should read these reports and other filings carefully before investing.\nShareholders should not use the information provided in preparing their tax returns. Shareholders will receive a Form 1099-DIV for the calendar year indicating how to report Fund distributions for federal income tax purposes.\nWebsite: http://cohenandsteers.com/\nSymbol: (NYSE: CNS)\nAbout Cohen & Steers. Cohen & Steers is a global investment manager specializing in liquid real assets, including real estate securities, listed infrastructure, commodities and natural resource equities, as well as preferred securities and other income solutions. Founded in 1986, the firm is headquartered in New York City, with offices in London, Hong Kong, Tokyo and Seattle.\n : releases/cohen--steers-reit-and-preferred-income-fund-inc-rnp-notification-of-sources-of-distribution-under-section-19a-300587925.html\nSOURCE Cohen & Steers", "external_links": ["http://cohenandsteers.com/", "http://www.prnewswire.com/news-releases/cohen--steers-reit-and-preferred-income-fund-inc-rnp-notification-of-sources-of-distribution-under-section-19a-300587925.html"], "published": "2018-01-25T02:12:00.000+02:00", "crawled": "2018-01-25T03:29:53.024+02:00", "highlightTitle": ""}