{"organizations": [], "uuid": "78dd0b784a7d9c2626406083aac7ec4636375a9b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets/europe", "section_title": "European Stock Market News | Reuters.com", "url": "https://www.reuters.com/article/zealand-strategy/biotech-zealand-pharma-bets-on-self-marketing-over-big-pharma-partnerships-idUSL8N1PK518", "country": "US", "domain_rank": 408, "title": "Biotech Zealand Pharma bets on self-marketing over big pharma partnerships", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.844, "site_type": "news", "published": "2018-01-30T19:34:00.000+02:00", "replies_count": 0, "uuid": "78dd0b784a7d9c2626406083aac7ec4636375a9b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/zealand-strategy/biotech-zealand-pharma-bets-on-self-marketing-over-big-pharma-partnerships-idUSL8N1PK518", "ord_in_thread": 0, "title": "Biotech Zealand Pharma bets on self-marketing over big pharma partnerships", "locations": [], "entities": {"persons": [{"name": "britt meelby jensen", "sentiment": "none"}], "locations": [{"name": "denmark", "sentiment": "none"}, {"name": "copenhagen", "sentiment": "none"}, {"name": "zealand", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "soliqua", "sentiment": "none"}], "organizations": [{"name": "zealand pharma", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "biotech zealand pharma", "sentiment": "negative"}, {"name": "sanofi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GLOSTRUP, Denmark, Jan 30 (Reuters) - Denmark’s Zealand Pharma is pinning its strategy on rare disease drugs that the small biotech can market itself after seeing disappointing income from a diabetes drug marketed by partner Sanofi, its chief executive said.\nSales of Soliqua, which is a combination of insulin and a GLP-1, has been below both analysts and Sanofi’s own expectations since the drug was launched in the United States a year ago, Sanofi said in its third-quarter results in November.\n“Sanofi has said that this doesn’t live up to their expectations ... They had hoped and believed it would be easier to convince the doctors,” chief executive Britt Meelby Jensen told Reuters at the company’s headquarters on the outskirts of Copenhagen.\nGlucagon-like peptide-1 (GLP-1) analogues are a rapid growing drug class that imitate an intestinal hormone that stimulates the production of insulin.\nZealand is entitled to 10 percent royalties on Soliqua sales, and with three products in third phase studies this year the income is important to future development and bringing treatments to market.\nBut Sanofi said in November that the uptake of Soliqua in the Unites States remained relatively modest and was below expectations. It had sales of 17 million euros ($21 million) in the first nine months of 2017, with nearly half of that in the third quarter.\nIt competes with Novo Nordisk’s Xultophy which had net sales of 461 million Danish crowns ($76.80 million) between January and September.\nDiabetes drugmakers including Sanofi and Novo Nordisk have seen margins being squeezed due to increased competition and pharmacy purchase managers demanding bigger discounts.\nWhile most investor focus has been on Zealand’s partnerships with big diabetes players, the firm is also betting on products within rare diseases such as short bowel syndrome where it this year will initiate phase three study with drug candidate glepaglutide.\nGlepaglutide is the first product it plans to bring to market itself.\nZealand, with a market capitalisation of $516 million, is aiming for a product launch by 2021-2022 and aims to take “a majority” of the $1 billion U.S. market for the rare disease.\n“If we give up control to a pharma company we will be evaluated against their internal portfolio and there is a risk of you getting assigned to a lower priority,” Jensen said.\n“It is much more interesting it get the full revenue rather than 10 percent. We can do that within rare diseases where investments for getting it to the market is a lower level than within diabetes.”\nMeanwhile, Jensen said she would be surprised if Soliqua did not make it as a blockbuster drug, defined as one that generates sales of at least $1 billion a year, but said a challenging U.S. diabetes market meant that it took longer for sales of new drugs to accelerate.\n“We are in dialogue with Sanofi and there is no doubt that they still see it as a strategic important product,” Jensen said.\nReporting by Stine Jacobsen; Editing by Jacob Gronholt-Pedersen and Alison Williams\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T19:34:00.000+02:00", "crawled": "2018-01-30T16:37:40.026+02:00", "highlightTitle": ""}