{"organizations": [], "uuid": "0e2ab8754289d8bc57c202b3cacf371f01977ebe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/subjects/middle-east", "section_title": "Middle East Insight", "url": "https://www.reuters.com/article/us-saudi-construction/some-shares-in-saudi-binladin-group-may-be-transferred-to-state-idUSKBN1F20J3", "country": "US", "domain_rank": 408, "title": "Some shares in Saudi Binladin Group may be transferred to state", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T22:00:00.000+02:00", "replies_count": 0, "uuid": "0e2ab8754289d8bc57c202b3cacf371f01977ebe"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-saudi-construction/some-shares-in-saudi-binladin-group-may-be-transferred-to-state-idUSKBN1F20J3", "ord_in_thread": 0, "title": "Some shares in Saudi Binladin Group may be transferred to state", "locations": [], "entities": {"persons": [{"name": "bakr bin laden", "sentiment": "none"}], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "mecca", "sentiment": "none"}, {"name": "grand mosque", "sentiment": "none"}, {"name": "riyadh", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "saudi binladin group", "sentiment": "negative"}, {"name": "sbg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ABU DHABI/KHOBAR, Saudi Arabia (Reuters) - Saudi Binladin Group (SBG) said on Saturday some shareholders in the construction giant might transfer part of their holdings to the state in a settlement with authorities, which detained several members of the founding family in an anti-graft drive.\nFamily-owned SBG, which had more than 100,000 employees at its height, is the biggest builder in Saudi Arabia and important to Riyadh’s plans for large real estate, industrial and tourism projects to help diversify the economy beyond oil.\nThe group has been hurt by a construction industry slump due to weak oil prices and by a temporary exclusion from new state contracts after a crane accident killed 107 people at Mecca’s Grand Mosque in 2015, causing it to make thousands of layoffs.\nSBG Chairman Bakr Bin Laden and several family members were detained in a government crackdown on corruption announced in November, sources familiar with the matter told Reuters, alongside scores of princes, senior officials and businessmen.\nSaudi officials are trying to negotiate settlements with detainees, saying they want to claw back some $100 billion of funds that they say rightfully belong to the state. The government has been talking to SBG as part of this effort.\n“Based on information available to management, some of the shareholders may have agreed a settlement that involves transferring some SBG shares to the government of Saudi Arabia against outstanding dues,” SBG said in a statement emailed to Reuters on Saturday.\nIt said a committee, comprising two family members and three independent businessmen, had been appointed to restructure the firm and separate SBG’s ownership from management. It said SBG “remains a private sector company owned by its shareholders”.\n“The committee will restructure the group and empower the new executive management to lead the projects and overcome the current challenges, bringing the company to profitability again,” the statement said.\nTAKING CONTROL Reuters reported on Thursday that the government was appointing the committee to take managerial control and was discussing a possible transfer of some assets to the state.\nBanking sources said the three independent businessmen on the SBG committee were effectively acting for the state. They said Riyadh wanted to control the firm to ensure SBG continued to serve Saudi Arabia’s development plans.\nSBG said it was continuing to work on major government projects, such as expanding facilities at Islam’s holiest mosques in Mecca and Medina.\nThe group named the family members on the new committee as Yehia Bin Laden and Abdullah Bin Laden. It said they would work with three others: Abdulrehman al-Harkan, a former chief executive of Saudi property firm Dar Al Arkan; Khaled Nahas, a board member of state-controlled Saudi Basic Industries Corp; and Khaled Mohammed al-Khowaiter.\nIt was not clear whether the government’s handling of SBG would set a precedent for other firms whose owners have been detained in the anti-corruption drive.\nThose held include Prince Alwaleed bin Talal, chairman and owner of investment firm Kingdom Holding, and Nasser bin Aqeel al-Tayyar, founder and board member of Al Tayyar Travel Group, Saudi Arabia’s largest travel company.\nSBG’s strategic importance to Saudi construction and development, and its financial woes, may mean it receives different treatment from the assets of other detainees.\nTransferring ownership of SBG to the government may have implications for Saudi banks. Bankers estimate the group’s debt is about $30 billion.\nCreditors agreed last year to extend by two years 4 billion riyals ($1.1 billion) of an Islamic credit facility that was used to pay for work at Mecca’s Grand Mosque, and which had been due to expire at the end of 2017.\nGovernment ownership could help lift SBG back into profit, but bankers said it was not clear if it would also mean quicker or fuller repayment of outstanding debt to banks, as the group’s restructuring might involve restructuring of some of that debt.\nAdditional reporting by Tom Arnold; Writing by Hadeel Al Sayegh and Andrew Torchia; Editing by Edmund Blair\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-13T22:00:00.000+02:00", "crawled": "2018-01-13T19:42:50.008+02:00", "highlightTitle": ""}