{"organizations": [], "uuid": "3123ae93b0205de0fcadaca8413fb85e3136a43f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 47, "shares": 47, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220449433&w=1200&r=LYNXMPEE0808T", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-forex-yen/japans-central-bank-trims-bond-purchases-prompting-stimulus-withdrawal-talk-idUSKBN1EY0FF", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Japan's central bank trims bond purchases, prompting taper talk", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T10:15:00.000+02:00", "replies_count": 0, "uuid": "3123ae93b0205de0fcadaca8413fb85e3136a43f"}, "author": "", "url": "https://www.reuters.com/article/us-forex-yen/japans-central-bank-trims-bond-purchases-prompting-stimulus-withdrawal-talk-idUSKBN1EY0FF", "ord_in_thread": 0, "title": "UPDATE 2-Japan's central bank trims bond purchases, prompting taper talk", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 5:44 AM / Updated an hour ago Japan's central bank trims bond purchases, prompting stimulus withdrawal talk Reuters Staff 4 Min Read \nHONG KONG (Reuters) - Speculation the Bank of Japan may slow its monetary stimulus this year gripped the currency market on Tuesday after the central bank trimmed the amount of its purchases of Japanese government bonds. \nWhile the bond-buying operations are usually seen as a routine affair, traders appeared to latch on to the BOJ announcement that it will buy less of the long-dated bonds, sending the dollar down about 0.5 percent against the yen. \n“This (announcement) adds to speculation that BOJ may remove monetary stimulus,” Maybank analysts said in a note after the announcement. \nBOJ Governor Haruhiko Kuroda has repeatedly dismissed the chance of withdrawing stimulus any time soon, even as some policymakers have recently expressed concerns over the perceived demerits of monetary easing, especially the hit on financial institutions’ profit margins. \nThat has led to speculation that the central bank may have to consider raising its yield targets or slow purchases of risky assets later in 2018. A host of developed nations have started to tighten policy, partly thanks to a synchronized uptick in global growth. [nL4N1OS1AQ] \nThe BOJ pledged in 2016 to guide short-term interest rates at minus 0.1 percent and 10-year bond yields at around zero percent. It also keeps a loose pledge to increase its bond holdings at 80 trillion yen ($710.29 billion) per year, although its buying has recently slowed. \nOn Tuesday, the central bank reduced its purchases of JGBs with 10 to 25 years left to maturity and those with 25 to 40 years to maturity by 10 billion yen ($88.39 million) each, from its previous operations. [nL4N1P4168] \nIt also offered to buy 190 billion yen of 10-25 year JGBs and 80 billion yen of 25-40 year JGBs. \nThe announcement pushed the dollar to a session low of 112.50 yen JPY= , down around 0.5 percent on the day. \nJapanese bond prices dipped, lifting 20- to 40-year yields to one-month highs. The benchmark 10-year JGB yield ticked up 1 basis point to 0.065 percent JP10YTN=JBTC. POLICY INCONSISTENCY? \nSince it adopted the yield curve control policy in 2016, the BOJ has occasionally tweaked its bond operations, with officials saying any changes are meant to keep bond yields in line with its policy goal and not to telegraph hints on its future policy. \nBut some analysts say the inconsistency of the two policy targets requires a change of tack from the BOJ. \n“It’s better to use the upcoming Jan. 23 meeting to tweak the policy – with a fresh balance sheet target at 40 trillion yen,” Westpac analysts said in a note. \nThe difficulty is that inflation remains far off the BOJ’s 2 percent target. Slow wage growth is one of the challenges. \nData on Tuesday showed Japan’s real wages, which are adjusted for inflation, posted their first gain in 11 months in November, helped by a rise in year-end bonuses. But the increase was just 0.1 percent and economists warn that wages are unlikely to keep up with general price increases, which could hurt consumption. [nL4N1P41F0] \n“Regular pay is set to strengthen only slowly ... the Bank of Japan’s 2 percent inflation target won’t be reached anytime soon,” said Marcel Thieliant, senior Japan economist at Capital Economics. \n($1 = 112.6300 yen)", "external_links": [], "published": "2018-01-09T10:15:00.000+02:00", "crawled": "2018-01-09T10:52:01.023+02:00", "highlightTitle": ""}