{"organizations": [], "uuid": "b927bd6b6ad9ef057ac3fd8da2723963fe6138d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-893664976.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/04/sessions-on-marijuana/", "country": "US", "domain_rank": 1196, "title": "Sessions on Marijuana: No More Hands Off Approach | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.16, "site_type": "news", "published": "2018-01-04T13:29:00.000+02:00", "replies_count": 0, "uuid": "b927bd6b6ad9ef057ac3fd8da2723963fe6138d3"}, "author": "Grace Donnelly", "url": "http://fortune.com/2018/01/04/sessions-on-marijuana/", "ord_in_thread": 0, "title": "Sessions on Marijuana: No More Hands Off Approach | Fortune", "locations": [], "entities": {"persons": [{"name": "jeff sessions", "sentiment": "negative"}, {"name": "grace donnelly", "sentiment": "negative"}, {"name": "james m. cole", "sentiment": "none"}], "locations": [{"name": "district of columbia", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "associated press", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Grace Donnelly 11:29 AM EST \nAttorney General Jeff Sessions has said he will rescind the federal policy that takes a hands off approach to states’ legalized marijuana, the Associated Press reported Thursday . \nInstead Sessions will allow federal prosecutors in areas where the substance is legal to decide how aggressively to enforce federal drug laws, two sources with knowledge of the matter told the AP ahead of a formal announcement expected Thursday. \nThis news comes just after the first sales of legal recreational pot in California on Jan. 1 and Nevada in July 2017 . \nEight states and the District of Columbia have legalized adult use of marijuana. The reversal of the Cole Memo , written by then-Deputy Attorney General James M. Cole in 2013 means that there will be more confusion about the legality of growing, selling, and using the drug in places where state and local laws clash with the federal government. \nSessions has never been a fan of marijuana legalization. He said during the run-up to the 2016 presidential election that “ good people don’t smoke marijuana ” and called it a “real danger.” \nDuring his confirmation hearing , Sessions would not commit to enforcing federal drug laws, but he sent a letter to Congressional leaders last May urging them to let him prosecute the use of medical marijuana. \nSen. Cory Gardner (R-Colo.) said this decision by the Justice Department breaks a promise Sessions made to him prior to his confirmation . \n“With no prior notice to Congress, the Justice Department has trampled on the will of the voters in CO and other states,” Gardner said in a tweet on Thursday. I am prepared to take all steps necessary, including holding DOJ nominees, until the Attorney General lives up to the commitment he made to me prior to his confirmation. \n— Cory Gardner (@SenCoryGardner) January 4, 2018 \nSpeculation about enforcement under the new administration left the marijuana industry with many questions and concerns about slowed growth. \nThe industry was projected to generate about $50 billion by 2026 with the expectation that cannabis would be legalized nationwide by that time. Sales in California alone are expected to reach $1 billion by the end of this year. \nThis decision by the Justice Department also contradicts President Donald Trump, who said as a candidate that enforcement of drug laws against the sale of medical or recreational marijuana should be left up to the states. Video from Colorado in 2016👇 \nI asked @realDonaldTrump about the possibility that his AG pick might try to shut down #marijuana legalization. \n“I wouldn’t do that, no,” Trump said. “I think it should be up to the states, absolutely.” https://t.co/PnTo7OtM23 \n— Brandon Rittiman (@BrandonRittiman) January 4, 2018 \nSession’s stance on this issue also diverges from public opinion : More Americans than ever support the legalization of marijuana. An October 2017 Gallup poll showed 64% of all Americans and, for the first time since the beginning of the survey in 1969, a majority of Republicans thought that the drug should be made legal . SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-04T13:29:00.000+02:00", "crawled": "2018-01-04T21:01:34.018+02:00", "highlightTitle": ""}