{"organizations": [], "uuid": "e24c2cc797e65e372206752ccf35d854f7bd55ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225060296&w=1200&r=LYNXMPEE0O0AA", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-sky-results/sky-reports-5-percent-rise-in-first-half-revenue-idUKKBN1FE0MW", "country": "US", "domain_rank": 408, "title": "Sky reports 5 percent rise in first-half revenue", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T09:28:00.000+02:00", "replies_count": 0, "uuid": "e24c2cc797e65e372206752ccf35d854f7bd55ef"}, "author": "", "url": "https://uk.reuters.com/article/uk-sky-results/sky-reports-5-percent-rise-in-first-half-revenue-idUKKBN1FE0MW", "ord_in_thread": 0, "title": "Sky reports 5 percent rise in first-half revenue", "locations": [], "entities": {"persons": [{"name": "jeremy darroch", "sentiment": "none"}, {"name": "rupert murdoch", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "sky", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 7:18 AM / Updated 14 minutes ago TV dramas boost Sky as its own takeover saga drags on Paul Sandle 4 Min Read \nLONDON (Reuters) - Hit shows like “Game of Thrones” and “Riviera” helped Sky ( SKYB.L ) deliver a 10 percent rise in first-half earnings, underscoring the appeal of the European pay-TV group to the U.S. media companies trying to buy it. \nRupert Murdoch’s Twenty-First Century Fox ( FOXA.O ) was provisionally blocked this week from buying the shares in Sky it does not already own, although there are options that would allow the $15.7 billion deal to do through. \nSky, whose customer base rose by 365,000 in the half to 22.9 million, could then be sold to Disney ( DIS.N ) if a separate sale of Murdoch’s TV and film assets receives the green light. \nThe British broadcaster reported revenue of 6.7 billion pounds for the six months to the end of December, up 5 percent year-on-year and in line with the first quarter, while core earnings rose to 1.1 billion pounds. \n“This performance reflects the investment choices we have made in recent years, allowing us to more than offset the pressure on consumer spending across Europe, as more customers continue to choose Sky for more of their services,” Chief Executive Jeremy Darroch said. \nShares in Sky, which are trading at the highest levels since Fox announced its 10.75 pound-a-share bid in Dec 2016, were up 1 percent at 10.34 pounds at 0948 GMT. \nThe satellite-company, which operates in Italy, Germany and Austria as well as Britain and Ireland, said it would pay an interim dividend of 13.06 pence a share, on top of a special dividend of 10 pence, which UBS analysts said was a positive surprise. ORIGINAL DRAMA \nDarroch said the company’s investment in original programming, such as dramas “Riviera” and “Tin Star”, drove viewing figures for Sky’s own channels up 6 percent. \n“We have an exceptional line-up of acquired series, and when you add to that our own Sky Originals, it puts us in what I think is the strongest content position we’ve ever had,” he told reporters on Thursday. \nThe results come two days after Britain’s competition regulatory ruled that Fox’s bid to buy the 61 percent of Sky it does not already own was not in the public interest. \nMurdoch, who also owns newspapers in Britain, now has to come up with an arrangement that will prevent him from influencing the news agenda at Sky, for instance by spinning off its Sky News channel. \nDarroch said Sky, along with Fox, was focused on this media ownership hurdle after the competition regulator dismissed concerns about Murdoch’s commitment to broadcasting standards. \n“We are very much focused in the process with the (regulator) CMA,” he told reporters. \n“We have (media) plurality as the final issue to work though,(...) and we’ll see where that takes us.” \nHe would not comment on the company’s thinking about Sky News, saying any messages about the 24-hour service would be given directly to staff. \n“We have got a day job to do,” he said. “And I think you can see from results and the plan we are laying out for 2018 we are not being distracted from any of that.” \nBefore the government gives its final decision on the Fox deal in June, Sky faces the next auction for English Premier League rights, the cornerstone of its offer to soccer fans. \nSome of the pressure on Sky to pay huge sums to retain the biggest packages of games has been eased by a deal it struck with its biggest rival BT ( BT.L ) to supply channels on each other’s platform. \nDarroch said he wouldn’t give a running commentary on the auction, adding Sky’s bid strategy was commercially sensitive. Editing by James Davey and Mark Potter", "external_links": [], "published": "2018-01-25T09:28:00.000+02:00", "crawled": "2018-01-25T09:44:26.076+02:00", "highlightTitle": ""}