{"organizations": [], "uuid": "1adf774aa3efa3828e61253388f1f3d19ae87e7f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-notice-of-plaintiffsa-proposed-voluntary-dismissal-of-shareholder-derivative-actions.html", "country": "US", "domain_rank": 767, "title": "Notice of Plaintiffs’ Proposed Voluntary Dismissal of Shareholder Derivative Actions", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T16:30:00.000+02:00", "replies_count": 0, "uuid": "1adf774aa3efa3828e61253388f1f3d19ae87e7f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-notice-of-plaintiffsa-proposed-voluntary-dismissal-of-shareholder-derivative-actions.html", "ord_in_thread": 0, "title": "Notice of Plaintiffs’ Proposed Voluntary Dismissal of Shareholder Derivative Actions", "locations": [], "entities": {"persons": [], "locations": [{"name": "lake city", "sentiment": "none"}, {"name": "united states district court", "sentiment": "none"}, {"name": "utah", "sentiment": "none"}], "organizations": [{"name": "lifevantage", "sentiment": "none"}, {"name": "lifevantage corp", "sentiment": "none"}, {"name": "securities litigation", "sentiment": "none"}, {"name": "lifevantage corp.", "sentiment": "none"}, {"name": "united states district court for the district of utah", "sentiment": "none"}, {"name": "district of utah", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SALT LAKE CITY, Jan. 08, 2018 (GLOBE NEWSWIRE) -- This notice relates to a proposed voluntary dismissal by the plaintiffs in each of four pending shareholder derivative actions, and is being given pursuant to an order of The United States District Court for the District of Utah. The purpose of the notice is to advise LifeVantage shareholders that plaintiffs in the below-referenced actions wish to voluntarily dismiss their cases. Additional information on the actions and right to intervene may be found below.\nTHE SECURITIES CLASS ACTION\nAs previously reported, on September 15, 2016, a purported securities class action was filed in the United States District Court for the District of Utah, entitled Zhang v. LifeVantage Corp. , Case No. 2:16-cv-00965-BCW (D. Utah filed Sept. 15, 2016). In this action (later recaptioned as In re LifeVantage Corp. Securities Litigation ), plaintiff alleged that the Company, its Chief Executive Officer and former Chief Financial Officer violated Sections 10(b) and/or 20(a) of the Securities Exchange Act of 1934, 15 U.S.C. §§ 78j(b), 78t(a), and Rule 10b-5, 17 C.F.R. § 240.10b-5, promulgated thereunder. On June 15, 2017, the Court granted defendants’ motion to dismiss the amended complaint, without prejudice, and permitted lead plaintiffs to file a motion for leave to file a second amended complaint. On September 18, 2017, the Court denied lead plaintiffs’ motion for leave to amend and entered final judgment in favor of LifeVantage and the other defendants and dismissing the case with prejudice. On October 17, 2017, the parties executed a stipulation whereby lead plaintiffs agreed not to take an appeal from the final judgment of dismissal in favor of defendants in exchange for mutual releases, without payment of any consideration by or on behalf of defendants. This case is now concluded.\nTHE SHAREHOLDER DERIVATIVE ACTIONS\nAlso, as previously reported, on October 11, 2016, two purported shareholder derivative actions were filed in the Third District Court of the State of Utah, Salt Lake County, entitled Johnson v. Jensen , Case No. 160906320 MI (Utah Dist. filed Oct. 11, 2016), and Rupp v. Jensen , Case No. 160906321 MI (Utah Dist. filed Oct. 11, 2016). In these actions (which are substantively identical), plaintiffs, purportedly on behalf of the Company, alleged that the Company's Chief Executive Officer, former Chief Financial Officer and members of the board of directors breached their fiduciary duties owed to the Company in connection with the matters alleged in the securities class action lawsuit noted above. On October 19, 2016, the Court entered an order consolidating the two actions under the Johnson case number, with the new caption In re LifeVantage Corp. Derivative Litigation . On January 10, 2017, the Court approved a stipulation between the parties providing that this action would be deferred ( i.e. , stayed) pending a ruling on defendants’ then-anticipated motion to dismiss the amended complaint in the securities class action lawsuit noted above.\nOn January 30, 2017, another purported shareholder derivative action was filed in the United States District Court for the District of Utah, entitled Hansen v. Jensen , Case No. 2:17 cv-00075-DN (D. Utah filed Jan. 30, 2017). In this action, plaintiff, purportedly on behalf of the Company, alleged that the Company’s Chief Executive Officer, former Chief Financial Officer and members of the board of directors violated Section 14(a) of the Securities Exchange Act of 1934, 15 U.S.C. § 78n(a), and breached their fiduciary duties owed to the Company in connection with the matters alleged in the securities class action lawsuit noted above. On March 30, 2017, the parties entered into a stipulation providing that this action would be stayed pending a ruling on defendants’ motion to dismiss the amended complaint in the securities class action lawsuit noted above. On February 27, 2017, another purported shareholder derivative action was filed in the United States District Court for the District of Utah, entitled Baker v. Jensen , Case No. 2:17-cv-00141-PMW (D. Utah filed Feb. 27, 2017). Also, on April 24, 2017, another purported shareholder derivative action was filed in the United States District Court for the District of Utah, entitled Inforzato v. Jensen , Case No. 2:17-cv-00317-JNP (D. Utah filed Apr. 24, 2017). In these actions, plaintiffs, also purportedly on behalf of the Company, made similar allegations as the plaintiff in Hansen v. Jensen , described above. The parties in Baker and Inforzato similarly agreed to stays of those actions pending a ruling on defendants’ motion to dismiss in the securities class action lawsuit noted above.\nVOLUNTARY DISMISSAL OF THE SHAREHOLDER DERIVATIVE ACTIONS\nFollowing and in light of the dismissal with prejudice of the securities class action lawsuit noted above, the Company requested that the plaintiffs in the shareholder derivative actions agree to dismiss their lawsuits voluntarily and without payment of any consideration by or on behalf of defendants or the Company. Thus, on October 31, 2017, the plaintiffs in In re LifeVantage Corp. Derivative Litigation stipulated to voluntary dismissal of their consolidated action without payment of any consideration by or on behalf of defendants or the Company. On November 17, 2017, the parties in Inforzato , Hansen and Baker stipulated to voluntary dismissal of those actions without payment of any consideration by or on behalf of defendants or the Company.\nOn November 27, 2017, the Court in Inforzato ordered, pursuant to Rule 23.1(c) of the Federal Rules of Civil Procedure, that the parties give notice to shareholders of the voluntary dismissal without prejudice of the Inforzato action before the Inforzato action could be dismissed. The Company also is providing notice herein of the voluntary dismissal without prejudice of In re LifeVantage Corp. Derivative Litigation , the Baker action and the Hansen action.\nTHE RIGHT TO INTERVENE IN THE INFORZATO ACTION\nAny LifeVantage shareholder may seek to intervene as a plaintiff in the Inforzato action if he, she, or it (1) owns shares in LifeVantage and (2) wishes to pursue the claims in Inforzato or has any reason why any of the aforementioned actions should not be voluntarily dismissed without prejudice. All motions to intervene must be filed with the clerk of the court within thirty (30) days hereof. Every motion to intervene must contain: (1) the caption of the Inforzato action; (2) the intervenor’s name, address and phone number; (3) proof or certification of the date the intervenor purchased LifeVantage stock; and (4) any supporting papers, including all documents and writings that the intervenor desires the Court to consider.\nAny motions to intervene must be filed with the District Court at:\nClerk of Court\nUnited States District Court for the District of Utah\n351 South West Temple, Rm. 1.100\nSalt Lake City, Utah 84101\nA copy of any motion to intervene must also be mailed to:\nMilo Steven Marsden\nDorsey & Whitney LLP\n111 South Main Street, Suite 2100\nSalt Lake City, UT 84111-2176\nJohn P. Stigi III\nSheppard, Mullin, Richter & Hampton, LLP\n1901 Avenue of the Stars, Sui", "external_links": ["https://www.globenewswire.com/Tracker?data=WTSzBwMl02p7gXgkcAHAdbdxtEA0iKmktERr9sVhQ1D64D0cB5jnmCiGiPKf68pRISt4PmgDC-q-a_lf6WBXjT3lgURNP1FiBE4Es-WyovE=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/0a4e0557-7f26-4cc2-a809-4b32c6b0c2d1"], "published": "2018-01-08T16:30:00.000+02:00", "crawled": "2018-01-08T18:50:28.010+02:00", "highlightTitle": ""}