{"organizations": [], "uuid": "bf65aa55fd9c891c5a4da7ff35e3bb9cc58aeb80", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221151824&w=1200&r=LYNXMPEE0A16K", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-usa-congress-surveillance/u-s-house-to-vote-to-renew-nsas-internet-surveillance-program-idUSKBN1F01XD", "country": "US", "domain_rank": 408, "title": "U.S. House to vote to renew NSA's internet surveillance program", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T16:11:00.000+02:00", "replies_count": 0, "uuid": "bf65aa55fd9c891c5a4da7ff35e3bb9cc58aeb80"}, "author": "", "url": "https://www.reuters.com/article/us-usa-congress-surveillance/u-s-house-to-vote-to-renew-nsas-internet-surveillance-program-idUSKBN1F01XD", "ord_in_thread": 0, "title": "U.S. House to vote to renew NSA's internet surveillance program", "locations": [], "entities": {"persons": [{"name": "dusti", "sentiment": "negative"}, {"name": "barack obama", "sentiment": "none"}, {"name": "edward snowden", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "volz", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "house", "sentiment": "negative"}, {"name": "nsa", "sentiment": "negative"}, {"name": "u.s. house", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "house of representatives", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "national security agency", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - The U.S. House of Representatives on Thursday passed a bill to renew the National Security Agency’s warrantless internet surveillance program, overcoming objections from privacy advocates and confusion prompted by morning tweets from President Donald Trump that initially questioned the spying tool. \nThe legislation, which passed 256-164 and split party lines, is the culmination of a yearslong debate in Congress on the proper scope of U.S. intelligence collection - one fueled by the 2013 disclosures of classified surveillance secrets by former NSA contractor Edward Snowden. \nSenior Democrats in the U.S. House of Representatives had urged cancellation of the vote after Trump appeared to cast doubt on the merits of the program, but Republicans forged ahead. \nTrump initially said on Twitter that the surveillance program, first created in secret after the Sept. 11, 2001, attacks and later legally authorized by Section 702 of the Foreign Intelligence Surveillance Act, had been used against him but later said it was needed. \nSome conservative, libertarian-leaning Republicans and liberal Democrats attempted to persuade colleagues to include more privacy protections. They failed on Thursday to pass an amendment to include a warrant requirement before the NSA or other intelligence agencies could scrutinize communications belonging to Americans whose data is incidentally collected. \nThursday’s vote was a major blow to privacy and civil liberties advocates, who just two years ago celebrated passage of a law effectively ending the NSA’s bulk collection of U.S. call records, another top-secret program exposed by Snowden. \nThe bill as passed by the House would extend the NSA’s spying program for six years with minimal changes. Some privacy groups said it would actually expand the NSA’s surveillance powers. \nMost lawmakers expect it to become law, although it still would require Senate approval and Trump’s signature. Republican Senator Rand Paul and Democratic Senator Ron Wyden immediately vowed to filibuster the measure but it was unclear whether they could convince enough colleagues to force changes. \nThe White House, U.S. intelligence agencies and Republican leaders in Congress have said they consider the surveillance program indispensable and in need of little or no revision. \nBefore the vote a tweet from Trump had contradicted the official White House position and renewed unsubstantiated allegations that the previous administration of Barack Obama improperly surveilled his campaign during the 2016 election. \nFILE PHOTO: A man is silhouetted near logo of the U.S. National Security Agency (NSA) in this photo illustration taken in Sarajevo March 11, 2015. REUTERS/Dado Ruvic/File Photo “This is the act that may have been used, with the help of the discredited and phony Dossier, to so badly surveil and abuse the Trump Campaign by the previous administration and others?” the president said in a tweet. \n“WE NEED IT!” \nThe White House did not immediately respond to a request to clarify Trump’s tweet but he posted a follow-up less than two hours later, after speaking on the phone with House Republican leader Paul Ryan. \n“With that being said, I have personally directed the fix to the unmasking process since taking office and today’s vote is about foreign surveillance of foreign bad guys on foreign land. We need it! Get smart!” Trump tweeted. \nAn illustration picture shows the logo of the U.S. National Security Agency on the display of an iPhone in Berlin, June 7, 2013. REUTERS/Pawel Kopczynski Unmasking refers to the largely separate issue of how Americans’ names kept secret in intelligence reports can be revealed. \nAfter the vote Thursday, Ryan, asked about his conversation with the president, said Trump’s concerns regarded other parts of the law. \n“It’s well known that he has concerns about the domestic FISA law. That’s not what we’re doing today. Today was 702, which is a different part of that law ... He knows that and he, I think, put out something that clarifies that,” Ryan told reporters. \nAsked by Reuters at a conference in New York about Trump’s tweets, Rob Joyce, the top White House cyber official, said there was no confusion within Oval Office about the value of the surveillance program and that there have been no cases of it being used improperly for political purposes. \nWithout congressional action, legal support for Section 702 will expire next week, although intelligence officials say it could continue through April. \nSection 702 allows the NSA to eavesdrop on vast amounts of digital communications from foreigners living outside the United States through U.S. companies such as Facebook Inc, Verizon Communications Inc and Alphabet Inc’s Google. \nThe spying program also incidentally scoops up communications of Americans if they communicate with a foreign target living overseas, and can search those messages without a warrant. \nReporting by Dustin Volz; Additional reporting by David Shepardson, Patricia Zengerle, Richard Cowan and Mohammad Zargham; Editing by Lisa Von Ahn and Bill Trott\n ", "external_links": [], "published": "2018-01-11T16:11:00.000+02:00", "crawled": "2018-01-11T16:32:47.004+02:00", "highlightTitle": ""}