{"organizations": [], "uuid": "cbb99864e883b5b801218b564f163d7744218ba3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/06/dropboxfacility_-6-14-17.png", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/11/dropbox-ipo-2/", "country": "US", "domain_rank": 1196, "title": "Dropbox Has Filed Confidentially for IPO, Report Says | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.104, "site_type": "news", "published": "2018-01-11T14:51:00.000+02:00", "replies_count": 0, "uuid": "cbb99864e883b5b801218b564f163d7744218ba3"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/11/dropbox-ipo-2/", "ord_in_thread": 0, "title": "Dropbox Has Filed Confidentially for IPO, Report Says | Fortune", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "est  dropbox inc.", "sentiment": "neutral"}, {"name": "goldman sachs group inc.", "sentiment": "none"}, {"name": "jpmorgan chase & co.", "sentiment": "none"}, {"name": "snap inc.", "sentiment": "none"}, {"name": "ipo", "sentiment": "none"}, {"name": "jpmorgan", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg 12:51 PM EST \nDropbox Inc., the file-sharing private company valued at $10 billion, has filed confidentially for a U.S. initial public offering, people familiar with the matter said. \nGoldman Sachs Group Inc. and JPMorgan Chase & Co. will lead the potential listing, according to the people, who asked not to be identified because the filing wasn’t public. Dropbox is talking to other banks this month to fill additional roles on the IPO, the people said. The company is aiming to list in the first half of this year, one of the people said. \nRepresentatives for Dropbox, Goldman Sachs and JPMorgan declined to comment. \nA share sale by San Francisco-based Dropbox, one of a closely watched group of high-profile private tech companies with multibillion-dollar valuations, would follow Snap Inc.’s disappointing step into the public markets. How the stock fares post-listing will be an ongoing focus for both Wall Street and the tech community — Snap shares are down 15 percent from its IPO last March. \nUnlike money-losing Snap, Dropbox will come to the table with annualized sales of more than $1 billion, Chief Executive Officer Drew Houston said in an interview last year. It’s also been profitable, excluding interest, taxes, depreciation and amortization. Those benchmarks are the product of more than two years of focusing the company, expanding its product suite for businesses and reining in expenses, Houston said at the time. Goldman, JPMorgan \nDropbox could be one of the biggest U.S. enterprise technology companies to list domestically in recent years. First Data Corp. went public at a market value of about $14 billion in 2015 — the biggest such IPO in the past five years. \nThe two lead banks have a history of working with Dropbox. Goldman Sachs advised the company on earlier funding rounds and extended the company credit, while JPMorgan led a $600 million credit line to Dropbox last year, the people said. \nDropbox achieved its $10 billion private valuation in its last private funding round in 2014. While it’s uncertain whether the company will be able to initially sell shares above that valuation, the stock could trade higher once it’s public, the people said. \nTaking on the risk of lending to a private company can typically help a firm’s chances in underwriting an eventual IPO. JPMorgan led a credit line extended to Dropbox, along with Goldman Sachs, Bank of America Corp. , Deutsche Bank AG, Macquarie Group Ltd. and Royal Bank of Canada, people familiar with the matter said last March. \nGoldman Sachs had been helping the company prepare IPO documents. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-11T14:51:00.000+02:00", "crawled": "2018-01-11T19:55:16.000+02:00", "highlightTitle": ""}