{"organizations": [], "uuid": "4a9f98e22b7a76a6db40aef6accb24b1688eecb3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/news/world", "section_title": "World News | Reuters.com", "url": "https://www.reuters.com/article/us-germany-antisemitism/migrants-must-visit-nazi-concentration-camps-germanys-jewish-council-says-idUSKBN1EZ1O4", "country": "US", "domain_rank": 408, "title": "Migrants must visit Nazi concentration camps, Germany's Jewish council says", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-10T21:52:00.000+02:00", "replies_count": 0, "uuid": "4a9f98e22b7a76a6db40aef6accb24b1688eecb3"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-germany-antisemitism/migrants-must-visit-nazi-concentration-camps-germanys-jewish-council-says-idUSKBN1EZ1O4", "ord_in_thread": 0, "title": "Migrants must visit Nazi concentration camps, Germany's Jewish council says", "locations": [], "entities": {"persons": [{"name": "josef schuster", "sentiment": "none"}, {"name": "schuster", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "sawsan chebli", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "jerusalem", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}], "organizations": [{"name": "nazi", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "deutschlandfunk", "sentiment": "none"}, {"name": "central council of jews", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BERLIN (Reuters) - New migrants to Germany must visit Nazi concentration camp memorials to help tackle a perceived rise in anti-Semitism, Germany’s Central Council of Jews said on Wednesday, supporting a proposal by a Palestinian-German politician.\nAnti-Semitism remains a sensitive issue in Germany, one of Israel’s closest allies, more than 70 years after the end of the Nazi-era Holocaust, in which 6 million Jews were killed.\nThe government decried as shameful the spectacle of the Israeli flag being burned at demonstrations last month against U.S. President Donald Trump’s decision to recognize Jerusalem as Israel’s capital.\nJosef Schuster, head of the Central Council of Jews expressed support for a proposal by Sawsan Chebli, a Berlin state senator, for mandatory visits by newly arrived refugees to Nazi concentration camps memorials.\n“People who have fled to us who have themselves had to escape or been expelled, can develop empathy in such memorials,” Schuster told Deutschlandfunk radio on Wednesday.\nGermany has received well over a million migrants fleeing war and poverty in the Middle East and Africa.\nGermany is home today to an estimated 200,000 Jews and has built a reputation in recent decades as a tolerant, safe place for Jews to live - though data shows anti-Semitic crimes reported to the police rose 4 percent to 681 in the first eight months of 2017 from the same period in 2016.\n“It makes sense for everyone living in this country to be obliged to visit a concentration camp memorial site at least once in their lives,” Chebli told Bild am Sonntag newspaper on Sunday when she first floated the proposal.\nShe said such visits, long a staple of high school education in a country determined that the lessons of its history not be forgotten, should also be extended to new migrants, who should make trips as part of their compulsory integration courses.\nCurrently, the integration courses focus on learning the German language and about Germany’s history, culture and its legal system\nAsked about the possibility of mandatory visits to concentration camps, a spokeswoman for the Federal Office for Migration and Refugees ministry said the integration course for immigrants already had a module regarding the consequences of the Nazi rule for the people of Germany and Europe.\nLast month, Germany’s justice minister called for more emphasis on the Holocaust in migrants’ integration courses.\nSchuster said everyone who wanted to live permanently in Germany must identify with its history.\nSuch visits, which should be prepared by schools, would show where anti-Semitism and hatred for Jews could lead, he said.\nReporting by Riham Alkousaa; Editing by Alison Williams\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-10T21:52:00.000+02:00", "crawled": "2018-01-10T16:03:16.012+02:00", "highlightTitle": ""}