{"organizations": [], "uuid": "4e2c85c3c0e9abcf20238bda118a174c0126989b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224542261&w=1200&r=LYNXMPEE0M1JA", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/venezuela-politics/venezuela-presidential-vote-likely-by-end-of-april-idINKBN1FC2HZ", "country": "US", "domain_rank": 408, "title": "Venezuela to hold presidential vote by end of April", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T21:15:00.000+02:00", "replies_count": 0, "uuid": "4e2c85c3c0e9abcf20238bda118a174c0126989b"}, "author": "", "url": "https://in.reuters.com/article/venezuela-politics/venezuela-presidential-vote-likely-by-end-of-april-idINKBN1FC2HZ", "ord_in_thread": 0, "title": "Venezuela to hold presidential vote by end of April", "locations": [], "entities": {"persons": [{"name": "alexandra ulmer", "sentiment": "none"}, {"name": "maduro", "sentiment": "none"}, {"name": "nicolas maduro", "sentiment": "none"}, {"name": "hugo chavez", "sentiment": "none"}, {"name": "vivian sequera", "sentiment": "none"}], "locations": [{"name": "venezuela", "sentiment": "none"}], "organizations": [{"name": "min read  caracas", "sentiment": "none"}, {"name": "diosdado cabello", "sentiment": "none"}, {"name": "socialist party", "sentiment": "none"}, {"name": "constituent assembly", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CARACAS (Reuters) - Venezuelan President Nicolas Maduro looked sure to stand for re-election in a presidential vote due by the end of April where the ruling Socialists hope to trump a squabbling opposition despite an economic crisis and foreign sanctions.\nThe unpopular leader, whom foes decry as a dictator who has wrecked the OPEC member’s economy, said he would run if the ruling Socialist Party asked him, even as Venezuelans reel from empty shelves and the world’s fastest inflation.\n“I‘m ready to be a candidate,” he told reporters during a rally of cheering red-shirted supporters in Caracas.\nThe 55-year-old former bus driver and union leader, who succeeded Hugo Chavez in 2013, benefits from a formidable political machinery, a compliant national election board, and a hard core of support from poor Venezuelans reliant on state food handouts.\n“We only have one candidate!” Socialist Party No. 2 Diosdado Cabello told the pro-government Constituent Assembly superbody legislature in an obvious reference to Maduro.\nCritics from opposition politicians to Western powers doubt authorities will allow a free and fair vote, given the barring of some opposition figures from running plus abuse of state resources in campaigning.\nSome fear outright fraud.\n“These are not elections, it’s a military occupation with a fraudulent election board,” said hardline opposition activist Maria Corina Machado, referring to the armed forces’ major role in government and the board’s past pro-Maduro stance.\nAnnouncing the presidential poll would be held by the end of April, the Constituent Assembly said another election in Venezuela was further evidence of its democratic credentials despite a recent raft of international sanctions.\nThe United States, Canada, and the European Union have all taken measures against Venezuela’s government over rights and corruption allegations, hurting the government’s image and spooking banks from working with Caracas.\n“If the world wants to apply sanctions, we will apply elections,” added the feisty Cabello, whom some had seen as a potential rival to Maduro for the presidency.\nVenezuela's President Nicolas Maduro (R) greets supporters as he arrives for an event with women at Miraflores Palace in Caracas, Venezuela January 19, 2018. Miraflores Palace/Handout via REUTERS Should the vote be perceived as fraudulent, further foreign sanctions could come, including from U.S. President Donald Trump who has made opposition to Maduro a prominent feature of his foreign policy.\nMore economic measures, however, would worsen a recession now in its fifth year amid rising malnutrition, disease, and emigration to Latin American neighbours.\nWHO WILL TAKE ON MADURO?\nDemonstrators are seen through a Venezuelan flag during a rally against Venezuela's government as members of Lima Group nations meet in Santiago, Chile January 23, 2018. REUTERS/Ivan Alvarado It is unclear whom the Democratic Unity opposition coalition would attempt to field.\nIts most popular leaders are almost all sidelined from politics - jailed, in exile, or barred from holding office. Months of protests last year failed to dislodge Maduro but resulted in at least 125 deaths.\n“The majority of Venezuelans loathe his government and his circle. If our people are allowed to decide, they are out!” one opposition leader, Henrique Capriles, said.\nCapriles, a two-time presidential candidate, is prohibited from holding office over allegations of “administrative irregularities”. Former mayor Leopoldo Lopez is under house arrest for leading protests against Maduro, while his young protege Freddy Guevara has taken refuge in the Chilean embassy to avoid charges of plotting against Maduro.\nRelated Coverage Factbox: Venezuela's jailed, exiled or barred opposition politicians Henry Ramos, the former head of the opposition-led congress, is widely mistrusted among Maduro’s foes due to perceptions of having cut deals with the ruling party.\nThe coalition plans to hold primary elections to choose a candidate. They could also succumb to in-fighting about what conditions to accept in the vote.\nDuring the governors’ election of last October, opposition candidates for the first time gave convincing evidence that elections authorities had altered results in one state, though Maduro scoffed at that and said the system was the cleanest in the world.\nWith cynicism towards all politicians running high among Venezuelans, many are clamouring for a nontraditional, outside candidate. The name of Lorenzo Mendoza, billionaire head of private food company Polar, is on many people’s lips, but he has given no indication of wanting to stand.\nAdditional reporting by Brian Ellsworth, Eyanir Chinea, Corina Pons and Andreina Aponte; writing by Alexandra Ulmer and Andrew Cawthorne; editing by Matthew Lewis and Grant McCool\n ", "external_links": [], "published": "2018-01-23T21:15:00.000+02:00", "crawled": "2018-01-23T21:44:47.013+02:00", "highlightTitle": ""}