{"organizations": [], "uuid": "68ce8e0c41b55dd246bf85bc9e8774ac95c88852", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/01/21/101351378-ken-rogoff.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/23/rogoff-banks-dont-even-have-a-plan-a-for-another-financial-crisis.html", "country": "US", "domain_rank": 767, "title": "Rogoff: Banks 'don't even have a plan A' for another financial crisis", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.024, "site_type": "news", "published": "2018-01-23T11:24:00.000+02:00", "replies_count": 0, "uuid": "68ce8e0c41b55dd246bf85bc9e8774ac95c88852"}, "author": "Natasha Turak", "url": "https://www.cnbc.com/2018/01/23/rogoff-banks-dont-even-have-a-plan-a-for-another-financial-crisis.html", "ord_in_thread": 0, "title": "Rogoff: Banks 'don't even have a plan A' for another financial crisis", "locations": [], "entities": {"persons": [{"name": "rogoff", "sentiment": "negative"}, {"name": "patrick bucci", "sentiment": "negative"}, {"name": "ken rogoff", "sentiment": "negative"}, {"name": "kenneth rogoff", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "harvard un", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "negative"}, {"name": "public policy and professor of economics", "sentiment": "negative"}, {"name": "harvard", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Patrick Bucci | CNBC Ken Rogoff, Professor of Public Policy and Professor of Economics at Harvard University. \nFinancial institutions have fewer tools to deal with a crisis than ever before, according to Kenneth Rogoff. \nBut the Harvard economics professor said Tuesday he remains optimistic that a financial crash isn't imminent. \n\"If we have another financial crisis, there isn't even a plan A,\" with regard to what central banks would do, Rogoff told an audience during a panel entitled \"The Next Financial Crisis\" at the World Economic Forum (WEF) in Davos, Switzerland. \nStill, he said, \"I don't feel this time is different. We're still coming out of the last financial crisis,\" adding that a deep and systemic financial crisis has a long afterlife, and taking a decade to recover is not abnormal. \n\"I'm not going to tell you there's not going to be another financial crisis, but I'm kind of optimistic going forward with where the world economy is at the moment. Could there be a financial crisis? Of course. But I think we're at the tail end of the last one in a pretty typical trajectory.\" \nHowever, Rogoff warned that banks should remain on their guard. \n\"When you see debt rising at an aggressive pace, you should definitely look out for that,\" he said. \"If something pushed up interest rates, if they went up in the places that had a lot of debt like Italy and Japan, some emerging markets, they could have a lot of problems.\" \nHigh global debt was frequently touched on during the panel discussion. \nA major point of debate this year is whether global markets are on course for implosion. As the Dow Jones and S&P 500 continue to hit record highs, concerns abound that overheated markets may be headed for financial crisis. \n\"It is not hard to imagine a stock price collapse -- it's built on price growth but also very low interest rates, and I don't know how everything from art to bitcoin will react,\" Rogoff added. \nFinancial experts and investors are divided between bullish optimism on further growth and fears of a market crash as major world indexes are seeing their highest valuations in history. \nThe panel's topics included concerns over leverage and liquidity, implications of passive investing, and transforming financial services business models. \nMore than 2,500 guests made up of billionaires, world leaders, celebrities and investors are gathered this week at the Swiss mountain resort to discuss the state of the world, covering topics like climate change, inequality and technology disruption. show chapters", "external_links": [], "published": "2018-01-23T11:24:00.000+02:00", "crawled": "2018-01-23T11:26:42.000+02:00", "highlightTitle": ""}