{"organizations": [], "uuid": "4158212a6b5aa9e2d59c770b5a33464fd7993e21", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/17/104591426-RTS147UK-nafta.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/03/well-find-out-whether-trump-is-actually-tough-on-trade-this-month.html", "country": "US", "domain_rank": 767, "title": "We'll find out whether Trump is actually tough on trade this month", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.021, "site_type": "news", "published": "2018-01-03T20:06:00.000+02:00", "replies_count": 0, "uuid": "4158212a6b5aa9e2d59c770b5a33464fd7993e21"}, "author": "Kayla Tausche", "url": "https://www.cnbc.com/2018/01/03/well-find-out-whether-trump-is-actually-tough-on-trade-this-month.html", "ord_in_thread": 0, "title": "We'll find out whether Trump is actually tough on trade this month", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}], "locations": [{"name": "south korea", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "trump administration", "sentiment": "none"}, {"name": "nafta", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Trump Administration is staring down a half-dozen deadlines on trade policy that will create a moment of truth for the White House, which has so far opted for long-term investigations and renegotiations over immediate challenges to the status quo.\nJanuary could change that.\nThe month is book-ended by contentious trade negotiations with South Korea, beginning Jan. 5 in Washington, and with Mexico and Canada, beginning Jan. 23 in Montreal. By mid-January, Pres. Trump must decide whether to punish exporters of cheap steel and aluminum that threaten American producers, the subject of a nine-month national security investigation. By late January, Pres. Trump must decide whether to levy fines on Chinese solar panel producers. A decision on washing machine tariffs is due early February.\nA separate, draft report is circulating among agencies on Chinese violations of US intellectual property — an issue that figured prominently in the National Security Strategy — is said to contain \"muscular\" recommendations. An administration official tells CNBC the recommendations are still being discussed, but could be made public this month.\nStrict enforcement actions against China and unpredictable negotiations on free-trade agreements may align with President Trump's populist preferences on trade, but the business community and Republican lawmakers have warned of the economic consequences of letting the pendulum swing too far.\n\"To date, the Trump Presidency has been marked by strong growth and job creation and rising business confidence. Withdrawing from trade agreements or raising tariffs puts that momentum at risk,\" said John Murphy, senior vice president for international policy at the U.S. Chamber of Commerce. \"The White House has a choice here: Take aggressive action on longstanding trade concerns or double down on economic growth.\"\nA White House official pointed to trade as part of a \"bigger picture\" for the economy, with cabinet-level discussions described as \"deliberative\" and the President focused on doing right by American workers.\nBut as the White House considers its choices, battle lines have been forming on two fronts.\nThe first is between congressional Republicans who support free trade and the hawks advising the President to withdraw from multilateral trade agreements and instill tariffs. Such advisers had been pushing Trump to take action against China on steel or intellectual property before his November trip to Asia. Citing tax reform sensitivity, diplomatic efforts and national security, centrist aides moved to postpone any potential action, sources familiar with the matter said.\nThe White House moved to shelve its most rancorous trade rhetoric toward the end of the year in an effort to preserve GOP relationships as tax reform neared passage. Expecting the truce would be temporary, GOP senators and governors began seeking reassurances in December from the Administration that it would not withdraw from NAFTA as talks enter their final stretch in early 2018.\n\" The Montreal round has become make or break,\" said Matt McAlvanah, principal at Monument Policy Group and former Assistant U.S Trade Representative. \"If there is little or no progress made in Montreal it's hard to see how a deal comes together by the administration's March deadline.\"\nWithdrawal is not an outcome that fazes Amb. Robert Lighthizer, the top US trade official; at a briefing with reporters following the October round, Lighthizer said, \"If we end up not having an agreement, my guess is all three countries will do just fine.\"\nRebecca Cook | Reuters A semi truck headed for Windsor, Ontario, drives onto the Ambassador bridge in Detroit, Michigan. At a White House meeting on Dec. 5, a heated exchange took place between Sen. Lamar Alexander (R-Tenn.) and Lighthizer, the top US trade official. Alexander, who had been defending NAFTA's positive impact on the automotive industry, challenged Lighthizer to name a senator who would support withdrawing from the pact. Lighthizer, according to a person briefed on the meeting, could not.\nA White House official said it would be premature to discuss whether the U.S. would initiate withdrawal talks when the three countries convene this month, and a second official said there are \"notional\" dates being discussed for future talks in February and March.\nIn charting his trade agenda, Pres. Trump must also balance the interests of two industries with heavy presence in states that voted for him: Manufacturing and agriculture.\nPrivate sector advisory reports have shown manufacturers and labor unions in support of the strict approach the Administration has taken in its talks with NAFTA partners and Korea. And one specific NAFTA proposal that so far hasn't sit well with Mexico and Canada - requiring automobiles to have 50 percent of parts come from the US - is a direct overture to US factory workers.\nYet in recent months, the agricultural community has warned that such proposals, met with resistance by Mexico and Canada, could put a deal — and their business — at risk.\nJeff Schwager employs 530 people at Sartori Company, which exports cheese to 50 countries. He says withdrawing from NAFTA would erase half his business in Mexico and Canada, and cut revenues by at least 2 percent overall.\n\"Canada and Mexico are both excellent trading partners, and if we can't work with the countries that are so close to us, it makes it even harder for the ones that are farther away,\" Schwager tells CNBC.\nKent Bacus of the National Cattlemen's Beef Association says it's hard to brace for impact without knowing what the US will do.\n\"I don't know how you have a plan B to lose a billion dollar market, and that's really something that's concerning us,\" Bacus told CNBC. \"We stand to lose more than we stand to gain.\"\nThe industry chasm exists on the China front, too.\nAmerican steel and aluminum producers would cheer tariffs on Chinese exporters after years of watching prices get suppressed due to oversupply. But Nicholas Lardy of Peterson Institute for International Economics says China could target US agriculture in retaliation. Roughly 40% of the US soybean crop, concentrated in farm belt states like Indiana, Wisconsin and Iowa, is exported to China.\n\"If we lose that market, the price will plummet,\" Lardy said.\nPresident Trump will speak to the Farm Bureau convention on Jan. 8, an address that may hold some tea leaves for how he plans to approach this month's slate of decisions.\nTRADE DEADLINES LOOMING January 5: Talks resume with Korea to modernize trade deal January 14/15: – Deadline for Commerce Dept. recommendations on whether steel imports threaten US national security January 21/22: Deadline for Commerce Dept. recommendations on whether aluminum imports threaten U.S. national security. January 26: Deadline for President Trump's decision on solar panel tariffs January 28: Trade ministers from US, Canada and Mexico close sixth round of NAFTA talks February 1: ITC's final decision due on Boeing v. Bombardier February 4: Deadline for President Trump's decision on washing machine tariffs TBD: Penalties imposed on China's intellectual property abuses\n— Stephanie Dhue contributed reporting.", "external_links": [], "published": "2018-01-03T20:06:00.000+02:00", "crawled": "2018-01-03T20:07:00.000+02:00", "highlightTitle": ""}