{"organizations": [], "uuid": "6a6ce90e34234684cabaf7455475d9afa4e8dd30", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 19, "shares": 19, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-china-harassment-insight/chinas-metoo-movement-in-colleges-initially-encouraged-by-authorities-then-frustrated-idUSKBN1FJ33W", "country": "US", "domain_rank": 408, "title": "China's #MeToo movement in colleges initially encouraged by authorities, then frustrated", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T01:13:00.000+02:00", "replies_count": 0, "uuid": "6a6ce90e34234684cabaf7455475d9afa4e8dd30"}, "author": "", "url": "https://www.reuters.com/article/us-china-harassment-insight/chinas-metoo-movement-in-colleges-initially-encouraged-by-authorities-then-frustrated-idUSKBN1FJ33W", "ord_in_thread": 0, "title": "China's #MeToo movement in colleges initially encouraged by authorities, then frustrated", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING (Reuters) - After declaring they were ready to fight sexual harassment on university campuses, the Chinese authorities now appear to be seeking to contain a nascent #MeToo movement.\nOn Jan. 14, China’s education ministry announced it had stripped a professor at Beihang University in Beijing, who is facing sexual harassment allegations, of an academic title and said it will not tolerate activity that harms students and will look into setting up a robust mechanism to prevent sexual harassment.\nA week later, more than fifty professors put their names to an online proposal calling for a detailed and strict set of rules to combat campus sexual harassment.\nBut a march planned that day from Beihang to the University of International Business and Economics (UIBE), another Beijing school where a professor has faced accusations of harassment, was canceled by organizers, two sources involved in its planning told Reuters.\nThe organizers declined to say why it was called off, but three would-be participants, who asked not to be named due to the sensitivity of the matter, said they were told by their school not to attend. Neither university would comment on the proposed march.\nThere has also been censorship of online postings supporting the #MeToo movement and some universities have warned students to tone down the campaign, according to women rights activists and students.\nThe education ministry declined to respond to phone calls and faxes seeking comment.\nThe authorities have been slowly acknowledging in state-media commentaries that there is a systematic problem of sexual harassment on Chinese college campuses.\nOn Jan. 7, the Chinese Communist Party’s paper, the People’s Daily, said that victims of sexual harassment should be shown support if they go public with allegations, and the Guangming Daily, another official party publication, said on Jan. 17 that the issue of sexual harassment in education cannot be ignored.\nBut while the issue of sexual harassment has become increasingly high profile on campuses in China, there have - in contrast to the United States - been few public allegations of sexual harassment in other areas of Chinese society, including politics, business and entertainment.\nA third of Chinese college students say they have suffered sexual violence or sexual assault, according to data from the China Family Planning Association released in 2016, with the most common allegations being that they were harassed with sexual language and forced to kiss someone or suffered inappropriate touching.\nLOCKED THE DOOR The catalyst for a Chinese #MeToo-style movement came on Dec. 31 when Luo Xixi, a U.S.-based Chinese software engineer, published a blog post accusing Chen Xiaowu, a professor at Beihang, of sexual harassment.\nIn her post, Luo republished an account, originally run anonymously on Chinese website Zhihu.com in October 2017, of an evening 12 years ago when she alleges Chen had driven her to a house off-campus, locked the door and tried to force himself upon her. She said he relented when she started crying and said she was a virgin.\nAfter conducting an investigation, Beihang said Chen was found to have sexually harassed students and was removed from his positions at the university. The education ministry stripped him of a title soon after.\nBeihang declined to comment further.\nIn an interview with the Beijing Youth Daily published on Jan. 1, Chen said he had not broken any regulations and said the accuracy of the claims against him would be determined by the investigation. He has not spoken publicly since the investigation came to its conclusion.\nReuters was unable to contact Chen for comment.\nLuo told Reuters by phone that the responses of the university, state-media, the ministry and the Chinese public, have been overwhelmingly and unexpectedly positive.\nZhang Leilei (R), 25 and Xiao Meili, 28, pose in Guangzhou, China January 25, 2018. REUTERS/Staff She said the university initially had been slow to respond after she contacted them in October. “They would take action bit by bit, saying that they have not yet had instructions from above, that there is no relevant law and regulation, that there is no precedent to follow,” she said.\nBut once her named post went viral and the People’s Daily ran a commentary supporting her decision to go public, Beihang was swift to take action. “I was very satisfied with the speed of progress afterwards,” she said.\nThe response is very different from some by the authorities in the recent past. In 2015, authorities detained five activists, later dubbed the “Feminist Five,” who were planning to defy government warnings to demonstrate against sexual harassment on public transport for International Women’s Day. The activists were released a month later.\nMOLESTATION ALLEGATION A second recent allegation was made anonymously, also on Zhihu.com, against UIBE professor Xue Yuan who was accused by the poster of having molested a student and ripped her clothing in university dormitories.\nXue has not responded publicly to the accusations. Reuters was unable to contact him for comment.\nSlideshow (9 Images) UIBE launched an investigation into the accusations and it recalled Xue from overseas to aid in the probe, according to a statement from the university.\nUIBE did not respond to questions sent by Reuters.\nWomen’s rights activists applauded the ministry’s moves against Chen and UIBE’s investigation of Xue as a positive first step, but say they worry that online censorship and the authorities’ fears of grassroots movements causing social instability could prevent real change in dealing with sexual harassment at universities.\nThe ministry has not yet released regulations that provide a clear definition of sexual harassment, activists say.\nStudents have in recent weeks posted open letters on social media calling for better prevention of campus sexual harassment. So far, there are more than 70, with hundreds of signatures.\nBut Zhang Leilei, a women’s rights activist, told Reuters that some of the letters on social media calling attention to the issue have been deleted. Reuters independently confirmed this was the case.\nChinese authorities regularly censor discussion of issues that might spur collective action. The country’s cyberspace regulator did not respond to a request for comment.\nMore than 10 universities have also summoned students to warn them against drawing too much attention to their complaints, Zhang said.\nXiao Meili, an activist whose open letter early this month calling for better sexual harassment prevention at the Communication University of China has been used as a template by others, said authorities’ likely want to try to “stabilize” the movement.\n“If there was no censorship, if students were not called in for talks with their teachers, then the movement would be much wider and the conversation would be deeper,” she said.\nOne university in northern China warned student authors of an open letter not to post publicly about their demands for better harassment prevention measures as they might bring “dishonor” to the school, one of the students said, asking that their name and their school’s not be used.\nAnd an interview on harassment with Bai Benfeng, the head of Tsinghua University’s postgraduate student Communist Party organization, published on Jan. 22 by a university paper, had been removed by the following day.\nBai had said that Tsinghua, a top Chinese university, had a system where a single report of unethical behavior could jeopardize a teacher’s position, but that sexual harassment education was inadequate for both teachers and students.\nTsinghua did not respond to a request for comment.\nReporting by Christian Shepherd; Editing by Tony Munroe and Martin Howell\n ", "external_links": [], "published": "2018-01-31T01:13:00.000+02:00", "crawled": "2018-01-31T01:19:03.010+02:00", "highlightTitle": ""}