{"organizations": [], "uuid": "4cd0359a2cc363c2f6a47f6abfd34cbab44490f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-gritstone-oncology-appoints-jean-marc-bellemin-as-chief-financial-officer.html", "country": "US", "domain_rank": 767, "title": "Gritstone Oncology Appoints Jean-Marc Bellemin as Chief Financial Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T16:00:00.000+02:00", "replies_count": 0, "uuid": "4cd0359a2cc363c2f6a47f6abfd34cbab44490f5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-gritstone-oncology-appoints-jean-marc-bellemin-as-chief-financial-officer.html", "ord_in_thread": 0, "title": "Gritstone Oncology Appoints Jean-Marc Bellemin as Chief Financial Officer", "locations": [], "entities": {"persons": [{"name": "jean-marc bellemin", "sentiment": "negative"}, {"name": "andrew allen", "sentiment": "none"}, {"name": "gritstone", "sentiment": "none"}, {"name": "bellemin", "sentiment": "none"}], "locations": [{"name": "emeryville", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "emeryville", "sentiment": "none"}, {"name": "ca", "sentiment": "none"}], "organizations": [{"name": "gritstone oncology", "sentiment": "negative"}, {"name": "actelion pharmaceuticals usa", "sentiment": "none"}, {"name": "information technology", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "EMERYVILLE, Calif.--(BUSINESS WIRE)-- Gritstone Oncology, a next-generation personalized cancer immunotherapy company, announced today the appointment of Jean-Marc Bellemin as Executive Vice President of Finance and Chief Financial Officer, effective January 5, 2018.\nMr. Bellemin will lead Gritstone’s finance, accounting and investor relations functions, as well as Human Resources and Information Technology. He will report to Andrew Allen, M.D., Ph.D., President and CEO of Gritstone Oncology, and will be based in the company’s headquarters in Emeryville, CA.\nMr. Bellemin brings more than 23 years of international experience in finance and operations management within start-up and global commercial pharmaceutical organizations. Most recently, he was Senior Vice President and Chief Financial Officer of Actelion Pharmaceuticals USA, providing strategic leadership, plus financial and operations management of an international, profitable, publicly-traded biotechnology company. He led the long-term strategic process for the finance, project management, information technology and market access functions at Actelion until its acquisition by Johnson & Johnson in 2017.\nHis previous experience includes various leadership roles within the finance team over 11 years at Actelion in both Europe and the USA, and serving in financial management roles at GUERBET Pharmaceuticals, ELF AQUITAINE, Philips Electronic Company and Credit Lyonnais Bank. Mr. Bellemin holds a Bachelor of Science degree in Economics and Management from Paris Dauphine University, a Master’s degree in Finance and Accounting at Paris Sorbonne University and an M.B.A. from Essec Business School in Paris.\n“With a significant Series B financing raised last September, Gritstone is well-capitalized and will benefit particularly from Jean-Marc’s experience leading the finance function at Actelion USA, an internationally-renowned biotechnology company which grew from an R&D company into a very successful commercial one,” said Dr. Allen. “We are fortunate to have Jean-Marc join our team as we prepare for our lead personalized immunotherapy program to enter clinical development in 2018 and beyond.”\nAbout Gritstone Oncology\nGritstone Oncology is a privately-held, next-generation personalized cancer immunotherapy company. Gritstone brings together distinguished scientific founders, an experienced and diverse management team, a seasoned and successful board of directors and deep financial backing to tackle fundamental challenges at the intersection of cancer genomics, immunology, and immunotherapy design. The Company’s initial goal is to leverage artificial intelligence to identify and deploy therapeutic neoantigens from individual patients’ tumors to develop novel treatments for lung, gastric, and colorectal cancer. In addition to neoantigen therapy development, Gritstone is leveraging its unique antigen discovery platform, EDGE™ (Epitope Discovery of cancer GEnomes), to define targets for shared antigen immunotherapies, which would provide an opportunity to treat even more patients. Gritstone Oncology is headquartered in the San Francisco Bay Area with key functions located in Cambridge, MA and Pleasanton, CA. The company launched in October 2015 and has received funding from leading blue-chip biotechnology investors, including Versant Ventures, The Column Group, Clarus Funds, Frazier Healthcare Partners, RedMile, Casdin Capital, Lilly Asia Ventures, Trinitas Capital, GV, Alexandria Venture Investments, and Bay City Capital. More information can be found at www.gritstoneoncology.com or @gritstoneonc.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123005423/en/\n1AB\nDan Budwick, 973-271-6085\ndan@1abmedia.com\nSource: Gritstone Oncology", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.gritstoneoncology.com%2F&esheet=51747233&newsitemid=20180123005423&lan=en-US&anchor=www.gritstoneoncology.com&index=1&md5=7f9efac55a0a90e73de075f64b6bceb1", "http://www.businesswire.com/news/home/20180123005423/en/"], "published": "2018-01-23T16:00:00.000+02:00", "crawled": "2018-01-23T18:24:45.012+02:00", "highlightTitle": ""}