{"organizations": [], "uuid": "8f51f87a6827234a42a817e5f30eb0240804bd5f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224700229&w=1200&r=LYNXMPEE0N080", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-environment-budweiser/green-logo-for-budweiser-as-brewer-taps-into-u-s-wind-power-idUKKBN1FD0D6", "country": "US", "domain_rank": 408, "title": "Green logo for Budweiser as brewer taps into U.S. wind power", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T07:18:00.000+02:00", "replies_count": 0, "uuid": "8f51f87a6827234a42a817e5f30eb0240804bd5f"}, "author": "", "url": "https://uk.reuters.com/article/us-environment-budweiser/green-logo-for-budweiser-as-brewer-taps-into-u-s-wind-power-idUKKBN1FD0D6", "ord_in_thread": 0, "title": "Green logo for Budweiser as brewer taps into U.S. wind power", "locations": [], "entities": {"persons": [{"name": "brian perkins", "sentiment": "none"}, {"name": "alister doyle", "sentiment": "none"}, {"name": "tony milikin", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "oklahoma", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "green", "sentiment": "negative"}, {"name": "budweiser", "sentiment": "negative"}, {"name": "reuters) - budweiser", "sentiment": "none"}, {"name": "min read  oslo", "sentiment": "none"}, {"name": "anheuser-busch inbev", "sentiment": "none"}, {"name": "ab inbev", "sentiment": "none"}, {"name": "enel green power", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 5:25 AM / Updated 37 minutes ago Green logo for Budweiser as brewer taps into U.S. wind power Alister Doyle 3 Min Read \nOSLO (Reuters) - Budweiser said it has switched all its U.S. brewing to renewable electricity and is adding a clean energy logo to its labels as part of a global shift to green power by its parent Anheuser-Busch InBev. \nA “100 percent renewable electricity” symbol will be added to U.S. bottles and cans, Budweiser said, adding it expects to lift sales of one of America’s top beers, after a dip. \nAB InBev, the world’s biggest brewer, is one of more than 100 multinational firms to have committed to use renewable power to combat pollution and climate change under the Paris accord. \n“Beer has been around for 3,000 years - we would like that to continue for another 3,000 years,” Brian Perkins, global vice president of Budweiser, told Reuters by telephone. \nSince the start of this year Budweiser has bought power equivalent to its U.S brewing demands from Enel Green Power’s 300 megawatt capacity Thunder Ranch Wind Farm in Oklahoma. \nTony Milikin, chief procurement and sustainability officer of AB InBev, told Reuters that consumers were often rightly sceptical about environmental pledges by big companies. \n“Here you see it on the label. That adds confidence,” he said from the World Economic Forum in Davos, adding that the cost of the electricity was not more than from other sources. FILE PHOTO: Anheuser Busch's Budweiser and Bud Light Beer can be seen on display at a new Wal-Mart store in Chicago, U.S., January 24, 2012. REUTERS/John Gress/File Photo \nAB InBev will widen the logo to other markets and offer it to other companies. It is also trying to cut emissions in areas ranging from growing hops to transporting beer to shops. \nAbout 41 million Budweiser beers are sold every day worldwide and switching brewing to renewables from fossil fuels will correspond to taking 48,000 cars off the road every year. \nLast March, AB InBev committed to obtain 100 percent of purchased electricity for brewing from renewables by 2025. It expects to reach a rate of 31 percent this year. \nIn the third quarter of 2017, Budweiser revenues dipped 2.2 percent worldwide, despite gains in non-U.S. markets, AB InBev said. \nBudweiser, which calls itself the King of Beers, reckons consumers will embrace the logo despite U.S. President Donald Trump’s push to develop fossil fuels and his doubts that human activities are the prime cause of climate change. \n“We’ve talked to beer drinkers in multiple countries - they roundly agree that climate change is a big issue,” Perkins said. \nMicrosoft, Starbucks and Marks & Spencer were among major companies to have achieved 100 percent renewable energy by the end of 2016, according to The Climate Group, a non-profit which oversees pledges. It welcomed Budweiser’s shift. \n(Refiles to remove “embargo” from headline) Reporting by Alister Doyle; editing by Alexander Smith", "external_links": [], "published": "2018-01-24T07:18:00.000+02:00", "crawled": "2018-01-24T09:37:45.012+02:00", "highlightTitle": ""}