{"organizations": [], "uuid": "eaac0433e25b5a64775e2fcf1b97ef493a868b85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/india-morningcall/morning-news-call-india-january-5-idUSL4N1P01O6", "country": "US", "domain_rank": 408, "title": "Morning News Call - India, January 5", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T05:13:00.000+02:00", "replies_count": 0, "uuid": "eaac0433e25b5a64775e2fcf1b97ef493a868b85"}, "author": "", "url": "https://www.reuters.com/article/india-morningcall/morning-news-call-india-january-5-idUSL4N1P01O6", "ord_in_thread": 0, "title": "Morning News Call - India, January 5", "locations": [], "entities": {"persons": [], "locations": [{"name": "india", "sentiment": "none"}, {"name": "new delhi", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "mumbai", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "reuters staf", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "To access the newsletter, click on the link: here If you would like to receive this newsletter via email, please register at: here FACTORS TO WATCH 5:00 pm: RBI to release weekly foreign exchange data in Mumbai. 5:30 pm: Government to release advance GDP estimates for this FY in New Delhi. GMF: QUIZ EAST The first of our Friday quizzes focuses on Asia and the week's top news. Tests your wits and googling speed at 1100 IST. To join the conversation, click on the link: here INDIA TOP NEWS India probes report on breach of national identity database India on Thursday began investigating a report that access to its database of the identity details of more than 1 billion citizens was being sold for just $8 on social media, in what could be one of the giant programme's biggest security breaches. India seeks parliament nod to spend $12.6 bln on bank recap plan The Indian government asked parliament on Thursday for 800 billion rupees that it plans to spend by March as part of a two-year programme to recapitalise state banks to help them deal with bad debts and revive credit growth. India's Idea unveils $1.1 bln fundraising plan ahead of Vodafone deal Idea Cellular, India's third largest mobile services operator, on Thursday unveiled a 67.5 billion-rupee fundraising plan ahead of its merger with Vodafone's local unit. Indian services firms bounce back to growth in December - PMI Activity in India's services industry bounced back to modest growth in December after contracting in the previous month, a private survey showed on Thursday, as new business orders stabilised and price increases slowed. India cenbank puts Allahabad Bank under prompt corrective action India's Allahabad Bank said the central bank has initiated 'prompt corrective action' against the state-run lender over its high bad loans. GLOBAL TOP NEWS Trump credits his firmness for potential Korea talks, signals Olympic concession U.S. President Donald Trump on Thursday called potential talks between North and South Korea \"a good thing\" and agreed with South Korea there would be no joint military drills, which North Korea bitterly opposes, during next month's Winter Olympics. China tightens bond trading rules in deleveraging campaign -PBOC China released new rules tightening bond trading regulations on Thursday, with a focus on restricting leverage and banning under-the-table deals. Uber ex-CEO Kalanick plans to sell 29 pct of stake -source Uber Technologies Inc co-founder Travis Kalanick, who was ousted as chief executive in June, will sell nearly a third of his shares in the ride-services company for about $1.4 billion, a person familiar with the matter said on Thursday. LOCAL MARKETS OUTLOOK (As reported by NewsRise) The SGX Nifty Futures was trading at 10,538.00, trading up 0.05 percent from its previous close The Indian rupee will likely open little changed to a tad higher against the dollar, as strength in the euro weighed on the greenback despite a solid U.S. private employment report. Indian government bonds are expected to edge lower ahead of a weekly debt sale, even as traders expect strong interest for a new 10-year paper being auctioned today. The yield on the benchmark 6.79 percent bond maturing in 2027 is likely to trade in a 7.32 percent-7.36 percent band today, a trader with a primary dealership said. GLOBAL MARKETS • The Dow industrials broke above the 25,000 level for the first time on Thursday and other major indexes hit closing record highs again, propelled by strong global economic data that extended the New Year's rally for the stock market. • Asian shares inched closer to their record 2007 peak as U.S. jobs data pointed to firm economic growth although the greenback was soft as the spectre of benign inflation capped domestic bond yields. • The euro hovered near a three-year high against the sagging dollar, while improving investor risk appetite weighed on the yen. • Yields on U.S. government bonds rose modestly on Thursday, a day before the December payrolls report, which is expected to show further improvement in the jobs market, though some traders worry that wage growth may fall short of expectations. • Oil prices held firm, with Brent crude up by more than 10 percent from its December lows on the back of political tensions in OPEC-member Iran and a tightening U.S. market. • Gold prices held steady after hitting 3-1/2 month highs in the previous session, remaining on track for their fourth straight weekly gain. CLOSE FII INVESTMENTS EQUITIES DEBT PNDF spot 63.39/63.42 January 4 $33.44 mln $58.52 mln 10-yr bond yields 7.33 pct Month-to-date $113.34 mln -$56.64 mln Year-to-date $113.34 mln -$56.64 mln For additional data: India govt bond market volumes Stock market reports Non-deliverable forwards data Corporate debt stories [IN CORPD] Local market closing/intraday levels [IN SNAPSHOT] Monthly inflows [INFLOWS RTRS TABLE IN] ($1 = 63.3950 Indian rupees)\n ", "external_links": [], "published": "2018-01-05T05:13:00.000+02:00", "crawled": "2018-01-05T05:43:25.000+02:00", "highlightTitle": ""}