{"organizations": [], "uuid": "0c6833db720804bc205960f75e7530fe9d73ec6c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226289109&w=1200&r=LYNXMPEE0S0VI", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/iraq-oil-opec/iraq-says-to-comply-with-opec-deal-despite-oil-export-capacity-rise-idINKBN1FI1GY", "country": "US", "domain_rank": 408, "title": "Iraq says to comply with OPEC deal despite oil export capacity rise", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T14:29:00.000+02:00", "replies_count": 0, "uuid": "0c6833db720804bc205960f75e7530fe9d73ec6c"}, "author": "", "url": "https://in.reuters.com/article/iraq-oil-opec/iraq-says-to-comply-with-opec-deal-despite-oil-export-capacity-rise-idINKBN1FI1GY", "ord_in_thread": 0, "title": "Iraq says to comply with OPEC deal despite oil export capacity rise", "locations": [], "entities": {"persons": [{"name": "jason neely", "sentiment": "none"}, {"name": "alex lawler", "sentiment": "none"}, {"name": "dmitry zhdannikov", "sentiment": "none"}, {"name": "jabar al-luaibi", "sentiment": "none"}], "locations": [{"name": "iraq", "sentiment": "none"}, {"name": "kirkuk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "london iraq", "sentiment": "none"}], "organizations": [{"name": "opec", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "chatham house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Iraq will comply with the OPEC-led deal on reducing output even though Baghdad is working hard to increase its oil export capacity from the north and south of the country, its oil minister said on Monday.\nJabar al-Luaibi told a Chatham House conference in London that Iraq’s export capacity was nearing 5 million barrels per day (bpd), including 4.6 million bpd from the south.\nIraq, the second largest producer in the Organization of the Petroleum Exporting Countries, has had to limit output in line with OPEC’s commitment to cut output by about 1.2 million barrels per day (bpd) as part of a deal with Russia and others.\n“Iraq has made it clear at every time and every event that Iraq will comply with OPEC declarations in good spirit, genuine spirit,” the minister said. “We are determined that we will reach 5 million bpd export capacity by the end of this year.”\nThe OPEC cut has boosted oil prices, which last week topped $71 a barrel for the first time since 2014. OPEC members are enjoying the rally and extra revenue, and say prices are not too high. Luaibi described prices as “reasonable” so far.\nHe said Iraq hoped to more than double production from the northern Kirkuk oilfields with the help of BP.\nIraq said this month it had signed a memorandum of understanding with BP to boost capacity at the fields.\nWhile exports from the south are at record levels, output in northern Iraq is down after falling in mid-October when Iraqi forces retook control of oilfields from Kurdish fighters who had been there since 2014.\nThis has had the side-effect of boosting Iraqi compliance with the OPEC cuts in recent months. Last year, Iraq’s compliance lagged Saudi Arabia and other large OPEC producers.\nThe minister said the market was nearing “good stability” and Iraq was pumping 4.35 million to 4.36 million bpd of oil.\nAssuming Iraqi output of that level in January, the country has cut supply by 206,000 bpd and delivered 98 percent of its pledged reduction of 210,000 bpd under the OPEC deal, according to a Reuters calculation.\nAdditional reporting by Ahmad Ghaddar and Julia Payne; Editing by David Evans and Edmund Blair\n ", "external_links": [], "published": "2018-01-29T14:29:00.000+02:00", "crawled": "2018-01-29T15:00:48.011+02:00", "highlightTitle": ""}