{"organizations": [], "uuid": "1ab98be1ae6ce105d70c9ba6a1690d1e4bc314c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-five-below-inc-announces-holiday-sales-results-for-quarter-to-date-through-january-6-2018aexpects-fourth-quarter-and-fiscal.html", "country": "US", "domain_rank": 767, "title": "Five Below, Inc. Announces Holiday Sales Results for Quarter-To-Date Through January 6, 2018; Expects Fourth Quarter and Fiscal 2017 Results Near High End of Previously Provided Guidance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T17:00:00.000+02:00", "replies_count": 0, "uuid": "1ab98be1ae6ce105d70c9ba6a1690d1e4bc314c3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-five-below-inc-announces-holiday-sales-results-for-quarter-to-date-through-january-6-2018aexpects-fourth-quarter-and-fiscal.html", "ord_in_thread": 0, "title": "Five Below, Inc. Announces Holiday Sales Results for Quarter-To-Date Through January 6, 2018; Expects Fourth Quarter and Fiscal 2017 Results Near High End of Previously Provided Guidance", "locations": [], "entities": {"persons": [{"name": "joel anderson", "sentiment": "none"}], "locations": [{"name": "pa", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}], "organizations": [{"name": "inc", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PHILADELPHIA, PA, Jan. 08, 2018 (GLOBE NEWSWIRE) -- Five Below, Inc. (NASDAQ:FIVE) (“Five Below” or the “Company”) today announced net sales results for the quarter-to-date period from October 29, 2017 through January 6, 2018 (\"Holiday Period\"). The Company also announced that it expects fourth quarter and full year fiscal 2017 (ending February 3, 2018) results near the high end of its previously provided guidance ranges.\nThe Company announced that net sales for the Holiday Period increased by 26.7% to $442.6 million from $349.3 million in the comparable fiscal week period of 2016. Comparable sales for the Holiday Period increased by 6.7%.\nJoel Anderson, President and CEO of Five Below, stated, “We are pleased to share that our holiday sales performance was the strongest since our IPO in 2012. We believe our compelling merchandise assortment, offered at an amazing value with a great in-store experience, resonated with customers and drove these results. Multiple merchandise categories outperformed, once again demonstrating the broad-based strength of our business. Given our strong quarter-to-date performance and expectations for the remainder of January, we expect to finish the fourth quarter and full year near the high end of our previously provided guidance ranges.”\nThe Company’s guidance given on its third quarter earnings call is provided below. The Company’s guidance did not include any impact from the tax reform bill enacted in December 2017. The fiscal 2017 results will contain an additional, non-comparable week, or the \"53rd week\" in the fourth quarter. The 53rd week is expected to contribute approximately $16 million in sales and approximately $0.03 in diluted income per common share.\nFourth Quarter Fiscal 2017 Guidance\n• Net sales of $491 million to $503 million\n• Comparable sales increase of 4% to 6%\n• Diluted income per common share of $1.09 to $1.16 on approximately 55.7 million estimated diluted weighted average shares outstanding\nFull Year Fiscal 2017 Guidance\n• Net sales of $1.264 billion to $1.276 billion\n• Comparable sales increase of 5.7% to 6.5%\n• Diluted income per common share of $1.72 to $1.79 on approximately 55.7 million estimated diluted weighted average shares outstanding\nAs previously announced, management is scheduled to present today at 3:00 p.m. Eastern Time at the 20th Annual ICR Conference. The presentation will be webcast live at http://investor.fivebelow.com/ . An archived replay will be available two hours after the conclusion of the live event.\nAbout Five Below:\nFive Below is a leading high-growth value retailer offering trend-right, high-quality products loved by tweens, teens and beyond. We know life is way better when you're free to \"let go & have fun\" in an amazing experience filled with unlimited possibilities. We make it easy to say YES! to the newest, coolest stuff because everything is just $5 and below across awesome Five Below worlds: Style, Room, Sports, Tech, Create, Party, Candy and Now. Founded in 2002 and headquartered in Philadelphia, Pennsylvania, Five Below today has over 600 stores in 32 states. For more information, please visit www.fivebelow.com and a store!\nForward-Looking Statements:\nThis news release includes forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 as contained in Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934, which reflect management's current views and estimates regarding the Company's industry, business strategy, goals and expectations concerning its market position, future operations, margins, profitability, capital expenditures, liquidity and capital resources and other financial and operating information. Investors can identify these statements by the fact that they use words such as \"anticipate,\" \"assume,\" \"believe,\" \"continue,\" \"could,\" \"estimate,\" \"expect,\" \"intend,\" \"may,\" \"plan,\" \"potential,\" \"predict,\" \"project,\" \"future\" and similar terms and phrases. The Company cannot assure investors that future developments affecting the Company will be those that it has anticipated. Actual results may differ materially from these expectations due to risks related to the Company's strategy and expansion plans, risks related to the inability to successfully implement our expansion into online retail, risks related to our ability to select, obtain, distribute and market merchandise profitably, risks related to our reliance on merchandise manufactured outside of the United States, the availability of suitable new store locations and the dependence on the volume of traffic to our stores, risks related to the Company's continued retention of its executive officers, senior management and other key personnel, risks related to changes in consumer preferences and economic conditions, risks related to increased operating costs, including wage rates, risks related to extreme weather, risks related to the Company's distribution centers, risks related to our ability to successfully manage inventory balance and inventory shrinkage, quality or safety concerns about the Company's merchandise, increased competition from other retailers including online retailers, risks related to the seasonality of our business, risks related to cyber security, risks related to our ability to protect our brand name and other intellectual property, risks related to customers' payment methods, risks related to trade restrictions, and risks associated with leasing substantial amounts of space. For further details and a discussion of these risks and uncertainties, see the Company's periodic reports, including the annual report on Form 10-K, quarterly reports on Form 10-Q and current reports on Form 8-K, filed with or furnished to the Securities and Exchange Commission and available at www.sec.gov . If one or more of these risks or uncertainties materialize, or if any of the Company's assumptions prove incorrect, the Company's actual results may vary in material respects from those projected in these forward-looking statements. Any forward-looking statement made by the Company in this news release speaks only as of the date on which the Company makes it. Factors or events that could cause the Company's actual results to differ may emerge from time to time, and it is not possible for the Company to predict all of them. The Company undertakes no obligation to publicly update any forward looking statement, whether as a result of new information, future developments or otherwise, except as may be required by any applicable securities laws.\nInvestor Contact:\nFive Below, Inc.\nChristiane Pelz\n215-207-2658\nChristiane.Pelz@fivebelow.com\nSource:Five Below, Inc.", "external_links": ["http://investor.fivebelow.com/", "https://www.globenewswire.com/Tracker?data=uQ3Xe_MYWYn38JMfwuv5LVCNQTbKtH-YFLOALgaH-9hGgf2sh8fSFXmkpRsZ0i-EwEbf3tm3WQSF94ZBaHOV0i4rfv1U8gid9MPchXAnLg1Xew0lcdql0wUzD8I0nCAd", "https://www.globenewswire.com/Tracker?data=Ei6lt9nLaRg-mbi-j7xYvVRbdjhbrLh2mMzzpUrlTy2RFiO5c09sMgqtmp07_mSSmCR2o3E13P4HiAb_UPWHvg==", "https://www.globenewswire.com/Tracker?data=V_aqyCJhy66j2M3Kr-hDC1yKuE4cu4re50O6bFMAvMHK63nXk2-9w6z01IpQCZp3cYULcft8F-gdO7hXV_ur-CB-F130NNhdjWZf8yBFYT5dTzw6q3ZYnbfl9yqTSBAn", "https://www.globenewswire.com/NewsRoom/AttachmentNg/8611b91b-649e-45b5-9599-c7c0c45d978d"], "published": "2018-01-08T17:00:00.000+02:00", "crawled": "2018-01-08T19:06:50.014+02:00", "highlightTitle": ""}