{"organizations": [], "uuid": "18109828a4269f98d3cbe27dfbe193272e46f618", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/06/29/104559117-GettyImages-626433450-aetna.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10000108/device/rss/rss.html", "section_title": "Health Care", "url": "https://www.cnbc.com/2018/01/28/what-to-watch-from-health-care-earnings.html", "country": "US", "domain_rank": 767, "title": "What to watch from health care earnings", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T22:49:00.000+02:00", "replies_count": 0, "uuid": "18109828a4269f98d3cbe27dfbe193272e46f618"}, "author": "Bertha Coombs", "url": "https://www.cnbc.com/2018/01/28/what-to-watch-from-health-care-earnings.html", "ord_in_thread": 0, "title": "What to watch from health care earnings", "locations": [], "entities": {"persons": [], "locations": [{"name": "texas", "sentiment": "none"}], "organizations": [{"name": "aetna", "sentiment": "none"}, {"name": "cvs", "sentiment": "none"}, {"name": "hca", "sentiment": "none"}, {"name": "anthem health insurance", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "This week, investors could get a better picture of how this year's intense flu season is impacting health care firms, with three major health insurers and the nation's largest for-profit hospital operator set to report fourth quarter results.\nHere's what to watch:\nHospital operator HCA reports Tuesday. With a large presence in Texas — where the flu outbreak has been especially severe — investors will be watching for the impact on HCA's admissions.\nAetna is also set to report results on Janaury 30 th , but the bigger news for its investors this week will be the regulatory outlook for the CVS ' proposed $69 billion acquisition of the health insurer.\nThe 30-day Hart-Scott-Rodino Act anti-trust waiting period on the CVS-Aetna deal expires on February 2 nd . If regulators raise no objections to extend the review period, it would lift a big hurdle for the merger.\nIn regulatory filings, the companies said they expect the merger to be completed in the second half of this year. The deal carries a $2.1 billion break-up fee.\nGetty Images An exterior view of the Anthem Health Insurance headquarters in Indianapolis, Indiana. When Anthem reports ahead of the bell Wednesday, analysts will be watching for its outlook on how tax reform will impact 2018 earnings.\nAnalysts at Cantor Fitzgerald raised their 2018 earnings estimate for the insurer from $13.00 per share to $16.00, based in part on the assumption that Anthem's tax rate will fall from 35.5 percent to 28 percent, due to tax reform.\nWhether they'll use that extra cash to pursue a merger is likely to be one of the big questions for New CEO Gail Boudreaux.\n\"We see the company as having the budget and motivation to guild out a significant AI team both organilcally and through M&A [mergers and acquisitions],\" analysts at Piper Jaffray wrote in a recent research note, estimating that Anthem has $5.5 billion in deployable capital, beyond tax savings.\nIt has been nearly eight months since Anthem terminated its deal to buy rival Cigna , which was blocked by regulators .\nOn Thursday, Cigna CEO David Cordani is likely to face questions about how mergers and acquisitions will figure in the firm's plans to deploy tax reform savings.\nLeerink analyst Ana Gupte said in a recent research note that Cigna executives aren't likely to pursue acquiring their own pharmacy benefit manager. They also don't seem anxious to do a deal, despite recent moves by competitors.\n\"Cigna is not looking at a deadline on capital deployment and is still actively contemplating its… strategic priorities,\" Gupte wrote.", "external_links": [], "published": "2018-01-28T22:49:00.000+02:00", "crawled": "2018-01-28T23:45:12.002+02:00", "highlightTitle": ""}