{"organizations": [], "uuid": "03e6343dec25627d8364311c09e9203c9754ab05", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-cargill-strengthens-pet-food-production-and-distribution-capabilities-with-pro-pet-acquisition.html", "country": "US", "domain_rank": 767, "title": "Cargill strengthens pet food production and distribution capabilities with Pro-Pet acquisition", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-02T20:00:00.000+02:00", "replies_count": 0, "uuid": "03e6343dec25627d8364311c09e9203c9754ab05"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-cargill-strengthens-pet-food-production-and-distribution-capabilities-with-pro-pet-acquisition.html", "ord_in_thread": 0, "title": "Cargill strengthens pet food production and distribution capabilities with Pro-Pet acquisition", "locations": [], "entities": {"persons": [{"name": "pilar cruz", "sentiment": "none"}], "locations": [{"name": "minneapolis", "sentiment": "none"}, {"name": "kansas city", "sentiment": "none"}, {"name": "owatonna", "sentiment": "none"}, {"name": "kan", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "minn.", "sentiment": "none"}], "organizations": [{"name": "cargill", "sentiment": "negative"}, {"name": "cargill feed and nutrition", "sentiment": "none"}, {"name": "cargill animal nutrition", "sentiment": "none"}, {"name": "st. marys", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MINNEAPOLIS, Jan. 2, 2018 /PRNewswire/ -- Cargill has reached an agreement to acquire Pro-Pet, an Ohio-based manufacturer of private label and co-manufactured pet foods, including premium dog food brand Black Gold®. The acquisition makes Cargill the only national supplier of both animal feed and pet food offerings in the agricultural retail space.\nThe transaction is expected to close within 30 days, subject to customary approvals. Terms of the deal were not disclosed.\n\"Pro-Pet's commitment to high-quality, safe pet food and passion for the pet food business is the perfect fit for our Cargill Animal Nutrition business, and allows us to better serve our customers seeking a focused supplier for both animal feed and pet food options,\" said Pilar Cruz, president, Cargill Feed and Nutrition.\nPro-Pet has more than 150 employees and three pet food manufacturing facilities in Owatonna, Minn.; St. Marys, Ohio; and Kansas City, Kan. Pro-Pet provides Cargill with increased production capacity and proximity to existing agricultural retail customers to better meet their growth needs within pet food.\n\"Cargill's vast resources and competency in sourcing of commodities, along with their reputation in the agricultural retail business sector, makes Cargill the natural and best partner for Pro-Pet,\" said Jim Wiegmann, president and CEO of Pro-Pet. \"There is no organization that can leverage the strengths and capabilities of Pro-Pet better than Cargill, which will enhance our ability to serve retail partners and pet food brand owners.\"\nPet food is a top-growing category among agriculture retailers with an estimated eight percent distribution share, in a space that continues to evolve with changing consumer preferences.\n\"The pet food category continues to change, as indicated by the increased focus on premium offerings,\" said Mark Lueking, U.S. managing director, Cargill Feed and Nutrition. \"Pro-Pet has the capability to satisfy this market need, and our mutual passion for serving customers make us a strong cultural fit. We look forward to growing the business together by delivering a range of options to meet customer demand.\"\nCurrently, Cargill operates 50 animal feed production and distribution facilities across the U.S., offering branded and private label pet food to agriculture retailer customers.\nAbout Cargill\nCargill provides food, agriculture, financial and industrial products and services to the world. Together with farmers, customers, governments and communities, we help people thrive by applying our insights and 150 years of experience. We have 155,000 employees in 70 countries who are committed to feeding the world in a responsible way, reducing environmental impact and improving the communities where we live and work. For more information, visit Cargill.com and our News Center .\nAbout Cargill Animal Nutrition\nCargill's animal nutrition business has more than 20,000 employees at more than 275 facilities in 40 countries. Fueled by our innovation and research, we offer a range of products and services to feed manufacturers, animal producers, and feed retailers around the world, helping put food on the plates of nearly one billion people around the world every day. Cargill's animal nutrition business offers a range of compound feed, premixes, feed additives, supply chain and risk management solutions, software tools and animal nutrition expertise that is unmatched in the industry. For more information about Cargill Animal Nutrition, visit: http://cargill.com/animal-nutrition .\nAbout Pro-Pet\nPro-Pet, L.L.C. is a North American pet food company focused on producing premium and super premium branded and private label pet food products with facilities in St. Marys, Ohio; Kansas City, Kansas; and Owatonna, Minnesota. Pro-Pet currently employees more than 150 team members.\nView original content with multimedia: http://www.prnewswire.com/news-releases/cargill-strengthens-pet-food-production-and-distribution-capabilities-with-pro-pet-acquisition-300576467.html\nSOURCE Cargill", "external_links": ["http://www.cargill.com/", "http://www.cargill.com/news", "http://cargill.com/animal-nutrition", "http://www.prnewswire.com/news-releases/cargill-strengthens-pet-food-production-and-distribution-capabilities-with-pro-pet-acquisition-300576467.html"], "published": "2018-01-02T20:00:00.000+02:00", "crawled": "2018-01-02T21:34:17.001+02:00", "highlightTitle": ""}