{"organizations": [], "uuid": "fcd1cf1d5456d47bf66ccd4aa447df4ce3e1064c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 8, "shares": 8, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-camp/syrians-displaced-by-idlib-assault-take-shelter-near-turkey-idUSKBN1F71MZ", "country": "US", "domain_rank": 408, "title": "Syrians displaced by Idlib assault take shelter near Turkey", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T14:52:00.000+02:00", "replies_count": 0, "uuid": "fcd1cf1d5456d47bf66ccd4aa447df4ce3e1064c"}, "author": "", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-camp/syrians-displaced-by-idlib-assault-take-shelter-near-turkey-idUSKBN1F71MZ", "ord_in_thread": 0, "title": "Syrians displaced by Idlib assault take shelter near Turkey", "locations": [], "entities": {"persons": [{"name": "idlib", "sentiment": "negative"}, {"name": "diab", "sentiment": "none"}, {"name": "bahr diab", "sentiment": "none"}, {"name": "dominic evans", "sentiment": "none"}], "locations": [{"name": "turkey", "sentiment": "none"}, {"name": "kelbit", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 12:52 PM / Updated 11 minutes ago Syrians displaced by Idlib assault take shelter near Turkey Dominic Evans 5 Min Read \nKELBIT CAMP, Syria (Reuters) - When fighting drove Bahr Diab from his home in southern Idlib last month, it was the fourth time he and his family had been displaced since the start of Syria’s seemingly endless conflict. \nFrom his pre-war home on the Lebanese border, Diab moved first east and then north searching for safety, finally taking shelter near Turkey where he hopes his wife and four children will be safe from air strikes and ground assaults. \n“Every time I get to a new place I build a house, but we are forced to leave it and move on,” he said at a makeshift camp a few miles from the border, where hundreds of people endure the mud and winter weather. \n“That’s my tent over there, that’s my home. Four homes later we decided to settle for blankets for winter.” \nDiab is part of a wave of Syrians fleeing an offensive by Syrian government forces and their allies, which several people at the Kelbit camp said involved the heaviest bombardment they had seen in nearly seven years of conflict. \nThe Idlib area is the largest remaining opposition-held territory in Syria, its population swelled by insurgents and civilians retreating from shrinking rebel strongholds elsewhere. The scale of this latest upheaval has overwhelmed local authorities in Islamist-controlled Idlib. \nThey say around 36,000 families have been uprooted, nearly half of which have fled to the Turkish border region. The United Nations said this week it had tracked 212,000 displacements in the last month alone, though some may have been counted more than once on their journey. \nNeighboring Turkey, already hosting 3 million refugees, says that further fighting could trigger another mass exodus. But it has built a wall along the frontier and tightened control at crossings, leaving tens of thousands of Syrians near the border with nowhere left to flee. \nDiab, who reached Kelbit three weeks ago, said people were suffering from the cold, wet weather and sickness was rife. But compared to his last home in the Idlib town of Sinjar, where people lived in daily fear of air strikes, they felt secure. \n“The Turkish border region is safer,” he said. “Where we were before, you would hear planes 20 times a day. The children and women were terrified.” \n“FIVE FAMILIES TO A TENT” \nAnother man displaced from the Sinjar region said the ground and air assault by forces loyal to President Bashar al-Assad, who is supported by Russia and Iran, was the most ferocious he had experienced. \n“There were situations when you would get civilians killed, but not like this,” said the 43-year-old father of six, who gave his name only as Abdulhamid. “This is hysteria at an insane level. It’s the first time I’ve seen civilians being targeted in schools, mosques, entire districts.” \nAbdulhamid said his home in Sinjar had been destroyed and he had lost contact with relatives during his three-day trek to the border. “My cousins, I know nothing about them. My sisters, brothers and wives, I don’t know where they are”. \nNext to the canvas and blue tarpaulin structures of the improvised camp, Turkey’s Red Crescent has built 500 new tents which will soon be ready for families to move into. \nBut Hassan Darwish, an official with the local authority running the opposition-controlled Idlib region, said they desperately needed more food and shelter to support the displaced population. \nHe said there were 1,300 displaced families in Kelbit area, 300 of which could not be housed at the camp. In the wider border region, he said there were 71,000 displaced families. \nThe World Food Programme is helping feed tens of thousands, but WFP provisions cover less than half the needs, Darwish said. \n“People who have been displaced from all the governorates (in Syria) have nowhere apart from this region. But this region ... cannot absorb any more people,” he said. “In several camps, you find five or six families in one tent.” \nThe overcrowding may only get worse if the army and its militia allies continue to advance from the south, eating further into opposition areas. \nRakkan Khalil, who said he was first uprooted by the violence six years ago, said that given the chance he would cross the border to Turkey, but he saw no way to make the short trip with his wife, four sons and two daughters. \n“They’ve closed the borders, it’s hard for us,” he said. \nAt the approach to the Bab al-Hawa crossing from Syria to Turkey, a large sign in the center of the road encapsulates the sense of entrapment and resignation in the Islamist-controlled region. \n“All crossings and roads may be closed,” it reads. “Except the path to God.” Reporting by Dominic Evans;  ", "external_links": [], "published": "2018-01-18T14:52:00.000+02:00", "crawled": "2018-01-18T15:08:08.000+02:00", "highlightTitle": ""}