{"organizations": [], "uuid": "eeb73a0ba08dfa6d854287b25e51df233edc7694", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-shareholder-alert-pomerantz-law-firm-reminds-shareholders-with-losses-on-their-investment-in-qudian-inc-of-class-action.html", "country": "US", "domain_rank": 767, "title": "SHAREHOLDER ALERT: Pomerantz Law Firm Reminds Shareholders with Losses on their Investment in Qudian Inc. of Class Action Lawsuit and Upcoming Deadline - QD", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T21:53:00.000+02:00", "replies_count": 0, "uuid": "eeb73a0ba08dfa6d854287b25e51df233edc7694"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-shareholder-alert-pomerantz-law-firm-reminds-shareholders-with-losses-on-their-investment-in-qudian-inc-of-class-action.html", "ord_in_thread": 0, "title": "SHAREHOLDER ALERT: Pomerantz Law Firm Reminds Shareholders with Losses on their Investment in Qudian Inc. of Class Action Lawsuit and Upcoming Deadline - QD", "locations": [], "entities": {"persons": [{"name": "robert s. willoughby", "sentiment": "none"}, {"name": "qudian", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "qudian inc.", "sentiment": "neutral"}, {"name": "pomerantz llp", "sentiment": "neutral"}, {"name": "united states district court", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "southern district of new york", "sentiment": "none"}, {"name": "qudian", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 17, 2018 /PRNewswire/ -- Pomerantz LLP announces that a class action lawsuit has been filed against Qudian Inc. (\"Qudian\" or the \"Company\") (NYSE: QD) and certain of its officers. The class action, filed in United States District Court, Southern District of New York, and docketed under 17-cv-09903, is on behalf of a class consisting of investors who purchased or otherwise acquired Qudian's American Depositary Receipts (\"ADRs\") pursuant and/or traceable to Qudian's false and misleading Registration Statement and Prospectus, issued in connection with the Company's initial public offering on or about October 18, 2017 (the \"IPO\" or the \"Offering\"), seeking to recover damages caused by Defendants' violations of the Securities Act of 1933 (the \"Securities Act\").\nIf you are a shareholder who purchased Qudian securities on or after October 18, 2017, you have until February 12, 2018, to ask the Court to appoint you as Lead Plaintiff for the class. A copy of the Complaint can be obtained at www.pomerantzlaw.com . To discuss this action, contact Robert S. Willoughby at rswilloughby@pomlaw.com or 888.476.6529 (or 888.4-POMLAW), toll-free, Ext. 9980. Those who inquire by e-mail are encouraged to include their mailing address, telephone number, and the number of shares purchased.\n[Click here to join this class action]\nQudian Inc. is a provider of online micro-lending credit products. The Company offers cash credit products, including funds in digital form and merchandise credit products. Qudian serves customers in China.\nThe Complaint alleges that throughout the Class Period, Defendants made materially false and misleading statements in the IPO's Registration Statement regarding the Company's business, operational and compliance policies. Specifically, Defendants made false and/or misleading statements and/or failed to disclose that: (i) the Company was engaged in predatory lending practices that saddled subprime borrowers and/or those with poor or limited credit histories with high-interest rate debt that they could not repay; (ii) many of the Company's customers were using Qudian-provided loans to repay their existing loans, thereby inflating the Company's revenues and active borrower numbers and increasing the likelihood of defaults; (iii) the Company was providing online loans to college students despite a governmental ban on the practice; (iv) the Company was engaged overly aggressive and improper collection practices; (v) the Company had understated the number of its non-performing loans in the Registration Statement and Prospectus; (vi) because of the Company's improper lending, underwriting and collection practices it was subject to a heightened risk of adverse actions by Chinese regulators; (vii) the Company's largest sales platform and strategic partner, Alipay, and Ant Financial, could unilaterally cap the APR for loans provided by Qudian; (viii) the Company had failed to implement necessary safeguards to protect customer data; (ix) data for nearly one million Company customers had been leaked for sale to the black market, including names, addresses, phone numbers, loan information, accounts and, in some cases, passwords to CHIS, the state-backed higher-education qualification verification institution in China, subjecting the Company to undisclosed risks of penalties and financial and reputational harm; and (x) as a result of the foregoing, Qudian's public statements were materially false and misleading at all relevant times.\nOn December 12, 2017, Qudian's ADR price closed at $13.19, approximately 45% lower than the $24.00 IPO price.\nThe Pomerantz Firm, with offices in New York, Chicago, Los Angeles, and Paris, is acknowledged as one of the premier firms in the areas of corporate, securities, and antitrust class litigation. Founded by the late Abraham L. Pomerantz, known as the dean of the class action bar, the Pomerantz Firm pioneered the field of securities class actions. Today, more than 80 years later, the Pomerantz Firm continues in the tradition he established, fighting for the rights of the victims of securities fraud, breaches of fiduciary duty, and corporate misconduct. The Firm has recovered numerous multimillion-dollar damages awards on behalf of class members. See www.pomerantzlaw.com\nCONTACT:\nRobert S. Willoughby\nPomerantz LLP\nrswilloughby@pomlaw.com\nView original content: http://www.prnewswire.com/news-releases/shareholder-alert--pomerantz-law-firm-reminds-shareholders-with-losses-on-their-investment-in-qudian-inc-of-class-action-lawsuit-and-upcoming-deadline--qd-300584100.html\nSOURCE Pomerantz LLP", "external_links": ["http://www.pomerantzlaw.com/", "http://www.prnewswire.com/news-releases/shareholder-alert--pomerantz-law-firm-reminds-shareholders-with-losses-on-their-investment-in-qudian-inc-of-class-action-lawsuit-and-upcoming-deadline--qd-300584100.html", "https://form.jotformpro.com/pomerantzllp2/qudian"], "published": "2018-01-17T21:53:00.000+02:00", "crawled": "2018-01-17T21:08:56.026+02:00", "highlightTitle": ""}