{"organizations": [], "uuid": "48f4d81256ec2b4336a141bca4dc51fbb8113e54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180128.html", "section_title": "Archive News &amp; Video for Sunday, 28 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/russia-election-navalny/russian-opposition-takes-to-streets-calls-for-election-boycott-idUSL8N1PN062", "country": "US", "domain_rank": 408, "title": "Russian opposition takes to streets, calls for election boycott", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.018, "site_type": "news", "published": "2018-01-28T16:25:00.000+02:00", "replies_count": 0, "uuid": "48f4d81256ec2b4336a141bca4dc51fbb8113e54"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/russia-election-navalny/russian-opposition-takes-to-streets-calls-for-election-boycott-idUSL8N1PN062", "ord_in_thread": 0, "title": "Russian opposition takes to streets, calls for election boycott", "locations": [], "entities": {"persons": [{"name": "denis pinchuk", "sentiment": "none"}, {"name": "alexei navalny", "sentiment": "none"}, {"name": "vladimir putin", "sentiment": "none"}, {"name": "navalny", "sentiment": "none"}, {"name": "andrew osborn", "sentiment": "none"}, {"name": "putin", "sentiment": "none"}, {"name": "magadan", "sentiment": "none"}], "locations": [{"name": "russia", "sentiment": "none"}, {"name": "yakutsk", "sentiment": "none"}, {"name": "omsk", "sentiment": "none"}, {"name": "novosibirsk", "sentiment": "none"}, {"name": "vladivostok", "sentiment": "none"}, {"name": "russian far east", "sentiment": "none"}, {"name": "kemerovo", "sentiment": "none"}, {"name": "kurgan", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Russia holds presidential election on March 18\n* Opposition holds nationwide day of protest\n* Calls for voters to boycott what it says is unfair vote\n* Police raid opposition leader’s office\nBy Andrew Osborn and Denis Pinchuk\nMOSCOW, Jan 28 (Reuters) - Hundreds of supporters of Russian opposition leader Alexei Navalny began a nationwide day of protest against the authorities on Sunday, calling on voters to boycott what they said was a rigged presidential election on March 18.\nBeneath bright blue skies, hundreds of young people gathered in the main square of the port of Vladivostok in the Russian Far East. Speakers called the election, which polls show incumbent Vladimir Putin should easily win, a farce.\n“I will go to the elections when there’s a choice,” read one placard in Vladivostok, a reference to the fact that Navalny has been barred from running over what he says is a trumped up suspended prison sentence. “Putin is gobbling up Russia’s future,” read another.\nOther protests took place in Novosibirsk, Kurgan, Omsk, Magadan, Kemerovo and Yakutsk. Navalny’s supporters said they expected thousands of people to take part in similar demonstrations in 118 towns and cities.\n“Your own life is at stake,” Navalny, who organised the boycott protests, said in a pre-protest video.\n“How many more years to do you want to live with these thieves, bigots and creeps?”\nIn Moscow, where a protest is expected later on Sunday, police forced their way into Navalny’s office and started questioning and searching people, citing reports of a bomb, an online feed run by Navalny’s supporters showed.\nPolice shut down a TV studio at the office which had been broadcasting online news bulletins, but another studio in a different location continued to operate.\nPolice detained six of Navalny’s supporters at the Moscow studio and around 16 protesters in other parts of Russia, OVD-Info, an independent monitoring group, said.\nIt was unclear where Navalny was, but a group of police officers was stationed near his home. Navalny said he planned to attend the Moscow protest later on Sunday.\nPOSSIBLE VIOLENCE Police warned beforehand they would harshly suppress any illegal protest activity and authorities refused to authorise events in Moscow and St Petersburg, the country’s two biggest cities, raising the possibility of possible violence.\nNavalny, a lawyer who has campaigned against official corruption, was barred from running in the election by the central election commission in December over what he said was a trumped up suspended prison sentence.\nThe United States and the EU criticised the decision.\nPutin, who has dominated the Russian political landscape for the past 18 years, described U.S. criticism of the election’s commission’s decision as crude interference in Russia’s internal affairs and suggested Navalny was Washington’s pick for the presidency.\nPolls show Navalny had scant chance of beating Putin, but Navalny says the system is rigged against political opponents like himself which makes polls meaningless.\nWhilst there is little suspense about the outcome of the election, there is keen interest in voter turnout as media reports say the Kremlin wants to ensure Putin is re-elected on a turnout of around 70 percent or more as it sees high turnout as lending him greater legitimacy.\nThough Navalny can’t run against Putin and says he knows Putin will be re-elected, his spoiler campaign is aimed at lowering voter turnout to try to take the shine off a Putin win. (Additional reporting by a Reuters reporter in Vladivostok; Writing by Andrew Osborn; Editing by Katya Golubkova)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-28T16:25:00.000+02:00", "crawled": "2018-01-29T21:57:50.004+02:00", "highlightTitle": ""}