{"organizations": [], "uuid": "7bc8e2e8b4835e0d64c01b9b8a51e97d34fb491e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/11/17/103176135-RTS6KOQ.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/19/walmart-will-see-a-larger-breakout-oppenheimer-analyst-says.html", "country": "US", "domain_rank": 767, "title": "Walmart will see a larger breakout, Oppenheimer analyst says", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T14:19:00.000+02:00", "replies_count": 0, "uuid": "7bc8e2e8b4835e0d64c01b9b8a51e97d34fb491e"}, "author": "Keris Lahiff", "url": "https://www.cnbc.com/2018/01/19/walmart-will-see-a-larger-breakout-oppenheimer-analyst-says.html", "ord_in_thread": 0, "title": "Walmart will see a larger breakout, Oppenheimer analyst says", "locations": [], "entities": {"persons": [{"name": "ari wald", "sentiment": "none"}, {"name": "mark tepper", "sentiment": "none"}, {"name": "wald", "sentiment": "none"}], "locations": [], "organizations": [{"name": "walmart", "sentiment": "positive"}, {"name": "strategic wealth partners", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "oppenheimer", "sentiment": "none"}, {"name": "wal-mart stores", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Walmart has been one of the strongest performers in the Dow over the past year, finishing 2017 with its best gains since the turn of the century.\nBut it's not done yet. Ari Wald, head of technical analysis at Oppenheimer , sees the case for its shares to go even higher.\n\"It has rallied sharply over the last year, but this is following 16 years of no progress,\" Wald told CNBC's \" Trading Nation \" on Thursday.\nWald's bullish bet is based on the lost decade-and-a-half from 1999 through to 2016, when Walmart shares made moves to end up nowhere. During that period, Walmart shares went as high as $90.47 and as low as $39.53. But those moves did not stick — its shares ended 2016 at $69.12, just a penny lower than its settlement in 1999.\n\"We see a much larger breakout at play. We're buyers of the stock,\" Wald said.\nMark Tepper , president of Strategic Wealth Partners, is also bullish on the stock, particularly as Walmart shows signs of evolution. He grew more confident in the retailer after it announced it was changing its corporate name to Walmart from Wal-Mart Stores. That change will take effect on Feb. 1.\n\"It's actually signaling their shift from brick-and-mortar stores to a stronger e-commerce presence. We feel they're well-positioned to compete with Amazon ,\" Tepper said on \"Trading Nation.\"\nTepper and Wald are in good company. Goldman Sachs on Thursday upgraded its rating to buy and added the stock to its conviction buy list. The firm gave a 12-month price target of $117, up 14 percent from levels at the time of its rating change. After Thursday's 1.5 percent rally, the price target implies 12 percent upside.\nExpected income growth and individual tax cuts should fuel spending in the mass market, which will benefit Walmart sales, Goldman said. Analysts raised their earnings estimates for fiscal 2018 and 2019 based on stronger sales estimates and more favorable currency trends.\nWalmart has had a rock-solid start to the year, joining in on a rally among Dow components that propelled the blue-chip index above another milestone, 26,000, and to new record highs. Walmart's stock has risen 5.6 percent this year after climbing eight times in the past 12 trading sessions. It is the third-best performer in the consumer staples sector in 2018.\nWalmart reports earnings alongside its retail peers at the tail-end of the reporting season. Analysts surveyed by FactSet expect the world's largest retailer to post a 3 percent increase in sales for its January-ending fourth quarter, and 4.9 percent rise in earnings. Walmart will report on its fourth quarter on Feb. 20.\nVote Vote to see results Total Votes: Not a Scientific Survey. Results may not total 100% due to rounding.\nDisclaimer", "external_links": [], "published": "2018-01-19T14:19:00.000+02:00", "crawled": "2018-01-19T14:51:34.014+02:00", "highlightTitle": ""}