{"organizations": [], "uuid": "c0f7157ebab90d6b44db73a86d7140596b510325", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/10/27/104056613-20161027-2894-2295.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/02/amazon-alexa-is-opening-up-to-more-sponsored-product-ads.html", "country": "US", "domain_rank": 767, "title": "Amazon Alexa is opening up to more sponsored product ads", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.138, "site_type": "news", "published": "2018-01-02T18:30:00.000+02:00", "replies_count": 0, "uuid": "c0f7157ebab90d6b44db73a86d7140596b510325"}, "author": "Lauren Hirsch", "url": "https://www.cnbc.com/2018/01/02/amazon-alexa-is-opening-up-to-more-sponsored-product-ads.html", "ord_in_thread": 0, "title": "Amazon Alexa is opening up to more sponsored product ads", "locations": [], "entities": {"persons": [{"name": "alexa", "sentiment": "negative"}], "locations": [{"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "amazon alexa", "sentiment": "negative"}, {"name": "colgate", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "clorox", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Amazon is turning to Alexa and asking it to build a big digital advertising business.\nThe e-tailer has been in talks with several companies about letting them promote products on the best-selling Echo devices, which are powered by the Alexa voice assistant, according to several people familiar with the matter who asked not to be named because the discussions are private. Consumer companies, including Procter & Gamble and Clorox, have been involved in these talks, according to the people.\nSome of the early discussions have centered on whether companies would pay for higher placement if a user searches for a product such as shampoo on the device, similar to how paid searches work in Google.\nThe move by Amazon, which right now does very little advertising on the Echo, could mean big things for consumer companies that are fretting their influence on a voice-powered shopping experience.\nWith Alexa's clout anticipated to rise, brands are worried about being left out of the voice-shopping platform entirely. Advertisers and brands are particularly focused on search placement on Alexa because shoppers are more likely to select a top result on a voice assistant than they are on the web, where it's easy to scroll down or ignore written suggestions.\nAmazon has hinted in the past that it will launch a paid search ad product for Alexa, but sources said that the latest talks show the e-commerce giant is preparing to make a serious run at the ad market as early as this year.\nshow chapters Amazon in talks with P&G, Clorox for Alexa ads: Sources 3 Hours Ago | 01:12 CNBC reported last week that Amazon is testing a number of ad types, including videos, for 2018.\nWhile Amazon dominates online commerce, its web advertising business ranks fifth among U.S. companies, according to eMarketer . Amazon's ad sales, which today mostly come from sponsored listings on the website, will grow 42 percent in 2018 to $2.4 billion, still putting the company way behind Google at $40.1 billion and Facebook at $21.6 billion, eMarketer said.\nWith Alexa, where advertising is currently limited, Amazon is in talks to offer companies a variety of promotional opportunities, including some that are already being tested.\nOne experiment in the works is letting companies target users based on past shopping behavior. For example, Alexa may suggest to a shopper who previously bought Clorox's Pine-Sol to consider buying its disinfecting wipes. Amazon is also looking to tap advertising in Alexa's skills. Someone asking the Echo for help cleaning up a spill might be nudged to use a specific brand.\nshow chapters Amazon is planning a push into digital advertising in 2018 11:19 AM ET Wed, 27 Dec 2017 | 00:50 There are already some sponsorships on Alexa that aren't tied to a user's history. If a shopper asks Alexa to buy toothpaste, one response is, \"Okay, I can look for a brand, like Colgate . What would you like?\"\nColgate did not respond to a request for comment. Clorox declined to comment.\nAs Amazon goes deeper with Alexa, it will likely be attempting to combine the popularity of the voice-powered devices with its wealth of consumer data to create more targeted opportunities for brand advertisers.\nAmazon did not respond to a request for comment.\nVoice and artificial intelligence represent a new frontier for consumer giants, who are adjusting to non-visual formats. Consumer brands are expert at promoting their products in stores by manipulating packaging and shelving, and they're effective with commercials and traditional web ads, where they have screen space to showcase their products.\nNow that people are shopping by voice without browsing, advertisers have to find new ways of getting in front of them.\n\"In these early days, artificial intelligence doesn't appear to recognize brand value, and it doesn't articulate it,\" said Greg Stemler, Ernst & Young's U.S. consumer products and retail leader for transaction advisory services. \"It may be a real challenge for branded consumer packaged goods companies to readjust.\"\n'New brick and mortar' They don't have much of a choice. The number of people in the U.S. using voice-enabled speakers more than doubled in 2017 to 36 million, with Amazon capturing 71 percent of the market, according to a prediction from eMarketer. The Alexa app recently topped the Apple App store , and Amazon said it sold \"tens of millions\" of Alexa devices over the holidays.\nAmazon is \"the new brick and mortar,\" said Matt Borchard, media director at ad agency Noble People. For brands, \"just like they need to spend money for placement in-store, they need to spend money for placement on Amazon.\"\nStill, voice represents a new medium with unpredictable results. Radio-style commercials don't work for most of the ways that people use the devices, and newer types of ads have hit early speed bumps. In June, a start-up called VoiceLabs, which was trying to help developers monetize their Alexa apps with ads, shut down after Amazon changed its policies to restrict promotions in Alexa skills.\nIn 2017, Procter & Gamble slashed up to $140 million in digital advertising spend, which the company deemed to be ineffective.\nIn Alexa's current narrow use of advertising, it allows skills such as streaming music, radio, podcast or flash briefings to have ads, as long as the voice doesn't sound like or refer to Alexa. For example, CNBC announced recently that it will begin selling sponsorship opportunities on its skill . Ads can also be used in skills that help customers order products. If a person asks to order pizza, Alexa may indicate what deals are available.\n\"We have to come up with the right monetization opportunity,\" said Doug Rozen, chief digital and innovation officer at media agency OMD. \"But it can't get in the way of what we are trying to use these devices for.\"", "external_links": [], "published": "2018-01-02T18:30:00.000+02:00", "crawled": "2018-01-02T18:42:57.014+02:00", "highlightTitle": ""}