{"organizations": [], "uuid": "f0ea77ba1604646f78e48f89643e28de259f4404", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 177, "shares": 177, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220511720&w=1200&r=LYNXMPEE080OE", "site_section": "http://feeds.reuters.com/reuters/topNews?format=xml", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-usa-trump-immigration/trump-to-meet-lawmakers-in-search-for-immigration-compromise-idUSKBN1EY149", "country": "US", "domain_rank": 408, "title": "Trump to meet lawmakers in search for immigration compromise", "performance_score": 1, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T13:02:00.000+02:00", "replies_count": 0, "uuid": "f0ea77ba1604646f78e48f89643e28de259f4404"}, "author": "", "url": "https://www.reuters.com/article/us-usa-trump-immigration/trump-to-meet-lawmakers-in-search-for-immigration-compromise-idUSKBN1EY149", "ord_in_thread": 0, "title": "Trump to meet lawmakers in search for immigration compromise", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "steve holland", "sentiment": "none"}, {"name": "richard cowan", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "tennessee", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "nashville", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "republican and democratic", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 11:03 AM / in 30 minutes Trump calls for two-step process on immigration, pushes bipartisan deal Jeff Mason , Richard Cowan 5 Min Read \nWASHINGTON (Reuters) - U.S. President Donald Trump said on Tuesday he would back a two-step immigration approach that initially protects young “Dreamer” immigrants from deportation if it includes immigration restrictions and provisions for a border wall with Mexico that Democrats have opposed. \nAt a White House meeting of Republican and Democratic lawmakers, Trump said after the first phase was complete he wanted to move quickly to even more contentious issues including a possible pathway to citizenship for 11 million undocumented immigrants that is opposed by many Republicans. \n“If you want to take it that further step, I’ll take the heat, I don’t care,” Trump told lawmakers of a broad immigration bill. “You are not that far away from comprehensive immigration reform.” \nTrump said he would sign any bill that gives legal status to undocumented immigrants brought to the country as children as long as it had the border security protections he has sought, including funding for a border wall. \n“If you don’t have the wall, you don’t have security,” Trump told the lawmakers. \nTrump and his fellow Republicans, who control the U.S. Congress, have been unable to reach agreement with Democrats on a deal to resolve the status of an estimated 700,000 young immigrants whose protection from potential deportation under the Deferred Action for Childhood Arrivals, or DACA, program ends in early March. MIDTERM ELECTIONS \nUnder pressure from immigrant groups ahead of midterm congressional elections in November, Democrats are reluctant to give ground to Trump on the issue of the wall - his central promise from the 2016 presidential campaign. \nBut after the meeting, lawmaker from both parties said they would meet as early as Wednesday to continue negotiations on a deal covering DACA and border security, as well as a visa lottery program and “chain migration,” which could address the status of relatives of Dreamers who are still in the United States illegally. \n“From that standpoint it was a very productive meeting,” said U.S. Senator David Perdue, a Republican. “We have a scope now.” \nRepublican Senator Lindsey Graham, who also was at the meeting, said negotiators in Congress still faced difficulties but it was important that Trump had shown he had ”no animosity toward the Dream Act kids“ and the “wall is not going to be 2,220 miles wide.” \nThe U.S. Congress has been trying and failing to pass a comprehensive immigration bill for more than a decade, most recently when the Senate passed one in 2013 that later died in the House of Representatives. FILE PHOTO: U.S. President Donald Trump speaks during a meeting with Republican members of the Senate about immigration at the White House in Washington, U.S., January 4, 2018. REUTERS/Kevin Lamarque \nWhite House spokeswoman Sarah Sanders told reporters the broader bill with a path to citizenship was not a focus for now. \n“Our focus is on the four things that I laid out. That’s where our negotiation is and that’s phase one,” she said at a regular White House briefing. \n“We’re certainly open to talking about a number of other issues when it comes to immigration, but right now this administration is focused on those four things and that negotiation, and not a lot else at this front.” \nThe immigration negotiations are part of a broader series of talks over issues ranging from funding the federal government through next September to renewing a children’s health insurance program and giving U.S. territories and states additional aid for rebuilding following last year’s hurricanes and wildfires. \nTop congressional leaders did not attend the hour-long meeting. Instead, the guest list included lawmakers from both parties involved in the immigration debate, such as Republican Graham and Senator Dick Durbin of Illinois, a Democrat. \nMany of the Dreamers are from Mexico and Central America and have spent most of their lives in the United States, attending school and participating in society. \nTrump put their fate in doubt in early September when he announced he was ending former President Barack Obama’s DACA program, which allowed them to legally live and work in the United States temporarily. \nSteny Hoyer, the No. 2 Democrat in the House of Representatives, said a DACA bill could win support for passage even though there are differences between the parties over constitutes necessary border security. \n“Democrats are for security at the border,” Hoyer told Trump during the meeting. “There are obviously differences, however, Mr. President, on how you affect that.” \nOn Monday, Trump announced that he was ending immigration protections for about 200,000 El Salvadorans who are living legally in the United States under the Temporary Protection Status program. Haitians and other groups have faced similar actions. \nA congressional aide told Reuters that negotiators in Congress also have been talking about legislation that would expand TPS in return for ending a visa lottery program that Republicans want to terminate. \nThese discussions are part of broader talks on protecting Dreamers and enacting additional immigration law changes, including beefed up border security. Reporting by Steve Holland and Richard Cowan; Additional reporting by Susan Cornwell, Susan Heavey and Amanda Becker; Writing by John Whitesides; Editing by Rosalba O'Brien and Alistair Bell", "external_links": [], "published": "2018-01-09T13:02:00.000+02:00", "crawled": "2018-01-09T13:08:44.006+02:00", "highlightTitle": ""}