{"organizations": [], "uuid": "fb348be12b2af6f03f5cf0141a4e4442c6e52f1e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219360486&w=1200&r=LYNXMPEE0312R", "site_section": "https://www.reuters.com/breakingviews", "section_title": "Breakingviews | Reuters", "url": "https://www.reuters.com/article/us-cyber-intel-breakingviews/breakingviews-intel-flaws-hint-at-tech-too-big-to-fail-risk-idUSKBN1ET1VD", "country": "US", "domain_rank": 408, "title": "Intel flaws hint at tech “too big to fail” risk", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.34, "site_type": "news", "published": "2018-01-05T00:26:00.000+02:00", "replies_count": 0, "uuid": "fb348be12b2af6f03f5cf0141a4e4442c6e52f1e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-cyber-intel-breakingviews/breakingviews-intel-flaws-hint-at-tech-too-big-to-fail-risk-idUSKBN1ET1VD", "ord_in_thread": 0, "title": "Intel flaws hint at tech “too big to fail” risk", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "amazon", "sentiment": "negative"}, {"name": "facebook", "sentiment": "negative"}, {"name": "intel", "sentiment": "negative"}, {"name": "advanced micro devices", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON/NEW YORK Tech groups like Amazon, Facebook and Alphabet are attracting increasing political heat for their dominance of markets like e-commerce, social media and web search. But a recently discovered security flaw in chips made by Intel, Advanced Micro Devices and ARM highlights another important concern: bugs potentially affecting hardware found in the majority of computing devices.\nScale helps justify the massive investment needed to develop improved semiconductor technology and produce chips. Intel last year said it would spend $7 billion on a U.S. factory, and it had already started building the facility years ago. The dominance of a few players also helps ensure compatibility between machines. The downside is that hardware flaws like the newly revealed Meltdown and Spectre affect a huge number of users and could become systemic. It’s an analogous problem to vulnerabilities in the once-dominant Microsoft Windows operating system – or, in the agricultural world, to a disease affecting a widely used crop variety, like the preponderant but under-threat Cavendish banana.\nSecurity researchers on Wednesday published details of Meltdown and Spectre. The first affects Intel chips and potentially allows hackers to steal secret passwords by evading the hardware barrier between applications and a protected part of a computer’s memory. The second also affects AMD and some ARM chips, and means hackers could trick applications into giving up information. Software groups like Apple and Microsoft had patches ready for Meltdown but not Spectre, which is less easily fixed but also harder to exploit.\nResearch outfit Gartner reckons no single semiconductor vendor has more than a 15 percent share across all processor types, with Samsung last year displacing Intel for the top spot because of booming memory-chip sales. But in specific sub-sectors – like personal-computer or data-centre chips – single vendors dominate. The $200 billion Intel has more than 90 percent of the market for central processing units used in servers, for example, while it and AMD have long dominated PC microprocessors.\nTrue, vulnerabilities in chip design are rare. And the diligent patching of security holes helps mitigate the danger. But as semiconductors increasingly spread to homes, cars and factories through the Internet of Things, the risk is that a winner-takes-all chip industry effectively makes a few manufacturers’ products too big to fail.\n ", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-05T00:26:00.000+02:00", "crawled": "2018-01-04T21:13:37.019+02:00", "highlightTitle": ""}