{"organizations": [], "uuid": "8f4e9a63a72decc23e3b24863e948a939966b0f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220560292&w=1200&r=LYNXMPEE08106", "site_section": "http://feeds.reuters.com/Reuters/PoliticsNews\r", "section_title": "Reuters: Politics", "url": "https://www.reuters.com/article/us-cuba-usa/u-s-wont-sent-americans-back-to-embassy-in-havana-yet-u-s-official-idUSKBN1EY1PX", "country": "US", "domain_rank": 408, "title": "U.S. won't sent Americans back to Embassy in Havana yet: U.S. official", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T16:48:00.000+02:00", "replies_count": 0, "uuid": "8f4e9a63a72decc23e3b24863e948a939966b0f6"}, "author": "", "url": "https://www.reuters.com/article/us-cuba-usa/u-s-wont-sent-americans-back-to-embassy-in-havana-yet-u-s-official-idUSKBN1EY1PX", "ord_in_thread": 0, "title": "U.S. won't sent Americans back to Embassy in Havana yet: U.S. official", "locations": [], "entities": {"persons": [{"name": "havan", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "marco rubio", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "havana", "sentiment": "none"}, {"name": "u.s. embassy", "sentiment": "none"}, {"name": "cuba", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "embassy", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "republican", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "state department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - U.S. investigators are looking at a range of theories, including the possibility of a “viral” attack, to explain what sickened American diplomats last year who were stationed in Havana, the State Department said on Tuesday.\nU.S. experts have yet to determine who or what was behind the mysterious incidents. But they saw no evidence it was a case of “mass hysteria” among the 24 affected U.S. personnel and family members, a senior State Department medical official told a Senate hearing.\nState Department officials testified that it was “incomprehensible” that Cuba’s Communist government would not have been aware of what occurred or who was responsible, though they stopped short of assigning direct blame to Havana.\nCuban officials, who are conducting their own investigation, have denied any involvement or any knowledge of who or what was behind it.\nThe administration of President Donald Trump, which has partly rolled back a detente with Cuba, responded last year by sharply drawing down U.S. embassy staff in Havana and expelling some Cuban diplomats.\nTodd Brown, diplomatic security assistant director at the State Department, said that as well as the possibility of a acoustic or sonic attack, U.S investigators were also considering whether people might have been deliberately exposed to a virus. But he offered no details.\n“I do know other type of attacks are being considered in a connection with this,” he said. “There’s viral, there is ultrasound, there’s a range of things that the technical experts are looking at.”\nExperts have argued that an acoustic attack seems implausible, given that would have caused an extremely loud noise in the neighborhood, which was not the case.\nCuban officials have dismissed as “science fiction” the notion that some kind of sonic weapon was used and have accused the Trump administration of politicizing the matter.\n‘TRAUMATIC BRAIN INJURY’\nSymptoms suffered by the diplomats have included hearing loss, tinnitus, vertigo, headaches and fatigue, a pattern consistent with “mild traumatic brain injury,” said Charles Rosenfarb, medical director of the State Department’s Bureau of Medical Services.\nA U.S. official told Reuters earlier on Tuesday that the government will not send staff back to the U.S. Embassy in Havana yet. The United States pulled out more than half of its personnel there last fall.\n“I don’t think we can say categorically that we can guarantee that they would be safe from this (if staffers return),” Brown told the hearing, chaired by Republican Senator Marco Rubio, a Cuban-American and strong critic of Cuba’s communist government.\nFrancisco Palmieri, acting Assistant Secretary of State for Western Hemisphere Affairs, said the Cuban government was responsible for the security of U.S. diplomatic personnel on the island “and they have failed to live up to that responsibility.”\nAsked whether it was possible that the Cuban government would have been unaware of any attacks, he said: “I find it very difficult to believe that. Cuba is a security state, the Cuban government in general has a very tight lid on anything and everything that happens in that country.”\nThe Cuban government has accused the Trump administration of slander for saying Havana was holding back information.\nSecretary of State Rex Tillerson will open a new high-level investigation into the matter, Palmieri said. He is convening an Accountability Review Board, a panel that evaluates cases where U.S. diplomatic personnel or facilities have been damaged abroad.\nThe new probe will be in addition to other U.S. government investigations already under way, including one by the Federal Bureau of Investigation.\nAfter decades of hostility between the United States and Cuba, the U.S. Embassy reopened in 2015 as part of moves by former President Barack Obama and his Cuban counterpart, Raul Castro, to mend ties.\nRelations have been strained since Trump took office last year, with the new administration saying Obama made too many concessions to Havana and reversing some of the measures taken under the rapprochement.\nAdditional reporting by Sarah Marsh in Havana and Arshad Mohammed and Doina Chiacu in Washington; Editing by Frances Kerry and Rosalba O'Brien\n ", "external_links": [], "published": "2018-01-09T16:48:00.000+02:00", "crawled": "2018-01-09T16:57:43.026+02:00", "highlightTitle": ""}