{"organizations": [], "uuid": "c42e1f58b23ea89a410968b9f9fd20d915091229", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/09/104936801-GettyImages-903030184.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/13/trump-dossier-testimony-financial-ties.html", "country": "US", "domain_rank": 767, "title": "Trump dossier testimony shines new light on Trump's financial ties", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.667, "site_type": "news", "published": "2018-01-13T19:04:00.000+02:00", "replies_count": 0, "uuid": "c42e1f58b23ea89a410968b9f9fd20d915091229"}, "author": "Kevin Breuninger", "url": "https://www.cnbc.com/2018/01/13/trump-dossier-testimony-financial-ties.html", "ord_in_thread": 0, "title": "Trump dossier testimony shines new light on Trump's financial ties", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "glenn simpson", "sentiment": "negative"}, {"name": "chuck grassley", "sentiment": "none"}, {"name": "dianne feinstein", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "simpson", "sentiment": "none"}], "locations": [{"name": "r-iowa", "sentiment": "none"}, {"name": "d-calif.", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "negative"}, {"name": "getty images donald trump  fusion gps", "sentiment": "neutral"}, {"name": "trump organization", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fusion GPS Co-Founder Glenn Simpson's recently disclosed Senate testimony has cast new light on President Donald Trump 's nebulous business ties and financial history.\nThe 312-page transcript , released by Sen. Dianne Feinstein , D-Calif., on Tuesday over the reported objections of Sen. Chuck Grassley , R-Iowa, documents nearly 10 hours of testimony that delves into Trump's purported wealth, the financial health of some of his properties, his business ties to disreputable figures and his public statements regarding his own finances.\nSimpson said his intelligence-gathering firm did not have access to Trump's personal tax returns beyond what had already been leaked to the media. But the firm, Simpson said, did secure Trump's \"tax bills,\" from which it concluded \"that his statements about what individual properties were worth were greatly exaggerated.\"\nThat exaggeration extended to the Trump Organization's golf courses. Simpson said that his firm's review of public financial statements showed that \"they were not profitable entities.\"\n\"I don't specifically recall. I just remember that these were not doing very well and that he'd sunk a lot of money into them and he hadn't gotten a lot of money back yet,\" Simpson said.\nSimpson's allegations about Trump's business relationships, particularly with convicted felon Felix Sater, contradicted statements Trump had previously made under oath.\nTrump \"testified under oath he wouldn't know Felix if he ran into him in the street,\" Simpson said. \"That was not true.\"\nIn a 2013 deposition , Trump had distanced himself from Sater, saying, \"I don't know him well at all,\" and \"if he were sitting in the room right now, I really wouldn't know what he looked like.\"\n\"He knew him well,\" Simpson said, \"and, in fact, continued to associate with him long after he learned of Felix's organized crime ties.\"\nSimpson's claim stunned some observers.\n\"It's an allegation of perjury,\" said Elizabeth McLaughlin, a retired lawyer and founder of the left-leaning Gaia Project for Women's Leadership. \"It's eye-popping.\"\nThe White House did not respond to CNBC's request for comment.\nThe Steele dossier A 35-page dossier featuring research commissioned by Fusion GPS, which started investigating Trump in late 2015, roiled the already-febrile post-election political landscape when Buzzfeed published it in January 2017 , less than two weeks before Trump took office. The document alleges salacious connections between Russia and the Trump campaign.\nTrump immediately labeled the dossier a \"witch hunt\" and has since repeatedly decried it as \"discredited,\" \"debunked,\" \"fictitious\" and \"fake news.\"\nTrump tweet: FAKE NEWS A TOTAL POLITICAL WITCH HUNT\nI n a recent op-ed in The New York Times , Simpson and fellow Fusion GPS co-founder Peter Fritsch said representatives of their firm had been questioned by the three Congressional bodies investigating possible contacts between Russia and the Trump campaign.\nOn Jan. 4, Senate Judiciary Committee Chairman Grassley and committee member Sen. Lindsey Graham , R-S.C., issued a criminal referral against Christopher Steele, a former British spy who compiled the dossier, for allegedly making false statements to investigators. It was not immediately clear what Steele was alleged to have lied about.\nThe following Tuesday, Feinstein released the full transcript with the backing of committee Democrats. She said the \"misinformation\" swirling in the absence of the fully viewable transcript is part of \"a deeply troubling effort to undermine the investigation.\" Trump attacked her on Twitter for releasing the transcript of the testimony while continuing to deny he colluded with Russia.\nTrump Feinstein tweet\nFormer U.S. attorney and deputy assistant attorney general Harry Litman said the content of the testimony casts Republicans' refusal to release the document in a decidedly political light. \"This is a guy who obviously has genuine concern about the security information he's coming across,\" Litman said of Simpson, \"and he's coming at it in really a conscientious or even patriotic way.\"\nThe campaign Trump's finances have been politically troublesome long before Simpson's testimony emerged.\nAs a presidential candidate, Trump eschewed a de facto tradition of modern American president campaigns by refusing to release his tax returns. Claiming to be hamstrung by an audit from the Internal Revenue Service, then-candidate Trump promised to release his tax filings as soon as he was able. Various fact-checkers at the time reported that there was no law keeping Trump from releasing his tax returns while under audit.\nShortly after Trump's inauguration in January, White House spokeswoman Kellyanne Conway announced that Trump would not be releasing this tax returns at all. \"We litigated this all through the election. People didn't care,\" she said.\nTrump's financial history remained a subject of interest after former FBI Director Robert Mueller was appointed special counsel to an investigation of possible contacts between the Trump campaign and Russia.\nIn a July 2017 interview with the New York Times, Trump warned Mueller not to extend the FBI's investigation into his or his family's personal finances. \"I think that's a violation,\" he told the Times. \"Look, this is about Russia.\"\n\"Fire and Fury\" In recent weeks, new reporting from an author with privileged access to the Trump administration suggested that many of the president's Cabinet members and confidantes were worried about the possibility of Mueller investigating Trump's business past.\nMichael Wolff's tell-all book, \"Fire and Fury: Inside the Trump White House,\" Quote: d former Trump campaign boss and former White House chief strategist Steve Bannon speculating that Mueller is gearing up to investigate suspicions of money laundering.\nAccording to \"Fire and Fury\" – which Trump has called a \"fake book\" – Bannon said that Mueller's hiring of Andrew Weissman, who prosecuted mafia members and helped lead the federal government's investigation of Enron more than a decade ago, shows that the investigation is \"all about money laundering.\"\nIn a CNBC interview , Wolff said \"everybody\" near the president thinks an examination of his finances would be more threatening than the possibility of Russian collusion.\n\"People don't think in the White House — don't think that he colluded with Russia,\" Wolff said on \"Squawk Box.\" \"They do think that if the investigation goes near his finances, he's sunk. Everybody, again, to a man.\"", "external_links": [], "published": "2018-01-13T19:04:00.000+02:00", "crawled": "2018-01-13T19:05:53.036+02:00", "highlightTitle": ""}