{"organizations": [], "uuid": "53f3a12a0b974e6d4cc03d65b1ac3ddbaa76c9f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-lear-reports-record-fourth-quarter-and-full-year-2017-results.html", "country": "US", "domain_rank": 767, "title": "Lear Reports Record Fourth Quarter and Full Year 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T15:00:00.000+02:00", "replies_count": 0, "uuid": "53f3a12a0b974e6d4cc03d65b1ac3ddbaa76c9f1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-lear-reports-record-fourth-quarter-and-full-year-2017-results.html", "ord_in_thread": 0, "title": "Lear Reports Record Fourth Quarter and Full Year 2017 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "mich.", "sentiment": "none"}, {"name": "southfield", "sentiment": "none"}], "organizations": [{"name": "lear corporation", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "exo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SOUTHFIELD, Mich., Jan. 26, 2018 /PRNewswire/ -- Lear Corporation (NYSE: LEA), a leading global supplier of automotive seating and electrical systems, today reported record results for the fourth quarter and full year 2017. Highlights include:\nFourth Quarter 2017\nRecord sales of $5.4 billion, up 16% from a year ago Net income of $401 million and record adjusted net income of $300 million, compared to $230 million and $270 million, respectively, in the prior year Record core operating earnings of $441 million, up 14% from a year ago Earnings per share of $5.80 and record adjusted earnings per share up 15% from a year ago to $4.38 Announced definitive agreement to acquire EXO Technologies\nFull Year 2017\nRecord sales of $20.5 billion, up 10% from a year ago Record net income of $1,313 million and record adjusted net income of $1,178 million, compared to $975 million and $1,026 million, respectively, in the prior year Record core operating earnings of $1,719 million, up 12% from the prior year, with a record margin of 8.4%, up from 8.3% a year ago Record earnings per share of $18.59 and record adjusted earnings per share up 21% from a year ago to $17.00 Record net cash provided by operating activities of $1.8 billion and record free cash flow of $1.2 billion Completed acquisition of Grupo Antolin's seating business\n\"In 2017, we continued to deliver superior results, as the investments that we have made in our business are paying off. We achieved record performance in all key financial metrics, and we further strengthened our product capabilities in both business segments. Today, we are in the strongest overall competitive position in our history. Our total return to shareholders last year was 35%. Over the last five years, we have delivered a total return to our shareholders of approximately 300%, almost three times the return of the S&P 500,\" said Matt Simoncini, Lear's president and chief executive officer. \"Going forward, our unique product capabilities and industry-leading cost structure will allow Lear to continue to deliver profitable sales growth and superior value to our customers and shareholders.\"\nFourth Quarter Financial Results\n(in millions, except per share amounts)\n2017\n2016\nReported\nSales\n$5,363.8\n$4,643.5\nNet income\n$400.5\n$229.9\nEarnings per share\n$5.80\n$3.24\nAdjusted (1)\nCore operating earnings\n$441.1\n$385.6\nAdjusted net income\n$300.4\n$270.1\nAdjusted earnings per share\n$4.38\n$3.80\nSales in the fourth quarter increased 16% to $5.4 billion. Excluding the impact of foreign exchange, sales were up 11%. This increase reflects the addition of new business in both of our product segments and the acquisition of Grupo Antolin's seating business.\nCore operating earnings were up $56 million to $441 million, or 8.2% of sales, primarily reflecting the increase in sales. In the Seating segment, margins and adjusted margins were 7.5% and 8.1% of sales, respectively. In the E-Systems segment, margins and adjusted margins were 13.2% and 14.3% of sales, respectively.\nEarnings per share were $5.80. In the fourth quarter, we recognized one-time net tax benefits of $146 million, comprised of $290 million of foreign tax credit benefits from the repatriation of certain foreign earnings and $30 million of other discrete tax benefits, offset by a $131 million one-time transition tax on accumulated foreign earnings and $43 million of tax expense to reflect the new U.S. corporate tax rate of 21% and other tax reform changes to our deferred tax accounts. Adjusted earnings per share were up 15% to $4.38 per share, reflecting improved operating earnings and a reduced share count.\nIn the fourth quarter of 2017, net cash provided by operating activities was $599 million and free cash flow (1) was $435 million.\nFull Year Financial Results\n(in millions, except per share amounts)\n2017\n2016\nReported\nSales\n$20,467.0\n$18,557.6\nNet income\n$1,313.4\n$975.1\nEarnings per share\n$18.59\n$13.33\nAdjusted (1)\nCore operating earnings\n$1,719.0\n$1,534.8\nAdjusted net income\n$1,177.8\n$1,026.3\nAdjusted earnings per share\n$17.00\n$14.03\nSales for the full year increased 10% to $20.5 billion. Excluding the impact of foreign exchange, sales were up 9%. This increase reflects the addition of new business in both of our product segments and the acquisition of Grupo Antolin's seating business.\nCore operating earnings were up $184 million to $1,719 million, or 8.4% of sales, primarily reflecting the increase in sales. In the Seating segment, margins and adjusted margins were 7.9% and 8.3% of sales, respectively. In the E-Systems segment, margins and adjusted margins were 14.0% and 14.6% of sales, respectively.\nEarnings per share were $18.59. During the year, we recognized one-time net tax benefits of $215 million, comprised of $290 million of foreign tax credit benefits from the repatriation of certain foreign earnings and $99 million of other discrete tax benefits, offset by a $131 million one-time transition tax on accumulated foreign earnings and $43 million of tax expense to reflect the new U.S. corporate tax rate of 21% and other tax reform changes to our deferred tax accounts. Adjusted earnings per share were up 21% to $17.00, reflecting the improved operating earnings, a reduced share count and a lower effective tax rate.\nFor the full year of 2017, net cash provided by operating activities was $1,783 million, and free cash flow (1) was $1,189 million.\n(1) For more information regarding our non-GAAP financial measures, see \"Non-GAAP Financial Information\" below.\nStrategic Acquisitions\nDuring 2017, we continued to make strategic acquisitions in both of our product segments. In Seating, we completed the acquisition and integration of Grupo Antolin's seating business, further strengthening our market share with key European customers and expanding our seat component capabilities. In E-Systems, we announced the signing of a definitive agreement to acquire EXO Technologies, a leading developer of differentiated GPS technology providing high-accuracy positioning solutions without the need for terrestrial base-station networks to support autonomous and connected vehicle applications. The acquisition of EXO Technologies closed in early January.\nShare Repurchase Program\nDuring the fourth quarter of 2017, we repurchased approximately 700,000 shares of our common stock for a total of $122 million. As of the end of the fourth quarter, we had a remaining share repurchase authorization of $546 million, which expires on December 31, 2019, and reflects approximately 4% of our total market capitalization at current market prices.\nSince initiating the share repurchase program in early 2011, we have repurchased 44.1 million shares of our common stock for a total of $3.5 billion at an average price of $79.73 per share. This represents a reduction of approximately 42% of our shares outstanding at the time that we began the program.\nFull Year 2018 Financial Outlook\nOur 2018 financial outlook is based on a global industry production assumption of 95.1 million vehicles, up 2% from 2017. On a regional basis, vehicle production is forecasted to be 17.4 million units in North America, up 2%, 23.4 million units in Europe and Africa, up 2%, and 26.5 million units in China, up 1%. Our financial outlook is also based on an average exchange rate of $1.18/Euro for the year.\nSales in 2018 are expected to be in the range of $21.4 to $21.6 billion, and core operating earnings are expected to be in the range of $1,750 million to $1,775 million. Net cash provided by operating activities is estimated to be $1.8 billion, and free cash flow is expected to be more than $1.2 billion.\nThe Company's effective tax rate on an adjusted basis is expected to be approximately 22%. Adjusted net income is expected to be in the range of $1,230 million to $1,250 million.\nPretax operational restructuring costs are estimated to be $65 million, capital expenditures are expected to be $630 million and depreciation and amortization expense is estimated to be $480 million.\nCertain of the forward-looking financial measures above are provided on a non-GAAP basis. The Company does not provide a reconciliation of such forward-looking measures to the most directly comparable financial measures calculated and presented in accordance with accounting principles generally accepted in the United States (\"GAAP\") because to do so would be potentially misleading and not practical given the difficulty of projecting event driven transactional and other non-core operating items in any future period. The magnitude of these items, however, may be significant.\n2018-2020 Sales Backlog\nWe presented our 2018-2020 sales backlog at the Deutsche Bank Global Auto Industry Conference in Detroit on January 16, 2018. The consolidated three-year backlog of $3.2 billion is the largest in the Company's history and will drive continued global revenue growth and sales diversification. E-Systems represents 41% of the backlog, reflecting market share gains as well as accelerating growth aligned with emerging industry trends, especially vehicle electrification and connectivity. In addition to our consolidated backlog, we have $700 million in backlog at our non-consolidated joint ventures, primarily in China.\nWebcast Information\nLear will webcast a conference call to review the Company's fourth quarter and full year 2017 financial results and related matters on January 26, 2018, at 9:00 a.m. Eastern Time, through the investor relations link at lear.com . In addition, the conference call can be accessed by dialing 1-800-789-4751 (domestic) or 1-973-200-3975 (international). The audio replay will be available two hours following the call until February 9, 2018 at 1-855-859-2056 (domestic) or 1-404-537-3406 (international) with a Conference I.D. of 58073011.\nNon-GAAP Financial Information\nIn addition to the results reported in accordance with GAAP included throughout this press release, the Company has provided information regarding \"pretax income before equity income, interest, other (income) expense, restructuring costs and other special items\" (core operating earnings or adjusted segment earnings), \"adjusted net income attributable to Lear\" (adjusted net income), \"adjusted diluted net income per share available to Lear common stockholders\" (adjusted earnings per share), \"tax expense excluding the impact of restructuring costs and other special items\" and \"free cash flow\" (each, a non-GAAP financial measure). Other (income) expense includes, among other things, non-income related taxes, foreign exchange gains and losses, gains and losses related to certain derivative instruments and hedging activities, losses on extinguishment of debt and gains and losses on the disposal of fixed assets. Adjusted net income represents net income attributable to Lear adjusted for restructuring costs and other special items, including the tax effect thereon. Adjusted earnings per share represents diluted net income per share available to Lear common stockholders adjusted for the redeemable noncontrolling interest adjustment, restructuring costs and other special items, including the tax effect thereon. Free cash flow represents net cash provided by operating activities, less capital expenditures.\nManagement believes the non-GAAP financial measures used in this press release are useful to both management and investors in their analysis of the Company's financial position and results of operations. In particular, management believes that core operating earnings, adjusted net income, adjusted earnings per share and tax expense excluding the impact of restructuring costs and other special items are useful measures in assessing the Company's financial performance by excluding certain items that are not indicative of the Company's core operating performance or that may obscure trends useful in evaluating the Company's continuing operating activities. Management also believes that these measures are useful to both management and investors in their analysis of the Company's results of operations and provide improved comparability between fiscal periods. Management believes that free cash flow is useful to both management and investors in their analysis of the Company's ability to service and repay its debt. Further, management uses these non-GAAP financial measures for planning and forecasting future periods.\nCore operating earnings, adjusted net income, adjusted earnings per share, tax expense excluding the impact of restructuring costs and other special items and free cash flow should not be considered in isolation or as a substitute for net income attributable to Lear, diluted net income per share attributable to Lear, cash provided by operating activities or other income statement or cash flow statement data prepared in accordance with GAAP or as a measure of profitability or liquidity. In addition, the calculation of free cash flow does not reflect cash used to service debt and, therefore, does not reflect funds available for investment or other discretionary uses. Also, these non-GAAP financial measures, as determined and presented by the Company, may not be comparable to related or similarly titled measures reported by other companies.\nFor reconciliations of these non-GAAP financial measures to the most directly comparable financial measures calculated and presented in accordance with GAAP, see the attached supplemental data pages which, together with this press release, have been posted on the Company's website through the investor relations link at lear.com .\nForward-Looking Statements\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including statements regarding anticipated financial results and liquidity. The words \"will,\" \"may,\" \"designed to,\" \"outlook,\" \"believes,\" \"should,\" \"anticipates,\" \"plans,\" \"expects,\" \"intends,\" \"estimates,\" \"forecasts\" and similar expressions identify certain of these forward-looking statements. The Company also may provide forward-looking statements in oral statements or other written materials released to the public. All statements contained or incorporated in this press release or in any other public statements that address operating performance, events or developments that the Company expects or anticipates may occur in the future are forward-looking statements. Factors that could cause actual results to differ materially from these forward-looking statements are discussed in the Company's Annual Report on Form 10-K for the year ended December 31, 2016 and its other Securities and Exchange Commission filings. Future operating results will be based on various factors, including actual industry production volumes, commodity prices and the Company's success in implementing its operating strategy.\nInformation in this press release relies on assumptions in the Company's sales backlog. The Company's sales backlog reflects anticipated net sales from formally awarded new programs less lost and discontinued programs. The calculation of the sales backlog does not reflect customer price reductions on existing or newly awarded programs. The sales backlog may be impacted by various assumptions embedded in the calculation, including vehicle production levels on new programs, foreign exchange rates and the timing of major program launches.\nThe forward-looking statements in this press release are made as of the date hereof, and the Company does not assume any obligation to update, amend or clarify them to reflect events, new information or circumstances occurring after the date hereof.\nAbout Lear\nLear Corporation was founded in Detroit in 1917 as American Metal Products. Today, Lear is one of the world's leading suppliers of automotive seating systems and electrical systems (E-Systems). Lear serves every major automaker in the world, and Lear content can be found on more than 400 vehicle nameplates. Lear's world-class products are designed, engineered and manufactured by a diverse team of approximately 165,000 employees located in 39 countries. Lear currently ranks #151 on the Fortune 500. Lear's headquarters are in Southfield, Michigan. Further information about Lear is available at lear.com or follow us on Twitter @LearCorporation.\nLear Corporation and Subsidiaries\nCondensed Consolidated Statements of Income\n(In millions, except per share amounts)\nThree Month\nPeriod Ended\nDecember 31,\nDecember 31,\n2017\n2016\nNet sales\n$ 5,363.8\n$ 4,643.5\nCost of sales\n4,788.9\n4,131.4\nSelling, general and administrative expenses\n164.1\n165.0\nAmortization of intangible assets\n13.5\n11.3\nInterest expense\n21.8\n20.5\nOther expense, net\n8.2\n7.2\nConsolidated income before income taxes and\nequity in net income of affiliates\n367.3\n308.1\nIncome taxes\n(42.7)\n82.8\nEquity in net income of affiliates\n(10.4)\n(23.2)\nConsolidated net income\n420.4\n248.5\nNet income attributable to noncontrolling interests\n19.9\n18.6\nNet income attributable to Lear\n$ 400.5\n$ 229.9\nDiluted net income per share available to Lear\ncommon stockholders\n$ 5.80\n$ 3.24\nWeighted average number of diluted shares outstanding\n68.5\n71.1\nLear Corporation and Subsidiaries\nCondensed Consolidated Statements of Income\n(In millions, except per share amounts)\nTwelve Month\nPeriod Ended\nDecember 31,\nDecember 31,\n2017\n2016\nNet sales\n$ 20,467.0\n$ 18,557.6\nCost of sales\n18,175.9\n16,455.5\nSelling, general and administrative expenses\n635.2\n621.9\nAmortization of intangible assets\n47.6\n53.0\nInterest expense\n85.7\n82.5\nOther (income) expense, net\n(4.1)\n6.4\nConsolidated income before income taxes and\nequity in net income of affiliates\n1,526.7\n1,338.3\nIncome taxes\n197.5\n370.2\nEquity in net income of affiliates\n(51.7)\n(72.4)\nConsolidated net income\n1,380.9\n1,040.5\nNet income attributable to noncontrolling interests\n67.5\n65.4\nNet income attributable to Lear\n$ 1,313.4\n$ 975.1\nDiluted net income per share available to Lear\ncommon stockholders\n$ 18.59\n$ 13.33\nWeighted average number of diluted shares outstanding\n69.3\n73.1\nLear Corporation and Subsidiaries\nCondensed Consolidated Balance Sheets\n(In millions)\nDecember 31,\nDecember 31,\n2017\n2016\nASSETS\nCurrent:\nCash and cash equivalents\n$ 1,500.4\n$ 1,271.6\nAccounts receivable\n3,230.8\n2,746.5\nInventories\n1,205.7\n1,020.6\nOther\n676.1\n610.6\n6,613.0\n5,649.3\nLong-Term:\nPP&E, net\n2,459.4\n2,019.3\nGoodwill\n1,401.3\n1,121.3\nOther\n1,472.2\n1,110.7\n5,332.9\n4,251.3\nTotal Assets\n$ 11,945.9\n$ 9,900.6\nLIABILITIES AND EQUITY\nCurrent:\nShort-term borrowings\n$ -\n$ 8.6\nAccounts payable and drafts\n3,167.2\n2,640.5\nAccrued liabilities\n1,678.1\n1,497.6\nCurrent portion of long-term debt\n9.0\n35.6\n4,854.3\n4,182.3\nLong-Term:\nLong-term debt\n1,951.5\n1,898.0\nOther\n694.1\n627.4\n2,645.6\n2,525.4\nRedeemable noncontrolling interest\n153.4\n-\nEquity\n4,292.6\n3,192.9\nTotal Liabilities and Equity\n$ 11,945.9\n$ 9,900.6\nLear Corporation and Subsidiaries\nSupplemental Data\n(Unaudited; in millions, except content per vehicle and per share amounts)\nThree Months Ended\nDecember 31,\nDecember 31,\n2017\n2016\nNet Sales\nNorth America\n$ 1,954.9\n$ 1,797.7\nEurope and Africa\n2,163.1\n1,676.4\nAsia\n1,056.7\n1,002.0\nSouth America\n189.1\n167.4\nTotal\n$ 5,363.8\n$ 4,643.5\nContent per Vehicle 1\nNorth America\n$ 469\n$ 413\nEurope and Africa\n$ 367\n$ 302\nFree Cash Flow 2\nNet cash provided by operating activities\n$ 598.8\n$ 525.4\nCapital expenditures\n(164.3)\n(228.0)\nFree cash flow\n$ 434.5\n$ 297.4\nDepreciation and Amortization\n$ 114.5\n$ 94.8\nCore Operating Earnings 2\nNet income attributable to Lear\n$ 400.5\n$ 229.9\nInterest expense\n21.8\n20.5\nOther expense, net\n8.2\n7.2\nIncome taxes\n(42.7)\n82.8\nEquity in net income of affiliates\n(10.4)\n(23.2)\nNet income attributable to noncontrolling interests\n19.9\n18.6\nPretax income before equity income, interest and\nother expense\n397.3\n335.8\nRestructuring costs and other special items -\nCosts related to restructuring actions\n24.8\n13.5\nPension settlement charge\n-\n34.2\nAcquisition and other related costs\n0.3\n1.3\nLitigation\n13.9\n-\nOther\n4.8\n0.8\nCore operating earnings\n$ 441.1\n$ 385.6\nAdjusted Net Income Attributable to Lear 2\nNet income available to Lear common shareholders\n$ 397.7\n$ 229.9\nRedeemable noncontrolling interest\n2.8\n-\nNet income attributable to Lear\n400.5\n229.9\nRestructuring costs and other special items -\nCosts related to restructuring actions\n25.0\n13.2\nPension settlement charge\n-\n34.2\nAcquisition and other related costs\n0.3\n1.3\nLitigation\n15.4\n-\nOther\n5.6\n0.6\nU.S. transition tax on accumulated foreign earnings\n131.0\n-\nDeferred tax impact of U.S. corporate tax reform\n42.5\n-\nForeign tax credits on repatriated earnings\n(289.7)\n-\nTax impact of special items and other net tax adjustments 3\n(30.2)\n(9.1)\nAdjusted net income attributable to Lear\n$ 300.4\n$ 270.1\nWeighted average number of diluted shares outstanding\n68.5\n71.1\nDiluted net income per share available to Lear\ncommon stockholders\n$ 5.80\n$ 3.24\nAdjusted earnings per share\n$ 4.38\n$ 3.80\n1\nContent per Vehicle for 2016 has been updated to reflect actual production levels.\n2\nSee \"Non-GAAP Financial Information\" included in this press release.\n3\nReflects the tax effect of restructuring costs and other special items and several discrete tax items, including tax benefits of\n$14.3 million related to an incentive tax credit in a foreign subsidiary in 2017. The identification of these tax items is judgmental\nin nature and their calculation is based on various assumptions and estimates.\nLear Corporation and Subsidiaries\nSupplemental Data\n(Unaudited; in millions, except content per vehicle and per share amounts)\nTwelve Months Ended\nDecember 31,\nDecember 31,\n2017\n2016\nNet Sales\nNorth America\n$ 7,788.1\n$ 7,523.6\nEurope and Africa\n8,136.5\n7,051.8\nAsia\n3,794.9\n3,444.6\nSouth America\n747.5\n537.6\nTotal\n$ 20,467.0\n$ 18,557.6\nContent per Vehicle 1\nNorth America\n$ 455\n$ 422\nEurope and Africa\n$ 355\n$ 316\nFree Cash Flow 2\nNet cash provided by operating activities\n$ 1,783.1\n$ 1,619.3\nCapital expenditures\n(594.5)\n(528.3)\nFree cash flow\n$ 1,188.6\n$ 1,091.0\nDepreciation and Amortization\n$ 427.7\n$ 378.2\nDiluted Shares Outstanding at end of Quarter 3\n68,084,010\n70,641,105\nCore Operating Earnings 2\nNet income attributable to Lear\n$ 1,313.4\n$ 975.1\nInterest expense\n85.7\n82.5\nOther (income) expense, net\n(4.1)\n6.4\nIncome taxes\n197.5\n370.2\nEquity in net income of affiliates\n(51.7)\n(72.4)\nNet income attributable to noncontrolling interests\n67.5\n65.4\nPretax income before equity income, interest and\nother (income) expense\n1,608.3\n1,427.2\nRestructuring costs and other special items -\nCosts related to restructuring actions\n75.4\n69.9\nPension settlement charge\n-\n34.2\nAcquisition and other related costs\n3.8\n1.3\nAcquisition-related inventory fair value adjustments\n5.0\n-\nLitigation\n13.9\n-\nOther\n12.6\n2.2\nCore operating earnings\n$ 1,719.0\n$ 1,534.8\nAdjusted Net Income Attributable to Lear 2\nNet income available to Lear common shareholders\n$ 1,287.9\n$ 975.1\nRedeemable noncontrolling interest\n25.5\n-\nNet income attributable to Lear\n1,313.4\n975.1\nRestructuring costs and other special items -\nCosts related to restructuring actions\n74.5\n69.6\nPension settlement charge\n-\n34.2\nAcquisition and other related costs\n3.8\n1.3\nAcquisition-related inventory fair value adjustments\n5.0\n-\nLitigation\n15.4\n-\nLoss on extinguishment of debt\n21.2\n-\nGain related to affiliate\n(54.2)\n(30.3)\nOther\n13.5\n-\nU.S. transition tax on accumulated foreign earnings\n131.0\n-\nDeferred tax impact of U.S. corporate tax reform\n42.5\n-\nForeign tax credits on repatriated earnings\n(289.7)\n-\nTax impact of special items and other net tax adjustments 4\n(98.6)\n(23.6)\nAdjusted net income attributable to Lear\n$ 1,177.8\n$ 1,026.3\nWeighted average number of diluted shares outstanding\n69.3\n73.1\nDiluted net income per share available to Lear\ncommon stockholders\n$ 18.59\n$ 13.33\nAdjusted earnings per share\n$ 17.00\n$ 14.03\n1\nContent per Vehicle for 2016 has been updated to reflect actual production levels.\n2\nSee \"Non-GAAP Financial Information\" included in this press release.\n3\nCalculated using stock price at end of quarter.\n4\nReflects the tax effect of restructuring costs and other special items and several discrete tax items, including tax benefits of\n$29.9 million related to the reversal of valuation allowances on the deferred tax assets of certain foreign subsidiaries, $17.3\nmillion related to the change in the accounting for share-based compensation and $14.3 million related to an incentive tax\ncredit in a foreign subsidiary in 2017. The identification of these tax items is judgmental in nature and their calculation is\nbased on various assumptions and estimates.\nLear Corporation and Subsidiaries\nSupplemental Data\n(Unaudited; in millions, except margins)\nThree Months Ended\nDecember 31,\nDecember 31,\n2017\n2016\nAdjusted Segment Earnings\nSeating\nNet sales\n$ 4,111.0\n$ 3,601.0\nSegment earnings\n$ 309.0\n$ 287.2\nCosts related to restructuring actions\n12.4\n10.2\nLitigation\n10.6\n-\nOther\n1.9\n(0.7)\nAdjusted segment earnings\n$ 333.9\n$ 296.7\nAdjusted segment margins\n8.1%\n8.2%\nE-Systems\nNet sales\n$ 1,252.8\n$ 1,042.5\nSegment earnings\n$ 164.9\n$ 149.8\nCosts related to restructuring actions\n10.2\n3.3\nLitigation\n3.3\n-\nOther\n1.2\n1.3\nAdjusted segment earnings\n$ 179.6\n$ 154.4\nAdjusted segment margins\n14.3%\n14.8%\nTwelve Months Ended\nDecember 31,\nDecember 31,\n2017\n2016\nAdjusted Segment Earnings\nSeating\nNet sales\n$ 15,873.0\n$ 14,356.7\nSegment earnings\n$ 1,250.8\n$ 1,136.0\nCosts related to restructuring actions\n46.2\n43.9\nAcquisition costs\n0.3\n-\nAcquisition-related inventory fair value adjustments\n4.3\n-\nLitigation\n10.6\n-\nOther\n1.9\n(4.7)\nAdjusted segment earnings\n$ 1,314.1\n$ 1,175.2\nAdjusted segment margins\n8.3%\n8.2%\nE-Systems\nNet sales\n$ 4,594.0\n$ 4,200.9\nSegment earnings\n$ 641.6\n$ 591.3\nCosts related to restructuring actions\n21.3\n23.1\nAcquisition-related inventory fair value adjustments\n0.7\n-\nLitigation\n3.3\n-\nOther\n4.8\n4.9\nAdjusted segment earnings\n$ 671.7\n$ 619.3\nAdjusted segment margins\n14.6%\n14.7%\nView original content with multimedia: http://www.prnewswire.com/news-releases/lear-reports-record-fourth-quarter-and-full-year-2017-results-300588658.html\nSOURCE Lear Corporation", "external_links": ["http://ir.lear.com/", "http://www.prnewswire.com/news-releases/lear-reports-record-fourth-quarter-and-full-year-2017-results-300588658.html", "http://www.lear.com/"], "published": "2018-01-26T15:00:00.000+02:00", "crawled": "2018-01-26T16:44:00.014+02:00", "highlightTitle": ""}