{"organizations": [], "uuid": "d0bbe6196e121e79279d2d3f819b9c2c12432b27", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-stryve-foods-llc-becomes-major-player-in-the-protein-snack-industry-with-acquisition-of-biltong-usa.html", "country": "US", "domain_rank": 767, "title": "Stryve Foods LLC Becomes Major Player in the Protein Snack Industry With Acquisition of Biltong USA", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.146, "site_type": "news", "published": "2018-01-31T01:16:00.000+02:00", "replies_count": 0, "uuid": "d0bbe6196e121e79279d2d3f819b9c2c12432b27"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-stryve-foods-llc-becomes-major-player-in-the-protein-snack-industry-with-acquisition-of-biltong-usa.html", "ord_in_thread": 0, "title": "Stryve Foods LLC Becomes Major Player in the Protein Snack Industry With Acquisition of Biltong USA", "locations": [], "entities": {"persons": [{"name": "ted casey", "sentiment": "none"}], "locations": [{"name": "texas", "sentiment": "none"}, {"name": "biltong usa plano", "sentiment": "none"}, {"name": "biltong usa", "sentiment": "none"}], "organizations": [{"name": "protein snack industry with acquisition", "sentiment": "negative"}, {"name": "stryve foods", "sentiment": "negative"}, {"name": "stryve foods llc", "sentiment": "negative"}, {"name": "usda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PLANO, Texas, Jan. 30, 2018 /PRNewswire/ -- Protein snacks start-up, Stryve Foods announced today that it acquired the assets of Biltong USA , one of the first USDA approved biltong manufacturers in the country.\nBiltong USA, produces high quality sliced beef biltong, droëwors, and other related products for enthusiasts nationwide. Their secret family recipe and method of curing beef was passed down for future generations to enjoy.\nStryve Foods Chairman, Ted Casey, states \"bringing our manufacturing resources to Biltong USA will greatly increase scale, allowing us to get biltong into more people's hands.\" Stryve Foods has already shown tremendous growth since its inception in the summer of 2017, including partnerships with several leading retailers in the FDM and specialty markets.\nThis acquisition brings together the knowledge base of Biltong USA and Stryve Foods respective teams of experts in the protein snack industry to provide the highest quality, best-tasting biltong product on the market. Biltong USA will continue to offer its products under its current brand while also producing for Stryve Foods. This acquisition is a significant move for Stryve Foods to become the number one name in Biltong.\nGabe Carimi, CEO of Stryve Foods stated, \"this is a major accomplishment for our young brand and a huge step towards bringing awareness about this amazing product to the U.S. We're ready to make huge strides in the meat snack industry.\"\nAbout Stryve Foods\nStryve Foods is a protein snack company based in Dallas, Texas (turkey and chicken bites baked with real fruit pieces, beef, turkey and pork sticks and gourmet beef biltong). Stryve was founded by titans of the sports nutrition industry, Ted Casey, founder of Dymatize, Joe Oblas and TJ Humphreys, founders of Prosupps, and Gabe Carimi former NFL first-round draft pick. They banded together to create a convenient, protein-packed snack that would leave people drooling. Stryve Foods products are all natural, with clean ingredients, no additives, low in sugar and high in protein. Learn more by visiting https://stryvefoods.com/\nAbout Biltong USA\nIn the late 1600's the Joubert Family, who were French Huguenots, settled in the fertile valleys of the Cape of Good Hope in South Africa. For generations, their secret family recipe and method of curing beef was passed down for future generations to enjoy. This product is now available in the US for the first time ever. The Biltong USA facility is located in Stallings, NC where biltong and droëwors are manufactured to the stringent standards imposed by the United States Department of Agriculture (USDA). In addition, the plant has also acquired the internationally recognized Hazard Analysis and Critical Control Point (HACCP) approval as well as the USDA Food Safety and Inspection Service (FSIS). Biltong USA, incorporated in 1995.\nMedia Contact:\nPaige Brown\nPhone: 469-712-6043\nEmail: paige@stryvefoods.com\nRelated Images\nimage1.jpg\nStryve Original Biltong\nimage2.jpg\nStryve Protein Snacks\nimage3.png\nBiltong USA\nView original content with multimedia: http://www.prnewswire.com/news-releases/stryve-foods-llc-becomes-major-player-in-the-protein-snack-industry-with-acquisition-of-biltong-usa-300590518.html\nSOURCE Stryve Foods", "external_links": ["https://stryvefoods.com/", "http://www.biltongusa.com/", "http://www.prnewswire.com/news-releases/stryve-foods-llc-becomes-major-player-in-the-protein-snack-industry-with-acquisition-of-biltong-usa-300590518.html"], "published": "2018-01-31T01:16:00.000+02:00", "crawled": "2018-01-31T02:15:54.005+02:00", "highlightTitle": ""}