{"organizations": [], "uuid": "15a6b8bfaf0a2a0f03c1885f34dc5ffce2e710bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-gds-announces-full-exercise-of-underwritersa-option-to-purchase-additional-adss.html", "country": "US", "domain_rank": 767, "title": "GDS Announces Full Exercise of Underwriters’ Option to Purchase Additional ADSs", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.013, "site_type": "news", "published": "2018-01-30T00:30:00.000+02:00", "replies_count": 0, "uuid": "15a6b8bfaf0a2a0f03c1885f34dc5ffce2e710bd"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-gds-announces-full-exercise-of-underwritersa-option-to-purchase-additional-adss.html", "ord_in_thread": 0, "title": "GDS Announces Full Exercise of Underwriters’ Option to Purchase Additional ADSs", "locations": [], "entities": {"persons": [{"name": "raymond james", "sentiment": "none"}], "locations": [{"name": "shanghai", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "sbcvc", "sentiment": "none"}], "organizations": [{"name": "cowen", "sentiment": "none"}, {"name": "sbcvc", "sentiment": "none"}, {"name": "citigroup", "sentiment": "none"}, {"name": "guggenheim securities", "sentiment": "none"}, {"name": "sbcvc holdings limited", "sentiment": "none"}, {"name": "j.p. morgan", "sentiment": "none"}, {"name": "rbc capital markets", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHANGHAI, China, Jan. 29, 2018 (GLOBE NEWSWIRE) -- GDS Holdings Limited (“GDS” or the “Company”) (Nasdaq:GDS) today announced that the underwriters of the previously announced public offering by it and by entities affiliated with SBCVC Holdings Limited (“SBCVC”) have exercised in full their option to purchase an additional 225,000 ADSs from GDS and 1,425,000 ADSs from SBCVC, respectively, at the public offering price of US$26.00 per ADS. Each ADS represents eight Class A ordinary shares.\nGDS and SBCVC raised a total of approximately US$204.8 million and US$110.2 million, respectively, in proceeds from the public offering, after the underwriters’ exercise in full of their option to purchase additional ADSs, after deducting underwriting discounts and commissions (but before expenses). GDS will not receive any of the proceeds from the sale of ADSs by SBCVC.\nRBC Capital Markets, J.P. Morgan and Citigroup are acting as joint book-running managers for the offering, and Cowen, Guggenheim Securities, and Raymond James are acting as co-managers.\nThe securities described above are being offered by GDS and the selling shareholders pursuant to a shelf registration statement filed by GDS with the Securities and Exchange Commission (the “SEC”) that automatically became effective as of January 23, 2018. This press release shall not constitute an offer to sell or the solicitation of an offer to buy these securities, nor shall there be any offer or sale of these securities in any state or other jurisdiction in which such offer, solicitation or sale would be unlawful prior to the registration or qualification under the securities laws of any such state or other jurisdiction.\nThe offering is being made only by means of the prospectus supplement and related prospectus, copies of which may be obtained from: RBC Capital Markets, LLC, Attention: Equity Syndicate, 200 Vesey Street, 8th Floor, New York, NY 10281-8098, or by telephone at (877) 822-4089 or by email at equityprospectus@rbccm.com ; J.P. Morgan Securities LLC, c/o Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, NY 11717, or by telephone at 866-803-9204 or by email at prospectus-eq_fi@jpmchase.com ; or Citigroup Global Markets Inc., c/o Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, NY 11717, or by telephone at (800) 831-9146.\nAbout GDS\nGDS Holdings Limited (Nasdaq:GDS) is a leading developer and operator of high-performance data centers in China. The Company’s facilities are strategically located in China’s primary economic hubs where demand for high-performance data center services is concentrated. The Company’s data centers have large net floor area, high power capacity, density and efficiency, and multiple redundancy across all critical systems. GDS is carrier and cloud neutral, which enables customers to connect to all major PRC telecommunications carriers, and to access a number of the largest PRC cloud service providers, whom GDS hosts in its facilities. The Company offers colocation and managed services, including a unique and innovative managed cloud value proposition. The Company has a 17-year track record of service delivery, successfully fulfilling the requirements of some of the largest and most demanding customers for outsourced data center services in China. The Company’s base of customers consists predominantly of hyper-scale Cloud service providers, large Internet companies, financial institutions, telecommunications and IT service providers, and large domestic private sector and multinational corporations.\nSafe Harbor\nThis news release contains forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended, and as defined in the U.S. Private Securities Litigation Reform Act of 1995. These forward-looking statements can be identified by terminology such as “will,” “expects,” “anticipates,” “future,” “intends,” “plans,” “believes,” “estimates,” “target,” “going forward,” “outlook” and similar statements. Such statements are based upon management’s current expectations and current market and operating conditions, and relate to events that involve known or unknown risks, uncertainties and other factors, all of which are difficult to predict and many of which are beyond the Company’s control, which may cause the Company’s actual results, performance or achievements to differ materially from those in the forward-looking statements. Further information regarding these and other risks, uncertainties or factors is included in the Company’s filings with the SEC. The Company does not undertake any obligation to update any forward-looking statement as a result of new information, future events or otherwise, except as required under law.\nFor investor and media inquiries, please contact:\nGDS Holdings Limited\nLaura Chen\nPhone: +86 (21) 2033-0295\nEmail: ir@gds-services.com\nThe Piacente Group, Inc.\nRoss Warner\nPhone: +86 (10) 5730-6200\nEmail: GDS@tpg-ir.com\nAlan Wang\nPhone: +1 (212) 481-2050\nEmail: GDS@tpg-ir.com\nGDS Holdings Limited\nSource:GDS Holdings Limited", "external_links": [], "published": "2018-01-30T00:30:00.000+02:00", "crawled": "2018-01-30T03:54:33.000+02:00", "highlightTitle": ""}