{"organizations": [], "uuid": "10f7ca1450fe30304a6e8a9e7c350c89a4531537", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/11/104891871-dice.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100646281/device/rss/rss.html", "section_title": "Financial Advisor Hub", "url": "https://www.cnbc.com/2018/01/24/investing-with-borrowed-money-can-win-big--for-some.html", "country": "US", "domain_rank": 767, "title": "Investing with borrowed money can win big — for some", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-24T15:59:00.000+02:00", "replies_count": 0, "uuid": "10f7ca1450fe30304a6e8a9e7c350c89a4531537"}, "author": "Kayleigh Kulp", "url": "https://www.cnbc.com/2018/01/24/investing-with-borrowed-money-can-win-big--for-some.html", "ord_in_thread": 0, "title": "Investing with borrowed money can win big — for some", "locations": [], "entities": {"persons": [{"name": "warren buffett", "sentiment": "negative"}, {"name": "ihor bondarenko", "sentiment": "none"}], "locations": [], "organizations": [{"name": "university of notre dame", "sentiment": "negative"}, {"name": "berkshire hathaway", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "In a 1991 speech at the University of Notre Dame, Warren Buffett offered a few of what are now regarded as some of his wisest words: \"I've seen more people fail because of liquor and leverage — leverage being borrowed money.\"\nIhor Bondarenko | Getty Images Using leveraged money to invest in ETFs and other stocks can be ruinous for the average individual investor who is not careful. The Berkshire Hathaway CEO told the campus audience they could make a lot of money without other people's money if they were smart.\nStill, the temptation now to use historically low-interest money from mortgages, personal credit lines and 401(k) plans to invest in the stock market is great, especially as the Dow is reaching historic heights at more than 26,000 — a milestone unfathomable in 2009, during the Great Recession.\nProfessional traders have used leveraged money from brokers and lenders to invest in exchange-traded funds and other stocks for decades, but this tactic can be ruinous for the average individual investor who is not careful, say investment and finance experts. Borrowing \"on margin\" — or using stock you already own to buy more stock — is one thing, but borrowing against your home to buy stocks is another.\n\"The decision to invest with borrowed money comes down to comparing the cost of borrowing versus the expected investment returns,\" said S. Michael Sury, lecturer of finance at the University of Texas at Austin. \"If the returns exceed the cost, then the transaction makes economic sense.\"\nToday the spread between the two is so wide that with proper diversification, it can still work. But because borrowing costs are fixed and stock market gains are variable and unpredictable, it is not a perfect formula, he said.\n\"Take an investment that offers an expected return of 15 percent, but with actual results that might range between 15 percent and 30 percent,\" said Sury. \"Even if the cost of borrowing is low, say 4 percent, the transaction is very risky.\n\"On the other hand, if a collection of diversified investments can offer a 10 percent rate of return with a narrower range of 9 percent to 11 percent, then the risk of the transaction has been dramatically reduced.\"\nWhy some fear is good for investors\nAdvisors turn to life coaches and counselors\nRetirees leave $100B in Social Security benefits on table\nIt's a strategy that can win big but also lose big, said James Sinclair, a London-based manager of TradeFinanceGlobal.com, which helps trading companies around the world structure debt so they increase trading volumes at lower margins and grow.\nIn a 2010 letter to Berkshire Hathaway shareholders , Buffett acknowledged some people had become \"very rich through the use of borrowed money,\" while others had also become very poor. \"When leverage works, it magnifies your gains ... but leverage is addictive,\" Buffett wrote. \"Once having profited from its wonders, very few people retreat to more conservative practices.\"\nFor example, if a $10 stock you purchased with cash rises in price by 10 percent, you have made a $1 profit. If the stock loses 10 percent, it is worth $9. However, a $10 stock leveraged with a 2-to-1 margin trade would make 20 percent, or a $2 profit. But if the stock loses 10 percent, the scenario can be bleak. After paying back the margin costs of about 5 percent or more, you lose $2.50 — or 25 percent — on the original $10 investment. To make matters worse, if the stock were to decline substantially, you could be subject to a margin call, where you may be forced to sell that stock at a loss, or potentially throw good money after bad, Sury said.\nThe same scenario can occur on a consumer level. Say you've used $10,000 borrowed with a home-equity loan at 5 percent to purchase $10,000 in stock. That stock appreciates 10 percent, or $1,000, in a year. You paid $500 in borrowing costs and made $500 in profit that year. But if the stock lost 10 percent, you actually lost $1,500 instead of $1,000 had you paid in cash.\nThat's why only those with a track record should attempt leveraging debt to buy investments.\nYour Wealth: Weekly advice on managing your money Sign up to get Your Wealth\nJob Industry Advertising/Marketing Automotive Communications/PR Construction/Manufacturing Education Finance/Banking/Insurance Legal Media/Entertainment Medical/Health Care Mining/Oil/Gas/Utilities Gov't/Non-Profit Real Estate Retail Technology/IT Transportation/Shipping Travel/Hospitality Other Submit Please enter a valid email address Get this delivered to your inbox, and more info about about our products and service. Privacy Policy . \"If you understand your industry and you're trading something of value, you should be able to use debt to trade more,\" Sury said.\nThere's evidence that trades on margin are increasing as the stock market continues its bullish ascent, demonstrating investor confidence now that prices are on the up and up. About $551 million in margin debt was reported to the New York Stock Exchange in August, compared to about $471 million last year. In 2010 about $236 million in margin debt was reported to the NYSE .\nWhether an individual should borrow from one asset to invest in another seems to depend on their individual financial situation, age and goals, says Lyn Alden, founder of Lyn Alden Investment Strategy. Because there aren't many bargain stocks out there, she recommends taking advantage of low rates on student loan and consumer debt to pay down slowly while investing with cash savings.\n\"These types of 'good debt' give far lower interest rates for people with good credit than the typical margin rates offered by brokers,\" she said.\nRobert R. Johnson, president and CEO of The American College of Financial Services, which trains financial advisors, said that \"using leverage to invest either in the stock market or other marketable securities is a speculative play.\"\n\"The key to building wealth is to consistently invest money, not to try and time the markets.\" -Robert R. Johnson, president & CEO of The American College of Financial Services \"The key to building wealth is to consistently invest money, not to try and time the markets,\" he added.\nAnd if you're close to retirement, it's best to avoid borrowing altogether.\n\"Occasionally, I see clients borrowing 401(k) dollars or from their home equity to get a rental property going or a small business,\" said Allie Petrova, founder and managing partner of Petrova Law PLLC, a tax- and business-law firm in Greensboro, North Carolina. \"My recommended age cut-off would be 50.\n\"Creating debt instead of equity after 50, when you are closer to retirement, is a tough sell.\"\nNo matter your investment choices, they should be for the long term, said Johnson of The American College of Financial Services. \"If you have a 30-year horizon, the stock market isn't really that risky,\" he said. \"It's only risky if you feel the need to sell during that period\" — and borrowing can force your hand to do that.\n\"It's been about 10 years since the crisis,\" Johnson added. \"Some people forget how that felt.\"\n— By Kayleigh Kulp, special to CNBC.com", "external_links": ["http://www.berkshirehathaway.com/letters/2010ltr.pdf", "http://www.nyxdata.com/nysedata/asp/factbook/viewer_edition.asp?mode=table&key=3153&category=8", "https://www.sec.gov/reportspubs/investor-publications/investorpubsmarginhtm.html"], "published": "2018-01-24T15:59:00.000+02:00", "crawled": "2018-01-24T15:03:32.008+02:00", "highlightTitle": ""}