{"organizations": [], "uuid": "b00d3350fc87cd8b586561ba5aa94128d2222a7c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-cambodia-china/chinese-investment-in-cambodian-province-pushes-up-crime-rate-says-governor-idUSKBN1FF0XP", "country": "US", "domain_rank": 408, "title": "Chinese investment in Cambodian province pushes up crime rate, says governor", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T10:59:00.000+02:00", "replies_count": 0, "uuid": "b00d3350fc87cd8b586561ba5aa94128d2222a7c"}, "author": "", "url": "https://www.reuters.com/article/us-cambodia-china/chinese-investment-in-cambodian-province-pushes-up-crime-rate-says-governor-idUSKBN1FF0XP", "ord_in_thread": 0, "title": "Chinese investment in Cambodian province pushes up crime rate, says governor", "locations": [], "entities": {"persons": [{"name": "hun sen", "sentiment": "none"}, {"name": "yun min", "sentiment": "none"}, {"name": "prak chan thul", "sentiment": "none"}, {"name": "preah sihanoukville", "sentiment": "none"}], "locations": [{"name": "beijing", "sentiment": "none"}, {"name": "cambodia", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PHNOM PENH (Reuters) - China’s growing presence and investment in a fast-developing Cambodian port and province have pushed up the crime rate and brought instability, its governor said in a letter to the government.\nAnti-China comments are rare in a country that has welcomed Chinese investment with open arms. Prime Minister Hun Sen is a close Beijing ally and China is Cambodia’s biggest source of foreign direct investment by far.\nPreah Sihanoukville province in the southwest has seen a construction boom in recent years supported by a steady stream of Chinese money into building hotels, casinos and thousands of apartments.\nGovenor Yun Min said in a three-page letter sent to the interior minister that the Chinese influx had “created opportunities for Chinese mafia to come in and commit various crimes and kidnap Chinese investors, causing insecurity in the province”.\nReuters obtained the letter on Friday and confirmed its authenticity with Yun Min and the Interior Ministry.\nSihanoukville is an illustration of how China’s money has transformed a sleepy backpacker town into an economic hub, binding Cambodia’s economy even closer to China.\nChina’s support has allowed Hun Sen to defy Western criticism of a crackdown on his opponents. The opposition Cambodia National Rescue Party was dissolved by Cambodia’s Supreme Court at the request of Hun Sen’s government.\nThat followed a crackdown on opposition figures, independent media and civil society groups.\nIn his letter to the government, Yun Min also complained about drunk Chinese getting into fights in restaurants and about rising hotel prices as a result of Chinese interest in Sihanoukville.\nNot all his comments were negative, however. Yun Min said Chinese investment had created jobs and pushed up real estate prices in the province.\nKhieu Sopheak, a spokesman for the interior ministry, said he had not yet seen the letter but added that Cambodia would not be controlled by the Chinese.\n“We still keep our sovereignty, the Chinese can’t control us,” Khieu Sopheak told Reuters. “If they come as proper investors and respect our laws, it’s fine.”\nEditing by Amy Sawitta Lefevre and Nick Macfie\n ", "external_links": [], "published": "2018-01-26T10:59:00.000+02:00", "crawled": "2018-01-26T11:15:08.005+02:00", "highlightTitle": ""}