{"organizations": [], "uuid": "87d12b0009362838c38af72acf3d05b25155056d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/06/20/104540967-GettyImages-656201462-ginni-rometty.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/ibm-hasnt-been-this-unimportant-to-the-market-in-at-least-40-years.html", "country": "US", "domain_rank": 767, "title": "IBM hasn't been this unimportant to the market in at least 40 years", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.798, "site_type": "news", "published": "2018-01-22T23:19:00.000+02:00", "replies_count": 0, "uuid": "87d12b0009362838c38af72acf3d05b25155056d"}, "author": "Ari Levy", "url": "https://www.cnbc.com/2018/01/22/ibm-hasnt-been-this-unimportant-to-the-market-in-at-least-40-years.html", "ord_in_thread": 0, "title": "IBM hasn't been this unimportant to the market in at least 40 years", "locations": [], "entities": {"persons": [{"name": "ginny rometty", "sentiment": "negative"}, {"name": "schroeter", "sentiment": "none"}, {"name": "jim cramer", "sentiment": "none"}, {"name": "watson", "sentiment": "none"}, {"name": "martin schroeter", "sentiment": "none"}], "locations": [{"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "ibm", "sentiment": "negative"}, {"name": "factset  ibm", "sentiment": "neutral"}, {"name": "google", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "IBM was such a force in the 1980s that it spent almost the entire decade as the biggest single component of the S&P 500, making up 6.4 percent of the index in 1985. \n\nThat was a long time ago. \nAfter providing a disappointing earnings outlook last week, \"Big Blue\" now makes up about 0.6 percent of the S&P 500 and has sunk to 35th in the index, according to FactSet. Howard Silverblatt, a senior index analyst at S&P Dow Jones Indices, said it's the lowest IBM has been in his four decades following the market at S&P.\nWhile investors have been pouring money into tech mega-cap companies like Alphabet , Amazon and Microsoft , even showing some enthusiasm of late for Cisco , Intel and Oracle , they've given IBM a giant shrug. \nOf the 10 most valuable U.S. tech companies, only IBM is down over the past year. Intel , the next worst performer among the group, has gained 24 percent, and the S&P 500's technology index has jumped 42 percent.\n10 most valuable U.S. tech companies Company Market cap 12-mo performance Apple $907.8 bln 48% Alphabet $794.5 bln 40% Microsoft $694.3 bln 45% Amazon $623.8 bln 63% Facebook $526.8 bln 45% Intel $209.8 bln 24% Oracle $209.4 bln 27% Cisco $204.1 bln 38% IBM $150.3 bln -4.9% Nvidia $139.4 bln 124% FactSet IBM, under CEO Ginny Rometty , is saying all the right things. The company is airing a commercial promoting its blockchain technology, which allows customers to digitally track food safety, solve financial disputes and securely exchange health data. IBM is embedding its Watson artificial intelligence engine into a growing number of applications and is taking on Amazon and Google in cloud computing. \nDuring last week's earnings call, IBM mentioned Watson 14 times, blockchain 17 times and cloud more than 50 times, according to the transcript. \nIn an interview with CNBC's Jim Cramer, IBM Senior Vice President Martin Schroeter said that Watson is allowing banks to navigate regulations around the world and helping H&R Block prepare your taxes. Its blockchain is letting giant shippers and manufacturers securely manage their supply chain at a global scale.\n\"We're operating in thousands and thousands of transactions per second,\" Schroeter said. \"That suits an enterprise world.\"\nshow chapters IBM: Blockchain 'creates a lot of value'      8:01 PM ET Thu, 18 Jan 2018 | 01:00 But for investors looking for growth -- the kind they can get from Alphabet or Facebook -- IBM looks like a stodgy mainframe computer play.\nThe company just reported its first quarterly revenue increase since 2012. That wasn't enough to overcome a profit forecast for 2018 that fell shy of analysts' estimates and a 4 percent drop in the stock. IBM said it faces a higher tax rate after the passage of the tax reform bill and expects capital expenditures to go up. \n\"Although investors have waited a long time for positive top-line comps, they now have new concerns,\" wrote Jim Kelleher, an analyst at Argus Research, in a report on Monday. \nStill, Kelleher recommends buying the shares, because \"the multiyear relative underperformance of the stock and signs of growth in strategic businesses creates an attractive opportunity for patient investors,\" he wrote. \nNobody is expecting IBM to revisit the heyday of the 1980s. From 1982 to 1988, IBM was the single biggest contributor the S&P 500 every year, according to data from Silverblatt, meaning it was the index's most valuable company. During that stretch, it accounted for between 3.8 percent and 6.4 percent of the index.\nCurrently, the biggest contributor is Apple at 3.8 percent, followed by Alphabet at 3.4 percent.\nMore recently, IBM has lost its influence in the Dow Jones Industrial Average, which is weighted by stock price rather than market cap. In March 2012, the last time IBM saw revenue growth prior to the end of 2017, IBM reached almost $210 a share and was by far the most influential stock in the Dow, almost double the price of the next biggest contributor. \nSince then, the stock has dropped 23 percent. At Monday's close of $162.61, IBM has sunk to the ninth biggest component in the Dow. \n-- CNBC's Robert Hum and Chris Hayes contributed to this report.", "external_links": [], "published": "2018-01-22T23:19:00.000+02:00", "crawled": "2018-01-22T23:42:27.018+02:00", "highlightTitle": ""}