{"organizations": [], "uuid": "7719f93177d10b8ce8d42ff057099045131a4ffc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 19}, "facebook": {"likes": 10, "shares": 10, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/23/104668309-RTS1CWES.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/08/taxes-biotech-and-pharma-companies-like-repatriation-in-tax-law.html", "country": "US", "domain_rank": 767, "title": "Taxes: Biotech and pharma companies like repatriation in tax law", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.016, "site_type": "news", "published": "2018-01-09T05:38:00.000+02:00", "replies_count": 0, "uuid": "7719f93177d10b8ce8d42ff057099045131a4ffc"}, "author": "Angelica LaVito", "url": "https://www.cnbc.com/2018/01/08/taxes-biotech-and-pharma-companies-like-repatriation-in-tax-law.html", "ord_in_thread": 0, "title": "Taxes: Biotech and pharma companies like repatriation in tax law", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Joshua Roberts | Reuters President Donald Trump listens to the cheering crowd at a campaign rally in Phoenix, Arizona, U.S., August 22, 2017. \nAt the biggest healthcare conference of the year, executives are happy about the new federal tax law — but not for the reason you may expect. \nMany biotech and pharmaceutical firm won't gain much from the new corporate tax rate, but they'll benefit from being able to access overseas cash. Analysts see a spike in dealmaking this year thanks to an influx of cash. \nBut companies at the J.P. Morgan Healthcare Conference on Monday in San Francisco insisted the money won't fundamentally change their plans for putting capital to work. \"I do think now we have a more globally competitive system, a system that will benefit the U.S. economy and will benefit job creation in the U.S.\" -Dominic Caruso, chief financial officer, Johnson & Johnson \nJohnson & Johnson Chief Financial Officer Dominic Caruso said the new law reduces some hurdles to allocating capital, but it won't shift the company's overall strategy. J&J's first priority remains its dividend, he said, then mergers and share buybacks. \n\"I do think now we have a more globally competitive system, a system that will benefit the U.S. economy and will benefit job creation in the U.S.,\" Caruso said in a presentation. Big money overseas \nThe law encourages companies to bring overseas cash back to the U.S., a process known as repatriation. They're required to pay a tax on that money, and pharmaceutical companies have some of the largest stockpiles of overseas cash. \nBut the tax law President Donald Trump signed last month makes it cheaper for multinational companies to repatriate foreign cash , and they can use that money to fund transactions. \nMedtronic CEO Omar Ishrak said the new law will allow the medical device giant to access nearly all of its cash, up from 55 percent of it. Repatriation will cost Medtronic between $2 billion and $3 billion over the next eight years on prior accumulated profit and cash, he said. The company will focus on reinvesting to offset the cost. \nCelgene CEO Mark Alles said the changes will allow it to access about 60 percent of the cash it couldn't beforehand, and the one-time tax could be between $800 million and $1.3 billion. Ahead of the presentation, the biotech company announced it would buy Impact Biomedicines . \nMore companies may clarify on how the law will affect them this week. Angelica LaVito News Associate for CNBC Related Securities ", "external_links": [], "published": "2018-01-09T05:38:00.000+02:00", "crawled": "2018-01-09T10:32:28.008+02:00", "highlightTitle": ""}