{"organizations": [], "uuid": "e8f4fd6646d1d525839f318cdf7679d0a587e70e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223030198&w=1200&r=LYNXMPEE0H10T", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-olympics-2018-stsk-korea/short-track-still-koreas-most-likely-path-to-gold-idUSKBN1F71QF", "country": "US", "domain_rank": 408, "title": "Short track still Korea's most likely path to gold", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T15:18:00.000+02:00", "replies_count": 0, "uuid": "e8f4fd6646d1d525839f318cdf7679d0a587e70e"}, "author": "", "url": "https://www.reuters.com/article/us-olympics-2018-stsk-korea/short-track-still-koreas-most-likely-path-to-gold-idUSKBN1F71QF", "ord_in_thread": 0, "title": "Short track still Korea's most likely path to gold", "locations": [], "entities": {"persons": [{"name": "steve keating", "sentiment": "negative"}, {"name": "charles hamelin", "sentiment": "none"}], "locations": [{"name": "korea", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "gangneung ice arena", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - While there has been much handwringing over sluggish ticket sales for the Pyeongchang Winter Olympics, empty seats will not be an issue inside the Gangneung Ice Arena when short track speed skating is in session.\nNothing pulls in the crowds like a winner and South Koreans expect to see several local skaters top the podium when the long blades come out for what has been described as the Winter Olympics’ answer to roller derby.\nWith 42 of the host nation’s 53 Winter Games all-time medal haul coming on the small oval, including 21 golds, short track is the hot ticket in Pyeongchang with nearly three-quarters of available seats sold before the new year.\n“Being in Korea, with all the legacy Korea has in short track and the popularity of the sport, we will have the biggest stadium with the biggest crowds in Pyeongchang,” Canadian triple gold medallist Charles Hamelin told Reuters.\n”Every single time we go race in Korea it is always something special for us because when we go there we are one of the best athletes in the world and even if we are not Korean people are loving us, cheering for us.\n“It is something special.”\nA mix of furious energy and controlled elegance, short track speed skating is capable of delivering an action packed program of heart stopping entertainment.\nWhile there are detailed rules and tactics, races often resemble little more than an adrenaline fueled mad dash to the finish line and gold can sometimes go to the last skater standing, as was the case in 2002 when Australian Steven Bradbury navigated the wreckage to win the 1,000 meters.\nIt is a discipline that South Koreans have become particularly adept at.\nSince the sport was introduced to the Olympic program at the 1992 Albertville Games, South Korea’s 42 medals are by far the most of any nation. China is next best with 30 followed by Canada with 28.\nOf the 26 Winter Games gold medals won by South Korean athletes, short track speed skaters have claimed 21 and data company Gracenote has tipped the hosts to add to their golden haul in both the men and women’s 1,000m and 1,500m events at the Feb. 9-25 Games.\nShim Suk-hee, a gold, silver and bronze medal winner in Sochi, is back eager to add to her resume while Choi Min-jeong is a gold medal threat in every race. After being shut out in Sochi, Korea’s men are also fired up to make amends on home ice.\n“I’ve been preparing to be in top form at the Olympics,” Choi told reporters earlier this month during a conference call from the South Korean National Training Center. “I‘m doing well, I think. If there is a possibility (for four gold), it will be better for me to get as much as I can.”\nEditing by Peter Rutherford\n ", "external_links": [], "published": "2018-01-18T15:18:00.000+02:00", "crawled": "2018-01-18T15:38:31.005+02:00", "highlightTitle": ""}