{"organizations": [], "uuid": "9663201236a737baef80d0ed3162d0a53fde2885", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-finn-partners-scott-widmeyer-assumes-new-role-to-enhance-and-expand-the-agencys-growth-in-washington-dc.html", "country": "US", "domain_rank": 767, "title": "Finn Partners' Scott Widmeyer Assumes New Role to Enhance and Expand the Agency's Growth in Washington, DC", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T16:00:00.000+02:00", "replies_count": 0, "uuid": "9663201236a737baef80d0ed3162d0a53fde2885"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-finn-partners-scott-widmeyer-assumes-new-role-to-enhance-and-expand-the-agencys-growth-in-washington-dc.html", "ord_in_thread": 0, "title": "Finn Partners' Scott Widmeyer Assumes New Role to Enhance and Expand the Agency's Growth in Washington, DC", "locations": [], "entities": {"persons": [{"name": "scott widmeyer", "sentiment": "negative"}, {"name": "widmeyer", "sentiment": "none"}, {"name": "peter finn", "sentiment": "none"}], "locations": [{"name": "dc new york", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "finn", "sentiment": "none"}, {"name": "washington, dc", "sentiment": "none"}, {"name": "dc", "sentiment": "none"}], "organizations": [{"name": "agency", "sentiment": "negative"}, {"name": "finn partners", "sentiment": "negative"}, {"name": "widmeyer communications", "sentiment": "none"}, {"name": "founding managing partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 23, 2018 /PRNewswire/ -- Finn Partners, one of the world's fastest growing marketing and communications firms, today announced that Scott Widmeyer, a Finn Partners founding managing partner, is stepping into a new role as Chief Strategy Officer/Washington, DC, focused on the growth of the firm in this market.\nAccording to Peter Finn, managing partner, \"Washington, DC continues to be a dynamic growth area for PR and marketing and it's been a high priority for Finn to continue expanding our DC operations, the second largest after our New York headquarters. We believe in the vibrancy and future of the Washington, DC area and our vision is to build upon our existing practice areas as well as add capabilities in new sectors.\"\nWidmeyer had been the CEO of DC-based Widmeyer Communications before he sold his firm to Finn Partners in 2013, and became a member of the Founding Managing Partners group at Finn.\n\"Scott's insights around strategic communications and public policy and the direct impact on citizens, consumers and the constituent community are of great value to our client base,\" said Finn.\nFinn Partners has approximately 65 staff in its Washington D.C. office, and is starting 2018 with approximately $15 million in annual fees generated by the DC operation. The firm's DC office includes groups specializing in public affairs, education/higher education, professional services, government agencies, digital marketing/creative services, and qualitative/quantitative research.\n\"I cut my teeth in Washington so I'm thrilled at the opportunity to work with many great colleagues and build out our footprint in the nation's capital. The role that Washington and government plays in our lives is constantly under evaluation and whether it's a for-profit entity or a non-profit organization, Finn experts who provide sound communications guidance will be in big demand,\" said Widmeyer.\nWidmeyer's ties to Washington are many including The George Washington University School of Media and Public Affairs where he chairs its National Council. He is also on the executive committee of the DC-based Education Writers Association, and formerly chaired the Gay and Lesbian Victory Fund. In 2010, Scott was inducted into the PR News Hall of Fame at a National Press Club event. Scott also is host of a weekly public affairs/lifestyle show and podcast which is produced by NPR affiliate, WNCK-FM in Nantucket, MA.\nAbout Finn Partners, Inc.\nFounded in 2011 on the core principles of innovation and collaborative partnership, Finn Partners has more than tripled in size in six years, becoming one of the fastest growing independent public relations agencies in the world. The full-service marketing and communications company's record setting pace is a result of organic growth and integrating new companies and new people into the Finn Partners world through a common philosophy. With 575 professionals, Finn Partners provides its clients with global access and capabilities in the U.S., Europe and Asia, in addition to PROI Worldwide. Headquartered in New York, Finn Partners' other offices are located in: Chicago, Detroit, Fort Lauderdale, Frankfurt, Jerusalem, London, Los Angeles, Munich, Nashville, Paris, Portland, San Francisco, Shanghai, Singapore and Washington D.C. Find us at finnpartners.com and follow us on Twitter and Instagram at @finnpartners.\nContact:\nrenee.martin@finnpartners.com\n646-307-6334\nView original content with multimedia: http://www.prnewswire.com/news-releases/finn-partners-scott-widmeyer-assumes-new-role-to-enhance-and-expand-the-agencys-growth-in-washington-dc-300586079.html\nSOURCE Finn Partners", "external_links": ["http://www.prnewswire.com/news-releases/finn-partners-scott-widmeyer-assumes-new-role-to-enhance-and-expand-the-agencys-growth-in-washington-dc-300586079.html"], "published": "2018-01-23T16:00:00.000+02:00", "crawled": "2018-01-23T18:44:41.001+02:00", "highlightTitle": ""}