{"organizations": [], "uuid": "3fe1d29329ea4b83f51d5bd0d4fed6b9d54ad0f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219547272&w=1200&r=LYNXMPEE040FM", "site_section": "https://www.reuters.com/places/china", "section_title": "China | Reuters.com", "url": "https://www.reuters.com/article/us-china-coal/china-aims-to-create-giant-coal-mining-firms-in-push-to-modernize-sector-idUSKBN1EU0Q8", "country": "US", "domain_rank": 408, "title": "China aims to supersize coal sector through mergers", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T16:43:00.000+02:00", "replies_count": 0, "uuid": "3fe1d29329ea4b83f51d5bd0d4fed6b9d54ad0f6"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-china-coal/china-aims-to-create-giant-coal-mining-firms-in-push-to-modernize-sector-idUSKBN1EU0Q8", "ord_in_thread": 0, "title": "China aims to supersize coal sector through mergers", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "national development & reform commission", "sentiment": "none"}, {"name": "national energy administration", "sentiment": "none"}, {"name": "ndrc", "sentiment": "none"}, {"name": "china national coal association", "sentiment": "none"}, {"name": "china guodian group corp", "sentiment": "none"}, {"name": "datong coal mine group", "sentiment": "none"}, {"name": "shenhua group", "sentiment": "none"}, {"name": "china coal energy group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING (Reuters) - China said on Friday it plans to create several “super-large” coal mining companies by the end of 2020 as the world’s biggest producer of the fuel ramps up years of efforts to streamline the fragmented sector and slash outdated capacity.\nThe country’s National Development & Reform Commission (NDRC) said in a statement that by the end of 2020, China plans to form a number of mega-miners, each with the capacity to produce 100 million tonnes per year of coal, which will compete on the global market and help to modernize the sector.\nLast year, China had more than 4,000 coal mines with a total capacity of 3.41 billion tonnes a year, the National Energy Administration (NEA) said in November.\nOnly six of China’s coal mining companies are currently capable of producing more than 100 million tonnes per year, according to the China National Coal Association. Those include top coal miner Shenhua Group, China Coal Energy Group and Datong Coal Mine Group [DTCOA.UL].\nThe NDRC’s plan follows the acquisition last year of state power company China Guodian Group Corp by Shenhua to create the world’s largest utility.\nThat latest arranged marriage by the government was part of Beijing’s effort to shake up its indebted and inefficient state sector, cut the number of companies and create globally competitive firms straddling many sectors including power generation, shipping and metals.\nIt also comes as Beijing deepens its war on smog with a push to boost cleaner energy consumption and limit the use of coal, which is used to produce the majority of China’s electricity.\n“Apart from eliminating excess capacity, the government is also seeking to improve coal firms’ profitability by extending business into non-coal sectors, such as power generation and transportation,” said Wu Qi, a research director at Hengfeng Bank Research Institute.\nAmong the steps proposed on Friday, the NDRC said it would encourage the coal industry to undertake more dealmaking with chemical coal, shipping and iron and steel firms.\nIt also called for the continued phase-out of outdated production by encouraging small-scale, inefficient mines to close, it said.\nUnder its five-year plan to 2020, China has pledged to eliminate around 800 million tonnes of outdated capacity and add around 500 million tonnes of advanced output. Coal output will be around 3.9 billion tonnes a year by 2020.\nReporting by Muyu Xu and Josephine Mason; Editing by Kenneth Maxwell and Christian Schmollinger\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-05T16:43:00.000+02:00", "crawled": "2018-01-05T22:30:55.043+02:00", "highlightTitle": ""}