{"organizations": [], "uuid": "51f2a736396238529100888280f5302fef7752ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/22/104960589-GettyImages-908613688.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/23/alibaba-jack-ma-entrepreneurs-should-donate-money-to-chinese-schools.html", "country": "US", "domain_rank": 767, "title": "Alibaba Jack Ma: entrepreneurs should donate money to Chinese schools", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.069, "site_type": "news", "published": "2018-01-23T09:00:00.000+02:00", "replies_count": 0, "uuid": "51f2a736396238529100888280f5302fef7752ab"}, "author": "Karen Gilchrist", "url": "https://www.cnbc.com/2018/01/23/alibaba-jack-ma-entrepreneurs-should-donate-money-to-chinese-schools.html", "ord_in_thread": 0, "title": "Alibaba Jack Ma: entrepreneurs should donate money to Chinese schools", "locations": [], "entities": {"persons": [{"name": "jack ma", "sentiment": "negative"}, {"name": "alibaba jack ma", "sentiment": "negative"}, {"name": "ma", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}], "organizations": [{"name": "ministry of education", "sentiment": "none"}, {"name": "alibaba", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Billionaire business magnate Jack Ma is calling on other entrepreneurs to support his plans to lift millions of poor Chinese children out of poverty and give them better access to education.\nThe founder and executive chairman of e-commerce behemoth Alibaba said that investing in rural boarding schools could provide a solution for China's \"left-behind children\" and ensure a more prosperous future for the next generation.\n\"Left-behind children\" is a phenomenon in China which refers to the growing number of youth who are left in rural communities while their parents relocate to urban areas to find work. For the estimated 60 million children afflicted by the problem, education is a particular issue — kids in rural communities are expected to travel an average of 5.4 kilometers from home to school, according to China's Ministry of Education.\nAFP | Getty Images Wang Fuman, also known as 'Frost Boy', walks on the road in Ludian in China's southwestern Yunnan province on January 12, 2018. At an event organized by his charitable foundation on Sunday, Ma told a room of 80 entrepreneurs that establishing a network of boarding schools would improve education standards and save children from often difficult commutes.\n\"Many pupils have to climb mountains or take a boat to go to school. In my opinion, these kids should not be commuting between home and school every day — they should go to a boarding school,\" Ma said in comments first cited by the South China Morning Post , which is owned by Alibaba.\nThe plight of China's left-behind children rose to new prominence earlier in January after an image of eight-year-old boy, Wang Fuman, became an internet sensation. The child — deemed \"Ice Boy\" — had arrived at school with his hair and eyebrows covered in ice after walking for over an hour along treacherous mountain paths to get to school.\nMa said the image reminded him of a young girl he had seen making a similar commute more than 25 years ago in 1992.\n\"So many years have passed and the situation hasn't changed,\" he said. \"It doesn't mean that the authorities haven't done anything about it, but that the resources can't reach some remote places,\" Ma said, according to SCMP.\nHe acknowledged the efforts of the Chinese government to improve education, but said that Chinese entrepreneurs could also do more by donating to their home provinces.\n\"I hope we entrepreneurs can push this plan to merge school resources. I encourage all of you to participate and make a contribution to your home provinces by building dormitories and donating school buses,\" Ma said, according to the report.\nWang HE | Getty Images Founder and Chairman of Alibaba Group Jack Ma present at the 'Ma Yun Rural Teachers Prize' awards show on January 22, 2018 in Sanya , Hainan province, China. The tycoon said he envisions merging rural schools that have under 100 students. Those new groups could be made into boarding schools, with a bus service to collect children from their villages on Mondays and return them to their homes on Fridays.\nHe added that the plan could provide employment for locals who could be hired as dormitory supervisors.\nThe event, hosted by the Jack Ma Foundation in Sanya, Hainan Island, was attended by prominent Chinese business leaders, including Beijing property tycoon Feng Lun and co-founder of private equity firm Yunfeng Capita, Yu Feng, according to the SCMP.\nMa has long espoused the benefits of education and has credited his English teacher in his hometown of Hangzhou with giving him the confidence to pursue his first vocational pursuit: teaching English.\nTo read more about Jack Ma's solution for 'left-behind children,' see the South China Morning Post report.", "external_links": [], "published": "2018-01-23T09:00:00.000+02:00", "crawled": "2018-01-23T09:00:14.000+02:00", "highlightTitle": ""}