{"organizations": [], "uuid": "c5fcce897d0dab3e64c5cc93a57fe59cde1521a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-geometric-results-inc-agrees-to-acquire-the-de-poel-group.html", "country": "US", "domain_rank": 767, "title": "Geometric Results, Inc. Agrees to Acquire the de Poel Group", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.047, "site_type": "news", "published": "2018-01-05T20:24:00.000+02:00", "replies_count": 0, "uuid": "c5fcce897d0dab3e64c5cc93a57fe59cde1521a2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-geometric-results-inc-agrees-to-acquire-the-de-poel-group.html", "ord_in_thread": 0, "title": "Geometric Results, Inc. Agrees to Acquire the de Poel Group", "locations": [], "entities": {"persons": [{"name": "bain cap", "sentiment": "negative"}, {"name": "de poel", "sentiment": "none"}, {"name": "art knapp", "sentiment": "none"}, {"name": "de poel", "sentiment": "none"}], "locations": [{"name": "detroit", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "de poel group", "sentiment": "negative"}, {"name": "geometric results, inc.", "sentiment": "neutral"}, {"name": "geometric results, inc", "sentiment": "neutral"}, {"name": "private equity", "sentiment": "none"}, {"name": "de poel", "sentiment": "none"}, {"name": "msx international", "sentiment": "none"}, {"name": "msp", "sentiment": "none"}, {"name": "gri", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DETROIT, Jan. 5, 2018 /PRNewswire/ -- Geometric Results, Inc. (GRI), a portfolio company of Bain Capital Private Equity and wholly owned subsidiary of MSX International (MSXI), is pleased to announce it has finalized an agreement to acquire the de Poel group of companies. De Poel is the UK's leading Managed Service Provider (MSP) for the purchase of non-employee workers.\nCurrently serving more than 120 private and public-sector clients, de Poel provides vendor-neutral MSP programs supported by its own unique technology platform. The company's experienced management team focuses on helping clients realize the benefits of outsourcing while coordinating with more than 1,500 recruitment agencies weekly.\nBy combining with de Poel, GRI is positioned to provide MSP services to an even broader array of industries such as automotive, technology, oil and gas, health care, retail and education.\n\"Together, GRI and de Poel are the world's largest independent MSP provider. De Poel's commitment to operate as a vendor-neutral MSP mirrors GRI's service offering,\" said Art Knapp, President of GRI. \"Since neither company is affiliated with a staffing firm, each creates individualized, strategic solutions for every client. Merging de Poel and GRI creates a leading global extended workforce solutions provider with a strong U.S. and European presence.\"\n\"Partnering with a vendor neutral, independent partner is a highly-effective outsourcing strategy for our clients,\" said Andrew Preston, de Poel's president. \"This is why so many household names in the UK choose to trust the management of their non-employee workforce to us. We are very excited to join with GRI. The acquisition will allow us to move more quickly to broaden the scope of our services for our existing and future clients.\"\n\"We are pleased to welcome the de Poel organization to our portfolio. The immediate benefits to GRI will be to increase our geographic diversity, branch out into more industry sectors, and broaden our customer base,\" said Charles Megaw, Operating Partner at Bain Capital Private Equity. \"When completed in late January 2018, de Poel will be our first acquisition following the purchase of MSXI a year ago, fulfilling our commitment to organic growth and strategic investments.\"\nContact:\nJill E. Parrino\nVice President, Solutions and Innovation\nGeometric Results, Inc.\nPhone: (720) 210-3137; Email: jparrino@geometricresultsinc.com\nAbout MSX International\nMSXI ( www.msxi.com ) is a business process outsourcing company that provides technology based services to enterprises in more than 80 countries. MSXI's deep industry expertise combined with advanced data analytics and custom software solutions improve the performance of automotive dealership networks by increasing revenue, reducing cost, and enhancing customer satisfaction. Geometric Results, Inc. (GRI), a wholly owned subsidiary of MSXI, is the world's largest independent managed service provider (MSP) with $4 billion in managed non-employee labor spend and clients in more than 70 countries. The company maintains an independent position with regard to staffing suppliers and VMS technology platforms. GRI's solutions offer management of clients' total extended workforce program activity including contracting, supplier management, payment services, and advanced analytics; clients realize improved efficiency, increased transparency, and reduced cost.\nAbout Bain Capital Private Equity\nBain Capital Private Equity ( www.baincapitalprivateequity.com ) has partnered closely with management teams to provide the strategic resources that build great companies and help them thrive since its founding in 1984. Bain Capital Private Equity's global team of approximately 220 investment professionals creates value for its portfolio companies through its global platform and depth of expertise in key vertical industries including healthcare, consumer/retail, financial and business services, industrials, and technology, media and telecommunications. Bain Capital Private Equity has offices in Boston, New York, London, Munich, Mumbai, Hong Kong, Shanghai, Sydney and Tokyo and has made more than 760 primary and add-on investments to date. In addition to private equity, Bain Capital invests across asset classes including credit, public equity and venture capital, managing approximately USD 85 billion in total and leveraging the firm's shared platform to capture opportunities in strategic areas of focus.\nAbout de Poel\nSince 2001, de Poel ( www.depoel.co.uk ) has provided vendor neutral solutions to the procurement and management of temporary workers in both the public and private sector. Navigating legislation, ensuring that compliant temporary workers are booked onto each and every shift, creating the best balance between temporary and permanent workforces, and ensuring workers are paid a fair market rate, de Poel has a game-changing track record. By implementing their in-house proprietary software solution, e-tips ® , de Poel empowers hiring organizations to build their own communities of temporary workers or revolutionizes clients' relationships with recruitment agencies. A proven technology which has processed over 2 billion temporary hours of work to date, the e-tips ® technology is supported by a dedicated Contract & Performance Management team, to ensure a best practice approach to non-permanent staffing is achieved.\nView original content: http://www.prnewswire.com/news-releases/geometric-results-inc-agrees-to-acquire-the-de-poel-group-300578292.html\nSOURCE Geometric Results, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/geometric-results-inc-agrees-to-acquire-the-de-poel-group-300578292.html"], "published": "2018-01-05T20:24:00.000+02:00", "crawled": "2018-01-05T23:22:37.026+02:00", "highlightTitle": ""}