{"organizations": [], "uuid": "4848954587a39afbbed6dc0f2aaf56b224ca3682", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.grainnet.com/rss.xml", "section_title": "Grainnet", "url": "https://www.reuters.com/article/china-economy-trade-rice/grain-gain-chinas-rice-exports-to-africa-surge-idUSL4N1PJ2ZW", "country": "US", "domain_rank": 408, "title": "China Significantly Increases Rice Exports to Africa", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T17:16:00.000+02:00", "replies_count": 0, "uuid": "4848954587a39afbbed6dc0f2aaf56b224ca3682"}, "author": "", "url": "https://www.reuters.com/article/china-economy-trade-rice/grain-gain-chinas-rice-exports-to-africa-surge-idUSL4N1PJ2ZW", "ord_in_thread": 0, "title": "China Significantly Increases Rice Exports to Africa", "locations": [], "entities": {"persons": [{"name": "josephine mason", "sentiment": "none"}, {"name": "hallie gu", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "senegal", "sentiment": "none"}, {"name": "one road", "sentiment": "none"}, {"name": "ivory coast", "sentiment": "none"}, {"name": "thailand", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "general administration of customs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Ivory Coast overtakes S.Korea as top export destination in 2017\n* Chinese stocks of rice could feed India for a year\n* One Belt, One Road scheme helps boost sales to Africa -analyst\n* Stockpiles shrink in rival exporter Thailand\nBy Josephine Mason and Hallie Gu\nBEIJING, Jan 25 (Reuters) - China’s rice exports to Africa surged last year, customs data showed on Thursday, with the world’s second-largest producer of the staple grain pushing to clear bulging state and commercial warehouses as it overhauls government support for its farming sector.\nThat rapid growth in sales to African nations is expected to continue in 2018, as buyers there increasingly turn to China as stockpiles are almost depleted in rival supplier Thailand.\nChina in 2017 sold just over 781,000 tonnes of rice to almost 40 African countries including Ivory Coast and Senegal, up from around 74,000 tonnes the year before, data from the General Administration of Customs showed. That accounted for nearly 70 percent of China’s total shipments of the commodity, versus 19 percent in 2016.\nWest Africa’s Ivory Coast overtook South Korea to become the top destination for China’s rice in 2017, with total purchases of 309,200 tonnes.\n“China has very high stocks of rice. The state is taking various measures to destock,” said Chen Xiaoshan, an analyst with Zhuochuang, a commodities consultancy in China’s eastern province of Shandong.\n“The Belt and Road Initiative policy also boosted the chances to export rice to these African countries,” Chen said, referring to a Chinese project to promote trade links with Asia, Africa and Europe through billions of dollars in infrastructure investment.\nThe pace of exports may stoke concerns in the international market about China selling excess grain abroad after years of stockpiling. In 2016, the United States complained to the World Trade Organization about Beijing’s support for the country’s wheat, corn and rice farmers.\nChina has around 94 million tonnes of rice stockpiles, two-thirds of the world’s excess inventory and enough to feed India for a year. A lot of that was accumulated through years of the government buying the grain from farmers at a minimum price when the market price dropped below that level.\nBut last year Beijing cut minimum prices for rice and wheat for the first time, marking the start of an overhaul of the subsidy programme. Analysts expect another cut to rice prices in 2018.\nThe U.S. Department of Agriculture said earlier this month that it expected Chinese sales of old-crop rice, especially to West Africa, to continue to expand as Thailand’s old-crop government stocks are nearly depleted.\nThailand has sold most of the about 18 million tonnes of rice built up during a rice-buying scheme introduced by a previous government.\n“This year, we no longer have any old rice in the state stockpile, so it is likely that China will take this African market from us,” Chookiat Ophaswongse, honorary president of the Thai Rice Exporters Association, told Reuters on Thursday.\n“This will also depend on how much old rice China has in its stockpile.”\nSouth Korea bought 167,270 tonnes of rice from China in 2017, Thursday’s data showed, making it the second-largest buyer of the grain. That was down 4.7 percent from 2016. (Reporting by Josephine Mason and Hallie Gu; additional reporting by Panarat Thepgumpanat in BANGKOK; Editing by Joseph Radford and Christian Schmollinger)\n ", "external_links": [], "published": "2018-01-26T17:16:00.000+02:00", "crawled": "2018-01-26T19:07:15.014+02:00", "highlightTitle": ""}