{"organizations": [], "uuid": "e400c9f0d16713b5de7d48bd32b6b2aae0d83a75", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-gastar-exploration-signs-definitive-agreement-to-sell-non-core-reserves-and-acreage-in-oklahoma.html", "country": "US", "domain_rank": 767, "title": "Gastar Exploration Signs Definitive Agreement To Sell Non-Core Reserves And Acreage In Oklahoma", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-26T01:23:00.000+02:00", "replies_count": 0, "uuid": "e400c9f0d16713b5de7d48bd32b6b2aae0d83a75"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-gastar-exploration-signs-definitive-agreement-to-sell-non-core-reserves-and-acreage-in-oklahoma.html", "ord_in_thread": 0, "title": "Gastar Exploration Signs Definitive Agreement To Sell Non-Core Reserves And Acreage In Oklahoma", "locations": [], "entities": {"persons": [{"name": "gastar", "sentiment": "none"}, {"name": "j. russell porter", "sentiment": "none"}], "locations": [{"name": "oklahoma", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}, {"name": "logan", "sentiment": "none"}], "organizations": [{"name": "company", "sentiment": "none"}, {"name": "west edmund hunton lime unit", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "gastar", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Transaction Provides Additional Capital for STACK Acreage Development\nHOUSTON, Jan. 25, 2018 /PRNewswire/ -- Gastar Exploration Inc. (NYSE MKT: GST) (\"Gastar\" or the \"Company\") today announced that it has entered into a definitive purchase and sale agreement to divest its interest in the West Edmund Hunton Lime Unit (\"WEHLU\") for $107.5 million.\nThe transaction, subject to customary closing conditions and adjustments, is expected to close on or before February 28, 2018, with a property sale effective date of October 1, 2017. Gastar received a deposit of 10% of the purchase price on January 25, 2018.\nWEHLU is primarily located in Oklahoma and Logan counties, Oklahoma. During the third quarter of 2017, our WEHLU assets' daily production net to the Company was approximately 2,836 barrels of oil equivalent (\"BOE\") comprised of 52% oil, 25% natural gas liquids and 23% natural gas, which constituted 46% of the Company's total equivalent production for such quarter.\nJ. Russell Porter, Gastar's President and CEO, commented, \"This divestiture of our WEHLU assets should provide Gastar with sufficient liquidity to fund our core STACK acreage development plan through 2018. Our one rig drilling program has been re-started and we expect to be able to drill and complete approximately 20 operated wells in 2018 to more fully delineate and develop the Meramec and Osage formations on our 65,200 net surface acres in our core STACK position. Due to our large, contiguous acreage position with as many as six potentially productive formations and multiple benches within certain prospective formations, we have a large inventory of undrilled horizontal locations to exploit to create value going forward.\"\nAdvisors\nTudor, Pickering, Holt & Co. advised Gastar on the sale of its WEHLU assets. Vinson & Elkins L.L.P. served as legal counsel to Gastar for the transaction.\nAbout Gastar Exploration\nGastar Exploration Inc. is a pure play Mid-Continent independent energy company engaged in the exploration, development and production of oil, condensate, natural gas and natural gas liquids. Gastar's principal business activities include the identification, acquisition and subsequent exploration and development of oil and natural gas properties with an emphasis on unconventional reserves, such as shale resource plays. Gastar holds a concentrated acreage position in what is believed to be the core of the STACK Play, an area of central Oklahoma which is home to multiple oil and natural gas-rich reservoirs including the Meramec, Oswego, Osage, Woodford and Hunton formations. For more information, visit Gastar's website at www.gastar.com .\nForward Looking Statements\nThis news release includes \"forward looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Forward looking statements give our current expectations, opinion, belief or forecasts of future events and performance. A statement identified by the use of forward looking words including \"may,\" \"expects,\" \"projects,\" \"anticipates,\" \"plans,\" \"believes,\" \"estimate,\" \"will,\" \"should,\" and certain of the other foregoing statements may be deemed . Although Gastar believes that the expectations reflected in such are reasonable, these statements involve risks and uncertainties that may cause actual future activities and results to be materially different from those suggested or described in this news release. These include risks inherent in natural gas and oil drilling and production activities, including risks with respect to continued low or further declining prices for natural gas and oil that could result in further downward revisions to the value of proved reserves or otherwise cause Gastar to further delay or suspend planned drilling and completion operations or reduce production levels which would adversely impact cash flow; risks relating to the availability of capital to fund drilling operations that can be adversely affected by adverse drilling results, production declines and continued low or further declining prices for natural gas and oil; risks regarding closing the sale of Gastar's WEHLU assets; risks of fire, explosion, blowouts, pipe failure, casing collapse, unusual or unexpected formation pressures, environmental hazards, and other operating and production risks, which may temporarily or permanently reduce production or cause initial production or test results to not be indicative of future well performance or delay the timing of sales or completion of drilling operations; delays in receipt of drilling permits; risks relating to unexpected adverse developments in the status of properties; risks relating to the absence or delay in receipt of government approvals or third-party consents; risks relating to our ability to integrate acquired assets with ours and to realize the anticipated benefits from such acquisitions; and other risks described in Gastar's Annual Report on Form 10-K and other filings with the SEC, available at the SEC's website at www.sec.gov . Our actual sales production rates can vary considerably from tested initial production rates depending upon completion and production techniques and our primary areas of operations are subject to natural steep decline rates. By issuing forward looking statements based on current expectations, opinions, views or beliefs, Gastar has no obligation and, except as required by law, is not undertaking any obligation, to update or revise these statements or provide any other information relating to such statements.\nTargeted expectations and guidance for the full-year of 2018 are based upon the current 2018 planned capital expenditures budget, which may be subject to revision and reevaluation dependent upon future developments, including changes in commodity prices, drilling results, our liquidity position, availability of crews, supplies and production capacity, weather delays and significant changes in drilling costs.\nUnless otherwise stated herein, equivalent volumes of production are based upon an energy equivalent ratio of six Mcf of natural gas to each barrel of liquids (oil, condensate and NGLs), which ratio is not reflective of relative value. Our NGLs are sold as part of our wet gas subject to an incremental NGLs pricing formula based upon a percentage of NGLs extracted from our wet gas production. Our reported production volumes reflect incremental post-processing NGLs volumes and residual gas volumes with which we are credited under our sales contracts.\nContacts:\nGastar Exploration Inc.\nJ. Russell Porter, President & Chief Executive Officer\n713-739-1800 / rporter@gastar.com\nInvestor Relations Counsel:\nLisa Elliott, Dennard Lascar Investor Relations:\n713-529-6600 / lelliott@DennardLascar.com\nView original content: http://www.prnewswire.com/news-releases/gastar-exploration-signs-definitive-agreement-to-sell-non-core-reserves-and-acreage-in-oklahoma-300588618.html\nSOURCE Gastar Exploration Inc.", "external_links": ["http://www.gastar.com/", "http://www.prnewswire.com/news-releases/gastar-exploration-signs-definitive-agreement-to-sell-non-core-reserves-and-acreage-in-oklahoma-300588618.html"], "published": "2018-01-26T01:23:00.000+02:00", "crawled": "2018-01-26T01:25:03.014+02:00", "highlightTitle": ""}