{"organizations": [], "uuid": "d6cc8f5d9984e876a1c8cde446c165b7a7ff8c19", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180122.html", "section_title": "Archive News &amp; Video for Monday, 22 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/italy-factors-jan-22/italy-factors-to-watch-on-jan-22-idUSL8N1PA3QJ", "country": "US", "domain_rank": 408, "title": "Italy - Factors to watch on Jan. 22", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T13:00:00.000+02:00", "replies_count": 0, "uuid": "d6cc8f5d9984e876a1c8cde446c165b7a7ff8c19"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/italy-factors-jan-22/italy-factors-to-watch-on-jan-22-idUSL8N1PA3QJ", "ord_in_thread": 0, "title": "Italy - Factors to watch on Jan. 22", "locations": [], "entities": {"persons": [{"name": "silvio berlusconi", "sentiment": "none"}], "locations": [{"name": "italy", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "yoox net-a-porter", "sentiment": "none"}, {"name": "corriere della sera", "sentiment": "none"}, {"name": "forza italia", "sentiment": "none"}, {"name": "richemont", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The following factors could affect Italian markets on Monday.\nReuters has not verified the newspaper reports, and cannot vouch for their accuracy. New items are marked with (*).\nFor a complete list of diary events in Italy please click on .\nPOLITICS Right-wing party Forza Italia pledges to keep Italy’s public deficit below 3 percent of gross domestic product (GDP), privatise state assets worth 3 percent of GDP and lower the debt-to-GDP ratio to “near” 100 percent in five years if it wins upcoming general elections on March 4, party’s leader and former Prime Minister Silvio Berlusconi told Corriere della Sera on Sunday.\n5-Star political movement has presented a 20-point programme for the elections, which makes no reference to a referendum on the euro and targets a reduction of 40 points in the debt-to-GDP ration over the next 10 years.\nCOMPANIES (*) YOOX NET-A-PORTER Luxury goods maker Richemont on Monday offered up to 2.8 billion euros ($3.42 billion) to buy the shares in Yoox Net-A-Porter that it does not already own in a deal aimed at boosting the Swiss company’s online presence.\n(*) CREDEM The lender wants to grow and does not rule out acquisitions, managing director Nazzareno Gregori told Affari&Finanza/La Repubblica on Monday, adding 2017 results are better than 2016.\nATLANTIA Italian airports and motorway operator Atlantia said on Friday it would call a shareholder meeting to vote on changes to its offer for Spanish rival Abertis, as it seeks to strengthen its hand in a bid battle.\nIf Atlantia decides to waive the 10.1 percent minimum acceptance threshold for the share component of its offer for Abertis, rival bidder Hochtief will come under pressure to improve the equity component of its own offer, Il Sole 24 Ore wrote on Sunday.\nMEDIASET, TELECOM ITALIA An Italian regional court said it would postpone to July 4 the first hearing of an appeal filed by Vivendi against an Italian communications authority’s decision regarding the French group’s stakes in Telecom Italia and Mediaset.\nItalian broadcaster Mediaset has lost patience with Vivendi over a negotiation about a failed pay-TV deal and is determined to fight in court, La Repubblica reported on Saturday. The daily cited sources close to Vivendi saying that the French group, instead, is confident about reaching a compromise soon.\nAn agreement to settle the dispute between Mediaset and Vivendi by Feb. 27 is “highly unlikely”, Il Giornale said.\nTelecom Italia’s board members will be on a business trip in Paris on Monday and Tuesday to visit Vivendi’s and Canal Plus’ headquarters, several Italian newspapers reported.\nItaly’s industry ministry has asked state lawyers for advice on a fine it could issue against Telecom Italia using its so-called “Golden Powers”, Il Sole 24 Ore said on Sunday. It added ministry officials last week met with Telecom Italia’s executives to start discussing a possible separation of the company’s fixed-line network.\nThere are few chances that Mediaset, Telecom Italia and Vivendi’s Canal Plus will team up to bid for TV soccer rights related to Italy’s Serie A, Il Sole 24 Ore said on Sunday.\nBANCA CARIGE Credit Agricole has not any M&A dossier on the table at the moment, Giampiero Maioli, head of the Italian unit of the French lender, told Il Messaggero on Sunday when asked about possible interest in Carige.\nIPO, ITALO Italian railway group Italo, which is planning an initial public offering, said on Friday shareholders had approved a buy back of up to 1 percent of share capital for up to 20 million euros ($24.5 million), implying a valuation of around 2 billion euros.\nGENERALI, FINCANTIERI Executives of Generali and Fincatieri will be among the managers attending a meeting with the French government at Palace of Versailles on Monday to discuss investments in France, several Italian newspapers reported over the weekend.\nMONDADORI French publisher Reworld Media is studying an offer to buy the French division of Mondadori, daily Il Sole 24 Ore reported on Saturday.\nTrade ex-dividend: ENEL of 0.105 euro per share as 2017 interim dividend; SNAM of 0.0862 euro per share as 2017 interim dividend.\nFor Italian market data and news, click on codes in brackets:\n20 biggest gainers (in percentage)\n20 biggest losers (in percentage)\nFTSE IT allshare index\nFTSE Mib index\nFTSE Allstars index...\nFTSE Mid Cap index....\nBlock trades\nStories on Italy IT-LEN\nFor pan-European market data and news, click on codes in brackets: European Equities speed guide FTSEurofirst 300 index DJ STOXX index Top 10 STOXX sectors Top 10 EUROSTOXX sectors Top 10 Eurofirst 300 sectors Top 25 European pct gainers Top 25 European pct losers Main stock markets: Dow Jones Wall Street report Nikkei 225 Tokyo report FTSE 100 London report Xetra DAX Frankfurt market stories CAC-40 Paris market stories... World Indices Reuters survey of world bourse outlook Western European IPO diary European Asset Allocation Reuters News at a Glance: Equities Main currency report:\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T13:00:00.000+02:00", "crawled": "2018-01-23T17:57:07.000+02:00", "highlightTitle": ""}