{"organizations": [], "uuid": "eeb4dcb51bf38bfc9833b18d45f24781ed331104", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/business-wire-jpmorgan-chase-appoints-daniel-pinto-and-gordon-smith-as-co-presidents-and-co-chief-operating-officers-of-the-company.html", "country": "US", "domain_rank": 767, "title": "JPMorgan Chase Appoints Daniel Pinto and Gordon Smith as Co-Presidents and Co-Chief Operating Officers of the Company", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T00:15:00.000+02:00", "replies_count": 0, "uuid": "eeb4dcb51bf38bfc9833b18d45f24781ed331104"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/business-wire-jpmorgan-chase-appoints-daniel-pinto-and-gordon-smith-as-co-presidents-and-co-chief-operating-officers-of-the-company.html", "ord_in_thread": 0, "title": "JPMorgan Chase Appoints Daniel Pinto and Gordon Smith as Co-Presidents and Co-Chief Operating Officers of the Company", "locations": [], "entities": {"persons": [{"name": "daniel pinto", "sentiment": "neutral"}, {"name": "gordon smith", "sentiment": "neutral"}, {"name": "gordon", "sentiment": "none"}, {"name": "jamie dimon", "sentiment": "none"}, {"name": "smith", "sentiment": "none"}, {"name": "pinto", "sentiment": "none"}, {"name": "dimon", "sentiment": "none"}, {"name": "daniel", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "jpmorgan chase", "sentiment": "neutral"}, {"name": "jpmorgan chase & co.", "sentiment": "neutral"}, {"name": "nyse", "sentiment": "neutral"}, {"name": "operating committee", "sentiment": "none"}, {"name": "corporate & investment bank", "sentiment": "none"}, {"name": "consumer & community banking", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- JPMorgan Chase & Co. (NYSE:JPM) today announced that Daniel Pinto (55), Chief Executive Officer of its Corporate & Investment Bank, and Gordon Smith (59), Chief Executive Officer of Consumer & Community Banking, have been appointed Co-Presidents and Co-Chief Operating Officers of the company, effective tomorrow, continuing to report to Jamie Dimon (61), Chairman and Chief Executive Officer. In addition to their current roles, Pinto and Smith will work closely with Dimon to help drive critical firmwide opportunities. Responsibilities for the rest of the firm’s Operating Committee will remain unchanged, with its members continuing to report to Dimon as well.\n“While the Board of Directors and I have agreed that I will continue in my current role for approximately five more years, the promotions we announced today reflect the enormous contributions that Gordon and Daniel have made to the continuing success of our company. Both have proven track records of working successfully across the firm, and both truly possess the capabilities, character and intellect that exemplify great leadership. Having Daniel Pinto, head of the world’s largest and most successful Corporate & Investment Bank, and Gordon Smith, CEO of America’s top consumer financial company, serve as Co-Presidents and Co-COOs of our company, demonstrates the strength of our management team and formally recognizes the critically important roles they play,” Dimon said. Dimon added that Pinto and Smith are leading innovators in their respective businesses -- embracing cutting edge technology and customer solutions that have earned them consistently growing market shares. These are particularly important skills as the firm works to fuel continued healthy growth with its wholesale and consumer customers.\n“I also want to say how grateful I am to the rest of our Operating Committee, the top leaders of our company, who have taken our company to the next level and who have been so supportive of this decision. They will continue in their current roles and will also help me and their other colleagues on various cross-company initiatives. Our other outstanding CEOs, Mary Erdoes (50), Asset and Wealth Management, and Doug Petno (52), Commercial Bank, along with our Chief Financial Officer, Marianne Lake (48), took on expanded roles last year and have played progressively more significant roles partnering across the firm in helping manage the company.”\nManagement succession planning is the highest priority of the firm’s Board of Directors, and the Board knows the firm’s senior leaders well through unfettered access and significant interaction. The Board and Dimon both believe that under all timing scenarios, whether today or in the future, the company has several highly capable successors in place. Many of the company’s top leaders have taken on firmwide responsibilities in addition to their specific mandates and have demonstrated their ability to manage at the highest level.\nThe changes announced today are also consistent with the Board’s commitment to provide ongoing growth opportunities for future generations of leaders to develop the capabilities critical to our organization’s long-term health and success.\n“I am greatly honored and humbled to be named a President of this extraordinary institution,” said Daniel Pinto, “and I’m extremely fortunate to be sharing this role with Gordon Smith, who has been an outstanding partner and friend to me. We both care deeply about our company and our people, and we are committed to building on JPMorgan Chase’s great successes.”\nGordon Smith added, “I deeply appreciate what a tremendous honor and responsibility it is to take on this broader role, and I couldn’t ask for a better partner in Daniel. We talk nearly every day, and I greatly value his counsel and friendship. It’s a privilege to work with him and my other outstanding colleagues on the Operating Committee on behalf of our millions of customers and clients and to help develop the next generation of leaders at JPMorgan Chase.”\nAbout Daniel Pinto\nDaniel Pinto is the CEO of the largest and most successful Corporate & Investment Bank in the world. He has spent his entire 35-year career at JPMorgan Chase and has run the Corporate & Investment Bank for the past five years, a division with a diversified suite of top ranked businesses in both market share and revenues, including investment banking, trading, treasury services, prime brokerage and custody. He started his career as a trader and took on increasing responsibilities in the firm’s Markets business, the largest in the world, before becoming CEO. In 2017, Daniel and Gordon Smith also assumed responsibility for firmwide technology, which plays a major role inside the CIB. Daniel has prioritized technology investments across J.P. Morgan, from cutting edge etrading and mobile technologies, to a wholesale payments business that processes $5 trillion a day and a custody business that protects, monitors and grows more than $23 trillion in assets for clients.\nAbout Gordon Smith\nGordon Smith leads America’s leading consumer and community banking business, with 140,000 employees serving 61 million households and four million small businesses. The Chase businesses he manages are leaders in payments, banking, home lending, small business lending, auto finance, and merchant services. Along with Daniel Pinto, he also manages technology and data firmwide. Gordon is known as being an exceptional people manager, a passionate advocate for the customer and a digital innovator. Smith joined Chase in 2007 after a successful career at American Express, where he ran all of its U.S. domestic card businesses and was President of its Global Commercial Card when he left to join JPMorgan Chase.\nAbout JPMorgan Chase & Co.\nJPMorgan Chase & Co. (NYSE: JPM) is a leading global financial services firm with assets of $2.5 trillion and operations worldwide. The Firm is a leader in investment banking, financial services for consumers and small businesses, commercial banking, financial transaction processing, and asset management. A component of the Dow Jones Industrial Average, JPMorgan Chase & Co. serves millions of customers in the United States and many of the world's most prominent corporate, institutional and government clients under its J.P. Morgan and Chase brands. Information about JPMorgan Chase & Co. is available at www.jpmorganchase.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180129006138/en/\nJPMorgan Chase & Co.\nInvestors:\nJason Scott, 212-270-7325\nor\nMedia:\nJoseph Evangelisti, 212-270-7438\nSource: JPMorgan Chase & Co.", "external_links": ["http://www.businesswire.com/news/home/20180129006138/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.jpmorganchase.com%2F&esheet=51750523&newsitemid=20180129006138&lan=en-US&anchor=www.jpmorganchase.com&index=1&md5=bd35e1dd1b458adac15d3754ea8a4cd1"], "published": "2018-01-30T00:15:00.000+02:00", "crawled": "2018-01-30T04:25:32.040+02:00", "highlightTitle": ""}