{"organizations": [], "uuid": "dd7c353125d3e67f7c0d6d261e1c82a7676aa04b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 55, "shares": 55, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223455340&w=1200&r=LYNXMPEE0I1PL", "site_section": "http://feeds.reuters.com/reuters/domesticNews", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-usa-mcdonalds/mcdonalds-joint-employment-trial-delayed-amid-settlement-talks-idUSKBN1F82PV", "country": "US", "domain_rank": 408, "title": "McDonald's 'joint employment' trial delayed amid settlement talks", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T00:06:00.000+02:00", "replies_count": 0, "uuid": "dd7c353125d3e67f7c0d6d261e1c82a7676aa04b"}, "author": "", "url": "https://www.reuters.com/article/us-usa-mcdonalds/mcdonalds-joint-employment-trial-delayed-amid-settlement-talks-idUSKBN1F82PV", "ord_in_thread": 0, "title": "McDonald's 'joint employment' trial delayed amid settlement talks", "locations": [], "entities": {"persons": [{"name": "robert iafolla", "sentiment": "none"}, {"name": "peter robb", "sentiment": "none"}, {"name": "lauren esposito", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "daniel wiessner", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}], "organizations": [{"name": "mcdonald", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "mcdonald’s corp", "sentiment": "none"}, {"name": "national labor relations board", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 10:07 PM / Updated 10 hours ago McDonald's 'joint employment' trial delayed amid settlement talks Daniel Wiessner , Robert Iafolla 3 Min Read \n(Reuters) - McDonald’s Corp and a U.S. labor board are in talks to settle a case claiming the fast food company is liable for purported labor law violations by its franchisees, leading a judge on Friday to pause a trial that began in 2015. \nAdministrative Law Judge Lauren Esposito in Manhattan said that even though the trial is expected to wrap up as soon as next week, McDonald‘s, its franchisees, and the National Labor Relations Board’s general counsel should have a chance to pursue a settlement. \nThe office of General Counsel Peter Robb, appointed by President Donald Trump and took office in November, requested the stay on Wednesday. The general counsel said a board decision released last month in a separate case that narrowed the definition of “joint employment” may have wiped out some of the claims against McDonald‘s. \nThe McDonald’s case had been seen as a test of when franchisors may be considered joint employers and required to bargain with unions or be held accountable for franchisees’ labor practices. Business groups have said that treating franchisors as employers could upend the franchise model. \nMcDonald’s spokeswoman Terri Hickey on Friday said ”McDonald’s USA is simply not a joint employer with its franchisees, and we are hopeful that this development will lead to a long overdue and successful resolution of the pending cases. \nThe NLRB declined to comment. \nRobert Brody, a lawyer for McDonald’s franchisees in New York, said the decision made sense after the recent NLRB ruling revising the definition of joint employment. \nThe Service Employees International Union had urged Esposito not to pause the trial. SEIU said settlement talks could proceed after the trial ended. \nAdriana Alvarez, a McDonald’s employee in Chicago and an organizer with SEIU affiliate Fight for $15, said in a statement that McDonald’s had illegally harassed and fired workers who pushed for higher wages. She said pausing the trial amounted to “a get-out-of-jail-free card” for the company. \nThe union and some McDonald’s workers filed a series of complaints with the NLRB beginning in 2012. In 2014, the general counsel issued a complaint that said McDonald’s controlled working conditions at franchises, including through corporate policies and scheduling software. \nMcDonald’s also helped franchise owners respond to nationwide protests calling for fast food companies to pay higher wages, the general counsel said. Reporting by Daniel Wiessner in New York and Robert Iafolla in Washington; Editing by Alexia Garamfalvi and Grant McCool", "external_links": [], "published": "2018-01-20T00:06:00.000+02:00", "crawled": "2018-01-20T00:22:07.005+02:00", "highlightTitle": ""}