{"organizations": [], "uuid": "909e4d36a4844a49b55ea38a4954d651249c7c9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-enlink-midstream-announces-executive-leadership-changes.html", "country": "US", "domain_rank": 767, "title": "EnLink Midstream Announces Executive Leadership Changes", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T16:02:00.000+02:00", "replies_count": 0, "uuid": "909e4d36a4844a49b55ea38a4954d651249c7c9c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-enlink-midstream-announces-executive-leadership-changes.html", "ord_in_thread": 0, "title": "EnLink Midstream Announces Executive Leadership Changes", "locations": [], "entities": {"persons": [{"name": "barry e. davis", "sentiment": "none"}, {"name": "enlink", "sentiment": "none"}, {"name": "eric d. batchelder", "sentiment": "none"}, {"name": "michael j. garberding", "sentiment": "none"}, {"name": "davis", "sentiment": "none"}], "locations": [{"name": "midstream", "sentiment": "none"}, {"name": "dallas", "sentiment": "none"}], "organizations": [{"name": "enlink midstream", "sentiment": "negative"}, {"name": "enlink", "sentiment": "none"}, {"name": "enlink midstream partners", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS, Jan. 3, 2018 /PRNewswire/ -- The EnLink Midstream companies (EnLink), EnLink Midstream, LLC (NYSE: ENLC), the General Partner, and EnLink Midstream Partners, LP (NYSE: ENLK), the Master Limited Partnership, announced today that EnLink's Boards of Directors have appointed Barry E. Davis to Executive Chairman, Michael J. Garberding to President and Chief Executive Officer, and Eric D. Batchelder to Executive Vice President and Chief Financial Officer.\nThese transitions are the result of the company's succession process, which was developed and administered by EnLink's Boards of Directors to ensure strategic leadership continuity and the company's long-term success. Additionally, the transitions enhance EnLink's strong leadership team, which is dedicated to pursuing growth through execution excellence.\nBarry E. Davis has transitioned from his role as Chairman and CEO to become Executive Chairman, a newly created role in which he will continue to guide the company's long-term strategy. Davis has served as CEO since EnLink was created in 2014, following the merger of Crosstex Energy and Devon Energy Corp., a transaction that Davis was instrumental in spearheading. Prior to that, Davis led the founding of Crosstex in 1996 and drove asset expansions and a strong values-focused culture. Today, EnLink is a leading growth-focused, integrated midstream company with premier positions in the Permian's Midland and Delaware basins, Oklahoma's Midcontinent, and Louisiana's Gulf Coast. Over the past four years, the Partnership has approximately quadrupled its adjusted EBITDA and tripled its workforce. Adjusted EBITDA is a non-GAAP measure and is explained in greater detail under \"Non-GAAP Financial Information.\"\n\"I look forward to continuing to serve EnLink as Executive Chairman, guiding EnLink's long-term strategy while working closely with Mike and the rest of our outstanding leadership team,\" Davis said. \"I remain fully engaged and will spend the majority of my time dedicated to EnLink.\"\nMichael J. Garberding is appointed President and CEO of EnLink, succeeding Davis as CEO. In his new role, Garberding is responsible for developing and leading EnLink's corporate strategy. Additionally, as part of this transition, he has joined the boards of directors for both ENLK and ENLC. Previously, he served as EnLink's CFO since 2011 and President and CFO since 2016. Garberding has more than 25 years of leadership experience in the energy industry and has held several executive-level positions within EnLink and its predecessors since 2008, including Senior Vice President of Business Development and Finance. He played a critical leadership role in creating EnLink's financial and corporate strategy and was instrumental in the execution and integration of the merger that formed EnLink. Under his and Davis' visionary leadership, EnLink executed more than $4.5 billion of organic expansions and acquisition-related transactions over the last three years.\n\"I am honored that Barry and the Boards have elected me as CEO, and I look forward to guiding EnLink toward further growth and success in my new position,\" Garberding said. \"Under Barry's leadership, EnLink has grown into a leading midstream service provider, and I am confident that our talented leadership team and highly dedicated employee base will continue executing EnLink's strategic growth plan and vision of being the 'Trusted Energy Partner' in our industry.\"\n\"After working closely with Mike for nearly a decade, the Boards and I are confident that the time is right for Mike to make the natural transition into the role of CEO,\" Davis said. \"His track record and commitment to EnLink's employees, customers, and financial position prove he is well qualified to lead the company in its next stage.\"\nEric D. Batchelder has joined EnLink as Executive Vice President and CFO. In his new role, Batchelder is responsible for EnLink's economic strategy and oversees financial forecasting and reporting, as well as capital markets activity. Batchelder brings more than 15 years of financial leadership experience in the energy sector, most recently as Managing Director, Energy Investment Banking at RBC Capital Markets. At RBC, where he served for five years, Batchelder was responsible for transaction structuring, capital markets activity, strategic planning, business development efforts, and maintaining key client relationships for the bank's midstream energy advisory business in the United States. He also has extensive experience in advising clients with mergers and acquisitions, including several EnLink transactions. Prior to RBC, Batchelder spent 10 years at Goldman Sachs & Co. where he advised on several significant deals, including the approximately $10 billion sale of Southern Union Co. to Energy Transfer Equity and the $1.35 billion sale of Koch Industries Natural Gas Liquids Business to ONEOK. Prior to Goldman Sachs, he spent seven years at Arthur Andersen LLP and is a certified public accountant. He earned a Bachelor of Arts in economics from Middlebury College, a Master of Science in professional accounting from the University of Hartford, and a Master of Business Administration from The Tuck School of Business at Dartmouth.\n\"I have known Eric for 15 years, and he has played a crucial role in advising EnLink during several key acquisitions,\" Garberding said. \"He has a strong understanding of our financial strategy, along with an unparalleled knowledge of the midstream sector. Eric's years of capital markets experience will be valuable to our ongoing strategic and financial initiatives at EnLink, and we look forward to accomplishing great things together.\"\nAdditionally, EnLink named R. Alan Marcum to the boards of directors for both ENLK and ENLC. He was selected to serve as a director due to his affiliation with Devon, his extensive knowledge of the energy industry, and his financial and business expertise. Marcum is the Executive Vice President, Administration for Devon, a position he has served in since 2008. Prior to joining Devon in 1995, Marcum was employed by KPMG Peat Marwick as a Senior Auditor. He earned a bachelor's degree from East Central University, majoring in accounting and finance. He is a certified public accountant and a member of the Oklahoma Society of Certified Public Accountants.\nSteve J. Hoppe, EnLink Executive Vice President and President of the Gas Business Unit, is leaving the company to pursue other interests. Hoppe has been with EnLink since its creation in 2014, having joined the company from Devon at the time of the merger.\n\"We are thankful to Steve for his service to EnLink and wish him success in his future endeavors,\" Garberding said.\nAbout the EnLink Midstream Companies\nEnLink provides integrated midstream services across natural gas, crude oil, condensate, and NGL commodities. EnLink operates in several top U.S. basins and is strategically focused on the core growth areas of the Permian's Midland and Delaware basins, Oklahoma's Midcontinent, and Louisiana's Gulf Coast. Headquartered in Dallas, EnLink is publicly traded through EnLink Midstream, LLC (NYSE: ENLC), the General Partner, and EnLink Midstream Partners, LP (NYSE: ENLK), the Master Limited Partnership. Visit www.EnLink.com for more information on how EnLink connects energy to life.\nNon-GAAP Financial Information\nThis press release contains a non-generally accepted accounting principle financial measure that we refer ", "external_links": ["http://www.prnewswire.com/news-releases/enlink-midstream-announces-executive-leadership-changes-300576779.html", "http://www.enlink.com/"], "published": "2018-01-03T16:02:00.000+02:00", "crawled": "2018-01-03T18:40:47.004+02:00", "highlightTitle": ""}