{"organizations": [], "uuid": "7f951b84de813bcc642eef46e2cd4fe720a899f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-usa-crime-uber-trafficking/uber-drivers-told-how-to-spot-traffickers-in-their-cabs-idUSKBN1FI23C", "country": "US", "domain_rank": 408, "title": "Uber drivers told how to spot traffickers in their cabs", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T18:30:00.000+02:00", "replies_count": 0, "uuid": "7f951b84de813bcc642eef46e2cd4fe720a899f9"}, "author": "", "url": "https://www.reuters.com/article/us-usa-crime-uber-trafficking/uber-drivers-told-how-to-spot-traffickers-in-their-cabs-idUSKBN1FI23C", "ord_in_thread": 0, "title": "Uber drivers told how to spot traffickers in their cabs", "locations": [], "entities": {"persons": [{"name": "bacchi", "sentiment": "none"}, {"name": "thorn", "sentiment": "none"}, {"name": "tracey breeden", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "walk free foundation", "sentiment": "none"}, {"name": "mccain institute", "sentiment": "none"}, {"name": "uber", "sentiment": "none"}, {"name": "united nations international labour organization", "sentiment": "none"}, {"name": "min read  london", "sentiment": "none"}, {"name": "ilo", "sentiment": "none"}, {"name": "thomson reuters foundation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 4:33 PM / in 15 minutes Uber drivers told how to spot traffickers in their cabs Umberto Bacchi 3 Min Read \nLONDON (Thomson Reuters Foundation) - Uber is enlisting its drivers across the United States in the fight against modern slavery by giving them tips on how to spot traffickers and their victims when they hail a car, the app-based taxi company said on Monday. \nAbout 40 million people worldwide were living as modern slaves last year - many trapped in forced labor or sexual exploitation - according to the United Nations International Labour Organization (ILO) and human rights group Walk Free Foundation. \n“Uber connects millions of people daily all around the globe, and drivers are uniquely positioned to help identify and ultimately prevent human trafficking,” Uber safety spokeswoman Tracey Breeden said in a statement. \nThe company said it was partnering with U.S. anti-trafficking groups, including ECPAT-USA, Thorn and The McCain Institute, in an effort to fight the crime. \nThe move comes as Uber tries to reassure regulators that it is changing the way it does business, after a string of controversies damaged its reputation and led to the exit of its co-founder Travis Kalanick last year. \nAs part of the anti-trafficking initiative messages sent via the app will provide drivers with information on trafficking and how to report their suspicions to police and non-governmental organizations. \nThey will be told to look out for signs of trafficking such as people who look inadequately dressed, fearful, or submissive, sport bruises or are accompanied by someone who seems controlling, the company said. \n“Ride sharing services like Uber have a significant role to play in disrupting human trafficking and helping survivors to find freedom,” said Bradley Myles, head of anti-trafficking organization Polaris. \nIn 2016, an Uber driver helped rescue an underage girl who was about to be trafficked in California by alerting police after she got in his car with her alleged captors, the company said. \nGlobally, human trafficking earns profits of roughly $150 billion a year for traffickers, according to the ILO. \nUber has been criticized in several countries for failing to carry out thorough background checks on drivers. \nThe company is battling to keep its cars on the streets of London amid concerns about its approach to reporting serious criminal offences and vetting drivers. \nLast month an Uber driver in Lebanon was arrested for the alleged murder of a British embassy worker in Beirut. Reporting by Umberto Bacchi @UmbertoBacchi, Editing by Emma Batha.; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org", "external_links": [], "published": "2018-01-29T18:30:00.000+02:00", "crawled": "2018-01-29T18:51:42.007+02:00", "highlightTitle": ""}