{"organizations": [], "uuid": "15d3d7f878a77ac5790765315aba143b1907ff02", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-technical-perspectives-on-trucking-stocks--j-b-hunt-old-dominion-freight-line-werner-enterprises-and-yrc-worldwide.html", "country": "US", "domain_rank": 767, "title": "Technical Perspectives on Trucking Stocks -- J.B. Hunt, Old Dominion Freight Line, Werner Enterprises, and YRC Worldwide", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-23T14:15:00.000+02:00", "replies_count": 0, "uuid": "15d3d7f878a77ac5790765315aba143b1907ff02"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-technical-perspectives-on-trucking-stocks--j-b-hunt-old-dominion-freight-line-werner-enterprises-and-yrc-worldwide.html", "ord_in_thread": 0, "title": "Technical Perspectives on Trucking Stocks -- J.B. Hunt, Old Dominion Freight Line, Werner Enterprises, and YRC Worldwide", "locations": [], "entities": {"persons": [{"name": "j.b. hunt", "sentiment": "neutral"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "lowell", "sentiment": "none"}, {"name": "arkansas", "sentiment": "none"}], "organizations": [{"name": "werner enterprises", "sentiment": "neutral"}, {"name": "yrc worldwide", "sentiment": "neutral"}, {"name": "j.b. hunt transport services inc.", "sentiment": "none"}, {"name": "wern", "sentiment": "none"}, {"name": "j.b. hunt transport services shares", "sentiment": "none"}, {"name": "jbht", "sentiment": "none"}, {"name": "old dominion freight line inc.", "sentiment": "none"}, {"name": "yrc worldwide inc.", "sentiment": "none"}, {"name": "odfl", "sentiment": "none"}, {"name": "werner enterprises inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, WallStEquities.com strives to bring the best free research to the investment community. Today we are offering reports on JBHT, ODFL, WERN, and YRCW which can be accessed for free by signing up to www.wallstequities.com/registration . Today's research on WallStEquities.com is centered on the Trucking industry, which is engaged in transporting large quantities of raw materials, works in process, and finished goods over land — typically from manufacturing plants to retail distribution centers. Four stocks have been lined up for tracking this morning, and they: are J.B. Hunt Transport Services Inc. (NASDAQ: JBHT), Old Dominion Freight Line Inc. (NASDAQ: ODFL), Werner Enterprises Inc. (NASDAQ: WERN), and YRC Worldwide Inc. (NASDAQ: YRCW). All you have to do is sign up today for this free limited time offer by clicking the link below.\nwww.wallstequities.com/registration\nJ.B. Hunt Transport Services\nShares in Lowell, Arkansas headquartered J.B. Hunt Transport Services Inc. climbed 1.44%, ending Monday's trading session at $125.39. The stock recorded a trading volume of 1.17 million shares, which was higher than its three months average volume of 902,530 shares. The Company's shares have gained 11.22% in the last month, 19.66% over the last three months, and 32.66% over the past year. The stock is trading 12.58% and 26.53% above its 50-day and 200-day moving averages, respectively. Moreover, shares of J.B. Hunt have a Relative Strength Index (RSI) of 86.99.\nOn January 10 th , 2018, J.B. Hunt announced that it has been named as a Top 100 Trucker for 2017 by Inbound Logistics. According to the magazine, the annual Top 100 Truckers directory provides a comprehensive list of carriers that match the demanding and diverse needs of the shipping community.\nOn January 11 th , 2018, research firm JP Morgan downgraded the Company's stock rating from 'Overweight' to 'Neutral'. Get the full research report on JBHT for free by clicking below at:\nwww.wallstequities.com/registration/?symbol=JBHT\nOld Dominion Freight Line\nThomasville, North Carolina-based Old Dominion Freight Line Inc.'s stock rose slightly by 0.76%, closing the day at $149.10 with a total trading volume of 632,933 shares. The Company's shares have advanced 14.89% in the past month, 34.77% in the previous three months, and 70.28% over the past year. The stock is trading 14.97% and 41.62% above its 50-day and 200-day moving averages, respectively. Additionally, shares of Old Dominion have an RSI of 85.00.\nOn January 10 th , 2018, Old Dominion announced plans to release its fourth-quarter and year-end 2017 financial results on February 08 th , 2018, before opening of trading. The Company will hold a conference call at 10:00 a.m. ET that same day to discuss its financial results and outlook. An online, real-time webcast of the quarterly conference call will be available on the Company's website. Access the free research report on ODFL now by signing up at:\nwww.wallstequities.com/registration/?symbol=ODFL\nWerner Enterprises\nOn Monday, shares in Omaha, Nebraska headquartered Werner Enterprises Inc. recorded a trading volume of 635,266 shares. The stock ended the day 0.97% higher at $41.80. The Company's shares have advanced 7.59% in the past month, 17.42% in the previous three months, and 57.74% over the past year. The stock is trading above its 50-day and 200-day moving averages by 11.06% and 29.20%, respectively. Furthermore, shares of Werner Enterprises have an RSI of 71.89.\nOn December 29 th , 2017, Werner Enterprises announced its designation as a 2018 Military Spouse Friendly Employer® by G.I. Jobs magazine for the third consecutive year. The Company was recognized as number two on the list of 92 Military Spouse Friendly Employers®.\nOn January 08 th , 2018, research firm UBS upgraded the Company's stock rating from 'Neutral' to 'Buy' while revising its previous target price from $37 a share to $47 a share. Are you already registered with Wall St. Equities? Do so now for free, and get the report on WERN at:\nwww.wallstequities.com/registration/?symbol=WERN\nYRC Worldwide\nOverland Park, Kansas headquartered YRC Worldwide Inc.'s stock rose 2.59%, finishing yesterday's session at $17.45. A total volume of 827,632 shares was traded, which was above their three months average volume of 650,310 shares. The Company's shares have advanced 19.60% in the last month, 33.21% in the previous three months, and 27.93% over the past year. The stock is trading above its 50-day and 200-day moving averages by 27.67% and 43.74%, respectively. Additionally, shares of YRC Worldwide have an RSI of 79.52.\nOn January 11 th , 2018, YRC Worldwide announced that its executives will host a conference call with the investment community on February 01 st , 2018, at 4:30 p.m. ET to discuss Q4 and year-end 2017 financial results. The results will be released that same day, following the close of the market. The call will be webcast live and accessible on the Company's website. Aspiring Member, please take a moment to register below for your free research report on YRCW at:\nwww.wallstequities.com/registration/?symbol=YRCW\n--\nWall St. Equities :\nWall St. Equities (WSE) produces regular sponsored and non-sponsored reports, articles, stock market blogs, and popular investment newsletters covering equities listed on NYSE and NASDAQ and micro-cap stocks. WSE has two distinct and independent departments. One department produces non-sponsored analyst certified content generally in the form of press releases, articles and reports covering equities listed on NYSE and NASDAQ and the other produces sponsored content (in most cases not reviewed by a registered analyst), which typically consists of compensated investment newsletters, articles and reports covering listed stocks and micro-caps. Such sponsored content is outside the scope of procedures detailed below.\nWSE has not been compensated; directly or indirectly; for producing or publishing this document.\nPRESS RELEASE PROCEDURES :\nThe non-sponsored content contained herein has been prepared by a writer (the \"Author\") and is fact checked and reviewed by a third-party research service company (the \"Reviewer\") represented by a credentialed financial analyst [for further information on analyst credentials, please email info@wallstequities.com . Rohit Tuli, a CFA® charterholder (the \"Sponsor\"), provides necessary guidance in preparing the document templates. The Reviewer has reviewed and revised the content, as necessary, based on publicly available information which is believed to be reliable. Content is researched, written and reviewed on a reasonable-effort basis. The Reviewer has not performed any independent investigations or forensic audits to validate the information herein. The Reviewer has only independently reviewed the information provided by the Author according to the procedures outlined by WSE. WSE is not entitled to veto or interfere in the application of such procedures by the third-party research service company to the articles, documents or reports, as the case may be. Unless otherwise noted, any content outside of this document has no association with the Author or the Reviewer in any way.\nNO WARRANTY\nWSE, the Author, and the Reviewer are not responsible for any error which may be occasioned at the time of printing of this document or any error, mistake or shortcoming. No liability is accepted whatsoever for any direct, indirect or consequential loss arising from the use of this document. WSE, the Author, and the Reviewer expressly disclaim any fiduciary responsibility or liability for any consequences, financial or otherwise arising from any reliance placed on the information in this document. Additionally, WSE, the Author, and the Reviewer do not (1) guarantee the accuracy, timeliness, completeness or correct sequencing of the information, or (2) warrant any results from use of the information. The included information is subject to change without notice.\nNOT AN OFFERING\nThis document is not intended as an offering, recommendation, or a solicitation of an offer to buy or sell the securities mentioned or discussed, and is to be used for informational purposes only. Please read all associated disclosures and disclaimers in full before investing. Neither WSE nor any party affiliated with us is a registered investment adviser or broker-dealer with any agency or in any jurisdiction whatsoever. To download our report(s), read our disclosures, or for more information, visit\nhttps://wallstequities.com/legal-disclaimer/\nCONTACT\nFor any questions, inquiries, or comments reach out to us directly. If you're a company, we are covering and wish to no longer feature on our coverage list contact us via email and/or phone between 09:30 EDT to 16:00 EDT from Monday to Friday at:\nEmail: info@wallstequities.com\nPhone number: +21-32-044-483\nOffice Address: 1 Scotts Road #24-10, Shaw Center Singapore 228\nCFA® and Chartered Financial Analyst® are registered trademarks owned by CFA Institute.\n releases/technical-perspectives-on-trucking-stocks----jb-hunt-old-dominion-freight-line-werner-enterprises-and-yrc-worldwide-300586556.html\nSOURCE Wall St. Equities", "external_links": ["http://www.wallstequities.com/registration/?symbol=WERN", "http://www.wallstequities.com/registration/?symbol=YRCW", "http://www.wallstequities.com/registration/?symbol=JBHT", "https://wallstequities.com/legal-disclaimer/", "http://www.prnewswire.com/news-releases/technical-perspectives-on-trucking-stocks----jb-hunt-old-dominion-freight-line-werner-enterprises-and-yrc-worldwide-300586556.html", "http://www.wallstequities.com/registration/?symbol=ODFL", "http://www.wallstequities.com/registration"], "published": "2018-01-23T14:15:00.000+02:00", "crawled": "2018-01-23T14:16:44.006+02:00", "highlightTitle": ""}