{"organizations": [], "uuid": "4094efdf22ec25cdf9cd04bbdfcad8441e358bcf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/21/104601587-GettyImages-98740375.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/23/how-to-stick-to-your-new-years-career-resolutions.html", "country": "US", "domain_rank": 767, "title": "How to stick to your New Year’s career resolutions", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T18:43:00.000+02:00", "replies_count": 0, "uuid": "4094efdf22ec25cdf9cd04bbdfcad8441e358bcf"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/23/how-to-stick-to-your-new-years-career-resolutions.html", "ord_in_thread": 0, "title": "How to stick to your New Year’s career resolutions", "locations": [], "entities": {"persons": [{"name": "laura weldy", "sentiment": "none"}], "locations": [{"name": "nashville", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The best part of the New Year? We all get a chance to have a do-over. Whatever goals and dreams you have been thinking about over the past year, now's your chance to make those achievements possible over the next twelve months.\nLooking for a new job? Working toward a promotion? Planning to ask for a raise? No matter the career aspiration, we all need a little help and guidance to keep us on track — which is why we spoke with Laura Weldy, life coach at The Well Supported Woman. Based in Nashville, TN, Weldy helps millennial women seeking more confidence, clarity and connection in their daily lives. Here's what she advises for all jobs seekers and workers who want to stick to their New Year's resolutions in 2018.\nMore from Glassdoor: \n8 ways to transform your job search in 2018 \nCool companies that hire in 15 days or less\n10 brilliant hacks that'll let you work smarter, not harder \n1. Set realistic resolutions Most of us who set New Year's resolutions tend to have a few goals that are vague or a little too over the top. If you want to actually see your resolutions through, make sure you think about how realistic your goals are and how you will track the progress you make.\n\"For those of us with a full-time job, I love the idea of crafting some resolutions around the progress you desire to make in your career and the lifestyle you want to experience in your downtime,\" says Weldy.\nFor those work resolutions, Weldy says it's important to consider very measurable ones — so focus your resolutions on specific awards, titles, projects or milestones you want to complete or work on this year.\nshow chapters The least stressful jobs in America      11:30 AM ET Thu, 12 Jan 2017 | 00:55 2. Don't let resolutions stress you out One of the hardest parts about setting New Year's resolutions is how we treat ourselves when we don't stick to them. Don't worry — you're not alone in this. So many people feel the same way about their resolutions.\nIf you want to get ahead in your career , you can't set resolutions that are going to make you feel bad about yourself. It's hard to avoid this, but it comes down to spending more time thinking about the resolutions you are setting and why you are setting them.\n\"This is one of the downsides of the New Year's resolution phenomenon — if you didn't achieve your resolutions last year (or the year before that!) it's easy to get discouraged,\" says Weldy. \"Your resolutions or goals should never be a source of shame for you — instead, think of them as always changing reflections of what matters to you right now.\"\nWorking a full-time job or tackling the job hunt is hard work enough–so your resolutions should focus on positive ways to help make the process easier, or to help you achieve your goals.\n3. Prioritize your resolutions If you set a long list of resolutions where the majority are goals that are going to take a lot of work and add more hours to your workday, you're eventually going to burn out . As a result, find it hard to keep up with everything. Not to mention, you won't be feeling too happy, both about your work ethic and yourself!\nWeldy encourages us to evaluate our resolutions by asking ourselves: \"Is this truly important to me, or is this something I feel I SHOULD do?\"\nInstead, she says to focus on the resolutions that you're really excited about in order to have the most success with your goal setting. If there's a really exciting project you can take ownership of in the New Year, focus on that goal right away.\n4. Keep your list of resolutions short Sometimes when we set our New Year's resolutions, we set too many big goals and later find ourselves completely failing at keeping most of them. We start the year excited and make a long list of all the ideas we have and all the things we want to accomplish. Some 50 resolutions later, and we can't even remember half the ones we set for ourselves.\nshow chapters NASA rocket scientist on how to find a career that brings you joy      1:36 PM ET Mon, 30 Jan 2017 | 00:52 \"I see this all the time with resolutions because I think goal setting and living in that mental space of what could be possible for you is so much fun,\" notes Weldy. \"But even more fun than creating a list of 2,000 goals and imagining your dream life is actually LIVING that life. That happens when we prioritize and focus.\"\nWeldy recommends keeping your resolution list short with about 3-5 resolutions in total.\n5. Have someone hold you accountable It's hard to stick to your goals on your own — but it doesn't have to be that way. Consider showing your resolutions to your boss and asking them to help keep you accountable for the career goals you're setting in the New Year.\nIf you don't necessarily want your manager to know your resolutions, you can always confide in a co-worker, or even consider working with a personal coach.\n\"Find someone to help hold you accountable, and keep your resolutions somewhere where you see them every day,\" advises Weldy. \"If you are still struggling with sticking to your resolutions, you may need someone to help you better understand your mode of operating in the world, your motivations and how to maximize your time and energy. Nothing in this world is truly one-size-fits-all — including productivity hacks and tools for goal accomplishment. This is when working with a professional life coach comes in handy.\"\nDon't worry — you've got this! And if you don't quite reach your goals this year, you'll always have a do-over at the end of 2018.\nLike this story? Like CNBC Make It on Facebook . \nSee also: The 50 most innovative companies to work for in 2018 \nThis article originally appeared on Glassdoor. \nshow chapters Google exec shares his trick for ensuring career moves are building on each other      12:09 PM ET Thu, 9 March 2017 | 00:59", "external_links": [], "published": "2018-01-23T18:43:00.000+02:00", "crawled": "2018-01-23T19:19:40.076+02:00", "highlightTitle": ""}