{"organizations": [], "uuid": "45800e5c57a57bd2b8f627e465d942ba04312ec9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222814895&w=1200&r=LYNXMPEE0G1O3", "site_section": "http://feeds.reuters.com/reuters/domesticNews", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-gymnastics-usa-nassar/coach-tells-ex-usa-gymnastics-doctor-nassar-in-court-to-go-to-hell-idUSKBN1F62OJ", "country": "US", "domain_rank": 408, "title": "Coach tells ex-USA gymnastics doctor Nassar in court to 'go to hell'", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T21:55:00.000+02:00", "replies_count": 0, "uuid": "45800e5c57a57bd2b8f627e465d942ba04312ec9"}, "author": "", "url": "https://www.reuters.com/article/us-gymnastics-usa-nassar/coach-tells-ex-usa-gymnastics-doctor-nassar-in-court-to-go-to-hell-idUSKBN1F62OJ", "ord_in_thread": 0, "title": "Coach tells ex-USA gymnastics doctor Nassar in court to 'go to hell'", "locations": [], "entities": {"persons": [{"name": "nassar", "sentiment": "negative"}, {"name": "gwen anderson", "sentiment": "none"}, {"name": "thomas brennan", "sentiment": "none"}, {"name": "brennan", "sentiment": "none"}, {"name": "brendan mcdermid", "sentiment": "none"}, {"name": "anderson", "sentiment": "none"}, {"name": "larry nassar", "sentiment": "none"}], "locations": [{"name": "mich.", "sentiment": "none"}, {"name": "lansing", "sentiment": "none"}, {"name": "michigan", "sentiment": "none"}], "organizations": [{"name": "usa gymnastics", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 7:47 PM / Updated 37 minutes ago Coach tells ex-USA gymnastics doctor Nassar in court to 'go to hell' Brendan McDermid 3 Min Read \nLANSING, Mich. (Reuters) - A coach who sent dozens of young girls for treatment to USA Gymnastics team doctor Larry Nassar, who pleaded guilty to molesting female athletes, told the disgraced physicians on Wednesday to “go to hell” for his crimes. \nThomas Brennan, a youth gymnastics coach, confronted Nassar in a Michigan courtroom on the second day of a sentencing hearing for the former doctor, who pleaded guilty in November to multiple counts of sexual assault. \n“For the record, go to hell,” Brennan said, glowering at Nassar. \nBrennan’s outburst came as he stood next to one of Nassar’s victims, Gwen Anderson, as she recounted the molestation she suffered at the hands of Nassar. \nAt one point during Anderson’s tearful testimony, Brennan barked at Nassar, “look at her.” \nNassar has sat through the proceedings with his head bowed, not making eye contact with the victims. He apologized for his crimes at the November hearing, local media reported. \nBrennan told Ingham County Court Judge Rosemarie Aquilina that he sent more than 100 girls to Nassar, whom he once considered a mentor. \n“The guilt I feel for that is hard to fathom,” he said. Larry Nassar, a former team USA Gymnastics doctor who pleaded guilty in November 2017 to sexual assault charges, listens to a victim during his sentencing hearing in Lansing, Michigan, U.S., January 16, 2018. REUTERS/Brendan McDermid \nMore than 100 victims are providing victim-impact statements during the four-day hearing, prosecutors said. \nThe judge has addressed each victim and repeatedly said she will make certain Nassar gets a lengthy prison sentence. Prosecutors are seeking a life sentence. Slideshow (2 Images) \n“He will die there,” Aquilina told one victim on Wednesday. “The next judge he faces will be God.” Aquilina is set to impose sentence on Friday. \nNassar is already serving a 60-year prison after pleading guilty in July to child pornography charges in federal court. \nA mother of a one-time U.S. Gymnastics team member, Maggie Nichols, who tried to qualify to compete in the 2016 Olympic Games, also criticized Nasser on Wednesday. \n“A real doctor never sees a child alone,” said Gina Nichols, who said she is a registered nurse and whose husband is a doctor. “You’re a serial child molester - a pedophile.” \nNichols also criticized USA Gymnastics for not properly vetting Nassar, who served as the team’s physician through four Olympic Games. \nOlympic gold medalists Aly Raisman, Gabby Douglas, McKayla Maroney and Simone Biles have gone public in recent months, saying they were assaulted by Nassar while undergoing treatment. Additional reporting and writing by Keith Coffman in Denver", "external_links": [], "published": "2018-01-17T21:55:00.000+02:00", "crawled": "2018-01-17T22:14:15.018+02:00", "highlightTitle": ""}