{"organizations": [], "uuid": "71871f0080aae886b299348e06660716b4e7f533", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000336/device/rss", "section_title": "Janet Yellen", "url": "https://www.cnbc.com/2018/01/29/reuters-america-us-stocks-futures-lower-as-investors-brace-for-busy-week.html", "country": "US", "domain_rank": 767, "title": "US STOCKS-Futures lower as investors brace for busy week", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T14:35:00.000+02:00", "replies_count": 0, "uuid": "71871f0080aae886b299348e06660716b4e7f533"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/29/reuters-america-us-stocks-futures-lower-as-investors-brace-for-busy-week.html", "ord_in_thread": 0, "title": "US STOCKS-Futures lower as investors brace for busy week", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "s&p", "sentiment": "negative"}, {"name": "apple", "sentiment": "none"}, {"name": "pfizer", "sentiment": "none"}, {"name": "thomson reuters", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Futures down: Dow 31 pts, S&P 6.5 pts, Nasdaq 16.5 pts\nJan 29 (Reuters) - U.S. stock index futures were slightly lower on Monday, pulling back from record levels seen last week, and as investors brace for a busy week ahead.\nThe latest round of strong earnings reports helped the three major indexes notch their best four-week run since 2016 on Friday.\nFourth-quarter earnings growth for the S&P 500 is now estimated at 13.2 percent, according to Thomson Reuters data, up from 12 percent at the start of the year. Of the 133 companies in the index that have reported through Friday, 79.7 percent have topped expectations.\nTech industry heavyweights Apple, Alphabet , Facebook, Microsoft and Amazon as well as Dow components, Pfizer and DowDuPont , are all set to report earnings this week.\nAt 7:02 a.m. ET (1202 GMT), Dow e-minis were down 31 points, or 0.12 percent, with 39,866 contracts changing hands.\nS&P 500 e-minis were down 6.5 points, or 0.23 percent, with 150,562 contracts traded.\nNasdaq 100 e-minis were down 16.5 points, or 0.23 percent, on volume of 38,914 contracts.\nApart from the quarterly earnings, the market will also focus on the outcome of Federal Reserve's two-day meeting on Wednesday.\nWhile no interest rate hike is expected at this meeting, investors will focus on outgoing Fed Chair Janet Yellen's last statement for clues regarding the future path of rate hikes.\nU.S. Treasury yields climbed to fresh multi-year highs in early trading on Monday, extending rises seen last week on the back of strong economic data and as investors braced for major central banks to step back from ultra-easy monetary policies.\nOn Friday, the U.S. Labor Department's closely watched employment report will likely show nonfarm payrolls increased by 178,000 jobs in January, picking up from December's 148,000 gain.\nAt 8:30 a.m. ET (1330 GMT), the Commerce Department is expected to report that consumer spending, which accounts for more than two-thirds of U.S. economic activity, accelerated 0.6 percent in November and shipments of key capital goods orders increased for the 10th straight month.\nShares of KapStone Paper and Packaging jumped 30 percent after packaging company WestRock said it would buy the company for an enterprise value of about $4.9 billion.\nAvon was up 7.41 percent after the WSJ reported the cosmetics company was under activist pressure for a sale. (Reporting by Tanya Agrawal; Editing by Savio D'Souza)", "external_links": [], "published": "2018-01-29T14:35:00.000+02:00", "crawled": "2018-01-29T19:39:54.026+02:00", "highlightTitle": ""}