{"organizations": [], "uuid": "9cf6ee508b7037c444d13a796864f05fac6ec537", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 11, "shares": 11, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/lifestyle", "section_title": "Reuters: Lifestyle", "url": "https://www.reuters.com/article/us-peru-archaeology/ancient-finding-in-peru-sheds-light-on-desert-society-archaeologist-idUSKBN1EY0BZ", "country": "US", "domain_rank": 408, "title": "Ancient finding in Peru sheds light on desert society - archaeologist", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T12:29:00.000+02:00", "replies_count": 0, "uuid": "9cf6ee508b7037c444d13a796864f05fac6ec537"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-peru-archaeology/ancient-finding-in-peru-sheds-light-on-desert-society-archaeologist-idUSKBN1EY0BZ", "ord_in_thread": 0, "title": "Ancient finding in Peru sheds light on desert society - archaeologist", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " 29 AM / Updated 7 hours ago Ancient finding in Peru sheds light on desert society - archaeologist Marion Giraldo 3 Min Read \nLIMA (Reuters) - Archaeologists have discovered two chambers used for political ceremonies on Peru’s desert coast more than 1,500 years ago that had previously only been glimpsed in the illustrations of the ancient Moche people, an archaeologist said on Monday. \nThe finding, at the ruins of the Limon archaeological complex in the region of Lambayeque, will provide key clues to understanding the Moche’s political life before the desert society’s sudden decline, said lead archaeologist Walter Alva. \nOne room features two thrones where a powerful leader and guest likely enjoyed elaborate feasts, said Alva. The other has a circular podium, possibly for making announcements. \nThe events that took place in the chambers were so important they had been featured repeatedly on Moche ceramics, Alva said. \n“These scenes had been depicted in the iconography of the Moche world but we had never been lucky enough to physically find where they took place,” he said. “It’s a very important finding.” \nThe Moche, one of several complex societies that thrived in Peru long before the rise of the Incan empire, ruled over a vast swath of coastal desert from 100 to 700 AD, thanks to irrigation canals they built to grow crops in desert valleys. The Moche are known for their elaborate gold work and sculptures featuring a wide variety of sexual acts. \nMany researchers believe a disastrous climate event, such as the El Nino phenomena that still triggers severe flooding in northern Peru, probably led to the collapse of Moche society. \nAlva said construction on part of the recently unearthed chambers appears to have halted abruptly in the 5th century. The rooms were believed to have been used only by the elite, and paintings of fish and sea lions can be seen on the walls. \nWomen are believed to have held political and religious positions in Moche society. Last year, Peruvian officials and archaeologists unveiled a replica of the face of an ancient female Moche ruler, the Lady of Cao, whose elaborately tattooed body had been buried with weapons and gold objects. Reporting By Marion Giraldo; Writing By Mitra Taj; Editing by Paul Tait", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-09T12:29:00.000+02:00", "crawled": "2018-01-09T09:42:46.726+02:00", "highlightTitle": ""}