{"organizations": [], "uuid": "8af32a2972774dc7d973741a28527f0647a75fcc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-con-edison-declares-common-stock-dividend.html", "country": "US", "domain_rank": 767, "title": "Con Edison Declares Common Stock Dividend", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T22:35:00.000+02:00", "replies_count": 0, "uuid": "8af32a2972774dc7d973741a28527f0647a75fcc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-con-edison-declares-common-stock-dividend.html", "ord_in_thread": 0, "title": "Con Edison Declares Common Stock Dividend", "locations": [], "entities": {"persons": [{"name": "con edison", "sentiment": "none"}, {"name": "robert hoglund", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "con edison", "sentiment": "negative"}, {"name": "consolidated edison, inc.", "sentiment": "neutral"}, {"name": "s&p", "sentiment": "none"}, {"name": "securities", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 18, 2018 (GLOBE NEWSWIRE) -- Consolidated Edison, Inc. (Con Edison) (NYSE:ED) declared a quarterly dividend of 71.5 cents a share on its common stock, payable March 15, 2018 to stockholders of record as of February 14, 2018, an annualized increase of 10 cents over the previous annualized dividend of $2.76 a share.\n“The increase in the dividend, the 44 th consecutive annual increase for stockholders, reflects our continued emphasis on providing a return to our investors while meeting the needs of our customers,” said Robert Hoglund, Con Edison’s senior vice president and chief financial officer. The increase continues the longest period of consecutive annual dividend increases of any utility in the S&P 500 index. The company expects to continue to pay its stockholders between 60% and 70% of its adjusted earnings.\nThis press release contains a forward-looking statement that reflects an expectation and not a fact. Actual results may differ materially from this expectation because of factors such as those identified in reports the company has filed with the Securities and Exchange Commission. This press release also refers to a financial measure, adjusted earnings, that is not determined in accordance with generally accepted accounting principles in the United States of America (GAAP). This non-GAAP financial measure should not be considered as an alternative to net income (which is an indicator of financial performance determined in accordance with GAAP) and may exclude from net income amounts that the company does not consider indicative of its ongoing financial performance.\nConsolidated Edison, Inc. is one of the nation's largest investor-owned energy-delivery companies, with approximately $12 billion in annual revenues and $49 billion in assets. The company provides a wide range of energy-related products and services to its customers through the following subsidiaries: Consolidated Edison Company of New York, Inc., a regulated utility providing electric, gas and steam service in New York City and Westchester County, New York; Orange and Rockland Utilities, Inc., a regulated utility serving customers in a 1,300-square-mile-area in southeastern New York State and northern New Jersey; Con Edison Clean Energy Businesses, Inc., which through its subsidiaries develops, owns and operates renewable and energy infrastructure projects and provides energy-related products and services to wholesale and retail customers; and Con Edison Transmission, Inc., which through its subsidiaries invests in electric and natural gas transmission projects.\nContact:\nRobert McGee\n212-460-4111\nSource:Consolidated Edison, Inc.", "external_links": [], "published": "2018-01-18T22:35:00.000+02:00", "crawled": "2018-01-19T01:21:17.000+02:00", "highlightTitle": ""}