{"organizations": [], "uuid": "15eab048b7f4ff53bef556d69982590af412f6af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000811/device/rss", "section_title": "Jobless Claims", "url": "https://www.cnbc.com/2018/01/25/reuters-america-wrapup-1-u-s-new-home-sales-post-largest-drop-in-16-months-jobless-claims-up.html", "country": "US", "domain_rank": 767, "title": "WRAPUP 1-U.S. new home sales post largest drop in 16 months; jobless claims up", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T17:52:00.000+02:00", "replies_count": 0, "uuid": "15eab048b7f4ff53bef556d69982590af412f6af"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/25/reuters-america-wrapup-1-u-s-new-home-sales-post-largest-drop-in-16-months-jobless-claims-up.html", "ord_in_thread": 0, "title": "WRAPUP 1-U.S. new home sales post largest drop in 16 months; jobless claims up", "locations": [], "entities": {"persons": [{"name": "ben ayers", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "south", "sentiment": "none"}, {"name": "columbus", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "commerce department", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "up@\n* New home sales fall 9.3 percent in December\n* Weekly jobless claims increase 17,000\n* Continuing claims decline 28,000\nWASHINGTON, Jan 25 (Reuters) - Sales of new U.S. single-family homes fell more than expected in December, recording their biggest drop in nearly 1-1/2 years, likely as the boost from the replacement of flood-damaged houses in parts of the South affected by hurricanes faded.\nOther data on Thursday showed the number of Americans filing for unemployment benefits rose from a 45-year low last week. The jump in jobless claims was, however, less than expected, and the underlying trend remained consistent with a tight labor market that is helping to underpin demand for housing.\n\"We expect demand for single-family housing to remain robust, driven by job gains and the aging of the millennial generation into prime homebuying ages,\" said Ben Ayers, senior economist at Nationwide in Columbus, Ohio.\nThe Commerce Department said new home sales declined 9.3 percent to a seasonally adjusted annual rate of 625,000 units last month. The percentage decrease was the largest since August 2016. Unseasonably cold temperatures at the end of December probably also hurt sales.\nEconomists polled by Reuters had forecast that new home sales, which account for 10.1 percent of the housing market, would tumble 7.9 percent to a pace of 679,000 units last month.\nSales plunged 9.8 percent in the South last month after a 6.6 percent surge in November that was tied to rebuilding after the devastation caused by Hurricanes Harvey and Irma. They fell 10 percent in the Midwest and dropped 2.4 percent in the Northeast - both regions experienced unusually cold weather in late December. In the West, sales fell 9.5 percent.\nPointing to underlying strength in the housing market, new home sales surged 14.1 percent from a year ago. They increased 8.3 percent in 2017 to 608,000 units, the highest level since 2007.\nThe strong labor market, which is near full employment, has unleashed demand for housing that has not been matched by supply. As a result, house price inflation has outpaced wage growth, keeping some first-time home buyers out of the market. The median new house price rose 2.6 percent to a record $335,400 in December from a year ago.\nWhile the stock of new homes on the market increased 3.9 percent in December to 295,000 units, more than an 8-1/2-year high, it remained below its peak of 572,000 units in July 2006.\nAt December's sales pace it would take 5.7 months to clear the supply of houses on the market, up from 4.9 months in November. A six-month supply is viewed as a healthy balance between supply and demand.\nThe U.S. dollar was weaker against a basket of currencies after the data. Prices of U.S. Treasuries were trading mostly lower while U.S. stock indexes were largely flat.\nTIGHT LABOR MARKET\nIn a separate report on Thursday, the Labor Department said initial claims for state unemployment benefits increased 17,000 to a seasonally adjusted 233,000 for the week ended Jan. 20. Claims fell to 216,000 in the prior week, the lowest level since January 1973.\nEconomists had forecast claims rising to 240,000 in the latest week. Last week marked the 151st straight week that claims remained below the 300,000 threshold, which is associated with a strong labor market. That is the longest such stretch since 1970, when the labor market was much smaller.\n\"The song remains the same for tightness of the labor market - employers are extremely reluctant to fire current workers, which reflects not only the current positive business environment but also the difficulty in finding qualified replacements,\" said John Ryding, chief economist at RDQ Economics in New York.\nLast week, the four-week moving average of initial claims, considered a better measure of labor market trends as it irons out week-to-week volatility, fell 3,500 to 240,000.\nThe claims report also showed the number of people receiving benefits after an initial week of aid dropped 28,000 to 1.94 million in the week ended Jan. 13. The four-week moving average of the so-called continuing claims fell 3,500 to 1.92 million.\nThe continuing claims data covered the week of the household survey from which January's unemployment rate will be calculated. The four-week average of continuing claims slipped 1,750 between the December and January survey periods.\nThat suggests little change in the unemployment rate this month. The jobless rate dropped seven-tenths of a percentage point to a 17-year low of 4.1 percent in 2017, and economists expect it to hit 3.5 percent by the end of this year, which could spur faster wage growth as companies compete for workers.\nStrong wage inflation would in turn likely prompt the Federal Reserve to raise interest rates a bit more aggressively than currently anticipated. The U.S. central bank has forecast three rate hikes this year. It increased borrowing costs three times in 2017.\n\"The Fed may have to pick up its game this year and raise rates four times, not just the three they have already forecast,\" said Chris Rupkey, chief economist at MUFG in New York. (Reporting by Lucia Mutikani; Editing by Paul Simao)", "external_links": [], "published": "2018-01-25T17:52:00.000+02:00", "crawled": "2018-01-25T19:25:28.004+02:00", "highlightTitle": ""}