{"organizations": [], "uuid": "5db1f62b1273e4778c681d85bcb06cf472a6ef78", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-vical-announces-restructuring-to-focus-resources-on-hsv-2-and-antifungal-clinical-programs.html", "country": "US", "domain_rank": 767, "title": "Vical Announces Restructuring to Focus Resources on HSV-2 and Antifungal Clinical Programs", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T00:15:00.000+02:00", "replies_count": 0, "uuid": "5db1f62b1273e4778c681d85bcb06cf472a6ef78"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-vical-announces-restructuring-to-focus-resources-on-hsv-2-and-antifungal-clinical-programs.html", "ord_in_thread": 0, "title": "Vical Announces Restructuring to Focus Resources on HSV-2 and Antifungal Clinical Programs", "locations": [], "entities": {"persons": [{"name": "vijay samant", "sentiment": "none"}], "locations": [{"name": "san diego", "sentiment": "none"}], "organizations": [{"name": "vical incorporated", "sentiment": "negative"}, {"name": "focus resources", "sentiment": "negative"}, {"name": "vical", "sentiment": "negative"}, {"name": "astellas pharma", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO, Jan. 30, 2018 (GLOBE NEWSWIRE) -- Vical Incorporated (Nasdaq:VICL) today announced a restructuring to conserve capital and to focus its efforts on VL-2397, its antifungal drug product candidate which is entering a pivotal Phase 2 clinical trial in the first quarter of 2018, and on completing its Phase 2 HSV-2 clinical trial. The restructuring includes a reduction in staff of approximately 54%, from 74 to 34 employees. The company is terminating all activities related to the ASP0113 program licensed to Astellas Pharma. The company believes its currently available cash and investments will be adequate to fund operations at least through 2019.\n“We have carefully evaluated our organization and priorities and are restructuring to extend our cash runway to ensure that our promising HSV-2 vaccine candidate and VL-2397 antifungal drug product candidate is adequately resourced to maximize shareholder value,” said Vijay Samant, Vical’s President and Chief Executive Officer. “This has been a very difficult process and we regret the impact this business decision has on our departing employees. We greatly appreciate the hard work and commitment they have shown Vical over the years and wish them the very best in their future endeavors.”\nFinancial Guidance and Restructuring Impact\nVical expects to report that it ended 2017 with cash and investments of approximately $60 to $65 million. The cash burn for 2017 is expected to be at the low end of Vical’s guidance of $8 to $11 million. The company expects to incur personnel-related restructuring charges of approximately $1.1 million in the first quarter of 2018. The company will provide cash burn guidance for 2018 at its upcoming 2017 year-end financial results conference call.\nPipeline Programs\nVCL-HB01 HSV-2 Therapeutic Vaccine\nVical is developing the HSV-2 therapeutic vaccine, VCL-HB01, to treat patients with symptomatic genital herpes infection. The vaccine candidate is currently being evaluated in a Phase 2 study in healthy adult subjects, 18 to 50 years of age who are randomized 2:1 to receive either vaccine or placebo. Recruitment of 261 subjects at 15 U.S. clinical sites was completed in April 2017 and 4-dose vaccination series was completed in July 2017. Following the 4 th vaccination, each subject entered a 12-month surveillance period during which each new lesion recurrence is assessed in the clinic by the investigator. Once all subjects have completed a minimum of 9-months of surveillance, the primary endpoint of annualized recurrence rate will be calculated based on those recurrences that are both clinically - and virologically - confirmed. This endpoint provides important information on the number of recurrences over time in this chronic disease setting and is clinically meaningful for both patients and treating physicians. Vical remains on target to deliver top-line results during the second quarter of 2018.\nVL-2397 Antifungal\nVical is developing its novel antifungal drug product candidate, VL-2397, for the treatment of patients with invasive fungal infections. The FDA has advised that VL‑2397 would be eligible for a Limited Use Indication (LUI) approval for the treatment of invasive aspergillosis, assuming a successful outcome of a single Phase 2 trial carried out in accordance with a protocol and statistical analysis plan consistent with the Agency's advice. The final determination whether the drug is approvable will be made by FDA after review of all relevant data. The Company intends to initiate a Phase 2 trial of VL-2397 for the treatment of invasive aspergillosis in the first quarter of 2018. In addition, the FDA has granted Vical Qualified Infectious Disease Product, Orphan Drug and Fast Track designations to VL-2397 for the treatment of invasive aspergillosis.\nAbout Vical\nVical develops biopharmaceutical products for the prevention and treatment of chronic or life-threatening infectious diseases, including antiviral and antifungal candidates in clinical development. Additional information on Vical is available at www.vical.com .\nForward-Looking Statements\nThis press release contains subject to risks and uncertainties that could cause actual results to differ projected. Forward-looking statements include anticipated restructuring charges, net cash use guidance, expected cash and investment balances, as well as anticipated developments in independent clinical programs, including the initiation and completion of clinical trials. Risks and uncertainties include whether Vical will effectively focus resources on its clinical programs; whether Vical’s audited financial results will differ from its estimates; whether Vical or others will continue development of VCL-HB01 and VL-2397 or any other independent or collaborative programs; the risk that the FDA does not grant LUI approval of VL-2397 following the results of Vical’s planned Phase 2 clinical trial; whether Vical will achieve levels of revenues and control expenses to meet its financial projections; whether enrollment in on-going trials will continue at current rates; whether Vical will be able to obtain regulatory approvals, allowances or guidance necessary to commercialize any product or to proceed with proposed clinical trials or implement anticipated clinical trial designs; whether on-going or planned clinical trials or regulatory submissions will be initiated or completed on the timelines Vical currently expects; whether any product candidates will be shown to be safe and efficacious in clinical trials; whether Vical is able to enter into new collaborative arrangements; whether Vical will have access to sufficient capital to fund its planned development activities; and additional risks set forth in the Company's filings with the Securities and Exchange Commission. These represent the Company's judgment as of the date of this release. The Company disclaims, however, any intent or obligation to update these .\nContact: Andrew Hopkins\n(858) 646-1127\nWebsite: www.vical.com\nSource:Vical Incorporated", "external_links": ["https://www.globenewswire.com/Tracker?data=MTrHabart5i3bhKlaSAawnhZT7RGK1R5c_r_9I9LG5U_y63rnqqjjXpoA-ED5w4tN7dD4zWkErAJubBLcRlh3w==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/12905f60-5592-4a40-8c6d-0068410eedbd", "https://www.globenewswire.com/Tracker?data=MTrHabart5i3bhKlaSAawrKSzQa_fCSfVB72p_wCsK3awNRs4VW1Dn5fcv88m67HD45rvHXNu-NIxYqdixTH8g=="], "published": "2018-01-31T00:15:00.000+02:00", "crawled": "2018-01-31T02:49:45.013+02:00", "highlightTitle": ""}