{"organizations": [], "uuid": "b26d6f37536367f4d74f36adeb1052f0d36dd494", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/14/104899621-GettyImages-633005170.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/16/why-ripple-is-not-cashing-out-its-xrp-holdings.html", "country": "US", "domain_rank": 767, "title": "Why Ripple is not cashing out its XRP holdings", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.011, "site_type": "news", "published": "2018-01-16T21:29:00.000+02:00", "replies_count": 0, "uuid": "b26d6f37536367f4d74f36adeb1052f0d36dd494"}, "author": "Ari Levy", "url": "https://www.cnbc.com/2018/01/16/why-ripple-is-not-cashing-out-its-xrp-holdings.html", "ord_in_thread": 0, "title": "Why Ripple is not cashing out its XRP holdings", "locations": [], "entities": {"persons": [{"name": "andreessen horowitz", "sentiment": "none"}], "locations": [{"name": "silicon", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "google ventures", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sixteen months ago, Ripple raised $55 million by selling equity in a typical Silicon Valley funding round that included Alphabet 's GV (Google Ventures), Andreessen Horowitz and some strategic investors. The round placed the value of the company around $400 million .\nToday the San Francisco start-up could bring in many times that amount of cash every month -- if it wanted to -- without giving up any company ownership or control.\nRipple develops software that banks use for fast global financial settlements. But almost all of its current value comes from being the creator and majority holder of XRP , a digital currency that was obscure a year ago, but now has a total market value of about $130 billion.\nXRP, which trades publicly like bitcoin, went on an inexplicable rally starting last year. Even after plummeting from a high of $3.84 in early January to $1.30 (including a 30 percent drop on Tuesday), it's still up almost 200-fold in the past 12 months.\nRipple owns about 60 billion of the 100 billion XRP created, giving it a market value -- based just on its holdings -- of close to $80 billion.\nThe company's revenue is unknown, although CEO Brad Garlinghouse told CNBC that some banks are paying the company millions of dollars for its software. Regardless, $80 billion is far ahead of where any reasonable investor would value the company.\nA tough company to value Ripple has placed limitations on how much XRP it can sell each month to remove the concern that it will suddenly flood the market with tokens. The company placed 55 billion of its XRP in a \"cryptographically-secured\" escrow account and can release up to 1 billion every month. Ripple has never come close to selling that amount in a month and said in December that it's averaged selling 300 million XRP a month since mid-2016.\nBy selling a tiny fraction of its holdings each month, the company brought in over $90 million in the first three quarters of 2017.\nshow chapters Cryptocurrency ripple falls 5 percent 4:19 PM ET Tue, 9 Jan 2018 | 00:42 Ripple hasn't released its fourth-quarter XRP report yet, but if it continued selling the same amount programmatically, as a percentage of overall XRP traded, it would have raised more than $75 million in the fourth quarter and another $150 million just in the first half of January. That doesn't include money made from direct sales.\nThe company can dial back how much XRP it puts on the market, so there's no reason to expect that it's reeling in hundreds of millions of dollars a quarter. But just having that ability puts Ripple in a cash position that's extremely rare -- particularly for a start-up with just 170 employees -- and gives it the flexibility to quickly bring in money for a pricey acquisition, fund an ambitious new project or invest in other start-ups.\nRipple executives just invested some of their XRP as part of a $25 million funding round in a storage start-up called Omni.\n\"In all likelihood, they need cash less than any other company on the planet,\" said Timothy Enneking, managing director of Crypto Asset Management , a crypto hedge fund in San Diego with about $70 million in assets.\nJeremy Liew of Lightspeed Venture Partners invested in Ripple in 2013 , before the currency had any value and when the company was focused on consumer peer-to-peer payments. He doesn't have a board seat and isn't close to the company, but is suddenly looking at a potentially very valuable stake.\nFiguring out exactly how to value that stake is no easy task: Lightspeed owns illiquid shares in a private company, whose soaring paper value is derived from a highly volatile asset that it plans to monetize in small chunks over the course of many years.\nSource: Lightspeed Venture Partners Jeremy Liew \"It's absolutely unprecedented,\" said Liew, who's best known for his early bet on Snap . \"It hadn't been material until the end of last quarter, so now we have to think it through.\"\nSeagate , through an investment in Ripple in 2016, could own a stake worth close to $8 billion, according to a report last week from Deep Value Research. The stock has rallied 20 percent since the report on Jan. 8, even though the company has said nothing about it publicly.\nThe anti-bitcoin While Ripple's ability to practically print money puts it in an admirable place, the start-up has attracted plenty of controversy in the world of cryptocurrencies and blockchain.\nBitcoin is a decentralized currency that has to be mined to enter circulation and was created by a mysterious and still unidentified person using the pseudonym Satoshi Nakamoto.\nXRP, by contrast, is the creation of a single company that owns the majority of the currency and has defined its parameters.\nCritics on Reddit and elsewhere comment on how crazy it is that Ripple just created a currency \"out of thin air.\" Additionally, the currency is hardly being used, making it even more difficult to justify the price surge.\nshow chapters Ripple skyrocketed after teaming up with MoneyGram 4:10 PM ET Thu, 11 Jan 2018 | 00:58 Ripple's core product, xCurrent, is used by banks as a messaging solution that allows them to settle cross-border payments quickly. But they're not using XRP for that. A newer and still nascent Ripple product called xRapid allows financial institutions to convert fiat currencies to XRP quickly and cheaply, and transact digitally in real time.\nLast week Ripple made its first significant customer announcement for xRapid. It said that MoneyGram will use the technology and XRP to speed up and reduce the cost of transferring money. Viamericas, a money transmitter focused on sending money to Latin America and Asia, said that that it's testing XRP.\nRipple claims an average transaction on its network takes between two and three seconds to process. Bitcoin transactions take around 51 minutes on average, according to data by industry website Blockchain.info.\n\"Bitcoin showed us what's possible, but it's not going to solve every use case,\" said Garlinghouse, Ripple's CEO, who personally owns billions of dollars worth of combined Ripple equity and XRP at the current price. \"I'm personally long bitcoin, because I think it solves a problem around the store of value.\"\nIn other words, Garlinghouse sees bitcoin as a form of digital gold, attracting investors looking to diversify their holdings. But XRP has a specific use and, if he's right, it will be the way that financial firms transact over blockchain.\n\"We're driving velocity and demand of XRP,\" Garlinghouse said.\nDavid Paul Morris | Bloomberg | Getty Images Brad Garlinghouse, chief executive officer of Ripple Labs Inc. None of that makes it any easier to grasp the value of XRP, which helps explain the wild price swings. The best explanation for its surge is the increasing global interest in cryptocurrencies and the proliferation of online exchanges that make it possible to buy, sell and hold these types of assets.\nEnneking said that for his Crypto Asset Management fund he recently shorted XRP, and he's been more bullish on bitcoin and ethereum.\n\"I have a tough time understanding, even if a lot of banks use Ripple to move billions of dollars, why does that increase the value of XRP?\" he said. \"I don't understand what drives price formation.\"\nIf 2017 (and 2018 so far) has taught us anything about cryptocurrency, it's that extreme volatility is the norm. XRP could crash below 10 cents just as quickly as it soared past $3 for any number of ", "external_links": [], "published": "2018-01-16T21:29:00.000+02:00", "crawled": "2018-01-16T21:44:03.002+02:00", "highlightTitle": ""}