{"organizations": [], "uuid": "ae35a001bd45579484d05be7339bb504760c910d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 17}, "facebook": {"likes": 8, "shares": 8, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XC057_claria_SOC_20180119172643.jpg", "site_section": "http://www.wsj.com/xml/rss/3_7014.xml", "section_title": "WSJ.com: US Business", "url": "https://www.wsj.com/articles/foreign-firms-brace-for-potential-cost-increases-after-u-s-tax-overhaul-1516530600", "country": "US", "domain_rank": 387, "title": "Foreign Firms Brace Potential Cost Increases After U.S. Tax Overhaul", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T12:30:00.000+02:00", "replies_count": 0, "uuid": "ae35a001bd45579484d05be7339bb504760c910d"}, "author": "Nina Trentmann", "url": "https://www.wsj.com/articles/foreign-firms-brace-for-potential-cost-increases-after-u-s-tax-overhaul-1516530600", "ord_in_thread": 0, "title": "Foreign Firms Brace Potential Cost Increases After U.S. Tax Overhaul", "locations": [], "entities": {"persons": [{"name": "patrick jany", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "clariant", "sentiment": "none"}, {"name": "international ltd.", "sentiment": "none"}, {"name": "clariant clzny", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "16 COMMENTS Foreign companies are calculating whether the cost increases they will bear under the new U.S. tax law will outweigh the benefits of a lower corporate rate. \nNew measures, such as taxing large companies on payments made to international affiliates under the Base Erosion and Anti-Abuse Tax—or BEAT—are raising alarm among international companies operating in the U.S. Meanwhile, tighter rules on the deductibility of interest and one-time charges linked to a reduction in the value of deferred tax assets are also sparking concern.\nForeign companies worry these moves will put them at a competitive disadvantage.\nStill, a centerpiece provision of the new tax law ushers in a steep reduction in the U.S. corporate tax rate to 21% from 35%, which makes doing business in the U.S. more attractive, executives say. \nFinance chief Patrick Jany is still tallying the potential bump in tax costs for Swiss chemicals maker Clariant CLZNY 4.17% International Ltd., he said. \nCompanies like Clariant, that generate more than $500 million annual revenue in the U.S., could face new taxes on the payments they send to international affiliates under the BEAT tax. \nRoyalties, interest, and compensation to foreign units for the use of intellectual property and services could now be taxed in the U.S. if those payments make up a big enough part of the company’s U.S. tax deductions. Previously, companies could deduct these payments from their U.S. tax bill. \n“This will add millions to our U.S. tax bill,” said Mr. Jany said, adding that the company will also write down its deferred tax assets by more than 10 million Swiss francs ($10.4 million).\nThe BEAT provision has some foreign companies fuming. The U.S. is “obviously pursuing protectionist policies” with the tax plan, a spokesman for German auto parts maker Continental AG CTTAY 2.01% said in an email. These policies, including BEAT, hinder international competition, he said.\nOther foreign companies, including Chinese computer maker Lenovo Group Ltd. LNVGY 0.35% and Daimler AG DMLRY 0.99% say they are carefully considering their options.\n“There are both sticks and carrots in the tax bill, some of which could result in higher tax charges for U.S. subsidiaries of international companies,” said Manal Corwin, national leader of the international tax practice at KPMG LLP (U.S.).\nCFOs are also busy assessing potential one-time charges incurred by their U.S. subsidiaries. Many of these stem from deferred tax-assets that are worth less because of the drop in the corporate tax rate at which these deductions will now be recognized. \nLenovo, the Chinese maker of laptops and smartphones, forecasts a $400 million non-cash charge due to re-measuring the company’s deferred tax assets. While the company continues to assess the impact of the new law, Lenovo believes the lower tax rate will have a positive long-term impact on the earnings of its U.S. operations.\n“It’s a very extensive and detailed bill that is still very new so at the moment the teams are working through it to understand the opportunities [and] changes it presents,” a spokeswoman said in an email.\nNewsletter Sign-up Foreign companies must also measure the impact of new rules that put a cap on the deductibility of interest. This measure will raise costs for U.S. units of foreign companies that borrowed heavily and deducted the interest payments from their U.S. tax bill at the old 35% tax rate, said Stef van Weeghel, global tax policy leader at PricewaterhouseCoopers LLP. \nThe new law also increases the risk that U.S. investors will divest from —and ultimately avoid owning—minority stakes in certain foreign controlled corporations, said KPMG’s Ms. Corwin. Earnings from some of these structured investments could now fall subject to U.S. taxes, she said. \nBut other companies predict a positive one-off impact from the new tax rules. German automaker Daimler will record a boost of €1.7 billion ($2.1 billion) for 2017 thanks to a reduction of its net tax liabilities.\nExecutives at foreign firms welcomed the reduction in the U.S. corporate tax rate, despite these challenges. \n“Any tax cut is good for business” said Jane Jie Sun, CEO of Ctrip.com International Ltd., a Shanghai-based travel firm listed on the Nasdaq. \nThe lower corporate tax rate also offers operational flexibility, said Kaarina Muurinen, CFO of Vaisala Oyi. The Finnish industrial instruments maker could source more of its components in the U.S. rather than import them from home now that the U.S. corporate tax rate, at 21%, is closer to Finland’s rate of 20%, she said.\n“Before, the difference in tax rates was so big,” that sourcing components from the U.S. was “unfavorable” in comparison to importing them from Finland, Ms. Muurinen said. \nSimilarly, Clariant expects to broadly benefit from the drop in the corporate tax rate despite the introduction of BEAT and other charges. The company is keen to expand its U.S. footprint, potentially through bolt-on-acquisitions in areas such as oil services.\n“The U.S. is becoming more competitive in comparison to other markets,” Clariant’s Mr. Jany said. \nWrite to Nina Trentmann at Nina.Trentmann@wsj.com", "external_links": [], "published": "2018-01-21T12:30:00.000+02:00", "crawled": "2018-01-22T08:25:00.002+02:00", "highlightTitle": ""}