{"organizations": [], "uuid": "c5c118eabd575c076e4a221e9a8a2a88c0ef4321", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/easteurope-markets/cee-markets-banks-help-boost-stock-indices-zloty-leads-fx-gains-idUSL8N1OZ1NC", "country": "US", "domain_rank": 408, "title": "CEE MARKETS-Banks help boost stock indices, zloty leads fx gains", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T12:47:00.000+02:00", "replies_count": 0, "uuid": "c5c118eabd575c076e4a221e9a8a2a88c0ef4321"}, "author": "", "url": "https://www.reuters.com/article/easteurope-markets/cee-markets-banks-help-boost-stock-indices-zloty-leads-fx-gains-idUSL8N1OZ1NC", "ord_in_thread": 0, "title": "CEE MARKETS-Banks help boost stock indices, zloty leads fx gains", "locations": [], "entities": {"persons": [{"name": "sandor peto", "sentiment": "none"}, {"name": "monika kiss", "sentiment": "none"}], "locations": [{"name": "budapest", "sentiment": "none"}, {"name": "warsaw", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "budapest", "sentiment": "none"}, {"name": "equilor", "sentiment": "none"}, {"name": "prague", "sentiment": "none"}], "organizations": [{"name": "deutsche bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 10:49 AM / Updated an hour ago CEE MARKETS-Banks help boost stock indices, zloty leads fx gains Reuters Staff 8 Min Read \n* DB upgrade boosts Erste, Prague stock index at 6-1/2-yr high * Financial sector stocks drive rally in Warsaw bourse * Zloty hits 2-1/2-year high despite CPI fall * Weak dollar underpins Central European currencies By Sandor Peto BUDAPEST, Jan 4 (Reuters) - Financial sector stocks helped lift Central European stock indices on Thursday on optimism about the region's booming economic output and strong U.S. and German data. Prague's main stock index hit its highest since the summer of 2011, rising 1.2 percent, driven by a 4.3 percent jump in the stocks of Austria-based regional bank Erste. The stock surged after Deutsche Bank upgraded Erste to \"buy\" from \"hold\", saying growth was strong in the key economies of the region amid rising inflation and accelerating loan growth. \"The view that interest rates will start to rise (in some countries in the region)... buoys banks stocks,\" said Monika Kiss, analyst of Equilor in Budapest. \"In Warsaw, a consolidation of the sector also helps financial sector stocks, with funds reassessing their investments,\" she added. Analysts said the gains of the Warsaw bourse were bigger than elsewhere because it reopened after the year-end holiday with a one day delay compared to many other bourses. \"It seems that we observe the delayed effect of a positive start of the year on most equity markets, including emerging markets, since MSCI EM at the beginning of year reached a new peak,\" said DM BOS analyst Lukasz Bugaj. Warsaw's blue-chip index rose two percent, outperforming the MSCI's broadest index of Asia-Pacific shares outside Japan, similar to the Nikkei of Tokyo which also reopened for 2018 with a delay. Warsaw's rise was led by insurer PZU, and two banks, PKO BP and BZ WBK. The zloty, Central Europe's most liquid currency, also outperformed regional peers, rising 0.1 percent to 4.152 against the euro, slightly off 2-1/2-year highs touched early on Thursday. Regional currencies have firmed in the year's first sessions, even though Polish data released on Wednesday showed a bigger-than-expected decline in annual inflation in December to two percent, discouraging expectations of Polish central bank interest rate hikes late this year. The weakness of the dollar, however, has fuelled market appetite for the region's currencies, even the forint of Hungary where the central bank has continued to stimulate the economy with unconventional tools. It is due to launch its new long-term interest rate swaps for banks on Jan. 18, which can help long-term market interest rates fall further, traders said. Forint interest rate swaps in the market consolidated on Thursday after 5-10 basis point decline in 5- to 10-year tenors on Wednesday. \"Early-year illiquidity enlarged that movement,\" one Budapest-based fixed income trader said, adding though that long-term yields already trading at record lows may have some further room to decline. CEE SNAPSHOT AT MARKETS 1047 CET CURRENCI ES Latest Previous Daily Change bid close change in 2018 Czech <EURCZK= 25.5150 25.5155 +0.00% +0.11% crown > Hungary <EURHUF= 308.6700 308.6550 -0.00% +0.73% forint > Polish <EURPLN= 4.1500 4.1556 +0.13% +0.63% zloty > Romanian <EURRON= 4.6295 4.6255 -0.09% +1.08% leu > Croatian <EURHRK= 7.4225 7.4295 +0.09% +0.11% kuna > Serbian <EURRSD= 118.8700 118.8100 -0.05% -0.31% dinar > Note: calculated from 1800 CET daily change Latest Previous Daily Change close change in 2018 Prague 1100.25 1086.750 +1.24% +2.05% 0 Budapest 39755.06 39604.40 +0.38% +0.96% Warsaw 2513.40 2463.25 +2.04% +2.12% Bucharest 7909.79 7910.81 -0.01% +2.01% Ljubljana <.SBITOP 799.58 794.96 +0.58% -0.84% > Zagreb 1841.90 1840.82 +0.06% -0.05% Belgrade <.BELEX1 754.02 754.59 -0.08% -0.76% 5> Sofia 688.57 685.09 +0.51% +1.64% BONDS Yield Yield Spread Daily (bid) change vs Bund change in Czech spread Republic 2-year <CZ2YT=R 0.6620 0.0690 +128bps +7bps R> 5-year <CZ5YT=R 0.8770 -0.0280 +108bps -3bps R> 10-year <CZ10YT= 1.6950 0.0010 +124bps -1bps RR> Poland 2-year <PL2YT=R 1.6480 -0.0260 +226bps -3bps R> 5-year <PL5YT=R 2.5640 -0.0270 +277bps -3bps R> 10-year <PL10YT= 3.2620 -0.0410 +281bps -5bps RR> FORWARD RATE AGREEMEN T 3x6 6x9 9x12 3M interban k Czech Rep 1.06 1.25 1.38 0.00 <PRIBOR= > Hungary 0.03 0.06 0.10 0.03 Poland 1.75 1.79 1.88 1.72 Note: FRA are for ask prices quotes", "external_links": [], "published": "2018-01-04T12:47:00.000+02:00", "crawled": "2018-01-04T13:06:42.090+02:00", "highlightTitle": ""}