{"organizations": [], "uuid": "0bbdad8e11d7b0e29ac8bf46d1007dcf408d29a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/06/07/104516246-_Y2A5929.1910x1000.JPG", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2017/12/29/why-shark-tanks-daymond-john-refuses-to-binge-watch-tv.html", "country": "US", "domain_rank": 767, "title": "Why 'Shark Tank's' Daymond John refuses to binge-watch TV", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.024, "site_type": "news", "published": "2018-01-01T18:00:00.000+02:00", "replies_count": 0, "uuid": "0bbdad8e11d7b0e29ac8bf46d1007dcf408d29a5"}, "author": "Ali Montag", "url": "https://www.cnbc.com/2017/12/29/why-shark-tanks-daymond-john-refuses-to-binge-watch-tv.html", "ord_in_thread": 0, "title": "Why 'Shark Tank's' Daymond John refuses to binge-watch TV", "locations": [], "entities": {"persons": [{"name": "daymond john", "sentiment": "negative"}, {"name": "fubu", "sentiment": "none"}, {"name": "john", "sentiment": "none"}], "locations": [], "organizations": [{"name": "abc", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "hbo", "sentiment": "none"}, {"name": "nfl", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "We all get the same 24 hours in a day. \nFor Daymond John , those hours are packed. When he's not busy overseeing businesses like Fubu, his fashion brand, or Blueprint + Co. , his co-working space venture, he's tending to his investments made on ABC's \"Shark Tank,\" authoring books and being a father.\nTo help ensure success at all of these ventures, he avoids one activity.\n\"I don't binge-watch TV,\" John tells CNBC Make It .\n\"The reason why is because I value my time, and I know that I'm going to get caught up on 'Game of Thrones,'\" he says. \"I just don't have the time.\"\nIt isn't just HBO or Netflix. Binge-watching new shows, playing video games and becoming engrossed in hours of NFL games can all cause your productivity to plummet, John says.\n\"A lot of people sit there and go, 'I wonder how come I can't make it anywhere in life?' yet they just played 'Black Ops' for 15 hours that week and they just watched nine football games,\" he adds, referring to the \"Call of Duty\" shooter video game. \"I'm going to break something to you: In every single football game, somebody is going to win and somebody is going to lose.\n\"That's it, you don't need to watch them anymore!\"\nDavid A. Grogan | CNBC Daymond John Daymond admits he doesn't watch any new TV shows. \"I haven't watched a new program, probably in the last five or six years,\" he says. \"I keep TV on kind of in the background, like wallpaper.\n\"If I'm going to binge-watch anything, it is going to be a documentary on how to save the world, make more money, stop human trafficking or things that are of my interest,\" he tells CNBC Make It.\nJohn doesn't cut out entertainment completely, he just chooses wisely.\n\"I'm a normal guy. I watch all the normal movies that guys are supposed to watch: 'Rambo,' 'Terminator,' 'Transformers,' 'Star Wars' and 'Rocky,' of course. Any of those,\" he says. And, of course, he watches \"Shark Tank.\" \nSo what's his advice when it comes to using free time in a way that cultivates success? You can watch as much Netflix as you want, as long as you know the trade-off.\n\"There is nothing against binge-watching ... or watching football if that is your escape,\" he says. \"Maybe you work all day every single day, and that is the way that you escape.\n\"You really just have to put your priorities in perspective. But don't complain when you can't get where you want to go.\" \nDon't miss: Kevin O'Leary: Why having a creative passion can make you better at your job \nLike this story? Like CNBC Make It on Facebook ! \nshow chapters Kevin O'Leary explains why devoting time to creative pursuits will make you better at your job      11:29 AM ET Sat, 23 Dec 2017 | 01:07 Video by Beatriz Bajuelos Castillo \nDisclosure: CNBC owns the exclusive off-network cable rights to \"Shark Tank.\"", "external_links": [], "published": "2018-01-01T18:00:00.000+02:00", "crawled": "2018-01-01T18:00:56.000+02:00", "highlightTitle": ""}