{"organizations": [], "uuid": "e0f8c99c73c5256b4c78510452517da745ee801f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XE455_UPrail_SOC_20180125182029.jpg", "site_section": "https://www.wsj.com/news/business", "section_title": "Business &amp; Finance News - Wall Street Journal", "url": "https://www.wsj.com/articles/todays-top-supply-chain-and-logistics-news-from-wsj-1516966313", "country": "US", "domain_rank": 387, "title": "Today’s Top Supply Chain and Logistics News From - WSJ", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-26T14:31:00.000+02:00", "replies_count": 0, "uuid": "e0f8c99c73c5256b4c78510452517da745ee801f"}, "author": "Paul Page", "url": "https://www.wsj.com/articles/todays-top-supply-chain-and-logistics-news-from-wsj-1516966313", "ord_in_thread": 0, "title": "Today’s Top Supply Chain and Logistics News From - WSJ", "locations": [], "entities": {"persons": [{"name": "lance fritz", "sentiment": "none"}, {"name": "paul ziobro", "sentiment": "none"}], "locations": [{"name": "kansas city", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}], "organizations": [{"name": "logistics news from - wsj", "sentiment": "negative"}, {"name": "unp", "sentiment": "none"}, {"name": "union pacific corp", "sentiment": "none"}, {"name": "wsj", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Sign up: With one click, get this newsletter delivered to your inbox .\nNew safety technology is bringing fresh headaches to Union Pacific Corp. UNP -0.10% and its shipping customers. Railroad Chief Executive Lance Fritz says the troublesome implementation of braking technology known as positive train control is causing congestion in its networks, the WSJ’s Paul Ziobro reports, triggering slowdowns and terminal delays at key points in the UP system. The problems at the largest American railroad mark a new concern for U.S. shippers, with freight networks increasingly jammed in a resurgent economy marked by strong shipping demand. Many shippers have turned to rail service with trucking capacity tight and over-the-road rates soaring, and that’s helped boost intermodal railroad traffic at a typically weak seasonal period. UP competes for that business, and for commodities like lumber and refrigerated transports. But the company’s 5% gain in fourth-quarter revenue was relatively slim, and delays in spots including Chicago, Kansas City and Houston make it harder to lure away frustrated truck shippers.\nOne piece of the White House infrastructure plan coming into clearer focus is that the Trump administration wants projects to move faster. The administration plans to roll back regulations to reduce the period between project approval and construction, the WSJ’s Ted Mann reports, limiting environmental reviews and litigation in favor of getting big things built. That would be welcome news to bridge builders, port planners and others focused on transportation spending. Yet it could make passing an infrastructure package more difficult, with Democrats and environmental groups likely to raise alarms that the fast-permitting plan is focused less on efficiency than on sidestepping basic air and water quality reviews. The White House expects to have allies, however, among mayors and governors who are eager to see local projects move ahead quickly but then see them hobbled by a gauntlet of federal agency reviews.\nThe biggest tax overhaul in three decades is already starting to ripple across U.S. supply chains just weeks after it was adopted. Companies are dusting off once-shelved plans, re-evaluating existing projects and exploring new investment in factories and equipment, the WSJ’s Theo Francis, Peter Loftus and Heather Haddon report, signaling a growing impact the tax law is likely to have on production and distribution. Specialty drugmaker Amicus Therapeutics Inc. will spend as much as $200 million on a new production facility in the Eastern U.S. rather than look at European sites to supply an experimental drug. Grocery distributor United Natural Foods Inc., a supplier to Whole Foods, says the return on investment improved by four percentage points on a planned warehousing project, largely because of the new lower tax rate. Economist Joseph LaVorgna says the law may trigger a kind of virtuous cycle, with spending by some companies feeding still more revenue to other firms.\nECONOMY & TRADE Photo: Bloomberg News Growing world-wide demand has U.S. industrial manufacturing engines humming. Caterpillar Inc. and 3M Co. are both reporting stronger revenue and profit growth, and the WSJ’s Andrew Tangel and Bob Tita write that expanding trade in goods from construction equipment to industrial electronics has the companies heading into 2018 with brighter outlooks . Caterpillar’s expansion is especially significant for industrial markets: the 18% revenue growth last year breaks a four-year streak of declining sales, and the 35% surge in fourth-quarter revenue may drive the construction and mining industry bellwether to boost investment after restoring 4,800 jobs in the U.S. last year. 3M is investing in supplying electronics and energy business, including makers of semiconductors, automotive electrification and energy grids. Its revenue in that industrial arena rose 12.5% last quarter, largely driven by overseas demand. The sales figures suggest more production is coming from those companies, and likely even more from their customers.\nQUOTABLE\n‘ It gives us more incentive to invest, particularly in the U.S. ’\n—Kimberly-Clark CEO Tom Falk, on the new tax law.\nNumber of the Day 3.7% Year-over-year growth in American Trucking Associations’ truck-tonnage index for 2017, the largest annual gain since 2013.\nIN OTHER NEWS The Conference Board’s Leading Economic Index rose 0.6% in December, slightly more than in November . (WSJ)\nThe U.K. economy grew 0.5% in 2017, the slowest pace in five years . (WSJ)\nNatural gas prices are at the highest level in more than a year . (WSJ)\nJapan’s exports jumped 11.8% last year but imports grew even faster at 14%. (WSJ)\nCanada hopes to break a logjam in North American Free Trade Agreement talks with a proposal for more regional content in automobiles. (WSJ)\nCongo is moving to double taxes on cobalt, a key metal in high demand for use in smartphones and electric vehicles. (WSJ)\nBig global mergers-and-acquisitions are coming at a blistering pace to start 2018 . (WSJ)\nUnited Continental Holdings Inc. fourth-quarter cargo revenue soared 21.6% on a 15.2% gain in traffic . (WSJ)\nPresident Trump says he would rejoin the Trans-Pacific Partnership if “we made a much better deal than we had.” (Nikkei Asian Review)\nCSX Corp. is considering selling up to 8,000 miles of its 21,000-mile freight rail network. (Albany Times-Union)\nNine West Holdings Inc. is near entering bankruptcy as part of a deal to restructure debt and sell off parts of the clothing retailer . (Bloomberg)\nU.S. soybean growers are losing market share in China to Brazilian exporters as their push for higher yields has dimmed protein levels in American crops . (Reuters)\nDicks Sporting Goods opened the first phase of a Binghamton, N.Y., distribution center expected to grow to 923,000 square feet . (Press Connects)\nNorfolk Southern Corp.’s revenue rose 7% in the fourth quarter on 5% more freight volume . (Roanoke Times)\nEuronav will consider more acquisitions in the troubled tanker market once its purchase of Gener8 Maritime closes. (Lloyd’s List)\nThe Transpacific Stabilization Agreement container shipping price discussion group shut down . (Seatrade Maritime)\nBangladeshi lawmakers enacted tougher penalties aimed at cleaning up the country’s notorious ship recycling sector . (Splash 24/7)\nContainer imports at California’s Port of Long Beach soared 27.3% year-over-year in December and advanced sharply from November . (American Shipper)\nLas Vegas Railway Express Inc. acquired United Rail in its growing effort to buy freight and passenger short lines. (Progressive Railroading)\nFourth-quarter net profit at trucker Marten Transport Ltd. rose 3.7% to $8.6 million excluding special tax gains on a 5.9% gain in revenue . (Heavy Duty Trucking)\nA poll shows 94% of U.S. workers doubt they will lose jobs to automation despite rapid growth in robotics in warehouses. (NPR)\nABOUT US Paul Page is deputy editor of WSJ Logistics Report. Follow him at @PaulPage , and follow the entire WSJ Logistics Report team: @brianjbaskin , @jensmithWSJ and @EEPhillips_WSJ . Follow the WSJ Logistics Report on Twitter at @WSJLogistics .\nWrite to Paul Page at paul.page@wsj.com", "external_links": ["https://www.bloomberg.com/news/articles/2018-01-24/nine-west-is-said-to-plan-a-bankruptcy-filing-with-asset-sales", "http://www.timesunion.com/business/article/CSX-considers-sale-of-former-Boston-Albany-line-12522378.php", "https://www.npr.org/2018/01/25/579160550/don-t-think-a-robot-could-do-this-warehouse-workers-aren-t-worried-for-their-job", "https://twitter.com/WSJLogistics?lang=en", "https://twitter.com/jensmithWSJ", "https://www.reuters.com/article/us-usa-soybeans-protein-insight/protein-plight-brazil-steals-u-s-soybean-share-in-china-idUSKBN1FE0FM", "http://www.seatrade-maritime.com/news/americas/liner-conferences-reaching-the-end-of-the-road-as-tsa-shuts-its-doors.html", "http://www.pressconnects.com/story/news/2018/01/25/now-fully-operational-dicks-celebrate-new-distribution-center/1063088001/", "https://asia.nikkei.com/Politics-Economy/International-Relations/Trump-may-reconsider-withdrawal-from-TPP", "http://splash247.com/parliament-votes-massive-overhaul-bangladeshs-ship-recycling-sector/", "http://www.truckinginfo.com/news/story/2018/01/earnings-watch-marten-transport-profits-balloon.aspx", "https://twitter.com/brianjbaskin?lang=en", "https://twitter.com/PaulPage", "http://www.roanoke.com/ap/business/tax-cuts-boost-norfolk-southern-s-fourth-quarter-profit/article_db892488-12bc-5feb-98b2-9ff12e6257b2.html", "https://twitter.com/EEPhillips_WSJ?lang=en", "http://www.logisticsmgmt.com/article/ata_reports_annual_gains_in_2017_truck_tonnage", "https://www.americanshipper.com/main/asd/port-of-long-beach-thrives-in-2017-70388.aspx", "http://www.progressiverailroading.com/m_a/news/Las-Vegas-Railway-Express-acquires-United-Rail--53768", "https://lloydslist.maritimeintelligence.informa.com/LL1120988/Euronav-vows-more-MA-activity-after-Gener8-deal"], "published": "2018-01-26T14:31:00.000+02:00", "crawled": "2018-01-26T19:49:50.000+02:00", "highlightTitle": ""}