{"organizations": [], "uuid": "f331bcd64ef2845aef66394041291cba1b1b0682", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/hexagon-ab-ceo-trial/update-1-norway-prosecutors-to-appeal-against-acquittal-of-hexagon-ceo-idUSL8N1PI6IW", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Norway prosecutors to appeal against acquittal of Hexagon CEO", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T19:45:00.000+02:00", "replies_count": 0, "uuid": "f331bcd64ef2845aef66394041291cba1b1b0682"}, "author": "", "url": "https://www.reuters.com/article/hexagon-ab-ceo-trial/update-1-norway-prosecutors-to-appeal-against-acquittal-of-hexagon-ceo-idUSL8N1PI6IW", "ord_in_thread": 0, "title": "UPDATE 1-Norway prosecutors to appeal against acquittal of Hexagon CEO", "locations": [], "entities": {"persons": [{"name": "terje solsvik", "sentiment": "none"}, {"name": "ole petter skonnord", "sentiment": "none"}, {"name": "rollen", "sentiment": "none"}], "locations": [{"name": "oslo", "sentiment": "none"}, {"name": "oslo", "sentiment": "none"}, {"name": "sweden", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "stockholm", "sentiment": "none"}], "organizations": [{"name": "hexagon", "sentiment": "negative"}, {"name": "hexagon chief executive ola rollen", "sentiment": "none"}, {"name": "rollen", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "hexagon ceo reuters staff", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 5:47 PM / Updated 18 minutes ago UPDATE 2-Norway prosecutors to appeal against acquittal of Hexagon CEO Reuters Staff \n* Ola Rollen was acquitted of insider trading on Jan. 10 \n* Prosecutors had asked for 18-month prison term \n* Judges must now decide whether to allow prosecutors’ appeal \n* Rollen’s lawyers says court should reject the case (Adds Hexagon, prosecutor quotes, background) \nBy Ole Petter Skonnord \nOSLO, Jan 23 (Reuters) - Norwegian prosecutors will appeal against the acquittal of Hexagon Chief Executive Ola Rollen over insider trading charges, they said on Tuesday. \nRollen, who was cleared of all accusations in an unanimous verdict by an Oslo court on Jan. 10, now faces the prospect of a new trial, if the appeals court agrees to hear the case. \nProsecutors had asked for an 18-month prison term over Rollen’s 2015 purchase of shares in Norway’s Next Biometrics , a company not connected to Hexagon. \nOne of Sweden’s best known business leaders, Rollen maintained his innocence throughout the trial and continued to run the company he has led since 2000. \nTrading on the Stockholm stock exchange had ended ahead of the announcement. Hexagon’s shares, which fell sharply on the initial news of an investigation in October 2016, rose to all-time highs following the acquittal this month. \nThe case dates back to Rollen’s purchase of Next Biometrics shares on Oct. 6 and 7, 2015, on behalf of Greenbridge, an investment firm he co-founded. Prosecutors said this was illegal because Greenbridge was involved in talks to take a larger stake in Next at a higher price. \nRollen’s lawyer argued successfully at trial that his client did not possess privileged information at the time of the share purchase and that the transactions he made were motivated by his own independent analysis of Next Biometrics. \n“The prosecutor’s office disagrees with the court’s consideration of the evidence, and also with how it has evaluated the legal questions raised by this case,” lead prosecutor Marianne Bender told Reuters. \n“The appeals court must first consider whether to allow the appeal, which may take a few months. If they do, they will set a trial date,” she added. \nRollen’s lawyers will ask the appeals court to reject the case, Hexagon said in a statement. \n“I speak on behalf of the board and everyone else who has supported Ola since the beginning of this ordeal that we stand united with him,” Hexagon Chair Gun Nilsson said in a statement. \n“This decision doesn’t change anything; thus, Ola will continue as President and CEO with the board’s full support.” \nUnder Rollen, Hexagon has transformed from a sprawling conglomerate with a market value of a few billion crowns in 2000 into a $20 billion technology market leader thanks to a string of acquisitions and rapid growth. \nRollen declined to comment when contacted by Reuters. (Additional reporting by Johannes Hellstrom in Stockholm; Writing by Terje Solsvik; Editing by Mark Potter)", "external_links": [], "published": "2018-01-23T19:45:00.000+02:00", "crawled": "2018-01-23T20:14:26.024+02:00", "highlightTitle": ""}