{"organizations": [], "uuid": "33e67b66f2c41c3116f675ee099a222b8a8b0059", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/europe-stocks/update-1-european-stocks-rally-on-u-s-shutdown-deal-dax-hits-record-idUSL8N1PI1Z8", "country": "US", "domain_rank": 408, "title": "UPDATE 1-European stocks rally on U.S. shutdown deal, DAX hits record", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T11:37:00.000+02:00", "replies_count": 0, "uuid": "33e67b66f2c41c3116f675ee099a222b8a8b0059"}, "author": "", "url": "https://www.reuters.com/article/europe-stocks/update-1-european-stocks-rally-on-u-s-shutdown-deal-dax-hits-record-idUSL8N1PI1Z8", "ord_in_thread": 0, "title": "UPDATE 1-European stocks rally on U.S. shutdown deal, DAX hits record", "locations": [], "entities": {"persons": [{"name": "julien ponthus", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "carrefour", "sentiment": "none"}, {"name": "milan cutkovic", "sentiment": "none"}, {"name": "easyjet", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* STOXX 600 up 0.1 pct at close\n* DAX bulls aim at 14,000 points\n* Carrefour takes the fight to Amazon\n* EasyJet jumps after Q1 results (Adds details and updates prices at close)\nBy Julien Ponthus\nLONDON, Jan 23 (Reuters) - European shares rose to new highs on Tuesday after U.S. senators struck a deal to end a three-day government shutdown, while earnings updates were also in focus.\nEuro zone stocks reached their highest in a decade, with Germany’s DAX jumping to a fresh record of just over 13,596 points. The DAX ended 0.7 percent higher, while the pan-European STOXX 600 closed the session up 0.1 percent.\n“As the next goal, the bulls have the hurdle of 14,000 points in mind,” said market analyst Milan Cutkovic at trading house AxiTrader. “With the current mood on the stock markets, this is a realistic scenario for the coming weeks.”\nAfter a previous session fueled by M&A news, corporate updates maintained the buoyant mood.\nInvestors cheered plans by Europe’s biggest retailer Carrefour to slash costs, open its loss-making Chinese business to new investors and spend more heavily on e-commerce in the face of competition from Amazon.\nCarrefour touched a five-month high with a 3.2 percent rise. Bernstein analysts said the strategic plan “ticks all the right boxes”.\nShares in computer peripherals and mobile speaker maker Logitech were the biggest gainers, jumping 8 percent after it reported better than expected sales and raised its guidance.\nEasyjet was another strong riser, up 5.1 percent, after reporting first-quarter results.\n“A strong performance for new boss Johan Lundgren in his first quarter as easyJet benefited from a combination of Ryanair cancellations and the demise of a trio of peers removing some capacity from the market”, senior ETX market analyst Neil Wilson commented.\nSky shares were up 2.3 percent after a UK regulator said Fox buying Sky was not in the public interest because of media plurality concerns, but suggested remedies.\nThe regulator CMA also backed Fox’s commitment to broadcasting standards.\n“Concerns on broadcasting standards would likely have been a complete deal breaker,” said Neil Campling, Co-Head of the Global Thematic Group at Mirabaud Securities.\nHungarian low-cost airline Wizz Air rose 5.3 percent after saying it was interested in Italy’s struggling flag carrier Alitalia but only regarding short and medium-haul routes.\nOnline grocery technology provider Ocado inched a further 0.9 percent after a 27 percent surge on Monday when it unveiled a deal with Canada’s second-largest food supermarket group Sobeys. (Additional reporting by Danilo Masoni, Alasdair Pal and Kit Rees; Editing by Matthew Mpoke Bigg)\n ", "external_links": [], "published": "2018-01-23T11:37:00.000+02:00", "crawled": "2018-01-23T12:02:39.005+02:00", "highlightTitle": ""}