{"organizations": [], "uuid": "fa81aadeb66d1838fcb156e8389870a00687b860", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223348798&w=1200&r=LYNXMPEE0I0WM", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-boxing-fury/former-world-champion-fury-regains-licence-idUKKBN1F81KP", "country": "US", "domain_rank": 408, "title": "Former world champion Fury regains licence", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T15:50:00.000+02:00", "replies_count": 0, "uuid": "fa81aadeb66d1838fcb156e8389870a00687b860"}, "author": "", "url": "https://uk.reuters.com/article/uk-boxing-fury/former-world-champion-fury-regains-licence-idUKKBN1F81KP", "ord_in_thread": 0, "title": "Former world champion Fury regains licence", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 1:51 PM / Updated 3 minutes ago Former world champion Fury has licence suspension lifted Reuters Staff 2 Min Read \n(Reuters) - Former world heavyweight champion Tyson Fury is set to resume his career after the British Boxing Board of Control (BBBC) lifted his suspension subject to medical clearance. \nThe BBBC had suspended the 29-year-old’s licence in 2016, citing anti-doping and medical issues, and he has not fought since beating the previously undefeated Wladimir Klitschko to claim the IBF, WBA and WBO world titles in November 2015. \nFury accepted a backdated two-year doping ban last December and this month announced that he was applying to have his licence reinstated. \n“Following an interview with Tyson Fury at the British Boxing Board of Control offices earlier today, the suspension of his British Boxing Board of Control boxer’s licence will be lifted subject to receipt and clearance of all medical requirements,” the BBBC said on its website. FILE PHOTO - Britain Boxing - Billy Joe Saunders v Artur Akavov WBO World Middleweight Title - Lagoon Leisure Centre, Paisley, Renfrewshire, Scotland - 3/12/16 Tyson Fury before the fight Action Images via Reuters / Peter Cziborra Livepic \nWhen Fury was suspended, the BBBC pointed to concern about his health after he admitted using cocaine to help him cope with depression. \nSince then, the boxer has frequently given mixed messages about his intentions, announcing his retirement and then claiming he intends to regain his title. \nFury has split with his trainer, his uncle Peter Fury, and will now team up with Ben Davison, whose first task will be to oversee the boxer’s fitness regime after recent pictures posted on social media showed him to be bloated. \nOn Thursday, Fury posted on social media: “Working really hard & putting in the sacrifice needed to achieve glory. Along with the sunshine there has to be a little rain sometimes! There will be no victory without pain.” \nFury has previously scheduled his possible return for April, by when IBF and WBA champion Anthony Joshua will have met WBO title holder Joseph Parker in a unification bout. Reporting by Neil Robinson; Editing by David Goodman and Christian Radnedge", "external_links": [], "published": "2018-01-19T15:50:00.000+02:00", "crawled": "2018-01-19T16:12:45.000+02:00", "highlightTitle": ""}