{"organizations": [], "uuid": "c9dc24c1430cd4153df6351abe53f65526e7c1d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-franklin-limited-duration-income-trust-announces-sources-of-monthly-dividend-distribution.html", "country": "US", "domain_rank": 767, "title": "Franklin Limited Duration Income Trust Announces Sources of Monthly Dividend Distribution", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T00:05:00.000+02:00", "replies_count": 0, "uuid": "c9dc24c1430cd4153df6351abe53f65526e7c1d1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-franklin-limited-duration-income-trust-announces-sources-of-monthly-dividend-distribution.html", "ord_in_thread": 0, "title": "Franklin Limited Duration Income Trust Announces Sources of Monthly Dividend Distribution", "locations": [], "entities": {"persons": [], "locations": [{"name": "san mateo", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "franklin limited duration income trust", "sentiment": "negative"}, {"name": "nav", "sentiment": "none"}, {"name": "fund", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN MATEO, Calif., Jan. 11, 2018 (GLOBE NEWSWIRE) -- The Franklin Limited Duration Income Trust (NYSE:FTF) (CUSIP 35472T101) has declared a dividend of $0.1042 per common share payable January 12, 2018, to shareholders of record as of December 29, 2017. It is currently estimated that $0.0434 per share represents net investment income and $0.0608 per share represents return of principal.\nThe Fund adopted a managed distribution plan and will make monthly distributions to common shareholders at an annual minimum fixed rate of 10%, based on the average monthly net asset value (NAV) of the Fund’s common shares. The Fund will calculate the average NAV from the previous month based on the number of business days in that month on which the NAV is calculated. The distribution will be calculated as 10% of the previous month’s average NAV, divided by 12. Management will generally distribute amounts necessary to satisfy the Fund’s plan and the requirements prescribed by excise tax rules and Subchapter M of the Internal Revenue Code. The plan is intended to provide shareholders with a constant, but not guaranteed, fixed minimum rate of distribution each month and is intended to narrow the discount between the market price and the NAV of the Fund’s common shares, but there is no assurance that the plan will be successful in doing so.\nUnder the managed distribution plan, to the extent that sufficient investment income is not available on a monthly basis, the Fund will distribute long-term capital gains and/or return of capital in order to maintain its managed distribution level. No conclusions should be drawn about the Fund’s investment performance from the amount of the Fund’s distributions or from the terms of the Fund’s managed distribution plan.\nThe Board may amend the terms of the plan or terminate the plan at any time without prior notice to the Fund’s shareholders. The amendment or termination of the plan could have an adverse effect on the market price of the Fund’s common shares. The plan will be subject to the periodic review by the Board, including a yearly review of the annual minimum fixed rate to determine if an adjustment should be made.\nIn compliance with Rule 19a-1 of the Investment Company Act of 1940, shareholders will receive a notice that details the source of income for each dividend such as net investment income, gain from the sale of securities and return of principal. Please note: Determination of the actual source of the fund’s dividend can only be made at year-end. The actual source amounts of all fund dividends will be included in the fund’s annual or semiannual reports.\nIn addition, the tax treatment may differ from the accounting treatment used to calculate the source of the fund’s dividends as shown on your statement. Please refer to your Form 1099-DIV for the character and amount of distributions for income tax reporting purposes. Since each shareholder’s tax situation is unique, please consult your tax advisor as to the appropriate treatment of fund distributions.\nYou may request a copy of the Fund's current Report to Shareholders by contacting Franklin Templeton’s Fund Information Department at 1-800/DIAL BEN® (1-800-342-5236) or by visiting franklintempleton.com . All investments involve risks, including possible loss of principal. Interest rate movements and mortgage prepayments will affect the Fund's share price and yield. Bond prices generally move in the opposite direction of interest rates. As the prices of bonds in a fund adjust to a rise in interest rates, the fund’s share price may decline. Investments in lower-rated bonds include higher risk of default and loss of principal. The Fund is actively managed but there is no guarantee that the manager's investment decisions will produce the desired results. For portfolio management discussions, including information regarding the Fund’s investment strategies, please view the most recent Annual or Semi-Annual Report to Shareholders which can be found at franklintempleton.com or sec.gov .\nFranklin Resources, Inc. (NYSE:BEN) is a global investment management organization operating as Franklin Templeton Investments. Franklin Templeton Investments provides global and domestic investment management to retail, institutional and sovereign wealth clients in over 170 countries. Through specialized teams, the company has expertise across all asset classes—including equity, fixed income, alternative and custom solutions. The company’s more than 650 investment professionals are supported by its integrated, worldwide team of risk management professionals and global trading desk network. With offices in over 30 countries, the California–based company has more than 70 years of investment experience and over $753 billion in assets under management as of December 31, 2017. For more information, please visit franklintempleton.com .\nFranklin Templeton Investments\nShareholders/Financial Advisors: (800) 342-5236\nSource:Franklin Limited Duration Income Trust", "external_links": [], "published": "2018-01-12T00:05:00.000+02:00", "crawled": "2018-01-12T02:40:05.000+02:00", "highlightTitle": ""}