{"organizations": [], "uuid": "c87eb50f9e2911a48aa39b3ad65b6982c33ac5d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/business-wire-subadvisor-for-wells-fargo-multi-sector-income-fund-changes-its-name.html", "country": "US", "domain_rank": 767, "title": "Subadvisor for Wells Fargo Multi-Sector Income Fund Changes Its Name", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T17:15:00.000+02:00", "replies_count": 0, "uuid": "c87eb50f9e2911a48aa39b3ad65b6982c33ac5d5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/business-wire-subadvisor-for-wells-fargo-multi-sector-income-fund-changes-its-name.html", "ord_in_thread": 0, "title": "Subadvisor for Wells Fargo Multi-Sector Income Fund Changes Its Name", "locations": [], "entities": {"persons": [], "locations": [{"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "first international advisors", "sentiment": "negative"}, {"name": "llc", "sentiment": "none"}, {"name": "wells fargo asset management", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "wells fargo & company", "sentiment": "none"}, {"name": "wells fargo funds management", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO--(BUSINESS WIRE)-- Effective today, January 31, 2018, First International Advisors, LLC, subadvisor to the Wells Fargo Multi-Sector Income Fund (NYSE American: ERC), has changed its legal entity name to Wells Fargo Asset Management (International), LLC. Wells Fargo Asset Management (International) is an indirect wholly owned subsidiary of Wells Fargo & Company and an affiliate of Wells Fargo Funds Management, LLC, the fund’s investment advisor. There will be no change to the portfolio management team, investment philosophy, or process as a result of this change.\nThe Wells Fargo Multi-Sector Income Fund is a closed-end income fund. The fund’s investment objective is to seek a high level of current income consistent with limiting its overall exposure to domestic interest-rate risk.\nThe final determination of the source of all distributions is subject to change and is made after year-end. Each fund will send shareholders a Form 1099-DIV for the calendar year that will tell shareholders how to report these distributions for federal income tax purposes.\nFor more information on Wells Fargo’s closed-end funds, please visit our website .\nThese closed-end funds are no longer engaged in initial public offerings, and shares are only available through broker/dealers on the secondary market. Unlike an open-end mutual fund, a closed-end fund offers a fixed number of shares for sale. After the initial public offering, shares are bought and sold through broker/dealers in the secondary marketplace, and the market price of the shares is determined by supply and demand, not by NAV, and is often lower than the NAV. A closed-end fund is not required to buy its shares back from investors upon request.\nHigh-yield, lower-rated bonds may contain more risk due to the increased possibility of default. Foreign investments may contain more risk due to the inherent risks associated with changing political climates, foreign market instability, and foreign currency fluctuations. Risks of international investing are magnified in emerging or developing markets. The fund is exposed to mortgage- and asset-backed securities risk. When interest rates rise, the value of debt securities tends to fall. When interest rates decline, interest that a fund is able to earn on its investments in debt securities may also decline, but the value of those securities may increase. Changes in market conditions and government policies may lead to periods of heightened volatility in the debt securities market and reduced liquidity for certain fund investments. Interest-rate changes and their impact on the funds and their NAVs can be sudden and unpredictable.\nThe use of leverage results in certain risks, including, among others, the likelihood of greater volatility of the NAV and the market price of common shares. Derivatives involve additional risks, including interest-rate risk, credit risk, the risk of improper valuation, and the risk of noncorrelation to the relevant instruments they are designed to hedge or to closely track. There are numerous risks associated with transactions in options on securities. Illiquid securities may be subject to wide fluctuations in market value and may be difficult to sell.\nWells Fargo Asset Management (WFAM) is a trade name used by the asset management businesses of Wells Fargo & Company. Wells Fargo Funds Management, LLC, a wholly owned subsidiary of Wells Fargo & Company, provides investment advisory and administrative services for Wells Fargo Funds. Other affiliates of Wells Fargo & Company provide subadvisory and other services for the funds. This material is prepared by Wells Fargo Funds Distributor, LLC , Member FINRA, an affiliate of Wells Fargo & Company. Neither Wells Fargo Funds Distributor nor Wells Fargo Funds Management holds fund shareholder accounts or assets. This material is for general informational and educational purposes only and is NOT intended to provide investment advice or a recommendation of any kind—including a recommendation for any specific investment, strategy, or plan.\nSome of the information contained herein may include forward-looking statements about the expected investment activities of the funds. These statements provide no assurance as to the funds’ actual investment activities or results. The reader must make his/her own assessment of the information contained herein and consider such other factors as he/she may deem relevant to his/her individual circumstances.\n308776 1-18\nNOT FDIC INSURED • NO BANK GUARANTEE • MAY LOSE VALUE\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180131005181/en/\nShareholder inquiries, 1-800-730-6001\nFinancial advisor inquiries, 1-888-877-9275\nor\nMedia contact:\nSarah Kerr, 212-260-1582\nskerr@wellsfargo.com\nSource: Wells Fargo & Company", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.wellsfargofunds.com%2F&esheet=51751049&newsitemid=20180131005181&lan=en-US&anchor=visit+our+website&index=1&md5=5f4c499762e62faa9799d82390067bfa", "http://www.businesswire.com/news/home/20180131005181/en/"], "published": "2018-01-31T17:15:00.000+02:00", "crawled": "2018-01-31T18:49:37.003+02:00", "highlightTitle": ""}