{"organizations": [], "uuid": "db1d36fabaacab73fb32018fc870cdfd38736662", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-stanley-black-decker-reports-full-year-and-4q-2017-results.html", "country": "US", "domain_rank": 767, "title": "Stanley Black & Decker Reports Full Year And 4Q 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T14:00:00.000+02:00", "replies_count": 0, "uuid": "db1d36fabaacab73fb32018fc870cdfd38736662"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-stanley-black-decker-reports-full-year-and-4q-2017-results.html", "ord_in_thread": 0, "title": "Stanley Black & Decker Reports Full Year And 4Q 2017 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "conn.", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "stanley black & decker", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "nelson fastener systems", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW BRITAIN, Conn., Jan. 24, 2018 /PRNewswire/ -- Stanley Black & Decker (NYSE: SWK) today announced full year and fourth quarter 2017 financial results.\nFull Year Revenues Totaled $12.7 Billion, Up 12% Versus Prior Year, As 7% Organic Growth And 7% Growth From Acquisitions Were Partially Offset By The Sale Of The Mechanical Security Business Full Year Operating Margin Rate Was 14.1%; Excluding M&A Related Charges, Full Year Operating Margin Rate Expanded 40 Basis Points To A Record 14.8% Full Year Diluted GAAP EPS Was $8.04; Excluding M&A Related Charges, Full Year Diluted EPS Was $7.45, Up 14% Versus Prior Year, Reflecting Strong Operational Performance And Accretive Acquisitions 2017 Free Cash Flow Conversion Was Approximately 100% 4Q'17 Revenues Totaled $3.4 Billion, Up 17% Versus Prior Year, Including Robust Organic Growth Of 8% 4Q'17 Diluted GAAP EPS Was $1.84; Excluding M&A Related Charges, 4Q'17 Diluted EPS Was $2.18, Up 27% Versus Prior Year Signed Agreement To Acquire Nelson Fastener Systems ($200 Million Revenues) For $440 Million Expect 2018 Full Year Diluted GAAP EPS Of $7.80 To $8.00; Adjusted EPS Of $8.30 - $8.50, Up 11% - 14% Versus Prior Year; 2018 Free Cash Flow Conversion Expected To Approximate 100%\n4Q'17 Key Points:\nNet sales for the quarter were $3.4 billion, up 17% versus prior year, as acquisitions (+9%), volume (+9%) and currency (+3%) more than offset divestitures (-3%) and price (-1%). Gross margin rate for the quarter was 36.6%. Excluding charges, the gross margin rate was 36.7% compared to 36.9% in 4Q'16, as volume leverage and productivity were more than offset by the impact from the Mechanical Security business divestiture and continued commodity inflation. SG&A expenses were 23.2% of sales. Excluding charges, SG&A expenses were 22.9% of sales, down 50 basis points versus 4Q'16, as tight cost management offset the impact from investments in growth initiatives. Operating margin rate was 13.3%. Excluding charges, operating margin rate was 13.8%, a 30 basis point expansion versus 4Q'16. Restructuring charges for the quarter were $8.6 million. Excluding M&A related charges, restructuring charges for the quarter were $4.9 million compared to $21.7 million in 4Q'16. Tax rate was 17.8%, which reflects a one-time net charge of $23.6 million related to the recently enacted U.S. tax legislation. Excluding M&A related charges and one-time tax charge, tax rate was 9.4%, no change from 4Q'16. Average diluted shares outstanding for the quarter were 153.4 million versus 149.4 million a year ago, due primarily to share issuances in 4Q'16 associated with the Company's 2013 Equity Units. Working capital turns for the quarter were 8.9, down 1.7 turns from prior year as a result of recent acquisitions. Excluding acquisitions, turns were flat versus prior year.\nJames M. Loree, President & CEO, commented, \"Stanley Black & Decker delivered an impressive 2017, with strong execution aligned with our SFS 2.0 operating system. Our team delivered total growth of 12% with well above-market organic growth of 7%, 40 basis points of operating margin expansion, 14% earnings per share growth and solid free cash flow conversion. We achieved these excellent results while successfully integrating multiple acquisitions on or ahead of plan. We are particularly excited about the growth pipeline for 2018 and beyond which includes core innovation, the Craftsman brand rollout, Lenox and Irwin revenue synergies, FlexVolt, emerging markets and additional acquisitions such as Nelson Fastener Systems.\n\"We are expecting 2018 to be another strong year as our continued focus on SFS 2.0 and our solid growth pipeline position us to deliver sustained above-market organic growth with margin expansion. The team is energized by our company's purpose – 'For Those Who Make The World™' – to achieve our 22/22 vision and to strive to become known as one of the world's leading innovators, to deliver top-quartile financial performance and to demonstrate our commitment to social responsibility.\"\n4Q'17 Segment Results\n($ in M)\nSales\nProfit\nCharges 1\nProfit\nEx -\nCharges 1\nProfit\nRate\nProfi t Rate\nEx-\nCharges 1\nTools & Storage\n$2,430\n$391.9\n$13.6\n$405.5\n16.1%\n16.7%\nIndustrial\n$473\n$75.8\nN/A\n$75.8\n16.0%\n16.0%\nSecurity\n$510\n$55.5\n$1.1\n$56.6\n10.9%\n11.1%\n1 See Merger And Acquisition (M&A) Related Charges On Page 5\nTools & Storage net sales increased 26% versus 4Q'16 as acquisitions (+13%), volume (+12%) and currency (+2%) more than offset the impact from price to support holiday promotions (-1%). Organic growth was strong across all regions with emerging markets +17%, Europe +17% and North America +8%. The strong emerging market organic growth was supported by mid-price-point product releases, higher e-commerce volumes and benefits from changes to our distribution models in Russia & Turkey. All markets across Europe contributed to another quarter of above-market organic growth in that region, enabled by successful commercial actions and new product launches. North America growth was supported by share gains from strong commercial execution and market-leading innovation, including sales from the DEWALT FlexVolt system, as well as a healthy U.S. tool market. Overall Tools & Storage segment profit rate, excluding charges, was 16.7%, up 50 basis points versus 4Q'16 as volume leverage and productivity more than offset growth investments, price, and increased commodity inflation. Industrial net sales increased 4% versus 4Q'16 as volume (+2%) and currency (+3%) were moderated by divestitures (-1%). Engineered Fastening organic revenues increased 1% as automotive fastener penetration gains, which enabled growth in excess of light vehicle production, and strong volume growth in general industrial markets more than offset the impact from lower self-piercing rivet system shipments in automotive and lower volumes within electronics. Infrastructure organic revenues were up 8% on increased Hydraulic Tools volumes from successful commercial actions and supportive market conditions, as well as low-single digit growth within Oil & Gas from higher inspection and onshore project activity in North America. Overall Industrial segment profit rate was 16.0%, as volume leverage, productivity gains and cost control resulted in an 80 basis point expansion versus the 4Q'16 rate. Security net sales decreased 4% versus 4Q'16 as bolt-on commercial electronic security acquisitions (+4%), currency (+3%) and volume (+2%) were more than offset by the sale of the Mechanical Security business (-13%). North America expanded organically (+2%) on higher installation volumes within commercial electronic security and growth within healthcare. Europe organic growth (+1%) was due to strength within the UK and the Nordics partially offset by anticipated ongoing weakness in France. Overall Security segment profit rate of 11.1% was consistent with the prior two quarters. Versus the prior year, the rate reflects a decline of approximately 90 basis points related to the sale of the Mechanical Security business, as well as impacts from mix and funding growth investments.\nEngineered Fastening Acquisition\nOn December 22, 2017, the company reached an agreement to purchase the industrial business of Nelson Fastener Systems, which excludes Nelson's automotive stud welding business, for approximately $440 million in cash (LTM Revenue ~$200 million). Nelson enhances Engineered Fastening's presence in the general industrial end markets, expands its portfolio of highly engineered fastening solutions and will deliver cost synergies. The transaction is expected to be modestly accretive to 2018 earnings per share, excluding one-time charges. This transaction, which is subject to customary closing conditions including regulatory approval, is expected to close in the first half of 2018.\n2018 Outlook\nDonald Allan Jr., Executive Vice President and CFO, commented, \"2017 was a year of excellent operational execution as we delivered very strong financial results, while remaining focused on acquisition integrations, overcoming commodity and currency headwinds, successfully navigating dynamic end markets and investing for future growth. In 2018 we expect to generate another year of above-market organic growth of approximately 5% and adjusted earnings per share growth of 11% - 14% versus prior year.\"\nManagement expects its 2018 EPS to be $7.80 - $8.00 on a GAAP basis and $8.30 - $8.50 on an adjusted basis. Free cash flow conversion is expected to approximate 100%.\nThe following represents key 2018 adjusted EPS assumptions:\nOrganic growth of approximately 5% (+$0.50 to +$0.60 EPS) Commodity inflation of ~$150 million partially offset by price actions (approximately -$0.25 to -$0.30 EPS) Net impact from closed acquisitions, cost actions and improved productivity partially offset by higher share count (approximately +$0.45 to +$0.50 EPS) Tax rate to approximate 18% reflecting the recently enacted U.S. tax legislation (approximately +$0.20 EPS) Embedded core restructuring charges (~$50 million)\nAllan continued, \"While we expect 2018 to have its share of externally driven challenges, our strong day-to-day execution, ability to deliver robust innovation, and commitment to SFS 2.0 give us confidence in our ability to deliver solid organic growth, operating leverage and strong free cash flow conversion this year, consistent with our long-term financial objectives.\"\nMerger And Acquisition (\"M&A\") Related Charges\nTotal M&A related charges in 4Q'17 were $27.1 million, primarily related to restructuring, deal and integration costs, as well as non-cash inventory step-up charges. Gross margin included $4.3 million of these charges while SG&A included $10.9 million. Other, net and Restructuring included $7.2 million and $3.7 million, respectively, of these charges. In addition, a net $1.0 million loss was recorded in the quarter related to divestitures.\nThe Company will host a conference call with investors today, January 24, 2018, at 8:00 am ET. A slide presentation which will accompany the call will be available at www.stanleyblackanddecker.com and will remain available after the call.\nThe call will be accessible by telephone within the U.S. at (877) 930-8285, from outside the U.S. at +1 (253) 336-8297, and via the Internet at www.stanleyblackanddecker.com . To participate, please register on the website at least fifteen minutes prior to the call and download and install any necessary audio software. Please use the conference identification number 1779666. A replay will also be available two hours after the call and can be accessed at (855) 859-2056 or +1 (404) 537-3406 using the passcode 1779666. The replay will also be available as a podcast within 24 hours and can be accessed on our website and via iTunes.\nStanley Black & Decker, an S&P 500 company, is a diversified global provider of hand tools, power tools and related accessories, electronic security solutions, healthcare solutions, engineered fastening systems, and more. Learn more at www.stanleyblackanddecker.com .\nInvestor Contacts:\nDennis Lange\nVice President, Investor Relations\ndennis.lange@sbdinc.com\n(860) 827-3833\nMichelle Hards\nDirector, Investor Relations\nmichelle.hards@sbdinc.com\n(860) 827-3913\nMedia Contacts:\nShannon Lapierre\nVice President, Communications & Public Relations\nshannon.lapierre@sbdinc.com\n(860) 827-3575\nTim Perra\nVice President, Public Affairs\ntim.perra@sbdinc.com\n(860) 826-3260\nOrganic sales growth is defined as total sales growth less the sales of companies acquired and divested in the past twelve months and any foreign currency impacts. Operating margin is defined as sales less cost of sales and selling, general and administrative expenses. Management uses operating margin and its percentage of net sales as key measures to assess the performance of the Company as a whole, as well as the related measures at the segment level. Free cash flow is defined as cash flow from operations less capital and software expenditures. Management considers free cash flow an important indicator of its liquidity, as well as its ability to fund future growth and to provide a return to the shareowners. Free cash flow does not include deductions for mandatory debt service, other borrowing activity, discretionary dividends on the Company's common stock and business acquisitions, among other items. Free cash flow conversion is defined as free cash flow divided by net income, excluding the gain or loss on the sales of businesses. The normalized statement of operations and business segment information, as reconciled to GAAP on pages 12 and 13 for 2017, is considered relevant to aid analysis of the Company's margin and earnings results aside from the material impact of the acquisition-related charges, gain or loss on the sales of businesses and a one-time net tax charge related to the recently enacted U.S. tax legislation.\nCAUTIONARY STATEMENTS\nUnder the Private Securities Litigation Reform Act of 1995\nStatements in this press release that are not historical, including but not limited to those regarding the Company's ability to: (i) achieve full year 2018 GAAP EPS of $7.80 – $8.00 and Adjusted EPS of $8.30 - $8.50; (ii) generate 2018 free cash flow conversion approximating 100%; (iii) achieve its 22/22 vision of doubling the size of the Company by 2022 while expanding its margin rate; and (iv) deliver solid organic growth with operating leverage, earnings per share expansion and free cash flow conversion in 2018 consistent with its long-term financial objectives, (collectively, the \"Results\"); are \"forward-looking statements\" and subject to risk and uncertainty.\nThe Company's ability to deliver the Results as described above is based on current expectations and involves inherent risks and uncertainties, including factors listed below and other factors that could delay, divert, or change any of them, and could cause actual outcomes and results to differ materially from current expectations. In addition to the risks, uncertainties and other factors discussed in this press release, the risks, uncertainties and other factors that could cause or contribute to actual results differing materially from those expressed or implied in the forward-looking statements include, without limitation, those set forth under Item 1A Risk Factors of the Company's Annual Report on Form 10-K and any material changes thereto set forth in any subsequent Quarterly Reports on Form 10-Q, or those contained in the Company's other filings with the Securities and Exchange Commission, and those set forth below.\nThe Company's ability to deliver the Results is dependent, or based, upon: (i) the Company's ability to deliver successful innovation in its products and services; (ii) the Company's ability to invest in product, brand and commercialization of the Craftsman brand and to successfully integrate Newell Tools while remaining focused on its diversified industrial portfolio strategy; (iii) the Company's ability to deliver overall organic growth of approximately 5.0% in 2018; (iv) limit the impact from commodity inflation of approximately $150 million, partially offset by price actions to -$.25 to -$0.30 EPS in 2018; (v) net impact from closed acquisitions, cost actions and improved productivity partially offset by higher share count being approximately +$0.45 to +$0.50 EPS in 2018; (vi) core (non M&A) restructuring charges being approximately $50 million in 2018; (vii) 2018 tax rate being approximately 18%; (viii) the Company's ability to identify, close and integrate appropriate acquisition opportunities, within desired timeframes at reasonable cost; (ix) successful integration of existing and any newly acquired businesses and formation of new business platforms; (x) the continued acceptance of technologies used in the Company's products and services, including DEWALT FLEXVOLT™ product; (xi) the Company's ability to manage existing Sonitrol franchisee and MAC Tools relationships; (xii) the Company's ability to minimize costs associated with any sale or discontinuance of a business or product line, including any severance, restructuring, legal or other costs; (xiii) the proceeds realized with respect to any business or product line disposals; (xiv) the extent of any asset impairments with respect to any businesses or product lines that are sold or discontinued; (xv) the success of the Company's efforts to manage freight costs, steel and other commodity costs as well as capital expenditures; (xvi) the Company's ability to sustain or increase prices in order to, among other things, offset or mitigate the impact of steel, freight, energy, non-ferrous commodity and other commodity costs and any inflation increases and/or currency impacts; (xvii) the Company's ability to generate free cash flow and maintain a strong debt to capital ratio; (xviii) the Company's ability to identify and effectively execute productivity improvements and cost reductions, while minimizing any associated restructuring charges; (xix) the Company's ability to obtain favorable settlement of tax audits; (xx) the ability of the Company to generate earnings sufficient to realize future income tax benefits during periods when temporary differences become deductible; (xxi) the continued ability of the Company to access credit markets under satisfactory terms; (xxii) the Company's ability to negotiate satisfactory price and payment terms under which the Company buys and sells goods, services, materials and products; and (xxiii) the Company's ability to successfully develop, market and achieve sales from new products and services. (xxiv) the impact of the enacted U.S. Tax Cuts and Jobs Act on the provisional estimate recorded in 2017 based on legislative developments and refined calculations.\nThe Company's ability to deliver the Results is also dependent upon: (i) the success of the Company's marketing and sales efforts, including the ability to develop and market new and innovative products at the right price points in both existing and new markets; (ii) the ability of the Company to maintain or improve production rates in the Company's manufacturing facilities, respond to significant changes in product demand and fulfill demand for new and existing products; (iii) the Company's ability to continue improvements in working capital through effective management of accounts receivable and inventory levels; (iv) the ability to continue successfully managing and defending claims and litigation; (v) the success of the Company's efforts to mitigate any adverse earnings impact resulting from, for example, increases in the cost of energy or significant Chinese Renminbi, Canadian Dollar, Euro, British Pound, Brazilian Real or other currency fluctuations; (vi) the geographic distribution of the Company's earnings; (vii) the commitment to and success of the Stanley Fulfillment System including, core innovation, breakthrough innovation, digital and commercial excellence and functional transformation; and (viii) successful implementation with expected results of cost reduction programs.\nThe Company's ability to achieve the Results will also be affected by external factors. These external factors include: challenging global geopolitical and macroeconomic environment, possibly including impact from \"Brexit\" or other similar actions from other EU member states; the economic environment of emerging markets, particularly Latin America, Russia, China and Turkey; pricing pressure and other changes within competitive markets; the continued consolidation of customers particularly in consumer channels; inventory management pressures on the Company's customers; the impact the tightened credit markets may have on the Company or its customers or suppliers; the extent to which the Company has to write-off accounts receivable or assets or experiences supply chain disruptions in connection with bankruptcy filings by customers or suppliers; increasing competition; changes in laws, regulations and policies that affect the Company, including, but not limited to trade, monetary, tax and fiscal policies and laws; the timing and extent of any inflation or deflation; the impact of poor weather conditions on sales; currency exchange fluctuations; the impact of dollar/foreign currency exchange and interest rates on the competitiveness of products and the Company's debt program; the strength of the U.S. and European economies; the impact from demand changes within world-wide markets associated with homebuilding and remodeling; the impact of events that cause or may cause disruption in the Company's supply, manufacturing, distribution and sales networks such as war, terrorist activities, and political unrest, including hostilities on the Korean Peninsula; and recessionary or expansive trends in the economies of the world in which the Company operates. The Company undertakes no obligation to publicly update or revise any forward-looking statements to reflect events or circumstances that may arise after the date hereof.\nSTANLEY BLACK & DECKER, INC. AND SUBSIDIARIES\nCONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS\n(Unaudited, Millions of Dollars Except Per Share Amounts)\nFOURTH QUARTER\nYEAR-TO-DATE\n2017\n2016\n2017\n2016\nNET SALES\n$ 3,413.5\n$ 2,920.4\n$ 12,747.2\n$ 11,406.9\nCOSTS AND EXPENSES\nCost of sales\n2,165.1\n1,843.8\n7,969.2\n7,139.7\nGross margin\n1,248.4\n1,076.6\n4,778.0\n4,267.2\n% of Net Sales\n36.6%\n36.9%\n37.5%\n37.4%\nSelling, general and administrative\n793.3\n683.8\n2,980.1\n2,623.9\n% of Net Sales\n23.2%\n23.4%\n23.4%\n23.0%\nOperating margin\n455.1\n392.8\n1,797.9\n1,643.3\n% of Net Sales\n13.3%\n13.5%\n14.1%\n14.4%\nOther - net\n57.7\n46.3\n289.7\n196.9\nLoss (gain) on sales of businesses\n1.0\n-\n(264.1)\n-\nPension settlement\n(0.6)\n-\n12.2\n-\nRestructuring charges\n8.6\n21.7\n51.5\n49.0\nIncome from operations\n388.4\n324.8\n1,708.6\n1,397.4\nInterest - net\n46.6\n42.5\n182.5\n171.3\nEARNINGS BEFORE INCOME TAXES\n341.8\n282.3\n1,526.1\n1,226.1\nIncome taxes\n60.7\n26.5\n300.5\n261.2\nNET EARNINGS\n281.1\n255.8\n1,225.6\n964.9\nLess: net (loss) earnings attributable to non-controlling interests\n(0.4)\n0.3\n(0.4)\n(0.4)\nNET EARNINGS ATTRIBUTABLE TO COMMON SHAREOWNERS\n$ 281.5\n$ 255.5\n$ 1,226.0\n$ 965.3\nEARNINGS PER SHARE OF COMMON STOCK\nBasic\n$ 1.88\n$ 1.74\n$ 8.19\n$ 6.61\nDiluted\n$ 1.84\n$ 1.71\n$ 8.04\n$ 6.51\nDIVIDENDS PER SHARE\n$ 0.63\n$ 0.58\n$ 2.42\n$ 2.26\nWEIGHTED-AVERAGE SHARES OUTSTANDING (in thousands)\nBasic\n150,080\n147,145\n149,629\n146,041\nDiluted\n153,412\n149,440\n152,449\n148,207\nSTANLEY BLACK & DECKER, INC. AND SUBSIDIARIES\nCONDENSED CONSOLIDATED BALANCE SHEETS\n(Unaudited, Millions of Dollars)\nDecember 30,\nDecember 31,\n2017\n2016\nASSETS\nCash and cash equivalents\n$ 637.5\n$ 1,131.8\nAccounts and notes receivable, net\n1,635.9\n1,302.8\nInventories, net\n2,018.4\n1,478.0\nAssets held for sale\n-\n523.4\nOther current assets\n274.3\n352.5\nTotal current assets\n4,566.1\n4,788.5\nProperty, plant and equipment, net\n1,742.5\n1,451.2\nGoodwill and other intangibles, net\n12,283.5\n8,993.5\nOther assets\n487.8\n401.7\nTotal assets\n$ 19,079.9\n$ 15,634.9\nLIABILITIES AND SHAREOWNERS' EQUITY\nShort-term borrowings\n$ 5.3\n$ 4.3\nCurrent maturities of long-term debt\n983.4\n7.8\nAccounts payable\n2,021.0\n1,640.4\nAccrued expenses\n1,352.1\n1,101.5\nLiabilities held for sale\n-\n53.5\nTotal current liabilities\n4,361.8\n2,807.5\nLong-term debt\n2,843.0\n3,815.3\nOther long-term liabilities\n3,575.2\n2,638.5\nStanley Black & Decker, Inc. shareowners' equity\n8,297.1\n6,367.0\nNon-controlling interests' equity\n2.8\n6.6\nTotal liabilities and shareowners' equity\n$ 19,079.9\n$ 15,634.9\nSTANLEY BLACK & DECKER, INC. AND SUBSIDIARIES\nSUMMARY OF CASH FLOW ACTIVITY\n(Unaudited, Millions of Dollars)\nFOURTH QUARTER\nYEAR-TO-DATE\n2017\n2016\n2017\n2016\nOPERATING ACTIVITIES\nNet earnings\n$ 281.1\n$ 255.8\n$ 1,225.6\n$ 964.9\nDepreciation and amortization\n122.7\n102.8\n460.7\n408.0\nLoss (gain) on sales of businesses\n1.0\n-\n(264.1)\n-\nChanges in working capital 1\n523.1\n450.5\n(261.1)\n57.2\nOther\n22.9\n26.1\n257.5\n55.1\nNet cash provided by operating activities\n950.8\n835.2\n1,418.6\n1,485.2\nINVESTING AND FINANCING ACTIVITIES\nCapital and software expenditures\n(164.5)\n(125.3)\n(442.4)\n(347.0)\nPremium paid on equity option\n-\n-\n(25.1)\n-\nProceeds from issuances of common stock\n43.3\n367.2\n90.8\n418.5\nProceeds from issuance of preferred stock\n-\n-\n727.5\n-\nProceeds from sales of businesses, net of cash sold\n11.6\n24.0\n756.9\n24.0\nBusiness acquisitions, net of cash acquired\n(19.0)\n-\n(2,601.1)\n(59.3)\nNet short-term (repayments) borrowings\n(575.9)\n(90.5)\n(76.7)\n1.9\nNet investment hedge settlements\n8.3\n41.4\n(23.3)\n104.7\nNon-controlling interest buyouts\n-\n(12.5)\n(3.2)\n(12.5)\nCash dividends on common stock\n(95.0)\n(87.0)\n(362.9)\n(330.9)\nCash settlement on forward stock purchase contract\n-\n(147.4)\n-\n(147.4)\nPurchases of common stock for treasury\n(12.5)\n(11.4)\n(28.7)\n(374.1)\nEffect of exchange rate changes on cash\n(0.5)\n(78.9)\n81.0\n(101.7)\nOther\n7.6\n(3.8)\n(5.7)\n5.0\nNet cash used in investing and financing activities\n(796.6)\n(124.2)\n(1,912.9)\n(818.8)\nIncrease (Decrease) in Cash and Cash Equivalents\n154.2\n711.0\n(494.3)\n666.4\nCash and Cash Equivalents, Beginning of Period\n483.3\n420.8\n1,131.8\n465.4\nCash and Cash Equivalents, End of Period\n$ 637.5\n$ 1,131.8\n$ 637.5\n$ 1,131.8\nFree Cash Flow Computation 2\nOperating cash flow\n$ 950.8\n$ 835.2\n$ 1,418.6\n$ 1,485.2\nLess: Capital and software expenditures\n(164.5)\n(125.3)\n(442.4)\n(347.0)\nFree cash flow (before dividends)\n$ 786.3\n$ 709.9\n$ 976.2\n$ 1,138.2\n1\nWorking capital is comprised of accounts receivable, inventory, accounts payable and deferred revenue.\n2\nFree cash flow is defined as cash flow from operations less capital and software expenditures. Management considers free cash flow an important measure of its liquidity, as well as its ability to fund future growth and to provide a return to the shareowners. Free cash flow does not include deductions for mandatory debt service, other borrowing activity, discretionary dividends on the Company's common stock and business acquisitions, among other items.\nSTANLEY BLACK & DECKER, INC. AND SUBSIDIARIES\nBUSINESS SEGMENT INFORMATION\n(Unaudited, Millions of Dollars)\nFOURTH QUARTER\nYEAR-TO-DATE\n2017\n2016\n2017\n2016\nNET SALES\nTools & Storage\n$ 2,430.2\n$ 1,933.8\n$ 8,862.4\n$ 7,469.2\nIndustrial\n473.5\n453.8\n1,946.0\n1,840.3\nSecurity\n509.8\n532.8\n1,938.8\n2,097.4\nTotal\n$ 3,413.5\n$ 2,920.4\n$ 12,747.2\n$ 11,406.9\nSEGMENT PROFIT\nTools & Storage\n$ 391.9\n$ 312.4\n$ 1,450.1\n$ 1,266.9\nIndustrial\n75.8\n69.2\n352.3\n304.4\nSecurity\n55.5\n69.9\n212.3\n269.2\nSegment Profit\n523.2\n451.5\n2,014.7\n1,840.5\nCorporate Overhead\n(68.1)\n(58.7)\n(216.8)\n(197.2)\nTotal\n$ 455.1\n$ 392.8\n$ 1,797.9\n$ 1,643.3\nSegment Profit as a Percentage of Net Sales\nTools & Storage\n16.1%\n16.2%\n16.4%\n17.0%\nIndustrial\n16.0%\n15.2%\n18.1%\n16.5%\nSecurity\n10.9%\n13.1%\n11.0%\n12.8%\nSegment Profit\n15.3%\n15.5%\n15.8%\n16.1%\nCorporate Overhead\n(2.0%)\n(2.0%)\n(1.7%)\n(1.7%)\nTotal\n13.3%\n13.5%\n14.1%\n14.4%\nSTANLEY BLACK & DECKER, INC. AND SUBSIDIARIES\nRECONCILIATION OF GAAP EARNINGS FINANCIAL MEASURES TO CORRESPONDING\nNON-GAAP FINANCIAL MEASURES\n(Unaudited, Millions of Dollars Except Per Share Amounts)\nFOURTH QUARTER 2017\nYEAR-TO-DATE 2017\nReported\nAcquisition-\nRelated\nCharges &\nOther 1\nNormalized 2\nFOURTH\nQUARTER\n2016\nReported\nAcquisition-\nRelated\nCharges &\nOther 1\nNormalized 2\nYEAR-TO-\nDATE 2016\nGross margin\n$ 1,248.4\n$ 4.3\n$ 1,252.7\n$ 1,076.6\n$ 4,778.0\n$ 46.8\n$ 4,824.8\n$ 4,267.2\n% of Net Sales\n36.6%\n36.7%\n36.9%\n37.5%\n37.8%\n37.4%\nSelling, general and administrative\n793.3\n(10.9)\n$ 782.4\n$ 683.8\n2,980.1\n(37.7)\n$ 2,942.4\n$ 2,623.9\n% of Net Sales\n23.2%\n22.9%\n23.4%\n23.4%\n23.1%\n23.0%\nOperating margin\n455.1\n15.2\n470.3\n392.8\n1,797.9\n84.5\n1,882.4\n1,643.3\n% of Net Sales\n13.3%\n13.8%\n13.5%\n14.1%\n14.8%\n14.4%\nEarnings before income taxes\n341.8\n27.1\n368.9\n282.3\n1,526.1\n(107.8)\n1,418.3\n1,226.1\nIncome taxes\n60.7\n(26.1)\n34.6\n26.5\n300.5\n(17.3)\n283.2\n261.2\nNet earnings attributable to common shareowners\n281.5\n53.2\n334.7\n255.5\n1,226.0\n(90.5)\n1,135.5\n965.3\nDiluted earnings per share of common stock\n$ 1.84\n$ 0.34\n$ 2.18\n$ 1.71\n$ 8.04\n$ (0.59)\n$ 7.45\n$ 6.51\n1\nAcquisition-related charges and other relates primarily to inventory step-up, integration and consulting costs, gains or losses on sales of businesses, and a one-time net tax charge related to the recently enacted U.S. tax legislation.\n2\nThe normalized 2017 information, as reconciled to GAAP above, is considered relevant to aid analysis of the Company's margin and earnings results aside from the material impact of the acquisition-related charges, gains or losses on sales of businesses, and a one-time net tax charge related to the recently enacted U.S. tax legislation.\nSTANLEY BLACK & DECKER, INC. AND SUBSIDIARIES\nRECONCILIATION OF GAAP SEGMENT PROFIT FINANCIAL MEASURES TO CORRESPONDING\nNON-GAAP FINANCIAL MEASURES\n(Unaudited, Millions of Dollars)\nFOURTH QUARTER 2017\nYEAR-TO-DATE 2017\nReported\nAcquisition-\nRelated\nCharges 1\nNormalized 2\nFOURTH\nQUARTER\n2016\nReported\nAcquisition-\nRelated\nCharges 1\nNormalized 2\nYEAR-TO-\nDATE\n2016\nSEGMENT PROFIT\nTools & Storage\n$ 391.9\n$ 13.6\n$ 405.5\n$ 312.4\n$ 1,450.1\n$ 81.8\n$ 1,531.9\n$ 1,266.9\nIndustrial\n75.8\n-\n75.8\n69.2\n352.3\n-\n352.3\n304.4\nSecurity\n55.5\n1.1\n56.6\n69.9\n212.3\n2.0\n214.3\n269.2\nSegment Profit\n523.2\n14.7\n537.9\n451.5\n2,014.7\n83.8\n2,098.5\n1,840.5\nCorporate Overhead\n(68.1)\n0.5\n(67.6)\n(58.7)\n(216.8)\n0.7\n(216.1)\n(197.2)\nTotal\n$ 455.1\n$ 15.2\n$ 470.3\n$ 392.8\n$ 1,797.9\n$ 84.5\n$ 1,882.4\n$ 1,643.3\nSegment Profit as a Percentage of Net Sales\nTools & Storage\n16.1%\n16.7%\n16.2%\n16.4%\n17.3%\n17.0%\nIndustrial\n16.0%\n16.0%\n15.2%\n18.1%\n18.1%\n16.5%\nSecurity\n10.9%\n11.1%\n13.1%\n11.0%\n11.1%\n12.8%\nSegment Profit\n15.3%\n15.8%\n15.5%\n15.8%\n16.5%\n16.1%\nCorporate Overhead\n(2.0%)\n(2.0%)\n(2.0%)\n(1.7%)\n(1.7%)\n(1.7%)\nTotal\n13.3%\n13.8%\n13.5%\n14.1%\n14.8%\n14.4%\n1\nAcquisition-related charges relate primarily to inventory step-up, integration and consulting costs.\n2\nThe normalized 2017 business segment information, as reconciled to GAAP above, is considered relevant to aid analysis of the Company's segment profit results aside from the material impact of the acquisition-related charges.\nView original content with multimedia: http://www.prnewswire.com/news-releases/stanley-black--decker-reports-full-year-and-4q-2017-results-300587226.html\nSOURCE Stanley Black & Decker", "external_links": ["http://www.stanleyblackanddecker.com/", "http://www.prnewswire.com/news-releases/stanley-black--decker-reports-full-year-and-4q-2017-results-300587226.html"], "published": "2018-01-24T14:00:00.000+02:00", "crawled": "2018-01-24T15:09:57.006+02:00", "highlightTitle": ""}