{"organizations": [], "uuid": "319cce5ec59a10237506b256b749f3db7f9cf72a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-guaranty-bancshares-inc-to-acquire-westbound-bank.html", "country": "US", "domain_rank": 767, "title": "Guaranty Bancshares, Inc. to Acquire Westbound Bank", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-29T16:30:00.000+02:00", "replies_count": 0, "uuid": "319cce5ec59a10237506b256b749f3db7f9cf72a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-guaranty-bancshares-inc-to-acquire-westbound-bank.html", "ord_in_thread": 0, "title": "Guaranty Bancshares, Inc. to Acquire Westbound Bank", "locations": [], "entities": {"persons": [{"name": "katy", "sentiment": "none"}, {"name": "ty abston", "sentiment": "none"}, {"name": "westbound", "sentiment": "none"}], "locations": [{"name": "texas", "sentiment": "none"}, {"name": "conroe", "sentiment": "none"}, {"name": "bellaire", "sentiment": "none"}, {"name": "bellaire boulevard", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}, {"name": "westbound", "sentiment": "none"}, {"name": "w. grand parkway south", "sentiment": "none"}], "organizations": [{"name": "acquire westbound bank mount pleasant", "sentiment": "negative"}, {"name": "guaranty bancshares, inc.", "sentiment": "neutral"}, {"name": "houston-area westbound bank", "sentiment": "none"}, {"name": "board", "sentiment": "none"}, {"name": "guaranty", "sentiment": "none"}, {"name": "westbound bank", "sentiment": "none"}, {"name": "guaranty bank & trust", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MOUNT PLEASANT, Texas, Jan. 29, 2018 (GLOBE NEWSWIRE) -- Guaranty Bancshares, Inc. (NASDAQ:GNTY), the holding company for Guaranty Bank & Trust, N.A., announced today the execution of a definitive agreement under which Guaranty will acquire Houston-area Westbound Bank. Pursuant to the agreement, Westbound will be merged with and into Guaranty Bank & Trust.\nAs Guaranty further expands its Texas banking franchise into the Houston metropolitan region, it will continue to operate Westbound’s four locations located at 655 W. Grand Parkway South, Katy, 5231 Bellaire Boulevard, Bellaire, 15001 FM 529, Houston, and 244 South Loop 336 W., Conroe. As of December 31, 2017, Westbound Bank reported total assets of $228.0 million, total loans of $160.3 million and total deposits of $188.5 million.\nTy Abston, Chairman of the Board and Chief Executive Officer of Guaranty, said, “We are pleased to announce our first acquisition into the dynamic Houston market. Our expansion into this growing region has been a part of our strategy for several years, and Westbound brings to us a proven team and excellent initial footprint to make that happen. Troy England, Westbound’s CEO, will become Houston Area Chairman for Guaranty and lead our Houston MSA expansion efforts. He’s a proven leader in the Houston market and we are excited to have Troy join our management team.”\nTroy England, President and Chief Executive Officer of Westbound stated, “Joining an established and growing Texas community bank organization like Guaranty is an opportunity to better serve our customers and market, while continuing our focus on community banking and local decision making. Guaranty offers an expanded array of products and services, as well as the convenience of a state-wide banking network. Guaranty’s community banking model and asset size will truly enhance our customer’s banking experience. I am looking forward to joining Guaranty in my new leadership role.”\nUnder the terms of the agreement, Guaranty Bancshares, Inc., will issue 900,000 shares of its common stock and pay cash in the aggregate amount of $6.4 million to the shareholders and option holders of Westbound, subject to certain potential adjustments. If Westbound’s tangible equity is greater than $16.5 million at closing, Westbound will be permitted to pay a pre-closing cash distribution to its shareholders and option holders in an amount equal to any excess.\nThe boards of directors of both companies have approved the agreement and proposed transaction, which is expected to close in the second quarter of 2018, subject to certain conditions, including customary regulatory approvals and approval by the Westbound shareholders. Upon the closing of this transaction, Guaranty’s total assets will be over $2.2 billion, while operating 32 locations in 24 Texas markets.\nGuaranty Bancshares, Inc. was advised in this transaction by Sandler O’Neill + Partners, LP as financial advisor and Fenimore, Kay, Harrison & Ford, LLP as legal counsel. Westbound Bank was advised by The Bank Advisory Group, LLC as financial advisor and Hunton & Williams, LLP as legal counsel\nAbout Guaranty Bancshares\nGuaranty Bancshares, Inc. is a bank holding company that conducts commercial banking activities through its wholly-owned subsidiary, Guaranty Bank & Trust, N.A. One of the oldest regional community banks in Texas, Guaranty Bank & Trust provides its customers with a full array of relationship-driven commercial and consumer banking products and services, as well as mortgage, trust, and wealth management products and services. Guaranty Bank & Trust has 28 banking locations across 20 Texas communities located within the East Texas, Dallas/Fort Worth and Central Texas regions of the state. As of December 31, 2017, Guaranty had total assets of $2.0 billion, total loans of $1.4 billion and total deposits of $1.7 billion. Visit www.gnty.com for more information.\nNo Offer or Solicitation\nThis press release does not constitute an offer to sell, a solicitation of an offer to sell, or the solicitation or an offer to buy any securities. There will be no sale of securities in any jurisdiction in which such an offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction. No offer of securities shall be made except by means of a prospectus meeting the requirement of Section 10 of the Securities Act of 1933, as amended.\nForward Looking Statements\nThis communication contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements reflect our current views with respect to, among other things, future events and our results of operations, financial condition and financial performance. These statements are often, but not always, made through the use of words or phrases such as “may,” “should,” “could,” “predict,” “potential,” “believe,” “will likely result,” “expect,” “continue,” “will,” “anticipate,” “seek,” “estimate,” “intend,” “plan,” “projection,” “would” and “outlook,” or the negative version of those words or other comparable words of a future or forward-looking nature. These forward-looking statements are not historical facts, and are based on current expectations, estimates and projections about our industry, management’s beliefs and certain assumptions made by management, many of which, by their nature, are inherently uncertain and beyond our control. Accordingly, we caution you that any such forward-looking statements are not guarantees of future performance and are subject to risks, assumptions and uncertainties that are difficult to predict. Although we believe that the expectations reflected in these forward-looking statements are reasonable as of the date made, actual results may prove to be materially different from the results expressed or implied by the forward-looking statements. Such factors include, without limitation, the “Risk Factors” referenced in our Registration Statement on Form S-1 filed with the Securities and Exchange Commission, other risks and uncertainties listed from time to time in our reports and documents filed with the SEC, including our Annual Reports on Form 10-K and Quarterly Reports on Form 10-Q, and the following factors: business and economic conditions generally and in the financial services industry, nationally and within our current and future geographic market areas; economic, market, operational, liquidity, credit and interest rate risks associated with our business; the composition of our loan portfolio, including deteriorating asset quality and higher loan charge-offs; the laws and regulations applicable to our business; our ability to achieve organic loan and deposit growth and the composition of such growth; increased competition in the financial services industry, nationally, regionally or locally; our ability to maintain our historical earnings trends; our ability to raise additional capital to execute our business plan; acquisitions and integrations of acquired businesses; systems failures or interruptions involving our information technology and telecommunications systems or third-party servicers; the composition of our management team and our ability to attract and retain key personnel; the fiscal position of the U.S. federal government and the soundness of other financial institutions; and the amount of nonperforming and classified assets we hold. We can give no assurance that any goal or plan or expectation set forth in forward-looking statements can be achieved and readers are cautioned not to place undue reliance on such statements. The forward-looking statements are made as of the date of this communication, and we do not intend, and assume no obligation, to update any forward-looking statement to reflect events or circumstances after the date on which the statement is made or to reflect the occurrence of unanticipated events or circumstances, except as required by applicable law.\nAdditional Information about the Merger and Where to Find It\nIn connection with the proposed acquisition of Westbound Bank, Guaranty Bancshares, Inc. will file with the Securities and Exchange Commission a registration statement on Form S-4 to register the shares of Guaranty Bancshares, Inc.’s common stock to be issued to the shareholders of Westbound Bank. The registration statement will include a proxy statement/prospectus which will be sent to the shareholders of Westbound Bank seeking their approval of the proposed transaction.\nWE URGE INVESTORS AND SECURITY HOLDERS TO READ THE REGISTRATION STATEMENT ON FORM S-4, THE PROXY STATEMENT/PROSPECTUS INCLUDED WITHIN THE REGISTRATION STATEMENT ON FORM S-4 AND ANY OTHER RELEVANT DOCUMENTS FILED OR TO BE FILED WITH THE SECURITIES AND EXCHANGE COMMISSION IN CONNECTION WITH THE PROPOSED TRANSACTION BECAUSE THESE DOCUMENTS DO AND WILL CONTAIN IMPORTANT INFORMATION ABOUT GUARANTY BANCSHARES, INC., WESTBOUND BANK, AND THE PROPOSED TRANSACTION.\nInvestors and security holders may obtain copies of these documents free of charge through the website maintained by the Securities and Exchange Commission at www.sec.gov or from Guaranty Bancshares, Inc. at its website, www.gnty.com . Documents filed with the Securities and Exchange Commission by Guaranty Bancshares, Inc. will be available free of charge by directing a request by telephone or mail to Guaranty Bancshares, Inc., 201 South Jefferson Avenue, Mt. Pleasant, Texas 75455, 903-572-9881.\nParticipants in the Transaction\nGuaranty Bancshares, Inc., Westbound Bank and certain of their respective directors and executive officers may be deemed to be participants in the solicitation of proxies from the shareholders of Westbound Bank in connection with the proposed transaction. Certain information regarding the interests of these participants and a description of their direct and indirect interests, by security holdings or otherwise, will be included in the proxy statement/prospectus regarding the proposed transaction when it becomes available. Additional information about Guaranty Bancshares, Inc., and its directors and officers may be found in its registration statement on Form S-1 filed with the Securities and Exchange Commission. The definitive proxy statement can be obtained free of charge from the sources described above.\nMedia/Investors Contact:\nCappy Payne\nSenior Executive Vice President & CFO\nGuaranty Bancshares, Inc.\n1-888-572-9881\nInvestors@gnty.com\nSource:Guaranty Bancshares, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=fqCQb9A2SEkY9EsWfxYSH2ULCdBCC8zr07Xu0AJsRJnqoJvKHR9Fwffelfvgs8fDeThecrE5gqLl6cd78xYnqw==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/aefe4ce9-02dc-4276-bce3-31ea553c15f6"], "published": "2018-01-29T16:30:00.000+02:00", "crawled": "2018-01-29T19:25:44.004+02:00", "highlightTitle": ""}