{"organizations": [], "uuid": "6e673db2ad1138b4392e9ced2f3939b346fb7ea9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-foundation-medicine-reports-preliminary-2017-results.html", "country": "US", "domain_rank": 767, "title": "Foundation Medicine Reports Preliminary 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.984, "site_type": "news", "published": "2018-01-08T14:30:00.000+02:00", "replies_count": 0, "uuid": "6e673db2ad1138b4392e9ced2f3939b346fb7ea9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-foundation-medicine-reports-preliminary-2017-results.html", "ord_in_thread": 0, "title": "Foundation Medicine Reports Preliminary 2017 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "cambridge", "sentiment": "none"}], "organizations": [{"name": "foundation medicine reports preliminary 2017 results", "sentiment": "negative"}, {"name": "fda", "sentiment": "none"}, {"name": "foundation medicine", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Reports Total Revenue of Approximately $152.9 Million, a 31% Year Over Year Increase; Reports 67,375 Clinical Tests in 2017, a 54% Year Over Year Increase\nIncreases Biopharma Revenue Approximately 27% Year-Over-Year with New and Expanded Collaborations\nAchieves Significant Milestone with FDA Approval and Preliminary National Coverage Determination (NCD) for FoundationOne CDx™\nCAMBRIDGE, Mass.--(BUSINESS WIRE)-- Foundation Medicine (NASDAQ:FMI) today announced preliminary unaudited total revenue of approximately $48.9 million for the fourth quarter of 2017 and approximately $152.9 million for the full year ended December 31, 2017, representing a 70% and 31% increase from the $28.8 million and $116.9 million recorded in the fourth quarter and full year ended December 31, 2016, respectively.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180108005713/en/\n“2017 was a year of significant milestones for Foundation Medicine, including posting record revenue and achieving our largest annual increase in recorded clinical volume,” stated Troy Cox, chief executive officer of Foundation Medicine. “Our most notable achievement was the successful completion of the parallel review process during the fourth quarter which culminated with FDA approval and a preliminary National Coverage Determination (NCD) for FoundationOne CDx™ from CMS. This approval and preliminary NCD are transformational for our company, clinicians, biopharma partners and most importantly, for patients with advanced cancer, as we continue to meaningfully improve access to personalized cancer care.”\nRevenue from biopharmaceutical companies is expected to be approximately $33.4 million in the fourth quarter of 2017 and approximately $99.7 million for the full year ended December 31, 2017, compared to $19.0 million and $78.8 million in the fourth quarter and full year ended December 31, 2016, respectively. The company reported 6,206 tests to biopharmaceutical customers in this year’s fourth quarter.\nRevenue from clinical testing is expected to be approximately $15.5 million in the fourth quarter of 2017 and approximately $53.1 million for the full year ended December 31, 2017, compared to $9.8 million and $38.1 million in the fourth quarter and full year ended December 31, 2016, respectively. The company reported 20,044 clinical tests to ordering physicians in the fourth quarter of 2017, compared to a total of 12,788 tests reported during the fourth quarter of 2016, an increase of 57%. A total of 67,375 clinical tests were reported to ordering physicians for the full year ended December 31, 2017, compared to 43,686 clinical tests reported in 2016, an increase of 54%.\nBased on the new revenue reporting the company initiated during 2017, Molecular Information Services revenue is expected to be approximately $37.4 million in the fourth quarter of 2017 and approximately $117.1 million for the full year ended December 31, 2017, compared to $20.4 million and $81.8 million in the fourth quarter and full year ended December 31, 2016, respectively. Pharma Research and Development Services revenue is expected to be approximately $11.5 million in the fourth quarter of 2017 and approximately $35.8 million for the full year ended December 31, 2017, compared to $8.4 million and $35.1 million in the fourth quarter and full year ended December 31, 2016, respectively.\nCash and cash equivalents at December 31, 2017 was approximately $71.4 million, including $30 million in new borrowings received during the fourth quarter under the company’s Credit Facility Agreement with Roche Finance.\n2017 Enterprise Highlights:\nReceived approval from the U.S. Food & Drug Administration (FDA) under the parallel review process for FoundationOne CDx, the first broad genomic profiling test incorporating multiple companion diagnostics. Simultaneously, the Centers for Medicare and Medicaid Services (CMS) issued a preliminary NCD for FoundationOne CDx, which is expected to improve access to molecular information for personalized healthcare. The NCD is expected to be finalized during the first quarter of 2018. Grew the biopharma business with new and expanded collaborations for molecular information solutions including companion diagnostics, molecular profiling, data insights, and biomarker discovery. Presented validation data for a novel assay measuring tumor mutational burden in blood (bTMB) providing evidence that response to immunotherapy can be predicted using a blood sample. Based on these findings, Foundation Medicine’s bTMB assay is being integrated as part of Roche/Genentech's prospective, randomized Phase III Blood First Assay Screening Trial (BFAST) as a companion diagnostic assay investigating the use of bTMB as a non-invasive biomarker of response to first-line atezolizumab in advanced NSCLC patients. Received approval from the State of New York Department of Health for FoundationACT ® , the company’s liquid biopsy assay. Announced a collaboration with the American Society of Clinical Oncology (ASCO) to identify patients for its Targeted Agent and Profiling Utilization Registry (TAPUR) study. Announced a collaboration with the National Cancer Institute (NCI) and ECOG-ACRIN Cancer Research Group to identify patients for the NCI-Match (Molecular Analysis for Therapy Choice) study. Increased FoundationCORE™, the company’s molecular information database, to nearly 180,000 clinical cases. Expanded the company’s global footprint and patient access to personalized healthcare by commencing operations at the company’s laboratory in Penzberg, Germany. The Penzberg location is supporting continued growth and expansion in Europe through the company’s commercial collaboration with Roche. Published 95 peer-reviewed manuscripts in top medical and scientific journals and presented 141 podium talks and posters at scientific and medical meetings.\nComplete 2017 fourth quarter and full year financial results will be announced during the company's fourth quarter and fiscal year 2017 financial results conference call. The company also anticipates providing 2018 financial guidance at that time. This press release contains certain unaudited financial results for the company. These unaudited results could change as a result of further review by the company's management and its independent auditors.\nMr. Cox is scheduled to present at the 36 th Annual J.P. Morgan Healthcare Conference on Monday, January 8, 2017, at 3:30 p.m. PST, in San Francisco. Additionally, Mr. Cox will participate in a panel discussion focused on the FDA and CMS parallel review process on Monday, January 8, 2018 at 5:15 p.m. PST. Live, listen-only webcasts of these presentations and the breakout session may be accessed by visiting the investors section of the company's website at investors.foundationmedicine.com . A replay of these webcasts will be available shortly after the conclusion of the presentations and will be archived on the company's website for two weeks.\nAbout Foundation Medicine\nFoundation Medicine (NAS", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Ffoundationmedicine.com%2F&esheet=51739268&newsitemid=20180108005713&lan=en-US&anchor=Foundation+Medicine&index=1&md5=a495082d98070525965d2523282dc1e4", "http://www.businesswire.com/news/home/20180108005713/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.FoundationMedicine.com&esheet=51739268&newsitemid=20180108005713&lan=en-US&anchor=http%3A%2F%2Fwww.FoundationMedicine.com&index=3&md5=0d9d602fd4582713353cfe0cbb36f12d", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Finvestors.foundationmedicine.com&esheet=51739268&newsitemid=20180108005713&lan=en-US&anchor=investors.foundationmedicine.com&index=2&md5=801c002bfb4e85808fa23988b4bdb257"], "published": "2018-01-08T14:30:00.000+02:00", "crawled": "2018-01-08T15:31:22.018+02:00", "highlightTitle": ""}