{"organizations": [], "uuid": "3e8ecd63887c6e1c68d603afe4ce079c2d436ce8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180114&t=2&i=1221915114&w=1200&r=LYNXMPEE0D0E9", "site_section": "http://feeds.reuters.com/reuters/topNews", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-usa-immigration-trump/trump-says-program-protecting-young-immigrants-probably-dead-idUSKBN1F30MA", "country": "US", "domain_rank": 408, "title": "Trump says program protecting young immigrants 'probably dead'", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T15:57:00.000+02:00", "replies_count": 0, "uuid": "3e8ecd63887c6e1c68d603afe4ce079c2d436ce8"}, "author": "", "url": "https://www.reuters.com/article/us-usa-immigration-trump/trump-says-program-protecting-young-immigrants-probably-dead-idUSKBN1F30MA", "ord_in_thread": 0, "title": "Trump says program protecting young immigrants 'probably dead'", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "raissa kasolowsky", "sentiment": "none"}, {"name": "lucia mutikani", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "daca", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - U.S. President Donald Trump said on Sunday that a program that protects illegal immigrants brought to the United States as children from being deported would “probably” be discontinued.\nTrump has said he would end the Deferred Action for Childhood Arrivals, or DACA, and his Twitter comments on Sunday came as lawmakers worked on a bipartisan compromise on immigration policy.\nEfforts to extend the program are further complicated because it could make a funding bill to avert a government shutdown due Friday more difficult.\n“DACA is probably dead because the Democrats don’t really want it, they just want to talk and take desperately needed money away from our military,” Trump said on Twitter. But he left a door open that a deal could be reached with Democrats in Congress.\nA U.S. judge ruled last Tuesday that DACA should remain in effect until legal challenges brought in multiple courts are resolved.\nThe debate over immigration policy became increasingly acrimonious after it was reported on Thursday that the president described immigrants from Haiti and Africa as coming from “shithole countries” in a private meeting with lawmakers.\nThe comments led to harsh recriminations from Democrats and Republicans alike, even as bipartisan talks continued in Congress. It has distracted from the policy discussion of not only DACA, but of broader issues like immigration based on merit, which the president says he favors over a policy of family reunification, what he calls “chain immigration.”\n“I hope that we are actually going to work on fixing DACA,” said Representative Mia Love on CNN’s “State of the Union” program on Sunday. “We cannot let this derail us.”\nLove, whose parents are from Haiti, had criticized Trump for his remarks and called on him to apologize.\nTrump denied making the remarks Friday, although U.S. Senator Richard Durbin, who was in the White House meeting, said the president had used the term.\nLawmakers hope to reach an immigration deal before Jan. 19, when Congress must pass a funding bill or the government will shut down. Some Democrats insist that the DACA question be addressed by then.\nLawmakers are trying to combine some form of relief for DACA immigrants along with enhanced border security, including a wall along the Mexican border, sought by Trump. The president’s inflammatory comments left lawmakers struggling to find a path forward.\n“I hope we can move beyond that. What was reported was unacceptable. But what we have to do is not let that define this moment,” said Republican Senator Cory Gardner on CBS’s “Face the Nation” program.\nRepublican Senator David Perdue, who was at the same White House meeting and had said he did not recall whether Trump made the comment, was more explicit Sunday. He called the new stories a “gross misrepresentation.”\n“I‘m telling you, he did not use that word,” he said on ABC’s “This Week” program.\nHowever, Republicans and Democrats have both said they either heard Trump say it, or heard directly from colleagues who did.\nRepublican Senator Jeff Flake said Sunday he was told about the remarks by colleagues who attended the meeting, before the news reports emerged.\n“I heard that account before the account even went public,” he said on “This Week.”\nOne of Trump’s top advisers, Homeland Security Secretary Kirstjen Nielsen, said on “Fox News Sunday” she did not recall if Trump used “that specific phrase.”\nShe also appeared to rebut Trump’s remarks from earlier in the day, with talks ongoing. “DACA is not dead,” she said.\nReporting by Lucia Mutikani and Pete Schroeder; Editing by Raissa Kasolowsky and Jeffrey Benkoe\n ", "external_links": [], "published": "2018-01-14T15:57:00.000+02:00", "crawled": "2018-01-14T16:11:46.017+02:00", "highlightTitle": ""}