{"organizations": [], "uuid": "98769ff0c9444658df4cd4877aa4ea1ff8bdc179", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-sciaky-posts-record-december-with-the-sale-of-four-ebama-metal-3d-printing-systems.html", "country": "US", "domain_rank": 767, "title": "Sciaky Posts Record December with the Sale of Four EBAM® Metal 3D Printing Systems", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-03T16:30:00.000+02:00", "replies_count": 0, "uuid": "98769ff0c9444658df4cd4877aa4ea1ff8bdc179"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-sciaky-posts-record-december-with-the-sale-of-four-ebama-metal-3d-printing-systems.html", "ord_in_thread": 0, "title": "Sciaky Posts Record December with the Sale of Four EBAM® Metal 3D Printing Systems", "locations": [], "entities": {"persons": [{"name": "scott phillips", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "phillips service industries", "sentiment": "negative"}, {"name": "sciaky, inc.", "sentiment": "neutral"}, {"name": "electron beam additive manufacturing", "sentiment": "none"}, {"name": "psi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 3, 2018 /PRNewswire/ -- Sciaky, Inc. , a subsidiary of Phillips Service Industries, Inc. (PSI) and leading provider of metal additive manufacturing (AM) solutions, announced today that it has posted record machine sales in the month of December with the sale of four state-of-the-art Electron Beam Additive Manufacturing (EBAM®) systems. The buyers will use the machines to 3D print titanium structures for aerospace applications, as well as to produce large parts for ground-based military vehicles, and warships. Three of the four machines will be the popular EBAM 110 model. The fourth machine will be an EBAM 150 model, which has a nominal part envelope of 146\" (3708 mm) x 62\" (1575 mm) x 62\" (1575 mm), allowing the customer to 3D print the industry's largest metal parts in-house. All four systems will be delivered around mid-2018.\n\"Sciaky is proud to deliver more best-in-class EBAM metal 3D printing systems to the marketplace, which will be leveraged in a wide range of land, sea, air and space applications,\" said Scott Phillips, President & CEO of Sciaky, Inc. \"Now, more than ever, manufacturers are looking for ways to reduce time and cost associated with producing large, high-value parts, and Sciaky EBAM systems have a proven track record of helping manufacturers achieve these business-critical goals.\"\nBob Phillips, Sciaky's Vice President of Marketing, added, \"January is shaping up to be another great month for EBAM machine sales, and there will be more exciting industry news coming from Sciaky in the near future.\"\nAs the most widely scalable, metal additive manufacturing solution in the industry (in terms of work envelope), Sciaky's EBAM systems can produce parts ranging from 8 inches (203 mm) to 19 feet (5.79 meters) in length. EBAM is also the fastest deposition process in the metal additive manufacturing market, with gross deposition rates ranging from seven to 20 lbs. (3.18 to 9.07 kg) of metal per hour. EBAM brings quality and control together with IRISS ® – the Interlayer Real-time Imaging and Sensing System, which is the only real-time monitoring and control system in the metal 3D printing market that can sense and digitally self-adjust metal deposition with precision and repeatability. This innovative closed-loop control is the primary reason that Sciaky's EBAM 3D printing process delivers consistent part geometry, mechanical properties, microstructure, and metal chemistry, from the first part to the last.\nFor more information on Sciaky, visit www.sciaky.com . You can also follow Sciaky on Twitter , Facebook , Google+ , YouTube and LinkedIn .\nAbout Sciaky, Inc.\nSciaky, Inc., a subsidiary of Phillips Service Industries, is a world leader in metal 3D printing solutions. Our exclusive Electron Beam Additive Manufacturing (EBAM®) process is the fastest, most cost-effective 3D printing process in the market for large-scale metal parts, allowing manufacturers to save significant time and money over traditional manufacturing and rapid prototyping processes. Sciaky also provides industry-leading electron beam (EB) and advanced arc welding systems, as well as the most robust EB job shop welding services in the world, for the aerospace, defense, automotive, healthcare and other manufacturing industries. Our welding equipment meets rigid military specifications to manufacture items such as airframes, landing gear, jet engines, guided missiles and vehicle parts.\nAbout Phillips Service Industries, Inc.\nEstablished in 1967, Phillips Service Industries, Inc. (PSI) is a privately held global manufacturing and services holding company, which oversees a diverse collection of innovative subsidiaries: Beaver Aerospace & Defense, Inc., Mountain Secure Systems, POWERTHRU, PSI Repair Services, Inc., PSI Semicon Services, and Sciaky, Inc. We serve a wide range of high-tech industries like aerospace, defense, automotive, alternative energy, healthcare, security and semiconductor. Our award-winning products and services help reduce costs and maximize efficiency for many Fortune 500 companies around the globe, as well as the U.S. Military. We push the boundaries of technology on critical programs like Homeland Security, Defense research and space exploration, delivering innovative solutions for land, sea, air and space. We're PSI: Always innovating. Everywhere.™\nCONTACT:\nJay Hollingsworth\nPublic Relations Director\nPhillips Service Industries (PSI)\n(734) 853-5211\n188178@email4pr.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/sciaky-posts-record-december-with-the-sale-of-four-ebam-metal-3d-printing-systems-300576857.html\nSOURCE Sciaky, Inc.", "external_links": ["http://www.facebook.com/sciakyinc", "http://www.twitter.com/sciaky_inc", "http://youtube.com/SciakyInc", "http://www.prnewswire.com/news-releases/sciaky-posts-record-december-with-the-sale-of-four-ebam-metal-3d-printing-systems-300576857.html", "http://www.psi-online.com/", "https://plus.google.com/b/114947618826896915327/114947618826896915327/posts#114947618826896915327/posts", "http://www.sciaky.com/additive-manufacturing/electron-beam-additive-manufacturing-technology", "http://www.linkedin.com/company/sciaky-inc.", "http://www.sciaky.com/additive-manufacturing/iriss-closed-loop-control", "http://www.sciaky.com/"], "published": "2018-01-03T16:30:00.000+02:00", "crawled": "2018-01-03T16:28:24.008+02:00", "highlightTitle": ""}