{"organizations": [], "uuid": "e690239cc8615ea6e07d657bcdb399112a0cf2fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.goldreview.com/?feed=linkfeed", "section_title": "Gold Review » Gold Review", "url": "https://uk.reuters.com/article/global-precious/precious-gold-slips-from-3-1-2-month-peak-as-dollar-edges-higher-idUKL8N1OY31H", "country": "US", "domain_rank": 408, "title": "Gold eases from 3-1/2-month peak as dollar moves higher", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T21:43:00.000+02:00", "replies_count": 0, "uuid": "e690239cc8615ea6e07d657bcdb399112a0cf2fe"}, "author": "cmullen", "url": "https://uk.reuters.com/article/global-precious/precious-gold-slips-from-3-1-2-month-peak-as-dollar-edges-higher-idUKL8N1OY31H", "ord_in_thread": 0, "title": "Gold eases from 3-1/2-month peak as dollar moves higher", "locations": [], "entities": {"persons": [{"name": "renita d. young", "sentiment": "none"}, {"name": "jan harvey new york/london", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "fed", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 2:41 PM / Updated an hour ago PRECIOUS-Gold holds losses after Fed minutes show case for rate hikes Reuters Staff 3 Min Read \n* Gold falls further after Fed December meeting minutes * Technicals suggest gold rally is overstretched -analyst * Palladium drifts from record high hit on Tuesday (New throughout, updates prices, market activity and analyst comments after Fed minutes) By Renita D. Young and Jan Harvey NEW YORK/LONDON, Jan 3 (Reuters) - Gold fell on Wednesday, extending losses after the Federal Reserve released minutes of its December policy meeting, which fed the view among investors that more U.S. interest rate hikes are in store. In early trading, gold hit a 3-1/2 month high. But a firmer dollar encouraged selling, putting the precious metal on track for its first day of losses in nearly three weeks. Though the Fed's meeting minutes showed some disagreement between policy hawks and doves, \"the tax cuts were seen as very beneficial for economy. A higher GDP and higher consumer spending would boost the possibility for more rate hikes, which would put pressure on gold,\" said Bob Haberkorn, senior market strategist for RJO Futures in Chicago. Gold, which as a non-yielding asset is highly sensitive to rising interest rates, fell in the run-up to the third U.S. interest rate rise of 2017 in December. But then it climbed 5 percent from its mid-month low to the year's close. Spot gold was down 0.7 percent at $1,309.35 an ounce by 2:29 p.m. EST (1929 GMT), off its session high of $1,321.33. U.S. gold futures for February delivery settled up $2.40, or 0.2 percent, at $1,318.50 per ounce. Spot gold's 14-day relative strength index (RSI) touched 75 on Tuesday, it highest since September 2017. An RSI above 70 indicates a commodity is overbought and could herald a price correction, technical analysts said. The dollar rebounded after upbeat U.S. manufacturing and construction data, snapping a three-week losing streak. U.S. stocks rose, with the benchmark S&P 500 index surging past the 2,700-mark for the first time. Other major indexes hit record intraday highs. Among other precious metals, palladium was down 0.7 percent at $1,084 an ounce after hitting a record high on Tuesday of $1,096.50. Palladium soared 56 percent in 2017 on fears that strong demand from carmakers for catalytic converters, chiefly used in gasoline-powered vehicles, would tighten the market further after years of deficit. \"You have a market that is on the one hand in deficit, and on the other very well managed by some of the bigger producers, who are unwilling to ship additional units into the market,\" Bank of America-Merrill Lynch analyst Michael Widmer said. Spot silver was down 0.7 percent at $17.06 an ounce after earlier touching a six-week high of $17.24. Platinum was 0.6 percent higher at $949 an ounce, after touching $960.70, its highest level since Sept. 19. (Additional reporting by Nallur Sethuraman in Bengaluru; Editing by Adrian Croft, Matthew Lewis and David Gregorio)", "external_links": [], "published": "2018-01-03T21:43:00.000+02:00", "crawled": "2018-01-03T22:51:26.004+02:00", "highlightTitle": ""}