{"organizations": [], "uuid": "a53ca8c9df417d5cf60711e7cf172e533bc56f82", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/business-wire-littelfuse-completes-acquisition-of-ixys-corporation.html", "country": "US", "domain_rank": 767, "title": "Littelfuse Completes Acquisition of IXYS Corporation", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-17T16:07:00.000+02:00", "replies_count": 0, "uuid": "a53ca8c9df417d5cf60711e7cf172e533bc56f82"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/business-wire-littelfuse-completes-acquisition-of-ixys-corporation.html", "ord_in_thread": 0, "title": "Littelfuse Completes Acquisition of IXYS Corporation", "locations": [], "entities": {"persons": [{"name": "dave heinzmann", "sentiment": "none"}], "locations": [], "organizations": [{"name": "ixys corporation chicago", "sentiment": "negative"}, {"name": "littelfuse", "sentiment": "negative"}, {"name": "littelfuse, inc.", "sentiment": "neutral"}, {"name": "ixys corporation", "sentiment": "none"}, {"name": "ixys", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO--(BUSINESS WIRE)-- Littelfuse, Inc. (NASDAQ:LFUS) today announced the completion of its acquisition of IXYS Corporation (NASDAQ:IXYS). IXYS is a global pioneer in the power semiconductor market with a focus on medium- to high-voltage power semiconductors across the industrial, communications, consumer and medical device markets.\n“Today marks a significant step forward in our company strategy to accelerate growth within the power control and industrial OEM markets,” said Dave Heinzmann, President and Chief Executive Officer of Littelfuse. “The combination of our companies brings together a broad power semiconductor portfolio, complementary technology expertise and a strong talent pool.”\nThe transaction is expected to be immediately accretive to adjusted EPS. Littelfuse expects to achieve more than $30 million of annualized cost savings within the first two years after closing. The combination is also expected to create significant revenue synergy opportunities longer term, given the companies’ complementary offerings and combined customer base.\nIn conjunction with the close of the transaction, IXYS founder Dr. Nathan Zommer has been appointed to the Littelfuse Board of Directors, increasing the size of the board to nine members.\nWith today’s transaction close, each former IXYS stockholder is entitled to receive, per IXYS share held immediately prior to the closing, either $23.00 in cash or 0.1265 of a share of Littelfuse common stock. In total, 50% of IXYS stock was converted into the cash consideration and 50% into the stock consideration.\nAbout Littelfuse\nFounded in 1927, Littelfuse is the global leader in circuit protection with advancing platforms in power control and sensor technologies. The company serves customers in the electronics, automotive and industrial markets with products that include fuses, semiconductors, polymers, ceramics, relays and sensors. Littelfuse has more than 11,000 employees in more than 50 locations worldwide. For more information, please visit Littelfuse.com .\n“Safe Harbor” Statement under the Private Securities Litigation Reform Act of 1995.\nThe statements in this press release that are not historical facts are intended to constitute “forward-looking statements” entitled to the safe-harbor provisions of the PSLRA. These statements may involve risks and uncertainties, including, but not limited to, risks relating to product demand and market acceptance; economic conditions; the impact of competitive products and pricing; product quality problems or product recalls; capacity and supply difficulties or constraints; coal mining exposures reserves; failure of an indemnification for environmental liability; exchange rate fluctuations; commodity price fluctuations; the effect of Littelfuse, Inc.’s (“Littelfuse” or the “Company”) accounting policies; labor disputes; restructuring costs in excess of expectations; pension plan asset returns less than assumed; uncertainties related to political or regulatory changes; the integration of the recently acquired business of IXYS Corporation (“IXYS”) and the risk that expected benefits, synergies and growth prospects of the acquisition of IXYS may not be achieved in a timely manner, or at all; and other risks which may be detailed in the company’s Securities and Exchange Commission filings. Should one or more of these risks or uncertainties materialize or should the underlying assumptions prove incorrect, actual results and outcomes may differ materially from those indicated or implied in the forward-looking statements. This release should be read in conjunction with information provided in the financial statements appearing in the company’s Annual Report on Form 10-K for the year ended December 31, 2016. For a further discussion of the risk factors of the company, please see Item 1A. “Risk Factors” to the company’s Annual Report on Form 10-K for the year ended December 31, 2016.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180117005745/en/\nLittelfuse, Inc.\nInvestor Contact\nMeenal Sethna\nExecutive Vice President and CFO\n(773) 628-0616\nor\nMedia Contact\nSteve Schrier\nCorporate Communications\n(773) 628-2112\nSource: Littelfuse, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180117005745/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.littelfuse.com&esheet=51744271&newsitemid=20180117005745&lan=en-US&anchor=Littelfuse.com&index=2&md5=fdc7faae02da3e0a69f4d2baa1e5305b", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.littelfuse.com&esheet=51744271&newsitemid=20180117005745&lan=en-US&anchor=Littelfuse%2C+Inc.&index=1&md5=e5b3e455a30cd415f44efc95f92132fa"], "published": "2018-01-17T16:07:00.000+02:00", "crawled": "2018-01-17T16:48:31.016+02:00", "highlightTitle": ""}