{"organizations": [], "uuid": "b95cbff53d8fb685dac1f973aa15cd435bc8e259", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/home", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-beijing-ev-listing/chinas-baic-plans-4-5-billion-backdoor-listing-for-electric-car-unit-idUSKBN1FC0GP", "country": "US", "domain_rank": 408, "title": "China's BAIC plans $4.5 billion backdoor listing for electric car unit", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T13:43:00.000+02:00", "replies_count": 0, "uuid": "b95cbff53d8fb685dac1f973aa15cd435bc8e259"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-beijing-ev-listing/chinas-baic-plans-4-5-billion-backdoor-listing-for-electric-car-unit-idUSKBN1FC0GP", "ord_in_thread": 0, "title": "China's BAIC plans $4.5 billion backdoor listing for electric car unit", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "baic", "sentiment": "negative"}, {"name": "beijing automotive group", "sentiment": "negative"}, {"name": "beijing electric", "sentiment": "none"}, {"name": "beijing electric vehicle co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HONG KONG/SHANGHAI (Reuters) - China’s state-backed Beijing Automotive Group (BAIC) will take its electric vehicle unit public by injecting it into another listed subsidiary, boosting its financial muscle as the battle for the country’s hotly contested green car market heats up.\nThe de facto backdoor listing values the unit, Beijing Electric Vehicle Co, at $4.5 billion and comes as the government engineers a dramatic shift away from conventional gasoline cars with strict quotas for electric and hybrid vehicles set to come into effect next year.\nThe shift has prompted major investment and a spate of deals between global automakers, tech firms and local rivals as companies rush to bring out new vehicle models and set up local ventures and facilities in the world’s biggest car market.\nThe deal is also a rare listing for China’s green car sector and marks the first time that a state-owned manufacturer of so-called new energy vehicles (NEVs) will debut on one of the country’s main stock exchanges.\nBeijing Electric, established in 2009, said this month that sales jumped 98 percent in 2017 to 103,199 vehicles.\nFILE PHOTO: An electric vehicle (EV) taxi is displayed at the booth of Beijing Automotive Group (BAIC) during the Auto China 2016 auto show in Beijing, China April 26, 2016. REUTERS/Kim Kyung-Hoon/File Photo That puts it just behind Warren Buffett-backed BYD Co Ltd ( 002594.SZ ) which said its NEV sales last year totalled 113,669, up around 13.5 percent.\nUnder the deal, ChengDu QianFeng Electronics Co ( 600733.SS ), one of the listed arms of BAIC, will buy the electric car unit and then sell 761.1 million shares at 37.66 yuan per share. Beijing Electric will become the listed entity.\nChina’s automotive market slowed sharply in 2017, but new energy vehicles have been a bright spot. An industry body said this month NEV sales would likely grow 40 percent this year, topping 1 million vehicles.\nCar makers, however, are worried about the rapid pace of the shift to fully electric vehicles and some have called for Beijing to maintain financial support for the auto market to help drive consumer demand.\n($1 = 6.4003 Chinese yuan)\nReporting by Meg Shen and Twinnie Siu in HONG KONG and Adam Jourdan in SHANGHAI; Editing by Edwina Gibbs\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T13:43:00.000+02:00", "crawled": "2018-01-23T07:47:49.010+02:00", "highlightTitle": ""}