{"organizations": [], "uuid": "827c73fd122ced063986a47f8cf052ba1cb5129b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/30/104978040-GettyImages-912424224.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/19832390/device/rss/rss.html", "section_title": "Asia-Pacific News", "url": "https://www.cnbc.com/2018/01/31/trump-state-of-the-union-address-eases-protectionist-fears-in-asia.html", "country": "US", "domain_rank": 767, "title": "Trump’s State of the Union address eases protectionist fears in Asia", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-31T14:57:00.000+02:00", "replies_count": 0, "uuid": "827c73fd122ced063986a47f8cf052ba1cb5129b"}, "author": "Nancy Hungerford", "url": "https://www.cnbc.com/2018/01/31/trump-state-of-the-union-address-eases-protectionist-fears-in-asia.html", "ord_in_thread": 0, "title": "Trump’s State of the Union address eases protectionist fears in Asia", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "james crabtree", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "trump’s state", "sentiment": "neutral"}, {"name": "congress", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "lee kuan yew school of public policy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump 's first State of the Union address was rife with promises to put \"America First,\" but investors and political analysts in Asia seem to be taking it in their stride.\n\"There was only one name check of China in the speech, and then one allusion to intellectual property rights, so it was less hard on China than you might have expected,\" James Crabtree, associate professor of practice at the Lee Kuan Yew School of Public Policy in Singapore, told CNBC.\nInvestors were bracing for the worst amid signs of a protectionist ramp-up in Washington. The State of the Union fell just days after the administration slapped steep tariffs on solar panels and washing machines, hitting Asian exporters particularly hard. China and South Korea condemned the tariffs, raising fears of retaliation.\nshow chapters Trump's speech to Congress had 'red meat' for his base 16 Hours Ago | 01:15 Trump did declare that \"the era of economic surrender is totally over,\" but the lack of emphasis put on trade and the complete absence of the word \"tariff\" in Tuesday's address appears to have assuaged some concerns.\n\"The trade race is a big impact issue, but its probability is still fairly low. Given the speech, the probability still remains fairly low,\" James Cheo, investment strategist at the Bank of Singapore, told CNBC at the conclusion of the speech.\nUS withdrawal from TPP Not everyone agrees. \"There is every reason to believe that businesses need to be prepared for a series of trade sanctions between the U.S. and its key trading partners in 2018, and sooner rather than later,\" Steve Okun, president for the Asia Business Trade Association, told CNBC in an email after the address.\nWithout mentioning specific trade arrangements such as NAFTA or the Trans-Pacific Partnership (TPP), Trump used the moment to boast that \"America has finally turned the page on decades of unfair trade deals that sacrificed our prosperity and shipped away our companies.\"\nshow chapters Infrastructure and trade details awaited after Trump speech 16 Hours Ago | 01:28 The U.S. withdrawal from TPP under Trump marks a dramatic shift in Asian relations since the last State of the Union delivered by former President Barack Obama .\n\"With TPP, China does not set the rules in that region, we do. You want to show our strength in this new century? Approve this agreement; give us the tools to enforce it. It's the right thing to do,\" Obama said in January 2016.\n'Real, potential faster growth' for the US The remaining 11 members party to the TPP have agreed to finalize the deal in March, without the United States on board. However, Trump hinted in an interview with CNBC in Davos last week that he may be willing to reopen the door to TPP if the terms were significantly improved.\nFor now, investors in Asia seem willing to look past the changing trade winds, so long as the global growth tide continues to lift all boats.\nshow chapters Trump's State of the Union comes against a good economy 13 Hours Ago | 02:14 Gerard Cassidy, managing director and banking analyst at RBC Capital Markets in the United States, spoke to CNBC after the State of the Union during a visit to Singapore. When asked what his Asian clients were saying about the White House agenda, he said: \"What has surprised the folks we've seen over the last three days starting in Beijing, then to Hong Kong and now in Singapore is how exciting these changes are.\"\nPeople do not truly appreciated how meaningful these changes in the U.S would be, Cassidy added, suggesting that people were looking past the trade aspect of Trump's agenda.\n\"People are recognizing the U.S. is on the cusp of some real, potential faster growth, that's the part people are now realizing and saying, 'Wow, this could take off',\" he said.", "external_links": [], "published": "2018-01-31T14:57:00.000+02:00", "crawled": "2018-01-31T14:25:32.001+02:00", "highlightTitle": ""}