{"organizations": [], "uuid": "60fc015a2f3affc70f408343cc7d33c061a5551b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/europe-stocks/live-markets-half-session-update-europe-on-a-high-idUSL8N1PE3L4", "country": "US", "domain_rank": 408, "title": "LIVE MARKETS-Half session update: Europe on a high", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T15:20:00.000+02:00", "replies_count": 0, "uuid": "60fc015a2f3affc70f408343cc7d33c061a5551b"}, "author": "", "url": "https://www.reuters.com/article/europe-stocks/live-markets-half-session-update-europe-on-a-high-idUSL8N1PE3L4", "ord_in_thread": 0, "title": "LIVE MARKETS-Half session update: Europe on a high", "locations": [], "entities": {"persons": [{"name": "danilo masoni", "sentiment": "none"}, {"name": "ken odeluga", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "carpetright", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 1:20 PM / Updated an hour ago LIVE MARKETS-Half session update: Europe on a high Reuters Staff 15 Min Read * Euro zone shares hit ten year high * STOXX 600 at 2 1/2 year peak * Carpetright, Dignity drop after profit warnings Jan 19 (Reuters) - Welcome to the home for real time coverage of European equity markets brought to you by Reuters stocks reporters and anchored today by Danilo Masoni. Reach him on Messenger to share your thoughts on market moves: danilo.masoni.thomsonreuters.com@reuters.net HALF SESSION UPDATE: EUROPE ON A HIGH (1320 GMT) After a rather subdued start, equities in Europe have clearly moved into positive territory with the pan-regional STOXX 600 benchmark at fresh 2-1/2 year highs and euro zone stocks at a 10 year peak. One supportive factor for the intraday move (and probably the one that \"really matters\" - to use the words tweeted by City Index analyst at Ken Odeluga) is that Wall Street is set for a higher open as investors bet on strong corporate earnings, while playing down fears of a potential U.S. government shutdown. (Danilo Masoni) **** SO GREEK SOVEREIGN BONDS RECOVERED, ARE SHARES NEXT? (1235 GMT) Greek sovereigns bonds have made a spectacular come-back these last two years, with yields falling from over ten percent to below four percent as the country prepares to exit its bail-out program and finance itself on the markets. \"We think that Greek Equities should be next to outperform,\" writes Lyxor, which notes that \"the Athens Stock Exchange (ASE) has underperformed the EuroStoxx300 by 80% since the Eurozone crisis started\". In a nutshell, if Greek shares catch up with their peers the way the country's sovereign bonds have with Euro zone so-called peripherals, the upside is impressive. \"A recovery of the ASE back to its 2014 highs would grant a lofty 50% price return,\" Lyxor adds. Here's the chart showing the catch-up potential: (Julien Ponthus) **** HIGH RISK PREMIA PRESERVE DOMINANCE OF STOCKS OVER BONDS (1208 GMT) With everyone asking themselves how long this New Year's bull run can continue without a significant hiccough, Citi's global strategy team reminds us why stocks remain popular from a cross-asset point of view: a high equity risk premium (ERP). \"Risk premia across global equities still look attractive compared to those in fixed income,\" Citi's Robert Buckland and team write. The high ERP has been part of what's helped stock markets stay relatively unscathed by moves in bond yields. This buffer is \"not exhausted yet\", they reckon, but it is shrinking (see the chart courtesy of Citi below). The ERP remains the highest in Europe where bond yields remain very low, while it is lower in Japan and the U.S. - a divergence Citi strategists recommend playing by going overweight European equities (ex-UK). A falling ERP favours cyclicals, which usually outperform defensives in this environment. \"Financials seem to be the most consistent beneficiary,\" say Buckland and co. Flows data certainly reflects this: financials drew the largest inflows ($1.6 bln) this week, according to EPFR. (Helen Reid) SEARCHING FOR VALUE IN CONSUMER STAPLES (1135 GMT) There's been a lot of buzz around cyclicals in 2018, but what about European defensives? Given that defensives aren't cheap and are facing the threat of rising bond yields, analysts at Liberum prefer consumer staples stocks which offer value, FCF yield and self-help stories. \"While Consumer Staples companies still present relatively resilient, visible earnings growth, constrained top-line growth, intensely competitive end markets and rising inflation provide headwinds to EPS growth. Weak sales growth is forcing companies to drive earnings via aggressive margin expansion,\" Liberum analysts say in a note. Liberum add that they expect the sector to perform in line with the broader market. Their top picks for 2018 include Reckitt Benckiser, Heineken, Danone and Tate & Lyle. (Kit Rees) STOXX 600 - ENJOY THE MOMENTUM WHILE YOU CAN (1121 GMT) The economic momentum which has driven the STOXX 600 up to 400 points is set to fade in the next couple of months, meaning the pan-European index should settle on a downward path, Deutsche Bank reckons. \"Accelerating growth momentum has done wonders for European asset prices over the past 18 months, but we expect this acceleration to start reversing over the coming months,\" Sebastian Raedler, head of European equity strategy at Deutsche Bank just told us. \"We project the fair-value level for the Stoxx 600 declining from around 410 at the moment to around 370 by mid-year\", he said. With December's euro zone manufacturing Purchasing Managers' Index (PMI) at 60.6, the highest since the survey began in June 1997, there isn't much room left for the pace to improve further and DB expects it to decline this month. \"When the Euro area PMI is above 56, PMI momentum is rarely positive over the following six months\", Raedler said, explaining that \"it's not the level of growth that matters for equities, but the rate of change of growth, i.e. whether growth is accelerating or decelerating\". Based on this model, Deutsche has been \"tactically neutral\" on the STOXX 600 since September while most of its peers generally take a more optimistic view. Here's their chart : (Julien Ponthus) EURO ZONE STOCKS LOOK PAST FX STRENGTH, HITTING 10-YEAR HIGH (1015 GMT) Deutsche Bank may be bearish on euro zone stocks because of the single currency's strength but the market appears to be going in another direction: the euro zone's STOXX benchmark index has just risen to its highest level in 10 years. A number of analysts and fund managers are very upbeat on euro zone equities because of their cheap valuations relative to the U.S., an economic recovery that gets stronger and stronger and the underlying quality of company earnings. That is boosting confidence euro zone stocks could outperform Wall Street in 2018 and catch up with stellar gains seen across the pond. Strength in the euro could surely reduce competitiveness in the region but at the same time it also reduces its import costs. (Danilo Masoni) SEMIS: IN CHIP SHAPE (0951 GMT) You'd think European semiconductor stocks wouldn't have much impetus for going higher given the gains we saw last year: ASML, AMS, Infineon and STMicro rose between 36 and 208 percent in 2017. But the tech sector is once again outstripping the STOXX even this early in the year, while this week's results from ASML and subsequent 5 percent rise in its shares plus broker upgrades suggest that there is further strength in these stocks, defying Morgan Stanley's view in their November note \"Global Technology: Time for a Pause\". Marcus Morris-Eyton, European equities portfolio manager at Allianz, for whom ASML is a core holding, said that ASML's results and commentary illustrated the end market demand that semis are seeing at the moment. \"At the moment, (ASML are) in a beautiful place where their demand is outstripping their production so they are getting increasing demand from customers to bring forward some of their equipment,\" Morris-E", "external_links": [], "published": "2018-01-19T15:20:00.000+02:00", "crawled": "2018-01-19T16:23:32.014+02:00", "highlightTitle": ""}