{"organizations": [], "uuid": "5a93472b84648101dba3606491de19f9b0cf9b78", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224217723&w=1200&r=LYNXMPEE0L1QD", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/india-budget-oil/indias-oil-ministry-seeks-cut-in-excise-duty-on-petrol-diesel-in-budget-idINKBN1FB2EB", "country": "US", "domain_rank": 408, "title": "India's oil ministry seeks cut in excise duty on petrol, diesel in budget", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T19:27:00.000+02:00", "replies_count": 0, "uuid": "5a93472b84648101dba3606491de19f9b0cf9b78"}, "author": "", "url": "https://in.reuters.com/article/india-budget-oil/indias-oil-ministry-seeks-cut-in-excise-duty-on-petrol-diesel-in-budget-idINKBN1FB2EB", "ord_in_thread": 0, "title": "India's oil ministry seeks cut in excise duty on petrol, diesel in budget", "locations": [], "entities": {"persons": [{"name": "narendra modi", "sentiment": "none"}, {"name": "nidhi verma", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}], "organizations": [{"name": "promit mukherjee", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW DELHI/MUMBAI (Reuters) - India’s oil ministry is pushing for a cut in excise duty on petrol and diesel in the upcoming 2018/19 budget to cushion the impact of rising oil prices on its vast consumer base, two oil ministry officials told Reuters on Monday.\nPrime Minister Narendra Modi, who faces elections in key states later this year, and a nationwide election in early 2019, has faced pressure over a rise in retail prices of petrol and diesel to a record level.\nIndia has the highest retail prices of petrol and diesel among South Asian nations as taxes account for about 40-50 percent of the pump prices.\nA litre of petrol costs 72.23 rupees ($1.13) while diesel is sold at 63.01 rupees. Petrol and diesel account for about half of India’s refined fuel consumption.\n“We can only recommend. It is up to the finance ministry to take a decision,” a senior oil ministry official said.\nA cut in excise duty on petrol and diesel in the budget, due to be unveiled on Feb. 1, would pose challenges as the government is struggling to tackle a widening fiscal gap amid falling tax revenues due to the implementation of a goods and services tax (GST) regime from July.\nThe word oil is pictured on an oil bank at a recycling yard in London March 2, 2011. REUTERS/Stefan Wermuth/File Photo In 2016/17, the petroleum sector contributed around 5.2 trillion rupees ($81 billion), about a third of total revenue receipts, for federal and state finances.\nIndia raised excise duty nine times between November 2014 and January 2016 to shore up federal finances as global oil prices fell, but then cut the tax last October by 2 rupees a litre.\nSources said the ministry has also sought inclusion of petrol, diesel, jet fuel and natural gas in the GST to help companies claim tax credits against the tax paid on the purchase of equipment meant to produce refined fuel.\n“We cannot claim input tax credit for almost 70 percent of our volumes ... So usually we lose out about 1.5 billion rupees quarterly on that,” J. Ramaswamy, head of finance at Hindustan Petroleum Corp, said.\nThe oil ministry officials said the addition of refined products in GST will help reduce retail prices even if the government levies a charge on top of its highest GST rate of 28 percent.\nThe ministry has also sought federal support for laying fuel and gas pipelines in the northeast of the country to give the region a boost. Economic development in India has largely been concentrated in the western and southern states that have better infrastructure and more accessible energy supplies.\nState-controlled India Oil has sought government support for laying a 650-kilometre (404 mile) fuel pipeline in the northeast, costing 13 billion rupees, as the project is economically unviable due to low fuel demand in the region, one of the sources familiar with the matter told Reuters.\nEditing by Euan Rocha and Susan Fenton\n ", "external_links": [], "published": "2018-01-22T19:27:00.000+02:00", "crawled": "2018-01-22T20:00:28.009+02:00", "highlightTitle": ""}