{"organizations": [], "uuid": "66a42d3fa73abf129b17ce23821fd1dab7a9df8a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 11}, "facebook": {"likes": 28, "shares": 28, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-907167716.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/19/government-shutdown-senate-vote/", "country": "US", "domain_rank": 1196, "title": "Commentary: Government Shutdown Facts | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.223, "site_type": "news", "published": "2018-01-19T02:00:00.000+02:00", "replies_count": 0, "uuid": "66a42d3fa73abf129b17ce23821fd1dab7a9df8a"}, "author": "Jeffrey Neal", "url": "http://fortune.com/2018/01/19/government-shutdown-senate-vote/", "ord_in_thread": 0, "title": "Commentary: Government Shutdown Facts | Fortune", "locations": [], "entities": {"persons": [{"name": "jeffrey neal january", "sentiment": "negative"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Jeffrey Neal January 19, 2018 \nTalk of an impending shutdown of the United States federal government spreads far beyond Washington, D.C. these days. The reason: Funding halts completely on Friday if a temporary deal is not reached. Time is quickly running out. \nI’ll be honest. Two weeks ago, I thought the likelihood of a shutdown was remote. Why would any member of Congress allow it to happen? After all, the last shutdown showed that the American people do not think much of a Congress that cannot do its job. One survey clocked congressional approval at 9% following the 2013 shutdown. \nIf Congress does reach a deal in the next day or two, it’s not going to be a deal to fund the government for the remainder of the fiscal year. It will be yet another short-term extension for a month. The fiscal year that began on Oct. 1 was supposed to start with appropriations in place, but almost a third of the year is gone with no solution in sight. Balancing regular work and planning for an uncertain future \nIn the meantime, government agencies that should be focusing on the work of the taxpayers are in the midst of shutdown planning. They have to decide who stays at work and who goes home. They have to decide what work continues and what stops. In some agencies, such as the departments of Defense and Homeland Security, many employees will stay on the job, but without pay or any guarantee of back-pay. \nIt’s not just the federal workforce whose livelihood is on the line. Federal contractors will be squeezed as well. Larger companies may find other work or allow employees to take paid leave, but for some contractors, a government shutdown means no work and no pay, and generally no back-pay. The people in the private sector who run restaurants and coffee shops and other small businesses that serve federal employees and contractors will see sales drop, and their employees who are sent home will not get paid or get back-pay. For some small businesses that operate on tight margins, a prolonged shutdown could mean they lose their profit for the year. Shutdown, but not shutting down entirely \nOne important fact to remember is that a shutdown doesn’t mean that the entire government stops functioning. If the money runs out on Friday, we are not going to send Customs and Border Protection officers home, open the borders, stop travel into the country, and bring international commerce to a screeching halt. We will not stop issuing Social Security checks, nor will we send the Federal Aviation Administration’s air traffic controllers home and ground every aircraft in the country. We do not do those things because of government official, military personnel, and federal employee exemptions that are intended to conduct essential work that protects people’s lives and government property. We also do not do them because of the political firestorm it would create. \nSome folks, though, say that a full shutdown would be preferable to a pretend one where we throw away billions of dollars (the 2013 shutdown cost $24 billion) and disrupt the lives of millions of people. After all, they claim, truly shutting down the government would create so much pressure on Congress that Democrats and Republicans would stop being Democrats and Republicans for a day and do the job we sent them to Washington to do. \nOne such shutdown would most likely assure that there is never another one, but doing it would be stupid and dangerous. It could trash the economy, halt critical access to public sector-provided health care and other citizen services, do long-term damage to our national security, diminish public confidence in the U.S. government, and hurt us in countless other ways. The congressional art of reaching a shutdown deal \nPresident Trump recently said it might be worth considering bringing back earmarks, or dedicated funds set aside for a particular purpose, as a way to get deals made in Congress. There was a quick and mostly negative reaction to his comments. But after being in government for 33 years, and watching from the outside since 2011, I have to say I agree with the president on this one. \nEarmarks, often in the form of what are derisively referred to as “pork barrel” spending, used to be the lubricant that kept the wheels of Congress turning. Loyalty to a political party might be important, but bringing home the bacon was even more critical. Even voters who criticize pork barrel spending look at it differently when it is in their hometown. The new courthouse somewhere else is pork, but the new bridge they drive across every day is a public works project. \nWhatever the solution, something needs to happen to stop this annual appropriations gridlock. The American people deserve a government that works, and, according to the U.S. Constitution , that begins with Congress. \nJeffrey Neal is a senior vice president at ICF , former chief human capital officer for the U.S. Department of Homeland Security and publisher of the blog ChiefHRO.com. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-19T02:00:00.000+02:00", "crawled": "2018-01-20T20:03:30.016+02:00", "highlightTitle": ""}