{"organizations": [], "uuid": "30ee38fcd9f9649b242f728a85664754489d8f72", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224269495&w=1200&r=LYNXMPEE0L21L", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/us-netflix-results/netflix-subscriber-growth-beats-on-strong-original-programming-idINKBN1FB2WM", "country": "US", "domain_rank": 408, "title": "Netflix crosses $100 billion market capitalisation as subscribers surge", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T02:46:00.000+02:00", "replies_count": 0, "uuid": "30ee38fcd9f9649b242f728a85664754489d8f72"}, "author": "", "url": "https://in.reuters.com/article/us-netflix-results/netflix-subscriber-growth-beats-on-strong-original-programming-idINKBN1FB2WM", "ord_in_thread": 0, "title": "Netflix crosses $100 billion market capitalisation as subscribers surge", "locations": [], "entities": {"persons": [{"name": "will smith", "sentiment": "none"}, {"name": "lisa richwine", "sentiment": "none"}, {"name": "aishwarya venugopal", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "netflix", "sentiment": "negative"}, {"name": "netflix inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Netflix Inc ( NFLX.O ) snagged 2 million more subscribers than Wall Street expected in the final three months of 2017, tripling profits at the online video service that is burning money on new programming to dominate internet television around the world.\nThe results drove Netflix to a market capitalization of more than $100 billion for the first time. Shares jumped 9 percent to over $248 in after-hours trading on Monday after rallying throughout the month and rising 53 percent last year. ( tmsnrt.rs/1Ry82wG )\nThe company has signed up more than half of all U.S. broadband households and is building its customer base in 190 countries by spending billions on programming.\nNetflix picked up 6.36 million subscribers in international markets from October through December, when it released new seasons of critically acclaimed shows “Stranger Things” and “The Crown” as well as Will Smith action movie “Bright.” That topped Wall Street expectations of 5.1 million, according to FactSet.\nAlong with 1.98 million customer additions in the United States, the company ended the year with 117.58 million streaming subscribers around the globe, despite a price hike in October.\n“Netflix is pouring more and more money into making content, and it is directly translating into more subscribers,” BTIG analyst Richard Greenfield said. “They see a huge opportunity and they are moving as fast as they can to attack it.”\nThe company also said it took a $39 million non-cash charge for “unreleased content we’ve decided not to move forward with.” A source familiar with the matter said the charge was related to content starring Kevin Spacey, with whom Netflix cut ties after he was accused of sexual misconduct.\nNetflix temporarily halted production of “House of Cards” to write out Spacey’s character and decided not to release the film “Gore,” which starred Spacey as Gore Vidal.\nSpacey has apologized to one of his accusers, and according to his representatives is seeking unspecified treatment. Reuters was unable to independently confirm the accusations.\nThe charge is one of the first signs of costs faced by companies in the wake of a widespread campaign against sexual harassment.\nNetflix turned a DVD-by-mail business into an online competitor of movie channel HBO. As it grew it began licensing its own original shows to ensure a stream of new offerings if studio suppliers ended deals.\nFILE PHOTO: The Netflix logo is pictured on a television in this illustration photograph taken in Encinitas, California, U.S., on January 18, 2017. REUTERS/Mike Blake/File Photo In fact, Walt Disney Co ( DIS.N ) is making a major push into online streaming and will pull its first-run shows and movies from Netflix in 2019 as Hollywood fights for audiences.\nNetflix plans to spend up to $8 billion this year on TV shows and movies to fend off Disney, Amazon.com Inc ( AMZN.O ), studios-owned Hulu and local competitors that are jumping into online video, and it is turning more and more to high-budget projects, such as the roughly $90 million “Bright.”\nIn 2017, Netflix recorded its first full-year profit in international markets. The company has said it is aiming for steady improvements in profitability overseas this year.\n“We believe our big investments in content are paying off,” Netflix said in a quarterly letter to shareholders.\nNetflix is raising its marketing budget faster than revenue is growing and will spend about $2 billion this year. The company expects negative cash flow in 2018 of $3 billion to $4 billion, up from $2 billion in 2017.\nLast October, Netflix raised prices for two of its three main subscription plans to help fund the substantial content investment. The earnings report showed customers took it in stride.\n“Consumers are tolerant as long as something’s improving,” Netflix CEO Reed Hastings, on a post-earnings webcast, said of the price increase.\nFor the December quarter, Netflix reported diluted earnings-per-share of 41 cents, even with the expectations of analysts polled by Thomson Reuters I/B/E/S.\nRevenue for the three months totaled $3.286 billion, in line with forecasts.\nLooking ahead, Netflix forecast streaming customer additions of 6.35 million for the first quarter, above analysts’ expectation of 5.01 million, according to FactSet.\nInvestors appear confident in Netflix’s ability to grow. Netflix recently traded at 91 times expected earnings for the next 12 months, versus Amazon at 152 times earnings and Disney at 17 times earnings, according to Thomson Reuters data.\nNetflix also said Monday that Rodolphe Belmer, CEO of global satellite company Eutelsat, had joined the company’s board.\nRelated Coverage Netflix takes $39 million charge after Kevin Spacey scandal Reporting by Lisa Richwine in Los Angeles and Aishwarya Venugopal in Bengaluru; Editing by Peter Henderson and Lisa Shumaker\n ", "external_links": [], "published": "2018-01-23T02:46:00.000+02:00", "crawled": "2018-01-23T08:04:18.018+02:00", "highlightTitle": ""}