{"organizations": [], "uuid": "729f541f07906e703f196da8ef67b9126887fce7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226985287&w=1200&r=LYNXMPEE0U15Q", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-hedgefunds-activists/activist-investors-demands-rejected-more-in-2017-data-idUSKBN1FK272", "country": "US", "domain_rank": 408, "title": "Activist investors' demands rejected more in 2017 -data", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T17:09:00.000+02:00", "replies_count": 0, "uuid": "729f541f07906e703f196da8ef67b9126887fce7"}, "author": "", "url": "https://www.reuters.com/article/us-hedgefunds-activists/activist-investors-demands-rejected-more-in-2017-data-idUSKBN1FK272", "ord_in_thread": 0, "title": "Activist investors' demands rejected more in 2017 -data", "locations": [], "entities": {"persons": [], "locations": [{"name": "boston", "sentiment": "none"}], "organizations": [{"name": "schulte roth & zabel", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOSTON (Reuters) - Corporate chiefs said “no” more often to activist investors in 2017 who approached them with ideas on how to run their businesses and demands to sit on their boards, new data from research group Activist Insight show.\nSo-called settlements where corporations and money managers hammered out their differences without having to ask all shareholders to vote on an issue in a proxy contest dropped to 116 last year from 170 in 2016, the data released on Wednesday show. Activist Insight worked with law firm Schulte Roth & Zabel to compile its annual review.\nThis means that 63 percent of demands were settled in 2016, down from 69 percent the year earlier.\nFor three consecutive years, corporations had become ever more willing to see the activists’ point of view and reach a settlement. That stopped in 2017 when companies surrounded themselves with more advisers who often urged them to fight on, according to managers, lawyers and industry analysts.\nWilliam 'Bill' Ackman, CEO and Portfolio Manager of Pershing Square Capital Management, speaks during the Sohn Investment Conference in New York City, U.S., May 8, 2017. REUTERS/Brendan McDermid In 2017, prominent corporations including consumer products company Procter & Gamble and human resources outsourcing company Automatic Data Processing Inc., rebuffed prominent activist investors Nelson Peltz and William Ackman when they came with new ideas and requests to join the board. Peltz eventually was invited onto the P&G board after a hotly contested proxy contest.\nTo be sure, there were also settlements in 2017. Jeweler Tiffany & Co made a deal with Jana Partners to add three board members. Railroad CSX agreed with Mantle Ridge to hire the late Hunter Harrison as its chief executive and industrial parts company Arconic made a deal to give Elliott Management board seats. But generally the mood appeared to shift to companies preferring to fight harder to keep activist investors at bay.\nActivist Insight data show that 169 board seats were won by activist investors through a settlement last year, nearly five times as many as the 34 seats won through a proxy vote. But in 2016 corporations gave 244 seats to activists through settlements while 29 seats were won through a vote.\n“In 2017, activists could no longer just throw the kitchen sink at a company and hope for the best,” said Josh Black, an analyst at Activist Insight, which tracks activist fund managers and their activities.\nReporting by Svea Herbst-Bayliss; Editing by Andrew Hay\n ", "external_links": [], "published": "2018-01-31T17:09:00.000+02:00", "crawled": "2018-01-31T17:41:21.004+02:00", "highlightTitle": ""}