{"organizations": [], "uuid": "b59559b52d2329c04a37a0b08ce0cb9cf57238c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000666/device/rss", "section_title": "IPOs", "url": "https://www.cnbc.com/2018/01/15/reuters-america-update-1-auto1-says-no-need-for-ipo-after-softbank-invests.html", "country": "US", "domain_rank": 767, "title": "1-Auto1 says no need for IPO after Softbank invests", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T12:13:00.000+02:00", "replies_count": 0, "uuid": "b59559b52d2329c04a37a0b08ce0cb9cf57238c3"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/15/reuters-america-update-1-auto1-says-no-need-for-ipo-after-softbank-invests.html", "ord_in_thread": 0, "title": "1-Auto1 says no need for IPO after Softbank invests", "locations": [], "entities": {"persons": [{"name": "hakan koc", "sentiment": "none"}, {"name": "masayoshi son", "sentiment": "none"}, {"name": "abu dhab", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "saudi arabia", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "softbank", "sentiment": "negative"}, {"name": "financial times", "sentiment": "none"}, {"name": "softbank vision fund", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Softbank fund invests 460 mln euros in used-car platform\n* Investment values business at 2.9 billion euros\n* Auto1 operates in 30 countries, with 35,000 dealers (Updates with interview with co-founder, background)\nBERLIN, Jan 15 (Reuters) - German used-car dealing platform Auto1 said a 460 million euro ($561 million) financial infusion from Japan's Softbank meant it was under no pressure to launch an initial public offering to fund its pan-European growth plans.\nSoftbank, through its Vision Fund, will make around half of its investment via new shares, valuing Auto1 at 2.9 billion euros and supporting the auto trader's international expansion.\nThat money is of the order that Berlin-based Auto1 might have raised with a stock market flotation, co-founder Hakan Koc told Reuters on Monday. \"That's why we aren't considering going to the market for now,\" he said.\nThe Financial Times earlier reported the investment by the Softbank Vision Fund, which was set up by Japan's Masayoshi Son and has raised more than $90 billion, chiefly from the sovereign wealth funds of Saudi Arabia and Abu Dhabi.\nBerlin-based Auto1, founded in 2012, buys cars using its vehicle pricing database to calculate an offer within minutes. It then sells the vehicles on to one of its roughly 35,000 dealerships for a commission.\nAuto1 is virtually unknown to consumers except through its used car buying arm Wir Kaufen dein Auto (We Buy Your Car) in Germany and similar names elsewhere. It operates from Finland to Romania to Portugal, 30 countries in all, but not Britain.\nThe company was set up in Berlin by entrepreneur Christian Bertermann after having trouble selling two old cars owned by his grandmother, along with Koc, who previously worked at Rocket Internet-backed firms Zalando and Home24.\nCompetitors include vehicle distributors Emil Frey AG of Switzerland and AVAG Holding SE of Germany, plus, further afield, U.S. based, used-car retailing behemoths Carmax and Mannheim, a unit of Cox Enterprises.\nVroom, which applies a strategy similar to Auto1 to the U.S. used-car market, has taken in $329 million in funding from T. Rowe Price, General Catalyst and Allen & Co. since its founding in 2013, according to venture funding database Crunchbase.\nAuto1 said it now sells more than 40,000 cars per month. The company achieved revenues of 1.5 billion euros in 2016.\nFollowing its investment, Softbank will own 20 percent of Auto1 while its founders will retain just over 30 percent, ensuring that together they have majority control. With the new funding, Auto1 has raised more than $1 billion in outside financing, according to Crunchbase.\nAkshay Naheta, a partner at Softbank Investment Advisers, will become a member of the supervisory board.\n($1 = 0.8201 euros) (Additional reporting by Eric Auchard; Writing by Douglas Busvine; Editing by Mark Potter)", "external_links": [], "published": "2018-01-15T12:13:00.000+02:00", "crawled": "2018-01-16T09:55:45.001+02:00", "highlightTitle": ""}