{"organizations": [], "uuid": "238a2a3d097e5c0e5661b89ecefc4728a5b66c68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 15}, "facebook": {"likes": 82, "shares": 82, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/25/104794794-GettyImages-632701638.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/28/earnings-have-been-unambiguously-positive-and-its-going-to-get-even-better-says-jpmorgan.html", "country": "US", "domain_rank": 767, "title": "Earnings have been ‘unambiguously positive,’ and it’s going to get even better, says JPMorgan", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T22:00:00.000+02:00", "replies_count": 0, "uuid": "238a2a3d097e5c0e5661b89ecefc4728a5b66c68"}, "author": "Keris Lahiff", "url": "https://www.cnbc.com/2018/01/28/earnings-have-been-unambiguously-positive-and-its-going-to-get-even-better-says-jpmorgan.html", "ord_in_thread": 0, "title": "Earnings have been ‘unambiguously positive,’ and it’s going to get even better, says JPMorgan", "locations": [], "entities": {"persons": [{"name": "parker", "sentiment": "none"}, {"name": "stephen parker", "sentiment": "none"}], "locations": [], "organizations": [{"name": "mcdonald", "sentiment": "none"}, {"name": "boeing", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "exxon mobil", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "jpmorgan", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "at&t", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "18 Hours Ago | 02:06 \nBuckle up: The market is entering one of the busiest weeks of earnings season, and one strategist says the ride could be thrilling. \nMore than 100 S&P 500 Index companies and 10 Dow stocks are due to report in the coming week, a group with a collective value of over $9 trillion. Some of the largest companies reporting earnings in the week ahead include Facebook , Microsoft , Apple , Alphabet , McDonald's , Boeing , AT&T and Exxon Mobil . \nBased on the results we've seen so far, Stephen Parker, head of thematic equity solutions at JPMorgan, says the markets could see a huge boost following these reports. \n\"What we're hearing is unambiguously positive,\" Parker told CNBC's \" Futures Now \" last week. \"Not only is this quarter strong on an absolute basis, but unlike past quarters, we didn't see the sort of analyst revisions downward that you traditionally would always see leading into fourth-quarter earnings.\" \nA lack of downward revisions to earnings estimates makes this quarter \"even more impressive\" than in the past, added Parker. \nThe stats so far back up Parker's fourth-quarter positivity. Just over a quarter of the S&P 500 has reported and 4/5 of those have surpassed analysts' estimates, according to Thomson Reuters. Analysts anticipate 13 percent blended earnings growth — the largest portion contributed by the energy sector. \nThe S&P 500 has added just nearly 4 percent to end at all-time highs over multiple sessions since JPMorgan and Wells Fargo unofficially kicked off the fourth-quarter earnings season on Jan. 12. Over that same period, the Dow Jones Industrial Average has surged 818 points, or 3 percent. \nEven with positive earnings, markets could return to normal volatility following a year of low levels that Parker characterized as \"abnormal.\" That could increase chance of a normal correction in the near term, though Parker recommended keeping the focus on the long term. \n\"We should expect at some point we're going to see some sort of pullback,\" he said. But, \"unless you think that there's a recession in the cards, which we don't see over the next 12 to 18 months, you still want to be buying any kind of weakness you see in the market.\" \nVolatility in 2017 declined for its third year in a row and hit an all-time low in November. The CBOE volatility index , also known as the 'Fear Index,' plummeted 21 percent last year. A steady upward trend over the year led the S&P 500 to see its longest stretch ever without a 3 percent pullback. \nThe trend continues this year: The Dow and S&P have not seen back-to-back losses so far in January, the longest stretch markets have seen in a start to a year. \nParker and JPMorgan are taking a \"barbell approach\" to the market at the moment, whether a pullback is on the cards or not. \n\"We like secular growth stories like technology and healthcare, and we like cyclical value stories like banks and energy,\" he said. \nAll four of those sectors have seen a solid start to the year. Technology has gained 8 percent so far, health care 10 percent, banks 7.5 percent, and energy 7 percent. show chapters ", "external_links": [], "published": "2018-01-28T22:00:00.000+02:00", "crawled": "2018-01-29T00:02:50.001+02:00", "highlightTitle": ""}