{"organizations": [], "uuid": "18a14803282f82936eb7939e2233c0532dba4430", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226957007&w=1200&r=LYNXMPEE0U0UT", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-newsnow-jan31/wednesday-morning-briefing-idUSKBN1FK1PX", "country": "US", "domain_rank": 408, "title": "Wednesday Morning Briefing", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T20:44:00.000+02:00", "replies_count": 0, "uuid": "18a14803282f82936eb7939e2233c0532dba4430"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-newsnow-jan31/wednesday-morning-briefing-idUSKBN1FK1PX", "ord_in_thread": 0, "title": "Wednesday Morning Briefing", "locations": [], "entities": {"persons": [{"name": "larry nassar", "sentiment": "negative"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "mic", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "guantanamo bay", "sentiment": "none"}], "organizations": [{"name": "usa gymnastics", "sentiment": "negative"}, {"name": "fed", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "On the horizon today is former USA Gymnastics doctor Larry Nassar’s second sentencing hearing in Michigan, the Federal Reserve’s first meeting of the year and a larger and brighter “Super Blue Blood Moon” in the sky.\nHighlights\nIt seems that President Trump is finally beginning to stick to the script , with his first State of the Union address lacking many surprises and painting a relatively coherent policy picture. Alongside stressing a commitment to keeping the Guantanamo Bay detention centre open, Trump pushed a hard line on immigration, insisting on a border wall and other concessions from Democrats as part of any deal to protect the children of illegal immigrants.\nOn the business side of things, Trump took credit for U.S. economic gains including a soaring stock market and a low jobless rate. Indeed, world stocks were eyeing their second best start to a year ever , but the dollar came under renewed pressure ahead of the Federal Reserve’s first meeting of the year. The Fed is expected to leave interest rates unchanged while signaling a gradual tightening of monetary policy later this year as the U.S. economy continues to expand and job gains remain solid.\nIt’s an early start for many skywatchers who awoke before dawn to see a rare type of lunar eclipse called a “ Super Blue Blood Moon. ” A number of celestial factors are combining to deliver the particularly unusual spectacle, not seen in North America since 1866 according to the meteorological forecaster AccuWeather.\nWorld\nThree days of deadly clashes between southern Yemeni separatists and an internationally recognized government based in the port of Aden subsided after fighters handed back two military bases they had seized, residents said. The detente followed mediation by a Saudi-led military coalition, which is trying to halt the worst infighting yet among its allies in a wider war against the Houthi movement that controls northern Yemen, including the capital Sanaa.\nAfter declaring they were ready to fight sexual harassment on university campuses, Chinese authorities now appear to be seeking to contain a nascent #MeToo movement . While authorities have been slowly acknowledging in state-media commentaries that there is a systematic problem of sexual harassment on Chinese college campuses, there has been censorship of online postings and some universities have warned students to tone down the campaign, according to women rights activists and students.\nCommentary\nA melting Arctic has opened previously frozen northern trade routes and created new strategic challenges for the United States, which is lagging behind Russia and China in the jostle for influence in the High North. The Pentagon has been reviewing its Arctic strategy, writes columnist Peter Apps . But with only one aging icebreaker against Russia’s forty, the United States may soon “find itself eased out of what could become an important region without any fight at all.”\nBusiness\nJapan’s Fujifilm is set to take over Xerox in a $6.1 billion deal , combining the U.S. company into their existing joint venture to gain scale and cut costs amid declining demand for office printing.\nU.S. exchange operator Nasdaq posted a fourth-quarter profit, helped by higher revenue at its market services unit. The company reported net income attributable of $246 million , or $1.45 per share, in the fourth quarter ended Dec. 31, compared with a loss of $224 million, or $1.35 per share, a year ago.\nSouth Korea’s finance minister said the government has no plans to shut down cryptocurrency trading, welcome news for investors worried that authorities might go as far as China’s tough action in blocking virtual coin platforms.\nOnline shopping may not be the typical domain of the elderly, but when it comes to buying groceries with a smartphone, Xiang Jiang, 70, considers herself rather savvy. Xiang is part of an older generation in China that e-commerce giant Alibaba is looking to tap as broader growth in online retail revenues slow.\nTop stories from Reuters TV\nU.S. agency criticizes Hawaii over false missile alarm\nMay in China to hunt for post-Brexit trade\n ", "external_links": ["https://www.reuters.tv/v/wGy/2018/01/31/may-in-china-the-hunt-for-post-brexit-trade", "http://thomsonreuters.com/en/about-us/trust-principles.html", "https://www.reuters.tv/v/wAA/2018/01/30/u-s-agency-criticizes-hawaii-over-false-missile-alarm"], "published": "2018-01-31T20:44:00.000+02:00", "crawled": "2018-01-31T16:07:16.016+02:00", "highlightTitle": ""}