{"organizations": [], "uuid": "beceb7e37e72115b43836f0c4178ea81be409df8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/24/104965427-9I9B1574.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/24/ceos-in-davos-have-to-admit-they-like-what-they-see.html", "country": "US", "domain_rank": 767, "title": "CEOs in Davos have to admit they like what they see", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T23:08:00.000+02:00", "replies_count": 0, "uuid": "beceb7e37e72115b43836f0c4178ea81be409df8"}, "author": "Liz Moyer", "url": "https://www.cnbc.com/2018/01/24/ceos-in-davos-have-to-admit-they-like-what-they-see.html", "ord_in_thread": 0, "title": "CEOs in Davos have to admit they like what they see", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "blankfein", "sentiment": "none"}, {"name": "lloyd blankfein", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "They have bristled at some of President Donald Trump's words and pushed back at some of the year-old administration's policy stances, but as American CEOs gather in Davos, Switzerland, this week at the World Economic Forum, one thing is clear: They are happier than they were this time last year.\nFears over trade protectionism and immigration have given way to an embrace of the business opportunities created by tax cuts, accelerating economic growth and a buoyant stock market that hit yet another record high during trading on Wednesday.\n\"I kind of adapt to the way the world is,\" Goldman Sachs CEO Lloyd Blankfein said on CNBC's \" Squawk Box \" earlier Wednesday. \"The animal spirits are out there and little bit more vital than they would have been otherwise.\"\nThat \"otherwise\" refers to a different outcome for the 2016 election, which shocked many for the populism that swept Trump into office. From the earliest days of his term, Trump has angered some CEOs for his stance on immigration and other social issues, but his push for tax reform was universally embraced.\nTweet\nBlankfein has used his verified Twitter account over the last year to lob veiled criticisms at the administration, but he admits he has \"really liked \" what Trump has done for the economy so far. \"I'd say I like a lot more stuff than I don't like, and some of the stuff I don't like I really don't like,\" he said on CNBC.\n\"I think he's going out of his way to be very, very supportive of the system and I don't want to be antagonistic to that,\" Blankfein said Wednesday. \"Frankly, I want to honor that.\"\nFellow CEOs offered similarly conciliatory messages as the attendees of the annual confab of billionaires, politicians and business leaders awaited Trump's remarks later this week. He will be the first sitting president to attend the summit in two decades , and will have to strike a delicate balance between the anti-globalism sentiment that got him elected and his intention to strike business deals.\nHe is still a polarizing force, as some attendees acknowledge. \"You can't expect everybody here to love everything he says,\" as Carlyle Group co-CEO David Rubenstein told CNBC. \"But I think he'll have a message that will be reasonably well received.\"\nTwo years ago, Davos attendees saw then-candidate Trump as a long-shot. Last year, Trump, just days from his inauguration, was viewed with a great deal of skepticism.\nThough he has pulled the U.S. out of the Trans Pacific Partnership trade agreement and has threatened to quit the 23-year-old North American Free Trade Agreement with Mexico and Canada, Trump hasn't completely overhauled American trade policy, yet. That, and the passage of tax reform are giving CEOs reason for optimism.\n\"If you want America to be competitive, you need a competitive tax system,\" J. P. Morgan Chase CEO Jamie Dimon told CNBC on Wednesday.\nThough he has been critical of Trump in the last year, quitting a presidential advisory council like other CEOs after Trump's remarks about the Charlottesville violence that did not condemn white supremacists, Dimon has put out an olive branch before.\nAt J. P. Morgan's annual meeting last spring, shareholders asked him about his support of Trump. \"He is the President of the United States. I believe he is the pilot flying our airplane,\" Dimon said at the time. \"I would try to help any President of the United States because I'm a patriot.\"\nSome of the CEOs in Davos this week have said they are looking to see what Trump says about trade. Ginny Rometty, IBM's CEO, told CNBC, many of the trade agreements \"need modernization.\"\nSalesforce.com's CEO Marc Benioff, said, \"I want him to bring everybody together in a positive way\" in a unifying speech \"that shows the United States' role in the world, setting values and has a clear North Star.\"", "external_links": [], "published": "2018-01-24T23:08:00.000+02:00", "crawled": "2018-01-24T23:25:58.006+02:00", "highlightTitle": ""}