{"organizations": [], "uuid": "03d32dfff1447355eff9965061e59c804bac0985", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180115.html", "section_title": "Archive News &amp; Video for Monday, 15 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-malaysia-humantrafficking/malaysia-plans-special-court-on-human-trafficking-as-cases-soar-idUSKBN1F41JW", "country": "US", "domain_rank": 408, "title": "Malaysia plans special court on human trafficking as cases soar", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.948, "site_type": "news", "published": "2018-01-15T20:34:00.000+02:00", "replies_count": 0, "uuid": "03d32dfff1447355eff9965061e59c804bac0985"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-malaysia-humantrafficking/malaysia-plans-special-court-on-human-trafficking-as-cases-soar-idUSKBN1F41JW", "ord_in_thread": 0, "title": "Malaysia plans special court on human trafficking as cases soar", "locations": [], "entities": {"persons": [{"name": "zahid hamidi", "sentiment": "none"}], "locations": [{"name": "malaysia", "sentiment": "none"}, {"name": "bangladesh", "sentiment": "none"}, {"name": "nepal", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}, {"name": "selangor", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "kuala lumpur", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KUALA LUMPUR (Thomson Reuters Foundation) - Malaysia is setting up a special court to tackle rising numbers of human trafficking cases, in a move welcomed by campaigners who said it would help deliver justice to victims.\nThe Southeast Asian nation relies heavily on foreign domestic workers as well as laborers from countries including Indonesia, Bangladesh and Nepal for jobs shunned by locals including work on plantations and in construction.\nIt has nearly two million registered migrant workers, according to government data, but rights groups say there are also many others who work in the country without permits.\nBut advocacy groups say many of the workers are victims of human trafficking and debt bondage, who had to fork out huge sums to pay recruiters in return for jobs that paid much less than the ones they were promised.\nUnder a pilot project, the special court is expected to be set up as early as May in the central state of Selangor, with a dedicated judge to hear cases, before it is gradually rolled out in other parts of the country.\nMalaysia’s deputy premier Zahid Hamidi said authorities hoped the court would help expedite human trafficking cases and boost public awareness of the crime, state media Bernama Quote: d him as saying on Saturday.\nKuala Lumpur-based group Tenaganita, which works with refugees and migrant workers, welcomed the project, saying trafficking victims have often reluctant to fight their case in court due to a lengthy legal process and a lack of support.\n“Most of the trafficking victims are foreigners, they don’t want to wait for a long time to testify in court,” its director Aegile Fernandez told the Thomson Reuters Foundation by phone.\n“The longer you keep them, the more they are traumatised and they just want to go home, then all the efforts to get the perpetrators are wasted.”\nAlex Ong of advocacy group Migrant Care cautioned that the move should not be done only to appease U.S. officials in order to get an upgrade on the State Department’s annual Trafficking in Persons report.\nMalaysia has said it was hoping to achieve a Tier 1 rating on the report, after it was upgraded to Tier 2 last year from the Tier 2 Watch List in 2016.\nTier 2 means it was not fully complying with U.S. standards but was making significant efforts to do so.\n“The establishment of a human trafficking court should be functional, not window dressing,” Ong said. “Human trafficking court is just a name. Human trafficking activities remain rampant.”\nReporting by Beh Lih Yi @behlihyi, Editing by Ros Russell; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T20:34:00.000+02:00", "crawled": "2018-01-16T13:20:31.001+02:00", "highlightTitle": ""}