{"organizations": [], "uuid": "e5b0e7c699db4bbc1122f607b1e6692fd1269082", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180106&t=2&i=1219861559&w=1200&r=LYNXMPEE050G0", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-cup/coventry-pile-misery-on-stoke-manchester-city-ease-through-idUKKBN1EV0LA", "country": "US", "domain_rank": 408, "title": "Coventry pile misery on Stoke, Manchester City ease through", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T19:24:00.000+02:00", "replies_count": 0, "uuid": "e5b0e7c699db4bbc1122f607b1e6692fd1269082"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-cup/coventry-pile-misery-on-stoke-manchester-city-ease-through-idUKKBN1EV0LA", "ord_in_thread": 0, "title": "Coventry pile misery on Stoke, Manchester City ease through", "locations": [], "entities": {"persons": [{"name": "martyn herman", "sentiment": "none"}, {"name": "stephen ireland", "sentiment": "none"}, {"name": "steve cook", "sentiment": "none"}, {"name": "mark hughes", "sentiment": "none"}, {"name": "jack grimmer", "sentiment": "none"}, {"name": "jordan willis", "sentiment": "none"}], "locations": [{"name": "manchester city", "sentiment": "none"}, {"name": "bournemouth", "sentiment": "none"}, {"name": "stoke city - ricoh arena", "sentiment": "none"}, {"name": "leicester city", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "coventry city", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "ricoh arena", "sentiment": "none"}], "organizations": [{"name": "coventry", "sentiment": "negative"}, {"name": "stoke city", "sentiment": "none"}, {"name": "football league", "sentiment": "none"}, {"name": "coventry city", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "wigan athletic", "sentiment": "none"}, {"name": "reuters/carl recine  former cup winners coventry", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 6, 2018 / 5:26 PM / Updated 39 minutes ago Coventry pile misery on Stoke, Chelsea held by Norwich Martyn Herman 4 Min Read \nLONDON (Reuters) - Fourth-tier Coventry City piled on the misery for Stoke City manager Mark Hughes by pulling off the only genuine upset on a hectic day of FA Cup third-round action on Saturday. Soccer Football - FA Cup Third Round - Coventry City vs Stoke City - Ricoh Arena, Coventry, Britain - January 6, 2018 Coventry City’s Jack Grimmer celebrates scoring their second goal as Stoke City's Stephen Ireland looks dejected Action Images via Reuters/Carl Recine \nFormer Cup winners Coventry, now plying their trade in the bottom division of the Football League, revived memories of happier times as Jordan Willis and Jack Grimmer scored the goals in a 2-1 victory at the Ricoh Arena. \nElsewhere, the 25 ties offered only crumbs for the romantics seeking Cup magic although second tier Norwich City did hold champions Chelsea to a 0-0 draw. \nTop-flight Bournemouth needed a late Steve Cook goal to draw 2-2 at home to League One leaders and 2013 Cup winners Wigan Athletic and Leicester City drew 0-0 at third-tier Fleetwood Town who struck the post in stoppage-time. \nChelsea manager Antonio Conte made nine changes and his side struggled to make clear-cut chances in a dour game at Norwich who created the better opportunities. \nRunaway Premier League leaders Manchester City maintained their pursuit of an unprecedented four trophies, Sergio Aguero scoring twice as they came from a goal down to beat Burnley 4-1. \nGoals by Leroy Sane and Bernardo Silva killed off Burnley who had led at halftime thanks to an Ashley Barnes effort. \nSeveral clubs in the thick of the Premier League relegation battle survived potential banana skins. \nAlan Pardew enjoyed his first win as West Bromwich Albion manager as his team beat fourth-tier Exeter City 2-0, Southampton overcame Championship Fulham 1-0 and bottom club Swansea City held on for a worthy 0-0 draw at free-scoring Championship leaders Wolverhampton Wanderers. \nSeven-times Cup winners Aston Villa, fifth in the Championship, lost 3-1 at home to third-tier Peterborough United while Brentford, also from the second tier, were humbled by fourth-tier Notts County with Jon Stead scoring the winner. RELEGATION ZONE Soccer Football - FA Cup Third Round - Norwich City vs Chelsea - Carrow Road, Norwich, Britain - January 6, 2018 Norwich City's Josh Murphy in action with Chelsea’s Davide Zappacosta Action Images via Reuters/John Sibley \nStoke manager Hughes would have hoped for respite after his side’s tumble into the Premier League’s relegation zone, but there was none coming in the Midlands clash as they suffered a sixth defeat in the last eight matches. \n“It’s clearly a difficult time for us. When we make mistakes, they’re getting penalised,” Hughes said. \n“We’re all under pressure. I can take the pressure and the focus. I‘m not naive and I realise people will talk about my position. But we’ve got good owners who will make the right decisions for the club.” Slideshow (13 Images) \nCoventry won the Cup in 1987 but have been on a downward spiral since they were relegated from the top flight in 2001 and are in England’s bottom tier for the first time since 1959. \nBut there are signs of a revival and the mood was, for a change, joyous on Saturday. \nWillis headed Coventry in front and although Charlie Adam levelled for Stoke from the penalty spot Grimmer fired home Coventry’s winner in the 68th minute. \nManager Mark Robins said he would love to draw his old club Manchester United in round four. \n“For us it’s brilliant, we’re in the fourth-round draw. Hopefully, we’ll get a big club away from home - United away would be perfect,” he said. \nNewcastle United scored three times in nine minutes - Ayoze Perez with two - to see off League Two leaders Luton Town while fellow top-flight side Watford made light of a poor recent run to beat second-tier high-fliers Bristol City who are in League Cup semi-final action against Manchester City next week. \nIn a north-east derby, Middlesbrough deepened Sunderland’s gloom with a 2-0 victory at the Riverside Stadium. \nFA Cup holders Arsenal face Nottingham Forest on Sunday. Reporting by Martyn Herman, editing by Ed Osmond", "external_links": [], "published": "2018-01-06T19:24:00.000+02:00", "crawled": "2018-01-06T19:37:00.008+02:00", "highlightTitle": ""}