{"organizations": [], "uuid": "845bfeef9febe223a4e888a87eaef03201a32d14", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180120&t=2&i=1223687389&w=1200&r=LYNXMPEE0J0RT", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-mexico-election-corral/vowing-anti-graft-revolution-mexican-governor-shakes-election-idUKKBN1F912H", "country": "US", "domain_rank": 408, "title": "Vowing anti-graft revolution, Mexican governor shakes election", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T21:36:00.000+02:00", "replies_count": 0, "uuid": "845bfeef9febe223a4e888a87eaef03201a32d14"}, "author": "", "url": "https://uk.reuters.com/article/uk-mexico-election-corral/vowing-anti-graft-revolution-mexican-governor-shakes-election-idUKKBN1F912H", "ord_in_thread": 0, "title": "Vowing anti-graft revolution, Mexican governor shakes election", "locations": [], "entities": {"persons": [{"name": "corral", "sentiment": "none"}, {"name": "enrique pena nieto", "sentiment": "none"}, {"name": "pancho villa", "sentiment": "none"}, {"name": "javier corral", "sentiment": "none"}], "locations": [{"name": "chihuahua", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "chihuahua", "sentiment": "none"}], "organizations": [{"name": "villa", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "mexica", "sentiment": "none"}, {"name": "frank jack daniel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 20, 2018 / 7:39 PM / Updated an hour ago Vowing anti-graft revolution, Mexican governor shakes election Frank Jack Daniel 5 Min Read \nCHIHUAHUA, Mexico (Reuters) - Invoking Pancho Villa’s revolutionary legacy and armed with a hard-hitting corruption investigation into the country’s ruling party, the governor of border state Chihuahua is shaking up Mexico’s presidential election, without being in the race. \nGovernor Javier Corral’s national profile exploded in late December when his prosecutors arrested a senior figure in President Enrique Pena Nieto’s party for his role in an alleged scheme to siphon $13 million of state funds for electoral campaigns. \nThe election financing irregularities his government is probing in Chihuahua, where five people have been jailed for political corruption under his predecessor, should now be investigated in other states, Corral told Reuters in an interview on Friday. \n“We want a true revolution in this country,” the mustachioed governor said in his wood paneled office, hung with a large portrait of Villa, the legendary general of the Mexican revolution a century ago who lived and died in the state. \nVilla put Chihuahua at the forefront of change in Mexico, something Corral said he wanted to repeat, this time with an unarmed revolution aimed at breaking what he called an “impunity pact” agreed by the political class that cuts across party lines and turns a blind eye to corrupt practices. \nOn Saturday, Corral launched a two-week cross country protest caravan that will tour 1,124 miles (1,810 km) from Ciudad Juarez to Mexico City to keep attention on his cause. \nA member of the opposition National Action Party, Corral says none of this is linked to the July 1 election. But his actions are widely seen as benefiting Ricardo Anaya, the party’s candidate in coalition with a center party. \nCorral said he wants Anaya to win, but would be happy with leftist Andres Manuel Lopez Obrador, or most other presidential hopefuls apart from the candidate of Pena Nieto’s Institutional Revolutionary Party (PRI), Jose Antonio Meade. \n“He represents everything we are fighting against,” Corral said. \nSince Pena Nieto took office in 2012, corruption scandals, many in states ruled by the PRI, have repeatedly rocked the government. However, investigations have mostly tracked personal enrichment rather than how graft is used to finance politics. \n“Really? It didn’t favor the PRI in Veracruz, in Quintana Roo, in Nuevo Leon?” said an incredulous Corral, listing states where former governors have been investigated for graft. \nWhen the federal government withheld some $36 million in federal financing to Chihuahua after the arrest of PRI operative Alejandro Gutierrez last month, Corral broke with Mexican political etiquette by vocally accusing Pena Nieto’s administration of using the budget as a weapon to control unruly states. \n“It’s the carrot for those who behave themselves and the stick for those who behave badly,” he said. \nThe federal government says funds were cut to Chihuahua for budgetary and technical reasons, not as revenge, and Pena Nieto has criticized Corral for politicizing the matter. LONELY CRUSADE \nSo far, Corral’s crusade has been lonely. While all the presidential candidates vow to crush corruption, several state governors, including some from his own party, have questioned Corral’s claim that the federal government is bullying him. \nHowever, as well as providing a sideshow to an otherwise unremarkable start to campaigning for the election, Corral’s investigation into campaign financing could have consequences for the race itself if it claims more high profile scalps or spreads to other states. \nThere are already signs Corral’s pressure on the government is having repercussions in his drive to bring his fugitive predecessor Cesar Duarte back to Mexico to face justice and pay back the $300 million dollars Corral says he stole. \nDuarte denied accusations of wrongdoing before disappearing from public view. His whereabouts have been unclear since around the time his term finished in October 2016. \nThis week, Meade sharpened his own rhetoric against corruption. Days later, and five months after Corral first sought his arrest, the office of Mexico’s attorney general announced that it was seeking the extradition of Duarte from a unnamed country believed to be the United States. \nCorral welcomed that move, but said too much advance warning was given, maybe allowing Duarte to escape. He said his predecessor must be brought home to face justice. \n“We don’t only want him to face the maximum sentence, more than anything we want him to pay back the damage he caused to the state’s wealth,” he said. Reporting by Frank Jack Daniel; Editing by Daniel Wallis", "external_links": [], "published": "2018-01-20T21:36:00.000+02:00", "crawled": "2018-01-20T22:07:13.007+02:00", "highlightTitle": ""}