{"organizations": [], "uuid": "133122aa9669ac5b9d14e0f05e24e15bb71a7e85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180106&t=2&i=1219890147&w=1200&r=LYNXMPEE050J8", "site_section": "http://feeds.reuters.com/reuters/topNews?format=xml", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-usa-trump-arabs/arab-league-to-lobby-u-n-to-recognize-palestinian-state-idUSKBN1EV0PG", "country": "US", "domain_rank": 408, "title": "Arab League to lobby U.N. to recognize Palestinian state", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T22:43:00.000+02:00", "replies_count": 0, "uuid": "133122aa9669ac5b9d14e0f05e24e15bb71a7e85"}, "author": "", "url": "https://www.reuters.com/article/us-usa-trump-arabs/arab-league-to-lobby-u-n-to-recognize-palestinian-state-idUSKBN1EV0PG", "ord_in_thread": 0, "title": "Arab League to lobby U.N. to recognize Palestinian state", "locations": [], "entities": {"persons": [{"name": "ayman safadi", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "jordan", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "jerusalem", "sentiment": "none"}, {"name": "egypt", "sentiment": "none"}, {"name": "amman", "sentiment": "none"}, {"name": "united arab emirates", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "saudi arabia", "sentiment": "none"}, {"name": "east jerusalem", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "morocco", "sentiment": "none"}, {"name": "cairo", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}, {"name": "jordan", "sentiment": "none"}], "organizations": [{"name": "arab league", "sentiment": "negative"}, {"name": "u.n.", "sentiment": "negative"}, {"name": "united nations", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  amman", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 6, 2018 / 8:43 PM / Updated an hour ago Arab League to lobby U.N. to recognize Palestinian state Reuters Staff 4 Min Read \nAMMAN (Reuters) - Arab states will soon embark on a diplomatic drive to persuade the United Nations to recognize a Palestinian state with East Jerusalem as its capital on territory captured by Israel in the 1967 war, Jordan’s Foreign Minister Ayman Safadi said. \nSix Arab foreign ministers met in Amman on Saturday to follow up on earlier decisions taken by the Arab League to counter U.S. President Donald Trump’s move in December to recognize Jerusalem as Israel’s capital, a decision that overturned decades of U.S. policy on the Middle East. \nA committee made up of Egypt, Morocco, Saudi Arabia, the United Arab Emirates, the Palestinians and headed by Jordan was set up after an emergency meeting of the Arab League in Cairo shortly after Trump’s decision that called on Washington to abandon its decision. \nThe Arab League said at the time the move would spur violence throughout the region and described Trump’s announcement as a “dangerous violation of international law” which had no legal impact. \nSafadi said the ministers would recommend a series of moves to a full ministerial meeting of the Arab League due later this month. \n“We will confront the decision by seeking a (U.N.) resolution, an international one, to recognize a Palestinian state on 1967 borders with Jerusalem as its capital,” said Safadi. \nHe did not elaborate on the timing of the diplomatic moves nor say whether he was referring to a U.N. Security Council or General Assembly resolution. \nArab League Secretary-General Ahmed Aboul Gheit said the ministerial meeting would also discuss Washington’s role in future Arab-Israeli peacemaking that members states said was now jeopardized by what they see as U.S. bias towards Israel. \n“We want to lessen any losses on the Palestinian side and lessen the Israeli gains,” Aboul Gheit added. \nArab states would also discuss whether to convene an extraordinary summit of their leaders or wait until a scheduled summit in the Saudi capital Riyadh at the end of March, he added. \nTrump’s recognition of Jerusalem has infuriated the Arab world and upset Western allies, who say it is a blow to peace efforts and risks sparking more violence in the region. \nPalestinians claim East Jerusalem as the capital of a future state. Israel regards Jerusalem as its eternal and indivisible capital. \nMost countries consider East Jerusalem, which Israel annexed after capturing it from Jordan in a 1967 war, to be occupied territory, and say the status of the city should be decided at future Israeli-Palestinian talks. \nOn Dec. 18, the United States blocked a United Nations Security Council call for Trump’s declaration on Jerusalem to be withdrawn. \nThree days later, more than 120 countries defied Trump and voted in favor of a United Nations General Assembly resolution calling for the United States to drop its recognition of Jerusalem as Israel’s capital. \nIn 2012, the U.N. General Assembly overwhelmingly approved the de facto recognition of the sovereign state of Palestine in a resolution that said the status of Jerusalem should be resolved through negotiations. Reporting by Suleiman Al-Khalidi; Editing by Adrian Croft", "external_links": [], "published": "2018-01-06T22:43:00.000+02:00", "crawled": "2018-01-06T22:53:56.024+02:00", "highlightTitle": ""}