{"organizations": [], "uuid": "26ada8a088c77c357b0d21532597abcd3128e5a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 21, "shares": 21, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/04/104928767-VenturaCounty_truckloads.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/after-big-wildfire-losses-southern-california-braces-for-new-threat--mudslides.html", "country": "US", "domain_rank": 767, "title": "After big wildfire losses, Southern California braces for new threat — mudslides", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.789, "site_type": "news", "published": "2018-01-05T00:27:00.000+02:00", "replies_count": 0, "uuid": "26ada8a088c77c357b0d21532597abcd3128e5a6"}, "author": "Jeff Daniels", "url": "https://www.cnbc.com/2018/01/04/after-big-wildfire-losses-southern-california-braces-for-new-threat--mudslides.html", "ord_in_thread": 0, "title": "After big wildfire losses, Southern California braces for new threat — mudslides", "locations": [], "entities": {"persons": [{"name": "thomas", "sentiment": "none"}, {"name": "tom fayram", "sentiment": "none"}], "locations": [{"name": "southern california", "sentiment": "none"}], "organizations": [{"name": "consortium media ventura county public works agency", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A winter storm is forecast to strike next week in Southern California that could bring up to 4 inches of rain and result in mudslides or flooding in some wildfire-scarred areas.\nCrews were scrambling this week to clean out debris in catch basins and prepare for heavy rains forecast to fall in burn areas Tuesday into Wednesday. The absence of vegetation and roots in burned-out hillsides and canyons makes them more susceptible to mudslides and even landslides, officials said.\n\"To think that there won't be flooding would be very foolish,\" Tom Fayram, water resources deputy director for Santa Barbara County Public Works, said in an interview Thursday. \"We've actually started while the fire is still burning clearing about 11 debris basins.\"\nThe region's first major winter storm could bring rain to Ventura and Santa Barbara counties where the Thomas fire has burned as well as precipitation to residential areas in Los Angeles where other recent blazes have left hillsides bare of vegetation and prone to mudslides and flooding.\nshow chapters The California wildfires are the worst this firefighter has seen 8:14 PM ET Tue, 12 Dec 2017 | 02:19 \"We have a lot of steep, fire-denuded hill slopes where a lot of heavy rain at once could cause flooding and debris flows,\" said Paul Meznarich, U.S. Forest Service spokesman for the Thomas fire, told CNBC. \"We want rain but we don't want a lot of it coming down hard in a short period of time because that brings its own problems with it.\"\nThe National Weather Service is forecasting there could be about 2 to 4 inches of rain in the foothills and mountains areas of some of the recent burned areas from the approaching storm. There also is significant rain forecast for the coastal and other areas of the region.\nJayme Laber, a hydrologist at the NWS office in Oxnard, California, said forecast models are showing that rain rates Tuesday into Wednesday in recent burn areas could approach a rate of about one-half-inch an hour, or enough to trigger flashfloods and debris flows.\n\"Any recent burn area is considered a risk for mud and debris flow in the event there is a large amount of rain,\" said Capt. Erik Scott of the Los Angeles Fire Department.\nWildfires often happen in September and October in Southern California and give local public works agencies time to prepare for the winter rains. However, given the Thomas fire started in December it has left little time for communities to prepare for the major storm system next week.\nGene Blevins | Reuters Fire fighters attack the Thomas Fire’s north flank with backfires as they continue to fight a massive wildfire north of Los Angeles, near Ojai , California, U.S., December 9, 2017. Overall, the Thomas fire — the largest wildfire in California history — has scorched nearly 282,000 acres, or about 440 square miles, and destroyed or damaged more than 1,300 structures. The blaze, which also has caused losses to agriculture exceeding $171 million , was 92 percent contained as of Thursday morning.\nIn Ventura County, the fire destroyed homes from Santa Paula to Ventura and left bare slopes along a coastal highway that connects Ventura to Santa Barbara.\nSome of the burned areas have a history of major debris flows and flooding after fires.\nFor example, the western Ventura County town of La Conchita, where slopes burned last month, experienced a deadly mudslide in 2005 after rains. That event killed 10 people and destroyed more than a dozen homes.\n\"The whole face of that slope [in La Conchita] burned,\" said Jim O'Tousa, a Ventura County geologist. \"We are concerned about debris flows off that slope and out of the canyons on either side.\"\nAnother potential danger is hillsides that burned above Summerland, Montecito and Carpinteria in Santa Barbara County.\nThe Santa Barbara County Board of Supervisors held a special meeting Wednesday to discuss the flooding risk and heard how county workers are already clearing debris basins from burned areas in preparation for the storm.\nMeantime, in LA County where the so-called Creek and Skirball fires burned homes and hills in December there are preparations underway for the approaching storm. Also, more than 100 fire stations in the LA area are providing sandbags for residents to use as a way to protect homes.\nBesides December's fires, LA Fire's Scott said a concern with the approaching storm is areas burned in September's so-called La Tuna fire — the largest acreage fire in LA city history. Even so, local agencies have had more time to perform field work to shore up those burn areas that may cause mudslides.\nWATCH: Wildfires getting worse and more expensive to fight show chapters Wildfires are getting worse and more expensive to fight than ever before 10:47 AM ET Tue, 12 Dec 2017 | 01:40", "external_links": [], "published": "2018-01-05T00:27:00.000+02:00", "crawled": "2018-01-05T00:26:48.027+02:00", "highlightTitle": ""}