{"organizations": [], "uuid": "f4f1cadc5f7e7dc72a48f6d104d2721727f2416e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/03/01/103433792-IMG_8004.1910x1000.JPG", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/16/us-stock-market-is-a-bubble-says-sovereign-wealth-fund-advisor.html", "country": "US", "domain_rank": 767, "title": "US stock market is a bubble, says sovereign wealth fund advisor", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.207, "site_type": "news", "published": "2018-01-16T17:00:00.000+02:00", "replies_count": 0, "uuid": "f4f1cadc5f7e7dc72a48f6d104d2721727f2416e"}, "author": "Matthew J. Belvedere", "url": "https://www.cnbc.com/2018/01/16/us-stock-market-is-a-bubble-says-sovereign-wealth-fund-advisor.html", "ord_in_thread": 0, "title": "US stock market is a bubble, says sovereign wealth fund advisor", "locations": [], "entities": {"persons": [{"name": "komal sri-kumar", "sentiment": "negative"}, {"name": "sri-kumar", "sentiment": "none"}, {"name": "alan greenspan", "sentiment": "none"}, {"name": "greenspan", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}], "organizations": [{"name": "sri-kumar global strategies", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Komal Sri-Kumar, whose economic consultancy advises multinational firms and sovereign wealth funds, believes a stock market reckoning is coming.\n\"I think it is a bubble,\" the founder of Sri-Kumar Global Strategies told CNBC on Tuesday before the Dow Jones industrial average broke through 26,000 and the S&P 500 eclipsed 2,800 on the open, continuing the bullish start to 2018 and last year's powerful rally.\n\"You can have this bubble get bigger,\" Sri-Kumar acknowledged. \"But the question is how big does it get? Irrationality can last a long time.\"\nSri-Kumar was evoking former Federal Reserve Chairman Alan Greenspan 's famous \"irrational exuberance\" speech in December 1996. Greenspan asked at the time, \"How do we know when irrational exuberance has unduly escalated asset values, which then become subject to unexpected and prolonged contractions?\"\nIn making his point for continued upside in the market before a plunge, Sri-Kumar pointed out on \"Squawk Box\" the stock bubble of the 1990s did not burst until 2000, more than three years after Greenspan's prescient words.\n\"The true downside [now] is for the equities to continue to rise and to have a much sharper fall at some point in time,\" Sri-Kumar predicted.\nA decline of \"5 percent, or even 10 percent, is nothing,\" he said. \"You have to talk in terms of a 15 percent to 20 percent decline. But the question is when does it happen? The answer is the later it happens the bigger the magnitude of the decline.\"\nThe last time there was a correction, defined as a decline from new highs of at least 10 percent, was from late 2015 to early 2016, according to Yardeni Research .\nBut the top-end 20 percent drop that Sri-Kumar was warning about would qualify as bear market. The last true bear market was during the financial crisis from 2008 to early 2009 when stock prices were cut in half.\nBillionaire investor Sam Zell also sees \"irrational exuberance\" in stocks. The founder and chairman of Equity Group Investments told CNBC later Tuesday the record market rally is based on emotions not fundamentals .\nBut David Bianco, strategist at Deutsche Asset Management, sees it differently. He told \"Squawk Box\" separately on Tuesday, \"We don't think it's irrational because the earnings growth will be there in 2018. The economy is healthy.\"\nStock valuations are supported by interest rates, which remain low despite the Fed's three rate hikes last year and projections for three more in 2018, Bianco said.\nPrice-to-earnings ratios are certainly historically high, \"but we don't think the 10-year Treasury yield materially exceeds 3 percent\" for the rest of the business cycle, he said.\nThe 10-year yield, which was trading around 2.5 percent early Tuesday, touched 3 percent at the end of 2013 before cratering again and reaching a record low under 1.4 percent in July 2016.\nWATCH: Strategist David Bianco: We don't see the market rally as irrational show chapters Chief investment strategist: Expect tech to ‘modestly’ outperform for next two to three years 8 Hours Ago | 03:10 Morning Squawk: CNBC's before the bell news roundup Sign up to get Morning Squawk each weekday\nJob Industry Advertising/Marketing Automotive Communications/PR Construction/Manufacturing Education Finance/Banking/Insurance Legal Media/Entertainment Medical/Health Care Mining/Oil/Gas/Utilities Gov't/Non-Profit Real Estate Retail Technology/IT Transportation/Shipping Travel/Hospitality Other Get this delivered to your inbox, and more info about about our products and service. Privacy Policy . Submit Please enter a valid email address", "external_links": [], "published": "2018-01-16T17:00:00.000+02:00", "crawled": "2018-01-16T17:07:49.002+02:00", "highlightTitle": ""}