{"organizations": [], "uuid": "c05042165a2edcaf0d1443a23703c8637adc7b3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222484042&w=1200&r=LYNXMPEE0F19E", "site_section": "http://feeds.reuters.com/reuters/politicsNews", "section_title": "Reuters: Politics", "url": "https://www.reuters.com/article/us-usa-congress-surveillance/senate-to-vote-to-renew-nsas-internet-surveillance-program-idUSKBN1F528V", "country": "US", "domain_rank": 408, "title": "Senate to vote to renew NSA's internet surveillance program", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T19:34:00.000+02:00", "replies_count": 0, "uuid": "c05042165a2edcaf0d1443a23703c8637adc7b3d"}, "author": "", "url": "https://www.reuters.com/article/us-usa-congress-surveillance/senate-to-vote-to-renew-nsas-internet-surveillance-program-idUSKBN1F528V", "ord_in_thread": 0, "title": "Senate to vote to renew NSA's internet surveillance program", "locations": [], "entities": {"persons": [{"name": "edward snowden", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "dustin volz", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "negative"}, {"name": "nsa", "sentiment": "negative"}, {"name": "house of representatives", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "national security agency", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - The U.S. Senate on Tuesday planned to vote to advance a bill to renew the National Security Agency’s warrantless internet surveillance program, as privacy advocates made a final push to derail the measure.\nThe legislation would extend the NSA program, which gathers information from foreigners overseas but incidentally collects an unknown amount of communications belonging to Americans. The bill - which easily passed the House of Representatives last week despite mixed signals posted on Twitter by President Donald Trump - would renew the surveillance program for six years with minimal changes.\nThe measure’s passage would mark a disappointing end to a years-long effort by a coalition of liberal Democrats and libertarian-leaning Republicans to redefine the scope of U.S. intelligence collection, fueled by the 2013 disclosures of classified surveillance secrets by former NSA contractor Edward Snowden.\nThe legislation requires 60 votes to avoid a Senate filibuster that could delay or block it.\nThe authorization, formally known as Section 702 of the Foreign Intelligence Surveillance Act (FISA), is set to expire on Friday unless the Senate and Trump sign off, although intelligence officials say it could continue to operate until April.\nThe bill allows the NSA to eavesdrop on vast amounts of digital communications from foreigners living outside the United States via American companies like Facebook Inc, Verizon Communications Inc and Alphabet Inc’s Google.\nBut the program also incidentally scoops up Americans’ communications, including when they communicate with a foreign target living overseas, and can search those messages without a warrant.\nThe White House, U.S. intelligence agencies and congressional Republican leaders have said the program is indispensable to national security, vital to protecting U.S. allies and needs little or no revision.\nPrivacy advocates say it allows the NSA and other intelligence agencies to grab data belonging to Americans in a way that represents an affront to the U.S. Constitution.\n“Without additional meaningful constraints, Congress is allowing the government to use information collected without a warrant against Americans in domestic court proceedings,” Republican Senator Rand Paul and Democratic Senator Ron Wyden, vocal opponents of the legislation, wrote in a letter to Senate colleagues last week.\nOther proposals introduced in Congress would have required investigators obtain a warrant before sifting through emails belonging to Americans.\nThe measure before the Senate on Tuesday does add a narrow warrant requirement for cases where the Federal Bureau of Investigation seeks emails related to an existing criminal investigation that has no relevance to national security.\nReporting by Dustin Volz; Editing by Jonathan Oatis\n ", "external_links": [], "published": "2018-01-16T19:34:00.000+02:00", "crawled": "2018-01-16T19:49:27.014+02:00", "highlightTitle": ""}