{"organizations": [], "uuid": "285420ad48c18269d3b354d8248fc8107987b9fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-lithium-americas-announces-filing-of-canadian-base-shelf-prospectus-and-u-s-shelf-registration-statement.html", "country": "US", "domain_rank": 767, "title": "Lithium Americas Announces Filing of Canadian Base Shelf Prospectus and U.S. Shelf Registration Statement", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T17:04:00.000+02:00", "replies_count": 0, "uuid": "285420ad48c18269d3b354d8248fc8107987b9fb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-lithium-americas-announces-filing-of-canadian-base-shelf-prospectus-and-u-s-shelf-registration-statement.html", "ord_in_thread": 0, "title": "Lithium Americas Announces Filing of Canadian Base Shelf Prospectus and U.S. Shelf Registration Statement", "locations": [], "entities": {"persons": [{"name": "tom hodgson", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "vancouver", "sentiment": "none"}, {"name": "british columbia", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "lithium americas", "sentiment": "none"}, {"name": "quebec", "sentiment": "none"}], "organizations": [{"name": "lithium americas corp.", "sentiment": "negative"}, {"name": "globe newswire", "sentiment": "negative"}, {"name": "sec", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "u.s. securities and exchange commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VANCOUVER, British Columbia, Jan. 18, 2018 (GLOBE NEWSWIRE) -- Lithium Americas Corp. (TSX:LAC) (OTCQX:LACDF) (\"Lithium Americas\" or the \"Company\") announced today that it has filed a preliminary short form base shelf prospectus in each province of Canada, other than the Province of Quebec, to qualify the distribution, from time to time over a 25-month period, of up to US$500 million of the Company’s debt and equity securities. The Company also filed a corresponding shelf registration statement with the U.S. Securities and Exchange Commission (the “SEC”) on Form F-10 under the Multijurisdictional Disclosure System.\nThe terms of future offerings, if any, will be established at the time of such offerings. At the time any of the securities covered by the shelf prospectus are offered for sale, a prospectus supplement containing specific information about the terms of any such offering will be filed with applicable Canadian securities regulatory authorities and the SEC.\nTom Hodgson, CEO of Lithium Americas, commented, “While we have no immediate plans to raise capital, the shelf prospectus represents a prudent step to add financial flexibility and efficiently access capital markets as the Company pursues future growth opportunities in Argentina, Nevada and elsewhere.”\nThe Canadian shelf prospectus has been filed with the securities commission or similar regulatory authority in each province of Canada other than Quebec, but remains subject to completion or amendment. The shelf registration statement on Form F-10 relating to the Company’s debt and equity securities has been filed with the SEC but has not yet become effective. These securities may not be sold nor may offers to buy be accepted until a receipt for the final short form base shelf prospectus has been issued by the Canadian securities regulators and the registration statement has become effective. This press release does not constitute an offer of any securities for sale. A copy of the prospectus included in the registration statement may be obtained from the Company at the address below, on the SEC’s website at www.sec.gov , or in Canada at www.sedar.com .\nAbout Lithium Americas\nLithium Americas, together with Sociedad Quimica y Minera de Chile S.A. (“SQM”), is developing the Cauchari-Olaroz lithium project, located in the Province of Jujuy, Argentina, through its 50% interest in Minera Exar S.A. In addition, Lithium Americas owns 100% of the Lithium Nevada project (formerly Kings Valley project), and RheoMinerals Inc., a supplier of rheology modifiers for oil-based drilling fluids, coatings, and specialty chemicals. The Company trades on the Toronto Stock Exchange and expects to trade, effective January 25, 2018, on the NYSE, under the ticker symbol “LAC”.\nFor further information contact:\nLithium Americas Corp.\nInvestor Relations\nSuite 1100 – 355 Burrard Street\nVancouver, BC, V6C 2G8\nTelephone: 778-656-5820\nEmail: ir@lithiumamericas.com\nWebsite: www.lithiumamericas.com\nForward-looking statements\nThis news release contains “forward-looking information” and “forward-looking statements” (which we refer to collectively as forward-looking information) under the provisions of applicable securities legislation. Such forward-looking information is subject to various risks and uncertainties. Forward-looking information in this news release includes the statements regarding the timeframe for our plans to raise capital, the ability of the shelf prospectus to add financial flexibility and allow us to more efficiently access capital markets and the timing of commencement of trading of the Company’s securities on the NYSE. Forward looking information is subject to a variety of risks and uncertainties and other factors that could cause actual events or results to differ materially from those projected in the forward-looking information, including, but not limited to, risks and uncertainties related to the timing of our potential needs for additional capital and our ability to raise additional capital. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Forward-looking statements are made as of the date hereof and the Company does not intend, and expressly disclaims any obligation to, update or revise the forward-looking information contained in this news release, except as required by law. Accordingly, readers are cautioned not to place undue reliance on forward-looking information.\nSource: Lithium Americas", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/bc3ab541-8e32-4db7-b3ea-c37fb3b32d70"], "published": "2018-01-18T17:04:00.000+02:00", "crawled": "2018-01-18T20:07:53.003+02:00", "highlightTitle": ""}