{"organizations": [], "uuid": "70f523ed831a129049f8983e0fc6e83e872bc200", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-jamie-bechtel-jd-phd-joins-the-board-of-directors-for-senestech.html", "country": "US", "domain_rank": 767, "title": "Jamie Bechtel, JD, PhD Joins the Board of Directors for SenesTech", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.861, "site_type": "news", "published": "2018-01-22T17:01:00.000+02:00", "replies_count": 0, "uuid": "70f523ed831a129049f8983e0fc6e83e872bc200"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-jamie-bechtel-jd-phd-joins-the-board-of-directors-for-senestech.html", "ord_in_thread": 0, "title": "Jamie Bechtel, JD, PhD Joins the Board of Directors for SenesTech", "locations": [], "entities": {"persons": [{"name": "jamie bechtel", "sentiment": "negative"}, {"name": "jamie", "sentiment": "none"}, {"name": "kito global", "sentiment": "none"}, {"name": "loretta mayer", "sentiment": "none"}, {"name": "bob ramsey", "sentiment": "none"}, {"name": "bechtel", "sentiment": "none"}], "locations": [{"name": "flagstaff", "sentiment": "none"}, {"name": "ariz.", "sentiment": "none"}, {"name": "fiji", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "costa rica", "sentiment": "none"}], "organizations": [{"name": "snes", "sentiment": "negative"}, {"name": "kito global", "sentiment": "none"}, {"name": "bechtel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FLAGSTAFF, Ariz., Jan. 22, 2018 /PRNewswire/ -- SenesTech, Inc. (NASDAQ: SNES) today announced the appointment of Jamie Bechtel, JD, PhD, to the Board of Directors. Bechtel will take the position of Bob Ramsey, who has retired from the board.\nDr. Bechtel is the Co-Founder and a board member of New Course, founder and managing partner of Kito Global, and a highly regarded leader in international conservation. Her work has led to strategic advances in the fields of conservation, sustainable finance, and biology. Before founding Kito Global and New Course, Jamie worked for seven years at Conservation International (CI), in over 20 countries including such diverse areas as Costa Rica, Fiji, Mexico, and South Africa, among many others.\n\"Jamie has a proven track record of engaging community, business and governmental leaders to scale international projects that are rooted in market-based solutions. As a female-founded company, we at SenesTech, are particularly impressed with her commitment to engaging women in the development of these projects,\" said Dr. Loretta Mayer, co-founder, CEO and Chairman of the Board of SenesTech. She continued, \"SenesTech is committed to providing effective solutions that are more humane, sustainable, less invasive to the environment, and add value to our communities. Jamie shares our ideal of doing well by doing good, and we believe her expertise will continue to guide our success as we serve our customers and our communities.\"\n\"The innovative technology developed at SenesTech has the potential to impact the world in a magnificent way. This chance to simultaneously contribute to global food security, biodiversity conservation, and improved health outcomes is a once in a lifetime opportunity and it is an honor to support the SenesTech team in their efforts to drive impact while returning value to their shareholders,\" highlighted Bechtel.\nDr. Bechtel was an advisor to the Clinton Global Initiative, and was recently honored in Fast Company Magazine as 1 of 60 women heroes. Jamie has a Ph.D. from Boston University and a law degree from Boston College.\nBob Ramsey, who Dr. Bechtel replaces on the board, was one of SenesTech's original advisors, and served on the SenesTech Board for two years.\n\"Bob's contributions are innumerable, and we remain grateful not only for his service, but for his steadfast guidance throughout his tenure on the Board. On behalf of the Board of Directors, I would like to thank Bob for his dedication to our company, our team, and our vision. He is a dear friend, and we will all miss his guidance, \"said Dr. Cheryl Dyer, co-founder, President, Chief Research Officer and board member of SenesTech.\nAbout SenesTech\nSenesTech has developed an innovative technology for managing animal pest populations through fertility control as opposed to a lethal approach.\nContraPest®'s novel technology and approach targets the reproductive capabilities of both sexes in rat populations, inducing egg loss in female rats and impairing sperm development in males. Using a proprietary bait delivery method, ContraPest® is dispensed in a highly palatable liquid formulation that promotes sustained consumption by rat communities. ContraPest® is designed, formulated and dispensed to be low hazard for handlers and non-target species such as wildlife, livestock and pets, where the active ingredients break down rapidly, unlike rodenticides. In contrast, the historical approach to managing rat pest populations, rodenticides, carries a high risk of environmental contamination and the poisoning of non-target animals, pets and children. ContraPest® is a Restricted Use product.\nWe believe our innovative non-lethal approach, targeting reproduction, is more humane, less harmful to the environment, and more effective in providing a sustainable solution to pest infestations than traditional lethal pest management methods. We believe ContraPest® will establish a new paradigm in rodent control, resulting in improved performance in rodent control over rodenticides, without the negative environmental effects of rodenticides. For more information visit the SenesTech website at www.senestech.com.\nSafe Harbor Statement\nThis release contains \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended and such forward-looking statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. \"Forward-looking statements\" describe future expectations, plans, results, or strategies and are generally preceded by words such as \"may,\" \"future,\" \"plan\" or \"planned,\" \"will\" or \"should,\" \"expected,\" \"anticipates,\" \"draft,\" \"eventually\" or \"projected.\" You are cautioned that such statements are subject to a multitude of risks and uncertainties that could cause future circumstances, events, or results to differ materially from those projected in the forward-looking statements, including the risks that actual results may differ materially from those projected in the forward-looking statements as a result of various factors and other risks identified in our filings with the Securities and Exchange Commission. All forward-looking statements contained in this press release speak only as of the date on which they were made and are based on management's assumptions and estimates as of such date. We do not undertake any obligation to publicly update any forward-looking statements, whether as a result of the receipt of new information, the occurrence of future events or otherwise.\nView original content with multimedia: http://www.prnewswire.com/news-releases/jamie-bechtel-jd-phd-joins-the-board-of-directors-for-senestech-300585704.html\nSOURCE SenesTech, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/jamie-bechtel-jd-phd-joins-the-board-of-directors-for-senestech-300585704.html"], "published": "2018-01-22T17:01:00.000+02:00", "crawled": "2018-01-22T20:24:16.012+02:00", "highlightTitle": ""}