{"organizations": [], "uuid": "06d38ff5870d080054ee47333e8d2f9e3f59a2a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 17, "shares": 17, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/02/104924837-GettyImages-900415160.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/02/asia-markets-dollar-oil-and-ant-financial-in-focus.html", "country": "US", "domain_rank": 767, "title": "Asia markets: Dollar, oil and Ant Financial in focus", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-03T02:34:00.000+02:00", "replies_count": 0, "uuid": "06d38ff5870d080054ee47333e8d2f9e3f59a2a0"}, "author": "Cheang Ming", "url": "https://www.cnbc.com/2018/01/02/asia-markets-dollar-oil-and-ant-financial-in-focus.html", "ord_in_thread": 0, "title": "Asia markets: Dollar, oil and Ant Financial in focus", "locations": [], "entities": {"persons": [], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "nasdaq", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "asx", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "s&p/asx", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Asian stocks closed with moderate gains on Wednesday, tracking sizable increases seen on Wall Street overnight as the dollar traded near three-month lows.\nSouth Korea's benchmark Kospi index edged up 0.27 percent to close at 2,486.35 as large cap technology names extended the moderate gains seen last session. Heavyweights Samsung Electronics and SK Hynix closed up 1.18 percent and 1.44 percent, respectively.\nSteel plays were also higher, with blue-chip Posco jumping 5.46 percent and Hyundai Steel rising 2.62 percent by the end of the session.\nHyundai Heavy Industries soared 8.84 percent after the South Korean shipbuilder announced it was aiming for 7.99 trillion won ($7.52 billion) in sales this year, Reuters said. Hyundai Heavy shares had plunged last week when it unveiled plans to list its Hyundai Oilbank subsidiary. Shares of other shipbuilders also jumped, with Daewoo Shipbuilding rising 12.05 percent on the day.\nSymbol Name Price Change %Change NIKKEI --- HSI --- ASX 200 --- SHANGHAI --- KOSPI --- CNBC 100 --- Also of note was a tweet from President Donald Trump , which took a jab at North Korean leader Kim Jong Un. Trump's tweet, which boasted that his \"Nuclear Button\" is \"bigger\" than Kim's, came after South Korea on Tuesday said it was interested in hosting talks with the North on Jan. 9.\nHong Kong's Hang Seng Index edged up 0.08 percent by 3:35 p.m. HK/SIN after soaring 2 percent on Tuesday, with technology shares continuing their ascent. Apple supplier AAC Technologies rose 2.14 percent and heavyweight Tencent tacked on 1.05 percent by 3:38 p.m. HK/SIN.\nMainland markets also trended higher, with the Shanghai Composite advancing 0.65 percent to end at 3,370.1 and the Shenzhen Composite adding 0.77 percent to close at 1,934. The telecommunications, technology and utilities sectors led gains on the blue-chip CSI 300 index, which closed 1.08 percent higher.\nDown Under, the S&P/ASX 200 edged up 0.15 percent to close at 6,070.4 as mining stocks led the index higher. Rio Tinto and BHP, the country's two-largest miners, closed up 2.21 percent and 1.68 percent, respectively. Gold producers were a mixed bag, but traded higher on the whole, with the S&P/ASX All Ords Gold sub-index rising 1.21 percent by the end of the day.\nMSCI's broad index of shares in Asia Pacific excluding Japan was last higher by 0.34 percent at 579.27, trading near its all-time high of 591.50.\nJapanese markets are closed on Wednesday for an exchange holiday.\nMarkets stateside closed with gains in the first trading session of the new year as technology names moved higher. Both the S&P 500 and Nasdaq composite hit closing highs, with the latter closing above the 7,000 mark for the first time.\nThe Dow Jones industrial average rose 0.42 percent, or 104.79 points, to close at 24,824.01.\nDollar languishes The dollar continued to languish on Wednesday, having tumbled to a more than three-month low against a basket of six currencies overnight. At 3:27 p.m. HK/SIN, the dollar index was a touch firmer at 91.944, compared to a low of 91.751 seen overnight.\nLast year saw the dollar index record its largest annual fall since 2003.\nAgainst the Japanese yen, the dollar was steady at 112.36.\nThe euro pared some overnight gains against the greenback after climbing overnight. The common currency traded at $1.2042 after had touching as high $1.2082 on Tuesday.\nThe Korean won gave up some gains after touching a more than three-year high against the dollar in the last session. On Wednesday, the currency traded at 1,063.52 won to the dollar after strengthening as much as 1,058.97 in the last session.\nEarlier, the head of South Korea's central bank told reporters that he was looking at movements in the currency \"very closely,\" Reuters reported. The country would be looking at ways to increase capital outflows if its currency continued to strengthen, Reuters said, citing sources.\nThe commodities trade Oil prices were a touch softer on Wednesday after touching their highest levels since mid-2015 in the last session.\nU.S. West Texas Intermediate crude shed 0.08 percent to trade at $60.32 per barrel. Brent crude futures was off by 0.17 percent at $66.46.\nAnt Financial-MoneyGram deal A high-profile proposed merger between U.S.-based MoneyGram International and Alibaba affiliate Ant Financial Services Group has fallen through after the companies failed to obtain regulatory approval. A joint statement from the companies said Ant Financial has paid a $30 million termination fee to MoneyGram following the termination.", "external_links": ["http://ir.moneygram.com/releasedetail.cfm?ReleaseID=1053096"], "published": "2018-01-03T02:34:00.000+02:00", "crawled": "2018-01-03T02:01:06.020+02:00", "highlightTitle": ""}