{"organizations": [], "uuid": "cec54d59a4b0705b10d8f2f2f8fbdc04c7cfce82", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/europe-stocks/live-markets-closing-snapshot-european-stocks-see-a-bright-start-to-the-week-idUSL8N1PH5XX", "country": "US", "domain_rank": 408, "title": "LIVE MARKETS-Closing snapshot: European stocks see a bright start to the week", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T01:11:00.000+02:00", "replies_count": 0, "uuid": "cec54d59a4b0705b10d8f2f2f8fbdc04c7cfce82"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/europe-stocks/live-markets-closing-snapshot-european-stocks-see-a-bright-start-to-the-week-idUSL8N1PH5XX", "ord_in_thread": 0, "title": "LIVE MARKETS-Closing snapshot: European stocks see a bright start to the week", "locations": [], "entities": {"persons": [{"name": "julien ponthus", "sentiment": "none"}, {"name": "jp morgan", "sentiment": "none"}], "locations": [], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "value", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 5:11 PM / in 22 minutes LIVE MARKETS-Closing snapshot: European stocks see a bright start to the week Reuters Staff 20 Min Read Jan 22 (Reuters) - Welcome to the home for real time coverage of European equity markets brought to you by Reuters stocks reporters and anchored today by Julien Ponthus. Reach him on Messenger to share your thoughts on market moves: julien.ponthus.thomsonreuters.com@reuters.net CLOSING SNAPSHOT: A BRIGHT START TO THE WEEK (1709 GMT) European stocks have closed in positive territory, while a stronger pound hampered the FTSE 100. Could this be gearing up to be week four of gains? It's too early to tell, but if we see more M&A and well-received earnings reports, then it could well be! Here's your closing snapshot: (Kit Rees PREPARING FOR A CHANGE IN STYLE (1556 GMT) As we mentioned earlier, JP Morgan recommends a change of style, out of Growth and into Value stocks in order to guard against a rising bond yield environment. Here's more of their thinking on the best current styles and sectors. \"The Quality and Growth parts of the market have led the performance in this cycle and could now be pressured by higher yields. On the other side, the Value part of the market has lagged and could bounce,\" JPM strategists say in a note. Financials remain JPM's top pick - as key beneficiaries of rising bond yields. Within the Euro zone, strategists prefer the periphery over the core, focusing on Italy. Here's a chart from JPM detailing the relationship between value, growth, and bond yields in Europe: (Kit Rees) HOLD THE PHONE: DEAL TALK BOOSTS TELECOMS (1530 GMT) Top of the sector leaderboard as we head towards the close are telecoms stocks, up 1.6 percent, after a report in Le Monde that Orange and Deutsche Telekom held merger talks last year. \"This could boost M&A expectations in Europe,\" says AFS Group analyst Jauke de Jong in Amsterdam. \"This could be a sign that either Orange or Deutsche Telekom is open for cross border M&A.\" He also notes the report comes after some recent in-country M&A in telecoms with the Tele2-Com Hem and Tele2-TMobile NL deals. \"Telco M&A hopes could come back in full swing,\" says de Jong. It's a much-needed boost for a sector which has lagged the market for months. Or, as a trader at a European bank bluntly put it, \"Without M&A the sector sucks.\" Here's how Orange and Deutsche Telekom shares reacted: (Danilo Masoni and Helen Reid) OCADO: FEELS LIKE A SQUEEZE (1515 GMT) According to Jefferies, it's unlikely that the surge in Ocado shares is due to the fundamentals of the Sobey deal, which will allow Canada's second largest food supermarket group Sobeys to use the UK group's ecommerce platform. \"In reality it will be the ongoing squeeze in the short base (76m shares are still on loan, from a peak of 124m in July 2017) that will dictate near term outlook for the stock\", the analysts said as Ocado enjoys a 20 percent jump. This comes roughly two months after a similar deal with France's Casino had pushed the shares up more than 20 percent. Ocado was a favoured as a \"short\" bet amongst hedge funds throughout 2017 partly because of divergent views among investors over whether the company is a food retailer or a technology provider able to command a high valuation. Check out our story here: Have a look here to spot the pattern of short squeezes: (Julien Ponthus) RISING RATES AND UTILITIES, IT'S NOT NECESSARILY ALL THAT BAD (1423 GMT) You would think that with monetary normalisation on the agenda and rising rates on their way, there isn't much of a case for investing in European utilities. Not so fast, UBS analysts say. \"When bond markets fall and power prices are rising, power generators can still strongly outperform,\" they argue, naming EDF, RWE and Fortum as stocks likely to outperform this year. They also cite special situations with Uniper (Fortum bid) or Centrica (recovery case). Overall, out of the 24 European utilities it covers, UBS would only buy half: (Julien Ponthus) AFTERNOON SNAPSHOT: IBEX HITS FIVE-MONTH HIGH (1349 GMT) European shares have turned slightly higher, pushing the STOXX 600 index back to its highest point since Aug. 2015 and the euro zone's STOXX to 10-year highs, milestones already reached on Friday. Only the IBEX in Madrid is breaking new ground after Fitch upgraded Spain's credit rating to \"A-\". The Spanish top share index has just extended its gains to 1.1 percent, hitting a five-month high and helping it recover from the losses linked to the Catalonia crisis. (Danilo Masoni) IS THE MARKET POSITIONED FOR CROSS-BORDER BANK M&A? (1257 GMT) Mediobanca Securities analysts don't think so. They see opportunities for stock pickers, but have a word of caution over the broad benefits of such deals. \"European regulators and governments are getting more and more explicit about their desire to have in-market and cross border consolidation within the Banking Union. By contrast, both CEOs and investors seem very cold about it given the limited cost synergies and the higher execution risk,\" they say. \"Yet, we see some combinations making sense as they either offer in-market synergies or material upside from capital arbitrage. None of this is included in current prices... and we stress it would make sense to gain exposure to attractive stand-alone names also offering free upside potential from M&A,\" they add in a note to clients. Here are their possible M&A picks in the space: * Bankia and Monte dei Paschi among government-owned banks * Italian mid-cap banks on valuation * Commerzbank as the only entry ticket into the German market or as the way to create a large German player (Danilo Masoni) BOND YIELD REPRICING SHOULDN'T SINK STOCKS (1249 GMT) The thing keeping most stock investors up at night right now, according to JP Morgan, is the potential for bond yields to reprice and drive a re-rating of equity P/E. But JPM analysts reckon equities will be able to absorb a potential repricing in bond yields as the move up in yields is happening for the 'right reasons', i.e. strong economic growth. And earnings momentum is more important to valuations staying strong - they see \"at worst\" stable P/E multiples ahead. So far from being a threat to stocks' outperformance, JP Morgan analysts see the potential repricing in bond yields as a reason to stay constructive on stocks. \"If yields move higher we believe equities could in face benefit from, among other factors, a rotation in investor flows.\" Regardless of the impact bond repricing may have on the P/E multiple, JPM recommends hedging this risk by rotating out of Growth and into Value stocks - a trade which, if it plays out, will favour the European market which is heavier in Value stocks. \"It is very difficult to see Eurozone underperform the US if the Growth-Value rotation does materialize this year,\" says JPM. (Helen Reid) FUEL PRICE SURGE SPELLS TURBULENCE FOR AIRLINES (1225 GMT) While the New Year surge in oil prices, has buoyed global markets and energy stocks, it isn't good news for everyone. Airlines are one sector set to suffer from higher cost pressures. The cost of jet fuel has increased by more than 30 percent in 12 months, Bernstein analysts write. They forecast fuel costs to rise by 2.4 billion euros this year, or 14 percent. \"Rising costs are increasingly worrying airline executives as the days of cheap fuel appear to be over,\" Bernstein analysts say. And they don't see any chance the airlines can pass on this cost to consumers through higher fares. \"We see this translating into a very different picture for earnings at individual airlines as differing hedging policies, profit margins and 'locked in' hedge prices for fuel and currency create different levels of exposure.\" Ryanair's fuel bill is the most sensitive to further changes in oil price, according to Bernstein, but they reckon rising prices won't dent margins too much because the airline has hedged its exposure at a low price so far. Meanwhile Air France-KLM faces the largest increase in fuel prices in 2018 given its relatively low hedging amount and after it enjoyed the lowest fuel price across the analysts' coverage in 2017. The French airline is already down 3.4 percent today after Davy Research analysts downgraded the stock to neutral after a strong run. (Helen Reid) A SOBERING VIEW ON FRANCE: STRUCTURAL UNEMPLOYMENT IS A DRAG (1138 GMT) With growing optimism on the health of the Euro zone economy and its equity markets, it's easy to forget that GDP growth in some countries such as France is somewhat below what one would expect at this stage in the cycle, with forecasts of under 2 percent for 2017 and 2018. According to Natixis' research, structural unemployment and the rise in numbers of young people with no qualifications are a drag on the Gallic economy and will keep holding it back. \"When the structural unemployment rate is as high as in France currently (more than 9%), recruitment difficulties will very prematurely stop growth,\" Patrick Artus, who heads research at the French bank, says in a note. \"Periods of vigorous growth in France will necessarily be short, since recruitment difficulties rapidly become severe,\" he argues, noting how the last ten years have hurt growth potential: (Julien Ponthus) NO NEED TO BE WORRIED ABOUT U.S. SHUTDOWN (1044 GMT) That's the view from investment manager Rathbones on the U.S. government shutdown. \"I believe investors shouldn’t get too panicked. It's important to remember that financial markets barely blinked at the last two shutdowns in 1995/96 and 2013,\" Ed Smith, head of asset allocation research at Rathbones, said in a note. The U.S. Senate is due to vote on a funding bill at 1700 GMT later today. \"Markets do not react because the economic impact is not that large,\" Smith added. In Europe markets are still flat, suggesting the focus remains on M&A activity and upcoming earnings reports. (Kit Rees) BANKS: CAN YOU SEE Q4 THREATS IF YOU TAKE THE HELICOPTER VIEW? (1039 GMT) As mentioned in the post below, the rotation to banks has been a very popular trade so far in 2018, seen as a proxy to play the buoyant Euro zone economy and monetary normalisation. But while this seems to make perfect sense when one takes a helicopter view on the sector, in the short term, Q4 could be a tricky one, just as UBS seems to show this morning. Looking at the French banking sector, Deutsche Bank notes three potential threats to Q4 results: * Retail banking is still suffering from low interest rates and that's hurting net interest margins. * Low volatility is a drag for market activities, and that has been clearly exposed last week in the results of U.S. investment banks. * One-offs such as SocGen's recent tax fight with the French government, are not a thing of the past. JP Morgan has made a similar warning to its clients, advising them to be selective in picking the right banking stock. Interestingly, DB, like JP Morgan, also recommends favouring Natixis over Societe Generale and notes its recent underperformance: (Julien Ponthus) DOES UBS SHARE DROP SET A PATTERN FOR Q4 BANK RESULTS? (1010 GMT) UBS kicked off European bank earnings with buybacks and higher dividends despite a U.S. tax-related writedown, but the shares are down 1.6 percent. Cyclical stocks like banks have been buoyed the most by the flood of money into equities since the start of the year and UBS is no exception. The Swiss bank’s earnings forecasts were in line with consensus, but that was still enough to trigger some selling, one analyst tells us. It seems the market was holding out hope for more ambitious targets from UBS given wealth generation in the world is increasing, new money is growing and markets are strong. (Tom Pfeiffer) VIEWS FROM THE STREET: RICHEMONT'S OFFER FOR YNAP (0950 GMT) Surging up to the top of Italy's stock index is Yoox Net-a-Porter, up 24 percent to a record high after Richemont put in a bid for the remaining shares in YNAP, at a 26 percent premium to Friday's closing price. \"The deal seems to reflect Richemont's aim to expand but at the same time control its distribution channels,\" note Baader Helvea analysts. The deal is in a similar vein to Richemont's recent move to increase its stake in duty free retail company Dufry. \"Given the lack of interesting acquisition targets up for sale in their core business of hard luxury, Richemont has decided to put at work its big cash pile investing into distribution channels,\" write Bernstein's Mario Ortelli and team. Crucially, Bernstein analysts note, Richemont will continue to run YNAP as a separate business in order to make sure third-party luxury brands continue to see it as a neutral platform. The already strong ties between the companies mean analysts don't see counter-bids as likely. We're just under the offer price of 38 euros now. Richemont shares meanwhile are down 1 percent as investors digest the bid. \"Due to [YNAP's] relatively lower ROIC profile, some investors may question the group's decision to go back to the lower return e-commerce business rather than look to expand its existing brand portfolio,\" says Berenberg. (Helen Reid) OPENING SNAPSHOT: STOXX 600 FLAT (0813 GMT) European shares have opened little changed with the broader pan-regional STOXX 600 stuck at Friday's level and sectoral indexes also showing small moves. Germany's DAX is up a little as Chancellor Angela Merkel's conservatives prepare for formal coalition talks after the centre-left SPD voted narrowly to go ahead following months of political deadlock. Below the surface, the price swings are much bigger. Top 2 movers on the STOXX 600 are Sweden's Orphan Biovitrum, up 15 percent, which is a partner of haemophilia drug maker Bioverativ that Sanofi agreed to buy, and bookie William Hill, down 14 percent after the Sunday Times reported that Britain will limit gambling terminal stakes to two pounds. (Danilo Masoni) SANOFI'S MOVE BOOSTS BIOTECH M&A PIPELINE (0747 GMT) Investors betting on a pick of M&A deals in the pharma sector will likely be emboldened by news that French healthcare group Sanofi has agreed to buy U.S. peer Bioverativ in a $11.6 billion transaction. Check out our story here for more details on the cash deal which comes after Sanofi had failed to land major takeovers in recent years. Separately, Biotest said late on Friday it sold its U.S. operations, allaying U.S. national security concerns and paving the way for the German blood plasma products maker's sale to a Chinese investor. Just in recent weeks there has been a flurry of M&A deals in the biotech space worth several billion dollars. Here's a quick recap of dealmaking that has involved European companies: Novo Nordisk/Ablynx; Roche/Ignyta; and Takeda/TiGenix . (Danilo Masoni) WHAT YOU NEED TO KNOW (0740 GMT) It seems to be business as usual so far on European stocks markets with futures indicating shares to rise slightly, expect in London with the FTSE losing a few points. That could change however with a prolonged stalemate in Washington but in the meantime, in Europe, prospects of talks between Merkel allies and the SPD should support sentiment. Main newsmaker this morning is France's Sanofi, which confirmed a bid for U.S. peer Bioverativ , another sign that M&A should indeed continue to spice things up. Switching from spice to sugar, Italian airports and motorway operator Atlantia is open to sweeten its bid to Abertis and other takeover preys, such as Ablynx in Belgium or GKN in the UK, expect their would-be suitors to cough up more cash to woo investors. A deal is not always needed though for shareholders to get extra cash: UBS proposed an increased dividend and new share buyback programme despite a hefty write down from a tax overhaul in the United States. Other movers today could include troubled South African retailer Steinhoff which plans to sell about 7.5 billion rand ($620 million) of shares in investment firm PSG Group it scrambles to plug a liquidity gap. Possible impact also of the chief executive of Dixons Carphone leaving Britain's largest electricals and mobile phone retailer to run the Boots chain. Also, platinum miner Lonmin reported a 65 percent drop in 2017 profit, citing higher costs and subdued commodity prices but reiterated its 2018 targets Please have a look below for a summary of our main headlines. (Julien Ponthus) MAIN HEADLINES (0740 GMT) Healthcare group Sanofi agrees to buy U.S. peer Bioverativ for $11.6 bln Richemont offers 2.8 bln euros to buy Yoox Net-A-Porter Steinhoff to place shares in PSG Group worth around $620 million UBS ups investor returns as US tax overhaul socks bank with quarterly loss Takeover target GKN raises forecast for electric driveline sales Dixons Carphone reports 6 percent jump in underlying revenue Dixons Carphone CEO James quits for job at Boots TUI sees record sales, earnings in 2018-paper Atlantia opens door to sweetening Abertis bid Takeaway.com says merger with Delivery Hero an option –paper UK Q4 motor insurance premiums fall 1.3 pct-survey Britain to limit gambling terminal stakes to two pounds-Sunday Times LVMH hires Hedi Slimane for Celine brand Engie to keep separate CEO, board chair roles -finance minister Deutsche Telekom expects steady dividend hikes –paper Hearing on Vivendi's appeal against Italian antitrust ruling postponed Schaeffler CEO says splitting company would be unwise -paper UK Takeover Panel extends deadline for IWG bidding Sika CEO says share price rise could end takeover battle UK's Computacenter says to beat 2017 expectations, sees stable 2018 Lonmin reports 65 percent fall in 2017 profit on higher costs (Tom Pfeiffer) EUROPE'S STOCK FUTURES SLIGHTLY UP (0705 GMT) Futures have opened with slight gains overall but London's FTSE 100 is seen, as earlier indications from spreadbetters showed, opening in negative territory. (Julien Ponthus) WHAT TO EXPECT ON MARKETS DURING A U.S. SHUTDOWN? (0645 GMT) While many see minimal impact on the economy from a short-term government shutdown, analysts say a prolonged stalemate in Washington could dampen investors' confidence in U.S. assets. Here's how Nordea sums up what's to be expected based on the previous shutdowns: (Julien Ponthus)", "external_links": [], "published": "2018-01-23T01:11:00.000+02:00", "crawled": "2018-01-22T19:22:06.004+02:00", "highlightTitle": ""}