{"organizations": [], "uuid": "0c43407652f1178e9d194a8f4e207712148ee06b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224403816&w=1200&r=LYNXMPEE0M0GE", "site_section": "http://www.reuters.com/resources/archive/us/20180123.html", "section_title": "Archive News &amp; Video for Tuesday, 23 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-davos-meeting-russia-aramco/russian-pension-funds-eyeing-saudi-aramco-ipo-russian-direct-investment-fund-idUSKBN1FC0KQ", "country": "US", "domain_rank": 408, "title": "Russia may back Aramco IPO, enhance OPEC ties", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.195, "site_type": "news", "published": "2018-01-23T14:51:00.000+02:00", "replies_count": 0, "uuid": "0c43407652f1178e9d194a8f4e207712148ee06b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-davos-meeting-russia-aramco/russian-pension-funds-eyeing-saudi-aramco-ipo-russian-direct-investment-fund-idUSKBN1FC0KQ", "ord_in_thread": 0, "title": "Russia may back Aramco IPO, enhance OPEC ties", "locations": [], "entities": {"persons": [{"name": "dmitriev", "sentiment": "none"}, {"name": "kirill dmitriev", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "riyadh", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "aramco ipo", "sentiment": "negative"}, {"name": "opec", "sentiment": "negative"}, {"name": "aramco", "sentiment": "none"}, {"name": "direct investment fund", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DAVOS, Switzerland (Reuters) - Russian pension funds are considering investing in Saudi Arabian state oil major Aramco when it lists its stock in a move to strengthen the partnership between the world’s two top oil producers, Russia’s top state investment officer said.\nThe head of Russia’s Direct Investment Fund, Kirill Dmitriev, told Reuters on Tuesday that Moscow and Riyadh should be coordinating oil policies for many more years.\n“We see great interest in the Aramco IPO from Russian pension funds as well as from our Chinese partners,” said Dmitriev, who two years ago was the first Russian official to suggest the possibility of a joint oil output deal with OPEC.\nHe said he could not disclose the names of the funds or the amount they were prepared to invest.\nSources told Reuters last year Chinese state oil companies were willing to become cornerstone investors in the Aramco IPO which could become the world’s biggest, valuing the firm at up to $2 trillion and raising more than $100 billion.\n“Russia already has significant positions in the oil business so it is hard to expect us taking a very significant stake during the IPO,” Dmitriev said on the sidelines of the World Economic Forum in Davos.\nHe added that the deal would help strengthen growing cooperation with Riyadh.\nNon-OPEC Russia and OPEC led by Saudi Arabia agreed to cut oil output by 1.8 million barrels per day (bpd) or around 2 percent of global production throughout 2017 and 2018, in a move that has helped oil prices to double from their 2016 lows to around $70 a barrel.\n“Extending such cooperation for many more years would be very useful for the market. It has proven its efficiency, when we were targeting balancing supply and demand rather than targeting a particular oil price,” said Dmitriev.\nOPEC has said it wanted global oil stocks to return to a five-year average and the group’s officials have said that target could be reached by the middle or end of 2018.\nFILE PHOTO: A view shows Saudi Aramco's Wasit Gas Plant, Saudi Arabia December 8, 2014. Saudi Aramco/Handout/File Photo via REUTERS But even when the target is reached, OPEC has insisted it would exit from cuts gradually in order not to shock the market.\n“Future mechanisms of cooperation and concrete tools could differ,” said Dmitriev.\nHe said oil producers had generated an extra $600 billion in revenues thanks to oil cuts and higher prices over the past year, which allowed them to resume investments and guarantee no supply shortages in the future.\nSlideshow (2 Images) For Russia and Saudi Arabia the deal has also paved the way for dialogue on many other fronts despite the two countries effectively fighting a proxy war in Syria.\n“The deal has created elements of trust in investments and in political cooperation. It did help political dialogue. It showed Russia and Saudi Arabia can work together,” Dmitriev said.\n“Without the deal, a visit of the Saudi king to Russia wouldn’t have been possible and wouldn’t have been that successful,” said Dmitriev, referring to King Salman’s visit in October.\nRelated Coverage Russia's RDIF head says Russia-OPEC cooperation should last for years Dmitriev’s $10 billion fund has joint projects with Saudi Arabia, including a $1 billion technology fund. He expects the number of projects to grow.\nHe also said Russia should embark on reforms such as cutting the state’s presence in the economy after the presidential election in March, in which the current leader Vladimir Putin is widely anticipated to be re-elected.\n“In some sectors, the role of the state represents more than 70 percent. It is clearly too much,” said Dmitriev.\n“From the investment point of view, we see the need for reform such as the sale of non-core assets by state companies. This could boost Russia’s economic growth,” he said.\nReporting by Dmitry Zhdannikov; Editing by Mark Bendeich\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T14:51:00.000+02:00", "crawled": "2018-01-24T15:31:46.018+02:00", "highlightTitle": ""}