{"organizations": [], "uuid": "87026926eca9a6865012407d8a64a8010454c210", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 31, "shares": 31, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180114&t=2&i=1221989612&w=1200&r=LYNXMPEE0D0NP", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-britain-eu-france-exclusive/exclusive-france-expects-uk-to-pay-up-take-more-refugees-to-keep-border-official-idUKKBN1F30YQ", "country": "US", "domain_rank": 408, "title": "Exclusive: France expects UK to pay up, take more refugees to keep border - official", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T00:13:00.000+02:00", "replies_count": 0, "uuid": "87026926eca9a6865012407d8a64a8010454c210"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-eu-france-exclusive/exclusive-france-expects-uk-to-pay-up-take-more-refugees-to-keep-border-official-idUKKBN1F30YQ", "ord_in_thread": 0, "title": "Exclusive: France expects UK to pay up, take more refugees to keep border - official", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}, {"name": "gerard collomb", "sentiment": "none"}, {"name": "emmanuel macron", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "hotel des invalides", "sentiment": "none"}, {"name": "platiau  britain", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "matthias blamont", "sentiment": "none"}, {"name": "min read  paris", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 14, 2018 / 10:14 PM / Updated an hour ago Exclusive: France expects UK to pay up, take more refugees to keep border - official Matthias Blamont 4 Min Read \nPARIS (Reuters) - France expects Britain to agree to take more asylum seekers and pay more for border security in order to maintain a frontier on the French side of the Channel, a French government official said. Migrant walks past the fence which secures the approach to the city from migrants trying to reach Britain, in Calais, France, September 21, 2016. REUTERS/Pascal Rossignol \nBritain’s border was extended into France under a 2003 bilateral treaty known as the Le Touquet accord. But a migration crisis and the Brexit vote to leave the European Union have made the arrangement an increasing source of friction. \nThe deal will be on the table on Thursday when President Emmanuel Macron holds talks with British Prime Minister Theresa May at a Anglo-French summit in southern England. \nAsked if concrete announcements are expected at the talks, the source said: “Yes. But is it all finalised? Absolutely not.” \nFrance’s Interior Minister Gerard Collomb, who has taken the lead on talks, was quoted by the Le Parisen newspaper on Sunday saying he hoped an “additional protocol” to supplement the Le Touquet accord could be agreed upon. \nHis comments indicated Macron has dropped a campaign promise to renegotiate the Le Touquet accord in full. \n“We’re still negotiating. There is back and forth. Nothing is locked in yet. The British have shaken on nothing but there’s a lot of pressure on them,” said the official familiar with Collomb’s thinking. \nIf no deal can be struck, France could tear up the Le Touquet accord and the two countries would have to reinstate borders on each side of the English Channel, the source said, adding that this was not in the interest of either side. \n“Our understanding is that they will pay more. The question is how much and for what,” said the source, adding that the two sides are in daily contact ahead of the summit. \n“We have let them know of our needs and a figure, we’re talking tens of millions of euros.” A migrant walks as a rainbow appears over past the razor-wire topped fence in Calais, France, which secures the road approach to the city and dissuade them from trying to reach Britain on lorries, Calais, northern France, October 22, 2016. REUTERS/Pascal Rossignol \nSome pro-Brexit lawmakers from Britain’s ruling Conservative party have branded suggestions London pay more as “absurd”. \nA spokesman for the British Home Office (interior ministry) said: “We work closely with the French authorities at all levels to reduce migrant pressures and target criminal gangs involved in people trafficking, both in northern France and further afield.” DETENTION CENTRE, REPATRIATIONS French Interior Minister Gerard Collomb attends a New Year wishes ceremony to the Gendarmerie Nationale at the Hotel des Invalides in Paris, France, January 3, 2018. REUTERS/Charles Platiau \nMacron will travel to Britain two days after visiting the northern port city of Calais, the final stopping point for migrants striving to cross the English Channel. \nCalais has borne the brunt of the migration crisis in France and at its peak up to 10,000 migrants squatted in a sprawling camp dubbed “The Jungle”, before former president Francois Hollande sent in bulldozers. \nParis has complained that it shoulders too much of the financial burden and handles more than its share of asylum cases, while Macron said in 2016 before becoming president that there would be no migrants in Calais if the accord unravelled. \nBritain had paid 140 million euros (124.54 million pounds) in the past three years towards border and security infrastructure, but that this needed to be increased in the future, the official, who declined to be named, told Reuters. \nOther options included Britain co-financing a detention centre for illegal migrants, organising repatriation flights and assisting with expulsions, the source said. \nFrance is also asking for legal provisions to ensure Britain accepts more refugees, the official said, adding that it could take more unaccompanied minors under the terms of EU rules. \nMacron has come under fire over legislation his government is drafting to speed up the processing of asylum demands and help it expel illegal migrants who do not have a legitimate cause for refugee status. Reporting by Matthias Blamont, with additional reporting by Elizabeth Piper in London and Richard Lough in Paris; writing by Richard Lough; editing by Alexander Smith", "external_links": [], "published": "2018-01-15T00:13:00.000+02:00", "crawled": "2018-01-15T00:32:13.024+02:00", "highlightTitle": ""}