{"organizations": [], "uuid": "3550180f09e9821378b6caa89325fc3adf866d7f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180118.html", "section_title": "Archive News &amp; Video for Thursday, 18 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/china-economy-output-steel/update-1-china-average-daily-steel-output-hits-12-mth-low-in-dec-on-govt-output-curbs-idUSL3N1PC2TV", "country": "US", "domain_rank": 408, "title": "UPDATE 2-China govt curbs drop avg daily steel output to 12-mth low in Dec", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-01-18T16:10:00.000+02:00", "replies_count": 0, "uuid": "3550180f09e9821378b6caa89325fc3adf866d7f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/china-economy-output-steel/update-1-china-average-daily-steel-output-hits-12-mth-low-in-dec-on-govt-output-curbs-idUSL3N1PC2TV", "ord_in_thread": 0, "title": "UPDATE 2-China govt curbs drop avg daily steel output to 12-mth low in Dec", "locations": [], "entities": {"persons": [{"name": "josephine mason", "sentiment": "none"}, {"name": "ruby lian", "sentiment": "none"}], "locations": [{"name": "shanghai", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "national bureau of statistics", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Overall Dec output up from Nov, but avg daily rate falls\n* Production curbs deepen in Dec, extended to more regions\n* Full-year steel output hits record above 830 mln T\n* Electric furnaces contribute more to steel output (Adds data on pig iron output, Jan output outlook)\nBy Ruby Lian and Josephine Mason\nSHANGHAI, Jan 18 (Reuters) - China’s average daily steel output fell 1.9 percent in December from the previous month, official data showed on Thursday, touching the lowest level in a year as government-imposed production curbs deepened.\nTotal output climbed to 67.05 million tonnes in December from 66.15 million tonnes in November, and was up 1.8 percent from a year ago, data from the National Bureau of Statistics showed. Full-year output in 2017 rose 5.7 percent to a record high of 831.73 million tonnes.\nStill, average daily steel output declined 1.9 percent to 2.16 million tonnes in December from 2.205 million tonnes in November, according to Reuters calculations based on the data.\n“The government-driven production curbs were in force for the whole of December compared to half the month in November, and with smog getting worse, the cutbacks were deeper and extended to more regions,” said Qiu Yuecheng, an analyst with steel trading platform Xiben New Line E-Commerce in Shanghai.\nSteel mills have been cutting production since mid-November as part of government efforts to fend off smog in winter months.\nQiu said the growth in annual output was probably because production from electric furnaces, which have replaced illegal induction furnaces, was included on the balance sheet.\n“This year’s steel output may have stood flat or actually fallen as output from induction furnaces was excluded (from data for 2016),” Qiu added.\nChina closed up to an estimated 140 million tonnes per year of illegal induction furnace capacity in the first half of 2017, part of Beijing’s efforts to tackle overcapacity.\nPig iron production from blast furnaces, which process iron ore and have dominated China’s steel sector, dropped 4.4 percent in December from a year ago. Crude steel output still rose, suggesting mills produced more from electric furnaces that consume scrap metal.\nFull-year steel output rose at a faster pace, about three times that of pig iron, data showed.\nChina’s Ministry of Industry and Information Technology said in a statement on Jan. 8 that the government would encourage steel firms to build more electric furnaces, which produce lower emissions and fit into China’s push to cut pollution.\nLoosening output curbs and still-high profits will likely prompt mills to increase production in January, analysts said.\nWeaker demand for steel in December pushed prices for the material down 5 percent for the month, but they have since steadied amid signs of restocking by traders, which may encourage mills to minimize production curbs.\nChina’s iron ore imports rose 5 percent in 2017 to hit a record 1.075 billion tonnes. (Reporting by Ruby Lian and Josephine Mason; Editing by Joseph Radford and Tom Hogue)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T16:10:00.000+02:00", "crawled": "2018-01-19T12:13:38.001+02:00", "highlightTitle": ""}