{"organizations": [], "uuid": "f6e8c8ef2152d8353294f5859da8fbc375f48ca6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225503341&w=1200&r=LYNXMPEE0P0XE", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-usa-stocks-weekahead/state-of-the-union-more-likely-to-raise-eyebrows-than-stocks-idUSKBN1FF1WV", "country": "US", "domain_rank": 408, "title": "State of the Union more likely to raise eyebrows than stocks", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T16:27:00.000+02:00", "replies_count": 0, "uuid": "f6e8c8ef2152d8353294f5859da8fbc375f48ca6"}, "author": "", "url": "https://www.reuters.com/article/us-usa-stocks-weekahead/state-of-the-union-more-likely-to-raise-eyebrows-than-stocks-idUSKBN1FF1WV", "ord_in_thread": 0, "title": "State of the Union more likely to raise eyebrows than stocks", "locations": [], "entities": {"persons": [{"name": "michael o’rourke", "sentiment": "none"}, {"name": "sinead carew", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [], "organizations": [{"name": "state of the union", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 2:28 PM / Updated 4 hours ago State of the Union more likely to raise eyebrows than stocks Sinead Carew 5 Min Read \n(Reuters) - Anybody hoping for a replay of the stock market advance that followed U.S. President Donald Trump’s first address to Congress may be disappointed. This time around, shares could suffer if Trump does not tread carefully on hot-button issues. \nThe S&P 500 jumped 1.4 percent the day after Trump’s speech last February, as an unexpectedly measured tone from the notoriously abrasive president boosted investor optimism that he would be able to deliver on pro-business campaign promises. \nBut with a new tax law under his belt, Trump is expected to use his late-night State of the Union speech on Tuesday to applaud that victory and broach topics including trade agreements, immigration reform and infrastructure spending. \nThat may not be enough to inspire investors further, after enthusiasm about corporate tax cuts helped push the S&P 500 up more than 19 percent in 2017 and close to 7 percent so far this year. \n“Nothing is going to trump tax reform,” said Michael O’Rourke, chief market strategist at JonesTrading in Greenwich, Connecticut. “Since I expect the president to do a victory lap, the typical market reaction would be a sell-the-news reaction in contrast to last year.” \nThe S&P 500 has had only 4 daily declines so far this year, and the chances of a Jan. 31 selloff are higher if the market does not take a breather before then, O‘Rourke said. \nInvestors could be rattled by tough talk from Trump on issues including U.S. immigration policy, which has already divided lawmakers in a Republican-controlled Congress and led to a three-day government shutdown. \n“He’s got to tread carefully on the hot-button items,” said Phil Blancato, chief executive of Ladenburg Thalmann Asset Management in New York, citing immigration and trade talks. \nHe noted that a “pro-immigration agenda” could be the easiest way to expand the U.S. workforce to boost an economy with a tight labor market. \nCongress agreed to extend funding to Feb. 8 and the White House is expected to unveil an immigration legislation framework a day before the speech. \nStrategists also are wary about how Trump will approach international trade, including the North American Free Trade Agreement (NAFTA) in his speech due to his tendency for “America First” rhetoric. \n“We know historically protectionism is bad for the economy. It’s bad for markets. You open a great deal of uncertainty if you hone in on that,” said JonesTrading’s O‘Rourke. \nU.S. officials on Thursday probed Canadian proposals for unblocking talks on NAFTA but there were few signs of progress, raising questions about whether any real movement is happening at the penultimate round of negotiations on the treaty. \nAny trade comments would also come on the heels of Trump approving a steep tariff on solar panels and washing machines, moves those industries have warned could raise prices and endanger jobs. \nTo be sure, Trump could boost sentiment with details on a plan to rebuild U.S. infrastructure. On Wednesday he promised $1.7 trillion in investments over the next 10 years. But any related gains may be limited to sectors like industrials and materials. \nAnd in general, big moves like the one seen last year are relatively rare. \nThe market moved more than 1 percent in either direction just 15 times the day after the annual U.S. presidential address since 1965, when it was first televised at night. By comparison, it had a 1 percent or more move 13 times in the session before the speech. \nRetail investors may be more likely than professional fund managers to let policy comments influence their trading, said Blancato, who is not planning to make any asset allocation changes based on the speech. \nInvestors may also be less sensitive to the speech’s message this time around. Many now say they largely ignore politics after a tumultuous year with a divided Republican party, heated exchanges with nuclear-armed North Korea, a probe of possible collusion between Trump’s election campaign and Russia and the government shutdown. \nTraders have instead focused on economic data and earnings, which continue to look strong. Analysts expect the S&P 500’s fourth-quarter earnings per share to rise by 12.7 percent from a year earlier, according to Thomson Reuters data. \n“Short of something truly stupid like a trade war with China or a withdrawal from NAFTA, or something horrific like a nuclear conflict with North Korea, we don’t see a scenario where investors are likely to elevate politics to the same level of importance as the global recovery and improving earnings,” said Robert Phipps, a director at Per Stirling Capital Management in Austin, Texas. Additional reporting by Lewis Krauskopf; Editing by Alden Bentley and Meredith Mazzilli", "external_links": [], "published": "2018-01-26T16:27:00.000+02:00", "crawled": "2018-01-26T16:31:07.007+02:00", "highlightTitle": ""}