{"organizations": [], "uuid": "b839b065f08b087194ea489f5ba2ceb898cfbab0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180127&t=2&i=1225866932&w=1200&r=LYNXMPEE0Q0S9", "site_section": "http://feeds.reuters.com/reuters/sportsNews/", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-tennis-ausopen-sandgren/tennis-sandgren-denies-right-wing-views-apologizes-for-posts-idUSKBN1FG0XB", "country": "US", "domain_rank": 408, "title": "Tennis: Sandgren denies right-wing views, apologizes for posts", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T23:52:00.000+02:00", "replies_count": 0, "uuid": "b839b065f08b087194ea489f5ba2ceb898cfbab0"}, "author": "", "url": "https://www.reuters.com/article/us-tennis-ausopen-sandgren/tennis-sandgren-denies-right-wing-views-apologizes-for-posts-idUSKBN1FG0XB", "ord_in_thread": 0, "title": "Tennis: Sandgren denies right-wing views, apologizes for posts", "locations": [], "entities": {"persons": [{"name": "sandgren", "sentiment": "negative"}, {"name": "serena williams", "sentiment": "none"}, {"name": "tennys sandgren", "sentiment": "none"}, {"name": "chung hyeon", "sentiment": "none"}], "locations": [], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 27, 2018 / 9:53 PM / in 13 hours Tennis: Sandgren denies right-wing views, apologizes for posts Reuters Staff 2 Min Read \n(Reuters) - American tennis player Tennys Sandgren has denied holding right-wing activist views and denounced any implied association with those who do. \nSandgren had been accused of homophobia and racism for comments he made in the past on social media, which have since resurfaced during his run to the Australian Open quarter-finals where he lost to South Korean Chung Hyeon. \nFormer world number one Serena Williams was among people who called for Sandgren to apologize for his remarks, particularly one in which he described a visit to a gay club in 2012 as having “left his eyes bleeding”. \nIn a long statement on Saturday on his Twitter account, Sandgren apologized for his past comments and explained why he had appeared to follow politically right-wing profiles. \n“Let me emphatically say that I do not hold any alt right views, and I denounce any implied association with that group,” Sandgren wrote. \n“I unequivocally believe in the equality of all peoples as made in the image of God.” \nThe 26-year-old, who broke into the ATP Top 100 late last year, said he was sorry. \n“I followed and interacted with a wide variety of people from different backgrounds and ideologies from the right and left of the political spectrum,” he wrote. \n“What I thought was something harmless and innocuous, I see now as being understandably hurtful and confusing. I am sorry for that.” \nSandgren continued: ”This is a tumultuous time in our political landscape It seems each issue has become polarizing and communication has broken down to the point where people refuse to talk to each other. \n“I encourage everyone to keep an open mind, to think critically and honestly.” \nSandgren encouraged people “to avoid tribalism and collectivism”. \n“I have not always practiced this in the past, and for that I am sorry,” he said. “I will do better moving forward.” Reporting by Gene Cherry in Salvo, North Carolina,; Editing by Christian Radnedge", "external_links": [], "published": "2018-01-27T23:52:00.000+02:00", "crawled": "2018-01-28T00:11:02.000+02:00", "highlightTitle": ""}