{"organizations": [], "uuid": "3194326ccc17419c7a52c75556a55d7ff1336f09", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-bowmo-acquires-mainz-launches-ai-based-service-model-within-its-hr-software-offering.html", "country": "US", "domain_rank": 767, "title": "bowmo Acquires Mainz, Launches AI-Based Service Model Within Its HR Software Offering", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.034, "site_type": "news", "published": "2018-01-18T18:00:00.000+02:00", "replies_count": 0, "uuid": "3194326ccc17419c7a52c75556a55d7ff1336f09"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-bowmo-acquires-mainz-launches-ai-based-service-model-within-its-hr-software-offering.html", "ord_in_thread": 0, "title": "bowmo Acquires Mainz, Launches AI-Based Service Model Within Its HR Software Offering", "locations": [], "entities": {"persons": [{"name": "michael abitebol", "sentiment": "none"}, {"name": "matthew c. kupferman", "sentiment": "none"}, {"name": "joshua sason", "sentiment": "none"}, {"name": "matthew kupferman", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "mainz", "sentiment": "none"}], "organizations": [{"name": "inc", "sentiment": "negative"}, {"name": "magna", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 18, 2018 /PRNewswire/ -- bowmo, Inc . the New York City-based HR Software as a Service company has announced its acquisition of Mainz, a recruitment and services company founded by Magna , an investment firm based in NYC. The acquisition marks a strategic investment into an innovative recruiting service process coined 'Recruiting as a Service' ( RaaS ). The addition of the Mainz recruiting process into the bowmo AI-based Machine Learning software platform will allow for an accelerated, efficient and value-based recruiting experience for both organizations, clients and prospects.\nThe transaction was spearheaded by bowmo's Chairman, Mr. Matthew C. Kupferman who negotiated the transaction with Mr. Joshua Sason, CEO of Magna and Mr. Michael Abitebol, the firm's COO/CFO. The terms of the transaction were not disclosed but it was a cash and stock transaction that includes Joshua Sason joining the bowmo Board of Directors.\nMatthew Kupferman shared, \"Having been in the software business for decades, I know that timing is incredibly important but what is more important is working with great people who know what they are doing and are willing to make sacrifices to create a legacy. After meeting Joshua Sason, it was clear to me that one plus one equals three and I am excited about 2018 for bowmo. When I started in the business, even with the 'best of breed' software apps and solutions, we could not be sure that one vendor could do it all well. Our bowmo software and the combined Mainz platform changes that. We help companies find the right people for their business. Any company who has this problem of finding and matching the right people to open jobs should come to bowmo. Whereas some companies can't service some users because they may only work with specific applicant tracking systems (ATS), at bowmo we are user-focused. We deliver an experience that includes integration to all applicant tracking systems, and we connect to third-party job boards as well as proprietary candidate pools. We are agile experts and our innovative machine learning technology expediently delivers the right people to the right jobs in less time. We are taking on the very hot talent engagement market by doing some new things that complement and supercharge current recruiting systems. For bowmo, it's all about the people.\"\nThe acquisition results in a single company operating under one Chief Executive Officer, Michael Bekiarian who previously served as the CEO of Mainz and will now be the CEO across the combined entity. The bowmo leadership team includes bowmo's COO and Co-founder, Eddie Aizman; Brian Enochson, their Chief Technology Officer and Adrienne A. Wallace, the company's Chief Marketing Officer. As the two companies work to integrate over the next quarter, clients will continue to receive custom-tailored products and services delivered through bowmo's technology, sales and marketing teams.\nMichael Bekiarian said, \"This deal is fueled by the combination of people from both companies who together will launch into the marketplace a powerful marriage of software and services; together we are accelerating the process of identifying, engaging and on-boarding great talent for great companies.\" Michael continued, \"The bowmo algorithm is designed to source deeply matched candidates from within millions of records in our clients' ATS and third-party candidate databases. As a combined entity, we can now extend to our clients the ability to use our software for themselves, or use the Mainz-based service team to run the software for them. Whether they subscribe to our software or use the RaaS process, our clients will experience deeply matched candidates, delivered to their inbox 24 hours per day, 7 days per week.\"\nThe bowmo team has moved its operations from midtown NYC to offices at 40 Wall Street where the Mainz business was already operating.\n\"Our intention at Mainz has always been to marry our unique recruiting as a service (RaaS) process with incredible technology. With this transaction, we continue to execute on our founding strategy and continue to maintain a significant equity position in and resource commitment to bowmo,\" said Joshua Sason, CEO of Magna and the founder of Mainz.\nEddie Aizman, Co-Founder and COO at bowmo said, \"This acquisition will deliver a service and technology-enabled talent acquisition experience to the enterprise and recruiting agency markets. Recruiting agencies can experience upwards of 3,000 percent ROI using our software. With this acquisition, growing and scaling mid-market companies that would like to have the horsepower of a machine learning application performing their searches but may not have the infrastructure to manage the end to end recruiting process can now experience the bowmo application using our RaaS process. We are combining people and technology to deliver a full-service platform to the human capital space that is unparalleled by any of our competition in the market, the results; our customers come to realize incredible value with the bowmo platform.\"\nAbout bowmo\nbowmo, Inc. provides an intelligent software solution (bowmo: SaaS) driven by AI-based machine learning for the staffing and recruiting industry. It seamlessly integrates into existing ATS — applicant tracking systems and third-party candidate pools. With this acquisition, the company now offers Recruiting as a Service (bowmo: RaaS) which allows clients to outsource the management of the software. In addition, clients get assistance across all recruiting functions such as job description development, branded career page management, pre-employment assessments, cultural assessments and a video interview platform all managed by a team of experienced recruiters. Overall, bowmo facilitates a comprehensive and faster search freeing the recruiter's time to speak to candidates and stakeholders.\nAbout Magna:\nMagna , founded in 2009, is a diversified holding and investment company with three operating divisions: Magna:equities, Magna:ventures and Magna:entertainment. Guided by the vision of its Founder & CEO Joshua Sason, Magna prioritizes the open mind, creativity and a robust appreciation for mitigating risk in its pursuit to create value and make a lasting impact through its endeavors. Magna pursues its philanthropic work through the Magna:initiative, focusing on harnessing the power of creative and artistic inclination to spur entrepreneurial activity that impacts society.\nMedia/Interview Inquiries:\nAdrienne A. Wallace\nPress@bowmo.com\n1-212-398-0002 Ext. 511\nView original content: http://www.prnewswire.com/news-releases/bowmo-acquires-mainz-launches-ai-based-service-model-within-its-hr-software-offering-300584511.html\nSOURCE bowmo, Inc.", "external_links": ["https://magnainvests.com/", "http://www.prnewswire.com/news-releases/bowmo-acquires-mainz-launches-ai-based-service-model-within-its-hr-software-offering-300584511.html", "https://www.bowmo.com/"], "published": "2018-01-18T18:00:00.000+02:00", "crawled": "2018-01-18T20:12:43.002+02:00", "highlightTitle": ""}