{"organizations": [], "uuid": "cc4efa6c82a3c4d12002879538a7bc3af854d8a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180114&t=2&i=1221903386&w=1200&r=LYNXMPEE0D0BR", "site_section": "http://feeds.reuters.com/reuters/INtopNews\r", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/myanmar-rohingya-bangladesh/myanmar-bangladesh-meet-amid-doubts-about-rohingya-repatriation-plan-idINKBN1F30JA", "country": "US", "domain_rank": 408, "title": "Myanmar, Bangladesh meet amid doubts about Rohingya repatriation plan", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T10:32:00.000+02:00", "replies_count": 0, "uuid": "cc4efa6c82a3c4d12002879538a7bc3af854d8a5"}, "author": "", "url": "https://in.reuters.com/article/myanmar-rohingya-bangladesh/myanmar-bangladesh-meet-amid-doubts-about-rohingya-repatriation-plan-idINKBN1F30JA", "ord_in_thread": 0, "title": "Myanmar, Bangladesh meet amid doubts about Rohingya repatriation plan", "locations": [], "entities": {"persons": [{"name": "rohingy", "sentiment": "negative"}, {"name": "hamid hussain", "sentiment": "none"}, {"name": "krishna n. das", "sentiment": "none"}, {"name": "hussain", "sentiment": "none"}, {"name": "serajul quadir", "sentiment": "none"}, {"name": "simon lewis", "sentiment": "none"}], "locations": [{"name": "myanmar", "sentiment": "none"}, {"name": "bangladesh", "sentiment": "none"}, {"name": "cox's bazar", "sentiment": "none"}, {"name": "kutupalong", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 14, 2018 / 12:35 PM / Updated 6 hours ago Myanmar, Bangladesh meet amid doubts about Rohingya repatriation plan Krishna N. Das , Serajul Quadir , Simon Lewis 7 Min Read \nDHAKA/YANGON (Reuters) - Hamid Hussain, a 71-year-old Rohingya Muslim farmer, first fled Myanmar for Bangladesh in 1992. He went home the next year under a repatriation deal between the two neighbours, only to repeat the journey last September when violence flared once more. Hamid Hussain, a 71-year-old Rohingya refugee cuts firewood after an interview with Reuters at Kutupalong camp, near Cox's Bazar, Bangladesh January 13, 2018. Picture taken January 13, 2018.REUTERS/Tyrone Siu \nOfficials from Myanmar and Bangladesh meet on Monday to discuss how to implement another deal, signed on Nov. 23, on the return of more than 650,000 Rohingya who have escaped an army crackdown since late August. Hussain is one of many who say they fear this settlement may be no more permanent than the last. \n“Bangladesh authorities had assured us that Myanmar would give us back our rights, that we would be able to live peacefully,” said Hussain, who now lives in a makeshift refugee camp in southeast Bangladesh. \n“We went back but nothing changed. I will go back again only if our rights and safety are guaranteed - forever.” \nBuddhist-majority Myanmar has for years denied Rohingya citizenship, freedom of movement and access to many basic services such as healthcare and education. They are considered illegal immigrants from mainly Muslim Bangladesh. \nThe authorities have said returnees could apply for citizenship if they can show their forebears have lived in Myanmar. But the latest deal - like the one in 1992 - does not guarantee citizenship and it is unclear how many would qualify. \nMonday’s meeting in Myanmar’s capital Naypyitaw will be the first for a joint working group set up to hammer out the details of the November repatriation agreement. The group is made up of civil servants from both countries. \nTwo senior Bangladesh officials who are involved in the talks acknowledged that much was left to be resolved and it was unclear when the first refugees could actually return. One of the key issues to be worked out was how the process for jointly verifying the identities of returnees would work, they said. \n“Any return is chaotic and complex,” said Shahidul Haque, Bangladesh’s top foreign ministry official who will lead Dhaka’s 14-member team in the talks. “The challenge is to create an environment conducive for their return.” \nMyanmar government spokesman Zaw Htay said returnees would be able to apply for citizenship “after they pass the verification process”. \nZaw Htay added that Myanmar had proposed that a group of 500 Hindus who fled to Bangladesh and have already agreed to be repatriated, alongside 500 Muslims, could form the first batch of returnees. \n“The first repatriation is important - we can learn from the experiences, good or bad,” he said. MYANMAR SETS UP CAMPS \nBangladesh officials said they would begin the process this month by sharing with Myanmar authorities a list of 100,000 Rohingya, picked at random from among registered refugees. \nHaque said Myanmar officials would vet the names against their records of residents before the August exodus, and those approved would then be asked if they wanted to go back. \nRefugees without documents would be asked to identify streets, villages and other landmarks near their former homes as proof of their right to return, said Haque. Hamid Hussain, a 71-year-old Rohingya refugee poses for photo after an interview with Reuters at Kutupalong camp, near Cox's Bazar, Bangladesh January 13, 2018. Picture taken January 13, 2018.REUTERS/Tyrone Siu \nA Myanmar agency set up to oversee repatriation said in a statement on Thursday that two temporary “repatriation and assessment camps” and one other site to accommodate returnees had been set up. \nMyint Kyaing, permanent secretary at Myanmar’s Ministry of Labour, Immigration and Population, told Reuters earlier this month Myanmar would be ready to begin processing least 150 people a day through each of the two camps by Jan. 23. \nAs well as checking their credentials as residents of Myanmar, he said, authorities would check returnees against lists of suspected “terrorists”. \nMyint Kyaing declined to comment on how long the repatriation would take but conceded the process after the 1992 agreement had taken more than 10 years. \nUnited Nations agencies working in the camps clustered around Cox’s Bazar, in southeastern Bangladesh, have voiced scepticism about the resettlement plans. Hamid Hussain, a 71-year-old Rohingya refugee poses for photo after an interview with Reuters at Kutupalong camp, near Cox's Bazar, Bangladesh January 13, 2018. Picture taken January 13, 2018. REUTERS/Tyrone Siu \nThe U.N. High Commissioner for Refugees (UNHCR) and the International Organization for Migration said their offers to help with the process have not been taken up by the two countries. \n“Further measures are needed to ensure safe, voluntary and sustainable repatriation of refugees to their places of origin and to address the underlying root causes of the crisis,” said Caroline Gluck, a spokeswoman for the UNHCR in Cox’s Bazar. \nThe UNHCR says refugees it has surveyed want guarantees that international agencies will be involved in overseeing the process and more information about the security situation in their home areas. WHO WILL GO? WHO WILL PAY? \nWhile many Rohingya say they want to go back to Myanmar, most of the more than a dozen who spoke to Reuters said they were scared to do so now. \n“I am not going back. No one’s going back,” said Hafizulla, a 37-year-old Rohingya man. “We are scared to go back without any U.N. intervention. They can accuse us later, they can arrest us. They may accuse us of helping the militants.” \nThe military offensive the refugees fled, which was prompted by Rohingya insurgent attacks on police and army posts, has been described by the United States and U.N. as ethnic cleansing. Myanmar rejects that, saying troops did not target civilians. \n“You can have all the agreements in the world, and set up all the reception centres and everything, but it won’t make a difference unless the conditions in Myanmar are such that people feel confident that they can go back and live in peace, and have equal rights,” said a Western diplomat in Dhaka. \nThe second Bangladesh official, Refugee Relief and Rehabilitation Commissioner Mohammed Abul Kalam, said the “Rohingyas’ reluctance to go back” was an issue that needed to be addressed. \nHe said the repatriation process would cost “millions of dollars” but funding details had not yet been agreed and were not expected to be discussed at Monday’s meeting. \nJapan, one of Myanmar’s biggest aid donors, said on Friday it was giving an emergency grant of around $3 million to help with the return of the Rohingya. Reporting by Krishna N. Das and Serajul Quadir in DHAKA and Simon Lewis in YANGON; Editing by Paritosh Bansal, Robert Birsel", "external_links": [], "published": "2018-01-14T10:32:00.000+02:00", "crawled": "2018-01-14T16:03:52.020+02:00", "highlightTitle": ""}