{"organizations": [], "uuid": "f9dbb64b0773afc85d739f1a04bb55c309865504", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-pan-american-silver-announces-preliminary-2017-operating-results-provides-guidance-for-2018-and-three-year-outlook.html", "country": "US", "domain_rank": 767, "title": "Pan American Silver Announces Preliminary 2017 Operating Results Provides Guidance for 2018 and Three-year Outlook", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T16:00:00.000+02:00", "replies_count": 0, "uuid": "f9dbb64b0773afc85d739f1a04bb55c309865504"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-pan-american-silver-announces-preliminary-2017-operating-results-provides-guidance-for-2018-and-three-year-outlook.html", "ord_in_thread": 0, "title": "Pan American Silver Announces Preliminary 2017 Operating Results Provides Guidance for 2018 and Three-year Outlook", "locations": [], "entities": {"persons": [], "locations": [{"name": "vancouver", "sentiment": "none"}], "organizations": [{"name": "paas", "sentiment": "none"}, {"name": "pan american silver corp.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "All amounts are expressed in US$ unless otherwise indicated. Results are unaudited and could change based on final audited financial results. This news release contains forward-looking information about expected future events and financial and operating performance of the Company. Readers should refer to the risks and assumptions set out in the \"Cautionary Note Regarding Forward-Looking Statements and Information\" at the end of this news release.\nThis news release refers to measures that are not generally accepted accounting principle (\"non-GAAP\") financial measures, including cash costs per payable ounce of silver (\"Cash Costs\") and all-in sustaining costs per silver ounce sold (\"AISCSOS\"). Please refer to the section titled \"Alternative Performance (non-GAAP) Measures\" at the end of this news release for further information on these measures.\nVANCOUVER, Jan. 11, 2018 /PRNewswire/ - Pan American Silver Corp. (NASDAQ: PAAS; TSX: PAAS) (\"Pan American Silver\", or the \"Company\") today announced preliminary operating results for the fourth quarter (\"Q4\") and full year 2017, with annual silver production within the targeted range and consolidated cash costs per payable ounce of silver, net of by-product credits, (\"Cash Costs\") below guidance. Today, the Company also provided its 2018 guidance and three-year outlook for production and costs.\n\"The Company achieved decade-low consolidated cash costs of $4.55 per ounce in 2017, with silver production as targeted of 25 million ounces, exemplifying the high quality of our silver mining assets. With the completion of our mine expansions in Mexico in 2017, we are now focused on ramping up production from these long-life mines to design capacity rates. Over the next three years, we expect silver production to grow at an annual compounded rate of 8%, reaching 30.5 to 33.0 million ounces by 2020,\" said Michael Steinmann, President and Chief Executive Officer of the Company.\nConsolidated Preliminary 2017 Operating Results\n2017 Guidance (1)\n2017 Actual\nFourth Quarter 2017\nProduction\nSilver (million ounces)\n24.5 - 26.0\n25.0\n6.6\nGold (thousand ounces)\n155.0 - 165.0\n160.0\n43.7\nZinc (thousand tonnes)\n56.5 - 58.5\n55.3\n14.7\nLead (thousand tonnes)\n19.0 - 20.0\n21.5\n5.4\nCopper (thousand tonnes)\n8.8 - 9.3\n13.4\n3.0\nCash Costs (2) ($/ounce)\n6.45 - 7.45\n4.55\n3.18\n(1)\nGuidance provided in the Company's news release dated January 12, 2017. During 2017, Pan American revised its guidance for 2017 Cash Costs, Consolidated All-In Sustaining Costs per Silver Ounce Sold (\"AISCSOS\") and project capital in its news release dated August 9, 2017. On November 8, 2017, the Company revised its guidance for 2017 base metal production and further reduced its estimate for Cash Costs.\n(2)\nPreliminary Cash Costs per payable ounce of silver, net of by-product credits. Average by-product metal prices for 2017 were: Au $1,257/oz, Zn $2,896/tonne, Pb $2,317/tonne, and Cu $6,166/tonne. Cash Costs is a non-GAAP measure and readers should refer to the information under the heading \"Alternative Performance (non-GAAP) Measures\" at the end of this news release for more information.\nPreliminary 2017 Operating Results by Mine\nMine\nSilver Production\n(million ounces)\nGold Production\n(thousand ounces)\nCash Costs ($/ounce) (1)\nLa Colorada\n7.1\n4.3\n2.08\nDolores\n4.2\n103.0\n(1.65)\nAlamo Dorado\n0.6\n2.1\n16.49\nHuaron\n3.7\n1.1\n1.35\nMorococha (92.3%) (2)\n2.6\n3.5\n(5.34)\nSan Vicente (95%) (2)\n3.6\n0.5\n11.85\nManantial Espejo\n3.1\n45.3\n18.25\nTotal (3)\n25.0\n160.0\n4.55\n(1)\nCash Costs is a non-GAAP measure and readers should refer to the information under the heading \"Alternative Performance (non-GAAP) Measures\" at the end of this news release for more information.\n(2)\nReflects Pan American's ownership in the operation.\n(3)\nTotals may not add up due to rounding.\n2017 Operating Highlights:\nConsolidated silver production of 25.0 million ounces was within the original guidance range provided in January 2017 (the \"Original Guidance\") of 24.5 million to 26.0 million ounces. Consolidated gold production of 160 thousand ounces was within the Original Guidance range of 155 thousand to 165 thousand ounces. Annual record set for gold production at Dolores. Record zinc and lead production with lead production beating the Company's Original Guidance and zinc production slightly below the Original Guidance. Copper production beat the Company's Original Guidance. Zinc and copper production were within the revised range provided on November 8, 2017 (the \"Revised Guidance\") while lead production was slightly above the Revised Guidance. Annual production records were set for zinc and lead at La Colorada. Decade-low annual consolidated Cash Costs of $4.55 were 35% below the midpoint of the Original Guidance of $6.45 to $7.45, and at the low end of the Revised Guidance, largely due to improved productivity at our mines in Peru and Mexico, higher by-product credits from strong base metal production and base metal prices, and improved concentrate treatment costs. Annual Cash Costs records were set at La Colorada, Huaron, Morococha, and Dolores. Construction of the La Colorada mine expansion was completed. Full design processing rates of 1,800 tonnes per day were achieved in mid-2017, about six months ahead of schedule. Average throughput exceeded design rates by about 5% during the last six months of 2017. Construction of the Dolores pulp agglomeration plant was completed and commissioning commenced. Heap leach pad stacking rates achieved 97% of the expanded capacity of 20,000 tonnes per day during the last four months of 2017. Implementation of \"Towards Sustainable Mining\" (\"TSM\") was initiated. TSM is a three-year initiative designed to enhance our community engagement processes, drive world-leading environmental practices and reinforce our commitment to the safety and health of our employees and surrounding communities.\n2018 Guidance and Three-Year Outlook\nPan American's guidance for 2018 as at January 11, 2018, is provided below. We may revise guidance during the year to reflect actual and anticipated results. We also provide a three-year outlook of our production, Cash Costs, sustaining capital and AISCSOS on a consolidated basis, which we update only on an annual basis.\n2018 Guidance by Mine\nMine\nSilver Production\n(million ounces)\nGold Production\n(thousand ounces)\nCash Costs ($/ounce) (1)\nLa Colorada\n7.4 - 7.7\n4.2 - 4.3\n1.35 - 1.70\nDolores\n4.5 - 4.9\n138.9 - 147.7\n(1.25) - 0.45\nHuaron\n3.6 - 3.8\n1.0\n0.75 - 1.50\nMorococha (92.3%) (2)\n2.5 - 2.7\n2.2 - 2.3\n(5.80) - (4.30)\nSan Vicente (95%) (2)\n3.9 - 4.1\n0.2\n10.00 - 10.50\nManantial Espejo\n3.2 - 3.3\n28.5 - 29.5\n17.60 - 19.00\nTotal (3)\n25.0 - 26.5\n175.0 - 185.0\n3.60 - 4.60\n(1)\nCash Costs is a non-GAAP measure and readers should refer to the information under the heading \"Alternative Performance (non-GAAP) Measures\" at the end of this news release for more information.\n(2)\nReflects Pan American's ownership in the operation.\n(3)\nTotals may not add up due to rounding.\nThree-year Outlook\nThe following table provides Pan American's guidance and outlook for the years 2018 to 2020 (the \"Three-year Outlook\"):\n2018 Guidance\n2019 Outlook\n2020 Outlook\nProduction\n", "external_links": ["http://www.panamericansilver.com/investors/events"], "published": "2018-01-11T16:00:00.000+02:00", "crawled": "2018-01-11T19:53:55.016+02:00", "highlightTitle": ""}