{"organizations": [], "uuid": "fba8875aa847dc67a95c7646a4917cf0ab2d056c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/11/10/104096706-GettyImages-613835366.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/trump-pledged-to-revive-coal-industry-little-has-changed-in-a-year.html", "country": "US", "domain_rank": 767, "title": "Trump pledged to revive coal industry. Little has changed in a year", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.158, "site_type": "news", "published": "2018-01-22T17:20:00.000+02:00", "replies_count": 0, "uuid": "fba8875aa847dc67a95c7646a4917cf0ab2d056c"}, "author": "Tom Dichristopher", "url": "https://www.cnbc.com/2018/01/22/trump-pledged-to-revive-coal-industry-little-has-changed-in-a-year.html", "ord_in_thread": 0, "title": "Trump pledged to revive coal industry. Little has changed in a year", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "neutral"}, {"name": "donald trump", "sentiment": "none"}, {"name": "dominick reuter", "sentiment": "none"}], "locations": [{"name": "wilkes-barre", "sentiment": "none"}, {"name": "mohegan sun arena", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump pledged to revive the coal industry and put miners back to work, but one year into his first term, there's been little change in the beleaguered industry.\nCoal production is up slightly and exports were a highlight in 2017, but coal-fired power plants are still closing. The best that can be said about employment is decades of job declines have bottomed out, which also has happened — temporarily — under past presidents.\nThis month, federal regulators dealt a blow to Trump's energy agenda by rejecting his administration's proposal to subsidize coal plants, its most proactive step to prevent more of them from shutting down.\n\"The overall trend is still very much down. 2017 was a recovery year.\" -James Stevenson, senior director of global coal at IHS Markit To be sure, it would be a heavy lift for any president to reverse the structural decline in the coal industry. But Trump has tried by repealing President Barack Obama 's signature plan to limit carbon emissions from power plants, scaled back other coal regulations and ended a moratorium on issuing leases to extract coal from federal lands.\nThose regulations created hurdles for the coal industry, but the main problem remains competition from cheap natural gas and renewable energy, said Matt Preston, research director for North American coal markets at Wood Mackenzie.\n\"All of those hurdles would have been overcome if natural gas was really expensive ... but with gas cheap, you just don't go over those hurdles.\"\n\"It's a help, there's no doubt about it,\" he said, referring to deregulation. \"But they're not going to improve the economics of today.\"\nLuke Popovich, vice president of external communications at the National Mining Association, said he disagrees that Trump's policies have been incidental or that the rebound has been modest.\n\"Had his administration prevailed with the Clean Power Plan, the moratorium on federal coal lease sales and the stream rule — all voided in this past year — coal communities and their employment would likely never have recovered,\" he said. \"That, to us, is the relevant and realistic measurement of coal's comeback\"\nHere's how coal performed on a number of fronts under Trump's watch.\nThe United States produced more coal in 2017 Coal production rose slightly during Trump's first year in office. The country produced 767.4 million short tons of coal in the year through Jan. 13, according to the latest available weekly estimate from the U.S. Energy Department.\nThat's up 3.6 percent from the previous 52-week period — just before Trump took office — when output totaled 740.4 million short tons.\nThe main driver was steeper natural gas prices, which meant coal was more competitive with gas for electric power generation, analysts say. Coal and natural gas each account for about 30 percent of the U.S. power mix. Coal eats into natural gas' lead when gas prices rise.\nNatural gas first overtook coal as the American grid's primary fuel source in 2015 after a surge in its use in power plants. Its rapid rise is now moderating, analysts say.\n\"The market really bottomed out in 2016. We had incredibly low gas prices and they displaced more coal generation than at any time before,\" said James Stevenson, senior director of global coal at IHS Markit.\n\"The overall trend is still very much down,\" said Stevenson, referring to U.S. coal production. \"2017 was a recovery year.\"\nThe U.S. Department of Energy forecast that coal production will slip by 2 percent this year and next. That outlook is based on its projection that natural gas prices will remain low over much of the next two years and demand for U.S. coal exports will slow down.\nBut coal plants are still shutting down Most coal produced in the United States is burned in power plants, and the country continued to mothball coal-fired facilities under Trump.\nThe United States retired about 5.5 gigawatts of coal-fired power generation in 2017, down significantly from recent years, when many small, inefficient plants shut down as new pollution rules took effect. But more than double the amount of coal-fired generation that retired last year is scheduled to come offline this year.\nSince Trump took office, 20 coal plants have announced they're shutting down, according to a count by the Sierra Club, an environmentalist group.\nThere's little chance new coal plants will open because natural gas facilities can be built cheaper and faster, says Stevenson. Utilities and independent power producers also anticipate greenhouse gas regulations will take effect at some point.\nU.S. miners also played a bigger part in the global coal trade A bump in U.S. coal exports also boosted mining activity. Coal exports rose 55 percent to 44.1 million short tons in the first half of 2017.\nDisruptions in Chinese and Australian coal supplies conspired with higher demand in parts of Europe and Asia to push up international coal prices last year, opening a window of opportunity for U.S. coal producers .\nDespite Trump's efforts to promote U.S. coal overseas, there is limited scope for export growth. The United States is a swing producer, meaning it typically picks up customers at times when demand is high and supplies from dominant exporters like Australia and South Africa are limited.\nPreston says today's high international coal prices will cause those major exporters to increase production and muscle out U.S. miners.\nIHS Markit believes the world genuinely needs more U.S. coal, but any uptick in exports won't be large enough to offset the drop in demand at home, said Stevensen.\nThe White House did not yet return a call for comment on this story.\nCoal employment barely budged Employment in coal mining is indeed trending higher under Trump. Analysts say that's to be expected given the moderate rise in production.\nThe United States added more than 1,100 coal mining jobs in the first six months of 2017, according to a quarterly census. The rebound began in the final months of 2016, when Obama was still in office and coal prices started rising.\nHowever, preliminary monthly data from the Bureau of Labor Statistics indicate that the gains have topped out, and employment is sliding back toward year-ago levels.\nGiven the size of the coal mining industry — about 51,000 employees — the change in employment in the bureau's survey of employers was so small in the year through October that economists can't say with certainty whether there was actually a net gain in jobs.\nThe United States has shed about 100,000 coal mining jobs over the last 30 years. Employment occasionally ticks up from year to year — including under Obama and George W. Bush — but there's nothing to suggest the long-term trend is reversing.\nHere's what the employment picture in Trump's first year looks like compared with the trend since Ronald Reagan's second term:", "external_links": [], "published": "2018-01-22T17:20:00.000+02:00", "crawled": "2018-01-22T17:20:50.021+02:00", "highlightTitle": ""}