{"organizations": [], "uuid": "b8bdf01376a1ab9704b7646e87cac7705f40c31e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-new-context-names-dustin-payne-vice-president-of-sales.html", "country": "US", "domain_rank": 767, "title": "New Context Names Dustin Payne Vice President of Sales", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T19:00:00.000+02:00", "replies_count": 0, "uuid": "b8bdf01376a1ab9704b7646e87cac7705f40c31e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-new-context-names-dustin-payne-vice-president-of-sales.html", "ord_in_thread": 0, "title": "New Context Names Dustin Payne Vice President of Sales", "locations": [], "entities": {"persons": [{"name": "dustin payne", "sentiment": "negative"}, {"name": "daniel riedel", "sentiment": "none"}, {"name": "dustin", "sentiment": "none"}, {"name": "payne", "sentiment": "none"}], "locations": [{"name": "sales san francisco", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO--(BUSINESS WIRE)-- New Context , a systems integrator that automates the orchestration, governance, and protection of critical infrastructure, today announced it has named former Chef Software executive, Dustin Payne, as Vice President of Sales. In his new role, Payne will focus on expanding New Context’s expertise in delivering mass scale automation and security to critical infrastructure customers across North America.\n“Dustin’s extensive network and business development expertise will be instrumental as New Context continues to forge partnerships to develop new cybersecurity technologies and tools to protect critical infrastructure from cyber attacks,” said Daniel Riedel, CEO, New Context.\n“His hands-on approach will drive adoption of our professional DevSecOps consulting services, enterprise cybersecurity systems integration and data governance solutions, furthering our vision to make the connected world safe. We look forward to Dustin’s contributions at New Context.”\nPrior to joining New Context, Payne held several roles at Chef Software that were critical to the company’s internal sales process and revenue growth. Dustin most recently served as a regional sales director, responsible for the top accounts in the Pacific Northwest, Desert Mountain and Western Canada territories. He is also an active member of a private technology board that advises best practices for configuration management and version control software.\n“New Context’s recent announcement of their ongoing collaboration with the U.S. Department of Energy and Idaho National Laboratory is proof that the they are working at the forefront of critical energy network protection,” said Payne. “I came to New Context to disrupt traditional enterprise’s perspective on achieving reliability and resilience in critical infrastructure and am excited to join the company at such an opportune time.”\nAbout New Context:\nNew Context is a Lean Security company that automates the orchestration, governance, and protection of the industrial Internet. We are a team of experts with extensive backgrounds in information security and scalable, secure application development. Our tools and processes streamline development frameworks to ensure transparent and secure IT software development within DevOps processes. New Context is Headquartered in San Francisco.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123005067/en/\nNew Context\nEmily Marquart, 888-773-8360\nMarketing Manager\ninfo@newcontext.com\nSource: New Context", "external_links": ["http://www.businesswire.com/news/home/20180123005067/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.newcontext.com%2F&esheet=51746178&newsitemid=20180123005067&lan=en-US&anchor=New+Context&index=1&md5=91ea3ded51ac996ab0bc144bee8f6349"], "published": "2018-01-23T19:00:00.000+02:00", "crawled": "2018-01-23T20:20:26.002+02:00", "highlightTitle": ""}