{"organizations": [], "uuid": "beb2a557696149e8d858f718b8a2365c1a944e26", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225241290&w=1200&r=LYNXMPEE0O1I0", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/ecb-policy-guidance/spooked-by-euro-rise-ecb-policymakers-split-on-next-move-sources-idINKBN1FE2SQ", "country": "US", "domain_rank": 408, "title": "Spooked by euro rise, ECB policymakers split on next move - sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T21:00:00.000+02:00", "replies_count": 0, "uuid": "beb2a557696149e8d858f718b8a2365c1a944e26"}, "author": "", "url": "https://in.reuters.com/article/ecb-policy-guidance/spooked-by-euro-rise-ecb-policymakers-split-on-next-move-sources-idINKBN1FE2SQ", "ord_in_thread": 0, "title": "Spooked by euro rise, ECB policymakers split on next move - sources", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "frankfurt", "sentiment": "none"}], "organizations": [{"name": "ecb", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FRANKFURT (Reuters) - European Central Bank policymakers gathering on Thursday were split on their next policy move as a stronger-than-expected rise in the euro gets in the way of their careful exit from years of aggressive stimulus, sources close to the matter told Reuters.\nThe ECB reaffirmed its easy policy of massive bond purchases and ultra low-rates on Thursday despite an increasingly upbeat assessment of the economy.\nRate setters had been working on the assumption of making a change to their policy message in March to signal that they were preparing to phase out their 2.55 trillion euro ($3.18 trillion) money-printing programme later in the year.\nBut a surge in the euro EUR= to three-year highs against the U.S. dollar in recent days is making their life harder by threatening to curb the recovery in euro zone inflation.\nThe euro rise has been fuelled by stronger-than-expected growth in the euro zone but also comments by a top U.S. policymaker in support of a weaker dollar.\nSome policymakers still want to discuss dropping in March a pledge to ramp up their bond purchases if needed, the three sources on or close to the Governing Council said.\n“There will be a serious discussion about the easing bias in March,” one of the sources said.\nA spokesman for the ECB declined to comment.\nThe signature of the President of the European Central Bank (ECB), Mario Draghi, is seen on the new 50 euro banknote during a presentation by the German Central Bank (Bundesbank) at its headquarters in Frankfurt, Germany, March 16, 2017. REUTERS/Kai Pfaffenbach This part of the policy message was added years ago to fight off the threat of deflation, or a sustained fall in prices, and is largely seen by investors as already outdated.\nThis token change, a concession to the members of the Governing Council who have been calling for months for an end to bond-buying, would then pave the way for bolder moves later in the year.\nBut other policymakers, taken aback by the euro move, felt that it was too early to make any commitment at Thursday’s meeting and want to reassess the whole situation in March.\n“The euro rise is a very serious matter,” one of the sources said.\nThe euro rise has been fuelled by stronger-than-expected growth in the euro zone but also comments by top U.S. policymaker welcoming a weaker dollar.\nAlready in December, policymakers had signalled their appetite for changing their ultra-easy policy message early in the New Year, including a promise to keep buying bonds until inflation heads back to the ECB’s target, accounts of the meeting showed.\nBut Draghi played down those expectations on Thursday, saying rate-setters had simply agreed to discuss the issue. He added differences on the Governing Council were not “existential” and merely related to the timing of future steps.\n($1 = 0.8011 euros)\nReporting By Francesco Canepa, Frank Sibelt and Balazs Koranyi; Editing by Angus MacSwan\n ", "external_links": [], "published": "2018-01-25T21:00:00.000+02:00", "crawled": "2018-01-25T21:29:41.012+02:00", "highlightTitle": ""}