{"organizations": [], "uuid": "afd6b5240391fb9043be9e1dbd8cd5affa590835", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-elite-group-inc-announces-loi-for-carter-county-resources.html", "country": "US", "domain_rank": 767, "title": "Elite Group, Inc. Announces LOI for Carter County Resources", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.195, "site_type": "news", "published": "2018-01-25T16:30:00.000+02:00", "replies_count": 0, "uuid": "afd6b5240391fb9043be9e1dbd8cd5affa590835"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-elite-group-inc-announces-loi-for-carter-county-resources.html", "ord_in_thread": 0, "title": "Elite Group, Inc. Announces LOI for Carter County Resources", "locations": [], "entities": {"persons": [{"name": "mcguire", "sentiment": "none"}, {"name": "terrence tecco", "sentiment": "none"}], "locations": [{"name": "frisco", "sentiment": "none"}, {"name": "tx.", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "odessa", "sentiment": "none"}], "organizations": [{"name": "elite group, inc.", "sentiment": "neutral"}, {"name": "elite group, inc", "sentiment": "neutral"}, {"name": "carter county resources", "sentiment": "none"}, {"name": "letter of intent", "sentiment": "none"}, {"name": "ccr", "sentiment": "none"}, {"name": "loi", "sentiment": "none"}, {"name": "msa", "sentiment": "none"}, {"name": "anadarko", "sentiment": "none"}, {"name": "plains pipeline", "sentiment": "none"}, {"name": "elite", "sentiment": "none"}, {"name": "energen", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FRISCO, TX., Elite Group, Inc. (OTC: ELTZ) a Nevada corporation established to acquire assets in the oil field service sector, announced today it has signed a Letter of Intent to acquire Carter County Resources (CCR), an oil and gas service company located in Odessa, Texas. CCR provides a multitude of services including roustabout services, equipment rental, welding services, and many others. Pursuant to the LOI, Elite Group, Inc. will acquire all assets including projects that generated revenue of approximately $1.5 million in 2017.\nTerrence Tecco, CEO of Elite Group, Inc. said Elite will launch a number of new services through CCR that will include grubber clearing and drill site construction, pipeline and pit construction. This new work will be added through CCR’s existing MSA’s (Master Service Agreements with multiple companies such as, Energen, Anadarko, Plains Pipeline and McGuire and others.\n“We are focused and aggressively pursuing our ongoing business strategy of identifying and acquiring assets with significant market potential in the oil field services sectors,” said Tecco. “CCR is the latest to become part of Elite Group.. We anticipate that we will have more acquisitions which we are currently targeting to announce during the course of this year which fit our model. Stay tuned.”\nAbout Elite Group, Inc.\nELITE Group, Inc.( www.EliteGroupEnergy.com ) is a Nevada corporation established to acquire assets in the oil field service sector. ELITE Group, Inc. specializes in the acquisition of assets related to the oil field services. Management’s objective is to acquire and consolidate oil field service assets in the prolific oil and gas exploration areas – primarily in the Permian and Eagle Ford Basins.Management believes it will accomplish its goal to maximize shareholder value through strategic acquisitions, effective business model design and economies of scale to a expanding industry. Elite’s management currently has relationships with a substantial number of oil and gas operators in the Permian and Eagle Ford basins. ELITE Group, Inc. will use the most environmentally friendly procedures and processes available to the industry.\nForward-Looking Statements\nCertain statements in this press release and elsewhere by management of the Company that are neither reported financial results nor other historical information are \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Such forward-looking statements are not guarantees of future performance and are subject to known and unknown risks, uncertainties and other factors which may cause or contribute to actual results of the Company's operations varying significantly and materially from anticipated results. Debt Resolve undertakes no obligation to publicly update any forward-looking statement, whether as a result of new information, future events or otherwise, except as required by SEC rules. Investors are advised to consult any further disclosures made on related subjects in the Company's reports filed with the SEC.\nElite Group, Inc. 4760 Preston Road #244-144 Frisco, TX 75034 http://www.elitegroupenergy.com For Investor Relations: Synergy: 1-888-259-9173 Media Contact: Dave Donlin 407-490-6635 ddonlin@publicwire.com\nSource:Elite Group Inc", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/c2f4a074-1362-4530-8c24-7e07db8ef6a1"], "published": "2018-01-25T16:30:00.000+02:00", "crawled": "2018-01-25T18:14:19.021+02:00", "highlightTitle": ""}