{"organizations": [], "uuid": "1f956c2c4b229dd226eb8927759cd64c92d8abe8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-markets/global-markets-boj-bond-tweak-buoys-yen-stocks-rally-rumbles-on-idUSL8N1P43V4", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-BOJ bond tweak buoys yen, stocks rally rumbles on", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.016, "site_type": "news", "published": "2018-01-09T21:20:00.000+02:00", "replies_count": 0, "uuid": "1f956c2c4b229dd226eb8927759cd64c92d8abe8"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-markets/global-markets-boj-bond-tweak-buoys-yen-stocks-rally-rumbles-on-idUSL8N1P43V4", "ord_in_thread": 0, "title": "GLOBAL MARKETS-BOJ bond tweak buoys yen, stocks rally rumbles on", "locations": [], "entities": {"persons": [{"name": "marc jones", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "bank of japan", "sentiment": "negative"}, {"name": "msci", "sentiment": "none"}, {"name": "samsung", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Yen rises after Bank of Japan trims JGB purchases\n* Crude oil futures rise to highest since May 2015\n* Samsung’s guidance disappoints, weighing on tech sector\n* Nikkei probes highest levels since November 1991\n* Europe helps world stocks extend flying start to year\n* Graphic: World FX rates in 2018 tmsnrt.rs/2egbfVh\nBy Marc Jones\nLONDON, Jan 9 (Reuters) - A tweak to the Bank of Japan’s bond-buying programme shunted the yen higher on Tuesday, while gains from commodity stocks as oil hit its highest since 2015 helped world shares maintain their flying start to the year.\nMSCI’s all-country world stocks index posted another record high as Europe’s main markets shrugged off a tech wobble in Asia and instead cheered Christmas trading updates, the oil gains and more forecast-beating data from Germany.\nWall Street was expected to inch to fresh peaks too when trading resumes, though there will be plenty of cross-market cross-winds to tack through.\nU.S. Treasury yields -- the biggest driver of global borrowing costs -- had briefly touched a nine-month high in Europe on the mix of higher oil prices, good economic data and an unexpected move by the BOJ to trim its long-dated bond buys.\nThat stoked speculation it could start to wind down its stimulus policy this year and saw the yen rise as much as half a percent to 112.50 yen to the dollar.\n“It shouldn’t be perceived as a monstrous signal of the end of monetary easing but it shows that even the tiniest announcement on a quiet day can have a reaction,” said Societe Generale’s global head of currency strategy Kit Juckes.\n“And it shows that when they start turning their ship around from this policy, the yen is going to go miles.”\nSince it adopted its yield-curve-control policy in 2016, the BOJ has occasionally tweaked its buying, but some market players seemed to take Tuesday’s move as a signal of possible intent.\nThe dollar, meanwhile, was rising against most other major currencies including the euro, which having approached three-year highs last week slipped to a 10-day low of $1.1941 .\nThat was despite the biggest increase in German industrial output since September 2009 and suggested investors might be becoming more cautious after a months-long rally that has pushed “long” euro positions to record levels.\n“I don’t think right now levels substantially above $1.20 are justified,” Reichelt said. “I know the market is very optimistic about the euro, but if you look at the data and the central bank, the ECB (European Central Bank) is still on an expansionary path.”\nHOT OIL, EVEN HOTTER EARNINGS Wall Street’s expected tick higher later comes with the fourth-quarter earnings season there just beginning and investors unashamedly upbeat.\nCiti analysts say global earnings revisions have now been upgraded for 14 weeks in a row, the best run of weekly upgrades since their data series started in 2000.\nAlthough high levels of earnings revisions are usually seen at the start or end of the economic/market cycle, they said “it is still too early to call the end of this cycle”.\nCommodity markets are one of potential factors in that. Oil prices jumped to their highest since mid-2015 on Tuesday amid OPEC-led production cuts and a dip in American drilling.\nBrent crude the international benchmark, jetted as high as $68.29 a barrel, its highest since May 2015, with U.S. WTI crude doing the same as it rose to $61.91.\nBeyond equalling that 2015 high, which was a short intra-day spike, Tuesday’s high was the strongest for WTI since December, 2014, at the start of the oil market slump.\n“Speculators continued to increase their net long in ICE Brent ... According to exchange data, speculators increased their position by 4,175 lots to leave them with a record net long of 565,459 lots,” ING bank said.\nAsian trading saw its own milestones. Japan’s Nikkei closed at its highest since November 1991, China chalked up an eighth day of gains and stocks in the Philippines jumped 2 percent to a new all-time high.\nSouth Korea’s KOPSI was dragged down though by a 3.1 percent drop in Samsung’s shares after its profit guidance disappointed some analysts who are also wary about longevity of the boom in demand for the firm’s memory chips.\nEmerging market stocks were a touch lower anyway having hit a 6-1/2 year high this week.\nAngola’s kwanza currency was braced for an expected devaluation, while Venezuela’s battered bonds were dealt another blow as a key market body recommended that they should be traded on the presumption that they have as-good-as defaulted.\nAdditional reporting by Jemima Kelly in London; Editing by Catherine Evans\n ", "external_links": ["http://tmsnrt.rs/2egbfVh", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-09T21:20:00.000+02:00", "crawled": "2018-01-10T03:04:12.011+02:00", "highlightTitle": ""}