{"organizations": [], "uuid": "b58dbcb6ad835bd4ecb6ab80e844f0030afbc70f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219271468&w=1200&r=LYNXMPEE030GW", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-eurozone-economy-pmi/euro-zone-economys-growth-best-in-nearly-seven-years-pmis-suggest-idUKKBN1ET0V7", "country": "US", "domain_rank": 408, "title": "Euro zone economy's growth best in nearly seven years, PMIs suggest", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T11:04:00.000+02:00", "replies_count": 0, "uuid": "b58dbcb6ad835bd4ecb6ab80e844f0030afbc70f"}, "author": "", "url": "https://uk.reuters.com/article/us-eurozone-economy-pmi/euro-zone-economys-growth-best-in-nearly-seven-years-pmis-suggest-idUKKBN1ET0V7", "ord_in_thread": 0, "title": "Euro zone economy's growth best in nearly seven years, PMIs suggest", "locations": [], "entities": {"persons": [{"name": "rahul karunakar", "sentiment": "none"}], "locations": [{"name": "la defense", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "reuters tv united states", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "ihs markit", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Reuters TV United States January 4, 2018 / 9:12 AM / a few seconds ago Euro zone economy's growth best in nearly seven years, PMIs suggest Rahul Karunakar 3 Min Read \nThe euro zone economy closed out the year with the strongest growth in nearly seven years, driven by accelerating services and manufacturing activity across all major economies, a survey showed on Thursday. A woman walks on the esplanade of La Defense, in the financial and business district of La Defense, west of Paris, France November 21, 2017. REUTERS/Gonzalo Fuentes \nThe news will put pressure on the European Central Bank to close out its aggressive stimulus this year, and coincides with the central bank’s decision to halve its monthly bond purchases to 30 billion euros starting this month. \nIHS Markit’s Final Composite Purchasing Managers’ Index - seen as a good overall growth indicator for the euro zone - rose to 58.1 in December from 57.5 in November and up slightly from the flash estimate of 58.0. \nIt is now at its highest since February 2011 and well above the 50 mark that separates growth from contraction. \n“A stellar end to 2017 for the euro zone rounded off the best year for over a decade, continuing to confound widely held fears that rising political uncertainty would curb economic growth,” Chris Williamson, chief business economist at IHS Markit, said in a release. \nThe average composite euro zone PMI reading for 2017, 56.4, was the best annual trend since 2006, Williamson noted -- just before the financial crisis. \nThe data suggested fourth-quarter economic growth of 0.8 percent, faster than many other developed-market economies and exceeding the median forecast of 0.6 percent in a Reuters poll last month. \nBased on forward-looking indicators within the PMI release, the momentum is set to continue. The composite new orders index climbed to 58.0 last month - its highest since July 2007 - from 57.3. That demand pushed companies to add staff; hiring growth matched a 17-year record high set in November. \nEuro zone unemployment peaked at 12.1 percent in the first half of 2013. It has now declined to 8.8 percent. \nThe services PMI, which is part of the composite, soared to its highest in more than six years, 56.6, up from 56.2 in November. That followed a report on Tuesday showing the manufacturing PMI climbed to its highest in more than two decades of survey data. \nBut price pressure eased, a disappointing development for the ECB, which has been struggling to boost inflation. The rate of increases in input costs and what business charge consumers slowed for the first time in five months. Still, inflationary pressures remain at levels not seen in over six years. \n“Based on past experience, the extent to which demand appears to be outstripping supply for many goods and services suggests that inflationary pressures could continue to build in the coming months,” noted Williamson. \n”A big question for 2018 will therefore be whether relatively high unemployment and spare capacity in many \ncountries will continue to hold down pay growth and keep a ceiling on consumer price inflation.” Reporting by Rahul Karunakar, editing by Larry King", "external_links": [], "published": "2018-01-04T11:04:00.000+02:00", "crawled": "2018-01-04T11:19:06.013+02:00", "highlightTitle": ""}