{"organizations": [], "uuid": "a735b8f6156f291c7ace764cc93d6cc9ee084fcf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-davos-meeting-oil/oil-rally-may-run-further-on-venezuelas-output-woes-fund-interest-idUSKBN1FC1DG", "country": "US", "domain_rank": 408, "title": "Oil rally may run further on Venezuela's output woes, fund interest", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-23T19:36:00.000+02:00", "replies_count": 0, "uuid": "a735b8f6156f291c7ace764cc93d6cc9ee084fcf"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-davos-meeting-oil/oil-rally-may-run-further-on-venezuelas-output-woes-fund-interest-idUSKBN1FC1DG", "ord_in_thread": 0, "title": "Oil rally may run further on Venezuela's output woes, fund interest", "locations": [], "entities": {"persons": [{"name": "majid jafar", "sentiment": "none"}, {"name": "marco dunand", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "venezuela", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "reuters television", "sentiment": "none"}, {"name": "crescent petroleum", "sentiment": "none"}, {"name": "mercuria", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DAVOS, Switzerland (Reuters) - A rally that pushed oil prices above $70 a barrel in January for the first time in three years may have further to run because of falling Venezuelan output and funds’ appetite for commodities, some oil firms and trading houses said.\nMajid Jafar, Crescent Petroleum’s chief executive, said prices could rise to as high as $80 per barrel if the economic crisis in Venezuela leads to further output falls. Its production has already dropped to a three-decade low.\n“My concern is that events in Venezuela could lead to a shock and prices could go to $80 per barrel this year,” he told Reuters Television at the World Economic Forum in Davos.\nHe said low levels of investment in the past three to four years, as oil firms reined in spending when crude prices plunged from above $100 to below $30, has led to a shortage of new projects that could create a supply deficit in the mid-term.\nMarco Dunand, the chief executive and co-owner of trading house Mercuria said, global oil demand growth had surprised on the upside, which was also supporting prices.\n“People talk about peak demand but then demand all of a sudden accelerates further. And you have global GDP growth rates above average, which is creating inflation fears,” he said.\n“In that environment, many macro funds want to be long commodities and use them as a hedge against inflation,” he said.\nOpen interest in Brent and WTI benchmark contracts, or the number of futures and options contracts owned by fund mangers, has reached new highs.\n“People say it will collapse soon. Not necessarily. It happens as equity markets have gone up like crazy. So to keep percentage allocation unchanged, the macro funds have to buy commodities. It helps explain why open interest in oil is so big,” Dunand said.\nBut some oil majors remain cautious about betting on further price gains.\n“We are certainly not planning for such prices,” said Bob Dudley, the head of oil major BP, adding that he did not expect them to rise above $70.\nLike other majors, BP cut costs sharply in the past three years as crude prices collapsed as a result of the boom in U.S. shale oil output that flooded the market with new oil.\nPrices started recovering after the Organization of the Petroleum Exporting Countries, Russia and some other producers agreed to curb production and remove the glut. The production curbs began in January 2017 and will run until the end of 2018.\nBut the price recovery has spurred on U.S. shale output again.\nMost oil majors are now approving new projects that work at prices below $40 to $50 a barrel to avoid being caught out if the price rally peters out and prices slip again.\nReporting by Dmitry Zhdannikov; Editing by Edmund Blair\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T19:36:00.000+02:00", "crawled": "2018-01-23T14:00:43.012+02:00", "highlightTitle": ""}