{"organizations": [], "uuid": "e423029bbba3b70b34c69cbd35ce718325c1d425", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/global-dollar-markets/rpt-column-world-markets-lap-up-mnuchins-dollar-view-mcgeever-idUSL8N1PL1JF", "country": "US", "domain_rank": 408, "title": "RPT-COLUMN-World markets lap up Mnuchin's dollar view: McGeever", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T10:25:00.000+02:00", "replies_count": 0, "uuid": "e423029bbba3b70b34c69cbd35ce718325c1d425"}, "author": "", "url": "https://www.reuters.com/article/global-dollar-markets/rpt-column-world-markets-lap-up-mnuchins-dollar-view-mcgeever-idUSL8N1PL1JF", "ord_in_thread": 0, "title": "RPT-COLUMN-World markets lap up Mnuchin's dollar view: McGeever", "locations": [], "entities": {"persons": [{"name": "mnuchin", "sentiment": "negative"}, {"name": "mcgeever", "sentiment": "negative"}, {"name": "jamie mcgeever", "sentiment": "none"}, {"name": "steven mnuchin", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "wall street", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "mcgeever reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Repeats Jan 25 column, no change to text)\nBy Jamie McGeever\nLONDON, Jan 25 (Reuters) - U.S. Treasury Secretary Steven Mnuchin this week has given the clearest indication to date that Washington’s long-standing “strong dollar” policy is over.\nYet while some countries may be nervous about their own currencies rising as a result, there’s not much that could give the global economy and markets a bigger boost right now than a cheap dollar.\nWall Street, world stocks, gold, oil and credit markets have all powered higher since Mnuchin said on Wednesday: “Obviously a weaker dollar is good for us as it relates to trade and opportunities.” Bond markets, under increasing pressure in recent weeks, have held their ground too.\nA weaker dollar flatters U.S. corporate earnings, which will give support to the melt up on Wall Street (and world stocks at large). The perfect fillip for U.S. equities that are beginning to look stretched and expensive.\nOn a price/earnings ratio basis, U.S. stocks are their most expensive since 2002, and far more expensive than euro zone, Japanese and UK stocks. That gap over their foreign peers has widened dramatically in recent months.\nA weaker dollar also eases the strain on overseas borrowers loaded up on $11 trillion of dollar debt. More than $3.5 trillion of these loans resides in emerging market countries, which still bear the scars of exchange rate crises past.\nAccording to the Institute of International Finance, the Washington-based global banking lobby group, $1.5 trillion of emerging market bonds and syndicated loans come due in 2018. Nearly $400 billion of that is in dollars.\n“Rollover risk for emerging markets is high this year. Stronger hard currencies would pose substantial risks for some emerging markets,” the IIF said in a report on global debt earlier this month.\nAs far as developed economies go, the flip side of a weak dollar is a stronger euro and yen. While this complicates the European Central Bank and Bank of Japan’s ability to generate the inflation they desperately want, it also lessens the pressure on them to tighten monetary policy.\nAll else being equal, this is extra fuel for financial markets already firing on all cylinders. The withdrawal of global central bank stimulus might be more gradual than initially expected.\nAnd if you buy into the Bank for International Settlement’s theory that the dollar is now the best barometer of global investor risk appetite and financial market leverage, a weak dollar can only be good news for world markets.\nIf risk appetite is weak when the dollar is strong, as the BIS says, then the reverse must also be true because a weaker dollar loosens financial conditions not just in the United States but globally. A sweet spot for world markets.\nAnd despite the Fed’s five rate hikes and near certainty of more to come, financial conditions in the United States have not been this loose for more than three years, according to Goldman Sachs.\nUnderpinning all of this is the strongest global economy in years, with world growth expected to reach nearly 4 percent this year and next, according to the IMF. Not only that, growth is extremely broad-based across geographical regions and economic sectors.\nThe euro zone’s economic boom, for example, is why the ECB may be less concerned with the euro’s run to a three-year high now than it might have been previously when the economy was more fragile. Even perennial laggard Italy appears to be turning a corner, despite the rampant euro.\nMnuchin made his remarks on the dollar at the World Economic Forum in Davos on Wednesday, sparking the dollar’s biggest one-day fall since June. Speaking again in the Swiss ski resort on Thursday, Mnuchin declined to row back on them.\n“I thought it was actually balanced and consistent with what I’ve said before, which is, we are not concerned with where the dollar is in the short term,” he said.\nOn the surface at least, this marks a departure from his predecessors Larry Summers, Paul O‘Neill, John Snow, Hank Paulson, Tim Geithner and Jack Lew. They all, with varying degrees of enthusiasm, signed up to Robert Rubin’s doctrine first aired in 1995 that a strong dollar is in the U.S. interest.\nWriting in the Washington Post on Thursday, Summers said Mnuchin had made a “very problematic statement”. Talking the dollar down risks generating an avalanche of selling that could have severe consequences, he said.\nIt risks pushing up U.S. interest rates over time, which will mean “less investment, lower stock prices and more risk of financial instability,” Summers wrote. It could also spark a currency war as other countries take retaliatory measures.\nBut Mnuchin and Commerce Secretary Wilbur Ross, who were joined in Davos on Thursday by President Donald Trump, are unlikely to pay much heed to these warnings.\nTrump will promote his “America First” agenda in his address to the Forum on Friday, and a lower exchange rate fits into that world view perfectly. Right now, as long as the dollar decline remains smooth, it will not do world markets any harm either.\nReporting by Jamie McGeever; Editing by Angus MacSwan\n ", "external_links": [], "published": "2018-01-26T10:25:00.000+02:00", "crawled": "2018-01-26T10:44:18.023+02:00", "highlightTitle": ""}