{"organizations": [], "uuid": "e807f8025b2e54ecd49c40d8991c60fc3aace974", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-solar-senior-capital-ltd-announces-q4-2017-net-investment-income-per-share-of-0-point-35-and-estimated-net-asset-value-per.html", "country": "US", "domain_rank": 767, "title": "Solar Senior Capital Ltd. Announces Q4 2017 Net Investment Income Per Share of $0.35 and Estimated Net Asset Value Per Share in the range of $16.81 to $16.84", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T16:00:00.000+02:00", "replies_count": 0, "uuid": "e807f8025b2e54ecd49c40d8991c60fc3aace974"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-solar-senior-capital-ltd-announces-q4-2017-net-investment-income-per-share-of-0-point-35-and-estimated-net-asset-value-per.html", "ord_in_thread": 0, "title": "Solar Senior Capital Ltd. Announces Q4 2017 Net Investment Income Per Share of $0.35 and Estimated Net Asset Value Per Share in the range of $16.81 to $16.84", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "globe newswire", "sentiment": "negative"}, {"name": "solar senior capital ltd", "sentiment": "neutral"}, {"name": "solar senior capital ltd.", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "north mill capital llc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 10, 2018 (GLOBE NEWSWIRE) -- In conjunction with hosting its Analyst Day on January 10, 2018, Solar Senior Capital Ltd. (NASDAQ:SUNS) (“Solar Senior” or the “Company”) is hereby disclosing certain estimated results for the quarter ended December 31, 2017.\nFor the quarter ended December 31, 2017, management expects the Company’s net investment income per share to be $0.35, consistent with $0.35 for the quarter ended September 30, 2017. Approximately $0.3 million of performance-based incentive fees were voluntarily waived by the Company’s investment manager for the quarter ended December 31, 2017 compared to $0.7 million of management fees and performance-based incentive fees waived in Q3 2017. The reduced fee waiver in Q4 2017 is a direct result of the Company generating higher gross investment income due to its net portfolio growth as well as an increase in the weighted average portfolio yield primarily attributable to its recent acquisition of North Mill Capital LLC.\nManagement expects the Company’s net asset value per share at December 31, 2017 to be in the range of $16.81 to $16.84 compared to the net asset value per share of $16.81 as of September 30, 2017.\nFor the quarter ended December 31, 2017, the Company’s comprehensive portfolio activity 1 includes investments of approximately $85 million and prepayments and other exits of approximately $52 million. In addition, management expects the Company’s net debt/equity ratio to be approximately 0.45x at December 31, 2017.\nAt December 31, 2017, the Company had no investments on non-accrual.\nOn October 24, 2017, the Company announced that it acquired 100% of the equity interests of North Mill Capital LLC (“North Mill”). North Mill is a leading asset-based lending commercial finance company that provides senior secured asset-backed financings to U.S. based small-to-medium sized businesses primarily in the manufacturing, services and distribution industries. The acquisition further diversifies and expands the Company’s senior secured direct lending investment channels, provides differentiated sources of growth, and increases the earnings power of Solar Senior’s portfolio.\nAdditionally, on January 5, 2018, the Board declared a distribution of $0.1175 per share for the month of January 2018. The distribution is payable on January 31, 2018 to stockholders of record as of January 18, 2018.\nThe estimates presented are subject to the completion of financial closing procedures and are not a comprehensive statement of our financial condition or results for the period from October 1, 2017 through December 31, 2017.\nThe preliminary estimates and guidance provided herein have been prepared by, and are the responsibility of, management. Neither our independent registered public accounting firm, nor our Board of Directors, have audited, reviewed, compiled, or performed any procedures with respect to the accompanying preliminary financial data and estimates. Accordingly, our independent registered public accounting firm and our Board of Directors do not express an opinion or any form of assurance with respect thereto and assumes no responsibility for, and disclaims any association with, this preliminary information. Actual results for the period may differ materially.\nABOUT SOLAR SENIOR CAPITAL LTD.\nSolar Senior Capital Ltd. is a closed-end investment company that has elected to be treated as a business development company under the Investment Company Act of 1940. A specialty finance company with expertise in several niche markets, the Company primarily invests directly and indirectly in leveraged, U.S. middle market companies in the form of cash flow senior secured loans including first lien and second lien debt instruments and asset-based loans including senior secured loans collateralized on a first lien basis primarily by current assets.\nFORWARD-LOOKING STATEMENTS\nStatements included herein may constitute “forward-looking statements,” which relate to future events or our future performance or financial condition. These statements are not guarantees of future performance, condition or results and involve a number of risks and uncertainties. Actual results may differ materially from those in the forward-looking statements as a result of a number of factors, including those described from time to time in our filings with the Securities and Exchange Commission. Solar Senior Capital Ltd. undertakes no duty to update any forward-looking statements made herein, unless required to do so by law.\nCONTACT\nSolar Senior Capital Ltd.\nInvestor Relations\n646-308-8770", "external_links": [], "published": "2018-01-10T16:00:00.000+02:00", "crawled": "2018-01-10T19:15:20.031+02:00", "highlightTitle": ""}