{"organizations": [], "uuid": "a84a59445d4c4a2342b55ee75e96e2880f8f1d89", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-aep-reports-strong-2017-fourth-quarter-and-year-end-earnings.html", "country": "US", "domain_rank": 767, "title": "AEP Reports Strong 2017 Fourth-Quarter And Year-End Earnings", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.016, "site_type": "news", "published": "2018-01-25T14:57:00.000+02:00", "replies_count": 0, "uuid": "a84a59445d4c4a2342b55ee75e96e2880f8f1d89"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-aep-reports-strong-2017-fourth-quarter-and-year-end-earnings.html", "ord_in_thread": 0, "title": "AEP Reports Strong 2017 Fourth-Quarter And Year-End Earnings", "locations": [], "entities": {"persons": [], "locations": [{"name": "columbus", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "aep", "sentiment": "negative"}, {"name": "gaap", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "american electric power", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "COLUMBUS, Ohio, Jan. 25, 2018 /PRNewswire/ --\nAMERICAN ELECTRIC POWER\nPreliminary, unaudited results\nFourth Quarter ended December 31\nYear-to-date ended December 31\n2017\n2016\nVariance\n2017\n2016\nVariance\nRevenue ($ in billions):\n3.8\n3.8\n—\n15.4\n16.4\n(1.0)\nEarnings (Loss) ($ in millions):\nGAAP\n400.7\n373.4\n27.3\n1,912.6\n610.9\n1,301.7\nOperating (non-GAAP)\n420.1\n330.4\n89.7\n1,807.9\n1,937.0\n(129.1)\nEPS ($):\nGAAP\n0.81\n0.76\n0.05\n3.89\n1.24\n2.65\nOperating (non-GAAP)\n0.85\n0.67\n0.18\n3.68\n3.94\n(0.26)\nEPS based on 492mm shares 4Q 2017, 492mm shares 4Q 2016, 492mm shares YTD 2017 and 491mm shares YTD 2016.\nAmerican Electric Power (NYSE: AEP) today reported fourth-quarter 2017 earnings, prepared in accordance with Generally Accepted Accounting Principles (GAAP), of $401 million or $0.81 per share, compared with a GAAP earnings of $373 million or $0.76 per share in fourth-quarter 2016. Operating earnings for fourth-quarter 2017 were $420 million or $0.85 per share, compared with operating earnings of $330 million or $0.67 per share in fourth-quarter 2016. Operating earnings is a non-GAAP measure representing GAAP earnings excluding special items.\nYear-end 2017 GAAP earnings were $1.913 billion or $3.89 per share, compared with GAAP earnings of $611 million or $1.24 per share for year-end 2016. Year-end 2017 operating earnings were $1.808 billion or $3.68 per share, compared with operating earnings of $1.937 billion or $3.94 per share for year-end 2016.\nThe difference between fourth-quarter 2017 GAAP and operating earnings was largely due to certain impairments of generation assets, partially offset by the effects of the Tax Cuts and Jobs Act enacted in December 2017.\nThe difference between year-end 2017 GAAP and operating earnings was largely due to gain on the sale of competitive generation assets in January 2017 and the effects of the Tax Cuts and Jobs Act, partially offset by certain generation plant impairments.\nA full reconciliation of GAAP earnings to operating earnings for the quarter and year-to-date is included in the tables at the end of this news release.\n\"Investments in our core, regulated businesses to enhance service for our customers continue to support solid earnings growth. We delivered strong earnings for 2017 despite the negative impacts of mild temperatures and the loss of revenue from the competitive generation assets that we sold early in the year,\" said Nicholas K. Akins, AEP chairman, president and chief executive officer. \"In 2017, AEP delivered a total shareholder return of nearly 21 percent, exceeding the 10.6 percent total return for the S&P 500 Electric Utilities Index. Over the past five years, we've provided a total shareholder return of more than 108 percent, on par with the broader S&P 500 Index and well exceeding the 71 percent total return for the S&P 500 Electric Utilities Index,\" Akins said.\n\"Our transmission business continues to grow. Earnings from our AEP Transmission Holding Co. were $0.72 per share, an increase of 18 cents from 2016. Net plant, less deferred taxes, for that business grew by $2.1 billion, an increase of 52 percent year over year.\n\"We are still evaluating the impact of tax reform and will be working with state regulatory commissions to determine the best options for delivering these tax benefits to our customers. Because of our strong balance sheet, we only needed to slightly modify our capex plans in response to tax reform. This allows us to continue investing to improve service for our customers and maintain our 5 to 7 percent operating earnings growth rate and credit ratings without changing our previously disclosed equity requirements,\" Akins said.\nAEP revised its capital investment plan for 2018 through 2020. The company plans to maintain its previously forecasted capital investment for 2018 and 2019 at $6 billion and $6.2 billion, respectively, and lower its expected capital investment for 2020 by $500 million to $5.5 billion. This forecast does not include the proposed Wind Catcher project.\nSUMMARY OF RESULTS BY SEGMENT\n$ in millions\nGAAP Earnings\n4Q 17\n4Q 16\nVariance\nYTD 17\nYTD 16\nVariance\nVertically Integrated Utilities (a)\n163.9\n150.6\n13.3\n790.5\n979.9\n(189.4)\nTransmission & Distribution Utilities (b)\n262.1\n94.3\n167.8\n636.4\n482.1\n154.3\nAEP Transmission Holdco (c)\n76.4\n58.8\n17.6\n352.1\n266.3\n85.8\nGeneration & Marketing (d)\n(80.3)\n50.8\n(131.1)\n166.0\n(1,198.0)\n1,364.0\nCorporate and Other (e)\n(21.4)\n18.9\n(40.3)\n(32.4)\n80.6\n(113.0)\nTotal GAAP Earnings (Loss)\n400.7\n373.4\n27.3\n1,912.6\n610.9\n1,301.7\nOperating Earnings (non-GAAP)\n4Q 17\n4Q 16\nVariance\nYTD 17\nYTD 16\nVariance\nVertically Integrated Utilities (a)\n179.4\n150.6\n28.8\n806.0\n986.7\n(180.7)\nTransmission & Distribution Utilities (b)\n123.9\n81.5\n42.4\n498.2\n469.3\n28.9\nAEP Transmission Holdco (c)\n78.5\n58.8\n19.7\n354.2\n266.3\n87.9\nGeneration & Marketing (d)\n24.5\n47.8\n(23.3)\n146.7\n245.5\n(98.8)\nCorporate and Other (e)\n13.8\n(8.3)\n22.1\n2.8\n(30.8)\n33.6\nTotal Operating Earnings (non-GAAP)\n420.1\n330.4\n89.7\n1,807.9\n1,937.0\n(129.1)\nA full reconciliation of GAAP earnings to operating earnings is included in tables at the end of this news release.\na.\nIncludes AEP Generating Co., Appalachian Power, Indiana Michigan Power, Kentucky Power, Kingsport Power, Public Service Company of Oklahoma, Southwestern Electric Power and Wheeling Power\nb.\nIncludes Ohio Power and AEP Texas\nc.\nIncludes wholly-owned transmission-only subsidiaries and transmission-only joint ventures\nd.\nIncludes AEP OnSite Partners, AEP Renewables, competitive generation in ERCOT and PJM as well as marketing, risk management and retail activities in ERCOT, PJM and MISO\ne.\nIncludes commercial barging operations in prior periods\nEARNINGS GUIDANCE\nManagement reaffirms its 2018 operating earnings guidance range of $3.75 to $3.95 per share. Operating earnings could differ from GAAP earnings for matters such as impairments, divestitures or changes in accounting principles. AEP management is not able to forecast if any of these items will occur or any amounts that may be reported for future periods. Therefore, AEP is not able to provide a corresponding GAAP equivalent for earnings guidance.\nWEBCAST\nAEP's quarterly discussion with financial analysts and investors will be broadcast live over the internet at 9 a.m. EST today at http://www.aep.com/webcasts . The webcast will include audio of the discussion and visuals of charts and graphics referred to by AEP management. The charts and graphics will be available for download at http://www.aep.com/webcasts .\nAmerican Electric Power, based in Columbus, Ohio, is focused on building a smarter energy infrastructure and delivering new technologies and custom energy solutions to our customers. AEP's more than 17,000 employees operate and maintain the nation's largest electricity transmission system and more than 224,000 miles of distribution lines to efficiently deliver safe, reliable power to nearly 5.4 million regulated customers in 11 states. AEP also is one of the nation's largest electricity producers with approximately 33,000 megawatts of diverse generating capacity, including 4,200 megawatts of renewable energy. AEP's family of companies includes utilities AEP Ohio, AEP Texas, Appalachian Power (in Virginia and West Virginia), AEP Appalachian Power (in Tennessee), Indiana Michigan Power, Kentucky Power, Public Service Company of Oklahoma, and Southwestern Electric Power Company (in Arkansas, Louisiana and east Texas). AEP also owns AEP Energy, AEP Energy Partners, AEP OnSite Partners and AEP Renewables, which provide innovative competitive energy solutions nationwide.\nAEP's earnings are prepared in accordance with accounting principles generally accepted in the United States and represent the company's earnings as reported to the Securities and Exchange Commission. The company's operating earnings, a non-GAAP measure representing GAAP earnings excluding special items as described in the news release and charts, provide another representation for investors to evaluate the performance of the company's ongoing business activities. AEP uses operating earnings as the primary performance measurement when communicating with analysts and investors regarding its earnings outlook and results. The company uses operating earnings data internally to measure performance against budget and to report to AEP's Board of Directors and also as an input in determining performance-based compensation under the company's employee incentive compensation plans.\n---\nThis report made by American Electric Power and its Registrant Subsidiaries contains forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934. Although AEP and each of its Registrant Subsidiaries believe that their expectations are based on reasonable assumptions, any such statements may be influenced by factors that could cause actual outcomes and results to be materially different from those projected. Among the factors that could cause actual results to differ materially from those in the forward-looking statements are: economic growth or contraction within and changes in market demand and demographic patterns in AEP service territories; inflationary or deflationary interest rate trends; volatility in the financial markets, particularly developments affecting the availability or cost of capital to finance new capital projects and refinance existing debt; the availability and cost of funds to finance working capital and capital needs, particularly during periods when the time lag between incurring costs and recovery is long and the costs are material; electric load and customer growth; weather conditions, including storms and drought conditions, and AEP's ability to recover significant storm restoration costs; the cost of fuel and its transportation, the creditworthiness and performance of fuel suppliers and transporters and the cost of storing and disposing of used fuel, including coal ash and spent nuclear fuel; availability of necessary generating capacity, the performance of AEP's generating plants and the availability of fuel, including processed nuclear fuel, parts and service from reliable vendors; AEP's ability to recover fuel and other energy costs through regulated or competitive electric rates; AEP's ability to build transmission lines and facilities (including the ability to obtain any necessary regulatory approvals and permits) when needed at acceptable prices and terms and to recover those costs; new legislation, litigation and government regulation, including oversight of nuclear generation, energy commodity trading and new or heightened requirements for reduced emissions of sulfur, nitrogen, mercury, carbon, soot or particulate matter and other substances that could impact the continued operation, cost recovery, and/or profitability of AEP's generation plants and related assets; evolving public perception of the risks associated with fuels used before, during and after the generation of electricity, including nuclear fuel; a reduction in the federal statutory tax rate that could result in an accelerated return of deferred federal income taxes to customers; timing and resolution of pending and future rate cases, negotiations and other regulatory decisions, including rate or other recovery of new investments in generation, distribution and transmission service and environmental compliance; resolution of litigation; AEP's ability to constrain operation and maintenance costs; AEP's ability to develop and execute a strategy based on a view regarding prices of electricity and gas; prices and demand for power generated and sold at wholesale; changes in technology, particularly with respect to energy storage and new, developing, alternative or distributed sources of generation; AEP's ability to recover through rates any remaining unrecovered investment in generating units that may be retired before the end of their previously projected useful lives; volatility and changes in markets for capacity and electricity, coal, and other energy-related commodities, particularly changes in the price of natural gas; changes in utility regulation and the allocation of costs within regional transmission organizations, including ERCOT, PJM and SPP; AEP's ability to successfully and profitably manage competitive generation assets, including the evaluation and execution of strategic alternatives for these assets as some of the alternatives could result in a loss; changes in the creditworthiness of the counterparties with whom AEP has contractual arrangements, including participants in the energy trading market; actions of rating agencies, including changes in the ratings of AEP debt; the impact of volatility in the capital markets on the value of the investments held by AEP's pension, other postretirement benefit plans, captive insurance entity and nuclear decommissioning trust and the impact of such volatility on future funding requirements; accounting pronouncements periodically issued by accounting standard-setting bodies; and other risks and unforeseen events, including wars, the effects of terrorism (including increased security costs), embargoes, cyber security threats and other catastrophic events.\nAmerican Electric Power\nFinancial Results for the Fourth Quarter 2017\nReconciliation of GAAP to Operating Earnings (non-GAAP)\n2017\nVertically\nIntegrated\nUtilities\nTransmission\n& Distribution\nUtilities\nAEP\nTransmission\nHoldco\nGeneration &\nMarketing\nCorporate and\nOther\nTotal\nEPS\n($ millions)\nGAAP Earnings (Loss)\n163.9\n262.1\n76.4\n(80.3)\n(21.4)\n400.7\n$ 0.81\nSpecial Items\nMark-to-Market Impact of Commodity\nHedging Activities\n(a)\n-\n-\n-\n0.3\n-\n0.3\n-\nImpairment of Certain Merchant\nGeneration Assets\n(b)\n-\n-\n-\n27.8\n-\n27.8\n0.05\nWelsh Unit 2 Disallowance\n(b)\n4.5\n-\n-\n-\n-\n4.5\n0.01\nImpairment of Turk Plant\n(b)\n13.5\n-\n-\n-\n-\n13.5\n0.03\nEffects of Tax Reform\n(c)\n(2.5)\n(138.2)\n2.1\n76.7\n35.2\n(26.7)\n(0.05)\nTotal Special Items\n15.5\n(138.2)\n2.1\n104.8\n35.2\n19.4\n$ 0.04\nOperating Earnings (Loss)\n179.4\n123.9\n78.5\n24.5\n13.8\n420.1\n$ 0.85\n(non-GAAP)\nFinancial Results for the Fourth Quarter 2016\nReconciliation of GAAP to Operating Earnings (non-GAAP)\n2016\nVertically\nIntegrated\nUtilities\nTransmission\n& Distribution\nUtilities\nAEP\nTransmission\nHoldco\nGeneration &\nMarketing\nCorporate and\nOther\nTotal\nEPS\n($ millions)\nGAAP Earnings (Loss)\n150.6\n94.3\n58.8\n50.8\n18.9\n373.4\n$ 0.76\nSpecial Items\nMark-to-Market Impact of Commodity\nHedging Activities\n(a)\n-\n-\n-\n(4.9)\n-\n(4.9)\n(0.01)\nImpairment of Certain Merchant\nGeneration Assets\n(b)\n-\n-\n-\n1.9\n-\n1.9\n-\nDisposition of Commercial Barge\nOperations\n(c)\n-\n-\n-\n-\n(6.1)\n(6.1)\n(0.01)\nFederal Tax Audit Settlement\n(c)\n-\n-\n-\n-\n(21.1)\n(21.1)\n(0.04)\nUK Windfall Tax\n(c)\n-\n(12.8)\n-\n-\n-\n(12.8)\n(0.03)\nTotal Special Items\n-\n(12.8)\n-\n(3.0)\n(27.2)\n(43.0)\n$ (0.09)\nOperating Earnings (Loss)\n150.6\n81.5\n58.8\n47.8\n(8.3)\n330.4\n$ 0.67\n(non-GAAP)\n(a)\nReflected in Revenues and Income Tax Expense\n(b)\nReflected in Asset Impairments and Other Related Charges and Income Tax Expense\n(c)\nReflected in Income Tax Expense\nAmerican Electric Power\nSummary of Selected Sales Data\nRegulated Connected Load\n(Data based on preliminary, unaudited results)\nThree Months Ending December 31\nENERGY & DELIVERY SUMMARY\n2017\n2016\nChange\nVertically Integrated Utilities\nRetail Electric (in millions of kWh):\nResidential\n7,591\n7,232\n5.0%\nCommercial\n6,036\n6,022\n0.2%\nIndustrial\n8,884\n8,453\n5.1%\nMiscellaneous\n575\n577\n(0.3%)\nTotal Retail\n23,086\n22,284\n3.6%\nWholesale Electric (in millions of kWh): (a)\n5,830\n5,831\n(0.0%)\nTotal KWHs (in millions)\n28,916\n28,115\n2.8%\nTransmission & Distribution Utilities\nRetail Electric (in millions of kWh):\nResidential\n5,745\n5,617\n2.3%\nCommercial\n6,204\n6,244\n(0.6%)\nIndustrial\n6,093\n5,663\n7.6%\nMiscellaneous\n169\n172\n(1.7%)\nTotal Retail (b)\n18,211\n17,696\n2.9%\nWholesale Electric (in millions of kWh): (a)\n584\n490\n19.2%\nTotal KWHs (in millions)\n18,795\n18,186\n3.3%\n(a) Includes Off-System Sales, Municipalities and Cooperatives, Unit Power, and\nOther Wholesale Customers\n(b) Represents energy delivered to distribution customers\nAmerican Electric Power\nFinancial Results for Year-to-Date 2017\nReconciliation of GAAP to Operating Earnings (non-GAAP)\n2017\nVertically\nIntegrated\nUtilities\nTransmission\n& Distribution\nUtilities\nAEP\nTransmission\nHoldco\nGeneration &\nMarketing\nCorporate and\nOther\nTotal\nEPS\n($ millions)\nGAAP Earnings (Loss)\n790.5\n636.4\n352.1\n166.0\n(32.4)\n1,912.6\n$ 3.89\nSpecial Items\nMark-to-Market Impact of Commodity\nHedging Activities\n(a)\n-\n-\n-\n3.1\n-\n3.1\n0.01\nGain from Competitive Generation\nAsset Sale\n(b)\n-\n-\n-\n(129.4)\n-\n(129.4)\n(0.26)\nImpairment of Certain Merchant\nGeneration Assets\n(c)\n-\n-\n-\n30.3\n-\n30.3\n0.05\nWelsh Unit 2 Disallowance\n(c)\n4.5\n-\n-\n-\n-\n4.5\n0.01\nImpairment of Turk Plant\n(c)\n13.5\n-\n-\n-\n-\n13.5\n0.03\nEffects of Tax Reform\n(e)\n(2.5)\n(138.2)\n2.1\n76.7\n35.2\n(26.7)\n(0.05)\nTotal Special Items\n15.5\n(138.2)\n2.1\n(19.3)\n35.2\n(104.7)\n$ (0.21)\nOperating Earnings (Loss)\n806.0\n498.2\n354.2\n146.7\n2.8\n1,807.9\n$ 3.68\n(non-GAAP)\nFinancial Results for Year-to-Date 2016\nReconciliation of GAAP to Operating Earnings (non-GAAP)\n2016\nVertically\nIntegrated\nUtilities\nTransmission\n& Distribution\nUtilities\nAEP\nTransmission\nHoldco\nGeneration &\nMarketing\nCorporate and\nOther\nTotal\nEPS\n($ millions)\nGAAP Earnings (Loss)\n979.9\n482.1\n266.3\n(1,198.0)\n80.6\n610.9\n$ 1.24\nSpecial Items\nMark-to-Market Impact of Commodity\nHedging Activities\n(a)\n-\n-\n-\n(6.5)\n-\n(6.5)\n(0.01)\nImpairment of Certain Merchant\nGeneration Assets\n(c)\n6.8\n1,460.1\n-\n1,466.9\n2.98\nDisposition of Commercial Barge\nOperations\n(d)\n(0.8)\n(0.8)\n-\nFederal Tax Audit Settlement\n(e)\n(76.8)\n(76.8)\n(0.15)\nCapital Loss Valuation Allowance\n(e)\n(10.1)\n(33.8)\n(43.9)\n(0.09)\nUK Windfall Tax\n(e)\n(12.8)\n(12.8)\n(0.03)\nOperating Earnings (Loss)\n6.8\n(12.8)\n-\n1,443.5\n(111.4)\n1,326.1\n$ 2.70\n(non-GAAP)\n986.7\n469.3\n266.3\n245.5\n(30.8)\n1,937.0\n$ 3.94\n(a)\nReflected in Revenues and Income Tax Expense\n(b)\nReflected in Gain on Sale of Assets and Income Tax Expense\n(c)\nReflected in Asset Impairments and Other Related Charges and Income Tax Expense\n(d)\nReflected in Discontinued Operations, Equity Earnings and Income Tax Expense\n(e)\nReflected in Income Tax Expense\nAmerican Electric Power\nSummary of Selected Sales Data\nRegulated Connected Load\n(Data based on preliminary, unaudited results)\nTwelve Months Ending December 31\nENERGY & DELIVERY SUMMARY\n2017\n2016\nChange\nVertically Integrated Utilities\nRetail Electric (in millions of kWh):\nResidential\n30,817\n32,606\n(5.5%)\nCommercial\n24,423\n25,229\n(3.2%)\nIndustrial\n34,676\n34,029\n1.9%\nMiscellaneous\n2,275\n2,316\n(1.8%)\nTotal Retail\n92,191\n94,180\n(2.1%)\nWholesale Electric (in millions of kWh): (a)\n25,098\n23,081\n8.7%\nTotal KWHs (in millions)\n117,289\n117,261\n0.0%\nTransmission & Distribution Utilities\nRetail Electric (in millions of kWh):\nResidential\n25,108\n26,191\n(4.1%)\nCommercial\n25,390\n25,922\n(2.1%)\nIndustrial\n23,082\n22,179\n4.1%\nMiscellaneous\n682\n700\n(2.6%)\nTotal Retail (b)\n74,262\n74,992\n(1.0%)\nWholesale Electric (in millions of kWh): (a)\n2,387\n1,888\n26.4%\nTotal KWHs (in millions)\n76,649\n76,880\n(0.3%)\n(a) Includes Off-System Sales, Municipalities and Cooperatives, Unit Power, and\nOther Wholesale Customers\n(b) Represents energy delivered to distribution customers\nView original content: http://www.prnewswire.com/news-releases/aep-reports-strong-2017-fourth-quarter-and-year-end-earnings-300587944.html\nSOURCE American Electric Power", "external_links": ["http://www.prnewswire.com/news-releases/aep-reports-strong-2017-fourth-quarter-and-year-end-earnings-300587944.html", "http://www.aep.com/webcasts"], "published": "2018-01-25T14:57:00.000+02:00", "crawled": "2018-01-25T14:25:39.007+02:00", "highlightTitle": ""}