{"organizations": [], "uuid": "a456346df40d7a183cc26d21a4243f588b4dfd24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 48}, "facebook": {"likes": 14, "shares": 14, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223981126&w=1200&r=LYNXMPEE0K0YB", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-rio-tinto-mongolia/rio-tinto-sets-up-new-exploration-office-in-mongolia-idUSKBN1FA17R", "country": "US", "domain_rank": 408, "title": "Rio Tinto sets up new exploration office in Mongolia", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T01:27:00.000+02:00", "replies_count": 0, "uuid": "a456346df40d7a183cc26d21a4243f588b4dfd24"}, "author": "", "url": "https://www.reuters.com/article/us-rio-tinto-mongolia/rio-tinto-sets-up-new-exploration-office-in-mongolia-idUSKBN1FA17R", "ord_in_thread": 0, "title": "Rio Tinto sets up new exploration office in Mongolia", "locations": [], "entities": {"persons": [{"name": "jean-sebastien jacques", "sentiment": "none"}], "locations": [{"name": "mongolia", "sentiment": "none"}, {"name": "mongolia reu", "sentiment": "none"}, {"name": "rio tinto", "sentiment": "none"}, {"name": "ulaanbaatar", "sentiment": "none"}, {"name": "turquoise hill", "sentiment": "none"}, {"name": "oyu tolgoi", "sentiment": "none"}], "organizations": [{"name": "rio tinto", "sentiment": "negative"}, {"name": "min read  melbourne", "sentiment": "none"}, {"name": "turquoise hill resources", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MELBOURNE/ULAANBAATAR (Reuters) - Global miner Rio Tinto will set up a new office in the Mongolian capital, separate from its giant Oyu Tolgoi project, to focus on exploration and local ties, strengthening its commitment to one of the world’s greatest copper prospects.\nMongolia’s proximity to neighbouring China, the world’s biggest copper consumer, has attracted interest from international prospectors as an anticipated leap in electric vehicle demand and renewable energy would increase consumption of a commodity that already has multiple uses.\nBut some investors are nervous about the unpredictability of Mongolia’s young democracy and Rio Tinto, which is operating an expansion project at the Oyu Tolgoi copper mine in Mongolia, has had difficult negotiations with the government in the past.\nThe new office, which will expand to 80 staff over the course of this year, will support the company’s exploration programme, as well as focusing on building relationships, the miner said in a statement on Monday.\n“We are demonstrating the deepening of our commitment to Mongolia through the establishment of a new country office under new Mongolian leadership,” Rio Tinto Chief Executive Jean-Sebastien Jacques said.\n“Mongolia is one of Rio Tinto’s most strategically important markets and we are here to stay,” Jacques said, adding Rio had invested more than $7 billion in Mongolia since 2010, including salaries, supplier payments, and taxes and royalties.\nAn industry source, speaking on condition of anonymity, said the decision was “very good news indeed” because it underlined Rio Tinto’s commitment to exploring beyond Oyu Tolgoi and this unit would be 100 percent-owned by the major.\nThe Oyu Tolgoi copper and gold mine is jointly owned by the government of Mongolia, with 34 percent, and Turquoise Hill Resources with 66 percent. Turquoise Hill is in turn 51 percent-owned by Rio Tinto.\nSome analysts and lawyers have expressed concern about the risk the Mongolian government could try to seize a bigger share.\nThe Mongolian Copper Corporation (MCC) said earlier this month it would fight a decision by the Mongolian government to repurchase its stake in one of Asia’s biggest copper mines for about $400 million after a failed attempt to nationalise it. [nL8N1P36AE]\nIt said the signal Mongolia’s government was giving to potential foreign investors, which can help it meet the terms of an IMF bailout agreed last year, was negative.\nAlso this month, Oyu Tolgoi said it was evaluating a bill for about $155 million from Mongolia’s tax authority following an audit of payments made between 2013 and 2015. [nFWN1PA0MN]\nThe mine was raided by Mongolian immigration officials earlier in January. A majority of 44 visas that were checked were found to be in breach of rules, a source with knowledge of the matter said.\nA Rio Tinto spokesman said the workers were employed by Australian engineering firm Hofmann Engineering and those with an incorrect visa had been asked to leave the country. Hofmann Engineering was not available for comment.\nBontoi Munkhdul, Chief Executive Officer of Mongolia-based market intelligence group Cover Mongolia, said the latest issues at Oyu Tolgoi appeared unrelated.\n“They’re two different incidents that happened at the same time. Immigration and tax authorities were doing their jobs,” he said.\nRelations between the Mongolian government and Rio Tinto soured in 2013 during a dispute over costs and taxes related to a proposed expansion of Oyu Tolgoi. The matter was finally resolved in 2015. Rio Tinto embarked on new exploration in Mongolia in 2017. [nL3N1JH3LP]\nAdditional reporting and writing by Barbara Lewis in London; editing by Richard Pullin and Louise Heavens\n ", "external_links": [], "published": "2018-01-22T01:27:00.000+02:00", "crawled": "2018-01-22T01:56:40.002+02:00", "highlightTitle": ""}