{"organizations": [], "uuid": "6924ce988bc2c60ce68a780d5d2ec9c9a5fbbcef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/italo-ipo-strategy/destination-europe-for-italian-high-speed-rail-upstart-idUSL8N1PH629", "country": "US", "domain_rank": 408, "title": "Destination Europe for Italian high-speed rail upstart", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T19:37:00.000+02:00", "replies_count": 0, "uuid": "6924ce988bc2c60ce68a780d5d2ec9c9a5fbbcef"}, "author": "", "url": "https://www.reuters.com/article/italo-ipo-strategy/destination-europe-for-italian-high-speed-rail-upstart-idUSL8N1PH629", "ord_in_thread": 0, "title": "Destination Europe for Italian high-speed rail upstart", "locations": [], "entities": {"persons": [{"name": "italo", "sentiment": "none"}, {"name": "agnieszka flak  rome", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Italo aims to export business model to Europe\n* Spain, Germany and France among possible targets\n* But faces long, costly task against state rivals\n* Co-founder tells Reuters about IPO plans:\nBy Agnieszka Flak\nROME, Jan 23 (Reuters) - Italian high-speed rail group Italo plans to export its flexible business model to other European countries such as Spain, Germany and France following its planned stock market listing in February, its chairman told Reuters.\nThe company, Europe’s only profitable privately owned high-speed train operator, has enjoyed rapid growth domestically by offering long-distance rail passengers a wider range of prices, including budget tickets, and reducing costs by largely selling online.\nIt now aims to capitalise on the EU push to create a single market for the sector from 2020 with an obligation to open routes to competitive services in member states, where networks are often controlled by state-owned rail monopolies.\n“In the next few years trains will be extremely important in Europe and our business model can be exported very easily elsewhere,” Luca Cordero di Montezemolo, Italo’s co-founder and chairman, told Reuters in an interview at the company’s headquarters in Rome.\nThe rewards could be large in a European high-speed rail market that is estimated to grow by 70 percent to over 27 billion euros ($33 billion) in annual revenue by 2025, according to data from TRA Consulting.\nHowever industry experts warn European expansion will not be an easy ride, and that the company faced risky, lengthy and costly struggles to compete with dominant state-owned players like Spain’s Renfe, Germany’s Deutsche Bahn and France’s SNCF.\nItalo was founded in 2006 and took a decade to make a profit in Italy, where it faced fierce opposition from state-owned rail giant Ferrovie dello Stato. Its entry helped boost demand for domestic long-distance railway travel by 80 percent and cut average prices by 40 percent.\nItalo copied the tiered pricing system of airlines, where passengers can travel at rock-bottom prices if they book early and choose off-peak times, or splash out and have meals served to their seats.\nCore investors are now hoping to cash in by listing the group in Milan. Italo expects to complete the share offering by February, however potential volatility around a national election on March 4 could delay the flotation by a few weeks or months, Montezemolo told Reuters.\n‘FIGHT THE BATTLE’\nFollowing the listing, the group is preparing to launch new routes at home, like the Turin-Venice one that will open in May. Next it will look to Europe to take advantage of the EU reforms, which analysts describe as the biggest step in transport liberalisation since the bloc opened up its skies two decades ago.\nMontezemolo said Spain, France and Germany were possible targets, despite the monopolies Renfe, SNCF and Deutsche Bahn hold in their respective markets.\nItalo will look to find a partner, get some core investors on board, including a local lender, and act as a minority shareholder in the venture to provide expertise, he said.\n“We plan to look and have contacts very soon in at least one or two countries,” added 70-year-old Montezemolo, a former chairman of Ferrari and Fiat who has headed the powerful Italian business lobby Confindustria.\n“We are not the ones to fight the battle, we will be a minority investor ... but they can save time, avoid our mistakes and we can have synergies tomorrow.”\nAnalysts said Italo’s strength lies in its flexible business model, where fixed costs are minimised and various tasks outsourced.\nHowever it will not be easy for the company to replicate its success abroad, they added.\nIn Germany, various operators have tried and failed because they did not have the clout to rival incumbent Deutsche Bahn, said Michael Holzhey, a transport analyst with ETC.\n“(Italo) would need a local partner with lots of capital, someone that knows the market in and out and can deal with politicians and regulators,” Holzhey said.\nEach high-speed train, which run at above 250 km/h, costs around 25-30 million euros, analysts said. Italo’s shareholders put in 1 billion euros to start their Italian venture and it took a decade before they turned a profit.\n“They would need to come in with a fleet of at least 13-15 trains to attack one of the key routes and start from there,” Holzhey said. “Eventually they might make a profit, but you need patience because it would take years and DB wouldn’t stand still.”\nBut Montezemolo remains convinced the gamble could pay off because it had succeeded in Italy, against all odds.\n“At the beginning we were the first in Europe, the first in Italy ... we made lots of mistakes,” he said. “Looking back, we made a miracle.”\n($1 = 0.8165 euros)\nAdditional reporting by Mark Bendeich; Editing by Pravin Char\n ", "external_links": [], "published": "2018-01-23T19:37:00.000+02:00", "crawled": "2018-01-23T20:02:38.010+02:00", "highlightTitle": ""}