{"organizations": [], "uuid": "f10dc480980df2ccac0a929cb31abc2f1398fbc6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/business-wire-first-foundation-announces-2017-financial-results.html", "country": "US", "domain_rank": 767, "title": "First Foundation Announces 2017 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-31T17:00:00.000+02:00", "replies_count": 0, "uuid": "f10dc480980df2ccac0a929cb31abc2f1398fbc6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/business-wire-first-foundation-announces-2017-financial-results.html", "ord_in_thread": 0, "title": "First Foundation Announces 2017 Financial Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Earnings per share of $0.06 for the fourth quarter of 2017 and $0.78 for the full year Non-GAAP fully diluted earnings per share of $0.25 for the fourth quarter of 2017 Revenue growth of 23% in 2017 Loan growth of 36% and deposit growth of 42% in 2017\nIRVINE, Calif.--(BUSINESS WIRE)-- First Foundation Inc. (NASDAQ: FFWM), a financial services company with two wholly-owned operating subsidiaries, First Foundation Advisors (“FFA”) and First Foundation Bank (“FFB”), announced today its financial results for the quarter and year ended December 31, 2017. As we present certain non-GAAP measures in this release, the reader should refer to the non-GAAP reconciliations set forth below under the section “Use of Non-GAAP Financial Measures.”\nFor the fourth quarter, earnings per fully diluted share of $0.06 were impacted by a $5.4 million tax charge, attributable to the remeasurement of the net deferred tax asset as a result of the reduced corporate tax rate under the federal tax law enacted on December 22, 2017, formally known as the Tax Cuts and Jobs Act, and $2.6 million of costs (offset by a corresponding $1.1 million tax benefit) related to the acquisition of Community 1st Bank (“C1B”), which was completed during the fourth quarter of 2017. Excluding these items, non-GAAP fully diluted earnings per share in the fourth quarter of 2017 would have been $0.25 .\n“2017 was another year of strong growth as both Wealth Management and Banking experienced record amounts of revenues and increased efficiencies,” said Scott F. Kavanaugh, CEO of First Foundation. “Wealth Management AUM grew to $4.3 billion and the pretax margin increased to 13%, while the efficiency ratio at the Bank improved to 55%. We are very pleased with the performance of key areas of our business and feel like we are well-positioned for another year of growth in 2018.”\nHighlights\nFinancial Results:\n2017 compared to 2016: Total revenues were $152.3 million, an increase of 23% Net interest income was $113.6 million, an increase of 27% Income before taxes was $50.6 million, an increase of 32% Earnings were $27.6 million, an increase of 18% Earnings per fully diluted share were $0.78, compared to $0.70 in 2016 2017 fourth quarter compared to 2016 fourth quarter: Total revenues were $42.6 million, an increase of 31% Net interest income was $31.2 million, an increase of 25% Income before taxes was $13.0 million, an increase of 23% Earnings were $2.3 million Earnings per fully diluted share were $0.06 2017 Financial ratios: Return on average equity of 8.5% for 2017 Return on average assets of 0.70% for 2017 Efficiency ratio of 61.1% for the fourth quarter and 63.3% for the full year\nOther Activity:\nAssets under management (“AUM”) at FFA increased by $709 million in 2017 and totaled $4.3 billion at December 31, 2017 Deposits increased by $1.02 billion in 2017, including $412 million from the acquisition of C1B Loan originations totaled $1.72 billion in 2017 Loan balances increased by $1.01 billion, including $227 million from the acquisition of C1B $453 million of loans were sold in 2017, with a gain of $7.0 million realized The acquisition of PBB Bancorp and Premier Business Bank was announced on December 19, 2017. Subject to regulatory and PBB Bancorp shareholder approval, we expect the acquisition to close in the second quarter of 2018. Executive management team expanded with the appointment of Bob Sjogren, EVP, General Counsel\n“We were able to experience strong growth in our revenues and improvements in our efficiencies in spite of a tight interest rate spread environment,” said David DePillo, President of FFB. “Our credit quality remains strong as we experienced no credit losses in 2017 and our non-performing assets remain at low levels.”\nDetails of Growth\nThe $709 million growth in AUM during 2017 was the result of $399 million of new accounts and $431 million of portfolio gains which were partially offset by terminations and net withdrawals of $121 million. Total loans, including loans held for sale, increased $1.01 billion in 2017 as a result of $1.72 billion of originations, $227 million obtained in the acquisition of C1B and $8 million of purchases which were partially offset by the sale of $453 million of multifamily loans and payoffs or scheduled payments of $491 million. The $1.02 billion growth in deposits during 2017 is due to a $267 million increase in specialty deposits, a $240 million increase in branch deposits and $412 million from the acquisition of C1B.\n“We added $709 million in wealth management assets during the year, while we were able to enhance our profitability and make investments in our platform to better serve our clients and drive organic growth,” said John Hakopian, President of FFA.\nManagement Outlook for 2018\nOur current expectation for the expected full year 2018 is as follows:\nLoan originations consistent with 2017 levels Maintaining the ratio of the allowance for loan losses to loans at current levels Deposit growth between 15% and 20%, excluding any deposits obtained from acquisitions Net yield on interest earning assets between 2.80% and 2.95% Efficiency levels consistent with 2017 results (excluding any one-time acquisition costs)\nThe expectations outlined above are based on, among other things, our management’s assumption that the Federal Reserve Board will increase rates twice during 2018.\nAbout First Foundation\nFirst Foundation, a financial institution founded in 1990, provides personal banking, business banking and private wealth management. The Company has offices in California, Nevada and Hawaii with headquarters in Irvine, California. For more information, please visit www.firstfoundationinc.com .\nWe have two business segments, “Banking” and “Investment Management and Wealth Planning” (“Wealth Management”). Banking includes the operations of FFB and First Foundation Insurance Services, and Wealth Management includes the operations of FFA. The financial position and operating results of the stand-alone holding company, FFI, are included under the caption “Other” in certain of the tables that follow, along with any consolidation elimination entries.\nForward-Looking Statements\nStatements in this news release regarding our expectations and beliefs about our future financial performance and financial condition, as well as trends in our business and markets are \"forward-looking statements\" as defined in the Private Securities Litigation Reform Act of 1995. Forward-looking statements often include words such as \"believe,\" \"expect,\" \"anticipate,\" \"intend,\" \"plan,\" \"estimate,\" \"project,\" \"outlook,\" or words of similar meaning, or future or conditional verbs such as \"will,\" \"would,\" \"should,\" \"could,\" or \"may.\" The forward looking statements in this news release are based on current information and on assumptions that we make about future events and circumstances that are subject to a number of risks and uncertainties that are often difficult to predict and beyond our control. As a result of those risks and uncertainties, our actual financial results in the future could differ, possibly materially, from those expressed in or implied by the forward looking statements contained in this news release and could cause us to make changes to our future plans. Those risks and uncertainties include, but are not limited to, the risk that shareholders of PBB Bancorp may fail to approve the consummation of the acquisition, or that other conditions to the closing of the acquisition may not be satisfied on a timely basis or at all; the risk that the costs associated with the PBB Bancorp acquisition, which will be incurred whether or not the acquisition successfully closes, may be higher than we expect; the risk of incurring loan losses, which is an inherent risk of the banking business; the risk that we will not be able to continue our internal growth rate; the risk that we will not be able to access the securitization market on favorable terms or at all; the risk that the economic recovery in the United States will stall or will be adversely affected by domestic or international economic conditions and risks associated with the Federal Reserve Board taking actions with respect to interest rates, any of which could adversely affect our interest income and interest rate margins and, therefore, our future operating results; the risk that the performance of our investment management business or of the equity and bond markets could lead clients to move their funds from or close their investment accounts with us, which would reduce our assets under management and adversely affect our operating results; risks associated with changes in income tax laws and regulations including, but not limited to, under the federal tax law enacted on December 22, 2017, formally known as the Tax Cuts and Jobs Act; and risks associated with seeking new client relationships and maintaining existing client relationships. Additional information regarding these and other risks and uncertainties to which our business and future financial performance are subject is contained in Item 1A, entitled “Risk Factors” in our 2016 Annual Report on Form 10-K for the fiscal year ended December 31, 2016 that we filed with the SEC on March 15, 2017, and other documents we file with the SEC from time to time. We urge readers of this news release to review the Risk Factors section of that Annual Report and the Risk Factors section of other documents we file with the SEC from time to time. Also, our actual financial results in the future may differ from those currently expected due to additional risks and uncertainties of which we are not currently aware or which we do not currently view as, but in the future may become, material to our business or operating results. Due to these and other possible uncertainties and risks, readers are cautioned not to place undue reliance on the forward-looking statements contained in this news release, which speak only as of today's date, or to make predictions based solely on historical financial performance. We also disclaim any obligation to update forward-looking statements contained in this news release or in the above-referenced 2016 Annual Report on Form 10-K, whether as a result of new information, future events or otherwise, except as may be required by law or NASDAQ rules.\nFIRST FOUNDATION INC.\nCONSOLIDATED BALANCE SHEETS - Unaudited\n(in thousands, except share and per share amounts)\nDecember 31,\n2017\nDecember 31,\n2016\nASSETS Cash and cash equivalents $ 120,394 $ 597,946 Securities available-for-sale (“AFS”) 519,364 509,578 Loans held for sale 154,380 250,942 Loans, net of deferred fees 3,663,727 2,555,709 Allowance for loan and lease losses (“ALLL”) (18,400 ) (15,400 ) Net loans 3,645,327 2,540,309 Investment in FHLB stock 19,060 33,750 Deferred taxes 12,143 16,811 Premises and equipment, net 6,581 6,730 Real estate owned (“REO”) 2,920 1,734 Goodwill and intangibles 33,576 2,177 Other assets 27,440 15,426 Total Assets $ 4,541,185 $ 3,975,403 LIABILITIES AND SHAREHOLDERS’ EQUITY Liabilities: Deposits $ 3,443,527 $ 2,426,795 Borrowings 678,000 1,250,000 Accounts payable and other liabilities 24,707 14,344 Total Liabilities 4,146,234 3,691,139 Commitments and contingencies - - Shareholders’ Equity\nCommon Stock, par value $.001: 70,000,000 shares authorized; 38,207,766 and 32,719,632 shares issued and outstanding at December 31, 2017 and December 31, 2016, respectively 38 16 Additional paid-in-capital 314,501 232,428 Retained earnings 85,503 57,065 Accumulated other comprehensive income (loss), net of tax (5,091 ) (5,245 ) Total Shareholders’ Equity 394,951 284,264 Total Liabilities and Shareholders’ Equity $ 4,541,185 $ 3,975,403 FIRST FOUNDATION INC.\nCONSOLIDATED INCOME STATEMENTS - Unaudited\n(in thousands, except share and per share amounts)\nFor the Quarter\nEnded December 31,\nFor the Year\nEnded December 31,\n2017 2016 2017 2016 Interest income: Loans $ 33,998 $ 23,718 $ 121,707 $ 85,080 Securities 3,227 3,358 12,407 12,781 FHLB Stock, fed funds sold and deposits 686 1,291 2,687 2,781 Total interest income 37,911 28,367 136,801 100,642 Interest expense: Deposits 5,340 2,722 17,443 8,916 Borrowings 1,346 641 5,740 2,277 Total interest expense 6,686 3,363 23,183 11,193 Net interest income 31,225 25,004 113,618 89,449 Provision for loan losses 900 1,800 2,762 4,681 Net interest income after provision for loan losses 30,325 23,204 110,856 84,768 Noninterest income: Asset management, consulting and other fees 7,038 6,257 26,710 24,384 Gain on sale of loans 2,717 574 7,029 7,812 Gain (loss) on capital markets activities - - - (1,043 ) Other income 1,621 755 4,980 3,407 Total noninterest income 11,376 7,586 38,719 34,560 Noninterest expense: Compensation and benefits 13,703 11,867 56,558 48,574 Occupancy and depreciation 4,302 3,195 15,396 11,978 Professional services and marketing costs 2,572 2,017 7,687 9,825 Other expenses 8,084 3,112 19,335 10,617 Total noninterest expense 28,661 20,191 98,976 80,994 Income before taxes on income 13,040 10,599 50,599 38,334 Taxes on income 10,767 4,082 23,017 15,031 Net income $ 2,273 $ 6,517 $ 27,582 $ 23,303 Net income per share: Basic $ 0.06 $ 0.20 $ 0.80 $ 0.72 Diluted $ 0.06 $ 0.19 $ 0.78 $ 0.70 Shares used in computation: Basic 36,890,085 32,668,318 34,482,630 32,365,800 Diluted 37,500,952 33,788,114 35,331,059 33,471,816 FIRST FOUNDATION INC.\nSELECTED FINANCIAL INFORMATION - Unaudited\n(in thousands, except share and per share amounts and percentages)\nFor the Quarter Ended\nDecember 31,\nFor the Year\nEnded December 31,\n2017 2016 2017 2016 Selected Income Statement Data: Net interest income $ 31,225 $ 25,004 $ 113,618 $ 89,449 Provision for loan losses 900 1,800 2,762 4,681 Noninterest Income: Asset management, consulting and other fees 7,038 6,257 26,710 24,384 Gain on sale of loans 2,717 574 7,029 7,812 Gain (loss) on capital markets activities - - - (1,043 ) Other 1,621 755 4,980 3,407 Noninterest expense 28,661 20,191 98,976 80,994 Income before taxes 13,040 10,599 50,599 38,334 Net income 2,273 6,517 27,582 23,303 Net income per share: Basic $ 0.06 $ 0.20 $ 0.80 $ 0.72 Diluted 0.06 0.19 0.78 0.70 Selected Performance Ratios: Return on average assets - annualized 0.21 % 0.80 % 0.70 % 0.80 % Return on average equity - annualized 2.5 % 9.1 % 8.5 % 8.4 % Net yield on interest-earning assets 2.97 % 3.11 % 2.93 % 3.13 % Efficiency ratio (1) 61.1 % 62.0 % 63.3 % 65.3 % Noninterest income as a % of total revenues 26.7 % 23.3 % 25.4 % 27.9 % Other Information: Loan originations $ 495,952 $ 447,340 $ 1,721,931 $ 1,770,511 Charge-offs (recoveries) / average loans - annualized 0.00 % 0.00 % (0.01 ) % (0.01 ) % (1) Efficiency Ratio: See disclosures regarding “Use of Non-GAAP Financial Measures” included as a separate section in this press release.\nFIRST FOUNDATION INC.\nSELECTED FINANCIAL INFORMATION - Unaudited\n(in thousands, except share and per share amounts and percentages)\nDecember 31,\n2017\nDecember 31,\n2016\nSelected Balance Sheet Data: Cash and cash equivalents $ 120,394 $ 597,946 Loans held for sale 154,380 250,942 Loans, net of deferred fees 3,663,727 2,555,709 Allowance for loan and lease losses (“ALLL”) (18,400 ) (15,400 ) Total assets 4,541,185 3,975,403 Noninterest-bearing deposits 1,097,196 661,781 Interest-bearing deposits 2,346,331 1,765,014 Borrowings 678,000 1,250,000 Shareholders’ equity 394,951 284,264 Selected Capital Data: Tangible common equity to tangible assets (2) 8.02 % 7.10 % Tangible book value per share (2) $ 9.46 $ 8.62 Shares outstanding at end of period 38,207,766 32,719,632 Other Information: Assets under management (end of period)\n$ 4,296,077 $ 3,586,672 Number of employees 394 335 Loan to deposit ratio 110.9 % 115.7 % Nonperforming assets to total assets 0.31 % 0.25 % Ratio of ALLL to loans (3) 0.54 % 0.60 % (2) Tangible common equity. See disclosures regarding “Use of Non-GAAP Financial Measures” included as a separate section in this press release.\n(3) This ratio excludes loans acquired in an acquisition as GAAP requires estimated credit losses for acquired loans to be recorded as discounts to those loans.\nFIRST FOUNDATION INC.\nSEGMENT REPORTING - Unaudited\n(in thousands)\nFor the Quarter\nEnded December 31,\nFor the Year\nEnded December 31,\n2017 2016 2017 2016 Banking: Interest income $ 37,912 $ 28,367 $ 136,801 $ 100,642 Interest expense 6,468 3,363 22,530 11,193 Net interest income 31,444 25,004 114,271 89,449 Provision for loan losses 900 1,800 2,762 4,681 Noninterest income 5,380 2,327 16,016 13,832 Noninterest expense 22,484 14,676 73,990 58,422 Income before taxes on income $ 13,440 $ 10,855 $ 53,535 $ 40,178 Wealth Management: Noninterest income $ 6,221 $ 5,431 $ 23,556 $ 21,348 Noninterest expense 5,141 4,696 20,469 19,232 Income before taxes on income $ 1,080 $ 735 $ 3,087 $ 2,116 Other and Eliminations: Interest income $ - $ - $ - $ - Interest expense 218 - 653 - Net interest income (218 ) - (653 ) - Noninterest income (226 ) (172 ) (853 ) (620 ) Noninterest expense 1,036 819 4,517 3,340 Income before taxes on income $ (1,480 ) $ (991 ) $ (6,023 ) $ (3,960 ) FIRST FOUNDATION INC.\nROLLING INCOME STATEMENTS - Unaudited\n(in thousands, except share and per share amounts)\nFor the Quarter Ended December 31,\n2016\nMarch 31,\n2017\nJune 30,\n2017\nSeptember 30,\n2017\nDecember 31,\n2017\nInterest income: Loans $ 23,718 $ 26,491 $ 29,982 $ 31,236 $ 33,998 Securities 3,358 3,031 3,126 3,023 3,227 FHLB Stock, fed funds sold and deposits 1,291 838 544 619 686 Total interest income 28,367 30,360 33,652 34,878 37,911 Interest expense: Deposits 2,722 3,192 4,012 4,899 5,340 Borrowings 641 1,110 1,745 1,539 1,346 Total interest expense 3,363 4,302 5,757 6,438 6,686 Net interest income 25,004 26,058 27,895 28,440 31,225 Provision for loan losses 1,800 69 1,092 701 900 Net interest income after provision for loan losses 23,204 25,989 26,803 27,739 30,325 Noninterest income: Asset management, consulting and other fees 6,257 6,215 6,557 6,900 7,038 Gain on sale of loans 574 300 2,050 1,962 2,717 Gain (loss) on capital markets activities - - - - - Other income 755 1,268 1,090 1,001 1,621 Total noninterest income 7,586 7,783 9,697 9,863 11,376 Noninterest expense: Compensation and benefits 11,867 14,755 13,983 14,117 13,703 Occupancy and depreciation 3,195 3,414 3,879 3,801 4,302 Professional services and marketing costs 2,017 3,429 207 1,479 2,572 Other expenses 3,112 3,111 4,144 3,996 8,084 Total noninterest expense 20,191 24,709 22,213 23,393 28,661 Income before taxes on income 10,599 9,063 14,287 14,209 13,040 Taxes on income 4,082 2,950 4,671 4,629 10,767 Net income $ 6,517 $ 6,113 $ 9,616 $ 9,580 $ 2,273 Net income per share: Basic $ 0.20 $ 0.19 $ 0.29 $ 0.28 $ 0.06 Diluted $ 0.19 $ 0.18 $ 0.28 $ 0.27 $ 0.06 Shares used in computation: Basic 32,668,318 32,805,010 33,623,671 34,565,949 36,890,085 Diluted 33,788,114 33,961,220 34,564,319 35,259,632 37,500,952 FIRST FOUNDATION INC.\nROLLING SEGMENT REPORTING - Unaudited\n(in thousands)\nFor the Quarter Ended December 31,\n2016\nMarch 31,\n2017\nJune 30,\n2017\nSeptember 30,\n2017\nDecember 31,\n2017\nBanking: Interest income $ 28,367 $ 30,360 $ 33,652 $ 34,877 $ 37,912 Interest expense 3,363 4,277 5,575 6,210 6,468 Net interest income 25,004 26,083 28,077 28,667 31,444 Provision for loan losses 1,800 69 1,092 701 900 Noninterest income 2,327 2,516 4,165 3,955 5,380 Noninterest expense 14,676 18,331 15,842 17,333 22,484 Income before taxes on income $ 10,855 $ 10,199 $ 15,308 $ 14,588 $ 13,440 Wealth Management: Noninterest income $ 5,431 $ 5,457 $ 5,745 $ 6,133 $ 6,221 Noninterest expense 4,696 5,190 5,042 5,096 5,141 Income before taxes on income $ 735 $ 267 $ 703 $ 1,037 $ 1,080 Other and Eliminations: Interest income $ - $ - $ - $ - $ - Interest expense - (25 ) 182 228 218 Net interest income - (25 ) (182 ) (228 ) (218 ) Noninterest income (172 ) (190 ) (213 ) (224 ) (226 ) Noninterest expense 819 1,188 1,329 964 1,036 Income before taxes on income $ (991 ) $ (1,403 ) $ (1,724 ) $ (1,416 ) $ (1,480 ) FIRST FOUNDATION INC.\nSELECTED INFORMATION: INTEREST MARGIN - Unaudited\n(in thousands, except percentages)\nFor the Quarter\nEnded December 31,\nFor the Year\nEnded December 31,\n2017 2016 2017 2016 Average Balances: Loans $ 3,584,283 $ 2,620,615 $ 3,277,530 $ 2,263,292 Securities 502,477 526,644 498,198 525,480 Total interest-earnings assets 4,208,592 3,219,269 3,871,669 2,853,398 Deposits: interest-bearing 2,274,163 1,666,499 2,101,702 1,444,449 Deposits: noninterest-bearing 1,244,750 757,897 943,749 650,956 Borrowings 367,701 530,357 532,914 507,025 Average Yield / Rate Loans 3.79 % 3.62 % 3.71 % 3.76 % Securities 2.57 % 2.55 % 2.49 % 2.43 % Total interest-earnings assets 3.60 % 3.52 % 3.53 % 3.53 % Deposits (interest-bearing only) 0.93 % 0.65 % 0.83 % 0.62 % Deposits (noninterest and interest-bearing) 0.60 % 0.45 % 0.57 % 0.43 % Borrowings 1.45 % 0.48 % 1.08 % 0.45 % Total interest-bearing liabilities 1.00 % 0.61 % 0.88 % 0.57 % Net Interest Rate Spread 2.60 % 2.91 % 2.65 % 2.95 % Net Yield on Interest-earning Assets 2.97 % 3.11 % 2.93 % 3.13 % For the Quarter Ended December 31,\n2016\nMarch 31,\n2017\nJune 30,\n2017\nSeptember 30,\n2017\nDecember 31,\n2017\nAverage Balances: Loans $ 2,620,615 $ 2,932,011 $ 3,240,755 $ 3,345,159 $ 3,584,283 Securities 526,644 511,962 496,896 481,741 502,477 Total interest-earnings assets 3,219,269 3,516,207 3,822,758 3,930,860 4,208,592 Deposits: interest-bearing 1,666,499 1,916,422 2,054,400 2,157,282 2,274,163 Deposits: noninterest-bearing 757,897 700,613 809,129 1,013,753 1,244,750 Borrowings 530,357 634,422 679,055 454,273 367,701 Average Yield / Rate: Loans 3.62 % 3.62 % 3.70 % 3.73 % 3.79 % Securities 2.55 % 2.37 % 2.52 % 2.51 % 2.57 % Total interest-earnings assets 3.52 % 3.46 % 3.52 % 3.55 % 3.60 % Deposits (interest-bearing only) 0.65 % 0.68 % 0.78 % 0.90 % 0.93 % Deposits (noninterest and interest-bearing) 0.45 % 0.49 % 0.56 % 0.61 % 0.60 % Borrowings 0.48 % 0.71 % 1.03 % 1.34 % 1.45 % Total interest-bearing liabilities 0.61 % 0.68 % 0.84 % 0.98 % 1.00 % Net Interest Rate Spread 2.91 % 2.78 % 2.68 % 2.57 % 2.60 % Net Yield on Interest-earning Assets 3.11 % 2.96 % 2.92 % 2.90 % 2.97 % Use of Non-GAAP Financial Measures\nTo supplement our unaudited condensed consolidated financial statements presented in accordance with GAAP, we use certain non-GAAP measures (including, but not limited to, non-GAAP net income and non-GAAP financial ratios) of financial performance. These supplemental performance measures may vary from, and may not be comparable to, similarly titled measures by other companies in our industry. Non-GAAP financial measures are not in accordance with, or an alternative for, GAAP. Generally, a non-GAAP financial measure is a numerical measure of a company’s performance that either excludes or includes amounts that are not normally excluded or included in the most directly comparable measure calculated and presented in accordance with GAAP. A non-GAAP financial measure may also be a financial metric that is not required by GAAP or other applicable requirement.\nWe believe that these non-GAAP financial measures, when taken together with the corresponding GAAP financial measures (as applicable), provide meaningful supplemental information regarding our performance by providing additional information used by management that is not otherwise required by GAAP or other applicable requirements. Our management uses, and believes that investors benefit from referring to, these non-GAAP financial measures in assessing our operating results and when planning, forecasting and analyzing future periods. These non-GAAP financial measures also facilitate a comparison of our performance to prior periods. We believe these measures are frequently used by securities analysts, investors and other interested parties in the evaluation of companies in our industry. However, these non-GAAP financial measures should be considered in addition to, not as a substitute for or superior to, net income or other financial measures prepared in accordance with GAAP. In the financial tables below, we have provided a reconciliation of, where applicable, the most comparable GAAP financial measures to the non-GAAP financial measures used in this press release, or a reconciliation of the non-GAAP calculation of the financial measure.\nIn particular, in this press release, we use certain non-GAAP measures that exclude the following from net income:\n2017 Fourth Quarter Non GAAP Fully Diluted Earnings Per Share Disclosure Reconciliation (dollars in thousands) Amounts presented\nunder GAAP\nAdjustments Non-GAAP\nDisclosure\nNet income before adjustments $ 2,273 $ - $ 2,273 Adjustments Tax rate change impact on deferred taxes - 5,414 5,414 Acquisition costs - 2,640 2,640 Tax benefit of acquisition costs - (1,097 ) (1,097 ) Adjusted net income $ 2,273 $ 6,957 $ 9,230 Earnings per share: Fully diluted earnings per share $ 0.06 $ 0.25 Diluted shares outstanding 37,500,952 37,500,952 In addition, in this press release, we use certain non-GAAP financial ratios and measures that are not required by GAAP or exclude certain financial items from calculations that are otherwise required under GAAP, including:\nThe efficiency ratio is the ratio of noninterest expense to the sum of net interest income and noninterest income and excludes one-time items of income or expense. For the quarter and year ended December 31, 2017, $2.6 million of acquisition costs were excluded from noninterest expenses for purposes of this computation. Tangible common equity (also referred to as tangible book value) and tangible assets, are equal to common equity and assets, respectively, less $33.6 million and $2.2 million of goodwill and intangible assets as of December 31, 2017 and December 31, 2016, respectively. We believe that this information is consistent with the treatment by bank regulatory agencies, which exclude intangible assets from the calculation of capital ratios.\nDiscussion of Changes in Results of Operations and Financial Position\nQuarter Ended December 31, 2017 as Compared to Quarter Ended December 31, 2016\nOur net income and income before taxes in the fourth quarter of 2017 were $2.3 million and $13.0 million, respectively, as compared to $6.5 million and $10.6 million, respectively, in the fourth quarter of 2016. The $2.4 million increase in income before taxes was the result of a $2.6 million increase in income before taxes for Banking and a $0.3 million increase in income before taxes for Wealth Management which were partially offset by a $0.5 million increase in corporate expenses. The increase in Banking was due to higher net interest income, a lower provision for loan losses and higher noninterest income which was partially offset by higher noninterest expenses. The increase in Wealth Management was due to higher noninterest income which was partially offset by higher noninterest expenses. Corporate interest expenses are related to the holding company line of credit which did not exist in 2016. Included in corporate noninterest expenses are $0.1 million of costs incurred related to the acquisition of C1B.\nIn the fourth quarter of 2017, we recorded a $5.4 million tax charge, attributable to the remeasurement of the net deferred tax asset as a result of the reduced corporate tax rate under the Tax Cuts and Jobs Act enacted in the fourth quarter of 2017. As a result, our effective tax rate for the fourth quarter of 2017 was 82.6% as compared to 38.5% for the fourth quarter of 2016, and as compared to a statutory rate of approximately 41.5%. During the fourth quarters of 2017 and 2016, we realized 58 and 233 basis point reductions in our effective tax rate, respectively, related to excess tax benefits resulting from the exercise of stock awards.\nNet interest income for Banking increased 26% from $25.0 million in the fourth quarter of 2016, to $31.4 million in the fourth quarter of 2017 due to a 31% increase in interest-earning assets, which was partially offset by a decrease in our net interest rate spread. The decrease in the net interest rate spread from 2.91% in the fourth quarter of 2016 to 2.60% in the fourth quarter of 2017 was due to an increase in the cost of interest-bearing liabilities from 0.61% in the fourth quarter of 2016 to 1.00% in the fourth quarter of 2017 which was partially offset by an increase in yield on total interest-earning assets from 3.52% in the fourth quarter of 2016 to 3.60% in the fourth quarter of 2017. The yield on interest-earning assets increased as a result of an increase in the yield on loans and a higher proportion of higher yielding loans which were partially offset by lower yields on and lower levels of FHLB stock holdings. The increase in the cost of interest-bearing liabilities was due to increased costs of interest-bearing deposits, resulting from increases in deposit market rates, and increased costs of borrowings as the average rate on FHLB advances increased from 0.48% in the fourth quarter of 2016 to 1.28% in the fourth quarter of 2017. In addition, the Company had outstanding borrowings on its holding company line of credit during the fourth quarter of 2017.\nThe provision for loan losses in the fourth quarter of 2017 was $0.9 million as compared to $1.8 million in the fourth quarter of 2016 as the growth in outstanding loans in the fourth quarter of 2017, excluding loans acquired in the acquisition of C1B, was 27% less than the growth in loans in the fourth quarter of 2016.\nNoninterest income in Banking was $3.1 million higher in the fourth quarter of 2017 as compared to the fourth quarter of 2016. During the fourth quarter of 2017, we realized $2.7 million in gains on the sale of $167 million of multifamily loans, while in the fourth quarter of 2016, we realized $0.6 million of gains on the sale of $41 million of multifamily loans. In addition, loan related fees, including loan servicing fees, were $0.7 million higher in the fourth quarter of 2017 as compared to the fourth quarter of 2016 due to increased balances of loans serviced for others and increased loan activity. Noninterest income for Wealth Management increased by $0.8 million in the fourth quarter of 2017 when compared to the corresponding period in 2016 due to higher levels of AUM.\nNoninterest expense in Banking increased from $14.7 million in the fourth quarter of 2016 to $22.5 million in the fourth quarter of 2017 due to $2.5 million of one-time costs related to the acquisition of C1B, increases in staffing and costs associated with the Bank’s expansion, including the acquisition of C1B and the growth of its balances of loans and deposits. Compensation and benefits for Banking increased $1.3 million or 16% during the fourth quarter of 2017 as compared to the fourth quarter of 2016 as the number of full time equivalent employees (“FTE”) in Banking increased to 332.2 from 272.0 as a result of the increased staffing related to the C1B acquisition, the December 2016 acquisition of two branches and additional personnel added to support the growth in loans and deposits. A $1.0 million increase in occupancy and depreciation for Banking in the fourth quarter of 2017 as compared to the fourth quarter of 2016 was due to costs related to the C1B acquisition, the December 2016 acquisition of two branches and increases in our data processing costs due to increased volumes and the implementation of enhancements. Litigation related costs for Banking were $0.3 million higher in the fourth quarter of 2017 as compared to the fourth quarter of 2016 due to costs associated with outstanding litigation matters. The $5.0 million increase in other expenses in Banking in the fourth quarter of 2017 as compared to the fourth quarter of 2016 was due to $2.5 million of one-time costs related to the acquisition of C1B and a $2.8 million increase in customer service costs related to the increases in noninterest demand deposits. The increase in noninterest expense for Wealth Management was due to a $0.4 million increase in compensations and benefits related to a 9% increase in FTE and cost of living increases.\n2017 as Compared to 2016\nOur net income and income before taxes in 2017 were $27.6 million and $50.6 million, respectively, as compared to $23.3 million and $38.3 million, respectively, in 2016. The increase in income before taxes was the result of a $13.4 million increase in income before taxes for Banking and a $1.0 million increase in income before taxes for Wealth Management, which were partially offset by a $2.1 million increase in corporate expenses. The increase in Banking was due to higher net interest income, a lower provision for loan losses and higher noninterest income which were partially offset by higher noninterest expenses. The increase in Wealth Management was due to higher noninterest income which was partially offset by higher noninterest expense. The increase in Wealth Management was due to higher noninterest income which was partially offset by higher noninterest expenses. Corporate interest expenses are related to the holding company line of credit which did not exist in 2016. Corporate noninterest expenses increased in 2017 by $1.4 million when compared to 2016 due to costs related to strategic activities, including the Company’s at the market stock offering and acquisition related activities, higher charitable contributions and other increases in costs, including legal and marketing.\nIn the fourth quarter, we recorded a $5.4 million tax charge, attributable to the remeasurement of the net deferred tax asset as a result of the reduced corporate tax rate under the Tax Cuts and Jobs Act enacted in the fourth quarter of 2017. As a result, the effective tax rate for 2017 was 45.5% as compared to 39.2% for 2016, and as compared to a statutory rate of approximately 41.5%. During 2017 and 2016, we realized 743 and 267 basis point reductions in our effective tax rate, respectively, related to excess tax benefits resulting from the exercise of stock awards.\nNet interest income for Banking increased 28% from $89.4 million in 2016, to $114.3 million in 2017 due to a 36% increase in interest-earning assets, which was partially offset by a decrease in our net interest rate spread. The decrease in the net interest rate spread from 2.95% in 2016 to 2.65% in 2017 was due to an increase in the cost of interest-bearing liabilities. The yield on interest-earning assets was 3.53% for both 2017 and 2016 as a decrease in the yield on loans due to prepayments of higher yielding loans and the addition of loans at market rates in the latter half of 2016 which were lower than the then-current yield on our loan portfolio were offset by an increase in the proportion of higher yielding loans to total assets in 2017. The cost of interest-bearing liabilities increased from 0.57% to 0.88% due to increased costs of interest-bearing deposits, resulting from increases in deposit market rates and increased costs of borrowings as the average rate on FHLB advances increased from 0.45% in 2016 to 0.98% in 2017. In addition, the Company borrowed on its holding company line of credit during 2017.\nThe provision for loan losses in 2017 was $2.8 million as compared to $4.7 million in 2016. During 2017, we realized $0.2 million of recoveries and experienced improving credit trends in our criticized loans.\nNoninterest income in Banking increased $2.2 million from $13.8 million in 2016 to $16.0 million in 2017. During 2016, we realized $7.8 million in gains on the sale of multifamily loans and $1.0 million in losses from capital activities as compared to $7.0 million in gains on sales of loans during 2017. In addition, loan related fees, including loan servicing fees, were $1.8 million higher in 2017 as compared to 2016 due to increased balances of loans serviced for others and increased loan activity. Noninterest income for Wealth Management increased by $2.2 million when compared to 2016 due to higher levels of AUM.\nNoninterest expense in Banking increased from $58.4 million in 2016 to $74.0 million in 2017 due to $2.5 million of one-time costs related to the acquisition of C1B, increases in staffing and costs associated with the Bank’s expansion, including the acquisition of C1B and the growth of its balances of loans and deposits, which was partially offset by lower legal costs. Compensation and benefits for Banking increased $6.3 million or 19% during 2017 as compared to 2016 as the number of FTE in Banking increased to 310.9 from 260.2 as a result of the increased staffing related to the C1B acquisition, the December 2016 acquisition of two branches and additional personnel added to support the growth in loans and deposits. A $3.3 million increase in occupancy and depreciation for Banking in 2017 as compared to 2016 was due to costs associated with our expansion into additional corporate space, the C1B acquisition, the December 2016 acquisition of two branches, the opening of new offices during 2016 and increases in our data processing costs due to increased volumes and the implementation of enhancements. Litigation related costs for Banking were $2.8 million lower in 2017 as compared to 2016 due to the reimbursement in 2017 from our insurance providers of $1.8 million of previously incurred legal costs and costs incurred for a trial in 2016. The $8.6 million increase in other expenses in Banking in the 2017 as compared to 2016 was due to $2.5 million of one-time costs related to the acquisition of C1B, a $5.4 million increase in customer service costs related to the increases in noninterest demand deposits and a $0.4 million increase in FDIC insurance fees. The increase in noninterest expense for Wealth Management was due to a $1.3 million increase in compensations and benefits related to a 6% increase in FTE and cost of living increases.\nQuarter Ended December 31, 2017 as Compared to Quarter Ended September 30, 2017\nOur net income and income before taxes in the fourth quarter of 2017 were $2.3 million and $13.0 million, respectively, as compared to $9.6 million and $14.2 million, respectively, in the third quarter of 2017.\nIncome before taxes for Banking decreased by $1.1 million, while income before taxes for Wealth Management and corporate expenses were consistent with the third quarter amounts. The decrease in Banking was due to a higher provision for loan losses and higher noninterest expenses which were partially offset by a higher net interest income and higher noninterest income.\nIn the fourth quarter, we recorded a $5.4 million tax charge, attributable to the remeasurement of the net deferred tax asset as a result of the reduced corporate tax rate under the Tax Cuts and Jobs Act enacted in the fourth quarter of 2017. As a result, the effective tax rate for the fourth quarter of 2017 was 82.6% as compared to 32.6% for the fourth quarter of 2016, and as compared to a statutory rate of approximately 41.5%. During the fourth and third quarters of 2017, we realized 58 and 976 basis point reductions in our effective tax rate, respectively, related to excess tax benefits resulting from the exercise of stock awards.\nNet interest income for Banking increased 10% from $28.7 million in the third quarter of 2017 to $31.4 million in the fourth quarter of 2017 due to a 7% increase in interest-earning assets and an increase in the net interest rate spread from 2.57% to 2.60%. The net yield on interest earning assets increased from 2.90% in the third quarter of 2017 to 2.97% in the fourth quarter of 2017 as the increase in yield on interest earning assets, from 3.55% to 3.60%, was only partially offset by an increase in the cost of interest-bearing liabilities, from 0.98% to 1.00%. The yield on interest earning assets increased due to an increase in the yield on loans from 3.73% to 3.79% as the yield on originations is higher than the current yield on the existing loan portfolio. The increase in the cost of interest-bearing liabilities was due to increased costs of interest-bearing deposits, resulting from increases in deposit market rates.\nThe provision for loan losses in the fourth quarter of 2017 was $0.9 million as compared to $0.7 million in the third quarter of 2017 due to slightly higher growth in outstanding loans in the fourth quarter of 2017 as compared to the third quarter of 2017.\nNoninterest income in Banking increased from $4.0 million in the third quarter of 2017 to $5.4 million in the fourth quarter of 2017 as we realized $2.7 million and $2.0 million in gains on the sale of multifamily loans in the fourth and third quarter of 2017, respectively. In addition, loan related fees, including loan servicing fees, were $0.6 million higher in the fourth quarter of 2017 as compared to the third quarter of 2017.\nNoninterest expense in Banking increased from $17.3 million in the third quarter of 2017 to $22.5 million in the fourth quarter of 2017. A $0.4 million increase in occupancy and depreciation for Banking in the fourth quarter of 2017 as compared to the third quarter of 2017 was due to costs related to the C1B acquisition and increases in our data processing costs due to increased volumes and the implementation of enhancements. Litigation related costs for Banking were $0.9 million higher in the fourth quarter of 2017 as compared to the fourth quarter of 2016 due to costs associated with outstanding litigation matters and the reimbursement in the third quarter of 2017 from our insurance providers of previously incurred legal costs. A $4.0 million increase in other expenses in Banking in the fourth quarter of 2017 as compared to the third quarter of 2017 was due to $2.5 million of one-time costs related to the acquisition of C1B, a $0.6 million increase in customer service costs related to the increases in noninterest demand deposits, a $0.2 million increase in FDIC insurance costs due to increased deposit levels and a $0.2 million increase in core deposit intangible amortization costs.\nChanges in Financial Position\nDuring 2017, total assets increased by $566 million as the growth of our loans, including loans acquired in the acquisition of C1B, was offset by the elimination of additional borrowings of $550 million that occurred as of December 31, 2016. Loans and deposits balances acquired in the C1B acquisition were $227 million and $412 million, respectively. Cash and cash equivalents decreased by $478 million due primarily to the payoff of the additional borrowing. Loans and loans held for sale increased by $1.01 billion as a result of $1.7 billion of originations, loans acquired from C1B and $8 million of purchases which were partially offset by the sale of $453 million of multifamily loans and payoffs or scheduled payments of $491 million. Deposits increased by $1.02 billion as a result of deposits acquired from C1B and as our specialty deposits and branch deposits increased by $267 million and $240 million, respectively. Borrowings decreased by $572 million due primarily to the payoff of the additional borrowings. During 2017, the Company sold 1.4 million shares of its common stock through its at-the-market offering at an average price of $16.83 per share, generating net proceeds of $22.8 million, and borrowed $50 million on its holding company line of credit. The Company contributed $59.7 million as a result of the acquisition of C1B and $65 million in cash to the Bank during 2017.\nOur credit quality remains strong as our ratio of non-performing assets to total assets is at 0.31% at December 31, 2017. We realized net recoveries of $0.2 million during 2017 and the ratio of the allowance for loan and lease losses to loans, excluding loans acquired in acquisitions, was 0.54% at December 31, 2017.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180131005432/en/\nFirst Foundation Inc.\nJohn Michel\nChief Financial Officer\n949-202-4160\njmichel@ff-inc.com\nSource: First Foundation Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ff-inc.com&esheet=51751357&newsitemid=20180131005432&lan=en-US&anchor=www.firstfoundationinc.com&index=1&md5=832f917bed484a20fda9ee4fe698a8f9", "http://www.businesswire.com/news/home/20180131005432/en/"], "published": "2018-01-31T17:00:00.000+02:00", "crawled": "2018-01-31T18:50:29.006+02:00", "highlightTitle": ""}