{"organizations": [], "uuid": "8df94ac1ecf97b09e2fd0997e5d6d7f5703c88e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180114&t=2&i=1221902057&w=1200&r=LYNXMPEE0D0B5", "site_section": "http://feeds.reuters.com/reuters/INformulaOne\r", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/india-supremecourt-judges/former-top-judges-join-criticism-of-indias-chief-justice-idINKBN1F30IK", "country": "US", "domain_rank": 408, "title": "Former top judges join criticism of India's Chief Justice", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T14:24:00.000+02:00", "replies_count": 0, "uuid": "8df94ac1ecf97b09e2fd0997e5d6d7f5703c88e5"}, "author": "", "url": "https://in.reuters.com/article/india-supremecourt-judges/former-top-judges-join-criticism-of-indias-chief-justice-idINKBN1F30IK", "ord_in_thread": 0, "title": "Former top judges join criticism of India's Chief Justice", "locations": [], "entities": {"persons": [{"name": "chi", "sentiment": "negative"}, {"name": "rupam jain", "sentiment": "none"}, {"name": "jasti chelameswar", "sentiment": "none"}, {"name": "madan lokur", "sentiment": "none"}, {"name": "kurian joseph", "sentiment": "none"}, {"name": "misra", "sentiment": "none"}, {"name": "ranjan gogoi", "sentiment": "none"}, {"name": "dipak misra", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "new delhi", "sentiment": "none"}], "organizations": [{"name": "supreme court", "sentiment": "none"}, {"name": "delhi high court", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW DELHI (Reuters) - Four former senior Indian judges on Sunday released a letter in support of a group of Supreme Court judges who on Friday openly criticised the way the top court was functioning.\n(L-R) Justices Kurian Joseph, Jasti Chelameswar, Ranjan Gogoi and Madan Lokur address the media at a news conference in New Delhi, January 12, 2018. REUTERS/Stringer The retired judges — including a former Supreme Court judge and a chief justice of the Delhi High Court — confirmed they had issued an open letter to the Chief Justice of India after four Supreme Court judges held a press conference on Friday in which one of them warned that the nation’s democracy was under threat because of the way the top court was being run.\nThe four sitting judges of the Supreme Court had criticised distribution of cases to judges and raised concerns about judicial appointments in the nation’s highest court under Chief Justice Dipak Misra.\nMisra has not responded to their allegations.\n“We agree with the four judges that though the chief justice of India is the master of roster and can designate benches for allocation of work, this does not mean that it can be done in an arbitrary manner such that sensitive and important cases are sent to hand-picked benches of junior judges by the chief justice,” the former judges said in the open letter on Sunday.\nJustice Jasti Chelameswar gestures as he leaves after the news conference in New Delhi, January 12, 2018. REUTERS/Adnan Abidi Reuters was able to confirm that the letter was drafted and signed by four former judges P.B.Sawant, A.P.Shah, K. Chandru and H. Suresh.\nTwo of the retired judges said it was important to support the group of Supreme Court judges because they had taken the bold step of speaking out publicly to protect the sanctity of the most important institution of India.\nSlideshow (3 Images) Friday’s public outburst by judges prompted Prime Minister Narendra Modi to hold an emergency meeting with his law minister on Friday but the government has refused to comment.\nThe four former judges said in the statement that all rules and norms must be laid down clearly for allocation of cases.\n“This must be done immediately to restore public confidence in the judiciary and in the Supreme Court,” the former judges said.\nEditing by David Goodman\n ", "external_links": [], "published": "2018-01-14T14:24:00.000+02:00", "crawled": "2018-01-14T15:13:59.003+02:00", "highlightTitle": ""}