{"organizations": [], "uuid": "98cc5a16482c1b2f3451227f77b280ae20904202", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/safrica-markets-probe/update-1-south-african-regulator-reviewing-volatile-share-trading-idUSL8N1P72UM", "country": "US", "domain_rank": 408, "title": "UPDATE 1-South African regulator reviewing volatile share trading", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T15:06:00.000+02:00", "replies_count": 0, "uuid": "98cc5a16482c1b2f3451227f77b280ae20904202"}, "author": "", "url": "https://www.reuters.com/article/safrica-markets-probe/update-1-south-african-regulator-reviewing-volatile-share-trading-idUSL8N1P72UM", "ord_in_thread": 0, "title": "UPDATE 1-South African regulator reviewing volatile share trading", "locations": [], "entities": {"persons": [{"name": "viceroy", "sentiment": "none"}, {"name": "nqobile dludla", "sentiment": "none"}], "locations": [{"name": "johannesburg", "sentiment": "none"}, {"name": "aspen", "sentiment": "none"}], "organizations": [{"name": "fsb", "sentiment": "none"}, {"name": "johannesburg stock exchange", "sentiment": "none"}, {"name": "financial services board", "sentiment": "none"}, {"name": "aspen pharmacare", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "viceroy research", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 1:06 PM / Updated 2 hours ago UPDATE 1-South African regulator reviewing volatile share trading Reuters Staff \n* Regulator reviewing trading activity in Aspen \n* Talk of negative research report hits property stocks \n* Viceroy Research group says won’t comment on speculation (Adds Resilient CEO quote, analyst, background on Viceroy) \nBy Nqobile Dludla \nJOHANNESBURG, Jan 12 (Reuters) - A South African market regulator said on Friday it was reviewing volatile share trading sparked by market speculation that a research group would release a negative report on a listed firm. \nThe regulator confirmed in an emailed response to questions it was reviewing unusual activity in shares of Aspen Pharmacare , which plunged 10 percent on Tuesday, prompting the company to say there was speculation that New York-based Viceroy Research would release damaging information about the company. \nAspen, whose shares have since recovered, said it had never been contacted by Viceroy. \nThe Financial Services Board (FSB) was working with the Johannesburg Stock Exchange to determine whether to open a formal investigation, FSB spokeswoman Tembisa Marele said. \n“The specific mandate of the FSB in this area, according to the Financial Markets Act is to investigate cases of insider trading; price manipulation; and false reporting,” Marele said. \nJohannesburg Stock Exchange director of market regulation Shaun Davies said a review was underway and it was a market offence “to make false statements about listed securities” but added it was not clear if there had been any misconduct. \nSpeculation that Viceroy would publish damaging research on a company also hit real estate investment trusts, such as Resilient Reit, Fortress Reit, and Greenbay Properties. \nThe FSB said it had not decided whether to investigate movements in property stocks. \nViceroy, which describes itself on its website as “a group of individuals who see the world differently,” said it would not comment on the market speculation. \n“Viceroy encourages people not to speculate on the identity of any companies we are researching and we advise caution in trading on gossip,” it said in an emailed response to questions. \nFortress Reit Chief Executive Officer Mark Stevens said the market was “speculating wildly on unsolicited rumours” and it was business as usual at his firm. \nResilient CEO Desmond de Beer said recent movements in the firm’s share price “may emanate from an attack by a hedge fund short-selling the shares following a social media campaign.” \nResilient hasn’t been contacted by Viceroy, and welcomes the review by the regulators, particularly into aggressive short-selling of shares, he added. \nThere was no immediate comment from Greenbay. \nViceroy thrust itself into the spotlight after releasing a report detailing some of retail giant Steinhoff’s <SNHJ,J> troubles in December, shortly after the resignation of its CEO Markus Jooste and its admission of accounting irregularities. (Editing by Edmund Blair and Mark Potter)", "external_links": [], "published": "2018-01-12T15:06:00.000+02:00", "crawled": "2018-01-12T15:26:27.015+02:00", "highlightTitle": ""}