{"organizations": [], "uuid": "0cd7e620dc7a5a817f596a2330d2604fc61386b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.feedburner.com/NewsUnNews-GoogleNews", "section_title": "NEWS UN news - Google News", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-france/france-says-sochi-meeting-on-syria-must-be-under-u-n-auspices-idUSKBN1FI1SU", "country": "US", "domain_rank": 408, "title": "France says Sochi meeting on Syria must be under UN auspices - Reuters", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T16:38:00.000+02:00", "replies_count": 0, "uuid": "0cd7e620dc7a5a817f596a2330d2604fc61386b6"}, "author": "", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-france/france-says-sochi-meeting-on-syria-must-be-under-u-n-auspices-idUSKBN1FI1SU", "ord_in_thread": 0, "title": "France says Sochi meeting on Syria must be under UN auspices - Reuters", "locations": [], "entities": {"persons": [{"name": "bashar al-assad", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "un", "sentiment": "negative"}, {"name": "u.n. security council", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "u.n.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 2:34 PM / Updated 3 minutes ago France, Britain shun Sochi meeting on Syria, want U.N. process Reuters Staff 3 Min Read \nPARIS (Reuters) - France and Britain will not take part in Syrian peace talks to be held in Russia on Tuesday, saying the talks had to be part of a U.N.-led process and urging Moscow to get the Syrian government to engage in meaningful negotiations. \nWestern powers and some Arab states believe the Sochi talks are an attempt by Russia to create a separate peace process that undermines the U.N. peace effort while laying the groundwork for a solution favorable to President Bashar al-Assad and allies Russia and Iran. \nRussia has invited the other permanent members of the U.N. Security Council - Britain, China, France and the United States - to the meeting, which the Syrian opposition has said it will boycott. \n”All other initiatives, like the Sochi meeting organized by Russia, must support the U.N. process and be in that framework,” a French foreign ministry spokesman said in a daily briefing. \n“We take note of the Syrian opposition’s decision not to go to Sochi. France will not participate in the work being carried out there,” the spokesman said. \nSome 1,600 Syrian politicians, rebels and members of civil society will attend the negotiations in the Black Sea Resort, which follow another round of failed U.N. peace talks in Vienna. \n“UK will not participate in the Sochi conference. Despite Russia’s efforts the regime refuses to engage and has damaged confidence that Sochi can help the Geneva process,” Britain’s Syria envoy Martin Longden said on Twitter. \n“We urge Russia to use its influence to persuade the regime to cease its destructive behavior.” \nFrance and Britain have backed the Syrian opposition during the seven-year conflict. \nFrench officials said Russia only extended an invitation to attend on the sidelines of the Sochi conference and the foreign ministry declined to say whether any diplomats would attend. France’s Syria envoy is not due to go, a diplomatic source said. \n“If the talks failed in Vienna it’s because the regime was not in the negotiations, it was there figuratively,” French Foreign Minister Jean-Yves Le Drian was quoted as saying by media during a trip to Japan. \n“I think Sotchi will not enable a breakthrough because an essential player will not be there due precisely to the regime’s refusal to negotiate in Vienna.” Reporting by John Irish; editing by Richard Lough, Larry King", "external_links": [], "published": "2018-01-29T16:38:00.000+02:00", "crawled": "2018-01-29T20:29:15.049+02:00", "highlightTitle": ""}