{"organizations": [], "uuid": "1598dfa2f5c28711b88853c671ea14bc513a36f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/17/104849844-RTS1KBAU.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/11/tesla-semi-could-save-money-over-diesels-within-2-years-of-ownership.html", "country": "US", "domain_rank": 767, "title": "Tesla Semi could save money over diesels within 2 years of ownership", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.042, "site_type": "news", "published": "2018-01-11T20:01:00.000+02:00", "replies_count": 0, "uuid": "1598dfa2f5c28711b88853c671ea14bc513a36f1"}, "author": "Robert Ferris", "url": "https://www.cnbc.com/2018/01/11/tesla-semi-could-save-money-over-diesels-within-2-years-of-ownership.html", "ord_in_thread": 0, "title": "Tesla Semi could save money over diesels within 2 years of ownership", "locations": [], "entities": {"persons": [{"name": "tesla semi", "sentiment": "negative"}, {"name": "tesla", "sentiment": "none"}, {"name": "elon musk", "sentiment": "none"}, {"name": "alexander potter", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "hawthorne", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "piper jaffray", "sentiment": "none"}, {"name": "alexandria sage | reuters tesla", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Retail Report Tesla Semi could save money over diesels within 2 years of ownership The Tesla Semi could recoup costs and begin saving over diesel engines in two years, Piper Jaffray says. There are still some unknowns around costs, such as potential battery replacements. SHARES Alexandria Sage | Reuters Tesla's new electric semi truck is unveiled during a presentation in Hawthorne, California, U.S., November 16, 2017. \nElon Musk may yet convince skeptics that an electric semitrailer is a better buy than diesel. \nTesla has said its electric truck will save owners money over diesel trucks over time, but skeptics so far have expressed doubts and have clamored for more data and validation. \nA new report from Piper Jaffray suggests Tesla Semi buyers could begin saving money over diesel engines after two years of ownership. \nFactoring the costs of variables such as engine manufacturing, fuel/electricity and maintenance, along with assumptions about how customers are likely to use a large commercial semitrailer, Piper Jaffray analyst Alexander Potter said he thinks EV trucks will succeed. \nElectric vehicles do appear to cost much more to manufacture, according to Potter. For example, he estimates the cost of all parts on a diesel truck that would not be needed on an electric vehicle to be $37,128, while the cost of parts needed on an EV (but not a diesel) would be much higher, at $82,720. That is mostly due to the battery pack, which is estimated at $54,500 installed. \nHowever, the costs of repairing, refueling and maintaining an electric vehicle are lower. Yearly spending on those expenses runs $35,676 for diesel truck. The electric truck would cost less than half, $14,306. \nAt that rate, electric trucks would recoup their extra costs over diesels and begin saving money in about 2.1 years, Potter said. \nOther factors are needed for future versions of the payback model, particularly around costs, Potter said. For example, it is not known whether fleets will need to spend significantly more to replace batteries as they degrade, or if they will be able to solve that problem by redeploying older trucks to lower-mileage routes. There also may be unforeseen maintenance costs or downtime and effects on performance from extreme weather. \nTesla also said it has been able to improve range by reducing drag on the sleek vehicle as it drives. But diesel manufacturers could make similar improvements to their trucks, reducing the Tesla Semi's edge.", "external_links": [], "published": "2018-01-11T20:01:00.000+02:00", "crawled": "2018-01-11T20:01:35.003+02:00", "highlightTitle": ""}