{"organizations": [], "uuid": "59db084b6a13daa8add851bbe73be8e4983546ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-tradeworx-inc-announces-sale-of-trading-business.html", "country": "US", "domain_rank": 767, "title": "Tradeworx, Inc. Announces Sale Of Trading Business", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-23T17:16:00.000+02:00", "replies_count": 0, "uuid": "59db084b6a13daa8add851bbe73be8e4983546ae"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-tradeworx-inc-announces-sale-of-trading-business.html", "ord_in_thread": 0, "title": "Tradeworx, Inc. Announces Sale Of Trading Business", "locations": [], "entities": {"persons": [{"name": "blueshift", "sentiment": "none"}, {"name": "mani mahjouri", "sentiment": "none"}, {"name": "mike beller", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "tradeworx", "sentiment": "none"}], "organizations": [{"name": "tradeworx, inc.", "sentiment": "neutral"}, {"name": "tradeworx, inc", "sentiment": "neutral"}, {"name": "thesys group, inc.", "sentiment": "none"}, {"name": "blueshift asset management", "sentiment": "none"}, {"name": "tradeworx", "sentiment": "none"}, {"name": "tradeworx inc", "sentiment": "none"}, {"name": "thesys technologies", "sentiment": "none"}, {"name": "thesys technologies, inc.", "sentiment": "none"}, {"name": "thesys group inc.", "sentiment": "none"}, {"name": "tradeworx inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 23, 2018 /PRNewswire/ -- Tradeworx, Inc. announced today it has sold its trading business in order to focus solely on the continued growth and expansion of the financial technology business of its wholly owned subsidiary, Thesys Technologies, Inc., a leading capital markets provider. As a result, Tradeworx Inc. has changed its name to Thesys Group, Inc. and the former trading business of Tradeworx was established as a separate firm named Blueshift Asset Management (Blueshift). Terms of the transaction were not disclosed.\nThe trading business was sold to a group led by Mani Mahjouri, Chief Executive Officer and Chief Investment Officer of Blueshift, who previously served as Tradeworx's Chief Investment Officer. As part of the transaction, Blueshift acquired all the trading assets from Tradeworx. Mike Beller, will remain CEO of Thesys Technologies and its holding company Thesys Group Inc., formerly Tradeworx Inc.\nMike Beller, Chief Executive Officer of Thesys Group, Inc. said, \"As we evolved both our technology and trading businesses over time, we realized it was mutually beneficial to separate the two businesses to maximize their potential. This new corporate structure better aligns with our recent growth as a market structure technology leader within capital markets, while allowing the team at Blueshift Asset Management to focus solely on institutional asset management.\"\nMani Mahjouri, Chief Executive Officer of Blueshift commented, \"I want to thank Mike and the entire team at Thesys for the support they've provided to the Blueshift team over the past several years and as we set out to launch our firm. As a standalone entity, we are very excited to have the opportunity to focus entirely on the pursuit of alpha generation on behalf of our investors.\"\nThe trading business team formerly with Tradeworx is now part of Blueshift, which is based in Red Bank, New Jersey. Thesys Technologies, along with its holding company Thesys Group Inc. will remain in New York with offices in South Carolina.\nAbout Thesys Group Inc.: Thesys Group Inc. is a financial technology company headquartered in New York. Thesys Group operates Thesys Technologies, a capital markets technology leader and Thesys CAT LLC, the plan processor for the Consolidated Audit Trail. For more information, please visit the website at www.thesysgroup.com .\nAbout Thesys Technologies, LLC: Thesys Technologies, LLC is a capital markets technology leader with a focus on market structure technology, providing high performance trading technologies and big data solutions to financial market participants. Thesys' technology includes pre- and post-trade surveillance tools, low latency trading platforms, matching engines, and big data analytical tools such as those provided to the U.S. Securities and Exchange Commission as the MIDAS system. Thesys Technologies, LLC is headquartered in New York with offices in Charleston, South Carolina. For more information on Thesys Technologies, LLC, please visit the website at www.thesystech.com .\nAbout the Blue Shift Asset Management: Blueshift Asset Management is a quantitative investment management firm headquartered in Red Bank, New Jersey. Led by Mani Mahjouri, a former Tradeworx, Sun Trading, and AQR executive who serves as Blueshift's Chief Executive Officer and Chief Investment Officer, the Firm deploys quantitative research-based trading knowledge to its statistical arbitrage and high-frequency strategies across a range of structures. The team's innovative approach has a 10-year history in statistical arbitrage and an 8-year history in high frequency trading. For more information, please visit the website at https://blueshift.am/ .\nView original content with multimedia: http://www.prnewswire.com/news-releases/tradeworx-inc-announces-sale-of-trading-business-300586610.html\nSOURCE Thesys Technologies, LLC", "external_links": ["https://blueshift.am/", "http://www.prnewswire.com/news-releases/tradeworx-inc-announces-sale-of-trading-business-300586610.html", "http://www.thesysgroup.com/", "https://www.thesystech.com/"], "published": "2018-01-23T17:16:00.000+02:00", "crawled": "2018-01-23T17:35:21.012+02:00", "highlightTitle": ""}