{"organizations": [], "uuid": "1ea16d36185cf40a18de0cbf0405dfe29fd5e41a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225461353&w=1200&r=LYNXMPEE0P0ND", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/usa-immigration/trump-says-republicans-will-accept-citizenship-for-dreamers-cnbc-interview-idINKBN1FF1CT", "country": "US", "domain_rank": 408, "title": "Trump says Republicans will accept citizenship for Dreamers: CNBC interview", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T13:31:00.000+02:00", "replies_count": 0, "uuid": "1ea16d36185cf40a18de0cbf0405dfe29fd5e41a"}, "author": "", "url": "https://in.reuters.com/article/usa-immigration/trump-says-republicans-will-accept-citizenship-for-dreamers-cnbc-interview-idINKBN1FF1CT", "ord_in_thread": 0, "title": "Trump says Republicans will accept citizenship for Dreamers: CNBC interview", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "trump interv", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "bob goodlatte", "sentiment": "none"}, {"name": "david perdue", "sentiment": "none"}, {"name": "tom cotton", "sentiment": "none"}, {"name": "john cornyn", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "republicans", "sentiment": "negative"}, {"name": "dreamers reuters", "sentiment": "negative"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "republican", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - U.S. President Donald Trump said on Friday he was willing to shift his stance on immigration to push through a deal that protects illegal immigrants brought to the country as children from deportation and offer them citizenship.\nIn an interview with CNBC broadcast on Friday, Trump also said Republican senators who have taken a tough approach to immigration, including Tom Cotton, John Cornyn and David Perdue, could agree to the plan to offer citizenship within 10 to 12 years to so-called “Dreamers.”\n“They’ve really shifted a lot, and I think they’re willing to shift more, and so am I,” the Republican president told CNBC in an interview from the World Economic Forum in Davos. “We’re going to see. If we make the right deal, I think they will.”\n“These are people that have very strong opinions on DACA (the Deferred Action for Childhood Arrivals programme) and on immigration generally. And I happen to think they’re largely right,” said Trump.\nSenior White House officials outlined an immigration plan on Thursday, hours after the Trump interview was taped, that would offer a path to citizenship for up to 1.8 million of the illegal immigrants. The proposal includes measures to curb some legal immigration programs and provide a border wall with Mexico.\nThe White House described the offer to more than double the number of Dreamers who would be protected from deportation as a major concession aimed at attracting enough votes for an immigration deal from Democrats.\nTo appeal to Republicans, the plan would slash family sponsorship of immigrants, tighten border security and provide billions of dollars in funding for a border wall with Mexico, one of Trump’s signature campaign promises - and proposals that have largely failed to gain traction with Democrats before.\nTrump’s framework was quickly slammed by Democrats as a non-starter. House Democratic leader Nancy Pelosi said it held Dreamers “hostage to a hateful anti-immigrant scheme” and accused the Trump administration of a campaign “to make America white again.”\nThe deal also was panned by both pro-immigration groups, who called the proposal a bad trade-off, and conservative groups, who criticized the expansion of “amnesty” for illegal immigrants.\nTrump, who was heading back from Davos, undermined any illusions of bipartisanship by taunting Senate Democratic leader Chuck Schumer on Twitter. Earlier this week, Schumer and Democrats backed a deal to reopen the government after a weekend shutdown if Republicans agreed to take up an immigration bill protecting the Dreamers.\n“DACA has been made increasingly difficult by the fact that Cryin’ Chuck Schumer took such a beating over the shutdown that he is unable to act on immigration!” Trump tweeted.\nRelated Coverage Factbox: What is in Trump's framework for immigration legislation Critics said the Trump framework was not helpful to the bipartisan Senate negotiations on an immigration deal.\n“It looks like President Trump has no intention of actually working on a bipartisan deal that protects Dreamers and makes sensible changes to our immigration laws. He’s trying to turn our nation against immigrants,” Democratic Senator Chris Murphy said.\nRepublican Senators Cotton and Perdue on Thursday praised the framework. But Representative Jim Jordan, a member of the House of Representatives conservative Freedom Caucus, said on Friday the focus of any plan must prioritise border security issues over DACA. “I have some concerns frankly. It’s all about where the focus is,” he told Fox News.\nReporting by Doina Chiacu and Makini Brice; Editing by Jeffrey Benkoe and Cynthia Osterman\n ", "external_links": [], "published": "2018-01-26T13:31:00.000+02:00", "crawled": "2018-01-26T13:58:04.010+02:00", "highlightTitle": ""}