{"organizations": [], "uuid": "a16b663015813300b59b082e1f79ef007cffda0a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/business-wire-the-sage-group-serves-as-exclusive-financial-advisor-to-vita-liberata-in-its-sale-to-crown-laboratories-a-hildred-capital.html", "country": "US", "domain_rank": 767, "title": "The Sage Group Serves as Exclusive Financial Advisor to Vita Liberata in Its Sale to Crown Laboratories, a Hildred Capital Partners Portfolio Company", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-05T17:58:00.000+02:00", "replies_count": 0, "uuid": "a16b663015813300b59b082e1f79ef007cffda0a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/business-wire-the-sage-group-serves-as-exclusive-financial-advisor-to-vita-liberata-in-its-sale-to-crown-laboratories-a-hildred-capital.html", "ord_in_thread": 0, "title": "The Sage Group Serves as Exclusive Financial Advisor to Vita Liberata in Its Sale to Crown Laboratories, a Hildred Capital Partners Portfolio Company", "locations": [], "entities": {"persons": [{"name": "vita liberata", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "llc", "sentiment": "neutral"}, {"name": "hildred capital partners portfolio company los angeles", "sentiment": "neutral"}, {"name": "vita liberata", "sentiment": "neutral"}, {"name": "sage group", "sentiment": "neutral"}, {"name": "advoganic tm technology", "sentiment": "none"}, {"name": "hildred capital partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES & NEW YORK--(BUSINESS WIRE)-- The Sage Group, LLC, a leading independent investment bank that provides corporate finance advice to premium branded consumer and beauty companies, announced today that it has served as the exclusive financial advisor to Vita Liberata, a premium sunless tanning and skincare brand, in its sale to Crown Laboratories, a leading, fully-integrated specialty pharmaceutical company focused on dermatology. Crown Laboratories is a portfolio company of Hildred Capital Partners, a New York based private investment firm.\nVita Liberata is the beauty industry’s first completely non-toxic tanning brand with a collection of odorless products free from parabens, perfume, and alcohol. Vita Liberata’s products employ a proprietary Advoganic TM Technology, combining cutting-edge skin chemistry with highly potent organic botanicals. The technology fully releases the premium ingredients’ potential, enabling skincare benefits that are superior to those found in formulas using traditional cosmetic chemicals. Vita Liberata sells at premium retailers in the US and Europe, including Sephora, Ulta, Boots, and Space.NK, and in prominent spas internationally such as George V Paris, St. Regis, and Burj Al Arab.\n“On meeting with the team at Sage for the first time, I found them to be not only very skilled and knowledgeable about the business of beauty, but also patient and supportive with a huge level of warmth and integrity and a sense of humor that I did not immediately expect from within the financial world,” said Alyson Hogg, Founder & CEO of Vita Liberata.\nPete Smyth, Founder & CEO of Broadlake, a Dublin-based private equity firm who supported Vita Liberata’s growth since 2012, added, “We selected Sage from a small shortlist of advisers who we felt had both the sector expertise and international network required to deliver a successful result. Andrew, Fred, and the team worked tirelessly and diligently to ensure that each stage of the process delivered the required results. The transaction’s success was largely due to the simple fact that they all genuinely cared about the outcome, to them it was clearly more than a mandate. We are very happy that we chose Sage.”\n“Alyson Hogg and her team at Vita, with the support of Broadlake, its private equity partner, have built the preeminent sunless tanning brand that has truly elevated the category. It was a pleasure to advise them on this transaction, a key inflection point in Vita’s growth story,” said Andrew Charbin, Director at The Sage Group. “While Vita brings to Crown strength in premium retail, home shopping, and professional, Crown has an extensive derm network in the US that offers a logical runway for growth for Vita, who will bring to the derm channel a two-tiered incremental offering: a truly organic and efficacious ingredient story, and sunless tanning products with proven skincare benefits.”\n“Crown Laboratories has a big vision for becoming a leading global player in dermatology covering all key consumer interfaces – OTC branded consumer, aesthetic, and medical prescription. Vita represents Crown’s first acquisition and is a meaningful step towards building its branded consumer division,” said Olivia Theroux, Vice President at The Sage Group.\nAbout The Sage Group, LLC:\nFounded in 2000, The Sage Group is an independent investment bank that provides corporate finance advice to premium branded consumer and retail companies. Sage advises on a broad range of M&A, capital raising, restructurings, take-privates, fairness opinions, and other corporate finance services for private and public companies and private equity funds worldwide.\nSage prides itself on its far-reaching industry relationships with key executives, entrepreneurs and financiers at the highest levels of international corporations, private equity firms, hedge funds and lending institutions. The firm’s combination of M&A expertise, industry knowledge, relationships, and success in creating value for its clients, has brought Sage a reputation for delivering exceptional results.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180105005487/en/\nMedia :\nProsek for The Sage Group\nEmily Roy, 212-279-3115 ext. 232\neroy@prosek.com\nSource: The Sage Group, LLC", "external_links": ["http://www.businesswire.com/news/home/20180105005487/en/"], "published": "2018-01-05T17:58:00.000+02:00", "crawled": "2018-01-05T20:22:09.023+02:00", "highlightTitle": ""}