{"organizations": [], "uuid": "8e682d788151f4bb0d08a9dc3a7950eb2050b426", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223243296&w=1200&r=LYNXMPEE0I07H", "site_section": "http://feeds.reuters.com/reuters/environment", "section_title": "Reuters: Environment", "url": "https://www.reuters.com/article/us-china-shipping-accident/china-says-sunken-iranian-tanker-may-be-leaking-bunker-fuel-idUSKBN1F80EV", "country": "US", "domain_rank": 408, "title": "China says sunken Iranian tanker may be leaking bunker fuel", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T07:18:00.000+02:00", "replies_count": 0, "uuid": "8e682d788151f4bb0d08a9dc3a7950eb2050b426"}, "author": "", "url": "https://www.reuters.com/article/us-china-shipping-accident/china-says-sunken-iranian-tanker-may-be-leaking-bunker-fuel-idUSKBN1F80EV", "ord_in_thread": 0, "title": "China says sunken Iranian tanker may be leaking bunker fuel", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "east china sea", "sentiment": "none"}, {"name": "sanchi", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "state oceanic administration", "sentiment": "none"}, {"name": "soa", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 5:20 AM / in an hour China says sunken Iranian tanker may now be leaking heavy oil Chen Aizhu , Muyu Xu 3 Min Read \nBEIJING (Reuters) - A sunken Iranian oil tanker may be leaking heavy bunker fuel as well as light oil off the east coast of China and the best remedy was to recover the vessel, officials said on Friday. \nIt was unclear how much bunker fuel was left aboard the tanker when it sank on Sunday after being ablaze for days but experts estimated it may have been carrying about 1,000 tonnes at the time of collision. \n“There have been multiple appearances of oil slicks of different sizes and types at the sinking spot and nearby... the slicks exceeded 200 sq kilometers (77 sq miles) on Thursday,” Huo Chuanlin, of the State Oceanic Administration’s Ecological Protection Department, told reporters. \nIt was not immediately clear where the oil could wash up or the extent of the damage it could cause. \nThe large tanker Sanchi (IMO:9356608) sank in the world’s worst oil ship disaster in decades. The crew of 30 Iranians and two Bangladeshis are all believed to have been killed. \nThe tanker had been adrift and ablaze after crashing into the freighter CF Crystal (IMO:9497050) on Jan. 6. Strong winds pushed it away from the Chinese coast, where the collision happened, and into Japan’s exclusive economic zone. FILE PHOTO: Flames and smoke from the Iranian oil tanker Sanchi is seen in the East China Sea, on January 15, 2018 in this photo provided by Japan's 10th Regional Coast Guard. 10th Regional Coast Guard Headquarters/Handout via REUTERS \nHuo said no oil spills had been detected near the coast, though it was hard to predict the impact on ocean life. \nThe SOA on Thursday reported three slicks covering a combined area of just 20.7 square km. FILE PHOTO: A Chinese rescue ship works to clean oil slicks from the sunken Iranian oil tanker Sanchi in the East China Sea, in this January 15, 2018 handout picture released by China's Ministry of Transport January 17, 2018. China's Ministry of Transport/Handout via REUTERS \nBunker fuel is the heavy oil used in ships’ engines and is difficult to remove from the sea once spilled, unlike condensate fuel - an extremely light form of oil - that was being shipped at the time of the collision. \nOfficials on Friday said the ship was carrying 111,300 tonnes of condensate before the accident. Most of the fuel evaporated after the ship caught fire. Related Coverage \nThey said recovering the vessel was risky and challenging, as the remaining condensate could catch fire again. \n(INTERACTIVE GRAPHIC: Tanker blaze burns bright interactive - tmsnrt.rs/2DmrPvL ) \n(MAP: Ship collision - tmsnrt.rs/2CBgqai )", "external_links": [], "published": "2018-01-19T07:18:00.000+02:00", "crawled": "2018-01-19T07:37:13.005+02:00", "highlightTitle": ""}