{"organizations": [], "uuid": "93be1358a4addc73d1547102fef18881f28c9c15", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 8}, "facebook": {"likes": 80, "shares": 80, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-WX144_OCULUS_SOC_20180108190316.jpg", "site_section": "http://online.wsj.com/xml/rss/3_7455.xml", "section_title": "WSJ.com: WSJD", "url": "https://www.wsj.com/articles/facebook-and-xiaomi-to-launch-virtual-reality-headset-in-china-1515455217", "country": "US", "domain_rank": 387, "title": "Facebook and Xiaomi to Launch Virtual-Reality Headset in China", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T03:37:00.000+02:00", "replies_count": 0, "uuid": "93be1358a4addc73d1547102fef18881f28c9c15"}, "author": "Deepa Seetharaman", "url": "https://www.wsj.com/articles/facebook-and-xiaomi-to-launch-virtual-reality-headset-in-china-1515455217", "ord_in_thread": 0, "title": "Facebook and Xiaomi to Launch Virtual-Reality Headset in China", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Facebook Inc. FB -0.22% and Chinese smartphone company Xiaomi Corp. are teaming up to launch a virtual-reality headset in China that would give the American tech giant a toehold in a growing market where its main business has long been blocked.\nThe two tech companies are working together to develop a VR headset sold only in China called Mi VR Standalone, Facebook said Monday. The new device is modeled after Facebook’s Oculus Go, a previously announced $199 headset that the company plans to launch outside of China in early 2018.\nXiaomi is also Facebook’s manufacturing partner for Oculus Go, the Silicon Valley company said. Facebook declined to comment on any revenue-sharing arrangement with Xiaomi, which will take a lead role in the Mi’s rollout.\nThe Mi headsets will be stamped with the Oculus logo, giving Facebook’s products exposure in China, where the company’s services have been blocked since 2009. Facebook needs to crack the large and growing China market to meet its previously stated goal of “connecting the world,” but Chinese officials show few signs of changing their policy. \nFacebook executives spent years publicly courting Chinese officials, making Chief Executive Mark Zuckerberg more visible and internally developing a tool that people familiar with the matter say would have allowed third parties—including governments like China—to block content before it could be posted on Facebook.\nMore in Technology \nFacebook Is Making a (Virtual) Comeback in China January 9, 2018 Tech Knocks on the Bathroom Door January 8, 2018 Amazon’s Alexa to Meet Google’s Assistant in a Las Vegas Showdown January 8, 2018 Parents Beware: That Videogame Under the Tree Wants More Money December 14, 2017 More recently, however, Facebook has adopted a quieter approach. Last May, the company covertly launched a photo-sharing app in China called Colorful Balloons under the name of a different company. \nThe latest Xiaomi deal is partly the handiwork of Hugo Barra, the former Xiaomi executive who joined Facebook a year ago to oversee the social-media company’s virtual-reality efforts. Mr. Barra’s portfolio includes Oculus VR, which Facebook bought for more than $2 billion in 2014.\nThe two companies won’t share any data about their users, a Facebook spokeswoman said. Users of the Xiaomi headset won’t be able to access the main Facebook service, used by more than two billion people a month world-wide, but developers working with the Oculus platform will be able to share their content to the Mi platform in China.\nBoth Oculus Go and Xiaomi Mi are standalone headsets that don’t require a personal computer or mobile phone to work. That is unlike Oculus’s debut device, the Rift virtual-reality goggles, which need to be tethered to a powerful computer to work, or the Samsung Gear VR, a smartphone-powered headset jointly developed by Facebook and Samsung Electronics Co. \nWrite to Deepa Seetharaman at Deepa.Seetharaman@wsj.com", "external_links": [], "published": "2018-01-09T03:37:00.000+02:00", "crawled": "2018-01-09T09:58:39.004+02:00", "highlightTitle": ""}