{"organizations": [], "uuid": "a89505e8be022e774ff8cc3f85218457a03853a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-ericsson-reports-fourth-quarter-and-full-year-results-2017.html", "country": "US", "domain_rank": 767, "title": "Ericsson Reports Fourth Quarter and Full Year Results 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T09:59:00.000+02:00", "replies_count": 0, "uuid": "a89505e8be022e774ff8cc3f85218457a03853a5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-ericsson-reports-fourth-quarter-and-full-year-results-2017.html", "ord_in_thread": 0, "title": "Ericsson Reports Fourth Quarter and Full Year Results 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "stockholm", "sentiment": "none"}, {"name": "mainland china", "sentiment": "none"}], "organizations": [{"name": "ericsson", "sentiment": "negative"}, {"name": "digital services", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "STOCKHOLM, Jan. 31, 2018 /PRNewswire/ --\nFOURTH QUARTER HIGHLIGHTS\nReported sales decreased by -12%. Sales adjusted for comparable units and currency declined by -7% YoY, partly due to lower LTE sales in Mainland China, as expected. As earlier communicated, write-down of assets was made in the quarter, with a final impact on the result of SEK -14.5 b. In addition, provisions and customer project adjustments amounted to SEK -3.2 b. and restructuring charges amounted to SEK -2.4 (-4.6) b. Gross margin was 21.0% (26.1%). Adjusted1) gross margin improved to 29.9% (29.4%) with improved gross margin in Networks, partly offset by lower gross margin in Digital Services. Networks gross margin was stable QoQ, supported by a higher share of software sales and increased hardware margins. The success of the 5G-ready portfolio continued with several new contract wins. Operating income was SEK -19.8 (-0.3) b. Adjusted1) operating income declined to SEK 0.4 (4.4) b. due to lower sales and higher operating expenses. Higher amortization than capitalization of development expenses and higher recognition than deferral of hardware costs had a negative impact of SEK -1.4 (0.8) b. Cash flow from operating activities was SEK 11.2 (19.4) b. Free cash flow 2) was SEK 10.1 (14.3) b.\nFULL-YEAR HIGHLIGHTS\nReported sales decreased by -10% with a decline in all segments. Sales adjusted for comparable units and currency declined by -10%. IPR licensing revenues amounted to SEK 7.9 (10.0) b. The baseline for current IPR licensing contract portfolio is approximately SEK 7 b. on an annual basis. Operating income declined to SEK -38.1 (6.3) b., mainly due to write-down of assets as well as provisions and customer project adjustments. Cash flow from operating activities was SEK 9.6 (14.0) b. Free cash flow2) amounted to SEK 5.1 (0.3) b. Net cash at year-end was SEK 34.7 (31.2) b. The Board of Directors will propose a dividend for 2017 of SEK 1.00 (1.00) per share to the AGM.\nREPORTED\nSEK b.\nQ4\n2017\nQ4\n2016\nYoY\nchange\nQ3\n2017\nQoQ\nchange\nFull-year 2017\nFull-year 2016\nNet sales\n57.2\n65.2\n-12%\n47.8\n20%\n201.3\n222.6\nSales growth adj. for comparable units and currency\n-\n-\n-7%\n-\n17%\n-10%\n-10%\nGross margin\n21.0%\n26.1%\n-\n25.4%\n-\n22.1%\n29.8%\nOperating income\n-19.8\n-0.3\n-\n-4.8\n-\n-38.1\n6.3\nOperating margin\n-34.5%\n-0.4%\n-\n-10.0%\n-\n-18.9%\n2.8%\nNet income\n-18.9\n-1.6\n-\n-4.3\n-\n-35.1\n1.9\nEPS diluted, SEK\n-5.68\n-0.48\n-\n-1.34\n-\n-10.61\n0.52\nEPS (non-IFRS), SEK 3)\n-1.19\n0.62\n-\n-0.55\n116%\n-3.99\n2.66\nCash flow from operating activities\n11.2\n19.4\n-43%\n0.0\n-\n9.6\n14.0\nNet cash, end of period\n34.7\n31.2\n11%\n24.1\n44%\n34.7\n31.2\nADJUSTED\nSEK b.\nQ4 2017 adjusted\nQ4 2016\nexcl. restr.\nYoY\nchange\nQ3 2017 adjusted\nQoQ\nchange\nNet sales adjusted for certain items affecting comparability in 2017\n57.3\n65.2\n-12%\n47.7\n20%\nGross margin excluding restructuring charges and adjusted for certain items affecting comparability in 2017\n29.9%\n29.4%\n-\n30.0%\n-\nOperating income excluding restructuring charges and adjusted for certain items affecting comparability in 2017\n0.4\n4.4\n-91%\n-\n-\nOperating margin excluding restructuring charges and adjusted for certain items affecting comparability in 2017\n0.7%\n6.7%\n-\n-0.1%\n-\n1) Adjusted: the numbers are adjusted for restructuring charges and for certain other items affecting comparability in 2017.\n2) Free cash flow: Cash flow from operating activities less net capital expenditures and other investments, see APMs at the end of the report.\n3) EPS diluted, excl. amortizations and write-downs of acquired intangible assets, and excluding restructuring charges.\nNon-IFRS financial measures are reconciled to the most directly reconcilable line items in the financial statements at the end of this report.\nComments from Börje Ekholm, President and CEO of Ericsson (NASDAQ: ERIC)\nDuring a challenging 2017, we have developed and started to execute on a focused strategy, strengthening our R&D while at the same time introducing robust measures to reduce cost and commercial risk. We have now laid the foundation for achieving our financial targets. The fourth quarter was in line with our overall expectation, with gradual improving performance in Networks and continued significant losses in Digital Services. The result is however far below our long-term ambition.\nIn the quarter, sales adjusted for comparable units and currency declined by -7% YoY. For 2018, the Radio Access Network (RAN) equipment market is expected to decline by -2%, compared with estimated -8% in 2017. The Chinese market is expected to continue to decline due to reduced LTE investments, while there is positive momentum in North America.\nWe further reduced commercial risks, resulting in provisions and adjustments relating to customer projects of SEK -3.2 b. in the quarter. As a consequence of our focused business strategy and as earlier communicated, we have impaired assets, impacting the result by SEK -14.5 b. in the quarter, without impacting cash flow. After concluding this review, we do not see a need for additional adjustments or write-downs.\nAdjusted for one-time items and restructuring charges the gross margin was 30% and the operating income was slightly positive in the quarter. When also excluding the negative effect from lower net capitalization of costs, the operating income was SEK 1.8 b.\nWe continued to execute on efficiency improvements with a net reduction of 10,000 employees and external workforce in the quarter. To date, the annual run-rate effect of cost savings is approximately SEK 6 b. compared with the target of SEK 10 b. for mid-2018. The impact on the results in the quarter is limited, but will be increasingly visible in the first half 2018.\nWe increased our focus on free cash flow during the year. Following good collections and inventory reductions, free cash flow in Q4 amounted to SEK 10.1 b. The more even distribution of the free cash flow over the year and the full-year number of SEK 5.1 b. mark a clear improvement over 2016. For the first time in five years, the full-year free cash flow exceeded the dividend payout. By raising new debt on favorable terms and extending the average maturity, we have further improved our resilience and financial flexibility.\nSegment Networks showed stable performance with the ramp-up of Ericsson Radio System (ERS), representing 71% of radio unit deliveries in the quarter, and efficiency gains in service delivery as key drivers. Networks adjusted gross margin increased to 36% (32%) YoY and the success of our 5G-ready portfolio continues. In the quarter, we made deliveries related to our market share gain in Mainland China and we signed several break-through contracts, including with Verizon and Deutsche Telekom. We have continued to increase our R&D efforts to safeguard a future leading portfolio and to significantly improve our gross margin.\nSegment Digital Services had another challenging quarter with significant losses, mainly due to higher costs in ongoing large transformation projects. As previously communicated, our turn-around plan builds on stability, profitability and growth – in that order. The initial focus has been on stabilizing both product roadmaps and challenging customer contracts. We have identified 45 critical or non-strategic customer contracts and the plan is to complete or exit approximately half of these contracts in 2018. The actions to improve profitability in Digital Services are expected to generate positive effects on gross margin in the second half of 2018.\nThe refocus of Managed Services to improve profitability is underway, with 23 out of the 42 under-performing contracts completed, resulting in an annualized profit improvement of SEK 0.5 b. As a result of these efforts, the underlying gross margin improved slightly QoQ. One-time effects and seasonality in operating expenses impacted operating income negatively.\nFor our Media Solutions portfolio, reported in segment Other, we have executed on a profit improvement program while continuing to invest in the product offering. This has significantly improved operating performance during the year, thereby improving our strategic flexibility as we have completed our strategic review of the business. We have evaluated various options including partnerships, divestments and continued in-house development, with the objective to maximize shareholder value.\nWe have decided to partner with One Equity Partners (OEP) to further develop the Media Solutions business through retaining a 49% ownership stake. This allows us to capture the upside of the business while at the same time taking active part in the expected consolidation of the industry.\nWe have decided to keep Red Bee Media (former Broadcast and Media Services) as the bids received did not reflect the value of the business. We will develop the business as an independent entity within Ericsson, building on the improved operations.\nThe Board will propose a dividend of SEK 1.00 per share to the AGM. The Board expresses confidence in the ongoing actions to improve profitability, and has the ambition to increase the dividend over time as the financial performance improves.\nThe focus during 2017 has been on reshaping overall strategy and on improving company structure and performance. 2017 was also the year when 5G went from vision to real business opportunities while we at the same time had good traction for our 4G portfolio. We are fully committed to our plans and our targets and expect to see tangible results of our turnaround in 2018.\nPlanning assumptions going forward\nMarket related\nIn line with previous estimate and that of an external source, the Radio Access Network (RAN) equipment market is estimated to decline by -2% for full-year 2018. The Chinese market is expected to continue to decline due to reduced LTE investments, while there is positive momentum in North America.\nCurrency exposure\nA weakening by 10% of USD to SEK would have a negative impact of approximately -5% on net sales and approximately -1 percentage point on operating margin. For historical rates, see www.ericsson.com/en/investors\nEricsson related\nFocusing the business and addressing low-performing operations are expected to reduce full-year sales by up to SEK 10 b. in 2019 compared with 2016. The baseline for current IPR licensing contract portfolio is approximately SEK 7 b. on an annual basis. The plan is to implement cost savings with an annual run-rate effect of at least SEK 10 b. by mid-2018 compared with the Q2 2017 annual run rate. Actions to improve profitability in Digital Services are expected to generate positive effects on gross margin in second half of 2018. To further strengthen technology leadership, R&D expenses will increase, primarily in Networks. Operating expenses typically vary between quarters due to seasonality. Restructuring charges for full-year 2018 are estimated to be SEK 5-7 b. Actual and estimated Impact from amortization and capitalization of development expenses and from recognition and deferral of hardware costs:\nSEK b.\nQ1 2017 Actual\nQ4 2017 Actual\nQ1 2018 Estimate\nFY 2017 Actual\nFY 2018 Estimate\nFY 2019\nEstimate\nCost of sales\n-0.5\n-0.8\n-0.3\n-2.6\n-1\nR&D expenses\n0.7\n-0.6\n-0.5\n-0.3\n-2\nTotal impact\n0.3\n-1.4\n-0.8\n-2.9\n-3\n-1 to -2\nNOTES TO EDITORS\nYou find the complete report with tables in the attached PDF or by following this link https://www.ericsson.com/assets/local/investors/documents/financial-reports-and-filings/interim-reports-archive/2017/12month17-en.pdf or on www.ericsson.com/investors\nThe company will hold a press briefing, which will also be available through a live webcast, starting at 09.00 CEST on January 31, 2018 at Ericsson Studio, Grönlandsgatan 8, Kista, Sweden.\nA conference call for analysts, investors and media will begin at 14.00 (CEST).\nLive webcast of the briefing and conference call details, as well as supporting slides, will be available at www.ericsson.com/press and www.ericsson.com/investors\nFor further information, please contact\nContact person\nPeter Nyquist, Head of Investor Relations\nPhone: +46-10-714-64-99\nE-mail: peter.nyquist@ericsson.com\nAdditional contacts\nHelena Norrman, Senior Vice President, Marketing and Communications\nPhone: +46-10-719-34-72\nE-mail: media.relations@ericsson.com\nInvestors\nÅsa Konnbjer,\nDirector, Investor Relations\nPhone: +46-10-713-39-28\nE-mail: asa.konnbjer@ericsson.com\nStefan Jelvin,\nDirector, Investor Relations\nPhone: +46-10-714-20-39\nE-mail: stefan.jelvin@ericsson.com\nRikard Tunedal,\nDirector, Investor Relations\nPhone: +46-10-714-54-00\nE-mail: rikard.tunedal@ericsson.com\nMedia\nOla Rembe,\nVice President, Head of External Communications\nPhone: +46-10-719-97-27\nE-mail: media.relations@ericsson.com\nCorporate Communications\nPhone: +46-10-719-69-92\nE-mail: media.relations@ericsson.com\nThis information is information that Telefonaktiebolaget LM Ericsson is obliged to make public pursuant to the EU Market Abuse Regulation. The information was submitted for publication, through the agency of the contact person set out above, at 07:30 CEST on January 31, 2018.\nThis information was brought to you by Cision http://news.cision.com\nhttp://news.cision.com/ericsson/r/ericsson-reports-fourth-quarter-and-full-year-results-2017,c2441459\nThe following files are available for download:\nhttp://mb.cision.com/Main/15448/2441459/784466.pdf\nEricsson fourth quarter and full year report 2017\nView original content: http://www.prnewswire.com/news-releases/ericsson-reports-fourth-quarter-and-full-year-results-2017-300590909.html\nSOURCE Ericsson", "external_links": ["http://news.cision.com/", "http://www.ericsson.com/en/investors", "http://www.prnewswire.com/news-releases/ericsson-reports-fourth-quarter-and-full-year-results-2017-300590909.html", "http://www.ericsson.com/press", "http://www.ericsson.com/investors", "http://mb.cision.com/Main/15448/2441459/784466.pdf", "https://www.ericsson.com/assets/local/investors/documents/financial-reports-and-filings/interim-reports-archive/2017/12month17-en.pdf", "http://news.cision.com/ericsson/r/ericsson-reports-fourth-quarter-and-full-year-results-2017,c2441459"], "published": "2018-01-31T09:59:00.000+02:00", "crawled": "2018-01-31T11:11:06.021+02:00", "highlightTitle": ""}