{"organizations": [], "uuid": "f430a74584d5c19da7711ce96e40acd1137cc88e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/31/104810440-GettyImages-848914620.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10001147/device/rss/rss.html", "section_title": "Business", "url": "https://www.cnbc.com/2018/01/02/workplace-harassment-fueled-by-messaging-collaboration-tools.html", "country": "US", "domain_rank": 767, "title": "Workplace harassment fueled by messaging, collaboration tools", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T17:30:00.000+02:00", "replies_count": 0, "uuid": "f430a74584d5c19da7711ce96e40acd1137cc88e"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/02/workplace-harassment-fueled-by-messaging-collaboration-tools.html", "ord_in_thread": 0, "title": "Workplace harassment fueled by messaging, collaboration tools", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "financial times", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Technology is fuelling a new wave of workplace sexual harassment, as social media provides intimate details of workers' personal lives and systems deployed by some companies allow would-be stalkers to track their colleagues' location in real time.\nThe role of new technologies in enabling workplace sexual harassment emerged in readers' responses to a Financial Times' investigation into inappropriate sexual behaviours in professional relationships. Many readers argued that the overall environment had improved in recent years, as companies took their responsibilities more seriously and individuals' attitudes changed.\nBut some highlighted a new threat.\nProfessional social networks such as Facebook 's Workplace and instant messaging service Slack have been embraced by big global companies who want to promote idea sharing and networking across time zones. Companies of all sizes have adopted applications including shared Outlook calendars in the name of efficiency.\n\"It's great to connect people across the world to form cross-border teams and share expertise,\" one financial services worker wrote to the FT. \"But, if some guy at the company is persistently trying to ask you out on a date, or pressuring you into sex, it means he has loads of tools to stalk you online, get tonnes of information about you, and find your whereabouts, which is really scary.\n\"And because all these systems are company mandatory, you can't block the guy, switch messenger off, or hide your profile from him. At least if you're harassed on Twitter or Facebook, you can block people or close your account,\" the reader wrote.\nA spokeswoman for Workplace — which keeps user accounts separate from personal Facebook pages — says that individuals cannot block colleagues but that companies administer their own portals and have the option of blocking or deactivating specific users.\nUnlike some other platforms, Workplace asks users to sign up to an \"acceptable use policy\" which prohibits creating content that is \"harmful\" or \"deceptive or defamatory\". The policy does not explicitly reference sexual harassment. The spokeswoman declined to say how or whether the policy is enforced.\nGmail's corporate email function allows users to block senders, but calendars cannot be hidden from company administrators. \"Protecting employees against workplace harassment should ultimately rest in the hands of the company's management, including HR,\" a spokesperson for Google says. \"That said, technology can play its part in the process\" of protecting employees.\nMicrosoft sets the default calendar settings on its Office software to private so individuals cannot see what their coworkers are doing. Microsoft says clients had not asked for additional controls or permissions. Slack, which does not have a blocking function on its platform, declined to comment.\nThe head of HR for a FTSE 250 company says his firm used Outlook for scheduling as well as several professional networking apps, and had \"no issues arising to date in respect of any of these platforms\".\n\"The benefits they bring in terms of collaboration are significant and underpin both productivity and innovation,\" he adds.\nAnother FT reader, also working in financial services, wrote that social media \"makes creeps worse . . . like when it's late at night and they try to direct message me on Instagram saying how hot I look or how they can't sleep. At the same time, I'm connected on Instagram to plenty of coworkers who, you know, don't send me weird messages and act like totally normal human beings.\"\nMore from The Financial Times: \nTencent denies storing users' WeChat conversations \nLeEco founder defies order to return to China \nMorgan Stanley enters robo-advice investment market \nMonica Parker, founder of workplace behavioural consultancy Hatch Analytics, warns that workers should exercise caution. \"Social networks do make us more likely to share aspects of our lives we might not share with colleagues, and those aspects can be used against us,\" she says.\nA woman working in Silicon Valley says she and her peers have employed a simple strategy: \"Many of us have simply stopped putting up anything on Instagram, period.\"\n\"One of my mentees, age 30, was so badly cyberstalked, I got her in touch with the local FBI field office in Chicago, which took her complaints quite seriously,\" she adds.\nSamantha Mangwana, a lawyer at Slater and Gordon, recalls social media being used against one of her clients who had made a complaint about sexual harassment.\nThe complaint \"became widely known and that resulted in her being hounded on Facebook,\" says Ms Mangwana. \"It's hard to express how difficult it is for someone when they're faced for the first time with such vitriol from such a high number of people who previously they considered their friends . . . That feeling of isolation and being shunned by everyone and actually being hated, is intense.\n\"In one case I later acted in, my client had attempted to commit suicide in order to end it all,\" she adds.\nThere is only one upside — if it can be called that — to high tech sexual harassment through social networks and messaging platforms. As Ms Parker puts it: \"It gives a great paper trail of the abuse should a person choose to report it\".", "external_links": [], "published": "2018-01-02T17:30:00.000+02:00", "crawled": "2018-01-02T18:50:53.012+02:00", "highlightTitle": ""}