{"organizations": [], "uuid": "5d7a3b098becfc1b569c875e5f86bb0314462313", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180120&t=2&i=1223677947&w=1200&r=LYNXMPEE0J0QH", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-championship/wolves-lead-cut-at-top-of-championship-after-surprise-defeat-idUKKBN1F910V", "country": "US", "domain_rank": 408, "title": "Wolves lead cut at top of Championship after surprise defeat", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T20:44:00.000+02:00", "replies_count": 0, "uuid": "5d7a3b098becfc1b569c875e5f86bb0314462313"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-championship/wolves-lead-cut-at-top-of-championship-after-surprise-defeat-idUKKBN1F910V", "ord_in_thread": 0, "title": "Wolves lead cut at top of Championship after surprise defeat", "locations": [], "entities": {"persons": [{"name": "kieran dowell", "sentiment": "none"}, {"name": "scott hogan", "sentiment": "none"}, {"name": "cameron jerome", "sentiment": "none"}, {"name": "aitor karanka", "sentiment": "none"}, {"name": "ben osborn", "sentiment": "none"}, {"name": "jerome", "sentiment": "none"}], "locations": [{"name": "england", "sentiment": "none"}, {"name": "derby county", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "wolverhampton wanderers", "sentiment": "none"}, {"name": "derby", "sentiment": "none"}, {"name": "aston villa", "sentiment": "none"}, {"name": "nottingham forest", "sentiment": "none"}, {"name": "barnsley", "sentiment": "none"}, {"name": "bristol city", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 49 PM / Updated 6 minutes ago Wolves lead cut at top of Championship after surprise defeat Reuters Staff 3   Wolverhampton Wanderers saw their lead at the top of England’s second tier Championship cut to nine points after they suffered a 2-0 loss at home to Nottingham Forest on Saturday -- their first league defeat since late October. \nFirst-half goals from Kieran Dowell and Ben Osborn were enough for Forest to pick up a first win in seven games, and give new boss Aitor Karanka his first victory since taking charge. \nSecond-placed Derby County will rue the fact they were held to a goalless draw by fellow promotion hopefuls Bristol City on Friday, missing the chance to cut Wolves’ lead yet further. \nDebutant Cameron Jerome thought he had earned Derby a golden chance to earn victory late on, but rather than winning a penalty, Jerome was cautioned for simulation by the referee. \nScott Hogan scored twice in three first-half minutes as Aston Villa beat Barnsley 3-1 to close the gap on Derby to three points. Soccer Football - Championship - Wolverhampton Wanderers vs Nottingham Forest - Molineux Stadium, Wolverhampton,   Nottingham Forest's Ben Osborn celebrates scoring their second goal with Danny Fox Action Images/Andrew Boyers \nHogan’s double was followed up by Dimitri Cavare’s goal for Barnsley, with Conor Hourihane adding a third for Villa against his former club. \nMillwall snatched a 4-3 victory over 10-man Leeds United after a quite incredible game at Elland Road. Soccer Football - Championship - Wolverhampton Wanderers vs Nottingham Forest - Molineux Stadium, Wolverhampton,   Nottingham Forest's Kieran Dowell in action with Wolves' Diogo Jose Teixeira Da Silva Action Images/Andrew Boyers \nAiden O‘Brien put the visitors ahead before home captain Liam Cooper was sent off, making it three red cards in as many games for the hosts. Lee Gregory then scored seemingly to put the game to bed, before Pierre-Michel Lasogga got Leeds back in it. \nKemar Roofe then scrambled an equaliser and Lasogga thought he had won it with a 25-metre effort. But Tom Elliott levelled three minutes from fulltime and Jed Wallace secured the win in stoppage time. \nSheffield United enjoyed a 2-1 triumph on the road at Norwich City. Manchester United loanee James Wilson opened the scoring and Clayton Donaldson added a second. Ivo Pinto replied but it was not enough. \nTony Pulis’s Middlesbrough won on the road at Queens Park Rangers thanks to goals from Daniel Ayala, George Friend and Adama Traore while Joel Asoro’s goal proved enough for struggling Sunderland as they pulled Hull City closer to trouble with a 1-0 win. Reporting by Peter Hall; Editing by Toby Davis", "external_links": [], "published": "2018-01-20T20:44:00.000+02:00", "crawled": "2018-01-20T21:02:46.017+02:00", "highlightTitle": ""}