{"organizations": [], "uuid": "35b8a5aa0d83b7d779be365f3180eb2def027b54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221126981&w=1200&r=LYNXMPEE0A0WH", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-china-politics/in-mass-address-chinas-xi-calls-for-total-party-loyalty-idUKKBN1F01KH", "country": "US", "domain_rank": 408, "title": "In mass address, China's Xi calls for total party loyalty", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T14:47:00.000+02:00", "replies_count": 0, "uuid": "35b8a5aa0d83b7d779be365f3180eb2def027b54"}, "author": "", "url": "https://uk.reuters.com/article/uk-china-politics/in-mass-address-chinas-xi-calls-for-total-party-loyalty-idUKKBN1F01KH", "ord_in_thread": 0, "title": "In mass address, China's Xi calls for total party loyalty", "locations": [], "entities": {"persons": [{"name": "xi jinping", "sentiment": "none"}, {"name": "reuters/jason lee  over", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "great hall of the people", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "cppcc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "communist party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 12:48 PM / Updated an hour ago In mass address, China's Xi calls for total party loyalty Reuters Staff 2 Min Read \nBEIJING (Reuters) - Chinese President Xi Jinping called on Thursday for out-and-out implementation of central party policy and the total loyalty of officials, the state broadcaster reported, in speech on discipline and corruption broadcast across the country. FILE PHOTO - China's President Xi Jinping arrives for the opening session of the Chinese People's Political Consultative Conference (CPPCC) at the Great Hall of the People in Beijing, China, March 3, 2017. REUTERS/Jason Lee \nOver five years in office, Xi has accrued more power than any of his immediate predecessors and has waged a war on graft in the ruling Communist Party. He has also intensified efforts to ensure cadres are disciplined, upright and honest. \nNevertheless, his latest call for unwavering discipline, delivered in a lengthy speech live-streamed to party officials around the country, was unusual in its bluntness. \n“When the party centre makes a policy decision, all party groups must put it into practice to the letter,” Xi said in the speech directed at the central party leadership, according to the CCTV state broadcaster. \n“At any time and in any situation, the party’s leading officials must stand firm and be trustworthy in their politics, be sincerely devoted to the party, be in one mind with the party centre,” he said. \nEfforts in party building are a “fundamental guarantee” of finally achieving the Chinese dream, Xi said, referring to an aspiration to restore a rejuvenated China to its full standing globally. \nOfficials who fail to carry out their political duty must be held accountable, Xi said. \nHe also re-iterated that there would be no let-up in efforts to tackle deep-rooted graft within the party. \n“As soon as a ‘tiger’ rears his head, we will strike at once; as soon as a ‘fly’ flies in disorder, we will swat,” he said, referring to high- and low-level officials. \nChina’s top corruption watchdog, the Central Commission for Discipline Inspection, said that 527,000 people were disciplined for graft in 2017, with 58 being high-level cadres, according to the official Xinhua news agency. Reporting by Christian Shepherd; Editing by Robert Birsel", "external_links": [], "published": "2018-01-11T14:47:00.000+02:00", "crawled": "2018-01-11T15:23:30.005+02:00", "highlightTitle": ""}