{"organizations": [], "uuid": "63117360ab27b25f7ad33d73891341ee66497c6f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-green-cures-botanical-distribution-inc-wishes-mr-tragesser-well-and-looks-forward-to-2018.html", "country": "US", "domain_rank": 767, "title": "Green Cures & Botanical Distribution, Inc. Wishes Mr. Tragesser Well and Looks Forward to 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T14:00:00.000+02:00", "replies_count": 0, "uuid": "63117360ab27b25f7ad33d73891341ee66497c6f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-green-cures-botanical-distribution-inc-wishes-mr-tragesser-well-and-looks-forward-to-2018.html", "ord_in_thread": 0, "title": "Green Cures & Botanical Distribution, Inc. Wishes Mr. Tragesser Well and Looks Forward to 2018", "locations": [], "entities": {"persons": [{"name": "tragesser", "sentiment": "negative"}, {"name": "pitsicalis", "sentiment": "none"}, {"name": "joe", "sentiment": "none"}, {"name": "joseph tragesser", "sentiment": "none"}, {"name": "william pitsicalis", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "ca", "sentiment": "none"}], "organizations": [{"name": "looks forward", "sentiment": "negative"}, {"name": "botanical distribution inc.", "sentiment": "negative"}, {"name": "green cures & botanical distribution, inc", "sentiment": "neutral"}, {"name": "green cures", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES, CA, Jan. 16, 2018 (GLOBE NEWSWIRE) -- - Green Cures and Botanical Distribution Inc. (OTC PINK: GRCU), an innovative hemp-infused nutrition, botanical, sports, and body care products company, as previously announced, Green Cures has appointed Mr. William Pitsicalis as the new Chief Executive Officer (CEO). Effective today, Mr. Joseph Tragesser has resigned as CEO, allowing Mr. Pitsicalis to begin leading the company moving forward.\n“Joe did great work, and we are very thankful for his tireless efforts in advancing the company towards cannabis and CBD-based objectives,” said the new CEO, Mr. William Pitsicalis, “We all wish you well in your future endeavors.”\nThe company’s management has been working on transitioning leadership and responsibilities for several weeks now, and in this time, Mr. Pitsicalis has developed a new strategy for 2018 with his team. In less than 90 days, the company will develop and launch a new blockchain technology platform to process payments in the cannabis space. In addition to this, the company will be releasing a new CBD-based product, which will be hitting shelves within 30 days.\nAs 2018 progresses, the company will continue its research and development initiatives to develop more exclusive product lines, which will be sold both online and in retail locations.\nMr. Pitsicalis added, “In any leadership transition, stakeholders wonder what it will mean for them. We are placing a strong emphasis on creating lasting shareholder value. Specifically, we are striving towards uplisting to the QB tier of the OTC Markets. This means we will become a more transparent company, with more up-to-date filings. At this time, we have no intention to reverse split our company’s stock. As we make progress towards our goal of uplisting, we will provide more updates.”\nAbout Green Cures & Botanical Distribution, Inc. (OTC PINK: GRCU)\nGreen Cures & Botanical Distribution Inc., is revenue-generating company that wholesales and retails hemp-infused nutritional, botanical, sports, and body care products. The company is currently Web-based and focuses on online retailing. Green Cures & Botanical Distribution Inc., operates a diverse portfolio of products and services within the botanical and cannabis industry, as permitted by law. From concept to production and distribution, Green Cures & Botanical Distribution Inc., is continuously creating and introducing products that promote a healthy life style. For more information visit: http://www.grcustock.com/.\nVisit us at Investors Hangout: https://investorshangout.com/Green-Cures--Botanical-Distribution-Inc-GRCU-67874/\nInvestors Hangout is the only authorized investors blog page for Green Cures & Botanical Distribution Inc.\nAbout Purple Haze Properties, LLC\nPurple Haze Properties, LLC was founded through a partnership between Andrew Pitsicalis and Leon Hendrix, blood brother to the legendary guitar icon. Purple Haze Properties, LLC is the premiere source\" for Jimi Hendrix Cannabis related products. Purple Haze Properties is a premiere celebrity licensing company for the Cannabis Industry. We represent, Cannabis Licensing for many celebrities including, Jimi Hendrix, Motorhead, Digital Underground, Peter Tosh, Anthrax, Charlo Greene, The Emperor of Hemp, Jack Herer, Baby Bash and others. Purple Haze Properties participates in all aspects of the cannabis industry including Licensing, Social, Medical, Music and Entertainment areas. Check us out at www.purplehazeproperties.com or www.facebook.com/purplehazeproperties . E-Mail purplehazeprop@gmail.com\nForward-Looking Statements Disclaimer:\nThis press release contains within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. In some cases, you can identify by the following words: \"anticipate,\" \"believe,\" \"continue,\" \"could,\" \"estimate,\" \"expect,\" \"intend,\" \"may,\" \"ongoing,\" \"plan,\" \"potential,\" \"predict,\" \"project,\" \"should,\" \"will,\" \"would,\" or the negative of these terms or other comparable terminology, although not all contain these words. are not a guarantee of future performance or results, and will not necessarily be accurate indications of the times at, or by, which such performance or results will be achieved. are based on information available at the time the statements are made and involve known and unknown risks, uncertainty and other factors that may cause our results, levels of activity, performance or achievements to be materially different from the information expressed or implied by the in this press release. This press release should be considered in light of all filings of the Company that are contained in the Edgar Archives of the Securities and Exchange Commission at www.sec.gov\nGRCU@i-businessmanagementllc.com\nSource:Green Cures & Botanical Distribution Inc.", "external_links": ["https://investorshangout.com/Green-Cures--Botanical-Distribution-Inc-GRCU-67874/", "https://www.globenewswire.com/Tracker?data=UoZb448K4RFgWWispIGq_8By1EvZH1piEdBLbaYENrLxsNyiw9MNKxZfPTv3B9mec6qWs0dlzKt-gQ8pUQbf0bPAYpeIQWy5puVuQX2whts=", "https://www.globenewswire.com/Tracker?data=A5-lNlPJSTjvb76NFc1y1NNvrX_KHA3aZBnO_DcVqSrsAa9nhDhmH1RhegL6_F9Tzc2WervXh3xRAviIomdT0Q==", "https://www.globenewswire.com/Tracker?data=JcnTgRQMxNoeCFrP3nqJt8LEuzHx1sUr6vPWa5cz-f_-bvn5IoyakhYyXwDlfXhHTMTtqyRxpSVqBbgW_6l3_1m9pLf8MTwsLUQFF4DV33Z51jyL8lrPktNkY99m7cjwa4Cl8beszTuUvv_kiAyaOA==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/5d830edf-9644-455b-9da3-5176c820e1e8", "http://www.grcustock.com/.", "https://www.globenewswire.com/Tracker?data=imPFNX7y0ZgHhomLFYtQOPPiK9pG0l3k55P_6EgjpGjq29aW4_X-EYvRQ_TkWN6YnolNf1UiqyWDg3lKKU5Dhs8hOJJMnCtBua6VTJ9c5b0C8KuU75hGCPdSTuNlmD_cgxnoAHAYYyA8D1sYPlJRV9mRwxCdQsWv_JPVsDLxi9LVoA5dAcUHw_klh-yyvPRTpLxBoRJhfrg9vkk3nawIZTOw1-wfeuE6uxBVsgRMcPCTtF9wr0MddVEo3mFs6usZ", "https://www.globenewswire.com/Tracker?data=kK10379DK8R3bmN9YwGxcoElt47RC5fcFrloxf3wygknJfN3dPRq8nLZOEMnCqc5MAFcHeEr4bprWtVHF75bGQ1r6M15z_uDdoqMrEaNLHQNK-1z4qGKchgNzNMYkn9B"], "published": "2018-01-16T14:00:00.000+02:00", "crawled": "2018-01-16T17:06:29.000+02:00", "highlightTitle": ""}