{"organizations": [], "uuid": "68593aa2715ea902f7ff41328ac2d785bf83bb63", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220427520&w=1200&r=LYNXMPEE0806B", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-samsung-elec-results-breakingviews/samsung-ends-a-stellar-year-on-worrisome-note-idUSKBN1EY0A0", "country": "US", "domain_rank": 408, "title": "Samsung ends a stellar year on worrisome note", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T11:28:00.000+02:00", "replies_count": 0, "uuid": "68593aa2715ea902f7ff41328ac2d785bf83bb63"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-samsung-elec-results-breakingviews/samsung-ends-a-stellar-year-on-worrisome-note-idUSKBN1EY0A0", "ord_in_thread": 0, "title": "Samsung ends a stellar year on worrisome note", "locations": [], "entities": {"persons": [], "locations": [{"name": "hong kong", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}], "organizations": [{"name": "samsung electronics", "sentiment": "negative"}, {"name": "samsung", "sentiment": "negative"}, {"name": "reuters breakingviews", "sentiment": "negative"}, {"name": "thomson reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HONG KONG (Reuters Breakingviews) - Samsung Electronics is ending its stellar year on a slightly worrisome note. Forecast quarterly sales and operating profit from South Korea’s $327 billion tech behemoth, while still strong, fell short of expectations. Falling memory chip prices are making investors anxious, and hint at a tougher 2018.\nOn Tuesday, the smartphone-to-chips maker said it expects fourth-quarter operating profit of 15.1 trillion won ($14 billion). That’s up a blistering 64 percent from a year earlier, and will probably set a new quarterly record for the South Korean group. But the figure comes 5 percent shy of what analysts polled by Thomson Reuters expected, and forecast sales disappointed too. By mid-morning Seoul time, shares of Samsung were down 2 percent, underperforming the benchmark KOSPI index.\nSamsung will disclose detailed results later in the month, but an appreciating currency and year-end bonuses probably weighed on performance. The impact of the former is particularly acute for a major exporter like Samsung. The won strengthened 12 percent against the dollar in 2017; on Monday, it touched a three-year high against the greenback.\nTo be sure, global dominance in memory chips has lifted the fortunes of the scandal-hit company: Samsung is on track for record full-year earnings in 2017, even as executives try to recover from a leadership crisis. Smartphones and data servers used for cloud computing and artificial intelligence all require more storage. A top Samsung executive recently boasted that 70 percent of the world’s data is produced and saved using the company’s products, according to South Korea’s Pulse News.\nYet warnings of a potential cyclical downturn are growing. Smartphone demand is cooling, and supply is expected to increase as competitors like SK Hynix and Western Digital catch up. Prices for so-called NAND flash memory chips, which Morgan Stanley analysts estimate account for over a fifth of 2017 operating profit at Samsung, have started to fall. On Nov. 27 they cut their recommendation on the company on concerns of falling prices, and sent Samsung’s shares down by 5 percent.\nEven before Tuesday’s disappointing results guidance, shares of Samsung were trading at just over 7 times forward earnings, well below their two-year average of 8.8 times, according to Eikon. Investors are bracing for more uncertainty.\nBreakingviews Reuters Breakingviews is the world's leading source of agenda-setting financial insight. As the Reuters brand for financial commentary, we dissect the big business and economic stories as they break around the world every day. A global team of about 30 correspondents in New York, London, Hong Kong and other major cities provides expert analysis in real time.\nSign up for a free trial of our full service at https://www.breakingviews.com/trial and follow us on Twitter @Breakingviews and at www.breakingviews.com . All opinions expressed are those of the authors.", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-09T11:28:00.000+02:00", "crawled": "2018-01-09T14:55:06.036+02:00", "highlightTitle": ""}