{"organizations": [], "uuid": "718320defb1da3944ec9fbf0e17b7da81a9d676c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 178, "shares": 178, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180120&t=2&i=1223530028&w=1200&r=LYNXMPEE0J040", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-tennis-ausopen-halep/tennis-halep-edges-davis-in-marathon-thriller-to-reach-fourth-round-idUSKBN1F905E", "country": "US", "domain_rank": 408, "title": "Tennis: Halep edges Davis in marathon thriller to reach fourth round", "performance_score": 1, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T06:47:00.000+02:00", "replies_count": 0, "uuid": "718320defb1da3944ec9fbf0e17b7da81a9d676c"}, "author": "", "url": "https://www.reuters.com/article/us-tennis-ausopen-halep/tennis-halep-edges-davis-in-marathon-thriller-to-reach-fourth-round-idUSKBN1F905E", "ord_in_thread": 0, "title": "Tennis: Halep edges Davis in marathon thriller to reach fourth round", "locations": [], "entities": {"persons": [{"name": "halep", "sentiment": "negative"}, {"name": "davis", "sentiment": "negative"}, {"name": "lauren davis", "sentiment": "none"}, {"name": "ashleigh barty", "sentiment": "none"}, {"name": "ian ransom", "sentiment": "none"}, {"name": "simona halep", "sentiment": "none"}, {"name": "naomi osaka", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "rod laver arena", "sentiment": "none"}, {"name": "melbourne park", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MELBOURNE (Reuters) - A courageous Simona Halep overcame three match points and throbbing ankle pain to edge out Lauren Davis 4-6 6-4 15-13 in a thrilling third round marathon at the Australian Open on Saturday.\nThe world number one fought back from the brink at 11-10 in the epic deciding set before finally serving out the contest on her fourth attempt after a taxing three hours and 44 minutes at Rod Laver Arena.\nShe sealed the win on her first match point when 76th-ranked Davis fired a forehand into the tramlines, as the hard-hitting American coughed up a mind-boggling 73rd unforced error.\nA shattered Halep declared herself “almost dead” in the wake of a 142-minute deciding set featuring more twists than the Transfagarasan mountain highway in her native Romania.\nIt was a win, said the French Open finalist, that might have slipped through her fingers in years past.\n”I think now I‘m much stronger (mentally),“ the 26-year-old told reporters. ”I was a little bit frustrated because of the leg. I felt the pain all match, but I didn’t give up.\n“I could resist like for every moment in the match. That makes me very happy, and I think the big win is that I could handle it.”\nWhile consistently haunting the women’s top five, a grand slam title has proven elusive for Halep, fanning doubts about her big match temperament.\nBut her brave effort against an inspired opponent can only help her self-belief for bigger tests to come.\nThe ankle remains a problem, though, and Halep said she would do precisely “nothing” on her rest day before a fourth round clash against home hope Ashleigh Barty or Japan’s Naomi Osaka.\n“After this match I think tomorrow (the ankle) is going to be worse, but I just push, push myself, and we will see what’s going to happen,” said Halep, a quarter-finalist at Melbourne Park in 2014 and 2015.\nTOENAIL FAIL The diminutive Davis, a baby-faced 24-year-old with a monster forehand, was majestic in defeat.\nShe broke Halep three times when the Romanian had served for the match and came within an whisker of the biggest win of her career.\nSwooping forward to pounce on a speculative drop-shot, she fired a pass by Halep to earn three match points at 11-10, but her victory push was hampered by jammed-up toenails.\n“Yeah, that first match point just, I felt something and I couldn’t really put any pressure -- it was my right toe, and then it eventually was my left toe, also,” she said.\nAs Davis struggled with her feet, Halep nervelessly saved all three match points for a galvanizing hold before Davis removed her footwear and walked gingerly to her chair.\nShe took a medical timeout that stalled Halep’s momentum and the Romanian stared balefully from the baseline while the trainer worked on Davis.\nRelated Coverage Factbox: Simona Halep versus Lauren Davis: match stats Halep moved in for the kill but the American saved five break points, and later thanked the net cord for helping her hold again at 12-12.\nHalep finally breached Davis’s serve to move 14-13 ahead and steeled herself to close it out.\nDictating terms to the American in a 17-shot rally, Halep held on for a well earned victory when Davis misfired twice in a desperate late flurry.\n“At 13-all when I took the game, I said ‘it’s my lucky number. So it’s going to be two in a row now’,” Halep said with a smile.\nEditing by Greg Stutchbury/John O'Brien\n ", "external_links": [], "published": "2018-01-20T06:47:00.000+02:00", "crawled": "2018-01-20T07:05:07.050+02:00", "highlightTitle": ""}