{"organizations": [], "uuid": "dcd12e9517424846dab605d88cd63b794c83b432", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-standard-lithium-acquires-lithium-brine-exploration-rights-in-productive-smackover-formation-in-arkansas.html", "country": "US", "domain_rank": 767, "title": "Standard Lithium Acquires Lithium Brine Exploration Rights in Productive Smackover Formation in Arkansas", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.35, "site_type": "news", "published": "2018-01-08T13:00:00.000+02:00", "replies_count": 0, "uuid": "dcd12e9517424846dab605d88cd63b794c83b432"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-standard-lithium-acquires-lithium-brine-exploration-rights-in-productive-smackover-formation-in-arkansas.html", "ord_in_thread": 0, "title": "Standard Lithium Acquires Lithium Brine Exploration Rights in Productive Smackover Formation in Arkansas", "locations": [], "entities": {"persons": [{"name": "robert mintak", "sentiment": "none"}], "locations": [{"name": "arkansas vancouver", "sentiment": "none"}, {"name": "british columbia", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "tetra", "sentiment": "none"}, {"name": "frankfurt", "sentiment": "none"}, {"name": "arkansas", "sentiment": "none"}], "organizations": [{"name": "standard lithium ltd.", "sentiment": "negative"}, {"name": "standard lithium acquires lithium brine exploration rights", "sentiment": "negative"}, {"name": "tetra technologies inc.", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "tetra", "sentiment": "none"}, {"name": "standard lithium", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VANCOUVER, British Columbia, Jan. 08, 2018 (GLOBE NEWSWIRE) -- Standard Lithium Ltd. (“Standard Lithium” or the “Company”) (TSXV:SLL) (OTCQX:STLHF) (FRANKFURT:S5L) is pleased to announce that the Company has signed an Option Agreement with TETRA Technologies Inc. (TETRA), a non-affiliated NYSE-listed company, to acquire the rights to conduct exploration, production and lithium extraction activities on up to 33,000 acres of brine leases located in an area where the Smackover Formation is known to be highly productive in southern Arkansas, USA.\nStandard Lithium’s Chief Executive Officer, Mr. Robert Mintak commented, “ In our search for opportunities of significance, this is one that could really move the needle. We believe the Smackover may be one of the lithium industry’s most promising regions to develop, given the potential resource size and large-scale brine-handling infrastructure in the region. This agreement highlights our excellent working relationship with TETRA, and signing this deal allows Standard Lithium access to the last available large lease package in the key brine production zone of the Smackover. ”\nProject Highlights:\nUp to 33,000 acres of brine leases in key brine production fairway in southern Arkansas, adjacent to producing Albemarle leases; Historical data from Standard Lithium lease area shows 370-424 mg/L lithium in brines (Moldovanyi and Walter, 1992); Arkansas currently produces the equivalent of 42.6 million m 3 (9,380,000,000 gallons) of brine per year (based on Arkansas Oil and Gas Commission reported average brine production from 2010-2016), almost entirely from the Smackover Formation; Low risk, well understood geology and chemistry; Significant infrastructure, roads, power, water, trained workforce in region; and Existing brine extraction, processing and re-injection permitting regime.\nPresident and Chief Operating Officer, Dr. Andy Robinson also commented, “ the Company chose the Smackover Formation as a key development target, precisely because it combines a very large resource potential, with well-studied and documented geology and hydrogeology, along with a permitting regime that has a long history of approving operations that remove, process and re-inject massive volumes of brine. Combined with a wealth of existing infrastructure in the project area (power, rail, gas, water, trained workforce, cheap reagents etc.), this makes Standard’s new opportunity in Southern Arkansas the perfect location to locate a modern lithium brine processing operation. Due to the wealth of already-available data from our new project area, we can start the process of compiling a maiden resource estimate for this large lease package extremely quickly, with a minimum of additional intrusive investigation. ”\nTransaction Terms\nUnder the terms of the Option Agreement with TETRA, the Company will be granted the rights in consideration for a series of cash payments, as well as certain ongoing royalties tied to lithium production from the properties. In consideration of the execution of the Option Agreement, the Company has made a non-refundable cash payment to TETRA of US$500,000, with further cash payments owing to TETRA as follows:\nUS$500,000 on or before the date that is thirty (30) calendar days following the Agreement Date; an additional US$600,000 on or before the date which is twelve (12) months following the Agreement Date; an additional US$700,000 on or before the date which is twenty-four (24) months following the Agreement Date; an additional US$750,000 on or before the date which is thirty-six (36) months following the Agreement Date; and an additional annual payment of US$1,000,000 on or before each annual anniversary of the Agreement Date, beginning with the date that is forty-eight (48) months following the Agreement Date, until the earlier of the expiration of the 10 year exploratory period or, if the Company exercises the Option, the Company begins payment of the Royalty.\nUpon commercial production, the Company will pay TETRA a two and one-half percent (2.5%) royalty on gross revenue derived from the sale of lithium produced from the properties, subject to a minimum annual royalty payment of US$1,000,000.\nQuality Assurance\nRaymond Spanjers, Certified Professional Geologist (SME No. 3041730), is a qualified person as defined by NI 43-101, and has supervised the preparation of the scientific and technical information that forms the basis for this news release. Mr. Spanjers is not independent of the Company as he is an officer in his role as Vice President, Exploration and Development.\nAbout Standard Lithium Ltd.\nStandard’s value creation strategy encompasses acquiring a diverse and highly prospective portfolio of large-scale domestic brine resources, led by an innovative and results-oriented management team with a strong focus on technical skills. The Company is currently focused on the immediate exploration and development of the Bristol Dry Lake Lithium Project located in the Mojave region of San Bernardino County, California; the location has significant infrastructure in-place, with easy road and rail access, abundant electricity and water sources, and is already permitted for extensive brine extraction and processing activities. The Company is also commencing resource evaluation on up to 33,000 acres of brine leases located in the Smackover Formation.\nStandard Lithium is listed on the TSX Venture under the trading symbol “SLL”; Quote: d on the OTCQX under the symbol “STLHF”; and on the Frankfurt Stock Exchange under the symbol “S5L”. Please visit the Company’s website at www.standardlithium.com .\nOn behalf of the Board,\nStandard Lithium Ltd.\nRobert Mintak, CEO & Director\nNeither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.\nThis news release may contain certain “Forward-Looking Statements” within the meaning of the United States Private Securities Litigation Reform Act of 1995 and applicable Canadian securities laws. When used in this news release, the words “anticipate”, “believe”, “estimate”, “expect”, “target, “plan”, “forecast”, “may”, “schedule” and other similar words or expressions identify forward-looking statements or information. These forward-looking statements or information may relate to future prices of commodities, accuracy of mineral or resource exploration activity, reserves or resources, regulatory or government requirements or approvals, the reliability of third party information, continued access to mineral properties or infrastructure, fluctuations in the market for lithium and its derivatives, changes in exploration costs and government regulation in Canada and the United States, and other factors or information. Such statements represent the Company’s current views with respect to future events and are necessarily based upon a number of assumptions and estimates that, while considered reasonable by the Company, are in", "external_links": ["https://www.globenewswire.com/Tracker?data=iSfnBZJXF4r1ImP9ChlCX0kdRREAHfRFcENkLPpK-L5Fi5Hdf-afsPotHeUJKOux36E_ooYdmY75noeGjI-qHNPN8NeFpq6wcO_JrZHDb2A="], "published": "2018-01-08T13:00:00.000+02:00", "crawled": "2018-01-08T15:15:57.012+02:00", "highlightTitle": ""}