{"organizations": [], "uuid": "026c2c1b5ed21736facd77383de706db8b050208", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180120&t=2&i=1223615300&w=1200&r=LYNXMPEE0J0ET", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-mideast-crisis-iraq-politics/iraqi-parliament-postpones-vote-on-election-date-idUSKBN1F90JA", "country": "US", "domain_rank": 408, "title": "Iraqi parliament postpones vote on election date", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T14:45:00.000+02:00", "replies_count": 0, "uuid": "026c2c1b5ed21736facd77383de706db8b050208"}, "author": "", "url": "https://www.reuters.com/article/us-mideast-crisis-iraq-politics/iraqi-parliament-postpones-vote-on-election-date-idUSKBN1F90JA", "ord_in_thread": 0, "title": "Iraqi parliament postpones vote on election date", "locations": [], "entities": {"persons": [{"name": "abadi", "sentiment": "none"}, {"name": "salim al-jabouri", "sentiment": "none"}], "locations": [{"name": "baghdad", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "washingto", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "negative"}, {"name": "u.s. embassy", "sentiment": "none"}, {"name": "islamic state", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BAGHDAD (Reuters) - Iraq’s parliament failed on Saturday to approve May 12 as the election date, as suggested by the government, as Sunni and Kurdish lawmakers demanded a delay to allow hundreds of thousands of war-displaced people to return home.\nShi‘ite politicians, including Prime Minister Haider al-Abadi, insist on holding the election as planned on May 12, saying a delay would be against the constitution.\nSpeaking after Saturday’s session in Baghdad, Parliamentary Speaker Salim al-Jabouri, a Sunni, expressed hope that parliament would be able to vote on an election date by Monday, state TV reported.\nAbadi is seeking re-election, building on a surge in his popularity among Iraq’s majority Shi‘ite Arab community after leading the three-year fight against Islamic State militants, supported by a U.S.-led coalition.\n“Postponing the elections would set a dangerous precedent, undermining the constitution and damaging Iraq’s long-term democratic development,” the U.S. Embassy in Baghdad said in a statement on Thursday.\nWashington had shown understanding for Abadi’s move in October to dislodge Kurdish fighters from the oil rich northern region of Kirkuk, even though the Kurds are traditional allies of the United States.\nTens of thousands of Kurds were displaced as a result of the takeover of the ethnically mixed areas of Kirkuk and its surroundings by Iraqi forces supported by Iranian-backed paramilitary groups.\nThe United Nations estimates the total number of people who remain displaced in Iraq at 2.6 million, mostly Sunni Arabs from areas previously controlled by Islamic State.\nThe role of prime minister is reserved for the Shi‘ite Arabs under a power-sharing system set up after the 2003 U.S-led invasion that toppled Saddam Hussein, a Sunni Arab.\nThe largely ceremonial office of president is reserved for a Kurdish member of parliament, while the speaker of parliament is drawn from among Sunni Arab MPs.\nReporting by Maher Chmaytelli; Editing by Janet Lawrence\n ", "external_links": [], "published": "2018-01-20T14:45:00.000+02:00", "crawled": "2018-01-20T14:55:40.064+02:00", "highlightTitle": ""}