{"organizations": [], "uuid": "b585bc40101d67beb820ebbde594b3766fac87ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 5}, "vk": {"shares": 0}, "linkedin": {"shares": 1284}, "facebook": {"likes": 958, "shares": 958, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XF753_WORKFA_SOC_20180130131449.jpg", "site_section": "http://www.wsj.com/xml/rss/3_7201.xml", "section_title": "WSJ.com: Lifestyle", "url": "https://www.wsj.com/articles/the-mistakes-you-make-in-a-meetings-first-milliseconds-1517322312", "country": "US", "domain_rank": 387, "title": "The Mistakes You Make in a Meeting’s First Milliseconds", "performance_score": 9, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T16:25:00.000+02:00", "replies_count": 0, "uuid": "b585bc40101d67beb820ebbde594b3766fac87ad"}, "author": "Sue Shellenbarger", "url": "https://www.wsj.com/articles/the-mistakes-you-make-in-a-meetings-first-milliseconds-1517322312", "ord_in_thread": 0, "title": "The Mistakes You Make in a Meeting’s First Milliseconds", "locations": [], "entities": {"persons": [{"name": "hilary blair", "sentiment": "negative"}, {"name": "blair", "sentiment": "none"}, {"name": "alexander todorov", "sentiment": "none"}], "locations": [{"name": "denver", "sentiment": "none"}], "organizations": [{"name": "boeing", "sentiment": "none"}, {"name": "articulate real & clear", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "117 COMMENTS Hilary Blair has acted professionally and served as chief executive of her own communications-coaching company for the past seven years. She oversees a staff of 13 and counts Staples and Boeing among her clients. She says her success comes despite the first impression she makes on some people, not because of it.\n“I remind everyone of their second-grade teacher,” says Ms. Blair, chief executive of Articulate Real & Clear in Denver. “And if they didn’t like their second-grade teacher, I’m in trouble.”\nA growing body of research shows the snap judgments people make about others’ trustworthiness are wrong more often than most people think . These first impressions are formed in milliseconds , based on instinctive responses in the brain’s emotion-processing center, the amygdala.\nSome people conclude a stranger is reliable because he or she looks like someone trustworthy the person already knows, says Alexander Todorov, a leading researcher and author of a 2017 book on the topic, “Face Value: The Irresistible Influence of First Impressions.” Or they make judgments based on stereotypes, such as an unconscious belief that older or more feminine-looking people are more trustworthy , he says.\nThis poses a challenge to anyone who must gain others’ trust to perform well in meetings, interviews or other gatherings.\nHold your hands free and relaxed at your sides, without fidgeting. Illustration: MARK MATCHO There are ways to head off other people’s shaky snap judgments, by being mindful of how they might see you. Some visual cues are beyond a person’s control. Faces with a wider distance between the eyes and eyebrows are seen as more trustworthy, research shows.\nBut people who use and teach these skills, including actors and courtroom trial strategists, say you can control other visual cues. A happy expression, with the corners of the mouth turned upward and eyebrows relaxed, is likely to inspire trust , research shows. People teamed in an investment game with online partners whose facial images appeared friendly and reliable entrusted their partners with 42% more money than those whose partners looked downbeat and threatening, says a 2012 study by British and U.S. researchers.\nFacial expressions are important even when you think no one is looking. People tend to distrust others whose “dominant face,” or habitual expression, is grumpy, disapproving or angry, says Judson Vaughn, an impression-management consultant. And suddenly switching that downbeat expression to a 1,000-watt smile, just because someone is looking, is likely to undermine trust even more, he says.\nMr. Vaughn, a former character actor , says casting directors’ snap judgments about him, based on fleeting first impressions in the audition room, used to cost him roles he wanted in TV and film years ago.\nHe began adapting his facial expression, body language and stance the moment he entered the room to suit the role he wanted. Mr. Vaughn landed more roles as a trustworthy good guy by wearing a pleasant expression that warmed to a smile when he faced the director, shoulders erect, at a respectful distance. Mr. Vaughn, chief executive of First Impressions HQ in Atlanta, also won more bad-guy roles by making sure the director’s first impression was of a shifty character—by hunching his shoulders, wearing a hostile expression and eyeing the director askance.\nLisa Peers, an actor and workplace-communications coach, advises clients to prepare themselves mentally to impress new acquaintances by pausing for a few moments beforehand to think about what they want to accomplish with the other person.\nMumbling could be read as untrustworthy behavior. Illustration: MARK MATCHO She recommends using breathing techniques to foster relaxed, confident movement, and striving for “symmetry in your stance, with your shoulders straight and even. That first entrance in the room is the same as that first entrance of your character on stage,” says Ms. Peers, chief executive of Peers & Players, a workplace-communication training firm in San Francisco.\nWhen Ms. Blair greets a new acquaintance, she avoids sending mixed messages. She stands with her hands relaxed and visible at her side, rather than hidden in her pockets or crossed defensively in front of her. This suggests that your warm greeting is genuine and you have no secret agenda or need to protect yourself, she says.\nMr. Vaughn also advises adjusting your stance and posture, leaning or turning toward the other person to show you’re focused intently on what he or she is thinking and feeling. Rather than extending your arm stiffly to shake hands at a distance, relax your arm and lower your elbow to your side, drawing the other person closer to you, he says. “This shows you’ve made a subconscious decision to trust the person, without having spoken a word,” he says.\nStephen Colavito used Mr. Vaughn’s techniques in an arbitration case against a former employer years ago. He consciously maintained a confident, positive facial expression throughout the proceedings, even when the opposing attorney asked tough questions, or other participants said things he didn’t agree with. Mr. Colavito also turned in his seat when testifying to face the person he most wanted to engage—the arbitrator—leaning toward him and speaking in a focused, positive way. He won the case.\nHe still uses the techniques as a portfolio manager for an Atlanta asset-management firm. He never reaches across a table to shake hands when meeting new clients, but walks around it to greet them face-to-face and offer a relaxed, warm handshake, elbow at his side. He’s also mindful of his posture, keeping his shoulders square and making eye contact to convey confidence, he says. “These little nuances are important. They can help create a deeper bond.”\nGain Trust Without Saying a Word To increase the chances that a stranger will see you as a potential ally:\nAvoid hunching over to stare into your phone before meeting others. Keep your elbow at your side when shaking hands, drawing the other person closer than arm’s length. Lean forward and focus intently on the other person when he or she is speaking. Stand erect with shoulders squared, balancing your weight evenly. Smile in response to what others say or do, rather than grinning nonstop. Remain mindful of what others are thinking and feeling. Write to Sue Shellenbarger at sue.shellenbarger@wsj.com\nMore From Work & Family\nBusiness Cards Aren’t Dead, They’re Just Getting Weirder January 23, 2018 How Tech Executives Monitor Their Teens on Social Media January 16, 2018 Even If Your New Job Is a Bad Fit, Don’t Quit January 2, 2018 When Your Child Won’t Hug the Relatives December 26, 2017 Sexual-Harassment Training Gets a Revamp December 19, 2017", "external_links": [], "published": "2018-01-30T16:25:00.000+02:00", "crawled": "2018-01-31T00:44:11.008+02:00", "highlightTitle": ""}