{"organizations": [], "uuid": "c59ca8c29627ceba575365183ef87237a0f9d7d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-vix-acquires-womensforum-com.html", "country": "US", "domain_rank": 767, "title": "VIX Acquires WomensForum.com", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.59, "site_type": "news", "published": "2018-01-31T20:30:00.000+02:00", "replies_count": 0, "uuid": "c59ca8c29627ceba575365183ef87237a0f9d7d9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-vix-acquires-womensforum-com.html", "ord_in_thread": 0, "title": "VIX Acquires WomensForum.com", "locations": [], "entities": {"persons": [{"name": "nielsen", "sentiment": "none"}], "locations": [{"name": "miami", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MIAMI, Jan. 31, 2018 (GLOBE NEWSWIRE) -- VIX, a leading multicultural digital media company today announced it has purchased WomensForum.com , an online women’s lifestyle space, and a leader in driving measurable consumer actions through its custom content and shopping influencers. Through this transaction, VIX will acquire the media assets, direct sales and content teams who will help expand their reach to audiences worldwide, and further their commitment to innovating branded content and marketing opportunities in the future.\nKnown for its largely female readership and shopper influencer network, WomensForum will retain its brand, while leveraging VIX’s social video and distribution capabilities. Most recently, VIX announced that women make up 62% of their audience and the site’s highest engagement comes from Millennial females, a coveted demographic among consumer brands. According to Nielsen’s Digital Content Ratings, VIX reaches over 40% of adult women between 18 and 49 in the U.S., attracting viewers to the brand’s English and Spanish language content.\n“We’ve always focused on creating quality content, and the audiences that are inspired and impacted by that content,” said Rafael Urbina-Quintero, Chairman & CEO of VIX. “From a business and content perspective, WomensForum encompasses our vision of a thriving publisher model - engaging with naturally inquisitive audiences and connecting them to relevant material that piques their interests. We’re looking forward to leveraging our assets and extending our suite of partners.”\nWomensForum.com has long been a leader in driving measurable consumer actions through its custom content and shopping influencers. As a new addition to the VIX portfolio, WomensForum.com’s appeal to women and moms of all ages will help further efforts to progress content strategies for clients. This comes as a recent data from the US Census Bureau indicates that one in five moms is a millennial, and they now account for almost 90 percent of the 1.5 million new mothers within the last year. This combination helps deepen VIX’s audience across multiple life stages and daily touchpoints and enables measurable shopping and consumer actions to drive return on ad spend (ROAS) for its marketing partners.\n“From advertisers and consumer audiences, VIX has the growing reputation of helping today’s key brands build and tell their stories to multifaceted communities around the globe,” said Mark Kaufman, CEO at WomensForum.com . “This is an organic and mutually beneficial collaboration and we’re excited to take our working relationship with VIX to the next level.”\nVIX is headquartered in Miami with offices in New York, Mexico City, Montevideo, Buenos Aires, and Sao Paulo. For more information, please visit www.vix.com .\nAbout VIX\nVIX is a digital media company that creates positively curious content in order to entertain and add value to the life of millions of millennials every day. VIX publishes content across VIX.com and a variety of platforms such as Facebook, Instagram, Twitter and YouTube. With over 80 million social followers, VIX reaches 75 million users on its web property, and hundreds of millions of people globally across social platforms. Currently, VIX delivers over 1.6 billion monthly video views. VIX is headquartered in Miami, with offices in New York, Mexico City, Montevideo, Buenos Aires, and Sao Paulo.\nMEDIA CONTACT :\nFor VIX\nMichael Tilus\nmichael@broadsheetcomms.com\nSource: VIX", "external_links": ["https://www.globenewswire.com/Tracker?data=gUGqMGFJpoGtq0sd2OHnuT89kyQ-hD1YLI9FIizirukgEEaz02b9KEtzjGTsR_pQ"], "published": "2018-01-31T20:30:00.000+02:00", "crawled": "2018-01-31T22:53:16.000+02:00", "highlightTitle": ""}