{"organizations": [], "uuid": "6fa785bb69ecfbd616fff3c7c4c49a4000e51663", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/12/104944174-GettyImages-801311344.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10000108/device/rss/rss.html", "section_title": "Health Care", "url": "https://www.cnbc.com/2018/01/12/heres-what-people-talked-about-at-jp-morgans-health-care-conference.html", "country": "US", "domain_rank": 767, "title": "Here's what people talked about at JP Morgan's health-care conference", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T23:48:00.000+02:00", "replies_count": 0, "uuid": "6fa785bb69ecfbd616fff3c7c4c49a4000e51663"}, "author": "Angelica LaVito", "url": "https://www.cnbc.com/2018/01/12/heres-what-people-talked-about-at-jp-morgans-health-care-conference.html", "ord_in_thread": 0, "title": "Here's what people talked about at JP Morgan's health-care conference", "locations": [], "entities": {"persons": [{"name": "alex gorsky", "sentiment": "none"}], "locations": [{"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "jp morgan", "sentiment": "neutral"}, {"name": "j.p. morgan healthcare conference", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "trump administration", "sentiment": "none"}, {"name": "johnson & johnson", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The biggest health-care investing conference of the year has come to an end, but the ideas discussed will continue to play out this year.\nHere are some themes from the J.P. Morgan Healthcare Conference :\nThe digital revolution How tech will affect the health industry remains a question mark.\nDigital upstarts are developing new technologies to measure and treat patients. Giants like Amazon are considering getting into the mix.\nshow chapters Johnson & Johnson CEO: We should all be acting like Amazon's getting into our business 11:14 AM ET Tue, 9 Jan 2018 | 03:24 Johnson & Johnson CEO Alex Gorsky said companies across the medical spectrum need to act like Amazon's going to disrupt them.\n\"Because frankly, we have to create a crisis,\" he told CNBC on Tuesday. \"We have to make sure we're always competitive, we're always thinking about how can we be more effective, how can we be more efficient. And so we're thinking that way across all of our different businesses.\"\nshow chapters Merck CEO: We continue to work with Trump Administration to try and do what's good for patients 5:48 PM ET Mon, 8 Jan 2018 | 04:26 He and Merck CEO Ken Frazier both said they would welcome Amazon into the pharmacy supply chain business . Gorsky said he would support Amazon's entry if it meant more transparency around costs.\n\"If that's a more efficient way of getting drugs to patients, we would be in favor of it,\" Frazier told CNBC on Monday.\nTaxes, taxes, taxes Analysts have predicted the new tax law would spur a buying spree , but discipline was a theme echoed throughout the rooms of the Westin St. Francis in San Francisco.\nThe new law will make it cheaper for multinational corporations to bring back their overseas cash, though they will still have to pay a one-time tax on the money. Some companies divulged what that cost would be.\nMany praised the changes but said just because they can access cash doesn't mean they'll change their capital allocation strategy, which includes mergers and acquisitions when appropriate.\nStill, some observers see opportunity for a few major deals this year, especially in wake of CVS ' plans to purchase Aetna .\nMedical device makers braced themselves for the return of a 2.3 percent sales tax. They had received a reprieve for the past few years, but that ended at the turn of the new year.\nThe first payment is due at the end of the month unless Congress acts beforehand. If legislation isn't passed before then, a retroactive measure could come later.\nPricing the future Some companies expressed support for getting paid based on whether their treatments work, a system known as outcomes-based pricing.\nSpark Therapeutics brought the concept into the spotlight earlier this month when it announced its Luxturna gene therapy would cost $850,000. It proposed tying payments to how effective the drug was and using a sort of payment plan.\nMedtronic CEO Omar Ishrak said there's no doubt in his mind getting paid for a drug's effectiveness is the right thing to do and the industry will eventually get there.\nEven though some executives philosophically believe in the system, there are still hurdles to overcome, such as how to establish and measure effectiveness.", "external_links": [], "published": "2018-01-12T23:48:00.000+02:00", "crawled": "2018-01-13T03:49:47.017+02:00", "highlightTitle": ""}