{"organizations": [], "uuid": "3d9ac4f4902f1becba936d2c190363ede73d0812", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-hologic-announces-offering-of-1-billion-of-senior-notes.html", "country": "US", "domain_rank": 767, "title": "Hologic Announces Offering of $1 Billion of Senior Notes", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T15:54:00.000+02:00", "replies_count": 0, "uuid": "3d9ac4f4902f1becba936d2c190363ede73d0812"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-hologic-announces-offering-of-1-billion-of-senior-notes.html", "ord_in_thread": 0, "title": "Hologic Announces Offering of $1 Billion of Senior Notes", "locations": [], "entities": {"persons": [], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "marlborough", "sentiment": "none"}], "organizations": [{"name": "hologic", "sentiment": "negative"}, {"name": "hologic, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MARLBOROUGH, Mass., Jan. 16, 2018 /PRNewswire/ -- Hologic, Inc. (Nasdaq: HOLX) announced today that it has launched, subject to market and other conditions, a private offering of $1 billion in aggregate principal amount of senior notes, to be allocated between additional 4.375% senior notes due 2025 and new senior notes due 2028.\nThe additional 2025 notes will be issued under the indenture dated October 10, 2017 that governs Hologic's 4.375% senior notes due 2025. The new 2028 notes will be issued pursuant to a new indenture to be executed as of the closing of the offering. The additional 2025 notes and the new 2028 notes will be unsecured obligations of the Company and will be guaranteed by certain subsidiaries. Hologic intends to use the proceeds of the offering and available cash, including funds from its secured revolving credit facility, to redeem its outstanding 5.25% senior notes due 2022 in the aggregate original principal amount of $1.0 billion.\nThe additional 2025 notes and the new 2028 notes will not be registered under the Securities Act of 1933, as amended, or any state securities laws. Unless so registered, the securities may not be offered or sold in the United States except pursuant to an exemption from, or in a transaction not subject to, the registration requirements of the Securities Act and applicable state securities law. The additional 2025 notes and the new 2028 notes are being offered only to qualified institutional buyers in reliance on Rule 144A under the Securities Act, and outside the United States in accordance with Regulation S under the Securities Act.\nHologic will redeem all outstanding 2022 notes on or about February 15, 2018 (30 days following the commencement of this offering), subject to the completion of this offering and the receipt of proceeds from the offering, for an aggregate redemption price equal to the principal amount of the outstanding 2022 notes, plus the applicable premium and accrued and unpaid interest through the day immediately preceding the redemption date.\nThis press release is neither an offer to sell nor a solicitation of an offer to buy any of these securities, nor shall there be any offer, solicitation or sale of these securities in any jurisdiction where the offer, solicitation or sale is not permitted. This press release shall not constitute a notice of redemption with respect to the 5.25% senior notes due 2022.\nAbout Hologic, Inc.\nHologic, Inc. is an innovative medical technology company primarily focused on improving women's health and well-being through early detection and treatment. For more information on Hologic, visit www.hologic.com .\nHologic, The Science of Sure, and associated logos are trademarks and/or registered trademarks of Hologic, Inc. and/or its subsidiaries in the United States and/or other countries.\nForward-Looking Statements\nThis news release contains forward-looking information that involves risks and uncertainties, including statements about the Company's plans, objectives, expectations and intentions. Such statements include, without limitation, the Company's intention to issue the additional 2025 notes and the new 2028 notes and the use of proceeds of the offering, including the Company's plans to redeem its outstanding 5.25% senior notes due 2022. These forward-looking statements are subject to known and unknown risks and uncertainties that could cause actual results to differ materially from those expressed or implied by such statements. The offering may also be adversely affected by prevailing credit markets, which have been subject to significant volatility, or adverse changes to Hologic's business or prospects. Hologic cannot assure it will complete the issuance of the additional 2025 notes and the new 2028 notes on favorable terms, if at all. In addition, Hologic's decision to redeem its outstanding 5.25% senior notes due 2022 shall be contingent on the completion of this offering and the receipt of its proceeds. The risks included above are not exhaustive. Other factors that could adversely affect the Company's business and prospects are described in the filings made by Hologic with the SEC. Hologic expressly disclaims any obligation or undertaking to release publicly any updates or revisions to any such statements presented herein to reflect any change in expectations or any change in events, conditions or circumstances on which any such statements are based.\nContact\nMichael Watts\nVice President, Investor Relations and\nCorporate Communications\n(858) 410-8588\nView original content: http://www.prnewswire.com/news-releases/hologic-announces-offering-of-1-billion-of-senior-notes-300583080.html\nSOURCE Hologic, Inc.", "external_links": ["http://www.hologic.com/", "http://www.prnewswire.com/news-releases/hologic-announces-offering-of-1-billion-of-senior-notes-300583080.html"], "published": "2018-01-16T15:54:00.000+02:00", "crawled": "2018-01-16T16:27:49.000+02:00", "highlightTitle": ""}