{"organizations": [], "uuid": "81b839d7801f67ca03782e887f8d5c7bc6aa3376", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-WW554_39XzX_TOP_20180107142411.jpg", "site_section": "https://www.wsj.com/news/business", "section_title": "Business &amp; Finance News - Wall Street Journal", "url": "https://www.wsj.com/articles/large-deals-set-record-pace-in-january-1516795599", "country": "US", "domain_rank": 387, "title": "Large Deals Set Record Pace in January", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T15:06:00.000+02:00", "replies_count": 0, "uuid": "81b839d7801f67ca03782e887f8d5c7bc6aa3376"}, "author": "Ezequiel Minaya", "url": "https://www.wsj.com/articles/large-deals-set-record-pace-in-january-1516795599", "ord_in_thread": 0, "title": "Large Deals Set Record Pace in January", "locations": [], "entities": {"persons": [{"name": "dealogic", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Global dealmakers set a blistering pace for larger transactions during the first three weeks of 2018, free of the uncertainty surrounding U.S. tax policy that plagued deal talks last year.\nThere have been 11 deals above the $5 billion threshold announced as of Jan. 23, ahead of the previous record-setting pace of seven such transactions disclosed during the same period of 2017, Dealogic said. The value of all announced deals during the period totaled $207 billion, the highest amount since the same period of Jan. 2000, according to Dealogic data.\nThe brisk dealmaking comes as the recent tax overhaul in the U.S. promises to boost corporate coffers. Executives are also more upbeat on the prospect of both U.S. and global economic growth in 2018, stoking the hunger for mergers and acquisitions.\nRevamped tax policy in the U.S. is only one of a number of considerations companies will weigh when assessing a deal. It is far too early in the year to declare that merger and acquisition activity will maintain its torrid pace. Several analysts and business leaders agreed that new U.S. tax policy will help nudge deals already in the works over the finish line and make the hunt for new acquisitions more attractive.\n“January is only the beginning of what we see as a very robust 2018,” said Curt Moldenhauer, a partner at PricewaterhouseCoopers LLP’s deals practice. “Certainly with tax reform being announced, a big piece of the puzzle was solved.”\nOn Monday, French drugmaker Sanofi SA said it would buy U.S.-based hemophilia drugmaker Bioverativ Inc. for over $11.5 billion. Fellow pharmaceutical company Celgene Corp. agreed to acquire Juno Therapeutics Inc. for about $9 billion. And insurer American International Group Inc. said it would buy Bermuda-based insurer and reinsurer Validus Holdings Ltd. in an all-cash deal for $5.56 billion.\nEarlier this month, Celgene announced it was buying Impact Biomedicines Inc. for around $7 billion. Other large January deals include Dominion Energy Inc.’s $7.71 billion bid for Scana Corp. and the $7.34 billion overture from Hunt Companies Inc. for Five Oaks Investment Corp.\nCelgene executives, speaking on a conference call on Monday, said the Juno addition would strengthen the company’s developmental pipeline. And given the right opportunity, the company was not done searching for sizable deals, they said.\n“Obviously with tax reform and with the strong operating cash flows of the company ... we do have a very strong balance sheet and very strong capacity,” said Peter Kellogg, finance chief of Celgene. “This transaction in no way slows us down,” he added.\nDealmaking was still brisk last year, just on the more modest end of the scale. While the number of global deals was up 3.7% in 2017 compared to the previous year, volume slipped 3% to $3.57 trillion, Dealogic said.\nThe new corporate tax rate—reduced to 21% from 35%—lowers the cost to operate in the U.S. and makes it more attractive for both domestic and international firms to expand their footprint in the country.\nSanofi CFO Jérôme Contamine said the company would benefit from “the new tax environment in the U.S.” as part of the Bioverativ deal in an analyst call Monday. He added that there were some “some tax synergies in the financing structure” that sweetened the deal.\nA new provision mandating that U.S. companies pay a one-time tax on any profits stockpiled offshore is expected to unleash a flood of repatriation that would also accelerate dealmaking. U.S. corporate earnings held overseas by Russell 1000 companies reached $2.6 trillion in 2016, according to data consultancy Audit Analytics, a figure that has more than doubled since 2009.\nJohnson & Johnson has about $16 billion in offshore cash, of which around $12 billion is set to be repatriated as a result of the U.S. tax overhaul, executives said on the company’s earnings call on Tuesday.\n“Some of the elements included in the package are provisions that will allow companies like Johnson & Johnson to have greater flexibility in how we can use overseas earnings to invest for the future,” said Chief Executive Officer Alex Gorsky on the call.\nJohnson & Johnson completed 16 acquisitions in 2017 and is “constantly looking” for opportunities to fill gaps in its portfolio, he said.\nOther companies, including insurance company Brown & Brown Inc. and Swiss chemicals giant Clariant International Ltd. , have said they are busy scouting potential targets.\nBrown & Brown posted fourth-quarter earnings that more than tripled because of tax benefits.\n“As it relates to additional money from tax reform ... we’re focused upon current and future teammates, innovation both in technology and beyond, as well as M&A,” said J.Powell Brown, CEO of the company.\nWrite to Ezequiel Minaya at ezequiel.minaya@wsj.com and Nina Trentmann at Nina.Trentmann@wsj.com", "external_links": [], "published": "2018-01-24T15:06:00.000+02:00", "crawled": "2018-01-24T23:15:51.019+02:00", "highlightTitle": ""}