{"organizations": [], "uuid": "00d42bc6bd12408d5bca0fda0a81c1f86ac5efa4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-cushinga-renaissance-fund-announces-monthly-distribution.html", "country": "US", "domain_rank": 767, "title": "Cushing® Renaissance Fund Announces Monthly Distribution", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T17:32:00.000+02:00", "replies_count": 0, "uuid": "00d42bc6bd12408d5bca0fda0a81c1f86ac5efa4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-cushinga-renaissance-fund-announces-monthly-distribution.html", "ord_in_thread": 0, "title": "Cushing® Renaissance Fund Announces Monthly Distribution", "locations": [], "entities": {"persons": [], "locations": [{"name": "dallas", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "szc", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS, Jan. 2, 2018 /PRNewswire/ -- The Cushing ® Renaissance Fund (NYSE: SZC) declared a distribution for January 2018 of $0.1367 per common share. The Fund's distribution will be payable on January 31, 2018 to shareholders of record on January 19, 2018. The ex-date for the Fund's distribution is January 18, 2018.\nIt is anticipated but not certain that approximately 83% of the Fund's distribution will be treated as a return of capital. The final determination of such amounts will be made and reported to shareholders in early 2019, after the end of the calendar year when the Fund determines its earnings and profits for the year. The final tax status of the distribution may differ substantially from this preliminary information.\nThe Fund is a non-diversified, closed-end management investment company with an investment objective of seeking a high total return with an emphasis on current income. The Fund seeks to provide shareholders with a vehicle to invest in an actively managed portfolio of companies that may benefit from the developing U.S. energy, industrial and manufacturing renaissance. The Fund is traded on the New York Stock Exchange under the symbol \"SZC.\"\nThe Fund is managed by Cushing ® Asset Management, LP (\"Cushing\"). No assurance can be given that the Fund's investment objectives will be achieved.\nABOUT CUSHING ® ASSET MANAGEMENT, LP\nCushing, a subsidiary of Swank Capital, is an SEC-registered investment adviser headquartered in Dallas, Texas. Cushing serves as investment adviser to affiliated funds and managed accounts which invest primarily in securities of MLPs and other natural resource companies. As of December 31, 2017, Cushing had approximately $3.8 billion of assets under management in closed-end funds, mutual funds, privately offered funds and separately managed accounts.\nContact:\nJudson Redmond\nCushing ® Asset Management, LP\n214-635-1702\nwww.swankcapital.com\nIMPORTANT INFORMATION\nThis press release shall not constitute an offer to sell or a solicitation to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer or solicitation or sale would be unlawful prior to registration or qualification under the laws of such state or jurisdiction.\nDistributions shall be payable when and to the extent declared by the Board of Trustees. The Fund reserves the right to change its distribution policy and the basis for establishing the rate of distributions at any time.\nThis press release contains certain statements that may include \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. All statements, other than statements of historical fact, included herein are \"forward-looking statements.\" Although the Funds and Cushing believe that the expectations reflected in these forward-looking statements are reasonable, they do involve assumptions, risks and uncertainties, and these expectations may prove to be incorrect. Actual results could differ materially from those anticipated in these forward-looking statements as a result of a variety of factors, including those discussed in the company's reports that are filed with the Securities and Exchange Commission. You should not place undue reliance on these forward-looking statements, which speak only as of the date of this press release. Other than as required by law, the Funds and Cushing do not assume a duty to update this forward-looking statement.\nView original content: http://www.prnewswire.com/news-releases/cushing-renaissance-fund-announces-monthly-distribution-300576388.html\nSOURCE Cushing Asset Management, LP", "external_links": ["http://www.swankcapital.com/", "http://www.prnewswire.com/news-releases/cushing-renaissance-fund-announces-monthly-distribution-300576388.html"], "published": "2018-01-02T17:32:00.000+02:00", "crawled": "2018-01-02T19:21:30.016+02:00", "highlightTitle": ""}