{"organizations": [], "uuid": "4f06ffe8c8ea65a1539ec08c3487435c42a73c34", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224756288&w=1200&r=LYNXMPEE0N0P4", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-britain-unemployment/employment-surges-to-unexpected-record-high-wages-edge-up-idUKKBN1FD10G", "country": "US", "domain_rank": 408, "title": "Employment surges to unexpected record high, wages edge up", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T11:42:00.000+02:00", "replies_count": 0, "uuid": "4f06ffe8c8ea65a1539ec08c3487435c42a73c34"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-unemployment/employment-surges-to-unexpected-record-high-wages-edge-up-idUKKBN1FD10G", "ord_in_thread": 0, "title": "Employment surges to unexpected record high, wages edge up", "locations": [], "entities": {"persons": [], "locations": [{"name": "britain", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "positive"}, {"name": "office for national statistics", "sentiment": "none"}, {"name": "ons", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 9:35 AM / Updated 5 hours ago UK employment surges to record high, wages edge up Andy Bruce , David Milliken 4 Min Read \nLONDON (Reuters) - The number of people in work in Britain surged and one measure of wage growth rose to a near one-year high, according to data that may encourage some Bank of England policymakers to think interest rates should rise again before long. \nSterling touched $1.41, its highest level against the U.S. dollar since the 2016 Brexit vote, and British government bond prices sank to their lowest level since October after Wednesday’s stronger-than-expected headline figures. \nBritain’s economy slowed in 2017 as higher inflation - caused by a post-Brexit referendum fall in the pound - hurt the spending power of consumers. But forecasts of a bigger hit to growth did not materialise and job creation remained strong. \nThe Office for National Statistics (ONS) said the number of people in work rose by 102,000 in the three months to November, the biggest increase since the period to July and taking those in employment to a record 32.2 million. \nA Reuters poll of economists had pointed to a fall of 13,000 in employment. \nFull-time jobs accounted for most of the increase, with workers aged 50 to 64 benefiting the most. \nOverall, the figures went some way to alleviating worries that Britain’s labour market was running out of steam after a couple of months in which employment fell slightly. \n“Today’s jobs numbers once again strongly suggest that the UK economy is on a firmer footing than many had anticipated following the EU referendum vote,” James Athey, senior investment manager at Aberdeen Standard Investments, said. \nThe BoE increased interest rates for the first time since 2007 in November as most of its policymakers thought steeply falling unemployment would soon start to push up wages - a forecast that Wednesday’s data justified, Athey added. \nMost economists expect the next BoE rate hike towards the end of this year but some say it could come in May. \nThe ONS said workers’ earnings, excluding bonuses, rose by an annual 2.4 percent in the three months to November, the biggest increase since December 2016 and compared with 2.3 percent in the three months to October. \nIncluding bonuses, pay growth remained at 2.5 percent. \n“Nevertheless inflation remains higher than pay growth and so the real value of earnings continues to decline,” ONS statistician David Freeman said. \nIn November, inflation outpaced wage growth to hit its highest in almost six years at 3.1 percent. Measuring both sets of data over the three months to November, that left regular pay in real terms down 0.5 percent on a year earlier. \nWages, adjusted for inflation, remain below their levels of before the 2007-09 financial crisis. Related Coverage Sterling posts biggest daily rise in nine months; above $1.42 \nThe data also showed the unemployment rate held at a four-decade low of 4.3 percent, as expected in the Reuters poll. \nSamuel Tombs, an economist with Pantheon Macroeconomics, said an annualised rate of growth in wages, excluding bonuses, over the three months to November compared with the previous three months, edged up to 3.4 percent. That suggested it would not be long before the headline rate also rose towards 3 percent. \n“This recovery won’t go unnoticed by the (BoE‘s) Monetary Policy Committee, which has placed more emphasis recently on short-term movements in wages in its policy deliberations,” Tombs said. “Even so, the Committee needn’t panic; slack in the labour market is being used up only a slow pace.” Editing by William Schomberg and John Stonestreet", "external_links": [], "published": "2018-01-24T11:42:00.000+02:00", "crawled": "2018-01-24T11:58:23.073+02:00", "highlightTitle": ""}