{"organizations": [], "uuid": "ee1ba7b9e9063788ee1181b9ed8db90675485426", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-royal-dutch-distillers-is-new-usa-importer-of-cherry-heering.html", "country": "US", "domain_rank": 767, "title": "Royal Dutch Distillers is New USA Importer of Cherry Heering", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.031, "site_type": "news", "published": "2018-01-03T17:00:00.000+02:00", "replies_count": 0, "uuid": "ee1ba7b9e9063788ee1181b9ed8db90675485426"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-royal-dutch-distillers-is-new-usa-importer-of-cherry-heering.html", "ord_in_thread": 0, "title": "Royal Dutch Distillers is New USA Importer of Cherry Heering", "locations": [], "entities": {"persons": [{"name": "de kuyper", "sentiment": "none"}], "locations": [{"name": "netherlands", "sentiment": "none"}, {"name": "schiedam", "sentiment": "none"}, {"name": "new usa", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "cherry heering miami", "sentiment": "negative"}, {"name": "royal dutch distillers", "sentiment": "negative"}, {"name": "de kuyper royal distillers", "sentiment": "none"}, {"name": "cherry heering liqueur", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MIAMI and SCHIEDAM, Netherlands, January 3, 2018 /PRNewswire/ --\nFollowing its recent global acquisition, Cherry Heering Liqueur will be available to bartenders and consumers across the United States through Royal Dutch Distillers. The Miami-based subsidiary of De Kuyper Royal Distillers will act as the exclusive importer and sales and marketing force of the renowned and well-established Cherry Heering brand. De Kuyper, well known for the world's largest brand of premium cocktail liqueurs, had announced the acquisition of Cherry Heering in October 2017.\n(Photo: http://mma.prnewswire.com/media/623838/Royal_Dutch_Distillers_Cherry_Heering.jpg )\nCherry Heering, probably the oldest cherry liqueur in the world, was established in 1818. It is known as the original \"Cherry Brandy\" and contributed to the creation of some of the most legendary cocktails. The very first \"Singapore Sling\" was created with Cherry Heering and, since then, the brand has been the global reference for this famous cocktail. Today it is still the essential ingredient and global reference for such world-famous cocktails as the \"Blood and Sand\" and the \"Copenhagen.\"\n\"The United States is the number one cocktail market in the world, and a key market for Cherry Heering,\" says Mark de Witte, CEO of De Kuyper. \"We are very pleased that we can now bring this internationally recognized and iconic brand to bartenders and retailers in the US, in conjunction with the other great brands in the portfolio of Royal Dutch Distillers: Rutte Gins and Genever, Mandarine Napoléon, Italicus Rosolio di Bergamotto, Half Hitch Gin and ChocoVine. We are continuously looking to extend our range of premium brands to offer customers a most complete portfolio. Just like our premium spirits, Cherry Heering is the global reference for a variety of classic cocktails and fully in line with our Global Company Strategy and vision to 'Own the Cocktail'\".\n\"The Cherry Heering brand is well-established and has a high level of recognition in the US bartender community,\" says Adéle Robberstad, CEO of Peter F. Heering company. \"We are very proud and grateful for this close relationship with the US on-premise and will continuously build on it with our constant support.\"\nMarc De Kuyper, an 11th-generation De Kuyper family member and CEO of Royal Dutch Distillers in the US, comments: \"We are very happy to take over the brand that's in such good shape thanks to the great work done by Royal Wines over the last couple of years. 2018 marks the 200 th anniversary of Cherry Heering and we're very much looking forward to celebrating this great heritage brand together with our customers. For the anniversary, we'll support sales of this modern classic with a new marketing campaign, including specials such as a Special Edition Label and a holiday gift box.\"\nUS media contact Royal Dutch Distillers:\nStephanie Jerzy, Customer Marketing Director, stephanie.jerzy@royaldistillers.com , +1-305-901-1444 x 208\nSOURCE Royal Dutch Distillers", "external_links": [], "published": "2018-01-03T17:00:00.000+02:00", "crawled": "2018-01-03T18:45:06.019+02:00", "highlightTitle": ""}