{"organizations": [], "uuid": "073d5c1fcfb0d794d9e3ea5e8b6f4181ad52e18f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/30/104806005-IMG_7774.1910x1000.JPG", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/house-gop-leader-mccarthy-this-is-a-real-shutdown-now.html", "country": "US", "domain_rank": 767, "title": "House GOP leader McCarthy: 'This is a real shutdown now'", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.185, "site_type": "news", "published": "2018-01-22T15:20:00.000+02:00", "replies_count": 0, "uuid": "073d5c1fcfb0d794d9e3ea5e8b6f4181ad52e18f"}, "author": "Matthew J. Belvedere", "url": "https://www.cnbc.com/2018/01/22/house-gop-leader-mccarthy-this-is-a-real-shutdown-now.html", "ord_in_thread": 0, "title": "House GOP leader McCarthy: 'This is a real shutdown now'", "locations": [], "entities": {"persons": [{"name": "kevin mccarthy", "sentiment": "negative"}, {"name": "mccarthy", "sentiment": "negative"}, {"name": "cameron costa", "sentiment": "none"}, {"name": "mitch mcconnell", "sentiment": "none"}], "locations": [{"name": "capitol hill", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "house", "sentiment": "negative"}, {"name": "house gop", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "cnbc kevin mccarthy  house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "House Majority Leader Kevin McCarthy told CNBC on Monday the Senate should do whatever it takes to open the government back up, even the so-called nuclear option.\nThe \"nuclear option\" refers to changing the Senate rules to pass a temporary funding measure by a simple majority instead of the 60 votes usually required for spending bills.\nRepublicans hold 51 seats in the 100 member chamber.\n\"I think they need to open the government,\" the California Republican said on \"Squawk Box.\"\n\"If it takes 51 votes, do it then,\" he continued, \"because that's the same percentage it took to keep the government open in the House.\"\nThe House, which passed its short-term funding bill last week, is not constrained by the same \"supermajority\" rules on spending bills that govern the Senate.\nIn a tweet Sunday, President Donald Trump also advocated the \"nuclear option.\"\nGreat to see how hard Republicans are fighting for our Military and Safety at the Border. The Dems just want illegal immigrants to pour into our nation unchecked. If stalemate continues, Republicans should go to 51% (Nuclear Option) and vote on real, long term budget, no C.R.'s!\nAfter a weekend of failed negotiations, there seems to be a light at the end of the tunnel, as Senate Majority Leader Mitch McConnell looks to advance a funding bill at noon on Capitol Hill, which could lead to an end to the 3-day-old shutdown .\n\"When you start this on a weekend, nobody wins on this. But when you get into a Monday, this is a real shutdown now,\" McCarthy said. \"These are people not going to work. This is a military not being paid. This is children's health insurance in a number of states being shut down.\"\nBut it appears Democrats, who were standing firm in hopes of winning concessions on the Obama-era Deferred Action for Childhood Arrivals program, are now on board to vote for a temporary measure to fund federal agencies through Feb. 8, in return for a commitment from McConnell to address the DACA issue over the next few weeks.\nIn a Monday morning tweet , Trump said Democrats are leaving Americans in the lurch in favor of allowances for illegal immigrants.\nThe Democrats are turning down services and security for citizens in favor of services and security for non-citizens. Not good!\nThe DACA standoff began in September, when Trump ended the policy. Delaying any action until March, he encouraged Congress to pass legislation to provide the same type of protections that DACA affords young immigrants brought to the U.S. illegally as children.\nLast week, the Justice Department asked the Supreme Court to quickly overturn a Jan. 9 lower court ruling that blocked the president's move to end DACA.\nWATCH: This is what happens when the U.S. government shuts down show chapters This is what happens when the U.S. government shuts down 3 Hours Ago | 02:07 Morning Squawk: CNBC's before the bell news roundup Sign up to get Morning Squawk each weekday\nJob Industry Advertising/Marketing Automotive Communications/PR Construction/Manufacturing Education Finance/Banking/Insurance Legal Media/Entertainment Medical/Health Care Mining/Oil/Gas/Utilities Gov't/Non-Profit Real Estate Retail Technology/IT Transportation/Shipping Travel/Hospitality Other Get this delivered to your inbox, and more info about about our products and service. Privacy Policy . Submit Please enter a valid email address", "external_links": [], "published": "2018-01-22T15:20:00.000+02:00", "crawled": "2018-01-22T16:05:52.017+02:00", "highlightTitle": ""}