{"organizations": [], "uuid": "e79cc7cde8434a85c35f2fbe8e1d58de466d1b1f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-sean-christie-seasoned-hospitality-and-nightlife-executive-joins-mgm-resorts-international.html", "country": "US", "domain_rank": 767, "title": "Sean Christie, Seasoned Hospitality And Nightlife Executive, Joins MGM Resorts International", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T17:00:00.000+02:00", "replies_count": 0, "uuid": "e79cc7cde8434a85c35f2fbe8e1d58de466d1b1f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-sean-christie-seasoned-hospitality-and-nightlife-executive-joins-mgm-resorts-international.html", "ord_in_thread": 0, "title": "Sean Christie, Seasoned Hospitality And Nightlife Executive, Joins MGM Resorts International", "locations": [], "entities": {"persons": [{"name": "sean christie", "sentiment": "negative"}, {"name": "christie", "sentiment": "none"}, {"name": "sean", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "bill hornbuckle", "sentiment": "none"}], "locations": [], "organizations": [{"name": "mgm resorts international las vegas", "sentiment": "negative"}, {"name": "mgm resorts international", "sentiment": "negative"}, {"name": "mgm", "sentiment": "negative"}, {"name": "seasoned hospitality and nightlife executive", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "mgm resorts", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LAS VEGAS, Jan. 16, 2018 /PRNewswire/ -- MGM Resorts International (NYSE:MGM) today announced the appointment of Sean Christie as its President of Events and Nightlife. In this role he will have oversight of all owned and leased day/nightlife venues and provide strategic direction around special events programming. As the demographics of travelers evolve and they become more and more sophisticated in what they are looking for, Christie will help identify and execute dynamic, engaging hospitality and entertainment experiences around the world.\nBill Hornbuckle, President of MGM Resorts, said, \"We are fortunate to have Sean join us. Our commitment to our guests is to consistently offer exciting, entertaining new reasons to visit. With Sean's vast experience in hospitality, we believe his insights and perspectives will enable us to take our offerings to new levels well into the future.\"\nChristie said, \"I'm excited by the opportunity to work with Bill and the entire MGM Resorts team. With projects under way around the globe, MGM Resorts sets the standard for entertainment and hospitality. I look forward to being part of a team that is so focused on continually reimagining and reinventing the visitor experience.\"\nChristie began his career in nightlife and hospitality in 1993 working for the Lyons Group in Boston. He moved to Las Vegas in 2000, just as nightlife was blossoming into one of the city's main attractions and helped establish a number of premier nightlife and entertainment venues, setting the stage for the explosive growth that would follow.\nBeginning in 2007 and over the course of a decade-plus-long relationship, Christie held a variety of senior leadership roles with Wynn Resorts. During that time, his responsibilities broadened beyond nightlife to include other sectors of the operation including hotel, casino, and restaurant venues. Most recently, Christie was Wynn's Executive Vice President of Business Development and explored development opportunities for Wynn Resorts in new markets.\nChristie joins MGM Resorts effective January 22, 2018.\nAbout MGM Resorts International\nMGM Resorts International (NYSE: MGM) is an S&P 500® global entertainment company with national and international locations featuring best-in-class hotels and casinos, state-of-the-art meetings and conference spaces, incredible live and theatrical entertainment experiences, and an extensive array of restaurant, nightlife and retail offerings. MGM Resorts creates immersive, iconic experiences through its suite of Las Vegas-inspired brands. The MGM Resorts portfolio encompasses 27 unique hotel offerings including some of the most recognizable resort brands in the industry. The company is expanding throughout the U.S. and around the world, developing MGM Springfield in Massachusetts and MGM COTAI in Macau, and debuting the first international Bellagio branded hotel in Shanghai. The 77,000 global employees of MGM Resorts are proud of their company for being recognized as one of FORTUNE® Magazine's World's Most Admired Companies®. For more information visit us at www.mgmresorts.com .\nView original content: http://www.prnewswire.com/news-releases/sean-christie-seasoned-hospitality-and-nightlife-executive-joins-mgm-resorts-international-300582833.html\nSOURCE MGM Resorts", "external_links": ["http://www.prnewswire.com/news-releases/sean-christie-seasoned-hospitality-and-nightlife-executive-joins-mgm-resorts-international-300582833.html", "http://www.mgmresorts.com/"], "published": "2018-01-16T17:00:00.000+02:00", "crawled": "2018-01-16T19:14:06.003+02:00", "highlightTitle": ""}