{"organizations": [], "uuid": "9452f6c47142f9f0c4cd00fdb20ec3457eca0288", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-usa-turkey-zarrab/u-s-jury-finds-turkish-banker-guilty-of-helping-iran-dodge-sanctions-idUKKBN1ES1SQ", "country": "US", "domain_rank": 408, "title": "U.S. jury finds Turkish banker guilty of helping Iran dodge sanctions", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T23:18:00.000+02:00", "replies_count": 0, "uuid": "9452f6c47142f9f0c4cd00fdb20ec3457eca0288"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-turkey-zarrab/u-s-jury-finds-turkish-banker-guilty-of-helping-iran-dodge-sanctions-idUKKBN1ES1SQ", "ord_in_thread": 0, "title": "U.S. jury finds Turkish banker guilty of helping Iran dodge sanctions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 7:31 PM / Updated 7 hours ago U.S. jury finds Turkish banker guilty of helping Iran dodge sanctions Brendan Pierson 4 Min Read \nNEW YORK (Reuters) - A U.S. jury on Wednesday found a Turkish banker guilty of helping Iran evade U.S. sanctions, after a nearly four-week trial that has strained diplomatic relations between the United States and Turkey. \nMehmet Hakan Atilla, an executive at Turkey’s majority state-owned Halkbank, was convicted on five of six counts he faced, including bank fraud and conspiracy to violate U.S. sanctions law, in Manhattan federal court. \nAtilla was also found not guilty on a money laundering charge. \nProsecutors had accused Atilla of conspiring with gold trader Reza Zarrab and others to help Iran escape sanctions using fraudulent gold and food transactions. Zarrab pleaded guilty and testified for the prosecutors. \nIn several days on the witness stand, Zarrab had described a sprawling scheme that he said included bribes to Turkish government officials and was carried out with the blessing of current President Tayyip Erdogan. \nHalkbank had no immediate comment. Attempts to reach Erdogan’s spokesman for comment on the allegations at the trial have been unsuccessful. Erdogan has publicly dismissed the case as a politically motivated attack on his government. \nIn brief public remarks after the verdict was announced, Erdogan made no comment on the trial but a senior Turkish government official rejected the verdict. \nU.S. prosecutors have criminally charged nine people, though only Zarrab, 34, and Atilla, 47, have been arrested by U.S. authorities. \nBANKERS’ CHOICE \n“Foreign banks and bankers have a choice: you can choose wilfully to help Iran and other sanctioned nations evade U.S. law, or you can choose to be part of the international banking community transacting in U.S. dollars,” Joon Kim, the acting U.S. Attorney in Manhattan, said in a statement after the verdict was read. “But you can’t do both.” \nU.S. District Judge Richard Berman scheduled Atilla to be sentenced on April 11. \nVictor Rocco, one of Atilla’s lawyers, told reporters that the banker would ask Berman to overturn the verdict and would appeal if necessary. \n“We believe he’s innocent,” Rocco said. “We intend, and he intends, most importantly, to continue to fight and clear his name.” \nThe trial carried echoes of an investigation in Turkey in 2012 and 2013 that involved Zarrab and multiple government officials. One of the prosecutors’ witnesses was a former Turkish police officer, Huseyin Korkmaz, who said he led that investigation. \nKorkmaz said he was jailed in retaliation, and eventually fled to the United States, carrying evidence from his investigation with him. \nA senior government official in Turkey said Wednesday’s verdict was “void.” \n“We consider this verdict void in every sense; international law has been violated,” said the official, who declined to be named. “It cannot have a negative impact on the Turkish economy, banking system or Halkbank, specifically.” \nLast month, Turkish Justice Minister Abdulhamit Gul demanded in a letter to U.S. Attorney General Jeff Sessions that Korkmaz be returned to Turkey, calling him “a fugitive, a terror suspect facing serious allegations.” \nThe Turkish government has said that followers of the U.S.-based cleric Fethullah Gulen were behind both the Turkish investigation and the U.S. case, as well as the 2016 failed coup in Turkey. Gulen has denied the accusations. Reporting By Brendan Pierson in New York; Additional reporting by Orhan Coskun in Ankara; Editing by Noeleen Walder and Alistair Bell", "external_links": [], "published": "2018-01-03T23:18:00.000+02:00", "crawled": "2018-01-04T00:11:25.000+02:00", "highlightTitle": ""}