{"organizations": [], "uuid": "eb698e0691c64b8c316dad57489ac0ab8e550ce8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-wake-forest-bancshares-inc-aannounces-first-quarter-results.html", "country": "US", "domain_rank": 767, "title": "Wake Forest Bancshares, Inc. Announces First Quarter Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T18:14:00.000+02:00", "replies_count": 0, "uuid": "eb698e0691c64b8c316dad57489ac0ab8e550ce8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/globe-newswire-wake-forest-bancshares-inc-aannounces-first-quarter-results.html", "ord_in_thread": 0, "title": "Wake Forest Bancshares, Inc. Announces First Quarter Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.c.", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "wake forest bancshares, inc.", "sentiment": "neutral"}, {"name": "wake forest bancshares, inc", "sentiment": "neutral"}, {"name": "wake forest federal savings and loan association", "sentiment": "none"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WAKE FOREST, N.C., Jan. 17, 2018 (GLOBE NEWSWIRE) -- Wake Forest Bancshares, Inc., (OTC BB:WAKE) parent company of Wake Forest Federal Savings and Loan Association, announced today that the Company reported earnings of $25,850 or $0.02 per share for its quarter ended December 31, 2017. The quarterly results were significantly impacted by the recently passed U.S. tax-overhaul legislation which caused the Company’s deferred tax assets to become less valuable. Deferred tax assets are essentially past credits and deductions that can be carried forward to be used to lower future taxable income. Substantially all financial institutions have deferred tax assets which will be required to be written down because such tax assets were established when corporate tax rates were at 35% and the recently passed law lowers that rate to 21%. The rate reduction triggers a one-time charge-off because such assets will be less valuable at the lower rate. The write-down of the Company’s deferred tax asset amounted to $266,288 during the current quarter. Without regard to the one-time write-down, the Company results would have been $292,119 or $0.26 per share. The Company reported earnings of $237,800 or $0.21 per share for the quarter ended December 31, 2016.\nIn announcing the earnings, Renee H. Shaw, President and Chief Executive Officer, stated that while the write-down of the Company’s deferred tax assets had a material negative impact on the current quarterly results, future earnings will be positively affected by the lower corporate tax rate that the new legislation provides. In addition, the Company’s results continue to be positively impacted by a lack of nonperforming loans and costs associated with foreclosed assets. The Company’s most recent quarterly results were also favorably impacted by rising interest rate margins created by greater loan demand and spreads that have widened due to upward rate movements initiated by the Federal Reserve. The Company’s interest rate margin was 3.01% during the current quarter compared to 2.81% for the same quarter a year earlier.\nEconomic conditions and residential home sales in our local markets continue to show strength. Our residential real estate markets have benefited because sales activity and home prices have increased while excess inventories of available homes, once common during the recession, have come down as the market continues to absorb existing product. In addition, our local area’s unemployment rate has continued to decline slightly. Further employment gains in higher paying industries should enhance our markets and our performance.\nPrimarily due to a lack of non-performing loans and strong local economic and real estate conditions, the Company determined that it was not necessary to provide any loan loss provisions during the current quarter. In addition, the Company had no loan charge-offs in its current quarter. In comparison, there were no loan loss provisions or charge-offs during the quarter ended December 31, 2016. The Company’s loan loss allowances amounted to approximately 2.38% of total loans outstanding at December 31, 2017. Foreclosed assets and non-performing loans amounted to $-0- and $-0- at December 31, 2017.\nTotal assets of the Company amounted to $104,156,800 at December 31, 2017. Total loans receivable and deposits outstanding at December 31, 2017 amounted to $59,053,750 and $78,950,050, respectively. Wake Forest Bancshares Inc.’s tier 1 capital leverage ratio was 22.96% at December 31, 2017.\nWake Forest Bancshares, Inc. has 1,129,766 shares of common stock outstanding. Based in Wake Forest, North Carolina since 1922, the Company conducts business as Wake Forest Federal from its office in Wake Forest, (Wake County), North Carolina.\nContact: Renee H. Shaw, CEO\n(919) 556-5146\nSource:Wake Forest Bancshares, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/b78b73fe-1415-483b-ad92-7dd8c8862784"], "published": "2018-01-17T18:14:00.000+02:00", "crawled": "2018-01-17T19:18:58.000+02:00", "highlightTitle": ""}