{"organizations": [], "uuid": "7293c82640b947e9a11ee965281af240acf72342", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-sears-holdings-announces-plan-to-enhance-liquidity-and-accelerate-return-to-profitability.html", "country": "US", "domain_rank": 767, "title": "Sears Holdings Announces Plan to Enhance Liquidity and Accelerate Return to Profitability", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.999, "site_type": "news", "published": "2018-01-10T15:00:00.000+02:00", "replies_count": 0, "uuid": "7293c82640b947e9a11ee965281af240acf72342"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-sears-holdings-announces-plan-to-enhance-liquidity-and-accelerate-return-to-profitability.html", "ord_in_thread": 0, "title": "Sears Holdings Announces Plan to Enhance Liquidity and Accelerate Return to Profitability", "locations": [], "entities": {"persons": [{"name": "rob riecker", "sentiment": "none"}], "locations": [{"name": "ill.", "sentiment": "none"}], "organizations": [{"name": "sears holdings", "sentiment": "negative"}, {"name": "sears holdings corporation", "sentiment": "negative"}, {"name": "holdings", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOFFMAN ESTATES, Ill., Jan. 10, 2018 /PRNewswire/ -- Sears Holdings Corporation (\"Holdings,\" \"we,\" \"us,\" \"our,\" or the \"Company\") (NASDAQ: SHLD) announced today it has raised $100 million in new financing and is pursuing an additional $200 million from other counterparties. In addition, Sears Holdings has amended its existing second lien notes, maturing October 15, 2018, to increase their borrowing base advance rate for inventory and defer their collateral coverage test and restart it with the second quarter of 2018, and is in discussions with certain lenders regarding additional transactions to improve the terms on potentially more than $1 billion of its non-first lien debt.\nThe Company also outlined incremental actions to further streamline its operations to drive profitability, including cost reductions of $200 million on an annualized basis in 2018 unrelated to store closures.\nRob Riecker, Sears Holdings' Chief Financial Officer, said: \"As previously announced, we are actively pursuing transactions to adjust our capital structure in order to generate liquidity and increase our financial flexibility. The new capital we have secured represents meaningful progress towards those objectives and demonstrates that we continue to have options to finance our business.\"\nEdward S. Lampert, Chairman and Chief Executive Officer of Sears Holdings, said: \"We made significant progress in 2017 through our efforts to reset our cost base and enhance our liquidity, as well as our recently announced agreement with the PBGC to pre-fund our contributions to our pension plan for the next two years. The initiatives we have announced today build on those achievements and make clear our determination to remain a viable competitor in the challenging retail environment. The financial transactions we are pursuing and incremental cost actions are designed to accelerate our return to profitability and enable Sears Holdings to increase our investment in the most promising opportunities in our enterprise, including our Shop Your Way network and our Sears Home Services business. Our leadership team is more aligned and committed to the transformation of Sears Holdings than ever before. With the support of our associates, we hope to work constructively with our investors, vendors and other constituents to facilitate the actions we are announcing today.\"\nFinancial Transactions\nSears Holdings has amended the borrowing base definition in the indenture relating to the Company's second lien notes, maturing October 15, 2018, to change the advance rate for inventory to 75%, increased from 65%. The amendment also defers the collateral coverage test for purposes of the repurchase offer covenant in such indenture and restarts it with the second quarter of 2018 (such that no collateral coverage event can occur until the end of the third quarter of 2018). The Company has also made corresponding amendments to its second lien credit agreement.\nSears Holdings has also initiated a series of financial transactions to raise an incremental $300 million in new liquidity. The Company has already received a $100 million term loan, supported by ground leases and select intellectual property. Under certain circumstances and with the consent of the lender, the Company will be entitled to raise an additional $200 million against the same collateral.\nIn addition, the Company is in discussions with certain lenders regarding additional transactions to enhance its liquidity and strengthen its balance sheet through a series of agreements that would improve the terms on potentially more than $1 billion of its non-first lien debt, including significantly reducing cash interest expense and extending the maturity of some of that debt. The Company will disclose the outcome of these negotiations as appropriate.\nFurther, the Company is also continuing to pursue a secured credit facility, consisting of an approximately $407 million (net of associated costs) first lien tranche and a second lien tranche of up to $200 million, secured by the 138 properties currently subject to a ring-fence arrangement with the Pension Benefit Guaranty Corporation. The 138 properties have an aggregate appraised value of approximately $985 million.\nHowever, should the Company's efforts to complete these transactions not be fully successful, the Board will consider all other options to maximize the value of its assets.\nCommitted to Return to Profitability\nIn addition to the significant cash savings that would be realized from completion of the financial transactions discussed above, Sears Holdings announced incremental actions to become a more agile and competitive retailer and deliver on its commitment to return to profitability in 2018. The Company has identified $200 million of cost savings, unrelated to store closures, to achieve its goal.\nSears Holdings will also benefit from cost reduction activities undertaken in the 2017 fiscal year, including additional store closures announced in January 2018, as the Company continues to right-size its store footprint in number and size. While the closing stores collectively generated about $850 million in sales over the past 12 months, they were among our lowest performing stores with an average gross margin rate approximately 400 basis points lower than our ongoing stores. While closing these stores may negatively impact our sales, our actions are aimed at returning the Company to profitability. Furthermore, we expect to generate a significant amount of cash from the liquidation of the inventory and related assets of these stores. Eligible associates impacted by these additional store closures will receive severance and will have the opportunity to apply for open positions at area Kmart or Sears stores. Customers can use the store locator function on the Company's web sites to find the location of their nearest Kmart and Sears stores.\nSears Holdings will continue to strategically evaluate the productivity of its Kmart and Sears stores as the Company transforms its business model so that its physical store footprint and its digital capabilities match the needs and preferences of its members. In addition, Sears Holdings will continue to evaluate strategic options to unlock value from its real estate portfolio, as well as its Kenmore® and DieHard® brands and its Sears Home Services and Sears Auto Centers businesses, as well as continue to seek other potential sources of capital.\nFinancial Update\nDespite the challenges in the retail environment, we continue to focus on managing expenses and inventory levels closely and our current quarter-to-date Adjusted EBITDA performance has improved over the prior year by approximately $40 million. Comparable store sales at Sears and Kmart for the first two months of the fourth quarter of 2017 have declined in the range of 16%-17%. Adjusting for the adverse impact on our revenues resulting from reductions in the number of pharmacies in open stores and the reduction in consumer electronics assortment, comparable store sales declined in the range of 14%-15%.\nAdjusted EBITDA is expected to ", "external_links": ["http://www.searsholdings.com/", "http://www.prnewswire.com/news-releases/sears-holdings-announces-plan-to-enhance-liquidity-and-accelerate-return-to-profitability-300580644.html"], "published": "2018-01-10T15:00:00.000+02:00", "crawled": "2018-01-10T16:18:14.007+02:00", "highlightTitle": ""}