{"organizations": [], "uuid": "0503e9c2502cd43b43465ea392118e5d20b74475", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/germany-wages/german-regional-union-to-extend-wage-talks-averting-strikes-for-now-sources-idUSL8N1PL1YY", "country": "US", "domain_rank": 408, "title": "German regional union to extend wage talks, averting strikes for now - sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T12:22:00.000+02:00", "replies_count": 0, "uuid": "0503e9c2502cd43b43465ea392118e5d20b74475"}, "author": "", "url": "https://www.reuters.com/article/germany-wages/german-regional-union-to-extend-wage-talks-averting-strikes-for-now-sources-idUSL8N1PL1YY", "ord_in_thread": 0, "title": "German regional union to extend wage talks, averting strikes for now - sources", "locations": [], "entities": {"persons": [{"name": "ilona wissenbach", "sentiment": "none"}, {"name": "bosch", "sentiment": "none"}], "locations": [{"name": "frankfurt", "sentiment": "none"}, {"name": "stuttgart", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "baden-wuerttemberg", "sentiment": "none"}], "organizations": [{"name": "daimler", "sentiment": "none"}, {"name": "mahle", "sentiment": "none"}, {"name": "porsche", "sentiment": "none"}, {"name": "mercedes-benz", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ig metall", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 22 AM / Updated 30 minutes ago German regional union to extend wage talks, averting strikes for now - sources Ilona Wissenbach 4 Min Read \nSTUTTGART, Germany, Jan 26 (Reuters) - Trade union and company representatives in Germany’s southwestern state of Baden-Wuerttemberg will extend wage negotiations on Friday to avert the immediate threat of nationwide strikes, three sources familiar with the talks said. \nBaden-Wuerttemberg is taking the lead in this year’s national wage round, and its decision will likely be followed by union IG Metall’s national leadership, which is meeting in Frankfurt on Friday to decide whether an escalation of industrial action to national 24-hour strikes is warranted. \nFour rounds of talks in Baden-Wuerttemberg, home to Mercedes-Benz maker Daimler and sports car brand Porsche as well as auto suppliers Bosch and Mahle, have so far failed to reach a deal over wages and working hours. \n“We need to use the available time to conduct talks, if 24-hour strikes are to be averted,” one of the people familiar with the matter said. \nEmboldened by the fastest economic growth in six years and record low unemployment, IG Metall is demanding a 6 percent pay rise for 3.9 million metals and engineering workers across Germany. \n“Twenty-four hour strikes would indeed be painful,” a spokesman for BMW said, adding that extended walkouts not only at the premium carmaker but also at its suppliers could disrupt production. \nThree hours of stoppages at BMW’s Munich factory on Wednesday resulted in 250 cars not being assembled, BMW said, adding it was working to make up the production shortfall. \nPremium rival Audi said it too was trying to catch up after around 700 vehicles were not assembled as a result of two stoppages at its Ingolstadt and Neckarsulm factories this week. \nDaimler said it would similarly try to address any production shortfall as quickly as possible after any strikes. \n“We assume we will be able to deliver all vehicles to our customers that they have ordered,” a spokesman said. \nA big sticking point in the talks is a union demand that workers should have the right to reduce their weekly hours to 28 from 35 to care for children, elderly or sick relatives, and return to full-time employment after two years. \nThis is IG Metall’s first major push for shorter hours since workers staged seven weeks of strikes in 1984 to help push through a cut of the working week to 35 hours from 40 hours. \nEmployers have so far offered a pay rise of 2 percent plus a one-off 200-euro ($245) payment and have rejected demands for a shorter working week unless employers are allowed to increase hours temporarily as well. \nMore than 900,000 workers have taken part in industrial action this year in support of IG Metall’s wage claims. \nGermany’s second biggest union, Verdi, which represents primarily services workers, is expected to publish its wage demand on Feb. 8. \nVerdi and IG Metall together account for around 15 percent of the German workforce, and other sectors tend to broadly follow their agreements. (Reporting by Ilona Wissenbach, Irene Preisinger and Jan Schwartz; Writing by Maria Sheahan and Edward Taylor; Editing by Georgina Prodhan and Mark Potter)", "external_links": [], "published": "2018-01-26T12:22:00.000+02:00", "crawled": "2018-01-26T12:58:37.017+02:00", "highlightTitle": ""}