{"organizations": [], "uuid": "26d1101b40f72d081b35eb20ee266d06c583abe0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 8, "shares": 8, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/domesticNews\r", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-colorado-shooting/manhunt-on-for-two-people-over-colorado-deputy-killing-idUSKBN1FE0R9", "country": "US", "domain_rank": 408, "title": "Manhunt on for two people over Colorado deputy killing", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T09:49:00.000+02:00", "replies_count": 0, "uuid": "26d1101b40f72d081b35eb20ee266d06c583abe0"}, "author": "", "url": "https://www.reuters.com/article/us-colorado-shooting/manhunt-on-for-two-people-over-colorado-deputy-killing-idUSKBN1FE0R9", "ord_in_thread": 0, "title": "Manhunt on for two people over Colorado deputy killing", "locations": [], "entities": {"persons": [{"name": "rich mckay", "sentiment": "none"}, {"name": "amanda overton", "sentiment": "none"}], "locations": [{"name": "colorado", "sentiment": "none"}, {"name": "thornton", "sentiment": "none"}, {"name": "adams county", "sentiment": "none"}, {"name": "denver", "sentiment": "none"}], "organizations": [{"name": "adams county sheriff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "sheriff’s office", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DENVER (Reuters) - A manhunt was underway on Thursday near Denver after a deputy sheriff was shot and killed while officers responded to an assault in progress, officials said.\nOne unidentified man was in custody and two suspects were on the run, an Adams County Sheriff’s office spokeswoman said at a late night news conference on Wednesday.\n“Our deputy was transported and pronounced dead at the hospital,” spokeswoman Amanda Overton said.\nThe sheriff’s office did not identify the slain officer. But the Colorado Police Officers Foundation on its website named the deputy as Heath Gumm, 32, asking for donations for his family. It said he had been on the force since 2013. Local news media showed a long line of police cars with lights on driving in procession with the body to the coroner’s office.\nResident Jess Williams told Fox News affiliate KDVR that he met Gumm while he patrolled his neighborhood.\n“He was kind as hell and shook our hands and thanked us for what we did,” the station Quote: d Williams as saying in an email.\nThis is the second law enforcement officer slain near Denver in recent weeks. A Douglas County Sheriff’s deputy was killed on Dec. 31 in a standoff in a Denver suburb where four other deputies and two civilians were also shot.\nThe latest shooting happened shortly before 7 p.m. Wednesday local time near the city of Thornton, about 10 miles (16 km)north of Denver where deputies were responding to a call of assault in progress, officials said.\nOnce on the scene, deputies found that the suspect had fled and began searching the area. When they caught up with the suspect, he pulled out a handgun and began shooting at the deputies, striking Gumm in the chest. He fled again but was eventually located and taken into custody.\nOnly a vague description of the two male suspects was available. Witnesses told police that they were “two light skinned black males or dark skin Hispanic males” dressed in all black, according to a statement from the sheriff’s office.\nMore than a dozen schools in the area were closed Thursday morning.\nSome 128 law enforcement officers died on the job in the United States in 2017, according to the nonprofit National Law Enforcement Officers Memorial Fund.\nAdditional reporting by Rich McKay in Atlanta and Gina Cherelus in New York; Editing by Gareth Jones and Andrew Hay\n ", "external_links": [], "published": "2018-01-25T09:49:00.000+02:00", "crawled": "2018-01-25T10:06:10.006+02:00", "highlightTitle": ""}