{"organizations": [], "uuid": "27a5ac38a1fd80b8ebf89bfcc17a46caa35da9a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-flowmons-new-ceo-plans-to-double-company-in-three-years.html", "country": "US", "domain_rank": 767, "title": "Flowmon's New CEO Plans to Double Company in Three Years", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T11:00:00.000+02:00", "replies_count": 0, "uuid": "27a5ac38a1fd80b8ebf89bfcc17a46caa35da9a7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-flowmons-new-ceo-plans-to-double-company-in-three-years.html", "ord_in_thread": 0, "title": "Flowmon's New CEO Plans to Double Company in Three Years", "locations": [], "entities": {"persons": [{"name": "flowmon", "sentiment": "negative"}, {"name": "rostislav", "sentiment": "none"}, {"name": "rostislav vocilka", "sentiment": "none"}, {"name": "tobola", "sentiment": "none"}, {"name": "jiri tobola", "sentiment": "none"}], "locations": [{"name": "prague", "sentiment": "none"}], "organizations": [{"name": "double company", "sentiment": "negative"}, {"name": "flowmon networks", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PRAGUE, January 24, 2018 /PRNewswire/ --\nF l owmon Networks , a vendor of advanced monitoring and security solutions for enterprise network infrastructures, has appointed Jiri Tobola as the new CEO of the company. Following the vision of Flowmon 2.0, Tobola aims to double the revenue of the company via global expansion and focus on people as a key enabler of this path.\n(Logo: http://mma.prnewswire.com/media/590352/Flowmon_Networks_Logo.jpg )\n(Photo: https://mma.prnewswire.com/media/632419/Jiri_Tobola.jpg )\nAs Tobola takes over the lead, the former CEO Rostislav Vocilka becomes an advisor and a member of Flowmon's supervisory board. \"It is a privilege for me to serve this great company. Flowmon has done an amazing job during the last ten years. Starting in 2007 in a 'garage', we are now an established European vendor with solutions appreciated by hundreds of network and security admins,\" says Jiri Tobola, CEO at Flowmon Networks. \"Many thanks goes to Rostislav who has brought Flowmon to this level. Now we are ready to scale up and build a global presence.\"\nAs a co-founder and employee number one, Jiri has been with Flowmon from the early beginnings. He was the creator of the company's market vision and the driving force behind the sales channel development and technical shifts across the company's product portfolio. Prior to joining Flowmon, Jiri worked as a researcher and developer at the Czech National Research and Education Network (CESNET).\n\"With Jiri and all Flowmoners who dedicate their experience and skills to the future, I have absolutely no doubt that Flowmon is in good hands,\" comments the company's former CEO, Rostislav Vocilka.\nIn the next three years, Flowmon aims to develop the US market, expand from Japan to the entire Asia-Pacific region and fortify its position on the European market. \"Focus on delivering deep network visibility, cloud technologies and IT operations analytics will be the engine of the future growth,\" comments Tobola.\nThe company also plans to double its size in terms of revenue and take on an additional 100 employees. Flowmon has recently strengthened management of its key departments with seasoned professionals and keeps investing in sales, marketing and people who are the engine of the company. Last year, Flowmon achieved 25% revenue growth.\n\"There is a lot of work ahead, but I believe it will also be great fun,\" adds Tobola.\nAbout Flowmon Networks\nFlowmon Networks develops network performance monitoring and network security products utilizing information from traffic flow.\nContact: Lukas Dolnicek, PR & Communications, T: 00-420-530-510-616\nSOURCE Flowmon Networks", "external_links": ["https://www.flowmon.com/en/solutions/use-case/flow-monitoring"], "published": "2018-01-24T11:00:00.000+02:00", "crawled": "2018-01-24T11:31:21.040+02:00", "highlightTitle": ""}