{"organizations": [], "uuid": "b4f3c77ef54072e35793400d9f4bdac3c3556fb6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/02/mpw-revised-logo-2-42.png", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/11/catherine-deneuve-michelle-williams-serena-williams-broadsheet-for-jan-11/", "country": "US", "domain_rank": 1196, "title": "Catherine Deneuve, Michelle Williams, Serena Williams: Broadsheet | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.969, "site_type": "news", "published": "2018-01-11T10:03:00.000+02:00", "replies_count": 0, "uuid": "b4f3c77ef54072e35793400d9f4bdac3c3556fb6"}, "author": "Kristen Bellstrom", "url": "http://fortune.com/2018/01/11/catherine-deneuve-michelle-williams-serena-williams-broadsheet-for-jan-11/", "ord_in_thread": 0, "title": "Catherine Deneuve, Michelle Williams, Serena Williams: Broadsheet | Fortune", "locations": [], "entities": {"persons": [{"name": "michelle williams", "sentiment": "negative"}, {"name": "kristen bellstrom", "sentiment": "negative"}, {"name": "serena williams", "sentiment": "negative"}, {"name": "catherine deneuve", "sentiment": "negative"}, {"name": "mark wahlberg", "sentiment": "none"}, {"name": "williams", "sentiment": "none"}, {"name": "kevin spacey", "sentiment": "none"}, {"name": "wahlberg", "sentiment": "none"}, {"name": "william morris", "sentiment": "none"}], "locations": [], "organizations": [{"name": "world", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Kristen Bellstrom 8:03 AM EST \nGood morning, Broadsheet readers! Congresswomen are getting on the all-black bandwagon, Serena Williams tells a harrowing health story, and what we can learn from Michelle Williams’ pay gap. Have a great Thursday. EVERYONE'S TALKING \n• A hell of a pay gap. When the team behind the upcoming All the Money in the World decided to remove Kevin Spacey from the film following accusations of sexual misconduct, Mark Wahlberg was paid $1.5 million to do the necessary reshoots. Meanwhile, lead actress Michelle Williams was not told about Wahlberg’s deal and received a per diem fee of $80. Adding to the shadiness of the whole affair: Both actors are represented by William Morris. \nThere’s a lot to unpack here, but I did find a point made by this Quartz piece particularly interesting. It quotes Williams on the reshoots (“I said I’d be wherever they needed me, whenever they needed me. And they could have my salary, they could have my holiday, whatever they wanted. Because I appreciated so much that they were making this massive effort.”) and cites research that shows that women tend to act more altruistically than men—in part because society expects them to and punishes them when they do not. \nThe idea that women are more willing than our male colleagues to “take one for the team” rings true to me. Yet too often those sacrifices are at best overlooked, and at worst actually detrimental to women’s careers. So, while I don’t necessarily want to be a cheerleader for ruthless selfishness, when it comes to work, please remember that it’s okay to put yourself first. Fortune ALSO IN THE HEADLINES \n• Le #MeToo backclash . Actor Catherine Deneuve and 100 of her fellow Frenchwomen signed a letter that asserted that the #MeToo movement (#BalanceTonPorc in France) has gone too far. “Rape is a crime. But insistent or clumsy flirting is not a crime, nor is gallantry a chauvinist aggression,” the letter, published Tuesday in Le Monde , begins. In a later passage, the authors write: “We do not recognize ourselves in this feminism, which beyond denouncing the abuse of power, takes on a hatred of men and of sexuality.” New York Times \n• State of the sartorial union . Taking a cue from Sunday’s Golden Globes, some female Democrats in Congress plan to protest sexual harassment by wearing black to President Donald Trump’s first State of the Union speech on January 30. “This is a culture change that is sweeping the country, and Congress is embracing it,” says Rep. Jackie Speier (D-Calif.). Though the organizers are encouraging members of both parties to participate, the move will likely be seen as a statement against the president, who has been accused of sexual misconduct by more than a dozen women. (He has denied all the claims and the White House has characterized his accusers as liars.) Time \n• Serena’s scare . Serena Williams talks motherhood, marriage, and tennis plans in this Vogue cover story. But the portion of the article that’s garnered the most attention is the description of the scary series of complications she endured after the birth of her daughter. Among them, a number of small blood clots in her lungs that she says her doctors would have missed had she not insisted on a CT scan. It’s a vivid reminder of research suggesting that medical professionals have a tendency to ignore women’s pain. Vogue \n• The woman behind the list . Remember the “Shitty Media Men” Google spreadsheet that made the Internet rounds last October? (The document lists the names of 70 men in the industry, along with allegations of sexual misconduct against them.) Its author, 28-year-old Moira Donegan, has gone public in order to pre-empt a Harper’s story that she feared would have “outed” her. Donegan writes that the list was an attempt to solve the problem of “how women can protect ourselves from sexual harassment and assault,” and was meant to enable women to “pass on open secrets and warn women away from serial assaulters.” \nMOVERS AND SHAKERS: Girls Who Invest has announced that Janet Cowell, former North Carolina State Treasurer, has joined as CEO. IN CASE YOU MISSED IT \n• Today in sexual harassment accusations . According to a report in the Daily Mail, which cites anonymous sources, the Marvel comics legend Stan Lee is currently in a legal dispute with a nursing company over claims that he sexually harassed and groped multiple female nurses who were employed to care for him at his home. Lee’s lawyers deny the allegations. Appearing on The Late Show , actor James Franco denied that he has acted improperly and said he has “no idea what I did to Ally Sheedy.” (During the Golden Globes, Sheedy tweeted he was an example of why she “left the film/TV business.”) After learning that multiple publications are working on stories that claim he masturbated in front of a former employee, Michael Douglas tried to get in front of the story by giving Deadline an interview in which he denies the allegations. \n• Once in a lifetime invite . Ai-jen Poo, the executive director for the National Domestic Workers Alliance, writes about what it was like to attend the Golden Globes as Meryl Streep’s “plus one.” ", "external_links": [], "published": "2018-01-11T10:03:00.000+02:00", "crawled": "2018-01-11T16:16:22.004+02:00", "highlightTitle": ""}