{"organizations": [], "uuid": "da6babaee791b38d8153ca4777ab94ccb296e62e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/global-markets/global-markets-equities-climb-as-shutdown-looms-treasury-yields-hit-3-year-high-idUSL1N1PE1D5", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-Equities climb as shutdown looms, Treasury yields hit 3-year high", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T20:56:00.000+02:00", "replies_count": 0, "uuid": "da6babaee791b38d8153ca4777ab94ccb296e62e"}, "author": "", "url": "https://www.reuters.com/article/global-markets/global-markets-equities-climb-as-shutdown-looms-treasury-yields-hit-3-year-high-idUSL1N1PE1D5", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Equities climb as shutdown looms, Treasury yields hit 3-year high", "locations": [], "entities": {"persons": [{"name": "chuck schumer", "sentiment": "none"}, {"name": "chuck mikolajczak", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "schumer", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}], "organizations": [{"name": "treasury", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "house of representatives", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}, {"name": "mar-a-lago", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 6:57 PM / in 20 minutes GLOBAL MARKETS-Equities climb as shutdown looms, Treasury yields hit 3-year high Reuters Staff \n* Trump, Schumer meet to avert shutdown \n* 10-year Treasury yields highest since Sep 2014 \n* Euro zone stock index hits 10-yr high (Updates with U.S. market open, changes byline, dateline; previous LONDON) \nBy Chuck Mikolajczak \nNEW YORK, Jan 19 (Reuters) - World equity markets scaled to a record on Friday as the U.S. dollar languished near three-year lows and a U.S. government shutdown loomed, while U.S. Treasury yields continued their ascent to hit their highest levels since September 2014. \nPresident Donald Trump postponed plans to go to his Mar-a-Lago resort in Florida and met at the White House with Senate Democratic Leader Chuck Schumer to try to avert the shutdown, a source familiar with the situation said. \nLegislation to stave off an imminent federal government shutdown encountered obstacles in the Senate on Thursday night, despite the passage of a month-long funding bill by the House of Representatives hours earlier. \nWithout an infusion of new money, no matter how temporary, hundreds of thousands of “non-essential” federal workers may be put on furlough, while “essential” employees, dealing with public safety and national security, would continue working. \n“The market is really just looking past this whole worry of government shutdown, which looks like we are getting closer and closer to,” said Lindsey Bell, investment strategist at CFRA Research in New York. \nShares of Wall Street rose modestly, with each of the major Wall Street indexes on track for their third straight weekly gain. \nThe Dow Jones Industrial Average fell 54.87 points, or 0.21 percent, to 25,962.94, the S&P 500 gained 3.73 points, or 0.13 percent, to 2,801.76 and the Nasdaq Composite added 22.56 points, or 0.31 percent, to 7,318.61. \nThe trade-weighted dollar index was last up 0.13 percent, but was on pace for its fifth straight weekly drop, and is down nearly 2 percent so far in 2018. The euro was down 0.14 percent to $1.222. \n“That is going probably going to persist through the first half, if not all of 2018, and that is going to be something that will benefit corporate profitability,” said Bell. \nEuropean shares closed higher as confidence grew about corporate earnings and the strength of the global economy. The euro zone’s STOXX benchmark index closed up 0.73 percent at 402.95 points, its highest level in 10 years and the pan-regional STOXX 600 benchmark rose 0.5 percent to 400.71 points, a 2-1/2 year peak. \nThe pan-European FTSEurofirst 300 index rose 0.49 percent, also a 2-1/2 year high, and MSCI’s gauge of stocks across the globe gained 0.30 percent. MSCI’s index was poised for its ninth straight week of gains. \nYields on the 10-year U.S. government bond hit their highest level in three years on Friday as weakness in overnight trading pushed the debt through key technical support levels, which resulted in further selling. \nThe benchmark 10-year yield hit its highest level since September 2014 at 2.646 percent, breaking the 2017 high of 2.64 percent that the market had been flirting with all week. \nBenchmark 10-year notes last fell 8/32 in price to yield 2.6388 percent, from 2.611 percent late on Thursday. \nOil prices retreated and were on course to snap a four-week streak of gains, as a bounce-back in U.S. production outweighed ongoing declines in crude inventories. \nU.S. crude fell 0.94 percent to $63.35 per barrel and Brent was last at $68.67, down 0.92 percent on the day. Reporting by Chuck Mikolajczak; Editing by Nick Zieminski", "external_links": [], "published": "2018-01-19T20:56:00.000+02:00", "crawled": "2018-01-19T21:19:06.005+02:00", "highlightTitle": ""}