{"organizations": [], "uuid": "10ee09d1df8d397379e18b8df9ce83de89623502", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/business-wire-investor-group-led-by-funds-managed-by-affiliates-of-apollo-global-management-and-varde-partners-to-acquire-a-significant.html", "country": "US", "domain_rank": 767, "title": "Investor Group Led by Funds Managed by Affiliates of Apollo Global Management and Värde Partners to Acquire a Significant Position in OneMain Holdings from Fund Managed by an Affiliate of Fortress Investment Group", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-04T14:30:00.000+02:00", "replies_count": 0, "uuid": "10ee09d1df8d397379e18b8df9ce83de89623502"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/business-wire-investor-group-led-by-funds-managed-by-affiliates-of-apollo-global-management-and-varde-partners-to-acquire-a-significant.html", "ord_in_thread": 0, "title": "Investor Group Led by Funds Managed by Affiliates of Apollo Global Management and Värde Partners to Acquire a Significant Position in OneMain Holdings from Fund Managed by an Affiliate of Fortress Investment Group", "locations": [], "entities": {"persons": [{"name": "värde", "sentiment": "none"}, {"name": "matthew michelini", "sentiment": "none"}], "locations": [{"name": "minneapolis", "sentiment": "none"}], "organizations": [{"name": "värde partners", "sentiment": "neutral"}, {"name": "affiliate of fortress investment group new york", "sentiment": "neutral"}, {"name": "onemain holdings", "sentiment": "neutral"}, {"name": "affiliates of apollo global management", "sentiment": "neutral"}, {"name": "onemain holdings, inc.", "sentiment": "none"}, {"name": "fortress investment group llc", "sentiment": "none"}, {"name": "värde partners, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK & MINNEAPOLIS--(BUSINESS WIRE)-- An investor group led by funds managed by affiliates of Apollo Global Management, LLC (together with its consolidated subsidiaries, “Apollo”) (NYSE:APO) and Värde Partners, Inc. (“Värde”) today announced they have entered into a definitive agreement with a company primarily owned by funds managed by an affiliate of Fortress Investment Group LLC (“Fortress”) to acquire all of its remaining equity interest in OneMain Holdings, Inc. (“OneMain” or the “Company”) (NYSE:OMF) for $26.00 per share. Upon completion of the transaction, the Apollo and Värde led investor group will own approximately 40.5% of OneMain. The transaction, which is expected to close in the second quarter of 2018, is subject to regulatory approvals and other customary closing conditions.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180104005486/en/\n“We are tremendously excited for our managed funds, together with Värde, to acquire a significant position in OneMain,” said Matthew Michelini, a Partner at Apollo. “As one of America’s premier consumer finance companies, we believe OneMain is exceptionally well-positioned for continued growth and innovation. We look forward to working with OneMain’s dedicated team of employees and leveraging Apollo’s resources and deep expertise in financial services as the Company embarks on the next chapter of its long history of success.”\n“We are delighted to be making a strategic investment in OneMain,” said Aneek Mamik, North America Head of Specialty Finance at Värde Partners. “We look forward to collaborating with the highly experienced teams at OneMain and Apollo to grow and develop the business for the benefit of all stakeholders. The investment is a complementary extension of our deep expertise globally in specialty finance.”\n“We appreciate all of the support and insight that Fortress has provided as a key partner and majority investor over the last seven years of our company’s journey,” said Jay Levine, President and CEO of OneMain Holdings, Inc. “With a clear path forward to achieve our long-term objectives, we are confident that the thought leadership and expertise represented by this new investor group will be instrumental as we build further shareholder value.”\nBarclays is serving as lead financial advisor and Sidley Austin LLP is serving as legal counsel to the Apollo and Värde led investor group in connection with this transaction. Goldman Sachs is also providing advisory services to the investor group. Citi is serving as financial advisor to Fortress and Cravath Swaine & Moore LLP is serving as legal counsel to Fortress in connection with this transaction.\nAbout Apollo Global Management\nApollo is a leading global alternative investment manager with offices in New York, Los Angeles, Houston, Chicago, St. Louis, Bethesda, Toronto, London, Frankfurt, Madrid, Luxembourg, Mumbai, Delhi, Singapore, Hong Kong and Shanghai. Apollo had assets under management (AUM) of approximately $242 billion as of September 30, 2017 in private equity, credit and real assets funds invested across a core group of nine industries where Apollo has considerable knowledge and resources. about Apollo, please visit www.agm.com .\nThe investment in OneMain by the Apollo-managed funds is being made from Apollo Investment Fund VIII, L.P. and its parallel funds (collectively, “Apollo Fund VIII”). Including its commitment to OneMain, Apollo Fund VIII has committed approximately 88% of its available capital.\nAbout Värde Partners\nVärde Partners is a $13 billion global alternative investment firm that employs a value-based approach to investing across a broad array of geographies, segments and asset types, including specialty finance, real estate, corporate credit, mortgages, energy and transportation. The firm sponsors and manages a family of private investment funds with a global investor base that includes foundations and endowments, pension plans, insurance companies, other institutional investors and private clients. Now in its third decade, Värde employs more than 270 people globally with regional headquarters in Minneapolis, London and Singapore.\nAbout OneMain Holdings, Inc.\nOneMain Holdings, Inc. (NYSE: OMF) is America’s premier consumer finance company, offering responsible and transparent personal loan products for over 100 years. The company provides personalized, best-in-class service at their 1,600+ branches and online. OneMain has more than 10,000 team members, located throughout 44 states, who are dedicated to serving and supporting the communities where they live and work. For additional information, please visit OneMainFinancial.com .\nForward Looking Statements\nThis press release may contain forward looking statements that are within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. These statements include, but are not limited to, discussions related to Apollo’s expectations regarding the performance of its business, its liquidity and capital resources and the other non-historical statements in the discussion and analysis. These based on management's beliefs, as well as assumptions made by, and information currently available to, management. When used in this press release, the words “believe,” “anticipate,” “estimate,” “expect,” “intend” and similar expressions are intended to identify . Although management believes that the expectations reflected in these reasonable, it can give no assurance that these expectations will prove to have been correct. These statements are subject to certain risks, uncertainties and assumptions, including risks relating to our dependence on certain key personnel, our ability to raise new private equity, credit or real estate funds, market conditions, generally, our ability to manage our growth, fund performance, changes in our regulatory environment and tax status, the variability of our revenues, net income and cash flow, our use of leverage to finance our businesses and investments by our funds and litigation risks, among others. We believe these factors include but are not limited to those described under the section entitled “Risk Factors” in Apollo’s annual report on Form 10-K filed with the Securities and Exchange Commission (the “SEC”) on February 13, 2017, as such factors may be updated from time to time in our periodic filings with the SEC, which are accessible on the SEC’s website at www.sec.gov . These factors should not be construed as exhaustive and should be read in conjunction with the other cautionary statements that are included in this press release and in other filings. We undertake no obligation to publicly update or review any , whether as a result of new information, future developments or otherwise, except as required by applicable law. This press release does not constitute an offer of any Apollo fund.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180104005486/en/\nApollo Global Management\nFor investor inquiries regarding Apollo:\nGary M. Stein\nHead of Corporate Communications\nApollo Global Management, LLC\n212-822-0467\ngstein@apollolp.com\nNoah", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51737142&newsitemid=20180104005486&lan=en-US&anchor=www.sec.gov&index=2&md5=604ccc6ee11eaf4d853194cb3ef2d6f6", "http://www.businesswire.com/news/home/20180104005486/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.agm.com&esheet=51737142&newsitemid=20180104005486&lan=en-US&anchor=www.agm.com&index=1&md5=fb177247fe7f57f676874d3f81533153"], "published": "2018-01-04T14:30:00.000+02:00", "crawled": "2018-01-04T14:01:14.009+02:00", "highlightTitle": ""}