{"organizations": [], "uuid": "632a3ec4255fa5a9f7448f666a776f2c76dda608", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/healthNews/", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-health-breastfeeding-milk-sharing/seek-medical-guidance-before-sharing-breast-milk-experts-say-idUSKBN1FC1X4", "country": "US", "domain_rank": 408, "title": "Seek medical guidance before sharing breast milk, experts say", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T16:27:00.000+02:00", "replies_count": 0, "uuid": "632a3ec4255fa5a9f7448f666a776f2c76dda608"}, "author": "", "url": "https://www.reuters.com/article/us-health-breastfeeding-milk-sharing/seek-medical-guidance-before-sharing-breast-milk-experts-say-idUSKBN1FC1X4", "ord_in_thread": 0, "title": "Seek medical guidance before sharing breast milk, experts say", "locations": [], "entities": {"persons": [{"name": "sriraman", "sentiment": "none"}, {"name": "natasha sriraman", "sentiment": "none"}], "locations": [{"name": "virginia", "sentiment": "none"}, {"name": "norfolk", "sentiment": "none"}], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "children’s hospital of the king", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}, {"name": "breastfeeding medicine", "sentiment": "none"}, {"name": "academy of breastfeeding medicine", "sentiment": "none"}, {"name": "shereen lehman", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 2:31 PM / Updated 7 hours ago Seek medical guidance before sharing breast milk, experts say Shereen Lehman 5 Min Read \n(Reuters Health) - The choice to informally share breast milk should only be made with the guidance of a physician, specialist doctors say in a new position statement. \nMothers are currently encouraged to breastfeed their babies for six months or more. Informal breast milk sharing is becoming more common, but certain safety measures are necessary, according to the board of directors of the Academy of Breastfeeding Medicine (ABM). \nInformal milk sharing differs from formal milk sharing that takes place through breast milk banks, the group writes in the journal Breastfeeding Medicine. \n“Currently, donor breast milk is reserved/used for premature babies,” lead author Dr. Natasha Sriraman, a pediatrician at Children’s Hospital of the King’s Daughters in Norfolk, Virginia, told Reuters Health in an email. \nSriraman said there are many reasons for informal breast milk sharing. ”One of the most common is when a mother is unable to give her infant/toddler her own breast milk or doesn’t have enough breast milk.” \nMany women participate in milk-sharing to help other mothers, in a spirit of community, she added. \n“With the publication of the ABM statement, the goal is to get physicians/pediatricians and other health care providers who work with mothers and babies to give correct information to help mothers make an informed decision when it comes to donor breast milk,” she said. \nThe ABM discourages the purchase of milk over the internet, because donors are usually strangers who cannot be medically screened and the milk is often not suitable for consumption. \nAny exchange of money for breast milk should be discouraged, said Sriraman. Also, as donors need screening, the ABM discourages the use of any milk from an anonymous donor. \n“Donors should be asked about their medical history, medications, (and) social practices (i.e., drug/tobacco/alcohol use). Prenatal records of the donor mother should be reviewed. Any postnatal infectious screening tests should be reviewed,” she said. \nIn addition, the Academy suggests that physicians teach women and families how to pasteurize donated breast milk at home before feeding their babies. \n“However, pasteurization can significantly decrease some of the beneficial components of human milk,” Sriraman noted. \nVitamins are minimally affected by pasteurization, while some studies show a slight reduction in fat content in the donor milk. Proteins are most significantly affected by pasteurization, specifically proteins with immunologic and anti-infective actions, Sriraman said. \n“There are no national statistics for the U.S. . . . but our Moms2Moms Study of 499 Ohio women with infants in 2012 reported that almost 4 percent had given or received milk either from a milk bank or another mother,” said Dr. Sarah Keim, a researcher at Nationwide Children’s Hospital in Columbus, Ohio, who wasn’t involved in the position statement. \n“In addition, 25 percent of the women in the study said they had considered it, and 77 percent were aware of it.” \nThere really is no way for a parent to know the milk they get from another family is 100 percent safe, Keim cautioned. “Unless you have a science lab of your own, you can’t test the milk for drugs, environmental contaminants, disease-causing bacteria, or viruses,” she said in an email. All you have is the word of the person who gave you the milk. \n“We do not have good evidence that milk shared for free is significantly less risky than milk bought and sold or distributed online,” she noted. “Much more research is needed.” \nKeim added that presently it’s not clear whether the benefits usually ascribed to a mother feeding her own baby at her breast apply at all to milk that is shared. \n“That (donated) milk is pumped, stored, usually frozen, thawed, handled, and then fed to an infant that is not the milk donor’s. We really do not know how much benefit the recipient infant is getting from that milk,” she said. \nSOURCE: bit.ly/2DG311Z Breastfeeding Medicine, online January 8, 2018.", "external_links": [], "published": "2018-01-23T16:27:00.000+02:00", "crawled": "2018-01-23T16:44:36.000+02:00", "highlightTitle": ""}