{"organizations": [], "uuid": "6da69d52ff0c6eefc8c83b57be13a70e2ee8ff66", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 9, "shares": 9, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225122763&w=1200&r=LYNXMPEE0O0QE", "site_section": "http://feeds.reuters.com/Reuters/domesticNews", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-usa-immigration-syria/syrians-with-temporary-u-s-protection-brace-for-trump-decision-idUSKBN1FE1GK", "country": "US", "domain_rank": 408, "title": "Syrians with temporary U.S. protection brace for Trump decision", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T19:39:00.000+02:00", "replies_count": 0, "uuid": "6da69d52ff0c6eefc8c83b57be13a70e2ee8ff66"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-immigration-syria/syrians-with-temporary-u-s-protection-brace-for-trump-decision-idUSKBN1FE1GK", "ord_in_thread": 0, "title": "Syrians with temporary U.S. protection brace for Trump decision", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "dania kassas", "sentiment": "none"}, {"name": "mohammad alala", "sentiment": "none"}, {"name": "alala", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "department of homeland security", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 11:39 AM / in 2 hours Syrians with temporary U.S. protection brace for Trump decision Yeganeh Torbati 5 Min Read \nWASHINGTON (Reuters) - Targeted by the Syrian government after providing humanitarian supplies to civilians fleeing air strikes, Mohammad Alala and his wife escaped in 2012, eventually obtaining student visas to enter the United States. \nThey received a form of temporary protected status (TPS) extended to Syrians in the United States because of Syria’s civil war. After moving to Florida, Alala found work as an engineer and his wife, Dania Kassas, enrolled in graduate school. \nNow, the couple’s ability to remain in the United States legally is uncertain. Their asylum claims are unresolved and TPS for Syrians will expire at the end of March unless the Department of Homeland Security decides to extend it. \nThe decision, due by Jan. 30, will affect some 6,000 Syrians. If their status is withdrawn, they could lose the ability to work in the United States and face possible deportation back to Syria, where the war rages into a seventh year. \nPresident Donald Trump’s administration has demonstrated deep skepticism toward TPS, a program established by Congress in 1990 to provide temporary reprieve for immigrants whose home countries face disaster or conflict. \nSince Trump took office, DHS has announced an end to protections for immigrants from El Salvador, Haiti, Nicaragua and Sudan. It has extended the protection for South Sudanese, and deferred a decision on Hondurans to later this year. \nAdministration officials have criticized previous presidents for leaving the status in place long after the crises that prompted it were over. \nStephen Yale-Loehr, a law professor at Cornell University, said the decision on Syria could indicate whether the administration dislikes the entire concept of TPS or simply thinks it was too leniently renewed in the past. \n“If the administration wants to make it known that they are considering whether to extend TPS on a case-by-case basis, Syria presents a much clearer case why it should be extended,” Yale-Loehr said. If they rescind the protection for Syrians, “then it signals that they think the concept and philosophy of TPS is unwarranted.” \nA DHS spokesman said the administration has not made a decision on Syria’s TPS, which was put in place in 2012, the year after the war began. \nSome groups traditionally critical of the program are holding back in Syria’s case. Roy Beck, president of Numbers USA, which favors immigration restrictions, said the group has not taken an official position on whether TPS for Syrians should be rescinded. The group supported ending protections for immigrants from El Salvador, Haiti, Nicaragua, and Honduras. \n‘DANGEROUS SIGNAL’ \nAlala said he came under suspicion from the government of President Bashar al-Assad when he refused to participate in pro-government rallies. He also quietly helped families fleeing government air strikes with humanitarian aid. \nAlala and his family are awaiting a decision on their asylum application, which they made in 2013. In the meantime, he dreads the prospect of being sent back. \n“The war is still going on in most of Syria, so it’s not safe from my perspective for anyone to go back there,” he said. \nThere is widespread agreement that civilians are in grave danger in Syria, a fact acknowledged by Secretary of State Rex Tillerson in a speech this month. \n“Assad has gassed his own people, he has barrel-bombed entire villages and urban neighborhoods,” Tillerson said. “Those abuses continue to this day.” \nThe United Nations High Commissioner for Refugees “believes that the conditions for refugees to return in safety and dignity are not yet in place in Syria,” said Andrej Mahecic, a UNHCR spokesman. \nAlthough the number of Syrians affected by the TPS decision is small compared to the number of Syrian refugees worldwide, advocates said stripping them of legal status could encourage countries hosting more Syrians to force them to return. \n“With mounting pressure on Syrian refugees in Lebanon, Jordan and Turkey to return, the U.S. government’s termination of temporary protected status for Syrians would send a particularly dangerous signal that could impact far larger numbers of Syrians at serious risk of forced return,” said Bill Frelick, director of Human Rights Watch’s refugee program. \nTurkey is host to three million Syrian refugees, and UNHCR had registered two million Syrians in Egypt, Iraq, Jordan and Lebanon as of January 2018. Reporting by Yeganeh Torbati, editing by Sue Horton and Grant McCool", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T19:39:00.000+02:00", "crawled": "2018-01-25T13:58:16.006+02:00", "highlightTitle": ""}