{"organizations": [], "uuid": "ede7bda2bcfc5cba0e8fdf2ecfcf68cc46555982", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/08/the-associated-press-budget-office-cuts-cost-estimate-of-childrens-insurance.html", "country": "US", "domain_rank": 767, "title": "Budget office cuts cost estimate of children's insurance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T02:46:00.000+02:00", "replies_count": 0, "uuid": "ede7bda2bcfc5cba0e8fdf2ecfcf68cc46555982"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/08/the-associated-press-budget-office-cuts-cost-estimate-of-childrens-insurance.html", "ord_in_thread": 0, "title": "Budget office cuts cost estimate of children's insurance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — Congress' official budget analysts have eased one stumbling block to lawmakers' fight over renewing a program that provides health insurance for nearly 9 million low-income children.\nThe Congressional Budget Office says a Senate bill adding five years of financing to the program would cost $800 million. Previously, the analysts estimated it would cost $8.2 billion.\nThat means lawmakers should find it much easier to agree to a way to pay for extending the program.\nThe lower cost projection doesn't resolve the main barrier the bill faces. Extending the children's health program has become enmeshed in a battle among President Donald Trump and lawmakers over how to protect hundreds of thousands of younger immigrants from deportation, and how much added money should be spent on defense and domestic programs.\nOnce those more heated disputes are resolved, the conflict over children's health should end quickly.\nFinancing for the program expired last fall. Congress has temporarily extended its funding, but growing numbers of states have moved closer to exhausting their money. Members of both parties are eager to extend the health insurance program and avoid being blamed for causing millions of children to be uninsured.\nCounterintuitively, the bill's budget impact has shrunk because the Republican tax bill enacted last month eliminated the penalty President Barack Obama's health care law imposes on people who don't buy insurance. That move is expected to drive up the government's costs of subsidizing people buying policies on insurance marketplaces.\nThat's because ending those penalties is projected to result in fewer healthy people buying coverage on marketplaces, driving premiums higher for remaining consumers. Since government subsidies for people buying policies are linked to premiums, higher premiums mean higher federal costs.\nThe budget analysts say extending the children's insurance program will encourage some parents to use that program and not the marketplaces. That would save the government money.\nThe new estimate was included in a letter the budget office sent Friday to Sen. Orrin Hatch, R-Utah.", "external_links": [], "published": "2018-01-09T02:46:00.000+02:00", "crawled": "2018-01-09T09:37:14.367+02:00", "highlightTitle": ""}