{"organizations": [], "uuid": "ff4550c25cab6c2d1628d54f453e8bfe07ff42ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets/indices", "section_title": "Market Indices | Reuters.com", "url": "https://www.reuters.com/article/global-precious/precious-gold-dips-further-from-3-1-2-month-peak-as-dollar-fights-back-idUSL4N1P32TM", "country": "US", "domain_rank": 408, "title": "PRECIOUS-Gold dips further from 3-1/2 month peak as dollar fights back", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.225, "site_type": "news", "published": "2018-01-08T18:50:00.000+02:00", "replies_count": 0, "uuid": "ff4550c25cab6c2d1628d54f453e8bfe07ff42ce"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-precious/precious-gold-dips-further-from-3-1-2-month-peak-as-dollar-fights-back-idUSL4N1P32TM", "ord_in_thread": 0, "title": "PRECIOUS-Gold dips further from 3-1/2 month peak as dollar fights back", "locations": [], "entities": {"persons": [{"name": "jan harvey", "sentiment": "none"}, {"name": "afshin nabavi", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "comex", "sentiment": "negative"}, {"name": "mks", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Euro takes a breather after run higher * Speculators raise COMEX gold net longs * GRAPHIC-2018 asset returns: tmsnrt.rs/2jvdmXl (Updates throughout, adds LONDON dateline) By Jan Harvey LONDON, Jan 8 (Reuters) - Gold dipped on Monday, retreating from last week's 3-1/2 month high as the dollar clawed back some ground against the buoyant euro and traders bet on further U.S. rate hikes this year after Friday's payrolls data. Dollar weakness, which continued into early January after it posted its biggest drop since 2003 last year, had helped lift assets priced in the U.S. currency, with gold posting a fourth straight weekly rise last week for the first time since April. Spot gold was down 0.1 percent at $1,318.31 an ounce at 1035 GMT, while U.S. gold futures for February delivery were down $2.70 an ounce at $1,319.60. \"(From) my point of view this is just a correction, with the market back in full swing today,\" said Afshin Nabavi, head of trading at MKS. \"I think it would be healthy to see a further correction before testing $1,325.\" \"The U.S. dollar is a touch firmer and the euro slightly lower,\" he added, saying he expected trading to be rangebound between $1,305 an $1,325. The dollar rose 0.3 percent against the euro in early trade. After mixed U.S. payrolls data on Friday, traders of U.S. short-term interest rate futures continued to bet the Fed would lift rates twice in 2018, including a probable hike in March. San Francisco Fed President John Williams said on Saturday that the Fed should raise rates three times this year given the already strong economy would get a boost from tax cuts, and could tighten more or less aggressively if needed. Gold is highly sensitive to rising U.S. interest rates, as these increase the opportunity cost of holding non-yielding bullion, while boosting the dollar, in which it is priced. Meanwhile U.S. Commodity Futures Trading Commission (CFTC) data showed on Friday that hedge funds and money managers raised their net long positions in COMEX gold in the week to Jan. 2. \"In the three weeks to Jan. 2, speculative financial investors nearly doubled their net long positions to 148,200 contracts,\" Commerzbank said in a note. \"This also means that correction potential has built up again,\" it added. \"If market participants maintain their high risk appetite and, if for example stock markets continue to soar, we could see profit-taking.\" Among other precious metals, silver was 0.2 percent lower to $17.17 an ounce, after having hit a 1-1/2-month high on Friday at $17.29. Platinum was down 0.1 percent to $968.20 an ounce, after hitting a more than 3-1/2-month peak at $970.50 earlier in the session. Palladium was 0.5 percent higher at $1,095.10 an ounce, off last week's record high of $1,105.70. (Additional reporting by Nallur Sethuraman in Bengaluru; Editing by Edmund Blair)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html", "http://tmsnrt.rs/2jvdmXl"], "published": "2018-01-08T18:50:00.000+02:00", "crawled": "2018-01-08T14:10:41.017+02:00", "highlightTitle": ""}