{"organizations": [], "uuid": "380364f235ddb4764b58f22ab4471829a7e10592", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/business-wire-holly-energy-partners-announces-53rd-consecutive-quarterly-distribution-increase-2018-distribution-and-coverage-guidance-and.html", "country": "US", "domain_rank": 767, "title": "Holly Energy Partners Announces 53rd Consecutive Quarterly Distribution Increase, 2018 Distribution and Coverage Guidance, and Private Placement of Common Equity", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.023, "site_type": "news", "published": "2018-01-26T14:30:00.000+02:00", "replies_count": 0, "uuid": "380364f235ddb4764b58f22ab4471829a7e10592"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/business-wire-holly-energy-partners-announces-53rd-consecutive-quarterly-distribution-increase-2018-distribution-and-coverage-guidance-and.html", "ord_in_thread": 0, "title": "Holly Energy Partners Announces 53rd Consecutive Quarterly Distribution Increase, 2018 Distribution and Coverage Guidance, and Private Placement of Common Equity", "locations": [], "entities": {"persons": [], "locations": [{"name": "dallas", "sentiment": "none"}], "organizations": [{"name": "holly energy partners", "sentiment": "neutral"}, {"name": "board of directors of holly energy partners", "sentiment": "none"}, {"name": "tortoise capital advisors, l.l.c.", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "holly energy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Increases quarterly distribution to $0.6500 per unit from $0.6450 per unit\nDALLAS--(BUSINESS WIRE)-- The Board of Directors of Holly Energy Partners, L.P. (NYSE:HEP) has declared a cash distribution of $0.6500 per unit for the fourth quarter of 2017, compared to the $0.6075 per unit distribution declared for the fourth quarter of 2016. Holly Energy has increased its distribution to unitholders every quarter since becoming a publicly-traded partnership in July 2004, with today’s distribution marking the 53 rd consecutive quarterly distribution increase. The distribution will be paid on February 14, 2018 to unitholders of record on February 5, 2018.\nIn 2018, Holly Energy expects to increase the quarterly distribution by $0.0050 per unit, resulting in an annual distribution growth rate of 4%. HEP expects distribution coverage to average 1.0x for the full year of 2018 with higher coverage ratios in the second half of the year due to contractual tariff escalators.\nHolly Energy has also agreed to a private placement with certain funds managed by Tortoise Capital Advisors, L.L.C. for approximately $110 million of common equity. Holly Energy believes that this transaction will satisfy the majority of Holly Energy’s current equity needs. Proceeds from the transaction will be used to repay debt associated with Holly Energy’s previously announced acquisition of the Frontier and SLC pipelines, which closed on October 31, 2017.\nHolly Energy plans to announce results for its fourth quarter of 2017 on February 20, 2018 before the opening of trading on the NYSE. The Partnership has scheduled a webcast conference on February 20, 2018 at 4:00 p.m. Eastern time to discuss financial results.\nThe webcast may be accessed at: https://event.webcasts.com/starthere.jsp?ei=1177984&tp_key=1318d4fcc7\nAbout Holly Energy Partners, L.P.:\nHolly Energy Partners, L.P., headquartered in Dallas, Texas, provides petroleum product and crude oil transportation, terminalling, storage and throughput services to the petroleum industry, including HollyFrontier Corporation subsidiaries. The Partnership, through its subsidiaries and joint ventures, owns and/or operates petroleum product and crude gathering pipelines, tankage and terminals in Texas, New Mexico, Arizona, Washington, Idaho, Oklahoma, Utah, Nevada, Wyoming and Kansas as well as refinery processing units in Kansas and Utah.\nThis release is intended to be a qualified notice under Treasury Regulation Section 1.1446-4(b). Please note that one hundred percent (100.0%) of Holly Energy Partner's distributions to foreign investors are attributable to income that is effectively connected with a United States trade or business. Accordingly, Holly Energy Partner's distributions to foreign investors are subject to federal income tax withholding at the highest applicable effective tax rate.\nForward-looking Statement:\nThe statements in this press release relating to matters that are not historical facts are “forward-looking statements” within the meaning of the federal securities laws. These statements are based on our beliefs and assumptions and those of our general partner using currently available information and expectations as of the date hereof, are not guarantees of future performance and involve certain risks and uncertainties. Although we and our general partner believe that such expectations reflected in such forward-looking statements are reasonable, neither we nor our general partner can give assurance that our expectations will prove to be correct. Therefore, actual outcomes and results could materially differ from what is expressed, implied or forecast in these statements. Any differences could be caused by a number of factors including, but not limited to:\nrisks and uncertainties with respect to the actual quantities of petroleum products and crude oil shipped on our pipelines and/or terminalled, stored and throughput in our terminals; the economic viability of HollyFrontier Corporation, Delek US Holdings, Inc. and our other customers; the demand for refined petroleum products in markets we serve; our ability to purchase and integrate future acquired operations; our ability to complete previously announced or contemplated acquisitions; the availability and cost of additional debt and equity financing; the possibility of reductions in production or shutdowns at refineries utilizing our pipeline and terminal facilities; the effects of current and future government regulations and policies; our operational efficiency in carrying out routine operations and capital construction projects; the possibility of terrorist attacks and the consequences of any such attacks; general economic conditions; other financial, operations and legal risks and uncertainties detailed from time to time in our Securities and Exchange Commission filings; and the impact of recent changes in tax laws and regulations that affect master limited partnerships.\nThe forward-looking statements speak only as of the date made and, other than as required by law, we undertake no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180126005079/en/\nHolly Energy Partners, L.P.\nCraig Biery, 214-954-6511\nDirector, Investor Relations\nor\nJared Harding, 214-954-6511\nInvestor Relations\nSource: Holly Energy Partners, L.P.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fevent.webcasts.com%2Fstarthere.jsp%3Fei%3D1177984%26tp_key%3D1318d4fcc7&esheet=51749248&newsitemid=20180126005079&lan=en-US&anchor=https%3A%2F%2Fevent.webcasts.com%2Fstarthere.jsp%3Fei%3D1177984%26tp_key%3D1318d4fcc7&index=1&md5=2cea6fe86aa6f592214fe441350201e6", "http://www.businesswire.com/news/home/20180126005079/en/", "https://event.webcasts.com/starthere.jsp?ei=1177984&tp_key=1318d4fcc7"], "published": "2018-01-26T14:30:00.000+02:00", "crawled": "2018-01-26T16:56:42.036+02:00", "highlightTitle": ""}