{"organizations": [], "uuid": "319cbe26c4e4ce3f4a3fd2151f9883bba9a0b472", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/business-wire-hff-inc-declares-special-cash-dividend-for-shareholders-of-record-as-of-february-9-2018.html", "country": "US", "domain_rank": 767, "title": "HFF, Inc. Declares Special Cash Dividend for Shareholders of Record as of February 9, 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T00:15:00.000+02:00", "replies_count": 0, "uuid": "319cbe26c4e4ce3f4a3fd2151f9883bba9a0b472"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/business-wire-hff-inc-declares-special-cash-dividend-for-shareholders-of-record-as-of-february-9-2018.html", "ord_in_thread": 0, "title": "HFF, Inc. Declares Special Cash Dividend for Shareholders of Record as of February 9, 2018", "locations": [], "entities": {"persons": [{"name": "direc", "sentiment": "negative"}], "locations": [{"name": "dallas", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "inc", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS--(BUSINESS WIRE)-- HFF, Inc. (NYSE:HF or the Company) announced today that its Board of Directors has declared a special cash dividend of $1.75 per Common Share, payable February 21, 2018 to shareholders of record on February 9, 2018. The aggregate dividend payment will total approximately $67.5 million based on the number of shares of Class A Common Stock currently outstanding. This follows five special cash dividends paid in 2012, 2014, 2015, 2016 and 2017, which total a combined $8.52 per share over that period, or approximately $320.7 million in the aggregate. When the sixth special cash dividend is paid in February 2018, the combined special cash dividends paid by the Company since December 2012 will total approximately $388.2 million, or $10.27 per share.\nBusiness Comments\n“Due to the extraordinary effort of the entire HFF team during 2017 and the strong cash position resulting from such dedication in satisfying our customers’ capital markets objectives, we are pleased to announce our Board of Directors has declared its sixth special cash dividend in the amount of $1.75 per Class A Common Share,” said Mark D. Gibson, the Company’s chief executive officer.\n“As we have continually communicated to our shareholders and the market, we adhere to three objectives relative to managing our cash position and returning capital to our shareholders. These three objectives are to 1) maintain sufficient working capital to operate the HFF platform commensurate with a “best in class” real estate capital markets service firm, 2) maintain sufficient cash reserves to not only survive a downturn such as during 2008 and 2009, but also to thrive in such a downturn given the significant opportunities for growth generally afforded well-capitalized firms in difficult times, and 3) maintain sufficient cash reserves to grow our business pursuant to our strategic initiatives and to take advantage of unexpected opportunities that may arise. We have clearly demonstrated our commitment to returning capital to shareholders once we have satisfied our three objectives, as evidenced by the payment of $388.2 million to our shareholders through the six special dividends since December 2012,” said Mr. Gibson.\n“As we stated in previous releases, if, in the future, we find ourselves in a similar position and can fully satisfy the three objectives outlined above, it would be our intention to recommend to our Board of Directors to return capital to our shareholders in some amount depending on the competitive position of the Company and other strategic options that might be available to the Company, as well as the macro and micro economic conditions and the legal and regulatory environment at that time. As such, it is important to note that future special dividends, if declared, may vary in timing and amount as it relates to previous dividend payments,” said Mr. Gibson.\nAbout HFF, Inc.\nThrough its subsidiaries, Holliday Fenoglio Fowler, L.P., HFF Real Estate Limited, HFF Securities L.P. and HFF Securities Limited, HFF operates out of 25 offices and is one of the leading and largest full-service commercial real estate financial intermediaries, providing commercial real estate and capital markets services to both the consumers and providers of capital in the commercial real estate sector. The Company offers clients a fully-integrated capital markets platform including debt placement, investment advisory, equity placement, funds marketing, M&A and corporate advisory, loan sales and commercial loan servicing.\nCertain statements in this press release are “forward-looking statements” within the meaning of the federal securities laws. Statements about our beliefs and expectations and statements containing the words “may,” “could,” “would,” “should,” “believe,” “expect,” “anticipate,” “plan,” “estimate,” “target,” “project,” “intend” and similar expressions constitute forward-looking statements. These forward-looking statements involve known and unknown risks, uncertainties and other factors that may cause the Company’s actual results and performance in future periods to be materially different from any future results or performance suggested in forward-looking statements in this press release. Investors, potential investors and other readers are urged to consider these factors carefully in evaluating the forward-looking statements and are cautioned not to place undue reliance on such forward-looking statements. Any forward-looking statements speak only as of the date of this press release and, except to the extent required by applicable securities laws, the Company expressly disclaims any obligation to update or revise any of them to reflect actual results, any changes in expectations or any change in events. If the Company does update one or more forward-looking statements, no inference should be drawn that it will make additional updates with respect to those or other forward-looking statements. Factors that could cause results to differ materially include, but are not limited to: (1) general economic conditions and commercial real estate market conditions, including the recent conditions in the global markets and, in particular, the U.S. debt markets; (2) the Company’s ability to retain and attract transaction professionals; (3) the Company’s ability to retain its business philosophy and partnership culture; (4) competitive pressures; (5) the Company’s ability to integrate and sustain its growth; and (6) other factors discussed in the Company’s public filings, including the risk factors included in the Company’s most recent Annual Report on Form 10-K.\nAdditional information concerning factors that may influence HFF, Inc.'s financial information is discussed under \"Management's Discussion and Analysis of Financial Condition and Results of Operations,\" \"Quantitative and Qualitative Disclosures About Market Risk\" and \"Forward-Looking Statements\" in the Company’s most recent Annual Report on Form 10-K, as well as in the Company's press releases and other periodic filings with the Securities and Exchange Commission. Such information and filings are available publicly and may be obtained from the Company's web site at www.hfflp.com or upon request from the HFF, Inc. Investor Relations Department at investorrelations@hfflp.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180126005619/en/\nHFF, Inc.\nMARK D. GIBSON , 214-265-0880\nChief Executive Officer\nmgibson@hfflp.com\nor\nGREGORY R. CONLEY , 412-281-8714\nChief Financial Officer\ngconley@hfflp.com\nor\nMYRA F. MOREN , 713-852-3500\nManaging Director, Investor Relations\nmmoren@hfflp.com\nSource: HFF, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180126005619/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.hfflp.com&esheet=51749735&newsitemid=20180126005619&lan=en-US&anchor=www.hfflp.com&index=1&md5=d1a86145cc3de7d586dda9086c6a04e7"], "published": "2018-01-27T00:15:00.000+02:00", "crawled": "2018-01-27T02:24:36.000+02:00", "highlightTitle": ""}