{"organizations": [], "uuid": "a4302d452808bf360f1f31a7d4fd62a3ac8c2973", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180115.html", "section_title": "Archive News &amp; Video for Monday, 15 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/eurobank-balkans-strategy/greeces-eurobank-sees-balkan-units-doubling-profitability-deputy-ceo-idUSL8N1PA27E", "country": "US", "domain_rank": 408, "title": "Greece's Eurobank sees Balkan units doubling profitability -deputy CEO", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T06:05:00.000+02:00", "replies_count": 0, "uuid": "a4302d452808bf360f1f31a7d4fd62a3ac8c2973"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/eurobank-balkans-strategy/greeces-eurobank-sees-balkan-units-doubling-profitability-deputy-ceo-idUSL8N1PA27E", "ord_in_thread": 0, "title": "Greece's Eurobank sees Balkan units doubling profitability -deputy CEO", "locations": [], "entities": {"persons": [{"name": "stavros ioannou", "sentiment": "none"}], "locations": [{"name": "greece", "sentiment": "none"}, {"name": "balkan", "sentiment": "none"}, {"name": "nicosia", "sentiment": "none"}, {"name": "bulgaria", "sentiment": "none"}, {"name": "serbia", "sentiment": "none"}, {"name": "romania", "sentiment": "none"}, {"name": "banca transilvania", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "eurobank", "sentiment": "negative"}, {"name": "bancpost", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NICOSIA, Jan 16 (Reuters) - Eurobank will maintain its Balkan footprint in Bulgaria, Serbia and Cyprus after pulling out of Romania, its deputy CEO said on Tuesday, expecting the group’s subsidiaries there to double their profitability over the next few years.\nGreece’s third-largest lender by assets clinched a deal in November to sell its Romanian unit Bancpost to Banca Transilvania, Romania’s second-largest bank, as part of a restructuring plan agreed with European Union authorities.\nThat sale closed a decade-long chapter of ambitions by Eurobank and other Greek lenders to spread their wings abroad after the country’s debt crisis forced them to retreat and sell foreign subsidiaries to boost their capital ratios.\n“Foreign operations contribute more than 50 percent of the group’s profitability. Our immediate target is to grow this to 200 million euros (from 110 million),” Deputy Chief Executive Stavros Ioannou told reporters.\nExecutives said these countries have emerged from the financial crisis and their economies are now expanding by 3 to 4 percent annually, meaning there is room to grow lending to businesses and households.\nAfter deleveraging its non-Greek assets to 8.7 billion euros from about 11.2 billion, meeting commitments agreed with EU competition authorities, Eurobank is set to emerge as the lender with the largest international presence among its Greek peers.\nThe group was fast to pull out of Poland and Turkey at the onset of the global credit crisis in 2008 and sold its Ukraine operations in 2016.\n“Our strategy was to exit countries that were too large for us to become one of the five biggest banks there. To achieve this would take a lot of investment,” Ioannou said. “Romania required more investment for us to become a sizeable player.”\nBut in Bulgaria, where Eurobank bought the network of peer Alpha Bank, its unit Postbank is now the fifth largest bank by assets and the only Greek-owned franchise there after the sale UBB by peer National Bank and Piraeus Bank’s expected exit.\n“If we find a good opportunity in Bulgaria we will look into it,” Ioannou said. Profitable Postbank competes with big players Unicredit, Austria’s Raiffeisen and Societe Generale in Bulgaria.\nIn Serbia, profitable unit Eurobank Beograd is the seventh largest among 31 banks in the country while fully-owned Eurobank Cyprus has grown to the island’s third largest by deposits. (Editing by David Evans)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-16T06:05:00.000+02:00", "crawled": "2018-01-16T13:23:22.007+02:00", "highlightTitle": ""}