{"organizations": [], "uuid": "a10ff6e60d94333856116c74f3b4f752bcdeef9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-lactalis-to-acquire-siggis-to-further-grow-the-unique-yogurt-brand.html", "country": "US", "domain_rank": 767, "title": "Lactalis to Acquire siggi's to Further Grow the Unique Yogurt Brand", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.161, "site_type": "news", "published": "2018-01-05T07:59:00.000+02:00", "replies_count": 0, "uuid": "a10ff6e60d94333856116c74f3b4f752bcdeef9c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-lactalis-to-acquire-siggis-to-further-grow-the-unique-yogurt-brand.html", "ord_in_thread": 0, "title": "Lactalis to Acquire siggi's to Further Grow the Unique Yogurt Brand", "locations": [], "entities": {"persons": [{"name": "siggi", "sentiment": "none"}, {"name": "meijer", "sentiment": "none"}, {"name": "siggi hilmarsson", "sentiment": "none"}, {"name": "bart ad", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}, {"name": "iceland", "sentiment": "none"}], "organizations": [{"name": "unique yogurt brand", "sentiment": "negative"}, {"name": "stop & shop", "sentiment": "none"}, {"name": "publix", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 4, Lactalis has agreed to acquire siggi's – the U.S. based maker of Icelandic style skyr yogurts with \"simple ingredients, not a lot of sugar\" – for an undisclosed price.\nsiggi's was founded by Siggi Hilmarsson who, after moving to the U.S. from his native Iceland, began making yogurt in his kitchen in response to American yogurt, which he found too sweet and full of extra ingredients. The recipe was based on skyr, the Icelandic style yogurt Siggi grew up eating in his native Iceland. With seed investment from his former professor, Siggi started selling his yogurt at an outdoor market in downtown Manhattan in 2006. It is now the fastest growing yogurt in conventional grocery. siggi's is a top 5 selling yogurt brand in many mainstream grocery chains including Stop & Shop, Meijer and Publix and recently became the #1 selling yogurt brand overall in Whole Foods 1 .\nsiggi's will continue operating out of its New York City office and will remain a standalone company under its current senior leadership team, which includes its founder as CEO, and Bart Adlam as President.\n\"We're excited to join the Lactalis family which offers the opportunity to further fuel our growth,\" said Siggi Hilmarsson. \"Our core values of clean ingredient label and less sugar will remain 100 percent unchanged. Consumers everywhere are actively trying to reduce sugar in their diets so our offering has a global relevance.\"\nBart Adlam added, \"siggi's topline grew 50% in 2017 and we expect to match this in 2018 as we launch further innovations. We are excited to keep the momentum going with support from the largest dairy player in the world.\"\n\"We are delighted to welcome siggi's to the Lactalis Group, which further expands our yogurt platform in the U.S. with this unique and fast-growing yogurt brand. We look forward to supporting siggi's as it continues to bring its retail partners exceptional dollar growth in the yogurt category,\" said Emmanuel Besnier, President of the Lactalis Group.\nJ.P. Morgan Securities LLC acted as exclusive financial advisor and The Giannuzzi Group acted as legal counsel to siggi's, and Dentons US LLP acted as legal counsel to the Lactalis Group, on the sale. The acquisition is subject to expiration of the waiting period under the Hart-Scott-Rodino Antitrust Improvements Act in the United States.\nAbout Lactalis\nFounded in France over 80 years ago by André Besnier, the Lactalis family group is the world's largest dairy company, employing more than 75,000 people in 85 countries worldwide. Lactalis is active in all categories of the dairy market, and is the number one cheese manufacturer in the world. The Group's prestigious brands include Président®, Galbani®, Parmalat®, Stonyfield Farm®, Bridel, Rachel's Organic, and Skånemejerier. For more information, visit www.lactalis.fr/en/ .\nAbout siggi's\nsiggi's was founded in 2005 by Siggi Hilmarsson who, after moving to New York from Iceland, found American yogurt too sweet so he started making his own yogurt, with less sugar, in his home kitchen. His yogurt recipe was skyr which is the traditional strained yogurt of Iceland and has been made there for over 1,000 years. Siggi started selling his yogurts at an outdoor market in downtown New York in 2006 and in New York's famous Murray's Cheese store. Today siggi's products are available nationwide in retailers such as Whole Foods, Publix, Target, Wegmans and Starbucks. For information visit www.siggis.com .\n1 Source: Nielsen, 4 and 12 weeks ending 12.2.17\nView original content with multimedia: releases/lactalis-to-acquire-siggis-to-further-grow-the-unique-yogurt-brand-300578029.html\nSOURCE siggi’s", "external_links": ["http://www.prnewswire.com/news-releases/lactalis-to-acquire-siggis-to-further-grow-the-unique-yogurt-brand-300578029.html", "http://www.lactalis.fr/en/", "http://www.siggis.com/"], "published": "2018-01-05T07:59:00.000+02:00", "crawled": "2018-01-05T09:47:38.002+02:00", "highlightTitle": ""}