{"organizations": [], "uuid": "bc20c5812398b73dcdce71d6fb4a93cc1872fc10", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/logitech-results/logitech-ceo-upbeat-after-raising-guidance-for-second-time-idUSL8N1PI14P", "country": "US", "domain_rank": 408, "title": "Logitech CEO upbeat after raising guidance for second time", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T11:08:00.000+02:00", "replies_count": 0, "uuid": "bc20c5812398b73dcdce71d6fb4a93cc1872fc10"}, "author": "", "url": "https://www.reuters.com/article/logitech-results/logitech-ceo-upbeat-after-raising-guidance-for-second-time-idUSL8N1PI14P", "ord_in_thread": 0, "title": "Logitech CEO upbeat after raising guidance for second time", "locations": [], "entities": {"persons": [{"name": "darrell", "sentiment": "none"}, {"name": "john revill", "sentiment": "none"}, {"name": "bracken darrell", "sentiment": "none"}], "locations": [{"name": "zurich", "sentiment": "none"}], "organizations": [{"name": "logitech", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 9:11 AM / Updated 11 minutes ago Logitech CEO upbeat after raising guidance for second time John Revill 3 Min Read \nZURICH, Jan 23 (Reuters) - Logitech Chief Executive Bracken Darrell was upbeat on Tuesday after the computer peripheral maker increased its full-year guidance for the second time during its 2018 financial year following strong third-quarter results. \nThe maker of computer keyboards and mice, video conferencing devices and mobile speakers said sales rose 22 percent to $812 million during the three months ended Dec. 31, beating forecasts of $752 million in a Reuters poll. \nIt raised its profit and sales targets for the 2018 fiscal year, which ends on March 31. \n”It’s fun to be able to raise your guidance,“ Darrell told Reuters in an interview. ”Our expectation is that we will continue to have good strong growth. \n“This quarter we grew by 18 percent in constant currencies, the biggest rate since 2011. I wouldn’t guide for that in the next quarter, but we do expect 12 to 14 percent for the year, which is very strong and we would be very happy with that.” \nLogitech now expects annual operating income of $270-280 million, up from its previous range of $260-270 million. \nDarrell, a former Procter & Gamble and Whirlpool executive, has overseen a turnaround at Logitech since he became CEO in 2013 by speeding up the launch of new products and improving design. \nHe said the company’s strategy should work for the long term, but declined to say how the raised guidance would affect the full-year dividend. \nIts shares rose as much as 8 percent in Switzerland following the results before paring gains. “Logitech delivered a very strong quarter in terms of growth,” said Michel Foeth, an analyst at Bank Vontobel. \nNet profit fell after Logitech was hit by a one-off charge after having to write down $16 million in deferred tax assets in the United States following the country’s tax reform. \nDarrell said Logitech was close to resolving problems with a distribution centre in the Americas which meant the company had to run two sites at the same time. The issue weighed on gross margins. \nHe also saw further growth in gaming products, where Logitech makes fast keyboards, mice and headsets used by players of PC games like League of Legends and Counter Strike. (Editing by Michael Shields)", "external_links": [], "published": "2018-01-23T11:08:00.000+02:00", "crawled": "2018-01-23T11:30:45.000+02:00", "highlightTitle": ""}