{"organizations": [], "uuid": "affef133d229e68417b59914a3c58536da222b70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-cboe-global-markets-announces-general-counsels-planned-retirement-and-successors-appointment.html", "country": "US", "domain_rank": 767, "title": "Cboe Global Markets Announces General Counsel's Planned Retirement and Successor's Appointment", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T20:30:00.000+02:00", "replies_count": 0, "uuid": "affef133d229e68417b59914a3c58536da222b70"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-cboe-global-markets-announces-general-counsels-planned-retirement-and-successors-appointment.html", "ord_in_thread": 0, "title": "Cboe Global Markets Announces General Counsel's Planned Retirement and Successor's Appointment", "locations": [], "entities": {"persons": [{"name": "moffic-silver", "sentiment": "none"}, {"name": "currentl", "sentiment": "none"}, {"name": "joanne moffic-silver", "sentiment": "none"}, {"name": "patrick sexton", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "cboe", "sentiment": "negative"}, {"name": "cboe global markets announces general counsel", "sentiment": "negative"}, {"name": "cboe global markets, inc.", "sentiment": "neutral"}, {"name": "cme group", "sentiment": "none"}, {"name": "national law journal", "sentiment": "none"}, {"name": "northwestern university pritzker school of law", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 10, 2018 /PRNewswire/ -- Cboe Global Markets, Inc. (Cboe: CBOE | Nasdaq: CBOE) today announced the planned retirement of its Executive Vice President, General Counsel and Corporate Secretary Joanne Moffic-Silver, after 37 years of service to the company, on February 28, 2018. Cboe plans to promote Patrick Sexton, currently Deputy General Counsel, to Executive Vice President, General Counsel and Corporate Secretary, effective March 1, 2018.\nMs. Moffic-Silver joined Cboe in 1980, serving as Chief Enforcement Counsel, Associate General Counsel and Corporate Secretary until her promotion in 1997 to Executive Vice President and General Counsel. Previously, she served as a staff attorney at CME Group. Ms. Moffic-Silver holds a J.D. degree with honors from the Northwestern University Pritzker School of Law.\nDuring her tenure, Cboe's Legal Division grew in size, strength and diversity from six lawyers in Chicago to more than 20 lawyers in multiple locations, and was named regional Legal Department of the Year in Corporate Compliance in 2015 by the National Law Journal. Currently, Ms. Moffic-Silver is overseeing the integration of Cboe's U.S. and London legal teams, following the acquisition of Bats Global Markets, Inc. (Bats) last year, and serves as counsel to the Cboe Global Markets board, several of its committees, its six subsidiary exchanges, and its executive management and planning teams.\nMs. Moffic-Silver's many accomplishments include successfully defending Cboe exclusive proprietary products through litigation that went all the way to the U.S. Supreme Court, as well as managing an eight-year patent infringement defense litigation that resulted in a dismissal. She also played a lead role in connection with major product launches, Cboe's demutualization and IPO in 2010, and the Bats acquisition in 2017, an expansion that made Cboe one of the world's largest exchange holding companies.\nCboe Global Markets Chairman and CEO Ed Tilly said: \"Joanne's contributions to Cboe have been unparalleled. Her legal acumen and expertise combined with extensive knowledge of the financial services industry, as well as her strong long- term relationships with Cboe regulators, have been instrumental in guiding our company successfully through challenges and numerous transformative growth initiatives.\"\nMs. Moffic-Silver said: \"My tenure at Cboe has been an exceptional opportunity and experience, and I am confident my exemplary team, along with the new combined executive team, is ready and able to continue the path we have forged. After leaving Cboe, I plan to expand my service on boards, my mentoring in the legal and financial services industries, and my participation in various women's leadership forums, including the Chicago Network, Women in Finance, Women in Listed Derivatives and the American Bar Association.\"\n\"I am confident in Pat Sexton's leadership abilities, and look forward to working with him to continue the success of Cboe Global Markets under his guidance,\" Mr. Tilly added.\nMr. Sexton, age 53, currently serves as Deputy General Counsel of Cboe. He has acted as legal, regulatory and compliance counsel with increasing responsibility and oversight since joining the company in 1997. Mr. Sexton played a significant role in Cboe's demutualization in 2010, and has since supervised functional legal areas related to public company obligations, litigation, and regulatory matters, among others. Mr. Sexton holds a B.A. degree from the University of Notre Dame and a J.D. degree with honors from Notre Dame Law School.\nAbout Cboe Global Markets, Inc.\nCboe Global Markets, Inc. (Cboe: CBOE | Nasdaq: CBOE) is one of the world's largest exchange holding companies, offering cutting-edge trading and investment solutions to investors around the world. The company is committed to relentless innovation, connecting global markets with world-class technology, and providing seamless solutions that enhance the customer experience.\nCboe offers trading across a diverse range of products in multiple asset classes and geographies, including options, futures, U.S. and European equities, exchange-traded products (ETPs), global foreign exchange (FX) and multi-asset volatility products based on the Cboe Volatility Index (VIX Index), the world's barometer for equity market volatility.\nCboe's trading venues include the largest options exchange in the U.S. and the largest stock exchange by value traded in Europe. In addition, the company is the second-largest stock exchange operator in the U.S. and a leading market globally for ETP trading.\nThe company is headquartered in Chicago with offices in Kansas City, New York, London, San Francisco, Singapore, Hong Kong and Quito, Ecuador. For more information, visit www.cboe.com .\nMedia Contacts\nAnalyst Contact\nSuzanne Cosgrove\nHannah Randall\nStacie Fleming\nDebbie Koopman\n+1-312-786-7123\n+1-646-856-8809\n+44-20-7012-8950\n+1-312-786-7136\ncosgrove@cboe.com\nhrandall@cboe.com\nsfleming@cboe.com\nkoopman@cboe.com\nCBOE-C\nCBOE-OE\nCboe®, Cboe Volatility Index®, and VIX® are registered trademarks and Cboe Global Markets SM is a service mark of Cboe Exchange, Inc. All other trademarks and service marks are the property of their respective owners.\nView original content with multimedia: http://www.prnewswire.com/news-releases/cboe-global-markets-announces-general-counsels-planned-retirement-and-successors-appointment-300580834.html\nSOURCE Cboe Global Markets, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/cboe-global-markets-announces-general-counsels-planned-retirement-and-successors-appointment-300580834.html", "http://www.cboe.com/"], "published": "2018-01-10T20:30:00.000+02:00", "crawled": "2018-01-10T20:07:54.017+02:00", "highlightTitle": ""}