{"organizations": [], "uuid": "f59f9290339c11c37c75697999542d266dedda5a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222758579&w=1200&r=LYNXMPEE0G15B", "site_section": "http://feeds.reuters.com/reuters/politicsNews", "section_title": "Reuters: Politics", "url": "https://www.reuters.com/article/us-usa-trump-russia/trumps-ex-aide-bannon-strikes-deal-to-avoid-grand-jury-testimony-cnn-idUSKBN1F61Y7", "country": "US", "domain_rank": 408, "title": "Trump's ex-aide Bannon strikes deal to avoid grand jury testimony: CNN", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T17:23:00.000+02:00", "replies_count": 0, "uuid": "f59f9290339c11c37c75697999542d266dedda5a"}, "author": "", "url": "https://www.reuters.com/article/us-usa-trump-russia/trumps-ex-aide-bannon-strikes-deal-to-avoid-grand-jury-testimony-cnn-idUSKBN1F61Y7", "ord_in_thread": 0, "title": "Trump's ex-aide Bannon strikes deal to avoid grand jury testimony: CNN", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "bannon", "sentiment": "negative"}, {"name": "mueller", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "susan heavey", "sentiment": "none"}, {"name": "robert mueller", "sentiment": "none"}, {"name": "tim ahmann", "sentiment": "none"}, {"name": "steve bannon", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "cnn", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "new york times", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "cnn reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 3:23 PM / Updated an hour ago Trump ex-aide Bannon agrees to Mueller probe interview, avoiding grand jury Reuters Staff 3 Min Read \nWASHINGTON (Reuters) - Former White House strategist Steve Bannon has reached agreement with U.S. Special Counsel Robert Mueller to be interviewed by Mueller’s investigators rather than appearing before a grand jury, a source familiar with the matter said on Wednesday. \nBannon, who was a close adviser during President Donald Trump’s 2016 election campaign and in his first months in office, had been subpoenaed to testify before a grand jury in Mueller’s probe of links between Russia and Trump’s campaign. \nBut the source, who spoke on condition of anonymity, said Mueller offered Bannon the option of being interviewed instead, and that Bannon accepted. It was unclear when the interview would take place. \nAn interview with prosecutors would allow Bannon to have an attorney present during his appearance, as lawyers are not permitted in grand jury rooms. \nA spokesman for Mueller declined to comment on the agreement, first reported by CNN. A lawyer who represented Bannon in an appearance before the House of Representatives Intelligence Committee on Tuesday could not be immediately reached. \nBannon was fired from his White House job in August as the president sought to bring more order to his staff operations. Former Trump campaign manager Corey Lewandowski arrives to meet with the House Intelligence Committee, about their ongoing probe of alleged Russian interference in the 2016 U.S. election, at the U.S. Captiol in Washington, U.S. January 17, 2018. REUTERS/Jonathan Ernst \nEarlier this month, Trump attacked Bannon for comments he made to Michael Wolff, the author of a book highly critical of the president and his family. They included scathing remarks about Donald Trump Jr., the president’s eldest son, for meeting during the campaign with a Russian lawyer who was said to have damaging information on Democratic candidate Hillary Clinton. \nMueller is investigating any potential collusion by Trump’s campaign with Moscow in alleged Russian meddling in the 2016 campaign. Russia denies such interference and Trump has denied any collusion. \nAccording to a person familiar with the arrangement, the attorney who represented Bannon for Tuesday’s House appearance, William Burck, is not representing him in connection with Mueller’s investigation. The person said they did not believe Bannon had hired a counsel for that yet. \nTwo other Trump associates, White House Deputy Chief of Staff Rick Dearborn, and former campaign manager Corey Lewandowski, were due to appear before the House panel behind closed doors on Wednesday, congressional sources said. \nCommittee aides were not immediately available to comment. \nThe House Intelligence Committee is conducting one of three congressional investigations of the Russia issue, separate from Mueller’s probe. Reporting by Karen Freifeld, Patricia Zengerle, Susan Heavey and Jonathan Landay; Writing by Tim Ahmann and Warren Strobel; Editing by Frances Kerry", "external_links": [], "published": "2018-01-17T17:23:00.000+02:00", "crawled": "2018-01-17T17:35:36.007+02:00", "highlightTitle": ""}