{"organizations": [], "uuid": "8dcf8135d54fbe2ed6284561bcd67ef49de94d6f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/12/iran-tehran-protests.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/02/2018-financial-outlook-eurasia/", "country": "US", "domain_rank": 1196, "title": "2018 Is Ripe for a 'Big Unexpected Crisis,' Eurasia Says | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.827, "site_type": "news", "published": "2018-01-02T11:56:00.000+02:00", "replies_count": 0, "uuid": "8dcf8135d54fbe2ed6284561bcd67ef49de94d6f"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/02/2018-financial-outlook-eurasia/", "ord_in_thread": 0, "title": "2018 Is Ripe for a 'Big Unexpected Crisis,' Eurasia Says | Fortune", "locations": [], "entities": {"persons": [{"name": "francine lacqua", "sentiment": "none"}, {"name": "ian bremmer", "sentiment": "none"}, {"name": "tom keene", "sentiment": "none"}], "locations": [{"name": "beijing", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "eurasia group", "sentiment": "none"}, {"name": "eurasia", "sentiment": "none"}, {"name": "bloomberg television", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg 9:56 AM EST \nThis year could see a geopolitical crisis on the scale of the financial crash a decade ago, Eurasia Group warned in its annual outlook. \nDescribing global political challenges as “daunting,” the New York-based political risk consultancy said that “if we had to pick one year for a big unexpected crisis — the geopolitical equivalent of the 2008 financial meltdown — it feels like 2018.” The biggest uncertainty surrounds China’s move to fill a vacuum as U.S. influence continues to decline, stoking tensions between the two powers, it said. That’s likely to affect economics as well. \n“We see a much greater fragmentation of the global marketplace because governments are becoming more interventionist,” Eurasia President Ian Bremmer said in a Bloomberg Television interview with Tom Keene and Francine Lacqua. “Part of that is because the Chinese have an alternative model for their investments and they’re increasingly going to be seen as the most important driver of other economies around the world who will align themselves more with Beijing than with Washington.” \nHere are some of Eurasia’s biggest worries in 2018: China \nPresident Xi Jinping’s successful consolidation of authority is helping him to fill the gap created by U.S. President Donald Trump’s move away from Washington-led multilateralism. In areas such as trade and investment, technology and values, China is setting international standards with less resistance than ever before. \n“For most of the West, China is not an appealing substitute,” Eurasia said. “But for most everybody else, it is a plausible alternative. And with Xi ready and willing to offer that alternative and extend China’s influence, that’s the world’s biggest risk this year.” Miscalculations \nThere are too many places where a misstep or misjudgment could provoke serious international conflict. Cyberattacks, North Korea, Syria, Russia and terrorism are some of the risks that could trigger a mistake that leads to confrontation. \n“We aren’t on the brink of World War III,” Eurasia said. “But absent a global security underwriter, and with a proliferation of subnational and non-state actors capable of destabilizing action, the world is a more dangerous place.” Technology Cold War \nAs rapid technological developments reshape the economic and political order, the process will be messy. Fault lines include a struggle for market dominance, fragmentation and a race for new technologies. \n“As our cars, homes, factories, and public infrastructure begin to generate mountains of data, and as connectivity morphs into augmented reality, a new generation of humans will be ‘on the grid’ around the clock, with important implications for society and geopolitics,” Eurasia said. “But until we get there, it’s the world’s biggest fight over economic power.” Iran \nRelations between the U.S. and Iran in 2018 will be a source of broad geopolitical and market risk. If the nuclear deal doesn’t survive the year, the Middle East could be pushed into a real crisis. \n“Trump has it in for Iran,” Eurasia said. “Rightly or wrongly, he sees the country as the root of much evil in the world.” Protectionism \nProtectionism will make further inroads led by populism, state capitalism and heightened geopolitical tensions. Governments are also intervening in the digital economy and innovation-intensive industries to preserve intellectual property and related technologies. \n“The rise of anti-establishment movements in developed markets has forced (in some cases, enabled) policy makers to shift toward a more mercantilist approach to global economic competition and to look as if they’re doing something about lost jobs,” Eurasia said. “Walls are going up.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-02T11:56:00.000+02:00", "crawled": "2018-01-02T17:15:23.034+02:00", "highlightTitle": ""}