{"organizations": [], "uuid": "18054158b521f784dbc9e47b959116676320e86f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/morrisons-outlook/update-1-uks-morrisons-beats-forecasts-for-christmas-trading-idUSL8N1P40X8", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Morrisons and Tesco shine in Christmas sales battle", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T12:32:00.000+02:00", "replies_count": 0, "uuid": "18054158b521f784dbc9e47b959116676320e86f"}, "author": "", "url": "https://www.reuters.com/article/morrisons-outlook/update-1-uks-morrisons-beats-forecasts-for-christmas-trading-idUSL8N1P40X8", "ord_in_thread": 0, "title": "UPDATE 2-Morrisons and Tesco shine in Christmas sales battle", "locations": [], "entities": {"persons": [{"name": "james davey", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "tesco", "sentiment": "negative"}, {"name": "asda", "sentiment": "none"}, {"name": "lidl", "sentiment": "none"}, {"name": "brc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "morrisons", "sentiment": "none"}, {"name": "aldi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 7:26 AM / Updated 10 minutes ago UPDATE 3-Morrisons, Tesco and discounters stand out in Christmas battle Reuters Staff \n* Morrisons beats forecasts with Christmas sales up 2.8 pct \n* Morrisons shares rise as much as 4.8 pct \n* Surveys show Tesco the best ‘big 4’ performer at Christmas \n* Discounters Aldi and Lidl still winning market share \n* Squeezed UK shoppers focus on food, drink over Christmas (Adds detail on discounters, analyst comment, updates shares) \nBy James Davey \nLONDON, Jan 9 (Reuters) - Britain’s fourth biggest supermarket chain Morrisons beat sales growth forecasts over Christmas while industry data indicated market leader Tesco outperformed smaller listed rivals during the festive season. \nThe survey data from both Kantar Worldpanel and Nielsen showed Tesco enjoyed the strongest performance of Britain’s big four chains over the Christmas quarter with total sales growth put at 3.1 percent and 3.4 percent respectively. \nThe data showed second placed Sainsbury’s and third ranked Asda performed solidly, but also that privately-owned German discounters Aldi UK and Lidl UK continued to outpace the sales growth of all the big four, winning market share from all but Tesco. \nAt Christmas discounters have historically lost market share compared with earlier in the year as many shoppers trade up to the big four in search of quality favourites. \n“Rising to the challenge, Aldi and Lidl collectively managed to attract nearly one million additional households during the past three months,” said Fraser McKevitt, head of retail at Kantar Worldpanel. \nThough their total sales growth of 16.8 percent in the 12 weeks to Dec. 31 was boosted by store openings, it also reflected work to improve premium ranges - in Aldi’s case products such as Aberdeen Angus beef roasting joints and Irish cream liqueur. \nAldi and Lidl have both said this month they will step-up investment in 2018. PRIORITISING FOOD AND DRINK \nWith Britons facing pressure from slow wage growth and the jump in inflation that followed the 2016 Brexit vote, company updates and data this month have shown they prioritised spending on food and drink over the holiday season. \nShoppers cut back on almost everything else in the last three months of 2017, causing the biggest fall in non-grocery spending since 2009, figures from the British Retail Consortium (BRC) showed on Tuesday. \n“The divergence between growth in sales of food and non-food has never been so stark,” BRC CEO Helen Dickinson said. \nShares in Morrisons were up 1.7 percent at 1250 GMT after its trading update showed it attracted more customers with competitive prices, expanded premium ranges and an improved online range. \nThough Kantar said grocery inflation was 3.7 percent in the 12 weeks to Dec. 31, analysts at Bernstein said consumers were “dialing out” about 50 percent of that by switching to cheaper products, meaning there was still some volume growth. \nShares in Sainsbury’s were up 2 percent, while Tesco was down 0.8 percent, having risen 12 percent over the last three months. \nSainsbury’s and Lidl will publish updates on Wednesday, with Tesco to follow on Thursday. BROADER BUSINESS \nBradford, northern England-based Morrisons said like-for-like sales, excluding fuel, rose 2.8 percent in the 10 weeks to Jan. 7 - ahead of analysts’ average forecast of 1.7 percent and third quarter growth of 2.5 percent. It said like-for-likes volumes were up. \nUnder CEO David Potts, Morrisons is trying to broaden its business by improving the performance of its 500 UK stores while also pursuing growth in online and wholesale markets. Its performance comprised retail growth of 2.1 percent and wholesale growth of 0.7 percent. \n“We were able to differentiate in range, value and service enough for increasing numbers of customers to choose Morrisons,” former Tesco executive Potts told reporters. \nHe said the total price of Morrisons’ basket of 100 key Christmas items was held at last year’s level. \nBut despite beating sales forecasts, Morrisons said its profit expectations for 2017-18 were unchanged. \nPrior to Tuesday’s update, analysts’ average forecast for 2017-18 underlying pretax profit was 371 million pounds ($503 million), up from 337 million pounds in 2016-17. \nPotts joined Morrisons in 2015 to lead a recovery after it was badly hurt by the discounters’ rise in its northern heartland and the strategy failures of previous management. \nHe has now delivered over two years of underlying sales growth but has a long way to go to reach previous profit levels. Morrisons made 935 million pounds in 2011-12. ($1 = 0.7374 pounds) (Additional reporting by Paul Sandle; Editing by Keith Weir and Mark Potter)", "external_links": [], "published": "2018-01-09T12:32:00.000+02:00", "crawled": "2018-01-09T12:50:57.037+02:00", "highlightTitle": ""}