{"organizations": [], "uuid": "5d754f59b21ec290575876449a7990b0a5f3136a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/06/03/102729740-RTX1CZDN.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/19/us-stocks-government-shutdown-earnings.html", "country": "US", "domain_rank": 767, "title": "Dow slips 49 points as worries of government shutdown loom", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T17:30:00.000+02:00", "replies_count": 0, "uuid": "5d754f59b21ec290575876449a7990b0a5f3136a"}, "author": "Fred Imbert", "url": "https://www.cnbc.com/2018/01/19/us-stocks-government-shutdown-earnings.html", "ord_in_thread": 0, "title": "Dow slips 49 points as worries of government shutdown loom", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "b. riley", "sentiment": "none"}, {"name": "mick mulvaney", "sentiment": "none"}, {"name": "art hogan", "sentiment": "none"}], "locations": [], "organizations": [{"name": "senate", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "office of management and budget", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "S&P 500 and Nasdaq notch record close as Street shrugs off government shutdown worries The S&P 500 and Nasdaq hit record highs on Friday. Equities have seen an increase in volatility this week amid government shutdown worries. 2 Hours Ago | 03:48 \nStocks closed higher on Friday as investors shrugged off worries about a possible government shutdown. \nThe S&P 500 rose 0.4 percent to close at 2,810.30, a record high, with consumer staples as the best-performing sector. The Nasdaq composite climbed 0.6 percent to finish at 7,336.38, also a record. \n\"The prospect of a government shutdown isn't putting a lid on this boiling market—investors simply aren't fazed,\" said Mike Loewengart, vice president of investment strategy at E-Trade. \"For traders, many are looking beyond the beltway and finding fundamentals in US companies as sound as they've been in a long time.\" \nThe Dow Jones industrial average closed 53.91 points higher at 26,071.72, despite pullbacks in IBM and American Express. Symbol NASDAQ --- \nOn Thursday, the House passed a bill to keep the government open. The bill is now in the Senate's hands, where 60 votes are needed to send it to President Donald Trump's desk. Republicans only hold 51 seats in the Senate. \nHistorically, a government shutdown has led to a short-term pullback in the stock market. \nMick Mulvaney, chief of the Office of Management and Budget, said Friday that odds of a shutdown occurring are 50-50 . Meanwhile, Goldman Sachs thinks there is a 60 percent chance the government shuts down. In a note, Goldman said a shutdown \"seems more likely than not because both sides appear to think they could gain from a shutdown.\" \nEquities have seen an increase in volatility this week. On Tuesday, stocks closed lower in a major reversal that knocked them off of record highs. \n\"The noise we're hearing out of Washing doesn't sound like they're close,\" said Art Hogan. chief market strategist at B. Riley FBR. \"If you were looking for a reason to be cautious, that might be it.\" \nStill, the major indexes posted weekly gains. The Dow rose 1 percent for the week, while the S&P 500 and Nasdaq gained 0.9 percent and 1 percent, respectively. The major averages also hit record highs as earnings season rolled on. Andrew Harrer | Bloomberg | Getty Images A man poses for a photo with the Wall Street bull sculpture between Broadway and Exchange Place in the Financial District of New York. \nEarnings season kicked into full gear this week, with most results surpassing expectations. Of the companies that have reported quarterly results as of Friday morning, 79 percent have exceeded earnings expectations while 89 percent have surpassed sales estimates, according to Nick Raich, CEO of The Earnings Scout. \nMorgan Stanley and American Express are among the companies that reported better-than-expected results this week. \n\"This reporting season should confirm continuity of synchronized global growth and start to provide clarity on the impact of tax reform on earnings and prospects for rising shareholder distributions,\" Dubravko Lakos-Bujas, head of U.S. equity strategy at J.P. Morgan, said in a note Friday. \nInvestors have   over the past four weeks as they try   surging stock market . Year to date, stocks are up about 5 percent. \nIBM and American Express dropped 4.1 percent and 2.4 percent, respectively, putting a lid on the Dow. IBM warned Thursday it could take a hit from a higher tax rate for 2018, while American Express posted its first overall earnings loss in 25 years. \nElsewhere, the 10-year yield hit its highest level since 2014, reaching 2.642 percent. \"If we continue higher on yields, at some point it's going to impact equities,\" said JJ Kinahan, chief market strategist at TD Ameritrade. \"But right now, the market can take higher rates\" since the economy and earnings are strong.", "external_links": [], "published": "2018-01-19T17:30:00.000+02:00", "crawled": "2018-01-19T18:08:41.003+02:00", "highlightTitle": ""}