{"organizations": [], "uuid": "b25c90536aca54713d624071913529c53a4203f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/business-wire-reliant-bancorp-inc-completes-merger-with-community-first-inc.html", "country": "US", "domain_rank": 767, "title": "Reliant Bancorp, Inc. Completes Merger with Community First, Inc.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T16:30:00.000+02:00", "replies_count": 0, "uuid": "b25c90536aca54713d624071913529c53a4203f4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/business-wire-reliant-bancorp-inc-completes-merger-with-community-first-inc.html", "ord_in_thread": 0, "title": "Reliant Bancorp, Inc. Completes Merger with Community First, Inc.", "locations": [], "entities": {"persons": [], "locations": [{"name": "tenn.", "sentiment": "none"}, {"name": "tenn. & columbia", "sentiment": "none"}, {"name": "brentwood", "sentiment": "none"}, {"name": "columbia", "sentiment": "none"}, {"name": "tennessee", "sentiment": "none"}, {"name": "nashville-davidson-murfreesboro-franklin", "sentiment": "none"}], "organizations": [{"name": "community first, inc", "sentiment": "neutral"}, {"name": "reliant bancorp, inc", "sentiment": "neutral"}, {"name": "tn metropolitan statistical area", "sentiment": "none"}, {"name": "community first bank & trust", "sentiment": "none"}, {"name": "community first", "sentiment": "none"}, {"name": "bancorp, inc.", "sentiment": "none"}, {"name": "commerce union bancshares, inc.", "sentiment": "none"}, {"name": "reliant bank", "sentiment": "none"}, {"name": "reliant bancorp", "sentiment": "none"}, {"name": "community first, inc.", "sentiment": "none"}, {"name": "reliant bancorp, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Stock Begins Trading Under RBNC Ticker\nBRENTWOOD, Tenn. & COLUMBIA, Tenn.--(BUSINESS WIRE)-- Reliant Bancorp, Inc., formerly Commerce Union Bancshares, Inc. (“Reliant Bancorp”) (Nasdaq: RBNC), the parent company for Reliant Bank, announced today that it completed its previously announced merger with Community First, Inc. (“Community First”), located in Columbia, Tennessee, on January 1, 2018. Reliant Bank, Reliant Bancorp’s wholly owned bank subsidiary, and Community First Bank & Trust, Community First’s wholly owned bank subsidiary, also merged effective January 1, 2018, with Reliant Bank surviving.\nReliant Bancorp also announced that its common stock began trading under the new ticker symbol “RBNC” effective January 2, 2018. On December 31, 2017, the company changed its corporate name to Reliant Bancorp, Inc. following shareholder approval of the name change in mid-December 2017.\nThe Community First merger creates the fourth largest community bank by assets headquartered in the Nashville-Davidson-Murfreesboro-Franklin, TN Metropolitan Statistical Area, based upon financial data as of September 30, 2017. On a pro forma basis as of September 30, 2017, the combined company has total assets of approximately $1.5 billion, total deposits of approximately $1.3 billion, and gross loans of approximately $1.1 billion. Post-transaction, Reliant Bank operates 15 branches, two loan and deposit production offices, and two mortgage services locations throughout Middle Tennessee and Chattanooga.\nDeVan D. Ard, Jr., Chairman, President, and Chief Executive Officer of Reliant Bancorp, commented, “We are excited to announce the closing of the merger with Community First effective January 1, 2018. The addition of Community First’s assets, loans and deposits will be an important part of our continued growth in 2018. We expect to report record assets, loans and deposits for Reliant Bancorp for 2017, prior to the closing of our merger with Community First. We look forward to building the Reliant brand across our markets in Middle Tennessee and Chattanooga.”\nAbout Reliant Bancorp and Reliant Bank\nReliant Bancorp, Inc. is a Brentwood, Tennessee-based bank holding company which operates banking centers in Davidson, Robertson, Sumner, Williamson, Maury and Hickman counties, Tennessee along with loan and deposit production offices in Rutherford and Hamilton counties, Tennessee, through its wholly-owned subsidiary Reliant Bank. Reliant Bank is a full-service commercial bank that offers a variety of deposit, lending and mortgage products and services to business and consumer customers. As of September 30, 2017, Reliant Bancorp had approximately $1 billion in total assets, approximately $749 million in loans and approximately $840 million in deposits. For additional information, locations and hours of operation, please visit their website at www.reliantbank.com .\nForward Looking Statements\nAll statements, other than statements of historical fact, included in this release are “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, and are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. The words “believe,” “anticipate,” “expect,” “may,” “will,” “assume,” “should,” “predict,” “could,” “would,” “intend,” “targets,” “estimates,” “projects,” “plans,” “potential” and other similar words and expressions of the future are intended to identify such forward-looking statements, but other statements not based on historical information may also be considered forward-looking, including statements about the benefits to Reliant Bancorp of the Community First merger, Reliant Bancorp’s future financial and operating results (including the anticipated impact of the transaction on the combined company’s earnings per share and tangible book value) and Reliant Bancorp’s plans, objectives and intentions.\nAll forward-looking statements are subject to risks, uncertainties and other factors that may cause the actual results, performance or achievements of Reliant Bancorp to differ materially from any results, performance or achievements expressed or implied by such forward-looking statements. Such factors include, among others, (1) the risk that the cost savings and any revenue synergies from the Community First merger may not be realized or take longer than anticipated to be realized, (2) the ability of Reliant Bancorp to meet expectations regarding the accounting and tax treatment of the transaction, (3) the effect of the announcement or completion of the transaction on employee and customer relationships and operating results (including, without limitation, difficulties in maintaining relationships with employees and customers), (4) the risk that integration of Community First’s operations with those of Reliant Bancorp will be materially delayed or will be more costly or difficult than expected, (5) the amount of costs, fees, expenses, and charges related to the transaction, (6) reputational risk and the reaction of the parties’ customers, suppliers, employees or other business partners to the transaction, (7) the dilution caused by Reliant Bancorp’s issuance of additional shares of its common stock in the transaction, and (8) general competitive, economic, political and market conditions. Additional factors which could affect the forward-looking statements can be found in Reliant Bancorp’s (formerly Commerce Union Bancshares, Inc.) annual report on Form 10-K, quarterly reports on Form 10-Q, and current reports on Form 8-K filed with the Securities and Exchange Commission (the “SEC”) and available on the SEC’s website at http://www.sec.gov . Reliant Bancorp believes the forward-looking statements contained herein are reasonable; however, undue reliance should not be placed on any forward-looking statements, which are based on current expectations and speak only as of the date that they are made. Reliant Bancorp disclaims any obligation to update or revise any forward-looking statements contained in this release, which speak only as of the date hereof, whether as a result of new information, future events or otherwise.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180102005134/en/\nReliant Bancorp, Inc.\nDeVan Ard, 615-221-2020\nChairman, President and Chief Executive Officer\nSource: Reliant Bancorp, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180102005134/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.reliantbank.com&esheet=51735759&newsitemid=20180102005134&lan=en-US&anchor=www.reliantbank.com&index=1&md5=c7c6746860940e78f1c8f68a88342d81", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51735759&newsitemid=20180102005134&lan=en-US&anchor=http%3A%2F%2Fwww.sec.gov&index=2&md5=82f7ed6318da3abb91758df1a6bc8801"], "published": "2018-01-02T16:30:00.000+02:00", "crawled": "2018-01-02T16:33:39.000+02:00", "highlightTitle": ""}