{"organizations": [], "uuid": "3f34f82c0f972d5aac3e76b4fc60b0bb38ae3ff2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/09/22/103962817-GettyImages-107158537.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/23/dollar-skids-to-3-year-low-as-mnuchin-welcomes-currency-weakness.html", "country": "US", "domain_rank": 767, "title": "Dollar skids to 3-year low as Mnuchin welcomes currency weakness", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.016, "site_type": "news", "published": "2018-01-24T09:55:00.000+02:00", "replies_count": 0, "uuid": "3f34f82c0f972d5aac3e76b4fc60b0bb38ae3ff2"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/23/dollar-skids-to-3-year-low-as-mnuchin-welcomes-currency-weakness.html", "ord_in_thread": 0, "title": "Dollar skids to 3-year low as Mnuchin welcomes currency weakness", "locations": [], "entities": {"persons": [{"name": "mnuchin", "sentiment": "negative"}, {"name": "stephen gallo", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "steven mnuchin", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "bmo capital markets", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "u.s. federal reserve", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The dollar slid to a three-year low against a basket of major peers on Wednesday after the U.S. Treasury secretary said he welcomed weakness in the currency, as investors worried about President Donald Trump 's protectionist agenda.\nIn a break with the traditional strong dollar mantra, Treasury Secretary Steven Mnuchin said the weaker dollar was positive for American trade. He was speaking at the World Economic Forum in Davos on the eve of Trump's arrival at the Swiss resort.\nMnuchin's comments provided a fresh trigger for selling of the dollar, which has been on the back foot for months on the view that the U.S. Federal Reserve is no longer the only game in town when it comes to tighter monetary policy, as growth in other regions - in Europe in particular - picks up speed.\n\"The Mnuchin comments have helped feed it (the weaker dollar) a little bit, but they certainly didn't get the move going in the first place,\" said BMO Capital Markets currency strategist Stephen Gallo, in London.\n\"He gave the green light for benign neglect of the currency, in the short run. It's going down for a number of fundamental reasons and he's saying he's not going to stop it.\"\nshow chapters This investment strategist is still bearish on the dollar 12:28 AM ET Tue, 23 Jan 2018 | 02:01 The dollar index , which measures the greenback's value against a basket of six major currencies, fell below the 90.00 threshold for the first time since December 2014 on Wednesday. It was last down 0.95 percent at 89.26.\nWhite House officials said on Tuesday that Trump would use his speech at Davos on Friday to stress his \"America First\" policies.\nUnder that agenda, Trump has threatened to withdraw from the North American Free Trade Agreement, disavowed the global climate change accord and criticised global institutions including the United Nations and NATO.\n\"It feels like the next few weeks could be a watershed moment for world trade and protectionism,\" ING currency strategist Viraj Patel said in London.\n\"(Trump's) 'America First' ideology...remains a risk strategy for the dollar and for a U.S. economy that relies on the kindness of strangers to fund its structural external deficit,\" he added.\nAs the dollar fell broadly, the euro touched a fresh three-year peak of $1.2391, while sterling soared to its highest level since Britain's June 2016 vote to leave the European Union, at $1.4223.\nInvestors are keenly awaiting the European Central Bank 's meeting on Thursday for clues on the outlook for monetary policy in the euro zone.\nAgainst the yen , the dollar fell below the 110 threshold for the first time in four months, last trading down 1.15 percent at 109.02 yen.", "external_links": [], "published": "2018-01-24T09:55:00.000+02:00", "crawled": "2018-01-24T19:06:46.007+02:00", "highlightTitle": ""}