{"organizations": [], "uuid": "553b19dbf84eed7af4d5888abad488a8a0a5bf30", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/08/104934137-GettyImages-902753408.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/08/these-celebrities-want-oprah-winfrey-to-run-for-president-in-2020.html", "country": "US", "domain_rank": 767, "title": "These celebrities want Oprah Winfrey to run for president in 2020", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.844, "site_type": "news", "published": "2018-01-08T21:03:00.000+02:00", "replies_count": 0, "uuid": "553b19dbf84eed7af4d5888abad488a8a0a5bf30"}, "author": "Zameena Mejia", "url": "https://www.cnbc.com/2018/01/08/these-celebrities-want-oprah-winfrey-to-run-for-president-in-2020.html", "ord_in_thread": 0, "title": "These celebrities want Oprah Winfrey to run for president in 2020", "locations": [], "entities": {"persons": [{"name": "oprah winfrey", "sentiment": "negative"}, {"name": "sarah silverman", "sentiment": "none"}, {"name": "winfrey", "sentiment": "none"}, {"name": "oprah", "sentiment": "none"}, {"name": "cecil b. demille", "sentiment": "none"}, {"name": "jesse louis jackson sr", "sentiment": "none"}, {"name": "seth meyers", "sentiment": "none"}, {"name": "stedman graham", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}], "organizations": [{"name": "nbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "After Oprah Winfrey 's powerful acceptance speech at the Golden Globes on Sunday, celebrities are calling for the self-made billionaire to run for U.S. president in 2020. Those supporters include civil rights activist Reverend Jesse Louis Jackson Sr ., Seth Meyers, Sarah Silverman and Winfrey's longtime partner Stedman Graham.\nAward show host Seth Meyers first planted the seed for speculation during his opening monologue when he teased how reverse psychology could get Winfrey to run for president.\n\"In 2011, I told some jokes about our current president at the White House correspondents' dinner, jokes about how he was unqualified to be president,\" the NBC late-night host said. \"And some have said that night convinced him to run. And if that's true, I would just like to say Oprah you will never be president.\"\nFurther speculation over Winfrey's potential presidential bid spread immediately after her acceptance speech for the 2018 Golden Globes' Cecil B. DeMille Award for lifetime achievement.\nAlthough Winfrey has denied any plans for a presidential bid, Bloomberg reports , Graham told the Los Angeles Times that it's truly the public's decision.\nPaul Drinkwater | Getty Images Oprah Winfrey accepts the 2018 Cecil B. DeMille Award speaks onstage during the 75th Annual Golden Globe Awards at The Beverly Hilton Hotel on January 7, 2018. \"It's up to the people,\" he told the newspaper on Sunday when asked about a presidential run. \"She would absolutely do it.\"\nMeryl Streep, the acclaimed actress and last year's winner of the Globes' award told the Washington Post that Winfrey \"launched a rocket\" Sunday evening.\n\"I want her to run for president,\" Streep said. \"I don't think she had any intention [of declaring]. But now she doesn't have a choice.\"\nStreep went on to call Winfrey's speech \"a barnburner.\"\n\"She runs a major company. She could lead the country. Instead of leading the country down,\" Streep added.\nWinfrey began the speech by reflecting on her own life and career, discussed the importance of being the first black woman to win the prestigious award and closed it by addressing the progress the media industry still needs to make.\n\"I want all the girls watching here and now to know that a new day is on the horizon,\" Winfrey said, referring to Hollywood's ongoing conversation against sexual harassment. \"And when that new day finally dawns, it will be because of a lot of magnificent women, many of whom are right here in this room tonight, and some pretty phenomenal men, fighting hard to make sure that they become the leaders who take us to the time when nobody ever has to say, 'Me too' again.\"\nHere are some of the celebrities calling for Winfrey to run for U.S. president in 2020:\nCivil rights activist Rev. Jesse Louis Jackson, Sr.:\nRev Jesse Jackson tweet\nTelevision host Joy-Ann Reid:\nJoy Reid tweet\nCountry singer Billy Gilman:\nBilly Gilman tweet\nSinger, actress and model Janelle Monáe:\nJanelle Monáe\nBestselling author Roxane Gay:\nRoxane Gay tweet\nComedian and night-show host Larry Wilmore:\nLarry Wilmore tweet\nActress and comedian Sarah Silverman:\nSarah Silverman tweet\nActor and producer John Stamos:\nJohn Stamos tweet\nActor and singer Leslie Odom Jr.:\nLeslie Odom jr tweet\nFilm exec Franklin Leonard:\nFranklin Leonard tweet\nIn October last year, Winfrey said she had never considered the possibility of running for president. On \"CBS This Morning,\" she shut down her longtime friend Gayle King's question about a potential vice president shortlist.\nTweet\n\"There will be no running for office of any kind for me,\" Winfrey told King. Still, CNN reported on Monday that Winfrey is \"actively thinking\" about running for president, according to two close friends of hers.\nLike this story? Like CNBC Make It on Facebook .\nDon't miss:\nThe incredible rags-to-riches rise of self-made billionaire Oprah Winfrey Why Solange Knowles believes saying 'no' is a powerful way to reach your goals show chapters Speculation is mounting that Mark Zuckerberg is running for president — here's how much it would cost him to run 1:48 PM ET Tue, 15 Aug 2017 | 00:56", "external_links": [], "published": "2018-01-08T21:03:00.000+02:00", "crawled": "2018-01-08T21:03:45.000+02:00", "highlightTitle": ""}