{"organizations": [], "uuid": "fee2370447ebafb9b8a8b16adaef1117a3db480e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221524382&w=1200&r=LYNXMPEE0B1EU", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-usa-influenza/flu-in-u-s-now-widespread-but-season-may-be-peaking-cdc-idUKKBN1F12DT", "country": "US", "domain_rank": 408, "title": "Flu in U.S. now widespread but season may be peaking: CDC", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T20:43:00.000+02:00", "replies_count": 0, "uuid": "fee2370447ebafb9b8a8b16adaef1117a3db480e"}, "author": "", "url": "https://uk.reuters.com/article/us-usa-influenza/flu-in-u-s-now-widespread-but-season-may-be-peaking-cdc-idUKKBN1F12DT", "ord_in_thread": 0, "title": "Flu in U.S. now widespread but season may be peaking: CDC", "locations": [], "entities": {"persons": [{"name": "reuters/lucy nicholson", "sentiment": "none"}, {"name": "dan jernigan", "sentiment": "none"}, {"name": "julie steenhuysen", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "cdc", "sentiment": "none"}, {"name": "centers for disease control and prevention", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  chicago", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 6:45 PM / Updated 30 minutes ago Flu in U.S. now widespread but season may be peaking: CDC Julie Steenhuysen 3 Min Read \nCHICAGO (Reuters) - Seasonal influenza is now widespread across the continental United States, causing severe illness and rising numbers of hospitalizations, but this year’s outbreak may be peaking, government health officials said on Friday. A nurse displays a flu vaccine at a free medical and dental health clinic in Los Angeles, California, U.S., April 27, 2016. REUTERS/Lucy Nicholson \n“Flu is everywhere in the U.S. right now,” Dr Dan Jernigan, director of the influenza division at the Centers for Disease Control and Prevention, told reporters on a conference call. \n“The season started early and it is probably peaking right now,” he said, but cautioned that there are still 11 to 13 more weeks of flu to come. \nThe flu strain currently causing the most infections is H3N2, an influenza A virus that has been linked with increased hospitalizations and death, especially in young children and adults over age 65. \nIn the past week, the CDC has seen a spike in flu-related visits to doctors’ offices that report to the CDC. “What we can see is a very rapid increase in the numbers of people coming in to see their healthcare providers,” Jernigan said. \nThe rate of hospitalizations for laboratory-confirmed cases of flu doubled last week, rising to 22.7 hospitalizations per 100,000 people, up from 13.7 the prior week. \nSeven children died from the flu last week, bringing the total pediatric flu deaths reported to the CDC this season up to 20. \nJernigan characterized the current flu season as “on the severe side,” but said it does not appear to be as severe as the 2014/2015 flu season, which was also driven by an H3N2 virus. \nThe current flu vaccine appears to be about 30 percent effective against this year’s circulating virus strains, contradicting widespread reports based on Australia’s recent flu season that suggested the vaccine was only about 10 percent effective, Jernigan said. \nOfficial effectiveness data on this season’s flu vaccine will not be available until the middle of next month. \nMost flu shots cover four flu viruses - two influenza A viruses - H3N2 and H1N1 - and two B viruses. Some states that have already had outbreaks of H3N2 are beginning to see cases of H1N1. \nSo far, influenza B strains have not yet appeared, and Jernigan said it was not too late for people who have not been immunized to benefit from a flu shot. Reporting by Julie Steenhuysen, Editing by Rosalba O'Brien", "external_links": [], "published": "2018-01-12T20:43:00.000+02:00", "crawled": "2018-01-12T21:17:08.002+02:00", "highlightTitle": ""}