{"organizations": [], "uuid": "6039d1edd448d8e4bb9dfd39f62395ce1febdfd0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/06/06/103693306-GettyImages-56583128.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/05/odds-of-winning-a-lottery-jackpot-are-worse-than-you-expect.html", "country": "US", "domain_rank": 767, "title": "Odds of winning a lottery jackpot are worse than you expect", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.074, "site_type": "news", "published": "2018-01-05T20:12:00.000+02:00", "replies_count": 0, "uuid": "6039d1edd448d8e4bb9dfd39f62395ce1febdfd0"}, "author": "Kevin Breuninger", "url": "https://www.cnbc.com/2018/01/05/odds-of-winning-a-lottery-jackpot-are-worse-than-you-expect.html", "ord_in_thread": 0, "title": "Odds of winning a lottery jackpot are worse than you expect", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "If your retirement plan involves winning either of this weekend's multi-million dollar lottery jackpots, sorry — you're far more likely to be killed by a falling asteroid.\nThe combined Powerball and the Mega Millions jackpots are the largest ever , at more than $1 billion. The Powerball jackpot is currently $570 million, and the Mega Millions stands at $450 million. Both games had their most recent jackpot wins in late October.\nThe next Mega Millions drawing is scheduled for 11 p.m. ET on Friday, and the next Powerball drawing is Saturday at 10:59 p.m. ET.\nTwo lottery drawings does technically imply more opportunities to win — but really, you should check your hopes at the convenience store counter.\nThe odds of winning the Powerball grand prize are 1 in 292.2 million, according to the game's own assessment . The Mega Millions jackpot odds are even more hopeless, at 1 in 302.5 million.\n(In late October, Mega Millions changed its range of numbers players can choose from, which made the odds of winning the big jackpot slimmer. Before that change, its jackpot odds were 1 in 258.9 million.)\nA few points of comparison. Your odds of being struck dead by a stray asteroid are just 1 in 1.9 million, according to Jim Murphy at sportsbettingexperts.com . The odds of being killed by a shark are even less likely at 1 in 3.7 million.\nGetty Images Yet both of these improbabilities are exponentially more likely than winning the whole bonanza in either of this weekend's lottery drawings.\nAnd perish the thought of winning both the Mega Millions and the Powerball. An Allstate analysis from mid-2017 (before the Mega Millions top prize odds worsened) put the chance of a double-win at 1 in 75,648,252,765,957,300. (That's 75 quadrillion.)\nFor those lucky few who do win the lottery, be prepared to sacrifice a hefty chunk of your winnings in tax payments almost immediately.\nLottery site USAMega.com estimates the federal tax withholding on the $281.2 million Mega Millions lump sum would be $70.3 million, and state taxes could knock out up to another $24.8 million (with New York the worst offender). For the Powerball, those tax tallies for the $358.5 million cash prize would be $89.6 million and up to $31.6 million, respectively.\nMore from Personal Finance:\nNew tax law is a mixed bag for your company benefits\nThis tax bill provision helps families save on school costs and taxes\nThese changes under the GOP tax plan affect homeowners", "external_links": [], "published": "2018-01-05T20:12:00.000+02:00", "crawled": "2018-01-05T20:23:51.008+02:00", "highlightTitle": ""}