{"organizations": [], "uuid": "63e1cd0378e0ea22c0a4cce64bfe48e1ff92bb0f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/china-gas-exchange/rpt-chinas-chongqing-gas-exchange-aims-to-be-asia-price-benchmark-idUSL4N1OT29Z", "country": "US", "domain_rank": 408, "title": "RPT-China's Chongqing gas exchange aims to be Asia price benchmark", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T01:00:00.000+02:00", "replies_count": 0, "uuid": "63e1cd0378e0ea22c0a4cce64bfe48e1ff92bb0f"}, "author": "", "url": "https://www.reuters.com/article/china-gas-exchange/rpt-chinas-chongqing-gas-exchange-aims-to-be-asia-price-benchmark-idUSL4N1OT29Z", "ord_in_thread": 0, "title": "RPT-China's Chongqing gas exchange aims to be Asia price benchmark", "locations": [], "entities": {"persons": [{"name": "henning gloystein", "sentiment": "none"}, {"name": "chen aizhu", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "chongqing", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "chongqing", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "central asia", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Repeats story from Friday with no changes to text)\n* Chongqing to launch trade of pipeline gas, LNG in H1 2018\n* Chongqing exchange rivals Shanghai hub, Japan Korean Marker\n* Govt price regulation, lack of infrastructures are barriers\nBy Chen Aizhu and Henning Gloystein\nCHONGQING, China/SINGAPORE, Dec 29 (Reuters) - China plans to launch a natural gas exchange in Chongqing in early 2018, aiming to create an Asian price benchmark as the nation’s use of the fuel surges amid its shift away from coal.\nChina is the world’s third-biggest consumer of natural gas behind the United States and Russia. An exchange in its fast-growing market would be a strong contender for an Asian gas marker off which other supplies in the region could be priced.\nThe Chongqing Oil and Gas Exchange - supported by state energy majors, and private and local government-backed gas distributors - would provide a trading platform for domestic output, pipeline imports from Central Asia and Myanmar, and imports of liquefied natural gas (LNG).\nChongqing is China’s second attempt to develop a traded gas market, having set up a similar exchange in 2015 in Shanghai.\nAn Asian gas price benchmark to stand next to those of the United States and Europe is seen as a key missing piece in establishing a truly global market for natural gas.\n“The exchange is a product of the government’s reform push - to hand the pricing power to the market,” Exchange Chairman Zhang Bowen told Reuters.\n“The long-term goal is to build the exchange into a benchmark for Asia and to win China its deserved pricing power,” said Zhang, who was previously president of PetroChina Kunlun Energy.\nThe exchange, led by a board of nine directors including a former PetroChina executive and an ex-senior state planning official, expects to launch electronically-based spot trading of pipeline gas and LNG imports in the first half of next year.\nRegistered in Chongqing municipality in July with 1 billion yuan ($150 million) in capital, the exchange has a team of 30, including former market developers at state-owned energy giants CNOOC and Sinopec.\n“A China gas hub certainly looks attractive from a supply/demand and infrastructure perspective,” said Jeff Brown, president of consultancy Facts Global Energy (FGE).\nChongqing exchange is appraising around 200 potential members, mostly from the consuming hub of eastern China, and will be open to foreign participation in the longer run, said exchange executives.\nPRICING CONTROLS A BARRIER Still, there are several challenges to overcome, for Chongqing or any other exchanges hoping to establish an active gas trading platform.\n“The biggest would be that the government is still heavily involved in ‘guiding’ prices. Access to pipelines and import terminals can also be difficult,” said Brown.\nChina’s National Development and Reform Commission (NDRC) currently sets wholesale or city-gate gas prices by linking them to alternative fuels such as liquefied petroleum gas (LPG) and fuel oil.\nInvestors fear China could be as heavy-handed with gas as it has been with coal. Authorities have repeatedly intervened whenever coal prices have risen sharply, contributing to the virtual death of coal futures in Asia.\nChina is also struggling to build the infrastructure needed to freely distribute gas supplies. An inadequate pipeline grid and insufficient storage helped to trigger a supply crunch this winter after millions of households were switched from using coal to gas for heating.\n“Pipelines need to be more connected and greater access allowed for third parties to the grid and terminals. More investments are needed to boost gas storage,” Song Dacai, chairman of the Chongqing exchange’s supervision committee and formerly a pricing official with the NDRC.\nThe exchange, though, is confident rising demand and slowly expanding gas infrastructure will help it succeed.\nChongqing, with its population of more than 30 million and proximity to Sichuan province’s large gas basin, already has a relatively well-developed gas grid, and distributors there are keen to participate on the exchange.\n“As an investor, we are keen to become a market maker, provided that suppliers are ready to post meaningful volumes for us to trade,” said Luo Jing, deputy head of gas development at China Gas Holdings, a piped gas distributor.\nState majors are expected to nominate available volumes on the exchange annually or bi-annually, said Zhang, the exchange chairman.\nBUT THERE ARE COMPETITORS Others that are trying to develop regional gas exchanges as the basis for an Asian benchmark include Shanghai Petroleum and Gas Exchange and the Japan Korea Marker (JKM) by S&P Global Platts.\nThe Shanghai exchange, launched in 2015, has so far failed to attract much trading interest. China’s financial hub, though, is seen as a potential oil and gas trading centre and likely home of China’s long delayed crude oil derivatives contract.\nIn many way, the JKM, an LNG price assessment, is seen as the strongest contender to become a regional gas benchmark.\n“JKM seems to be gaining steam as an Asian gas price ... Since LNG is the most commoditised gas in Asia, it seems best placed to emerge as the Asia price marker,” FGE’s Brown said.\n($1 = 6.5420 Chinese yuan)\nReporting by Chen Aizhu in CHONGQING and Henning Gloystein in SINGAPORE; Editing by Tom Hogue\n ", "external_links": [], "published": "2018-01-02T01:00:00.000+02:00", "crawled": "2018-01-02T01:02:18.000+02:00", "highlightTitle": ""}