{"organizations": [], "uuid": "3a3e7aaef7f58809be442ca4cdc4fd71d5d8579b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/04/104752727-GettyImages-698493074-ryan-zinke.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/17/citing-inexcusable-treatment-advisers-quit-national-parks-panel.html", "country": "US", "domain_rank": 767, "title": "Citing ‘inexcusable’ treatment, advisers quit national parks panel", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T17:26:00.000+02:00", "replies_count": 0, "uuid": "3a3e7aaef7f58809be442ca4cdc4fd71d5d8579b"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/17/citing-inexcusable-treatment-advisers-quit-national-parks-panel.html", "ord_in_thread": 0, "title": "Citing ‘inexcusable’ treatment, advisers quit national parks panel", "locations": [], "entities": {"persons": [{"name": "ryan zinke", "sentiment": "none"}, {"name": "zinke", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "utah", "sentiment": "none"}], "organizations": [{"name": "national parks system advisory board", "sentiment": "negative"}, {"name": "interior", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The majority of members of the National Parks System Advisory Board, which advises the federal government on management of the country's national parks, have jointly resigned to protest Trump administration policies that the board members say have ignored science, squelched efforts to address climate change and undermined environmental protections.\nThe advisory board was established in 1935 to advise the secretary of the interior, who oversees management of the country's national parks and monuments. Since taking office last year, Interior Secretary Ryan Zinke has come under criticism from environmental advocates for promoting President Trump's agenda of opening up the nation's public lands and waters to fossil-fuel exploration, and for reducing the protection of public monuments.\nThis month Mr. Zinke announced a plan to open up the majority of the nation's coastlines to offshore drilling . And in December, the administration reduced the size of two national monuments in Utah, Bears Ears and Grand Staircase-Escalante, by some two million acres, the largest rollback of federal land protection in the nation's history.\nRead more from The New York Times:\nTrump plans to shrink two national monuments in Utah\n2017: The year in climate\nClimate change is driving people from home. So why don't they count as refugees?\n\"From all of the events of this past year I have a profound concern that the mission of stewardship, protection, and advancement of our National Parks has been set aside,\" wrote Tony Knowles, the head of the advisory board, in a resignation letter dated Monday that was co-signed by eight other members of the 12-member panel. The Washington Post first reported the letter.\n\"We resigned because we were deeply disappointed with the department and we were concerned,\" Mr. Knowles said in an interview. Mr. Zinke, he said, \"appears to have no interest in continuing the agenda of science, the effect of climate change, pursuing the protection of the ecosystem.\"\nMr. Knowles said that Mr. Zinke has refused to meet with his board during his tenure.\nPhil Francis, chairman of the Coalition to Protect America's National Parks, an advocacy group of current and former national park employees, said Tuesday evening, \"This discourteous and disrespectful treatment of the Board is inexcusable and, unfortunately, consistent with a decidedly anti-park pattern demonstrated by Secretary Zinke's department.\"\nAn Interior Department spokeswoman did not respond to an emailed request for comment.\nMr. Zinke has sought to portray himself as a champion of national parks and has compared himself to Theodore Roosevelt, the founder of the national parks system.\nThe resignations come amid growing concern by scientists that their voices are being suppressed by the Trump administration. Last May, the Environmental Protection Agency dismissed several members of its Board of Scientific Counselors in a move that Trump administration officials said was designed to give greater voice to industry interests in the agency.", "external_links": [], "published": "2018-01-17T17:26:00.000+02:00", "crawled": "2018-01-17T17:32:53.000+02:00", "highlightTitle": ""}