{"organizations": [], "uuid": "0751ee8960345e9d26ebd4448366656c12faa2ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225292468&w=1200&r=LYNXMPEE0O1Q5", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-britain-eu-davis/offering-brighter-future-uks-davis-tries-to-convince-on-eu-transition-idUSKBN1FE36J", "country": "US", "domain_rank": 408, "title": "Britain sets out EU transition plans as Brexiteers cry foul", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T13:54:00.000+02:00", "replies_count": 0, "uuid": "0751ee8960345e9d26ebd4448366656c12faa2ba"}, "author": "", "url": "https://www.reuters.com/article/us-britain-eu-davis/offering-brighter-future-uks-davis-tries-to-convince-on-eu-transition-idUSKBN1FE36J", "ord_in_thread": 0, "title": "Britain sets out EU transition plans as Brexiteers cry foul", "locations": [], "entities": {"persons": [{"name": "brexite", "sentiment": "negative"}, {"name": "david davis", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "elizabeth piper", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TEESPORT, England (Reuters) - Britain wants to benefit from European Union trade deals and have a say over EU laws passed during its transition out of the bloc, Brexit minister David Davis said on Friday, seeking to defuse tension between senior ministers over the interim deal.\nDavis set out the government’s position on a transition period, looking to offer something for both those who want to keep close ties with the European Union after leaving and those who want a more radical break.\nThe balancing act, designed to appease both business and Brexiteers, is a taste of things to come for Prime Minister Theresa May, who has been unable to prevent divisions in her party repeatedly spilling out into the open.\nOn Thursday, finance minister Philip Hammond was rebuked by May’s office after saying he hoped Britain would diverge from the EU only “very modestly” after Brexit. He spoke hours before the head of a hardline group of Brexiteer lawmakers urged May to stop accepting negotiating terms set by the EU.\n“It’s only by being outside the EU but continuing with the existing structures of rules and regulation that we can meet the requirements for a smooth, orderly and successful exit,” Davis said in a speech at Teesport in northeast England.\n“The existing international agreements we are party to should continue to apply during this period. They are an important part of the existing EU structure of rules and regulations, to which we will remain a party during the implementation period.”\nWAY TO RESOLVE CONCERNS Davis also said there needed to be some mechanism for Britain to query new laws introduced during the transition period, which it would be duty-bound to follow, and that the future jurisdiction of regulators needed to be clarified.\n“We will have to find a way, to agree a way, of resolving concerns if laws that are deemed to run contrary to our interests, and we have not had our say,” he said.\nThere is little distance between Britain and the EU to overcome to agree the transitional deal, which will give the two sides time to prepare for the far-reaching impact of the end of more than 40 years of union.\nDavis said he expected a political agreement on the transition deal at an EU summit on March 22-23 - a target Brussels is also working towards, with plans for fortnightly rounds of negotiations.\nBritain's Secretary of State for Exiting the European Union David Davis delivers a speech during a visit to PD Ports at Teesport near Middlesborough, Britain, January 26, 2018. REUTERS/Ian Forsyth/Pool The EU is willing to be flexible on the duration and other terms of a Brexit transition period, which could include letting London sign trade deals, according to a document due to be formally endorsed by EU ministers on Monday.\nDavis dismissed a question on whether he could really negotiate for Britain if senior members of the cabinet disagreed about what the transition deal should contain:\n“There is no difference between the chancellor and myself and indeed the prime minister in terms of that we both want a Brexit which serves the British economy and serves the British people,” he said.\nBut May, who gambled on a snap election last year that cost her party its majority in parliament, is facing pressure from multiple angles: pro-EU lawmakers, hardline Brexiteers, and another contingent who question her leadership credentials and criticise a “dull dull dull” domestic agenda.\nLETTERS OF NO CONFIDENCE Several newspaper reports have said the number of letters expressing ‘No Confidence’ in the party leader is approaching the threshold of 48 required to trigger a leadership contest. The actual number is not made public by the party committee that holds them.\nMay is aware that the plan to change little of the current relationship immediately after Britain formally leaves on March 29, 2019, is fuelling anger among Brexit campaigners, who fear their mantra of “taking back control” is being sold out.\nJacob Rees-Mogg, who heads a hardline group of pro-Brexit Conservative lawmakers that could have enough members to topple May, has said Britain must stop accepting negotiating terms set by the EU and that current transition plans would render it a “vassal state”.\nRelated Coverage Most Britons favor a vote on final Brexit terms: Guardian/ICM poll EU and UK negotiators eye accelerated Brexit transition talks The febrile mood in the party is likely to linger; May has had to struggle to keep her lawmakers united over everything from transition to the future relationship to the so-called Brexit dividend - the funds that will be freed up when Britain stops paying into EU coffers.\nBut Davis said the prospect of an independent trade policy was worth waiting for.\n“We must keep sight of the fact that this is a bridge to a new future partnership,” he said.\n“... where, crucially, the United Kingdom is outside of the single market, and outside of the customs union; where the United Kingdom courts are sovereign once more; and where the United Kingdom can take advantage of its status as an independent trading nation.”\nAdditional reporting by William James; Editing by Kevin Liffey\n ", "external_links": [], "published": "2018-01-26T13:54:00.000+02:00", "crawled": "2018-01-26T14:10:59.004+02:00", "highlightTitle": ""}