{"organizations": [], "uuid": "c785e11efa2077921f3fe567590787ce605f1c98", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180114&t=2&i=1221965441&w=1200&r=LYNXMPEE0D0K6", "site_section": "http://feeds.reuters.com/reuters/INhollywood\r", "section_title": "Reuters: Hollywood News", "url": "https://in.reuters.com/article/us-fashion-harassment/male-models-say-top-fashion-photographers-harassed-them-new-york-times-idINKBN1F30VW", "country": "US", "domain_rank": 408, "title": "Male models say top fashion photographers harassed them: New York Times", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T21:35:00.000+02:00", "replies_count": 0, "uuid": "c785e11efa2077921f3fe567590787ce605f1c98"}, "author": "", "url": "https://in.reuters.com/article/us-fashion-harassment/male-models-say-top-fashion-photographers-harassed-them-new-york-times-idINKBN1F30VW", "ord_in_thread": 0, "title": "Male models say top fashion photographers harassed them: New York Times", "locations": [], "entities": {"persons": [{"name": "bruce weber", "sentiment": "none"}, {"name": "testino", "sentiment": "none"}, {"name": "mario testino", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "new york times", "sentiment": "negative"}, {"name": "the times", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "new york times reuters staff", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 14, 2018 / 7:36 PM / Updated 19 minutes ago Male models say top fashion photographers harassed them: New York Times Reuters Staff 3 Min Read \nNEW YORK (Reuters) - Male models and assistants who worked with high-powered fashion photographers Bruce Weber and Mario Testino say they were subjected by them to molestation, sexual advances and unnecessary nudity, The New York Times reported on Saturday. Bruce Weber, winner of the Isabella Blow Award for Fashion Creator poses for photographers at the Fashion Awards 2016 in London, Britain December 5, 2016. REUTERS/Neil Hall \nIn patterns that went on for years, the young men, including some who were given anonymity, said the photographers put them in uncomfortable sexual situations that they felt pressured to accept out of fear of upending their careers, The Times said. \nLawyers for both photographers denied the allegations and said that the pair was surprised and dismayed by them. Neither Weber, Testino nor their accusers could immediately be reached for further comment. \n“We never had sex or anything, but a lot of things happened. A lot of touching. A lot of molestation,” the Times quoted model Robyn Sinclair as saying of Weber. \nSinclair was among 15 current and former male models whom the newspaper said described harassment by Weber, 71, whose fashion clients have included Calvin Klein and Abercrombie & Fitch. Mario Testino poses for photographers at the screening of Zoolander 2 at a cinema in central London, February 4, 2016. REUTERS/Dylan Martinez \nThrough his lawyers, Weber denied the accusations in a statement to The Times, saying: “I‘m completely shocked and saddened by the outrageous claims being made against me, which I absolutely deny.” \nTestino’s law firm, Lavely & Singer, challenged the credibility of his accusers and said it had spoken to former employees of Testino who said they were shocked by the allegations and could not confirm any of them, The Times said. \nAllegations against Testino, 63, who has worked for fashion brands including Michael Kors, Burberry and Dolce & Gabbana, were made by 13 male assistants and models in accounts going back to the mid-1990s, the newspaper said. \nMultiple accusations of sexual misconduct against male actors, filmmakers and agents have roiled Hollywood since October 2017. The scandal has also engulfed men in U.S. politics, business and the workplace, inspiring a widespread #MeToo social movement by victims of sexual harassment or abuse. \nFollowing The Times’ report, Conde Nast artistic director Anna Wintour said the magazine company had suspended any future work with the two photographers, whom she described as personal friends. \n“I believe strongly in the value of remorse and forgiveness, but I take the allegations very seriously, and we at Conde Nast have decided to put our working relationship with both photographers on hold for the foreseeable future,” Wintour, who is also editor in chief of Vogue magazine, said in a statement. Reporting by Peter Szekely; Editing by Daniel Wallis and Sandra Maler", "external_links": [], "published": "2018-01-14T21:35:00.000+02:00", "crawled": "2018-01-14T22:04:12.087+02:00", "highlightTitle": ""}