{"organizations": [], "uuid": "c604a5847cafa4d2251fd644c032b543980f7375", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180130.html", "section_title": "Archive News &amp; Video for Tuesday, 30 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-dollar-steadies-ahead-of-fed-decision-on-track-for-monthly-loss-idUSL4N1PP3YB", "country": "US", "domain_rank": 408, "title": "FOREX-Dollar steadies ahead of Fed decision, on track for monthly loss", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.022, "site_type": "news", "published": "2018-01-31T09:08:00.000+02:00", "replies_count": 0, "uuid": "c604a5847cafa4d2251fd644c032b543980f7375"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-dollar-steadies-ahead-of-fed-decision-on-track-for-monthly-loss-idUSL4N1PP3YB", "ord_in_thread": 0, "title": "FOREX-Dollar steadies ahead of Fed decision, on track for monthly loss", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "masayuki kitano", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}], "organizations": [{"name": "fed", "sentiment": "negative"}, {"name": "u.s. federal reserve", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Dollar steady vs basket of major currencies\n* Traders await Trump’s address, Fed policy statement\nBy Masayuki Kitano\nSINGAPORE, Jan 31 (Reuters) - The dollar held steady against a basket of major rivals on Wednesday, as investors awaited the U.S. Federal Reserve’s policy decision and U.S. President Donald Trump’s State of the Union address.\nThe dollar index, which measures the greenback against a basket of six major currencies, was last at 89.145 , clinging above a three-year low around 88.43 set last week.\nAgainst the yen, the dollar rose 0.1 percent to 108.91 yen . The euro edged up 0.1 percent to $1.2416.\nTrump will say in his State of the Union address that he is extending an open hand to work with both Democrats and Republicans, according to excerpts of the speech released by the White House.\nTrump, who is scheduled to deliver the address on Capitol Hill at 0200 GMT, will call on both parties to work together on a plan to rebuild the country’s infrastructure.\nTraders are cautious ahead of a slate of events this week, including the U.S. Federal Reserve’s two-day monetary policy meeting that ends on Wednesday and a U.S. jobs report on Friday that will include data on nonfarm payrolls and average hourly earnings.\nThe Fed is widely expected to keep interest rates unchanged this week, and investors will be looking to its policy statement for fresh hints on the outlook for interest rates this year.\nThe Fed probably won’t make major changes to its assessment of the economic and inflation outlook at this stage, said Roy Teo, investment strategist for LGT Bank in Singapore, adding that any material changes are likely to be “further down the road”.\nSince market participants already seem to be bracing for the possibility of three Fed interest rate hikes this year, the chances of the dollar getting a lift from the Fed’s forthcoming policy statement appear low, Teo added.\nThe greenback gained a bit of respite this week as the U.S. 10-year Treasury yield rose to levels above 2.7 percent, reaching its highest level since April 2014.\nThe dollar is on track for hefty monthly losses against its major peers. For example, the euro has gained roughly 3.5 percent in January, putting the common currency on track for its best monthly performance against the dollar since July 2017.\nThe dollar has faced headwinds partly because its relative yield attraction is seen at risk as the world’s major central banks, and not just the U.S. Federal Reserve, are seen heading toward winding down their stimulus programmes. (Reporting by Masayuki Kitano; Editing by Eric Meijer)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-31T09:08:00.000+02:00", "crawled": "2018-01-31T16:39:22.013+02:00", "highlightTitle": ""}