{"organizations": [], "uuid": "1643bfd4a6329762b6903e939117953215e74086", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/07/11/103778900-GettyImages-546066166.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19854910/device/rss/rss.html", "section_title": "Tech", "url": "https://www.cnbc.com/2018/01/04/cramer-pinpoints-stocks-that-are-feeding-the-market-in-beast-mode.html", "country": "US", "domain_rank": 767, "title": "Cramer pinpoints stocks that are feeding the market in 'beast mode'", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T01:12:00.000+02:00", "replies_count": 0, "uuid": "1643bfd4a6329762b6903e939117953215e74086"}, "author": "Elizabeth Gurdus", "url": "https://www.cnbc.com/2018/01/04/cramer-pinpoints-stocks-that-are-feeding-the-market-in-beast-mode.html", "ord_in_thread": 0, "title": "Cramer pinpoints stocks that are feeding the market in 'beast mode'", "locations": [], "entities": {"persons": [{"name": "cramer", "sentiment": "neutral"}, {"name": "jim cramer", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "On a strong day for markets in which the Dow Jones industrial average crossed the 25,000 mark , CNBC's Jim Cramer wanted to check in on what exactly is driving this \"beast market.\"\n\"You get a market in beast mode like this one, you've got to feed the beast. And you can't give it the same menu every day,\" the \" Mad Money \" host said. \"This tape not only manages to feed the beast every day, it gives the monster that is this market exactly the kind of well-balanced diet it needs to keep roaring.\"\nAfter a healthy rally in industrial stocks involved in everything from machinery to aerospace to oil to shipping, Cramer said the beast would need a break from devouring these names.\nAfter all, a rally driven only by a select group of stocks tends to trade narrowly and be expensive, two factors that scream bad breadth — in other words, poor variety — to money managers.\nSo as the market's menu of stocks shifted on Thursday, Cramer took to the tape to pinpoint the morsels that came back into favor on Wall Street.\nFirst up were the financial stocks, which have struggled to execute a major move higher since November even with a rate hike by the Federal Reserve and President Donald Trump's push for deregulation .\nOn Thursday, a handful of bank stocks including Bank of America , JPMorgan , Wells Fargo and Goldman Sachs managed to rally, finally breaking out of their fits-and-starts trading pattern.\nIn particular, Goldman, a key player in the blockchain systems that allow individuals to trade digital currencies like bitcoin , got a boost from Merrill Lynch's ban on cryptocurrency products , Cramer said.\n\"I can see companies wanting to accept payment in bitcoin, but also wanting to hedge out their risk immediately, and that's Goldman's best hand. They will own the cryptocurrency market,\" the \"Mad Money\" host said. \"You want to buy that stock.\"\nNext up on the beast market's menu? Cloud stocks like Workday , Salesforce and VMware , the latter of which reached an all-time high in intraday trading.\nThe former market leaders fell out of favor in late 2017 as investors cooled on the white-hot group for fear of overvaluation or even correction.\n\"A group that looked toppy now looks delicious,\" Cramer said. \"Look for price target boosts tomorrow because the stocks have overrun their price targets.\"\nThird, shares of chemical and paper companies have stalled out in recent months, even as newly passed changes to the U.S. tax code will slash taxes for many names in the space, Cramer said.\nSure enough, on Thursday, the stocks of major chemical conglomerate DowDuPont and old-line paper play International Paper surged higher as institutional buyers raced to justify the gains.\n\"Here's the bottom line: believe me, when the market goes into beast mode, it doesn't roll over and just play dead. It rips the lungs out of anything that gets in its way,\" Cramer concluded. \"So you can focus on the endless drama in Washington: the Mueller investigation , the surreal Bannon interviews , the Dr.-Strangelove-style confrontation between our president and the leader of North Korea about the respective size of their nuclear buttons. 'Gentlemen, you can't fight in here! This is the War Room!' Or you can focus on what actually matters to the stock market. Me? I say keep your eye on the beast.\"\nWATCH: Cramer analyzes the market's changing taste in stocks show chapters Cramer pinpoints stocks that are feeding the market in 'beast mode' 20 Hours Ago | 12:30 ", "external_links": [], "published": "2018-01-05T01:12:00.000+02:00", "crawled": "2018-01-05T01:43:24.014+02:00", "highlightTitle": ""}