{"organizations": [], "uuid": "1115389234d8a2e2e50e4e69c2751ce3381af864", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180129.html", "section_title": "Archive News &amp; Video for Monday, 29 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/fortescue-output/update-1-fortescue-q2-shipments-fall-flags-higher-iron-ore-discount-idUSL4N1PO5P6", "country": "US", "domain_rank": 408, "title": "UPDATE 3-Australia's Fortescue says iron ore output costs hit record low, shares jump", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T07:18:00.000+02:00", "replies_count": 0, "uuid": "1115389234d8a2e2e50e4e69c2751ce3381af864"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/fortescue-output/update-1-fortescue-q2-shipments-fall-flags-higher-iron-ore-discount-idUSL4N1PO5P6", "ord_in_thread": 0, "title": "UPDATE 3-Australia's Fortescue says iron ore output costs hit record low, shares jump", "locations": [], "entities": {"persons": [{"name": "forte", "sentiment": "none"}, {"name": "paul hissey", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "fortescue", "sentiment": "none"}], "organizations": [{"name": "fortescue", "sentiment": "negative"}, {"name": "rbc", "sentiment": "none"}, {"name": "fortescue metals group ltd", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Fortescue’s iron ore output costs below analyst expectations\n* Company maintains full-year cost guidance\n* Reports 4-pct drop in quarterly iron ore shipments\n* Fortescue shares climb around 3 pct (Adds comment from Fortescue managers)\nMELBOURNE Jan 30 (Reuters) - Shares in Australia’s Fortescue Metals Group Ltd jumped on Tuesday as the iron ore miner reported its costs came in at record lows in the last quarter and as it forecast a pickup in demand from March.\nShares in Fortescue, which kept its full-year guidance for costs intact, climbed as much as 3 percent in a market where miners broadly declined after the U.S. dollar clawed back from three-year lows overnight.\n“The (company‘s) cost performance was solid considering the strength of the Australian dollar and oil prices,” RBC mining analyst Paul Hissey said in a report. The world’s fourth-largest iron ore producer said that it cost $12.08 to churn out a wet metric tonne (WMT) of the commodity in the Oct-Dec quarter. That was down 3.7 percent from the same period the year before and compared to RBC’s expectations of $13.24.\nFortescue maintained its cost target forecast for the financial year that started in July of between $11 and $12 a tonne.\nThe lower costs are part of an ongoing drive for efficiency, Fortescue’s director of operations, Greg Lilleyman, said on a call with media. He added that there was not “one silver bullet” when it came to cutting costs.\nFortescue said its iron ore was selling at a greater discount than expected as it reported a 4-percent decline in second-quarter shipments of the steelmaking ingredient, in line with analyst estimates.\nShipments fell to 40.5 million tonnes in the three months ended Dec. 31 versus 42.2 million tonnes in the same period a year ago. UBS had forecast a figure around 40.5 million tonnes.\nThat came in the wake of China switching to higher grade, less polluting iron ore as it battles severe winter smog.\nThe discount to which Fortescue sells its product against the benchmark 62 percent grade index .IO62-CNO=MB has been steadily deepening, hitting 23 percent in the first quarter of this year.\nIt said on Tuesday that the discount widened to 34 percent in the second quarter of fiscal 2018, but maintained its guidance range of 25-30 percent discount for the year on expectations that demand for its product would recover when China’s pollution curbs ease as winter fades.\n“It was always expected with that (winter cuts) intervention coming to an end in March that we would see the market rebalance as steel mills look to minimise their cost,” outgoing chief executive Nev Power said on the media call.\nHe added that even if China implemented pollution controls again next winter, steel producers would see minimal impact.\n“The reality is the steel mills in China have already made significant changes to their processes ... It’s not true to say that (the same) level of reduction (in output) is going to be required in the future to achieve the same environmental outcome.”\nThe Australian government earlier this month said it expected a 20 percent drop in iron ore prices this year, hurt by rising global supply and cooling demand from China. However, most private forecasts expect the price to remain largely flat.\n“(Fortescue‘s) December quarter price realisation was not as good as expected but more importantly not as bad as feared,” Peter O‘Connor of Shaw and Partners said in a report. (Reporting by Melanie Burton; Additional reporting by Aditya Soni in Bengaluru; Editing by Chris Reese, Rosalba O‘Brien and Joseph Radford)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T07:18:00.000+02:00", "crawled": "2018-01-30T19:08:35.009+02:00", "highlightTitle": ""}