{"organizations": [], "uuid": "ef41f427409d900de1f45dcccffa6624910ffe46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226552543&w=1200&r=LYNXMPEE0T0IB", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-russia-ratings-moody-s/russia-can-withstand-new-sanctions-rating-may-be-upgraded-moodys-idUKKBN1FJ15R", "country": "US", "domain_rank": 408, "title": "Russia can withstand new sanctions, rating may be upgraded - Moody's", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T11:42:00.000+02:00", "replies_count": 0, "uuid": "ef41f427409d900de1f45dcccffa6624910ffe46"}, "author": "", "url": "https://uk.reuters.com/article/uk-russia-ratings-moody-s/russia-can-withstand-new-sanctions-rating-may-be-upgraded-moodys-idUKKBN1FJ15R", "ord_in_thread": 0, "title": "Russia can withstand new sanctions, rating may be upgraded - Moody's", "locations": [], "entities": {"persons": [{"name": "lindow", "sentiment": "none"}, {"name": "kristin lindow", "sentiment": "none"}], "locations": [{"name": "russia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "kremlin", "sentiment": "none"}], "organizations": [{"name": "moody", "sentiment": "negative"}, {"name": "min read  moscow", "sentiment": "none"}, {"name": "moody’s investor service", "sentiment": "none"}, {"name": "moody's andrey ostroukh", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. treasury department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 42 AM / Updated 12 minutes ago Russia can withstand new sanctions, rating may be upgraded - Moody's Andrey Ostroukh 4 Min Read \nMOSCOW (Reuters) - Russia’s economy has gained enough resilience to withstand new Western sanctions and the country’s sovereign rating may be upgraded by the end of the year, Kristin Lindow, a senior vice president at Moody’s Investor Service, said in an interview. \nTargeted by Western economic and financial sanctions since 2014, Russia’s economy began to recover last year after a steep economic downturn, thanks to higher oil prices and some structural reforms implemented by the government. \n“Our analysis is that the economy and public finances are in good shape and can withstand new sanctions,” Lindow told Reuters late on Monday, before the United States named major Russian businessmen on a list of oligarchs close to the Kremlin. \nLate last week, Moody’s raised the country’s sovereign outlook to positive from stable just days before widely- anticipated reports on possible new U.S. sanctions against Russia. \nThe U.S. Treasury Department later released a list of people close to the Kremlin, casting a potential shadow of sanctions risk over a wide circle of wealthy Russians. \nMoody’s outlook upgrade also came less than two months before Russia’s March presidential election, which President Vladimir Putin is widely expected to win. \n“We were trying to send a message ... that we think that the economy is resilient to new sanctions. And we also didn’t feel it was necessary to wait to assign a positive outlook until after the presidential election,” Lindow said. \nGlobal rating agencies are on the watch now for a sovereign rating upgrade as higher oil prices eased concerns about Russia’s fiscal buffers, while the economy is on track to grow for the second year in a row. \nLindow said a decision on upgrading Russia’s rating could be made no later then in the next 12-18 months. 2018 OUTLOOK \nThis year, Moody’s expects Russia’s economy to grow by 1.6 percent, inflation to accelerate back to the central bank’s target of 4 percent, and international reserves to grow by another $40 billion. \n“What we’re looking for is a policy mix that we think has been adopted. A fiscal consolidation that would allow the deficit to be financed entirely domestically just in case new sanctions are imposed on Russian government debt. Similarly, the exchange rate to be a shock absorber,” Lindow said. \nAfter the 2018 presidential election, which would lead to a new cabinet of ministers, Moody’s also expects to see “continuity in terms of personnel at the top of key ministries” and the same economic and financial lines to be pursued. \n“What would be helpful is some clarity on where tax rates are going to be” after a new government is appointed, Lindow said. \nLindow also praised the central bank’s policy of purging the banking sector and shutting dozens of lenders as it helped to cap capital flight. But there was still more work to do in terms of the clean-up, Lindow said. \n“The clean-up in the banking sector that has been going on in the past several years has been very positive and certainly led to a better outcome for external finances than we anticipated,” she said. \n“Russia has had a history of having current account surpluses but a certain amount of that was lost to capital flight. And that’s diminished significantly with the closure of some of these banks.” Reporting by Andrey Ostroukh; Editing by Peter Graff", "external_links": [], "published": "2018-01-30T11:42:00.000+02:00", "crawled": "2018-01-30T12:00:39.002+02:00", "highlightTitle": ""}