{"organizations": [], "uuid": "0421b2ed42b870bbdf829ad36503bbf7412cb6d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/globe-newswire-protext-pharma-to-acquire-cannabis-blockchain-company-growprocess-inc.html", "country": "US", "domain_rank": 767, "title": "Protext Pharma to Acquire Cannabis Blockchain Company Growprocess, Inc.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.328, "site_type": "news", "published": "2018-01-19T18:00:00.000+02:00", "replies_count": 0, "uuid": "0421b2ed42b870bbdf829ad36503bbf7412cb6d8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/globe-newswire-protext-pharma-to-acquire-cannabis-blockchain-company-growprocess-inc.html", "ord_in_thread": 0, "title": "Protext Pharma to Acquire Cannabis Blockchain Company Growprocess, Inc.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "protext pharma to acquire cannabis blockchain company growprocess, inc", "sentiment": "neutral"}, {"name": "protext pharma, inc.", "sentiment": "none"}, {"name": "growprocess, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Growprocess Expected to Launch ICO-Cannabis-Derivative, Commodity Backed Token Q1 2018\nBOCA RATON, FL, Jan. 19, 2018 (GLOBE NEWSWIRE) -- Protext Pharma, Inc. (Pinksheets: TXTM ) (\"Protext\" or \"the Company\"), a biotech company engaged in the development of pharmaceutical botanical medicines that are formulated with highly-bioavailable plant extracts, today announced that it has signed a binding letter of intent to acquire up to 100% of the ownership in Growprocess, Inc., a blockchain and cannabis compliance advisory firm that has set out to develop a next generation seed-to-sale Blockchain digital ledger platform for the legal cannabis industry. Growprocess’ platform will contain complete “seed-to-sale” information of every cannabis consignment produced. The blockchain-based platform will allow for a transparent tracking and payment solution which will be fully auditable and make clients fully compliant with the various reporting requirements. Additionally, Growprocess is finalizing negotiations and expects to have approximately 3 acres under greenhouse, initially, for commercial hemp production from which CBD will be produced for its commodity backed token expected to launch in early 2018.\nMatjaz “Matt” Hrovat, Chief Executive Officer of Growprocess, stated, “We are very excited about this transaction with Protext given the cannabis synergies between our businesses. I have spent the last several years building a successful CBD business and see the significant global opportunity presented by both the blockchain and cannabis industries. We are encouraged by the progress made in the fourth quarter of last year by the Government of South Africa where they officially legalized medical cannabis use. We believe Protext is well positioned to be one of the first companies, if not the first, to receive a Government-issued license to grow cannabis and conduct much-needed pharmaceutical research. With a country of around 55 million citizens, there will be a significant need for a digital ledger track-and-trace technology, which we believe is a perfect foundation for this business. The current global legal cannabis industry does over $7 billion annually, and expected to grow to over $30 billion by 2021, yet there remains a lack of consistent regulations and standardized rules of trade across borders, forcing much of the industry to operate in the shadows and remain outside of the established economic system. As Protext Pharma gears up to commence development of its Phyto-Cannabinoid extract, we want to be at the forefront of ensuring traceability of the product while guaranteeing payment up and down the delivery chain.”\nAddressing the proposed ICO token, Mr. Hrovat further explained, “Growprocess has ambitious goals set for 2018, which include the launch of the first ever cannabis-derivative, commodity-backed token anticipated launching in the first quarter. The recent dramatic volatility in the leading cryptocurrencies confirms our belief that tokens backed by a commodity provide certain buffers to that volatility due to the inherent stability of the underlying instrument. In order to back (or commoditize) our token with cannabis and/or CBD production, we are in the process of securing up to three acres of commercial greenhouse hemp production. This production is anticipated to yield approximately ten tons of hemp flowers with a (B2C) value of $8-10 million dollars for the 2018 grow season. Part of our long-term business strategy is to leverage our CBD business into pharmaceutical research. By backing our anticipated ICO not only with CBD production but also the projected medical cannabis production of Protext, we believe we can bring serious value to the offering with significant upside potential.”\nUnder the terms of the agreement, Protext will acquire 60% of Growprocess for 5,000 shares of Series D Preferred stock with an additional 30,000 shares of Series D Preferred Stock payable based on certain milestones being met by Growprocess. The Company has an option to acquire the remaining 40% during the first six months after closing for an additional $100,000 payable in cash or its equivalent in either preferred or restricted common stock. The Companies anticipate closing to occur around month’s end. Additional details of the Growprocess token, its branding and unique characteristics that have the potential to deliver a financial and funding instrument to a global industry will be made available shortly.\nInvestors are encouraged to follow Protext using:\nYouTube: http://bit.ly/ProtextYouTube\nTwitter: https://twitter.com/protxtm\nInstagram: https://www.instagram.com/protextm/\nAbout Growprocess:\nGrowprocess is developing a next generation of seed-to-sale Blockchain ledger platform for the legal cannabis industry, as well as a European-based CBD business. The Company’s platform will enable growers and dispensaries to streamline their operations and optimize their profit margins. Simultaneously, the Company seeks to produce pharmaceutical-grade cannabis products backed by clinical research.\nFor further information please visit http://growprocess.co and https://twitter.com/growprocessco\nAbout Protext Pharma, Inc.\nProtext Pharma operates two wholly owned subsidiaries; Plandai Biotechnology South Africa (Pty) Ltd. and Cannabis Biosciences, Inc. The Company is engaged in the research, clinical testing and commercialization of highly bioavailable botanical products—all-natural ingredients formulated for pharmaceutical applications and produced under pharma-grade conditions. Please visit http://www.protextm.co for further information.\nAbout Plandai Biotechnology SA\nThrough its wholly owned subsidiary Plandai Biotechnology SA, the Company has the exclusive worldwide license to develop Phytofare® extracts from live plant materials including Phytofare® catechin complex, a highly bioavailable, and clinically proven antioxidant complex produced from live green tea leaves. Phytofare® can deliver a therapeutic level of catechins, which function as powerful antioxidants, to the system where they remain active for over 24 hours.\nAbout Cannabis Biosciences\nThe Company is actively pursuing government licensing that will allow it to use its proprietary processing and extraction technology to commence investigations and produce a full-profile cannabis extract, one that contains both CBD and the precursor acid form of THC (THC-A and THC-B) found in live cannabis plant. The Company's investigations will be designed to show that the Cannabis Biosciences extraction process, which will use live leaf and low temperatures to extract the phyto-chemicals, should leave the acid forms of THC intact, resulting in a non-psychoactive extract with full medicinal potential and having the heightened bioavailability of other Phytofare® extracts.\nSafe Harbor Statement\nThis release contains forward-looking statements that are based upon current expectations or beliefs, as well as a number of assumptions about future events. Although we believe that the expectations reflected in the forward-looking statements and the assumptions upon which they are based are reasonable, we can give no assurance or guarantee that such expectations and assumptions will prove to have been correct. Forward-looking statements are generally identifiable by the use of words like \"may,\" \"will,\" \"should,\" \"could,\" \"expect,\" \"anticipate,\" \"estimate,", "external_links": ["https://www.globenewswire.com/Tracker?data=5T-focF9bkZJehqC57mWeVuDU45rvs3BNMoyBPOgEzAU0I3s-tlL4TyvZMXSCEyoknFZFeH306jxQWNPTIWD5jgI987pwiNQi29gkriuWhM=", "http://bit.ly/ProtextYouTube", "https://www.globenewswire.com/Tracker?data=Z3ROvJl74LPCYGLBUIolUMlD2-JokhpHEBzKKQHMAcKp7PndoZpYDsRQWFKtwczDVwagdlHTTq0IKgtwAblaHyorI-eGe6bjTrCtcH84SaI=", "https://twitter.com/growprocessco", "https://www.globenewswire.com/Tracker?data=Z3ROvJl74LPCYGLBUIolULPqgGU3r1XZPU55Yjm8yJjvP1wwaxEkz8GTV5Q-Nc1vwXAssiYKmAXrqzg5OSnzwaug-3-6EA2A6drR3oXHiOoARGsi1k0itOTIlBGJ4AxR", "https://www.globenewswire.com/Tracker?data=5T-focF9bkZJehqC57mWeXBEi_BXiHL5XFMFwghpx0xbIp_g0vHHe6UA1aYBelPzbOHJ51FBMHr5EY1Qq7e4uJhlLE_OzfaGIGS2JoYZlOg=", "https://www.instagram.com/protextm/", "https://www.globenewswire.com/Tracker?data=5T-focF9bkZJehqC57mWed700obh3FTueuJ8SDD01RR0FC60ywaAXVKsZ30ZPD8E1zjnb9afREyLWrXDTLWvNvg5CjGUFe4Qu7gEXKVh_PA=", "https://twitter.com/protxtm"], "published": "2018-01-19T18:00:00.000+02:00", "crawled": "2018-01-19T20:49:14.000+02:00", "highlightTitle": ""}