{"organizations": [], "uuid": "a15d0b2dc115d1973b07e90c155036503ec87b10", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-aura-frames-hires-jonathan-harris-as-president.html", "country": "US", "domain_rank": 767, "title": "Aura Frames Hires Jonathan Harris as President", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.012, "site_type": "news", "published": "2018-01-03T18:30:00.000+02:00", "replies_count": 0, "uuid": "a15d0b2dc115d1973b07e90c155036503ec87b10"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-aura-frames-hires-jonathan-harris-as-president.html", "ord_in_thread": 0, "title": "Aura Frames Hires Jonathan Harris as President", "locations": [], "entities": {"persons": [{"name": "jonathan harris", "sentiment": "negative"}, {"name": "harris", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 3, 2018 /PRNewswire/ -- Aura Frames, the only WiFi picture frame powered by smart curation software, coupled with a modern, chic design, today announced that Jonathan Harris has joined its executive team as President. In his role, Harris will oversee all business operations, marketing efforts and strategic initiatives contributing to the brand's ongoing growth.\nHarris has more than 25-years of experience shaping and strengthening consumer tech companies with extensive experience in sales and marketing, project management and business development. Recently, Harris served as Senior Vice President of Intergalactic Sales at GoPro, where he expanded GoPro's retail presence from ~2,500 doors to over 40,000 and sales from $19MM to over $1.6B over the course of his tenure. He also currently sits on the Board of Directors for TrackR, the bluetooth-based item tracking device.\n\"Aura Frames represents a coalition of the brightest tech and engineering minds in the industry, as well as the most forward-thinking designers in the fields of home décor & industrial design,\" said Harris. \"I look forward to helping steward our brand into the future and holding fast to our role as leaders and innovators in this exciting category.\"\nAura Frames is creating a new category in the digital frame business by delivering a digital frame powered by machine learning, designed by some of the top, most creative engineers in the nation and connected to an app that allows a consumer's friends and family to regularly send new and old memories right to their frame automatically.\n\"Jonathan brings experience and a proven track record in brand building to the Aura Team,\" said Aura Frames Founder and CEO, Abdur Chowdhury. \"We've seen some great traction with our interactive digital frames, and we are fortunate to have Jonathan on board to help bring the company to the next level.\"\nABOUT AURA\nAura is the leading innovator in the smart home decor category. By marrying high-end design with cutting-edge technology, Aura's smart frame will fundamentally change the way you experience photography by magically gathering photos that you care about from your family and displaying them in beautiful frames.\nMEDIA CONTACT\nCarrie Pendolino\n650.868.4032\ncarrie@auraframes.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/aura-frames-hires-jonathan-harris-as-president-300577053.html\nSOURCE Aura Frames", "external_links": ["http://www.prnewswire.com/news-releases/aura-frames-hires-jonathan-harris-as-president-300577053.html"], "published": "2018-01-03T18:30:00.000+02:00", "crawled": "2018-01-03T21:09:54.051+02:00", "highlightTitle": ""}