{"organizations": [], "uuid": "86f0034894bcfc57da467e983628d939912f15d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219021165&w=1200&r=LYNXMPEE020H0", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/germany-economy-unemployment/german-jobs-bonanza-pushes-unemployment-to-record-low-idINKBN1ES0PH", "country": "US", "domain_rank": 408, "title": "German jobs bonanza pushes unemployment to record low", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T12:49:00.000+02:00", "replies_count": 0, "uuid": "86f0034894bcfc57da467e983628d939912f15d8"}, "author": "", "url": "https://in.reuters.com/article/germany-economy-unemployment/german-jobs-bonanza-pushes-unemployment-to-record-low-idINKBN1ES0PH", "ord_in_thread": 0, "title": "German jobs bonanza pushes unemployment to record low", "locations": [], "entities": {"persons": [{"name": "michael nienaber", "sentiment": "none"}, {"name": "joerg zeuner", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "kfw", "sentiment": "none"}, {"name": "federal labour office", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BERLIN (Reuters) - Germany’s unemployment rate hit a record low as its jobless total fell more than forecast in December, underpinning a broad-based economic upswing that augurs well for further strong growth in 2018.\nFILE PHOTO: The entrance of the Jobcenter in Eichstaett August 29 2013. REUTERS/Michael Dalder/File Photo Consumers in Europe’s biggest economy are reaping the benefits of a jobs bonanza accompanied by rising real wages and ultra-low borrowing costs, while its exporters ride a recovery tide that is pushing up demand from the United States and China as well as other European states.\n“There are no signs that the dynamic growth of the German economy will stop abruptly,” KfW chief economist Joerg Zeuner said in a research note following Wednesday’s Federal Labour Office data.\n“So we expect new employment records for 2018 and a further tangible increase in real wages.”\nThe seasonally adjusted jobless total dropped by 29,000 to 2.442 million, the data showed - more than double the 12,000 forecast in a Reuters poll.\nDecember’s unemployment rate was 5.5 percent, the same as a revised reading for November and the lowest level since German reunification in 1990, the office said. In 2017 as a whole, the rate fell to 5.7 percent from 6.1 percent.\nGETTING LEFT BEHIND The strong labour market provides welcome relief for conservative Chancellor Angela Merkel as she struggles to form a coalition government more than three months after a national election.\nData released on Tuesday showed Germany’s workforce expanded last year to a record 44.3 million, and the Ifo economic institute expects the rosy picture to endure, with employment levels hitting 44.8 million this year and 45.2 million next.\nThe Labour Office said there were 761,000 job vacancies in December, suggesting companies are struggling to find skilled workers quickly.\nBut that offers scant comfort for those whom the economic upswing is leaving behind.\nThe number of Germany’s long-term unemployed has remained broadly unchanged over the past ten years at around 1 million.\nThe German economy is expected to have grown by a calendar-adjusted 2.6 percent in 2017 and it is seen expanding by 2.5 percent in 2018, according to the Bundesbank.\nThe Federal Statistics Office will publish preliminary gross domestic product growth figures next week.\nFor a table of the labour market figures, click on:\nediting by John Stonestreet\n ", "external_links": [], "published": "2018-01-03T12:49:00.000+02:00", "crawled": "2018-01-03T13:14:08.008+02:00", "highlightTitle": ""}