{"organizations": [], "uuid": "dbcff096542044bded00a20bc24113b9812d286c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/07/104885752-RTX3JMPT-mexico-tourism.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10001054/device/rss/rss.html", "section_title": "Wealth", "url": "https://www.cnbc.com/2017/12/07/mexican-official-disputes-reports-of-tainted-alcohol-at-resorts.html", "country": "US", "domain_rank": 767, "title": "Mexican official disputes reports of tainted alcohol at resorts", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2017-12-07T22:36:00.000+02:00", "replies_count": 0, "uuid": "dbcff096542044bded00a20bc24113b9812d286c"}, "author": "Kevin Breuninger", "url": "https://www.cnbc.com/2017/12/07/mexican-official-disputes-reports-of-tainted-alcohol-at-resorts.html", "ord_in_thread": 0, "title": "Mexican official disputes reports of tainted alcohol at resorts", "locations": [], "entities": {"persons": [{"name": "cordero", "sentiment": "none"}, {"name": "enrique de la madrid cordero", "sentiment": "none"}], "locations": [{"name": "mexico", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "tripadvisor", "sentiment": "none"}, {"name": "u.s. state department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Mexico's secretary of tourism disputed reports of tainted alcohol and described warnings about criminal activities from the U.S. State Department as \"misleading\" on Wednesday.\n\"There is no evidence about tainted alcohol,\" Enrique de la Madrid Cordero said on CNBC's \" Power Lunch .\" Cordero said the case he reviewed concerned \"excessive alcohol\" — a problem associated with beach drinking culture — rather than tainted alcohol.\n\"The case that I've seen, where I have medical evidence, gives the evidence that the amount of alcohol that was drunk was excessive,\" he said.\nCordero also responded to reports of thousands of bottles of illegal alcohol being rounded up from resort suppliers. He stressed the distinction between tainted and illegal alcohol.\n\"Illegal, in Mexico, is alcohol that is not [being taxed],\" he said. Despite being illegal, Cordero says, that alcohol is \"good alcohol\" that is not tainted.\nAccounts of crimes against tourists, including rape, tainted alcohol and physical injury , surfaced last month after TripAdvisor was found to have deleted multiple users' complaints about their experiences at Mexican resorts, an investigation from the Milwaukee Journal Sentinel found.\nThe U.S. State Department updated a warning about traveling to Mexico in August, highlighting the risk of organized crime activity in a number of Mexican states. The warning said that \"U.S. citizens have been the victims of violent crimes, including homicide, kidnapping, carjacking, and robbery in various Mexican states.\"\nWhile Cordero doesn't want the U.S. State Department to remove its warnings, he said that \"sometimes, that information is misleading.\"\n\"I don't think it's a wise way to help Americans to make an intelligent decision, but that is for the U.S. to decide,\" he said.\nCordero said the problems with regard to tainted alcohol have mostly been of perception. But Mexico could do more to help promote \"a more responsible drinking of alcohol,\" he said. \"That's something we should work on.\"", "external_links": [], "published": "2017-12-07T22:36:00.000+02:00", "crawled": "2018-01-07T17:28:11.002+02:00", "highlightTitle": ""}