{"organizations": [], "uuid": "e3c081173624d9f99283fea11e7e008820037857", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/29/reuters-america-update-1-u-s-court-to-reconsider-ruling-on-san-francisco-soda-health-warnings.html", "country": "US", "domain_rank": 767, "title": "UPDATE 1-U.S. court to reconsider ruling on San Francisco soda health warnings", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T22:36:00.000+02:00", "replies_count": 0, "uuid": "e3c081173624d9f99283fea11e7e008820037857"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/29/reuters-america-update-1-u-s-court-to-reconsider-ruling-on-san-francisco-soda-health-warnings.html", "ord_in_thread": 0, "title": "UPDATE 1-U.S. court to reconsider ruling on San Francisco soda health warnings", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "warnings@ (Adds background, details on decision, requests for comment)\nSAN FRANCISCO, Jan 29 (Reuters) - A U.S. appeals court on Monday agreed to reconsider an earlier ruling which had blocked a San Francisco law that mandated health warnings for soda and other sugary drinks.\nA three-judge panel on the 9th U.S. Circuit Court of Appeals blocked the San Francisco ordinance last year. In an order on Monday, the appeals court said it would rehear the case before a larger, 11-judge panel.\nThe San Francisco ordinance is part of a growing national effort to curb consumption of soft drinks and other high-calorie beverages that medical experts say are largely to blame for an epidemic of childhood obesity. Many localities also have slapped special taxes on sugary beverages.\nSan Francisco passed an ordinance in June 2015 requiring advertisers within the city to include a black-box warning that said drinking high-sugar beverages contributed to obesity, diabetes and tooth decay.\nThe American Beverage Association, the California Retailers Association and the California State Outdoor Advertising Association, which in 2015 had asked for a preliminary injunction to block the ordinance's implementation, did not immediately respond to a request for comment on Monday.\nSan Francisco's city attorney office also did not immediately respond to a request for comment.\nThe appeals court decision does not reverse the blocking of the ordinance, but it suggest a majority of the appeals court judges are interested in reviewing the ruling.\nA unanimous three-judge 9th Circuit panel in September 2017 found that the required black-box warning \"overwhelmed other visual elements of the ads\" and could violate protected commercial speech.\nThe judges also said the city's warning requirements were misleading and deceptive by exclusively focusing on sugar-sweetened beverages and not the advertisement of other products with equal or greater amounts of added sugar. (Reporting by Dan Levine in San Francisco and Tina Bellon in New York; Editing by Paul Simao)", "external_links": [], "published": "2018-01-29T22:36:00.000+02:00", "crawled": "2018-01-30T06:17:03.002+02:00", "highlightTitle": ""}