{"organizations": [], "uuid": "2cfed095dd84383c0a26be19c576b8e453e58054", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-markets/global-markets-equities-advance-as-dow-tops-26000-dollar-steadies-idUSL8N1PB54U", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-Equities advance as Dow tops 26,000, dollar steadies", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-17T00:36:00.000+02:00", "replies_count": 0, "uuid": "2cfed095dd84383c0a26be19c576b8e453e58054"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-markets/global-markets-equities-advance-as-dow-tops-26000-dollar-steadies-idUSL8N1PB54U", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Equities advance as Dow tops 26,000, dollar steadies", "locations": [], "entities": {"persons": [{"name": "chuck mikolajczak", "sentiment": "none"}, {"name": "peter kenny", "sentiment": "none"}, {"name": "merck", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "thomson reuters", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "unitedhealth", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Wall Street advances to push Dow over 26,000\n* Dollar steadies after 4-day slump\n* ECB signals pull euro from 3-year high (Updates with U.S. market open, changes dateline; previous LONDON)\nBy Chuck Mikolajczak\nNEW YORK, Jan 16 (Reuters) - World stock markets advanced on Tuesday, with investors on Wall Street pushing the Dow index past the 26,000 threshold, while the U.S. dollar strengthened after four days of declines.\nThe healthcare sector, up 0.71 percent, paced the advance in the U.S., with Merck up 6.5 percent and UnitedHealth up 2.3 percent.\nUnitedHealth posted quarterly results that topped analyst estimates and raised its 2018 outlook, bolstering optimism for another solid quarter for corporate earnings.\nEarnings growth for the quarter is forecast at 12.1 percent, according to Thomson Reuters data through Friday.\n“U.S. equity markets are really turning on the afterburners now and it is really being validated by earnings and the economic data that is providing a really constructive outlook for the broader economy,” said Peter Kenny, senior market strategist at Global Markets Advisory Group, in New York.\n“The global economy and global markets are in sync for the first time in a meaningful way since the Great Recession.”\nThe Dow Jones Industrial Average rose 153.95 points, or 0.6 percent, to 25,957.14, the S&P 500 gained 7.96 points, or 0.29 percent, to 2,794.2 and the Nasdaq Composite added 33.55 points, or 0.46 percent, to 7,294.61.\nCitigroup shares rose 0.6 percent to $77.34 after earnings topped expectations, the latest major U.S. bank to post results for the fourth quarter. The S&P financial index is up nearly 5 percent to start the year.\nThe dollar strengthened to put the greenback on track to snap a four-session skid of losses but remained near three-year lows. The advance helped lift exporter shares in Asia, with Japan’s Nikkei hitting its highest since 1991. Shares in Europe, were little changed.\nThe pan-European FTSEurofirst 300 index lost 0.09 percent and MSCI’s gauge of stocks across the globe gained 0.19 percent. The gains for the MSCI index marked its third consecutive record.\nThe euro retreated from a three-year high, down 0.24 percent to $1.2231, as investors sold the currency on doubts that the European Central Bank would back away from its pledge to keep buying bonds at next week’s meeting.\nU.S. long-dated Treasury yields fell along with those of European bonds, following the report that the ECB was not quite ready to put away its bond-buying plan.\nBenchmark 10-year notes last rose 2/32 in price to yield 2.5462 percent, from 2.552 percent late on Friday.\nOil prices eased from three-year highs as traders booked profits from the rally but healthy demand underpinned prices near $70, a level not seen since 2014’s market slump.\nU.S. crude fell 0.53 percent to $63.96 per barrel and Brent was last at $69.43, down 1.18 percent on the day.\nEditing by Bernadette Baum\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T00:36:00.000+02:00", "crawled": "2018-01-16T23:11:38.021+02:00", "highlightTitle": ""}