{"organizations": [], "uuid": "d5e6b332d434b79f13ec678ec15a0830eae9b1e0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/03/104926457-GettyImages-488906561-hotel-maid.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/maids-to-ask-las-vegas-hotels-for-panic-buttons.html", "country": "US", "domain_rank": 767, "title": "Maids to ask Las Vegas hotels for panic buttons", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.043, "site_type": "news", "published": "2018-01-26T17:51:00.000+02:00", "replies_count": 0, "uuid": "d5e6b332d434b79f13ec678ec15a0830eae9b1e0"}, "author": "Simon Dawson", "url": "https://www.cnbc.com/2018/01/26/maids-to-ask-las-vegas-hotels-for-panic-buttons.html", "ord_in_thread": 0, "title": "Maids to ask Las Vegas hotels for panic buttons", "locations": [], "entities": {"persons": [{"name": "simon dawson", "sentiment": "none"}], "locations": [{"name": "las vegas", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "las vegas strip", "sentiment": "none"}], "organizations": [{"name": "u.s. news maids", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "culinary union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The union representing tens of thousands of hotel workers in Las Vegas will ask casino-resort operators to give every housekeeper a \"panic button\" as it begins negotiating new contracts amid the #MeToo movement against sexual misconduct.\nLeaders of the Culinary Union will bring the request to the bargaining table next month on behalf of the more than 14,000 housekeepers who work on the Las Vegas Strip and the destination's downtown area. The push is in line with ordinances recently approved in other cities that provide hotel workers with some protections.\n\"We want safety for all the workers,\" Geoconda Argüello-Kline, the union's secretary-treasurer, told The Associated Press. \"We want to have some language in the contract to protect more the people who work inside the hotels. ... We know what's going on with sexual harassment. No woman should have to go through that.\"\nThe union declined to provide figures related to threatening situations that housekeepers have faced in recent years while working at Las Vegas hotels. Court records show some housekeepers have been brutally attacked in the past.\nAuthorities accused a 22-year-old man of sexually assaulting a housekeeper who was cleaning a bathroom in 2016 at the Boulder Station hotel-casino. Police said the man stormed the room, punched the woman in the face, closed the doors and assaulted her. The victim told police that she yelled, but the man only hit her harder.\nA 19-year-old man was arrested in 2011 after a 65-year-old housekeeper was punched in the face and sexually assaulted inside a room at Bally's.\nIn New York City, housekeepers at unionized hotels have been carrying panic buttons — wireless devices that alert managers if they are attacked — since 2013. The move was in response to a union effort after a maid accused Dominique Strauss-Kahn, then-leader of the International Monetary Fund, of sexual assault.\nFollowing the lead of voters in Seattle in 2016, the Chicago City Council passed an ordinance in October requiring hotels to provide panic buttons to workers by next summer if they work alone in guest rooms.\nIn Las Vegas, the contracts of 50,000 union members, including housekeepers, cooks, bartenders and food and cocktail servers, expire at midnight May 31. The bulk of people work at properties downtown and on the Strip, including those operated by MGM Resorts International and Caesars Entertainment.\nMGM Resorts in a statement on Wednesday said \"workplace safety is a top priority\" and will work with the union to equip housekeepers at all of its Las Vegas resorts with panic buttons in the coming months. Meanwhile, Caesars Entertainment in a statement said it is working with the union \"to develop pilot programs that explore how technology can enhance employee safety.\"\nThe average hourly wage of union workers is $23, including benefits such as premium-free health care, a pension and a 401(k) retirement savings plan and $25,000 down-payment assistance for first-time homebuyers.\nArgüello-Kline said the group will negotiate with companies to protect existing benefits, increase wages, protect job security against the increasing adoption of technology at hotel-casinos, and strengthen language against sexual harassment.\n\"It's not like the recession anymore,\" Argüello-Kline said. \"The economy is better. ... We want the companies to be successful and grow, and we want the workers to have the right share from the company and the fair share, too.\"\nCasinos on the Strip earned a profit of $814 million during the fiscal year that ended June 30, according to data from the Nevada Gaming Control Board. That represented a 191.4 percent increase compared with 2016. It was the second fiscal year in a row that the Strip saw income gains after a streak of seven consecutive net losses.\nCasino operators agreed to raise wages during the last round of negotiations in 2013 as the city was coming out of the recession. MGM Resorts, for example, agreed to pay employees an extra 35 cents per hour in the first year of the contract, 50 cents more in the second year and an additional 55 cents in the third. It also agreed to later negotiate increases for the fourth and fifth years.", "external_links": [], "published": "2018-01-26T17:51:00.000+02:00", "crawled": "2018-01-26T17:52:37.020+02:00", "highlightTitle": ""}