{"organizations": [], "uuid": "fb32035b4061afd93878233bee20ce6e3104d2c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180107&t=2&i=1220102196&w=1200&r=LYNXMPEE060P9", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-starbucks-lawsuit/starbucks-wins-dismissal-in-u-s-of-underfilled-latte-lawsuit-idUSKBN1EW0V5", "country": "US", "domain_rank": 408, "title": "Starbucks wins dismissal in U.S. of underfilled latte lawsuit", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T23:50:00.000+02:00", "replies_count": 0, "uuid": "fb32035b4061afd93878233bee20ce6e3104d2c4"}, "author": "", "url": "https://www.reuters.com/article/us-starbucks-lawsuit/starbucks-wins-dismissal-in-u-s-of-underfilled-latte-lawsuit-idUSKBN1EW0V5", "ord_in_thread": 0, "title": "Starbucks wins dismissal in U.S. of underfilled latte lawsuit", "locations": [], "entities": {"persons": [{"name": "yvonne gonzalez rogers", "sentiment": "none"}, {"name": "rogers", "sentiment": "none"}, {"name": "jonathan stempel", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "starbucks", "sentiment": "negative"}, {"name": "starbucks corp", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "oakland", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 7, 2018 / 9:56 PM / Updated 15 hours ago Starbucks wins dismissal in U.S. of underfilled latte lawsuit Jonathan Stempel 3 Min Read \n(Reuters) - Starbucks Corp has won the dismissal of a U.S. lawsuit accusing the coffee chain of overcharging customers by underfilling lattes and mochas to reduce milk costs. \nU.S. District Judge Yvonne Gonzalez Rogers on Friday found a lack of evidence that Starbucks cheats customers by making its cups too small, using “fill-to” lines on baristas’ pitchers that are too low, and instructing baristas to skimp on ingredients, such as by leaving a quarter-inch of space atop drinks. \nThe Oakland, California-based judge also rejected a claim that milk foam added to lattes and mochas should not count toward advertised volumes. She said reasonable customers expect foam to take up some volume, and the plaintiffs conceded that foam is an essential ingredient in their drinks. \n“Accordingly, plaintiffs fail to show that lattes contain less than the promised beverage volume represented on Starbucks’ menu boards,” Rogers wrote. \nLawyers for the plaintiffs did not immediately respond on Sunday to requests for comment. Starbucks did not immediately respond to similar requests. \nLattes contain espresso, steamed milk and foam. Mochas are similar but also contain a chocolate sauce. \nSiera Strumlauf and Benjamin Robles, both of California, and Brittany Crittenden of New York had accused Starbucks in their proposed nationwide class action of fraud and false advertising by underfilling 12-, 16- and 20-ounce lattes by about 25 percent, causing unspecified damages. \nStarbucks countered that its cups hold more than the advertised number of ounces, and that the “fill-to” lines provide guidance to baristas as to how much cold milk, which expands when steamed, to pour into pitchers. \nIn 2016, two federal judges dismissed separate lawsuits accusing the Seattle-based company of cheating customers who bought iced beverages, finding that reasonable customers would understand that ice counts toward their drinks’ contents. \nThe case is Strumlauf et al v Starbucks Corp, U.S. District Court, Northern District of California, No. 16-01306. Reporting by Jonathan Stempel in New York; Editing by Lisa Shumaker", "external_links": [], "published": "2018-01-07T23:50:00.000+02:00", "crawled": "2018-01-08T00:01:34.000+02:00", "highlightTitle": ""}