{"organizations": [], "uuid": "8bb494f018cf5f225ec0119b9a283efa9ae09ef8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/09/the-associated-press-study-examines-california-prison-guards-high-suicide-rate.html", "country": "US", "domain_rank": 767, "title": "Study examines California prison guards' high suicide rate", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T18:26:00.000+02:00", "replies_count": 0, "uuid": "8bb494f018cf5f225ec0119b9a283efa9ae09ef8"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/09/the-associated-press-study-examines-california-prison-guards-high-suicide-rate.html", "ord_in_thread": 0, "title": "Study examines California prison guards' high suicide rate", "locations": [], "entities": {"persons": [{"name": "scott jones", "sentiment": "negative"}, {"name": "jones", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "sacramento", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "university of california, berkeley", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SACRAMENTO, Calif. (AP) — Correctional Officer Scott Jones kissed his wife goodbye on July 8, 2011, and headed off to a maximum-security prison in the remote high desert of northeastern California. He never came home.\nJones' body was found a day later, along with a note explaining why the 36-year-old took his own life: \"The job made me do it.\"\nSuicide is distressingly common among current and former California prison employees. The guards' union counts 96 confirmed or suspected suicides among current and retired members between 1999 and 2015.\nThe annual suicide rate among union members exceeded California's overall suicide rate of 10.3 per 100,000 people in 13 of those 17 years, according to an Associated Press analysis of union data. The number peaked at 13 in 2012, a rate more than four times that of the state's general population.\nNow, a first-in-the-nation study coordinated among the union, California's corrections agency and University of California, Berkeley researchers is trying to figure out why and what to do about it.\nInmate suicides have been intensively studied, but until now there has been limited research on how the job affects correctional employees, Berkeley researcher Amy Lerman said — and virtually none on programs that might help officers cope.\n\"I think it reflects a growing recognition across the country that correctional staff and law enforcement are experiencing these types of issues and it needs to be taken seriously,\" Lerman said.\nAbout 10 percent of prison guards say they have considered or attempted suicide, a rate nearly three times that of the general U.S. population, according to data provided to the AP from a survey completed by 8,300 of California's 30,000 correctional and parole officers.\nIt's even higher among retired guards — about 14 percent, similar to the suicide risk among military veterans.\nHalf of correctional officers expressed at least one symptom of post-traumatic stress disorder.\nResearchers cited officers' frequent exposure to violence and injury, their perception of constant danger, and their reluctance to share traumatic experiences with family members or counselors.\nIn response, the union is asking Gov. Jerry Brown's administration to hire a social worker for each of the state's 35 prisons next year and is seeking stronger confidentiality protections for workers who seek help.\nCalifornia Corrections Secretary Scott Kernan said currently available assistance programs are not used enough. He promised to consult with experts to see what the department can do better.\nOne hurdle to helping troubled officers is the stigma or perception of weakness among such workers.\nThe best solution seems to be having a highly trained peer support program that can connect troubled officers with mental health professionals, said Daniel Beaman, a correctional officer and California Correctional Peace Officers Association official.\nThat approach has helped reduce suicides among law enforcement officers, according to The Badge of Life, a widely cited prevention program that attempts an annual national tally of police suicides. The number fell 14 percent between 2012 and 2016, continuing a decline since 2008 and dropping the rate below that of the general population, although there was a reported increase last year.\nThe organization attributed the decrease to more aggressive mental health and peer support programs, and a growing willingness among troubled police officers to get help.\nLike police officers, prison guards go to work each day knowing they could face violence. It's a reality softened by the financial rewards — California guards can earn more than $100,000 with salary and overtime and have top-notch health care and retirement plans.\nBeaman equates being a prison guard to the time he spent as a Marine in Iraq in 2005. Battles there were alarmingly similar to what he experienced during a fight among about 300 Kern Valley State Prison inmates in 2010.\n\"The smell, the sounds were way too familiar,\" he said. \"Bam — I went from one war right to another one.\"\nStephen Walker remembers sleepless nights during the 16 years he spent as a California youth correctional officer in suburban Los Angeles, and ultimately sitting on his couch \"debating on whether to just end it all.\"\nWalker, now the union's chief lobbyist, will try again to pass a state law protecting public safety workers' confidentiality if they seek help. The union also is lining up California congressional support for requiring the federal government to study and fund mental health programs for law enforcement officers.\nThe Berkeley study comes too late for Jones and his family — and for at least three other High Desert State Prison guards who the Lassen County coroner's office says died of self-inflicted gunshot wounds between 2008 and 2013.\nIn a final three-day span, Janelle Jones said her husband threatened to kill himself, felt immediate relief when he quit his prison job, then was on his way in to reclaim his job when he killed himself. She sued the state alleging her husband essentially was harassed to death by other guards who feared he might rat them out over a bogus worker's compensation claim after he injured his knee during horseplay with another officer.\nShe eventually settled for $73,000.\n\"We hugged and kissed goodbye. Everything was perfectly normal,\" she said. \"Then we discovered the gun was missing, and you know the rest of the story.\"", "external_links": [], "published": "2018-01-09T18:26:00.000+02:00", "crawled": "2018-01-09T20:42:59.004+02:00", "highlightTitle": ""}