{"organizations": [], "uuid": "cdffa6d38aa2b3231caf721e39036791e205bdfc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-olympics-2018-sno-ormerod/britains-ormerod-ready-to-take-off-for-snowboarding-gold-idUKKBN1EX19Q", "country": "US", "domain_rank": 408, "title": "Britain's Ormerod ready to take off for snowboarding gold", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T15:26:00.000+02:00", "replies_count": 0, "uuid": "cdffa6d38aa2b3231caf721e39036791e205bdfc"}, "author": "", "url": "https://uk.reuters.com/article/uk-olympics-2018-sno-ormerod/britains-ormerod-ready-to-take-off-for-snowboarding-gold-idUKKBN1EX19Q", "ord_in_thread": 0, "title": "Britain's Ormerod ready to take off for snowboarding gold", "locations": [], "entities": {"persons": [{"name": "martyn her", "sentiment": "negative"}, {"name": "ormerod", "sentiment": "negative"}, {"name": "katie ormerod", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}], "organizations": [{"name": "yorkshire", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 1:29 PM / Updated an hour ago Britain's Ormerod ready to take off for snowboarding gold Martyn Herman 4 Min Read \nLONDON (Reuters) - She stands little more than five feet tall in her boots but when Katie Ormerod takes off on a snowboard she looks every inch a candidate to win Britain’s first Olympic gold medal on snow. \nThe bubbly and apparently fearless 20-year-old from Yorkshire will head to the Winter Olympics in Pyeongchang as one of the main contenders in the big air event which will be making its first appearance in the Games. \nFrom the moment she first experienced real snow on family holidays, former gymnast Ormerod was never content to merely make it down the bottom of a run. \nThe chance to get airborne was always too tempting. \nIt was that daredevil spirit that elevated Ormerod into the snowboarding stratosphere in 2014 when, months after missing the Sochi Olympics, she became the first female to land a backside double cork 1080 -- three rotations with two inverted flips. \n“I was only 16 at the time and a lot of the older girls that were in the industry, like all the top girls at the time, they all saw it and they were giving me lots of props (respect) for it, saying that I was leading the next generation,” Ormerod told Reuters at an indoor ski dome north of London. \n”It was really nice to see I was inspiring the older generation. Landing that kind of kick-started my professional career. I then started getting invites to big events like X Games and doing well in them. \n“That gave me the confidence I needed to go to events knowing that I belonged there and I started getting more World Cup podiums so it really helped me out, did that.” \nIn a sport where boundaries are there to be broken, Ormerod knows that her rivals will be trying to raise the bar in South Korea next month. But she exudes the quiet confidence of an athlete at the top of her profession. \nIn 2016 she was third in slopestyle at the X Games in Aspen and last year in Moscow she became the first Briton to win a World Cup big air title. There were also numerous podium finishes in big air and slopestyle, including in Pyeongchang at a competition that served as a test event. \nShe began this year with a big air second place in Milan. \nIt has not all been plain sailing though. \nShe has broken both wrists and a shoulder and last March she said she “got lucky” when breaking her back during a qualification accident at the freestyle world championships in Sierra Nevada, Spain. \n”There have been plenty of bumps and bruises,“ she said with a heavy dose of under-statement. ”It was the first day of training in Spain and I went way too big on one of the jumps and landed flat on my back and chipped a bit off the L3 vertebrae. \n”Wasn’t the best news being told I had broken my back. But it could have been a lot worse. I was able to walk and had six-week rehabilitation. Luckily my gymnastics background helped because I could work away from the snow. \n“Gymnastics is the closest thing to snowboarding and it’s a safer environment and I could test myself before getting back on the board.” \nDespite most of the team learning their craft on artificial slopes, Britain has several ski and snowboard medal shouts at the Games next month, courtesy of strong financial backing and attention to detail in all aspects of the various disciplines. \nBut none will travel with more expectation than Ormerod who is tipped to better the performance of Jenny Jones whose bronze in snowboard slopestyle in Sochi was the nation’s first on snow. \n“I am feeling really confident for the Olympics and I am hoping to bring back a medal because last season was the best season I have had,” Ormerod, who will also compete in the ‘obstacle course’ like event of slopestyle, said. \n“I was super-gutted not to make Sochi. So I want to go there to Pyeongchang and show the world what I can do, ride to my best and bring back a medal.” Reporting by Martyn Herman; Editing by Amlan Chakraborty", "external_links": [], "published": "2018-01-08T15:26:00.000+02:00", "crawled": "2018-01-08T15:41:31.008+02:00", "highlightTitle": ""}