{"organizations": [], "uuid": "541ca93b1d989b910d48a3a4b7691d71e7e3cc3f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-richardson-electronics-reports-second-quarter-fiscal-2018-profit-and-declares-quarterly-cash-dividend.html", "country": "US", "domain_rank": 767, "title": "Richardson Electronics Reports Second Quarter Fiscal 2018 Profit and Declares Quarterly Cash Dividend", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.784, "site_type": "news", "published": "2018-01-11T01:00:00.000+02:00", "replies_count": 0, "uuid": "541ca93b1d989b910d48a3a4b7691d71e7e3cc3f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-richardson-electronics-reports-second-quarter-fiscal-2018-profit-and-declares-quarterly-cash-dividend.html", "ord_in_thread": 0, "title": "Richardson Electronics Reports Second Quarter Fiscal 2018 Profit and Declares Quarterly Cash Dividend", "locations": [], "entities": {"persons": [], "locations": [{"name": "lafox", "sentiment": "none"}, {"name": "ill.", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "richardson electronics reports second", "sentiment": "negative"}, {"name": "richardson electronics, ltd.", "sentiment": "neutral"}, {"name": "richardson healthcare", "sentiment": "none"}, {"name": "pmt", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LAFOX, Ill., Jan. 10, 2018 (GLOBE NEWSWIRE) -- Richardson Electronics, Ltd. (NASDAQ:RELL) today reported financial results for its second quarter ended December 2, 2017. The Company also announced that its Board of Directors declared a $0.06 per share quarterly cash dividend.\nSecond Quarter Results\nNet sales for the second quarter of fiscal 2018 increased 15.5% to $39.1 million compared to net sales of $33.8 million in the prior year’s second quarter. Sales increased $4.8 million for PMT and $1.3 million for Canvys. PMT sales were higher in power grid tubes, power conversion and RF and microwave components as well as specialty products sold into the semiconductor wafer fabrication capital equipment market. Sales increased for Canvys due to higher overall demand in Europe. Sales decreased for Richardson Healthcare by $0.8 million due to the sale of the PACS Display business at the end of fiscal 2017, partially offset by higher certified pre-owned CT Tube sales.\nGross margin increased to $13.4 million, or 34.2% of net sales during the second quarter of fiscal 2018, compared to $11.0 million, or 32.4% of net sales during the second quarter of fiscal 2017. Margin increased as a percent of net sales primarily due to a favorable product mix. Richardson Healthcare margin as a percent of net sales also increased due to the sale of its lower margin PACS Display business.\nOperating expenses were $12.6 million for the second quarter of fiscal 2018 compared to $13.4 million in the second quarter of fiscal 2017. The second quarter of fiscal 2017 included $1.3 million in severance expense from a reduction in force. After excluding the severance expense from the second quarter of fiscal 2017, operating expenses increased due to higher research and development expenses for Richardson Healthcare and additional expenses relating to the increase in net sales. Operating expenses as a percent of sales decreased to 32.2% in the current quarter from 35.7% last year when excluding the severance expense from the second quarter of fiscal 2017.\nAs a result, the company reported $0.8 million of operating income for the second quarter of fiscal 2018 compared to an operating loss of $2.4 million in the prior year’s second quarter. Other expense for the second quarter of fiscal 2018, primarily a foreign exchange loss, was $0.1 million, compared to other income of $0.2 million, primarily a foreign exchange gain, for the second quarter of fiscal 2017.\nThe income tax provision of $0.5 million during the second quarter of fiscal 2018 reflected a provision for foreign income taxes based on the current quarter’s geographical distribution of income, additional tax due from an audit in Germany and no U.S. tax benefit due to the valuation allowance recorded against the net operating loss. The tax provision of $0.3 million in the second quarter of fiscal 2017 included a provision for foreign income taxes and no U.S. tax benefit due to the valuation allowance recorded against the net operating loss.\nIncome from continuing operations for the second quarter of fiscal 2018 was $0.2 million, compared to a loss from continuing operations of $2.5 million in the second quarter of 2017. In addition, during the second quarter of fiscal 2018, the Company received an income tax refund from the State of Illinois, inclusive of interest and net of professional fees, of $1.5 million. This refund was a result of the conclusion of the Illinois amended return related to the sale of the RF, Wireless and Power Division (“RFPD”) in 2011 and was therefore, classified as income from discontinued operations.\nAs a result, net income for the second quarter of fiscal 2018 was $1.7 million compared to a net loss of $2.5 million in the second quarter of fiscal 2017.\nFINANCIAL SUMMARY – SIX MONTHS ENDED DECEMBER 2, 2017\nNet sales for the first six months of fiscal 2018 were $76.1 million, an increase of 13.2%, compared to net sales of $67.2 million during the first six months of fiscal 2017. Sales increased by $8.6 million for PMT and $2.4 million for Canvys. These increases were partially offset by a $2.1 million decrease for Richardson Healthcare, which was due to the divestiture of the PACS Display business at the end of fiscal 2017. Gross margin increased to $25.5 million during the first six months of fiscal 2018, compared to $21.2 million during the first six months of fiscal 2017. In addition, as a percentage of net sales, gross margin increased to 33.5% of net sales during the first six months of fiscal 2018, compared to 31.6% of net sales during the first six months of fiscal 2017, mostly as a result of an improved product mix. Operating expenses decreased to $24.9 million for the first six months of fiscal 2018, compared to $25.7 million for the first six months of fiscal 2017. The decrease was due to the $1.3 million in severance expense associated with the reduction in work force during the second quarter of fiscal 2017, partially offset by higher research and development expenses for Richardson Healthcare. Operating income during the first six months of fiscal 2018 was $0.8 million, compared to an operating loss of $4.5 million during the first six months of fiscal 2017. Other expense for the first six months of fiscal 2018, including foreign exchange, was $0.1 million, compared to other expense of $0.1 million for the first six months of fiscal 2017. The income tax provision of $0.6 million during the first six months of fiscal 2018 reflected a provision for foreign income taxes, additional tax due from an audit in Germany and no U.S. tax benefit due to the valuation allowance recorded against the net operating loss. The tax provision of $0.8 million in the first six months of fiscal 2017 included a provision for foreign income taxes, additional tax due from an audit in France and no U.S. tax benefit due to the valuation allowance recorded against the net operating loss. Income from continuing operations for the first six months of fiscal 2018 was $0.1 million, compared to a loss from continuing operations of $5.4 million in the first six months of 2017. In addition, during the second quarter of fiscal 2018, the Company received an income tax refund from the State of Illinois, inclusive of interest and net of professional fees, of $1.5 million. This refund was a result of the conclusion of the Illinois amended return related to the sale of RFPD in 2011 and was therefore, classified as income from discontinued operations. Net income for the first six months of fiscal 2018 was $1.6 million, compared to a net loss of $5.4 million during the first six months of fiscal 2017.\nCASH DIVIDEND\nThe Company also announced today that its Board of Directors declared a $0.06 quarterly dividend per share to holders of common stock and a $0.054 cash dividend per share to holders of Class B common stock. The dividend will be payable on February 22, 2018, to common stockholders of record on February 9, 2018.\nCash and investments at the end of the second quarter of fiscal 2018 were $59.3 million compared to $61.4 million at the end of the first quarter of fiscal 2018 and $62.8 million at the end of the second quarter of fiscal 2017. During the second quarter of fiscal 2018, the Company did not repurchase any shares of its common stock under the existing share repurchase authorization. Since the sale of RFPD, the Company has spent $65.6 million on share repurchases, nearly $20.0 mi", "external_links": ["https://www.globenewswire.com/Tracker?data=rfpD3ZQsdQnwv_srYvZb1H5Nv5lyhoHmL2jp91rQZwZ0UcupWsagO3EA90gp7zFrdWAZwjtEUVPzH02ofRQL9w==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/b6c3bcfb-5de4-48df-a209-792b04f1b8d0"], "published": "2018-01-11T01:00:00.000+02:00", "crawled": "2018-01-11T03:23:57.008+02:00", "highlightTitle": ""}