{"organizations": [], "uuid": "166f013fb8d6a947bf34c0f0fe9817abf1b64f4c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-bitcoin-evangelist-charlie-shrem-joins-particls-team-of-advisors.html", "country": "US", "domain_rank": 767, "title": "Bitcoin Evangelist Charlie Shrem Joins Particl's Team of Advisors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.125, "site_type": "news", "published": "2018-01-27T04:24:00.000+02:00", "replies_count": 0, "uuid": "166f013fb8d6a947bf34c0f0fe9817abf1b64f4c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-bitcoin-evangelist-charlie-shrem-joins-particls-team-of-advisors.html", "ord_in_thread": 0, "title": "Bitcoin Evangelist Charlie Shrem Joins Particl's Team of Advisors", "locations": [], "entities": {"persons": [{"name": "charlie shrem", "sentiment": "negative"}, {"name": "charlie shrem joins particl", "sentiment": "negative"}, {"name": "charlie", "sentiment": "none"}], "locations": [{"name": "zug", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "bitcoin foundation", "sentiment": "none"}, {"name": "moneygram", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ZUG, Switzerland, Jan. 26, 2018 /PRNewswire/ -- Charlie Shrem brings unparalleled access to services and partners within the blockchain ecosystem. Charlie was founding member of the Bitcoin Foundation and co-founded one of the first and largest Bitcoin companies, BitInstant, in 2011. BitInstant allowed people to efficiently move their money into and within the Bitcoin economy in a fast and familiar way. Partnering with MoneyGram, Charlie brought crypto to people's front door with the ability to deposit cash for Bitcoin at over 700,000 locations in the United States at its peak.\n\"I'm excited to be working with Particl,\" says Charlie Shrem . \"As I see privacy, fungibility and ease of use the main pillars for any crypto. What if there were no needles in the haystack?\"\nHe is also the Business Development Advisor for Changelly, an instant cryptocurrency exchange service that lets you exchange one crypto to another in seconds and supports fiat money payment for any listed crypto. Changelly is an exchange without accounts that makes moving from one crypto to another fast and easy while customers maintain their privacy and control.\nCharlie's penchant for projects that aim to give freedom back to users by solving a problem that exists in services people use everyday aligns nicely with Particl 's vision: to foster a fully independent, decentralized economy and provide a sustainable environment of collaboration and innovation that empowers peers across different blockchain projects while respecting their rights to freedom and privacy.\nParticl is built on Bitcoin, not Ethereum as has become the norm in the crypto space this year. Adding to this battle-tested protocol at its foundation, Particl has layered privacy enhancements on the latest code (0.15.1) which no other project has yet done on Bitcoin; Confidential Transactions (CT) and Ring Confidential Transactions (RingCT). Particl created its own blockchain that allows intrinsic value to be layered onto their utility token (PART) through voting rights, governance control or passive income with proof-of-stake consensus. Currently, Particl is finishing a decentralized marketplace, Particl Marketplace, which will be a place to spend and earn PART but will not be exclusive to only Particl users.\n\"We are excited to get some input from an industry heavyweight,\" says Ryno Mathee, Particl Founder. \"Charlie's influence and experience will help us grow tremendously.\"\nAs a Strategic Advisor and Mentor to the Particl team, Charlie understands the project's set of core values which alongside privacy includes crypto-agnosticism. The marketplace is the next step towards Particl's vision of a decentralized economy and is slated for an alpha release in the first quarter of 2018. Not intended to be built exclusively for Particl users, Charlie will be instrumental in forging partnerships and opening opportunities so that most major cryptocurrencies, and possibly fiat, will be able to be spent on the Particl Marketplace.\nAbout Particl\nParticl's team is growing, currently made up of 16 full-time paid contributors and 20 total; and is self-sustaining through the Particl Foundation, a nonprofit organization in Zug. Particl's privacy token and upcoming marketplace are the cornerstones being placed for an independent decentralized economy. With the latest Bitcoin codebase as its foundation, Particl has brought privacy to the blockchain with CT and RingCT for the first time. Particl has an active community that will expand as other crypto communities learn a place exists where they can use their coins to buy products.\nVisit the Particl Website: https://www.particl.io\nView the Source Code: https://github.com/particl/particl-core\nView the Whitepaper: https://github.com/particl/whitepaper/blob/master/decentralized-private-marketplace-draft-0.1.pdf\nConnect on Social Media:", "external_links": ["https://github.com/particl/whitepaper/blob/master/decentralized-private-marketplace-draft-0.1.pdf", "https://github.com/particl/particl-core", "https://www.particl.io/"], "published": "2018-01-27T04:24:00.000+02:00", "crawled": "2018-01-27T03:53:57.000+02:00", "highlightTitle": ""}