{"organizations": [], "uuid": "99bd0bef6e65acd1ccb30c832185ce4c848ab90f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/18/104661419-GettyImages-633191646.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/03/why-steve-bannons-treason-comments-wont-destroy-trump-commentary.html", "country": "US", "domain_rank": 767, "title": "Why Steve Bannon’s treason comments won’t destroy Trump—Commentary", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-03T22:27:00.000+02:00", "replies_count": 0, "uuid": "99bd0bef6e65acd1ccb30c832185ce4c848ab90f"}, "author": "Jake Novak", "url": "https://www.cnbc.com/2018/01/03/why-steve-bannons-treason-comments-wont-destroy-trump-commentary.html", "ord_in_thread": 0, "title": "Why Steve Bannon’s treason comments won’t destroy Trump—Commentary", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "steve bannon", "sentiment": "negative"}, {"name": "donald jr.", "sentiment": "none"}, {"name": "bannon", "sentiment": "none"}, {"name": "michael wolf", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "alabama", "sentiment": "none"}, {"name": "trump tower", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "gop", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Getty Images White House Chief Strategist Steve Bannon (R) listens to U.S. President Donald Trump. \nThe old saying \"Politics makes strange bedfellows\" has an equally true and pithy corollary: \"Politics makes enemies out of the best of friends.\" \nWe're already seeing a lot of both in excerpts from Michael Wolf's upcoming book about the 2016 Trump campaign that were published today in New York magazine. \nThe most explosive segment is a series of quotes by former White House senior adviser Steve Bannon, who said the June 2016 Trump Tower meeting between the president's eldest son Donald Jr. and a Russian lawyer was \"treasonous\" and \"unpatriotic.\" \nBannon is also quoted as saying there was \"zero\" chance that then-candidate Trump did not meet with the attendees at a later date or time. \nThe White House has responded with a statement from President Trump saying that \"(Bannon) not only lost his job\" but also \"lost his mind\" when he left the White House. The statement goes on to say Bannon had little to do with Trump's election victory, blames him for the GOP loss in the Alabama special U.S. Senate election last month, and claims that Bannon is \"only in it for himself.\" \nThis is all coming from the same president who told the public as recently as October that he had a \"very good relationship\" with Bannon and, \"I like him.\" \"Making things worse from Bannon's perspective is the fact that the Trump administration is enjoying what seems to be its highest relative level of success since his departure.\" \nOkay, we all get how this kind of feud makes sense. Once Bannon was let go from his job at the White House, the chances were always high that he would turn against the members of the Trump family who always opposed him and eventually the president himself. \nEven a mild mannered person without the kind of coarse personal history Bannon owns is likely to lash out after essentially getting fired. But this is a public firing on steroids involving an outspoken media figure who basically wants to be known as a political revolutionary. We're talking about the man who says he wants to \"smash the state\" after all. \nMaking things worse from Bannon's perspective is the fact that the Trump administration is enjoying what seems to be its highest relative level of success since his departure. President Trump's poll numbers are up. The tax reform bill was passed, (with the help of the establishment Republicans in Congress Bannon detests so much). The economy looks very strong and the stock market keeps making new highs. \nBut there's a bigger issue here. Are Bannon's quotes really harmful as special counsel Robert Mueller's probe continues? Could his comments about treason and insinuating that President Trump himself was in on the meetings with Russian's trying to hurt candidate Clinton lead to impeachment? \nOr could Bannon's claims that China is like Nazi Germany in 1930 cause real lasting damage to the administration? \nNot really. \nFirst, let's look at the Russia probe. As well as Bannon may know President Trump and how he acted during the campaign, his guess about who met whom and did what with Colonel Mustard in the library with the candlestick is still just a guess. Now, if Bannon suddenly appears before the Mueller grand jury, then this is a big story. Otherwise, it's just mudslinging. \nBy contrast, those still in the Trump camp and/or allied with him are responding differently. Investor Tom Barrack, who served as the chairman of President Trump's inaugural committee, is strongly denying the quotes attributed to him the Wolf book that have him calling President Trump \"crazy\" and \"stupid.\" \nBannon has also long been painted as an especially dangerous and evil bogeyman by the Democrats and the left. They've regularly accused him of being a white supremacist just for starters. But in the \"politics makes strange bedfellows\" column, get ready for a large number of Bannon's most vocal critics on the left rushing to defend his comments and treat them like the Gospel. \nSecond, let's look at the damning statements about China and others. \nFor any other president, maybe they would create a serious problem. But in essence this is simply the very public break up between two firebrands who briefly tried to work together in politics. It's another internal drama in a series of dramas emanating from this White House on what seems like a daily basis. \nThat's the key point. Haven't we all noticed that every \"scandal\" or explosive story connected to this president eventually flames out and is replaced by another? \nJust minutes before this Bannon story, the D.C. punditry was beside itself parsing and responding excitedly to President Trump's \"bigger button\" North Korea tweets. \nIt's always something. \nUnless Bannon somehow turns around his clumsy beginning as a midterm election kingmaker, his most likely future role is as yet another Trump critic who gets airtime once in a while. \nBannon's quotes and the president's response to them are today's outrage. \nIt's not that these outrages don't leave permanent wounds. President Trump's approval rating is at 39 percent now, and that's a six month high. And he will be uniquely hated by his opponents in a way no other president has been since Nixon. \nBut that doesn't seem to slow him down. So, stay tuned for the next outrage to hit the screen. And the next... \nCommentary by Jake Novak, CNBC.com senior columnist. Follow him on Twitter @jakejakeny . \nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": [], "published": "2018-01-03T22:27:00.000+02:00", "crawled": "2018-01-03T22:53:02.015+02:00", "highlightTitle": ""}