{"organizations": [], "uuid": "47b5f5084f3937ec58b1e1efd2a2d78aae7a4b77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/21/104724430-GettyImages-845820824-kim-jong-un.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/08/north-korea-its-kim-jong-uns-birthday--here-are-some-of-his-most-memorable-quotes.html", "country": "US", "domain_rank": 767, "title": "North Korea: It's Kim Jong Un's birthday — Here are some of his most memorable quotes", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.289, "site_type": "news", "published": "2018-01-08T15:45:00.000+02:00", "replies_count": 0, "uuid": "47b5f5084f3937ec58b1e1efd2a2d78aae7a4b77"}, "author": "Sam Meredith", "url": "https://www.cnbc.com/2018/01/08/north-korea-its-kim-jong-uns-birthday--here-are-some-of-his-most-memorable-quotes.html", "ord_in_thread": 0, "title": "North Korea: It's Kim Jong Un's birthday — Here are some of his most memorable quotes", "locations": [], "entities": {"persons": [{"name": "kim jong un", "sentiment": "negative"}, {"name": "kim jong", "sentiment": "none"}, {"name": "kim jong-un", "sentiment": "none"}], "locations": [{"name": "north korea", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "pyongyang", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "kcna", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North Korea's Kim Jong Un was widely believed to be celebrating his birthday on Monday, a day before Pyongyang is set to hold talks with its southern neighbor for the first time in more than two years.\nThe leader is thought to have turned 35, although the North Korean state does not publicly recognize his birthday and there is no mention of the date on the regime calendar.\nWhile Kim Jong Un has ignored recent peace overtures with Seoul, officials from both countries are expected to initiate a formal dialogue on Tuesday. Ahead of the talks, CNBC takes a look at some of the most memorable Quote: s from Kim Jong Un over the past 12 months.\nNorth Korea has 'achieved' nuclear status In his 2017 New Year's address, North Korea's leader claimed the country had \"achieved the status\" of a nuclear power, before adding economic rivals would no longer dare to provoke a \"military giant in the East.\"\nIn response to Kim Jong Un's claim his country had the capacity to launch intercontinental ballistic missiles that could reach the U.S., President Donald Trump tweeted: \"It won't happen.\"\n'Up to you whether the US exists on this planet' In a state-produced video released last March, images showed a computer-animated nuclear attack on Washington. Subtitles to the video warned that the U.S. would be punished if it continued to provoke Pyongyang, before adding: \"The United States must choose! It's up to you whether the nation called the United States exists on this planet or not.\"\nKIM WON-JIN | AFP | Getty Images North Korean soldiers attend a mass rally to celebrate the North's declaration on November 29 it had achieved full nuclear statehood, on Kim Il-Sung Square in Pyongyang on December 1, 2017. The United Nations (UN) had imposed sanctions on North Korea earlier that month, after the country tested a nuclear device and a long-range rocket.\n'Bereft of reason' In August, amid escalating tensions between North Korea and the U.S. regarding Pyongyang's nuclear missile tests, North Korea's military warned \"only absolute force can work\" when communicating with the U.S. leader.\n\"Sound dialogue is not possible with such a guy bereft of reason,\" Kim Jong Un said in a statement published on Korea's state run news agency.\n'Mentally deranged US dotard' Trump issued a harsh warning at the UN General Assembly to nuclear-armed North Korea in September. In his first address, Trump threated to \" totally destroy \" Pyongyang if the U.S. was prompted to defend itself or its allies.\nKena Betancur | AFP | Getty Images President Donald Trump. \"Whatever Trump might have expected, he will face results beyond his expectation. I will surely and definitely tame the mentally deranged U.S. dotard with fire,\" Kim Jong Un said in a statement circulated on state news agency KCNA.\nTranslated from Korean to English, the word \"dotard\" generally means an imbecile.\n'Nuclear button on my desk' In his 2018 New Year's address, Kim Jong Un said: \"The U.S. should know that the button for nuclear weapons is on my desk. This is not blackmail but reality.\"\nTrump responded to taunt the North Korean leader about the size of his nuclear arsenal, saying on Twitter that the nuclear button in Washington was \"much bigger and more powerful\" then Pyongyang's.\nTweet 1", "external_links": [], "published": "2018-01-08T15:45:00.000+02:00", "crawled": "2018-01-08T15:46:08.019+02:00", "highlightTitle": ""}