{"organizations": [], "uuid": "9116d5361496573cd3d1410cd2ab85d23272fa14", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/31/dr-brenda-fitzgerald-head-of-the-centers-for-disease-control-and-prevention-resigns.html", "country": "US", "domain_rank": 767, "title": "Dr. Brenda Fitzgerald, head of the Centers for Disease Control and Prevention, resigns", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.475, "site_type": "news", "published": "2018-01-31T16:45:00.000+02:00", "replies_count": 0, "uuid": "9116d5361496573cd3d1410cd2ab85d23272fa14"}, "author": "", "url": "https://www.cnbc.com/2018/01/31/dr-brenda-fitzgerald-head-of-the-centers-for-disease-control-and-prevention-resigns.html", "ord_in_thread": 0, "title": "Dr. Brenda Fitzgerald, head of the Centers for Disease Control and Prevention, resigns", "locations": [], "entities": {"persons": [{"name": "brenda fitzgerald", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "centers for disease control and prevention", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The head of the federal Centers for Disease Control and Prevention resigned Wednesday on the heels of a bombshell report that she had purchased stock in a tobacco company soon after taking her job, which oversees smoking-cessation programs.\nDr. Brenda Fitzgerald, who is an ob-gyn, also had owned stock in other tobacco companies prior to assuming her post almost six months ago as one of the nation's top health officials.\nA lengthy delay in Fitzgerald's divestment of her stock holdings, which included shares in health-care companies, was cited by the Trump administration Wednesday morning as the reason for her resignation.\nNews of her tobacco holdings was broken by Politico in a story Tuesday night , shortly before President Donald Trump , who nominated Fitzgerald for her job, gave his State of the Union address. Politico noted in a story two weeks ago that Fitzgerald had repeatedly been unable to testify before Congress because of financial conflicts that were still unresolved.\nFitzgerald's then-boss, Health and Human Services Secretary Tom Price, resigned last September after Politico reported that Price had repeatedly used expensive private charter flights for official travel rather than traveling by commercial airlines.\nTwitter \nIn its story Tuesday night, Politico reported that Fitzgerald, the former commissioner of Georgia's Public Health Department, bought $1,001 to $15,000 worth of shares in Japan Tobacco after taking the CDC post in early July.\nShe also made similar purchases of shares in drug companies Merck & Co. and Bayer , as well as of big health insurer Humana , according to the article.\nPolitico noted that just a day after buying shares in Japan Tobacco, Fitzgerald toured the CDC's tobacco laboratory, \"which researches how the chemicals in tobacco harm human health.\"\nA CDC web page on smoking and tobacco use notes that smoking is the leading cause of preventable death in the nation. It says smoking \"harms nearly every organ of the body\" and costs the U.S. billions of dollars of year in health costs.\nFitzgerald sold her shares of tobacco stock on Oct. 26, and all of her stock holdings worth more than $1,000 by Nov. 21, according to the article.\nFitzgerald also cited tobacco cessation as a top priority while serving in her Georgia post. Politico said that prior to accepting the CDC position, Fitzgerald \"owned stock in five other tobacco companies: Reynolds American , British American Tobacco , Imperial Brands , Philip Morris International, and Altria Group Inc. — all legal under Georgia's ethics rules.\" \nThe article quoted Matthew Myers, president of the Campaign for Tobacco-Free Kids, who said Fitzgerald's conduct was \"stunning.\"\n\"It sends two messages, both of which are deeply disturbing,\" Myers said.\n\"First, it undermines the credibility of a public official when they argue that tobacco is the No. 1 preventable cause of disease. Second, and perhaps even worse, it indicates a public official is willing to put their personal profit above the ethics of investing in a company whose products cause so much harm.\"\nIn a statement, a Department of Health and Human Services spokesman said new HHS chief Alex Azar accepted her resignation.\n\"Dr. Fitzgerald owns certain complex financial interests that have imposed a broad recusal limiting her ability to complete all of her duties as the CDC Director,\" the spokesman said.\n\"Due to the nature of these financial interests, Dr. Fitzgerald could not divest from them in a definitive time period. After advising Secretary Azar of both the status of the financial interests and the scope of her recusal, Dr. Fitzgerald tendered, and the Secretary accepted, her resignation. The Secretary thanks Dr. Brenda Fitzgerald for her service and wishes her the best in all her endeavors.\"\nDr. Anne Schucat, who had been CDC's principal deputy director, was named acting director of the agency after Fitzgerald resigned.", "external_links": [], "published": "2018-01-31T16:45:00.000+02:00", "crawled": "2018-01-31T16:46:23.006+02:00", "highlightTitle": ""}