{"organizations": [], "uuid": "06fd58993e80f757ddb1f08e5c56d32f82f07c31", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-812545184.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/25/nyc-congestion-fees/", "country": "US", "domain_rank": 1196, "title": "Commentary: NYC Congestion Fees Will Help Poorest | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.129, "site_type": "news", "published": "2018-01-25T02:00:00.000+02:00", "replies_count": 0, "uuid": "06fd58993e80f757ddb1f08e5c56d32f82f07c31"}, "author": "Roderick M. Hills", "url": "http://fortune.com/2018/01/25/nyc-congestion-fees/", "ord_in_thread": 0, "title": "Commentary: NYC Congestion Fees Will Help Poorest | Fortune", "locations": [], "entities": {"persons": [{"name": "charles komanoff", "sentiment": "none"}, {"name": "roderick m. hills", "sentiment": "none"}, {"name": "andrew cuomo", "sentiment": "none"}, {"name": "loic", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}, {"name": "times square", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "congestion pricing Commentary: Here’s Who Will Benefit Most From NYC's Congestion Fees A police officer controls the traffic in Times Square, downtown Manhattan, on July 1, 2017 in New York City. LOIC VENANCE AFP/Getty Images By Roderick M. Hills and Charles Komanoff January 25, 2018 \nHelp is in sight for New York City’s beleaguered commuters. A state task force, “Fix NYC,” last week proposed a menu of options to fulfill Gov. Andrew Cuomo’s promise to implement “congestion fees”—tolls on autos and trucks entering New York City’s central business district, with surcharges on yellow cabs and Ubers that circulate in and near midtown. \nThe tolls would raise a billion dollars a year to modernize the city’s broken subways, according to Fix NYC, and their disincentives to drive would raise downtown traffic speeds by 9%—a figure that could eventually double as the subway investments bear fruit and attract more commuters from cars, cabs, and Ubers. \nOpponents say that congestion fees are regressive, since they impose a uniform toll on rich and poor alike. But the evidence shows that the poorest New Yorkers would benefit the most from a congestion fee—and pay the smallest share—while wealthier New Yorkers would pay a larger share. \nAn analysis last fall by the pre-eminent organization representing low-income New Yorkers, the Community Service Society, showed that, of an estimated 118,000 outer-borough residents who drive each day to jobs in the central business district, only 5,000 are working poor. The vast majority of working-class commuters traveling into Manhattan use mass transit—buses and subways. CSS’s analysis accordingly found that only 2% of the city’s working poor would regularly pay the congestion fee. \nSecond, the lion’s share of the congestion revenues will be invested in improved transit. This will be a particular boon to poor and working New Yorkers, whom subway delays burden disproportionately with lost wages, missed work opportunities, and even fines from being late to court dates. \n\nThird, the cost of traffic congestion is highest for those lower-income workers who do drive into the city. The lawyer or banker stuck in gridlock while riding in a taxi or Uber vehicle can at least make phone calls, read documents, or stage their commute a bit earlier to avoid the peak-hour toll. In contrast, the “man with van”—the tradesman who makes multiple stops over the course of the working day—pays the largest traffic tax, and thus has the most to gain from congestion pricing. A plumber or electrician who charges just $75 an hour (cheap for Manhattan) will recover his daily toll charge if he can spend an additional 20 minutes on the job earning money rather than be stuck in traffic—as predicted under the most conservative assumptions on tolling’s effect on vehicle flow. By improving traffic flow, the congestion fee will actually save low-income workers money. \nLast, traffic imposes the harshest delays on commuters who travel by bus. According to a 2017 report by New York City Comptroller Scott Stringer, buses in New York City are the slowest among the biggest bus companies in the nation, averaging a glacial stop-and-go pace of 7.4 mph—5.5 mph in Manhattan. The poorest New Yorkers often stumble home hours after they’ve stepped onto a bus. By speeding up the buses by at least 9%, the congestion fee will save these commuters time without costing them money. \nThere is, in short, nothing “free” about roads without tolls. Unless your time is worthless, you pay a steep tax for every extra minute you’re stuck in gridlock. If fairness is your goal, a transparent congestion fee easily beats the hidden traffic tax that harms all commuters, especially the poorest. \nRoderick Hills is the William T. Comfort III Professor of Law at NYU Law School. Charles Komanoff is a policy analyst based in New York City. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-25T02:00:00.000+02:00", "crawled": "2018-01-26T08:15:09.001+02:00", "highlightTitle": ""}