{"organizations": [], "uuid": "1f1fe745a7b12b346ce8d42724e815227f2e768c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225564651&w=1200&r=LYNXMPEE0P15Z", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-canada-death-apotex/canadian-pharmaceutical-billionaires-were-murdered-police-say-idUSKBN1FF2G2", "country": "US", "domain_rank": 408, "title": "Canadian pharmaceutical billionaires were murdered: police", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T20:50:00.000+02:00", "replies_count": 0, "uuid": "1f1fe745a7b12b346ce8d42724e815227f2e768c"}, "author": "", "url": "https://www.reuters.com/article/us-canada-death-apotex/canadian-pharmaceutical-billionaires-were-murdered-police-say-idUSKBN1FF2G2", "ord_in_thread": 0, "title": "Canadian pharmaceutical billionaires were murdered: police", "locations": [], "entities": {"persons": [{"name": "barry", "sentiment": "none"}, {"name": "sherman", "sentiment": "none"}, {"name": "susan gomes", "sentiment": "none"}], "locations": [{"name": "toronto", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 6:23 PM / in 10 minutes Canadian pharmaceutical billionaire couple was murdered: police Reuters Staff 3 Min Read \nTORONTO (Reuters) - Canadian pharmaceutical billionaire couple Barry and Honey Sherman were murdered in a targeted killing, Toronto police investigators said on Friday in their first detailed comments on the case since the couple’s bodies were found on Dec. 15. \nPolice said they are treating the case as a double murder, but declined to say if they had any suspects. \nThe Shermans were found hanging by belts from a railing next to a swimming pool at their Toronto mansion, police said. \nToronto homicide detective Susan Gomes said at a press conference that authorities believed the Shermans were targeted, but did not elaborate. \nPolice have “an extensive list of people we’re looking forward to speaking to,” she said. \nThe Sherman family said in a statement that it had expected police would classify the deaths as homicides. \nThe family hired a private investigator in late December and conducted an independent autopsy after complaining that police mishandled the case in its early days. FILE PHOTO: Honey and Barry Sherman, Chairman and CEO of Apotex Inc., are shown at the annual United Jewish Appeal (UJA) fundraiser in Toronto, Ontario, Canada, August 24, 2010. The Globe and Mail/Janice Pinto via REUTERS \nCiting unnamed police sources, multiple news organizations had reported last month that investigators were operating on the working theory that the deaths were a murder-suicide. \nGomes said those reports were wrong and that investigators initially reviewed three possibilities: double suicide, murder suicide and double homicide. \nSherman was 75 and his wife was 70. Their deaths stunned the worlds of Canadian business, politics and philanthropy, and drew public condolences from prominent figures including Canadian Prime Minister Justin Trudeau, who attended a memorial service on Dec. 21 that was broadcast on television. Slideshow (2 Images) \nBarry Sherman founded Apotex Inc in 1974 and built it into a pharmaceutical giant before stepping down as chief executive in 2012. He and his wife were known for their donations to hospitals, universities and Jewish organizations. \nSeparately, Apotex said on Friday that its Chief Executive Jeremy Desai had resigned and would be replaced by his predecessor and company co-founder Jack Kay. \nApotex is in a legal dispute with Teva Pharmaceuticals Industries, the world’s biggest maker of generic drugs, over allegations that a former Teva executive shared trade secrets with Desai. \nAn Apotex representative said Desai’s departure was not related to Teva’s lawsuit against Apotex. \nReuters could not immediately reach Desai for comment. Reporting by Anna Mehler Paperny, Matt Scuffham and Amran Abocar; Editing by Jim Finkle, Bernadette Baum and Daniel Wallis", "external_links": [], "published": "2018-01-26T20:50:00.000+02:00", "crawled": "2018-01-26T21:04:41.039+02:00", "highlightTitle": ""}