{"organizations": [], "uuid": "42bb27be4dea0ce573bc83b2be558400f817bcab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/04/104928626-AP_18004619469635.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/why-cheering-on-the-stock-market-is-risky-for-trump.html", "country": "US", "domain_rank": 767, "title": "Why cheering on the stock market is risky for Trump", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.224, "site_type": "news", "published": "2018-01-04T21:07:00.000+02:00", "replies_count": 0, "uuid": "42bb27be4dea0ce573bc83b2be558400f817bcab"}, "author": "Jeff Cox", "url": "https://www.cnbc.com/2018/01/04/why-cheering-on-the-stock-market-is-risky-for-trump.html", "ord_in_thread": 0, "title": "Why cheering on the stock market is risky for Trump", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "chuck grassley", "sentiment": "none"}, {"name": "thom tillis", "sentiment": "none"}, {"name": "andrew harnik", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "kirstjen nielsen", "sentiment": "none"}], "locations": [{"name": "r-iowa", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "homeland security", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "As the Dow Jones industrial average crosses 25,000, the popular stock market gauge gives President Donald Trump yet another opportunity to crow about growth since his election in November 2016.\nHowever, he may end up regretting his decision to latch onto such a fickle indicator.\nMarkets go up and markets go down, and using stocks as a barometer for broader economic performance has proven through history to be a dicey endeavor. One person's bull market is another's bust just waiting to happen, and it was, after all, less than a year and a half ago that Trump was dismissing the rise in equity values as \"all a big bubble.\"\n\"At any given moment, you can wake up tomorrow and a 15 percent correction wouldn't be shocking at all,\" said Michael Yoshikami, CEO and founder of Destination Wealth Management. \"What would cause the stock market to be worth 15 percent less than it is today? It's going to be some blip headline or geopolitical issue.\"\nTrump has yet to deal with a significant market pullback as his first full year in office nears a close. The Dow is up nearly 40 percent since around the time of Trump's election victory.\n\nWall Street will be watching the president's ubiquitous social media presence to see how he handles a retreat once it comes.\n\"When the stock market rises, it's great to take credit,\" Yoshikami said. \"But will someone take credit if the market goes down? There probably would be not credit but more blame.\"\nIndeed, should the market go down, Trump is likely to just shift the narrative and ignore what's happening on Wall Street, according to administration officials familiar with his thinking.\nHow that plays with the public is another story.\nHis base has come to be accustomed to the president using the Dow – a narrow market barometer of 30 stocks that nonetheless is the most headline-friendly indicator of corporate health – as a proxy for his administration's progress.\nBut it doesn't have to be that way. Virtually every other significant economic indicator, from job growth to consumer and business sentiment to manufacturing activity and a host of other metrics, are all substantially higher than when he took office.\nYet Trump continues to cling to the market, as he did again Thursday when the Dow passed the 25K mark.\n(Tweet) \n\"You assume a bear market happens under his watch,\" based on the basic probability that the nearly 9-year-old bull retreats at some point, said Peter Boockvar, chief investment officer at Bleakley Financial Group. \"He should be cheering about the economy instead of talking about the Dow. A lot of times, the stock market does something different than the economy.\"\nOne of the most obvious examples happened a little over 30 years ago – the infamous Black Monday in Oct. 19, 1987 when the Dow lost 22 percent in a single day.\nThe huge drop was not indicative of the broader economy, which continued to hum along at that point and was strong enough to keep market performance that year positive.\n\"The stock market is a very fickle animal, as we know. It has a mind of its own,\" Boockvar said. \"It can do whatever it wants to do, and it may not be on board with that [Trump] thinks it should do. He's better off talking about tax policy and hopes for faster growth, and to stop talking about the Dow.\"\nTrump individually has never been a big market fan.\nHe made his fortune in real estate, diversified other business interests and by licensing his own name, and has said on multiple occasions that any forays he took into stocks had been more for amusement than as a way to accumulate wealth.\nHis ambivalence about the market reached a crescendo in August 2016, when he told FOX Business News that the market was \"all a big bubble.\" \nFew, including the president, would argue that the market today from a valuation standpoint is in bubble territory. But it's not cheap, either, and for the rally to keep going investors are going to have to be willing to keep paying up for stocks.\nOne of the factors that kept investors in the game in 2017, during which the market rose about 20 percent, was the hope for tax reform. Now that the bill has been passed, the next measure is going to be whether stocks can justify trading at 18 times earnings.\n\"The risk is that you no longer have the hope that drove the market last year,\" said Lindsey Bell, investment strategist at CFRA. \"Now we have tax reform and we have to see if it is actually going to be able to support this high level of market valuation. There is no more hope – now it's going to have to be reality.\"\nThere are a few other reasons Trump may want to shift focus from the market.\nThe president has a fiercely competitive spirit, and he has to know that stocks flourished under his predecessor, Barack Obama , while the economy struggled to grow 2 percent. And as equity prices soared under Obama, so did income inequality.\nWealth disparity in the U.S. is now higher than any other country in the developed world, according to Deutsche Bank. A record 30 percent of U.S. families have no net wealth outside of their homes, while median net worth overall is just 66 percent the level prior to the financial crisis, Deutsche said.\nThen there's the great equalizer when it comes to economic growth: the Fed. The U.S. central bank in recent months has warned about inflated market values. Should stocks continue to run wild, there's a very real threat that the Fed could turn out the lights on Trump's market party.\n\"That's my biggest fear,\" said Joe LaVorgna, chief economist for the Americas at Natixis. \"My concern is the Fed will sound a possibly more hawkish alarm. All of a sudden the markets have to price in a less accommodative or hawkish Fed, and that causes an inevitable equity pullback.\"\nFor now, though, LaVorgna thinks Trump should take as many victory laps as he can.\n\"If you're enacting pro-business policies, it's fair for the president to get credit,\" he said. \"He's going to get blame when things go bad, so he might as well take credit when things are good.\"\n-- With reporting by Eamon Javers \nWATCH: Should Trump get credit for fueling the rally with tax cuts? show chapters Should Trump get credit for fueling the rally with tax cuts?      51 Mins Ago | 05:09", "external_links": [], "published": "2018-01-04T21:07:00.000+02:00", "crawled": "2018-01-04T21:06:59.000+02:00", "highlightTitle": ""}