{"organizations": [], "uuid": "faf6a9294287a2f7ef2b5b079df2d6358075a974", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/01/25/104240230-GettyImages-632478696.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/11/earnings-season-is-upon-us-and-traders-have-high-expectations.html", "country": "US", "domain_rank": 767, "title": "Earnings season is upon us, and traders have high expectations", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.15, "site_type": "news", "published": "2018-01-11T14:01:00.000+02:00", "replies_count": 0, "uuid": "faf6a9294287a2f7ef2b5b079df2d6358075a974"}, "author": "Bob Pisani", "url": "https://www.cnbc.com/2018/01/11/earnings-season-is-upon-us-and-traders-have-high-expectations.html", "ord_in_thread": 0, "title": "Earnings season is upon us, and traders have high expectations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "thomson reuters", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Financial earnings season begins Friday with several big banks reporting. \nHere's what to expect: \n1. This will be one of the best quarters in a long time. We are in one of the best macro environment in years, with the fastest pace of economic activity in 13 years, according to Goldman Sachs. Earnings for the S&P 500 are expected to grow 11.8 percent in the fourth quarter, according to Thomson Reuters. The numbers will likely be 3 to 5 percentage points higher by the time most companies report. \nIf that happens, it may beat the 15 percent earnings growth we saw in the first quarter of 2017, which was the strongest growth we have seen in many years. \n2. Earnings growth is occurring across the board. Earnings will grow in all 11 sectors of the S&P 500. \n3. Topline growth has returned. Unlike quarters in 2011, 2012, 2013 or 2014, these gains are not mostly due to cost cutting: It is top-line growth, expected to be up at least 7 percent, that is driving the earnings expansion. \nAll 11 sectors will see earnings growth, and all will see revenue growth. \n\"We haven't seen this kind of move in six years,\" FactSet earnings tracker John Butters told me. \n4. One of the great fears last year — that margins would begin to erode due to higher costs or lower prices — does not appear to be materializing. Margins are expected to remain near 10 percent. \nThe immediate risk to the rally is guidance disappointment. At the moment, the broader risk to stocks is not from a recession or from a risk the Fed may hike rates quicker, but from guidance and the impact of tax reform. Many companies will announce that they are taking one-time charges due to deferred taxes and may be reluctant to give the broad positive guidance the trading community is expecting. \nOne thing Butters is not expecting is a change in tone: \"Companies have generally been positive on tax reform throughout 2017, and overall I expect them to remain positive,\" he told me. \nIndeed, the rally has continued into 2018 partly on expectations of higher earnings continuing into 2018. Just look at how analysts have been taking up their earnings estimates for financials and energy for the first quarter \nFinancials: Q1 2018 estimates", "external_links": [], "published": "2018-01-11T14:01:00.000+02:00", "crawled": "2018-01-11T14:11:53.021+02:00", "highlightTitle": ""}