{"organizations": [], "uuid": "16dd5926072bf261906bd0f692a91d72c367b343", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-chs-reports-180-point-1-million-first-quarter-earnings-for-fiscal-2018.html", "country": "US", "domain_rank": 767, "title": "CHS reports $180.1 million first quarter earnings for fiscal 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.703, "site_type": "news", "published": "2018-01-10T23:36:00.000+02:00", "replies_count": 0, "uuid": "16dd5926072bf261906bd0f692a91d72c367b343"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-chs-reports-180-point-1-million-first-quarter-earnings-for-fiscal-2018.html", "ord_in_thread": 0, "title": "CHS reports $180.1 million first quarter earnings for fiscal 2018", "locations": [], "entities": {"persons": [{"name": "jay debertin", "sentiment": "none"}], "locations": [{"name": "minn.", "sentiment": "none"}], "organizations": [{"name": "st. paul", "sentiment": "negative"}, {"name": "chs inc.", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ST. PAUL, Minn., Jan. 10, 2018 /PRNewswire/ -- CHS Inc. (NASDAQ: CHSCP, CHSCO, CHSCN, CHSCM, CHSCL), the nation's leading farmer-owned cooperative and a global energy, grains and foods company, today reported net income of $180.1 million for the first quarter of its 2018 fiscal year (three-month period ended Nov. 30, 2017), compared to net income of $209.2 million for the same period a year ago.\nConsolidated revenues for the first quarter of fiscal 2018 were $8.0 billion, the same as fiscal 2017. Pretax income was $199.6 million and $225.6 million for the first quarter of fiscal 2018 and 2017, respectively.\n\"Despite challenging market conditions, CHS experienced a solid first quarter thanks to our continued focus on three key priorities: strengthening relationships, sharpening operational excellence and restoring financial flexibility,\" said CHS President and Chief Executive Officer Jay Debertin. \"In the first quarter, we recorded solid earnings from our businesses and reduced long-term debt. These actions are helping to strengthen and grow CHS.\"\nFor the first quarter of fiscal 2018, reporting segment results were:\nEnergy\nEnergy generated pretax income of $113.1 million during the first quarter, compared to $70.0 million during the same period last year. The $43.1 million increase was primarily driven by improved margins within refined fuels.\nAg\nThe Ag segment, which includes domestic and global grain marketing and crop nutrients businesses, renewable fuels, local retail operations, and processing and food ingredients, generated pretax income of $74.5 million for the three months ended Nov. 30, 2017, compared to $109.2 million for the same period the previous fiscal year. The $34.7 million decrease was primarily the result of lower margins in grain marketing, processing and food ingredients and renewable fuels. Lower volumes in grain marketing and processing and food ingredients also contributed to the decrease. The decrease was partially offset by an increase in earnings in the crop nutrients and country operations businesses.\nNitrogen Production\nThis segment is comprised of the company's investment in CF Industries Nitrogen, LLC (CF Nitrogen), and generated pretax income of $5.7 million during the first quarter of fiscal 2018, compared to $27.0 million during the same time in fiscal 2017. The decrease in earnings was primarily due to a gain of $29.1 million from an embedded derivative associated with CF Nitrogen that was recognized in fiscal 2017. There was no comparable gain in the current fiscal year. This decrease was partially offset by higher urea and urea ammonium nitrate prices.\nFood\nThis segment is comprised of the company's investment in Ventura Foods, LLC (Ventura Foods), and generated pretax income of $1.0 million in the first quarter of fiscal 2018, compared to $10.6 million during the same period of fiscal 2017. The decrease in earnings was due to lower margins at Ventura Foods.\nCorporate and Other\nThis category is primarily comprised of the company's wheat milling joint venture and its financing, hedging and insurance operations, and generated pretax income of $5.3 million in the first quarter of 2018, compared to $8.7 for the same period of fiscal 2017. The decrease in earnings was due to lower earnings from the wheat milling joint venture and less interest revenue due to amending a receivables securitization agreement in late FY17, pursuant to which we no longer receive interest income from those receivables.\nCHS Inc. ( www.chsinc.com ) is a leading global agribusiness owned by farmers, ranchers and cooperatives across the United States. Diversified in energy, grains and foods, CHS is committed to helping its customers, farmer-owners and other stakeholders grow their businesses through its domestic and global operations. CHS supplies energy, crop nutrients, grain marketing services, animal feed, food and food ingredients, along with insurance, financial and risk management services. The company operates petroleum refineries/pipelines and manufactures, markets and distributes Cenex® brand refined fuels, lubricants, propane and renewable energy products.\nThis document and other CHS Inc. publicly available documents contain, and CHS officers and representatives may from time to time make, \"forward–looking statements\" within the meaning of the safe harbor provisions of the U.S. Private Securities Litigation Report Act of 1995. Forward–looking statements can be identified by words such as \"anticipate,\" \"intend,\" \"plan,\" \"goal,\" \"seek,\" \"believe,\" \"project,\" \"estimate,\" \"expect,\" \"strategy,\" \"future,\" \"likely,\" \"may,\" \"should,\" \"will\" and similar references to future periods. Forward–looking statements are neither historical facts nor assurances of future performance. Instead, they are based only on CHS current beliefs, expectations and assumptions regarding the future of its businesses, future plans and strategies, projections, anticipated events and trends, the economy and other future conditions. Because forward–looking statements relate to the future, they are subject to inherent uncertainties, risks and changes in circumstances that are difficult to predict and many of which are outside of CHS control. CHS actual results and financial condition may differ materially from those indicated in the forward–looking statements. Therefore, you should not rely on any of these forward–looking statements. Important factors that could cause CHS actual results and financial condition to differ materially from those indicated in the forward–looking statements are discussed or identified in CHS public filings made with the U.S. Securities and Exchange Commission, including in the \"Risk Factors\" discussion in Item 1A of CHS Annual Report on Form 10–K for the fiscal year ended August 31, 2017. Any forward–looking statements made by CHS in this document are based only on information currently available to CHS and speak only as of the date on which the statement is made. CHS undertakes no obligation to publicly update any forward–looking statement, whether written or oral, that may be made from time to time, whether as a result of new information, future developments or otherwise.\nCHS Inc. Earnings\nmillions $\nFor the Three Months Ended\nNov. 30,\n2018\n(fiscal year)\n2017\n(fiscal year)\nEnergy\n$113.1\n$70.0\nAg\n74.5\n109.2\nNitrogen Production\nFoods\nCorporate and Other\n5.7\n1.0\n5.3\n27.0\n10.6\n8.8\nIncome before income taxes\n199.6\n225.6\nIncome taxes\n(19.9)\n(16.6)\nNet income\n179.7\n209.0\nNet income attributable to non-controlling interests\n0.4\n0.2\nNet income attributable to CHS Inc.\n$180.1\n$209.2\nView original content: http://www.prnewswire.com/news-releases/chs-reports-1801-million-first-quarter-earnings-for-fiscal-2018-300581033.html\nSOURCE CHS Inc.", "external_links": ["http://www.prnewswire.com/news-releases/chs-reports-1801-million-first-quarter-earnings-for-fiscal-2018-300581033.html", "http://www.chsinc.com/"], "published": "2018-01-10T23:36:00.000+02:00", "crawled": "2018-01-10T23:21:54.000+02:00", "highlightTitle": ""}