{"organizations": [], "uuid": "b56a0dd55f5fab8633f3aeae685a733ad00f4ce0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-pricesmart-announces-election-of-new-board-member-voting-results-from-2018-annual-meeting-of-stockholders-and-a-semi-annual.html", "country": "US", "domain_rank": 767, "title": "PriceSmart Announces Election of New Board Member, Voting Results from 2018 Annual Meeting of Stockholders, and a Semi-Annual Dividend", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T16:00:00.000+02:00", "replies_count": 0, "uuid": "b56a0dd55f5fab8633f3aeae685a733ad00f4ce0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-pricesmart-announces-election-of-new-board-member-voting-results-from-2018-annual-meeting-of-stockholders-and-a-semi-annual.html", "ord_in_thread": 0, "title": "PriceSmart Announces Election of New Board Member, Voting Results from 2018 Annual Meeting of Stockholders, and a Semi-Annual Dividend", "locations": [], "entities": {"persons": [{"name": "infante", "sentiment": "none"}, {"name": "beatriz infante", "sentiment": "none"}], "locations": [{"name": "san diego", "sentiment": "none"}, {"name": "san diego", "sentiment": "none"}], "organizations": [{"name": "pricesmart, inc.", "sentiment": "neutral"}, {"name": "pricesmart announces election of new board", "sentiment": "neutral"}, {"name": "princeton university", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "advisory committee", "sentiment": "none"}, {"name": "california institute of technology", "sentiment": "none"}, {"name": "liquidity services inc.", "sentiment": "none"}, {"name": "company's board of directors", "sentiment": "none"}, {"name": "princeton university school of engineering", "sentiment": "none"}, {"name": "businessexcelleration llc", "sentiment": "none"}, {"name": "ribbon communications", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO, PriceSmart, Inc. (NASDAQ: PSMT) today announced the election of a new board member, Beatriz Infante, to the Company's Board of Directors at the Company's 2018 annual meeting of stockholders held on January 24 in San Diego.\nBeatriz Infante is Chief Executive Officer of BusinessExcelleration LLC, a business consultancy specializing in corporate transformation and renewal, and an advisor and investor in a number of early stage technology companies. She is currently a member of the board of directors of Liquidity Services Inc., an online marketplace for retail and capital assets, and a director of Ribbon Communications, a market leader in cloud communications. In addition, she serves on the Advisory Committee to the Princeton University School of Engineering and Applied Science. Ms. Infante holds a bachelor of science and engineering degree in electrical engineering and computer science from Princeton University and holds a master of science degree in engineering science from California Institute of Technology.\nAt yesterday's annual meeting of stockholders, 11 nominees were elected to the PriceSmart board. Each director elected will continue to hold office until the next annual meeting of stockholders of PriceSmart, or until the director resigns or a successor is elected or appointed. The following directors were elected yesterday: Sherry S. Bahrambeygui, Gonzalo Barrutieta, Gordon Hanson, Beatriz Infante, Leon Janks, Jose Luis Laparte, Mitchell Lynn, Gary Malino, Pierre Mignault, Robert Price and Edgar Zurcher.\nStockholders also approved, on an advisory basis, the compensation of the Company's executive officers for fiscal year 2017 and ratified the selection of Ernst & Young LLP as the Company's independent registered public accounting firm for the fiscal year ending August 31, 2018. Stockholders also approved, on an advisory basis, holding an advisory vote on executive compensation every year. A final report on voting results will be filed with U.S. Securities and Exchange Commission within four business days following the date of the annual meeting of stockholders.\nOn January 24, 2018, the Company's Board of Directors declared a cash dividend in the total amount of $0.70 per share, with $0.35 per share payable on February 28, 2018 to stockholders of record as of close of business on February 14, 2018 and $0.35 per share payable on August 31, 2018 to stockholders of record as of the close of business on August 15, 2018. The Company anticipates the ongoing payment of semi-annual dividends in subsequent periods, although the actual declaration of future dividends, the amount of such dividends, and the establishment of record and payment dates is subject to final determination by the Board of Directors in its discretion, after its review of the Company's financial performance and anticipated capital requirements.\nAbout PriceSmart\nPriceSmart, headquartered in San Diego, owns and operates U.S.-style membership shopping warehouse clubs in Latin America and the Caribbean, selling high quality merchandise at low prices to PriceSmart members. PriceSmart now operates 40 warehouse clubs in 12 countries and one U.S. territory (seven each in Colombia and Costa Rica; five in Panama; four in Trinidad; three each in Guatemala, the Dominican Republic and Honduras; two each in El Salvador and Nicaragua; and one each in Aruba, Barbados, Jamaica and the United States Virgin Islands).\nThis press release may contain forward-looking statements concerning the Company's anticipated future revenues and earnings, adequacy of future cash flow, proposed warehouse club openings, the Company's performance relative to competitors, the outcome of tax proceedings and related matters. These forward-looking statements include, but are not limited to, statements containing the words \"expect,\" \"believe,\" \"will,\" \"may,\" \"should,\" \"project,\" \"estimate,\" \"anticipated,\" \"scheduled,\" and like expressions, and the negative thereof. These statements are subject to risks and uncertainties that could cause actual results to differ materially, including the following risks: our financial performance is dependent on international operations, which exposes us to various risks; any failure by us to manage our widely dispersed operations could adversely affect our business; we face significant competition; future sales growth depends, in part, on our ability to successfully open new warehouse clubs and grow sales in our existing locations; we might not identify in a timely manner or effectively respond to changes in consumer preferences for merchandise, which could adversely affect our relationship with members, demand for our products and market share; although we offer limited online shopping to our members in certain markets, our sales could be adversely affected if one or more major international online retailers were to enter our markets or if other competitors were to offer a superior online experience; failure to grow our e-commerce business through the integration of physical and digital retail or otherwise, and the cost of our increasing e-commerce investments, may materially adversely affect our market position, net sales and financial performance; our profitability is vulnerable to cost increases; we face difficulties in the shipment of, and risks inherent in the importation of, merchandise to our warehouse clubs; we are exposed to weather and other natural disaster risks that might not be adequately compensated by insurance; negative economic conditions could adversely impact our business in various respects; our failure to maintain our brand and reputation could adversely affect our results of operations; we face the risk of exposure to product liability claims, a product recall and adverse publicity; we are subject to risks associated with possible changes in our relationships with third parties with which we do business, as well as the performance of such third parties; we could be subject to additional tax liabilities or subject to reserves on the recoverability of tax receivables; we face the possibility of operational interruptions related to union work stoppages; we are subject to volatility in foreign currency exchange rates and limits on our ability to convert foreign currencies into U.S. dollars; we face compliance risks related to our international operations; we rely extensively on computer systems to process transactions, summarize results and manage our business. Failure to adequately maintain our systems and disruptions in our systems could harm our business and adversely affect our results of operations; we may experience difficulties implementing our new global enterprise resource planning system; any failure by us to maintain the security of the information that we hold relating to our company, members, employees and vendors, whether as a result of cybersecurity attacks on our information systems, failure of internal controls, employee negligence or malfeasance or otherwise, could damage our reputation with members, employees, vendors and others, could disrupt our operations, could cause us to incur substantial additional costs and to become subject to litigation and could materially adversely affect our operating results; we are subject to payment related risks; failure to attract and retain qualified employees, increases in wage and benefit costs, changes in laws and other labor issues could materially adversely affect our financial performance; changes in accounting standards and assumptions, projections, estimates and judgments by management related to complex accounting matters could significantly affect our financial condition and results of operations; a few of our stockholders own approximately 25.3% of our voting stock as of November 30, 2017, which may make it difficult to complete some corporate transactions without their support and may impede a change in control. The risks described above as well as the other risks detailed in the Company's U.S. Securities and Exchange Commission (\"SEC\") reports, including the Company's Annual Report on Form 10- K filed for the fiscal year ended August 31, 2017 filed on October 26, 2017 pursuant to the Securities Exchange Act of 1934. We assume no obligation and expressly disclaim any duty to update any forward- looking statement to reflect events or circumstances after the date of this presentation or to reflect the occurrence of unanticipated events.\nFor further information, please contact John M. Heffner, Principal Financial Officer and Principal Accounting Officer (858) 404-8826.\nView original content with multimedia: http://www.prnewswire.com/news-releases/pricesmart-announces-election-of-new-board-member-voting-results-from-2018-annual-meeting-of-stockholders-and-a-semi-annual-dividend-300587978.html\nSOURCE PriceSmart, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/pricesmart-announces-election-of-new-board-member-voting-results-from-2018-annual-meeting-of-stockholders-and-a-semi-annual-dividend-300587978.html"], "published": "2018-01-25T16:00:00.000+02:00", "crawled": "2018-01-25T17:37:09.011+02:00", "highlightTitle": ""}