{"organizations": [], "uuid": "9bf00e14d555ba6ee0d862e92d9e583ccc4a771b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/18/104905685-GettyImages-894967696.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/how-trump-can-crush-the-emerging-markets-stock-rally-in-2018.html", "country": "US", "domain_rank": 767, "title": "How Trump can crush the emerging markets stock rally in 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.298, "site_type": "news", "published": "2018-01-22T15:14:00.000+02:00", "replies_count": 0, "uuid": "9bf00e14d555ba6ee0d862e92d9e583ccc4a771b"}, "author": "Tim Mullaney", "url": "https://www.cnbc.com/2018/01/22/how-trump-can-crush-the-emerging-markets-stock-rally-in-2018.html", "ord_in_thread": 0, "title": "How Trump can crush the emerging markets stock rally in 2018", "locations": [], "entities": {"persons": [{"name": "michael wolff", "sentiment": "none"}, {"name": "jim lo scalzo", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "kim jong un", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "ronald reagan building", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "latin america", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "none"}, {"name": "nafta", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "How Trump can crush the emerging markets stock rally in 2018 The MSCI Emerging Market Index rose 37 percent last year, beating the S&P 500. Valuations are still low, and earnings are improving for many emerging market stocks. Experts worry that moves by President Donald Trump, such as igniting a trade war with China or key NAFTA partners, could derail the bull run in emerging market stocks. SHARES Jim Lo Scalzo | Bloomberg | Getty Images President Donald Trump pauses while speaking during a national security strategy speech at the Ronald Reagan Building in Washington, D.C., U.S., on Monday, Dec. 18, 2017. \nIf you wanted to crush President Donald Trump last year, there was a way even more efficient than giving indiscreet interviews to Michael Wolff: betting on emerging markets in Latin America and Asia, where the returns made Dow 25,000 look as tiny as Kim Jong Un's button. \nBut can emerging markets keep pushing higher in 2018? Still relatively cheap stocks, as well as structural reforms in a long list of nations, suggest they can, experts say. Unless, that is, Trump delivers on campaign promises to restrict global trade, or at least tries to hold it up while the rules of the game are rewritten to favor the United States. \nHe has threatened to scrap the 2011 U.S. free trade deal with South Korea, prompting Seoul to begin preparations for new talks , and said just last week that terminating the North American Free Trade Agreement would yield \"the best deal .\" A more isolationist America could ignite a trade war with China and cause ripple effects in global trade and the world's economy. That could hurt emerging markets. \nSo, too, could any geopolitical flare-ups, such as a Trump nuclear war showdown with North Korea. Already this year the war of words between the president and Kim Jung Un has captured headlines. \nThe MSCI Emerging Markets Index rose 37 percent last year, handily beating the 19.4 percent climb in the Standard & Poor's 500. That index tracks 846 companies in 24 countries, representing about 85 percent of the market capitalization of the markets it follows. The biggest names are familiar to U.S. investors: Chinese internet companies Tencent Holdings and Alibaba Group, Korea's Samsung Electronics and Taiwan Semiconductor Manufacturing. show chapters 2:51 PM ET Wed, 27 Dec 2017 | 01:22 \nThat may be the beginning of a longer move. Valuations are still low, partly because last year's jump came after the MSCI EM Index lost ground in three of the prior four years and four of the prior six. Earnings are improving, and the P/E ratio of the index is just 12.5 times this year's projected earnings, according to Yardeni Research. \n\"The reason to be confident is that there isn't a single engine\" for sustained emerging-markets gains, said Kate Moore, chief equity strategist at BlackRock. \"There are multiple engines.'' Rebounds in key markets \nThe simplest reason for the EM resurgence over the last 12 months is that a lot of markets, including China, Chile and Brazil, were rebounding from corrections or bear markets — in both stock prices and earnings. Even India had a big dip earlier in the decade. \nWracked by worries about China and by low commodity prices, emerging markets corporate earnings fell by about 7 percent a year since 2011, BlackRock research reveals. Important companies were hurt by the falling price of oil and other commodities, as well as by the Chinese growth slowdown and excessive expansion of productive capacity, Moore said in an interview. \nMore from Global Investing Hot Spots: How to get good returns on global stocks \nNow the earnings recession has ended and profits have room to rise further, said Chuck Knudsen, emerging markets equity portfolio specialist for T. Rowe Price Associates in Baltimore. \n\"Profit margins in emerging markets still remain below the average over the past 20 years vs. the U.S., where margins are near all-time highs,\" Knudsen said. \"Income per capita is rising, the middle class is growing, and consumption is becoming a more significant component of EM economies,\" such as China, he said. \nMost of 2017's strong returns can be traced to earnings, Knudsen said, with a smaller amount (about 6 percent to 7 percent) due to local currencies gaining value against the dollar. Fundamental analysis \nEmerging markets stocks are cheap after the earnings gains, BlackRock's Moore argued, trading at only 12.3 times 2018 earnings estimates. That's up from 11.6 last year and 26 percent cheaper than U.S. shares, she said. (Using a different measure, Yardeni says U.S. stocks trade at 18.5 times this year's projected earnings, putting the emerging markets discount near 50 percent.) \nEmerging markets stocks are usually cheaper than in more stable developed markets, but earnings growth in emerging markets means the spread hasn't narrowed materially during the last year, Knudsen said. \nValuations are low on a price-to-book ratio, too, Merrill Lynch strategist Ajay Kumar said. Stocks are trading below two times book value, well below the three times book level that historically ends emerging market rallies, he said. In a November interview he said profits in Asia, excluding Japan, would rise about 20 percent in 2018. Looking at the entire emerging markets universe, including Latin America, T. Rowe Price estimates profits will grow 25 percent to 30 percent, Knudsen said. \nThe moves are being driven partly by the broad global expansion and partly by structural reforms in many emerging markets, BlackRock's Moore said. \nAmong the most important have been moves by China's government to limit overinvestment in export industries, such as steel, while shifting money to consumer-facing businesses, she added. \n\"That has paid enormous dividends for China,\" she said. Future prospects \nEven after the surge in emerging markets, investors haven't plowed cash in numbers pointing to any overdone euphoria, Knudsen says. \n\"Investors are still underweight EM,\" he said. \"The EM economies represent close to 50 percent of the global economy and more than 50 percent of global growth since the global financial crisis, but they are about 12 percent to 13 percent of global indexes and less than that in the average global fund.\" \nFor investors who want to be in emerging markets but don't have the time to learn individual companies on the other side of the world, there are more than 100 exchange-traded stock funds in either a few emerging markets or a broad array of them, according to ETF Database. \nThe biggest is the $69 billion Vanguard FTSE Emerging Markets ETF, followed by BlackRock's iShares Core MSCIEmerging Markets ETF and iShares MSCI Emerging Markets ETF , each with $40 billion to $45 billion under management. From there it's a long way down to the next biggest funds, which manage about $5 billion each. So far in 2018, the top three have each gained about 5 percent to 5.5 percent in value, beating the 4.1 percent gain of the SPDR S&P 500 ETF . \nThe main risk, for now, seems to come from the White House, in the form of lingering uncertainty over whether President Trump will seek to renegotiate trade deals in a way that curtails growth, Moore said. That's especially true because technology companies that drive the MSCI EM Index, like Samsung, are themselves driven by global trade, she said. \n\"Even if it doesn't have a major impact in the near term, it would have a very large impact on sentiment,'' she said. Tim Mullaney Special to CNBC.com Related Securities", "external_links": [], "published": "2018-01-22T15:14:00.000+02:00", "crawled": "2018-01-22T15:54:21.009+02:00", "highlightTitle": ""}