{"organizations": [], "uuid": "63f46f8fac8822efd1767bd976c5f0cb10dc6619", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-new-fda-mr-conditional-labeling-approvals-further-expand-abbotts-portfolio-of-mri-ready-devices.html", "country": "US", "domain_rank": 767, "title": "New FDA MR-Conditional Labeling Approvals Further Expand Abbott's Portfolio of MRI-Ready Devices", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.533, "site_type": "news", "published": "2018-01-03T17:00:00.000+02:00", "replies_count": 0, "uuid": "63f46f8fac8822efd1767bd976c5f0cb10dc6619"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-new-fda-mr-conditional-labeling-approvals-further-expand-abbotts-portfolio-of-mri-ready-devices.html", "ord_in_thread": 0, "title": "New FDA MR-Conditional Labeling Approvals Further Expand Abbott's Portfolio of MRI-Ready Devices", "locations": [], "entities": {"persons": [{"name": "dru", "sentiment": "negative"}, {"name": "abbott", "sentiment": "negative"}], "locations": [{"name": "abbott park", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "ill.", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "fda", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ABBOTT PARK, Ill., Jan. 3, 2018 /PRNewswire/ -- Abbott (NYSE: ABT) today announced U.S. Food and Drug Administration (FDA) approval for magnetic resonance (MR)-conditional labeling for the Quadra Assura MP™ Cardiac Resynchronization Therapy Defibrillator (CRT-D) and Fortify Assura™ Implantable Cardioverter Defibrillator (ICD), two of the company's most widely-used high voltage medical devices. The approvals follow recent MR-conditional labeling approvals for the Assurity MRI™ pacemaker, Ellipse™ ICD and associated MRI-compatible leads, and further expand Abbott's portfolio of MRI-ready devices for patients indicated for ICDs and/or CRT-D devices who may need an MRI in the future.\nPhysicians utilize ICDs to restore normal heart rhythms in patients at risk for experiencing potentially life-threatening heart rhythms; they implant CRT-D devices to help the lower chambers of the heart beat in rhythm in patients battling progressive congestive heart failure and improve blood flow throughout the body. For some patients, the potential need for a future MRI has made MR-conditional labeling important as physicians assess therapies and device options. As a result, Abbott has done extensive testing to demonstrate that these devices are safe in the most commonly-used MRI scanners.\n\"For many patients who need an ICD or CRT-D device, receiving a device that is MRI-ready is a key benefit that can ensure future access to MRIs -- an important and commonly-used diagnostic tool,\" said Avi Fischer, M.D., divisional vice president, medical affairs, and medical director of Abbott's cardiac rhythm management business. \"We are excited to expand our portfolio and add MR-conditional labeling to the Fortify Assura ICD and Quadra Assura MP CRT-D to provide patients and their physicians additional peace of mind if those patients need an MRI in the future.\"\nIn addition to MRI compatibility, Abbott's Fortify Assura ICD and Quadra Assura MP CRT-D also include the company's suite of TailoredTherapy™ features, which are designed to provide physicians additional flexibility and control in how they deliver therapy to treat their patient's cardiac arrhythmias and congestive heart failure, even as their patient's therapy needs change over time. With the TailoredTherapy feature set, the Fortify Assura ICD and Quadra Assura MP CRT-D help protect against the delivery of unnecessary therapy and continuously evaluate the condition of a lead to consistently deliver appropriate therapy. Combined with MRI compatibility, these features offer physicians additional options to leverage when managing patient care.\nThe Quadra Assura MP CRT-D also offers Abbott's proprietary MultiPoint™ Pacing and SyncAV™ technology to provide additional options for CRT patients who are not responsive to traditional cardiac resynchronization therapy. With MultiPoint Pacing, Abbott allows physicians to \"individualize\" cardiac resynchronization therapy and shift their patient's treatment options from a single point of pacing to multiple options to better deliver therapy where needed. Abbott's SynvAV software allows a CRT device to detect real-time changes in a patient's cardiac condition and adjust therapy accordingly.\nAs with all Abbott cardiac rhythm management devices, all therapy data captured by the Fortify Assura and Quadra Assura MP devices can be directly, securely and wirelessly sent to a patient's doctor through the Merlin.net™ Patient Care Network. This communication allows physicians to remotely monitor their patient's therapy and assess any need for intervention.\nFor more information about Abbott's focus on cardiac rhythm management, visit www.sjm.com/en/patients/arrhythmias .\nAbout Abbott:\nAt Abbott, we're committed to helping people live their best possible life through the power of health. For more than 125 years, we've brought new products and technologies to the world -- in nutrition, diagnostics, medical devices and branded generic pharmaceuticals -- that create more possibilities for more people at all stages of life. Today, 94,000 of us are working to help people live not just longer, but better, in the more than 150 countries we serve.\nConnect with us at www.abbott.com , on Facebook at www.facebook.com/Abbott and on Twitter @AbbottNews and @AbbottGlobal.\nView original content with multimedia: http://www.prnewswire.com/news-releases/new-fda-mr-conditional-labeling-approvals-further-expand-abbotts-portfolio-of-mri-ready-devices-300576148.html\nSOURCE Abbott", "external_links": ["http://www.sjm.com/en/patients/arrhythmias", "http://www.abbott.com/", "http://www.prnewswire.com/news-releases/new-fda-mr-conditional-labeling-approvals-further-expand-abbotts-portfolio-of-mri-ready-devices-300576148.html", "http://www.facebook.com/Abbott"], "published": "2018-01-03T17:00:00.000+02:00", "crawled": "2018-01-03T16:31:07.004+02:00", "highlightTitle": ""}