{"organizations": [], "uuid": "caa2e168e7c22affb4e3eb4b52f9e3c552f5d3f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/06/28/104555975-GettyImages-159128937.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/sap-full-year-2017-earnings.html", "country": "US", "domain_rank": 767, "title": "SAP full year 2017 earnings", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.691, "site_type": "news", "published": "2018-01-30T10:17:00.000+02:00", "replies_count": 0, "uuid": "caa2e168e7c22affb4e3eb4b52f9e3c552f5d3f4"}, "author": "Thomas Lohnes", "url": "https://www.cnbc.com/2018/01/30/sap-full-year-2017-earnings.html", "ord_in_thread": 0, "title": "SAP full year 2017 earnings", "locations": [], "entities": {"persons": [{"name": "bill mcdermott", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "sap", "sentiment": "negative"}, {"name": "thomson reuters", "sentiment": "none"}, {"name": "reuters thomas lohnes | getty images  sap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAP posted 2017 results on the lower side of market expectations after Chief Executive Bill McDermott had promised a \"dynamite\" final quarter in its cloud business, as Europe's top\ntechnology company announced a $2.4 billion U.S. acquisition.\nFourth-quarter non-IFRS operating profit rose by 6 percent in constant currency terms to 2.37 billion euros ($2.93 billion), compared to average analyst expectations of 2.41 billion euros, according to a poll of 16 analysts by Thomson Reuters.\nBut executives of the German software giant said the company had turned the corner during the quarter and expected to begin to see sustained margin improvements during 2018.\n\"I'm happy to tell you that new cloud bookings surged 31 percent in Q4,\" CEO Bill McDermott told journalists on a conference call, adding that SAP was gaining market share against rivals purely focused on cloud-based software.\nshow chapters Expect more consolidation in cloud industry, says SAP CEO 2:39 AM ET Thu, 19 Oct 2017 | 04:10 \"This paves the way for the strong growth and margin expansion we expect in 2018 and beyond,\" Chief Financial Officer Luka Mucic said in a company statement.\nThe $140 billion business software company, which accounts for a quarter of the Stoxx Europe 600 Technology Index, has invested heavily in cloud services and hopes to see a payoff in the form of improving margins from this year on.\nSAP said it expected total non-IFRS revenue of 24.6 to 25.1 billion euros ($30.43-$31.05 billion) for 2018, in line with the forecasts of analysts polled by Thomson Reuters.\nBut the outlook also highlighted that it expects margins to increase faster in 2018. Revenue is set to grow around 5 to 7 percent, excluding currency translation effects, it said, while operating profit is poised to grow by 8 to 11 percent.\nIt forecast 2018 non-IFRS operating profit of 7.3 to 7.5 billion euros, adding that the implementation of IFRS 15, a new accounting rule on revenue recognition, would add 200 million euros to profits.\nLooking ahead to 2020, the final year of a five-year strategic transition to wean customers off software installed at offices and factories, SAP reiterated a forecast for non-IFRS operating profit of 8.5 to 9.0 billion euros and revenues of 28 to 29 billion.\nCloud Moves In the fourth quarter, cloud subscriptions and support revenues rose by 28 percent to 997 million euros, compared to market expectations of a 22 percent increase.\nRevenues from SAP's mainstay software licences and support operations rose 2 percent to 4.81 billion euros. Analysts had on average expected a decline of 1.1 percent.\nshow chapters All growth in cloud is organic unlike rivals: SAP CEO 2:40 AM ET Thu, 19 Oct 2017 | 03:33 SAP said it would buy cloud-based, sales management software company Callidus Software Inc for a modest premium to its $2.23 billion market capitalisation on Nasdaq on Monday, ahead of the deal's announcement.\nThis was the first sizable acquisition in 3-1/2 years, McDermott said, adding that SAP did not plan further major mergers and acquisitions but would continue to count for most of its growth from organically generated business.\n\"We are in no way looking to be in the M&A business at scale,\" McDermott said. \"This is a tuck-in.\"", "external_links": [], "published": "2018-01-30T10:17:00.000+02:00", "crawled": "2018-01-30T10:16:58.002+02:00", "highlightTitle": ""}