{"organizations": [], "uuid": "2ee22f0ec9fe5277883c023f32650b49140450bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-document-security-systems-inc-names-it-executive-vincent-lum-president-of-dss-asia.html", "country": "US", "domain_rank": 767, "title": "Document Security Systems, Inc. Names IT Executive Vincent Lum President of DSS Asia", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.079, "site_type": "news", "published": "2018-01-08T16:00:00.000+02:00", "replies_count": 0, "uuid": "2ee22f0ec9fe5277883c023f32650b49140450bf"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-document-security-systems-inc-names-it-executive-vincent-lum-president-of-dss-asia.html", "ord_in_thread": 0, "title": "Document Security Systems, Inc. Names IT Executive Vincent Lum President of DSS Asia", "locations": [], "entities": {"persons": [{"name": "vincent lum", "sentiment": "negative"}, {"name": "lum", "sentiment": "none"}], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "asia rochester", "sentiment": "none"}, {"name": "asia pacific", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "document security systems, inc", "sentiment": "neutral"}, {"name": "dss", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ROCHESTER, N.Y., Jan. 08, 2018 (GLOBE NEWSWIRE) -- Document Security Systems, Inc. (NYSE American:DSS), a leader in anti-counterfeit, authentication, and diversion protection technologies whose products and solutions are used by governments, corporations and financial institutions to defeat fraud and to help ensure the authenticity of both digital and physical financial instruments, identification documents, sensitive publications, brand packaging and websites, announced today that Mr. Vincent Lum has been named President of DSS Asia.\nMr. Lum will be responsible for strategic DSS business expansion in the Asia Pacific market. Mr. Lum will lead the Asia Pacific operation including management of customer support, implementation, product marketing, and product development in the region. As part of the DSS expansion to Asia, Mr. Lum will also oversee regional growth in the DSS infrastructure to service product opportunities in the market.\n“We see very strong demand for our products in the Asia Pacific market. The region is plagued by counterfeit products which are more than just a nuisance, in fact, they are a significant public health threat,” said Jeff Ronaldi, CEO of DSS. “Adding Vincent is a major step forward in our expansion plans. He has extensive experience in bringing technology products to the Asia Pacific market, in combination with strong product development knowledge. Under his leadership, we are building a very robust Asia Pacific presence.”\n“Counterfeiting is a serious and growing problem in the Asia Pacific marketplaces. I am very much looking forward to establishing a DSS presence, with its proven technology and years of brand protection experience, in this region,” stated Mr. Lum. “The Asia operation will not only be a sales and marketing operation, but also a technology and development extension of U.S. headquarters, where we will be actively building resources to enhance our digital product offerings.”\nMr. Lum has extensive experience in the IT industry, the consumer electronics market, and with product development and strategic marketing spanning the past 25 years. Prior to joining DSS, Mr. Lum was CEO of HotApp International, an integrated community and e-commerce platform based on mobile applications. From 2009-2014 Lum was founder and CEO of FUNboxx, Ltd., a software developer in internet security for kids, and from 2006-2007 he was CEO of Vitop, Ltd. In Hong Kong where he managed all business aspects for their Wellness and Healthcare division. Mr. Lum was the Head of Consumer Products and the Asia Pacific Marketing Director for YORK International (now Johnson Controls) from 2003-2006. From 1999-2004 Mr. Lum held executive positions of Regional VP, Korea and Japan; Director of Marketing; and CEO, iCommerce for publicly-listed Datacraft Asia. While at Datacraft Asia, Lum grew the Korean business to over $80 million and developed the China Digital Network Business into a $100 million unit in four years. Mr. Lum was Marketing Director, Asia Pacific, Global Consumer Line of Business Director and a Member of Global Executive Team with Apple from 1995-1998. Mr. Lum received his BSc in Electronics Engineering from the University of Essex in 1985.\nABOUT DOCUMENT SECURITY SYSTEMS, INC.\nFor over 15 years, Document Security Systems, Inc. (“DSS”) has protected corporations, financial institutions, and governments from sophisticated and costly fraud. DSS’ innovative anti-counterfeit, authentication, and brand protection solutions are deployed to prevent attacks which threaten products, digital presence, financial instruments, and identification. AuthentiGuard®, the company's flagship product, provides authentication capability through a smartphone application so businesses can empower a wide range of employees, supply chain personnel, and consumers to track their brands and verify authenticity. For more information visit dsssecure.com .\nKeep up-to-date on DSS events and developments by joining our online communities at Facebook , Twitter LinkedIn and our DSS Investor Update List .\nFORWARD-LOOKING STATEMENTS\nForward-looking statements that may be contained in this press release, including, without limitation, statements related to the Company’s plans, strategies, objectives, expectations, potential value, intentions and adequacy of resources, are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act and contain words such as “believes,” “anticipates,” “expects,” “plans,” “intends” and similar words and phrases. These forward-looking statements are subject to risks and uncertainties that could cause actual results to differ materially from the results projected in any forward-looking statement. In addition to the factors specifically noted in the forward-looking statements, other important factors, risks and uncertainties that could result in those differences include, but are not limited to, our ability to continue the growth in sales of AuthentiGuard and manage our expenses, as well as those risks disclosed in the “Risk Factors” section of the Company’s Annual Report on Form 10-K for the year ended December 31, 2016, filed with the Securities and Exchange Commission on March 28, 2017. Forward-looking statements that may be contained in this press release are being made as of the date of its release, and the Company assumes no obligation to update the forward-looking statements, or to update the reasons why actual results could differ from those projected in the forward-looking statements.\nContact: Investor Relations Jody Janson Document Security Systems, Inc. Tel: (585) 232-5440 Email: ir@dsssecure.com\nSource:Document Security Systems Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=_j7yCtFA_feU4CDBTz3ZpmifDrfrgZpAD7I0lu-kRA8ehXBQ5mM1Kt0C3aLDfRtNboIJvVcPQxxkTYenn-jqVg==", "https://www.globenewswire.com/Tracker?data=eDHwVacW8DVX-wGi1WW-ycpU7DSdF9S7MJm2hpf455ZMwucBKPUM0-Ia1XJyXGJp7pmcBdrbgkFnjtZtBjUe4eQrzg1Z5kh_mjF49bgbdIAATTXdI31LXy7Qukz-Elbk", "https://www.globenewswire.com/Tracker?data=qppZ_oiD90XBMSi7o5f4tU0RqJlO2vOXdUITXYFtyEnAJ7dh8OQNe_K5v2tNHVIIFDAJ94zk0f3tWNTSI3ziTAxS1DZ2Xd6DnwdeLT03d7g=", "https://www.globenewswire.com/Tracker?data=pp42ORxVitpQnbKm80QXModzvsZT-takli05sqDfWFQXHLvX4O3O9ZK4xAAD3tid0FdYKaHkLaw7FGWYF3_TOQ==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/fe5d8cdb-5c23-4a26-b03b-cb8fea3151ab", "https://www.globenewswire.com/Tracker?data=yQDZXygOhq9uJMsXd4aqR0IXQ7pWwdLA7AiEISwuOFnxl50LaXjUdV9RutgDlaEKJcLMbGijIc0cjC4PKix5vA==", "https://www.globenewswire.com/Tracker?data=vKzphHW7DIWc-0kHJYW5i6Z7FTau2xKUdJa7QE4_JS_xqxUz_XAulnZcSHKvBXCWbKFiMu3e_Z2lUkgBuVrNEIkFYrzr0FGPhNBem-BfKUVZMJQXOpdGu2mMYLme_koW"], "published": "2018-01-08T16:00:00.000+02:00", "crawled": "2018-01-08T17:10:27.013+02:00", "highlightTitle": ""}