{"organizations": [], "uuid": "77e9c71333d45037dcd0f508de78d7d171ee9526", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-vmg-partners-promotes-robin-tsai-to-managing-director.html", "country": "US", "domain_rank": 767, "title": "VMG Partners Promotes Robin Tsai to Managing Director", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T16:10:00.000+02:00", "replies_count": 0, "uuid": "77e9c71333d45037dcd0f508de78d7d171ee9526"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-vmg-partners-promotes-robin-tsai-to-managing-director.html", "ord_in_thread": 0, "title": "VMG Partners Promotes Robin Tsai to Managing Director", "locations": [], "entities": {"persons": [{"name": "robin tsai", "sentiment": "negative"}, {"name": "kara cissell-roell", "sentiment": "none"}, {"name": "michael l. mauzé", "sentiment": "none"}, {"name": "robin", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "vmg partners", "sentiment": "negative"}, {"name": "vmg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO, Jan. 8, 2018 /PRNewswire/ -- VMG Partners , a private equity firm that specializes in investing in and building branded consumer product companies in the lower middle market, today announced the promotion of Robin Tsai to Managing Director.\nKara Cissell-Roell, Managing Director of VMG, said, \"Robin understands the power of brands and enjoys helping entrepreneurs build the emotional connection between their brands and consumers. We seek tangible results from our younger professionals and are pleased to recognize Robin's contributions over the past eight years as he has helped create value for our investors.\"\nMichael L. Mauzé, Managing Director of VMG, said, \"We look to build future leaders within the firm who will continue to strengthen and improve VMG in the years ahead. Robin embodies the values that are core to VMG's investment philosophy and he shares our passion for building exciting and long-lasting brands. Robin continues to help position VMG as the investor of choice among entrepreneurs who seek to grow their brands and has been particularly instrumental in building our presence in the beauty and wellness sectors. We look forward to working with him for many years.\"\nMr. Tsai joined VMG in 2009. Prior to that, he was a consultant at The Boston Consulting Group where he worked in several industries, including consumer products and retail, and across multiple practice areas including brand strategy, merger integration, and organizational design. He received a B.A. with honors in Economics and East Asian Studies from Stanford University and an MBA from Stanford University Graduate School of Business. He currently serves on the Boards of VMG portfolio companies Drunk Elephant, Spindrift Beverage Co Inc., and Vermont Smoke & Cure.\nAbout VMG Partners\nVMG Partners is focused solely on partnering with entrepreneurs and managers to support the growth and strategic development of branded consumer products companies in the lower middle market. Since its inception in 2005, VMG has provided financial resources and strategic guidance to drive growth and value creation in more than 20 companies. VMG's defined set of target investment categories includes food, beverage, personal care, pet products and wellness. Representative past and present partner companies include babyganics®, Daily Harvest, Drunk Elephant, Justin's, KIND Healthy Snacks, Natural Balance, Nature's Bakery, Perfect Bar, Pretzel Crisps®, Quest, Spindrift, Sun Bum, and Vega. VMG Partners is headquartered in San Francisco. For more information about the fund please visit www.vmgpartners.com .\nContact: Chris Tofalli\nChris Tofalli Public Relations, LLC\n914-834-4334\nView original content: http://www.prnewswire.com/news-releases/vmg-partners-promotes-robin-tsai-to-managing-director-300578580.html\nSOURCE VMG Partners", "external_links": ["http://www.vmgpartners.com/", "http://www.prnewswire.com/news-releases/vmg-partners-promotes-robin-tsai-to-managing-director-300578580.html"], "published": "2018-01-08T16:10:00.000+02:00", "crawled": "2018-01-08T19:39:43.011+02:00", "highlightTitle": ""}