{"organizations": [], "uuid": "1097bca29146434c233538f203b6f13a298625f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 50, "shares": 50, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1224974062&w=1200&r=LYNXMPEE0O00N", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-honduras-corruption/oas-body-accuses-honduras-congress-of-blocking-anti-graft-probe-idUKKBN1FE01L", "country": "US", "domain_rank": 408, "title": "OAS body accuses Honduras Congress of blocking anti-graft probe", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T02:27:00.000+02:00", "replies_count": 0, "uuid": "1097bca29146434c233538f203b6f13a298625f7"}, "author": "", "url": "https://uk.reuters.com/article/uk-honduras-corruption/oas-body-accuses-honduras-congress-of-blocking-anti-graft-probe-idUKKBN1FE01L", "ord_in_thread": 0, "title": "OAS body accuses Honduras Congress of blocking anti-graft probe", "locations": [], "entities": {"persons": [{"name": "juan orlando hernandez", "sentiment": "none"}, {"name": "gustavo palencia", "sentiment": "none"}, {"name": "juan jimenez", "sentiment": "none"}], "locations": [{"name": "honduras", "sentiment": "none"}], "organizations": [{"name": "oas", "sentiment": "negative"}, {"name": "honduras congress", "sentiment": "negative"}, {"name": "oas mission to support the fight against corruption and impunity", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "organization of american states", "sentiment": "none"}, {"name": "maccih", "sentiment": "none"}, {"name": "min read  tegucigalpa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 12:31 AM / Updated 11 minutes ago OAS body accuses Honduras Congress of blocking anti-graft probe Gustavo Palencia 3 Min Read \nTEGUCIGALPA (Reuters) - An anti-graft body backed by the Organization of American States (OAS) on Wednesday accused the Honduran congress of blocking its investigations into a corruption racket that allegedly involves lawmakers and high-level officials. \nThe OAS Mission to Support the Fight Against Corruption and Impunity in Honduras (MACCIH), unveiled by the Central American nation’s President Juan Orlando Hernandez in 2015, said that a recently passed law will prevent the prosecutor’s office from investigating and charging dozens of possible suspects involved in a graft scheme. \n“We don’t understand how it’s possible a law has been passed that seeks to maintain impunity and handicap the battle against corruption,” MACCIH’s Peruvian spokesman, Juan Jimenez, said at a news conference on Wednesday morning. \nHe added that the new legislation will affect “current and future” probes. \nThat argument gained steam in the afternoon, when a judge applied the law to acquit five Honduran lawmakers who had been accused of diverting public funds intended for social programs. \n“In the morning we brought this up, and it’s happened just like we said,” Jimenez wrote in a Twitter post after the five were released from custody. \nThe case will now move to a fiscal tribunal. Juan Jimenez, spokesman of the OAS Mission to Support the Fight Against Corruption and Impunity in Honduras (MACCIH), looks on during a news conference in Tegucigalpa, Honduras January 24, 2018. REUTERS/Jorge Cabrera \nHeide Fulton, the U.S. chargé d‘affaires in Honduras, also decried the measure. \n“This action is a monumental step backward in the fight against corruption. Congress must act now to right this dangerous wrong,” she wrote in a Twitter post. \nHonduras has been roiled by deadly protests following a disputed Nov. 26 election, which the centre-left opposition has accused Hernandez of stealing. The OAS comments reveal the many hurdles to overcome for the poor, graft-riddled country with one of the world’s highest murder rates. \nMACCIH has been involved in helping the Honduran prosecutor’s office investigate a 2011-2015 embezzlement scheme that diverted 1.3 billion lempiras (38.7 million pounds) destined for social funds, allegedly with the help of more than 60 lawmakers and high-ranking officials. \nJimenez said allies of the president in Congress are among the suspects, adding that the new law would paralyse investigations for three years while the government’s financial authorities trace the diverted funds. \nIn response, the Congress said in a statement that Jimenez’s comments were “malicious,” adding that the law sought to encourage transparency. \nThe president’s office did not immediately respond to MACCIH’s comments. Reporting by Gustavo Palencia; Writing by Gabriel Stargardter and Daina Beth Solomon; Editing by Lisa Shumaker and Cynthia Osterman", "external_links": [], "published": "2018-01-25T02:27:00.000+02:00", "crawled": "2018-01-25T02:49:11.048+02:00", "highlightTitle": ""}