{"organizations": [], "uuid": "604814b138cf11d4295f06ec51b866cb6fd2e729", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/15/business-wire-angus-chemical-company-names-dave-neuberger-as-chief-executive-officer.html", "country": "US", "domain_rank": 767, "title": "ANGUS Chemical Company Names Dave Neuberger as Chief Executive Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-16T01:00:00.000+02:00", "replies_count": 0, "uuid": "604814b138cf11d4295f06ec51b866cb6fd2e729"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/15/business-wire-angus-chemical-company-names-dave-neuberger-as-chief-executive-officer.html", "ord_in_thread": 0, "title": "ANGUS Chemical Company Names Dave Neuberger as Chief Executive Officer", "locations": [], "entities": {"persons": [{"name": "dave neuberger", "sentiment": "negative"}, {"name": "mark henning", "sentiment": "none"}, {"name": "neuberger", "sentiment": "none"}, {"name": "dave", "sentiment": "none"}, {"name": "robert kirby", "sentiment": "none"}], "locations": [{"name": "buffalo grove", "sentiment": "none"}, {"name": "ill.", "sentiment": "none"}], "organizations": [{"name": "angus chemical company", "sentiment": "negative"}, {"name": "angus", "sentiment": "none"}, {"name": "agriculture and nutrition specialties", "sentiment": "none"}, {"name": "ashland inc.", "sentiment": "none"}, {"name": "north american industrial specialties", "sentiment": "none"}, {"name": "ashland", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BUFFALO GROVE, Ill.--(BUSINESS WIRE)-- ANGUS Chemical Company (\"ANGUS\" or the “Company”), a leading global manufacturer and marketer of specialty and fine chemicals, today announced the appointment of Dave Neuberger as Chief Executive Officer (CEO), effective immediately. Mr. Neuberger succeeds Mark Henning, who will step down as CEO.\nMr. Neuberger is an industry veteran with 20 years of experience. He has held a variety of leadership roles with leading chemicals companies. He joins ANGUS after a decade with Ashland Inc., a global specialty chemicals company, where he most recently served as Group Vice President of the company’s Pharmaceutical, Agriculture and Nutrition Specialties business. In that role, Mr. Neuberger oversaw Ashland’s most profitable P&L, and he managed a pipeline of new product introductions. During his time at Ashland, Mr. Neuberger also led the company’s North American Industrial Specialties business, including all commercial, technical service and supply chain functions.\nRobert Kirby, Chairman of the ANGUS Board of Directors, said: “Dave’s track record of building, growing and managing specialty chemicals businesses makes him the ideal person to lead ANGUS into its next chapter. Dave has decades of diverse leadership experience across the chemicals industry, as well as a strong, results-driven approach that will immediately create value and position ANGUS for future growth opportunities. We appreciate Mark’s decades of service to ANGUS, and are particularly grateful for his stewardship of the Company during the carve-out from the Dow Chemical Company. We look forward to working with Dave as we continue to grow the business.”\nMr. Neuberger said: “It is a privilege to join a company of ANGUS’ caliber and work alongside the talented ANGUS management team. ANGUS has an impressive customer base across a variety of end markets, and I am excited to support the Company’s mission to empower customers through science and technology and help steer ANGUS into its next phase.”\nRajeev Amara, a Managing Director at Golden Gate Capital and ANGUS Board member, added, “We are pleased to welcome Dave to the ANGUS team. This is an exciting moment in the Company’s history: ANGUS is the only vertically-integrated global provider of many of the foundational chemicals used in the production of next-generation medicine, including biologics and cell therapy, and we are confident that Dave’s experience and expertise in those sectors will significantly accelerate the Company’s growth.”\nPrior to Ashland, Mr. Neuberger spent nearly a decade at W.R. Grace, where he most recently served as Manager of New Business Development at the company’s specialty chemicals and materials division. He earned a MBA in Finance from the University of Pennsylvania, where he was a Palmer Scholar, and a BS in Chemical Engineering from Johns Hopkins University.\nAbout ANGUS Chemical Company\nANGUS Chemical Company, a portfolio company of Golden Gate Capital, is a specialty and fine chemical company dedicated to the development of novel chemistries that help customers deliver enhanced product and process performance. ANGUS is committed to constantly improving products and services by mastering science and technology. The company innovates through its unique nitroalkane chemistry, which harbors the reactivity to create complex molecules for use in a wide variety of applications. The innate characteristics of this chemistry, backed by unmatched application expertise and five regional Customer Applications Centers, enable the formulation of multifunctional additives that improve performance, and reduce reaction steps and synthesis costs.\nFollow ANGUS on Facebook , Twitter , and LinkedIn .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180115005471/en/\nANGUS Chemical Company\nScott C. Johnson, 847-808-3769\nscjohnson@angus.com\nSource: ANGUS Chemical Company", "external_links": ["http://www.businesswire.com/news/home/20180115005471/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.facebook.com%2FANGUSChemCo&esheet=51743137&newsitemid=20180115005471&lan=en-US&anchor=Facebook&index=1&md5=6cfaa19e44cca8f4c8ee21fea20cecd3", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.linkedin.com%2Fcompany%2Fangus-chemical-company&esheet=51743137&newsitemid=20180115005471&lan=en-US&anchor=LinkedIn&index=3&md5=46ff2e01eba9b44d004593d090c75127", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2Fanguschemco&esheet=51743137&newsitemid=20180115005471&lan=en-US&anchor=Twitter&index=2&md5=21763d4841879ab454e02f0c76b5fc20"], "published": "2018-01-16T01:00:00.000+02:00", "crawled": "2018-01-16T03:07:49.008+02:00", "highlightTitle": ""}