{"organizations": [], "uuid": "6248a5eece00892d2c2a08ae9bd9c8e83ccdd56e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-nutrien-announces-sale-of-its-equity-position-in-israel-chemicals-ltd.html", "country": "US", "domain_rank": 767, "title": "Nutrien Announces Sale of its Equity Position in Israel Chemicals LTD.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T09:42:00.000+02:00", "replies_count": 0, "uuid": "6248a5eece00892d2c2a08ae9bd9c8e83ccdd56e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-nutrien-announces-sale-of-its-equity-position-in-israel-chemicals-ltd.html", "ord_in_thread": 0, "title": "Nutrien Announces Sale of its Equity Position in Israel Chemicals LTD.", "locations": [], "entities": {"persons": [{"name": "nutrien", "sentiment": "none"}], "locations": [{"name": "saskatoon", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}], "organizations": [{"name": "israel chemicals ltd", "sentiment": "negative"}, {"name": "nutrien ltd.", "sentiment": "negative"}, {"name": "tsx", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "potash corporation of saskatchewan inc.", "sentiment": "none"}, {"name": "israel chemicals ltd.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NYSE, TSX: NTR\nSASKATOON, Jan. 16, 2018 /PRNewswire/ - Nutrien Ltd. (\"Nutrien\") today announced that its wholly-owned subsidiary, Potash Corporation of Saskatchewan Inc., intends to sell 176,088,630 ordinary shares (the \"Shares\") of Israel Chemicals Ltd. (\"ICL\") – or 100% of Nutrien's total stake – in a private secondary offering, subject to customary closing conditions. The offering is expected to close on January 23, 2018 (Israel). Nutrien expects to receive approximately US$700 million of net proceeds from the sale of the Shares.\nThe offering of the Shares has not been, and will not be, registered under the U.S. Securities Act of 1933 or the securities laws of any other jurisdiction and may not be offered or sold in the United States absent registration or an applicable exemption from registration requirements. The Shares will be offered only to qualified institutional buyers under Rule 144A and to persons outside the United States under Regulation S.\nNo sales of Shares are intended to be made to any person that, after giving effect to the offering, results in such person or its affiliates becoming a beneficial owner of more than 5% of the outstanding ordinary shares of ICL. By participating in the offering, each purchaser of ordinary shares is deemed to represent and warrant to the selling shareholder that, immediately after giving effect to the offering, neither it nor any of its affiliates (acting alone or as a part of any group (within the meaning of Section 13(d) of the Exchange Act) will (1) become a beneficial owner (as defined pursuant to Rule 13d-3 or Rule 13d-5 under the Exchange Act) of more than 5% of the outstanding ordinary shares of ICL as of the date of the offering or (2) be required to be filed a Schedule 13D or Schedule 13G with the U.S. Securities and Exchange Commission.\nThis press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any offer or sale of the Shares in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to their registration or qualification under the securities laws of any such state or jurisdiction.\nAbout Nutrien\nNutrien is the world's largest provider of crop inputs and services, playing a critical role in helping growers increase food production in a sustainable manner. We produce and distribute over 25 million tonnes of potash, nitrogen and phosphate products world-wide. With this capability and our leading agriculture retail network, we are well positioned to supply the needs of our customers. We operate with a long-term view and are committed to working with our stakeholders as we address our economic, environmental and social priorities. The scale and diversity of our integrated portfolio provides a stable earnings base, multiple avenues for growth and the opportunity to return capital to shareholders. For further information visit us at www.nutrien.com .\nForward Looking Statements\nCertain statements and other information included in this press release constitute \"forward-looking information\" or \"forward-looking statements\" (collectively, \"forward-looking statements\") under applicable securities laws. All statements in this press release, other than those relating to historical information or current conditions, are forward-looking statements, including, but not limited to, statements relating to the expected size and outcome of the proposed sale of Shares.\nForward-looking statements in this press release are based on certain key expectations and assumptions made by Nutrien, including expectations and assumptions concerning: customer demand for Nutrien's products; commodity prices and interest and foreign exchange rates; operating synergies, capital efficiencies and cost-savings; applicable tax laws; future production rates; future debt ratings; the sufficiency of budgeted capital expenditures in carrying out planned activities; and the availability and cost of labour and services. Although Nutrien believe that the expectations and assumptions on which such forward-looking statements are based are reasonable, undue reliance should not be placed on the forward-looking statements because Nutrien can give no assurance that they will prove to be correct.\nForward-looking statements are subject to various risks and uncertainties which could cause actual results and experience to differ materially from the anticipated results or expectations expressed in this press release. Key risks and uncertainties include, but are not limited: general global economic, market and business conditions; weather conditions including impacts from regional flooding and/or drought conditions; crop plant area, yield and prices; the supply and demand and price levels for major products of Nutrien may vary from what we currently anticipate; failure to realize anticipated synergies or cost savings; risks regarding the integration; failure to realize governmental and regulatory requirements and actions by governmental authorities, including changes in government policy, government ownership requirements, changes in environmental, tax and other laws or regulations and the interpretation thereof, and political risks, including civil unrest, actions by armed groups or conflict, regional natural gas supply restrictions as well as counterparty and sovereign risk; and relationships with employees, customers, business partners and competitors.\nNutrien disclaim any intention or obligation to update or revise any forward-looking statements in this press release as a result of new information or future events, except as may be required under applicable U.S. federal securities laws or applicable Canadian securities legislation.\nSOURCE Nutrien Ltd.", "external_links": [], "published": "2018-01-16T09:42:00.000+02:00", "crawled": "2018-01-16T11:01:05.017+02:00", "highlightTitle": ""}