{"organizations": [], "uuid": "4f8962d06a9d74912db3c6b6f7ec693d16daedab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/global-precious/precious-gold-edges-down-on-firmer-dollar-higher-bond-yields-idUSL4N1PP0VC", "country": "US", "domain_rank": 408, "title": "PRECIOUS-Gold edges down on firmer dollar, higher bond yields", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T03:48:00.000+02:00", "replies_count": 0, "uuid": "4f8962d06a9d74912db3c6b6f7ec693d16daedab"}, "author": "", "url": "https://www.reuters.com/article/global-precious/precious-gold-edges-down-on-firmer-dollar-higher-bond-yields-idUSL4N1PP0VC", "ord_in_thread": 0, "title": "PRECIOUS-Gold edges down on firmer dollar, higher bond yields", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "neutral"}, {"name": "european central bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 30 (Reuters) - Gold slipped on Tuesday, extending losses into a second session, as the dollar strengthened against a basket of currencies and U.S. bond yields rose. FUNDAMENTALS * Spot gold was down 0.1 percent at $1,338.40 per ounce at 0051 GMT. It fell 0.7 percent on Monday. * U.S. gold futures for February delivery fell 0.2 percent to $1,337.60 per ounce. * Gold prices have risen nearly 3 percent so far this month, largely due to weakness in the dollar. The greenback posted its sixth straight weekly fall last week, hitting a three-year low on Friday. A rise in the currency sent the yellow metal lower on Monday. * The dollar index , which measures the greenback against a basket of currencies, rose 0.1 percent to 89.406. * U.S. Treasury yields surged to more than three-year highs on Monday after comments from a European Central Bank official added to expectations that central banks globally will reduce stimulus as the economic outlook improves. * Rising bond yields helped underpin the greenback ahead of a week packed with U.S. data. The dollar remains on track for its biggest monthly decline since March 2016, however. * Traders now await U.S. employment data and the outcome of a two-day Federal Reserve policy meeting that begins on Tuesday, for any indications of interest rate hikes. * Asian stocks retreated from record peaks on Tuesday after a selloff in Apple shares knocked Wall Street. * Sovereign wealth funds have increased their exposure to alternative assets such as private equity, property, commodities and infrastructure to almost a quarter of their overall assets, a report from PWC said on Tuesday. * Holdings of SPDR Gold Trust GLD, the world's largest gold-backed exchange-traded fund, fell 0.17 percent to 846.67 tonnes on Monday from 848.14 tonnes on Friday. * Newcrest Mining Ltd's second-quarter gold production fell 0.3 percent from a year ago, but rose 17.2 percent over the prior quarter, driven by increased production at Cadia, Lihir, Bonikro and Telfer. DATA AHEAD (GMT) 0630 France Preliminary GDP Q4 0745 France Consumer spending Dec 1000 Euro zone GDP flash Q4 1000 Euro zone Business climate Jan 1000 Euro zone Consumer confidence final Jan 1300 Germany Consumer prices Jan 1400 U.S. Case-Shiller housing index Nov 1500 U.S. Consumer confidence Jan U.S. Federal Reserve starts two-day policy meeting (Reporting by Nallur Sethuraman in Bengaluru; Editing by Subhranshu Sahu)\n ", "external_links": [], "published": "2018-01-30T03:48:00.000+02:00", "crawled": "2018-01-30T04:08:51.004+02:00", "highlightTitle": ""}