{"organizations": [], "uuid": "ec4e8a384c1ef7671254c3848737f26fb53f1573", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/business-wire-former-citrix-executive-joins-softnasa-as-vice-president-of-marketing.html", "country": "US", "domain_rank": 767, "title": "Former Citrix Executive Joins SoftNAS® as Vice President of Marketing", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T19:16:00.000+02:00", "replies_count": 0, "uuid": "ec4e8a384c1ef7671254c3848737f26fb53f1573"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/business-wire-former-citrix-executive-joins-softnasa-as-vice-president-of-marketing.html", "ord_in_thread": 0, "title": "Former Citrix Executive Joins SoftNAS® as Vice President of Marketing", "locations": [], "entities": {"persons": [{"name": "john-marc", "sentiment": "none"}, {"name": "clark", "sentiment": "none"}, {"name": "john-marc clark", "sentiment": "none"}, {"name": "rick braddy", "sentiment": "none"}], "locations": [{"name": "tx", "sentiment": "none"}, {"name": "houston houston", "sentiment": "none"}, {"name": "memorial drive", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}], "organizations": [{"name": "citrix", "sentiment": "negative"}, {"name": "nas", "sentiment": "none"}, {"name": "inc.", "sentiment": "none"}, {"name": "cto", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Cloud Data Platform Business Expands Team with Marketing Leader; SoftNAS moves headquarters to Park Laureate in Houston\nHOUSTON--(BUSINESS WIRE)-- SoftNAS®, Inc., the #1 cloud data platform company and leading software-defined NAS provider for the cloud, today announced John-Marc Clark has joined its executive team as Vice President of Marketing. Clark brings three decades of enterprise software experience in global marketing, sales and strategic alliances with a focus on virtualization, cloud, security, open source, application development and systems integration. In addition, SoftNAS has relocated its corporate headquarters to Park Laureate at 10000 Memorial Drive, Suite 888, Houston, TX 77024.\n“We welcome our newest addition to the SoftNAS team and look forward to drawing on John-Marc’s expertise and direction as we expand our product line and brand value awareness,” said Rick Braddy, CEO, CTO, and Founder of SoftNAS. “We have always been driven by our customers’ needs and John-Marc brings expertise as we accelerate our efforts in corporate and product marketing, brand management, and building solution marketing with our strategic alliance and channel partners.”\n“This is an incredibly exciting time to join SoftNAS to lead marketing and I’m honored to become part of the leadership team. We believe that data is the critical component enterprises have to control and manage in a world undergoing massive digital transformation. To do this requires a cloud data platform, like SoftNAS Cloud® offers with data storage, data security, data acceleration and data integration capabilities,” said John-Marc Clark, Vice President, Marketing, SoftNAS. “Rapid growth at SoftNAS, technology innovation and market forces are all converging favorably. As such, we are building on our position as the #1 Cloud NAS solution provider to pioneer multi-cloud data control and management solutions that help customers with a range of additional business solutions including SaaS migration to the cloud, cloud backup and data archival, file-server consolidation, and on-premises to cloud migration of applications, data and storage infrastructure. We see 2018 as an inflection point year where cloud adoption becomes mainstream.”\nHaving held numerous leadership positions, Clark has built a career cultivating brands for leading companies in the Silicon Valley including IDC, Citrix, and Qumranet (acquired by Red Hat). He was formerly with GIS mapping software pioneer Strategic Mapping, Inc. which was acquired by ESRI.\nClark is responsible for SoftNAS corporate, product, digital and alliance marketing strategy and execution. In prior roles, he led analyst relations, market research, competitive intelligence, emerging product marketing, and global sales programs. At Citrix, Clark was responsible for the Fujitsu alliance team, growing that partnership into the company’s largest out of 9,000+ partners.\nWhile at Citrix Clark played a pivotal role as the company grew from $200 million to over $3 billion in annual revenues. Clark holds a bachelor’s degree in American History from Georgetown University and has a master’s degree in International Relations from La Universidad de Belgrano in Buenos Aires, Argentina as well as a master’s degree in International Business Administration specializing in International Marketing from The University of Miami.\nSoftNAS has moved its headquarters to the Park Laureate Building, a 9-story, Class A, boutique office building located in the premier Memorial Villages. One highlight of the location is a tribute sculpture display honoring its best-known tenant, President George H.W. Bush.\nAbout SoftNAS\nControl Any Data. Any Cloud. Anywhere.™\nSoftNAS®, Inc. is the #1 cloud data platform company and leading software-defined NAS provider for the cloud. Our mission is to be the fabric for business data in the cloud. SoftNAS provides a software-centric architecture that enables frictionless data management and control of any data, any cloud, anywhere. The SoftNAS cloud data platform and CloudFabric™ architecture provide customers a unified, integrated way to aggregate, transform, accelerate, protect, and store data and to easily create hybrid cloud solutions that bridge islands of data across SaaS, legacy systems, remote offices, factories, IoT, analytics, web services, SQL, NoSQL, and the cloud – any kind of data. SoftNAS provides the enterprise-class data security, protection, performance, and high-availability required to safely, predictably, and reliably operate IT systems and applications in the cloud. SoftNAS works with the most popular public, private, hybrid and premises-based cloud operating systems, including Amazon Web Services™, Microsoft® Azure™ and VMware vSphere®.\nLearn more: https://www.softnas.com/\nSoftNAS Cloud Beta: https://softnas.com/platinum-beta\nTwitter: https://twitter.com/softnas\nLinkedIn: https://www.linkedin.com/company/softnas\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180104005890/en/\nSoftNAS, represented by PetersGroup\nLauren Peters, 512-431-2938\nlauren@petersgroupPR.com\nSource: SoftNAS", "external_links": ["https://www.softnas.com/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2Fsoftnas&esheet=51737962&newsitemid=20180104005890&lan=en-US&anchor=https%3A%2F%2Ftwitter.com%2Fsoftnas&index=4&md5=92cf14095d6b074e764674db71a4dfae", "https://www.linkedin.com/company/softnas", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.softnas.com%2F&esheet=51737962&newsitemid=20180104005890&lan=en-US&anchor=https%3A%2F%2Fwww.softnas.com%2F&index=2&md5=be4440fd3fd6b1e84a47c1e17b8c4d24", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.softnas.com%2Fwp%2Fabout-us%2Fleadership%2F&esheet=51737962&newsitemid=20180104005890&lan=en-US&anchor=John-Marc+Clark&index=1&md5=7d9321e20dbafdc41a2bc1591647d309", "https://twitter.com/softnas", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Fsoftnas&esheet=51737962&newsitemid=20180104005890&lan=en-US&anchor=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Fsoftnas&index=5&md5=e32d5f9ae44efba790b7627e1725cead", "http://www.businesswire.com/news/home/20180104005890/en/", "https://softnas.com/platinum-beta", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fsoftnas.com%2Fplatinum-beta&esheet=51737962&newsitemid=20180104005890&lan=en-US&anchor=https%3A%2F%2Fsoftnas.com%2Fplatinum-beta&index=3&md5=dbd657027614b7bae0fdfba8a7780fe9"], "published": "2018-01-04T19:16:00.000+02:00", "crawled": "2018-01-04T20:32:24.000+02:00", "highlightTitle": ""}