{"organizations": [], "uuid": "d475fb846f0735ec229f490bd8286b52a0f8052f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.goldreview.com/feed", "section_title": "Gold Review » Gold Review", "url": "https://uk.reuters.com/article/global-precious/precious-gold-down-on-concern-about-europe-buoyant-shares-idUKL4N1P439L", "country": "US", "domain_rank": 408, "title": "Gold slips on concern about Europe, buoyant shares", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T18:50:00.000+02:00", "replies_count": 0, "uuid": "d475fb846f0735ec229f490bd8286b52a0f8052f"}, "author": "cmullen", "url": "https://uk.reuters.com/article/global-precious/precious-gold-down-on-concern-about-europe-buoyant-shares-idUKL4N1P439L", "ord_in_thread": 0, "title": "Gold slips on concern about Europe, buoyant shares", "locations": [], "entities": {"persons": [{"name": "eric onstad", "sentiment": "none"}, {"name": "jonathan butler", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "eft", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "mitsubishi", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 11:16 AM / Updated 3 hours ago PRECIOUS-Gold drifts lower on Europe concerns, buoyant shares Reuters Staff 4 Min Read \n* Palladium hits record high at $1,111.40/oz * Platinum off 3-1/2-month peaks marked in previous session (Recasts with palladium record, updates prices; adds analyst comments, NEW YORK to dateline) By Renita D. Young and Eric Onstad NEW YORK/LONDON, Jan 9 (Reuters) - Gold edged lower on Tuesday, weighed down by a stronger U.S. dollar on the back of concerns about political uncertainty in Europe, while a buoyant stock market also drained enthusiasm for bullion. Palladium, meanwhile, recorded its third record high so far in January, boosted by increased demand from the automotive industry. Spot gold was down 0.6 percent at $1,312.58 per ounce by 1:36 p.m. EST (1836 GMT). Prices last week touched their highest since Sept. 15 at $1,325.86. U.S. gold futures for February delivery settled down $6.70, or 0.5 percent, at $1,313.70 per ounce. Palladium was trading up 0.1 percent at $1,101.55 an ounce after touching a fresh record high of $1,111.40. The dollar was up 0.2 percent against a basket of major currencies on Tuesday, making commodities priced in the greenback more expensive for buyers using other currencies. It hit a more than one-week high on Monday. \"The dollar has bounced back, partly due to weakness in the euro,\" said Jonathan Butler, commodities analyst at Mitsubishi in London. \"There's also the continuing rally in the equity markets. All of that has probably helped take the wind out of gold's sails.\" The euro is being weighted down on concerns about upcoming Italian elections, problems forming a German government and lingering Brexit concerns, he added. Gold is also seeing profit-taking from its recent rally, traders said. Global gold-backed, exchange-traded funds added 197.5 tonnes in 2017, an 8.4 percent increase, the World Gold Council said. \"The gold price was clearly finding support from inflows ... into gold ETFs, meaning that inflows since the start of the year have totaled almost six tonnes,\" Commerzbank said in a research note. But gold may edge lower soon, according to traders. \"If it goes below the $1,240 level, then you’ll see a lot of sell stops ... That'll be the first sign of the trend starting to change,\" said Michael Matousek, head trader at U.S. Global Investors in San Antonio, Texas. Though U.S. auto sales figures for December were in line with expectations, palladium extended its 2018 rally. \"There are still strong fundamentals coming from the automotive industry, which uses catalytic converters in vehicles to fight pollution,\" said Phillip Streible, senior commodities strategist at RJO Futures in Chicago. \"But there's a potential for profit-taking. Over the long run, we might see more demand for electric vehicles.\" he added. Among other precious metals, spot silver fell 0.93 percent at $16.98 an ounce. Platinum dropped 0.9 percent at $963.74 an ounce after hitting a 3-1/2-month peak on Monday at $973.60. (Additional reporting by Nallur Sethuraman in Bengaluru; editing by Louise Heavens and G Crosse)", "external_links": [], "published": "2018-01-09T18:50:00.000+02:00", "crawled": "2018-01-09T19:25:42.008+02:00", "highlightTitle": ""}