{"organizations": [], "uuid": "bdb59cc87507a884aba4c8625461b63d80e8cc1c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/germany-executive-pay/germanys-top-earners-targeted-in-push-for-diluted-labour-laws-idUSL8N1PN0RB", "country": "US", "domain_rank": 408, "title": "Germany's top earners targeted in push for diluted labour laws", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T14:15:00.000+02:00", "replies_count": 0, "uuid": "bdb59cc87507a884aba4c8625461b63d80e8cc1c"}, "author": "", "url": "https://www.reuters.com/article/germany-executive-pay/germanys-top-earners-targeted-in-push-for-diluted-labour-laws-idUSL8N1PN0RB", "ord_in_thread": 0, "title": "Germany's top earners targeted in push for diluted labour laws", "locations": [], "entities": {"persons": [{"name": "tom sims", "sentiment": "none"}], "locations": [{"name": "germany", "sentiment": "none"}, {"name": "frankfurt", "sentiment": "none"}, {"name": "frankfurt", "sentiment": "none"}, {"name": "hesse", "sentiment": "none"}], "organizations": [{"name": "reuter", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 16 PM / Updated 6 minutes ago Germany's top earners targeted in push for diluted labour laws Reuters Staff \n* Hesse finance ministry says reform would boost competitiveness \n* Extends proposal from financial sector to all industries \n* Reforms could apply to staff on salaries of 200,000 euros \nBy Tom Sims \nFRANKFURT, Jan 29 (Reuters) - Germany’s business heartland has begun moves to loosen the country’s strict labour laws for high earners, aiming to boost competitiveness but putting it on a collision course with powerful labour unions. \nThe finance ministry of the state of Hesse -- home to some of Germany’s largest corporations and its financial capital Frankfurt -- is working “vigorously” on employment law reform for top earners across all industries, it said in a statement. \nThe plan is aimed at smoothing the system of time-consuming and costly settlements when companies fire senior staff, requiring contracts for elite workers to include agreed settlements in the event of early termination. \nThe effort is an expansion of a previous proposal that focused on the banking sector as financial businesses began last year to consider relocating staff from Britain when it leaves the European Union. Proponents of the new proposal for all industries say it is more in line with Germany’s constitution. \nIn the decades following World War II, laws protecting workers have helped to stabilise the German economy, but critics say they have also dragged on growth. \n“There are a lot of people who need protection, and we should grant that protection in labour markets,” said Markus Becker-Melching at the Germany banking association. “But there are others who don’t and we need to ensure that the German labour market remains competitive internationally.” \nThe renewed push in Europe’s largest economy is partly a response to French reforms pushed through by President Emmanuel Macron to make its jobs market more flexible. \nHowever, the German proposals face opposition from powerful trade unions that fear a domino effect that would erode protection for the broader workforce. \n“This could quickly lead to demands for other concessions from employers, and there is the fear of a general loosening of dismissal protection to other groups of workers,” said Jan Duscheck, an official in the Verdi trade union and a labour representative on Deutsche Bank’s supervisory board. \nThe Association of Foreign Banks in Germany, members of which include Goldman Sachs, Bank of America and Morgan Stanley, pitched their proposal to the Hesse government this month. \nThe foreign banks’ proposal is for high-earning employees to have pre-determined termination settlements written into their contracts, suggesting a salary starting point of either 200,000 euros ($247,940) or 300,000 euros. \nUnder the current system, employee dismissal disputes can result in costly court cases lasting at least six months, said labour law specialist Jens Jensen, who is advising the foreign banking association. ($1 = 0.8066 euros) Reporting by Tom Sims; Editing by David Goodman", "external_links": [], "published": "2018-01-29T14:15:00.000+02:00", "crawled": "2018-01-29T14:29:22.002+02:00", "highlightTitle": ""}