{"organizations": [], "uuid": "12dba2453821c8dbc99365d468a0298eb62d6db2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 52, "shares": 52, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-615682474.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/04/travis-kalanick-uber-shares-softbank/", "country": "US", "domain_rank": 1196, "title": "Uber: Travis Kalanick May Sell Nearly a Third of His Stake | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.987, "site_type": "news", "published": "2018-01-06T00:51:00.000+02:00", "replies_count": 0, "uuid": "12dba2453821c8dbc99365d468a0298eb62d6db2"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/04/travis-kalanick-uber-shares-softbank/", "ord_in_thread": 0, "title": "Uber: Travis Kalanick May Sell Nearly a Third of His Stake | Fortune", "locations": [], "entities": {"persons": [{"name": "travis kalanick", "sentiment": "negative"}, {"name": "kalanick", "sentiment": "none"}, {"name": "michael kovac", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "none"}, {"name": "vanity fair", "sentiment": "none"}, {"name": "softbank group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Uber Travis Kalanick May Sell Nearly a Third of His Stake in Uber Uber co-founder Travis Kalanick speaks at the Vanity Fair New Establishment Summit in San Francisco, Calif. on Oct. 19, 2016. Michael Kovac—Getty Images/Vanity Fair By Bloomberg 10:51 PM EST \nFormer Uber Technologies (uber) Chief Executive Officer Travis Kalanick, who has long boasted that he’s never sold any shares in the company he co-founded, plans to sell about 29% of his stake in the ride-hailing company, people with knowledge of the matter said. \nKalanick stands to reap about $1.4 billion from the transaction with SoftBank Group and a consortium of investors who have agreed to buy equity valuing Uber at $48 billion, said the people, who asked not to be identified discussing private negotiations. Kalanick, who owns 10% of the company, had offered to sell as much as half of his stake — the maximum board members were allowed to tender. He had to pare back the amount because of limits outlined in the agreement between Uber and the buyers, the people said. \nOne of the wealthiest people in the world on paper, Kalanick would become an actual billionaire for the first time as a result of the sale. Kalanick was pressured to resign last year after the company became mired in legal woes and a raft of government investigations into how it does business. He also clashed with Benchmark, one of the company’s earliest and biggest investors, which is also selling part of its stake. \nFor more on Uber, watch Fortune’s video: \nTerms of the deal bar sellers from parting with more than 58% of shares initially offered, requiring Kalanick to sell a smaller portion of his stake. Spokesmen for Uber and Kalanick declined to comment. \nGV, Alphabet Inc.’s venture capital firm, offered up significantly less than half of its stake in Uber even though Alphabet’s self-driving car subsidiary Waymo is suing Uber for stealing trade secrets. In October 2017, another Alphabet investment firm, CapitalG, said that it was leading an investment in Uber’s primary U.S. competitor, Lyft (lyft) . \nThe SoftBank deal is expect to close later this month. Once it is finalized, a number of governance reforms that effectively reduce Kalanick’s influence at Uber will go into effect. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-06T00:51:00.000+02:00", "crawled": "2018-01-05T07:15:52.002+02:00", "highlightTitle": ""}