{"organizations": [], "uuid": "aef355c5276157058b94d68f9aadf6858d4a817e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223915856&w=1200&r=LYNXMPEE0K0QU", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-usa-israel-pence-arrival/vice-president-pence-arrives-in-israel-idUSKBN1FA0YE", "country": "US", "domain_rank": 408, "title": "Vice President Pence arrives in Israel", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T19:24:00.000+02:00", "replies_count": 0, "uuid": "aef355c5276157058b94d68f9aadf6858d4a817e"}, "author": "", "url": "https://www.reuters.com/article/us-usa-israel-pence-arrival/vice-president-pence-arrives-in-israel-idUSKBN1FA0YE", "ord_in_thread": 0, "title": "Vice President Pence arrives in Israel", "locations": [], "entities": {"persons": [{"name": "pence", "sentiment": "negative"}, {"name": "benjamin netanyahu", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "netanyahu", "sentiment": "none"}], "locations": [{"name": "israel", "sentiment": "none"}, {"name": "ben-gurion airport", "sentiment": "none"}, {"name": "tel aviv", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "jerusalem", "sentiment": "none"}], "organizations": [{"name": "israel jeff mason", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 25 PM / in 4 minutes Vice President Pence arrives in Israel Jeff Mason 3 Min Read \nBEN-GURION AIRPORT, Israel (Reuters) - U.S. Vice President Mike Pence began a visit to Israel on Sunday after being praised as a “great friend” by Prime Minister Benjamin Netanyahu and shunned by the Palestinians over U.S. recognition of Jerusalem as Israel’s capital. \nPence was welcomed at Tel Aviv’s Ben-Gurion Airport by Israel’s tourism minister and made no statement to reporters before travelling to Jerusalem. \nIt is the highest-level U.S. visit to the region since President Donald Trump made his Jerusalem declaration on Dec. 6 and promised to begin the process of moving the American embassy to the city, whose status is at the heart of the Israeli-Palestinian conflict. \nWith the Palestinians boycotting Pence, the visit provides little obvious opportunity to build bridges towards peace. \nBut it gave Pence, a conservative Christian, Netanyahu, a right-winger who has hailed U.S. evangelicals for their support of Israel, an opportunity to shine a spotlight on the holy land visit and their own warm relationship for a community that serves as a power base for Trump and his vice president. \nPalestinian President Mahmoud Abbas, calling Trump’s declaration a ”slap in the face’, has rejected Washington as an honest broker in any future talks with Israel. Abbas left for an overseas visit before Pence arrived. U.S. Vice President Mike Pence and his wife Karen wave upon their arrival at Ben Gurion international Airport in Lod, near Tel Aviv, Israel January 21, 2018. REUTERS/Ammar Awad \nPence, who flew into Tel Aviv’s Ben-Gurion Airport from Jordan on a U.S. military plane after visiting U.S. troops on the Syrian border, was met by Israel’s tourism minister, Yariv Levin. \nNetanyahu, addressing his cabinet earlier on Sunday, described Pence as a “great friend of the State of Israel” and said they would discuss U.S. efforts “to halt Iran’s aggression, the Iranian nuclear programme, and ways to advance peace and security in the region.” \n“Anyone who truly wants to fulfill those goals knows there is no substitute to the United States’ leadership,” Netanyahu said. \nTrump’s shift on Jerusalem overturned decades of U.S. policy that its status should be decided in Israeli-Palestinian negotiations. His declaration drew universal condemnation from Arab leaders and widespread criticism elsewhere. \nIn comments delivered in Egypt, his first stop on the Middle East visit, Pence said Washington would support a two-state solution for Israelis and Palestinians if the two sides agreed to it. \nVisiting Jordan on Sunday before flying to Israel, Pence told its monarch, King Abdullah, that Washington was committed to preserving the status quo of holy sites in Jerusalem, a city sacred to Jews, Muslims and Christians. Writing by Jeffrey Heller; Editing by Stephen Farrell", "external_links": [], "published": "2018-01-21T19:24:00.000+02:00", "crawled": "2018-01-21T19:37:09.021+02:00", "highlightTitle": ""}