{"organizations": [], "uuid": "5693614588876a6387764f9da40d35b5af06568b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 12, "shares": 12, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/04/104928898-GettyImages-87874564.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/05/how-to-knock-out-holiday-credit-card-debt.html", "country": "US", "domain_rank": 767, "title": "How to knock out holiday credit card debt", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.146, "site_type": "news", "published": "2018-01-07T16:00:00.000+02:00", "replies_count": 0, "uuid": "5693614588876a6387764f9da40d35b5af06568b"}, "author": "Sarah O'Brien", "url": "https://www.cnbc.com/2018/01/05/how-to-knock-out-holiday-credit-card-debt.html", "ord_in_thread": 0, "title": "How to knock out holiday credit card debt", "locations": [], "entities": {"persons": [{"name": "gonzalez", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "federal reserve bank of new york  nevertheless", "sentiment": "neutral"}, {"name": "federal reserve", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "With retailers reporting strong holiday sales , and some consumers saying they turned to plastic to fund those purchases, it looks like 2018 will be the year that credit card debt crosses $1 trillion.\n\"The scary number — $1 trillion — we'll definitely hit in 2018,\" said Jill Gonzalez, an analyst with WalletHub. \"It seems to say a lot of American consumers did not learn their lesson from the recession and are returning to living beyond their means.\"\nCredit card debt stood at $808 billion on Sept. 30, the end of the third quarter, according to the most recent data from the Federal Reserve Bank of New York. That's $280 billion more than the previous high hit in 2008, at the height of the financial crisis that led to the Great Recession.\nUpdated numbers for the fourth quarter of 2017, which ended Dec. 31, should be released in mid-February.\nConsumer debt keeps climbing Category Quarterly change (from Q2 2017) Annual change (from Q3 2016) Total as of Q3 2017 Mortgage debt (+) $52 billion (+) $393 billion $8.74 trillion Home equity line of credit (-) $4 billion (-) $24 billion $448 billion Student loan debt (+) $13 billion (+) $78 billion $1.36 trillion Auto loan debt (+) $23 billion (+) $78 billion $1.21 trillion Credit card debt (+) $24 billion (+) $61 billion $808 billion Total debt (+) $116 billion (+) $605 billion $12.96 trillion Federal Reserve Bank of New York Nevertheless, U.S. consumers have continued racking up debt . An annual post-holiday survey by MagnifyMoney shows people who used credit cards for holiday purchases charged an average of $1,054, about 5 percent more than last year.\nAs consumers keep spending away on their credit cards — which typically come with interest rates starting at about 16 percent — the Federal Reserve is expected to have two or three quarter-point hikes this year to a key rate that affects consumer debt . It did so three times in 2017.\n\"Every time there is a Federal Reserve rate hike, that adds about $1.5 billion to our collective financing rates,\" Gonzalez said. \"That has to do with these delinquency rates rising. And when you factor in mortgages, student loans and auto loans, that becomes a scary picture.\"\nIf you are among those facing mounting credit card bills, Gonzalez offers the following tips to pare down your debt:\nConsider transferring your balance If your credit score is high enough to qualify for a zero percent balance-transfer offer, consider taking it.\n\"The offers with 18 or 21 months with zero percent interest are reserved for those with excellent credit,\" Gonzalez said.\nWhile these deals typically come with a balance-transfer fee, the zero percent interest rate can last anywhere from a few months or a year to a couple of years. At the end of the deal, the remaining balance begins accruing interest at the then-current rate.\nNot only do you avoid paying interest on the debt, you can potentially pay it down more quickly because all of your payment will go toward the balance instead of some going toward interest.\nPhoto by Joe Raedle/Getty Images Strategize your repayment efforts If you have multiple credit cards, start by funneling most of your repayments toward the one with the highest interest rate. In other words, pay the minimum on the lower-rate cards and put any extra you possibly can toward the debt that's costing you the most in interest.\n\"Once that most expensive debt is paid off, go to the card with the next highest rate and do that until you are debt free,\" Gonzalez said.\n\"On the Money\" airs on CNBC Saturdays at 5:30 a.m. ET. Check listings for air times in local markets.\nMore from Personal Finance:\nHere's what's derailing your financial resolutions\nLiving on minimum wage is possible in these 13 cities — but barely\nHere's how to get the most out of your 2018 financial resolutions", "external_links": [], "published": "2018-01-07T16:00:00.000+02:00", "crawled": "2018-01-07T15:59:39.001+02:00", "highlightTitle": ""}