{"organizations": [], "uuid": "6bf893804e21a332f8aaace228d5eb0d4e9c64a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-free-research-reports-on-these-shipping-stocks--globus-maritime-pyxis-tankers-seanergy-maritime-and-capital-product-partners.html", "country": "US", "domain_rank": 767, "title": "Free Research Reports on these Shipping Stocks -- Globus Maritime, Pyxis Tankers, Seanergy Maritime, and Capital Product Partners", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.778, "site_type": "news", "published": "2018-01-19T14:35:00.000+02:00", "replies_count": 0, "uuid": "6bf893804e21a332f8aaace228d5eb0d4e9c64a3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-free-research-reports-on-these-shipping-stocks--globus-maritime-pyxis-tankers-seanergy-maritime-and-capital-product-partners.html", "ord_in_thread": 0, "title": "Free Research Reports on these Shipping Stocks -- Globus Maritime, Pyxis Tankers, Seanergy Maritime, and Capital Product Partners", "locations": [], "entities": {"persons": [{"name": "fitch", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "capital product partners", "sentiment": "negative"}, {"name": "pyxis tankers", "sentiment": "negative"}, {"name": "globus maritime", "sentiment": "negative"}, {"name": "capital product partners l.p.", "sentiment": "none"}, {"name": "pyxis tankers inc.", "sentiment": "none"}, {"name": "globus maritime ltd", "sentiment": "none"}, {"name": "cplp", "sentiment": "none"}, {"name": "seanergy maritime holdings corp.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 19, 2018 /PRNewswire/ --WallStEquities.com strives to bring the best free research to the investment community. Today we are offering reports on GLBS, PXS, SHIP, and CPLP which can be accessed for free by signing up to www.wallstequities.com/registration . Breakbulk reported that the Shipping industry's outlook for 2018 remains negative with little expectation of material improvement in market fundamentals, according to the latest research by ratings agency Fitch. The firm's \"2018 Outlook: Global Shipping\" report suggests that overcapacity remains a constant danger and that longevity of any recovery is uncertain due to limited adherence to industry-wide limits. Ahead of today's trading session, WallStEquities.com shifts focus on four industry players to see how they have fared over the past trading sessions: Globus Maritime Ltd (NASDAQ: GLBS), Pyxis Tankers Inc. (NASDAQ: PXS), Seanergy Maritime Holdings Corp. (NASDAQ: SHIP), and Capital Product Partners L.P. (NASDAQ: CPLP). All you have to do is sign up today for this free limited time offer by clicking the link below.\nwww.wallstequities.com/registration\nGlobus Maritime\nAthens, Greece-based Globus Maritime Ltd's stock finished Thursday's session 0.83% lower at $1.19 with a total trading volume of 337,512 shares. Over the last month and the previous three months, the Company's shares have advanced 1.71% and 27.26%, respectively. The stock is trading slightly above its 50-day moving average by 0.73%. Moreover, shares of Globus Maritime, which provides marine transportation services worldwide, have a Relative Strength Index (RSI) of 49.68.\nOn December 22 nd , 2017, Globus Maritime announced that investors holding warrants originally issued pursuant to its February 2017 private placement have elected to exercise their right to purchase 274,808 of the Company's common shares at a price of $1.60 per share. Get the full research report on GLBS for free by clicking below at:\nwww.wallstequities.com/registration/?symbol=GLBS\nPyxis Tankers\nShares in Maroussi, Greece-based Pyxis Tankers Inc. dropped 4.44%, ending yesterday's session at $1.72 with a total trading volume of 372,535 shares. The stock is trading 15.64% below its 200-day moving average. Shares of the Company, which operates as a maritime transportation company with a focus on the tanker sector in the US, have an RSI of 34.42.\nOn January 08 th , 2018, research firm Maxim Group upgraded the Company's stock rating from 'Hold' to 'Buy', with a target price of $3 per share. Find your free research report PXS at:\nwww.wallstequities.com/registration/?symbol=PXS\nSeanergy Maritime Holdings\nOn Thursday, Athens, Greece headquartered Seanergy Maritime Holdings Corp.'s stock closed the day flat at $1.03. A total volume of 98,271 shares was traded. The Company's shares are trading 8.94% above their 200-day moving average. Additionally, shares of Seanergy Maritime, which provides marine dry bulk transportation services through the ownership and operation of dry bulk vessels, have an RSI of 44.69. Sign up today for the free research report on SHIP at:\nwww.wallstequities.com/registration/?symbol=SHIP\nCapital Product Partners\nShares in Piraeus, Greece headquartered Capital Product Partners L.P. ended the day 2.29% lower at $3.41. A total volume of 552,229 shares was traded, which was above their three months average volume of 456,280 shares. The stock has gained 1.49% in the last month and 1.79% over the past year. The Company's shares are trading above their 50-day moving average by 2.39%. Furthermore, shares of the Company, which provides marine transportation services in Greece, have an RSI of 48.54.\nOn January 17 th , 2018, Capital Product Partners announced that its Board of Directors has declared a cash distribution of $0.08 per common unit for Q4 2017 ended December 31 st , 2017. The fourth-quarter common unit cash distribution will be paid on February 13 th , 2018 to common unit holders of record on February 02 nd , 2018. Wall St. Equities' research coverage also includes the downloadable free report on CPLP at:\nwww.wallstequities.com/registration/?symbol=CPLP\n--\nWall St. Equities :\nWall St. Equities (WSE) produces regular sponsored and non-sponsored reports, articles, stock market blogs, and popular investment newsletters covering equities listed on NYSE and NASDAQ and micro-cap stocks. WSE has two distinct and independent departments. One department produces non-sponsored analyst certified content generally in the form of press releases, articles and reports covering equities listed on NYSE and NASDAQ and the other produces sponsored content (in most cases not reviewed by a registered analyst), which typically consists of compensated investment newsletters, articles and reports covering listed stocks and micro-caps. Such sponsored content is outside the scope of procedures detailed below.\nWSE has not been compensated; directly or indirectly; for producing or publishing this document.\nPRESS RELEASE PROCEDURES :\nThe non-sponsored content contained herein has been prepared by a writer (the \"Author\") and is fact checked and reviewed by a third-party research service company (the \"Reviewer\") represented by a credentialed financial analyst [for further information on analyst credentials, please email info@wallstequities.com . Rohit Tuli, a CFA® charterholder (the \"Sponsor\"), provides necessary guidance in preparing the document templates. The Reviewer has reviewed and revised the content, as necessary, based on publicly available information which is believed to be reliable. Content is researched, written and reviewed on a reasonable-effort basis. The Reviewer has not performed any independent investigations or forensic audits to validate the information herein. The Reviewer has only independently reviewed the information provided by the Author according to the procedures outlined by WSE. WSE is not entitled to veto or interfere in the application of such procedures by the third-party research service company to the articles, documents or reports, as the case may be. Unless otherwise noted, any content outside of this document has no association with the Author or the Reviewer in any way.\nNO WARRANTY\nWSE, the Author, and the Reviewer are not responsible for any error which may be occasioned at the time of printing of this document or any error, mistake or shortcoming. No liability is accepted whatsoever for any direct, indirect or consequential loss arising from the use of this document. WSE, the Author, and the Reviewer expressly disclaim any fiduciary responsibility or liability for any consequences, financial or otherwise arising from any reliance placed on the information in this document. Additionally, WSE, the Author, and the Reviewer do not (1) guarantee the accuracy, timeliness, completeness or correct sequencing of the information, or (2) warrant any results from use of the information. The included information is subject to change without notice.\nNOT AN OFFERING\nThis document is not intended as an offering, recommendation, or a solicitation of an offer to buy or sell the securities mentioned or discussed, and is to be used for informational purposes only. Please read all associated disclosures and disclai", "external_links": ["http://www.wallstequities.com/registration/?symbol=CPLP", "http://www.wallstequities.com/registration/?symbol=PXS", "https://wallstequities.com/legal-disclaimer/", "http://www.prnewswire.com/news-releases/free-research-reports-on-these-shipping-stocks----globus-maritime-pyxis-tankers-seanergy-maritime-and-capital-product-partners-300585174.html", "http://www.wallstequities.com/registration/?symbol=GLBS", "http://www.wallstequities.com/registration/?symbol=SHIP", "http://www.wallstequities.com/registration"], "published": "2018-01-19T14:35:00.000+02:00", "crawled": "2018-01-19T16:01:17.057+02:00", "highlightTitle": ""}