{"organizations": [], "uuid": "5ed1dab29a04bd33a419f8279479f2042ecb13c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/03/21/103485412-AP_585278705751.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/celgene-to-buy-biotechnology-company-juno-therapeutics-for-about-9-billion.html", "country": "US", "domain_rank": 767, "title": "Celgene to buy biotechnology company Juno Therapeutics for about $9 billion", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.026, "site_type": "news", "published": "2018-01-22T13:35:00.000+02:00", "replies_count": 0, "uuid": "5ed1dab29a04bd33a419f8279479f2042ecb13c6"}, "author": "Cnbc.Com Staff", "url": "https://www.cnbc.com/2018/01/22/celgene-to-buy-biotechnology-company-juno-therapeutics-for-about-9-billion.html", "ord_in_thread": 0, "title": "Celgene to buy biotechnology company Juno Therapeutics for about $9 billion", "locations": [], "entities": {"persons": [{"name": "juno", "sentiment": "none"}], "locations": [{"name": "juno", "sentiment": "none"}], "organizations": [{"name": "juno therapeutics", "sentiment": "negative"}, {"name": "celgene", "sentiment": "negative"}, {"name": "jefferies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Celgene agreed on Monday to buy the rest of Juno Therapeutics it doesn't already own for about $9 billion in cash to gain access to Juno's pipeline of CAR-T cancer drugs.\nCelgene owns 9.7 percent in Juno and will offer $87 per share for the rest of the company. Shares of Juno Therapeutics were up 27 percent on the news, to just below the offering price.\nThe clock was ticking for Celgene, Mike Bailey, director of research at FBB Capital Partners, told CNBC last week. \nCelgene loses patent protection by 2022 for Revlimid, its top-selling multiple myeloma drug that brought in about 60 percent of fiscal third quarter revenue of nearly $3.3 billion.\nOnce the patent runs out, Celgene could feel pressure from generics within a few years, Bailey said.\nCelgene is working with Seattle-based Juno on an experimental new gene therapy designed to treat people with relapsed or refractory aggressive B-cell non-Hodgkin lymphoma.\nThe treatment is a type of so-called CAR T-cell therapy — taking a patient's own immune cells, called T cells, genetically manipulating them to attack specific proteins on cancer, and infusing them back into the patient.\nKristoffer Tripplaar | AP Celgene Juno said it could expect approval for its treatment by the end of 2018. \n\"The acquisition of Juno builds on our shared vision to discover and develop transformative medicines for patients with incurable blood cancers,\" Celgene CEO Mark Alles said in a statement Monday.\n\"Juno's advanced cellular immunotherapy portfolio and research capabilities strengthen Celgene's global leadership in hematology and adds new drivers for growth beyond 2020.\"\nThe news comes about a week after the biotech giant announced it would buy Impact Biomedicines for $7 billion. Both Impact and Juno offer drugs that could boost Celgene in the market for blood-cancer treatment.\nJefferies analysts called the potential acquisition \"smart,\" because \"the buyout would enable Celgene to integrate Juno's entire cell therapy platform and bring it all in house.\"\nDavid Nierengarten, head of health-care equity research at Wedbush, told CNBC, \"Celgene has a big revenue hole to fill over the next few years\" and Juno's treatment could potentially \"fill that gap.\"\nCelgene has had an estimated $500 million stake in Juno since September, according to a report from Jefferies.\nNovartis and Gilead Sciences already received the first two approvals of CAR T for other types of cancer. For one-time treatments, they cost $475,000 and $373,000 , respectively.\nJ.P. Morgan Securities is acting as financial advisor to Celgene on the transaction, while Morgan Stanley is acting as Juno's advisor.\nWATCH: Celgene to buy Impact Biomedicines in $7 billion deal show chapters Celgene to buy Impact Biomedicines in $7 billion deal      2:56 PM ET Mon, 8 Jan 2018 | 02:45 —CNBC's Chloe Aiello and Reuters contributed to this report.", "external_links": [], "published": "2018-01-22T13:35:00.000+02:00", "crawled": "2018-01-22T13:45:59.007+02:00", "highlightTitle": ""}