{"organizations": [], "uuid": "de08a291e9eddcebb72d52b31c1e9301479d8474", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-853657646.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/24/us-olympic-committee-usa-gymnastics-resign/", "country": "US", "domain_rank": 1196, "title": "Larry Nassar Trial: USOC Calls For USA Gymnastics Board to Resign | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.512, "site_type": "news", "published": "2018-01-24T02:00:00.000+02:00", "replies_count": 0, "uuid": "de08a291e9eddcebb72d52b31c1e9301479d8474"}, "author": "Kirsten Korosec", "url": "http://fortune.com/2018/01/24/us-olympic-committee-usa-gymnastics-resign/", "ord_in_thread": 0, "title": "Larry Nassar Trial: USOC Calls For USA Gymnastics Board to Resign | Fortune", "locations": [], "entities": {"persons": [{"name": "scott blackmun", "sentiment": "negative"}, {"name": "kirsten korosec", "sentiment": "negative"}, {"name": "larry nassar", "sentiment": "negative"}, {"name": "rosemarie aquilina aquilina", "sentiment": "none"}, {"name": "nassar", "sentiment": "none"}, {"name": "blackmun", "sentiment": "none"}], "locations": [{"name": "eaton county", "sentiment": "none"}, {"name": "michigan", "sentiment": "none"}], "organizations": [{"name": "u.s. olympic committee", "sentiment": "negative"}, {"name": "usoc calls for usa gymnastics board", "sentiment": "negative"}, {"name": "usa gymnastics", "sentiment": "none"}, {"name": "usag", "sentiment": "none"}, {"name": "usoc", "sentiment": "none"}, {"name": "michigan state university", "sentiment": "none"}, {"name": "team usa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Kirsten Korosec January 24, 2018 \nU.S. Olympic Committee CEO Scott Blackmun called on the entire USA Gymnastics board to resign following Wednesday’s sentencing of former USA Gymnastics and Michigan State University doctor Larry Nassar who sexually abused young women under the guise of providing medical treatment. \nNassar was sentenced Wednesday to 40 to 175 years in prison for seven counts of first-degree criminal sexual conduct. He still faces sentencing in Eaton County, Michigan for three more counts. The sentencing by Judge Rosemarie Aquilina Aquilina followed an intense 7-day hearing in which more than 150 women gave statements describing how Nassar abused them. \nThree members of the USAG resigned Monday. In an open letter to Team USA athletes , Blackmun apologized that the USOC did not support the victims. \nThe purpose of this message is to tell all of Nassar’s victims and survivors, directly, how incredibly sorry we are. We have said it in other contexts, but we have not been direct enough with you. We are sorry for the pain caused by this terrible man, and sorry that you weren’t afforded a safe opportunity to pursue your sports dreams. The Olympic family is among those that have failed you. \nI know this apology is not enough. We have been working on taking steps at the USOC and mandating changes among National Governing Bodies to ensure this does not happen again. \nBlackmun outlined four steps that the USOC plans to take, including the launch of an independent investigation “to examine how an abuse of this proportion could have gone undetected for so long.” This investigation will include both USAG and the USOC. Blackmun said the results will be made public. \nBlackmun recommended all remaining members of the USAG resign, that the governance of the board be changed, and that a new system to make it easier to report abuse be established. \nAfter the initial USAG resignations, Olympic gymnastics gold medalist Aly Raisman —herself a victim and survivor of Nassar’s abuse—criticized the USOC for not doing more. Thoughts on USOC's statement pic.twitter.com/hygTV6nNXd \n— Alexandra Raisman (@Aly_Raisman) January 23, 2018 \nIn a statement that she tweeted on Jan. 22, Raisman said: \n“Over the weekend, the USOC released a statement shameless taking credit for a few USAG resignations (note: not fired); as though they’re addressing this problem. But they are still not acknowledging its own role in this mess. ZERO accountability! It’s like none of us were ever abused!” \nRaisman called for an independent investigation into the matter, ending her letter with “What’s it going to take for you to do the right thing?” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-24T02:00:00.000+02:00", "crawled": "2018-01-25T05:56:10.000+02:00", "highlightTitle": ""}