{"organizations": [], "uuid": "26b764ab4b888ca833b01bed576fcfa35a1692aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 633, "shares": 633, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/30/104977864-slack-imgs.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/light-on-trump-hotel-say-president-harassed-or-assaulted-twenty-women.html", "country": "US", "domain_rank": 767, "title": "Light on Trump hotel say president harassed or assaulted twenty women", "performance_score": 6, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.259, "site_type": "news", "published": "2018-01-31T03:42:00.000+02:00", "replies_count": 0, "uuid": "26b764ab4b888ca833b01bed576fcfa35a1692aa"}, "author": "Dan Mangan", "url": "https://www.cnbc.com/2018/01/30/light-on-trump-hotel-say-president-harassed-or-assaulted-twenty-women.html", "ord_in_thread": 0, "title": "Light on Trump hotel say president harassed or assaulted twenty women", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "neutral"}, {"name": "donald trump", "sentiment": "neutral"}], "locations": [{"name": "trump", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}, {"name": "washington d.c.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "ultraviolet", "sentiment": "none"}, {"name": "trump international hotel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Activists on Tuesday night proclaimed that President \" Donald Trump harassed or assaulted twenty women\" in an illuminated message projected on Trump's Washington, D.C., hotel in advance of his State of the Union address.\n\"Congress: Investigate Trump,\" another projection on the Trump International Hotel demanded.\nThe activist group UltraViolet took credit for the stunt, which came hours before Trump was due to address Congress nearby in his first State of the Union speech.\nIn a Twitter post noting the images on the downtown hotel, UltraViolet said: \"Investigate Trump for sexual assault.\"\nTweet\nUltraViolet says its mission is to \"fight sexism and create a more inclusive world that accurately represents all women.\"\nThe Trump International two weeks ago was hit with another illuminated projection, of the word \"s---hole,\" and a scatological emoji after news broke that Trump had used that term about certain countries during a discussion with members of Congress about immigration. A group other than UltraViolet projected those images.\nCNN reported Saturday that data showed that the occupancy rate of the Trump International Hotel in its first 11 months of operation was an average of only 50 percent, about one-third below the rate of other luxury hotels in Washington.\nSource: UltraViolet | Twitter A group is projecting messages outside the Trump International Hotel in Washington D.C. ahead of the State of the Union tonight. Karin Roland, a campaign director for UltraViolet, told the New York Daily News that: \"Trump remains accused of sexual harassment or assault from more than twenty women. This is a national shame.\"\n\"It is impossible for us to tackle the nation's sexual assault and harassment epidemic when the man who occupies our highest office is facing no accountability for the scores of sexual abuse accusations mounted against him,\" Roland said.\nMultiple women have accused Trump of sexual misconduct . The president has denied the allegations.\nBut on a videotape recorded by the TV show \"Access Hollywood\" in 2005 , Trump can be heard boasting to then-correspondent Billy Bush, using lewd language about trying to seduce a married woman, and also is heard talking about kissing and groping women without their consent.\n\"I just start kissing them. It's like a magnet. Just kiss. I don't even wait. And when you're a star, they let you do it. You can do anything,\" Trump said at the time. \"Grab 'em by the p----. You can do anything.\"", "external_links": [], "published": "2018-01-31T03:42:00.000+02:00", "crawled": "2018-01-31T03:42:05.008+02:00", "highlightTitle": ""}