{"organizations": [], "uuid": "59b41978eb4ac906b6d6919051cd3767fa4e6103", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220268163&w=1200&r=LYNXMPEE070SJ", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-olympics-2018-nors-brothers/kobayashi-brothers-primed-to-put-japan-on-ski-jump-podium-idUKKBN1EX18U", "country": "US", "domain_rank": 408, "title": "Kobayashi brothers primed to put Japan on ski jump podium", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T15:19:00.000+02:00", "replies_count": 0, "uuid": "59b41978eb4ac906b6d6919051cd3767fa4e6103"}, "author": "", "url": "https://uk.reuters.com/article/uk-olympics-2018-nors-brothers/kobayashi-brothers-primed-to-put-japan-on-ski-jump-podium-idUKKBN1EX18U", "ord_in_thread": 0, "title": "Kobayashi brothers primed to put Japan on ski jump podium", "locations": [], "entities": {"persons": [{"name": "philip o'co", "sentiment": "negative"}, {"name": "kobayashi", "sentiment": "negative"}, {"name": "junshiro", "sentiment": "none"}, {"name": "ryoyu kobayashi", "sentiment": "none"}, {"name": "ryoyu", "sentiment": "none"}], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "bischofshofen", "sentiment": "none"}, {"name": "austria", "sentiment": "none"}, {"name": "sapporo", "sentiment": "none"}, {"name": "hakuba", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}], "organizations": [{"name": "min read  stockholm", "sentiment": "none"}, {"name": "asian tv", "sentiment": "none"}, {"name": "fis", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 1:24 PM / Updated an hour ago Kobayashi brothers primed to put Japan on ski jump podium Philip O'Connor 3 Min Read \nSTOCKHOLM (Reuters) - With the Pyeongchang Olympics taking place during prime time for Asian TV, Japanese ski jumping brothers Junshiro and Ryoyu Kobayashi have the chance of a lifetime to showcase their skills to their home audience and share a spot on the podium. FILE PHOTO: Junshiro Kobayashi of Japan soars through the air during his jump in the men's large hill team ski jumping final at the Nordic World Ski Championships in Falun February 28, 2015. REUTERS/Kai Pfaffenbach/File photo \nOf the two, older brother Junshiro has the best chance, but as the Japanese showed when winning gold, silver and bronze in the normal hill competition at Sapporo in 1972, they are always capable of pulling off a surprise. \nThe Kobayashi brothers laid down a promising marker for the Olympic season to come back in August, with 26-year-old Junshiro finishing first and Ryoyu, who is five years younger, second at the FIS Grand Prix in Hakuba, Japan. \n“It’s great that my brother is on the podium with me,” Junshiro said after his victory. “We are both very happy now. Our goal is to be on the Olympic team together and that’s what we are working for.” \nJunshiro took a further leap into the public consciousness by notching his first World Cup win back in November, eclipsing double Olympic champion Kamil Stoch in Wisla, Poland for his first podium finish in six years. \n“The Japanese are strong and getting better and better, they have some younger guys who are very good right now,” former Olympic champion and Eurosport ski jumping expert Martin Schmitt told Reuters. FILE PHOTO: FIS Nordic Ski World Championships - Men's Ski Jumping - Large Hill Team - Lahti, Finland - 4/3/17 - Ryoyu Kobayashi from Japan prepares. REUTERS/Kai Pfaffenbach/File photo \n“The Kobayashis are young, but they are not that young - in Japan the guys often come up at the age of 24, 25 but it isn’t that young. It’s a bit like that with the Kobayashis, especially Junshiro.” \nThe sibling rivalry aside, both brothers will face strong opposition from Germany, Austria, Poland and Norway in Pyeongchang. \n“I think it’s going to be very exciting, a tough race for the medals between many jumpers for both the individual and the team events. It’s a close race,” Schmitt said. \nThe 39-year-old German, who also won silver in the large hill team event at Nagano in 1998 and Vancouver in 2010, believes that Junshiro has what it takes to make it to the podium. \n“He’s already won a World Cup (event) this season, he’s a good guy and might even be able to win a gold in Pyeongchang.” \nFor Ryoyu, who is well outside the top 10 in the world rankings, making the podium will be tougher. \n“He is also capable, but it’s not easy if you have a brother that you are fighting against. There can be a lot of pressure to fight against the brother, if the brother in the same sport is more successful, it’s really tough,” Schmitt explained. Reporting by Philip O'Connor; Editing by Amlan Chakraborty", "external_links": [], "published": "2018-01-08T15:19:00.000+02:00", "crawled": "2018-01-08T15:41:32.047+02:00", "highlightTitle": ""}