{"organizations": [], "uuid": "c631da926b7056288109f514c2a49cd85ab38fb8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 25}, "facebook": {"likes": 75, "shares": 75, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/10/104938927-GettyImages-515730060.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/10/iman-shumpert-automates-his-finances-and-saves-half-his-income.html", "country": "US", "domain_rank": 767, "title": "Iman Shumpert automates his finances and saves half his income", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-10T22:29:00.000+02:00", "replies_count": 0, "uuid": "c631da926b7056288109f514c2a49cd85ab38fb8"}, "author": "Kathleen Elkins", "url": "https://www.cnbc.com/2018/01/10/iman-shumpert-automates-his-finances-and-saves-half-his-income.html", "ord_in_thread": 0, "title": "Iman Shumpert automates his finances and saves half his income", "locations": [], "entities": {"persons": [{"name": "iman shumpert", "sentiment": "negative"}, {"name": "shumpert", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cleveland cavaliers", "sentiment": "negative"}, {"name": "nba", "sentiment": "none"}, {"name": "new york knicks", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Iman Shumpert of the Cleveland Cavaliers SHARES \nWhen Iman Shumpert signed a four-year, $7.5 million contract with the New York Knicks in 2011, the rookie didn't go on a spending spree. \nIn fact, \"the schedule was so crazy I just didn't have time to spend the money I was making,\" he says in an interview with Wealthsimple . \nToday, the the NBA star earns an average of $10 million a year with the Cleveland Cavaliers, but his spending habits haven't changed much. It helps that his team as a whole \"isn't big on expensive stuff,\" he says. \"For as much money as we make, we're all pretty cheap. We split the bill at dinner. We're smart about our coins, man.\" \nShumpert has been following one money rule throughout his entire career, he says: \"Since I entered the league, half of my checks have always gone into a separate account. … I pride myself on doing that. I've done it no matter the size of my contract or salary.\" \nOne simple strategy helps him stick to the rule: He's made saving automatic. show chapters 10:36 AM ET Tue, 17 Oct 2017 | 00:57 \n\"That money — I don't even see it. It's put into investments,\" says Shumpert. \nAutomating your finances is a simple yet highly effective money-saving strategy that almost anyone can use. Besides sending your money straight from your paycheck to an investment account like Shumpert does, you can also send your money straight to a retirement savings account, emergency fund or to creditors. \nMaking everything automatic allows you to build wealth effortlessly, says self-made millionaire and personal finance expert David Bach. \"You'll never forget a payment again — and you'll never be tempted to skimp on savings because you won't even see the money going directly from your paycheck to your savings accounts,\" he writes in \" The Automatic Millionaire \" \nPlus, you'll save time and simplify your life, says self-made millionaire Chris Reining , who reached the $1 million mark at age 35, thanks to automating his finances: \"I automated my money years ago, and the benefit is I don't have to make decisions about where my money should go, how much I should invest, what I can spend, do I have enough savings, and so on.\" \nThat's how Shumpert feels. \"Because of what I've saved I don't really have a lot of worries about money,\" he says, adding, \"The funny thing is that now that I can be way more flexible with what I'll buy, I've found I don't really need much.\" ", "external_links": [], "published": "2018-01-10T22:29:00.000+02:00", "crawled": "2018-01-11T04:37:44.008+02:00", "highlightTitle": ""}