{"organizations": [], "uuid": "3bb2dfee08ded3c4ca296b48aa266a85a1f6c1d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219295661&w=1200&r=LYNXMPEE030M9", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews/", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-china-cambodia/china-believes-cambodias-election-will-be-fair-confirms-support-idUKKBN1ET16G", "country": "US", "domain_rank": 408, "title": "China believes Cambodia's election will be fair, confirms support", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T13:19:00.000+02:00", "replies_count": 0, "uuid": "3bb2dfee08ded3c4ca296b48aa266a85a1f6c1d0"}, "author": "", "url": "https://uk.reuters.com/article/uk-china-cambodia/china-believes-cambodias-election-will-be-fair-confirms-support-idUKKBN1ET16G", "ord_in_thread": 0, "title": "China believes Cambodia's election will be fair, confirms support", "locations": [], "entities": {"persons": [{"name": "hun sen", "sentiment": "none"}], "locations": [{"name": "cambodia", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "pring  china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "angkor wat", "sentiment": "none"}, {"name": "siem reap province", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 22 AM / Updated 23 minutes ago China believes Cambodia's election will be fair, confirms support Reuters Staff 3 Min Read \nBEIJING (Reuters) - China believes a general election in Cambodia this year will be fair, a senior Chinese official said on Thursday, after the United States and the European Union withdrew support for the vote following the dissolution of the main opposition party. FILE PHOTO - Cambodia's Prime Minister Hun Sen greets as he holds a ceremony at the Angkor Wat temple to pray for peace and stability in Cambodia, in Siem Reap province, Cambodia December 3, 2017. REUTERS/Samrang Pring \nChina is Cambodia’s biggest aid donor and its backing has bolstered its veteran prime minister, Hun Sen, in the face of criticism of over what his opponents say amounts to his destruction of democracy. \n“China respects and supports the development path chosen by the Cambodian people, and believes Cambodia’s future election can, under all sides’ supervision, reflect its fairness and select a party and leader that satisfies the Cambodian people,” Chinese Vice Foreign Minister Kong Xuanyou said. \nKong told a briefing, ahead of a visit by Premier Li Keqiang to Cambodia, that China had offered election support, but did not specify what kind. \nCambodia has said China will provide various equipment for the July election, including ballot boxes and booths. \nThe United States and EU cancelled their planned support following a Cambodian court’s dissolution of the opposition Cambodia National Rescue Party (CNRP) in November at the government’s request. \nKong said China was Cambodia’s largest source of foreign investment, its largest trade partner, and its largest source of foreign tourists. \nLi will visit Cambodia on Jan. 10-11, and attend a regional forum there of leaders from six countries, including Laos, Myanmar, Thailand and Vietnam. \nCambodia and China have become increasingly close as a Cambodian government crackdown on its critics, civil society groups and independent media has drawn criticism from Western governments and human rights groups. \nCritics called the ban on the CNRP an attempt to steal the election and the death knell for democracy in a country where Western donors have spent billions of dollars since 1993 trying to build a multiparty system after decades of war. \nHun Sen, whose rule of more than 30 years was under threat from the opposition at the election, has said he will stay in power for at least another decade. \nChina’s President Xi Jinping has vowed that China will not export its political system but it has expanded the reach of its foreign policy and military under Xi. \nHun Sen was among leaders who spoke at a forum of international political parties hosted by Xi and China’s ruling Communist Party in Beijing in December. Reporting by Michael Martina; Editing by Robert Birsel", "external_links": [], "published": "2018-01-04T13:19:00.000+02:00", "crawled": "2018-01-04T13:33:42.006+02:00", "highlightTitle": ""}