{"organizations": [], "uuid": "0d6740f745ef58eac4c500ce93e1487a1d7af0c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/10/reuters-america-exclusive-u-s-justice-department-blindsided-banking-agency-on-pot-policy-flip-sources.html", "country": "US", "domain_rank": 767, "title": "EXCLUSIVE-U.S. Justice Department blindsided banking agency on pot policy flip -sources", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T00:44:00.000+02:00", "replies_count": 0, "uuid": "0d6740f745ef58eac4c500ce93e1487a1d7af0c9"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/10/reuters-america-exclusive-u-s-justice-department-blindsided-banking-agency-on-pot-policy-flip-sources.html", "ord_in_thread": 0, "title": "EXCLUSIVE-U.S. Justice Department blindsided banking agency on pot policy flip -sources", "locations": [], "entities": {"persons": [{"name": "jeff sessions", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "exclusive-u.s. justice department", "sentiment": "negative"}, {"name": "u.s. justice department", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "justice department", "sentiment": "none"}, {"name": "financial crimes enforcement network", "sentiment": "none"}, {"name": "fincen", "sentiment": "none"}, {"name": "u.s. treasury department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "flip -sources@\nWASHINGTON, Jan 10 (Reuters) - When the U.S. Justice Department said last week it was reversing policy on the $7 billion marijuana business, it failed to first notify federal officials who advise banks in states where the drug is legal, sources in Congress said.\nThe announcement by U.S. Attorney General Jeff Sessions, a longtime critic of legalizing marijuana, caused confusion among banks about how to do business with marijuana growers, processors and distributors without running afoul of federal money laundering laws.\nThe uncertainty unleashed a flood of phone calls to the Financial Crimes Enforcement Network (FinCEN), an office within the U.S. Treasury Department, from congressional offices with questions from lawmakers and constituents.\nBut FinCEN had no ready answers because it received no advance warning of Sessions' Jan. 4 announcement rescinding an Obama-era policy that had eased up on federal enforcement of marijuana laws, said congressional aides who spoke on condition of anonymity.\nA Justice Department spokesman declined to comment about whether it had coordinated with FinCEN in advance.\nThe abrupt announcement by Sessions was the latest example of sudden actions by the Trump administration that have blind-sided its own government agencies on major policy shifts. In 2017 the administration blindsided the Defense Department with a decision to ban transgender Americans from serving in the military. It also took many by surprise at the Department of Homeland Security by barring people from some predominantly Muslim countries from entering the United States.\nMarijuana is banned by federal law but it has become legal in one form or another in a number of states.\nAbout 400 banks and credit unions do business with the U.S. marijuana industry. Most are small institutions with operations limited to states where marijuana has been legalized.\nCritics said the Justice Department's decision, which gives prosecutors wide latitude to pursue criminal charges, could drive banks out of the cannabis industry.\nSessions issued his one-page announcement three days after California formally launched the world's largest regulated commercial market for recreational marijuana. Five other states have legalized recreational use, while dozens permit medicinal use.\n\"I imagine that Sessions did not even contemplate that his action could trigger potentially billions of dollars of cash from being unbanked,\" said Saphira Galoob, whose firm The Liaison Group lobbies on behalf of cannabis clients.\nReversing the Obama administration, Sessions said the Justice Department was withdrawing legal guidelines known as the Cole and Ogden memos, widely seen as giving safe harbor against prosecution to cannabis businesses in states where pot is legal.\nThe memos said that, while marijuana was still illegal, prosecutors would not prioritize pursuing criminal charges in states that had set up their own regulatory regimes.\nDeputy Attorney General Rod Rosenstein said in September that the marijuana policy was under review for possible changes.\nIn last week's announcement, the Justice Department made no mention of parallel marijuana guidance that FinCEN issued in February 2014 in coordination with Justice officials.\nThe guidance provided a pathway for banks to serve marijuana businesses in states such as Oregon, Colorado, Washington and California. It relied heavily on the Cole memo.\nFinCEN requires banks to file suspicious activity reports with the government on legally questionable transactions. The FinCEN guidance says banks must continue to file those reports, but lets them say if they are confident that their cannabis customers are complying with relevant state laws.\nDemocratic Representatives Dennis Heck of Washington state and Ed Perlmutter of Colorado are expected this week to send a letter, seen by Reuters, to FinCEN urging it not to rescind the guidance amid concerns that doing so could \"inject uncertainty in the financial markets.\"\nStephen Hudak, a FinCEN spokesman, said in a statement that the agency's guidance \"remains in place,\" despite the Justice Department's actions. (Reporting by Sarah N. Lynch; Editing by Kevin Drawbaugh and Grant McCool)", "external_links": [], "published": "2018-01-11T00:44:00.000+02:00", "crawled": "2018-01-11T03:56:03.028+02:00", "highlightTitle": ""}