{"organizations": [], "uuid": "3b596d6a0d763f140dd24332ece9183db193e380", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219530085&w=1200&r=LYNXMPEE040CX", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-china-debt-ncd/china-central-bank-issues-window-guidance-to-restrict-ncd-issuance-sources-idUSKBN1EU0L8", "country": "US", "domain_rank": 408, "title": "China c.bank issues window guidance to restrict NCD issuance - sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T08:53:00.000+02:00", "replies_count": 0, "uuid": "3b596d6a0d763f140dd24332ece9183db193e380"}, "author": "", "url": "https://www.reuters.com/article/us-china-debt-ncd/china-central-bank-issues-window-guidance-to-restrict-ncd-issuance-sources-idUSKBN1EU0L8", "ord_in_thread": 0, "title": "China c.bank issues window guidance to restrict NCD issuance - sources", "locations": [], "entities": {"persons": [{"name": "samuel shen", "sentiment": "none"}, {"name": "john ruwitch", "sentiment": "none"}, {"name": "sam holmes", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}], "organizations": [{"name": "pboc", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "people’s bank of china", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHANGHAI (Reuters) - China’s central bank has moved to restrict the issuance of negotiable certificates of deposit (NCDs) this year, two sources with knowledge of the matter said on Friday, as the government intensifies its campaign to reduce borrowing risks.\nThe People’s Bank of China (PBOC) advised banks via so-called “window guidance” to follow a new formula that puts a cap on NCD issues during the year.\nBanks looking to issue NCDs in any given year must apply for permission from the PBOC around the start of the year, specifying a maximum amount, or annual quota, that sets the limit on the amount of issued NCDs they can have outstanding.\nBanks have been told their applications for 2018 quotas would be rejected if their interbank borrowings plus the requested amount of NCD quotas exceeded one-third of its total liabilities, the sources said.\nNCD issuance has exploded in recent years as lenders, especially small ones, use this once loosely-regulated short-term debt instrument to fund longer-term investments, often through shadow banking. Outstanding NCDs exceeded 8 trillion yuan last year, compared with around 3 trillion yuan at the end of 2015, according to Soochow Securities.\nNCDs are issued by banks and traded between financial institutions in the interbank market. China opened its NCD market in 2013 as a means to help liberalize the country’s interest rate market.\nAlthough China has already tightened scrutiny on NCDs since then - the central bank will include them in its quarterly risk assessments this year targeting banks with assets of more than 500 billion yuan ($77.06 billion) - the new instructions point to a harsher stance as they now appear to target all banks.\n“The PBOC gave us guidance to follow the formula,” said an official at a rural commercial lender with assets below 500 billion yuan. “If you don’t follow, the annual issuance quota won’t get approved.”\nWindow guidance refers to informal instructions from regulators that are often communicated orally with no written notice.\nThe PBOC did not immediately respond to a Reuters request for comment on the matter.\nThe latest restrictions could force smaller lenders that are heavily reliant on NCD funding to shrink their balance sheets and liquidate some of their investments, which could be potentially negative to asset prices.\nThe impact of the latest measures targeting NCDs is already being seen in small banks’ fundraising plans.\nAccording a central bank website that tracks interbank data, Bank of Jilin has slashed its NCD issuance quotas by a third to 79 billion yuan this year. Bank of Guangzhou has cut its NCD quotas by a quarter, while the target by Bank of Suzhou slumped by 41 percent.\nReporting by Samuel Shen and John Ruwitch; Editing by Sam Holmes\n ", "external_links": [], "published": "2018-01-05T08:53:00.000+02:00", "crawled": "2018-01-05T09:22:05.017+02:00", "highlightTitle": ""}