{"organizations": [], "uuid": "4b8133e744e93f2a41423ab1de87dcb55318ece0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180110.html", "section_title": "Archive News &amp; Video for Wednesday, 10 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-kenya-labour-trafficking/fears-of-fresh-abuse-of-migrants-in-middle-east-as-kenya-set-to-lift-ban-idUSKBN1EZ0HS", "country": "US", "domain_rank": 408, "title": "Fears of fresh abuse of migrants in Middle East as Kenya set to lift ban", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-10T14:46:00.000+02:00", "replies_count": 0, "uuid": "4b8133e744e93f2a41423ab1de87dcb55318ece0"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-kenya-labour-trafficking/fears-of-fresh-abuse-of-migrants-in-middle-east-as-kenya-set-to-lift-ban-idUSKBN1EZ0HS", "ord_in_thread": 0, "title": "Fears of fresh abuse of migrants in Middle East as Kenya set to lift ban", "locations": [], "entities": {"persons": [{"name": "wairimu", "sentiment": "none"}], "locations": [{"name": "middle east", "sentiment": "none"}, {"name": "kenya", "sentiment": "none"}, {"name": "doha", "sentiment": "none"}, {"name": "qatar", "sentiment": "none"}, {"name": "gulf", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "nairobi", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NAIROBI (Thomson Reuters Foundation) - Working as a tutor for three children from a wealthy family in Qatar, Kenyan migrant Wairimu did not suspect that her employer’s offer to take her for a medical check up was a ploy to confiscate her passport.\nThree months later, she is trapped as she has yet to muster up the courage to ask her to return the document so that she can quit her job.\n“I came here to be a tutor ... but my boss wants me to do housework and still help the children ... It is too much work,” she told the Thomson Reuters Foundation by phone from Doha.\n“Without a passport, I can neither get another job nor travel back home ... (My employer) has also become hostile and rude to me and it is hard for me to approach her.”\nKenya plans to lift a ban on its citizens working in the Gulf - introduced in 2014 because of abuses - with new safeguards, such as requiring recruitment agencies to pay a security bond so they can repatriate any distressed migrants.\nBut experts fear that the new rules will not protect them amid corruption, greed and desperation for a better life.\nLured by the promise of well-paid work and a chance to escape joblessness at home, hundreds of thousands of Kenyans are thought to be employed in the Middle East, sending much-needed remittances to their families every year.\nDomestic workers are often kept under lock and key by their employer, forced to work more than 18 hours a day, deprived of food and wages and physically and sexually abused, activists say.\nVisa-sponsorship rules in Qatar, known as the kafala system - used in several Gulf Arab countries - mean migrant workers like Wairimu cannot change jobs without their employer’s consent and can be charged with absconding if they flee.\nRIGHT DIRECTION Kenya signed bilateral labor agreements with Qatar and Saudi Arabia in November, pledging the security of Kenyan migrant workers in the two states, and issued licenses to 29 recruitment agencies in Kenya.\nAll agencies had lost their licenses in the 2014 crackdown.\nRights groups praised the move.\n“It is a step in the right direction as it indicates a serious commitment by Saudi to enforce and protect the human and labor rights of Kenyans working in the country,” said Jacqueline Munyaka, a Nairobi-based lawyer and labor expert.\nRegistered agencies must have a physical office and submit quarterly reports to the government on their overseas migrants, labor minister Phyllis Kandie said while unveiling the names of the newly accredited agencies.\nShe said the agencies also have to pay a security bond of 500,000 to 1.5 million Kenya shillings ($4,852 to $14,556) for the government to repatriate workers in emergencies.\n“The ministry (of labor) is helping us understand the new regulations and why it is important that we observe them,” said Suzan Ngosho, who works for Derimel Recruiting Agency, one of the licensed firms.\nSLAVERY But further measures are needed to protect migrants, said Rothna Begum, a women’s rights researcher at Human Rights Watch.\n“The authorities must set out more protections, including ensuring rights-based pre-departure training in which they are taught their rights and where to access help and language skills to help them communicate,” she said.\n“Kenya should also ensure that their embassies provide shelter to fleeing domestic workers so they are not forced to remain with abusive employers.”\nAnother good idea would be to introduce standard contracts with Middle Eastern countries, including a minimum wage, and guarantees that the host country will inform Kenyan embassies when its workers seek help or have been arrested, she said.\nOthers fear the problem runs much deeper as slavery is permitted by Islamic law, with Saudi Arabia’s king only abolishing it in 1962.\n“If you are signing deals with governments that have very recently been involved in forms of slavery, it is hard to get leadership and responsibility from them,” said George Kegoro, head of Kenya Human Rights Commission, a lobby group.\n“This is the problem of culture; these countries have a history of slavery. The mistreatment you hear about migrant workers in these states is an offshoot of the culture. This will be hard to change.”\nFor Wairimu, the solution is closer to home.\n“My hope is that the government will create job opportunities so that we can come back home - because our security can never be guaranteed as long as we are in a stranger’s house,” she said.\nReporting by Annie Mang'era. Editing by Katy Migiro. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women’s rights, trafficking, property rights, climate change and resilience. Visit news.trust.org to see more stories.\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-10T14:46:00.000+02:00", "crawled": "2018-01-11T12:21:40.003+02:00", "highlightTitle": ""}