{"organizations": [], "uuid": "0bb98f784a75aaca490c524ee627d1417643994b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220663465&w=1200&r=LYNXMPEE081NK", "site_section": "http://feeds.reuters.com/reuters/UKTopNews/", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-myanmar-journalists/two-reuters-reporters-due-in-court-in-myanmar-idUKKBN1EY2RZ", "country": "US", "domain_rank": 408, "title": "Two Reuters reporters due in court in Myanmar", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T01:05:00.000+02:00", "replies_count": 0, "uuid": "0bb98f784a75aaca490c524ee627d1417643994b"}, "author": "", "url": "https://uk.reuters.com/article/uk-myanmar-journalists/two-reuters-reporters-due-in-court-in-myanmar-idUKKBN1EY2RZ", "ord_in_thread": 0, "title": "Two Reuters reporters due in court in Myanmar", "locations": [], "entities": {"persons": [{"name": "myanmar reu", "sentiment": "negative"}, {"name": "kyaw soe oo", "sentiment": "none"}], "locations": [{"name": "myanmar", "sentiment": "none"}, {"name": "yangon", "sentiment": "none"}, {"name": "rakhine", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "two reuters", "sentiment": "negative"}, {"name": "min read  yangon", "sentiment": "none"}, {"name": "rakhine state", "sentiment": "none"}, {"name": "u.n.", "sentiment": "none"}, {"name": "ministry of information", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 9, 2018 / 11:06 PM / Updated 7 hours ago Myanmar prosecutor seeks Official Secrets Act charges against two Reuters reporters Antoni Slodkowski , Simon Lewis 6 Min Read \nYANGON (Reuters) - Myanmar prosecutors sought charges on Wednesday against two Reuters reporters under the Official Secrets Act, which carries a maximum prison sentence of 14 years, the reporters’ lawyer said. \nWa Lone, 31, and Kyaw Soe Oo, 27, were detained on Dec. 12 after they had been invited to meet police officers over dinner. Family members have said the two told them they were arrested almost immediately after being handed some documents by the officers they had gone to meet. \nThe two had worked on Reuters coverage of a crisis in the western state of Rakhine, where - according to U.N. estimates - about 655,000 Rohingya Muslims have fled from a fierce military crackdown on militants. \n“They arrested us and took action against us because we were trying to reveal the truth,” Wa Lone told reporters as he and Kyaw Soe Oo were led out of the court and back to Yangon’s Insein prison after the 30-minute hearing. \nKhin Maung Zaw, a lawyer representing the two journalists, said the charges being sought came under Section 3.1 (c) of the British colonial-era Official Secrets Act. \nThe act dates back to 1923, when Myanmar, then known as Burma, was a province of British India. \nSection 3 covers entering prohibited places, taking images or handling secret official documents that “might be or is intended to be, directly or indirectly, useful to an enemy”. \nThe Ministry of Information had previously cited police as saying they were “arrested for possessing important and secret government documents related to Rakhine State and security forces”. The ministry has said they “illegally acquired information with the intention to share it with foreign media”. \nThe prosecutor objected to an application for bail, the reporters’ lawyer, Khin Maung Zaw, said. The court took it under consideration and will decide at the next hearing on Jan. 23, he said. \nThe government has said two police officers were also arrested for investigation under suspicion of having violated the Official Secrets Act. It has given no further information on the police arrested. \nAbout 30 journalists were outside the court, most dressed in black as a sign of protest against the arrest of the pair. Several had the message “journalism is not a crime” or “release the arrested journalists now” on their T-shirts. HANDCUFFED \nIn the court, Kyaw Soe Oo embraced his wife and held his daughter for a couple of minutes. His daughter began to weep as he was escorted away and he had to hand her back to other family members. \nWa Lone’s wife gave him a few small pieces of cake that she had brought. \n”I am trying to be strong in everything. I never made any mistake; I never did anything wrong,” Wa Lone said before leaving the court. \nThe two journalists arrived and left court in handcuffs. \n(Click tmsnrt.rs/2BHDUx8 for profiles of the two) Reuters journalist Wa Lone arrives at the court in Yangon, Myanmar January 10, 2018. REUTERS/Stringer NO RESALES NO ARCHIVES \nDistraught relatives of Kyaw Soe Oo wailed and reached out to grasp him as the two journalists were driven away from a throng of reporters after the hearing. \nReuters President and Editor-In-Chief Stephen J. Adler said he was extremely disappointed that the authorities were seeking to prosecute the pair. \n“We view this as a wholly unwarranted, blatant attack on press freedom. Our colleagues should be allowed to return to their jobs reporting on events in Myanmar. We believe time is of the essence and we continue to call for Wa Lone and Kyaw Soe Oo’s prompt release,” he said. \nGovernment spokesman Zaw Htay declined to comment on the charges but said the two had their rights under an independent judicial system. \n“The judge will be decide whether they are guilty or not according to the law,” he told Reuters. \nA spokesman for the military was not available for comment. Slideshow (9 Images) \nU.S. IS ‘VERY DISAPPOINTED’ \nGovernment officials from some of the world’s major nations, including the United States, Britain and Canada, as well as top United Nations officials, have called for the release of the reporters. \nObservers from the United Nations and from several embassies, including the Netherlands, Australia and Britain were at the court. \nThe U.S. embassy said it was “very disappointed” by the decision to pursue charges. \n“For democracy to succeed and flourish, journalists must be able to do their jobs. We call for their immediate release,” it said in a statement. \nThe French foreign ministry called in a statement for the journalists’ immediate release and for the free access of media to Rakhine State. Authorities have largely banned media from the conflict zone. \nFormer U.S. President Bill Clinton has urged that they be freed immediately, saying on Twitter on Monday that a free press was critical for a free society and the detention of journalists anywhere was unacceptable. \nClinton was U.S. president for much of the 1990s when the United States pressed Myanmar’s then military rulers to release democracy champion Aung San Suu Kyi from years of house arrest. \nJapan wants to raise the matter of the two reporters with the Myanmar government at appropriate opportunities, including a visit by Japanese Foreign Minister Taro Kono this week, Japan’s Chief Cabinet Secretary Yoshihide Suga said in Tokyo. \nPhil Robertson of the group Human Rights Watch said that ”if Aung San Suu Kyi and her government really cared about democratic reforms and governance, they could use their parliamentary majority to quickly reform this antiquated colonial law and bring it into compliance with international human rights standards.” \nSuu Kyi won a 2015 election and formed Myanmar’s first civilian government in more than half a century in early 2016, although she is barred by the constitution from becoming president. \nShe has made no public comment on the detention of the two Reuters reporters. The government has denied that their arrests represent an attack on press freedom. Additonal reporting by Yimou Lee, Soon Nang and Thu Tu Aung, Kiyoshi Takenaka in TOKYO, and John Irish in PARIS; Writing by Robert Birsel; Editing by Martin Howell", "external_links": [], "published": "2018-01-10T01:05:00.000+02:00", "crawled": "2018-01-10T01:14:17.030+02:00", "highlightTitle": ""}