{"organizations": [], "uuid": "94b7e27148b6542d695c724099289ed1a0cfc6da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180127&t=2&i=1225806025&w=1200&r=LYNXMPEE0Q0L4", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/trade-nafta/canada-hopeful-nafta-talks-can-continue-sees-some-progress-idINKBN1FG0QP", "country": "US", "domain_rank": 408, "title": "Canada hopeful NAFTA talks can continue, sees some progress", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T18:18:00.000+02:00", "replies_count": 0, "uuid": "94b7e27148b6542d695c724099289ed1a0cfc6da"}, "author": "", "url": "https://in.reuters.com/article/trade-nafta/canada-hopeful-nafta-talks-can-continue-sees-some-progress-idINKBN1FG0QP", "ord_in_thread": 0, "title": "Canada hopeful NAFTA talks can continue, sees some progress", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "steve verheul", "sentiment": "none"}, {"name": "david ljunggren", "sentiment": "none"}, {"name": "chrystia freeland", "sentiment": "none"}, {"name": "ildefonso guajardo", "sentiment": "none"}, {"name": "robert lighthizer", "sentiment": "none"}, {"name": "verheul", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}], "organizations": [{"name": "nafta", "sentiment": "positive"}, {"name": "min read  montreal", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 27, 2018 / 4:22 PM / Updated 2 hours ago Canada hopeful NAFTA talks can continue, sees some progress David Ljunggren 3 Min Read \nMONTREAL (Reuters) - Officials trying to hammer out differences over how to update the North American Free Trade Agreement have made some progress and hope politicians decide the process should continue, Steve Verheul, Canada’s chief negotiator, told Reuters on Saturday. \nThe United States, Canada and Mexico are due to finish the sixth of seven planned rounds of NAFTA talks on Monday, with several major issues far from being resolved. \nU.S. Trade Representative Robert Lighthizer, Canadian Foreign Minister Chrystia Freeland and Mexican Economy Minister Ildefonso Guajardo will hold a news conference later that day to announce the next steps. \nAsked whether he thought the three ministers would decide there is enough momentum to continue with the next round, Verheul said: “Well, that’s our hope.” \nU.S. President Donald Trump, who describes the $1.2 trillion pact as a disaster, has frequently threatened to walk away from it unless major changes are made. \nCanada and Mexico initially dismissed some of the main U.S. demands as unworkable but later made it clear they were ready to be more flexible. \nDuring the sixth round, Canada raised what it called creative ways of meeting U.S. demands for higher North American content in autos and a sunset clause that would allow one party to quit the treaty after five years. \n“I think we have demonstrated we have engaged on most of the big issues,” Verheul said. “We’ve made progress on some of the smaller ones, so I think (it was) not a bad week.” \nSpeaking separately, a Canadian government source said Ottawa was cautiously optimistic about the round, given that the U.S. side had not summarily rejected the proposals for compromise. \nBut the source, who requested anonymity because of the sensitivity of the situation, said much would depend on Lighthizer’s reaction on Monday. \nThe talks were initially scheduled to wrap up by the end of March to avoid clashing with Mexico’s presidential election in July. Guajardo told Reuters on Friday that the process could be extended if need be. \nAndres Manuel Lopez Obrador, the leftist front-runner in the presidential race, said on Friday that the renegotiation should wait until after the election so that the next government he aims to lead would get a say in the treaty’s future. Reporting by David Ljunggren; Editing by Lisa Von Ahn", "external_links": [], "published": "2018-01-27T18:18:00.000+02:00", "crawled": "2018-01-27T18:44:58.007+02:00", "highlightTitle": ""}