{"organizations": [], "uuid": "4d9a65ae5e5aeacfc9f6b433a254fa1d47dad910", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-frisco-dermatology-laser-surgery-center-joins-epiphany-dermatology.html", "country": "US", "domain_rank": 767, "title": "Frisco Dermatology Laser & Surgery Center Joins Epiphany Dermatology", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-03T19:12:00.000+02:00", "replies_count": 0, "uuid": "4d9a65ae5e5aeacfc9f6b433a254fa1d47dad910"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-frisco-dermatology-laser-surgery-center-joins-epiphany-dermatology.html", "ord_in_thread": 0, "title": "Frisco Dermatology Laser & Surgery Center Joins Epiphany Dermatology", "locations": [], "entities": {"persons": [{"name": "lucy li", "sentiment": "none"}, {"name": "frisco derm", "sentiment": "none"}, {"name": "li", "sentiment": "none"}], "locations": [{"name": "austin", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "dallas/fort worth", "sentiment": "none"}], "organizations": [{"name": "frisco dermatology laser & surgery center", "sentiment": "negative"}, {"name": "pa", "sentiment": "none"}, {"name": "boston university", "sentiment": "none"}, {"name": "tufts university school of medicine", "sentiment": "none"}, {"name": "frisco derm", "sentiment": "none"}, {"name": "harvard university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AUSTIN, Texas, Jan. 3, 2018 /PRNewswire/ -- Epiphany Dermatology ( www.epiphanydermatology.com ) announced today it has expanded its presence in the Dallas/Fort Worth metroplex through its acquisition of Lucy Li, MD, PA d/b/a Frisco Dermatology Laser & Surgery Center (\"Frisco Derm\"). Epiphany Dermatology is comprised of leading dermatologists committed to improving access to exceptional dermatologic care.\nFounded in 2006 by Dr. Lucy Li, Frisco Derm has an excellent reputation of providing quality dermatology services to patients in the greater Dallas-Fort Worth market. Frisco Derm has expanded rapidly, and the practice now consists of two board-certified dermatologists and two physician assistants across its four clinics. Through this acquisition, Frisco Derm's dedicated providers and support staff have joined Epiphany in a partnership grounded in top-notch patient care.\nDr. Li, a board-certified dermatologist who graduated magna cum laude from Harvard University, earned an M.D. at Tufts University School of Medicine, and completed her dermatology residency at Boston University, commented, \"My staff and I are excited to form this partnership with Epiphany, which has proven itself to be a high-quality company comprised of caring dermatologists. Epiphany shares the values and goals that my staff and I believe in—providing excellent care across the entire spectrum of medical and cosmetic dermatologic needs. By forming this partnership with Epiphany, we will expand our ability to treat the skin diseases and skin cancers in our community. Epiphany has the infrastructure to help us manage the growing regulatory burdens that may otherwise interfere with our ability to focus on what matters most—taking care of our patients and serving our community.\"\nGheorghe Pusta, Chief Executive Officer of Epiphany, said, \"We are pleased to form this partnership with Dr. Li and her exceptional team of caring professionals from Frisco Derm. They are as committed as Epiphany is to clinical excellence. This is a great opportunity to expand our provider network and improve access to great dermatologic care in the Dallas-Fort Worth market, including Frisco, Denton, Coppell, and Saginaw. Furthermore, Dr. Li is a proven leader in the practice of dermatology and a tireless patient advocate. We are excited to have her join our team as we continue to build a special company.\"\nThrough this partnership, Frisco Derm's providers and staff gain additional resources to help with operations, managed care, marketing, compliance, human resources, recruiting, and many other support services.\nAbout Epiphany Dermatology\nEpiphany Dermatology is a rapidly expanding dermatology company, driven by a passion to improve access to high quality dermatologic care in a values-based manner. Through its partnership with leading dermatologists at 30 locations in Texas, New Mexico, Oklahoma, and Arizona, Epiphany provides general dermatology, skin cancer care, Mohs surgery, cosmetic services, and additional dermatologic services. Epiphany raises the standard of dermatology care by making clinical excellence accessible to all patients, promptly and in a warm and inviting environment. Epiphany Dermatology is headquartered in Austin, Texas. For more details, please visit www.epiphanydermatology.com or call (512) 628-0465.\nTed Emmert\nChief Development Officer\nEpiphany Dermatology\n(512) 628-0465\ntemmert@epiphanydermatology.com\nGheorghe Pusta\nChief Executive Officer\nEpiphany Dermatology\n(512) 628-0465\ngpusta@epiphanydermatology.com\nView original content: http://www.prnewswire.com/news-releases/frisco-dermatology-laser--surgery-center-joins-epiphany-dermatology-300577082.html\nSOURCE Epiphany Dermatology", "external_links": ["http://www.prnewswire.com/news-releases/frisco-dermatology-laser--surgery-center-joins-epiphany-dermatology-300577082.html", "http://www.epiphanydermatology.com/"], "published": "2018-01-03T19:12:00.000+02:00", "crawled": "2018-01-03T20:57:32.008+02:00", "highlightTitle": ""}