{"organizations": [], "uuid": "478673a86ab90f052df5a1c3b94c4168cc400f91", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/31/104979340-GettyImages-890725250.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/31/trump-solar-tariff-scores-a-big-win-commentary.html", "country": "US", "domain_rank": 767, "title": "Trump solar tariff scores a big win—Commentary", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-31T16:28:00.000+02:00", "replies_count": 0, "uuid": "478673a86ab90f052df5a1c3b94c4168cc400f91"}, "author": "Jake Novak", "url": "https://www.cnbc.com/2018/01/31/trump-solar-tariff-scores-a-big-win-commentary.html", "ord_in_thread": 0, "title": "Trump solar tariff scores a big win—Commentary", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}], "locations": [{"name": "jinko solar", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "huainan", "sentiment": "none"}, {"name": "anhui province of china", "sentiment": "none"}, {"name": "nihe town", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "jacksonville", "sentiment": "none"}], "organizations": [{"name": "vcg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Well that was fast.\nBarely one week after President Donald Trump announced a stiff 30 percent tariff on Chinese-made solar panels, a leading Chinese solar company announced plans to build a plant inside the United States.\nJinko Solar made the plant building announcement Monday. It's reportedly hoping to build that plant for about $410 million in Jacksonville, Florida , create 800 new American jobs, and thus avoid the new tariffs. Obviously, much of the detailed planning was done before the tariff announcement. But the company's official statement hinted that the final decision was tied to the new tariffs, saying that the company \"continues to closely monitor treatment of imports of solar cells and modules under the U.S. trade laws.\"\nSo this isn't going the way the naysayers said it was going to, at least for now. The tariff was supposed to kill tens of thousands of American jobs and reduce the number of solar panel installations by 11 percent or more. It could still happen, but Jinko's move and possible copycat moves by other foreign companies might change the equation.\nYou can't exactly blame those naysayers, a rare combination of anti-Trump liberals and pro-free trade conservatives. Tariffs have historically done little but raise prices for consumers and slow the spread of better goods, services, and especially technology.\nBut this quick capitulation by Jinko Solar is a sign that maybe this tariff and this particular trade issue are different than the norm.\nThe value of the solar industry in the U.S. has to be measured on many different economic platforms. The industry only brought in $210 million in total revenues last year. But energy experts also believe it generated a hefty $154 billion in national impact when you add up direct sales, wages, salaries, benefits, taxes and fees. And that's worth protecting.\nOne reason solar may be different when it comes to tariffs and trade wars is that the trade imbalance between the U.S. and China is so great that much of the worst damage to American solar companies has already been done. U.S.-based solar companies have been under pressure from cheaper Chinese imports for years.\nThe largest U.S.-based solar panel maker, SolarWorld, has cut more than half of its workers and its parent company declared bankruptcy last year. Even with massive government backing from the Obama administration, Solyndra failed . Elon Musk's SolarCity is still facing severe challenges. By last year, the U.S. solar industry had almost disappeared, with 25 companies closing since 2012.\nWith that kind of blood already on the floor, it's not surprising it's a Chinese company that's responding to the tariff by building in America. The U.S. companies are either already gone or too weak to expand right now. That means the only companies that can really boost solar jobs in the U.S. are foreign-owned.\nNow of course just this one company's decision doesn't mean this tariff won't do damage at some point, or that President Trump's entire \"fair trade\" approach will work. But this is a significantly positive result. Remember, the existing largest U.S.-based solar panel company has only 300 employees right now and Jinko Solar alone is now planning to bring 800 jobs to the U.S.\nSo the White House has two things it didn't have just over a week ago. First, it has proof that it means what it says when it threatens to slap tariffs on certain goods. No one can realistically ignore any threats in the future. That's an extremely valuable tool because from now on, the Trump administration may be able to get more favorable outcomes simply by threatening and not actually imposing any tariffs.\nSecond, the administration now has at least one very clear example that pulling the trigger on a tariff can work to change attitudes.\nThat approach wouldn't be without precedent. In 1983, President Ronald Reagan boosted the tariff on heavier motorcycles by a whopping 10 ten times more than it was previously. The move was seen at the time as a major psychological boost to the then-failing Harley-Davidson Motor Company, which began to show strong signs of recovering just four years later.\nToday, many economists insist it was the company's internal streamlining efforts that were the real reason Harley-Davidson survived and then thrived after the tariff went into effect.\nBut the vote of confidence Reagan gave Harley-Davidson was the major boost the executives, workers, and Harley enthusiasts needed.\nTrump's move isn't about boosting solar energy in America or even rebuilding the U.S. solar companies. It's all about jobs. He's talking about American jobs to be sure, but he's also made it clear he doesn't care if those jobs are created by foreign companies. Focusing on what the tariff will or won't do for America's remaining solar companies is all wrong. In 1983, Reagan triggered a tariff to help an American company save and create jobs. Now, Trump is using a tariff to help a foreign company create American jobs.\nThe U.S. solar industry may never be able to compete against Chinese imports, but U.S. workers might still reap the benefits of solar manufacturing either way. That is at least a possibility now.\nCommentary by Jake Novak, CNBC.com senior columnist. Follow him on Twitter @jakejakeny .\nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": [], "published": "2018-01-31T16:28:00.000+02:00", "crawled": "2018-01-31T16:28:00.012+02:00", "highlightTitle": ""}