{"organizations": [], "uuid": "990faffc4a493b12f0cdc751e6080dcf0d17f4ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-pacific-financial-corp-reports-6-percent-increase-in-fye-2017-net-income-achieves-record-non-gaap-earnings-growth-of-23.html", "country": "US", "domain_rank": 767, "title": "Pacific Financial Corp Reports 6% Increase in FYE 2017 Net Income; Achieves Record non-GAAP Earnings Growth of 23% to $8.1 Million for FYE 2017, Excluding $1.1 Million DTA Writedown", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T17:00:00.000+02:00", "replies_count": 0, "uuid": "990faffc4a493b12f0cdc751e6080dcf0d17f4ab"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-pacific-financial-corp-reports-6-percent-increase-in-fye-2017-net-income-achieves-record-non-gaap-earnings-growth-of-23.html", "ord_in_thread": 0, "title": "Pacific Financial Corp Reports 6% Increase in FYE 2017 Net Income; Achieves Record non-GAAP Earnings Growth of 23% to $8.1 Million for FYE 2017, Excluding $1.1 Million DTA Writedown", "locations": [], "entities": {"persons": [], "locations": [{"name": "aberdeen", "sentiment": "none"}, {"name": "wash.", "sentiment": "none"}], "organizations": [{"name": "bank of the pac", "sentiment": "neutral"}, {"name": "pacific financial corp", "sentiment": "neutral"}, {"name": "pacific financial corporation", "sentiment": "neutral"}, {"name": "dta", "sentiment": "none"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ABERDEEN, Wash.,\nPacific Financial Corporation (OTCQB:PFLC), the holding company for Bank of the Pacific today reported that following a write-down of its deferred tax asset resulting in an additional tax expense of $1.1 million, net income was $1.4 million, or $0.13 per diluted share, for the fourth quarter of 2017. Net income for the third quarter of 2017 was $2.2 million, or $0.20 per share, compared to $1.5 million, or $0.14 per share, for the fourth quarter of 2016. For the twelve months ended December 31, 2017, net income was $7.0 million, or $0.65 per diluted share, up 6% from $6.6 million, or $0.62 per share, for the twelve months ended December 31, 2016.\nExcluding a charge to income tax expense of $1.1 million resulting from the revaluation of the Company’s net DTA, as a result of the recently enacted tax legislation, net income (non-GAAP), increased 15% to a record $2.5 million, or $0.23 per diluted share, for the fourth quarter of 2017, compared to $2.2 million, or $0.20 per share for the third quarter of 2017. Also excluding the DTA writedown taken in the fourth quarter, net income increased 23% to a record $8.1 million, or $0.76 per diluted share, for the twelve months ended 2017, compared to $6.6 million, or $0.62 per share, for 2016. Fourth quarter and full year results for 2016 were impacted by charges related to a loss on the sale of other real estate owned (OREO), totaling $328,000, and a writedown taken to reduce the carrying value of a former branch property of $324,000. All results are unaudited.\n“We delivered record earnings for the fourth quarter and for the full year 2017, excluding the one-time additional tax expense associated with the DTA writedown. These solid results were driven by an improved net interest margin, strong net interest income generation, and our dedication to improving operating efficiencies,” said Denise Portmann, President & Chief Executive Officer. “During the fourth quarter, we continued to streamline our operations by expanding the use of technologies, reviewing processes to improve workflows, and finding other revenue enhancement and expense management opportunities. Many initiatives are being implemented and demonstrating constructive results. Going forward, we anticipate recouping the DTA writedown in approximately 16 months, reflecting the lower tax rate effective in 2018, and plan to continue investing into technology improvements and other corporate initiatives.”\n“Residential mortgage lending continues to enhance our revenues, contributing $1.4 million to noninterest income during the quarter,” commented Portmann. “Residential housing demand is robust, but supply is low in several of our markets which continues to limit sales activity. We are proactively managing our loan growth for credit risk purposes, within regulatory guidelines, particularly in commercial real estate. As such, provision expense was modest, given the continued solid credit quality of the loan portfolio.” Total loans grew by $6.8 million from the third quarter to $687.3 million, and increased by $29.5 million compared to the fourth quarter a year ago.\nSummary of Financial Results as Impacted by Tax Cuts and Jobs Act of 2017 (Unaudited) For the Three Months Ended, (Dollars in thousands, except per share data) Dec 31, 2017\nNon-GAAP* Sept 30, 2017\nGAAP $\nChange %\nChange Dec 31, 2016\nGAAP $ Change % Change (Dollars in thousands, except per share data) Income before income taxes 3,514 3,037 477 16 % 1,953 1,561 80 % Income tax expense 1,033 884 149 17 % 493 540 110 % Net Income $ 2,481 $ 2,153 $ 328 15 % $ 1,460 $ 1,021 70 % Income per common share Basic $ 0.24 $ 0.21 $ 0.03 14 % $ 0.14 $ 0.10 71 % Diluted $ 0.23 $ 0.20 $ 0.03 15 % $ 0.14 $ 0.09 64 % *: (excludes DTA Valuation Writedown) For the Year Ended, Dec 31, 2017\nNon-GAAP* Dec 31, 2016\nGAAP $\nChange %\nChange (Dollars in thousands, except per share data) Income before income taxes 11,324 9,050 2,274 25 % Income tax expense 3,238 2,460 778 32 % Net Income $ 8,086 $ 6,590 $ 1,496 23 % Income per common share Basic $ 0.77 $ 0.63 $ 0.14 22 % Diluted $ 0.76 $ 0.62 $ 0.14 23 % *: (excludes DTA Valuation Writedown) For the Three Months Ended December 31, 2017 For the Year Ended December 31, 2017 GAAP\n(includes DTA\nValuation\nWritedown) Non-GAAP\n(excludes DTA\nValuation\nWritedown) Impact GAAP\n(includes DTA\nValuation\nWritedown) Non-GAAP\n(excludes DTA\nValuation\nWritedown) Impact (Dollars in thousands, except per share data) Income before income taxes $ 3,514 $ 3,514 $ - $ 11,324 $ 11,324 $ - Income tax expense 2,156 1,033 1,123 4,361 3,238 1,123 Net Income $ 1,358 $ 2,481 $ (1,123 ) $ 6,963 $ 8,086 $ (1,123 ) Income per common share Basic $ 0.13 $ 0.24 $ (0.11 ) $ 0.67 $ 0.77 $ (0.10 ) Diluted $ 0.13 $ 0.23 $ (0.10 ) $ 0.65 $ 0.76 $ (0.11 ) Return on average assets, annualized 0.60 % 1.09 % -0.49 % 0.79 % 0.92 % -0.13 % Return on average equity, annualized 6.09 % 11.13 % -5.04 % 8.19 % 9.52 % -1.33 % As of December 31, 2017 Book value per common share (1) $ 8.10 8.21 $ (0.11 ) Tangible book value per common share (2) $ 6.82 6.92 $ (0.10 ) As of December 31, 2017 Pacific Financial Corporation Bank of the Pacific Total risk-based capital ratio 12.69 % 12.89 % -0.20 % 12.63 % 12.72 % -0.09 % Tier 1 risk-based capital ratio 11.46 % 11.67 % -0.21 % 11.40 % 11.50 % -0.10 % Common equity tier 1 ratio 9.71 % 9.77 % -0.06 % 11.40 % 11.50 % -0.10 % Leverage ratio 9.56 % 9.77 % -0.21 % 9.51 % 9.63 % -0.12 % Tangible common equity ratio 8.16 % 8.34 % -0.18 % (1) Book value per common share is calculated as total common shareholders' equity divided by the period ending number of common stock shares outstanding. (2) Tangible book value per common share is calculated as total common shareholders' equity less total intangible assets and liabilities, divided by the period ending number of common stock shares outstanding. Financial Highlights (as of, or for the period ended December 31, 2017, except as noted):\nNet interest income increased 2% to $8.9 million for the fourth quarter of 2017, compared to $8.7 million for the third quarter of 2017, and increased 10% from $8.1 million for the fourth quarter of 2016. For the full year in 2017, net interest income increased 8% to $34.0 million, compared to $31.7 million for 2016. Net interest margin (“NIMTE”), on a tax equivalent basis, was 4.32%, compared to 4.29% in the preceding quarter and 4.00% for the fourth quarter of 2016. The expansion in NIMTE was primarily due to higher average balances in all earning asset categories funded by seasonal growth in noninterest-bearing deposits. NIMTE was also favorably affected by the rise in asset yields during the period due to the impact of increases in interest rates by the Federal Reserve. Total deposits were $777.2 million, compared to $798.0 million at September 30, 2017, and $779.7 million at December 31, 2016. The decline in deposits was primarily due to seasonal outflows of deposits that typically begin toward the end of the year related to the slowdown in tourism in our core markets of Washington and Oregon. Balances of brokered deposits also declined during these periods. Noninterest-bearing demand deposits decreased 4% on a linked quarter basis and grew 8% over the fourth quarter of 2016. Total loans grew by $6.8 million, or 1%, to $687.3 million versus $680.5 million on a linked quarter basis, and increased by $29.5 million, or 4%, from $657.8 million over the fourth quarter of 2016. Asset quality remains solid. Loans 30 – 89 days’ delinquent, not on nonaccrual status, were minimal at 0.04% of total loans outstanding. Net charge-offs totaled $120,000, or 0.07% of average gross loans in the fourth quarter of 2017, compared to $28,000, or 0.02% of average gross loans in third quarter of 2017, and net recoveries of $48,000, or 0.03% of average gross loans, in fourth quarter of 2016. In 2017, net charge-offs totaled $372,000, or 0.06% of average gross loans, compared to $123,000, or 0.02% of average gross loans for 2016. Primarily due to the payoff of two commercial loan relationships in the fourth quarter totaling $4.4 million, adversely classified loans decreased to $7.5 million, or 1.10% of gross loans at December 31, 2017, compared to $11.4 million, or 1.67% of gross loans at September 30, 2017, and $17.7 million, or 2.68% of gross loans at December 31, 2016. Nonperforming assets were $2.2 million, or 0.25% of total assets. This compares to the prior quarter at $2.6 million, or 0.28% of total assets versus $1.8 million, or 0.20% of total assets at December 31, 2016. There was no provision for loan losses for the fourth quarter of 2017, compared to $150,000 provision for the preceding quarter and a provision of $184,000 for the fourth quarter of 2016. For the twelve months of 2017, the provision for loan losses was $272,000, compared to a provision of $998,000 for the twelve months of 2016. Reduction in provision expense reflects the Company’s solid asset quality and recent growth experience. The allowance for loan losses to gross loans stood at 1.32% at December 31, 2017, compared to 1.35% at September 30, 2017 and 1.39% at December 31, 2016.\nOperating Results\nTotal assets decreased from the linked quarter, due primarily to expected seasonal declines in deposits from customers serving the tourist markets in coastal Washington and Oregon. In addition, a commercial client withdrew $8 million in deposits just prior to the end of the year to fund a business venture. Cash equivalents were reduced to fund the decline in deposits. Loans grew modestly during the period, as did loans held for sale. Total assets were up slightly year-over-year primarily due to the increase in loans funded by a reduction in cash equivalents. Liquidity remains strong, including unused borrowing capacity. Capital ratios continue to exceed the thresholds to be considered “Well-Capitalized” under published regulatory standards.\nBalance Sheet Overview (Unaudited) Dec 31,\n2017 Sept 30,\n2017 $\nChange %\nChange Dec 31,\n2016 $ Change % Change Assets: (Dollars in thousands, except per share data) Cash and cash equivalents $ 34,571 $ 66,545 $ (31,974 ) -48 % $ 59,298 $ (24,727 ) -42 % Other interest earning deposits 994 1,490 (496 ) -33 % 2,231 (1,237 ) -55 % Investment securities 110,767 111,159 (392 ) 0 % 112,155 (1,388 ) -1 % Loans held-for-sale 10,886 9,505 1,381 15 % 6,572 4,314 66 % Loans, net of deferred fees 687,319 680,514 6,805 1 % 657,803 29,516 4 % Allowance for loan losses (9,092 ) (9,212 ) 120 -1 % (9,192 ) 100 -1 % Net loans 678,227 671,302 6,925 1 % 648,611 29,616 5 % Federal Home Loan Bank and Pacific Coast\nBankers' Bank stock, at cost 2,409 2,410 (1 ) 0 % 2,335 74 3 % Other assets 57,099 58,991 (1,892 ) -3 % 60,181 (3,082 ) -5 % Total assets $ 894,953 $ 921,402 $ (26,449 ) -3 % $ 891,383 $ 3,570 0 % Liabilities and Shareholders' Equity: Total deposits $ 777,225 $ 798,044 $ (20,819 ) -3 % $ 779,731 $ (2,506 ) 0 % Borrowings 21,906 21,944 (38 ) 0 % 22,056 (150 ) -1 % Accrued interest payable and other liabilities 10,791 14,790 (3,999 ) -27 % 9,591 1,200 13 % Shareholders' equity 85,031 86,624 (1,593 ) -2 % 80,005 5,026 6 % Total liabilities and shareholders' equity $ 894,953 $ 921,402 $ (26,449 ) -3 % $ 891,383 $ 3,570 0 % Common Stock Shares Outstanding 10,491,892 10,479,475 12,417 0 % 10,424,541 67,351 1 % Book value per common share (1) $ 8.10 $ 8.27 $ (0.17 ) -2 % $ 7.67 $ 0.43 6 % Tangible book value per common share (2) $ 6.82 $ 6.98 $ (0.16 ) -2 % $ 6.38 $ 0.44 7 % Gross loans to deposits ratio 88.4 % 85.3 % 3.1 % 84.4 % 4.0 % (1) Book value per common share is calculated as the total common shareholders' equity divided by the period ending number of common stock shares outstanding. (2) Tangible book value per common share is calculated as the total common shareholders' equity less total intangible assets and liabilities, divided by the period ending number of common stock shares outstanding. Net interest income increased on a linked quarter basis, primarily due to both the growth in average earning assets and an increase in yields associated with the recent rise in short-term interest rates. Similarly, net interest income increased from a year ago, mainly due to growth in loan production generated predominately in Western Washington and Oregon.\nInterest expense was unchanged from the third quarter of 2017 and declined from the fourth quarter a year ago, primarily due to the non-renewal of higher-cost brokered and public certificates of deposit during the current period. For the full year of 2017, interest expense also declined as compared to 2016 for reasons previously cited, despite rate increases in LIBOR-based junior subordinated debentures during the period. The continued growth of noninterest-bearing deposits mitigated the impact of the above.\nPre-tax, pre-credit operating income (non-GAAP) for fourth quarter 2017, increased significantly from the linked quarter, primarily due to increased net interest income. Pre-tax, pre-credit operating income was also up from the fourth quarter of 2016 despite a decline in gain on sale of residential real estate loans. For the year 2017, pre-tax, pre-credit operating income (non-GAAP) increased as compared to 2016, primarily due to growth in net interest income, offset by a decline in gain on sale of residential real estate loans.\nIncome Statement Overview (Unaudited) For the Three Months Ended, Dec 31,\n2017 Sept 30,\n2017 $\nChange %\nChange Dec 31,\n2016 $ Change % Change (Dollars in thousands, except per share data) Interest and dividend income $ 9,495 $ 9,283 $ 212 2 % $ 8,694 $ 801 9 % Interest expense 593 594 (1 ) 0 % 621 (28 ) -5 % Net interest income 8,902 8,689 213 2 % 8,073 829 10 % Loan loss provision - 150 (150 ) -100 % 184 (184 ) -100 % Noninterest income 2,625 2,662 (37 ) -1 % 2,899 (274 ) -9 % Noninterest expense 8,013 8,164 (151 ) -2 % 8,179 (166 ) -2 % Income before income taxes 3,514 3,037 477 16 % 1,953 1,561 80 % Income tax expense 2,156 884 1,272 144 % 493 1,663 337 % Net Income $ 1,358 $ 2,153 $ (795 ) -37 % $ 1,460 $ (102 ) -7 % Average common shares outstanding - basic 10,482,545 10,456,923 25,622 0 % 10,422,889 59,656 1 % Average common shares outstanding - diluted 10,661,422 10,630,969 30,453 0 % 10,625,295 36,127 0 % Income per common share Basic $ 0.13 $ 0.21 $ (0.08 ) -38 % $ 0.14 $ (0.01 ) -7 % Diluted $ 0.13 $ 0.20 $ (0.07 ) -35 % $ 0.14 $ (0.01 ) -7 % For the Year Ended, Dec 31,\n2017 Dec 31,\n2016 $\nChange %\nChange (Dollars in thousands, except per share data) Interest and dividend income $ 36,445 $ 34,135 $ 2,310 7 % Interest expense 2,396 2,472 (76 ) -3 % Net interest income 34,049 31,663 2,386 8 % Loan loss provision 272 998 (726 ) -73 % Noninterest income 10,476 11,225 (749 ) -7 % Noninterest expense 32,929 32,840 89 0 % Income before income taxes 11,324 9,050 2,274 25 % Income tax expense 4,361 2,460 1,901 77 % Net Income $ 6,963 $ 6,590 $ 373 6 % Average common shares outstanding - basic 10,452,014 10,416,162 35,852 0 % Average common shares outstanding - diluted 10,647,279 10,588,724 58,555 1 % Income per common share Basic $ 0.67 $ 0.63 $ 0.04 6 % Diluted $ 0.65 $ 0.62 $ 0.03 5 % The following tables provide the reconciliation of net income to pre-tax, pre-credit operating income (non-GAAP):\nReconciliation of Non-GAAP Measure (Unaudited) For the Three Months Ended, Dec 31,\n2017 Sept 30,\n2017 $\nChange %\nChange Dec 31,\n2016 $ Change % Change Non-GAAP Operating Income (Dollars in thousands) Net Income $ 1,358 $ 2,153 $ (795 ) -37 % $ 1,460 $ (102 ) -7 % Loan loss provision - 150 (150 ) -100 % 184 (184 ) -100 % Loss on real estate owned, net - - - 0 % 324 (324 ) -100 % Income tax expense 2,156 884 1,272 144 % 493 1,663 337 % Pre-tax, pre-credit operating income $ 3,514 $ 3,187 $ 327 10 % $ 2,789 $ 1,053 38 % For the Year Ended, Dec 31,\n2017 Dec 31,\n2016 $\nChange %\nChange Non-GAAP Operating Income (Dollars in thousands) Net Income $ 6,963 $ 6,590 $ 373 6 % Loan loss provision 272 998 (726 ) -73 % Loss on real estate owned, net 34 324 (290 ) -90 % Income tax expense 4,361 2,460 1,901 77 % Pre-tax, pre-credit operating income $ 11,630 $ 10,275 $ 1,355 13 % Noninterest Income\nNoninterest income was unchanged on a linked quarter basis. Noninterest income was down compared to the fourth quarter of 2016, primarily due to a decline in revenue from the sale of residential mortgage loans. Recent increases in mortgage rates have moderated demand for refinancing. However, demand for purchase financing remains strong, with robust demand for new homes chasing a limited supply of housing in several of our Western Washington and Oregon markets. Supply constraints, and resulting increases in housing prices, have, in part, stemmed from increased governmental regulations governing real estate development over the past several years.\nFor the full year in 2017, noninterest income was down compared to 2016. This was primarily a result of a decline in revenue from the sale of residential mortgage loans for reasons noted above, and a $351,000 gain on the sale of a $1.2 million OREO property that occurred in the first quarter of 2016. However, this was partially offset by an increase in fee income from ATM/debit card activity in the current period versus the comparable period a year ago, due to the impacts of recent promotional activities and growth in debit card usage.\nNoninterest Income (Unaudited) For the Three Months Ended, Dec 31,\n2017 Sept 30,\n2017 $\nChange %\nChange Dec 31,\n2016 $ Change % Change (Dollars in thousands) Service charges on deposits $ 474 $ 456 $ 18 4 % $ 465 $ 9 2 % Gain on sale of loans, net 1,406 1,398 8 1 % 1,596 (190 ) -12 % Gain on sale of securities available for sale, net (70 ) - (70 ) 0 % - (70 ) 100 % Earnings on bank owned life insurance 109 110 (1 ) -1 % 114 (5 ) -4 % Other noninterest income Fee income 661 672 (11 ) -2 % 616 45 7 % Other 45 26 19 73 % 108 (63 ) -58 % Total noninterest income $ 2,625 $ 2,662 $ (37 ) -1 % $ 2,899 $ (274 ) -9 % For the Year Ended, Dec 31,\n2017 Dec 31,\n2016 $\nChange %\nChange (Dollars in thousands) Service charges on deposits $ 1,856 $ 1,876 $ (20 ) -1 % Gain on sale of loans, net 5,143 6,126 (983 ) -16 % Gain on sale of securities available for sale, net 9 6 3 50 % Earnings on bank owned life insurance 440 467 (27 ) -6 % Other noninterest income Fee income 2,575 2,271 304 13 % Other 453 479 (26 ) -5 % Total noninterest income $ 10,476 $ 11,225 $ (749 ) -7 % Noninterest Expense\nNoninterest expense decreased from the linked quarter, primarily due to $161,000 in consulting fees recognized in the prior quarter associated with a process improvement and revenue enhancement engagement undertaken during the year. Noninterest expense also decreased from the fourth quarter of 2016 as personnel costs declined as a result of the process improvement efforts undertaken during the period. In addition, expenses in fourth quarter 2016 included charges related to a write-down taken to reduce the carrying value of a former branch property of $324,000.\nNoninterest expense was unchanged year-to-date as compared to the same period in 2016, primarily for reasons cited previously, even including the $571,000 in expense incurred as part of the process improvement and revenue enhancement consulting engagement undertaken during the year. Expenses for 2016 included the write-down of a former branch property, as noted above. Data processing and software expense also increased versus the prior periods with the recent introduction of several technology solutions to augment cyber-security and enhance productivity.\nNoninterest Expense (Unaudited) For the Three Months Ended, Dec 31,\n2017 Sept 30,\n2017 $\nChange %\nChange Dec 31,\n2016 $ Change % Change (Dollars in thousands) Salaries and employee benefits $ 5,181 $ 5,090 $ 91 2 % $ 5,341 $ (160 ) -3 % Occupancy 498 489 9 2 % 537 (39 ) -7 % Equipment 262 282 (20 ) -7 % 266 (4 ) -2 % Data processing 575 581 (6 ) -1 % 532 43 8 % Professional services 137 330 (193 ) -58 % 170 (33 ) -19 % Other real estate owned write-downs - - - 0 % (328 ) 328 0 % Other real estate owned operating costs - (1 ) 1 -100 % 26 (26 ) -100 % State and local taxes 123 195 (72 ) -37 % 87 36 41 % FDIC and State assessments 120 115 5 4 % 78 42 54 % Other noninterest expense: Director fees 71 64 7 11 % 71 - 0 % Communication 70 69 1 1 % 77 (7 ) -9 % Advertising 80 78 2 3 % 85 (5 ) -6 % Professional liability insurance 43 48 (5 ) -10 % 47 (4 ) -9 % Amortization 86 72 14 19 % 62 24 39 % Loss on real estate owned, net - - - 0 % 324 (324 ) -100 % Other 767 752 15 2 % 804 (37 ) -5 % Total noninterest expense $ 8,013 $ 8,164 $ (151 ) -2 % $ 8,179 $ (166 ) -2 % For the Year Ended, Dec 31,\n2017 Dec 31,\n2016 $\nChange %\nChange (Dollars in thousands) Salaries and employee benefits $ 20,565 $ 20,884 $ (319 ) -2 % Occupancy 2,019 2,064 (45 ) -2 % Equipment 1,100 1,052 48 5 % Data processing 2,297 2,047 250 12 % Professional services 1,270 516 754 146 % Other real estate owned write-downs - (26 ) 26 -100 % Other real estate owned operating costs 62 464 (402 ) -87 % State and local taxes 588 459 129 28 % FDIC and State assessments 462 485 (23 ) -5 % Other noninterest expense: Director fees 269 289 (20 ) -7 % Communication 269 270 (1 ) 0 % Advertising 323 298 25 8 % Professional liability insurance 185 190 (5 ) -3 % Amortization 86 324 (238 ) -73 % Loss on real estate owned, net 34 324 (290 ) 100 % Other 3,400 3,200 200 6 % Total noninterest expense $ 32,929 $ 32,840 $ 89 0 %\nFinancial Performance Overview (Unaudited) For the Three Months Ended Dec 31,\n2017 Sept 30,\n2017 Change Dec 31,\n2016 Change Performance Ratios Return on average assets, annualized 0.60 % 0.96 % (0.36 ) 0.65 % (0.05 ) Return on average equity, annualized 6.09 % 9.90 % (3.81 ) 6.94 % (0.85 ) Efficiency ratio (1) 69.52 % 71.92 % (2.40 ) 79.92 % (10.40 ) (1) Non-interest expense divided by net interest income plus noninterest income. For the Year Ended, Dec 31,\n2017 Dec 31,\n2016 Change Performance Ratios Return on average assets, annualized 0.79 % 0.77 % 0.02 Return on average equity, annualized 8.19 % 8.16 % 0.03 Efficiency ratio (1) 73.96 % 76.62 % (2.66 ) (1) Non-interest expense divided by net interest income plus noninterest income. LIQUIDITY\nCash and Cash Equivalents and Investment Securities (Unaudited) Dec 31,\n2017 % of\nTotal Sept 30,\n2017 % of\nTotal $\nChange %\nChange Dec 31,\n2016 Total $\nChange %\nChange (Dollars in thousands) Cash on hand and in banks $ 14,667 9 % $ 18,460 9 % $ (3,793 ) -21 % $ 15,707 9 % $ (1,040 ) -7 % Interest bearing deposits 19,904 14 % 48,085 28 % (28,181 ) -59 % 43,591 25 % (23,687 ) -54 % Other interest earning deposits 994 1 % 1,490 1 % (496 ) -33 % 2,231 1 % (1,237 ) -55 % Total cash equivalents and interest earning deposits 35,565 24 % 68,035 38 % (32,470 ) -48 % 61,529 35 % (25,964 ) -42 % Investment securities: Collateralized mortgage obligations: agency issued 39,719 27 % 39,336 21 % 383 1 % 35,514 20 % 4,205 12 % Collateralized mortgage obligations: non-agency 257 0 % 288 0 % (31 ) -11 % 331 0 % (74 ) -22 % Mortgage-backed securities: agency issued 15,775 11 % 13,469 8 % 2,306 17 % 14,166 8 % 1,609 11 % U.S. Government and agency securities 2,483 2 % 2,578 1 % (95 ) -4 % 8,716 5 % (6,233 ) -72 % State and municipal securities 52,533 36 % 55,488 32 % (2,955 ) -5 % 53,428 32 % (895 ) -2 % Total investment securities 110,767 76 % 111,159 62 % (392 ) 0 % 112,155 65 % (1,388 ) -1 % Total cash equivalents and investment securities $ 146,332 100 % $ 179,194 100 % $ (32,862 ) -18 % $ 173,684 100 % $ (27,352 ) -16 % Total cash equivalents and investment securities as a percent of total assets 16 % 19 % 20 % “Liquidity remains strong based on existing levels of combined cash equivalents, investment securities and unused borrowing capacity. While seasonal outflow of deposits typical for this time of the year impacted total deposits during the quarter, noninterest-bearing deposits increased 8% from the fourth quarter a year ago,” said Douglas N. Biddle, EVP and Chief Financial Officer. “Our investment securities include a large component of fully amortized U.S. agency collateralized mortgage and mortgage-backed securities, for which we expect to have limited extension risk. The securities portfolio also contains municipal securities rated A or better.” The expected modified duration (adjusted for calls, consensus pre-payment speeds and rate adjustment dates) of the investment portfolio was 4.0 years at December 31, 2017, 3.9 years at September 30, 2017 and 3.9 years at December 31, 2016.\nThe Bank had $8.5 million in outstanding borrowings against its $169.7 million in established borrowing capacity with the Federal Home Loan Bank of Des Moines (FHLB) at December 31, 2017. The Bank had $8.5 million and $8.7 million in outstanding borrowings with the FHLB at September 30, 2017 and December 31, 2016, respectively. The Bank’s borrowing facility with the FHLB is subject to collateral and stock ownership requirements. The Bank also has available a discount window primary credit line with the Federal Reserve Bank of San Francisco of approximately $49.2 million, subject to collateral requirements, and $16.0 million from correspondent banks, with no balance outstanding on any of these facilities.\nLOANS\nLoans by Category (Unaudited) Dec 31, 2017 % of\nGross\nLoans Sept 30, 2017 % of\nGross\nLoans $\nChange %\nChange Dec 31,\n2016 % of\nGross\nLoans $\nChange %\nChange (Dollars in thousands) Commercial and agricultural $ 138,543 21 % $ 137,520 19 % $ 1,023 1 % $ 134,318 20 % $ 4,225 3 % Real estate: Construction and development 62,980 9 % 67,967 10 % (4,987 ) -7 % 41,983 6 % 20,997 50 % Residential 1-4 family 88,055 13 % 88,897 13 % (842 ) -1 % 91,686 14 % (3,631 ) -4 % Multi-family 22,333 3 % 19,425 3 % 2,908 15 % 29,747 5 % (7,414 ) -25 % Commercial real estate -- owner occupied 139,044 20 % 134,970 20 % 4,074 3 % 132,449 20 % 6,595 5 % Commercial real estate -- non owner occupied 139,169 20 % 135,925 20 % 3,244 2 % 138,078 21 % 1,091 1 % Farmland 34,452 5 % 34,583 5 % (131 ) 0 % 25,588 4 % 8,864 35 % Consumer 63,839 9 % 62,408 9 % 1,431 2 % 65,442 10 % (1,603 ) -2 % Loans net of deferred fees 688,415 100 % 681,695 100 % 6,720 1 % 659,291 100 % 29,124 4 % Less: allowance for loan losses (9,092 ) (9,212 ) 120 (9,192 ) 100 Less: deferred fees (1,096 ) (1,181 ) 85 (1,488 ) 392 Net loans $ 678,227 $ 671,302 $ 6,925 $ 648,611 $ 29,616 Loan Concentration (Unaudited) Dec 31,\n2017 % of Risk\nBased\nCapital Sept 30,\n2017 % of Risk\nBased\nCapital Change Dec 31,\n2016 % of Risk\nBased\nCapital Change (Dollars in thousands) Commercial and agricultural $ 138,543 148 % $ 137,520 146 % 2 % $ 134,318 149 % -1 % Real estate: Construction and development 62,980 67 % 67,967 72 % -5 % 41,983 47 % 20 % Residential 1-4 family 88,055 94 % 88,897 94 % 0 % 91,686 102 % -8 % Multi-family 22,333 24 % 19,425 21 % 3 % 29,747 33 % -9 % Commercial real estate -- owner occupied 139,044 148 % 134,970 143 % 5 % 132,449 147 % 1 % Commercial real estate -- non owner occupied 139,169 149 % 135,925 144 % 5 % 138,078 153 % -4 % Farmland 34,452 37 % 34,583 37 % 0 % 25,588 28 % 9 % Consumer 63,839 68 % 62,408 66 % 2 % 65,442 73 % -5 % Loans net of deferred fees $ 688,415 $ 681,695 $ 659,291 Regulatory Commercial Real Estate $ 215,087 230 % $ 210,142 222 % 8 % $ 200,010 222 % 8 % Total Risk Based Capital* $ 93,660 $ 94,494 $ 89,999 *Bank of the Pacific The loan portfolio continues to be well-diversified with balances in most lending categories originating predominately within the Western Washington and Oregon markets. Increases in loans were generated in most categories during the current quarter. Construction and development and farmland loans grew during the year to meet growing demand in the market and take advantage of opportunities to expand our lending in selected agribusiness sectors. The portfolio includes $33.3 million in LIBOR-based and $147.4 million in Wall Street Journal Prime-based floating rate commercial and commercial real estate loans. The portfolio also includes $18.8 million in purchased government-guaranteed commercial and commercial real estate loans. In addition, the portfolio contains $56.3 million in indirect consumer loans to finance luxury and classic cars as a part of a strategy to diversify the loan portfolio. These loans have been made to individuals with high credit scores and have exhibited very low losses to date. The Company manages new loan origination volume using concentration limits that establish maximum exposure levels by designated industry segment, real estate product types, geography and single borrower limits. While the Bank’s recent loan growth does include commercial real estate, the amount of such exposure continues to be managed within regulatory guidelines.\nDEPOSITS\nDeposits by Category (Unaudited) Dec 31,\n2017 % of\nTotal Sept 30,\n2017 % of\nTotal $\nChange %\nChange Dec 31,\n2016 % of\nTotal $\nChange %\nChange (Dollars in thousands) Interest-bearing demand and money market $ 332,707 44 % $ 337,474 42 % $ (4,767 ) -1 % $ 332,779 42 % $ (72 ) 0 % Savings 89,303 11 % 88,306 11 % 997 1 % 84,146 11 % 5,157 6 % Time deposits (CDs) 103,871 13 % 111,064 14 % (7,193 ) -6 % 129,175 17 % (25,304 ) -20 % Total interest-bearing deposits 525,881 68 % 536,844 67 % (10,963 ) -2 % 546,100 70 % (20,219 ) -4 % Non-interest bearing demand 251,344 32 % 261,200 33 % (9,856 ) -4 % 233,631 30 % 17,713 8 % Total deposits $ 777,225 100 % $ 798,044 100 % $ (20,819 ) -3 % $ 779,731 100 % $ (2,506 ) 0 % Total deposits decreased during the quarter, primarily due to seasonal outflows of deposits that normally begin toward the end of the year related to the slowdown in tourist activity in our core markets of Washington and Oregon. In addition, a commercial client withdrew $8 million in deposits just prior to year-end to fund a business venture. Time deposits continue to decline as a component of funding due to the increasing propensity of retail depositors to not lock in relatively low interest rates for an extended period. In addition, balances of brokered deposits also declined during these periods. The proportion of noninterest bearing deposits to total deposits continued to increase year-over-year due to an expansion of treasury management services during the period.\nBrokered certificates of deposit totaled $42.3 million, which included $0.7 million via reciprocal deposit arrangements, down from $47.9 million at September 30, 2017 and $50.3 million at December 31, 2016. The brokered deposits were acquired during the latter part of 2015 with fixed rates with terms ranging from 2 to 5 years. “These deposits were obtained to lock in historically low rates to enhance the Bank’s interest rate risk mitigation strategies,” explained Biddle.\nCAPITAL\nPacific Financial Corporation (“Company”), and its subsidiary Bank of the Pacific (“Bank”), met the thresholds to be considered “Well-Capitalized” under regulatory standards for total risk-based capital, Tier 1 risk-based capital, Common equity Tier 1 and Tier 1 leverage capital. Leverage ratios decreased due to asset growth during the current period. However, risk-weighted ratios have increased compared to the linked and prior year quarters, due to the retention of earnings, coupled with the modest level of growth during the period. As such, the balance sheet has exhibited only a modest increase in risk-weighting as compared to the year-over-year quarter.\nThe Federal Deposit Insurance Corporation (“FDIC”) has established minimum requirements for capital adequacy for banks under the Basel III capital framework. On April 9, 2015, The Board of Governors of the Federal Reserve System (“Federal Reserve”) issued a final rule to amend the Small Bank Holding Company Policy Statement. With this amendment, small bank holding companies, including Pacific Financial Corporation, are not being subject to Basel III capital rules. For illustrative purposes, Basel III framework capital ratios are displayed below for both the Company and the Bank.\nThe total risk-based capital ratios of the Company include $13.4 million of junior subordinated debentures, all of which qualified as Tier 1 capital under guidance issued by the Federal Reserve. As provided in the Dodd-Frank Act, the Company expects to continue to rely on these junior subordinated debentures as part of its regulatory capital.\nThe following table summarizes the capital measures of the Company and the Bank respectively, at the dates listed below.\nCapital Measures (unaudited) Dec 31,\n2017 Sept 30,\n2017 Change Dec 31,\n2016 Change To be Well\nCapitalized\nUnder Prompt\nCorrection\nAction\nRegulations* Pacific Financial Corporation Total risk-based capital ratio 12.69 % 12.82 % (0.13 ) 12.56 % 0.13 N/A Tier 1 risk-based capital ratio 11.46 % 11.58 % (0.12 ) 11.31 % 0.15 N/A Common equity tier 1 ratio 9.71 % 9.84 % (0.13 ) 9.49 % 0.22 N/A Leverage ratio 9.56 % 9.85 % (0.29 ) 9.25 % 0.31 N/A Tangible common equity ratio 8.16 % 8.08 % 0.08 7.63 % 0.53 N/A Bank of the Pacific Total risk-based capital ratio 12.63 % 12.71 % (0.08 ) 12.47 % 0.16 10.5% Tier 1 risk-based capital ratio 11.40 % 11.47 % (0.07 ) 11.22 % 0.18 8.5% Common equity tier 1 ratio 11.40 % 11.47 % (0.07 ) 11.22 % 0.18 7.0% Leverage ratio 9.51 % 9.75 % (0.24 ) 9.18 % 0.33 7.5% *Includes Basel III 2019 Capital Conservation Buffer Net Interest Margin\nNet interest margin expanded on a linked quarter and year-over-year basis, primarily due to increases in average loan and investment securities balances and yields. Increases in interest rates recently initiated by the Federal Reserve had a positive impact on asset yields during the period. Net interest margin for 2017 improved as compared to the prior year for similar reasons, despite additional one-time interest income assessed for a breach in loan agreement during first quarter 2016. This one-time interest income enhanced net interest margin by 3 basis points for the prior year period.\nCost of deposits remained relatively unchanged as compared to the linked quarter and year-over-year periods. The increase in the proportion of deposits coming from noninterest-bearing deposits favorably impacted funding costs during these respective periods. Improvement in loan and investment security yields offset increases in the cost of LIBOR-based junior subordinated debentures, which has increased as a result of rising interest rates, in the current quarter as compared to the linked and year-over-year periods.\nThe following tables set forth information regarding average balances of interest-earning assets and interest-bearing liabilities and the resultant yields or cost, and the net interest margin on a tax equivalent basis. Loans held for sale and non-accrual loans are included in total loans.\nNet Interest Margin (Unaudited) (Annualized, tax-equivalent basis) For the Three Months Ended, Dec 31,\n2017 Sept 30,\n2017 $\nChange % Change Dec 31,\n2016 $\nChange % Change Average Balances (Dollars in thousands) Gross loans $ 682,688 $ 676,059 $ 6,629 1 % $ 651,985 $ 30,703 5 % Loans held for sale $ 9,475 $ 8,457 $ 1,018 12 % $ 10,690 $ (1,215 ) -11 % Investment securities $ 147,863 $ 140,167 $ 7,696 5 % $ 158,255 $ (10,392 ) -7 % Total interest-earning assets $ 840,026 $ 824,683 $ 15,343 2 % $ 820,930 $ 19,096 2 % Non-interest bearing demand deposits $ 265,002 $ 251,003 $ 13,999 6 % $ 231,457 $ 33,545 14 % Interest bearing deposits $ 519,595 $ 521,545 $ (1,950 ) 0 % $ 540,687 $ (21,092 ) -4 % Borrowings $ 21,919 $ 21,956 $ (37 ) 0 % $ 22,070 $ (151 ) -1 % Total interest-bearing liabilities $ 541,514 $ 543,501 $ (1,987 ) 0 % $ 562,757 $ (21,243 ) -4 % Total Equity $ 88,466 $ 86,262 $ 2,204 3 % $ 83,428 $ 5,038 6 % For the Three Months Ended, Dec 31,\n2017 Sept 30,\n2017 Change Dec 31,\n2016 Change Yield on average gross loans (1) 5.08 % 5.04 % 0.04 4.86 % 0.22 Yield on average investment securities (1) 2.37 % 2.32 % 0.05 1.94 % 0.43 Cost of average interest bearing deposits 0.34 % 0.34 % - 0.36 % (0.02 ) Cost of average borrowings 2.73 % 2.69 % 0.04 2.43 % 0.30 Cost of average total deposits and borrowings 0.29 % 0.30 % (0.01 ) 0.31 % (0.02 ) Yield on average interest-earning assets 4.60 % 4.58 % 0.02 4.30 % 0.30 Cost of average interest-bearing liabilities 0.43 % 0.43 % - 0.44 % (0.01 ) Net interest spread 4.17 % 4.15 % 0.02 3.86 % 0.31 Net interest margin (1) 4.32 % 4.29 % 0.03 4.00 % 0.32 (1) Tax-exempt income has been adjusted to a tax equivalent basis at a 34% rate. For the Year Ended, Dec 31,\n2017 Dec 31,\n2016 $\nChange % Change Average Balances (Dollars in thousands) Gross loans $ 672,991 $ 644,813 $ 28,178 4 % Loans held for sale $ 7,702 $ 11,160 $ (3,458 ) -31 % Investment securities $ 135,352 $ 131,407 $ 3,945 3 % Interest-earning assets $ 816,045 $ 787,380 $ 28,665 4 % Non-interest bearing demand deposits $ 242,290 $ 203,955 $ 38,335 19 % Interest bearing deposits $ 523,007 $ 532,315 $ (9,308 ) -2 % Borrowings $ 22,080 $ 27,455 $ (5,375 ) -20 % Interest-bearing liabilities $ 545,087 $ 559,770 $ (14,683 ) -3 % Total Equity $ 84,976 $ 80,783 $ 4,193 5 % For the Year Ended, Dec 31,\n2017 Dec 31,\n2016 Change Net Interest Margin Yield on average gross loans (1) 5.01 % 4.89 % 0.12 Yield on average investment securities (1) 2.40 % 2.12 % 0.28 Cost of average interest bearing deposits 0.35 % 0.36 % (0.01 ) Cost of average borrowings 2.64 % 2.39 % 0.25 Cost of average total deposits and borrowings 0.30 % 0.32 % (0.02 ) Yield on average interest-earning assets 4.58 % 4.43 % 0.15 Cost of average interest-bearing liabilities 0.44 % 0.44 % - Net interest spread 4.14 % 3.99 % 0.15 Net interest margin (1) 4.28 % 4.11 % 0.17 (1) Tax-exempt income has been adjusted to a tax equivalent basis at a 34% rate. ASSET QUALITY\nAsset quality improved compared to the preceding quarter, primarily due to the payoff of two adversely-classified commercial loans totaling $4.4 million. As such, adversely classified loans to total gross loans declined as compared to both the linked and year-over-year quarters. Total 30-89 day delinquencies remained below 0.50%, a positive leading indicator of future credit quality.\nAdversely Classified Loans and Securities (Unaudited) Dec 31,\n2017 Sept 30,\n2017 $\nChange %\nChange Dec 31,\n2016 $\nChange %\nChange (Dollars in thousands) Rated substandard or worse, but not impaired $ 5,017 $ 8,490 $ (3,473 ) -41 % $ 16,086 $ (11,069 ) -69 % Impaired 2,529 2,916 (387 ) -13 % 1,615 914 57 % Total adversely classified loans¹ $ 7,546 $ 11,406 $ (3,860 ) -34 % $ 17,701 $ (10,155 ) -57 % Gross loans (excluding deferred loan fees) $ 688,415 $ 681,695 $ 6,720 1 % $ 659,291 $ 29,124 4 % Adversely classified loans to gross loans 1.10 % 1.67 % 2.68 % Allowance for loan losses $ 9,092 $ 9,212 $ (120 ) -1 % $ 9,192 $ (100 ) -1 % Allowance for loan losses as a percentage of adversely classified loans 120.49 % 80.76 % 51.93 % Allowance for loan losses to total impaired loans 359.51 % 315.91 % 569.16 % Adversely classified loans to total assets 0.84 % 1.24 % 1.99 % Delinquent loans to gross loans, not in nonaccrual status 0.04 % 0.08 % 0.03 % ¹Adversely classified loans are defined as loans having a well-defined weakness or weaknesses related to the borrower's financial capacity or to pledged collateral that may jeopardize the repayment of the debt. They are characterized by the possibility that the Bank may sustain some loss if the deficiencies giving rise to the substandard classification are not corrected. Note that any loans internally rated worse than substandard are included in the impaired loan totals. Nonperforming assets decreased on a linked quarter basis, primarily due to the payoff of one commercial loan on nonaccrual status totaling $878,000 in the current quarter. This was partially offset by the placement of a $400,000 loan to finance an exotic automobile on nonaccrual during the current period. As a result, there was a slight decrease in the percentage of nonperforming assets to total assets versus the linked quarter. However, nonperforming assets remained above the amount as of the year-over-year quarter primarily due to a $738,000 commercial real estate loan placed on nonaccrual in the linked quarter.\nNonperforming Assets (Unaudited) Dec 31,\n2017 Sept 30,\n2017 $\nChange %\nChange Dec 31,\n2016 $\nChange %\nChange (Dollars in thousands) Loans on nonaccrual status $ 2,163 $ 2,545 $ (382 ) -15 % $ 1,229 $ 934 76 % Total nonaccrual loans 2,163 2,545 (382 ) -15 % 1,229 934 76 % Other real estate owned and foreclosed assets 50 8 42 525 % 549 (499 ) -91 % Total nonperforming assets $ 2,213 $ 2,553 $ (340 ) -13 % $ 1,778 $ 435 24 % Restructured performing loans $ 366 $ 371 $ (5 ) -1 % $ 386 $ (20 ) -5 % Accruing loans past due 90 days or more $ - $ - $ - 0 % $ - $ - 0 % Percentage of nonperforming assets to total assets 0.25 % 0.28 % 0.20 % Nonperforming loans to total loans 0.31 % 0.37 % 0.19 % ALLOWANCE FOR LOAN LOSSES\nThe allowance for loan losses has been managed in concert with recent loan growth. With changes in the loan portfolio composition over the past several years and overall improvement in credit quality, loss factors used in estimates to establish reserve levels have declined commensurately.\nNet charge-offs increased for the fourth quarter, primarily made up of several small business loans, compared to the preceding quarter, which were primarily consumer loans, and net recoveries of the fourth quarter a year ago. Net charge-offs in 2017 were up compared to the like period a year ago. For the full year 2017 net charge-offs included a $121,000 charge-off that occurred earlier in the year related to the payoff of a $2.0 million adversely classified commercial loan participation. “The low level of charge-offs and ratio of net loan charge-offs to average gross loans demonstrate the solid credit quality of the portfolio,” said Biddle. The overall risk profile of the loan portfolio continues to be modest, demonstrating the solid credit risk management framework in place. The trend of future provisions for loan losses will depend primarily on economic conditions, growth in the loan portfolio, level of adversely-classified assets, and changes in collateral values.\nAllowance for Loan Losses (Unaudited) For the Three Months Ended, Dec 31,\n2017 Sept 30,\n2017 $\nChange %\nChange Dec 31,\n2016 $\nChange %\nChange (Dollars in thousands) Gross loans outstanding at end of period $ 688,415 $ 681,695 $ 6,720 1 % $ 659,291 $ 29,124 4 % Average loans outstanding, gross $ 682,688 $ 676,059 $ 6,629 1 % $ 651,985 $ 30,703 5 % Allowance for loan losses, beginning of period $ 9,212 $ 9,090 $ 122 1 % $ 8,960 $ 252 3 % Commercial (10 ) - (10 ) 100 % - (10 ) 0 % Commercial Real Estate - - - 0 % - - 0 % Residential Real Estate - - - 0 % (15 ) 15 -100 % Consumer (113 ) (33 ) (80 ) 242 % (41 ) (72 ) 176 % Total charge-offs (123 ) (33 ) (90 ) 273 % (56 ) (67 ) 120 % Commercial 2 2 - 0 % 5 (3 ) -60 % Commercial Real Estate - - - 0 % 2 (2 ) -100 % Residential Real Estate - 1 (1 ) -100 % 96 (96 ) -100 % Consumer 1 2 (1 ) -50 % 1 - 0 % Total recoveries 3 5 (2 ) -40 % 104 (101 ) -97 % Net recoveries/(charge-offs) (120 ) (28 ) (92 ) 329 % 48 (168 ) -350 % Provision charged to income - 150 (150 ) -100 % 184 (184 ) -100 % Allowance for loan losses, end of period $ 9,092 $ 9,212 $ (120 ) -1 % $ 9,192 $ (100 ) -1 % Ratio of net loans charged-off to average gross loans outstanding, annualized 0.07 % 0.02 % 0.05 % -0.03 % 0.10 % Ratio of allowance for loan losses to gross loans outstanding 1.32 % 1.35 % -0.03 % 1.39 % -0.07 % For the Year Ended, Dec 31,\n2017 Dec 31,\n2016 $\nChange %\nChange (Dollars in thousands) Gross loans outstanding at end of period $ 688,415 $ 659,291 $ 29,124 4 % Average loans outstanding, gross $ 672,991 $ 644,813 $ 28,178 4 % Allowance for loan losses, beginning of period $ 9,192 $ 8,317 $ 875 11 % Commercial (246 ) (8 ) (238 ) 2975 % Commercial Real Estate - (97 ) 97 -100 % Residential Real Estate (3 ) (50 ) 47 -94 % Consumer (187 ) (120 ) (67 ) 56 % Total charge-offs (436 ) (275 ) (161 ) 59 % Commercial 46 7 39 557 % Commercial Real Estate - 8 (8 ) -100 % Residential Real Estate 11 127 (116 ) -91 % Consumer 7 10 (3 ) -30 % Total recoveries 64 152 (88 ) -58 % Net (charge-offs) (372 ) (123 ) (249 ) 202 % Provision charged to income 272 998 (726 ) -73 % Allowance for loan losses, end of period $ 9,092 $ 9,192 $ (100 ) -1 % Ratio of net loans charged-off to average gross loans outstanding, annualized 0.06 % 0.02 % 0.04 % Ratio of allowance for loan losses to gross loans outstanding 1.32 % 1.39 % -0.07 % ABOUT PACIFIC FINANCIAL CORPORATION\nPacific Financial Corporation of Aberdeen, Washington, is the bank holding company for Bank of the Pacific, a state chartered and federally insured commercial bank. Bank of the Pacific offers banking products and services to small-to-medium sized businesses and professionals in western Washington and Oregon. At December 31, 2017, the Company had total assets of $897 million and operated fifteen branches in the communities of Grays Harbor, Pacific, Whatcom, Skagit, Clark and Wahkiakum counties in the State of Washington, and three branches in Clatsop County, Oregon. The Company also operated loan production offices in the communities of DuPont and Burlington in Washington and Salem, Oregon. Visit the Company’s website at www.bankofthepacific.com . Member FDIC.\nCautions Concerning Forward-Looking Statements\nThis press release contains statements that constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 and other laws, including all statements in this release that are not historical facts or that relate to future plans or events or projected results of Pacific Financial Corporation and its wholly-owned subsidiary, Bank of the Pacific. These forward-looking statements are subject to risks and uncertainties that could cause actual events or results to differ materially from those projected, anticipated or implied. These risks and uncertainties include various risks associated with growing the Bank and expanding the services it provides, successfully completing and integrating the acquisition of new branches and development of new business lines and markets, competition in the marketplace, general economic conditions, changes in interest rates, extensive and evolving regulation of the banking industry, and many other risks. We undertake no obligation to update or revise any forward-looking statement. Readers of this release are cautioned not to put undue reliance on forward-looking statements.\nCONTACTS:\nDENISE PORTMANN, PRESIDENT & CEO\nDOUGLAS BIDDLE, EVP & CFO\n360.533.8873\nThe Cereghino Group\nIR CONTACT: 206-388-5785\nSource:Pacific Financial Corporation", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/6b77e274-573a-4fa1-ac92-0dd1c31c9721", "https://www.globenewswire.com/Tracker?data=3wwvtiASC_FW8XA3QgrsoyMjYA8mnqOqqU_8w-IAnrhgExBR4l63R5_zEJwDB449x36PXY2JUzXj_PB0jL1AFgkeVAFyqteprUV6bocLxHQ="], "published": "2018-01-25T17:00:00.000+02:00", "crawled": "2018-01-25T18:33:19.002+02:00", "highlightTitle": ""}