{"organizations": [], "uuid": "b541f34d1f854111ba6a69bdbd6ef5a123627236", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180107&t=2&i=1220111935&w=1200&r=LYNXMPEE060Q1", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-cricket-ashes-root/england-captain-root-in-hospital-with-dehydration-idUKKBN1EW0WG", "country": "US", "domain_rank": 408, "title": "England captain Root in hospital with dehydration", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T00:55:00.000+02:00", "replies_count": 0, "uuid": "b541f34d1f854111ba6a69bdbd6ef5a123627236"}, "author": "", "url": "https://uk.reuters.com/article/uk-cricket-ashes-root/england-captain-root-in-hospital-with-dehydration-idUKKBN1EW0WG", "ord_in_thread": 0, "title": "England captain Root in hospital with dehydration", "locations": [], "entities": {"persons": [{"name": "joe root", "sentiment": "none"}, {"name": "clare fallon", "sentiment": "none"}], "locations": [{"name": "england", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}], "organizations": [{"name": "mitchell starc", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "scg", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 7, 2018 / 10:58 PM / Updated 7 hours ago England's Root hailed for leaving sick bed to bat Nick Mulvenney 3 Min Read \nSYDNEY (Reuters) - England captain Joe Root drew praise for his courage from team mate and opponent alike after leaving his sick bed to bat on the final day of the fifth Ashes test on Monday. Cricket - Ashes test match - Australia v England - SCG, Sydney, Australia, January 8, 2018. England's captain Joe Root hits a shot during the fifth day of the fifth Ashes cricket test match. REUTERS/David Gray \nThe 27-year-old was treated in hospital overnight for gastroenteritis but made it to the ground to briefly resume his innings before England fell to an innings and 123-run defeat that gave Australia a 4-0 series triumph. \nAs the hosts celebrated a convincing victory on the field at the Sydney Cricket Ground, Root was asleep in the dressing room leaving vice-captain Jimmy Anderson to fulfil his media duties. \n“He was up all night with some sort of stomach bug, some gastro thing,” Anderson said. \n”I think the heat over the last couple of days has taken its toll. Hopefully it’s just a simple bug that a bit of sleep and a bit of rehydration will get him back to 100 percent. \n“He’s not has any sleep, he’s not eaten. He’s had diarrhoea and vomiting, so I‘m guessing he’s not in a great state at the minute.” Cricket - Ashes test match - Australia v England - SCG, Sydney, Australia, January 8, 2018. England's captain Joe Root walks onto the ground to bat during the fifth day of the fifth Ashes cricket test match. REUTERS/David Gray \nRoot did not resume his innings straight away, sending Moeen Ali in to bat in his stead and only coming out once the all-rounder had been dismissed. \nHe managed to take his tally past to the half-century mark before suffering a recurrence of the symptoms at lunch and retiring hurt on 58. \n“It took a lot of courage to come out and bat, you could see he was struggling a fair bit, particularly when he was running between wickets,” said his Australian counterpart Steve Smith. \n“He’s a tough character so he must have been in a pretty bad way not to come out after the break.” \nRoot has come under fire for some of his decisions as captain over the series and failed to score a century with the bat but Anderson said his courage had typified his leadership in Australia. \n“To get to the ground in itself is a great effort and then to strap his pads on and bat for as long as he did was a brilliant effort from him and just shows what sort of character he is,” he said. \n“He wants to lead by example for this team. He’s been a fantastic captain throughout this tour.” Editing by Clare Fallon/Greg Stutchbury/Amlan Chakraborty", "external_links": [], "published": "2018-01-08T00:55:00.000+02:00", "crawled": "2018-01-08T01:13:44.000+02:00", "highlightTitle": ""}