{"organizations": [], "uuid": "512950603e190dc149344bc47610bc021c983286", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-intelligent-highway-solutions-finalizes-closing-of-fazync-corporation.html", "country": "US", "domain_rank": 767, "title": "Intelligent Highway Solutions Finalizes Closing of Fazync Corporation", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-10T17:00:00.000+02:00", "replies_count": 0, "uuid": "512950603e190dc149344bc47610bc021c983286"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/globe-newswire-intelligent-highway-solutions-finalizes-closing-of-fazync-corporation.html", "ord_in_thread": 0, "title": "Intelligent Highway Solutions Finalizes Closing of Fazync Corporation", "locations": [], "entities": {"persons": [{"name": "bob widner", "sentiment": "none"}, {"name": "devon jones", "sentiment": "none"}], "locations": [{"name": "sacramento", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "intelligent highway solutions finalizes closing of fazync corporation", "sentiment": "negative"}, {"name": "fazync, llc", "sentiment": "none"}, {"name": "inc.", "sentiment": "none"}, {"name": "tripac system, inc.", "sentiment": "none"}, {"name": "fazync corporation", "sentiment": "none"}, {"name": "tripac systems", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SACRAMENTO, Calif., Jan. 10, 2018 (GLOBE NEWSWIRE) -- via OTC PR WIRE -- Intelligent Highway Solutions, Inc. (OTC PINK:IHSI) announced today that the company has acquired 100% of Fazync Corporation and Fazync, LLC under more favorable terms vs the original agreement.\nCEO Devon Jones stated, \"We could not be more pleased with the results of this transaction. Mr. Bob Widner, the owner of Tripac System, Inc. has reached the point where his company's technology, Phase Angle Synchronization (PAS) that allows utility companies to recycle wasted electricity is \"plug and play\" ready. The revolutionary PAS Units require a small on-site footprint, but offer a massive impact as it pertains to energy savings and stress on utility infrastructure. All parties involved have determined that this is going to be a massive undertaking and will require specialized teams to handle the various aspects of the nationwide rollout and that's where Fazync comes in.\"\nMr. Bob Widner stated, \"Tripac Systems is currently setting up the infrastructure to handle the \"manufacturing\" component of the project. Fazync Corporation will work in conjunction as the \"installation\" arm of the rollout. Fazync will handle all marketing, installations, monitoring and maintenance of the units and capture significant revenue as a result of our joint efforts. The potential even in the short term is in the tens of millions, so we have already begun assembling a team of experts that will allow all entities involved to benefit tremendously.\"\nMr. Jones finished up with, \"We have already secured a facility in Sacramento, California in order to handle all aspects of our end of the operations and the square footage is more than enough for growth and expansion. Currently, there is an operational PAS Unit in place in our facility that has been set up for demonstrations for utility companies, energy service companies (ESCOs) and large commercial and industrial end users. We feel strongly that this new subsidiary provides tremendous revenue potential for our company as this technology is revolutionary and one of a kind. Over the past couple of months, there has been a flurry of activity to get us to this point and we'd like to thank our shareholders for their patience. We look forward to sharing more with you in the coming weeks and we thank you for your support.\"\nAbout Intelligent Highway Solutions, Inc.: Intelligent Highway Solutions, Inc. was formed in April 2011. IHSI provides technology driven solutions for commercial, industrial, and municipal facilities, from full-turn-key general contracting to LED lighting retrofits, HVAC and temperature control upgrades, to solar renewable energy systems, working with commercial developer, government and transportations sectors. Fazync technology is the first and only Phase Angle Synchronization technology that re-cycles electricity with the addition of Cresent Construction, North Carolina, and IHSI is a full-service general contractor providing design, installation and construction management services.\nForward Looking Statements: Any statements contained herein that are not historical facts are \"forward looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended and Section 21E of the Securities Exchange Act of 1934, as amended. These forward-looking statements are made subject to certain risks and uncertainties, which could cause actual results to differ materially from those presented. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only to the date such information was released. The Company undertakes no obligation to publicly revise these forward-looking statements to reflect events or circumstances that arise after release of this information.\nContact: Paul Knopick\nPknopick@eandecommunications.com\n940.262.3584\nSource:Intelligent Highway Solutions, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/bc7163d4-9e89-4bf6-8319-68150825a1e9", "https://www.globenewswire.com/Tracker?data=5Ldh-Ov-kqLVHJzZZcU80gPpqzdn216ySEZCvkm2c0FfbDZRN7Wov345bihDXXOp3Q6aRlF9JitmaHv1A6Uz0nP9ilG_O5NtpQY6WB7pY1_6G7ZDd_vDkm8IPFztPjDM"], "published": "2018-01-10T17:00:00.000+02:00", "crawled": "2018-01-10T18:51:37.002+02:00", "highlightTitle": ""}