{"organizations": [], "uuid": "8214c7b78fe734f09adc1b97af30a496cbac6d0d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-the-whole-child-names-constanza-pachon-as-ceo.html", "country": "US", "domain_rank": 767, "title": "The Whole Child Names Constanza Pachon As CEO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T18:03:00.000+02:00", "replies_count": 0, "uuid": "8214c7b78fe734f09adc1b97af30a496cbac6d0d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-the-whole-child-names-constanza-pachon-as-ceo.html", "ord_in_thread": 0, "title": "The Whole Child Names Constanza Pachon As CEO", "locations": [], "entities": {"persons": [{"name": "constanza pachon", "sentiment": "negative"}, {"name": "constanza", "sentiment": "none"}, {"name": "lyonel alexandre", "sentiment": "none"}], "locations": [{"name": "whittier", "sentiment": "none"}, {"name": "southern california", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "twc", "sentiment": "negative"}, {"name": "larta institute", "sentiment": "none"}, {"name": "board chair of twc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WHITTIER, Calif., Jan. 24, 2018 /PRNewswire/ -- The Whole Child (TWC), one of Southern California's leading agencies providing services for at-risk children and their families, announces the appointment of Constanza Pachon as Chief Executive Officer, effective January 17, 2018. Constanza's selection ends a rigorous search by TWC's board. \"We had several talented executives interested in our agency; Constanza's passion for our work and her record of success growing mission-driven organizations stood out,\" said Lyonel Alexandre, Board Chair of TWC. \"We looked to bring a new perspective to our industry and innovative ideas for TWC's role in today's world; Constanza brings both. We are fortunate to have her as our CEO and eager to see TWC's impact grow under her guidance,\" he added.\nConstanza brings over 15 years of experience in non-profit management to TWC. She is a highly regarded champion for numerous social and economic development initiatives both nationally and internationally. Most recently, she was President and COO of Larta Institute, a non-profit accelerator for startups developing science-based technologies that dramatically improve lives. During her tenure, Larta saw a nearly threefold increase in revenues, programs and staff; and became a thought leader in its field. Constanza has also served as senior consultant for InterAmerican Development Bank, World Bank, and United Nations on innovation and economic inclusion of at-risk groups. Constanza holds an MBA from The UCLA Anderson School of Management, and Master's and Bachelor's degrees in Economics from Javeriana University in her native country, Colombia.\n\"The proper development of children and families from underserved communities is an unparalleled building block of social inclusion and equity. The work being done at The Whole Child is at the forefront of this cause,\" said Constanza. \"I am honored to be TWC's next leader and look forward to partnering with its dedicated team and board to increase reach and impact. We will seek to improve the lives of many more families, and be a strong advocate for fairness in our region,\" she added.\nTWC has made a concerted effort to strengthen its staff at all levels; with the board focusing on bringing higher level of expertise to TWC's executive suite. \"Constanza joins TWC's COO, Dr. Franz Jordan, and CFO, Stacy Enomoto to form a stellar team that will surely advance our mission in exciting new ways,\" said Lyonel Alexandre. Dr. Jordan is a recognized authority in child welfare. Prior to TWC, he was with the Children's Bureau, one of Los Angeles most respected child services agencies, where he led a dramatic growth of their mental health programs and impact. \"I welcome Constanza into our team and look forward to working together to expand TWC's efforts to reverse the impact of poverty on the lives of families,\" said Dr. Jordan. Stacy Enomoto is a 30-year veteran of the financial management field with extensive experience in social services; prior to TWC, she led the finances of Canyon Acres, a mental health provider. \"I am excited to team up with Constanza and Franz to build upon TWC's strengths and create more opportunity for success for at-risk children,\" noted Stacy.\nThe Whole Child (TWC): Established in 1957, TWC is a leader in the fields of child and family emotional health, and family housing. TWC serves 10,000 families per year and is an advocate on behalf of at-risk children. The Whole Child's mission is to give children the skills, support and security they need to build emotionally healthy lives and become caring, responsible adults. Learn more at www.thewholechild.info\nView original content with multimedia: http://www.prnewswire.com/news-releases/the-whole-child-names-constanza-pachon-as-ceo-300587207.html\nSOURCE The Whole Child", "external_links": ["http://www.thewholechild.info/", "http://www.prnewswire.com/news-releases/the-whole-child-names-constanza-pachon-as-ceo-300587207.html"], "published": "2018-01-24T18:03:00.000+02:00", "crawled": "2018-01-24T19:29:21.000+02:00", "highlightTitle": ""}