{"organizations": [], "uuid": "f89a7dc38a443ba9e41b7857298dcf6c524b0159", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-customers-bancorp-expects-q4-2017-net-charge-from-tax-legislation-and-other-tax-strategies-of-less-than-2-million-or-0.html", "country": "US", "domain_rank": 767, "title": "Customers Bancorp Expects Q4 2017 Net Charge From Tax Legislation and Other Tax Strategies of Less Than $2 Million, or $0.06 Cents a Share", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T00:20:00.000+02:00", "replies_count": 0, "uuid": "f89a7dc38a443ba9e41b7857298dcf6c524b0159"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-customers-bancorp-expects-q4-2017-net-charge-from-tax-legislation-and-other-tax-strategies-of-less-than-2-million-or-0.html", "ord_in_thread": 0, "title": "Customers Bancorp Expects Q4 2017 Net Charge From Tax Legislation and Other Tax Strategies of Less Than $2 Million, or $0.06 Cents a Share", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "jay sidhu", "sentiment": "none"}], "locations": [{"name": "share wyomissing", "sentiment": "none"}, {"name": "pa.", "sentiment": "none"}], "organizations": [{"name": "customers bancorp, inc.", "sentiment": "neutral"}, {"name": "customers bancorp", "sentiment": "neutral"}, {"name": "nyse", "sentiment": "neutral"}, {"name": "customers bank", "sentiment": "none"}, {"name": "customers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WYOMISSING, Pa., Jan. 02, 2018 (GLOBE NEWSWIRE) -- Customers Bancorp, Inc. (NYSE:CUBI), the parent company of Customers Bank (collectively, “Customers”) today announced that as a result of the Tax Cuts and Jobs Act of 2017 (the “Act”), signed by President Donald Trump on December 22, 2017 and certain actions Customers has taken, it expects a fourth quarter of 2017 (“Q4 2017”) net impact to earnings and capital of less than $2 million, or $0.06 per share, which Customers expects will be quickly earned back through lower tax rates in 2018.\nBased on its initial analysis of the Act and September 30, 2017 balances of deferred tax assets and liabilities, Customers expects to record a net valuation adjustment in Q4 2017 between $8.0 million and $9.0 million, subject to further adjustment based on Q4 2017 operating results. Other items mitigate this amount, most notably an approximate $6.0 million Q4 2017 tax benefit from the exercise of employee stock options, including all vested options held by Chairman and Chief Executive Officer Jay Sidhu, which should reduce the net impact to less than $2.0 million in Q4 2017.\nCustomers estimates that the 14% reduction in federal income tax rate to 21% from 35%, will boost net income by approximately 22% in 2018 and future years. The company currently estimates a 2018 effective tax rate between 23.0% and 24.0%.\nSeparately, Customers stated that it successfully reduced its year-end balance sheet to approximately $9.9 billion in total assets in order to qualify for the Durbin Amendment small issuer exemption for purposes of assessing interchange fees through June 30, 2019. The reduction in balance sheet size had the added benefit of increasing capital ratios; lower taxes in 2018 will also benefit capital ratios in 2018 through increased retained earnings.\n“While the tax code changes will negatively affect Customers reported fourth quarter 2017 net income, we embrace the longer term benefits of a lower corporate tax rate and rationalization of the tax code,” stated Jay Sidhu, Chairman and Chief Executive Officer of Customers. “We are also pleased to report to our shareholders that the fourth quarter adverse effect on earnings of the new effective tax rates is largely offset by the gains realized by exercise of outstanding stock options by our employees and adoption of certain tax expense reducing strategies,” continued Mr. Sidhu. “And finishing 2017 with less than $10 billion in assets will give Customers until mid-year 2019 to divest BankMobile without losing interchange revenue,” concluded Mr. Sidhu.\nInstitutional Background\nCustomers Bancorp, Inc. is a bank holding company located in Wyomissing, Pennsylvania engaged in banking and related business through its bank subsidiary, Customers Bank. Customers Bank is a community-based, full-service bank with assets of approximately $9.9 billion at December 31, 2017 that was named by Forbes magazine as the 35th Best Bank in America (there are over 6,200 banks in the United States). A member of the Federal Reserve System with deposits insured by the Federal Deposit Insurance Corporation, Customers Bank is an equal opportunity lender that provides a range of banking services to small and medium-sized businesses, professionals, individuals and families through offices in Pennsylvania, New York, Rhode Island, Massachusetts, New Hampshire and New Jersey. Committed to fostering customer loyalty, Customers Bank uses a High Tech/High Touch strategy that includes use of industry-leading technology to provide customers better access to their money, as well as Concierge Banking® by appointment at customers’ homes or offices 12 hours a day, seven days a week. Customers Bank offers a continually expanding portfolio of loans to small businesses, multi-family projects, mortgage companies and consumers.\nCustomers Bancorp, Inc.'s voting common shares are listed on the New York Stock Exchange under the symbol CUBI. Additional information about Customers Bancorp, Inc. can be found on the Company’s website, www.customersbank.com .\n“Safe Harbor” Statement\nIn addition to historical information, this press release may contain \"forward-looking statements\" within the meaning of the \"safe harbor\" provisions of the Private Securities Litigation Reform Act of 1995. These forward-looking statements include statements with respect to Customers Bancorp, Inc.'s strategies, goals, beliefs, expectations, estimates, intentions, capital raising efforts, financial condition and results of operations, future performance and business. Statements preceded by, followed by, or that include the words \"may,\" \"could,\" \"should,\" \"pro forma,\" \"looking forward,\" \"would,\" \"believe,\" \"expect,\" \"anticipate,\" \"estimate,\" \"intend,\" \"plan,\" or similar expressions generally indicate a forward-looking statement. These forward-looking statements involve risks and uncertainties that are subject to change based on various important factors (some of which, in whole or in part, are beyond Customers Bancorp, Inc.'s control). Numerous competitive, economic, regulatory, legal and technological factors, among others, could cause Customers Bancorp, Inc.'s financial performance to differ materially from the goals, plans, objectives, intentions and expectations expressed in such forward-looking statements. In addition, important factors relating to the acquisition of the Disbursements business, the combination of Customers’ BankMobile business with the acquired Disbursements business, the implementation of Customers Bancorp, Inc.'s strategy regarding BankMobile, the possibility of events, changes or other circumstances occurring or existing that could result in the planned spin-off and merger of BankMobile not being completed, the possibility that the planned spin-off and merger of BankMobile may be more expensive to complete than anticipated, the possibility that the expected benefits of the planned transactions to Customers and its shareholders may not be achieved, the possibility of Customers incurring liabilities relating to the disposition of BankMobile, or the possible effects on Customers’ results of operations if the planned spin-off and merger of BankMobile are not completed in a timely fashion or at all also could cause Customers Bancorp's actual results to differ from those in the forward-looking statements. Customers Bancorp, Inc. cautions that the foregoing factors are not exclusive, and neither such factors nor any such forward-looking statement takes into account the impact of any future events. Further, Customers’ expectations with respect to the effects of the new tax law could be affected by future clarifications, amendments, and interpretations of such law. All forward-looking statements and information set forth herein are based on management's current beliefs and assumptions as of the date hereof and speak only as of the date they are made. For a more complete discussion of the assumptions, risks and uncertainties related to our business, you are encouraged to review Customers Bancorp, Inc.'s filings with the Securities and Exchange Commission, including its most recent annual report on Form 10-K for the year ended December 31, 2016, subsequently filed quarterly reports on Form 10-Q and current reports on Form 8-K that update or provid", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/c1e9d6a4-9b38-42c1-b321-ac386fc28317"], "published": "2018-01-03T00:20:00.000+02:00", "crawled": "2018-01-03T02:22:30.027+02:00", "highlightTitle": ""}