{"organizations": [], "uuid": "6a91d8ce6a38c97818e0cbd6439b8285119e0e17", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-park-national-bank-announces-plan-to-welcome-newdominion-bank-into-organization-in-2018.html", "country": "US", "domain_rank": 767, "title": "Park National Bank announces plan to welcome NewDominion Bank into organization in 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T16:20:00.000+02:00", "replies_count": 0, "uuid": "6a91d8ce6a38c97818e0cbd6439b8285119e0e17"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-park-national-bank-announces-plan-to-welcome-newdominion-bank-into-organization-in-2018.html", "ord_in_thread": 0, "title": "Park National Bank announces plan to welcome NewDominion Bank into organization in 2018", "locations": [], "entities": {"persons": [{"name": "park", "sentiment": "none"}], "locations": [{"name": "newark", "sentiment": "none"}, {"name": "charlotte", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}, {"name": "n.c.", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "charlotte", "sentiment": "none"}], "organizations": [{"name": "park national bank", "sentiment": "negative"}, {"name": "newdominion bank", "sentiment": "negative"}, {"name": "park national corporation", "sentiment": "negative"}, {"name": "newdominion", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEWARK, Ohio and CHARLOTTE, N.C., Jan. 23, 2018 (GLOBE NEWSWIRE) -- Park National Corporation (Park) (NYSE AMERICAN:PRK) and NewDominion Bank (NewDominion) (OTCPINK:NDMN) have signed a definitive agreement and plan of merger, in which NewDominion will become a community bank division of Park’s subsidiary The Park National Bank. The merger will allow NewDominion to strengthen its community banking success, achieve new growth goals as a company and broaden its services, such as larger and more specialized loans and wealth management capabilities. NewDominion will keep its name, local leadership and board, and maintain local decision-making and community support. NewDominion’s mission, vision and core values will continue to be at the center of every client interaction and their executive team will remain headquartered in Charlotte, North Carolina.\nIn November 2016, Park made a friendly investment of $3.5 million in NewDominion, giving Park 8.55 percent current ownership of NewDominion’s outstanding common stock. Yesterday, the boards of directors of both Park and NewDominion unanimously approved a merger transaction, which is expected to close mid-year of 2018.\n“This is an exciting time for our company and clients. I’m so proud of the commitment and effort our teammates have made to transform our bank and look forward to seeing the even greater impact we’ll be able to make in our community and with our clients across the region,” said NewDominion Chief Executive Officer J. Blaine Jackson. “Having the strength of Park National Bank behind us is going to take us all, our clients included, to the next level.”\nNewDominion holds $338 million in assets (as of December 31, 2017) and operates two banking offices, in downtown Charlotte and Mooresville, respectively. At December 31, 2017 it had $282 million in deposits and $284 million in loans. NewDominion recently announced that 2017 was its most successful year in its 13-year history. Loans grew by 14 percent and deposits grew by 9 percent.\nPark is a well-capitalized organization with eleven community banking divisions. By adding operations in a metropolitan market like Charlotte, Park intends to build on its successful performance in similar areas like Columbus and Cincinnati, Ohio. “The bankers at NewDominion are a welcome addition to our organization. We have common values and principles regarding community banking and delivering extraordinary service. This partnership is an excellent opportunity to create value for both organizations,” Park Chief Executive Officer David L. Trautman said. “Blaine Jackson and his team are doing great work in a thriving city, and we can provide them new and enhanced options to offer their personal and business clients. We share their enthusiasm and confidence, and look forward to supporting them as they continue NewDominion’s success.”\nUnder the terms of the merger agreement, Park will pay $76.4 million to acquire the remaining 91.45 percent of NewDominion shares and options. NewDominion shareholders can elect to receive either 0.01023 shares of Park common stock or $1.08 in cash for each share of NewDominion common stock owned, subject to proration such that the total consideration related to this transaction will consist of approximately 60 percent Park common stock and 40 percent cash. The agreement, in which NewDominion will merge with and into The Park National Bank, is subject to approval by NewDominion Bank’s shareholders, regulatory approvals and other customary closing conditions.\nThe Park National family of community banks consists of eleven banking divisions, each led by local professionals. The banks share operational, compliance and administrative resources, placing them in a strong position to remain competitive with sophisticated technology and service capabilities – while keeping a steadfast focus on personalized service and community involvement.\nBoenning & Scattergood, Inc. is serving as financial advisor and Squire Patton Boggs US LLP is serving as legal advisor to Park.\nSandler O’Neill is serving as financial advisor and Wyrick Robbins Yates & Ponton LLP is serving as legal advisor to NewDominion.\nHeadquartered in Newark, Ohio, Park National Corporation had $7.5 billion in total assets (as of December 31, 2017). The Park organization principally consists of 11 community bank divisions, a non-bank subsidiary and two specialty finance companies. Park's Ohio-based banking operations are conducted through Park subsidiary The Park National Bank and its divisions, which include Fairfield National Bank Division, Richland Bank Division, Century National Bank Division, First-Knox National Bank Division, Farmers Bank Division, United Bank, N.A. Division, Second National Bank Division, Security National Bank Division, Unity National Bank Division, and The Park National Bank of Southwest Ohio & Northern Kentucky Division; and Scope Leasing, Inc. (d.b.a. Scope Aircraft Finance). The Park organization also includes Guardian Financial Services Company (d.b.a. Guardian Finance Company) and SE Property Holdings, LLC.\nPark National Media Contact: Bethany Lewis, 740.349.0421, blewis@parknationalbank.com\nPark National Investor Contact: Brady Burt, 740.322.6844, bburt@parknationalbank.com\nNewDominion Bank Contact: MaryBeth Simon, 704-943-5708, msimon@newdominionbank.com\nImportant Information About the Merger:\nPark will file with the Securities and Exchange Commission (the “SEC”) a Registration Statement on Form S-4 that will include a Proxy Statement of NewDominion and a Prospectus of Park, as well as other relevant documents concerning the proposed transaction. SHAREHOLDERS OF NEWDOMINION ARE URGED TO READ THE REGISTRATION STATEMENT AND THE PROXY STATEMENT/PROSPECTUS REGARDING THE MERGER WHEN IT BECOMES AVAILABLE, AND ANY OTHER RELEVANT DOCUMENTS FILED WITH THE SEC, AS WELL AS ANY AMENDMENTS OR SUPPLEMENTS TO THOSE DOCUMENTS, BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION ABOUT PARK, PARK NATIONAL BANK, NEWDOMINION AND THE PROPOSED TRANSACTION.\nA free copy of the Proxy Statement/Prospectus, as well as other filings containing information about Park and NewDominion, may be obtained at the SEC’s Internet site ( http://www.sec.gov ). You will also be able to obtain these documents, free of charge, from Park at the “Investor Information” section of Park's web site at www.parknationalcorp.com or from NewDominion at the “Investor Relations” section of NewDominion’s website at www.newdominionbank.com . Copies of the Proxy Statement/Prospectus can also be obtained, free of charge, by directing a request to Park National Corporation, 50 North Third Street, P.O. Box 3500, Newark, OH 43058-3500, Attention: Investor Relations, Telephone: (740) 322 6844 or to NewDominion Bank, PO Box 37389, Charlotte, NC 28237, Attention: Investor Relations, Telephone: (704) 943-5725. This communication shall not constitute an offer to sell or the solicitation of an offer to buy securities nor shall there be any sale of securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of such jurisdiction. This communication is also not a solicitation of any vote in any jurisdiction pursuant to the proposed transactions or otherwise. No offer of securities or solicitation will be made except by means of a prospectus meeting the requirements of Section 10 of the Securities Act of 1933, as amended. The communication is not a substitute for the Registration Statement that will be filed with the SEC or the Proxy Statement/Prospectus that will be sent to NewDominion shareholders.\nForward –Looking Statement:\nCertain statements contained in this communication which are not statements of historical fact constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Such forward-looking statements can often, but not always, be identified by the use of words like “believe”, “continue”, “pattern”, “estimate”, “project”, “intend”, “anticipate”, “expect” and similar expressions or future or conditional verbs such as “will”, “would”, “should”, “could”, “might”, “can”, “may”, or similar expressions. These forward-looking statements include, but are not limited to, statements relating to the expected timing and benefits of the proposed merger (the “Merger”) between Park, The Park National Bank and NewDominion, including future financial and operating results, cost savings, enhanced revenues, and accretion/dilution to reported earnings that may be realized from the Merger, as well as other statements of expectations regarding the Merger, and other statements of Park’s goals, intentions and expectations; statements regarding the Park’s business plan and growth strategies; statements regarding the asset quality of Park’s loan and investment portfolios; and estimates of Park’s risks and future costs and benefits, whether with respect to the Merger or otherwise. These forward-looking statements are subject to significant risks, assumptions and uncertainties that may cause results to differ materially from those set forth in forward-looking statements, including, among other things: the risk that the businesses of Park and NewDominion will not be integrated successfully or such integration may be more difficult, time-consuming or costly than expected; expected revenue synergies and cost savings from the Merger may not be fully realized or realized within the expected time frame; revenues following the Merger may be lower than expected; customer and employee relationships and business operations may be disrupted by the Merger; the ability to obtain required governmental and shareholder approvals, and the ability to complete the Merger on the expected timeframe; possible changes in economic and business conditions; the existence or exacerbation of general geopolitical instability and uncertainty; the ability of Park to integrate recent acquisitions and attract new customers; possible changes in monetary and fiscal policies, and laws and regulations; the effects of easing restrictions on participants in the financial services industry; the cost and other effects of legal and administrative cases; possible changes in the credit worthiness of customers and the possible impairment of collectability of loans; fluctuations in market rates of interest; competitive factors in the banking industry; changes in the banking legislation or regulatory requirements of federal and state agencies applicable to bank holding companies and banks like Park’s affiliate bank; continued availability of earnings and excess capital sufficient for the lawful and prudent declaration of dividends; and changes in market, economic, operational, liquidity, credit and interest rate risks associated with the Park’s business. Please refer to Park’s Annual Report on Form 10-K for the year ended December 31, 2016, as well as its other filings with the SEC, for a more detailed discussion of risks, uncertainties and factors that could cause actual results to differ from those discussed in the forward-looking statements. All forward-looking statements included in this communication are made as of the date hereof and are based on information available as of the date hereof. Except as required by law, none of Park, Park National Bank or NewDominion assumes any obligation to update any forward-looking statement.\nProxy Solicitation\nNewDominion and certain of its directors, executive officers and certain other persons may be deemed to be participants in the solicitation of\nproxies from NewDominion’s shareholders in favor of the approval of the Merger.. Information about the directors and executive officers of NewDominion and their ownership of NewDominion common stock, as well as information regarding the interests of other persons who may be deemed participants in the transaction, may be obtained by reading the Proxy Statement/Prospectus regarding the proposed merger when it becomes available. Free copies of this document may be obtained as described above.\nSource:Park National Corporation", "external_links": ["https://www.globenewswire.com/Tracker?data=FDLVM0YOFNSIIHtu5zCI329yYMxb8IKiSyouGzjqG418zVUOKD5Vl-Jh6IuDgm_deQtXwycoDrAd1S_UqP3aDYfDrqHspbZKn3whreGz_mL6mhEqHoil8vQ3eHskkIJf", "https://www.globenewswire.com/NewsRoom/AttachmentNg/1414f431-8f52-4615-b3ba-ca4130aadda9", "https://www.globenewswire.com/Tracker?data=LmR12VBZvg1HrJC_tZzz_igXSFfvDe4YNBmLVmACUBI16obUa2R_lYzCOpmPlkXPOQQIWyWE2JBOA2GNMlbsgJ_Stg4_JW4aOFnq6lAB_S5YSZhSxX52MuUbfSI1Myxh", "https://www.globenewswire.com/Tracker?data=12OJl1vsOqSM8wGwY4QL0kqrEqqHTyxoRd7GytuKpSovxLLObRFmzwcSzMuVFQQIbBFJ4SvmzrYbalLNhsH5kx0F7aPnApeL9OMSOMtoRjKtWHxaKA1r1HFZu2dCDozq"], "published": "2018-01-23T16:20:00.000+02:00", "crawled": "2018-01-23T17:34:08.031+02:00", "highlightTitle": ""}