{"organizations": [], "uuid": "e36970d9c87edafaa52b47fb5deb6d335d00025e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226660836&w=1200&r=LYNXMPEE0T19Q", "site_section": "https://www.reuters.com/finance/commodities", "section_title": "Commodities News, Commodity Trading Prices &amp; Data | Reuters.com", "url": "https://www.reuters.com/article/us-vale-cobalt-streaming/exclusive-vale-at-work-on-pioneering-canadian-cobalt-stream-deal-sources-idUSKBN1FJ2EX", "country": "US", "domain_rank": 408, "title": "Exclusive: Vale at work on pioneering Canadian cobalt stream deal - sources", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.264, "site_type": "news", "published": "2018-01-31T01:10:00.000+02:00", "replies_count": 0, "uuid": "e36970d9c87edafaa52b47fb5deb6d335d00025e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-vale-cobalt-streaming/exclusive-vale-at-work-on-pioneering-canadian-cobalt-stream-deal-sources-idUSKBN1FJ2EX", "ord_in_thread": 0, "title": "Exclusive: Vale at work on pioneering Canadian cobalt stream deal - sources", "locations": [], "entities": {"persons": [], "locations": [{"name": "democratic republic of congo", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "positive"}, {"name": "vale", "sentiment": "positive"}, {"name": "volkswagen", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JOHANNESBURG/LONDON (Reuters) - Brazilian miner Vale is seeking to sell un-mined cobalt worth hundreds of millions of dollars to investors, as speculation rises over a shortage of the metal needed to make batteries, sources familiar with the matter said.\nSuch streaming, which allows an investor to make an upfront payment in exchange for future production at a discounted price, has expanded as a form of finance for precious and base metals companies but this deal would be a first for the booming cobalt sector.\nCobalt is a critical component in rechargeable lithium-ion batteries and its price has benefited from a push by governments and automakers to promote electric vehicles to cut emissions from diesel and petrol cars.\nPrices have soared by nearly 150 percent since the beginning of last year to around $80,000 a tonne, spurred in part by nervousness about reliance on top cobalt producer Democratic Republic of Congo, which is plagued by pockets of lawlessness and conflict.\nCarmakers such as Volkswagen ( VOWG_p.DE ) have sought contracts to lock in long-term supplies of cobalt for their ambitious electric vehicle plans.\nCobalt extends battery life. Analysts estimate each battery uses between 8-12 kg of the metal, while the overall market is estimated at just over 100,000 tonnes a year.\nVale has hired Canada’s Bank of Montreal (BMO) to raise around $500 million from bidders for cobalt that will be produced at its Voisey’s Bay nickel mine in eastern Canada, four sources said.\n“BMO is also going out to talk to the automakers and battery producers, people like Samsung and Toyota,” one of the sources said. Samsung said it did not comment on rumor or speculation and Toyota had no immediate comment.\nThe process started at the end of December, with prospective buyers reviewing the information, two of the sources said.\nA Vale spokesman in Canada declined to comment. BMO did not respond to a request for comment.\nThere is no certainty the process will result in a deal, the sources said. The people, to whom Reuters spoke over a period of several days, declined to be named as the talks were confidential.\nThe deal could provide the winning bidder with up to 3,000 tonnes of cobalt for production starting in 2020, one of the sources said. Around 2,000 tonnes would be delivered in the first 10 years, with the remaining 1,000 in the next 10.\nFor world’s No.1 iron ore producer Vale this is “a smart way of financing the underground expansion of Voisey’s Bay”, one of the sources said.\nVale could welcome the cash as it continues to deal with the repercussions of Brazil’s worst environmental disaster at Samarco, a dam designed to hold back mine waste that was inundated by flood waters in 2015 and has since remained closed.\nSMALL MARKET COMPLICATES TALKS The source said negotiating a price for a streaming deal in cobalt could be complicated by the limited size of its market.\n“No one has done a cobalt streaming deal before and how you price it, given that it is not a liquid market, is very difficult,” the source said. “But because cobalt is in short supply and there’s a squeeze in anticipation of a surge in demand for electric vehicles, then you’ll get interest.”\nMining streaming companies such as Franco Nevadaand Wheaton Precious Metals Corp are expected to take a look, the sources said.\nWheaton declined to comment and Franco-Nevada did not respond to a request for comment.\nOthers that could be interested include Cobalt 27,which buys cobalt to give investors an easier way to get exposure to the metal; U.S. private equity firm Orion MineFinance Group and BaseCore Metals, a new royalty joint venture between Glencore; and Canada’s Ontario Teachers Pension Plan.\nCobalt 27 and Orion declined to comment, as did Glencore.\nVale in 2015 approved construction of an underground mine at Voisey’s Bay that should extend the mine life by about 15 years to 2035 as the open pit mine runs out of ore. Last year its lowed underground development because of weak nickel prices and a company-wide assets review.\nVale last year also tried to sell a stake in its nickel-cobalt Goro mine in New Caledonia but decided to postpone the sale after initial bids were lower than expected, Reuters reported in November.\nAdditional reporting by Nicole Mordant in Vancouver and Susan Taylor in Toronto; Editing by Alison Williams\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-31T01:10:00.000+02:00", "crawled": "2018-01-31T04:29:00.005+02:00", "highlightTitle": ""}