{"organizations": [], "uuid": "976c98465aed6a8e6399ec6bfa71c53649baf569", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220298938&w=1200&r=LYNXMPEE0706Q", "site_section": "http://feeds.reuters.com/reuters/INentertainmentNews\r", "section_title": "Reuters: Entertainment News", "url": "https://in.reuters.com/article/us-awards-goldenglobes-oprah/oprah-winfrey-claims-lifetime-golden-globe-calls-for-a-new-day-idINKBN1EX08F", "country": "US", "domain_rank": 408, "title": "Oprah for president? Winfrey fans urge White House run after #MeToo speech", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T17:45:00.000+02:00", "replies_count": 0, "uuid": "976c98465aed6a8e6399ec6bfa71c53649baf569"}, "author": "", "url": "https://in.reuters.com/article/us-awards-goldenglobes-oprah/oprah-winfrey-claims-lifetime-golden-globe-calls-for-a-new-day-idINKBN1EX08F", "ord_in_thread": 0, "title": "Oprah for president? Winfrey fans urge White House run after #MeToo speech", "locations": [], "entities": {"persons": [{"name": "oprah", "sentiment": "negative"}, {"name": "winfrey", "sentiment": "negative"}, {"name": "oprah winfrey", "sentiment": "none"}, {"name": "paul drinkwater/courtesy", "sentiment": "none"}, {"name": "cecil b. demille", "sentiment": "none"}], "locations": [{"name": "white house", "sentiment": "none"}, {"name": "beverly hills", "sentiment": "none"}, {"name": "hollywood", "sentiment": "none"}, {"name": "golden globes", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "white house", "sentiment": "negative"}, {"name": "cnn", "sentiment": "none"}, {"name": "nichola groom", "sentiment": "none"}, {"name": "own", "sentiment": "none"}, {"name": "min read  los angeles", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES (Reuters) - Oprah Winfrey fans lit up Twitter on Monday with calls for her to run for U.S. president after the entertainment star gave an inspiring “new day” speech at an awards show in support of those who have exposed sexual misconduct in Hollywood and beyond.\nA surge of tweets carrying “#Oprahforpresident” and “#Oprah2020” hashtags followed her speech at the Golden Globes, where Winfrey became the first black woman to receive a lifetime achievement award on Sunday.\nWinfrey, an actress, movie and television producer, and chief executive of her OWN cable channel, is actively thinking about a run, CNN reported on Monday, citing two of her close friends. CNN did not name the friends, who it said had spoken on condition of anonymity.\nAt least one emphasized that Winfrey had made no firm decision on a run.\nSunday’s award ceremony honored Winfrey, 63, as a role model for women and a person who has promoted strong female characters.\n“In a 9 minute speech, @Oprah was more presidential than the current occupant of the White House has been for an entire year,” wrote Khary Penebaker, a member of the Democratic National Committee, on Twitter, referring to Republican President Donald Trump.\n“That speech was everything. #timesup #oprahforpresident,” tweeted Boston television personality Cassy Arsenault in one of many calls for Winfrey to run in the next U.S. presidential election, in November 2020.\nTrump also powered his successful 2016 campaign on the back of his celebrity reputation from reality TV show “The Apprentice,” as well as long-cultivated attention in New York newspapers.\nIn recent years, Winfrey has lent her star power to endorse Democratic presidential candidates: Barack Obama when he was seeking to become the first black U.S. president in 2008 and Hillary Clinton in her campaign against Trump in 2016.\nIn the past, Winfrey has said she is not interested in running for president, for example saying in a CBS interview in October when asked about the 2020 presidential election that, “There will be no running for office of any kind for me.”\nOprah Winfrey speaks after accepting the Cecil B. Demille Award at the 75th Golden Globe Awards in Beverly Hills, California, U.S. January 7, 2018. Paul Drinkwater/Courtesy of NBC/Handout via REUTERS However, the Los Angeles Times Quote: d Stedman Graham, Winfrey’s longtime partner in business and life, as saying on Sunday that “It’s up to the people ... She would absolutely do it.”\nThe awards show, Hollywood’s first leading up to the Oscars, was dominated by a scandal that has seen dozens of powerful men in U.S. entertainment, politics and the media accused of sexual abuse or harassment.\nWinfrey, who along with most of the show’s other women attendees wore a black gown to show support for victims of sexual misconduct, was the first black woman to receive the annual Cecil B. DeMille award, joining the likes of Meryl Streep, Steven Spielberg, Barbra Streisand and Sophia Loren.\n‘NEW DAY’ FOR GIRLS AND WOMEN\nSlideshow (3 Images) Winfrey used her speech to praise women who have shared their stories of sexual harassment and abuse, and to declare that “a new day is on the horizon” for girls and women.\n“When that new day finally dawns it will be because of a lot of magnificent women, many of whom are in this room tonight, and some pretty phenomenal men, fighting hard to make sure they become leaders that take us to the time where nobody has to say ‘me too’ again,” Winfrey said, referring to the #MeToo social media movement raising awareness about sexual harassment.\nWinfrey was raised in poverty by a single mother and went on to host the top-rated talk show “The Oprah Winfrey Show” for 25 years before ending it in 2011.\n“I want to express gratitude to all the women who have endured years of abuse and assault because they, like my mother, had children to feed and bills to pay and dreams to pursue.”\nShe produced and acted in the 2014 civil rights movie “Selma,” and 2017’s “The Immortal Life of Henrietta Lacks” and was Oscar nominated in 1986 for her role in “The Color Purple,” which she later helped finance as Broadway musical.\nEven after ending her daily talk show, her influence on popular culture remains strong.\nForbes last year estimated her net worth at $3 billion and placed her third on its list of the America’s richest self-made women.\nReporting by Jill Serjeant; Editing by Sandra Maler, Scott Malone and Frances Kerry\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-08T17:45:00.000+02:00", "crawled": "2018-01-08T18:11:28.003+02:00", "highlightTitle": ""}