{"organizations": [], "uuid": "0189de405dd79725942be68fbfbfcc45e8793fe9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222700439&w=1200&r=LYNXMPEE0G0NT", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-usa-harassment-helplines/metoo-effect-calls-flood-u-s-sexual-assault-hotlines-idUKKBN1F6196", "country": "US", "domain_rank": 408, "title": "#MeToo effect - Calls flood U.S. sexual assault hotlines", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T13:07:00.000+02:00", "replies_count": 0, "uuid": "0189de405dd79725942be68fbfbfcc45e8793fe9"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-harassment-helplines/metoo-effect-calls-flood-u-s-sexual-assault-hotlines-idUKKBN1F6196", "ord_in_thread": 0, "title": "#MeToo effect - Calls flood U.S. sexual assault hotlines", "locations": [], "entities": {"persons": [{"name": "lisa lamber", "sentiment": "negative"}, {"name": "weinstein", "sentiment": "none"}, {"name": "harvey weinstein", "sentiment": "none"}, {"name": "rainn", "sentiment": "none"}, {"name": "alyssa milano", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "national sexual assault hotline", "sentiment": "none"}, {"name": "abuse & incest national network", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 08 AM / Updated 15 minutes ago #MeToo effect - Calls flood U.S. sexual assault hotlines Lisa Lambert 3 Min Read \nWASHINGTON (Reuters) - The phones at U.S. sexual assault hotlines have been ringing in record numbers as the #MeToo social movement spurs victims to reach out for help, sending organizations scrambling to keep up. \nCalls spiked when the movement began in October, with people waiting up to three hours to talk to someone at the country’s largest one, the National Sexual Assault Hotline. \nThe number of calls to the hotline operated by the Rape, Abuse & Incest National Network (RAINN) surged 25 percent in November from a year earlier, and another 30 percent in December, according to RAINN. Its 209,480 total calls in 2017 were the most for any year since its founding in 1993. \nLast fall, actress Alyssa Milano of the television show “Charmed” asked women who had been sexually assaulted or harassed to post “Me Too” in response to allegations made against movie mogul Harvey Weinstein. \nWeinstein, accused of sexual abuse by dozens of women, has denied having nonconsensual sexual contact with anyone. Reuters has not been able to independently confirm the accusations. Volunteers on the National Sexual Assault Hotline work both over the phone and via web chat at the offices of the U.S.'s largest anti-sexual violence organization, the Rape Abuse Incest National Network, in Washington, U.S., January 12, 2018. Picture taken January 12, 2018. REUTERS/James Lawler Duggan \nAt the national hotline’s call centre, the lights that workers flip on to indicate they are on the phone never seemed to turn off, said Celia Gamboa, a manager at the national hotline. The chat app most callers prefer was flooded with messages, she said. The #MeToo movement almost always came up. \n“It wasn’t just a one-time thing,” Gamboa said. “We’re just going to continue to see that type of flow into the future.” Slideshow (4 Images) \nRAINN added 40 employees to its staff of 200 and stepped up volunteer recruiting, said CEO Scott Berkowitz. That has helped chip away at the wait times, he said. \nElsewhere, Network for Victim Recovery of D.C. saw a spike in calls about sexual harassment. Executive Director Bridgette Stumpf said that unfortunately, the centre can often only recommend private attorneys for people whose harassment did not include violence, adding such help may be too expensive for many victims. \nThe DC Rape Crisis Center now sees an average of 70 people a week seeking legal, physical or psychological help, up from 30 to 40 before #MeToo, said Executive Director Indira Henard. It also saw a bump in donations last fall following the #MeToo postings. \n“It is for the record books,” Henard said. “I don’t believe there has ever been a time in our history when we talked about sexual violence and its impact this way.” Reporting by Lisa Lambert; Editing by Scott Malone and David Gregorio", "external_links": [], "published": "2018-01-17T13:07:00.000+02:00", "crawled": "2018-01-17T13:31:46.045+02:00", "highlightTitle": ""}