{"organizations": [], "uuid": "eb6c32becb8fea0df4ee9589052da38ffde80d3e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223353706&w=1200&r=LYNXMPEE0I0YD", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-germany-politics-spd-factbox/factbox-what-happens-if-germanys-spd-refuse-to-hold-talks-with-merkel-idUSKBN1F81MM", "country": "US", "domain_rank": 408, "title": "Factbox: What happens if Germany's SPD refuse to hold talks with Merkel?", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T22:11:00.000+02:00", "replies_count": 0, "uuid": "eb6c32becb8fea0df4ee9589052da38ffde80d3e"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-germany-politics-spd-factbox/factbox-what-happens-if-germanys-spd-refuse-to-hold-talks-with-merkel-idUSKBN1F81MM", "ord_in_thread": 0, "title": "Factbox: What happens if Germany's SPD refuse to hold talks with Merkel?", "locations": [], "entities": {"persons": [{"name": "merkel", "sentiment": "negative"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "martin schulz", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "spd", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BERLIN (Reuters) - Germany’s Social Democrats (SPD) vote on Sunday on whether to start full-blown coalition negotiations with Angela Merkel’s conservatives, in what is the chancellor’s best bet of extending her 12-year run at the helm of Europe’s largest economy.\nThe result is far from clear, despite an appeal from SPD leader Martin Schulz for party members to back a re-run of their ‘grand coalition’ with the conservatives that has governed Germany for the past four years.\nThe SPD’s share of the vote in last September’s election dropped to its lowest level since Germany became a federal republic in 1949, and many members fear another four years in coalition with Merkel will further erode their support base.\nA coalition blueprint agreed between the conservatives and the SPD last week left many in the center-left party feeling the SPD leadership had not pushed through enough of their own agenda. Some also worry about the far-right Alternative for Germany (AfD) gaining influence as the largest opposition party if there is a ‘grand coalition’.\nHere’s an outline of what will happen if SPD delegates vote against coalition talks.\n- The onus shifts to President Frank-Walter Steinmeier to decide how to proceed. He would meet with Merkel and could urge her conservatives, the liberal Free Democrats (FDP) and the Greens to launch a second attempt to form a three-way alliance. But these unnatural partners are unlikely to want to join forces after their initial attempt collapsed in November when the FDP spectacularly walked out of talks, eroding trust between them.\n- Merkel - or another candidate if her conservatives take the unlikely decision to oust her - could decide to head up a minority government in what would be a post-war first for Germany. Merkel has previously said she would prefer new elections to a minority government. If she were to form such a government, however, the procedure would be as follows:\n- Steinmeier would set a date for a ‘chancellor vote’ in the Bundestag lower house of parliament and suggest Merkel run. If she gets an absolute majority, she becomes chancellor.\n- If she fails to get an absolute majority in that first round of voting, another vote can be held within 14 days.\n- If she fails to get an absolute majority in the second round, a third vote is held. If she gets a plurality in that vote, Steinmeier would need to appoint her chancellor within seven days. If she does not get a plurality, Steimeier would have seven days to decide whether to appoint her as a minority chancellor or dissolve parliament and call for new elections.\n- If Steinmeier were to call new elections, they would take place within 60 days. While Merkel’s personal ratings are slipping, she has said she would want to run for the conservatives if another poll is held.\n- Once Merkel has become chancellor, she could ask for a confidence vote in parliament. She could force new elections by urging her allies and other lawmakers to vote against her.\nReporting by Michelle Martin and Matthias Sobolewski; additional reporting by Paul Carrel; Editing by Gareth Jones\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T22:11:00.000+02:00", "crawled": "2018-01-20T17:42:17.009+02:00", "highlightTitle": ""}