{"organizations": [], "uuid": "c41bab492aa1a11ec3947781e9d90c2ab5e51180", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219324556&w=1200&r=LYNXMPEE030TQ", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-macys-results/macys-holiday-same-store-sales-rise-one-percent-to-close-stores-cut-jobs-idUSKBN1ET1I4", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Macy's holiday same-store sales rise; to close stores, cut jobs", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T16:17:00.000+02:00", "replies_count": 0, "uuid": "c41bab492aa1a11ec3947781e9d90c2ab5e51180"}, "author": "", "url": "https://www.reuters.com/article/us-macys-results/macys-holiday-same-store-sales-rise-one-percent-to-close-stores-cut-jobs-idUSKBN1ET1I4", "ord_in_thread": 0, "title": "UPDATE 1-Macy's holiday same-store sales rise; to close stores, cut jobs", "locations": [], "entities": {"persons": [{"name": "macy", "sentiment": "none"}], "locations": [], "organizations": [{"name": "macy", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "amazon.com inc", "sentiment": "none"}, {"name": "macy’s", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "macy’s inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Macy’s Inc ( M.N ) shares dropped as much as 7 percent on Thursday after it reported only modest growth in holiday sales and said it would close stores and slash thousands of jobs this year.\nThe 1 percent rise in comparable store sales came after industry watchers forecast a record season for U.S. retailers. Macy’s had said it would keep inventory tight for the holidays as it works to fend off competition from online sellers like Amazon.com Inc ( AMZN.O ).\nThe department store operator said it would save about $300 million in costs by shuttering 11 stores, cutting and hiring staff, and streamlining areas including human resources. Macy’s spokeswoman Blair Rosenberg said those changes would mean a net loss of some 5000 jobs.\nMacy’s shares had surged 44 percent since early November, when it forecast a jump in online sales that fueled optimism for its prospects in the crucial holiday quarter.\nOther department store operators also tumbled, with J.C. Penney Co Inc ( JCP.N ) and Sears Holdings ( SHLD.O ) each down 7 percent and Kohl’s Corp ( KSS.N ) down 5 percent.\nMacy‘s, which also owns luxury chain Bloomingdale‘s, has been focused on streamlining operations amid intense competition from rival department stores and online retailers.\nThe store closures and job cuts signal another year of change and disruption at Macy’s and outweigh the modest year-over-year sales growth during the holiday quarter, said Neil Saunders, managing director of GlobalData Retail.\n“One percent growth isn’t that good in the context of the market as this has been a robust Christmas and consumers have been out spending,” Saunders said, adding that Macy’s had underperformed against rivals and likely lost market share.\nMacy’s in-store and online market share shrunk between Thanksgiving and the first week of December compared with the same period last year, according to data from Earnest Research, which tallies anonymous card transactions of millions of U.S. shoppers.\nMacy’s shares were last down 4.4 percent at $24.21.\nWIDER CHEER STILL EXPECTED Still, the wider retail industry is expected to have benefited this holiday season from surging consumer confidence and increased use of mobile phones to shop.\nMastercard Inc’s ( MA.N ) analytics arm said last week that shoppers spent a record of more than $800 billion during the 2017 U.S. holiday period.\nThe holidays can account for up to 40 percent of annual sales for some stores, and retailers have invested aggressively in promotions, technology and delivery options.\nRival J.C. Penney Co Inc ( JCP.N ) reported a 3.4 percent rise in holiday same-store sales on Thursday, driven by strong demand for home goods, beauty products and jewelry. Its shares rose in premarket trading, but turned lower after the Macy’s announcement.\nMacy’s said its 1 percent rise in comparable sales was driven by demand for apparel and beauty products and would boost fourth-quarter comparable sales.\nFull-year comparable sales should decline by about 2.4 percent to 2.7 percent, Macy’s said, a slight improvement on the 2.2 percent to 3.3 percent decline it forecast in November.\nReporting by Richa Naidu in Chicago; additional reporting by Siddharth Cavale Meredith Mazzilli\n ", "external_links": [], "published": "2018-01-04T16:17:00.000+02:00", "crawled": "2018-01-04T16:31:24.002+02:00", "highlightTitle": ""}