{"organizations": [], "uuid": "9a671471cf767c4ce65604e581de22e78d5fd94f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-dollar-slips-on-track-for-worst-weekly-fall-since-may-idUSL8N1PL3V1", "country": "US", "domain_rank": 408, "title": "FOREX-Dollar slips, on track for worst weekly fall since May", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T00:13:00.000+02:00", "replies_count": 0, "uuid": "9a671471cf767c4ce65604e581de22e78d5fd94f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-dollar-slips-on-track-for-worst-weekly-fall-since-may-idUSL8N1PL3V1", "ord_in_thread": 0, "title": "FOREX-Dollar slips, on track for worst weekly fall since May", "locations": [], "entities": {"persons": [{"name": "kuroda", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "saqib iqbal ahmed", "sentiment": "none"}, {"name": "steven mnuchin", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* U.S. economic growth slows in Q4 on surging imports\n* Yen up on BoJ’s Kuroda comments on economy, inflation (Updates prices and market activity to U.S. market open, changes dateline; previous LONDON)\nBy Saqib Iqbal Ahmed\nNEW YORK, Jan 26 (Reuters) - The dollar remained weak against a basket of currencies on Friday, bruised by comments by senior U.S. officials this week backing a weak dollar and after data showed U.S. economic growth unexpectedly slowed in the fourth quarter.\nThe dollar index, which measures the greenback against a basket of six major currencies, was down 0.44 percent at 89.002 and on track for a weekly fall of 1.7 percent, its worst performance since May.\nPresident Donald Trump’s comments on Thursday that he wanted a “strong dollar,” a day after Treasury Secretary Steven Mnuchin said a weaker greenback would help U.S. trade balances in the short term, failed to put a lid on volatility and keep dollar bears in check.\nThe euro was up 0.3 percent against the greenback at $1.2432, after hitting a more than three-year high of $1.2536 on Thursday.\n“$1.25 in euro-dollar is a critical level and it’s got a lot of sticker shock associated with it,” said Greg Anderson, global head of FX strategy at BMO Capital Markets.\n“There were probably a lot of options barriers and lots of stops up there that people would love to take out. You would expect to see an acceleration in volatility,” he said.\n“We did have those comments, and it added to the drama,” Anderson said.\nThe market was likely to take a breather now but the underlying trend for a gradually weakening dollar remained intact, Anderson said.\nUBS Wealth Management upgraded its six-month forecasts for the euro on Friday to $1.28, from $1.22.\nThe dollar found little support after data showed U.S. fourth-quarter gross domestic product increased at a 2.6 percent annual rate, held back by a modest pace of inventory accumulation. Economists polled by Reuters had forecast a 3 percent increase.\n“Today’s U.S. growth print may prompt some modest soul-searching amongst interest rate bulls but does little to change the fact that the economy has considerable momentum behind it,” Karl Schamotta, director of global product and market strategy at Cambridge Global Payments, said in a note.\nThe dollar slipped to a session low against the Japanese yen after Bank of Japan Governor Haruhiko Kuroda said the central bank expects the economy to continue growing at a moderate pace and inflationary expectations are picking up slightly.\nThe pound rose after Britain’s economy unexpectedly picked up speed in the last three months of 2017, adding to the view that the hit from the Brexit vote was not as bad as expected.\nReporting by Saqib Iqbal Ahmed; Editing by Susan Thomas\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-27T00:13:00.000+02:00", "crawled": "2018-01-27T00:16:34.019+02:00", "highlightTitle": ""}