{"organizations": [], "uuid": "6103e4cac5fd29b713e815df93336a5e53e7bbc0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/business-wire-sandridge-mississippian-trust-ii-announces-quarterly-distribution.html", "country": "US", "domain_rank": 767, "title": "SandRidge Mississippian Trust II Announces Quarterly Distribution", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-26T00:15:00.000+02:00", "replies_count": 0, "uuid": "6103e4cac5fd29b713e815df93336a5e53e7bbc0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/business-wire-sandridge-mississippian-trust-ii-announces-quarterly-distribution.html", "ord_in_thread": 0, "title": "SandRidge Mississippian Trust II Announces Quarterly Distribution", "locations": [], "entities": {"persons": [{"name": "grant", "sentiment": "none"}, {"name": "kay", "sentiment": "none"}], "locations": [{"name": "houston", "sentiment": "none"}, {"name": "alfalfa", "sentiment": "none"}], "organizations": [{"name": "sandridge mississippian trust ii", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON--(BUSINESS WIRE)-- SANDRIDGE MISSISSIPPIAN TRUST II (NYSE: SDR) today announced a quarterly distribution for the three-month period ended December 31, 2017 (which primarily relates to production attributable to the Trust’s interests from September 1, 2017 to November 30, 2017) of approximately $2.9 million, or $0.058 per unit. The Trust makes distributions on a quarterly basis on or about the 60th day following the completion of each quarter. The distribution is expected to occur on or before February 23, 2018 to holders of record as of the close of business on February 9, 2018.\nDuring the three-month production period ended November 30, 2017, combined sales volumes were slightly lower than the previous period; however, oil and natural gas liquids (“NGL”) prices increased. As no additional development wells will be drilled, the Trust’s production is expected to decline each quarter during the remainder of its life.\nThe Trust owns royalty interests in oil and natural gas properties in the Mississippian formation in Alfalfa, Grant, Kay, Noble and Woods counties in northern Oklahoma and Barber, Comanche, Harper and Sumner counties in southern Kansas and is entitled to receive proceeds from the sale of production attributable to the royalty interests. As described in the Trust’s filings with the Securities and Exchange Commission (the “SEC”), the amount of the quarterly distributions is expected to fluctuate from quarter to quarter, depending on the proceeds received by the Trust as a result of actual production volumes, oil, natural gas and NGL prices and the amount and timing of the Trust’s administrative expenses, among other factors. All Trust unitholders share distributions on a pro rata basis.\nVolumes, average prices and distributable income available to unitholders for the period were (dollars in thousands, except per unit):\nSales Volumes Oil (MBbl) 25 NGL (MBbl) 48 Natural Gas (MMcf) 627 Combined (MBoe) 177 Average Price Oil (per Bbl) $ 51.87 NGL (per Bbl) $ 26.97 Natural Gas (per Mcf) $ 2.26 Natural Gas (per Mcf) including impact of post-production expenses $ 1.49 Revenues $ 4,000 Expenses 1,115 Distributable income available to unitholders $ 2,885 Distributable income per unit (49,725,000 units issued and outstanding) $ 0.058 Pursuant to IRC Section 1446, withholding tax on income effectively connected to a United States trade or business allocated to foreign partners should be made at the highest marginal rate. Under Section 1441, withholding tax on fixed, determinable, annual, periodic income from United States sources allocated to foreign partners should be made at 30% of gross income unless the rate is reduced by treaty. This is intended to be a qualified notice by SandRidge Mississippian Trust II to nominees and brokers as provided for under Treasury Regulation Section 1.1446-4(b), and while specific relief is not specified for Section 1441 income, this disclosure is intended to suffice. Nominees and brokers should withhold at the highest marginal rate on the distribution made to foreign partners.\nThis press release contains statements that are “forward-looking statements” within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended. All statements contained in this press release, other than statements of historical facts, are “forward-looking statements” for purposes of these provisions. These forward-looking statements include the amount and date of any anticipated distribution to unitholders. The anticipated distribution is based, in part, on the amount of cash received or expected to be received by the Trust from SandRidge Energy, Inc. (“SandRidge”) with respect to the relevant period. Any differences in actual cash receipts by the Trust could affect this distributable amount. The amount of such cash received or expected to be received by the Trust (and its ability to pay distributions) has been and will be significantly and negatively impacted by prevailing low commodity prices, which could remain low for an extended period of time or decline further. Other important factors that could cause actual results to differ materially include expenses of the Trust and reserves for anticipated future expenses. Statements made in this press release are qualified by the cautionary statements made in this press release. Neither SandRidge nor the Trustee intends, and neither assumes any obligation, to update any of the statements included in this press release. An investment in Common Units issued by SandRidge Mississippian Trust II is subject to the risks described in the Trust’s Annual Report on Form 10-K for the year ended December 31, 2016, and all of its other filings with the SEC. The Trust’s quarterly and other filed reports are or will be available over the Internet at the SEC’s website at http://www.sec.gov .\n //www.businesswire.com/news/home/20180125005791/en/\nSandRidge Mississippian Trust II\nThe Bank of New York Mellon Trust Company, N.A., as Trustee\nSarah Newell, 1-512-236-6555\nSource: SandRidge Mississippian Trust II", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51748905&newsitemid=20180125005791&lan=en-US&anchor=http%3A%2F%2Fwww.sec.gov&index=1&md5=58a25e8c02979b2279236cd3dcd02dca", "http://www.businesswire.com/news/home/20180125005791/en/"], "published": "2018-01-26T00:15:00.000+02:00", "crawled": "2018-01-26T02:56:22.000+02:00", "highlightTitle": ""}