{"organizations": [], "uuid": "fc6102ac264cf7cdc56f04f12a4da644ffa0cd3e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/09/04/104688595-GettyImages-842264474_1.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/07/merkel-starts-government-talks-with-center-left.html", "country": "US", "domain_rank": 767, "title": "Merkel starts government talks with center-left", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.017, "site_type": "news", "published": "2018-01-07T14:10:00.000+02:00", "replies_count": 0, "uuid": "fc6102ac264cf7cdc56f04f12a4da644ffa0cd3e"}, "author": "Omer Messinger", "url": "https://www.cnbc.com/2018/01/07/merkel-starts-government-talks-with-center-left.html", "ord_in_thread": 0, "title": "Merkel starts government talks with center-left", "locations": [], "entities": {"persons": [{"name": "angela", "sentiment": "negative"}, {"name": "merkel", "sentiment": "negative"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "stringer", "sentiment": "none"}, {"name": "omer messinger", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "european union cornered merkel", "sentiment": "negative"}, {"name": "spd", "sentiment": "none"}, {"name": "et sun", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Chancellor Angela Merkel said on Sunday she was optimistic her conservatives and the Social Democrats (SPD) could agree to join forces as they embarked on five days of talks about reviving the 'grand coalition' that has governed Germany since 2013.\nPersuading the SPD to team up with her is Merkel's best bet of forming a stable government in Europe's largest economy and extending her 12 years in office, after her attempt to form an alliance with two smaller parties failed last year. \nArriving at SPD headquarters for talks more than three months after a national election, Merkel said the parties had a lot of work to get through in the coming days but intended to tackle it quickly, adding: \"I think it can succeed.\"\nThe SPD, which had said it would go into opposition after its worst election showing since 1933, reconsidered when Germany's president intervened.\nBut the centre-left party, among whose membership opposition to a 'grand coalition' re-run remains strong, has been playing hard-to-get.\nA group called \"NoGroKo\", meaning \"no grand coalition\", has formed within its ranks to campaign against working with Merkel again, saying that would cost the SPD votes and make the far-right Alternative for Germany (AfD) the leading opposition party.\nSPD leader Martin Schulz said that, while the outcome of the talks was unclear, his party would enter them constructively.\n\"We won't draw any red lines - rather we want to push through as much red politics as possible in Germany,\" Schulz said, referring to the party's colour.\nSchulz said five days should suffice to find out whether the parties had enough common ground to launch full-blown coalition talks. The SPD leadership is due to recommend on Friday whether or not to start talks, and it is then up to an SPD party congress on Jan. 21 to make a decision.\nNot so grand? A coalition between Merkel's CDU/CSU alliance - which lost ground to the AfD in September's ballot - and the SPD has governed Germany for eight of the last 12 years.\nBut it has tended to be viewed as a last resort by both politicians and voters as it leaves the opposition weak.\nA poll for broadcaster ARD showed more than half of the electorate - 52 percent - are sceptical about reviving it, while 45 percent are in favour.\nSlideshow (9 Images)\nNot natural allies, the two camps are likely to clash on immigration, tax, healthcare and Europe - and expectations among other leading figures in the parties were mixed as the preliminary talks got under way.\nNorbert Roemer, SPD head in the regional assembly of North Rhine-Westphalia, told the RND newspaper group no lawmakers in his state caucus favoured a grand coalition - unlike five years ago - with past experience meaning they no longer trusted Merkel.\nVolker Bouffier, a senior member of Merkel's Christian Democrats (CDU), told Rheinische Post newspaper his party intended to form a grand coalition but that it could not come at any price.\nHorst Seehofer, leader of the Christian Social Union (CSU) - the Bavarian sister party to Merkel's CDU - said he was going into the talks in \"high spirits\" and participants needed to come to an agreement.\nThe potential partners have agreed on a news blackout during the exploratory talks, which are due to finish on Thursday.\nIf they find enough common ground and the SPD gets backing from its members in a vote, the parties will proceed to full-blown coalition talks. The consensus among politicians and observers expect those would last until at least March.\nBut if the discussions fail, Germany could either face fresh elections or, for the first time in the post-war era, a minority government run by Merkel.", "external_links": [], "published": "2018-01-07T14:10:00.000+02:00", "crawled": "2018-01-07T14:10:17.019+02:00", "highlightTitle": ""}