{"organizations": [], "uuid": "9caed4065643b9e58038969c2622259e1d63ac32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/30/104681431-RTX369XG.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/02/mixed-open-seen-for-2018s-first-stock-session.html", "country": "US", "domain_rank": 767, "title": "Mixed open seen for 2018’s first stock session", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.164, "site_type": "news", "published": "2018-01-02T14:14:00.000+02:00", "replies_count": 0, "uuid": "9caed4065643b9e58038969c2622259e1d63ac32"}, "author": "Berkeley Lovelace Jr.", "url": "https://www.cnbc.com/2018/01/02/mixed-open-seen-for-2018s-first-stock-session.html", "ord_in_thread": 0, "title": "Mixed open seen for 2018’s first stock session", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}], "organizations": [{"name": "aapl", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "cme", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "IN THE NEWS TODAY President Donald Trump issued a strong statement of support for protesters in Iran as a crackdown intensified against anti-government demonstrations. Police have arrested more than 450 people and there have been at least 20 deaths. (WSJ & Reuters)\nDemocrats in high-tax states are reportedly plotting to blunt the impact of the Republicans' newly passed tax bill . Officials object to the law's cap on state and local tax deductions, in particular, which were previously unlimited. (NY Times)\n* New year, new tax brackets. Here's where you stand (CNBC)\nBone-chilling cold gripped much of the central U.S. as 2018 began this week, breaking century-old records, icing over some New Year's celebrations and leading to at least two deaths attributed to exposure to the elements. (AP)\nPowerful Hollywood women have formed an initiative called \"Time's Up\" to fight systemic sexual harassment in Hollywood and in blue collar workplaces nationwide. It came after a number of sexual misconduct allegations against men in the entertainment industry. (NY Times)\nChicago, the nation's third-largest city, ended 2017 with 650 murders, 15 percent fewer than a year earlier. It's a sign of improvement as Trump has ridiculed Chicago officials for doing too little to stem the violence. (USA Today)\nSouth Korea today offered talks with North Korea amid a standoff over the latter's weapons program. It came a day after Kim Jong Un said he was open to negotiations, but that his country would push ahead with \"mass producing\" nuclear warheads. (Reuters)\n* Kim Jong Un declares North Korea is a nuclear power, says 'button' is on his desk (AP)\nImmigration desk computers at various airports went down for about two hours Monday, which caused long lines for travelers coming into the U.S. Customs gave no explanation for the disruption and said travelers were processed using alternative procedures. (Reuters)\nSTOCKS TO WATCH BP (BP) said it expected a positive impact on earnings from changes in U.S. tax law.\nLas Vegas Sands (LVS), Wynn Resorts (WYNN) and other casino companies with operations in Macau could benefit, following news that gaming revenue in the Chinese territory rose 19 percent in 2017. That was the first annual revenue gain in three years.\nVolkswagen (VLKAY) faces more legal issues over its diesel emissions scandal, with a Swiss consumer protection organization filing claims on behalf of about 6,000 owners seeking damages.\nSears Holdings (SHLD) has not run any paid national television commercials since late November, according to the Wall Street Journal. The parent of Sears and Kmart has run no national TV ads since late November, compared to $8.4 million a year earlier for the Sears brand and $6.5 million for the company's Kmart division.\nAltice USA (ATUS) pulled the Starz and Encore movie channels from its cable lineup, after the two sides could not come to an agreement on a new carriage contract.\nWATERCOOLER A new \"American Girl\" doll has been launched by Mattel (MAT), which the company describes as an \"aspiring astronaut\" who \"dreams of being the first person to go to Mars.\" Mattel consulted with NASA in developing the doll. (CBS)\nAlabama crushed Clemson , 24-6, in the College Football Playoff semifinal at the Allstate Sugar Bowl last night. The No. 4 Crimson Tide (12-1) will face No. 3 Georgia on January 8. (Reuters)", "external_links": [], "published": "2018-01-02T14:14:00.000+02:00", "crawled": "2018-01-02T14:42:27.016+02:00", "highlightTitle": ""}