{"organizations": [], "uuid": "ca4f19922535feff04098e946c939b9ef533339c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-leading-north-american-software-developer-spiria-continues-to-accelerate-its-growth-with-the-addition-of-a-new-toronto-based.html", "country": "US", "domain_rank": 767, "title": "Leading North American software developer Spiria continues to accelerate its growth with the addition of a new Toronto based company", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.476, "site_type": "news", "published": "2018-01-09T17:15:00.000+02:00", "replies_count": 0, "uuid": "ca4f19922535feff04098e946c939b9ef533339c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-leading-north-american-software-developer-spiria-continues-to-accelerate-its-growth-with-the-addition-of-a-new-toronto-based.html", "ord_in_thread": 0, "title": "Leading North American software developer Spiria continues to accelerate its growth with the addition of a new Toronto based company", "locations": [], "entities": {"persons": [{"name": "stéphane rouleau", "sentiment": "none"}], "locations": [{"name": "montreal", "sentiment": "none"}, {"name": "spiria", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "spiria", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Mobile and Web application development company DevBBQ joins Spiria.\nMONTREAL, Jan. 9, 2018 /PRNewswire/ - Spiria , one of North America's fastest-growing custom software development firms, is proud to announce the addition of DevBBQ to its Canadian team. The acquisition of this Toronto-based mobile and Web application developer will accelerate Spiria's ability to deliver innovative digital solutions to businesses across North America.\n\"Toronto is one of the fastest growing tech markets in North America. Since we provide user-driven innovation and software development services based on proximity, we felt it was essential to on-board a local team with a solid reputation,\" says Stéphane Rouleau, President & CEO of Spiria. \"With DevBBQ, we are adding experienced mobile and Web experts with strong business values aligned with ours. And that counts for a lot in an industry based on collaboration and trust.''\nDevBBQ's senior management agrees. \"We found an immediate fit with Spiria. We believe in bringing on skilled people who look beyond the code to understand business strategies. That's important for us, for our clients, and it is reflected in the solutions we develop. Pairing Spiria's 14 years of experience in custom software, with our Web and mobile application development abilities, will provide innovative and exciting opportunities for companies in the greater Toronto area\" explains Jordan Van Schyndel, Vice President of Spiria Toronto.\nDevBBQ is the developer behind innovative digital solutions for companies like Paymi, Salesforce, Party City, Collinson Group and Deloitte. DevBBQ, now Spiria Toronto, will continue to operate under the same and current management. Second addition in the past three months, this Toronto team joins Spiria in providing custom premium software, smart IoT solutions, and Mobile and Web application development services to businesses across North America.\nWith teams in Boston, Montreal, Gatineau-Ottawa and now Toronto, Spiria consolidates its position as a North American leader in the premium custom software and IoT solution development industry.\nAbout Spiria\nSince 2003, Spiria has been designing and developing premium software that transforms businesses, optimizes operations, and defines how its clients engage with customers. The methodology used to create these innovative digital solutions is based on experience acquired from 900 digital products designed, developed, and delivered across multiple industries. Spiria's 130 business analysts, engineers, architects, developers and designers focus on creating specialized software, embedded systems, smart IoT solutions and engaging Mobile and Web applications. Over 300 international companies, like Autodesk, Acosta and Shutterstock, rely on Spiria's expertise and custom software solutions to get more customers, cut costs, and accelerate growth. For more information, visit www.spiria.com .\nSOURCE Spiria", "external_links": ["https://www.devbbq.com/", "https://www.spiria.com/en", "http://www.spiria.com/"], "published": "2018-01-09T17:15:00.000+02:00", "crawled": "2018-01-09T19:05:56.010+02:00", "highlightTitle": ""}