{"organizations": [], "uuid": "a54999fb0e71313b0950d74d856f5abfa7e8af0a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224272422&w=1200&r=LYNXMPEE0L229", "site_section": "http://feeds.reuters.com/reuters/environment\r", "section_title": "Reuters: Environment", "url": "https://www.reuters.com/article/us-davos-meeting-snow/heavy-snow-humbles-the-global-elite-at-davos-summit-idUSKBN1FB2XM", "country": "US", "domain_rank": 408, "title": "Heavy snow humbles the global elite at Davos summit", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T23:34:00.000+02:00", "replies_count": 0, "uuid": "a54999fb0e71313b0950d74d856f5abfa7e8af0a"}, "author": "", "url": "https://www.reuters.com/article/us-davos-meeting-snow/heavy-snow-humbles-the-global-elite-at-davos-summit-idUSKBN1FB2XM", "ord_in_thread": 0, "title": "Heavy snow humbles the global elite at Davos summit", "locations": [], "entities": {"persons": [{"name": "noah bar", "sentiment": "negative"}, {"name": "adrian monck", "sentiment": "none"}, {"name": "silvia aloisi", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "world economic forum communications", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 9:35 PM / in 6 hours Heavy snow humbles the global elite at Davos summit Noah Barkin , Silvia Aloisi 3 Min Read \nDAVOS, Switzerland (Reuters) - The global economy and geopolitical tensions are taking a back seat to a more immediate problem at this year’s Davos summit of political and business leaders: heavy snow is burying the venue. \nHigh in the Swiss alps on Monday, on the eve of the opening sessions, many of the roughly 3,000 delegates struggled to reach the ski resort. Part of the main train line into Davos had been buried in snow over the weekend, forcing people onto buses, and helicopters were disrupted by poor visibility. \nSome pre-summit meetings were canceled or delayed as the first waves of delegates waded through snow-blanketed streets with luggage, looking for their hotels, or had to wait for road crews to dig their limousines out of drifts. \nBusinessmen slipped over on icy patches as snow plows roamed the streets, with the snow returning as fast as the machines could clear it. \nWorld Economic Forum communications chief Adrian Monck said it appeared to be the heaviest snowfall for the four-decades-old summit since 1999-2000, though he described it as more of an inconvenience than a real threat to attendance. \n“We know the snow causes inconvenience and it puts a lot of pressure on the city of Davos as a host but so far we have not seen any drop-off in registrations,” Monck said. Snipers hold their position on the roof of a hotel during the World Economic Forum (WEF) annual meeting in the Swiss Alps resort of Davos, Switzerland January 22, 2018. REUTERS/Denis Balibouse \nWith the weather forecast to clear on Tuesday, organizers are hoping transport will start to operate more smoothly and will be running without a hitch by the time U.S. President Donald Trump arrives on Friday to give the closing address. \nHowever, so much snow has built up on the slopes surrounding Davos that avalanches remain a danger. \nA bulletin from the SLF Institute for Snow and Avalanche Research in Davos showed a broad band of the mountainous country under Level 5 avalanche danger, the highest on a 1-5 scale. \n“Fresh snow and snow drift accumulations are prone to triggering (avalanches). Until late in the night a large number of natural avalanches are to be expected,” it said. \nLocal officials said on Monday they had evacuated two dozen residents from vulnerable areas while crews used explosives to reduce dangerous build-ups on some slopes above the town. \n“When Trump comes on Friday it is far from obvious whether he will be able to use a fleet of large helicopters to land in Davos,” said a source close to the organizing committee. “Large helicopters increase the risk of avalanches.” Additional reporting by Kirsten Donovan and Dmitry Zhdannikov; Editing by Mark Bendeich and Matthew Mpoke Bigg", "external_links": [], "published": "2018-01-22T23:34:00.000+02:00", "crawled": "2018-01-23T01:04:41.018+02:00", "highlightTitle": ""}