{"organizations": [], "uuid": "3514a626adf17f631903b52437d89db0c2a54c93", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2016/04/dna-sequencing.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/18/gv-google-ventures-krishna-yeshwant/", "country": "US", "domain_rank": 1196, "title": "GV's Krishna Yeshwant Says The Way We Fund Science 'Is Crazy' | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.105, "site_type": "news", "published": "2018-01-18T02:00:00.000+02:00", "replies_count": 0, "uuid": "3514a626adf17f631903b52437d89db0c2a54c93"}, "author": "Polina Marinova", "url": "http://fortune.com/2018/01/18/gv-google-ventures-krishna-yeshwant/", "ord_in_thread": 0, "title": "GV's Krishna Yeshwant Says The Way We Fund Science 'Is Crazy' | Fortune", "locations": [], "entities": {"persons": [{"name": "krishna yeshwant", "sentiment": "negative"}, {"name": "yeshwant", "sentiment": "none"}], "locations": [], "organizations": [{"name": "life sciences", "sentiment": "none"}, {"name": "lifemine therapeutics", "sentiment": "none"}, {"name": "google ventures", "sentiment": "none"}, {"name": "flatiron health", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 \nThis article originally ran in Term Sheet, Fortune’s newsletter about deals and dealmakers. Sign up here. \nKrishna Yeshwant is not your typical VC. In addition to practicing internal medicine, Yeshwant is a general partner at GV (formerly Google Ventures), where he heads the Life Sciences team. His portfolio includes companies like Flatiron Health, 23andMe, and LifeMine Therapeutics. \nYeshwant was drawn to venture capital after seeing the different processes that entrepreneurs and scientists go through in order to raise money for their ventures. \n“I realized that the way we finance things in science is just completely crazy,” he said. “As an entrepreneur, I was part of a team where I could write a 10-page deck and raise tens of millions of dollars. And here I was in a lab, writing hundreds of pages of grant material just to get a couple of hundreds of thousand dollars. It was just kind of backwards.” \nIn an interview with Term Sheet, Yeshwant discusses innovations in life sciences, artificial intelligence, and immunotherapy. Below is an excerpt of our conversation: \nTell me about your investment thesis. What do you look for in a company before investing? \nYESHWANT: I think a lot of people hear the words GV or Google Ventures and think we must be investing in digital health. While we certainly do make investments in IT areas, our investment thesis is quite broad. We invest essentially in all areas of healthcare, including areas that people wouldn’t traditionally associate with GV. \nWe are heavily invested across therapeutics, even therapeutics that have no IT or tech component to them. We look at IT as something we can organically integrate across all of those if it makes sense for the companies. We’re investing heavily across precision medicine. We believe it’s very hard to treat a disease if you can’t understand it, so we spend a lot of time and effort thinking about the underlying components of diseases, which can include large-scale sequencing, single-cell sequencing, and disease profiling. \nWhat are some emerging trends in the life sciences space that Term Sheet readers should be paying attention to? \nYESHWANT: One area that continues to be of interest today is immunotherapy. We’re also looking at the role the immune system has on cancer. This will be a phenomenal focus for a while to come. The next interesting question coming down the pike is: We’re all focused on cancer, but what other disease indications does the immune system have a role in? For example, we haven’t spent as much thinking about how a healthy immune system engages with the neurologic system, but it clearly does have a role as we look at neurodegenerative diseases. How does it interface into the infectious disease world? I think these are phenomenally rich areas that are only minimally explored, and those will continue to open up in the coming years. \nThe cancer immunotherapy market is projected to reach $111.23 billion by 2021 and there’s been plenty of VC activity there lately. Why are we seeing more of that now? \nYESHWANT: It’s largely because we now have the ability to profile the immune system more carefully and we have the ability to edit the cells and change them. We just didn’t have that capacity 15 years ago. Immunotherapy in itself is not a completely new thing. The concept of using the immune system as a therapeutic is not new, but our ability to use the immune system to target things we’re interested in is novel. That’s attached to the progress of sequencing technology, the ability to edit cells, and other gene editing approaches have been transformative in the immunotherapy world in recent years. \nMore and more companies are working on building a brain-computer interface, which would allow the mind to connect with artificial intelligence. Facebook is building a BCI that would let people type with their mind, and Elon Musk launched Neuralink to create devices that can be implanted in the brain. What do you think about the future of these innovations? \nYESHWANT: I think we’ll see more of it. But we’re left with this fundamental question around how information is encoded in the brain. That is still a research question — we’re still in the early days of answering it. I think [BCI] is less likely to be an area where we see commercial successes over the coming two or three years because we still don’t have the underlying tooling. We’re still looking for some of the core breakthroughs needed to unlock this field. \nWhat do the next 10 years look like? Will we all have brain implants and be able to edit our genes as we wish? \nYESHWANT: As I look at it, I’m a fundamental believer that’s transformative in our ability to discover new therapeutics that will not just treat, but cure, a variety of diseases. It’s not going to be everything, but I think there will be a lot of cures coming down the pike. And that’s very exciting from a biological and clinical perspective, but it’s going to beg this uncomfortable question of — how do we pay for cures? Historically, we’ve charged a lot for the cures. Similar to what we’ve seen in the tech world, there will be an explosion of business models and revenue models of how we pay for these things. I think there’s a lot of entrepreneurial opportunity around it, and I certainly hope it will make the whole thing a whole lot less painful for patients. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-18T02:00:00.000+02:00", "crawled": "2018-01-19T17:36:54.000+02:00", "highlightTitle": ""}