{"organizations": [], "uuid": "62a13d9d3d822463bade1b462d1c2b70cbaf238b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224765574&w=1200&r=LYNXMPEE0N0SN", "site_section": "http://feeds.reuters.com/reuters/INformulaOne\r", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/india-asean/india-plans-closer-southeast-asia-maritime-ties-to-counter-china-idINKBN1FD14R", "country": "US", "domain_rank": 408, "title": "India plans closer Southeast Asia maritime ties to counter China", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T12:19:00.000+02:00", "replies_count": 0, "uuid": "62a13d9d3d822463bade1b462d1c2b70cbaf238b"}, "author": "", "url": "https://in.reuters.com/article/india-asean/india-plans-closer-southeast-asia-maritime-ties-to-counter-china-idINKBN1FD14R", "ord_in_thread": 0, "title": "India plans closer Southeast Asia maritime ties to counter China", "locations": [], "entities": {"persons": [{"name": "sanjeev miglani", "sentiment": "none"}, {"name": "narendra modi", "sentiment": "none"}], "locations": [{"name": "southeast asia", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "new delhi", "sentiment": "none"}, {"name": "pakistan", "sentiment": "none"}, {"name": "sri lanka", "sentiment": "none"}, {"name": "south asia", "sentiment": "none"}], "organizations": [{"name": "association of southeast asian regional cooperation", "sentiment": "none"}, {"name": "asean", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 10:11 AM / Updated 3 hours ago India plans closer Southeast Asia maritime ties to counter China Sanjeev Miglani 3 Min Read \nNEW DELHI (Reuters) - India is gathering the leaders of the Association of Southeast Asian Regional Cooperation (ASEAN) for a summit on Thursday to promote maritime security in a region dominated by China, officials and diplomats said. \nIndia has been pursuing an “Act East” policy of developing political and economic ties with Southeast Asia, but its efforts have been tentative and far trail China, whose trade with ASEAN was more than six times India’s in 2016-17 at $470 million. \nChina has also expanded its presence in South Asia, building ports and power plants in countries around India’s periphery, such as Pakistan and Sri Lanka, and spurring New Delhi to seek new allies. \nPrime Minister Narendra Modi has invited the leaders of all ten ASEAN nations to join him in the Republic Day celebrations on Friday in the biggest ever gathering of foreign leaders at the parade that showcases military might and cultural diversity. \nThe leaders, who include Myanmar’s Aung San Suu Kyi, Indonesian President Joko Widodo and Philippine President Rodrigo Duterte, will hold talks on maritime cooperation and security, the Indian foreign ministry said in a statement. Vietnam's Prime Minister Nguyen Xuan Phuc and his wife Tran Thi Nguyet Thu wave upon their arrival at Air Force Station Palam in New Delhi, India, January 24, 2018. REUTERS/Adnan Abidi \nBoth India and the Southeast Asia nations have stressed the need for freedom of navigation and open seas and India already has strong naval ties with countries such as Singapore, Vietnam, Indonesia, Thailand and Malaysia, Preeti Saran, secretary in the Indian foreign ministry, said. \n“The ongoing activities of ship visits, of coordinated patrols, of exercises that take place bilaterally, are taking place very well,” Saran said. “And every time we have defence to defence talks or navy to navy talks, there is a great deal of satisfaction that has been expressed by the ASEAN member countries.” Cambodia's Prime Minister Hun Sen waves upon his arrival at Air Force Station Palam in New Delhi, India, January 24, 2018. REUTERS/Adnan Abidi \nBut several Southeast Asian countries locked in territorial disputes with China have sought even greater Indian engagement in the region, experts say. \n“China’s distinctly hegemonic moves in the last few years in the South China Sea and its growing assertiveness have made ASEAN look towards India as a partner for equilibrium,” said Arvind Gupta, former Indian deputy national security adviser who now heads the influential Vivekananda International Foundation in New Delhi with close ties to the ruling government. \nBut India, which has been building up its navy, is wary of getting entangled in South China Sea disputes and provoking a backlash from China. \nOne of the plans the Indian and ASEAN leaders will be discussing at the close-door summit on Thursday will be for their navies to exercise near the Malacca Straits between Malaysia and Singapore, one of the busiest routes for international shipping, a navy official said. Editing by Nick Macfie", "external_links": [], "published": "2018-01-24T12:19:00.000+02:00", "crawled": "2018-01-24T12:52:06.057+02:00", "highlightTitle": ""}