{"organizations": [], "uuid": "3b50f48563debf8361c1cf9259110cba26f3c334", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/saudi-aramco-ipo-fees/rpt-banks-expected-to-share-tiny-proportion-of-mammoth-saudi-aramco-ipo-idUSL8N1PC5TT", "country": "US", "domain_rank": 408, "title": "RPT-Banks expected to share tiny proportion of mammoth Saudi Aramco IPO", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T08:00:00.000+02:00", "replies_count": 0, "uuid": "3b50f48563debf8361c1cf9259110cba26f3c334"}, "author": "", "url": "https://www.reuters.com/article/saudi-aramco-ipo-fees/rpt-banks-expected-to-share-tiny-proportion-of-mammoth-saudi-aramco-ipo-idUSL8N1PC5TT", "ord_in_thread": 0, "title": "RPT-Banks expected to share tiny proportion of mammoth Saudi Aramco IPO", "locations": [], "entities": {"persons": [{"name": "clara denina", "sentiment": "none"}, {"name": "dasha afanasieva", "sentiment": "none"}, {"name": "alibaba", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "riyadh", "sentiment": "none"}], "organizations": [{"name": "saudi aramco", "sentiment": "none"}, {"name": "saudi aramco ipo reuters staff", "sentiment": "none"}, {"name": "ipo", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Repeats Jan 17 story with no changes to text)\n* Fees estimated at less than 0.2 pct of listing\n* Financial reward smaller than other big IPOs\n* Bankers jostling for mandates for league table credit, prestige\n* Also hoping for piece of larger Vision 2030 pie\nBy Dasha Afanasieva and Clara Denina\nLONDON, Jan 17 (Reuters) - The banks that will advise and execute Saudi Aramco’s stock market listing are expected to share a tiny proportion of the $100 billion Riyadh hopes to raise in its initial public offering, according to banking sources and industry insiders.\nInvestment banks involved in the listing IPO-ARMO.SE are expected to share a fifth of a percent of the money raised, they said, but noted that could still amount to about $200 million.\nThe listing of 5 percent of the state oil company’s shares could be the largest IPO in history, almost five times the size of current record holder Alibaba, the Chinese e-commerce company which went public in New York in 2014.\nBanks are competing fiercely for mandates in the IPO because it is viewed as a gateway to other deals expected to emerge from Saudi Arabia’s plan to revamp its economy via privatisation.\nSaudi Aramco is known for having paid relatively low banking fees in the past, banking industry sources said. The company declined to comment when asked how much it would offer for this IPO.\nThe estimate of the fee pot is based on forecasts by industry insiders that have been cross-checked with bankers who are working to grab a share of the pie. They asked not to be named because of the sensitivity of the matter.\nFreeman Consulting estimates the pot compares to an average of 2-2.5 percent for IPOs by companies in the region.\nInternational banks JP Morgan, Morgan Stanley and HSBC have been appointed global coordinators with more banks expected to be named, in addition to a team of book-runners.\nThe 35 banks who worked on Alibaba’s $21.8 billion float, led by six main underwriters, pocketed an estimated $300 million among them, according to Thomson Reuters data.\nThose jostling for a role in Aramco’s listing are doing it for the status and league table ranking as well as the hope that it will put them in pole position for more Saudi business. Some - such as JP Morgan and HSBC - have been informally working on this since at least 2016.\n“This is the IPO of Saudi Arabia, not just Saudi Aramco. Saudi Aramco is very tight and for something of this size in basis points terms it will be the lowest ever,” said one London investment banker with knowledge of the process. “This will set a new precedent.”\nAn investment banking industry source said it was very unlikely that the fees would reflect the size of the issuance.\n“Aramco is known for paying very little fees – for a transaction of this magnitude in the ECM (equity capital market) you are looking at 100 to 150 basis points, but Aramco will pay just 10 basis points,” he told Reuters.\nLEAGUE TABLES Advisers to Saudi Arabia’s National Commercial Bank IPO, the world’s second-largest after Alibaba at $6 billion in 2104, received just $4.8 million in fees, Thomson Reuters data shows.\nAccording to the data, Aramco, which produces 10.5 million barrels of crude oil per day, has paid out $180 million to advisers globally since 2002. By comparison the biggest corporate fee payer of last year, Japan Post Holdings Co Ltd , paid $382 million for investment banking advice, including on its IPO, in 2017 alone.\nOne of the attractions for banks is a much-coveted top spot on the equity capital market league tables, which are calculated on the basis of deal value as opposed to fees and are included in every client presentation if they make a bank look good.\nBeing a regional leader will be important for banks such as Citi and HSBC, which are expanding their operations in the kingdom, to take advantage of opportunities created by Vision 2030, the reforms launched by Crown Prince Mohammed bin Salman to end the economy’s reliance on oil exports.\n“It’s about prestige,” said another banking industry source. He said all the league table places will be taken up by banks involved in the listing because of its size.\n“The chief executive and senior management are going to ask questions if you’re not on it.”\nAdditional reporting by Rania El Gamal in Dubai; Editing by Silvia Aloisi and Sonya Hepinstall\n ", "external_links": [], "published": "2018-01-18T08:00:00.000+02:00", "crawled": "2018-01-18T08:22:46.007+02:00", "highlightTitle": ""}