{"organizations": [], "uuid": "5580240f6eb40c119c4381c68bb58e71e9fc2c74", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-metrospaces-announces-record-year-end-revenue-of-7697376-for-etelix-for-2017.html", "country": "US", "domain_rank": 767, "title": "Metrospaces Announces Record Year-End Revenue of $7,697,376 for Etelix for 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.066, "site_type": "news", "published": "2018-01-11T17:00:00.000+02:00", "replies_count": 0, "uuid": "5580240f6eb40c119c4381c68bb58e71e9fc2c74"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-metrospaces-announces-record-year-end-revenue-of-7697376-for-etelix-for-2017.html", "ord_in_thread": 0, "title": "Metrospaces Announces Record Year-End Revenue of $7,697,376 for Etelix for 2017", "locations": [], "entities": {"persons": [{"name": "silva", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "ny", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "la coruna", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "metrospaces, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, NY , Jan. 11, 2018 (GLOBE NEWSWIRE) -- Metrospaces, Inc. (OTC PINK: MSPC) announces its majority-owned sub Etelix grew revenue at almost 100% year-over-year from 2016.\nMr. Silva stated: “Etelix had a very strong year, outperforming our most aggressive year-estimate of $7.5M by a margin of almost 3%. Etelix Management out proved itself by setting a very high bar for year-end increase in revenue of almost 100% and still outperforming. 2016 Year End revenue was $4,067,807 so actual increased in revenue from 2016 to 2017 was a very strong 89%. Our EBITDA margin stayed strong, even though we had additional expenses of almost $178,000 tied to our new office in La Coruna, Spain and one-time acquisition costs for increasing our commercial footprint on some customers based in Europe and Asia, that are beginning to operate in our network. Our financial expenses also increased by almost $244,000 due to new operating lines of credit that we acquired to help finance our sales growth during the 2017 as well as the investment in the new office in Spain. Even though this was an important hit to our net earnings, it was necessary to fund revenue growth. It also shows the trust our financial partners showed in the Company, since these were all basically rotating lines of credit that were increased by a factor of 5 during the 2017 year. We think it’s the right decision to sacrifice short-term net income for continued revenue growth and the increase of the commercial footprint. We look forward to an even stronger 2018.”\nAbout Etelix.com USA, LLC\nEtelix.com USA ( http://www.etelix.com/ ) is a Miami-based, FCC-licensed voice, SMS and data/hosting operator. The company’s main products and services are international voice wholesale, data and hosting services as well as residential and commercial triple-play provider. The company was founded in 2007 and has been profitable since inception.\nAbout Metrospaces\nMetrospaces www.metrospaces.net is a publicly traded real estate investment and Development Company which acquires land, designs, builds, and develops then resells condominiums and Luxury High-End Hotels, principally in urban areas of Latin America. The company’s current projects are located in Buenos Aires, Argentina and Miami, USA. It is operated by an elite group of real estate and investment professionals and entrepreneurs located in New York City, Miami and Buenos Aires. Company shareholders have extensive careers in real estate and business financing worldwide, and have funded projects both in the America’s and across Europe valued in excess of US $550Million.\nMetrospaces majority shareholders has partnered with Investors on Elite properties including The London BLVGARI 5 Star Hotel, and is currently involved in negotiations for the development of several Elite luxury properties in South America.\nAmong Metrospace partners are Architects, Real Estate Developers, Agents and Attorneys of the highest standing, with extensive experience in the global property market.\nMetrospaces was originally founded by company President Oscar Brito.\nRelevant Links:\nhttp://metrospaces.net/\nSafe Harbor Statement:\nStatements in this news release may be “forward-looking statements”. Forward-looking statements include, but are not limited to, statements that express our intentions, beliefs, expectations, strategies, predictions or any other statements relating to our future activities or other future events or conditions. These statements are based on current expectations, estimates and projections about our business based, in part, on assumptions made by management. These statements are not guarantees of future performance and involve risks, uncertainties and assumptions that are difficult to predict. Therefore, actual outcomes and results may, and are likely to, differ materially from what is expressed or forecasted in forward-looking statements due to numerous factors. Any forward-looking statements speak only as of the date of this news release and Metrospaces Inc. undertakes no obligation to update any forward-looking statement to reflect events or circumstances after the date of this news release.\nCompany Contact: Metrospaces 305-600-0407 Investor Relations: investors@metrospaces.net\nSource:Metrospaces, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=v2K2IrsQoEjdHfUFks0ee07UAoXNFm7QFTT7g92pmDYZxvZsVzVQ1YmNbc3odiqRFXDTBUD8v9ZpVuCQbJLoXkHVrS-wT13wyWmMxAj-e5s=", "https://www.globenewswire.com/Tracker?data=DdKn91-9nPyVNvrJ0IVuwMuaj4_wakUNDf2-cv2Stf_lKTjLKIy2swfyttia-WoIuDOere6MtLia0RL8tfrqinSRiZIjRkw3alskFaJtWDQ=", "http://metrospaces.net/", "http://www.etelix.com/", "https://www.globenewswire.com/Tracker?data=v2K2IrsQoEjdHfUFks0ee58RcOPwB5Z0BMaInO_diz1BpXOGPeHrZy74F6pF_7lflDKomapC3cakF4_y-qU4Am7o5AGEkpfkaIFkZJca3DA=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/ac4fee78-7fdf-45e4-9763-221f54000f10"], "published": "2018-01-11T17:00:00.000+02:00", "crawled": "2018-01-11T19:06:10.001+02:00", "highlightTitle": ""}