{"organizations": [], "uuid": "9baa00c3ec5e3d69b19d7e9edd18285a87f9ac5e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224784019&w=1200&r=LYNXMPEE0N103", "site_section": "http://feeds.reuters.com/reuters/INtechnologyNews\r", "section_title": "Reuters: Technology News", "url": "https://in.reuters.com/article/us-baidu-fundraising/baidu-seeks-new-investors-for-finance-unit-in-up-to-2-billion-deal-sources-idINKBN1FD1EZ", "country": "US", "domain_rank": 408, "title": "Baidu seeks new investors for finance unit in up to $2 billion deal: sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T13:28:00.000+02:00", "replies_count": 0, "uuid": "9baa00c3ec5e3d69b19d7e9edd18285a87f9ac5e"}, "author": "", "url": "https://in.reuters.com/article/us-baidu-fundraising/baidu-seeks-new-investors-for-finance-unit-in-up-to-2-billion-deal-sources-idINKBN1FD1EZ", "ord_in_thread": 0, "title": "Baidu seeks new investors for finance unit in up to $2 billion deal: sources", "locations": [], "entities": {"persons": [{"name": "kane wu", "sentiment": "none"}, {"name": "julie zhu", "sentiment": "none"}], "locations": [{"name": "baidu", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}], "organizations": [{"name": "baidu inc", "sentiment": "none"}, {"name": "baidu wallet", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "baidu financial services group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 11:31 AM / Updated 2 hours ago Baidu seeks new investors for finance unit in up to $2 billion deal: sources Julie Zhu , Kane Wu 3 Min Read \nHONG KONG (Reuters) - Chinese search engine Baidu Inc is seeking new investors for its wholly-owned finance unit, in a deal that could fetch up to $2 billion and deepen its push into financial services, people with knowledge of the matter said. \nThe investors will either buy some of Baidu’s shares in Baidu Financial Services Group (Baidu FSG) or buy new stakes in the unit, which is valued at around 18 billion yuan ($2.8 billion) before the new funding round, the people told Reuters. \nBaidu Inc is currently talking to prospective investors with the aim of attracting between $1.5 billion and $2 billion, they said. About half of the proceeds will be raised by Baidu through selling down its holdings in the unit, they said. The fundraising is expected to close by April, one person said. \nBaidu FSG runs payment system Baidu Wallet, an online credit service and an online wealth management platform. By beefing it up, Baidu is attempting to narrow the lead that its Chinese rivals Alibaba Group and Tencent Holdings have forged in financial services. \nThe fundraising also comes amid a wider reshuffle of Baidu’s corporate strategy as it looks for new revenue streams outside its core search business. \nBaidu Inc declined to comment on the fundraising. All the people declined to be named as the fundraising plans were confidential. \nCurrently, Baidu FSG mainly offers online financial services and products in China and owns several small financial licenses such as a third-party payment license and a fund sales license. \nAlibaba affiliate Ant Financial [ANTFIN.UL], which was valued at over $60 billion in its latest funding round in 2016, runs China’s top online payment platform Alipay and offers services including online payment, wealth management products and insurance. \nIts main rival Tencent operates WeChat Pay, a payment feature which is attached to its popular messaging and social networking application WeChat and has several hundred million users. \nBaidu Wallet, which also attracts users for other financial services such as online credit, had 100 million activated accounts as at the end of 2016. It is currently far behind its rivals Ant Financial and WeChat Pay in mobile payments in China. \nBaidu FSG plans to use part of the proceeds to be raised to invest in several domestic financial institutions, such as trust firms. It is expected to record 3 billion yuan to 4 billion in net revenue and turn a slight profit this year, one of the people said. Reporting by Julie Zhu and Kane Wu in HONG KONG; Editing by Muralikumar Anantharaman", "external_links": [], "published": "2018-01-24T13:28:00.000+02:00", "crawled": "2018-01-24T14:54:49.000+02:00", "highlightTitle": ""}