{"organizations": [], "uuid": "1b7907f3b8b742fe3d703785b1408b23fdfc0368", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222318477&w=1200&r=LYNXMPEE0F08S", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-myanmar-journalists/veteran-u-s-diplomat-richardson-to-work-for-reuters-reporters-release-idUKKBN1F50BV", "country": "US", "domain_rank": 408, "title": "Veteran U.S. diplomat Richardson to work for Reuters reporters release", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T06:30:00.000+02:00", "replies_count": 0, "uuid": "1b7907f3b8b742fe3d703785b1408b23fdfc0368"}, "author": "", "url": "https://uk.reuters.com/article/uk-myanmar-journalists/veteran-u-s-diplomat-richardson-to-work-for-reuters-reporters-release-idUKKBN1F50BV", "ord_in_thread": 0, "title": "Veteran U.S. diplomat Richardson to work for Reuters reporters release", "locations": [], "entities": {"persons": [{"name": "richardson", "sentiment": "negative"}, {"name": "bill richardson", "sentiment": "none"}, {"name": "reuters/stringer  richardson", "sentiment": "none"}, {"name": "aung san suu kyi", "sentiment": "none"}, {"name": "wa lone", "sentiment": "none"}, {"name": "surakiart sathirathai", "sentiment": "none"}, {"name": "kofi annan", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "myanmar", "sentiment": "none"}, {"name": "new mexico", "sentiment": "none"}, {"name": "yangon", "sentiment": "none"}, {"name": "rakhine", "sentiment": "none"}], "organizations": [{"name": "reuter", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "u.n.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 4:30 AM / Updated an hour ago Veteran U.S. diplomat Richardson to work for Reuters reporters release Reuters Staff 3 Min Read \n(Reuters) - Former New Mexico governor Bill Richardson said on Monday he would work towards securing the release of two Reuters journalists arrested in Myanmar in his capacity as a member of an international advisory board on the crisis in Rakhine state. \nRichardson said he was chosen by Myanmar’s leader Aung San Suu Kyi to sit on the 10-member board that will advise on how to implement recommendations of an earlier commission headed by former U.N. secretary-general Kofi Annan regarding the situation in the state. \nRichardson told Reuters he would travel to Myanmar next week, along with the chairman of the advisory board, Surakiart Sathirathai, a former Thai foreign minister, who has also called for the journalists’ release. He said he was seeking an appointment with Myanmar’s Minister of Home Affairs. \n“My objective, along with the chairman of the commission, is to get them out while we are there in Myanmar,” Richardson said in a telephone interview. \nZaw Htay, a spokesman for the Myanmar government, was not immediately available for comment. A spokesman for Myanmar’s home (interior) ministry said he was not aware of any appointment for Richardson. \nAccording to U.N. estimates, about 655,000 Rohingya Muslims have fled from a fierce military crackdown on militants in Rakhine. The Reuters journalists, Wa Lone and Kyaw Soe Oo, had been reporting on the crisis. Reuters journalist Wa Lone arrives at the court in Yangon, Myanmar January 10, 2018. REUTERS/Stringer \nThey were arrested on Dec 12 after they had been invited to meet police officers over dinner. Family members have said the two told them they were arrested almost immediately after being handed some documents by the officers they had gone to meet. \nRichardson, 70, was the U.S. ambassador to the United Nations and energy secretary in the administration of President Bill Clinton. Reuters journalist Kyaw Soe Oo arrives at the court in Yangon, Myanmar January 10, 2018. REUTERS/Stringer \nIn 1995, Richardson negotiated with Iraqi President Saddam Hussein to secure the release of two Americans detained after straying over the border from Kuwait and he frequently acted as a go-between with Communist North Korea. \nMyanmar prosecutors sought charges last week against Wa Lone, 31 and Kyaw Soe Oo, 27, under the Official Secrets Act, which carries a maximum prison sentence of 14 years, the reporters’ lawyer said. \nGovernment officials from some of the world’s major nations, including the United States, Britain and Canada, as well as top United Nations officials, have called for the release of the reporters. \n“One of the key (Annan) recommendations is the freedom of journalists to observe and report on the situation,” Richardson said. “Incarcerating these two individuals for potentially 14 years is not a good start.” Reporting by David Alire Garcia and Frank Jack Daniel; Editing by Raju Gopalakrishnan", "external_links": [], "published": "2018-01-16T06:30:00.000+02:00", "crawled": "2018-01-16T07:28:13.039+02:00", "highlightTitle": ""}