{"organizations": [], "uuid": "10ae8945889b331004a0df25713abb01c8c16060", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180118.html", "section_title": "Archive News &amp; Video for Thursday, 18 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/morocco-currency-dirham/update-1-morocco-c-banker-fx-move-can-raise-inflation-by-0-4-pct-in-extreme-case-idUSL8N1PD5GI", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Morocco central banker says FX move to raise inflation and growth", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-19T01:30:00.000+02:00", "replies_count": 0, "uuid": "10ae8945889b331004a0df25713abb01c8c16060"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/morocco-currency-dirham/update-1-morocco-c-banker-fx-move-can-raise-inflation-by-0-4-pct-in-extreme-case-idUSL8N1PD5GI", "ord_in_thread": 0, "title": "UPDATE 2-Morocco central banker says FX move to raise inflation and growth", "locations": [], "entities": {"persons": [{"name": "ulf laessing", "sentiment": "none"}, {"name": "abdellatif jouahri", "sentiment": "none"}, {"name": "zakia abdennebi", "sentiment": "none"}], "locations": [{"name": "morocco", "sentiment": "none"}, {"name": "rabat", "sentiment": "none"}], "organizations": [{"name": "fx", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "international monetary fund", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Morocco started more flexible currency system this week\n* Kingdom will implement FX reform in gradual way\n* Morocco hopes dirham move will boost growth\n* Inflation could also rise-central bank (Adds details, background)\nBy Ulf Laessing and Zakia Abdennebi\nRABAT, Jan 18 (Reuters) - The flexible exchange rate system introduced this week in Morocco could raise annual inflation by 0.4 percent “in an extreme case” while allowing faster economic growth, the central bank governor said on Thursday.\nOn Monday, the North African country widened the band in which the dirham can trade against hard currencies to better protect its economy against external shocks and preserve its foreign reserves. The new system is part of reforms recommended by the International Monetary Fund.\nCentral bank governor Abdellatif Jouahri said the move would improve people’s purchasing power and estimated it would boost economic growth by 0.2 percent.\nBefore the launch of the new system, Morocco had forecast slower GDP growth of 2.8 percent this year, down from 4 percent in 2017, due to lower agricultural output amid less rain.\nInflation will accelerate to 1.6 percent in 2018 from 0.2 percent last year due to rising energy and other import costs, the head of the planning commission told Reuters on Wednesday.\n“It will be positive for growth,” Jouahri told reporters at the bank’s headquarters, explaining the new dirham rules.\nThe dirham has hardly moved against major currencies following the change, easing concerns that it might see a sharp devaluation. The currency has firmed 0.25 percent to the dollar this week.\nIMF Jouahri said there had been no crisis to precipitate the shift, which he described as a “sovereign decision”.\nFinance minister Mohammed Boussaid, speaking alongside the central governor, said the first days of trading under the new rules showed that markets “trusted” the dirham.\nThe risk, however, is that any currency weakness stokes inflation through relatively expensive imports of food, hurting the poor.\nBoussaid said the central bank would continue to intervene in the foreign exchange market if necessary to support the dirham.\nHe said Morocco was going in a cautious way, step by step -- unlike Egypt, which opted for a full float of its pound in 2016.\nMorocco has foreign reserves worth 240 billion dirhams covering six months of imports, the central bank governor said.\nThe kingdom is also planning to negotiate a new form of IMF precautionary line of credit which will be “modular and better” than the previous one, Jouahri said.\nIn 2016, the IMF granted Morocco a two-year, $3.5 billion credit line to help reassure foreign lenders, investors and rating agencies, allowing the country to tap international capital markets at favorable borrowing terms. (Reporting by Ulf Laessing and Zakia Abdennebi; Writing by Sujata Rao and Ulf Laessing; Editing by Catherine Evans)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T01:30:00.000+02:00", "crawled": "2018-01-19T12:10:40.000+02:00", "highlightTitle": ""}