{"organizations": [], "uuid": "65dd1dd034292f1a0344558d1e1dfc18270b9247", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/business-wire-adt-marks-ipo-and-first-day-of-trading-on-new-york-stock-exchange.html", "country": "US", "domain_rank": 767, "title": "ADT Marks IPO and First Day of Trading on New York Stock Exchange", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T22:24:00.000+02:00", "replies_count": 0, "uuid": "65dd1dd034292f1a0344558d1e1dfc18270b9247"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/business-wire-adt-marks-ipo-and-first-day-of-trading-on-new-york-stock-exchange.html", "ord_in_thread": 0, "title": "ADT Marks IPO and First Day of Trading on New York Stock Exchange", "locations": [], "entities": {"persons": [{"name": "timothy j. whall", "sentiment": "none"}, {"name": "whall", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "adt", "sentiment": "negative"}, {"name": "new york stock exchange", "sentiment": "negative"}, {"name": "adt inc.", "sentiment": "negative"}, {"name": "new york stock exch", "sentiment": "negative"}, {"name": "nyse", "sentiment": "none"}, {"name": "first trade bell", "sentiment": "none"}, {"name": "nyse opening bell", "sentiment": "none"}, {"name": "inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- ADT Inc. (NYSE: ADT) opened for trading today on the New York Stock Exchange (NYSE) under the ticker symbol “ADT” following its initial public offering. ADT is a leading provider of security and automation solutions for homes and businesses in the United States and Canada, with approximately 7.2 million customers and nearly 18,000 employees.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180119005667/en/\nADT, Inc. Chief Executive Officer Timothy J. Whall, joined by members of ADT's senior executive team and board of directors, rings the NYSE Opening Bell(R). (Photo: NYSE)\nADT Chief Executive Officer Timothy J. Whall, joined by members of ADT’s senior executive team and board of directors, rang the NYSE Opening Bell® , followed by a visit to the DMM location on the Trading Floor to observe the price discovery process. The process culminated with the ringing of the First Trade Bell by Mr. Whall, which signified the opening of the stock.\n“We have 18,000 employees who have helped make tremendous strides as an organization over the past two years in redefining customer experience and what security means,” said ADT’s Whall. “A big thanks goes out to our passionate team members for continuously focusing on the one thing that matters most – our customers.”\n“We’re pleased to welcome ADT to the NYSE’s community of the world’s leading companies,” said Tom Farley, President, NYSE. “We congratulate the ADT team on its IPO, and we are proud to mark this exciting new chapter for the company and its shareholders.”\nWith 200 locations across the U.S. and Canada, and more than 300 authorized Dealers, ADT is an industry leader in sales, installation and service field force. ADT team members receive an average of 40,000 alarms each day.\nThe NYSE is home to many of the world's most iconic brands, technology business leaders and emerging growth companies shaping today's global economic landscape. For more information on listing on the New York Stock Exchange, visit https://www.nyse.com/list .\nAbout ADT\nADT is a leading provider of security and automation solutions in the United States and Canada for homes and businesses, people on-the-go and their network. Making security more accessible than ever before, and backed by 24/7 customer support, ADT delivers same-day service and live answer within seconds in customer operations, helping customers feel more safe and empowered. ADT is headquartered in Boca Raton, Florida and employs more than 18,000 people throughout North America.\nAbout NYSE Group\nNYSE Group is a subsidiary of Intercontinental Exchange (NYSE:ICE), a leading operator of global exchanges and clearing houses, and a provider of data and listings services. NYSE Group includes exchanges, market data and connectivity services. The equity exchanges -- the New York Stock Exchange, NYSE American and NYSE Arca -- trade more U.S. equity volume than any other exchange group. NYSE is the premier global venue for capital raising, leading worldwide in IPOs, including technology IPOs. NYSE Arca Options and NYSE Amex Options are leading equity options exchanges. To learn more, visit www.nyse.com/index .\nAbout Intercontinental Exchange\nIntercontinental Exchange (NYSE:ICE) is a Fortune 500 company that operates a leading network of global futures , equity and equity options exchanges, as well as global clearing and data services across financial and commodity markets. The New York Stock Exchange is the world leader in capital raising, listings and equities trading.\nTrademarks of ICE and/or its affiliates include Intercontinental Exchange, ICE, ICE block design, NYSE and New York Stock Exchange. Information regarding additional trademarks and intellectual property rights of Intercontinental Exchange, Inc. and/or its affiliates is located at http://www.intercontinentalexchange.com/terms-of-use . Key Information Documents for certain products covered by the EU Packaged Retail and Insurance-based Investment Products Regulation can be accessed on the relevant exchange website under the heading “Key information Documents (KIDS)”.\nSafe Harbor Statement under the Private Securities Litigation Reform Act of 1995 -- Statement in this press release regarding ICE's business that are not historical facts are \"forward-looking statements\" that involve risks and uncertainties. For a discussion of additional risks and uncertainties, which could cause actual results to differ from those contained in the forward-looking statements, see ICE's Securities and Exchange Commission (SEC) filings, including, but not limited to, the risk factors in ICE's Annual Report on Form 10-K for the year ended December 31, 2016, as filed with the SEC on February 7, 2017.\nSOURCE: Intercontinental Exchange\nICE-EQ\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180119005667/en/\nNYSE Media Contact\nJudy Shaw\n+1 212 656 4290\njudy.shaw@nyse.com\nSource: Intercontinental Exchange", "external_links": ["https://www.theice.com/market-data", "http://www.intercontinentalexchange.com/terms-of-use", "http://www.businesswire.com/news/home/20180119005667/en/", "https://www.intercontinentalexchange.com/about", "http://www.nyse.com/index", "https://www.theice.com/clearing", "https://www.nyse.com/list", "https://livestream.com/NYSE/adtopeningbell2018/videos/168807517", "https://www.theice.com/trade"], "published": "2018-01-19T22:24:00.000+02:00", "crawled": "2018-01-20T00:53:22.000+02:00", "highlightTitle": ""}