{"organizations": [], "uuid": "0429920db651b63f1ea70b6320326f7bd5fd8c9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-virtual-instruments-vastly-enhances-global-channel-partner-program-to-focus-on-customer-engagement-and-var-profitability.html", "country": "US", "domain_rank": 767, "title": "Virtual Instruments Vastly Enhances Global Channel Partner Program to Focus on Customer Engagement and VAR Profitability", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.962, "site_type": "news", "published": "2018-01-23T17:00:00.000+02:00", "replies_count": 0, "uuid": "0429920db651b63f1ea70b6320326f7bd5fd8c9c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-virtual-instruments-vastly-enhances-global-channel-partner-program-to-focus-on-customer-engagement-and-var-profitability.html", "ord_in_thread": 0, "title": "Virtual Instruments Vastly Enhances Global Channel Partner Program to Focus on Customer Engagement and VAR Profitability", "locations": [], "entities": {"persons": [], "locations": [{"name": "san jose", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "virtual instruments vastly enhances global channel partner program to focus on customer engagement", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN JOSE, Calif., Jan. 23, 2018 (GLOBE NEWSWIRE) -- Virtual Instruments , the leader in application-centric infrastructure performance management (IPM), today announced a significant refresh of the Virtual Instruments Partner (VIP) Program. The enhanced global VIP Program enables participating partners to benefit from attractive profit margins, in addition to rewards based on customer engagement, rather than the traditional and less lucrative model of compliance with training and certification programs.\nThe VIP Program is designed to recognize channel partners’ expertise in enterprise technologies such as server virtualization, storage, storage networking, application performance management, and cloud infrastructure technologies. By participating in the program, value-added reseller (VAR) partners gain access to rewards and resources to drive sales, create new opportunities, expand their solution portfolio, increase profitability, and differentiate themselves from their competition.\n“Virtual Instruments has listened to the needs of its partner channel, and released an attractive program that caters to the needs of its resellers, while still maintaining the integrity of a traditional partner program,” said Deborah Bannworth, Sr. Vice President, Strategic Alliances and Inside Sales, Sirius Computer Solutions. “Participating in its VIP Program helps us continue to drive innovation, improve service levels and maximize our clients’ performance, while also reducing their infrastructure costs and mitigating risk.”\nUnlike traditional partner programs, upward progression through the VIP Program is primarily dependent on the introduction of new customer opportunities into Virtual Instruments’ sales pipeline, not on compliance requirements or revenue levels. Partners are protected with a well-defined deal registration process that provides further rewards to VARs who originate opportunities on their own.\n“Traditional channel program models massively de-value and marginalize partners by restricting their growth opportunities,” said Paul Brodie, VP of Channel, Virtual Instruments. “Our newly enhanced VIP Program is the antithesis of those traditional models. We want to take the heavy lifting away from partners and provide a predictable program that is easy to navigate and doesn’t require additional partner resources. Just as importantly, we want to reward our VARs for bringing new deals to the table by leading with our industry-leading app-centric IPM solutions – because to us, that’s the definition of a mutually beneficial partnership.”\nThe new VIP Program also offers participants:\nA streamlined onboarding process; Increased and guaranteed margin rewards for VI Partner-originated, non-standard pricing opportunities; Demand generation programs and access to joint marketing development funds (MDF); An easy-to-navigate discount program based on partner tiers and lead origination; and Access to online demonstration environments, the VIP Partner Portal, which offers online training, lead and opportunity registration, marketing materials and more.\n“Since enterprises are increasingly demanding flexibility when it comes to the solutions they implement across their infrastructures, we recognize that partnerships are paramount to our success,” said Sheen Khoury, EVP of Sales, Virtual Instruments. “By building out a channel program that proactively rewards resellers for their work, we’re ensuring that more enterprises have access to our highly differentiated products and services, backed up by companies they can trust.”\nTogether, Virtual Instruments and its partners deliver solutions that guarantee the performance and availability of mission critical applications while minimizing IT infrastructure costs. To learn more about the VIP Program, please visit http://www.virtualinstruments.com/partners/\nAbout Virtual Instruments\nVirtual Instruments is the leader in application-centric infrastructure performance management. It provides comprehensive infrastructure instrumentation and performance analytics for enterprise data centers. The company’s solutions give IT teams deep workload visibility and actionable insights into their end-to-end systems across the hybrid data center. Virtual Instruments empowers companies to maximize the performance, availability and utilization of their production IT infrastructure. Virtual Instruments has over 500 customers, including enterprise IT, cloud service providers and storage vendors. The privately held company is headquartered in San Jose, Calif. For more information, visit https://www.virtualinstruments.com .\nContact\nAnne Stanley\n10Fold for Virtual Instruments\nvirtualinstruments@10fold.com\n+1 415 800 5383\nSource: Virtual Instruments", "external_links": ["https://www.globenewswire.com/Tracker?data=38aYI3xHy0fMhkXf0caboHGylTrQVijh4GKYGpk8-7kMC9hYCTwFJlduIkzLKvU97NK0eHgZjOoJqo_OoN_mTu2tM4YUutNiTP4vHtWR63YkFVye_Ml8bDkib2gQaMbZ", "https://www.globenewswire.com/Tracker?data=d9l4JhSDplNP4OmgID0ifM5AnjowyAJvWYjs5ElsG1jPEAd84-oQdj6NFlFo8TWsyA5CCTa5SW-kpWQOTMAACLP5vILSzIzC6YN5g-JvtdI0EWGHr8_NlTReC4p9pRshAf4KeHEXyXjXAvAJrCTxSQ==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/ca671431-c32a-4cd5-b6dd-5387516b7f83", "https://www.globenewswire.com/Tracker?data=g1jd362jKCsMLSVDeD9hI0PFFCqBAEwflMGPtvXSRM89ddWwRGnkXkKz7dweWm6emKij-yNv-bIjhcol0ITv50kvZriM_NZeML6Ho_vTZWQSRB5vO8MXbKPj8s5yGnhkT6hHsTaauoYQABVXFQ6TQnv06zQmWSS8OcVkUiooGR9E7f8KHNrAKc_35Cz9WneEV33yyjvZHF0G4ct_LoJOiXZP_uMAsy763qdT0d8Dye3FVciJz2y1HXP87fMdObKJttqnFtj2uUlkZF9EKvj8sDa2884EpTXh1omvkM2jje2tZ-Wp1T8RSrnHkK59VDbe8cYUeqS_IciX3cnLA52JxcCNAJ0YwIb-IWrT-MzYSbcNI5gJdx38HMd-gjl4Ywe7as0ziYlbWNdLQRURVab6-A==", "https://www.globenewswire.com/Tracker?data=RwpW-LL9nPG0bpwCWYSoP00Uui2IyZxYMaHzbevqLj_KieXuNEMagz-WisRmNvERT1Y0TDbtvlpPsNiKHam3k0dDxHJZRYPCw2Pi0bYyCAo=", "http://www.virtualinstruments.com/partners/"], "published": "2018-01-23T17:00:00.000+02:00", "crawled": "2018-01-23T17:49:44.015+02:00", "highlightTitle": ""}