{"organizations": [], "uuid": "ab19a29d3c550f8da8bc53537ddf69360a43da14", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-american-national-bankshares-inc-reports-fourth-quarter-2017-earnings.html", "country": "US", "domain_rank": 767, "title": "American National Bankshares Inc. Reports Fourth Quarter 2017 Earnings", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-19T00:05:00.000+02:00", "replies_count": 0, "uuid": "ab19a29d3c550f8da8bc53537ddf69360a43da14"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-american-national-bankshares-inc-reports-fourth-quarter-2017-earnings.html", "ord_in_thread": 0, "title": "American National Bankshares Inc. Reports Fourth Quarter 2017 Earnings", "locations": [], "entities": {"persons": [], "locations": [{"name": "va.", "sentiment": "none"}, {"name": "danville", "sentiment": "none"}], "organizations": [{"name": "american national bankshares inc", "sentiment": "neutral"}, {"name": "american national bank and trust company", "sentiment": "none"}, {"name": "globe newswire", "sentiment": "none"}, {"name": "american national bankshares inc.", "sentiment": "none"}, {"name": "amnb", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "2017 loan growth $171 million or 14.7%\nQ4 2017 net income of $2.1 million New tax law negatively impacts earnings with a one-time charge, deferred tax write down of $2.7 million Net interest margin of 3.46% for Q4 2017 Average shareholders’ equity for Q4 of $211.9 million is 11.64% of average assets\nDANVILLE, Va., Jan. 18, 2018 (GLOBE NEWSWIRE) -- American National Bankshares Inc. (“American National”) (NASDAQ:AMNB), parent company of American National Bank and Trust Company, today announced net income for the fourth quarter of 2017 of $2,120,000 compared to $4,122,000 for the fourth quarter of 2016, a $2,002,000 or 48.6% decrease. Basic and diluted net income per common share was $0.25 and $0.24, respectively for the fourth quarter of 2017 compared to $0.48 for the 2016 quarter. Net income for the fourth quarter of 2017 produced a return on average assets of 0.47%, a return on average equity of 4.00%, and a return on average tangible equity of 5.21%.\nNet income for the year ended December 31, 2017 was $15,249,000 compared to $16,301,000 for 2016, a $1,052,000 or 6.5% decrease. Basic and diluted net income per common share was $1.76 for the 2017 period compared to $1.89 for the 2016 period.\nDeferred Tax Asset Adjustment\nThe enactment of the new federal tax law, signed in late December 2017, negatively affected net income for the current quarter and year.\nThe law provides for the corporate tax rate to be reduced from 35% to 21%. The new tax rates become effective in 2018, but the 2017 enactment requires companies to revalue their deferred tax assets at the new tax rate in 2017. Accordingly, American National recognized a $2.7 million charge ($0.31 per share) to its deferred tax asset and a corresponding increase in income tax expense in the fourth quarter.\nBeginning in 2018, income tax expense will be positively affected by the substantial reduction in the corporate tax rate.\nFinancial Performance and Overview\nJeffrey V. Haley, President and Chief Executive Officer, reported, “For 2017 we continued to see robust growth in loans. Our loan portfolio grew $171 million or 14.7%. This growth was widespread throughout our markets, but especially evident in our de novo offices and our Guilford County offices.\n“Deposits have continued to grow also. They increased $164 million or 12.0%. This growth was also widespread.\n“Our national and local economies are improving and market interest rates are increasing. An improving economy and rising rates are good for American National.\n“Our continuing challenge in this environment is achieving a reasonable yield on our earnings assets, mostly loans, and maintaining control of the cost of our liabilities, mostly deposits. Rising rates are good for us, but the benefit of those increases is reduced by competition for high quality loan customers and, on the liability side, also reduced by the desire of high volume, high value deposit customers for better returns. The net result is continuing and increasing pressure on net interest margin.\n“We are pleased that for the fourth quarter of 2017 our net interest margin was 3.46% compared to 3.45% for the comparable quarter of 2016.\n“For 2017 our net interest margin was 3.50% compared to 3.52% for 2016.\n“Net income for the fourth quarter of 2017 was $2.1 million or $0.24 per diluted share, a decrease of $2.0 million or 48.6%. Without the impact of the one-time, deferred tax write-down, net income would have been $4.8 million or $0.55 per diluted share, approximately a $700,000 increase.\n“Net income for 2017 was $15.2 million or $1.76 per diluted share, a decrease of $1.1 million or 6.5%. Without the impact of the one-time, deferred tax write-down, net income would have been $17.9 million or $2.07 per diluted share, approximately a $1.6 million increase.\n“A lot of factors impacted earnings in 2017, but the major driver was the recently enacted tax reform legislation.\n“The cut in the tax rate for corporations from 35% to 21% is a good event for the economy. However, the 14% reduction in the statutory tax rate requires every corporation to revalue its deferred tax assets. Deferred taxes are how we reconcile the many differences between income as defined by generally accepted accounting principles and income as defined by the IRS. The short version of this long, technical story is that American National had to write down its deferred tax asset $2.7 million, or $0.31 per share, in December 2017, in advance of receiving the benefit of the tax rate cut, which began in January 2018.\n“Notwithstanding the one-time charge to income taxes, the fourth quarter results were excellent. The primary driver was a $1.7 million or 13.6% increase in net interest income, mostly the result of higher interest income on the loan portfolio. Interest income was driven by higher loan volume; average loan volume for the quarter was up $191 million or 17.2%, compared to the first quarter of 2016.”\nHaley concluded, “American National has a long and enviable legacy of a strong balance sheet. Over the past three years we have had substantial growth in that balance sheet, while maintaining high asset quality and exceptional capital ratios. We are working hard to continue that strategy. In the meantime, we are seeing improvement in the local economies of our various markets. That should continue to provide us with increasing opportunities to do what we do best – provide our customers with the best possible banking services and products. We look forward optimistically to the opportunities that 2018 will surely provide.”\nCapital\nAmerican National’s capital ratios remain strong and exceed all regulatory requirements.\nFor the quarter ended December 31, 2017, average shareholders’ equity was 11.64% of average assets, compared to 12.39% for the quarter ended December 31, 2016.\nBook value per common share was $24.08 at December 31, 2017, compared to $23.37 at December 31, 2016.\nTangible book value per common share was $18.87 at December 31, 2017, compared to $18.08 at December 31, 2016.\nCredit Quality Measurements\nNon-performing assets ($2,201,000 of non-performing loans, $359,000 of 90 day past due and accruing loans, and $1,225,000 of other real estate owned) represented 0.21% of total assets at December 31, 2017, compared to 0.29% at December 31, 2016.\nAnnualized net charge offs to average loans were six basis points for the fourth quarter of 2017, compared to zero for the same quarter in 2016.\nOther real estate owned was $1,225,000 at December 31, 2017, compared to $1,328,000 at December 31, 2016, a decrease of $103,000 or 7.8%.\nMerger Related Financial Impact\nThe acquisition accounting adjustments related to our two recent acquisitions have had and continue to have a positive impact on net interest income and income before income tax for American National. The impact of these adjustments is summarized below (dollars in thousands):\nFor the quarter ended December 31, 2017 2016 Net Interest Income $ 529 $ 427 Income Before Income Taxes $ 449 $ 252 For the year ended December 31, 2017 2016 Net Interest Income $ 2,114 $ 2,136 Income Before Income Taxes $ 1,586 $ 1,172\nThe fourth quarter of 2017 includes $348,000 in cash basis accretion income related to the early payoff of several acquired loans, compared to $123,000 for the comparable quarter of 2016.\nFor 2017, cash basis accretion income totaled $968,000, compared to $465,000 for 2016.\nNet Interest Income\nNet interest income before the provision", "external_links": ["https://www.globenewswire.com/Tracker?data=54y4SVCSgicm2nhrovcvxyNtP_3XXQelWfldVkgX4tFteBvvDHC1pp0bYYIJO1SlXmCHNo76YK0rVrVVB-hXhPNWdYgkPnsaiAO16BLdDVo=", "https://www.globenewswire.com/Tracker?data=d-RybD6GVrV-tSmFSMcfeLIYICU9zpJ1LMBEd_tAhCD3t57nHUVXn1RDYmClO_rkr3kSX66bQoZRaiQXt5SKr4fyPiNWGMfsXWHcjbVkOtuJyWSNYpQrTjnhETg1e49_IK7npeo0HWtTaDD2_DLHqDwL89I6jly2PInkIfyxw34=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/d7b70c16-1f3f-4dbf-8f8d-c0119b9127b1"], "published": "2018-01-19T00:05:00.000+02:00", "crawled": "2018-01-19T00:17:46.040+02:00", "highlightTitle": ""}