{"organizations": [], "uuid": "fbafc1e50a805ac22e2280b110634ad92d31668a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://newsdesk-feeds.moreover.com/feed/bbaa8d997fbf4549.atom?n=30&img=1&ext=sc", "section_title": "Cannabis (online news - English)", "url": "https://in.reuters.com/article/us-cmed-m-a-aurora-cannabis/canadian-cannabis-firm-aurora-in-talks-to-buy-both-cannimed-and-newstrike-sources-idINKBN1F82RX", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Canadian cannabis firm Aurora in talks to buy both CanniMed and Newstrike -sources", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T00:44:00.000+02:00", "replies_count": 0, "uuid": "fbafc1e50a805ac22e2280b110634ad92d31668a"}, "author": "John Tilak, Nichola Saminather4 Min Read", "url": "https://in.reuters.com/article/us-cmed-m-a-aurora-cannabis/canadian-cannabis-firm-aurora-in-talks-to-buy-both-cannimed-and-newstrike-sources-idINKBN1F82RX", "ord_in_thread": 0, "title": "UPDATE 1-Canadian cannabis firm Aurora in talks to buy both CanniMed and Newstrike -sources", "locations": [], "entities": {"persons": [{"name": "john tilak", "sentiment": "none"}, {"name": "nichola saminather", "sentiment": "none"}], "locations": [{"name": "aurora", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}], "organizations": [{"name": "aurora", "sentiment": "negative"}, {"name": "aurora cannabis inc", "sentiment": "none"}, {"name": "canopy health", "sentiment": "none"}, {"name": "min read  toronto", "sentiment": "none"}, {"name": "newstrike resources ltd", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "cannimed therapeutics inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 10:39 PM / Updated 15 hours ago Canadian cannabis firm Aurora in talks to buy both CanniMed and Newstrike: sources John Tilak , Nichola Saminather 4 Min Read \nTORONTO (Reuters) - Canadian marijuana producer Aurora Cannabis Inc ( ACB.TO ) is in talks with rivals CanniMed Therapeutics Inc ( CMED.TO ) and Newstrike Resources Ltd ( HIP.V ) to buy both businesses in a friendly deal that would create the nation’s top weed company, people familiar with the matter told Reuters on Friday. \nThe deal signals an easing of tensions following an offer in November by Aurora, Canada’s second-biggest listed cannabis producer, to buy CanniMed in an all-stock bid that was met with resistance from the target and a C$725 million ($580.4 million) lawsuit filed last week. \nThe combined company formed by a deal would inch ahead of industry leader Canopy Health’s ( WEED.TO ) C$7.1 billion market value. The deal-making and fundraising frenzy comes as weed companies jostle for prime position ahead of the country’s legalization of recreational use of marijuana in mid-2018. \nBuying CanniMed and Newstrike would boost Aurora’s capacity to meet the higher demand at home, as well as overseas as more countries approve the use of medical marijuana. \nAurora had strongly opposed a plan by CanniMed to purchase Newstrike. On Wednesday, Newstrike shareholders voted in favor of that deal, but on Thursday CanniMed postponed its investor vote on the acquisition to engage in talks with Aurora. \nIf the three companies fail to reach a deal, CanniMed could further postpone the vote, according to the people, who declined to be identified because they were not authorized to speak publicly about the matter. \nWhile Aurora now prefers to acquire both companies, it could also settle for just CanniMed if talks with Newstrike fail, the sources said. \nUnder Aurora’s original bid, which was capped at C$24 a share, if CanniMed were to buy Newstrike, Aurora’s offer would not proceed. \nThe sources said Aurora is ready to raise its offer price for CanniMed and would look to use its own stock, which has been on a tear alongside the rest of the Canadian cannabis industry. \nCanniMed shares closed up 6.7 percent at C$34.77 in Toronto. Aurora stock was up 3.9 percent at C$13.48. Newstrike gained 5 percent to C$1.47. \n“We said from the beginning that we’d be happy to sit down for friendly, collaborative discussions, so we’re going in with an open mind,” Aurora Chief Corporate Officer Cam Battley told Reuters on Friday. “Perhaps there’s an opportunity to do something on a friendly basis.” \nA CanniMed representative declined to comment. \nA Newstrike representative did not immediately respond to a request for comment. \nWith this latest development, both Aurora’s offer for CanniMed and CanniMed’s bid for Newstrike would be scrapped and replaced with a new friendly agreement, the people said. \nThe deal could be announced as early as Monday, the people said, while cautioning that there is no certainty an agreement would be reached. \nAurora had more than C$500 million of cash and marketable securities as of Dec. 31, it said on Jan. 2. \nThe talks between the three parties started earlier this week, the people said. Reporting by John Tilak and Nichola Saminather; Editing by Denny Thomas, Matthew Lewis and Daniel Wallis", "external_links": [], "published": "2018-01-20T00:44:00.000+02:00", "crawled": "2018-01-20T16:06:34.004+02:00", "highlightTitle": ""}