{"organizations": [], "uuid": "e712b4c5000d4cbee0bfd669a61fda5e69c648e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-adp-reports-second-quarter-fiscal-2018-results.html", "country": "US", "domain_rank": 767, "title": "ADP Reports Second Quarter Fiscal 2018 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.847, "site_type": "news", "published": "2018-01-31T15:00:00.000+02:00", "replies_count": 0, "uuid": "e712b4c5000d4cbee0bfd669a61fda5e69c648e5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-adp-reports-second-quarter-fiscal-2018-results.html", "ord_in_thread": 0, "title": "ADP Reports Second Quarter Fiscal 2018 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "hcm", "sentiment": "none"}, {"name": "roseland", "sentiment": "none"}], "organizations": [{"name": "adp", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Revenues increased 8% to $3.2 billion for the quarter, 7% organic; raising fiscal 2018 revenue growth outlook to 7% to 8%\nWorldwide new business bookings increased 6% for the quarter, maintaining 5% to 7% increase in fiscal 2018 Diluted earnings per share declined 7% to $1.05 for the quarter, adjusted diluted earnings per share increased 14% to $0.99 Raising fiscal 2018 diluted earnings per share growth outlook to 8% to 9% and adjusted diluted earnings per share growth outlook to 12% to 13% In January 2018, ADP acquired WorkMarket, a leader in cloud-based freelance management\nROSELAND, N.J., Jan. 31, 2018 (GLOBE NEWSWIRE) -- ADP® (Nasdaq:ADP), a leading global provider of Human Capital Management (HCM) solutions, today announced its second quarter fiscal 2018 financial results, and provided an update to its fiscal 2018 outlook.\nSecond Quarter Fiscal 2018 Consolidated Results\nCompared to last year’s second quarter, revenues grew 8% to $3.2 billion, 7% organic. Net earnings were ahead of Company expectations but declined 8% to $468 million primarily due to the prior year second quarter $205 million pre-tax gain on the sale of the CHSA and COBRA businesses. Earnings before income tax declined to $566 million, or 28%. Adjusted earnings before income tax increased to $602 million, or 2%. Adjusted EBIT margin declined about 120 basis points in the quarter to 18.6% due to pressure from higher pass-through revenues and acquisitions. The enactment of the Tax Cuts and Jobs Act helped reduce the effective tax rate for the quarter to 17.4%, and 25.6% on an adjusted basis. This adjusted effective tax rate excludes a one-time net benefit of approximately $46 million related to the revaluation of U.S. deferred tax balances partially offset by a one-time transition tax and the recording of a valuation allowance against our foreign tax credits. Diluted earnings per share declined 7% to $1.05. Adjusted diluted earnings per share increased 14% to $0.99.\n“The world of work is going through transformative changes and we are continuing to evolve our solutions to meet our clients’ dynamic needs,” said Carlos Rodriguez, President and Chief Executive Officer, ADP. “With the recent acquisitions of Global Cash Card and WorkMarket we have further solidified our strategy of being the leading provider of HCM solutions across the entire workforce as we now comprehensively address the growing importance of freelance workers for our clients.”\n“ADP delivered strong results in the quarter, posting solid revenue, bookings and adjusted EPS growth. Based on the performance in the first half of the year, and the ongoing benefit we expect from corporate tax reform, we are raising our full year adjusted EPS guidance to 12% to 13% growth,” said Jan Siegmund, Chief Financial Officer, ADP.\nAdjusted EBIT, adjusted EBIT margin, adjusted diluted earnings per share, adjusted effective tax rate, and organic revenue are all non-GAAP financial measures. Please refer to the accompanying financial tables at the end of this release for a discussion of why ADP believes these measures are important and for a reconciliation of non-GAAP financial measures to their comparable GAAP financial measures.\nSecond Quarter Fiscal 2018 Segment Results\nEmployer Services – Employer Services offers a comprehensive range of HCM and human resources outsourcing solutions.\nEmployer Services revenues increased 6% on a reported basis, 4% organic compared to last year’s second quarter. The number of employees on ADP clients' payrolls in the United States increased 2.6% for the second quarter when measured on a same-store-sales basis for a subset of clients ranging from small to large businesses. Employer Services client revenue retention declined 20 basis points compared to last year’s second quarter. Employer Services segment margin decreased approximately 50 basis points compared to last year’s second quarter. This decrease resulted primarily from approximately 70 basis points of pressure from acquisitions and foreign currency.\nPEO Services – PEO Services provides comprehensive employment administration outsourcing solutions through a co-employment relationship.\nPEO Services revenues increased 15% compared to last year’s second quarter driven primarily by a 10% increase in average worksite employees for the quarter and higher than expected growth in pass-through revenues. PEO Services segment margin declined approximately 30 basis points compared to last year’s second quarter, primarily driven by pressure from higher pass-through revenues. Average worksite employees paid by PEO Services were about 498,000 and we ended the quarter with about 504,000 worksite employees.\nInterest on Funds Held for Clients – The safety, liquidity and diversification of ADP clients’ funds are the foremost objectives of the company’s investment strategy. Client funds are invested in accordance with ADP’s prudent and conservative investment guidelines and the credit quality of the investment portfolio is predominantly AAA/AA.\nFor the second quarter, interest on funds held for clients increased 16% to $107 million from $92 million a year ago. Average client funds balances increased 7% in the second quarter to $22.5 billion compared to $20.9 billion a year ago. For the second quarter, the average interest yield on client funds was 1.9% which was up 10 basis points compared to a year ago.\nNotable Subsequent Events\nThe composition of work is increasingly moving toward the freelance, or “gig,” worker and it is with this evolution in mind that ADP acquired WorkMarket, a leading provider of cloud-based freelance management solutions. With this acquisition, ADP has expanded its market opportunities while building on its current portfolio of industry-leading payroll and HCM solutions that help clients and workers modernize the way work gets done, while unlocking productivity, engagement, and growth. The purchase price of this acquisition was approximately $125 million.\nFiscal 2018 Outlook\nCertain components of ADP’s fiscal 2018 outlook and related growth comparisons exclude the impact of the following items and are discussed on an adjusted basis where applicable. Please refer to the accompanying financial tables for a reconciliation of these adjusted amounts to their closest comparable GAAP measure.\nFiscal 2017 pre-tax restructuring charges of $90 million related to our Service Alignment Initiative. Fiscal 2017 second quarter pre-tax gain on the sale of the CHSA and COBRA businesses of $205 million. Anticipated fiscal 2018 pre-tax restructuring charges of about $25 million related to our Service Alignment Initiative. Fiscal 2018 pre-tax proxy contest charges of about $33 million. Fiscal 2018 second quarter one-time net tax benefit of about $46 million from the Tax Cuts and Jobs Act.\nADP now anticipates full-year fiscal 2018 revenue growth of 7% to 8% compared to the prior forecast of 6% to 8%. This revenue forecast continues to include approximately one percentage point of growth from acquisitions and the impact from foreign currency. This revenue forecast continues to assume growth in worldwide new business bookings of 5% to 7% compared to the $1.65 billion sold in fiscal 2017. Adjusting for additional anticipated PEO pass-through pressure, ADP now assumes adjusted EBIT margin will decline approximately 50 basis points for the full year compared to the prior forecast of down 25 to 50 basis points.\nADP expects full year diluted earnings per share to be up 8% to 9%, compared to our prior forecast of down 1% to up 1% and adjusted diluted earnings per share growth to be 12% to 13% compared to our prior forecast of 5% to 7% growth. This adjusted earnings per share forecast reflects the ongoing estimated benefits from the enactment of the Tax Cuts and Jobs Act, and ADP now forecasts an adjusted effective tax rate for fiscal 2018 of 26.9% compared to the prior forecast of 31.7%. This benefit is primarily attributable to the lower blended federal corporate statutory rate of 28.1% for fiscal 2018.\nReportable Segments Fiscal 2018 Forecast\nFor the Employer Services segment, ADP still anticipates revenue growth of approximately 4% to 5%, and continues to anticipate a margin decline of 50 to 75 basis points for the year. ADP maintains expectations for an increase in pays per control of 2.5% for the year. For the PEO Services segment, taking into account higher pass-through revenues, ADP now anticipates revenue growth of approximately 12% to 13%, compared to our prior forecast of 11% to 13% and margin to be flat to down 25 basis points for the year, compared to the prior forecast of up 25 to 50 basis points.\nClient Funds Extended Investment Strategy Fiscal 2018 Forecast\nThe interest assumptions in our forecasts are based on Fed Funds futures contracts and forward yield curves as of January 29, 2018. The Fed Funds futures contracts used in the client short and corporate cash interest income forecasts assume an increase in the Fed Funds rate in March 2018. The three-and-a-half and five-year U.S. government agency rates based on the forward yield curves as of January 29, 2018 were used to forecast new purchase rates for the client and corporate extended, and client long portfolios, respectively.\nInterest on funds held for clients is expected to increase $55 to $65 million, or about 16%, compared to the prior forecast of up $45 to $55 million. This is based on anticipated growth in average client funds balances of approximately 4% to 5% from $23.0 billion in fiscal 2017, compared to the prior forecast of approximately 3% growth and an average yield which is still anticipated to increase about 20 basis points to 1.9% compared to the fiscal 2017 average yield of 1.7%. The total contribution from the client funds extended investment strategy is now expected to be up $45 to $55 million compared to the prior forecast of up $35 to $45 million.\nInvestor Webcast Today\nADP will host a conference call for financial analysts today, Wednesday, January 31, 2018 at 8:30 a.m. EDT. The conference call will be webcast live on ADP’s website at investors.adp.com and will be available for replay following the call. A slide presentation will be available shortly before the webcast.\nSupplemental financial information including schedules of quarterly and full year reportable segment revenues and earnings for fiscal years 2016 and 2017, as well as quarterly details of the fiscal 2018 results from the client funds extended investment strategy, are posted to ADP’s website at investors.adp.com . ADP news releases, current financial information, SEC filings and Investor Relations presentations are accessible at the same website.\nAbout ADP (Nasdaq: ADP)\nPowerful technology plus a human touch. Companies of all types and sizes around the world rely on ADP’s cloud software and expert insights to help unlock the potential of their people. HR. Talent. Benefits. Payroll. Compliance. Working together to build a better workforce. For more information, visit ADP.com .\nAutomatic Data Processing, Inc. and Subsidiaries Statements of Consolidated Earnings (In millions, except per share amounts) (Unaudited) Three Months Ended Six Months Ended December 31, December 31, 2017 2016 2017 2016 Revenues: Revenues, other than interest on funds held for clients and PEO revenues $ 2,188.8 $ 2,077.4 $ 4,269.8 $ 4,114.8 Interest on funds held for clients 106.7 91.8 206.1 181.0 PEO revenues (A) (B) 939.9 818.1 1,838.3 1,608.4 Total revenues 3,235.4 2,987.3 6,314.2 5,904.2 Expenses: Costs of revenues: Operating expenses (B) 1,719.3 1,560.4 3,366.0 3,091.9 Systems development & programming costs 158.1 152.5 315.1 307.4 Depreciation & amortization 69.3 54.9 131.9 112.2 Total costs of revenues 1,946.7 1,767.8 3,813.0 3,511.5 Selling, general & administrative expenses 717.2 640.8 1,379.6 1,288.6 Interest expense 27.5 20.5 55.5 40.4 Total expenses 2,691.4 2,429.1 5,248.1 4,840.5 Other income, net (21.7 ) (228.0 ) (47.8 ) (251.1 ) Earnings before income taxes 565.7 786.2 1,113.9 1,314.8 Provision for income taxes 98.2 275.3 244.9 435.2 Net earnings $ 467.5 $ 510.9 $ 869.0 $ 879.6 Basic earnings per share $ 1.06 $ 1.14 $ 1.97 $ 1.95 Diluted earnings per share $ 1.05 $ 1.13 $ 1.96 $ 1.94 Dividends declared per common share $ 0.630 $ 0.570 $ 1.200 $ 1.100 Components of Other income, net: Interest income on corporate funds $ (22.7 ) $ (21.3 ) $ (48.5 ) $ (44.3 ) Realized gains on available-for-sale securities (0.2 ) (2.0 ) (0.5 ) (2.5 ) Realized losses on available-for-sale securities 1.2 0.7 1.6 1.1 Gain on sale of assets — — (0.4 ) — Gain on sale of business — (205.4 ) — (205.4 ) Total other income, net $ (21.7 ) $ (228.0 ) $ (47.8 ) $ (251.1 ) (A) Professional Employer Organization (“PEO”) revenues are net of direct pass-through costs, primarily consisting of payroll wages and payroll taxes of $10,632.3 million and $9,145.5 million for the three months ended December 31, 2017 and 2016, respectively, and $19,370.8 million and $16,833.1 million for the six months ended December 31, 2017 and 2016, respectively. (B) PEO revenues and operating expenses include pass-through costs associated with benefits coverage, workers' compensation coverage, and state unemployment taxes for worksite employees of $705.2 million and $610.0 million for the three months ended December 31, 2017 and 2016, respectively, and $1,391.7 million and $1,207.8 million for the six months ended December 31, 2017 and 2016, respectively.\nAutomatic Data Processing, Inc. and Subsidiaries Condensed Consolidated Balance Sheets (In millions) (Unaudited) December 31, June 30, 2017 2017 Assets Cash and cash equivalents $ 1,773.4 $ 2,780.4 Other current assets 3,125.3 2,586.8 Total current assets before funds held for clients 4,898.7 5,367.2 Funds held for clients 34,451.3 27,291.5 Total current assets 39,350.0 32,658.7 Property, plant and equipment, net 799.9 779.9 Other non-current assets 4,395.6 3,741.4 Total assets $ 44,545.5 $ 37,180.0 Liabilities and Stockholders' Equity Other current liabilities $ 2,742.8 $ 2,626.5 Client funds obligations 34,508.1 27,189.4 Total current liabilities 37,250.9 29,815.9 Long-term debt 2,002.4 2,002.4 Other non-current liabilities 1,361.0 1,384.7 Total liabilities 40,614.3 33,203.0 Total stockholders' equity 3,931.2 3,977.0 Total liabilities and stockholders' equity $ 44,545.5 $ 37,180.0\nAutomatic Data Processing, Inc. and Subsidiaries Condensed Statements of Consolidated Cash Flows (In millions) (Unaudited) Six Months Ended December 31, 2017 2016\n*As Adjusted Cash Flows from Operating Activities: Net earnings $ 869.0 $ 879.6 Adjustments to reconcile net earnings to cash flows provided by operating activities 325.2 200.4 Changes in operating assets and liabilities, net of effects from acquisitions and divestitures of businesses (519.1 ) (238.9 ) Net cash flows provided by operating activities 675.1 841.1 Cash Flows from Investing Activities: Purchases and proceeds from corporate and client funds marketable securities (588.2 ) (481.5 ) Capital expenditures (118.3 ) (119.7 ) Additions to intangibles (132.4 ) (106.6 ) Acquisitions of businesses, net of cash acquired (487.4 ) (20.0 ) Proceeds from the sale of divested businesses — 234.0 Net cash flows used in investing activities (1,326.3 ) (493.8 ) Cash Flows from Financing Activities: Net increase / (decrease) in client funds obligations 7,207.1 (2,799.9 ) Repurchases of common stock (408.3 ) (765.3 ) Dividends paid (506.7 ) (482.3 ) Other financing activities (11.8 ) 18.2 Net cash flows provided by / (used in) financing activities 6,280.3 (4,029.3 ) Effect of exchange rate changes on cash, cash equivalents, restricted cash, and restricted cash equivalents 49.1 (55.1 ) Net change in cash, cash equivalents, restricted cash, and restricted cash equivalents 5,678.2 (3,737.1 ) Cash, cash equivalents, restricted cash, and restricted cash equivalents, beginning of period 8,181.6 15,458.6 Cash, cash equivalents, restricted cash, and restricted cash equivalents, end of period $ 13,859.8 $ 11,721.5 Reconciliation of cash, cash equivalents, restricted cash, and restricted cash equivalents to the Condensed Consolidated Balance Sheets Cash and cash equivalents 1,773.4 2,705.2 Restricted cash and restricted cash equivalents included in funds held for clients 12,086.4 9,016.3 Total cash, cash equivalents, restricted cash, and restricted cash equivalents $ 13,859.8 $ 11,721.5 Supplemental disclosures of cash flow information: Cash paid for interest $ 54.3 $ 39.2 Cash paid for income taxes, net of income tax refunds $ 389.2 $ 332.6 *Prior-period information has been restated for the adoption of ASU No. 2016-18, Statement of Cash Flows, Restricted Cash (Topic 230).\nAutomatic Data Processing, Inc. and Subsidiaries Other Selected Financial Data (Dollars in millions, except per share amounts) (Unaudited) Three Months Ended Six Months Ended December 31, December 31, 2017 2016 % Change 2017 2016 % Change Revenues Employer Services $ 2,437.6 $ 2,309.3 6 % $ 4,754.0 $ 4,570.6 4 % PEO Services 945.3 822.9 15 % 1,848.8 1,617.6 14 % Other (147.5 ) (144.9 ) n/m (288.6 ) (284.0 ) n/m Total revenues $ 3,235.4 $ 2,987.3 8 % $ 6,314.2 $ 5,904.2 7 % Segment earnings Employer Services $ 706.4 $ 681.1 4 % $ 1,353.0 $ 1,337.1 1 % PEO Services 128.2 114.5 12 % 245.0 221.6 11 % Other (268.9 ) (9.4 ) n/m (484.1 ) (243.9 ) n/m Total pretax earnings $ 565.7 $ 786.2 (28 )% $ 1,113.9 $ 1,314.8 (15 )% Three Months Ended Six Months Ended December 31, December 31, Segment margin 2017 2016 Change 2017 2016 Change Employer Services 29.0 % 29.5 % (0.5 )% 28.5 % 29.3 % (0.8 )% PEO Services 13.6 % 13.9 % (0.3 )% 13.2 % 13.7 % (0.4 )% Other n/m n/m n/m n/m n/m n/m Total pretax margin 17.5 % 26.3 % (8.8 )% 17.6 % 22.3 % (4.6 )% Three Months Ended Six Months Ended December 31, December 31, Earnings per share information: 2017 2016 % Change 2017 2016 % Change Net earnings $ 467.5 $ 510.9 (8 )% $ 869.0 $ 879.6 (1 )% Basic weighted average shares outstanding 441.3 447.9 (1 )% 441.8 450.1 (2 )% Basic earnings per share $ 1.06 $ 1.14 (7 )% $ 1.97 $ 1.95 1 % Diluted weighted average shares outstanding 443.7 450.3 (1 )% 444.4 452.7 (2 )% Diluted earnings per share $ 1.05 $ 1.13 (7 )% $ 1.96 $ 1.94 1 % Key Statistics: Employer Services: Change in pays per control - U.S. 2.6 % 2.3 % 2.5 % 2.5 % Change in client revenue retention percentage - worldwide (0.2 ) pts 0.1 pts 0.7 pts (0.4 ) pts Employer Services/PEO new business bookings growth - worldwide 6 % (5 )% 2 % (3 )% PEO Services: Paid PEO worksite employees at end of period 504,000 457,000 504,000 457,000 Average paid PEO worksite employees during the period 498,000 452,000 491,000 445,000\nAutomatic Data Processing, Inc. and Subsidiaries Other Selected Financial Data, Continued (Dollars in millions, except per share amounts or where otherwise stated) (Unaudited) Three Months Ended Six Months Ended December 31, December 31, 2017 2016 Change % Change 2017 2016 Change % Change Average investment balances at cost (in billions): Corporate, other than corporate extended $ 1.6 $ 2.5 $ (1.0 ) (38 )% $ 1.9 $ 2.7 $ (0.8 ) (29 )% Corporate extended 4.0 4.5 (0.5 ) (10 )% 4.2 4.5 (0.3 ) (6 )% Total corporate 5.6 7.0 (1.4 ) (20 )% 6.1 7.2 (1.1 ) (15 )% Funds held for clients 22.5 20.9 1.6 7 % 21.8 20.5 1.4 7 % Total $ 28.1 $ 27.9 $ 0.1 — % $ 27.9 $ 27.7 $ 0.3 1 % Average interest rates earned exclusive of realized losses (gains) on: Corporate, other than corporate extended 1.1 % 0.7 % 1.1 % 0.7 % Corporate extended 1.8 % 1.5 % 1.8 % 1.6 % Total corporate 1.6 % 1.2 % 1.6 % 1.2 % Funds held for clients 1.9 % 1.8 % 1.9 % 1.8 % Total 1.8 % 1.6 % 1.8 % 1.6 % Net unrealized (loss)/gain position at end of period $ (56.7 ) $ 24.2 $ (56.7 ) $ 24.2 Average short-term financing (in billions): U.S. commercial paper borrowings $ 3.5 $ 4.2 $ 3.7 $ 4.2 U.S. & Canadian reverse repurchase agreement borrowings 0.5 0.3 0.5 0.3 $ 4.0 $ 4.5 $ 4.2 $ 4.5 Average interest rates paid on: U.S. commercial paper borrowings 1.2 % 0.5 % 1.2 % 0.5 % U.S. & Canadian reverse repurchase agreement borrowings 1.2 % 0.5 % 1.1 % 0.5 % Interest on funds held for clients $ 106.7 $ 91.8 $ 14.9 16 % $ 206.1 $ 181.0 $ 25.0 14 % Corporate extended interest income (C) 18.3 17.0 1.3 8 % 37.8 35.1 2.7 8 % Corporate interest expense-short-term financing (C) (12.5 ) (5.5 ) (7.0 ) (126 )% (25.5 ) (10.5 ) (15.0 ) (143 )% $ 112.5 $ 103.3 $ 9.2 9 % $ 218.4 $ 205.7 $ 12.7 6 % (C) Please refer to the accompanying financial table at the end of this release for a reconciliation of these non-GAAP measures to their comparable GAAP financial measures.\nAutomatic Data Processing, Inc. and Subsidiaries Consolidated Statement of Adjusted / Non-GAAP Financial Information (in millions, except per share amounts) (Unaudited) In addition to our GAAP results, we use the adjusted results and other non-GAAP metrics set forth in the table below to evaluate our operating performance in the absence of certain items and for planning and forecasting of future periods: Adjusted Financial Measure U.S. GAAP Measures Adjustments/Explanation - as applicable in the periods Adjusted EBIT Net earnings - Provision for income taxes\n- All other interest expense and income\n- Certain restructuring charges\n- Gains/losses on sales of businesses and assets\n- Non-operational costs related to proxy contest matters\nSee footnotes (a), (b), and (f)\nAdjusted net earnings Net earnings Pre-tax and tax impacts of:\n- Certain restructuring charges\n- Gains/losses on sales of businesses and assets\n- Non-operational costs related to proxy contest matters\n- Tax Cuts and Jobs Act\nSee footnotes (b), (c), (d), (f), and (g)\nAdjusted provision for income taxes Provision for income taxes Tax impacts of:\n- Gains/losses on sales of businesses and assets\n- Certain restructuring charges\n- Non-operational costs related to proxy contest matters\n- Tax Cuts and Jobs Act\nSee footnotes (c), (d), (f), and (g)\nAdjusted diluted earnings per share Diluted earnings per share EPS impacts of:\n- Gains/losses on sales of businesses and assets\n- Certain restructuring charges\n- Non-operational costs related to proxy contest matters\n- Tax Cuts and Jobs Act\nSee footnotes (b), (c), (f), and (g)\nAdjusted effective tax rate Effective tax rate See footnote (e) Constant Dollar Basis U.S. GAAP P&L line items See footnote (h) Organic revenue growth Revenues Impact of acquisitions\nImpact of dispositions\nImpact of foreign currency\nSee footnote (i) Corporate extended interest income Interest income All other interest income\nSee footnote (j) Corporate interest expense-short-term financing Interest expense All other interest expense\nSee footnote (j) We believe that the exclusion of the identified items helps us reflect the fundamentals of our underlying business model and analyze results against our expectations, against prior period, and to plan for future periods by focusing on our underlying operations. We believe that the adjusted results provide relevant and useful information for investors because it allows investors to view performance in a manner similar to the method used by management and improves their ability to understand and assess our operating performance. The nature of these exclusions are for specific items that are not fundamental to our underlying business operations. Since these adjusted financial measures and other non-GAAP metrics are not measures of performance calculated in accordance with U.S. GAAP, they should not be considered in isolation from, as a substitute for, or superior to their U.S. GAAP measures, and they may not be comparable to similarly titled measures at other companies. Three Months Ended Six Months Ended December 31, % Change December 31, % Change 2017 2016 As\nReported Constant\nDollar Basis (h) 2017 2016 As\nReported Constant\nDollar Basis (h) Net earnings $ 467.5 $ 510.9 (8 )% (9 )% $ 869.0 $ 879.6 (1 )% (2 )% Adjustments: Provision for income taxes 98.2 275.3 244.9 435.2 All other interest expense (a) 15.0 14.9 30.0 29.9 All other interest income (a) (4.4 ) (4.4 ) (10.7 ) (9.2 ) Gain on sale of business — (205.4 ) — (205.4 ) Service Alignment Initiative (b) 3.3 1.2 — 41.1 Proxy contest matters (f) 22.9 — 33.3 — Adjusted EBIT $ 602.5 $ 592.5 2 % 1 % $ 1,166.5 $ 1,171.2 — % (1 )% Adjusted EBIT Margin 18.6 % 19.8 % 18.5 % 19.8 % Provision for income taxes $ 98.2 $ 275.3 (64 )% (65 )% $ 244.9 $ 435.2 (44 )% (44 )% Adjustments: Gain on sale of business (c) — (84.0 ) — (84.0 ) Service Alignment Initiative (d) 1.3 0.4 — 15.5 Proxy contest matters (f) 6.3 — 10.3 — Tax Cuts and Jobs Act (g) 45.7 — 45.7 — Adjusted provision for income taxes $ 151.5 $ 191.7 (21 )% (22 )% $ 300.9 $ 366.7 (18 )% (19 )% Adjusted effective tax rate (e) 25.6 % 32.9 % 26.2 % 31.9 % Net earnings $ 467.5 $ 510.9 (8 )% (9 )% $ 869.0 $ 879.6 (1 )% (2 )% Adjustments: Gain on sale of business — (205.4 ) — (205.4 ) Provision for income taxes on gain on sale of business (c) — 84.0 — 84.0 Service Alignment Initiative (b) 3.3 1.2 — 41.1 Income tax provision/(benefit) for Service Alignment Initiative (d) (1.3 ) (0.4 ) — (15.5 ) Proxy contest matters (f) 22.9 — 33.3 — Income tax benefit for proxy contest matters (f) (6.3 ) — (10.3 ) — Income tax benefit from Tax Cuts and Jobs Act (g) (45.7 ) — (45.7 ) — Adjusted net earnings $ 440.4 $ 390.3 13 % 12 % $ 846.3 $ 783.8 8 % 7 % Diluted EPS $ 1.05 $ 1.13 (7 )% (7 )% $ 1.96 $ 1.94 1 % — % Adjustments: Gain on sale of business (c) — (0.27 ) — (0.27 ) Service Alignment Initiative (b) — — — 0.06 Proxy contest matters (f) 0.04 — 0.05 — Tax Cuts and Jobs Act (g) (0.10 ) — (0.10 ) — Adjusted diluted EPS $ 0.99 $ 0.87 14 % 13 % $ 1.90 $ 1.73 10 % 9 % (a) We continue to include the interest income earned on investments associated with our client funds extended investment strategy and interest expense on borrowings related to our client funds extended investment strategy as we believe these amounts to be fundamental to the underlying operations of our business model. The adjustments in the table above represent the interest income and interest expense that is not related to our client funds extended investment strategy and are labeled as \"All other interest expense\" and \"All other interest income.\" (b) The majority of charges relating to our Service Alignment Initiative represent severance charges. Severance charges have been taken in the past and not included as an adjustment to get to adjusted results. Unlike severance charges in prior periods, these specific charges relate to our broad-based, company-wide Service Alignment Initiative. (c) The taxes on the gain on sale of the business were calculated based on the annualized marginal rate in effect during the quarter of the adjustment. The tax amount was adjusted for a book vs. tax basis difference for the period ended December 31, 2016 due to the derecognition of goodwill upon the sale of the business. (d) The tax provision on the Service Alignment Initiative was calculated based on the annualized marginal rate in effect during the quarter of the adjustment. (e) The Adjusted effective tax rate is calculated as our Adjusted provision for income taxes divided by our Adjusted net earnings plus our Adjusted provision for income taxes. (f) Represents non-operational costs associated with proxy contest matters. The tax benefit on the non-operational charges related to proxy contest matters was calculated based on the annualized marginal rate in effect during the quarter of the adjustment. (g) The one-time net benefit from the enactment of the Tax Cuts and Jobs Act (the “Act”) is comprised of the application of the newly enacted U.S. corporate tax rates to our U.S. deferred tax balances partially offset by the one-time transition tax and the recording of a valuation allowance against our foreign tax credits which may not be realized. (h) \"Constant dollar basis\" provides information that isolates the actual growth of our operations. \"Constant dollar basis\" is determined by calculating the current year result using foreign exchange rates consistent with the prior year. (i) The following table reconciles our reported growth rates to the non-GAAP measure of organic revenue which excludes the impact of acquisitions, the impact of dispositions, and the impact of foreign currency. The impact of acquisitions and dispositions is calculated by excluding the current year revenues of acquisitions until the one year anniversary of the transaction and by excluding the prior year revenues of divestitures for the one year period preceding the transaction. The impact of foreign currency is determined by calculating the current year result using foreign exchange rates consistent with the prior year. The PEO segment is not impacted by acquisitions, dispositions or foreign currency. Three Months Ended Six Months Ended December 31, December 31, Revenue growth consolidated: 2017 2016 2017 2016 Employer Services 6 % 4 % 4 % 5 % PEO Services 15 % 12 % 14 % 12 % Consolidated revenue growth as reported 8 % 6 % 7 % 7 % Adjustments: Impact of acquisitions (1 )% — % (1 )% — % Impact of dispositions 1 % — % 1 % — % Impact of foreign currency (1 )% — % (1 )% — % Consolidated organic revenue growth 7 % 7 % 6 % 7 % Segment: Employer Services revenue growth as reported 6 % 4 % 4 % 5 % Adjustments: Impact of acquisitions (1 )% — % (1 )% — % Impact of dispositions 1 % — % 1 % — % Impact of foreign currency (1 )% — % (1 )% — % Employer Services organic revenue growth 4 % 5 % 3 % 5 % (j) The following tables reconcile our \"Total interest income\" and \"Total interest expense\" to “Corporate extended interest income” and “Corporate interest expense-short-term financing,” related to our client funds investment strategy which are non-GAAP measures. Three Months Ended Six Months Ended December 31, December 31, 2017 2016 2017 2016 Corporate extended interest income $ 18.3 $ 17.0 $ 37.8 $ 35.1 All other interest income 4.4 4.4 10.7 9.2 Total interest income on corporate funds $ 22.7 $ 21.3 $ 48.5 $ 44.3 Corporate interest expense-short-term financing $ 12.5 $ 5.5 $ 25.5 $ 10.5 All other interest expense 15.0 14.9 30.0 29.9 Total interest expense $ 27.5 $ 20.5 $ 55.5 $ 40.4\nAutomatic Data Processing, Inc. and Subsidiaries Fiscal 2018 GAAP to Non-GAAP Guidance Reconciliation (Unaudited) Twelve Months Ended Fiscal 2018 June 30, 2017 Forecast Earnings before income taxes / margin (GAAP) $ 2,531.1 20.4 % ~(200) bps All other interest expense 59.3 +50bps - a All other interest income (22.4 ) (20)bps - a Gain on sale of business - 2Q F17 (205.4 ) (170)bps +170bps b Workforce Optimization Effort - 4Q F17 (5.0 ) (5)bps +5bps c Service Alignment Initiative - F17 90.0 +75bps (75)bps d Service Alignment Initiative - F18 - - +20bps e Proxy contest matters - F18 +25bps f Adjusted EBIT margin (Non-GAAP) $ 2,447.6 19.8 % ~(50) bps Effective tax rate (GAAP) 31.5 % 24.9 % Gain on sale of business - 2Q F17 (0.9 %) - b Workforce Optimization Effort - 4Q F17 (0.0 %) - c Service Alignment Initiative - F17 +0.4 % - d Service Alignment Initiative - F18 - +0.0 % e Proxy contest matters - F18 - +0.1 % f Tax Cuts and Jobs Act - F18 +1.9 % g Adjusted effective tax rate (Non-GAAP) 30.9 % 26.9 % Diluted earnings per share (GAAP) $ 3.85 18 % 8% - 9 % Gain on sale of business - 2Q F17 (0.27 ) (7 %) ~+7 % b Workforce Optimization Effort - 4Q F17 (0.01 ) (0 %) ~+0 % c Service Alignment Initiative - F17 0.12 +3 % ~(3 %) d Service Alignment Initiative - F18 - - ~+1 % e Proxy contest matters - F18 - - ~+1 % f Tax Cuts and Jobs Act - F18 - - ~(3 %) g Adjusted diluted earnings per share (Non-GAAP) $ 3.70 13 % 12% - 13 % a) We continue to include the interest income earned on investments associated with our client funds extended investment strategy and interest expense on borrowings related to our client funds extended investment strategy as we believe these amounts to be fundamental to the underlying operations of our business model. These adjustments in the table above represent the interest income and interest expense that is not related to our client funds extended investment strategy and are labeled as “All other interest expense” and “All other interest income”. No material impact is expected from change in all other interest expense or income in fiscal 2018. b) Second quarter fiscal 2017 impact from gain on the sale of CHSA and COBRA businesses c) Fourth quarter fiscal 2017 Workforce Optimization Effort adjustment is a reversal of the fiscal 2016 estimate and is not expected to recur in fiscal 2018. The majority of charges relating to the Workforce Optimization Effort represent severance charges. Severance charges have been taken in the past and not included as an adjustment to get to adjusted results. Unlike severance charges in prior periods, these specific charges related to a broad-based, company-wide Workforce Optimization Effort. d) Impact of Fiscal 2017 charges in connection with the Service Alignment Initiative e) Expected impact of Fiscal 2018 charges in connection with the Service Alignment Initiative f) Expected impact of Fiscal 2018 charges in connection with proxy contest matters. g) Expected Fiscal 2018 one-time benefit from the enactment of the Tax Cuts and Jobs Act Safe Harbor Statement\nThis document and other written or oral statements made from time to time by ADP may contain “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. Statements that are not historical in nature and which may be identified by the use of words like “expects,” “assumes,” “projects,” “anticipates,” “estimates,” “we believe,” “could,” “is designed to” and other words of similar meaning, are forward-looking statements. These statements are based on management’s expectations and assumptions and depend upon or refer to future events or conditions and are subject to risks and uncertainties that may cause actual results to differ materially from those expressed. Factors that could cause actual results to differ materially from those contemplated by the forward-looking statements or that could contribute to such difference include: ADP's success in obtaining and retaining clients, and selling additional services to clients; the pricing of products and services; compliance with existing or new legislation or regulations; changes in, or interpretations of, existing legislation or regulations; overall market, political and economic conditions, including interest rate and foreign currency trends; competitive conditions; our ability to maintain our current credit ratings and the impact on our funding costs and profitability; security or privacy breaches, fraudulent acts, and system interruptions and failures; employment and wage levels; changes in technology; availability of skilled technical associates; and the impact of new acquisitions and divestitures. ADP disclaims any obligation to update any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law. These risks and uncertainties, along with the risk factors discussed under “Item 1A. - Risk Factors” in our Annual Report on Form 10-K for the fiscal year ended June 30, 2017 should be considered in evaluating any forward-looking statements contained herein.\nADP and the ADP logo are registered trademarks of ADP, LLC. ADP A more human resource. is a service mark of ADP, LLC. All other marks are the property of their respective owners. Copyright © 2018 ADP, LLC. All rights reserved.\nADP-Investor Relations\nInvestor Relations Contacts:\nChristian Greyenbuhl\n973.974.7835\nChristian.Greyenbuhl@ADP.com\nMedia Contact:\nMichael Schneider\n973.974.5678\nMichael.Schneider@ADP.com\nSource:Automatic Data Processing(ADP)", "external_links": ["https://www.globenewswire.com/Tracker?data=FwI-XQvtidq2184gBV6FYsiokMRw3cNTVQlKdvqKXHvZmDlUO53EYyiBr-PQXAyJWRkHOFJsa5cdtKPA_-MvpQ==", "https://www.globenewswire.com/Tracker?data=x-10eUKWT3ko0lXU6dpS2UlVPTPDCBnS-u711SG3lLjsVq0IhIUTSZa91QsRoPT6", "https://www.globenewswire.com/NewsRoom/AttachmentNg/de303235-c176-43a8-abb3-da657784ee4b", "https://www.globenewswire.com/Tracker?data=FwI-XQvtidq2184gBV6FYnD8XSl1vNWgSfs4vF6nnsmrAlSUq2SWc_1BoLw-Q7db3g3-YWxKOcUlle3I-Ij2wA==", "https://www.globenewswire.com/Tracker?data=0cGNvO-P6mLS0G-3n1h-bgv96GstOfKjq617e4rJNg7XYjnDrK0-bxy772FSEUdv7tsRbXsC87aIrozfGkZrumtYRK2B0Gpm2k_tY2x4bBs=", "https://www.globenewswire.com/Tracker?data=MtiGdxzzzUYVC3ZL7bHF1770oMbwfZK8pLjCNLKrqBt9zKDCBPaCj-zkhph4uhMdJeAhl1iLs9ElIUiwavs23kw4-katiLEwvsvSsZe1e1BPD-yyrVNMnl1vI6h2Brq3"], "published": "2018-01-31T15:00:00.000+02:00", "crawled": "2018-01-31T17:16:28.012+02:00", "highlightTitle": ""}