{"organizations": [], "uuid": "002339463447394131ca21857c36104e080df655", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 6}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/26/104970871-GettyImages-528822857.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/us-world-news-report-the-top-10-countries-to-retire-in-2018.html", "country": "US", "domain_rank": 767, "title": "US World & News Report: The top 10 countries to retire in 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.017, "site_type": "news", "published": "2018-01-29T16:43:00.000+02:00", "replies_count": 0, "uuid": "002339463447394131ca21857c36104e080df655"}, "author": "Zameena Mejia", "url": "https://www.cnbc.com/2018/01/29/us-world-news-report-the-top-10-countries-to-retire-in-2018.html", "ord_in_thread": 0, "title": "US World & News Report: The top 10 countries to retire in 2018", "locations": [], "entities": {"persons": [{"name": "deidre mcphillips", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "new zealand", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "u.s. news & world report", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "For the second year in a row, New Zealand is the world's best country to live in if you want to retire comfortably, according to the U.S. News & World Report 's annual \"Best Countries\" ranking.\n\nNew Zealand and Australia top the firm's 2018 list of best countries for retirement, while Ireland — a tax haven that would be easy on large retirement accounts — is a newcomer to the top 10, data editor Deidre McPhillips tells CNBC Make It .\nIn order to help people understand how nations are perceived on a global scale, over 21,000 respondents were asked to evaluate 80 countries by ranking them according to 65 attributes. Among those were economic influence, power, citizenship and quality of life, which collectively helped determine each country's success as a modern nation.\nTo calculate the best countries for a comfortable retirement, researchers looked at scores from people 45 years or older who consider themselves \"upper class.\" Collectively, they ranked countries based on these seven attributes: affordability, favorable tax environment, friendliness, is a place they would live, pleasant climate, respects property rights and well-developed public health system.\nshow chapters These are the countries where expats earn more than they would at home      11:42 AM ET Fri, 29 Sept 2017 | 01:01 The rankings are part of an analysis project called the 2018 Best Countries Report, conducted now for three years by the Wharton School of the University of Pennsylvania and global consumer insights firm Y&R's BAV Group.\n\"The Best Countries report speaks to the effect a nation's brand can have on its economic prosperity and perceived standing in the world,\" Wharton professor of marketing David Reibstein said in a statement.\nHere are the top 10 best countries for retirement as detailed in the 2018 U.S. News & World Report:\n10. Italy Sylvain Sonnet | Getty Images Venice, Gondola on Grand Canal, Italy. Also in the top 10 best countries for: adventure, cultural influence, heritage & richest traditions, traveling alone, most influential.\n9. Sweden The Aurora Borealis captured in a clearing in a Swedish coniferous forest. Also in the top 10 best countries for: most business-friendly, cultural influence, most modern, entrepreneurship, quality of life, best countries to headquarter a corporation, raising kids, transparency, green living, education, women, best countries overall. \n8. Ireland View of Ha'penny bridge on bright sunny day in Dublin, Ireland. Also in the top 10 best countries for: traveling alone, best countries to headquarter a corporation.\n7. Luxembourg Robert Harding | Digital Vision | Getty Images Also in the top 10 best countries for: most business-friendly.\n6. Canada David Chapman | Getty Images Quebec City, Quebec, Canada. Also in the top 10 best countries for: most business-friendly, most modern, entrepreneurship, quality of life, starting a business, most forward-looking countries, headquartering a corporation, raising kids, transparency, green living, education, women, best countries overall.\n5. Portugal Luca Trovato | The Image Bank | Getty Images Also in the top 10 best countries for: heritage & richest traditions, adventure, traveling alone.\n4. Spain Tomas Sereda | Getty Images Park Guell in Barcelona, Spain. Also in the top 10 best countries for: traveling alone, heritage & richest traditions, starting a career, adventure, cultural influence, investing in.\n3. Switzerland Carl Larson | Getty Images This panorama was taken from the top of the Zurich's Grossmunster Cathedral. This aerial view shows Zurich's old town bordering the Limmat River. Also in the top 10 best countries for: most business-friendly, cultural influence, most modern, entrepreneurship, quality of life, starting a business, most forward-looking countries, headquartering a corporation, raising kids, transparency, green living, education, retiring comfortably, women, best countries overall.\n2. Australia Adam Jeffery | CNBC Sydney, Australia Also in the top 10 best countries for: cultural influence, most modern, quality of life, most-forward looking, best countries to headquarter a corporation, raising kids, traveling alone, green living, investing in, education, women, best countries overall.\n1. New Zealand Doug Pearson | Getty Images New Zealand, Auckland, Waitakere Harbour, Elevated View over Devenport towards CBD with Sky Tower at dawn Also in the top 10 best countries for: traveling alone, adventure, raising kids, most modern, quality of life.\nJust over a third of millennials think they only need $200,000 or less to retire comfortably,. However, AARP says a retiree needs to save about $1.18 million in order to live off of $40,000 a year for 30 years.\nAlthough this number may vary based on your lifestyle and spending habits, it's never too early to start saving for your future. \nTo see if you're on track , check out how much you should have saved at every age .\nLike this story? Like CNBC Make It on Facebook . \nDon't miss: \nHere's how much millennials think they need to retire—and how much they actually need Self-made billionaire Richard Branson on achieving success: This has been my 'greatest asset' show chapters These homes are worth $8 million      7:27 PM ET Mon, 12 June 2017 | 01:02 Video produced by Andrea Kramar .", "external_links": [], "published": "2018-01-29T16:43:00.000+02:00", "crawled": "2018-01-29T16:43:54.007+02:00", "highlightTitle": ""}