{"organizations": [], "uuid": "f3ec93082a2acd9b37b47a342f6afe3df12be6ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-john-marshall-bancorp-inc-reports-record-4th-quarter-and-full-year-pre-tax-earnings.html", "country": "US", "domain_rank": 767, "title": "John Marshall Bancorp, Inc. Reports Record 4th Quarter and Full Year Pre-Tax Earnings", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-30T19:07:00.000+02:00", "replies_count": 0, "uuid": "f3ec93082a2acd9b37b47a342f6afe3df12be6ee"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-john-marshall-bancorp-inc-reports-record-4th-quarter-and-full-year-pre-tax-earnings.html", "ord_in_thread": 0, "title": "John Marshall Bancorp, Inc. Reports Record 4th Quarter and Full Year Pre-Tax Earnings", "locations": [], "entities": {"persons": [], "locations": [{"name": "va.", "sentiment": "none"}, {"name": "reston", "sentiment": "none"}], "organizations": [{"name": "john marshall bancorp, inc", "sentiment": "neutral"}, {"name": "john marshall bancorp, inc.", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "RESTON, Va.--(BUSINESS WIRE)-- John Marshall Bancorp, Inc. (OTCQB: JMSB) (the “Company”) reported net income of $9.0 million for the year ended December 31, 2017, an increase of $683 thousand, or 8.2%, as compared to net income of $8.3 million for the year ended December 31, 2016. Net income per diluted share increased during 2017 to $0.66 per share, compared to $0.63 per share during 2016, as adjusted for the 5 for 4 stock split in the form of a 25% dividend paid September 5, 2017. The Company achieved record income before income taxes (“pre-tax earnings”) of $16.2 million during 2017, an increase of 31.7%, compared to $12.3 million reported during 2016.\nOn December 22, 2017, the Tax Cuts and Jobs Act was signed into law. The new tax law negatively affected net income for the fourth quarter of 2017 and 2017 year-end results. Pursuant to this act, effective January 1, 2018, a permanent reduction in the maximum federal corporate income tax rate occurred reducing the rate to 21%. As a result of the reduction in the corporate income tax rate, the Company was required under generally accepted accounting principles to revalue its net deferred tax asset as of December 31, 2017. Accordingly, the Company recognized a $1.8 million charge, or $0.14 per diluted share, to its net deferred tax asset and a corresponding increase in income tax expense in December 2017.\nFor the twelve months ended December 31, 2017 the Company produced a 0.80% return on average assets and 7.14% on average equity, compared to 0.85% and 7.27%, respectively during 2016.\nFor the fourth quarter 2017, the Company reported net income of $1.1 million, a decrease of $1.6 million, as compared to net income of $2.7 million for the three months ended December 31, 2016. The Company achieved record pre-tax earnings of $4.2 million during the fourth quarter of 2017, an increase of $303 thousand or 7.7%, compared to $3.9 million during the same period in 2016. Net income per diluted share was $0.08 per share during the three months ending December 31, 2017, compared to $0.20 per diluted share during the same period in 2016, also adjusted for the 5 for 4 stock split in the form of a 25% dividend paid in 2017. The Company’s three month results produced an annualized return of 0.38% on average assets and 3.40% on average equity, compared to 1.03% and 9.0%, respectively, for the same period a year ago. As of December 31, 2017, the Company’s tangible book value per share was $10.05, up 7.1% compared to $9.38 as of December 31, 2016, as adjusted for the 5 for 4 stock split in the form of a 25% dividend paid September 5, 2017.\nThe Company’s capital ratios remain well above regulatory minimums for well capitalized banks. As of December 31, 2017, the Company’s total risk-based capital ratio was 14.5%, compared to 12.3% at December 31, 2016.\nBalance Sheet Review\nAt December 31, 2017, total assets were $1.17 billion, an increase of $99.1 million, or 9.2%, from total assets of $1.08 billion at December 31, 2016, and an increase of $21.1 million, or 1.8% from $1.15 billion at September 30, 2017. Gross loans increased $112.7 million, or 12.6%, to $1.01 billion at December 31, 2017, compared to $896.0 million at December 31, 2017 and increased $36.9 million, or 3.8%, compared to $971.8 million at September 30, 2017. The Company’s investment portfolio comprised of held-to-maturity and available-for-sale securities was $96.3 million at December 31, 2017, up $3.9 million from $92.4 million at December 31, 2016. As of December 31, 2017, the Company held $41.6 million of its investment portfolio as held-to-maturity, and $54.7 million as available-for-sale. The Company also had restricted securities totaling $8.4 million at December 31, 2017, compared to $7.7 million at September 30, 2017 and $7.9 million at December 31, 2016. At December 31, 2017, the estimated fair value of bank owned life insurance was $19.1 million, compared to $19.0 million at September 30, 2017 and $18.5 million at December 31, 2016.\nTotal deposits were $896.9 million at December 31, 2017, $897.6 million at September 30, 2017 and $832.9 million at December 31, 2016. Year-over-year deposit growth, from December 31, 2016 to December 31, 2017, was $64.1 million, or 7.7%. Total borrowings, consisting of Federal Home Loan Bank advances, customer repurchase agreements and Federal funds purchased, were $118.5 million at December 31, 2017, $98.0 million at September 30, 2017 and $118.2 million at December 31, 2016.\nQwickRate certificates of deposits were $24.7 million at December 31, 2017, $22.2 million at September 30, 2017 and $22.8 million at December 31, 2016. Year-over-year QwickRate certificates of deposits increased $1.9 million from December 31, 2016 to December 31, 2017. CDARs were $77.5 million at December 31, 2017, $86.5 million at September 30, 2017 and $71.8 million at December 31, 2016. Year-over-year CDARS increased $5.7 million. Brokered deposits were $42.4 million at December 31, 2017, $39.5 million at September 30, 2017 and $46.9 million at December 31, 2016. Year-over-year, brokered deposits decreased $4.4 million from December 31, 2016 to December 31, 2017. There were no customer repurchase agreements at December 31, 2017 and September 30, 2017 and $14.2 million at December 31, 2016. During the first quarter of 2017, the Company partnered with Promontory to offer insured cash sweep products (“ICS”). As of December 31, 2017, the Company had $65.3 million in ICS deposits and $56.4 million as of September 30, 2017. The decline in the customer repurchase agreements were part of an initiative and were mostly moved into ICS. Federal Home Loan Bank advances were $108.5 million at December 31, 2017, $98.0 million at September 30, 2017 and $104.0 million at December 31, 2016. Year-over-year Federal Home Loan Bank advances increased $4.5 million or 4.3%. Core customer funding was $829.8 million at December 31, 2017, $835.9 million at September 30, 2017 and $777.3 million at December 31, 2016. Year-over-year core customer funding sources, which include deposits, customer repurchase agreements, ICS and CDARS, increased by $52.4 million, or 6.7%, from December 31, 2016 to December 31, 2017.\nTotal shareholders’ equity was $128.9 million at December 31, 2017, $127.8 million at September 30, 2017 and $118.8 million at December 31, 2016. Year-over-year shareholders’ equity increased by $10.1 million, or 9.2%. Total common shares outstanding increased from 10,137,149 at December 31, 2016 to 12,824,233, including 85,007 unvested shares, at December 31, 2017. The majority of the increase in shares year-over-year was related to the 5 for 4 stock split in the form of a 25% dividend paid September 5, 2017.\nThe Company completed a private placement of $25.0 million of fixed-to-floating subordinated notes on July 6, 2017. Unless redeemed earlier, the notes will mature on July 15, 2027. The notes bear a fixed rate of 5.75% for the first five years and will bear a floating rate equal to three-month LIBOR plus 388 basis points thereafter. The notes qualify as Tier 2 capital for the Company for regulatory purposes. The notes are carried at their principal amount, less unamortized issuance costs. The balance was $24.5 million at December 31, 2017 and September 30, 2017.\nIncome Statement Review\nNet interest income\nNet interest income, the Company’s primary source of revenue, was $40.5 million for the year ended December 31, 2017, up 12.2% from $36.1 million for the year ended December 31, 2016, The net interest margin was 3.72% for the year ended December 31, 2017 as compared to 3.79% for the year ended December 31, 2016. Net interest income was $10.6 million for the fourth quarter of 2017, compared to $9.5 million for the same period in 2016. The net interest margin was 3.68% for the fourth quarter of 2017, compared to 3.77% during the fourth quarter of 2016. The Federal Reserve increased rates by 25 basis points in December 2016, March 2017 and June 2017. The yield on average net loans increased 5 basis points year-over-year from December 31, 2016 to December 31, 2017. The average cost of interest bearing liabilities increased 21 basis points year-over-year from December 31, 2016 to December 31, 2017. The increase in cost of liabilities during 2017 was related to higher cost term funding and interest expense related to the Company’s issuance of subordinated debt.\nDespite the decline in the net interest margin over the past year, net interest income increased by 12.2% during 2017, compared to 2016, resulting primarily from a $137.1 million, or 14.4%, increase in average earning assets from December 31, 2017, compared to December 31, 2016.\nProvision for loan losses\nThe Company recognized a provision for loan losses of $1.4 million for the year ended December 31, 2017, compared to provision of $3.8 million for the year ended December 31, 2016. The Company reported net loan charge-offs of $655 thousand in 2017, compared to net loan charge-offs of $2.7 million in 2016.\nThe Company’s provision for loan losses was $235 thousand during the fourth quarter of 2017, compared to $480 thousand during the fourth quarter of 2016. In addition, the Company reported net loan charge-offs of $324 thousand during the fourth quarter of 2017, compared to $77 thousand in the same period in 2016.\nNoninterest income\nThe Company’s noninterest income consists primarily of bank owned life insurance income and service charges on deposit accounts. Loan fees are included in interest income on the loan portfolio and not reported as noninterest income.\nFor the year ended December 31, 2017, the Company reported total noninterest income of $1.2 million, compared to $1.0 million during the year ended December 31, 2016, an increase of 19.3%. For the three months ended December 31, 2017, the Company’s noninterest income was $266 thousand, compared to $286 thousand during the same period in 2016. The year-over-year decrease for the three months ended December 31, 2017 was related to lower bank owned life insurance income. The year-over-year increase for the twelve months ended December 31, 2017 was primarily attributable to gains on sales of securities during the first half of 2017 and fees related to loans moving from non-accrual to accruing that were collected in 2017 but were from prior years.\nNoninterest expense\nThe largest component of the Company’s noninterest expense is employee salaries and benefits. Salaries and benefits expense increased by 18.1% during 2017 to $14.8 million, compared to $12.5 million during 2016. All other noninterest expense increased by $876 thousand during 2017, from $8.4 million in 2016 to $9.3 million in 2017, an increase of 10.4%. During 2017, 14 additional full time equivalent employees were hired.\nFor the three months ended December 31, 2017, salaries and employee benefits expense increased 19.4% to $4.0 million, compared to $3.3 million for the same period in 2016. All other noninterest expenses totaled $2.4 million during the fourth quarter of 2017, an increase of 15.5% compared to $2.1 million reported for the same period in 2016.\nThe increase in salaries and benefits is related to additional staff needed to support the overall growth of the Company. The increase in other operating expenses was mostly related to one-time expenses related to the formation of the Holding Company in March 2017, expensed related to other real estate owned, additional rent and furniture expense related to the new loan production office in Arlington, VA as well as higher FDIC insurance and franchise tax related to growth.\nAsset Quality Review\nAs of December 31, 2017, non-performing assets were 0.09% of total assets, compared to 0.01% at December 31, 2016. The Company’s allowance for loan losses covered non-performing loans by 14.0 times as of December 31, 2017, compared to 149.1 times as of December 31, 2016. As of December 31, 2017, non-accrual loans totaled $639 thousand, of which $539 thousand represented four loans to one customer relationship and were put on non-accrual earlier this year. These loans are secured by real estate and have a specific reserve less than $1 thousand as of December 31, 2017. As of December 31, 2017, there were $1.2 million in loans 30-89 days past due and still accruing interest. As of December 31, 2016, there were $1.0 million in loans 30-89 days past due and still accruing interest.\nTroubled debt restructurings were $495 thousand at December 31, 2017, a decrease of $13 thousand, or 2.6%, from $508 thousand at December 31, 2016. All troubled debt restructurings were performing in accordance with modified terms as of December 31, 2017. The Company had $379 thousand in other real estate owned as of December 31, 2017 and no other real estate owned as of December 31, 2016.\nJohn Marshall Bancorp, Inc. is the bank holding company for John Marshall Bank. John Marshall Bank is headquartered in Reston, Virginia and has five full-service branches located in Reston, Leesburg, Arlington, Alexandria and Rockville. The Bank also has a limited-service commercial branch located in Washington, DC, a loan production office located in Tysons Corner, VA and a loan production office located in Arlington, VA. Further information on the Bank can be obtained by visiting its website at www.johnmarshallbank.com .\nThis press release contains forward-looking statements within the meaning of the Securities and Exchange Act of 1934, as amended, including statements of goals, intentions, and expectations as to future trends, plans, events or results of Company operations and policies and regarding general economic conditions. In some cases, forward-looking statements can be identified by use of words such as “may,” “will,” “anticipates,” “believes,” “expects,” “plans,” “estimates,” “potential,” “continue,” “should,” and similar words or phrases. These statements are based upon current and anticipated economic conditions, nationally and in the Company’s market, interest rates and interest rate policy, competitive factors, and other conditions which by their nature, are not susceptible to accurate forecast, and are subject to significant uncertainty. Because of these uncertainties and the assumptions on which this discussion and the forward-looking statements are based, actual future operations and results may differ materially from those indicated herein. Readers are cautioned against placing undue reliance on any such forward-looking statements. The Company’s past results are not necessarily indicative of future performance.\nJohn Marshall Bancorp, Inc. Consolidated Balance Sheets (Dollar amounts in thousands, except per share data)\n% Change December 31, September 30, December 31, Last Three Year Over 2017 2017 2016 Months Year Assets (Unaudited) (Unaudited) Cash and due from banks $ 7,256 $ 5,684 $ 4,898 27.7% 48.1% Federal funds sold 40 56 60 -28.6% -33.3% Interest-bearing deposits in banks 30,873 46,512 49,717 -33.6% -37.9% Securities available-for-sale, at fair value 54,699 53,197 48,312 2.8% 13.2% Securities held-to-maturity, fair value of $41,500 at 12/31/2017, $43,618 at 9/30/2017 and $44,067 at 12/31/2016\n41,570 43,427 44,073 -4.3% -5.7% Restricted securities, at cost 8,447 7,695 7,873 9.8% 7.3% Loans, net of allowance for loan losses of $8,927 at 12/31/2017, $9,017 at 9/30/2017 and $8,202 at 12/31/2016\n997,945 960,832 886,220 3.9% 12.6% Bank premises and equipment, net 2,480 2,543 2,471 -2.5% 0.4% Accrued interest receivable 3,263 3,043 2,988 7.2% 9.2% Bank owned life insurance 19,093 18,955 18,540 0.7% 3.0% Other real estate owned 379 392 - - -3.3% N/M Other assets 8,394 10,979 10,205 -23.5% -17.7% Total assets $ 1,174,439 $ 1,153,315 $ 1,075,357 1.8% 9.2% Liabilities and Shareholders' Equity Liabilities Deposits: Non-interest bearing demand deposits $ 174,686 $ 177,226 $ 195,065 -1.4% -10.4% Interest bearing demand deposits 258,306 260,211 211,495 -0.7% 22.1% Savings deposits 6,709 7,043 6,856 -4.7% -2.1% Time deposits 457,240 453,103 419,449 0.9% 9.0% Total deposits 896,941 897,583 832,865 -0.1% 7.7% Federal funds purchased 10,001 - - - - N/M N/M Repurchase agreements - - - - 14,206 N/M N/M Federal Home Loan Bank advances 108,500 98,000 104,000 10.7% 4.3% Subordinated Debt 24,531 24,519 - - 0.0% N/M Accrued interest payable 996 633 220 57.3% 352.7% Other liabilities 4,603 4,802 5,271 -4.1% -12.7% Total liabilities 1,045,572 1,025,537 956,562 2.0% 9.3% Shareholders' Equity Preferred stock, par value $0.01 per share; authorized 1,000,000 shares; none issued\n- - - - - - - - - - Common stock, nonvoting, par value $0.01 per share; authorized 1,000,000 shares; none issued\n- - - - - - - - - - Common stock, voting, par value $0.01 per share at 12/31/17 and 9/30/17; par value $5 per share at 12/31/16; authorized 20,000,000 shares; issued and outstanding, 12,824,233 at 12/31/2017 including 85,007 unvested shares, 12,824,047 shares at 9/30/2017 including 85,269 unvested shares and 10,137,149 at 12/31/16\n127 127 50,686 0.0% -99.7% Additional paid-in capital 83,867 83,670 32,112 0.2% 161.2% Retained earnings 45,432 44,313 36,454 2.5% 24.6% Accumulated other comprehensive loss (559 ) (332 ) (457 ) -68.4% -22.3% Total shareholders' equity 128,867 127,778 118,795 0.9% 8.5% Total liabilities and shareholders' equity $ 1,174,439 $ 1,153,315 $ 1,075,357 1.8% 9.2% John Marshall Bancorp, Inc. Consolidated Statements of Income (Dollar amounts in thousands, except per share data) Three Months Ended Twelve Months Ended December 31, December 31, 2017 2016 % Change 2017 2016 % Change (Unaudited) (Unaudited) (Unaudited) Interest and Dividend Income Interest and fees on loans $ 12,456 $ 10,617 17.3% $ 46,667 $ 40,250 15.9% Interest on investment securities, taxable 392 398 -1.5% 1,445 1,432 0.9% Interest on investment securities, tax-exempt 85 50 70.0% 269 170 58.2% Dividends 108 93 15.8% 417 341 22.3% Interest on deposits in banks 170 47 261.7% 520 168 209.5% Total interest and dividend income 13,211 11,205 17.9% 49,318 42,361 16.4% Interest Expense Deposits 1,924 1,407 36.7% 6,752 5,411 24.8% Federal Home Loan Bank advances 324 245 32.2% 1,300 784 65.8% Subordinated debt 372 - - N/M 719 - - N/M Other short-term borrowings 1 12 -91.7% 22 60 -63.3% Total interest expense 2,621 1,664 57.5% 8,793 6,255 40.6% Net interest income 10,590 9,541 11.0% 40,525 36,106 12.2% Provision for loan losses 235 480 -51.0% 1,380 3,810 -63.8% Net interest income after provision for loan losses 10,355 9,061 14.3% 39,145 32,296 21.2% Noninterest Income Service charges on deposit accounts 101 94 7.4% 383 401 -4.5% Bank owned life insurance 137 163 -16.0% 553 540 2.4% Other service charges and fees 28 29 -3.4% 105 77 36.4% Gain on sale of securities - - - - N/M 134 - - N/M Gain on sale of fixed assets - - - - N/M 1 - - N/M Other operating income - - - - N/M 53 6 783.3% Total noninterest income 266 286 -7.0% 1,229 1,024 20.0% Noninterest Expenses Salaries and employee benefits 3,992 3,344 19.4% 14,820 12,548 18.1% Occupancy expense of premises 499 417 19.7% 1,843 1,678 9.8% Furniture and equipment expenses 315 286 10.1% 1,183 1,228 -3.7% Other real estate owned, net 20 - - N/M 20 1 1900.0% Other operating expenses 1,572 1,380 13.9% 6,260 5,523 13.3% Total noninterest expenses 6,398 5,427 17.9% 24,126 20,978 15.0% Income before income taxes 4,223 3,920 7.7% 16,248 12,342 31.6% Income tax expense 3,105\n1,218 154.9% 7,264\n4,041 79.8% Net income $ 1,118 $ 2,702 -58.6% $ 8,984 $ 8,301 8.2% Earnings Per Common Share (1) Basic $ 0.09 $ 0.21 -57.1% $ 0.70 $ 0.66 6.1% Diluted $ 0.08 $ 0.20 -60.0% $ 0.66 $ 0.63 4.8% (1)\nPer share amounts for all periods have been adjusted to reflect a 5 for 4 stock split in the form of a 25% stock dividend paid September 5, 2017.\nJohn Marshall Bancorp, Inc. Loan, Deposit and Borrowing Detail (Unaudited) (Dollar amounts in thousands) December 31, 2017 September 30, 2017 December 31, 2016 Percentage Change Loans $ Amount % of Total $ Amount % of Total $ Amount % of Total Last 3 Mos Last 12 Mos Mortgage loans on real estate Commercial $ 577,016 57.1 % $ 543,865 56.0 % $ 519,857 58.0 % 6.1% 11.0% Construction and land development 218,538 21.7 % 217,334 22.3 % 180,318 20.1 % 0.6% 21.2% Residential 135,791 13.5 % 131,233 13.5 % 107,534 12.0 % 3.5% 26.3% Total mortgage loans on real estate $ 931,345 92.3 % $ 892,432 91.8 % $ 807,709 90.1 % 4.4% 15.3% Commercial loans 76,573 7.6 % 78,302 8.1 % 86,498 9.7 % -2.2% -11.5% Consumer loans 777 0.1 % 1,096 0.1 % 1,820 0.2 % -29.1% -57.3% Total loans $ 1,008,695 100.0 % $ 971,830 100.0 % $ 896,027 100.0 % 3.8% 12.6% Less: Allowance for loan losses (8,927 ) (9,017 ) (8,202 ) Net deferred loan fees (1,823 ) (1,981 ) (1,605 ) Net loans $ 997,945 $ 960,832 $ 886,220 December 31, 2017 September 30, 2017 December 31, 2016 Percentage Change Deposits $ Amount % of Total $ Amount % of Total $ Amount % of Total Last 3 Mos Last 12 Mos Noninterest-bearing demand deposits $ 174,686 19.5 % $ 177,226 19.7 % $ 195,065 23.4 % -1.4% -10.4% Interest-bearing demand deposits: NOW accounts 33,505 3.7 % 41,736 4.7 % 12,739 1.5 % -19.7% 163.0% Money market accounts 159,508 17.8 % 155,340 17.3 % 187,748 22.6 % 2.7% -15.0% Savings accounts 6,709 0.8 % 7,043 0.8 % 6,856 0.8 % -4.7% -2.1% Certificates of deposit $250,000 or more 199,161 22.2 % 198,362 22.1 % 187,568 22.5 % 0.4% 6.2% Less than $250,000 113,374 12.6 % 113,348 12.6 % 101,368 12.2 % 0.0% 11.8% QwickRate® Certificates of deposit 24,735 2.8 % 22,185 2.5 % 22,844 2.8 % 11.5% 8.3% ICS® 65,293 7.3 % 56,402 6.3 % - 0.0 % 15.8% N/M CDARS® 77,531 8.6 % 86,469 9.6 % 71,799 8.6 % -10.3% 8.0% Brokered deposits 42,439 4.7 % 39,472 4.4 % 46,878 5.6 % 7.5% -9.5% Total deposits $ 896,941 100.0 % $ 897,583 100.0 % $ 832,865 100.0 % -0.1% 7.7% Borrowings Federal funds purchased $ 10,001 7.0 % $ - 0.0 % $ - 0.0 % N/M N/M Customer repurchase agreements - 0.0 % - 0.0 % 14,206 12.0 % N/M -100.0% Federal Home Loan Bank advances 108,500 75.9 % 98,000 80.0 % 104,000 88.0 % 10.7% 4.3% Subordinated debt 24,531 17.1 % 24,519 20.0 % - 0.0 % 0.0% N/M Total borrowings $ 143,032 100.0 % $ 122,519 100.0 % $ 118,206 100.0 % 16.7% 21.0% Total deposits and borrowings $ 1,039,973 $ 1,020,102 $ 951,071 1.9% 9.3% Core customer funding sources (1) $ 829,767 79.8 % $ 835,926 81.9 % $ 777,349 81.7 % -0.7% 6.7% Wholesale funding sources (2) 185,675 17.8 % 159,657 15.7 % 173,722 18.3 % 16.3% 6.9% Subordinated debt (3) 24,531 2.4 % 24,519 2.4 % - 0.0 % 0.0% N/M Total funding sources $ 1,039,973 99.9 % $ 1,020,102 100.0 % $ 951,071 100.0 % 2.0% 9.4% (1) Includes ICS and CDARS(r), which are all reciprocal deposits maintained by customers, and repurchase agreements, which represent sweep accounts tied to customer operating accounts. (2) Consists of QwickRate(r) certificates of deposit, brokered deposits, federal funds purchased and Federal Home Loan Bank advances. (3) Subordinated debt obligation qualifies as Tier 2 capital. John Marshall Bancorp, Inc. Average Balance Sheets, Interest and Rates (unaudited) (Dollar amounts in thousands) Three Months Ended December 31, 2017 Three Months Ended December 31 2016 Interest Average Interest Average Average Income- Yields Average Income- Yields Balance Expense /Rates Balance Expense /Rates Assets Securities $ 104,081 $ 585 2.23 % $ 100,732 $ 541 2.14 % Loans, net of unearned income 987,726 12,456 5.00 % 871,311 10,617 4.85 % Interest-bearing deposits in other banks 49,537 170 1.36 % 35,099 47 0.53 % Federal funds sold 59 - 0.00 % 46 - 0.00 % Total interest-earning assets $ 1,141,403 $ 13,211 4.59 % $ 1,007,188 $ 11,205 4.43 % Other assets 33,469 31,887 Total assets $ 1,174,872 $ 1,039,075 Liabilities & Shareholders' equity Interest-bearing deposits NOW accounts $ 72,977 $ 73 0.40 % $ 13,353 $ 13 0.39 % Money market accounts 204,952 338 0.65 % 207,008 245 0.47 % Savings accounts 7,482 4 0.21 % 6,457 4 0.25 % Time deposits 451,037 1,509 1.33 % 408,648 1,145 1.11 % Total interest-bearing deposits $ 736,448 $ 1,924 1.04 % $ 635,466 $ 1,407 0.88 % Securities sold under agreement to repurchase and federal funds purchased\n$ 335 $ 1 1.18 % $ 13,644 $ 12 0.35 % Subordinated debt 24,523 372 6.02 % - - 0.00 % Other borrowed funds 96,201 324 1.34 % 90,207 245 1.08 % Total interest-bearing liabilities $ 857,507 $ 2,621 1.21 % $ 739,317 $ 1,664 0.90 % Demand deposits and other liabilities 186,919 181,472 Total liabilities $ 1,044,426 $ 920,789 Shareholders' equity 130,446 118,286 Total liabilities and shareholders' equity $ 1,174,872 $ 1,039,075 Interest rate spread 3.38 % 3.53 % Net interest income and margin $ 10,590 3.68 % $ 9,541 3.77 % Twelve Months Ended December 31, 2017 Twelve Months Ended December 31, 2016 Interest Average Interest Average Average Income- Yields Average Income- Yields Balance Expense /Rates Balance Expense /Rates Assets Securities $ 98,170 $ 2,131 2.17 % $ 94,518 $ 1,943 2.06 % Loans, net of unearned income 947,287 46,667 4.93 % 824,830 40,250 4.88 % Interest-bearing deposits in other banks 43,662 520 1.19 % 32,714 168 0.51 % Federal funds sold 58 - 0.00 % 16 - 0.00 % Total interest-earning assets $ 1,089,177 $ 49,318 4.53 % $ 952,078 $ 42,361 4.45 % Other assets 32,839 27,991 Total assets $ 1,122,016 $ 980,069 Liabilities & Shareholders' equity Interest-bearing deposits NOW accounts $ 44,269 $ 181 0.41 % $ 15,528 $ 61 0.39 % Money market accounts 201,501 1,181 0.59 % 213,766 1,081 0.51 % Savings accounts 7,250 17 0.23 % 9,671 40 0.41 % Time deposits 435,923 5,373 1.23 % 378,109 4,229 1.12 % Total interest-bearing deposits $ 688,943 $ 6,752 0.98 % $ 617,074 $ 5,411 0.88 % Securities sold under agreement to repurchase and federal funds purchased\n$ 4,997 $ 22 0.44 % $ 14,769 $ 60 0.41 % Subordinated debt 12,026 719 5.98 % - - 0.00 % Other borrowed funds 103,095 1,300 1.26 % 75,995 784 1.03 % Total interest-bearing liabilities $ 809,061 $ 8,793 1.09 % $ 707,838 $ 6,255 0.88 % Demand deposits and other liabilities 187,197 158,032 Total liabilities $ 996,258 $ 865,870 Shareholders' equity 125,758 114,199 Total liabilities and shareholders' equity $ 1,122,016 $ 980,069 Interest rate spread 3.44 % 3.57 % Net interest income and margin $ 40,525 3.72 % $ 36,106 3.79 % John Marshall Bancorp, Inc. Financial Highlights (Unaudited) (Dollar amounts in thousands, except per share data) At or For the Three Months Ended At or For the Twelve Months Ended December 31, December 31, 2017 2016 2017 2016 Per share Data and Shares Outstanding(1) Earnings per common share - basic $ 0.09 $ 0.21 $ 0.70 $ 0.66 Earnings per common share - diluted $ 0.08 $ 0.20 $ 0.66 $ 0.63 Tangible book value per share $ 10.05 $ 9.38 $ 10.05 $ 9.38 Weighted average common shares (basic) 12,738,895 12,667,249 12,715,999 12,586,921 Weighted average common shares (diluted) 13,498,593 13,283,426 13,486,450 13,202,296 Common shares outstanding at end of period 12,824,233 12,671,436 12,824,233 12,671,436 Performance Ratios Return on average assets (annualized) 0.38 % 1.03 % 0.80 % 0.85 % Return on average equity (annualized) 3.40 % 9.09 % 7.14 % 7.27 % Yield on earning assets (annualized) 4.59 % 4.43 % 4.53 % 4.45 % Cost of interest bearing liabilities (annualized) 1.21 % 0.88 % 1.09 % 0.88 % Net interest spread 3.38 % 3.53 % 3.44 % 3.57 % Net interest margin 3.68 % 3.77 % 3.72 % 3.79 % Noninterest income as a percentage of average assets (annualized) 0.09 % 0.11 % 0.11 % 0.10 % Noninterest expense to average assets (annualized) 2.16 % 2.08 % 2.15 % 2.14 % Efficiency ratio 58.9 % 55.2 % 57.8 % 56.5 % Asset Quality Loans 30-89 days past due and accruing interest $ 1,189 $ 1,008 $ 1,189 $ 1,008 Non-accrual loans $ 639 $ 55 $ 639 $ 55 Other real estate owned $ 379 $ - $ 379 $ - Non-performing assets (2) $ 1,018 $ 55 $ 1,018 $ 55 Non-performing assets to total assets 0.09 % 0.01 % 0.09 % 0.01 % Allowance for loan losses to total loans 0.89 % 0.92 % 0.89 % 0.92 % Allowance for loan losses to non-performing loans 14.0 149.1 14.0 149.1 Net loan chargeoffs $ 324 $ 77 $ 655 $ 2,738 Net charge-offs to average loans (annualized) 0.13 % 0.04 % 0.07 % 0.29 % Troubled debt restructurings (total) $ 495 $ 508 $ 495 $ 508 Performing in accordance with modified terms $ 495 $ 508 $ 495 $ 508 Not performing in accordance with modified terms $ - $ - $ - $ - Regulatory Capital Ratios Total risk-based capital ratio 14.5 % 12.3 % 14.5 % 12.3 % Tier 1 risk-based capital ratio 11.5 % 11.5 % 11.5 % 11.5 % Leverage ratio 11.5 % 11.5 % 11.5 % 11.5 % Common equity tier 1 ratio 11.0 % 11.5 % 0.0 % 11.5 % Other Information Effective income tax rate 73.5 % 31.1 % 44.7 % 32.7 % Tangible equity / tangible assets 11.0 % 11.0 % 11.0 % 11.0 % Average tangible equity / average tangible assets 11.1 % 11.4 % 11.2 % 11.7 % Number of full time equivalent employees 125 111 125 111 # Full service branch offices 5 5 5 5 # Loan production or limited service branch offices 3 2 3 2 (1) Shares and per share amounts for all periods have been adjusted to reflect a 5 for 4 stock split in the form of a 25% stock dividend paid September 5, 2017. (2) Non-performing assets consist of non-accrual loans, loans 90 day or more past due and still accruing interest, and other real estate owned. Does not include troubled debt restructurings (\"TDRs\") which were accruing interest at the date indicated. (3) Effective tax rates for the quarter and year-to-date periods ending December 31, 2017 are not comparable to the same periods in 2016 due to the income tax expense of $1.8 million recognized in conjunction with the tax reform and the revaluation of the Company's net deferred tax asset during the fourth quarter of 2017.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180130005968/en/\nJohn Marshall Bancorp, Inc.\nJohn R. Maxwell, 703-584-0840\nSource: John Marshall Bancorp, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180130005968/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.johnmarshallbank.com&esheet=51750879&newsitemid=20180130005968&lan=en-US&anchor=www.johnmarshallbank.com&index=1&md5=6594d96788f616c2e7ff2d940f80ab41"], "published": "2018-01-30T19:07:00.000+02:00", "crawled": "2018-01-30T20:52:38.018+02:00", "highlightTitle": ""}