{"organizations": [], "uuid": "2fd4b78a3d2711fe9c43be48b7bd240a0a6a8ab2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-j-f-lehman-company-acquires-waste-control-specialists.html", "country": "US", "domain_rank": 767, "title": "J.F. Lehman & Company Acquires Waste Control Specialists", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-27T00:34:00.000+02:00", "replies_count": 0, "uuid": "2fd4b78a3d2711fe9c43be48b7bd240a0a6a8ab2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-j-f-lehman-company-acquires-waste-control-specialists.html", "ord_in_thread": 0, "title": "J.F. Lehman & Company Acquires Waste Control Specialists", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "tx", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "andrews county", "sentiment": "none"}], "organizations": [{"name": "j.f. lehman & company", "sentiment": "negative"}, {"name": "j.f. lehman & company acquires waste control specialists", "sentiment": "negative"}, {"name": "department of energy", "sentiment": "none"}, {"name": "waste control specialists llc", "sentiment": "none"}, {"name": "vhi", "sentiment": "none"}, {"name": "wcs", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "environmental protection agency", "sentiment": "none"}, {"name": "valhi, inc.", "sentiment": "none"}, {"name": "northstar group holdings, inc.", "sentiment": "none"}, {"name": "jflco", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 26, 2018 /PRNewswire/ -- J.F. Lehman & Company (\"JFLCO\") is pleased to announce that an investment affiliate has acquired Waste Control Specialists LLC (\"WCS\" or the \"Company\") from Valhi, Inc. (NYSE: VHI). The acquisition represents JFLCO's fourth platform investment in the environmental and technical services sector.\nWCS owns and operates a unique waste disposal, storage, and treatment facility in Andrews County, TX for highly specialized and regulated waste streams including low-level radioactive waste, hazardous waste and mixed hazardous and radioactive waste. WCS is the only site in the United States licensed to process and dispose of Class A, B, and C low-level nuclear waste from government and commercial generators located in all 50 states. Customers include the Department of Energy, the Environmental Protection Agency, and blue-chip utility and healthcare enterprises.\nThe Company also has a strategic partnership with JFLCO portfolio company NorthStar Group Holdings, Inc. (\"NorthStar\"), a leading provider of specialized environmental and technical services for commercial and government end markets, to support domestic electric utilities in safely decommissioning nuclear power generation sites.\nAlex Harman, Partner at JFLCO, stated, \"WCS maintains an industry-leading reputation and provides an essential solution for the safe disposal of specialized waste streams. We are excited to support the long-term success of the business through continued engagement and partnership with industry stakeholders, including strengthening the partnership with NorthStar to deliver a best-in-class nuclear power plant decommissioning solution.\"\nScott State, Chief Executive Officer of WCS and NorthStar, said \"For more than two decades, WCS has provided state-of-the-art disposal capabilities from a rigorously-monitored, highly-engineered facility. Given the substantial capital investment in the facility, the site maintains significant capacity for growth, and we remain committed to serving our customers as a trusted solutions provider.\"\nGlenn Shor, Managing Director at JFLCO, stated, \"Through its unique technical competencies and industry leadership, WCS exemplifies many of the values and attributes JFLCO emphasizes in its investment strategy. Our partnership with WCS will ensure the business has the resources required to support its long-term growth strategy across the government and commercial marketplace.\"\nEvercore acted as financial advisor and Jones Day and Pillsbury Winthrop Shaw Pittman acted as legal counsel to JFLCO. Evercore also acted as placement agent for the debt financing for the transaction which was provided by The Carlyle Group's Credit Opportunities Fund.\nAbout J.F. Lehman & Company, Inc.\nJ.F. Lehman & Company is a leading middle-market private equity firm focused exclusively on the defense, aerospace and maritime sectors. The firm has offices in New York and Washington, D.C.\nFor more information about J.F. Lehman & Company, please visit www.jflpartners.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/jf-lehman--company-acquires-waste-control-specialists-300589066.html\nSOURCE J.F. Lehman & Company", "external_links": ["http://www.prnewswire.com/news-releases/jf-lehman--company-acquires-waste-control-specialists-300589066.html", "http://www.jflpartners.com/"], "published": "2018-01-27T00:34:00.000+02:00", "crawled": "2018-01-27T02:25:04.016+02:00", "highlightTitle": ""}