{"organizations": [], "uuid": "0d9adc62e6d28ee6138dc4e9b46e5fecc9d739c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/03/04/103444369-GettyImages-91837301.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/16/5-key-differences-between-roth-and-traditional-iras.html", "country": "US", "domain_rank": 767, "title": "5 key differences between Roth and traditional IRAs", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.14, "site_type": "news", "published": "2018-01-16T15:31:00.000+02:00", "replies_count": 0, "uuid": "0d9adc62e6d28ee6138dc4e9b46e5fecc9d739c7"}, "author": "Lorie Konish", "url": "https://www.cnbc.com/2018/01/16/5-key-differences-between-roth-and-traditional-iras.html", "ord_in_thread": 0, "title": "5 key differences between Roth and traditional IRAs", "locations": [], "entities": {"persons": [{"name": "roth", "sentiment": "neutral"}, {"name": "slott", "sentiment": "none"}, {"name": "ed slott", "sentiment": "none"}], "locations": [], "organizations": [{"name": "ed slott & co", "sentiment": "none"}, {"name": "ira", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "There are dramatic differences between traditional and Roth individual retirement accounts.\nAnd what you don't understand about the particular rules that apply to them can cost you, according to IRA expert Ed Slott, founder of Ed Slott & Co.\nWith traditional IRAs, you get a tax deduction up front. The taxes you pay on that money are delayed until you withdraw it in retirement.\nRoth IRAs, on the other hand, are funded with post-tax money.\n\"With a traditional IRA, you're at the mercy or uncertainty of what future higher tax rates might do to your retirement savings,\" Slott said. \"With a Roth IRA, you don't have to worry about future rates, because your tax rate in retirement will be zero.\"\nThere are five key differences between these two retirement accounts that savers need to understand.\nJason York | Getty Images 1) Income limits Contributions to traditional IRAs do not have income limits for savers who contribute to these kinds of accounts (though high earners may not get the upfront tax break).\nRoth IRA contributions, however, do have income limits. But Slott noted they are \"very high.\" For 2018, the income phase-out range is $120,000 to $135,000 for singles and $189,000 to $199,000 for married couples who file jointly.\n2) Age limits The rules for traditional IRAs prevent you from making contributions once you turn 70½.\nBut the same doesn't apply to Roth IRAs. You can continue to contribute to those accounts at any age, according to Slott, if you have the earned income wages or self-employment income to do so.\n3) Plan participation Your participation in a retirement plan generally doesn't affect either traditional or Roth IRA accounts.\nIt is important to note, however, that with a traditional IRA, you may not be eligible for the deduction depending on your income.\n4) Required minimum distributions The rules around required minimum distributions mark the biggest difference between traditional and Roth IRAs, according to Slott.\nWith traditional IRAs, you are forced to take distributions starting at age 70½. Roth IRAs aren't subject to required minimum distribution rules.\n5) Money withdrawals If you withdraw from a traditional IRA before retirement, you will pay tax on that money. Plus, if you are under 59½, you generally will be subject to an additional penalty.\nRoth IRAs, on the other hand, can be withdrawn from at any time for any reason, penalty free. The key is that those withdrawals have to be the money you contributed, not funds from IRA conversions or earnings on your investment.\n\"That's a big deal for lots of younger people who are worried, 'What if I need to get to my money?'\" Slott said.\nMore from Personal Finance:\nThis rollover mistake can sink your retirement savings\nTax bill kills this key strategy for how you save for retirement\nMissing this key retirement deadline could trigger a 50% tax penalty", "external_links": [], "published": "2018-01-16T15:31:00.000+02:00", "crawled": "2018-01-16T15:50:55.000+02:00", "highlightTitle": ""}