{"organizations": [], "uuid": "e7d8f07bf49d856f146db25bc62c8131a4e1f647", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221007821&w=1200&r=LYNXMPEE0A060", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/california-mudslides-evacuations/california-mudslides-highlight-difficulty-in-getting-evacuations-right-idINKBN1F00A4", "country": "US", "domain_rank": 408, "title": "California mudslides highlight difficulty in getting evacuations right", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T05:11:00.000+02:00", "replies_count": 0, "uuid": "e7d8f07bf49d856f146db25bc62c8131a4e1f647"}, "author": "", "url": "https://in.reuters.com/article/california-mudslides-evacuations/california-mudslides-highlight-difficulty-in-getting-evacuations-right-idINKBN1F00A4", "ord_in_thread": 0, "title": "California mudslides highlight difficulty in getting evacuations right", "locations": [], "entities": {"persons": [{"name": "gary goldberg", "sentiment": "none"}, {"name": "sharon bernstein", "sentiment": "none"}, {"name": "goldberg", "sentiment": "none"}, {"name": "jonathan allen", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "san ysidro creek", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "east valley road", "sentiment": "none"}, {"name": "montecito", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Living just outside the mandatory evacuation zone, Gary Goldberg said most of his neighbors probably felt out of harm’s way during this week’s deadly California mudslides.\nDestroyed homes are seen along San Ysidro Creek near East Valley Road following the mudslide in Montecito, California, U.S. January 10, 2018 in this picture obtained from social media. Courtesy of SANTA BARBARA COUNTY FIRE DEPARTMENT/via REUTERS If so, it was a false sense of security. A torrent of boulders and debris came roaring down a rain-saturated hillside near his house in the coastal community of Montecito on Tuesday, he said.\n“It came down so fast; it took people out,” said Goldberg, who evacuated anyway with his wife and two children. One neighbor’s home was completely washed away, the mud and boulders leaving only the foundation and the chimney behind.\nComing on the heels of one of the most devastating wildfire seasons in state history, the landslides in Santa Barbara County killed at least 17 people and destroyed dozens of homes.\nThe mudslides, many in areas where evacuations were either voluntary or not ordered at all, are the latest disaster to highlight the vexing task facing officials trying to get people out of the way of fast-moving disasters.\n“There clearly were areas that were damaged that were outside of the evacuation area,” said state Senator Hannah-Beth Jackson, who represents the region and last week authored a bill to improve disaster alert systems. “But trying to figure out where these floods are going to happen really is just good guessing. It’s an art, not a science.”\nLast fall, when wildfire swept through California’s wine-growing region in Napa and Sonoma counties, thousands of people failed to receive evacuation alerts on their cellphones because the fire destroyed the cell towers.\nIn the Thomas Fire that ravaged California’s south-central coast, a computer problem led to the alerts going out too broadly, frightening people who were not in danger and leading others to ignore future warnings, said Jackson.\nLast year’s hurricane season also brought evacuation challenges. Officials in Texas were criticized when they chose not to mandate evacuations as Hurricane Harvey barreled through Houston, yet the same city suffered terrible gridlock during efforts to evacuate from Hurricane Rita in 2005.\nWARNED FOR DAYS Destroyed homes are seen along San Ysidro Creek near East Valley Road following the mudslide in Montecito, California, U.S. January 10, 2018 in this picture obtained from social media. Courtesy of SANTA BARBARA COUNTY FIRE DEPARTMENT/via REUTERS Officials worked for days, even going door-to-door, to warn residents that the hillsides were ripe for dangerous mudflows after the fires destroyed the vegetation that could hold the soil in place, said Dennis Bozanich, deputy county executive officer for Santa Barbara County.\n“Since the time the fire ended, prior to Christmas, we had been warning our residents,” he said.\nThe county put on its website last week an interactive map in which residents could type in their address and see the position of the house relative to the flood zones.\nBozanich said many people did not comply with either voluntary or mandatory evacuation orders.\nPsychologist Betsy Bates Freed and her husband David were among those who decided to leave, fleeing their canyon home in the downpour just days after they finished cleaning it up after the fires. They had evacuated at that time as well, staying at four different places over 12 days until the danger passed.\nBut as the rain fell Monday night and the Freeds packed up their clothing and their dog Ellie, a neighbor called the county to verify that the evacuation was mandatory. He was mistakenly told that it was not, but eventually evacuated anyway, Bates Freed said.\nMany of those who were not in areas marked for mandatory evacuation were nonetheless in places designated as voluntary evacuation zones, officials said.\nIn the case of the mudslides, evacuation is made more difficult by the complexities of geology, said Lucy Jones, one of California’s top experts on earthquakes and other natural disasters.\nFor example, a non-scientist looking at a map showing where mudslides might occur would not have realized that some neighborhoods near Montecito Creek that were not under a mandatory evacuation order were particularly vulnerable.\n“A geologist would have looked at this map and said Montecito Creek is a really dangerous place,” said Jones.\nReporting by Sharon Bernstein in Sacramento, California, and Jonathan Allen in New York; Editing by Frank McGurty and Lisa Shumaker\n ", "external_links": [], "published": "2018-01-11T05:11:00.000+02:00", "crawled": "2018-01-11T05:44:01.010+02:00", "highlightTitle": ""}