{"organizations": [], "uuid": "4f6917d8149ddc0ea0345bc68393bf7c7895830d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-audioeye-reports-172-percent-revenue-increase-232-percent-bookings-growth-in-2017.html", "country": "US", "domain_rank": 767, "title": "AudioEye Reports 172% Revenue Increase, 232% Bookings Growth in 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.979, "site_type": "news", "published": "2018-01-10T14:00:00.000+02:00", "replies_count": 0, "uuid": "4f6917d8149ddc0ea0345bc68393bf7c7895830d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-audioeye-reports-172-percent-revenue-increase-232-percent-bookings-growth-in-2017.html", "ord_in_thread": 0, "title": "AudioEye Reports 172% Revenue Increase, 232% Bookings Growth in 2017", "locations": [], "entities": {"persons": [{"name": "todd bankofier", "sentiment": "none"}], "locations": [{"name": "tucson", "sentiment": "none"}, {"name": "ariz.", "sentiment": "none"}], "organizations": [{"name": "audioeye, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "audioeye", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TUCSON, Ariz., Jan. 10, 2018 /PRNewswire/ -- AudioEye, Inc. (OTCQB: AEYE) (\"AudioEye\" or the \"Company\"), the leader in cloud-based software-as-a-service (SaaS) digital content accessibility solutions, today announced preliminary revenue and new client cash contract bookings (\"cash contract bookings\" or \"bookings\") for its fiscal year ending December 31, 2017.\nFor 2017, AudioEye secured revenue of more than $2.7 million, an increase of more than 172% from $994,000 in the prior year. Bookings for 2017 were a Company record $6.3 million across more than 470 user accounts, an increase of 232% from cash contract bookings of $1.9 million for 2016. The Company expects to report complete financial results in March.\nAudioEye previously released 2018 targets for revenue between $6.5 million and $7.5 million and cash contract bookings between $11 million and $12 million, indicating expected continued rapid growth in its business.\nCEO Todd Bankofier stated, \"Bookings momentum continued to accelerate as companies increasingly prioritize accessibility as a critical part of their digital content strategy. AudioEye's industry leading solutions are being adopted by a rapidly growing list of financial service, government, education, HR and consumer sales facing customers. Our platform is in place on sites ranging from community banks to Fortune 500 enterprises, from private schools to US Federal Government agencies. Over the course of 2017, we have proven our ability to grow revenue, increase bookings and closely manage operating expenses. We look forward to continuing to do so with even greater success in 2018.\"\n\"The rapid expansion of market demand has also significantly increased interest in strategic partnerships between AudioEye and industry-leading third-party content management platforms. Our seven partnerships to date are accelerating our sales process in multiple vertical markets, several of which are just beginning to ramp going into 2018. We are actively discussing additional partnerships to further accelerate our market growth opportunities and expand our total addressable markets. We believe AudioEye is on track to not only further grow revenue in the year ahead, but also to achieve profitability and report significantly increased bookings in 2018.\"\nIn the first quarter of 2018, AudioEye plans to launch new service offerings and announce a key upgrade to the Digital Accessibility Platform (DAP), each of which will be impactful across its vertical markets.\nIn preparation for the \"refresh\" to Section 508 of the Rehabilitation Act of 1973, which will require federal agencies to conform to new updated accessibility standards, AudioEye has fully aligned its industry best Digital Accessibility Platform to fully align with the new standards that take effect in January 2018.\nAdditionally, AudioEye will introduce two new PDF services through its Accessible Documents Solutions. The first will provide remediation of key static legacy documents in PDF format, such as bank statements and other consumer and business records. The second service creates accessible templates for dynamic PDF downloads. This service was created working with HR-industry leader ADP to provide accessible W-2 downloads to millions of its users. The platform will be available to all clients needing to provide accessible templated high-volume PDFs on demand.\n\"In 2017 we secured our position as the technology leader in software driven accessibility solutions and dramatically increased awareness of our capabilities across key vertical markets,\" said Bankofier. \"We head into 2018 with great momentum, and look forward to a year of new and expanded service offerings, greater market penetration and launches into new vertical markets.\"\nAbout AudioEye, Inc.\nAudioEye is a technology company serving businesses committed to providing equal access to their digital content. Through patented technology, subject matter expertise and proprietary processes, AudioEye is transforming how the world experiences digital content.\nLeading with technology, AudioEye identifies and resolves issues of accessibility and enhances the user experience, making digital content more accessible and more usable for more people.\nAudioEye's common stock trades on the OTCQB under the symbol \"AEYE.\" The Company maintains offices in Tucson, Atlanta and Washington D.C. For more information about AudioEye and its online accessibility solutions, please visit https://www.audioeye.com .\nForward-Looking Statements\nAny statements in this press release about AudioEye's expectations, beliefs, plans, objectives, prospects, financial condition, assumptions or future events or performance are not historical facts and are \"forward-looking statements\" as that term is defined under the federal securities laws. These statements are often, but not always, made through the use of words or phrases such as \"believe\", \"anticipate\", \"should\", \"intend\", \"plan\", \"will\", \"expects\", \"estimates\", \"projects\", \"positioned\", \"strategy\", \"outlook\" and similar words. You should read the statements that contain these types of words carefully. Such forward-looking statements are subject to a number of risks, uncertainties and other factors that could cause actual results to differ materially from what is expressed or implied in such forward-looking statements, including the risk that the Company's bookings will not increase as currently expected or at all, the risk that the Company's cash position will not improve or will worsen, the risk that the Company's current capitalization plan will not provide the Company with sufficient cash to address its current or future needs or will otherwise not be successful, the risk that the Company's products will not perform as expected and the risk that the Company's products will not generate significant, or any, revenue for the Company. There may be events in the future that AudioEye is not able to predict accurately or over which AudioEye has no control. Other risks are described more fully in AudioEye's filings with the Securities and Exchange Commission. Forward-looking statements reflect management's analysis as of the date of this press release and AudioEye urges you not to place undue reliance on these forward-looking statements. AudioEye does not undertake any obligation to release publicly any revisions to such forward-looking statements to reflect events or uncertainties after the date hereof or to reflect the occurrence of unanticipated events.\nFor Further information, please contact:\nMatt Kreps, Darrow Associates Investor Relations\nEmail: mkreps@darrowir.com\nPhone: (214) 597-8200\nTodd Bankofier, AudioEye Chief Executive Officer\nEmail: tbankofier@AudioEye.com\nPhone: (520) 308-6140\nView original content with multimedia: http://www.prnewswire.com/news-releases/audioeye-reports-172-revenue-increase-232-bookings-growth-in-2017-300580121.html\nSOURCE AudioEye, Inc.", "external_links": ["https://www.audioeye.com/", "http://www.prnewswire.com/news-releases/audioeye-reports-172-revenue-increase-232-bookings-growth-in-2017-300580121.html"], "published": "2018-01-10T14:00:00.000+02:00", "crawled": "2018-01-10T16:28:27.053+02:00", "highlightTitle": ""}