{"organizations": [], "uuid": "636efd7c64f58ba0a390dff9e92c2b980e0bea3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225478031&w=1200&r=LYNXMPEE0P0RX", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-usa-stocks/futures-higher-ahead-of-trumps-address-gdp-data-idUSKBN1FF1KJ", "country": "US", "domain_rank": 408, "title": "US STOCKS-Futures higher ahead of Trump's address, GDP data", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T14:36:00.000+02:00", "replies_count": 0, "uuid": "636efd7c64f58ba0a390dff9e92c2b980e0bea3d"}, "author": "", "url": "https://www.reuters.com/article/us-usa-stocks/futures-higher-ahead-of-trumps-address-gdp-data-idUSKBN1FF1KJ", "ord_in_thread": 0, "title": "US STOCKS-Futures higher ahead of Trump's address, GDP data", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "steven mnuchin", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "commerce department", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 12:45 PM / in 19 minutes Intel, healthcare shares boost lift Wall St. to record Chuck Mikolajczak 4 Min Read \nNEW YORK (Reuters) - The latest round of strong earnings reports, including from Intel and AbbVie, along with continued weakness in the dollar lifted each of the major Wall Street indexes to closing records on Friday. \nThe three main indexes notched their best four-week run since 2016. \nIntel’s ( INTC.O ) shares surged as high as $50.15, their highest level since October 2000, and closed up 10.55 percent at $50.08 after results indicated that the chipmaker’s shift to higher-margin data-center business was working. \nAbbVie’s ( ABBV.N ) shares jumped 13.77 percent after the drugmaker significantly boosted its 2018 earnings forecast with help from U.S. tax reform and said it hopes to accelerate dividend growth and share buybacks. \n“We continue to see these positive steps in the right direction and definitely earnings are clearly justifying a lot of the recent move that we’ve had,” said Ryan Detrick, senior market strategist at LPL Financial in Charlotte, North Carolina. \nFourth-quarter earnings growth for the S&P 500 is now estimated at 13.2 percent, according to Thomson Reuters data, up from 12 percent at the start of the year. Of the 133 companies in the index that have reported through Friday, 79.7 percent have topped expectations. \nThe earnings enabled investors to shrug off a reading on economic growth that came in below expectations. \nGross domestic product increased at a 2.6 percent annual rate in the fourth quarter, the Commerce Department said in its advance GDP report, below the 3-percent forecast, as the strongest pace of consumer spending in three years resulted in a surge in imports. \n“You have manufacturing and the consumer doing well at the same time and the globe is doing better, so that’s a path for future GDP gains, which has always provided a fertile backdrop for earnings gains,” said Brent Schutte, chief investment strategist at Northwestern Mutual Wealth Management in Milwaukee. \nWeakness in the dollar, which is supportive for large multinational companies, continued. The greenback was down 0.34 percent against a basket of major currencies. \nThe dollar was on track for its worst week since May after comments from senior U.S. officials this week backing a weak currency. \nThe Dow Jones Industrial Average .DJI rose 223.92 points, or 0.85 percent, to 26,616.71, the S&P 500 .SPX gained 33.62 points, or 1.18 percent, to 2,872.87 and the Nasdaq Composite .IXIC added 94.61 points, or 1.28 percent, to 7,505.77. \nFor the week, the Dow rose 2.08 percent, the S&P 500 gained 2.22 percent and the Nasdaq advanced 2.31 percent. \nBuoyed by AbbVie, the S&P healthcare index .SPXHC gained 2.17 percent, scored its best day since November 2016 and was the best performer among the 11 major S&P sectors. \nAlso lifting the index were gains in Pfizer ( PFE.N ), up 4.78 percent after a European regulator recommended granting marketing approval to a diabetes drug developed by the company and Merck ( MRK.N ), up 1.21 percent. \nStarbucks ( SBUX.O ) dropped 4.23 percent after it warned 2018 global cafe sales growth would be at the low end of its forecast. \nAdvancing issues outnumbered declining ones on the NYSE by a 1.20-to-1 ratio; on Nasdaq, a 1.54-to-1 ratio favored advancers. \nThe S&P 500 posted 125 new 52-week highs and 2 new lows; the Nasdaq Composite recorded 178 new highs and 22 new lows. \nVolume on U.S. exchanges was 6.58 billion shares, compared to the 6.81 billion average for the full session over the last 20 trading days. Additional reporting by Caroline Valetkevitch; Editing by Nick Zieminski", "external_links": [], "published": "2018-01-26T14:36:00.000+02:00", "crawled": "2018-01-26T14:59:17.041+02:00", "highlightTitle": ""}