{"organizations": [], "uuid": "6c7bad4503407e87b7e947fcbe0b31e7fabecb19", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/08/the-associated-press-autos-overshadow-the-small-gadgets-at-ces-tech-show-in-vegas.html", "country": "US", "domain_rank": 767, "title": "Autos overshadow the small gadgets at CES tech show in Vegas", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T00:19:00.000+02:00", "replies_count": 0, "uuid": "6c7bad4503407e87b7e947fcbe0b31e7fabecb19"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/08/the-associated-press-autos-overshadow-the-small-gadgets-at-ces-tech-show-in-vegas.html", "ord_in_thread": 0, "title": "Autos overshadow the small gadgets at CES tech show in Vegas", "locations": [], "entities": {"persons": [{"name": "bosch", "sentiment": "none"}], "locations": [{"name": "vegas las vegas", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "kia", "sentiment": "none"}, {"name": "toyota", "sentiment": "none"}, {"name": "ford", "sentiment": "none"}, {"name": "hyundai", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LAS VEGAS (AP) — The smartphones and other small machines that used to dominate the annual CES gadget show have been overshadowed in recent years by bigger mobile devices: namely, automobiles.\nAuto companies typically save more practical announcements about new cars, trucks and SUVs for the upcoming Detroit auto show. But major automakers like Toyota, Kia, Hyundai and Ford have a noticeable presence at this week's tech showcase in Las Vegas. CES is a chance for carmakers and suppliers of automotive parts and software to display their wilder and far-out ideas.\nAmong the highlights Monday:\n— Toyota says it's developing self-driving mini-buses that can serve as bite-sized stores. These vehicles will drive themselves to places where potential buyers can try on clothes or shoes or pick through flea market items. The project is still in the conceptual stage, with testing expected in the 2020s.\n— Automotive supplier Bosch wants to help guide drivers to vacant parking spots in as many as 20 U.S. cities, including Los Angeles, Miami and Boston. The company says it will be working with automakers on the initiative but didn't say which ones. As cars drive by, they will automatically recognize and measure gaps between parked cars and transmit that data to a digital map.\nIn other developments at CES:\n— TV manufacturers are showcasing new models — all with acronyms to set their sets apart. One feature called HDR10+ by Samsung and HDR 10 Pro by LG takes what's known as high dynamic range and adjusts settings for each frame, instead of having levels set for the entire video at once. Meanwhile, quantum-dot technology promises more accurate colors. Samsung calls its version QLED, while Hisense has QDEF.\n— As LG unveiled its lineup of smart appliances, executive David VanderWaal quickly lost rapport with his on-stage partner, the cute voice-activated assistant CLOi. After an initial greeting, CLOi stopped responding while continuing to blink its digital eyes. VanderWaal shrugged it off, saying, \"even robots have bad days.\"\n— HTC is upgrading its headsets for exploring virtual worlds. HTC says the new Vive Pro has better resolution and audio and weighs less than its existing VR model. The Taiwanese company hasn't yet revealed cost or shipping dates. There's also a wireless option coming this summer. The Vive competes with Facebook's Oculus among high-end systems, but these haven't been as widely used as smartphone-based headsets such as Samsung's Gear VR and Google's Daydream.\nAnd beyond CES:\n— Toy maker VTech has agreed to pay $650,000 to settle charges it violated a law protecting children's privacy. The Federal Trade Commission says VTech collected personal information from children without getting consent from a verified parent and didn't do enough to protect the data it collected. Such toys have become popular, and companies are expected to unveil more toys and other internet-connected gadgets at the CES tech show in Las Vegas this week.", "external_links": [], "published": "2018-01-09T00:19:00.000+02:00", "crawled": "2018-01-09T20:43:34.015+02:00", "highlightTitle": ""}