{"organizations": [], "uuid": "a402159fa813f97948a2b9815d9caaae6545f917", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XC162_1XgnW_TOP_20180120132010.jpg", "site_section": "https://www.wsj.com/news/business/energy-oil-gas", "section_title": "Energy News, Oil News, Gas News, Nuclear &amp; Wind Industry, Gasoline at WSJ.com", "url": "https://www.wsj.com/articles/frackers-could-make-more-money-than-ever-in-2018-if-they-dont-blow-it-1516536000", "country": "US", "domain_rank": 387, "title": "Frackers Could Make More Money Than Ever in 2018, If They Don’t Blow It", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.858, "site_type": "news", "published": "2018-01-21T15:00:00.000+02:00", "replies_count": 0, "uuid": "a402159fa813f97948a2b9815d9caaae6545f917"}, "author": "Bradley Olson", "url": "https://www.wsj.com/articles/frackers-could-make-more-money-than-ever-in-2018-if-they-dont-blow-it-1516536000", "ord_in_thread": 0, "title": "Frackers Could Make More Money Than Ever in 2018, If They Don’t Blow It", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "41 COMMENTS U.S. shale companies are poised to earn real money this year for the first time since the start of the fracking boom.\nCrude prices have surged almost 40% in the past six months. Yet shale producers are so far touting cautious spending plans for 2018—in contrast with past price spikes, when companies mounted aggressive drilling campaigns that quickly increased supplies and pushed prices back down.\nShale drillers are heeding growing calls from investors, who have chastened the companies for pumping ever more oil and gas , even as they incur losses doing so. But some investors and analysts remain skeptical that U.S. wildcatters will fulfill promises to live within their means, saying that higher prices have almost always led them to boost drilling.\n“These companies can say that, but will they follow through?” said Norm MacDonald, vice president and portfolio manager at Invesco Ltd. “Given what oil prices have done in the past few months, the proof will be in the pudding.”\nCompanies such as Anadarko Petroleum Corp. already have detailed plans to reduce 2018 spending on drilling and operating wells. Even oil giant Chevron Corp. plan s to cut such investments by almost 10%.\nAmong smaller operators, spending is expected to rise about 8% in 2018, compared with a 55% increase in 2017, according to an analysis of more than 20 companies by Jefferies. About one-third of the biggest producers have released preliminary spending guidance, and the rest are expected to do so in coming weeks.\nEven as U.S. producers promise to curtail excesses of previous years, federal forecasters expect them soon to push U.S. oil output past the monthly record, set in 1970, of more than 10 million barrels a day. They are on pace to establish the record in the next few weeks, according to U.S. Energy Information Administration estimates.\nThe Paris-based International Energy Agency went a step further Friday, projecting that U.S. production in 2018 will surpass the output of Saudi Arabia and rival that of Russia, the top producer.\nProduction continues to increase because of past and continuing investment, but companies are pulling back on future spending. That puts U.S. oil companies on track in 2018 to generate more cash than they take in, a first in the age of shale.\nA wide range of companies are drawing up their 2018 budgets using an oil price of $50 to $55 a barrel, according to Goldman Sachs Group Inc., which hosted company executives and investors at a Miami conference last week.\nBillionaire Harold Hamm, chief executive of Continental Resources Inc., has said he would use excess cash to reduce debt, echoed by a dozen others. Producers also said they would consider buying back shares or fattening dividends. One operator, Concho Resources Inc., said it would “pile up cash” at an oil price of $60.\nU.S. oil prices fell 1.5% last week to $63.37, having recently topped $65, the highest level since 2014. Many companies might not increase spending levels until the second half of the year.\nShale-company executives have been preaching the gospel of moderation since 2014, when oil prices plummeted because of a global glut of crude that fracking helped create. Yet the companies behind the U.S. oil boom together have spent $265 billion more than they generated from operations since 2010, according to a Wall Street Journal analysis of FactSet data.\nOil producers’ stock prices have lagged behind oil’s rally, a signal that investors remain skeptical, according to shareholders, analysts and executives. An index of more than 40 companies has risen 17% in the past three months, outstripping the S&P 500 but falling well short of gains in the price of crude.\n“There is always a risk that they will shoot themselves in the foot again,” said John Castellano, managing director in the energy practice of consulting firm AlixPartners. But this time, he says, “the companies have much lower costs, better balance sheets, better management teams and more room to move.”\nShale producers, even as they hold back, will be able to increase output more than spending this year because of several factors.\nInvestments in drilling made in 2017 will yield production increases in the first months of 2018, because of the six- to nine-month lag time from when a well is drilled to when it starts to produce.\nAnd oil companies have a backlog of almost 7,000 wells that have been drilled but not fracked—30% more than in January 2017. Having already spent money to drill last year, operators can save money and boost production by fracking the backlog.\n“Is this time going to be different? I think yes, a little bit,” said Will Riley, who helps oversee more than $300 million in energy investments for asset manager Guinness Atkinson. “Companies will look to increase growth a little, but at a more moderate pace.”", "external_links": [], "published": "2018-01-21T15:00:00.000+02:00", "crawled": "2018-01-21T15:39:50.015+02:00", "highlightTitle": ""}