{"organizations": [], "uuid": "541a493f9fdff10b5f1d89307ff5fda3a569cdef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 73}, "facebook": {"likes": 209, "shares": 209, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/26/104970968-GettyImages-160330770.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/27/us-news-world-report-10-countries-with-the-best-quality-of-life.html", "country": "US", "domain_rank": 767, "title": "US News & World Report: 10 countries with the best quality of life", "performance_score": 2, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.143, "site_type": "news", "published": "2018-01-27T15:31:00.000+02:00", "replies_count": 0, "uuid": "541a493f9fdff10b5f1d89307ff5fda3a569cdef"}, "author": "Zameena Mejia", "url": "https://www.cnbc.com/2018/01/27/us-news-world-report-10-countries-with-the-best-quality-of-life.html", "ord_in_thread": 0, "title": "US News & World Report: 10 countries with the best quality of life", "locations": [], "entities": {"persons": [], "locations": [{"name": "canada", "sentiment": "none"}], "organizations": [{"name": "aurora borealis", "sentiment": "positive"}, {"name": "u.s. news & world", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CNBC.com The Aurora Borealis captured in a clearing in a Swedish coniferous forest. \nFor the third consecutive year, Canada is the No. 1 country to live in for the best quality of life, according to the U.S. News & World Report 2018 Best Countries list . \nIn order to help people understand how nations are perceived on a global scale, over 21,000 respondents were asked to evaluate 80 countries by ranking them according to 65 attributes. Among those were economic influence, power, citizenship and quality of life, which collectively helped determine each country's success as a modern nation. \nTo determine which countries were perceived to have the best quality of life, researchers measured these nine country attributes: affordability, quality of local job market, economic stability, family-friendliness, income equality, political stability, safety, quality of public education system and quality of public health system. \nWhile Canada is ranked first, \"Scandinavian countries that are well-known for their strong social welfare networks dominate the top 10,\" U.S. News & World Report data editor Deidre McPhillips tells CNBC Make It . show chapters 11:54 AM ET Wed, 25 Oct 2017 | 01:01 \nThe rankings are part of an analysis project called the 2018 Best Countries Report, conducted now for three years by the Wharton School of the University of Pennsylvania and global consumer insights firm Y&R's BAV Group. \n\"The Best Countries report speaks to the effect a nation's brand can have on its economic prosperity and perceived standing in the world,\" Wharton professor of marketing David Reibstein said in a statement. \nY&R Global CEO David Sable added that nations need to think carefully about their brand appeal and show off qualities like innovation and compassion in order to set themselves apart. \n\"For the countries that rose to the top of this year's rankings, it is once again clear that military vigor and economic power are no longer the key determinants to a country's brand success,\" Y&R Global CEO David Sable said in a statement. \nHere are the 10 countries that offer the best quality of life, along with how the U.S. News & World Report ranked them on other lists this year: 10. Germany Martin Deja | Getty Images Hamburg, Germany. \nAlso in the top 10 best countries for: most modern, entrepreneurship, power, most forward-looking, headquartering a corporation, most influential, transparency, green living, education, women, best countries overall. 9. New Zealand Doug Pearson | Getty Images New Zealand, Auckland, Waitakere Harbour, Elevated View over Devenport towards CBD with Sky Tower at dawn \nAlso in the top 10 best countries for: retirement, traveling alone, adventure, raising kids, most modern. 8. Netherlands Sergio Formoso | Flickr | Getty Images Amsterdam, The Netherlands \nAlso in the top 10 best countries for: most business-friendly, most modern, entrepreneurship, headquartering a corporation, raising kids, travel alone, most transparent countries, green living, women, best countries overall. 7. Finland Chad Ehlers | Stone | Getty Images Helsinki, Finland \nAlso in the top 10 best countries for: green living, raising kids, transparency, women, most business-friendly, most modern. 6. Switzerland Carl Larson | Getty Images This panorama was taken from the top of the Zurich's Grossmunster Cathedral. This aerial view shows Zurich's old town bordering the Limmat River. \nAlso in the top 10 best countries for: most business-friendly, cultural influence, most modern, entrepreneurship, starting a business, most forward-looking countries, headquartering a corporation, raising kids, transparency, green living, education, retiring comfortably, women, best countries overall. 5. Australia Adam Jeffery | CNBC Sydney, Australia \nAlso in the top 10 best countries for: cultural influence, most modern, most-forward looking, headquartering a corporation, raising kids, traveling alone, green living, investing in, education, retiring comfortably, women, best countries overall. 4. Norway Visions of Our Land | Getty Images Nidelva river and Solsiden area in Trondheim, Norway \nAlso in the top 10 best countries for: most business-friendly, entrepreneurship, most modern, transparency, raising kids, women, green living. 3. Sweden The Aurora Borealis captured in a clearing in a Swedish coniferous forest. \nAlso in the top 10 best countries for: most business-friendly, cultural influence, most modern, entrepreneurship, retiring comfortably, headquartering a corporation, raising kids, transparency, green living, education, women, best countries overall. 2. Denmark Merten Snijders | Getty Images Copenhagen, Denmark \nAlso in the top 10 best countries for: education, raising kids, women, most modern, most business-friendly, headquartering a corporation, transparency, green living. 1. Canada David Chapman | Getty Images Quebec City, Quebec, Canada. \nAlso in the top 10 best countries for: most business-friendly, most modern, entrepreneurship, retiring comfortably, starting a business, most forward-looking countries, headquartering a corporation, raising kids, transparency, green living, education, women, best countries overall. \nLongevity expert Dan Buettner tells CNBC Make It that if you want to become happy, changing your environment can be more effective than changing your belief system. \n\"Your beliefs aren't going to change. But data now exists to show us how to optimize your surroundings so you're more likely to be happy,\" he says. \"Living by water, in a bikable community and in a place with easy access to fruits and vegetables all stack the deck in favor of happiness.\" \nBuettner's offers this advice to millennials who may feel unhappy living or working where they do: \"As long as you make enough for food, shelter, healthcare and some mobility, you should only do a job you love and uses your skills/passions,\" he says. \"You will be much happier in the long run.\"", "external_links": [], "published": "2018-01-27T15:31:00.000+02:00", "crawled": "2018-01-27T15:33:31.038+02:00", "highlightTitle": ""}