{"organizations": [], "uuid": "4b94941121e114be568c82aff15cabf13cfa5ee7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220192770&w=1200&r=LYNXMPEE070CI", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews/", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-china-france/chinas-new-silk-road-cannot-be-one-way-frances-macron-says-idUKKBN1EX0FY", "country": "US", "domain_rank": 408, "title": "China's new \"Silk Road\" cannot be one-way, France's Macron says", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T08:56:00.000+02:00", "replies_count": 0, "uuid": "4b94941121e114be568c82aff15cabf13cfa5ee7"}, "author": "", "url": "https://uk.reuters.com/article/uk-china-france/chinas-new-silk-road-cannot-be-one-way-frances-macron-says-idUKKBN1EX0FY", "ord_in_thread": 0, "title": "China's new \"Silk Road\" cannot be one-way, France's Macron says", "locations": [], "entities": {"persons": [{"name": "macron", "sentiment": "negative"}, {"name": "reuters/charles platiau", "sentiment": "none"}, {"name": "emmanuel macron", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "daming palace", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "road", "sentiment": "none"}, {"name": "silk road", "sentiment": "none"}, {"name": "africa", "sentiment": "none"}, {"name": "shaanxi", "sentiment": "none"}, {"name": "central asia", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "southeast asia", "sentiment": "none"}, {"name": "pakistan", "sentiment": "none"}, {"name": "xian", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "macron", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 6:56 AM / Updated 22 minutes ago China's new 'Silk Road' cannot be one-way, France's Macron says Michel Rose 3 Min Read \nXIAN, China (Reuters) - French President Emmanuel Macron said on Monday China and Europe should work together on Beijing’s “Belt and Road” initiative, a project aiming to build a modern-day “Silk Road” he said could not be “one-way”. \nMacron began his first state visit to China with a stop in Xian, an eastern departure point of the ancient Silk Road, hoping to relaunch EU-China relations often strained by Beijing’s restrictions on foreign investment and trade. \n“After all, the ancient Silk Roads were never only Chinese,” Macron told an audience of academics, students and business people at the Daming Palace, the royal residence for the Tang dynasty for more than 220 years. \n“By definition, these roads can only be shared. If they are roads, they cannot be one-way,” he said. \nUnveiled in 2013, the Belt and Road project is aimed at connecting China by land and sea to Southeast Asia, Pakistan and Central Asia, and beyond to the Middle East, Europe and Africa. \nXi pledged $124 billion for the plan at a summit in May but it has faced suspicion in Western capitals that it is intended more to assert Chinese influence than Beijing’s professed desire to spread prosperity. \nMacron, who pledged to visit China at least once every year during his mandate, said the new infrastructure and cultural projects promoted by China could also be in France’s and Europe’s interest if done in a spirit of cooperation. \n“These roads cannot be those of a new hegemony, which would transform those that they cross into vassals,” Macron said. French President Emmanuel Macron and his wife Brigitte Macron pose with China's President Xi Jinping and his wife Peng Liyuan during their meeting in Beijing, China, January 8, 2018. REUTERS/Andy Wong/Pool TPX IMAGES OF THE DAY \nAlice Ekman of the Paris-based IFRI think-tank said: ”For the moment, considering how extensive and unclear the Chinese project continues to be, several European countries including France have shown caution about it. \n“For China, the new Silk Roads are also a tool to promote new international standards, rules and norms that are different from those currently used by France and other European countries,” \nBritish Finance Minister Philip Hammond said in December Britain, which is quitting the European Union, wanted closer cooperation with China over the Belt and Road scheme. Slideshow (10 Images) \nMacron, 40, has said Europe should not be “naive” in its trade relations, pushing in Brussels for more stringent anti-dumping rules against imports of cheap Chinese steel. \nIn June, he urged the European Commission to build a system for screening investments in strategic sectors from outside the bloc, which drew criticism from Beijing. \nIn Xian, Macron said he hoped EU-Chinese relations could have a new start, based on “balanced rules”, after acknowledging there had been mistrust and “legitimate questions” in China as well as fears amongst Europeans. \nEurope was now united and ready to cooperate with China after years of crisis-management and economic stagnation, Macron said. \n“What I came to tell you, is that Europe is back,” he added. \nThe French president, who is travelling with a delegation of 50 businessmen, is hoping to gain more access for French companies to Chinese markets. Reporting by Michel Rose; Editing by Paul Tait and Robin Pomeroy", "external_links": [], "published": "2018-01-08T08:56:00.000+02:00", "crawled": "2018-01-08T09:44:07.012+02:00", "highlightTitle": ""}