{"organizations": [], "uuid": "b8bc292df73580097a5a3a13ce3a28f04387f915", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-boys-hope-girls-hope-of-arizona-welcomes-healthcare-trust-of-america-ceo-scott-d-peters-to-board.html", "country": "US", "domain_rank": 767, "title": "Boys Hope Girls Hope of Arizona Welcomes Healthcare Trust of America CEO Scott D. Peters to Board", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.995, "site_type": "news", "published": "2018-01-29T21:37:00.000+02:00", "replies_count": 0, "uuid": "b8bc292df73580097a5a3a13ce3a28f04387f915"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-boys-hope-girls-hope-of-arizona-welcomes-healthcare-trust-of-america-ceo-scott-d-peters-to-board.html", "ord_in_thread": 0, "title": "Boys Hope Girls Hope of Arizona Welcomes Healthcare Trust of America CEO Scott D. Peters to Board", "locations": [], "entities": {"persons": [{"name": "scott d. peters", "sentiment": "negative"}, {"name": "peters", "sentiment": "none"}], "locations": [{"name": "board scottsdale", "sentiment": "none"}, {"name": "ariz.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}], "organizations": [{"name": "arizona welcomes healthcare trust of america", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "healthcare trust of america, inc.", "sentiment": "neutral"}, {"name": "arizona board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SCOTTSDALE, Ariz., Jan. 29, 2018 /PRNewswire/ -- Healthcare Trust of America, Inc. (NYSE: HTA), the largest dedicated owner and operator of medical office buildings in the United States, is pleased to announce that CEO Scott D. Peters has joined the Boys Hope Girls Hope of Arizona Board of Directors. Boys Hope Girls Hope (BHGH) helps academically capable and motivated children-in-need to meet their full potential and become men and women for others by providing value-centered, family-like homes, opportunities and education through college.\nSince 1989, BHGH of Arizona has been helping scholars rise up from disadvantaged backgrounds and strive for more. BHGH of Arizona serves youth who want to go to college and create successful futures for themselves. Scholars join the program to receive support on their journey to college and beyond. They seek the academic resources, extracurricular opportunities and mentor relationships.\n\"I am honored to have the opportunity to serve on the Boys Hope Girls Hope of Arizona Board of Directors,\" said Peters. \"Guidance from our board is imperative as we embark on significantly expanding our programs through donations and deepening our engagement with students. I hope to inspire others to continue the spirit of high achievement and dedication to those in need in our community.\"\nAs part of Peters' commitment to BHGH of Arizona, HTA provided much needed support to all the students by donating gift cards for new clothes, shoes and other supplies. In addition, HTA was proud to donate funds to BHGH of Arizona and will continue to provide assistance in raising awareness of the organizations needs and efforts.\nPeters is founder, chairman and CEO of Healthcare Trust of America, Inc. Peters previously served as the CEO of Grubb & Ellis Healthcare REIT Advisor and Grubb & Ellis Realty Investors. He also served as CEO, president and director of Grubb & Ellis Company, and CEO, president and director of NNN Realty Advisors, Inc. NNN Realty Advisors became a wholly owned subsidiary of Grubb & Ellis upon its merger in December 2007. In addition, Peters served as director of Golf Trust of America, Inc., a publically traded REIT and was an executive with Pacific Holding Company and Castle & Cooke. Peters received a B.B.A. in accounting and finance from Kent State University.\nAbout HTA\nHealthcare Trust of America, Inc. (NYSE: HTA) is the largest dedicated owner and operator of medical office buildings in the United States, based on gross leasable area. The company provides the real estate infrastructure for the integrated delivery of healthcare services in highly desirable locations. Over the last decade, HTA has invested approximately $7 billion primarily in medical office buildings and other healthcare assets comprising over 24 million square feet of gross leasable area. HTA's investments are targeted in key markets that are believed to have superior healthcare demographics and supports a strong, long-term demand for medical office space. HTA continues to achieve critical mass within these key markets by expanding its presence through accretive acquisitions and utilizing in-house operating expertise through regionally located property management and leasing platforms. Founded in 2006 and listed on the New York Stock Exchange in 2012, HTA has produced attractive returns for its stockholders that have significantly outperformed the S&P 500 and US REIT indices. For more information, visit www.htareit.com .\nForward-Looking Language\nThis press release contains certain forward-looking statements. Forward-looking statements are based on current expectations, plans, estimates, assumptions and beliefs, including expectations, plans, estimates, assumptions and beliefs about HTA, stockholder value and earnings growth.\nThe forward-looking statements included in this press release are subject to numerous risks and uncertainties that could cause actual results to differ materially from those expressed or implied in the forward-looking statements. Assumptions relating to the foregoing involve judgments with respect to, among other things, future economic, competitive and market conditions and future business decisions, all of which are difficult or impossible to predict accurately and many of which are beyond HTA's control. Although HTA believes that the expectations reflected in such forward-looking statements are based on reasonable assumptions, HTA's actual results and performance could differ materially and in adverse ways from those set forth in the forward-looking statements. Factors which could have a material adverse effect on HTA's operations and future prospects include, but are not limited to:\nchanges in economic conditions affecting the healthcare property sector, the commercial real estate market and the credit market; competition for acquisition of medical office buildings and other facilities that serve the healthcare industry; economic fluctuations in certain states in which HTA's property investments are geographically concentrated; retention of HTA's senior management team; financial stability and solvency of HTA's tenants; supply and demand for operating properties in the market areas in which HTA operates; HTA's ability to acquire real properties, and to successfully operate those properties once acquired; changes in property taxes; legislative and regulatory changes, including changes to laws governing the taxation of REITs and changes to laws governing the healthcare industry; fluctuations in reimbursements from third party payors such as Medicare and Medicaid; changes in interest rates; the availability of capital and financing; restrictive covenants in HTA's credit facilities; changes in HTA's credit ratings; HTA's ability to remain qualified as a REIT; changes in accounting principles generally accepted in the United States of America, policies and guidelines applicable to REITs; delays in liquidating defaulted mortgage loan investments; and the risk factors set forth in HTA's most recent Annual Report on Form 10-K and in HTA's most recent Quarterly Reports on Form 10-Q.\nForward-looking statements speak only as of the date made. Except as otherwise required by the federal securities laws, HTA undertakes no obligation to update any forward-looking statements to reflect the events or circumstances arising after the date as of which they are made. As a result of these risks and uncertainties, readers are cautioned not to place undue reliance on the forward-looking statements included in this press release or that may be made elsewhere from time to time by, or on behalf of, HTA.\nFinancial Contact:\nRobert A. Milligan\nChief Financial Officer\nHealthcare Trust of America, Inc.\n480.998.3478\nRobertMilligan@htareit.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/boys-hope-girls-hope-of-arizona-welcomes-healthcare-trust-of-america-ceo-scott-d-peters-to-board-300589645.html\nSOURCE Healthcare Trust of America, Inc.", "external_links": ["http://www.htareit.com/", "http://www.bhghaz.org/", "http://www.prnewswire.com/news-releases/boys-hope-girls-hope-of-arizona-welcomes-healthcare-trust-of-america-ceo-scott-d-peters-to-board-300589645.html"], "published": "2018-01-29T21:37:00.000+02:00", "crawled": "2018-01-30T00:38:14.004+02:00", "highlightTitle": ""}