{"organizations": [], "uuid": "1b6f36a12e19fc1d7e6bff5c3a2cc58e06d44b15", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-wabash-national-corporation-announces-fourth-quarter-and-full-year-2017-results.html", "country": "US", "domain_rank": 767, "title": "Wabash National Corporation Announces Fourth Quarter and Full Year 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T00:30:00.000+02:00", "replies_count": 0, "uuid": "1b6f36a12e19fc1d7e6bff5c3a2cc58e06d44b15"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-wabash-national-corporation-announces-fourth-quarter-and-full-year-2017-results.html", "ord_in_thread": 0, "title": "Wabash National Corporation Announces Fourth Quarter and Full Year 2017 Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fourth quarter and full-year GAAP earnings of $0.80 and $1.78 per diluted share Fourth quarter and full-year non-GAAP adjusted earnings of $0.36 and $1.38 per diluted share Strong Quote: and order activity increases backlog to near record level of $1.2 billion Company updates 2018 shipment guidance to 56,000 to 60,000 trailers and full-year earnings per diluted share guidance of $1.86 to $2.02\nLAFAYETTE, Ind., Jan. 30, 2018 (GLOBE NEWSWIRE) -- Wabash National Corporation (NYSE:WNC), a diversified industrial manufacturer and a leading producer of semi-trailers, truck bodies and liquid transportation systems, today reported results for the fourth quarter and full-year periods ending December 31, 2017.\nNet income for the fourth quarter 2017 was $49.4 million, or $0.80 per diluted share, compared to the fourth quarter 2016 net income of $23.0 million, or $0.36 per diluted share. Fourth quarter 2017 non-GAAP adjusted earnings was $22.3 million, or $0.36 per diluted share, a $2.0 million decrease as compared to the prior year period. Non-GAAP adjusted earnings for the fourth quarter 2017 exclude the one-time tax benefit associated with both the adjustment of the Company’s net deferred income tax liability totaling $19.7 million as a result of the Tax Cuts and Jobs Act of 2017 and the reversal of reserves for uncertain tax positions of $12.6 million. In addition, the fourth quarter 2017 adjusted earnings excludes non-recurring expenses totaling $6.6 million primarily related to acquisition and integration expenses associated with the Company’s acquisition of Supreme Industries, Inc. (“Supreme”) in September 2017 and charges incurred related to the closing of former branch locations. Net sales for the fourth quarter increased 18 percent to $543 million from $462 million in the prior year quarter and operating income decreased 13 percent to $35.3 million compared to operating income of $40.6 million for the fourth quarter 2016. Operating EBITDA, a non-GAAP measure that excludes the effects of certain items, for the fourth quarter 2017 was $51.1 million, a decrease of $2.5 million compared to operating EBITDA for the previous year quarter.\nFor the twelve months ended December 31, 2017, the Company reported net income of $111.4 million, or $1.78 per diluted share, on net sales of $1.77 billion, compared to net income of $119.4 million, or $1.82 per diluted share, on net sales of $1.85 billion for the twelve months ended December 31, 2016. Full-year 2017 results included tax benefits associated with both the adjustment of the Company’s net deferred income tax liability totaling $19.7 million as a result of the Tax Cuts and Jobs Act of 2017 and the reversal of reserves for uncertain tax positions of $12.6 million. Full-year results also include charges totaling $9.5 million related to acquisition and integration related costs for Supreme and early extinguishment of debt incurred with the Company’s purchase of a portion of the outstanding convertible senior notes net of gains from the transition and sale of former branch locations. Excluding the impact of these items, non-GAAP adjusted earnings for the full-year 2017 were $86.2 million, or $1.38 per diluted share. Full-year 2016 results included charges totaling $3.3 million related to early extinguishment of debt incurred with the Company’s purchase of a portion of the outstanding convertible senior notes and the impairment of intangible assets in connection with the Company’s segment realignment. Excluding the impact of these items, non-GAAP adjusted earnings for the full-year 2016 were $121.5 million, or $1.85 per diluted share. For the full-year 2017, the Company achieved operating EBITDA of $189.0 million, or 10.7 percent of net sales, as compared to $253.0 million, or 13.7 percent of net sales, for the previous year.\nThe following is a summary of select operating and financial results for the past five quarters:\nThree Months Ended (Dollars in thousands, except per\nshare amounts) December 31, March 31, June 30, September 30, December 31, 2016 2017 2017 2017 2017 Net Sales $ 462,057 $ 362,716 $ 435,903 $ 425,098 $ 543,444 Gross Profit Margin 15.5 % 16.4 % 15.5 % 14.3 % 13.4 % Income from Operations $ 40,621 $ 30,264 $ 38,668 $ 26,591 $ 35,293 Income from Operations Margin 8.8 % 8.3 % 8.9 % 6.3 % 6.5 % Net Income $ 23,000 $ 20,173 $ 22,945 $ 18,947 $ 49,356 Diluted EPS $ 0.36 $ 0.32 $ 0.36 $ 0.30 $ 0.80 Non-GAAP Measures (1) : Operating EBITDA $ 53,606 $ 41,930 $ 49,450 $ 46,561 $ 51,062 Operating EBITDA Margin 11.6 % 11.6 % 11.3 % 11.0 % 9.4 % Adjusted Earnings $ 24,213 $ 19,517 $ 23,189 $ 21,214 $ 22,250 Adjusted Diluted EPS $ 0.38 $ 0.31 $ 0.37 $ 0.34 $ 0.36 Notes:\nSee “Non-GAAP Measures” below for explanation of the non-GAAP results included above.\nThe following is a summary of select operating and financial results for each of the last five years ending December 31, 2017:\nTwelve Months Ended (Dollars in thousands, except per\nshare amounts) December 31, December 31, December 31, December 31, December 31, 2013 2014 2015 2016 2017 Net Sales $ 1,635,686 $ 1,863,315 $ 2,027,489 $ 1,845,444 $ 1,767,161 Gross Profit Margin 13.2 % 12.5 % 15.0 % 17.6 % 14.8 % Income from Operations $ 103,191 $ 122,386 $ 180,369 $ 202,532 $ 130,816 Income from Operations Margin 6.3 % 6.6 % 8.9 % 11.0 % 7.4 % Net Income $ 46,529 $ 60,930 $ 104,289 $ 119,433 $ 111,422 Diluted EPS $ 0.67 $ 0.85 $ 1.50 $ 1.82 $ 1.78 Non-GAAP Measures (2) : Operating EBITDA $ 149,890 $ 169,048 $ 229,464 $ 253,002 $ 189,004 Operating EBITDA Margin 9.2 % 9.1 % 11.3 % 13.7 % 10.7 % Adjusted Earnings $ 48,190 $ 62,992 $ 103,392 $ 121,538 $ 86,166 Adjusted Diluted EPS $ 0.70 $ 0.89 $ 1.49 $ 1.85 $ 1.38 Notes:\nSee “Non-GAAP Measures” below for explanation of the non-GAAP results included above.\nDick Giromini, chief executive officer, stated, “We are pleased overall with the Company’s 2017 performance, as we successfully established a stronger foundation for further growth and productivity for the current year and beyond. The addition of the Supreme truck body business was a key accomplishment as it not only adds immediate revenue and profit opportunity, but also provides significant diversification into a high-growth segment driven by the ever-increasing adoption of e-commerce.”\nMr. Giromini continued, “Operationally, following our fifth consecutive record year of profitability in 2016, a small reset was seemingly inevitable at some point. Despite a somewhat more challenging year for parts of our core businesses, we are nonetheless proud of the team’s efforts in overcoming many of the headwinds throughout the year, leading us to the strong finish in the fourth quarter that positioned us for new levels of success in 2018. New trailer shipments of 55,050 for the year were near the top-end of our previous guidance and we begin 2018 with a historically strong backlog of orders totaling $1.2 billion, an increase of 64 percent compared to the previous quarter.”\n2018 Outlook\nMr. Giromini stated, “Looking at the current year, we continue to believe the demand environment for trailers overall will remain healthy as fleet age, regulatory compliance requirements such as the ELD implementation, a strong economy and customer profitability all support a continuation of an extended trailer cycle. Adding to this belief is the significant turnaround in demand for both our platform and tank trailer businesses, leading to the strongest backlog in more than two years for those businesses. Those factors combined with the addition of the Supreme truck body business, impact of the new Tax Cuts and Jobs Act of 2017, and effects of cost and productivity improvement initiatives throughout the business create a great recipe for success. In 2018 we expect to ship in the range of 56,000 to 60,000 trailer units, along with 22,000 to 24,000 truck body units, for a revenue projection of $2.05 billion to $2.15 billion. While the first quarter will be slow out of the gate due to timing of shipments, we believe that pace will accelerate beginning in the second quarter and throughout the balance of the year. Based on those, and other demand and cost assumptions, we project full-year earnings of $1.86 to $2.02 per diluted share.”\nBusiness Segment Highlights\nThe table below is a summary of select segment operating and financial results prior to the elimination of intersegment sales for the fourth quarter and full-year periods of 2017 and 2016. As announced in the prior quarter, in the fourth quarter of 2017 the Company added a third reporting segment, Final Mile Products, which includes the results of our Supreme acquisition and the Company’s existing truck body growth and diversification initiative. A complete disclosure of the results by individual segment is included in the tables following this release.\n(dollars in thousands) Commercial Trailer Products Diversified Products Final Mile\nProducts Three months ended December 31 2017 2016 2017 2016 2017 New trailers shipped 15,500 # 14,600 650 550 - Net sales $ 385,961 $ 379,343 $ 91,771 $ 85,795 $ 70,461 Gross profit $ 47,055 $ 59,171 $ 18,040 $ 13,535 $ 8,150 Gross profit margin 12.2 % 15.6 % 19.7 % 15.8 % 11.6 % Income from operations $ 40,134 $ 49,917 $ 5,532 $ 1,124 $ (2,098 ) Income from operations margin 10.4 % 13.2 % 6.0 % 1.3 % -3.0 % Twelve months ended December 31 2017 2016 2017 2016 2017 New trailers shipped 52,800 58,850 2,250 2,100 - Net sales $ 1,348,382 $ 1,506,110 $ 361,358 $ 352,404 $ 70,461 Gross profit $ 183,912 $ 253,274 $ 70,159 $ 75,630 $ 8,150 Gross profit margin 13.6 % 16.8 % 19.4 % 21.5 % 11.6 % Income from operations $ 151,999 $ 212,351 $ 20,376 $ 24,595 $ (2,098 ) Income from operations margin 11.3 % 14.1 % 5.6 % 7.0 % -3.0 % Commercial Trailer Products’ net sales for the fourth quarter were $386 million, an increase of $7 million, or 2 percent, as compared to the prior year. Gross profit margin for the fourth quarter decreased 340 basis points as compared to the prior year period primarily due to increases in commodity costs and continued labor constraints resulting in higher overtime requirements to meet current demand. Operating income decreased $9.8 million, or 20 percent, from the fourth quarter last year to $40.1 million, or 10.4 percent of net sales.\nDiversified Products’ net sales for the fourth quarter increased $6 million, or 7 percent, due primarily to the increased demand for liquid tank trailers and process systems products as compared to the previous year period. Gross profit and profit margins as compared to the prior year period increased $4.5 million and 390 basis points, respectively, primarily due to increased demand levels and the execution of cost management initiatives. Operating income for the fourth quarter 2017 was $5.5 million, or 6.0 percent of net sales, an increase of $4.4 million compared to the prior year.\nFinal Mile Products’ net sales for the fourth quarter totaled $70 million. Gross profit and gross profit margin for the fourth quarter were $8.1 million and 11.6 percent, respectively. Excluding non-recurring acquisition and integration related costs, gross profit and operating margins for the fourth quarter were 17.6 percent and 3.9 percent, respectively. Truck body demand continues to be strong as backlog increased 33 percent compared to the prior year.\nNon-GAAP Measures\nIn addition to disclosing financial results calculated in accordance with United States generally accepted accounting principles (GAAP), the financial information included in this release contains non-GAAP financial measures, including operating EBITDA, operating EBITDA margin, adjusted earnings and adjusted earnings per diluted share.\nThese non-GAAP measures should not be considered a substitute for, or superior to, financial measures and results calculated in accordance with GAAP, including net income, and reconciliations to GAAP financial statements should be carefully evaluated.\nOperating EBITDA is defined as earnings before interest, taxes, depreciation, amortization, stock-based compensation, charges incurred in connection with the acquisition and integration of Supreme, impairment of goodwill and other intangible assets, and other non-operating income and expense. Management believes providing operating EBITDA is useful for investors to understand the Company’s performance and results of operations period to period with the exclusion of the items identified above. Management believes the presentation of operating EBITDA, when combined with the GAAP presentations of operating income and net income, is beneficial to an investor’s understanding of the Company’s operating performance. A reconciliation of operating EBITDA to net income is included in the tables following this release.\nAdjusted earnings and adjusted earnings per diluted share for the three- and twelve-month periods ending December 31, 2017 and 2016 reflect adjustments for charges incurred in connection with acquisition and integration of Supreme, the losses attributable to the Company’s extinguishment of debt, impairment of goodwill and other intangible assets, executive severance costs, income or losses recognized on sale of former branch locations as well as tax benefits associated with the adjustment of the Company’s net deferred income tax liability as a result of the Tax Cuts and Jobs Act of 2017 and reversal of reserves for uncertain tax positions. Management believes providing adjusted measures and excluding certain items facilitates comparisons to the Company’s prior year periods and, when combined with the GAAP presentation of net income and diluted net income per share, is beneficial to an investor’s understanding of the Company’s performance. A reconciliation of adjusted earnings and adjusted earnings per diluted share to net income and net income per diluted share is included in the tables following this release.\nFourth Quarter and Full-Year 2017 Conference Call\nWabash National will conduct a conference call to review and discuss its fourth quarter and full-year results on January 31, 2018 at 10:00 a.m. EST. Access to the live webcast will be available on the Company’s website at www.wabashnational.com . For those unable to participate in the live webcast, the call will be archived at www.wabashnational.com within three hours of the conclusion of the live call and will remain available through April 25, 2018. Meeting access also will be available via conference call at 800-708-4540, participant code 46320733.\nAbout Wabash National Corporation\nHeadquartered in Lafayette, Indiana, Wabash National Corporation (NYSE:WNC) is a diversified industrial manufacturer and a leading producer of semi-trailers, truck bodies and liquid transportation systems. Established in 1985, the Company manufactures a diverse range of products including: dry freight and refrigerated trailers, platform trailers, bulk tank trailers, dry and refrigerated truck bodies, truck-mounted tanks, intermodal equipment, aircraft refueling equipment, structural composite panels and products, trailer aerodynamic solutions, and specialty food grade and pharmaceutical equipment. Its innovative products are sold under the following brand names: Wabash National ® , Beall ® , Benson ® , Brenner ® Tank, Bulk Tank International, DuraPlate ® , Extract Technology ® , Garsite, Progress Tank, Supreme ® , Transcraft ® , Walker Engineered Products, and Walker Transport. Learn more at www.wabashnational.com .\nSafe Harbor Statement\nThis press release contains certain as defined by the Private Securities Litigation Reform Act of 1995. Forward-looking statements convey the Company’s current expectations or forecasts of future events. All statements contained in this press release other than statements of historical fact are . These include, among other things, all statements regarding the Company’s outlook for trailer and truck body shipments, backlog, expectations regarding demand levels for trailers, truck bodies, non-trailer equipment and our other diversified product offerings, pricing, profitability and earnings, cash flow and liquidity, opportunity to capture higher margin sales, new product innovations, our growth and diversification strategies and our expectations with regards to capital allocation. These and the Company’s other are subject to certain risks and uncertainties that could cause actual results to differ materially from those implied by the . Without limitation, these risks and uncertainties include the successful integration of Supreme into the Company’s business, adverse reactions to the transaction by customers, suppliers or strategic partners, uncertain economic conditions including the possibility that customer demand may not meet our expectations, increased competition, reliance on certain customers and corporate partnerships, risks of customer pick-up delays, shortages and costs of raw materials, risks in implementing and sustaining improvements in the Company’s manufacturing operations and cost containment, dependence on industry trends and timing and costs of indebtedness. Readers should review and consider the various disclosures made by the Company in this press release and in the Company’s reports to its stockholders and periodic reports on Forms 10-K and 10-Q.\nWABASH NATIONAL CORPORATION CONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS (Dollars in thousands, except per share amounts) (Unaudited) Three Months Ended\nDecember 31, Twelve Months Ended\nDecember 31, 2017 2016 2017 2016 Net sales $ 543,444 $ 462,057 $ 1,767,161 $ 1,845,444 Cost of sales 470,568 390,572 1,506,286 1,519,910 Gross profit 72,876 71,485 260,875 325,534 General and administrative expenses 24,314 19,036 77,825 74,129 Selling expenses 8,020 6,849 25,588 27,270 Amortization of intangibles 4,348 4,979 17,041 19,940 Acquisition Expenses 901 - 9,605 - Impairment of goodwill - - - 1,663 Income from operations 35,293 40,621 130,816 202,532 Other income (expense): Interest expense (7,335 ) (3,725 ) (16,400 ) (15,663 ) Other, net 194 (1,679 ) 8,122 (1,452 ) Income before income taxes 28,152 35,217 122,538 185,417 Income tax (benefit) expense (21,204 ) 12,217 11,116 65,984 Net income $ 49,356 $ 23,000 $ 111,422 $ 119,433 Dividends declared per share $ 0.075 $ 0.060 $ 0.255 $ 0.060 Basic net income per share $ 0.84 $ 0.37 $ 1.88 $ 1.87 Diluted net income per share $ 0.80 $ 0.36 $ 1.78 $ 1.82 Comprehensive income Net income $ 49,356 $ 23,000 $ 111,422 $ 119,433 Foreign currency translation adjustment (342 ) (403 ) 487 (1,347 ) Net comprehensive income $ 49,014 $ 22,597 $ 111,909 $ 118,086 Basic net income per share: Net income applicable to common stockholders $ 49,356 $ 23,000 $ 111,422 $ 119,433 Weighted average common shares outstanding 58,416 61,469 59,358 63,729 Basic net income per share $ 0.84 $ 0.37 $ 1.88 $ 1.87 Diluted net income per share: Net income applicable to common stockholders $ 49,356 $ 23,000 $ 111,422 $ 119,433 Weighted average common shares outstanding 58,416 61,469 59,358 63,729 Dilutive shares from assumed conversion of convertible senior notes 1,672 945 1,726 794 Dilutive stock options and restricted stock 1,479 1,287 1,514 1,239 Diluted weighted average common shares outstanding 61,567 63,701 62,598 65,762 Diluted net income per share $ 0.80 $ 0.36 $ 1.78 $ 1.82\nWABASH NATIONAL CORPORATION SEGMENTS AND RELATED INFORMATION (Dollars in thousands) (Unaudited) Commercial Diversified Final Mile Corporate and Three Months Ended December 31, Trailer Products Products Products Eliminations Consolidated 2017 New trailers shipped 15,500 650 - - 16,150 Used trailers shipped 550 50 - - 600 New Trailers $ 367,526 $ 40,895 $ - $ - $ 408,421 Used Trailers $ 5,352 $ 821 $ - $ - 6,173 Components, parts and service $ 9,908 $ 23,931 $ 1,877 $ (4,749 ) 30,967 Equipment and other $ 3,175 $ 26,124 $ 68,584 $ - 97,883 Total net external sales $ 385,961 $ 91,771 $ 70,461 $ (4,749 ) $ 543,444 Gross profit $ 47,055 $ 18,040 $ 8,150 $ (369 ) $ 72,876 Income (Loss) from operations $ 40,134 $ 5,532 $ (2,098 ) $ (8,275 ) $ 35,293 2016 New trailers shipped 14,600 550 - - 15,150 Used trailers shipped 150 - - - 150 New Trailers $ 359,767 $ 33,353 $ - $ - $ 393,120 Used Trailers 1,796 562 - - 2,358 Components, parts and service 13,082 22,867 - (3,055 ) 32,894 Equipment and other 4,698 29,013 - (26 ) 33,685 Total net external sales $ 379,343 $ 85,795 $ - $ (3,081 ) $ 462,057 Gross profit $ 59,171 $ 13,535 $ - $ (1,221 ) $ 71,485 Income (Loss) from operations $ 49,917 $ 1,124 $ - $ (10,420 ) $ 40,621 Twelve Months Ended December 31, 2017 New trailers shipped 52,800 2,250 - - 55,050 Used trailers shipped 1,050 100 - - 1,150 New Trailers $ 1,273,584 $ 140,105 $ - $ - $ 1,413,689 Used Trailers $ 10,720 $ 3,278 $ - $ - 13,998 Components, parts and service $ 48,008 $ 117,681 $ 1,877 $ (13,040 ) 154,526 Equipment and other $ 16,070 $ 100,294 $ 68,584 $ - 184,948 Total net external sales $ 1,348,382 $ 361,358 $ 70,461 $ (13,040 ) $ 1,767,161 Gross profit $ 183,912 $ 70,159 $ 8,150 $ (1,346 ) $ 260,875 Income (Loss) from operations $ 151,999 $ 20,376 $ (2,098 ) $ (39,461 ) $ 130,816 2016 New trailers shipped 58,850 2,100 - - 60,950 Used trailers shipped 950 100 - - 1,050 New Trailers $ 1,421,586 $ 129,639 $ - $ (89 ) $ 1,551,136 Used Trailers 11,998 3,176 - - 15,174 Components, parts and service 56,191 111,519 - (12,955 ) 154,755 Equipment and other 16,335 108,070 - (26 ) 124,379 Total net external sales $ 1,506,110 $ 352,404 $ - $ (13,070 ) $ 1,845,444 Gross profit $ 253,274 $ 75,630 $ - $ (3,370 ) $ 325,534 Income (Loss) from operations $ 212,351 $ 24,595 $ - $ (34,414 ) $ 202,532\nWABASH NATIONAL CORPORATION CONDENSED CONSOLIDATED BALANCE SHEETS (Dollars in thousands) December 31, December 31, 2017 2016 (Unaudited) ASSETS Current assets Cash and cash equivalents $ 191,521 $ 163,467 Accounts receivable 146,836 153,634 Inventories 180,735 139,953 Prepaid expenses and other 57,299 24,351 Total current assets $ 576,391 $ 481,405 Property, plant and equipment 195,363 134,138 Deferred income taxes - 20,343 Goodwill 317,464 148,367 Intangible assets 237,030 94,405 Other assets 25,265 20,075 $ 1,351,513 $ 898,733 LIABILITIES AND STOCKHOLDERS' EQUITY Current liabilities Current portion of long-term debt $ 46,020 $ 2,468 Current portion of capital lease obligations 290 494 Accounts payable 108,448 71,338 Other accrued liabilities 128,910 92,314 Total current liabilities $ 283,668 $ 166,614 Long-term debt 504,091 233,465 Capital lease obligations 1,012 1,409 Deferred income taxes 36,955 499 Other noncurrent liabilities 19,724 24,355 Stockholders' equity 506,063 472,391 $ 1,351,513 $ 898,733\nWABASH NATIONAL CORPORATION CONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS (Dollars in thousands) (Unaudited) Twelve Months Ended December 31, 2017 2016 Cash flows from operating activities Net income $ 111,422 $ 119,433 Adjustments to reconcile net income to net cash provided by operating activities Depreciation 18,012 16,830 Amortization of intangibles 17,041 19,940 Net (gain) loss on the sale of property, plant and equipment (8,046 ) 101 Deferred income taxes (14,814 ) 4,044 Loss on debt extinguishment 799 1,895 Stock-based compensation 10,429 12,038 Impairment of goodwill - 1,663 Non-cash interest expense 2,258 3,475 Changes in operating assets and liabilities Accounts receivable 31,943 (809 ) Inventories (13,158 ) 24,969 Prepaid expenses and other (2,014\n) (10,147 ) Accounts payable and accrued liabilities (963 ) (13,002 ) Other, net (8,530 ) (1,680 ) Net cash provided by operating activities $ 144,379 $ 178,750 Cash flows from investing activities Capital expenditures (26,056 ) (20,342 ) Proceeds from the sale of property, plant, and equipment 10,860 19 Acquisition, net of cash acquired (323,487 ) - Other, net 6,443 3,014 Net cash used in investing activities $ (332,240 ) $ (17,309 ) Cash flows from financing activities Proceeds from exercise of stock options 5,790 4,831 Borrowings under senior notes 325,000 - Dividends paid (15,315 ) - Borrowings under revolving credit facilities 713 618 Payments under revolving credit facilities (713 ) (618 ) Principal payments under capital lease obligations (600 ) (779 ) Proceeds from issuance of term loan credit facility 377,519 - Principal payments under term loan credit facilities (386,577 ) (1,928 ) Principal payments under industrial revenue bond (583 ) (473 ) Debt issuance costs paid (6,783 ) - Stock repurchase (74,491 ) (98,922 ) Convertible senior notes repurchase (8,045 ) (79,556 ) Net cash used in financing activities $ 215,915 $ (176,827 ) Net increase in cash and cash equivalents $ 28,054 $ (15,386 ) Cash and cash equivalents at beginning of period 163,467 178,853 Cash and cash equivalents at end of period $ 191,521 $ 163,467\nWABASH NATIONAL CORPORATION RECONCILIATION OF GAAP FINANCIAL MEASURES TO NON-GAAP FINANCIAL MEASURES (Dollars in thousands, except per share amounts) (Unaudited) Operating EBITDA 1 : Three Months Ended\nDecember 31, Twelve Months Ended\nDecember 31, 2017 2016 2017 2016 Net income $ 49,356 $ 23,000 $ 111,422 $ 119,433 Income tax expense (21,204 ) 12,217 11,116 65,984 Interest expense 7,335 3,725 16,400 15,663 Depreciation and amortization 9,651 9,565 35,053 36,769 Stock-based compensation 2,117 3,420 10,429 12,038 Impairment of intangibles - - - 1,663 Acquisition expenses and related charges 4,002 - 12,706 - Other non-operating (income) expense (194 ) 1,679 (8,122 ) 1,452 Operating EBITDA $ 51,062 $ 53,606 $ 189,004 $ 253,002 Three Months Ended March 31,\n2017 June 30,\n2017 September 30,\n2017 Net income $ 20,173 $ 22,945 $ 18,947 Income tax expense 8,434 13,160 10,728 Interest expense 2,990 2,888 3,187 Depreciation and amortization 8,704 8,315 8,386 Stock-based compensation 2,963 2,467 2,881 Acquisition expenses and related charges - - 8,704 Other non-operating (income) expense (1,333 ) (325 ) (6,271 ) Operating EBITDA $ 41,930 $ 49,450 $ 46,561 Adjusted Earnings 2 : Three Months Ended December 31, Twelve Months Ended December 31, 2017 2016 2017 2016 $ Per Share $ Per Share $ Per Share $ Per Share Net Income $ 49,356 $ 0.80 $ 23,000 $ 0.36 $ 111,422 $ 1.78 $ 119,433 $ 1.82 Adjustments: Facility transactions 3 274 - 450 0.01 (6,546 ) (0.10 ) (290 ) - Impairment of goodwill and other intangibles - - - - - - 1,663 0.03 Loss on debt extinguishment 32 - 1,408 0.02 800 0.01 1,895 0.03 Executive severance expense - - - - 238 - - - Acquisition expenses and related charges 6,308 0.10 - - 15,012 0.24 - - Tax effect of aforementioned items (2,381 ) (0.04 ) (645 ) (0.01 ) (3,421 ) (0.05 ) (1,163 ) (0.02 ) Tax reform and other discrete tax adjustments (31,339 ) (0.51 ) - - (31,339 ) (0.50 ) - - Adjusted earnings $ 22,250 $ 0.36 $ 24,213 $ 0.38 $ 86,166 $ 1.38 $ 121,538 $ 1.85 Weighted Average # of Diluted Shares O/S 61,567 63,701 62,598 65,762 Three Months Ended March 31, 2017 June 30, 2017 September 30, 2017 $ Per Share $ Per Share $ Per Share Net Income $ 20,173 $ 0.32 $ 22,945 $ 0.36 $ 18,947 0.30 Adjustments: Facility transactions 3 (1,665 ) (0.03 ) 18 - (5,165 ) (0.08 ) Loss on debt extinguishment 640 0.01 125 - 3 - Executive severance expense - - 238 - - Acquisition expenses and related charges - - - - 8,704 0.14 Tax effect of aforementioned items 369 0.01 (137 ) - (1,275 ) (0.02 ) Adjusted earnings $ 19,517 $ 0.31 $ 23,189 $ 0.37 $ 21,214 $ 0.34 Weighted Average # of Diluted Shares O/S 63,390 63,207 62,236 1 Operating EBITDA is defined as earnings before interest, taxes, depreciation, amortization, stock-based compensation, acquisition expenses and related charges, impairment of goodwill and other intangibles, and other non-operating income and expense. 2 Adjusted earnings and adjusted earnings per diluted share reflect adjustments for charges incurred in connection with acquistion expense and related costs, the losses attributable to the Company's extinguishment of debt, income or losses recognized on the sale and/or closure of former Company locations, one-time executive severance costs and impairment of goodwill or other intangible asset charges. 3 Facility transactions in 2016 and 2017 relate to gains and/or losses incurred for the sale or closure of the Company's retail branch locations.\nMedia Contact:\nDana Stelsel\nCorporate Communications Manager\n(765) 771-5766\ndana.stelsel@wabashnational.com\nInvestor Relations:\nJeff Taylor\nSenior Vice President, Chief Financial Officer\n(765) 771-5310\njeff.taylor@wabashnational.com\nSource:Wabash National Corporation", "external_links": ["https://www.globenewswire.com/Tracker?data=AUV1qct6gfUXctbJp8XHBNdZgt6q-VU9WkUfizkLMlaJcT8OV2Pp_Nb45Liw9JNPIBFQZ6U2irMrcOzNiFPOMrQhrjezsU5zDlM9cVKnABE=", "https://www.globenewswire.com/Tracker?data=uoCEPGtJ2yvBh7hZ6ZXMmH0G-TlyMKs8cX3N_4bON4OSERav4IGk1BHWbh_W8QVuXjB9fJ6oTAMCAabIaY-FtUearO6ysZc54EDDbIK01PNJ2WKs3ZPp9au2fvpfnlhi", "https://www.globenewswire.com/Tracker?data=AUV1qct6gfUXctbJp8XHBNdZgt6q-VU9WkUfizkLMlaaI4kIa5gc9--2bq1AaREoF-t6yKAR0FL0T-uTLIxjiza-jM0P5n1I5tfjDI-j7SA=", "https://www.globenewswire.com/Tracker?data=DECVrf550Z0qRL8HMiYv39v9A2T64_SpbFM38gLiwfLKj-TtxS7qa0KZboEWRYqxBtQaRHZaGTZoYa7UOMJSQARg9EKx_ULtKWAROfiI8HzbycwUDnHAGJmWaZU3rQuh", "https://www.globenewswire.com/Tracker?data=AUV1qct6gfUXctbJp8XHBNdZgt6q-VU9WkUfizkLMlaCSHk4HL0VSfktJLI9y7ZRfEyDKhwa4IGtql9uIx7DZhlf0bkBj74nEr7GYO0Eyo8=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/fba16e17-4fb8-4919-847b-fc6a913ae414", "https://www.globenewswire.com/Tracker?data=mCH4o1Ym--7EzO-xMzZ6Tj02XlOcyTNNKcnU09fDronq6h2MrqUJBgDwRtJIqTROG874scTpNGHYk2bPWN-QLNZTZsCZFnx8RlvSCsIhJww="], "published": "2018-01-31T00:30:00.000+02:00", "crawled": "2018-01-31T02:06:00.006+02:00", "highlightTitle": ""}