{"organizations": [], "uuid": "afdfe8fdab18c5d1eb6679dcb1a6b27d533304ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-903144236.jpeg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/10/north-and-south-korea-talks-moon-kim/", "country": "US", "domain_rank": 1196, "title": "South Korea's President Open to Holding Talks With Kim Jong Un | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.015, "site_type": "news", "published": "2018-01-10T02:54:00.000+02:00", "replies_count": 0, "uuid": "afdfe8fdab18c5d1eb6679dcb1a6b27d533304ad"}, "author": "Reuters", "url": "http://fortune.com/2018/01/10/north-and-south-korea-talks-moon-kim/", "ord_in_thread": 0, "title": "South Korea's President Open to Holding Talks With Kim Jong Un | Fortune", "locations": [], "entities": {"persons": [{"name": "kim jong u", "sentiment": "negative"}, {"name": "kim jong", "sentiment": "negative"}, {"name": "moon jae-in", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "kim hong-ji", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "koreas", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "pyongyang", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "presidential blue house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Korean peninsula South Korea's President Moon Jae-in Says He's Open to Holding Talks With Kim Jong Un South Korean President Moon Jae-in delivers a speech during his New Year news conference at the Presidential Blue House on January 10, 2018 in Seoul, South Korea. Kim Hong-ji - Pool/Getty Images By Reuters 12:54 AM EST \nSEOUL, Jan 10 (Reuters) – South Korean President Moon Jae-in credited U.S. President Donald Trump on Wednesday for helping to spark the first inter-Korean talks in more than two years, and warned that Pyongyang would face stronger sanctions if provocations continued. \nThe talks were held on Tuesday on the South Korean side of the demilitarised zone, which has divided the two Koreas since 1953, after a prolonged period of tension on the Korean peninsula over the North’s missile and nuclear programmes. \nNorth Korea ramped up its missile launches last year and also conducted its sixth and most powerful nuclear test, resulting in some of the strongest international sanctions yet. \nThe latest sanctions sought to drastically cut the North’s access to refined petroleum imports and earnings from workers abroad. Pyongyang called the steps an “act of war”. \nSeoul and Pyongyang agreed at Tuesday’s talks, the first since December 2015, to resolve all problems between them through dialogue and also to revive military consultations so that accidental conflict could be averted. \n“I think President Trump deserves big credit for bringing about the inter-Korean talks, I want to show my gratitude,” Moon told reporters at his New Year’s news conference. “It could be a resulting work of the U.S.-led sanctions and pressure.” \nTrump and North Korean leader Kim Jong Un exchanged threats and insults over the past year, raising fears of a new war on the peninsula. South Korea and the United States are technically still at war with the North after the 1950-53 Korean conflict ended with a truce, not a peace treaty. ‘Basic Stance’ \nWashington had raised concerns that the overtures by North Korea could drive a wedge between it and Seoul, but Moon said his government did not differ with the United States over how to respond to the threats posed by Pyongyang. \n“This initial round of talks is for the improvement of relations between North and South Korea. Our task going forward is to draw North Korea to talks aimed at the denuclearisation of the North,” Moon said. “(It’s) our basic stance that will never be given up.” \nMoon said he was open to meeting North Korea’s leader at any time to improve bilateral ties, and if the conditions were right and “certain achievements are guaranteed”. \n“The purpose of it shouldn’t be talks for the sake of talks,” he said. \nHowever, Pyongyang said it would not discuss its nuclear weapons with Seoul because they were only aimed at the United States, not its “brethren” in South Korea, nor Russia or China, showing that a diplomatic breakthrough remained far off. \nNorth Korea’s Rodong Sinmun newspaper said all problems would be resolved through efforts by the Korean people alone. \n“If the North and South abandon external forces and cooperate together, we will be able to fully solve all problems to match our people’s needs and our joint prosperity,” it said. \nWashington still welcomed Tuesday’s talks as a first step towards solving the North Korean nuclear crisis. The U.S. State Department said it would be interested in joining future talks, with the aim of denuclearising the North. \nThe United States, which still has 28,500 troops stationed in South Korea, initially responded coolly to the idea of inter-Korean meetings. Trump later called them “a good thing” and said he would be willing to speak to Kim. Large Olympics Delegation \nPyongyang also said it would send a large delegation to next month’s Winter Olympics in South Korea. \nWashington agreed with Seoul last week to postpone joint military exercises that Pyongyang denounces as rehearsals for invasion until after the Olympics. However, it also said the apparent North-South thaw had not altered the U.S. intelligence assessment of North Korea’s weapons programmes. \nThe United States has also warned that all options, including military, are on the table in dealing with the North. \n“We cannot say talks are the sole answer,” Moon said. “If North Korea engages in provocations again or does not show sincerity in resolving this issue, the international community will continue applying strong pressure and sanctions.” \nSeoul said on Tuesday it was prepared to offer financial assistance and lift some unilateral sanctions temporarily so North Koreans could attend the Olympics. North Korea said its delegation would include athletes, high-ranking officials, a cheering squad, art performers, reporters and spectators. \nHowever, Moon said on Wednesday South Korea had no plans for now to ease unilateral sanctions against North Korea, or to revive economic exchanges that could run foul of United Nations sanctions. \nFor more on the Korean Peninsula, see Fortune’s video: \nMoon also said his government would continue working towards recovering the honour and dignity of former “comfort women”, a euphemism for girls and women forced to work in Japan’s wartime brothels. \nHowever, he said historical issues should be separated from bilateral efforts with Japan to safeguard peace on the Korean peninsula. \n“It’s very important we keep a good relationship with Japan,” Moon said. \nOn Tuesday, South Korea said it would not seek to renegotiate a 2015 deal with Japan despite determining that the agreement was not enough to resolve the divisive issue, and called for Japan to take more steps to help the women. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-10T02:54:00.000+02:00", "crawled": "2018-01-10T10:40:08.007+02:00", "highlightTitle": ""}