{"organizations": [], "uuid": "8136e23fae1173cfd8ea745813212054b14c4e42", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-globus-medical-reports-preliminary-fourth-quarter-and-full-year-sales-results.html", "country": "US", "domain_rank": 767, "title": "Globus Medical Reports Preliminary Fourth Quarter and Full Year Sales Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T16:30:00.000+02:00", "replies_count": 0, "uuid": "8136e23fae1173cfd8ea745813212054b14c4e42"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-globus-medical-reports-preliminary-fourth-quarter-and-full-year-sales-results.html", "ord_in_thread": 0, "title": "Globus Medical Reports Preliminary Fourth Quarter and Full Year Sales Results", "locations": [], "entities": {"persons": [{"name": "dave demski", "sentiment": "none"}], "locations": [{"name": "pa.", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "globus medical", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "globus medical, inc.", "sentiment": "neutral"}, {"name": "alphatec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AUDUBON, Pa., Jan. 09, 2018 (GLOBE NEWSWIRE) -- Globus Medical, Inc. (NYSE:GMED), a leading musculoskeletal solutions company, today announced preliminary unaudited sales results for the fourth quarter and full year ending December 31, 2017. The company anticipates fourth quarter 2017 sales of approximately $175.5 million, an increase of 15.8% over the fourth quarter 2016. Full year 2017 estimated sales are expected to be approximately $635.4 million, an increase of 12.7% over the prior year.\n“We are very pleased to report record sales of $175.5 million for the fourth quarter, an increase of 15.8% over the fourth quarter of 2016,” said Dave Demski, Globus Medical Chief Executive Officer. “The growth in the quarter was 100% organic, as the anniversary of the Alphatec acquisition occurred in early September. US Spine sales continued the recent trend of mid-single-digit growth and our International business, led by Japan, showed significant improvement with 16.3% year-over-year growth. We are also encouraged by the strong robotic sales that contributed the rest of the growth in the fourth quarter. We are executing well in all aspects of our business and are excited by our prospects for 2018.”\n“The recently announced tax legislation will lower our marginal income tax rates, providing additional cash to our business,” said Dan Scavilla, Senior Vice President and Chief Financial Officer, “We have made the decision to reinvest a portion of the anticipated savings by increasing our spending on Emerging Technologies by approximately $14 million in 2018, investing for long-term growth while still providing a meaningful lift in EPS to our shareholders.”\nThe company established full year 2018 guidance of $690 million in sales and fully diluted non-GAAP earnings per share of $1.50. This EPS guidance assumes a full year benefit of tax reform, renewed suspension of the medical device tax and increased investment in Emerging Technologies.\nThese preliminary results are unaudited and are based on management’s initial analysis of operations for the periods ended December 31, 2017, and are therefore subject to change. The company expects to announce its fourth quarter and full year 2017 financial and operating results in late February.\nAbout Globus Medical, Inc.\nGlobus Medical, Inc. is a leading musculoskeletal solutions company based in Audubon, PA. The company was founded in 2003 by an experienced team of professionals with a shared vision to create products that enable surgeons to promote healing in patients with musculoskeletal disorders.\nNon-GAAP Financial Measures\nTo supplement our financial statements prepared in accordance with U.S. generally accepted accounting principles (“U.S. GAAP”), management uses certain non-GAAP financial measures. For example, non-GAAP adjusted EBITDA, which represents net income before interest income, net and other non-operating expenses, provision for income taxes, depreciation and amortization, stock-based compensation, provision for litigation, and acquisition related costs, is useful as an additional measure of operating performance, and particularly as a measure of comparative operating performance from period to period, as it is reflective of changes in pricing decisions, cost controls and other factors that affect operating performance, and it removes the effect of our capital structure, asset base, income taxes and interest income and expense. Provision for litigation represents costs incurred for litigation settlements or unfavorable verdicts when the loss is known or considered probable and the amount can be reasonably estimated, or in the case of a favorable settlement, when income is realized. Acquisition related costs represents the change in fair value of business-acquisition-related contingent consideration; costs related to integrating recently acquired businesses including but not limited to costs to exit or convert contractual obligations, severance, and information system conversion; and specific costs related to the consummation of the acquisition process such as banker fees, legal fees, and other acquisition-related professional fees. Our management also uses non-GAAP adjusted EBITDA for planning purposes, including the preparation of our annual operating budget and financial projections.\nIn addition, for the period ended December 31, 2017 and for other comparative periods, we are presenting non-GAAP net income and non-GAAP diluted earnings per share, which represent net income and diluted earnings per share excluding the provision for litigation, amortization of intangibles, acquisition related costs and the tax effects of such adjustments. The tax impact of these non-GAAP adjustments is calculated based on the consolidated effective tax rate on a GAAP basis, applied to the non-GAAP adjustments, unless the underlying item has a materially different tax treatment, in which case the estimated tax rate applicable to the adjustment is used. We believe these non-GAAP measures are also useful indicators of our operating performance, and particularly as additional measures of comparative operating performance from period to period as they remove the effects of litigation, amortization of intangibles, acquisition related costs, and the tax effects of such adjustments, which we believe are not reflective of underlying business trends. Additionally, for the periods ended December 31, 2017 and for other comparative periods, we also present the non-GAAP measure of free cash flow, which represents the net cash provided by operating activities, adjusted for the impact of restricted cash, less the cash impact of purchases of property and equipment. We believe that this financial measure provides meaningful information for evaluating our overall liquidity for comparative periods as it facilitates an assessment of funds available to satisfy current and future obligations and fund acquisitions. Finally, we utilize the non-GAAP measure of constant currency sales growth, which is calculated by translating current year sales at the same average exchange rates in effect during the applicable prior year period. We believe constant currency sales growth provides insight to the comparative increase or decrease in period sales, in dollar and percentage terms, excluding the effects of fluctuations in foreign currency exchange rates.\nNon-GAAP adjusted EBITDA, non-GAAP net income, non-GAAP diluted earnings per share, free cash flow and constant currency sales growth are not calculated in conformity with U.S. GAAP within the meaning of Item 10(e) of Regulation S-K. Non-GAAP financial measures have limitations as analytical tools and should not be considered in isolation or as a substitute for financial measures prepared in accordance with U.S. GAAP. These measures do not include certain expenses that may be necessary to evaluate our liquidity or operating results. Our definitions of non-GAAP adjusted EBITDA, non-GAAP net income, non-GAAP diluted earnings per share, free cash flow and constant currency sales growth may differ from that of oth", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/187ffdca-bffb-4917-95a4-744c5d5e4b5f"], "published": "2018-01-09T16:30:00.000+02:00", "crawled": "2018-01-09T17:40:18.040+02:00", "highlightTitle": ""}