{"organizations": [], "uuid": "6d27c15ffb8812ec069627e42a224c8ed841702d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/05/31/104502262-GettyImages-127980842.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/18/apple-google-and-microsoft-top-list-of-the-most-innovative-companies-in-2018.html", "country": "US", "domain_rank": 767, "title": "Apple, Google and Microsoft top list of the most innovative companies in 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T18:34:00.000+02:00", "replies_count": 0, "uuid": "6d27c15ffb8812ec069627e42a224c8ed841702d"}, "author": "Ruth Umoh", "url": "https://www.cnbc.com/2018/01/18/apple-google-and-microsoft-top-list-of-the-most-innovative-companies-in-2018.html", "ord_in_thread": 0, "title": "Apple, Google and Microsoft top list of the most innovative companies in 2018", "locations": [], "entities": {"persons": [{"name": "tesla", "sentiment": "none"}, {"name": "airbnb", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "positive"}, {"name": "google", "sentiment": "positive"}, {"name": "microsoft", "sentiment": "positive"}, {"name": "netflix", "sentiment": "none"}, {"name": "tesla", "sentiment": "none"}, {"name": "spacex", "sentiment": "none"}, {"name": "alibaba", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "boston consulting group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "For the second consecutive year, Apple and Google topped the list of the 50 most innovative companies, according to the Boston Consulting Group .\nThe companies at the top of the list shifted just slightly from last year . Microsoft jumped up by one spot to take third place, while electric-car company Tesla fell from No. 3 to sixth place. Retail giant Amazon climbed from fifth place to fourth place, and Netflix , which made the top 10 in 2017, fell to No. 13.\nIn the most recent report, two new companies managed to push their way into the top 10: ride-hailing app Uber and e-commerce site Alibaba .\nGeographically, North America produced the most innovative companies, with 27 featured on the list. Europe produced 16 entrants, up from 10 last year.\nThe travel and transportation sector also expanded its showing on the 2018 list, with companies such as Uber, Tesla , SpaceX and Airbnb included.\nThe firm found that the most innovative companies have been fueled by digital technologies. For example, they prioritize mobile products, digital design, big data and also quickly adapt to technological advances. They also tend to develop and test new products faster and more cheaply than other companies.\nAccording to the research, the biggest difference between the most innovative companies and the companies that appear much lower on the list is how heavily they have incorporated these digital processes into their businesses.\n\"While 79 percent of strong innovators reported that they had properly digitized innovation processes, only 29 percent of weak innovators make the same claim,\" the study reports.\nDrew Angerer | Getty Images Last year, the most innovative companies were those that brought in new ideas from outside sources such as social media and had open and collaborative work environments.\nFinally, the research notes that business leaders at the most innovative companies do five key things that set them apart from their competition:\n1. Leaders dedicate resources: They realize the importance of digital and invest accordingly.\n2. Leaders invest in speed: They test ideas earlier and launch products quickly.\n3. Leaders take smart risks: They make big bets that are high-risk but also high-reward.\n4. Leaders invest in data: They mine and analyze data to glean insight for their products.\n5. Leaders secure top talent: They acquire and develop talent across the company.\nLike this story? Like CNBC Make It on Facebook .\nSee also:\n3 reasons millennials want to work for Google and Amazon so badly\n75% of senior execs say they'd leave their company for one that values diversity\nMany of your employees probably don't like their jobs\nshow chapters This tech start-up lets you try out for your job, before you get an offer 3:50 PM ET Thu, 6 Oct 2016 | 01:09", "external_links": [], "published": "2018-01-18T18:34:00.000+02:00", "crawled": "2018-01-18T18:47:08.010+02:00", "highlightTitle": ""}