{"organizations": [], "uuid": "dc8992fdf533d30b441eedde91cc8a280d208836", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-julie-boland-appointed-ey-vice-chair-central-region-managing-partner.html", "country": "US", "domain_rank": 767, "title": "Julie Boland appointed EY Vice Chair, Central Region Managing Partner", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.006, "site_type": "news", "published": "2018-01-17T22:35:00.000+02:00", "replies_count": 0, "uuid": "dc8992fdf533d30b441eedde91cc8a280d208836"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-julie-boland-appointed-ey-vice-chair-central-region-managing-partner.html", "ord_in_thread": 0, "title": "Julie Boland appointed EY Vice Chair, Central Region Managing Partner", "locations": [], "entities": {"persons": [{"name": "julie boland", "sentiment": "negative"}, {"name": "julie", "sentiment": "none"}, {"name": "kelly grier", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}, {"name": "cleveland", "sentiment": "none"}, {"name": "ey us", "sentiment": "none"}], "organizations": [{"name": "us executive committee", "sentiment": "none"}, {"name": "americas operating executive", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 17, 2018 /PRNewswire/ -- EY announces the appointment of Julie Boland to EY Vice Chair and Central Region Managing Partner, succeeding Kelly Grier, EY US Chairman and Managing Partner and EY Americas Area Managing Partner-Elect, effective 1 July 2018.\nIn her new role, Julie will be responsible for driving market leadership, developing and retaining talent, creating high-performing teams, and providing exceptional client service for a regional practice of 10,000 professionals spanning 15 states and 17 offices. She will also serve as a Senior Advisory Partner on several of the region's largest clients and join the US Executive Committee and the Americas Operating Executive.\nKelly Grier says:\n\"The Central Region is one of EY's largest regions and its strong position comes from our purpose of building a better working world. Julie has a passion for our people and culture having led Cleveland, the region's second largest office, with outstanding growth, people engagement and recruiting results. During her 30-year career, she has served a variety of EY clients and is known for quality and integrity. Julie knows our region well and has the passion, mindset and experience to move it forward.\"\nSince 2014, Julie has served as EY's Cleveland Office Managing Partner. She is the current Presiding Partner for EY's Central Region Partner Forum and a member of the US Partner/Principal Council, Americas Advisory Council, Global Governance Council and Americas Inclusiveness Advisory Council.\nJulie shared that she is honored to succeed Kelly. \"EY's Central Region is known for its innovation, exceptional client service and its best-in-class execution of the talent agenda and people engagement. Under Kelly's leadership, EY's Central Region has built impressive momentum that I look forward to building upon.\"\nJulie began her career as a CPA in the audit practice of another Big Four firm. She then worked at J.P. Morgan and Goldman Sachs leading up to her CFO roles at publicly- and privately-held companies. Throughout her career, she's worked in offices in London, New York, Chicago and Cleveland.\nCurrent and past affiliations include current Vice Chair of Destination Cleveland, member of the Greater Cleveland Partnership Board, immediate past chair of the Achievement Centers for Children, Treasurer of the United Way of Greater Cleveland, and founding member of In Counsel with Women. A graduate of the Leadership Cleveland Class of 2006, Julie's been recognized as a YWCA Woman of Achievement and Crain's 40 under 40.\nJulie holds an MBA in finance and statistics from the University of Chicago, Booth School of Business, and a B.S. in business and accounting from the University of Vermont. She's a native of northeast Ohio.\nNotes to Editors\nAbout EY\nEY is a global leader in assurance, tax, transaction and advisory services. The insights and quality services we deliver help build trust and confidence in the capital markets and in economies the world over. We develop outstanding leaders who team to deliver on our promises to all of our stakeholders. In so doing, we play a critical role in building a better working world for our people, for our clients and for our communities.\nEY refers to the global organization, and may refer to one or more, of the member firms of Ernst & Young Global Limited, each of which is a separate legal entity. Ernst & Young Global Limited, a UK company limited by guarantee, does not provide services to clients. For more information about our organization, please visit ey.com .\nThis news release has been issued by EYGM Limited, a member of the global EY organization that also does not provide any services to clients.\nView original content with multimedia: http://www.prnewswire.com/news-releases/julie-boland-appointed-ey-vice-chair-central-region-managing-partner-300584121.html\nSOURCE EY", "external_links": ["http://www.prnewswire.com/news-releases/julie-boland-appointed-ey-vice-chair-central-region-managing-partner-300584121.html"], "published": "2018-01-17T22:35:00.000+02:00", "crawled": "2018-01-17T23:53:49.006+02:00", "highlightTitle": ""}