{"organizations": [], "uuid": "8abd7a183b05167f2a7e14f56d0a3c80dc26fa20", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180117.html", "section_title": "Archive News &amp; Video for Wednesday, 17 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-colombia-landrights/undecided-land-claims-in-colombia-put-slave-descendants-at-risk-study-says-idUSKBN1F632C", "country": "US", "domain_rank": 408, "title": "Undecided land claims in Colombia put slave descendants at risk, study says", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T06:38:00.000+02:00", "replies_count": 0, "uuid": "8abd7a183b05167f2a7e14f56d0a3c80dc26fa20"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-colombia-landrights/undecided-land-claims-in-colombia-put-slave-descendants-at-risk-study-says-idUSKBN1F632C", "ord_in_thread": 0, "title": "Undecided land claims in Colombia put slave descendants at risk, study says", "locations": [], "entities": {"persons": [{"name": "herrera", "sentiment": "none"}, {"name": "johana herrera", "sentiment": "none"}], "locations": [{"name": "colombia", "sentiment": "none"}, {"name": "bogota", "sentiment": "none"}, {"name": "bogota", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "javeriana university", "sentiment": "none"}, {"name": "ethnic and farmers’ territory observatory", "sentiment": "none"}, {"name": "otec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOGOTA (Thomson Reuters Foundation) - Hundreds of land claims by Afro-Colombians sitting unresolved, some for over a decade, put those communities in danger of being driven off their land by business interests, according to new research.\nEfforts by the government to award collective land titles have largely overlooked claims by Colombians of African descent whose families arrived as slaves, said researchers at Javeriana University in Bogota.\nWithout formal titles of ownership, Afro-Colombian communities are at acute risk of displacement and have little say over use of their land, researchers said.\nSome 271 Afro-Colombian collective land claims await a decision by government authorities, leaving about two million hectares in limbo, they said.\n“The state has been very slow in responding to collective land claims, some dating back more than 15 years,” said Johana Herrera, head of the university’s Ethnic and Farmers’ Territory Observatory (OTEC).\n“Recognizing their collective land titles is vital for their survival and the conservation of ecosystems,” Herrera, who coordinated the research, told the Thomson Reuters Foundation.\nAfro-Colombians make up nearly 11 percent of the country’s population of 48 million, and many live in resource-rich and rainforest regions along the Pacific and Caribbean coasts.\n“Many of the collective land claims are in areas where there is big interest from mining, energy and agricultural companies,” Herrera said.\nThe government has made big strides in awarding titles under a land restitution program started in 2011, and hundreds of thousands of hectares stolen or abandoned during Colombia’s half-century civil war have been handed back to rightful owners.\nBut much of the land has gone to individual farmers and landowners, not to collective claims by Afro-Colombians, Herrera said.\nIn the past year, formal land titles were awarded to more than 32,000 out of nearly 46,500 claims lodged in 2017, according to government figures.\nThe government said it aims to process up to 50,000 more claims in 2018.\nIllicit gold mining, drug trafficking, landmines and illegal armed groups in some areas can make land tenure difficult to sort out, the government has said.\nUnder the 2016 peace accord between rebels with the Revolutionary Armed Forces of Colombia (FARC) and the government, landless and displaced farmers are entitled to credit and farmland through a land bank that aims to redistribute millions of hectares over the next decade.\nReporting by Anastasia Moloney, @anastasiabogota, Editing by Ellen Wulfhorst.; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T06:38:00.000+02:00", "crawled": "2018-01-18T16:14:16.054+02:00", "highlightTitle": ""}