{"organizations": [], "uuid": "b84c0de8d2b6a062dfe9dc1dca08603529f2a142", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-delek-us-holdings-to-host-fourth-quarter-2017-conference-call-on-february-27.html", "country": "US", "domain_rank": 767, "title": "Delek US Holdings to Host Fourth Quarter 2017 Conference Call on February 27", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T02:45:00.000+02:00", "replies_count": 0, "uuid": "b84c0de8d2b6a062dfe9dc1dca08603529f2a142"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-delek-us-holdings-to-host-fourth-quarter-2017-conference-call-on-february-27.html", "ord_in_thread": 0, "title": "Delek US Holdings to Host Fourth Quarter 2017 Conference Call on February 27", "locations": [], "entities": {"persons": [], "locations": [{"name": "tenn.", "sentiment": "none"}, {"name": "brentwood", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "delek us holdings", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "delek us holdings, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "delek logistics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BRENTWOOD, Tenn., Jan. 18, 2018 (GLOBE NEWSWIRE) -- Delek US Holdings, Inc. (NYSE:DK) (“Delek US”) today announced that the Company intends to issue a press release summarizing fourth quarter and year end 2017 results after the U.S. stock market closes on Monday, February 26, 2018. A conference call to discuss fourth quarter 2017 results is scheduled to begin at 8:30 a.m. CT (9:30 a.m. ET) on Tuesday, February 27, 2018.\nThe live broadcast of this conference call will be available online by going to www.DelekUS.com and clicking on the investor relations section of the website. The online replay will be available on the website for 90 days. A telephonic replay of the call will also be available through May 27, 2018. The replay can be accessed by dialing (855) 859-2056 with the conference ID number 8499603.\nInvestors may also wish to listen to Delek Logistics’ (NYSE:DKL) fourth quarter and year end 2017 earnings conference call on Tuesday, February 27, 2018 and review Delek Logistics’ earnings press release. Market trends and information disclosed by Delek Logistics may be relevant to the logistics segment reported by Delek US. Investors can find information related to Delek Logistics and the timing of its earnings release online by going to www.DelekLogistics.com .\nAbout Delek US Holdings, Inc.\nDelek US Holdings, Inc. is a diversified downstream energy company with assets in petroleum refining, logistics, asphalt, renewable fuels and convenience store retailing. The refining assets consist of refineries operated in Tyler and Big Spring, Texas, El Dorado, Arkansas and Krotz Springs, Louisiana with a combined nameplate crude throughput capacity of 302,000 barrels per day. Delek US Holdings, through its subsidiaries, owns 100 percent of the general partner and 81.6 percent of the limited partner interest in Alon USA Partners, LP (NYSE:ALDW), which owns the crude oil refinery in Big Spring, Texas, with a crude oil throughput capacity of 73,000 barrels per day and an integrated wholesale marketing business.\nThe logistics operations primarily consist of Delek Logistics Partners, LP. Delek US Holdings, Inc. and its affiliates also own approximately 63 percent (including the 2 percent general partner interest) of Delek Logistics Partners, LP. Delek Logistics Partners, LP (NYSE:DKL) is a growth-oriented master limited partnership focused on owning and operating midstream energy infrastructure assets.\nThe asphalt operations consist of owned or operated asphalt terminals serving markets from Tennessee to the west coast through a combination of non-blended asphalt purchased from third parties and produced at the Big Spring, Texas and El Dorado, Arkansas refineries. The renewables operations consist of plants in Texas and Arkansas that produce biodiesel fuel and a renewable diesel facility in California.\nThe convenience store retail business is the largest 7-Eleven licensee in the United States and operates approximately 300 convenience stores in central and west Texas and New Mexico.\nU.S. Investor / Media Relations Contact:\nKeith Johnson\nVice President of Investor Relations\nDelek US Holdings, Inc.\n615-435-1366\nSource:Delek US Holdings, Inc", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/868a1c5d-8c22-44e4-abdf-3dc8125a4c4d"], "published": "2018-01-19T02:45:00.000+02:00", "crawled": "2018-01-19T05:17:53.030+02:00", "highlightTitle": ""}