{"organizations": [], "uuid": "f6eca3abc57a1a26427117053a78ac3ec83ba9dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219483992&w=1200&r=LYNXMPEE04041", "site_section": "https://www.reuters.com/breakingviews", "section_title": "Breakingviews | Reuters", "url": "https://www.reuters.com/article/us-china-economy-debt-breakingviews/breakingviews-beijing-will-allow-a-local-government-default-idUSKBN1EU08Y", "country": "US", "domain_rank": 408, "title": "Beijing will allow a local government default", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T11:02:00.000+02:00", "replies_count": 0, "uuid": "f6eca3abc57a1a26427117053a78ac3ec83ba9dd"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-china-economy-debt-breakingviews/breakingviews-beijing-will-allow-a-local-government-default-idUSKBN1EU08Y", "ord_in_thread": 0, "title": "Beijing will allow a local government default", "locations": [], "entities": {"persons": [{"name": "fitch", "sentiment": "none"}], "locations": [{"name": "beijing", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "lgfv jiangsu newheadline development", "sentiment": "none"}, {"name": "lehman brothers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON Investors in Chinese bonds should prepare for a nasty surprise in 2018. Beijing’s tolerance for off-balance sheet municipal borrowing has faded as debt levels have exploded. In the name of repricing risk, regulators will allow the once-unthinkable: a big default by a local government financing vehicle.\nLGFVs became popular in China during the global financial crisis. The budget law prevented localities from going directly into debt, but Beijing needed to stimulate quickly. With the connivance of the central government, regional officials created thousands of arms-length entities that could raise money to goose growth.\nMore than nine years have passed since Lehman Brothers collapsed, but these structures are still in business. They have around $600 billion worth of bonds outstanding issued domestically over the last two years, Fitch estimates, equivalent to 5 percent of GDP, but they keep running into trouble. In April, troubled LGFV Jiangsu NewHeadline Development became the first to be downgraded by an international ratings agency.\nIn 2014 Beijing tried to address the situation by revising the budget law and launching a municipal bond market. High-yielding LGFV securities were to be swapped for lower-yielding munis, easing debt service costs and improving transparency. Local government guarantees would be stripped from LGFV debt. Lacking official backing, the vehicles were supposed to roll into the sunset.\nAs the economy started wobbling in 2014 and into 2015, however, officials softened. LGFV liabilities grew 25 percent in 2015 and the pace remained above 20 percent going into 2016, the Financial Times reported, citing a confidential World Bank study. They’ve increasingly tapped offshore markets too. LGFV offshore bond issuance doubled to $12 billion in 2016, Reuters IFR reported, citing Moody’s data.\nBut in 2017 debt leapt back into focus, and the government resumed its hard line. In May, six financial regulators joined hands to order local governments to stop issuing “illegal guarantees.” In December a central bank official publicly floated the idea of a local government default. The natural next step is allowing a rickety entity collapse and letting everyone watch investors lose money.\nChina’s nervous bond market, where yields are already under pressure due to a campaign against shadow banking, will sell off on the news. While Beijing is unlikely to tolerate an onshore rout, the same won’t be true offshore.\n ", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-05T11:02:00.000+02:00", "crawled": "2018-01-05T09:50:21.018+02:00", "highlightTitle": ""}