{"organizations": [], "uuid": "4aab19db54e8736da55e39f37bda6ea625e33732", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-wowio-inc-attacks-housing-crisis-in-california.html", "country": "US", "domain_rank": 767, "title": "Wowio, Inc. Attacks Housing Crisis in California", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.057, "site_type": "news", "published": "2018-01-30T14:35:00.000+02:00", "replies_count": 0, "uuid": "4aab19db54e8736da55e39f37bda6ea625e33732"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-wowio-inc-attacks-housing-crisis-in-california.html", "ord_in_thread": 0, "title": "Wowio, Inc. Attacks Housing Crisis in California", "locations": [], "entities": {"persons": [{"name": "wowio", "sentiment": "none"}, {"name": "tony anish", "sentiment": "none"}], "locations": [{"name": "california wowio", "sentiment": "none"}, {"name": "avenal", "sentiment": "none"}, {"name": "california costa mesa", "sentiment": "none"}, {"name": "ca", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}], "organizations": [{"name": "attacks housing crisis", "sentiment": "negative"}, {"name": "wowio, inc", "sentiment": "neutral"}, {"name": "wowio, inc.", "sentiment": "none"}, {"name": "williams", "sentiment": "none"}, {"name": "wowio property development, inc", "sentiment": "none"}, {"name": "wswire", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Wowio agrees terms to Acquire Property in Avenal, California\nCosta Mesa, CA, Jan. 30, 2018 (GLOBE NEWSWIRE) -- Wowio, Inc. (OTC Pink: WWIO) “Wowio, WWIO or The Company” has agreed terms to acquire land in Avenal that is ready for building. The plan is to build out phase 1 by early next year. Plans have been approved and the final preliminary work to get the land ready for building will be completed in the next two to three months. The plan is to have the first five houses ready for sale in the third quarter of 2018. These low cost houses will sell for approximately $240,000 with profits of approximately 20% per home.\nWowio Property Development, Inc, has been expressly formed to manage the construction of properties that will be acquired by Wowio.\nTony Anish, CEO of Wowio, Inc., stated, “We are excited as we continue to execute our growth plan. We are currently growing our business in two areas, our restaurant, tourism, hospitality and entertainment division and our real estate division. We anticipate closing our first restaurant transaction in Williams, Arizona very shortly and we hope to start building in Avenal by the second quarter of this year. We are still working on the legal issues relating to Huron but hope to resolve those outstanding issues very shortly.”\nThe Company believes there is a large market opportunity in developing lower priced homes in Southern California.\nNumbers tell the story of California's housing crisis.\n* according to the state realtors association, 75 percent of Southern Californians can't afford to buy a home,\n* 16 of the 25 least affordable communities in the US are in California, according to 24/7 Wall Street.\n* Officials this year declared a homeless emergency in San Francisco, Los Angeles, San Diego and Orange counties.\n* 56 percent of state voters say they may have to move because of a lack of affordable housing. One in four say they will relocate out of state, according to University of California Berkeley's Institute of Governmental Studies.\n* A median price home in the Golden State is $561,000, according to the realtors association. A household needs to earn $115,000 a year to afford a home at that price, assuming a 20 percent down payment. Yet, two thirds of Californians earn less than $80,000, according to the U.S. Census Bureau.\n* Home prices in California are twice the national average, and 70 percent can't afford to buy a home, according to state figures.\n*1 in 10 residents are considering leaving because they can't afford a place to live, according to a state legislative study, while US Census figures show 2 million residents, 25 and older, have already left the state since 2010.\nAbout Wowio, Inc.\nWOWIO, Inc. has, historically, operated a digital media and technology development company with a patented process and a proprietary mobile ad-delivery platform that planned to disrupt the eBook distribution landscape by exploiting a previously untapped marketplace: ad-supported eBooks.\nHowever, with the introduction of the new management team, WWIO will be a holding company supporting a number of investments in entertainment, restaurants, tourism, hospitality and other businesses including homebuilding in Northern California and the real estate development in Arizona.\nSafe Harbor and Informational Statement\nThis press release may contain forward-looking information within the meaning of Section 21E of the Security Exchange Act of 1934, as amended (the Exchange Act), including all statements that are not statement of historical fact regarding the intent, belief or current expectations of the company, its directors or its officers with respect to, among other things: (i) the company's financing plans; (ii) trends affecting the company's financial conditions or results of operations; (iii): the company's growth strategy and operating strategy; and (iv) the declaration and payment of dividends.\nThe words \"may\", \"would\", \"will\", \"expect\", \"estimate\", \"anticipate\", \"believe\", \"intend\", and similar expressions and variations thereof are intended to identify . Investors are cautioned that any such forward-looking statement are not a guarantee of future of future performance and involve risks and uncertainties, many of which are beyond the company's ability to control, and that actual results may differ materially from those projected in the as a result of various factors including the risk disclosed in the company's statements and reports filed with the OTC Markets. The Company claims the safe harbor provided by Section 21E(c) of the Exchange Act for all .\nFor more information contact Anthony L. Anish info@wowioinc.com www.wowioinc.com twitter: @WOWIOinc\nSource:Wowio, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/b6d6517c-e9fe-4a36-b61c-706e866af3de"], "published": "2018-01-30T14:35:00.000+02:00", "crawled": "2018-01-30T15:36:58.000+02:00", "highlightTitle": ""}