{"organizations": [], "uuid": "dfb7637547ddf9ec959c73501d814607478ecb7a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-wuxi-biologics-announces-formation-of-scientific-advisory-board.html", "country": "US", "domain_rank": 767, "title": "WuXi Biologics Announces Formation of Scientific Advisory Board", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T12:05:00.000+02:00", "replies_count": 0, "uuid": "dfb7637547ddf9ec959c73501d814607478ecb7a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-wuxi-biologics-announces-formation-of-scientific-advisory-board.html", "ord_in_thread": 0, "title": "WuXi Biologics Announces Formation of Scientific Advisory Board", "locations": [], "entities": {"persons": [{"name": "ram sasisekharan", "sentiment": "none"}, {"name": "david d. ho", "sentiment": "none"}, {"name": "james larrick", "sentiment": "none"}, {"name": "peter g. schultz", "sentiment": "none"}], "locations": [{"name": "shanghai", "sentiment": "none"}, {"name": "hk", "sentiment": "none"}], "organizations": [{"name": "wuxi biologics announces formation of scientific advisory board", "sentiment": "negative"}, {"name": "wuxi biologics", "sentiment": "negative"}, {"name": "massachusetts institute of technology", "sentiment": "none"}, {"name": "sab", "sentiment": "none"}, {"name": "scientific advisory board", "sentiment": "none"}, {"name": "alfred h. caspary professor of biological engineering and health sciences & technology", "sentiment": "none"}, {"name": "scripps research institute", "sentiment": "none"}, {"name": "panorama research institute", "sentiment": "none"}, {"name": "california institute for translational research", "sentiment": "none"}, {"name": "rockefeller university", "sentiment": "none"}, {"name": "university of", "sentiment": "none"}, {"name": "aaron diamond aids research center", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHANGHAI, Jan. 24, 2018 /PRNewswire/ -- WuXi Biologics (2269.HK), a leading global open-access biologics technology platform company offering end-to-end solutions for biologics discovery, development and manufacturing, today announced the appointment of five internationally recognized scientists, entrepreneurs and visionary thinkers to its newly formed Scientific Advisory Board (SAB). The SAB includes: Peter G. Schultz, PhD (President of the Scripps Research Institute and the California Institute for Translational Research); James Larrick, MD and PhD (Founder, Managing Director, Scientific Director of Panorama Research Institute; Managing Director & Chief Medical Officer of Velocity Pharmaceutical Development); Ram Sasisekharan, PhD (Alfred H. Caspary Professor of Biological Engineering and Health Sciences & Technology at the Massachusetts Institute of Technology); David D. Ho, MD (Scientific Director and CEO, Aaron Diamond AIDS Research Center; and Irene Diamond Professor, the Rockefeller University) and Wei-Shou Hu, PhD (Distinguished McKnight University Professor at University of Minnesota).\nChaired by Dr. Schultz, the inaugural members represent a broad range of scientific disciplines in biologics research and development in the fields of synthetic biology, antibody therapeutics, protein engineering, analytical sciences, virology, vaccines, and cell culture bioprocessing and bioengineering. In addition, the SAB members are also thought leaders and entrepreneurs, collectively founding more than forty successful biotech companies.\nThe first SAB meeting was held on January 5, 2018 in San Diego. The SAB members thought highly of WuXi Biologics' achievements, business model, technology platforms, capabilities and capacities. \"I am excited about the capabilities WuXi Biologics is building and the impact this will have on biologics in the healthcare industry,\" said Dr. Peter G. Schultz. The members offered many insightful strategic, tactical, and technical suggestions at the meeting to help guide the future business strategies at WuXi Biologics.\n\"This SAB will help shape the technological and strategic direction of the company and build additional momentum for WuXi Biologics' quest to transform the way in which biologics are discovered, developed and manufactured,\" said Dr. Chris Chen, CEO of WuXi Biologics. \"The SAB will support WuXi Biologics' mission of becoming a technology leader and a trusted partner for biopharmaceutical companies worldwide to advance the science and technology of biologics development and ultimately benefiting patients worldwide.\"\nBrief biographies of the SAB members are listed below.\nPeter G. Schultz, PhD, SAB Chair\nDr. Peter Schultz is President of The Scripps Research Institute and The California Institute for Translational Research.\nDr. Schultz received his PhD from California Institute of Technologies and has a long distinguished academic career as professors of University of California at Berkeley and Scripps. Dr. Schultz founded the Genomics Institute of the Novartis Research Foundation and the California Institute for Biomedical Research, is a founder of Affymax Research Institute, Syrrx, Kalypsys, Phenomix, Symyx Therapeutics, Ilypsa, Ambrx, Ardelyx, and Wildcat Technologies, and pioneers in the application of diversity based approaches to problems in chemistry, materials science and medicine. Dr. Schultz received numerous awards and has co-authored over 600 scientific publications. Dr. Schultz is a member of the National Academy of Sciences and the National Academy of Medicine.\nJames Larrick, MD/PhD\nDr. James Larrick is Founder, Managing Director, Scientific Director of Panorama Research Institute and Managing Director & Chief Medical Officer of Velocity Pharmaceutical Development.\nDr. Larrick holds MD and PhD degrees from Duke University School of Medicine and is a pioneer of the biotechnology industry. He is an outstanding biomedical entrepreneur with an international reputation in cytokines, therapeutic antibodies, molecular biology, and pharmaceutical drug development. He has written or coauthored eight books, over 250 papers/chapters, over 30 patents, and served on the editorial boards of six journals. In 1991, Jim founded the Panorama Institute of Molecular Medicine (PRI) which has incubated more than 20 life science projects, leading to his co-founding more than a dozen companies. To date, PRI-initiated projects and/or companies have led to five IPOs and numerous successful acquisitions.\nRam Sasisekharan, PhD\nDr. Ram Sasisekharan is an Alfred H. Caspary Professor of Biological Engineering and Health Sciences & Technology in Massachusetts Institute of Technology.\nDr. Sasisekharan received his PhD in Medical Sciences from Harvard Medical School and has been a professor of Biological Engineering at MIT since 1996 and served as the Director of the Harvard-MIT Division of Health Sciences & Technology from 2008-2012. Dr. Sasisekharan's Laboratory employs multidisciplinary strategies to develop and integrate technologies to further study complex biological systems important to a host of disease processes. He has co-authored 5 books, over 210 papers/chapters, over 85 patents, and served on the editorial boards of 4 journals. Technologies developed in the Sasisekharan Lab have resulted in the founding of multiple local biotechnology companies, including Momenta Pharmaceuticals, Cerulean, Visterra and Tychan. Dr. Sasisekharan has received numerous awards, including National Institutes of Health Merit Award in 2010, American Institute for Medical and Biological Engineering (AIMBE) Fellow in 2009, and Fellow of the U.S. National Academy of Inventors in 2014 to name a few.\nDavid D. Ho, MD\nDr. David D. Ho is Scientific Director and CEO of the Aaron Diamond AIDS Research Center, as well as the Irene Diamond Professor at the Rockefeller University.\nDr. Ho received his MD from Harvard Medical School in 1978 and has a long distinguished academic career at Massachusetts General Hospital and Harvard Medical School in 1985-1986; UCLA School of Medicine in 1986-1990; and NYU School of Medicine in 1990-1996. Since 1990, Dr. Ho has been Scientific Director and CEO of Aaron Diamond AIDS Research Center; he is also Professor and Physician at the Rockefeller University. David has also been a reviewer, a member of editorial board, and/or editor of many scientific journals. Dr. Ho received over 40 awards and honors, including Man of the Year, Time Magazine in 1996; Fellow, American Academy of Arts and Sciences; Member of National Academy of Medicine; Member of Chinese Academy of Engineering; 14 honorary doctorates; and the US Presidential Medal.\nWei-Shou Hu, PhD\nDr. Wei-Shou Hu is a Distinguished McKnight University Professor at University of Minnesota.\nDr. Hu received his PhD in Biochemical Engineering from Massachusetts Institute of Technology. He pioneered the bioprocess technology field and initiated the Engineering Foundation Conference on Cell Culture Engineering twenty-eight years ago that has had a great impact on the biotech industry. Dr. Hu's current research efforts emphasize exploiting genomics and proteomics in advancing bioprocess technology, and applying systems analysis to generate new understanding of metabolic and gene expression regulation. Over the past quarter century, Dr. Hu helped train thousands of scientists and engineers for pharmaceutical and biotech industry around the world and authored several widely used textbooks on bioprocess engineering. He is a recipient of numerous awards for his contributions in the biochemical engineering field.\nAbout WuXi Biologics\nWuXi Biologics, a Hong Kong-listed company, is the only open-access biologics technology platform in the world offering end-to-end solutions to empower organizations to discover, develop and manufacture biologics from concept to commercial manufacturing. Our company history and achievements demonstrate our commitment to providing a truly ONE-stop service offering and value proposition to our global clients. For more information on WuXi Biologics, please visit www.wuxibiologics.com .\nView original content: http://www.prnewswire.com/news-releases/wuxi-biologics-announces-formation-of-scientific-advisory-board-300587344.html\nSOURCE WuXi Biologics", "external_links": ["http://www.wuxibiologics.com/", "http://www.prnewswire.com/news-releases/wuxi-biologics-announces-formation-of-scientific-advisory-board-300587344.html"], "published": "2018-01-24T12:05:00.000+02:00", "crawled": "2018-01-24T11:31:43.017+02:00", "highlightTitle": ""}