{"organizations": [], "uuid": "67934ba6fcb727279ae3ecd842c95715f8150777", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 1}, "linkedin": {"shares": 38}, "facebook": {"likes": 407, "shares": 407, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222991368&w=1200&r=LYNXMPEE0H0PK", "site_section": "https://www.reuters.com/news/sports", "section_title": "Sports News, Highlights &amp; Coverage | Reuters.com", "url": "https://www.reuters.com/article/us-olympics-2018-northkorea/pyongyang-olympics-backlash-reveals-changing-attitudes-in-south-korea-idUSKBN1F716G", "country": "US", "domain_rank": 408, "title": "'Pyongyang Olympics?' Backlash reveals changing attitudes in South Korea", "performance_score": 4, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.024, "site_type": "news", "published": "2018-01-18T18:19:00.000+02:00", "replies_count": 0, "uuid": "67934ba6fcb727279ae3ecd842c95715f8150777"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-olympics-2018-northkorea/pyongyang-olympics-backlash-reveals-changing-attitudes-in-south-korea-idUSKBN1F716G", "ord_in_thread": 0, "title": "'Pyongyang Olympics?' Backlash reveals changing attitudes in South Korea", "locations": [], "entities": {"persons": [{"name": "moon jae-in", "sentiment": "none"}, {"name": "moon", "sentiment": "none"}], "locations": [{"name": "south korea seoul", "sentiment": "none"}, {"name": "pyongyang", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "koreas", "sentiment": "none"}, {"name": "south", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEOUL (Reuters) - An agreement between South and North Korea to march under a unity flag and field a joint ice hockey team at next month’s Olympics was met by sharp criticism from many in the South on Thursday, highlighting changing attitudes toward the country’s northern neighbor.\nThe controversy reveals a South Korean public far less wedded to the idea of inter-Korean unity than previous generations, analysts say, a changing dynamic that may shape South Korean President Moon Jae-in’s efforts at reconciliation with the isolated North.\nNorth Korea’s participation in the Olympics has been seen as a win for Moon, who hopes to use the event to make a diplomatic breakthrough in the standoff over North Korea’s nuclear and missile program. It also eases public concerns the North might upstage the Games with yet another weapons test.\nBut Moon’s specific moves to integrate the two Koreas at the Pyeongchang Winter Olympics have sparked a sharp backlash that goes beyond his traditional conservative detractors to include his main support base of younger South Koreans upset an unchastened North Korea is stealing the spotlight.\n“North Korea was all about firing missiles last year, but suddenly they want to come to the South for the Olympics? Who gets to decide that?,” Kim Joo-hee, a 24-year-old translator told Reuters during a coffee break on a chilly Seoul afternoon. “Does North Korea have so much privilege to do whatever they want?”\nMoon’s office declined to comment beyond saying the two countries would be coordinating logistics for the Olympics, which begin on February 9.\nOpinion polls released since the plans became public have shown limited support for some of Seoul’s proposals.\nOnly four out of 10 respondents said they favor the plan to march together under a flag symbolizing a unified Korea, according to a survey released on Thursday by the South Korean pollster Realmeter.\nTens of thousands of people took to social media to vent their disgust after plans for the joint activities were announced on Wednesday, with one commenter saying the Korean peninsula flag is “not my goddamned flag”.\nOthers complained “the Pyeongchang Olympics have already become the Pyongyang Olympics”.\nTWO DIFFERENT COUNTRIES The South Korean women’s ice hockey team is the only team ear-marked for integration with the North Koreans, a move that drew criticism from the coach and team members worried their performance would be disrupted by accommodating less accomplished North Korean players at short notice.\nIn a visit with the team on Wednesday, Moon tried to smooth things over by telling the players that showing unity and hope may be more important than winning, and that integrating with North Koreans will bring attention to “a less-preferred sport”.\nSouth Korean President Moon Jae-in poses for photographs with South Korean women's and men's ice hockey team players during his visit to Jincheon National Training Center in Jincheon, South Korea January 17, 2018. Picture taken January 17, 2018. Yonhap via REUTERS Nam Sung-wook, a professor of North Korean studies at Korea University, said the president may have come across as being unfair to the South Korean athletes forced to change their plans.\n“Those who voted for Moon Jae-in last year yearned for a different world where fairness and hard work are valued and rewarded,” he said. “But this time the Moon administration failed to grasp the situation and disappointed many people, including its supporters.”\nYounger South Koreans who did not experience the 1950-1953 Korean War or its Cold War aftermath may also have fewer cross-border ties and less desire to reunite the peninsula than earlier generations.\n“Undoubtedly we are two different and separate countries,” said 26-year-old Lee Seung-kun, who works in business development. “No one questions that, so competing at the Olympics as ‘one country’ does logically not make any sense.”\nSlideshow (2 Images) Andray Abrahamian, a research fellow at Pacific Forum CSIS, said it was significant that plans for joint Olympic activities have upset younger South Koreans, not only older anti-North Korea nationalists.\n“I think that reflects a growing South Korean nationalism and identity, rather than a more simple anti-Communism in the older generation,” Abrahamian said. “Young people are not anti-Communist so much as Communism is just sort of irrelevant to them.”\n‘POLITICAL SHOW’\nThe political situation has also changed since jubilant crowds greeted a joint Korean team at the 2000 Summer Olympics in Sydney, when many in South Korea and beyond sensed there might be a real breakthrough on the horizon.\n“Marching under the one peninsula flag does not bring peace to the Korean peninsula,” said one South Korean Twitter user. “We did that 18 years ago at the Sydney Summer Olympics, but North Korea has fired missiles, conducted nuclear tests and killed our own citizens. It is just another political show.”\nWhile some in the Moon administration may feel “romantic” about reconciliation with North Korea, many in South Korea now see this as a “delusion”, said author Michael Breen, who has studied South Korea for decades.\n“South Koreans feel sorry for the athletes who have trained so hard for the Olympics and are now being kicked out of the team to make way for North Koreans,” he said.\n“They think there must be a better way, especially as a few months from now we all know we will be back to where we were with North Korea.”\n(This refiled version of the story adds dropped word “by” after “met” in first paragraph).\nAdditional reporting by Yuna Park; Editing by Soyoung Kim and Lincoln Feast\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T18:19:00.000+02:00", "crawled": "2018-01-18T12:23:45.010+02:00", "highlightTitle": ""}