{"organizations": [], "uuid": "644c54c03c75cb37372a149a53746c561e0f7bc2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219134573&w=1200&r=LYNXMPEE0216R", "site_section": "http://www.reuters.com/rssFeed/newIssuesNews\r", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-usa-trump/trump-breaks-with-bannon-says-former-aide-lost-his-mind-idUSKBN1ES1V4", "country": "US", "domain_rank": 408, "title": "Trump breaks with Bannon, says former aide 'lost his mind'", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T22:48:00.000+02:00", "replies_count": 0, "uuid": "644c54c03c75cb37372a149a53746c561e0f7bc2"}, "author": "", "url": "https://www.reuters.com/article/us-usa-trump/trump-breaks-with-bannon-says-former-aide-lost-his-mind-idUSKBN1ES1V4", "ord_in_thread": 0, "title": "Trump breaks with Bannon, says former aide 'lost his mind'", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "bannon", "sentiment": "negative"}, {"name": "donald trump jr.", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "don jr.", "sentiment": "none"}, {"name": "steve bannon", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}], "organizations": [{"name": "breitbart news", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "holland", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 8:21 PM / in an hour Trump breaks with Bannon, says former aide 'lost his mind' Steve Holland 6 Min Read \nWASHINGTON (Reuters) - President Donald Trump on Wednesday blasted former White House adviser Steve Bannon as having “lost his mind” in the fallout over damaging comments Bannon made about Trump’s son, Donald Trump Jr., in excerpts of a new book. \nTrump, who had continued to speak privately with Bannon in the months after firing him as the White House chief strategist last August, essentially cut ties with Bannon at least for now in a blistering statement issued after Bannon’s comments about Don Jr. came to light. \n“Steve Bannon has nothing to do with me or my presidency. When he was fired, he not only lost his job, he lost his mind,” Trump said in a statement. \nTrump had relied heavily on Bannon, chairman of right-wing news website Breitbart News, for advice in the months leading up to the November 2016 election that Trump unexpectedly won. Bannon helped Trump shape a populist, anti-establishment message and has been the president’s link to his conservative base of support. \nIn excerpts of the forthcoming book, Bannon called a June 2016 meeting with a group of Russians at Trump Tower in New York arranged by the president’s son and attended by top Trump campaign officials “treasonous” and “unpatriotic.” \nWhile in the past Trump has praised Bannon for his friendship, in his statement on Wednesday he said Bannon had little to do with his presidential victory over Democrat Hillary Clinton, calling him “a staffer who worked for me” after he had already won the Republican nomination. \nTrump said Bannon was to blame for the loss of a Republican-held U.S. Senate seat in Alabama in December when Republican Roy Moore, whose campaign was derailed by accusations of sexual misconduct with teenage girls, lost to Democrat Doug Jones. During the campaign, Trump joined Bannon in backing Moore. \n“Now that he is on his own, Steve is learning that winning isn’t as easy as I make it look. Steve had very little to do with our historic victory, which was delivered by the forgotten men and women of this country. Yet Steve had everything to do with the loss of a Senate seat in Alabama held for more than thirty years by Republicans,” Trump said. \nSenate Majority Leader Mitch McConnell, who had despaired over Trump’s backing of Moore at the urging of Bannon, was clearly pleased that Trump was now willing to rid himself of the former aide. McConnell’s campaign organization tweeted an image of the normally taciturn McConnell with a beaming smile. \nTrump, an expert at self-promotion, said Bannon was trying to promote himself by “leaking false information to the media to make himself seem far more important than he was.” \n“Steve was rarely in a one-on-one meeting with me and only pretends to have had influence to fool a few people with no access and no clue, whom he helped write phony books,” said Trump, who famously values loyalty in associates and employees. \nWith midterm elections looming in November that could cost Republicans control of Congress, Trump praised Republican lawmakers and candidates, words likely to be welcomed by McConnell and House of Representatives Speaker Paul Ryan. \n“Like me, they love the United States of America and are helping to finally take our country back and build it up, rather than simply seeking to burn it all down,” Trump said. \nAs with much in the Trump White House, the story that triggered the harsh back and forth was an offshoot of the investigation into whether Trump campaign aides colluded with Russia to sway the election to Trump over Clinton. \nBannon expressed derision and astonishment over the June 2016 in which a Russian lawyer was said to be offering damaging information about Clinton, according to the book “Fire and Fury: Inside the Trump White House” by Michael Wolff. The book is due to be released on Tuesday. \nThe meeting was attended by Trump’s son, his son-in-law, Jared Kushner, and then-campaign chairman, Paul Manafort. Bannon also was quoted as saying he was sure Trump Jr. would have taken the Russians who took part in the meeting to meet his father in Trump Tower. \n“The three senior guys in the campaign thought it was a good idea to meet with a foreign government inside Trump Tower in the conference room on the 25th floor - with no lawyers. They didn’t have any lawyers,” Bannon said in the book in excerpts seen by Reuters. \n“Even if you thought that this was not treasonous, or unpatriotic, or bad shit, and I happen to think it’s all of that, you should have called the FBI immediately.” \nWhen an intermediary proposed the meeting, saying the Russians were offering damaging information about Clinton, Trump Jr. responded in an email, “I love it.” \nBannon was incredulous about the meeting shortly after it was revealed, according to the book, concluding sarcastically, “That’s the brain trust they had.” \nThe Wolff book, parts of which were published by New York Magazine, portrayed Trump as shocked that he won the election and said his wife, Melania Trump, was in tears, and “not of joy.” \nWhite House spokeswoman Sarah Sanders called the book “trashy tabloid fiction” with false and misleading accounts. \nThe first lady’s spokeswoman, Stephanie Grisham, added: “The book is clearly going to be sold in the bargain fiction section. Mrs. Trump supported her husband’s decision to run for President and in fact, encouraged him to do so. She was confident he would win and was very happy when he did.” Reporting by Steve Holland and Doina Chiacu; Additional reporting by Jim Oliphant; Editing by Will Dunham", "external_links": [], "published": "2018-01-03T22:48:00.000+02:00", "crawled": "2018-01-03T23:43:11.009+02:00", "highlightTitle": ""}