{"organizations": [], "uuid": "c132fd84b8fd4f2848659952b8e272fe68b28a98", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/healthNews", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-health-diet-colorectal-cancer/inflammatory-diet-linked-to-higher-risk-of-colon-cancer-idUSKBN1FB2Z7", "country": "US", "domain_rank": 408, "title": "'Inflammatory' diet linked to higher risk of colon cancer", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T23:56:00.000+02:00", "replies_count": 0, "uuid": "c132fd84b8fd4f2848659952b8e272fe68b28a98"}, "author": "", "url": "https://www.reuters.com/article/us-health-diet-colorectal-cancer/inflammatory-diet-linked-to-higher-risk-of-colon-cancer-idUSKBN1FB2Z7", "ord_in_thread": 0, "title": "'Inflammatory' diet linked to higher risk of colon cancer", "locations": [], "entities": {"persons": [{"name": "lisa rapaport", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "jama oncology", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters Health) - People who consume lots of foods linked to chronic inflammation, such as red meat and refined grains, may be more likely to develop colorectal cancer than individuals who tend to avoid these foods, a U.S. study suggests.\nResearchers examined more than two decades of U.S. survey data on eating habits and cancer diagnoses for 74,246 female nurses and 46,804 male health professionals. They sorted participants into five groups based on how likely it was that their daily diets could contribute to inflammation.\nCompared to people with diets that had the least potential to cause inflammation, individuals with diets that were most likely to cause inflammation were 32 percent more likely to develop colorectal cancer during the study, researchers report in JAMA Oncology.\n“A dietary pattern that is associated with higher levels of inflammation will chronically stimulate the bowels, leading to the production of a constantly higher level of circulating inflammation mediators that may contribute to the development of cancer,” said lead study author Fred Tabung, a researcher at the Harvard T.H. Chan School of Public Health and Brigham and Women’s Hospital in Boston.\n“Such a pro-inflammatory dietary pattern has a high intake of red meat, processed meat, organ meat, refined grains, and sugary beverages and a low intake of tea, coffee, dark yellow vegetables and green leafy vegetables,” Tabung said by email.\nMen with the most pro-inflammatory diets were 44 percent more likely to develop colorectal cancer than men with diets that were least likely to cause inflammation, the study found.\nWomen with the most pro-inflammatory diets were 22 percent more likely to get colorectal tumors.\nIn both men and women, the connection between a pro-inflammatory diet and colorectal cancer risk persisted across all anatomical sites where these tumors can develop, except for the rectum for women.\nThe risk of developing colorectal cancer was even higher among overweight or obese men and lean women, and also among men and women who didn’t consume alcohol.\nSome of the most important risk factors for colorectal cancer are family history, personal history of polyps or cancer, certain diseases such as ulcerative colitis, and not getting screened, previous research has found. Not smoking, maintaining a normal weight and taking aspirin are associated with a lower risk of colon cancer.\nLimitations of the current study include its reliance on survey participants to accurately recall and report what they ate and drank. The study also wasn’t a controlled experiment designed to prove whether or how certain dietary habits might directly influence the chances of developing colorectal cancer.\nEven so, the findings offer fresh evidence that a typical Western diet full of pro-inflammatory foods like meat and processed grains and low in fruits and vegetables can lead to health problems, said Ursula Schwab, a nutrition researcher at the University of Eastern Finland in Kuopio who wasn’t involved in the study.\n“This study adds to the previous evidence that a pro-inflammatory diet is associated with several types of diseases, including cancer, type 2 diabetes and cardiovascular diseases,” Schwab said by email.\nSOURCE: bit.ly/2ruvZzl JAMA Oncology, online January 18, 2018.\n ", "external_links": [], "published": "2018-01-22T23:56:00.000+02:00", "crawled": "2018-01-23T00:21:58.025+02:00", "highlightTitle": ""}