{"organizations": [], "uuid": "9dbfa92616516e709fade72d8e10bc03ab702cbd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 24, "shares": 24, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/news/media", "section_title": "Media | Reuters.com", "url": "https://www.reuters.com/article/us-cambodia-media/cambodia-pm-berates-media-at-correspondents-dinner-idUSKBN1FA0ZB", "country": "US", "domain_rank": 408, "title": "Cambodia PM berates media at correspondents' dinner", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T01:38:00.000+02:00", "replies_count": 0, "uuid": "9dbfa92616516e709fade72d8e10bc03ab702cbd"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-cambodia-media/cambodia-pm-berates-media-at-correspondents-dinner-idUSKBN1FA0ZB", "ord_in_thread": 0, "title": "Cambodia PM berates media at correspondents' dinner", "locations": [], "entities": {"persons": [{"name": "hun sen", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "cambodia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "cambodian people’s party", "sentiment": "none"}, {"name": "cpp", "sentiment": "none"}, {"name": "cambodia national rescue party", "sentiment": "none"}, {"name": "cambodia daily", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PHNOM PENH (Reuters) - Cambodia’s long-serving Prime Minister Hun Sen berated journalists on Sunday at a dinner his government hosted for correspondents and accused some of spreading fabricated stories.\nHun Sen regularly accuses outlets that are critical of his government of spreading fake news.\nIn recent months his ruling Cambodian People’s Party (CPP) has gone after critics including members of the opposition Cambodia National Rescue Party (CNRP), which was banned by a court last year, civil rights groups and independent media.\nThe English-language The Cambodia Daily newspaper - one of the few remaining independent newspapers left in the country - shut last year after it was handed a $6.3 million tax bill which its publishers said was politically motivated. A further 18 independent radio stations were stopped from broadcasting.\nHun Sen referred to an announcement by U.S. President Donald Trump this month that he would hand out awards for what he calls “fake news”. Trump often uses the term “fake news” to cast doubt on reports critical of him or his administration.\n“I think President Donald Trump has correctly created an award that he just announced in recent days, the Fake News Award,” he said. “And in Cambodia there is also this type of media.”\nAt the dinner, the second state dinner he has hosted for journalists, Hun Sen also accused some reporters of extorting money from loggers.\nIllegal exports of timber from Cambodia to Vietnam are a sensitive and politically charged issue in Cambodia which is seeing rapid deforestation. Hun Sen has called for a bigger effort to curb illegal logging and the country has a long-standing ban on log exports.\n“We must not let it continue to exist, this media that acts as a mafia,” Hun Sen told the gathering of over 3,000 journalists and media officials.\nHe also singled out, but did not identify, a news organization for refusing to pay taxes.\n“They don’t respect laws, they are not registered by law and they avoid paying taxes,” Hun Sen said.\nReporting by Prak Chan Thul; Editing by Amy Sawitta Lefevre and Adrian Croft\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T01:38:00.000+02:00", "crawled": "2018-01-22T06:01:50.004+02:00", "highlightTitle": ""}