{"organizations": [], "uuid": "63caf34e2f3493aad6cc252c05fddd15625e3f3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-markets/global-markets-stocks-sucked-under-by-bond-market-breakout-idUSL8N1PP2V5", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-Stocks sucked under by bond market breakout", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.027, "site_type": "news", "published": "2018-01-30T18:22:00.000+02:00", "replies_count": 0, "uuid": "63caf34e2f3493aad6cc252c05fddd15625e3f3d"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-markets/global-markets-stocks-sucked-under-by-bond-market-breakout-idUSL8N1PP2V5", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Stocks sucked under by bond market breakout", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "marc jones", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "janet yellen", "sentiment": "none"}], "locations": [{"name": "asia-pacific", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "federal reserve", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* MSCI world stocks index in biggest 2-day sell off in 6 months Asia-Pacific index down 1.1 pct, Europe down 0.5 pct\n* Dollar off 3-yr low as U.S. yields steady at near 4-yr highs\n* Dollar’s moves weighs on commodities like oil, gold\n* Russian stocks shrug of U.S. list worries\n* Trump’s State of the Union address awaited for clues\nBy Marc Jones\nLONDON, Jan 30 (Reuters) - World stocks were stuck in their biggest two-day dive in almost six months on Tuesday and commodities were also jammed in reverse, as nerves about rising global borrowing costs cooled financial markets’ euphoric start to the year.\nLacklustre German state inflation numbers had halted U.S. Treasury yields - the benchmark for world lending rates - at 2.7 percent in Europe, but with an action-packed day ahead for U.S. markets the mood remained nervy.\nJanet Yellen was expected to keep the Federal Reserve on course for more interest rate rises at her final meeting in charge, while U.S. President Donald Trump’s first State of the Union address was also looming large.\nIt all had futures markets pointing to Wall Street going south again after the bond market strains and worries about Apple’s iPhone sales had triggered its biggest drop in five months on Monday.\nThat then rolled into Asia which had its worst day of the year so far, and then to Europe where stocks were down for the fourth day in the last five as traders took aim at cyclical sectors such as mining and financials.\n“There were a number of technical indicators pointing towards market complacency and today’s move should provide some relief,” said Prabhav Bhadani, equity strategist at JP Morgan.\n“You are seeing some sector rotation with again the winners hit the hardest. People are still looking to stay invested but looking at things that have not performed.”\nThere was also a hit from commodity markets as Brent oil limped back under $70 a barrel and industrial metals like nickel fell over 2 percent before paring their losses.\nHowever, the bond market and currency markets remained the central focus. Monday’s rise in Treasury yields above 2.7 percent had pushed U.S. borrowing costs to their highest since mid-2014.\nThey hung there as New York trading loomed. Moreover, the bond market braced for potentially hawkish language from the Federal Reserve, which will begin its two-day policy meeting on Tuesday.\nAttention on Trump’s State of the Union address later in the day was mostly on his views on an infrastructure overhaul and trade, with the future of the NAFTA pact hanging in the balance.\nThe dollar’s relapse meant the euro and the yen both avoided a second day of falls. The euro clawed up to $1.2424 having begun the European session at $1.2373.\nThough German inflation was weaker than expected , other European data was upbeat. France’s economy rounded off its strongest year since 2011, while Poland’s 2017 growth came in at 4.6 percent, almost 2 percent better than in 2016.\nBritain’s pound struggled back above $1.41 having come under renewed pressure overnight as Brexit tensions continued to hound the government and its leader Theresa May.\nBritain’s housing market continued to lose momentum, data showed, with mortgage approvals at their weakest in nearly three years following the Bank of England’s first interest rate hike in a decade.\nRUSSIA SHRUGS Russian stocks edged higher as they shrugged off the risk of possible new sanctions from a newly published U.S. list of oligarchs close to the Kremlin.\nThe list, drawn up as part of a sanctions package signed into law in August last year, does not mean those included will be subject to sanctions.\nIt does include a wide circle of wealthy Russians though that run some of the country’s biggest companies, including the heads of Russia’s two biggest banks Sberbank and VTB , metals magnates and the boss of state gas monopoly Gazprom.\nVTB Capital analysts said the list was “simply a mechanical listing” of prominent Russian politicians and business leaders which would not automatically lead to any immediate sanctions.\n“Therefore, we do not expect any market reaction,” they said in a note.\nMost Asian currencies had fallen overnight as the rise in bond yields had been lifting the dollar at that point.\nMSCI’s broadest index of Asia-Pacific shares outside Japan fell 1.1 percent too but, after a string of all-time highs, it was still on track for a 6.5 percent monthly gain.\nAustralian stocks shed 0.9 percent, South Korea’s KOSPI lost 1 percent. Hong Kong’s Hang Seng 0.9 percent and Shanghai 0.8 percent, while Japan’s Nikkei was the stand-out as it dropped 1.4 percent.\nThe bearish sentiment in Asia followed a softer lead from Wall Street, which has led a global equities rally over the past year thanks to strong world growth fuelling higher corporate earnings and stock valuations.\nOn Monday, U.S. stocks pulled back from record highs, with the Dow and the S&P 500 indexes marking their biggest one-day percentage declines in about five months, weighed down by a slide in Apple shares on reports of poor iPhone X demand.\nThe commodities falls saw oil prices extend losses after being pressured by the dollar’s bounce and rising U.S. crude output.\nU.S. crude futures were down 1 percent at $64.89 per barrel. Underpinned by the dollar’s recent slide, prices had risen to $66.66 per barrel on Thursday, the highest since December 2014.\nBrent crude fell 0.7 percent to $69.00 per barrel.\nSpot gold slipped as far as $1,334.10 an ounce, the lowest since Jan. 23, before it rebounded, while a 2.2 percent drop by nickel led a broad-based sell-off in industrial metals before they also trimmed the losses.\n“Markets remain fragile to the downside,” said Stephen Innes, head of trading for Asia-Pacific at futures brokerage Oanda in Singapore. (Additional reporting by Shinichi Saoshiro in Tokyo and Helen Reid in London; Editing by Robin Pomeroy)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T18:22:00.000+02:00", "crawled": "2018-01-31T04:38:47.012+02:00", "highlightTitle": ""}