{"organizations": [], "uuid": "fc34565e3adac84f675d692c806d230604532260", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-senscio-systems-appoints-digital-health-pioneer-david-whitehouse-md-as-chief-medical-officer-expanding-executive-leadership.html", "country": "US", "domain_rank": 767, "title": "Senscio Systems Appoints Digital Health Pioneer David Whitehouse, MD, As Chief Medical Officer, Expanding Executive Leadership Team", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T16:30:00.000+02:00", "replies_count": 0, "uuid": "fc34565e3adac84f675d692c806d230604532260"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-senscio-systems-appoints-digital-health-pioneer-david-whitehouse-md-as-chief-medical-officer-expanding-executive-leadership.html", "ord_in_thread": 0, "title": "Senscio Systems Appoints Digital Health Pioneer David Whitehouse, MD, As Chief Medical Officer, Expanding Executive Leadership Team", "locations": [], "entities": {"persons": [{"name": "david whitehouse", "sentiment": "negative"}, {"name": "david", "sentiment": "negative"}, {"name": "senscio", "sentiment": "none"}, {"name": "piali de", "sentiment": "none"}, {"name": "whitehouse", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}, {"name": "md.", "sentiment": "none"}], "organizations": [{"name": "senscio systems appoints digital health pioneer", "sentiment": "negative"}, {"name": "senscio systems, inc.", "sentiment": "neutral"}, {"name": "cigna", "sentiment": "none"}, {"name": "ust global", "sentiment": "none"}, {"name": "senscio systems", "sentiment": "none"}, {"name": "united health group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOSTON, Jan. 9, 2018 /PRNewswire/ -- Senscio Systems, Inc. today announced the appointment of David Whitehouse, MD, as Chief Medical Officer. His appointment is effective immediately. Dr. Whitehouse brings over three decades of expertise and thought leadership in outcomes-focused digital health transformation including strategic leadership roles at world-leading healthcare companies including UST Global, United Health Group, and CIGNA.\n\"We are thrilled to have Dr. Whitehouse join our executive leadership team. His deep experience and expertise in outcomes-focused, value-based clinical decision systems will be invaluable in this next stage of our growth as we scale to support new populations of patients with complex health,\" said Piali De, PhD, CEO, Senscio Systems.\n\"With its patented AI technology, Senscio truly has the premier health care delivery system in augmented home-based monitoring and remote complex care management. Its use of AI to detect health episodes and direct users through self-corrective measures for these episodes is revolutionary,\" said David Whitehouse, MD. \"I look forward to working with the Senscio team on its innovative, end-to-end 'home to hospital' population health management solution.\"\nPrior to joining Senscio, Dr. Whitehouse served as Chief Medical Officer at UST-Global, a global leader in healthcare IT solutions, where he spearheaded their digital health transformation initiative serving major health plans as well as ACOs. He has served on the clinical faculty at Dartmouth, Harvard, and Yale. He currently serves on the Board of Brain Net, the largest integrated research database on the human brain, in addition to the Healthcare Management Advisory Board at the University of Connecticut School of Business. Dr. Whitehouse holds master's degrees from both Harvard University and Cambridge University, an MBA from the University of Connecticut, an M.D. from Dartmouth Medical School, and a doctorate in theology from Harvard University.\nDr. Whitehouse will work with Senscio on refining its clinical protocols, integration with clinical care, and its digital health solution that is proven to empower patients while improving clinical outcomes and controlling costs. Senscio's Ibis solution addresses a host of therapeutic areas in the management of chronic diseases including diabetes, pulmonary disease (COPD), heart disease (CHF), hypertension, depression and anxiety, cognitive disabilities, pneumonia, and other chronic illnesses. In addition, Ibis proves highly valuable in the management of palliative care and eldercare populations, and the scalable solution is being integrated by Medicaid and Medicare Programs, Accountable Care Organizations (ACO), and Patient-Centered Medical Homes (PCMH) across the country.\nAbout Senscio Systems\nSenscio Systems developed the nation's leading home-based digital health solution, Ibis™, for people with multiple chronic conditions such as COPD, CHF, and diabetes. Ibis combines patented artificial intelligence with a human touch to provide patients with personalized care management. By improving self-management and enabling proactive interventions, Ibis significantly impacts health care quality and cost, delivering better outcomes, lower costs, and improved support for patients and doctors. Ibis reduces hospitalizations up to 75%, generates net medical savings of 30% per patient per year, and an unprecedented 90% of patients comply with their care plan versus a control norm of 50%. For more information go to www.sensciosystems.com and follow @Senscio on Twitter , LinkedIn , and Facebook .\nMedia contact:\nHeidi Creighton\n188328@email4pr.com\n978-302-1198\nView original content: http://www.prnewswire.com/news-releases/senscio-systems-appoints-digital-health-pioneer-david-whitehouse-md-as-chief-medical-officer-expanding-executive-leadership-team-300578975.html\nSOURCE Senscio Systems, Inc.", "external_links": ["https://www.linkedin.com/company/1427962/", "http://www.sensciosystems.com/", "https://twitter.com/Senscio", "https://www.facebook.com/senscio/", "http://www.prnewswire.com/news-releases/senscio-systems-appoints-digital-health-pioneer-david-whitehouse-md-as-chief-medical-officer-expanding-executive-leadership-team-300578975.html"], "published": "2018-01-09T16:30:00.000+02:00", "crawled": "2018-01-09T17:38:33.009+02:00", "highlightTitle": ""}