{"organizations": [], "uuid": "242e5294daa109ac6ef52788668b049638f938ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224961618&w=1200&r=LYNXMPEE0N2BA", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-southkorea-economy-gdp/south-koreas-fourth-quarter-gdp-falls-by-0-2-percent-on-quarter-misses-forecast-idUSKBN1FD38U", "country": "US", "domain_rank": 408, "title": "South Korea economy contracts in fourth-quarter on strong base effect, holidays", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T07:25:00.000+02:00", "replies_count": 0, "uuid": "242e5294daa109ac6ef52788668b049638f938ff"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-southkorea-economy-gdp/south-koreas-fourth-quarter-gdp-falls-by-0-2-percent-on-quarter-misses-forecast-idUSKBN1FD38U", "ord_in_thread": 0, "title": "South Korea economy contracts in fourth-quarter on strong base effect, holidays", "locations": [], "entities": {"persons": [], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "bank of korea", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEOUL (Reuters) - South Korea’s economy unexpectedly shrank in the last quarter as struggling car exporters and industrial production failed to keep up the previous quarter’s dashing pace, posting its worst performance since 2008.\nAn 10-day Chuseok autumn holiday in October hit fourth-quarter industrial output, just as a slump in car exports erased the gains from booming overseas sales of computer memory chips.\nHyundai Motor and its Kia Motors affiliate said earlier this month 2017 shipments were a million vehicles below their 8.25 million target after struggling with competitiveness problems and trade issues.\nThe Bank of Korea said on Thursday that gross domestic product fell by a seasonally adjusted 0.2 percent in the fourth quarter, sliding from bumper growth of 1.5 percent in the third quarter, which was the fastest expansion in seven years.\n“There is a strong base effect after particularly high third quarter growth and as irregular factors such as the Chuseok holiday shortened the number of working days for businesses,” said Chung Kyu-il, director general at the bank’s Economic Statistics Department said at a news conference.\nThursday’s data reinforced a broad consensus that the central bank’s monetary tightening will be gradual this year as export- and investment-led growth moderates after rapid expansion in 2017.\nThe contraction in fourth-quarter 2017 undershot the 0.1 percent expansion seen by economists and marks the worst quarterly performance since the economy contracted by 3.3 percent on-quarter in the fourth quarter of 2008.\nFILE PHOTO - Hanjin Shipping's container terminal is seen at the Busan New Port in Busan August 8, 2013. REUTERS/Lee Jae-Won/File Photo Exports fell by 5.4 percent in the fourth quarter after leaping 6.1 percent a quarter earlier, while private consumption growth accelerated to 1.0 percent from 0.8 percent, the BOK said in a statement.\nThe economy expanded 3.0 percent from a year earlier, slowing from 3.8 percent growth in the September quarter.\nChung added that on a half-year basis, the July-December period showed faster growth versus January-June 2017, indicating an overall improvement in growth momentum.\nMoon Jung-hui, an economist at KB Investment & Securities said domestic demand will make up for slowing exports growth this year.\n“The burst of investment and exports we’ve seen in 2017 won’t be sustained this year and will slow down. As the GDP data shows, the good news is that private consumption is picking up, and will support growth this year,” said Moon.\nConstruction investment fell 3.8 percent from a quarter earlier after the government said in October it would impose additional mortgage curbs on owners of multiple homes to discourage excessive borrowing.\nThe bank is monitoring the effects of its November hike, the first tightening in six years, and remains wary of triggering disruptive capital flows.\nThe BOK held its policy interest rate unchanged at 1.50 percent on Jan. 18 and upgraded its 2018 growth forecast to 3 percent, a fraction higher than the 2.9 percent projected in October last year. It lowered its 2018 consumer inflation forecast to 1.7 percent from 1.8 percent, supporting analysts’ views that monetary policy will remain accommodative in 2018.\nReporting by Cynthia Kim; Editing by Eric Meijer\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T07:25:00.000+02:00", "crawled": "2018-01-25T02:04:49.000+02:00", "highlightTitle": ""}