{"organizations": [], "uuid": "2435a1776c2c59bf1c9aeecc1e3de2f6aeb51dbf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-deloittes-bersin-identifies-key-talent-acquisition-practices-that-contribute-to-organizations-high-performance.html", "country": "US", "domain_rank": 767, "title": "Deloitte's Bersin Identifies Key Talent Acquisition Practices That Contribute to Organizations' High Performance", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T17:00:00.000+02:00", "replies_count": 0, "uuid": "2435a1776c2c59bf1c9aeecc1e3de2f6aeb51dbf"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-deloittes-bersin-identifies-key-talent-acquisition-practices-that-contribute-to-organizations-high-performance.html", "ord_in_thread": 0, "title": "Deloitte's Bersin Identifies Key Talent Acquisition Practices That Contribute to Organizations' High Performance", "locations": [], "entities": {"persons": [{"name": "deloitte", "sentiment": "negative"}, {"name": "bersin", "sentiment": "negative"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "bersin identifies key talent acquisition practices that contribute to organizations", "sentiment": "negative"}, {"name": "deloitte consulting llp", "sentiment": "negative"}, {"name": "hita", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 16, 2018 /PRNewswire/ -- According to a new study by Bersin, Deloitte Consulting LLP's digital destination for the human resources professional, the acquisition and development of talent at all levels of high performing organizations is no accident — it's the result of specific and surprisingly consistent characteristics that can be learned and implemented.\nIn Bersin's report, \" Six Key Insights to Put Talent Acquisition at the Center of Business Strategy and Execution ,\" researchers detail the correlation between high-impact talent acquisition (HITA) strategies and critical HR-related outcomes in the areas of retention, internal career progression, better candidate experiences, and a sharpened talent acquisition (TA) function. Bersin's research indicates that companies with high-maturity talent acquisition functions exhibit 18 percent higher revenue and 30 percent greater profitability compared to companies with low-maturity talent acquisition performance.\n\"Talent acquisition, at its highest levels of maturity, can be immensely effective in helping to execute corporate strategy and move a business forward,\" said Robin Erickson , vice president and talent acquisition research leader, Bersin , Deloitte Consulting LLP. \"The talent acquisition practices mastered by high performing companies — performed on a journey we call talent acquisition maturity — are game changers for their business. These strategies can be progressively applied by organizations to more successfully find the right talent to drive stronger business performance.\"\nIn many enterprises, talent acquisition and development is an afterthought, with roles being filled in a reactive \"post and pray\" manner. By contrast, Bersin's research shows how high performing organizations have effectively placed talent acquisition at the center of their businesses, which can prove to help transform the entire enterprise.\nIn high performing organizations, talent acquisition has evolved from a routine, regulatory-minded activity to a function of central strategic importance. These organizations exhibit six common traits:\nHITA teams build the workforce through integration with the business. Senior executives view talent acquisition teams as essential players in executing strategy and promoting the company's people culture. Integration also allows talent acquisition teams to better anticipate broader business needs and better partner with hiring managers. Existing employees are recognized as a strategic resource, and internal mobility is a part of company culture. Hiring managers and recruiters know their internal talent's capabilities, and hiring managers work with recruiters to cultivate talent from within. Candidates are evaluated for work ethic, values, and potential as much as skills and past experiences. Bersin's report found that nine out of 10 high performing talent acquisition functions use workplace values as a basis for hiring, resulting in a stronger corporate culture that is reinforced by each new hire. TA teams construct a personalized candidate journey. Rather than a \"one size fits all\" experience, HITA functions market the role to specific candidates to not only engage top talent, but also strengthen the employment brand and promote the organization's culture. Mature teams continuously regenerate because of dedication to upskilling, informal learning and professional growth. Talent acquisition professionals are encouraged to engage in a mix of traditional education, mentor relationships and networking opportunities. Highly-mature teams use AI and predictive data analytics. The practice sharpens the talent acquisition function by using data-driven analytics and digital, cognitive tools to better source and assess candidates and prevent possible misjudgments caused by bias or false logic.\nDenise Moulton, HR and talent research leader, Bersin, Deloitte Consulting LLP, added, \"High performing talent acquisition teams are more likely to innovate and respond effectively to change. These are vital for organizations as they prepare to meet the opportunities stemming from the shift to the future of work.\"\nIn its research, Bersin surveyed 1,220 talent and business leaders, with 55 percent of those based in North and South America and 43 percent employing between 5,000 and 50,000 people. In addition, Bersin conducted approximately 50 in-depth interviews with talent acquisition professionals and thought leaders worldwide.\nLearn more about Bersin's research or membership options by visiting the Bersin homepage .\nAbout Deloitte\nDeloitte provides industry-leading audit, consulting, tax and advisory services to many of the world's most admired brands, including more than 85 percent of the Fortune 500 and more than 6,000 private and middle market companies. Our people work across more than 20 industry sectors to make an impact that matters — delivering measurable and lasting results that help reinforce public trust in our capital markets, inspire clients to see challenges as opportunities to transform and thrive, and help lead the way toward a stronger economy and a healthy society. Deloitte is proud to be part of the largest global professional services network serving our clients in the markets that are most important to them.\nDeloitte refers to one or more of Deloitte Touche Tohmatsu Limited, a UK private company limited by guarantee (\"DTTL\"), its network of member firms, and their related entities. DTTL and each of its member firms are legally separate and independent entities. DTTL (also referred to as \"Deloitte Global\") does not provide services to clients. In the United States, Deloitte refers to one or more of the US member firms of DTTL, their related entities that operate using the \"Deloitte\" name in the United States and their respective affiliates. Certain services may not be available to attest clients under the rules and regulations of public accounting. Please see www.deloitte.com/about to learn more about our global network of member firms.\nView original content with multimedia: http://www.prnewswire.com/news-releases/deloittes-bersin-identifies-key-talent-acquisition-practices-that-contribute-to-organizations-high-performance-300582338.html\nSOURCE Deloitte", "external_links": ["https://www2.deloitte.com/us/en/pages/human-capital/solutions/bersin-by-deloitte.html?id=us:2el:3pr:cmlaunch:awa:cons:101217:bprdi", "http://marketing.bersin.com/HITA-Infographic-Registration.html", "http://blog.bersin.com/author/robin-erickson/", "https://www2.deloitte.com/us/en/legal/about-deloitte.html", "http://www.prnewswire.com/news-releases/deloittes-bersin-identifies-key-talent-acquisition-practices-that-contribute-to-organizations-high-performance-300582338.html", "https://home.bersin.com/"], "published": "2018-01-16T17:00:00.000+02:00", "crawled": "2018-01-16T19:39:34.024+02:00", "highlightTitle": ""}