{"organizations": [], "uuid": "49abe7fcc0f0ca7c407e43274bff6294c873d4d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/15/pr-newswire-cox-automotives-future-of-digital-retail-study-reveals-dealerships-remain-central-to-the-car-buying-experience.html", "country": "US", "domain_rank": 767, "title": "Cox Automotive's Future of Digital Retail Study Reveals Dealerships Remain Central to the Car Buying Experience", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T17:00:00.000+02:00", "replies_count": 0, "uuid": "49abe7fcc0f0ca7c407e43274bff6294c873d4d7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/15/pr-newswire-cox-automotives-future-of-digital-retail-study-reveals-dealerships-remain-central-to-the-car-buying-experience.html", "ord_in_thread": 0, "title": "Cox Automotive's Future of Digital Retail Study Reveals Dealerships Remain Central to the Car Buying Experience", "locations": [], "entities": {"persons": [], "locations": [{"name": "detroit", "sentiment": "none"}], "organizations": [{"name": "cox automotive", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DETROIT, Jan. 15, 2018 /PRNewswire/ -- Cox Automotive released the findings of its Future of Digital Retail Study, with results showing that the current dealership model needs to change with consumer preferences, but that the dealership remains central to car buying. While most consumers prefer completing at least one step of the car buying process online, most car buyers want to complete the transaction at a dealership.\nOn the digital front, 71 percent of consumers want to get accurate, detailed information on the deal online and 83 percent of consumers want to complete at least one purchase activity online. Consumers indicate they want to complete a majority of the legwork before they enter the dealership. They want to agree on an accurate price that does not change later in the process, understand and select add-ons and warranties, agree on a trade-in value and other costs ahead of time, reducing – or eliminating – the time necessary to negotiate the final purchase price in-store.\nThe average buyer currently spends three hours at the dealership during a car purchase, with 90 minutes spent on negotiating the financial details 1 . Consumer satisfaction with how long the process takes at the dealership continues to decrease, dropping from 55 percent in 2016 2 to 46 percent in 2018 3 .\nOn a parallel track, the dealership is important for consumers in both initial research and final purchase processing. Nearly nine in 10 respondents want to complete their purchase at the dealership; only 11 percent of consumers want to review and sign paperwork online away from the dealership. However, Cox Automotive research shows a growing percentage of people are interested in completing the entire purchase online in the future. 4\nThe dealership continues to have a significant role. Eight in 10 consumers would never purchase a car without a test drive and seven in 10 would never purchase a car without physically seeing it first, even if a condition report is offered – both activities typically conducted at a dealership. The survey also indicates that most car shoppers want dealership staff to be valuable consultants during the process, especially for learning about the individual products, features and vehicle capabilities.\n\"The results of our study show that the most successful dealers are the ones who offer a connected in-store and online experience, where consumers start car-buying activities online and seamlessly finish them at the dealership,\" said Mike Burgiss, vice president of Digital Retailing at Cox Automotive. \"Importantly, a more efficient process is not only better for consumers, it's better for dealers as well.\"\nThe importance of a connected dealership is displayed in the study where 85 percent of shoppers are more likely to buy from a particular dealership that allows them to start or complete nearly all of the vehicle purchase online. Considering the many retail options offered by other industries today, consumers are right to expect a flexible, seamless car-buying experience both online and in the dealership.\n\"2018 is when consumers will see significant change in the experience,\" continued Burgiss. \"The technology and tools are here to make car buying more efficient for both consumers and dealers. With new solutions streamlining and improving the experience, we firmly disagree with anyone who says the dealership is dead—it's not, but the old way of car buying certainly is.\"\nFor more information on Cox Automotive's Future of Digital Retail Study, please visit https://www.coxautoinc.com/learning-center/4-truths-of-connected-retail/ .\nAbout Cox Automotive\nCox Automotive Inc. is transforming the way the world buys, sells and owns cars with industry-leading digital marketing, financial, retail and wholesale solutions for consumers, dealers, manufacturers and the overall automotive ecosystem worldwide. Committed to open choice and dedicated to strong partnerships, the Cox Automotive family includes Autotrader ® , Dealer.com ® , Dealertrack ® , Kelley Blue Book ® , Manheim ® , NextGear Capital ® , RMS Automotive, vAuto ® , Xtime ® and a host of other brands. The global company has 34,000-plus team members in more than 200 locations and is partner to more than 40,000 auto dealers, as well as most major automobile manufacturers, while engaging U.S. consumer car buyers with the most recognized media brands in the industry. Cox Automotive is a subsidiary of Cox Enterprises Inc., an Atlanta-based company with revenues exceeding $20 billion and approximately 60,000 employees. Cox Enterprises' other major operating subsidiaries include Cox Communications and Cox Media Group. For more information about Cox Automotive, visit www.coxautoinc.com .\n1 2018 Car Buyer Journey Study\n2 2016 Car Buyer Journey Study\n3 2018 Car Buyer Journey Study\n4 2015 Car Buyer of the Future Study, 2018 Future of Digital Retail Study\nView original content with multimedia: http://www.prnewswire.com/news-releases/cox-automotives-future-of-digital-retail-study-reveals-dealerships-remain-central-to-the-car-buying-experience-300582252.html\nSOURCE Cox Automotive, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/cox-automotives-future-of-digital-retail-study-reveals-dealerships-remain-central-to-the-car-buying-experience-300582252.html", "http://www.coxautoinc.com/", "https://www.coxautoinc.com/learning-center/4-truths-of-connected-retail/"], "published": "2018-01-15T17:00:00.000+02:00", "crawled": "2018-01-15T18:50:50.005+02:00", "highlightTitle": ""}