{"organizations": [], "uuid": "40bd3da7659eec21a23ecea70b15d7cdb0558547", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/20180108_192038.jpg", "site_section": "http://nvidianews.nvidia.com/rss.xml", "section_title": "NVIDIA Newsroom", "url": "http://fortune.com/2018/01/09/ceo-daily-for-january-9-2018/", "country": "US", "domain_rank": 1196, "title": "NVIDIA's Jensen Huang Is Living the Dream", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T21:59:00.000+02:00", "replies_count": 0, "uuid": "40bd3da7659eec21a23ecea70b15d7cdb0558547"}, "author": "", "url": "http://fortune.com/2018/01/09/ceo-daily-for-january-9-2018/", "ord_in_thread": 0, "title": "NVIDIA's Jensen Huang Is Living the Dream", "locations": [], "entities": {"persons": [{"name": "jensen huang", "sentiment": "negative"}, {"name": "zuma", "sentiment": "none"}], "locations": [{"name": "earth", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "dream apple", "sentiment": "negative"}, {"name": "nvidia", "sentiment": "negative"}, {"name": "california state teachers’ retirement system", "sentiment": "none"}, {"name": "reuters  satellite", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "spacex", "sentiment": "none"}, {"name": "bloomberg  gopro", "sentiment": "none"}, {"name": "jana partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Apple says it’s “always looked out for kids.” \nApple defended its smartphone technology on Monday after two major shareholders—Jana Partners and the California State Teachers’ Retirement System—publicly pushed the company to study the effects of smartphone usage on mental health in children. Apple noted that its iPhone software already has tools that let parents control the apps and other content their children can use, and the company said it is working to make those tools more effective. Reuters \nSatellite lost? \nThe U.S. government satellite that SpaceX was to deliver into low-Earth orbit on Sunday night reportedly never reached its destination. U.S. officials are not commenting on the outcome of the secretive Zuma mission, but the satellite has not been spotted in orbit and anonymous sources tell Bloomberg it was lost after it fell back to Earth due to a failure during one of the launch stages. Bloomberg \nGoPro’s future looking shaky. \nThe action camera company confirmed on Monday that it will lay off 20% of its workforce (about 250 people) while also shutting down its Karma drone business due to disappointing sales results. After GoPro’s stock tumbled yesterday, reports surfaced that the company is exploring a sale. While the company confirmed it is working with J.P. Morgan, a GoPro spokesperson insisted it is not actively looking to sell. Fortune \nAltice will spin off U.S. arm. \nThe European cable giant, which controls Cablevision and Suddenlink in the U.S., said Monday that it plans to spin off its U.S. unit, Altice USA, which just had its IPO over the summer. The parent Altice, which needs to lighten a massive debt load, will spin off its stake in the U.S. unit to shareholders, while Altice founder Patrick Drahi will retain control of both companies and serve as chairman of Altice USA. The Wall Street Journal Around the Water Cooler \nJeff Bezos’ net worth hits a new high. \nWith Amazon’s shares up more than 6% this year, the founder and CEO’s net worth has also ticked upward, reaching $105.1 billion on Monday, according to Bloomberg. Bezos was already the world’s richest person, but the new number puts him ahead of the all-time high Bill Gates reached in 1999. Bloomberg \nSamsung doubles down on IOT. \nAt the 2018 CES tech show in Las Vegas on Monday, Samsung executives echoed their previous promise that all of the company’s products will soon be able to connect with one another and your home as part of the internet of things (IOT). The company reiterated its goal of making all of its devices IOT-ready by 2020, even noting that Samsung is already 90% of the way there. Fortune \nHTC, Facebook both debut new VR headsets. \nAlso at CES, attendees got a look at two new virtual reality headsets, one from Taiwan’s HTC and the other from Facebook-owned Oculus. HTC showed off a new version of its Vive headset, called the Vive Pro, which has better resolution and improved weight distribution. Meanwhile, Facebook’s Oculus revealed details about its Mi VR Standalone headset, which goes on sale in China later this year. Fortune \nAston Martin possibly revving up for IPO. \nThe British sports car manufacturer—known as the preferred brand of James Bond—is reportedly weighing an initial public offering that would value the company at as high as $6.8 billion, which would put it on par with Ferrari. The move would precede Aston Martin’s plan to release a luxury SUV next year. Bloomberg", "external_links": [], "published": "2018-01-09T21:59:00.000+02:00", "crawled": "2018-01-10T00:51:18.010+02:00", "highlightTitle": ""}