{"organizations": [], "uuid": "89d58b891a8bdc036fa84fdff4ac9dd6b9393a60", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/quiksilver-billabong-merger/lpc-boardriders-backs-billabong-acquisition-with-us600m-of-loans-idUSL1N1P51N7", "country": "US", "domain_rank": 408, "title": "LPC: Boardriders backs Billabong acquisition with US$600m of loans", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T21:38:00.000+02:00", "replies_count": 0, "uuid": "89d58b891a8bdc036fa84fdff4ac9dd6b9393a60"}, "author": "", "url": "https://www.reuters.com/article/quiksilver-billabong-merger/lpc-boardriders-backs-billabong-acquisition-with-us600m-of-loans-idUSL1N1P51N7", "ord_in_thread": 0, "title": "LPC: Boardriders backs Billabong acquisition with US$600m of loans", "locations": [], "entities": {"persons": [{"name": "andrew berl", "sentiment": "negative"}, {"name": "billabong", "sentiment": "negative"}, {"name": "vonzipper", "sentiment": "none"}], "locations": [{"name": "billabong", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "quiksilver", "sentiment": "none"}, {"name": "dc shoes", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "xcel", "sentiment": "none"}, {"name": "oaktree", "sentiment": "none"}, {"name": "boardriders inc", "sentiment": "none"}, {"name": "oaktree capital management", "sentiment": "none"}, {"name": "billabong international ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 7:39 PM / in 3 minutes LPC: Boardriders backs Billabong acquisition with US$600m of loans Andrew Berlin 3 Min Read \nNEW YORK, Jan 10 (Reuters) - US surfwear retailer Boardriders Inc will use US$600m of loans to back its purchase of Australian peer Billabong International Ltd, according to three sources familiar with the matter. \nThe acquisition, announced on January 4, comes roughly two years after California-based Boardriders - formerly known as Quiksilver - emerged from a five-month stint in bankruptcy court precipitated by competition and operational issues that plagued performance. \nThe designer and distributor of brands including Quiksilver, Roxy and DC Shoes filed for Chapter 11 bankruptcy protection in September 2015 and transferred control to US private equity firm Oaktree Capital Management, its largest debtholder, as part of the restructuring process. \nThe investment firm currently holds 19% of Billabong, owner of the eponymous brand as well as RVCA, Element, VonZipper and Xcel. Oaktree received the stake in connection with a rescue financing package it provided to Billabong in 2013 along with US private equity firm Centerbridge Partners, which currently owns 19.2%. \nBoardriders’ new debt will include a US$150m asset-based revolving credit facility and a US$450m term loan with a first priority claim, the sources said. \nBank of America Merrill Lynch will arrange the revolving credit facility, the sources said. Deutsche Bank will lead the term loan alongside BAML and Macquarie Capital. \nProceeds will be used to fund the Billabong acquisition and refinance debt at both companies. \nBAML, Deutsche Bank, Macquarie and Oaktree declined to comment. \nBoardriders is buying Billabong for an enterprise value of A$380m, or a multiple of 7.4 times Billabong’s pro forma 2017 Ebitda, or earnings before interest, tax, depreciation and amortization, according to a Billabong press release. The valuation is equivalent to roughly US$300m. \nThe combined company’s Ebitda will total roughly US$100m, not accounting for synergies arising from the merger, two of the sources said. \nSyndication of the financing is likely to begin in March, although timing is dependent on factors influencing the transaction such as shareholder, court and regulatory approval, the same sources said. \nThe deal is expected to close in April. (Reporting by Andrew Berln; Editing By Jon Methven)", "external_links": [], "published": "2018-01-10T21:38:00.000+02:00", "crawled": "2018-01-10T21:53:48.102+02:00", "highlightTitle": ""}