{"organizations": [], "uuid": "d309d02868ef96c9d254e7b3a51be8d16e003214", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1218938136&w=1200&r=LYNXMPEE0202S", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-mideast-crisis-syria-rebels/syrian-army-preparing-assault-to-end-rebel-siege-of-base-east-of-capital-idUKKBN1ES04M", "country": "US", "domain_rank": 408, "title": "Syrian army preparing assault to end rebel siege of base east of capital", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T04:14:00.000+02:00", "replies_count": 0, "uuid": "d309d02868ef96c9d254e7b3a51be8d16e003214"}, "author": "", "url": "https://uk.reuters.com/article/uk-mideast-crisis-syria-rebels/syrian-army-preparing-assault-to-end-rebel-siege-of-base-east-of-capital-idUKKBN1ES04M", "ord_in_thread": 0, "title": "Syrian army preparing assault to end rebel siege of base east of capital", "locations": [], "entities": {"persons": [{"name": "suleiman al-khalidi", "sentiment": "none"}], "locations": [{"name": "ghouta", "sentiment": "none"}, {"name": "harasta", "sentiment": "none"}, {"name": "damascus", "sentiment": "none"}, {"name": "douma", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}], "organizations": [{"name": "military vehicles administration", "sentiment": "none"}, {"name": "min read  amman", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 2:15 AM / Updated 6 hours ago Syrian army preparing assault to end rebel siege of base east of capital Suleiman Al-Khalidi 4 Min Read \nAMMAN (Reuters) - The Syrian army backed by Russian jets escalated bombing of the last rebel bastion on the eastern outskirts of Damascus as they prepared to break a siege of an army base encircled by opposition forces, residents and witnesses said on Wednesday. A man watches as smoke rises from Harasta area, as seen from Douma, in the eastern Damascus suburb of Ghouta, Syria November 14, 2017. REUTERS/Bassam Khabieh \nThey said the army was amassing elite forces to prepare for a major assault on the Military Vehicles Administration, which is besieged by rebels. At least 200 troops were believed to be trapped within its sprawling, heavily defended grounds. \nSince Sunday, rebels mainly belonging to the Islamist Ahrar al Sham faction widened their control of parts of the army base in Harasta that penetrates the Eastern Ghouta, the last rebel bastion around the capital. \nThey stormed the base last November in a drive to relieve pressure on Eastern Ghouta’s towns and villages, which have seen escalating aerial attacks in the last week. \nState media did not report the assault but said “terrorists” had fired mortars on residential areas in Harasta and the army responded by strikes in Eastern Ghouta that led to losses in the ranks of the insurgents. No further details were given. \nCivil defence sources said that in four days of heavy aerial strikes since Friday 38 civilians have been killed and at least 147 people have been injured. Five civilians were killed on Tuesday. \nThe base has long been used to strike at the densely populated Eastern Ghouta in an attempt to force the rebel enclave to submission. More than 300,000 people there have lived under siege by army troops since 2013. \nThe advances bring rebels closer to the heart of the capital once again, after they were pushed out of their remaining pockets last year by months of siege and bombardment. \nThe army setback comes against a backdrop of successive battlefield victories that allowed the Syrian army with heavy reliance on Russia and Iran to regain in the last year large tracts of territory from insurgents. \nResidents said at least 30 aerial strikes hit residential areas of Eastern Ghouta on Tuesday. Shelling of a market in the city of Douma, the main urban centre in the Ghouta, left one dead and scores injured. \n“The frontlines of Ghouta are witnessing battles and clashes and big losses inflicted on (Syrian President) Assad’s forces and his militias,” said Hamza Biriqdar, the spokesman for Jaish al Islam, a main rebel faction. \nFurther northwest, rebels ranging from jihadists to mainstream Free Syrian Army (FSA) were retreating from more villages seized by the army in southern Idlib province and the adjoining eastern Hama countryside. \nThe strikes have escalated in the last week on this major front with at least 50 villages retaken by the Syrian army and its allies in their push into the last major province in rebel hands that borders Turkey. \nThe intensity of strikes by Russia and the Syrian Air Force has driven tens of thousands of villagers in these areas to flee to the relative safety of the northern part of Idlib province near of the Turkish border, where many families have spread makeshift tents on main roads and agricultural land. Reporting by Suleiman Al-Khalidi; Editing by Toni Reinhold", "external_links": [], "published": "2018-01-03T04:14:00.000+02:00", "crawled": "2018-01-03T04:31:27.013+02:00", "highlightTitle": ""}