{"organizations": [], "uuid": "4c832af4334a2bb2ce77b1ca7b0c6f19bf005972", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/02/mpw-revised-logo-2-42.png", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/18/dylan-farrow-ellen-pompeo-ann-curry-broadsheet-jan-18/", "country": "US", "domain_rank": 1196, "title": "Dylan Farrow, Ellen Pompeo, Ann Curry: Broadsheet Jan. 18 | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.217, "site_type": "news", "published": "2018-01-18T02:00:00.000+02:00", "replies_count": 0, "uuid": "4c832af4334a2bb2ce77b1ca7b0c6f19bf005972"}, "author": "Kristen Bellstrom", "url": "http://fortune.com/2018/01/18/dylan-farrow-ellen-pompeo-ann-curry-broadsheet-jan-18/", "ord_in_thread": 0, "title": "Dylan Farrow, Ellen Pompeo, Ann Curry: Broadsheet Jan. 18 | Fortune", "locations": [], "entities": {"persons": [{"name": "dylan farrow", "sentiment": "negative"}, {"name": "kristen bellstrom", "sentiment": "negative"}, {"name": "ann curry", "sentiment": "negative"}, {"name": "ellen pompeo", "sentiment": "negative"}, {"name": "nicole kidman", "sentiment": "none"}, {"name": "witherspoon", "sentiment": "none"}, {"name": "kidman", "sentiment": "none"}, {"name": "reese witherspoon", "sentiment": "none"}, {"name": "grey", "sentiment": "none"}, {"name": "pompeo", "sentiment": "none"}], "locations": [{"name": "hollywood", "sentiment": "none"}], "organizations": [{"name": "big little lies", "sentiment": "none"}, {"name": "hbo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Kristen Bellstrom January 18, 2018 \nGood morning, Broadsheet readers! Dylan Farrow speaks out against her father (again), women’s rage is having a moment, and the women of Hollywood are getting raises—and so should you. Enjoy your Thursday. EVERYONE'S TALKING \n• Show us the money . Today, let’s start the morning with a little “Get paid!” inspiration. \nAfter cleaning up at award show after award show, Reese Witherspoon and Nicole Kidman are reaping the financial rewards of bringing Big Little Lies to HBO. The duo, who both produce and star in the powerhouse show, will reportedly earn roughly $1 million apiece for each episode of the upcoming second season. That’s a significant jump over the $250,000 (Witherspoon) and $350,000 (Kidman) per episode they earned during the first season. \nAnother Hollywood force, Grey’s Anatomy star Ellen Pompeo, talks to The Hollywood Reporter about the multi-year fight that led to her new contract—a deal that makes her TV’s high-paid woman, at more than $20 million a year. \nIn the story, Pompeo talks about overcoming doubts that she was being too pushy or greedy. Ultimately—with some help from Grey’s creator Shonda Rhimes—she came to see the situation differently. “ Grey’ s has generated nearly $3 billion for Disney,” says Pompeo. “When your face and your voice have been part of something that’s generated $3 billion for one of the biggest corporations in the world, you start to feel like, ‘OK, maybe I do deserve a piece of this.'” \nObviously, none of these stars are hurting for cash—and their fair pay struggles are worlds away from the life-or-death financial challenges faced by many Americans. But, as Hollywood has led the way in speaking truth to power in the #MeToo movement, I do believe their willingness to fight for what they’re worth—and to talk openly about it—can motivate the rest of us to do the same. ALSO IN THE HEADLINES \n• Standing by her words . In an interview airing today on CBS This Morning, Dylan Farrow reiterated her charge that she was sexually assaulted by her adoptive father, Woody Allen. Farrow says she’s hurt and furious that her allegations—first leveled 25 years ago—have fallen on deaf ears. “Why shouldn’t I want to bring him down? Why shouldn’t I be angry?” Farrow said. “Why shouldn’t I be hurt? Why shouldn’t I feel some sort of outrage that after all these years, being ignored and disbelieved and tossed aside?” Time \n• Mad vs. Sad . Speaking of that powerful emotion, this New York Times Magazine piece—subtitled “On female rage”—examines the way our society reacts to women’s anger, and why so many of us are more comfortable with the idea of “sad women.”“[The sad woman] often looks beautiful in her suffering: ennobled, transfigured, elegant. Angry women are messier. Their pain threatens to cause more collateral damage.” New York Times \n• Victims’ voices . Numerous victims of Larry Nassar, the disgraced USA Gymnastics doctor who plead guilty to 10 counts of first-degree sexual conduct with minors, are sharing their heartbreaking stories of abuse at his sentencing hearing. (In a separate federal case, Nassar was sentenced to 60 years in prison for child pornography charges.) Prosecutors say they have scheduled 98 of his more than 140 victims to appear during the proceedings. Washington Post \n• Curry is not surprised . Appearing on CBS yesterday, Ann Curry said she was “not surprised” by the sexual harassment claims against her former Today co-host Matt Lauer. “I would be surprised if many women did not understand that there was a climate of verbal harassment that existed [at the Today show],” she said. Fortune IN CASE YOU MISSED IT \n• Today’s news . In other Today -related news, NBC has announced that Don Nash, who has been the show’s executive producer since 2012, will be succeeded by Libby Leist. She will become the first woman to hold the top producing job for the program’s first two hours. New York Times \n• The 5% solution. The Canada-U.S. Council for Advancement of Women Entrepreneurs and Business Leaders (formed last year after a meeting between President Trump and PM Justin Trudeau), released its first report. It called for—among other things—5% of prime private sector procurement contracts to be awarded to small businesses owned by women, better maternity and paternity leave, and tax incentives to help lower the cost of childcare. ", "external_links": [], "published": "2018-01-18T02:00:00.000+02:00", "crawled": "2018-01-19T18:33:53.011+02:00", "highlightTitle": ""}