{"organizations": [], "uuid": "d0da76aec7a67eaffdc7411592f46263db49b1d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/southeast-asia-stocks/se-asia-stocks-fall-on-soft-wall-street-philippines-down-over-2-pct-idUSL4N1PP1XH", "country": "US", "domain_rank": 408, "title": "SE Asia Stocks-Fall on soft Wall Street; Philippines down over 2 pct", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T06:56:00.000+02:00", "replies_count": 0, "uuid": "d0da76aec7a67eaffdc7411592f46263db49b1d7"}, "author": "", "url": "https://www.reuters.com/article/southeast-asia-stocks/se-asia-stocks-fall-on-soft-wall-street-philippines-down-over-2-pct-idUSL4N1PP1XH", "ord_in_thread": 0, "title": "SE Asia Stocks-Fall on soft Wall Street; Philippines down over 2 pct", "locations": [], "entities": {"persons": [{"name": "philipp", "sentiment": "negative"}, {"name": "stephen innes", "sentiment": "none"}, {"name": "christina martin jan", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "philippines", "sentiment": "none"}, {"name": "asia-pacific", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "oanda", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "fed", "sentiment": "none"}, {"name": "min read * philippines", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Philippines posts biggest intraday drop in over 1 year * Investors await Fed meeting, U.S. employment report By Christina Martin Jan 30 (Reuters) - Southeast Asian stock markets fell on Tuesday tracking Wall Street, with the Philippines posting its biggest intraday percentage drop in more than a year. On Monday, U.S. stocks pulled back from record highs, weighed down by a slide in Apple shares on news that the company will cut production of its iPhone X smartphone. \"Asian markets are tracking U.S. equity markets, which finished broadly lower with tech and energy stocks accounting for much of the decline,\" said Stephen Innes, head of trading in Asia-Pacific for Oanda in Singapore. The dollar traded above a recent three-year low against a basket of major currencies on Tuesday, having drawn some support from a rise in U.S. bond yields as traders awaited a Federal Reserve policy meeting for fresh catalysts. \"Higher global bond yields are factoring negatively into regional sentiment and when compounded by the slew of U.S. headline risk starting with tomorrow's key FOMC statement, investors are erring on the side of caution while taking profits off the table,\" he said. The Fed is widely expected to keep interest rates unchanged at its two-day policy meeting that starts later on Tuesday. Investors, however, will be focusing on its assessment of the economy and inflation for hints on the monetary policy outlook. Investors will also await U.S. President Donald Trump's first official State of the Union speech late on Tuesday and the U.S. employment report. In Southeast Asia, Philippine shares slumped 2.4 percent in their sharpest intraday percentage drop since December 2016 and were headed for their first fall in four sessions. \"There is nervousness on the currency front with the peso trading lower,\" said Innes, pointing out that a weaker currency was horrible for equity flows. The peso slipped as much as 0.6 percent to a near three-month low. Industrials and financials were the top losers, with SM Investments Corp shedding as much as 4.5 percent and Ayala Corp declining 3.1 percent. Indonesian shares declined as much as 1.6 percent, hurt by falls in energy, telecom and consumer staple stocks. United Tractors Tbk PT and Telekomunikasi Indonesia (Persero) Tbk Perusahaan Perseroan PT shed as much as 4.2 percent and 2 percent, respectively. An index of the country's 45 most liquid stocks dropped 1.9 percent to a one-week low. Singapore slipped as much as 0.6 percent to a one-week low, weighed down by financial and real estate stocks. United Overseas Bank Ltd and DBS Group Holdings Ltd declined as much as 1.2 percent and 1.5 percent, respectively. Vietnam dropped as much as 1.6 percent to a more than one-week low. For Asian Companies click; SOUTHEAST ASIAN STOCK MARKETS as at 0453 GMT Change on the day Market Current Previous close Pct Move Singapore 3561 3577.07 -0.45 Bangkok 1825.84 1837.49 -0.63 Manila 8840.78 9058.62 -2.40 Jakarta 6576.108 6680.619 -1.56 Kuala Lumpur 1867.68 1870.52 -0.15 Ho Chi Minh 1097.18 1109.8 -1.14 Change in 2018 Market Current End 2017 Pct Move Singapore 3561 3402.92 4.65 Bangkok 1825.84 1753.71 4.11 Manila 8840.78 8558.42 3.30 Jakarta 6576.108 6355.654 3.47 Kuala Lumpur 1867.68 1796.81 3.94 Ho Chi Minh 1097.18 984.24 11.47 (Reporting by Christina Martin in Bengaluru; Editing by Subhranshu Sahu)\n ", "external_links": [], "published": "2018-01-30T06:56:00.000+02:00", "crawled": "2018-01-30T07:37:54.010+02:00", "highlightTitle": ""}