{"organizations": [], "uuid": "342c72ee90c5657453d04ed06afcd4b7cbf9c5a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180118.html", "section_title": "Archive News &amp; Video for Thursday, 18 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/ibm-results/update-1-ibms-first-revenue-rises-in-nearly-6-years-tops-estimates-idUSL3N1PD5RR", "country": "US", "domain_rank": 408, "title": "CORRECTED-UPDATE 2-IBM returns to growth, but shares drop after recent rally", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T05:31:00.000+02:00", "replies_count": 0, "uuid": "342c72ee90c5657453d04ed06afcd4b7cbf9c5a4"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/ibm-results/update-1-ibms-first-revenue-rises-in-nearly-6-years-tops-estimates-idUSL3N1PD5RR", "ord_in_thread": 0, "title": "CORRECTED-UPDATE 2-IBM returns to growth, but shares drop after recent rally", "locations": [], "entities": {"persons": [{"name": "lou miscioscia", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "macmillan communications", "sentiment": "negative"}, {"name": "pivotal research", "sentiment": "none"}, {"name": "ibm", "sentiment": "none"}, {"name": "ternational business machines corp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Corrects brokerage name in paragraph 5 to CFRA from MacMillan Communications)\nJan 18 (Reuters) - International Business Machines Corp’s revenue rose for the first time in 23 quarters and beat analysts’ estimates as the company’s shift into its focus areas such as cloud computing and security services gains traction.\nIBM’s shares tumbled about 4 percent in extended trading on Thursday. In October, the company had flagged a possible return to growth and since then its stock has gained about 16 percent, including rallying about 10 percent since the start of 2018.\n“IBM hit their numbers, so I think the reason why shares are down is the shares have been up materially in the last 18 days ... so they’re giving a little bit of that up,” Pivotal Research analyst Lou Miscioscia said.\nIBM’s quarterly profit, excluding a charge related to the recent U.S. tax overhaul, just edged past analysts’ estimates and the company did not detail the expected impact of the new tax rates on current year’s results.\n“It’s really the uncertainty of how 2018 shapes out. The big portion of that is tax,” said CFRA analyst David Holt.\n“Yes it’s going to be headwind but we really don’t know when and how they will be able to recognize those discrete items, and the second one would be the actual growth margin pull.”\nTo counter a slowdown in its legacy hardware and software businesses, IBM has in recent years targeted high-margin “strategic imperatives” such as cloud computing, cybersecurity, mobile and data analytics that flow across its five business units.\nThat has helped its revenue decline slow down in recent quarters and finally turn a corner last quarter. Wall Street expects IBM’s revenue to grow in the current quarter and the next quarter as well, according to Thomson Reuters I/B/E/S.\n“Well I think the expectations got ahead of themselves ... they (IBM) have not given 2018 guidance yet, they’re going to give that in the call, so were still waiting for more information,” Miscioscia said.\nIBM’s “Strategic imperatives” includes the contribution of cloud computing – where firms use a remote network of data centers instead of their own hardware to cut costs.\nIBM’s cloud business grew 30 percent in the fourth quarter. Revenue from all “strategic imperatives” rose 17 percent.\nTotal revenue increased 3.6 percent to $22.54 billion, beating analysts’ average estimate of $22.06 billion.\nIBM swung to a loss of $1.05 billion from a year-ago profit of $4.50 billion, due to a $5.5 billion tax reform-related charge. Its adjusted profit of $5.18 per share was a penny above analysts estimates. (Reporting by Pushkala Aripaka in Bengaluru; Editing by Maju Samuel and Savio D‘Souza)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T05:31:00.000+02:00", "crawled": "2018-01-19T12:14:22.000+02:00", "highlightTitle": ""}