{"organizations": [], "uuid": "4ef0f815db148a508c08c7c19aff1649e74bb886", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223367798&w=1200&r=LYNXMPEE0I13O", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-davos-meeting-wto-factbox/factbox-five-fundamental-threats-facing-the-wto-in-2018-idUKKBN1F81UI", "country": "US", "domain_rank": 408, "title": "Factbox - Five fundamental threats facing the WTO in 2018", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T17:12:00.000+02:00", "replies_count": 0, "uuid": "4ef0f815db148a508c08c7c19aff1649e74bb886"}, "author": "", "url": "https://uk.reuters.com/article/uk-davos-meeting-wto-factbox/factbox-five-fundamental-threats-facing-the-wto-in-2018-idUKKBN1F81UI", "ord_in_thread": 0, "title": "Factbox - Five fundamental threats facing the WTO in 2018", "locations": [], "entities": {"persons": [{"name": "suresh prabhu", "sentiment": "none"}, {"name": "cecilia malmstrom", "sentiment": "none"}, {"name": "tom miles", "sentiment": "none"}, {"name": "robert lighthizer", "sentiment": "none"}, {"name": "roberto azevedo", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "wto", "sentiment": "negative"}, {"name": "factbox - five", "sentiment": "negative"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "min read  geneva", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "world trade organization", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 3:12 PM / Updated an hour ago Factbox - Five fundamental threats facing the WTO in 2018 Tom Miles 4 Min Read \nGENEVA (Reuters) - The World Trade Organization, created in 1995 as a defence against trade wars and protectionism, is facing an unprecedented range of fundamental threats, some of which are likely to be aired when trade ministers meet in Davos next week. \nOfficials attending the World Economic Forum in Davos include U.S. Trade Representative Robert Lighthizer, European Commissioner Cecilia Malmstrom and Indian Commerce Minister Suresh Prabhu, as well as WTO Director-General Roberto Azevedo. \nThe following are five ways that international disagreements risk putting the WTO out of business. PARALYSIS BY U.S. VETO \nThe most urgent crisis has been caused by the United States blocking new appointments to the WTO’s appellate body, effectively the supreme court of global trade. \nIt should have seven members but is down to four, with one more leaving in September. Three are needed on each appeal. \nThe dispute system is already backed up, with rulings taking four years and appeals and compliance proceedings several more. \nTrade experts fear that if the WTO dispute system seizes up altogether, governments will simply resort to raising tariffs and imposing embargoes to retaliate against perceived threats. \n“I’ve spoken to Ambassador Lighthizer. Our Japanese friends, many other countries, have addressed it with our American friends to find a way out, and there is no agreement whatsoever,” Malmstrom told Reuters on Monday. OBSOLESCENCE DUE TO FAILURE OF NEGOTIATIONS \nThe evolution of the global trade rulebook began in 1947 and basically stopped in 1995 when the WTO was created. The launch of new negotiations in Doha in 2001 proved over-ambitious and divisive and collapsed without ever formally ending. \nSome developing countries, such as India, still want to see it through. The United States and the EU are keen to move on. \nAmid the stalemate, the rise of the digital economy is turning a chronic ailment into an acute condition. Without updated rules applicable to global value chains, e-commerce and digital trade, the WTO rulebook risks sliding into irrelevance. BREAK-UP INTO SMALLER GROUPS \nIn November, the United States vetoed WTO support for the “centrality of the multilateral trading system”, killing off global trade talks and calling into question the role of the WTO, the only such “multilateral” venue. \nLighthizer, hailing the end of an “outdated” system, said breaking the impasse freed like-minded countries to pursue deals in key areas without others holding them back. RIPPED APART BY CHINESE “MARKET ECONOMY” ROW \nPresident Donald Trump wants to end the “horrible” U.S. trade deficit with China and says China trades unfairly, with state-backed firms subsidising goods for export at discounted prices. Washington frequently fights back with punitive tariffs on Chinese goods. \nChina says the WTO agreed, when it joined in 2001, that 15 years later it would be respected as a “market economy” and its prices would be taken at face value. It has taken legal action, and Lighthizer has said it would be “cataclysmic for the WTO” if China wins. PRESSING THE “NATIONAL SECURITY” BUTTON \nThe WTO rulebook allows an exemption from its rules on national security grounds. But until last year it was considered virtually taboo, out of concern that countries might use it as a pretext to duck their obligations. \nSuddenly, it arose in a dispute over an economic boycott of Qatar and in a U.S. plan for restrictions on Chinese steel and aluminium which prompted concern from China, the EU, Brazil, Australia, Taiwan and Russia. \nTrump received a confidential U.S. Commerce Department report on steel last week and will get its report on aluminium on Jan. 22. If the reports support such action, he could impose broad tariffs or import quotas within 90 days. Reporting by Tom Miles; editing by Andrew Roche", "external_links": [], "published": "2018-01-19T17:12:00.000+02:00", "crawled": "2018-01-19T17:34:17.000+02:00", "highlightTitle": ""}