{"organizations": [], "uuid": "9cb459f8b95894fa8a0e04ee15b011562a0953a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/ukraine-cenbank-rates/update-2-ukraine-surprises-with-aggressive-interest-rate-hike-idUSL8N1PK3U7", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Ukraine surprises with aggressive interest rate hike", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T16:15:00.000+02:00", "replies_count": 0, "uuid": "9cb459f8b95894fa8a0e04ee15b011562a0953a9"}, "author": "", "url": "https://www.reuters.com/article/ukraine-cenbank-rates/update-2-ukraine-surprises-with-aggressive-interest-rate-hike-idUSL8N1PK3U7", "ord_in_thread": 0, "title": "UPDATE 2-Ukraine surprises with aggressive interest rate hike", "locations": [], "entities": {"persons": [{"name": "yakiv smoliy", "sentiment": "none"}, {"name": "natalia zinets  kiev", "sentiment": "none"}], "locations": [{"name": "ukraine", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "positive"}, {"name": "imf", "sentiment": "none"}, {"name": "international monetary fund", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 2:15 PM / Updated an hour ago UPDATE 2-Ukraine surprises with aggressive interest rate hike Reuters Staff \n(Adds quotes, details, background) \nBy Natalia Zinets \nKIEV, Jan 25 (Reuters) - The Ukrainian central bank unexpectedly raised its key rate for a third time on Thursday and said the $17.5 billion International Monetary Fund programme and future cooperation with the Fund remained vital for economic stability. \nThe bank would initiate talks soon on a new IMF aid programme for the 2019-20 period to help Ukraine meet high external debt payments, the bank’s top official said. \nDelays in implementing reforms have held up disbursement of funding under the present programme, which expires in the first quarter next year, and raised concern about Ukraine’s willingness to modernise the economy and root out corruption as elections approach in 2019. \nActing central bank governor Yakiv Smoliy said it was vital Ukraine continued working with the Fund as it faces external debt payments in 2018-2020 of more than $16 billion. \n“A new IMF programme is an integral part of macro-financial stability and support for the central bank’s reserves will be essential given that payments to service external debt hit a peak in 2019-2020,” he told a briefing. \nEarlier the bank lowered its end-2018 reserves forecast to $20.5 billion from $22.2 billion and estimated central bank coffers would shrink further to $17.8 billion in 2019. \nIt said the 2018 estimate depended on Ukraine receiving a long-delayed loan tranche of $2 billion from the IMF this year, as well as funding from the European Union and the World Bank. \nMeanwhile it raised the main interest rate 1.5 percentage points to 16 percent to contain stubbornly high inflation of 13.7 percent as of end-December, despite economists’ forecasts in a Reuters poll that rates would be kept on hold. \nRates could be raised further if there are no signs of inflationary pressures easing in the short term, the bank said in a statement, adding that rising food prices and household incomes remain a key risk in 2018. \n“The tighter monetary policy will help decrease inflation and bring it back to the target range in the middle of 2019,” the bank said. \nIt raised its 2018 inflation forecast to 8.9 percent from 7.3 percent and forecast for 2019 to 5.8 percent from 5 percent. \nThe bank said the government’s softer fiscal policy, including higher social spending, also posed a considerable risk to inflation expectations. (Writing by Alessandra Prentice; Editing by Richard Balmforth)", "external_links": [], "published": "2018-01-25T16:15:00.000+02:00", "crawled": "2018-01-25T16:36:57.020+02:00", "highlightTitle": ""}