{"organizations": [], "uuid": "8d8234ded2fc1680ba977f6835ca19e3004c77db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219280676&w=1200&r=LYNXMPEE030I9", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-usa-turkey-ministry/turkey-says-u-s-conviction-of-banker-unjust-and-unfortunate-idUKKBN1ET0P8", "country": "US", "domain_rank": 408, "title": "Turkey says U.S. conviction of banker is 'unprecedented interference'", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T12:03:00.000+02:00", "replies_count": 0, "uuid": "8d8234ded2fc1680ba977f6835ca19e3004c77db"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-turkey-ministry/turkey-says-u-s-conviction-of-banker-unjust-and-unfortunate-idUKKBN1ET0P8", "ord_in_thread": 0, "title": "Turkey says U.S. conviction of banker is 'unprecedented interference'", "locations": [], "entities": {"persons": [{"name": "bekir bozdag", "sentiment": "none"}, {"name": "mehmet hakan atilla", "sentiment": "none"}, {"name": "erdogan", "sentiment": "none"}, {"name": "tulay karadeniz", "sentiment": "none"}, {"name": "bulent arinc", "sentiment": "none"}, {"name": "tayyip erdogan", "sentiment": "none"}], "locations": [{"name": "turkey", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "ataturk international airport", "sentiment": "none"}, {"name": "halkbank", "sentiment": "none"}, {"name": "istanbul", "sentiment": "none"}], "organizations": [{"name": "nato", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 7:57 AM / Updated 4 hours ago Turkey says U.S. conviction of banker is 'unprecedented interference' Tulay Karadeniz 4 Min Read \nANKARA (Reuters) - Turkey on Thursday condemned the U.S. conviction of a Turkish banker for evading Iran sanctions as unprecedented meddling in its internal affairs, pushing back against a case that President Tayyip Erdogan has cast as a political attack. FILE PHOTO - Turkey's Prime Minister Tayyip Erdogan, accompanied by his deputies Bulent Arinc (not pictured) and Bekir Bozdag (R), speaks during a news conference at Ataturk International Airport in Istanbul in this June 3, 2013REUTERS/Stringer/Files \nWednesday’s court decision capped a trial that had strained diplomatic relations between the two countries and is likely to further aggravate tension between the NATO allies. \nThe case has angered Erdogan and his ministers, some of whom accuse U.S. court officials of ties to a cleric blamed for a 2016 coup attempt. Some of the testimony at the trial implicated senior officials, including Erdogan. Ankara has said the case was based on fabricated evidence. \nMehmet Hakan Atilla, an executive at Turkey’s majority state-owned Halkbank, was convicted on five of six counts in a Manhattan federal court, including bank fraud and conspiracy to violate U.S. sanctions law. \n“The U.S. court, in a process carried out by relying on so-called ‘evidence’, which is fake and open to political exploitation, ... made an unprecedented interference in Turkey’s internal affairs,” Turkey’s foreign ministry said. \nU.S. prosecutors have charged a total of nine people in the case, including a former economy minister, Zafer Caglayan. However, only Atilla and a wealthy Turkish-Iranian gold trader, Reza Zarrab, are in U.S. custody. \nErdogan, who has yet to comment on the decision, has previously dismissed the trial as a politically motivated attack on his government, and has attempted to use it to tap into anti-American sentiment among his supporters. \nAnkara has not, however, threatened to take concrete measures. \n“POLITICAL PLOT” \nThe U.S. case against Atilla was based on the testimony of the gold trader Zarrab, who cooperated with U.S. prosecutors and pleaded guilty to charges of leading a scheme to evade U.S. sanctions against Iran. \nIn his testimony Zarrab implicated top Turkish politicians, including Erdogan. Zarrab said Erdogan, who has governed Turkey for nearly 15 years, personally authorised two Turkish banks to join the scheme when he was prime minister. \n“The Zarrab court case is a political plot”, Deputy Prime Minister Bekir Bozdag tweeted on Thursday. \nHalkbank said Atilla had the right to appeal against the decision and said it had not been a party to the U.S. case. It noted there had been no financial or administrative decision taken against it by the court. \nThe bank has denied any wrongdoing and said its transactions were in line with local and international regulations. Halkbank shares were flat by late afternoon, giving up gains after advancing more than 4 percent. \nThe court decision is unlikely to damage Erdogan or his government at home, said Wolfango Piccoli of Teneo Intelligence, a London-based consultancy. \n“Domestically, I don’t believe it will make any difference at all... The government has managed to cast a huge shadow on it by portraying it as a plot against Turkey and the government,” Piccoli said. “I think it is much more important in terms of the bilateral relations with the United States. This is a relationship that has been difficult for some time.” \nLess clear was the potential fall-out for the banking sector, with some analysts seeing the possibility that one or more Turkish lenders could be hit by fines over the case. \n“The whole thing is really about what the consequences will be for the relationship between Turkey and the U.S.,” said Paul Fage of TD Securities in London. \n“Obviously, the U.S. will impose fines, and the question will be how Turkey is going to respond to that, and whether this is going to escalate into some tit-for-tat thing.” \nTurkey has said it will take any necessary measures to protect its banks from the potential impact of the case. “If anything is going to happen, in this situation we will stand by the banks,” Finance Minister Naci Agbal told Reuters last month. \n“We must not allow any eventuality that would weaken our banking system.” Additional reporting by Ali Kucukgocmen in Istanbul and Karin Strohecker in London; Writing by David Dolan; Editing by Nick Tattersall and Janet Lawrence", "external_links": [], "published": "2018-01-04T12:03:00.000+02:00", "crawled": "2018-01-04T12:25:10.004+02:00", "highlightTitle": ""}