{"organizations": [], "uuid": "36a1314ce8cc6b7c52233e10e9a18d7484529dfc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-inc-researchinventiv-health-announces-cfo-transition.html", "country": "US", "domain_rank": 767, "title": "INC Research/inVentiv Health Announces CFO Transition", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T01:36:00.000+02:00", "replies_count": 0, "uuid": "36a1314ce8cc6b7c52233e10e9a18d7484529dfc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-inc-researchinventiv-health-announces-cfo-transition.html", "ord_in_thread": 0, "title": "INC Research/inVentiv Health Announces CFO Transition", "locations": [], "entities": {"persons": [{"name": "alistair macdonald", "sentiment": "none"}, {"name": "greg rush", "sentiment": "none"}, {"name": "greg", "sentiment": "none"}, {"name": "alistair", "sentiment": "none"}, {"name": "rush", "sentiment": "none"}], "locations": [{"name": "raleigh", "sentiment": "none"}, {"name": "n.c.", "sentiment": "none"}], "organizations": [{"name": "inc", "sentiment": "negative"}, {"name": "inc research", "sentiment": "none"}, {"name": "executive leadership team", "sentiment": "none"}, {"name": "inc research/inventiv health", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "RALEIGH, N.C., Jan. 03, 2018 (GLOBE NEWSWIRE) -- INC Research/inVentiv Health (Nasdaq:INCR), the only fully integrated biopharmaceutical solutions organization, today announced that Greg Rush is stepping down as Chief Financial Officer (CFO) to pursue an opportunity at a private company. In order to ensure a smooth transition, Rush will remain as the company’s CFO until April 30, 2018.\nAlistair Macdonald, Chief Executive Officer of INC Research/inVentiv Health, said, “Greg is a valued member of the Executive Leadership Team. He played an important role in INC Research’s initial public offering, successfully merging INC Research and inVentiv Health and building great momentum in our integration. On behalf of everyone here, I thank Greg for his contributions to the company and look forward to his continued guidance as we work to identify his successor.”\nRush said, “As I prepare to start the next chapter of my career, I am grateful for my four years at INC Research/inVentiv Health. Serving alongside Alistair and our talented and dedicated team has been a privilege and an honor. I am committed to ensuring a seamless transition, and I am confident that INC Research/inVentiv Health will continue to positively address the needs of biopharmaceutical companies, patients, physicians and payers around the world for many years to come.”\nThe company has initiated a search for a permanent CFO and will retain an executive search firm to assist with that process. The company expects to consider both internal and external candidates for the role. Jason Meggs, Executive Vice President and CFO, Commercial Solutions, will act as interim CFO, beginning April 30, 2018, should the search continue to be active at that time.\nAbout INC Research/inVentiv Health\nINC Research/inVentiv Health (Nasdaq:INCR) is the only fully integrated biopharmaceutical solutions organization. Our company, including a Contract Research Organization (CRO) and Contract Commercial Organization (CCO), is purpose-built to address new market realities where clinical and commercial share expertise, data and insights to accelerate biopharmaceutical performance. With more than 21,000 employees and the ability to support customers in more than 110 countries, our global scale and deep therapeutic alignment enables INC Research/inVentiv Health to help customers successfully navigate an increasingly complex environment. For more information, visit incresearch.com or inventivhealth.com .\nCautionary Statement Regarding Forward-Looking Statements\nExcept for historical information, all of the statements, expectations, and assumptions contained in this press release are forward-looking statements as that term is defined in the Private Securities Litigation Reform Act of 1995. Actual results might differ materially from those explicit or implicit in the forward-looking statements. Important factors that could cause actual results to differ materially include, but are not limited to: risks associated with the integration of our business with the business of inVentiv, and our operation of the combined business following the closing of the Merger; our ability to maintain or generate new business awards; our ability to increase our market share, grow our business, and execute our growth strategies; our backlog not being indicative of future revenues and our ability to realize the anticipated future revenue reflected in our backlog; our ability to adequately price our contracts and not overrun cost estimates; general and international economic, political, and other risks, including currency and stock market fluctuations and the uncertain economic environment; fluctuations in our financial results; reliance on key personnel; our customer or therapeutic area concentration; and the other risk factors set forth in our Form-Q for the quarter ended September 30, 2017, and other SEC filings, copies of which are available free of charge on our website at investor.incresearch.com . INC Research assumes no obligation and does not intend to update these forward-looking statements, except as required by law.\nContacts\nInvestor Relations:\nRonnie Speight\nVice President, Investor Relations\n+1 919 745 2745\ninvestor.relations@incresearch.com\nPress/Media:\nDanielle DeForge\nSenior Director, External Communications\n+1 202 210 5992\ndanielle.deforge@inventivhealth.com\nSource:INC Research, LLC", "external_links": ["https://www.globenewswire.com/Tracker?data=QBEcaiU2El-2pp00gYCIS9pyB_kmv8WQOMFY3i5Kf3jgnkfpD0qCjSFa9Dh6lojjdmM7YI3CqC-qiaCAEUrCmw==", "https://www.globenewswire.com/Tracker?data=ATkr9CdKrP5vc4GvCFNFR2fa0CW1RdqgnuDzx_WFPULEpk4_xk0me49i_Sf7mFum2A52srpJ-8N_2PgJZRPoJxOdJ_5FtRnN2y_KrRadiXcLK0OXYmK_m8ykEv7292GW7Ky7fZiBJ2wDBADVHGgLVA==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/6b90a654-b1dd-4f21-9a31-06cc2d39d207", "https://www.globenewswire.com/Tracker?data=0lwMvfWIoDnvRy3xf-I57KkPsdDYeMBPSynW3yGbHYx2846oWXVe3JHAdHJG_5WTKes5fL4Xa0wFsPtzeZ73cpa4onCFjqA0na3Ku-7gNj0=", "https://www.globenewswire.com/Tracker?data=ZUcLJDmhONPsbQzOGYtM9lCqcDx3EdtErnY0fgofo4AIXN0EI6cwCxD--Pow1-JqvSkfMdliUyCarKiN4NGr7CMu36G3ajgVDHVndKSE2gY=", "https://www.globenewswire.com/Tracker?data=ZUcLJDmhONPsbQzOGYtM9nL-C_vSitw4xdVrDquqQFXPBy7OL5pvzWCFUcP4UYvCVWk6_VXixIi6dJvC7-SCHv5YNZQuskpV02cWo6LAC986X-ItVsVuVwsJzU6Di2OGSXeDxx3CLq57GYsFqxbjwg=="], "published": "2018-01-04T01:36:00.000+02:00", "crawled": "2018-01-04T05:27:05.008+02:00", "highlightTitle": ""}