{"organizations": [], "uuid": "20567419dc0de836798d527d7ceb453b98882eb1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/business-wire-reinsurance-group-of-america-reports-fourth-quarter-results.html", "country": "US", "domain_rank": 767, "title": "Reinsurance Group of America Reports Fourth-Quarter Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T00:15:00.000+02:00", "replies_count": 0, "uuid": "20567419dc0de836798d527d7ceb453b98882eb1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/business-wire-reinsurance-group-of-america-reports-fourth-quarter-results.html", "ord_in_thread": 0, "title": "Reinsurance Group of America Reports Fourth-Quarter Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "st. louis", "sentiment": "none"}], "organizations": [{"name": "reinsurance group of america reports", "sentiment": "negative"}, {"name": "reinsurance group of america", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Earnings per diluted share: $18.49 from net income, $2.60 from adjusted operating income* Full-year earnings per diluted share: $27.71 from net income, $10.84 from adjusted operating income* Tax Cuts and Jobs Act of 2017 tax benefit estimate of $1.0 billion, or net income per diluted\nshare of $15.71 for the quarter ROE 22.7 percent and adjusted operating ROE* 11.0 percent for the full year\nST. LOUIS--(BUSINESS WIRE)-- Reinsurance Group of America, Incorporated (NYSE: RGA), a leading global provider of life reinsurance, reported fourth-quarter net income of $1,216.9 million, or $18.49 per diluted share, compared with $190.1 million, or $2.92 per diluted share, in the prior-year quarter. Adjusted operating income* totaled $170.9 million, or $2.60 per diluted share, compared with $171.3 million, or $2.63 per diluted share, the year before. Net foreign currency fluctuations had a favorable effect of $0.06 per diluted share on net income and on adjusted operating income.\nThe Tax Cut and Jobs Act of 2017 (“U.S. Tax Reform”) was enacted on December 22, 2017, reducing the statutory federal income tax rate from 35 percent to 21 percent, effective January 1, 2018. The estimated impact of U.S. Tax Reform was a tax benefit, recognized in net income during the fourth quarter, of approximately $1.0 billion, or $15.71 per diluted share. The estimated impact primarily relates to the rate change on the Company’s net deferred tax liabilities existing at the date of enactment, and did not affect RGA’s adjusted operating income, a non-GAAP financial measure. The impact of U.S. Tax Reform may differ from this estimate, and is based on the best information currently available and may change as a result of changes in interpretations and the Company's assumptions.\nQuarterly Results Year-to-Date Results ($ in thousands, except per share data) 2017 2016 2017 2016 Net premiums $ 2,505,186 $ 2,493,163 $ 9,841,130 $ 9,248,871 Net income 1,216,888 190,149 1,822,181 701,443 Net income per diluted share 18.49 2.92 27.71 10.79 Adjusted operating income* 170,899 171,259 712,686 632,598 Adjusted operating income per diluted share* 2.60 2.63 10.84 9.73 Book value per share 148.48 110.31 Book value per share, excluding accumulated other comprehensive income (AOCI)* 118.88 92.59 Total assets 60,514,818 53,097,879 * See ‘Use of Non-GAAP Financial Measures’ below\nBook value per share at December 31, 2017, totaled $148.48 including accumulated other comprehensive income (“AOCI”), and $118.88 excluding AOCI*. RGA expects to adopt in its issued financial statements a reclassification between AOCI and retained earnings related to a proposed Accounting Standard Update (“ASU”) issued by the Financial Accounting Standards Board on January 18, 2018. The anticipated impact of adopting the proposed ASU will be an increase in AOCI and a reduction in retained earnings of approximately $156.4 million resulting in a reduction in book value per share, excluding AOCI, of $2.42.\nFull-year 2017 net income totaled $1,822.2 million, or $27.71 per diluted share, versus $701.4 million, or $10.79 per diluted share in 2016. The effect of the reduced U.S. corporate tax rate on 2017 net income totaled $1.0 billion, or $15.72 per diluted share. Adjusted operating income for the full year increased to $712.7 million, or $10.84 per diluted share, from $632.6 million, or $9.73 per diluted share, the year before. The reduced U.S. corporate tax rate benefit did not affect adjusted operating income, a non-GAAP financial measure. Net foreign currency fluctuations had an immaterial effect on net income and adjusted operating income. Net premiums totaled $9.8 billion, increasing 6 percent in 2017. Full-year premiums reflected favorable foreign currency effects of $25.9 million.\nIn the fourth quarter, consolidated net premiums totaled $2.5 billion, up slightly from last year’s fourth quarter, with favorable net foreign currency effects of $43.2 million. Excluding spread-based businesses and the value of associated derivatives, investment income rose slightly over year-ago levels, as a 7 percent increase in average invested assets was offset by the effect of lower yields on new money and reinvested assets, and lower variable investment income. The average investment yield, excluding spread businesses, was down 31 basis points from the fourth quarter of 2016 to 4.38 percent, reflecting lower yields on new money and reinvested assets, and lower variable investment income. The average investment yield was 43 basis points lower than the third-quarter yield due primarily to a lower level of variable investment income.\nPrimarily as a result of U.S. Tax Reform, the effective tax rate on pre-tax net income was (376.3) percent for the fourth quarter, and (59.5) percent for the full year. The effective tax rate was approximately 30.4 percent on pre-tax adjusted operating income for the fourth quarter. The Company's effective tax rate on pre-tax adjusted operating income was below the expected effective rate of 33 to 34 percent due to the recognized income tax benefits associated with an adjustment to prior-period tax accruals, as well as the tax treatment of uncertain tax positions related to foreign jurisdictions. For the full year, the effective tax rate was 31.4 percent on pre-tax adjusted operating income.\nAnna Manning, president and chief executive officer, commented, “U.S. Tax Reform and a number of unusual items contributed to a noisy fourth quarter, but if you strip away the noise, it was a solid quarter, capping off an excellent year.\n“In the quarter, we continued to benefit from good earnings diversity, as strong results in the EMEA region and Canada, offset modest weakness in U.S. and Asia Traditional business. Corporate expenses were elevated this quarter due to the write-off of certain capitalized project costs and accelerated pension benefits that together reduced pre-tax adjusted operating income by approximately $30 million. Premiums were up slightly in the quarter, negatively affected by certain treaty recaptures in Australia and the modification of a large health treaty in the U.S. and Latin America segment. Underlying momentum remained favorable overall.\n“U.S. Tax Reform resulted in a one-time increase to our net income and stockholders' equity in the quarter. More importantly, we expect ongoing benefits from this legislation because of a lower effective tax rate for RGA and a more level playing field, as compared with our global competitors.\n“We closed a number of in-force and other transactions during the quarter, bringing total deployment for the year to approximately $225 million. We ended the year with an excess capital position of approximately $1.4 billion.\n“Looking forward, we remain optimistic about the future and our business prospects. RGA is well positioned in its markets, we have a proven strategy, and a long track record of successful execution. We anticipate ongoing change in the life insurance industry, and RGA continues to innovate and add to its capabilities in order to help our clients successfully address these industry challenges and opportunities.”\nSEGMENT RESULTS\nU.S. and Latin America\nTraditional\nThe U.S. and Latin America Traditional segment reported pre-tax income of $92.4 million, compared with $131.5 million in the fourth quarter of 2016. Pre-tax adjusted operating income totaled $93.8 million for the quarter, compared with $129.3 million in last year’s fourth quarter. Results for the current quarter reflected modestly unfavorable claims experience in the Individual Mortality segment, and poor performance in Group. The year-ago period benefited from higher variable investment income and moderately favorable claims results in the Individual Mortality line of business. For the full year, pre-tax income increased to $373.4 million from $371.1 million and pre-tax adjusted operating income totaled $375.0 million compared with $375.3 million in 2016. Mortality experience for the full year of 2017 was in line with management's expectations.\nTraditional net premiums decreased 3 percent from last year’s fourth quarter to $1,389.5 million due to the negotiated modification of an existing health treaty that effectively reduced premiums in the quarter by about $55 million with limited impact on income. Net premiums increased 2 percent for the full year, totaling $5,356.3 million.\nFinancial Solutions\nThe Asset-Intensive business reported pre-tax income of $80.8 million compared with $72.3 million last year. Fourth-quarter pre-tax adjusted operating income improved to $55.3 million from $46.7 million in the prior-year period, due to the addition of income from a new in-force transaction written earlier this year, as well as the impact of favorable equity markets. Full-year pre-tax income totaled $320.7 million, up from $224.1 million in 2016. Pre-tax adjusted operating income increased to $229.4 million from $205.0 million for the full year.\nThe Financial Reinsurance business reported pre-tax income and pre-tax adjusted operating income of $21.1 million, up from $14.4 million the year before, due to strong, recent new business volumes. For the full year, pre-tax income and pre-tax adjusted operating income totaled $80.9 million compared with $59.2 million in 2016.\nCanada\nTraditional\nThe Canada Traditional segment reported pre-tax income of $39.3 million, compared with $37.0 million the year before. Pre-tax adjusted operating income totaled $38.6 million, compared with $34.8 million in the fourth quarter of 2016. The current quarter reflected favorable individual mortality experience. Foreign currency exchange rates had a favorable effect of $1.9 million on pre-tax income and $1.8 million on pre-tax adjusted operating income. For the full year, pre-tax income totaled $120.2 million compared with $134.7 million and pre-tax adjusted operating income totaled $113.9 million versus $125.6 million the year before. Foreign currency exchange rates favorably affected pre-tax income and pre-tax adjusted operating income by $3.2 million for the full year.\nReported net premiums totaled $239.0 million for the quarter, slightly down from $241.9 million in the year-ago period due to the continued effects of the previously disclosed lost creditor business treaty. Net foreign currency fluctuations had a favorable effect of $11.5 million on net premiums. Net premiums for the full year totaled $902.0 million compared with $928.6 million in 2016. Net foreign currency fluctuations favorably affected net premiums by $18.5 million for the full year.\nFinancial Solutions\nThe Canada Financial Solutions business segment, which consists of longevity and fee-based transactions, reported fourth-quarter pre-tax income and pre-tax adjusted operating income of $4.2 million, compared with $4.1 million a year ago, with both periods reflecting favorable longevity experience. Net foreign currency fluctuations favorably affected pre-tax income and pre-tax adjusted operating income by $0.2 million. Pre-tax income and pre-tax adjusted operating income totaled $16.6 million for the full year, up from $7.9 million in 2016. For the full year, foreign currency exchange rates favorably affected pre-tax income and pre-tax adjusted operating income by $0.4 million.\nEurope, Middle East and Africa (EMEA)\nTraditional\nThe EMEA Traditional segment reported pre-tax income and pre-tax adjusted operating income of $29.7 million, up from $15.8 million in last year’s fourth quarter. The current-period results were driven by favorable mortality and morbidity experience, primarily in the U.K. Net foreign currency fluctuations favorably affected pre-tax income and pre-tax adjusted operating income by $2.0 million. For the full year, pre-tax income totaled $70.5 million compared with $30.1 million and pre-tax adjusted operating income totaled $70.4 million compared with $30.1 in the prior year. Full-year net foreign currency fluctuations favorably affected pre-tax income and pre-tax adjusted operating income by $1.5 million.\nReported net premiums increased 7 percent from the prior-year period to $321.9 million due to new business across the segment and growth of existing treaties. Foreign currency exchange rates favorably affected net premiums by $19.5 million. For the full year, net premiums totaled $1,301.6 million, with an adverse effect of $8.3 million from foreign currency exchange rates.\nFinancial Solutions\nThe EMEA Financial Solutions business segment includes longevity, asset-intensive and fee-based transactions. Pre-tax income totaled $31.7 million, compared with $41.3 million in the year-ago period. Pre-tax adjusted operating income totaled $34.5 million, compared with $36.7 million the year before. Current-period results reflected favorable longevity experience, while the prior year reflected favorable experience in both asset-intensive and longevity. Net foreign currency fluctuations favorably affected pre-tax income by $2.1 million and pre-tax adjusted operating income by $2.3 million. For the full year, pre-tax income totaled $123.5 million compared with $138.0 million in 2016. Pre-tax adjusted operating income for the year totaled $118.2 million versus $122.4 million the year before. Net foreign currency fluctuations adversely affected full-year pre-tax income by $5.8 million and pre-tax adjusted operating income by $4.6 million.\nAsia Pacific\nTraditional\nThe Asia Pacific Traditional segment reported pre-tax income and pre-tax adjusted operating income of $27.2 million, up from $18.5 million in the prior-year period. The increase versus the year-ago period reflected an improvement in Australia, from a loss in the year-ago period to a modest profit in the current quarter. In Asia, which excludes Australia, the current period reflected modestly unfavorable experience versus favorable experience in the year-ago period. Net foreign currency fluctuations had an adverse effect of $1.1 million on pre-tax income and pre-tax adjusted operating income. For the full year, pre-tax income and pre-tax adjusted operating income totaled $148.8 million compared with $113.9 million in 2016. Net foreign currency fluctuations had an adverse effect of $1.4 million on pre-tax income and pre-tax adjusted operating income for the full year.\nReported net premiums rose 11 percent to $495.4 million, with strong growth across Asia, primarily from new and existing treaties in Hong Kong and Southeast Asia. The strong premium growth in Asia was offset by a material reduction in premiums in Australia due to the recapture of several treaties. Foreign currency exchange rates had a favorable effect of $8.5 million on net premiums. For the full year, net premiums totaled $2,053.0 million, an increase of 22 percent over the prior year. Net foreign currency fluctuations had a favorable effect of $22.7 million on net premiums for the full year.\nFinancial Solutions\nThe Asia Pacific Financial Solutions business segment includes asset-intensive and fee-based transactions. Pre-tax income totaled $2.1 million, compared with pre-tax losses of $12.0 million in the prior-year period. Pre-tax adjusted operating income totaled $0.7 million, compared with pre-tax adjusted operating losses of $6.1 million in the prior-year quarter. Current-period results reflected better-than-expected results from a treaty that is in runoff, with the prior-year period losses due to unfavorable results on the same treaty. Net foreign currency fluctuations had a favorable effect of $0.2 million on pre-tax losses and pre-tax adjusted operating losses. Pre-tax income for the full year totaled $13.1 million compared with $4.1 million in 2016. Pre-tax adjusted operating income was $2.6 million for the year versus pre-tax operating losses of $2.4 million a year ago. Foreign currency exchange rates had a favorable effect of $0.3 million on pre-tax net income and $0.2 million on pre-tax adjusted operating income for the full year.\nCorporate and Other\nThe Corporate and Other segment’s pre-tax losses totaled $73.0 million, compared with $27.4 million the year before. Pre-tax adjusted operating losses were $59.6 million versus year-ago pre-tax adjusted operating losses of $26.3 million. General expenses were higher this period, due to numerous items, including the write-off of capitalized project costs, increased pension expense, and higher incentive-based compensation expenses. For the full year, pre-tax losses totaled $125.0 million compared with $39.2 million in 2016. Pre-tax adjusted operating losses were $117.4 million versus $88.4 million in the prior year.\nCompany Guidance\nOn an annual basis, the Company provides financial guidance based upon the intermediate term rather than giving a range of annual earnings per share for an upcoming year. This better reflects the long-term nature of the business, as the Company accepts risks over very long periods of time, up to 30 years or longer in some cases. While more predictable over longer-term horizons, RGA's business is subject to inherent short-term volatility, primarily due to mortality and morbidity experience.\nOver the intermediate term, the Company continues to target growth in adjusted operating earnings per share in the 5 to 8 percent range, and adjusted operating return on equity of 10 to 12 percent. It is presumed that there are no significant changes in the investment environment from current levels, and the Company will deploy $300 to $400 million of excess capital, on average, annually. These guidance ranges are based upon “normalized” results. The Company currently estimates that as a result of tax reform, its effective tax rate for 2018 and thereafter will be in the range of 21 percent to 24 percent. The forward guidance for adjusted operating earnings per share is assumed to be on an equivalent tax basis, using 21 percent to 24 percent for all years, including 2017 on a pro forma basis.\nTodd C. Larson, senior executive vice president and chief financial officer, commented, “We believe that our adjusted operating EPS range is appropriate, and we expect the combination of organic growth, execution of block transactions and effective capital management to allow us to reach our financial targets. We have faced significant macro headwinds in terms of weak foreign currencies and sustained low interest rates over the past several years, and we assume that there will be some level of ongoing headwinds for the foreseeable future. Nevertheless, we expect that we can overcome these challenges and achieve our goals.”\nDividend Declaration\nThe board of directors declared a regular dividend of $0.50, payable March 1 to shareholders of record as of February 8.\nEarnings Conference Call\nA conference call to discuss fourth-quarter results will begin at 11 a.m. Eastern Time on Tuesday, January 30. Interested parties may access the call by dialing 877-604-9674 (domestic) or 719-325-4917 (international). The access code is 4138948. A live audio webcast of the conference call will be available on the Company’s Investor Relations website at www.rgare.com . A replay of the conference call will be available at the same address for 90 days following the conference call.\nThe Company has posted to its website a Quarterly Financial Supplement that includes financial information for all segments as well as information on its investment portfolio. Additionally, the Company posts periodic reports, press releases and other useful information on its Investor Relations website.\nUse of Non-GAAP Financial Measures\nRGA uses a non-GAAP financial measure called adjusted operating income as a basis for analyzing financial results. This measure also serves as a basis for establishing target levels and awards under RGA’s management incentive programs. Management believes that adjusted operating income, on a pre-tax and after-tax basis, better measures the ongoing profitability and underlying trends of the Company’s continuing operations, primarily because that measure excludes substantially all of the effect of net investment related gains and losses, as well as changes in the fair value of certain embedded derivatives and related deferred acquisition costs. These items can be volatile, primarily due to the credit market and interest rate environment, and are not necessarily indicative of the performance of the Company’s underlying businesses. Additionally, adjusted operating income excludes any net gain or loss from discontinued operations, the cumulative effect of any accounting changes, tax reform and other items that management believes are not indicative of the Company’s ongoing operations. The definition of adjusted operating income can vary by company and is not considered a substitute for GAAP net income.\nBook value per share excluding the impact of AOCI is a non-GAAP financial measure that management believes is important in evaluating the balance sheet in order to ignore the effects of unrealized amounts primarily associated with mark-to-market adjustments on investments and foreign currency translation.\nAdjusted operating income per diluted share is a non-GAAP financial measure calculated as adjusted operating income divided by weighted average diluted shares outstanding. Adjusted operating return on equity is a non-GAAP financial measure calculated as adjusted operating income divided by average stockholders’ equity excluding AOCI. Similar to adjusted operating income, management believes these non-GAAP financial measures better reflect the ongoing profitability and underlying trends of the Company’s continuing operations, they also serve as a basis for establishing target levels and awards under RGA’s management incentive programs.\nReconciliations from GAAP net income, book value per share, net income per diluted share and average stockholders’ equity are provided in the following tables. Additional financial information can be found in the Quarterly Financial Supplement on RGA’s Investor Relations website at www.rgare.com in the “Financial Information” section.\nAbout RGA\nReinsurance Group of America, Incorporated (RGA), a Fortune 500 company, is among the leading global providers of life reinsurance and financial solutions, with approximately $3.3 trillion of life reinsurance in force and assets of $60.5 billion as of December 31, 2017. Founded in 1973, RGA today is recognized for its deep technical expertise in risk and capital management, innovative solutions, and commitment to serving its clients. With headquarters in St. Louis, Missouri, and operations around the world, RGA delivers expert solutions in individual life reinsurance, individual living benefits reinsurance, group reinsurance, health reinsurance, facultative underwriting, product development, and financial solutions. To learn more about RGA and its businesses, visit the company’s website at www.rgare.com .\nCautionary Note Regarding Forward-Looking Statements\nThis release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including, among others, statements relating to projections of the earnings, revenues, income or loss, ratios, future financial performance, and growth potential of Reinsurance Group of America, Incorporated and its subsidiaries (which we refer to in the previous paragraphs as “we,” “us” or “our”). The words “intend,” “expect,” “project,” “estimate,” “predict,” “anticipate,” “should,” “believe,” and other similar expressions also are intended to identify forward-looking statements. Forward-looking statements are inherently subject to risks and uncertainties, some of which cannot be predicted or quantified. Future events and actual results, performance and achievements could differ materially from those set forth in, contemplated by, or underlying the forward-looking statements.\nNumerous important factors could cause actual results and events to differ materially from those expressed or implied by forward-looking statements including, without limitation, (1) adverse capital and credit market conditions and their impact on the Company’s liquidity, access to capital, and cost of capital, (2) the impairment of other financial institutions and its effect on the Company’s business, (3) requirements to post collateral or make payments due to declines in market value of assets subject to the Company’s collateral arrangements, (4) the fact that the determination of allowances and impairments taken on the Company’s investments is highly subjective, (5) adverse changes in mortality, morbidity, lapsation, or claims experience, (6) changes in the Company’s financial strength and credit ratings and the effect of such changes on the Company’s future results of operations and financial condition, (7) inadequate risk analysis and underwriting, (8) general economic conditions or a prolonged economic downturn affecting the demand for insurance and reinsurance in the Company’s current and planned markets, (9) the availability and cost of collateral necessary for regulatory reserves and capital, (10) market or economic conditions that adversely affect the value of the Company’s investment securities or result in the impairment of all or a portion of the value of certain of the Company’s investment securities, that in turn could affect regulatory capital, (11) market or economic conditions that adversely affect the Company’s ability to make timely sales of investment securities, (12) risks inherent in the Company’s risk management and investment strategy, including changes in investment portfolio yields due to interest rate or credit quality changes, (13) fluctuations in U.S. or foreign currency exchange rates, interest rates, or securities and real estate markets, (14) adverse litigation or arbitration results, (15) the adequacy of reserves, resources, and accurate information relating to settlements, awards, and terminated and discontinued lines of business, (16) the stability of and actions by governments and economies in the markets in which the Company operates, including ongoing uncertainties regarding the amount of United States sovereign debt and the credit ratings thereof, (17) competitive factors and competitors’ responses to the Company’s initiatives, (18) the success of the Company’s clients, (19) successful execution of the Company’s entry into new markets, (20) successful development and introduction of new products and distribution opportunities, (21) the Company’s ability to successfully integrate acquired blocks of business and entities, (22) action by regulators who have authority over the Company’s reinsurance operations in the jurisdictions in which it operates, (23) the Company’s dependence on third parties, including those insurance companies and reinsurers to which the Company cedes some reinsurance, third-party investment managers, and others, (24) the threat of natural disasters, catastrophes, terrorist attacks, epidemics, or pandemics anywhere in the world where the Company or its clients do business, (25) interruption or failure of the Company’s telecommunication, information technology, or other operational systems, or the Company’s failure to maintain adequate security to protect the confidentiality or privacy of personal or sensitive data stored on such systems, (26) changes in laws, regulations, and accounting standards applicable to the Company, its subsidiaries, or its business, (27) the benefits or burdens associated with the Tax Cuts and Jobs Act of 2017 may be different than expected, (28) the effect of the Company’s status as an insurance holding company and regulatory restrictions on its ability to pay principal of and interest on its debt obligations and (29) other risks and uncertainties described in this document and in the Company’s other filings with the Securities and Exchange Commission.\nForward-looking statements should be evaluated together with the many risks and uncertainties that affect our business, including those mentioned in this document and described in the periodic reports we file with the Securities and Exchange Commission. These forward-looking statements speak only as of the date on which they are made. We do not undertake any obligations to update these forward-looking statements, even though our situation may change in the future. We qualify all of our forward-looking statements by these cautionary statements. For a discussion of the risks and uncertainties that could cause actual results to differ materially from those contained in the forward-looking statements, you are advised to see Item 1A - “Risk Factors” in the 2016 Annual Report.\nREINSURANCE GROUP OF AMERICA, INCORPORATED AND SUBSIDIARIES Reconciliation of Consolidated Net Income to Adjusted Operating Income (Dollars in thousands, except per share data) (Unaudited) Three Months Ended December 31, 2017 2016 Diluted Diluted Earnings Per Earnings Per Share Share Net income $ 1,216,888 $ 18.49 $ 190,149 $ 2.92 Reconciliation to adjusted operating income: Capital (gains) losses, derivatives and other, included in investment related gains/losses, net 17,806 0.28 66,640 1.02 Capital (gains) losses on funds withheld, included in investment income, net of related expenses (2,036 ) (0.03 ) (5,355 ) (0.08 ) Embedded derivatives: Included in investment related gains/losses, net (34,787 ) (0.53 ) (72,343 ) (1.11 ) Included in interest credited (2,337 ) (0.04 ) (25,977 ) (0.40 ) DAC offset, net 14,449 0.22 17,957 0.28 Investment (income) loss on unit-linked variable annuities (3,108 ) (0.05 ) (2,741 ) (0.04 ) Interest credited on unit-linked variable annuities 3,108 0.05 2,741 0.04 Non-investment derivatives 27 — 188 — Statutory tax rate changes (1,039,111 ) (15.79 ) — — Adjusted operating income $ 170,899 $ 2.60 $ 171,259 $ 2.63 (Unaudited) Twelve Months Ended December 31, 2017 2016 Diluted Diluted Earnings Per Earnings Per Share Share Net income $ 1,822,181 $ 27.71 $ 701,443 $ 10.79 Reconciliation to adjusted operating income: Capital (gains) losses, derivatives and other, included in investment related gains/losses, net 10,385 0.16 (21,322 ) (0.33 ) Capital (gains) losses on funds withheld, included in investment income, net of related expenses (10,070 ) (0.15 ) (18,330 ) (0.28 ) Embedded derivatives: Included in investment related gains/losses, net (114,979 ) (1.75 ) (40,302 ) (0.62 ) Included in interest credited (26,169 ) (0.40 ) (18,289 ) (0.28 ) DAC offset, net 70,382 1.07 30,787 0.47 Investment (income) loss on unit-linked variable annuities (7,201 ) (0.11 ) (8,535 ) (0.13 ) Interest credited on unit-linked variable annuities 7,201 0.11 8,535 0.13 Non-investment derivatives 67 —\n(1,389 ) (0.02 ) Statutory tax rate changes (1,039,111 ) (15.80 ) —\n—\nAdjusted operating income $ 712,686 $ 10.84 $ 632,598 $ 9.73 REINSURANCE GROUP OF AMERICA, INCORPORATED AND SUBSIDIARIES Reconciliation of Consolidated Effective Income Tax Rates (Dollars in thousands) (Unaudited) Three Months Ended December 31, 2017 Effective Tax Pre-tax Income Income Taxes Rate GAAP income $ 255,494 $ (961,394 )\n(376.3\n)%\nReconciliation to adjusted operating income: Capital (gains) losses, derivatives and other, included in investment related gains/losses, net 27,908 10,102 Capital (gains) losses on funds withheld, included in investment income, net of related expenses (3,133 ) (1,097 ) Embedded derivatives: Included in investment related gains/losses, net (53,518 ) (18,731 ) Included in interest credited (3,595 ) (1,258 ) DAC offset, net 22,230 7,781 Investment (income) loss on unit-linked variable annuities (4,781 ) (1,673 ) Interest credited on unit-linked variable annuities 4,781 1,673 Non-investment derivatives 41 14 Statutory tax rate changes — 1,039,111 Adjusted operating income $ 245,427 $ 74,528\n30.4\n%\nReconciliation of Consolidated Income before Income Taxes to Pre-tax Adjusted Operating Income (Dollars in thousands) (Unaudited) Three Months Ended Twelve Months Ended December 31, December 31, 2017 2016 2017 2016 Income before income taxes $ 255,494 $ 295,543 $ 1,142,815 $ 1,043,946 Reconciliation to pre-tax adjusted operating income: Capital (gains) losses, derivatives and other, included in investment related gains/losses, net 27,908 103,944 19,969 (22,082 ) Capital (gains) losses on funds withheld, included in investment income, net of related expenses (3,133 ) (8,238 ) (15,493 ) (28,200 ) Embedded derivatives: Included in investment related gains/losses, net (53,518 ) (111,297 ) (176,890 ) (62,003 ) Included in interest credited (3,595 ) (39,964 ) (40,260 ) (28,137 ) DAC offset, net 22,230 27,625 108,280 47,364 Investment (income) loss on unit-linked variable annuities (4,781 ) (4,217 ) (11,078 ) (13,131 ) Interest credited on unit-linked variable annuities 4,781 4,217 11,078 13,131 Non-investment derivatives 41 289 103 (2,137 ) Pre-tax adjusted operating income $ 245,427 $ 267,902 $ 1,038,524 $ 948,751 REINSURANCE GROUP OF AMERICA, INCORPORATED AND SUBSIDIARIES Reconciliation of Pre-tax Income to Pre-tax Adjusted Operating Income (Dollars in thousands) (Unaudited)\nThree Months Ended December 31, 2017 Capital Change in (gains) losses, value of Pre-tax adjusted Pre-tax income derivatives embedded operating (loss) and other, net derivatives, net income (loss) U.S. and Latin America: Traditional $ 92,368 $ (6 ) $ 1,420 $ 93,782 Financial Solutions: Asset-Intensive 80,810 30,413 (1) (55,934 ) (2)\n55,289 Financial Reinsurance 21,085 — — 21,085 Total U.S. and Latin America 194,263 30,407 (54,514 ) 170,156 Canada Traditional 39,265 (647 ) — 38,618 Canada Financial Solutions 4,154 — — 4,154 Total Canada 43,419 (647 ) — 42,772 EMEA Traditional 29,735 (45 ) — 29,690 EMEA Financial Solutions 31,738 2,779 — 34,517 Total EMEA 61,473 2,734 — 64,207 Asia Pacific Traditional 27,212 15 — 27,227 Asia Pacific Financial Solutions 2,110 (1,408 ) — 702 Total Asia Pacific 29,322 (1,393 ) — 27,929 Corporate and Other (72,983 ) 13,346 — (59,637 ) Consolidated $ 255,494 $ 44,447 $ (54,514 ) $ 245,427 (1) Asset-Intensive is net of $19,631 DAC offset. (2) Asset-Intensive is net of $2,599 DAC offset. (Unaudited)\nThree Months Ended December 31, 2016\nCapital Change in (gains) losses, value of Pre-tax adjusted Pre-tax income derivatives embedded operating (loss) and other, net derivatives, net income (loss) U.S. and Latin America: Traditional $ 131,492 $ (336 ) $ (1,811 ) $ 129,345 Financial Solutions: Asset-Intensive 72,261 35,800 (1) (61,363 ) (2) 46,698 Financial Reinsurance 14,447 — — 14,447 Total U.S. and Latin America 218,200 35,464 (63,174 ) 190,490 Canada Traditional 37,026 (2,272 ) — 34,754 Canada Financial Solutions 4,065 — — 4,065 Total Canada 41,091 (2,272 ) — 38,819 EMEA Traditional 15,826 — — 15,826 EMEA Financial Solutions 41,328 (4,600 ) — 36,728 Total EMEA 57,154 (4,600 ) — 52,554 Asia Pacific Traditional 18,464 — — 18,464 Asia Pacific Financial Solutions (11,966 ) 5,846 — (6,120 ) Total Asia Pacific 6,498 5,846 — 12,344 Corporate and Other (27,400 ) 1,095 — (26,305 ) Consolidated $ 295,543 $ 35,533 $ (63,174 ) $ 267,902 (1) Asset-Intensive is net of $(60,462) DAC offset. (2) Asset-Intensive is net of $88,087 DAC offset. REINSURANCE GROUP OF AMERICA, INCORPORATED AND SUBSIDIARIES Reconciliation of Pre-tax Income to Pre-tax Adjusted Operating Income (Dollars in thousands) (Unaudited) Twelve Months Ended December 31, 2017 Capital Change in (gains) losses, value of Pre-tax adjusted Pre-tax income derivatives embedded operating (loss) and other, net derivatives, net income (loss) U.S. and Latin America: Traditional $ 373,434 $ 1 $ 1,605 $ 375,040 Financial Solutions: Asset-Intensive 320,708 81,620 (1) (172,930 ) (2) 229,398 Financial Reinsurance 80,876 — — 80,876 Total U.S. and Latin America 775,018 81,621 (171,325 ) 685,314 Canada Traditional 120,218 (6,285 ) — 113,933 Canada Financial Solutions 16,643 — — 16,643 Total Canada 136,861 (6,285 ) — 130,576 EMEA Traditional 70,486 (52 ) — 70,434 EMEA Financial Solutions 123,514 (5,323 ) — 118,191 Total EMEA 194,000 (5,375 ) — 188,625 Asia Pacific Traditional 148,786 15 — 148,801 Asia Pacific Financial Solutions 13,130 (10,498 ) — 2,632 Total Asia Pacific 161,916 (10,483 ) — 151,433 Corporate and Other (124,980 ) 7,556 — (117,424 ) Consolidated $ 1,142,815 $ 67,034 $ (171,325 ) $ 1,038,524 (1) Asset-Intensive is net of $62,455 DAC offset. (2) Asset-Intensive is net of $45,825 DAC offset. (Unaudited)\nTwelve Months Ended December 31, 2016\nCapital Change in (gains) losses, value of Pre-tax adjusted Pre-tax income derivatives embedded operating (loss) and other, net derivatives, net income (loss) U.S. and Latin America: Traditional $ 371,101 $ (339 ) $ 4,568 $ 375,330 Financial Solutions: Asset-Intensive 224,142 (52,840 ) (1) 33,680 (2) 204,982 Financial Reinsurance 59,238 — — 59,238 Total U.S. and Latin America 654,481 (53,179 ) 38,248 639,550 Canada Traditional 134,705 (9,056 ) — 125,649 Canada Financial Solutions 7,945 — — 7,945 Total Canada 142,650 (9,056 ) — 133,594 EMEA Traditional 30,059 (5 ) — 30,054 EMEA Financial Solutions 138,007 (15,595 ) — 122,412 Total EMEA 168,066 (15,600 ) — 152,466 Asia Pacific Traditional 113,928 (16 ) — 113,912 Asia Pacific Financial Solutions 4,063 (6,473 ) — (2,410 ) Total Asia Pacific 117,991 (6,489 ) — 111,502 Corporate and Other (39,242 ) (49,119 ) — (88,361 ) Consolidated $ 1,043,946 $ (133,443 ) $ 38,248 $ 948,751 (1) Asset-Intensive is net of $(81,024) DAC offset. (2) Asset-Intensive is net of $128,388 DAC offset. REINSURANCE GROUP OF AMERICA, INCORPORATED AND SUBSIDIARIES Per Share and Shares Data (In thousands, except per share data) (Unaudited) Three Months Ended Twelve Months Ended December 31, December 31, 2017 2016 2017 2016 Earnings per share from net income: Basic earnings per share $ 18.89 $ 2.96 $ 28.28 $ 10.91 Diluted earnings per share $ 18.49 $ 2.92 $ 27.71 $ 10.79 Diluted earnings per share from adjusted operating income $ 2.60 $ 2.63 $ 10.84 $ 9.73 Weighted average number of common and common equivalent shares outstanding 65,806 65,124\n65,753\n64,989 (Unaudited) At December 31,\n2017\n2016 Treasury shares\n14,686\n14,835 Common shares outstanding\n64,452\n64,303 Book value per share outstanding $ 148.48 $ 110.31 Book value per share outstanding, before impact of AOCI $ 118.88 $ 92.59 Reconciliation of Book Value Per Share to Book Value Per Share Excluding AOCI (Unaudited)\nAt December 31,\n2017 2016 Book value per share outstanding $ 148.48 $ 110.31 Less effect of AOCI: Accumulated currency translation adjustments\n(1.60\n) (2.68 ) Unrealized appreciation of securities\n31.85\n21.07 Pension and postretirement benefits\n(0.65\n) (0.67 ) Book value per share outstanding, before impact of AOCI $ 118.88 $ 92.59 Reconciliation of Stockholders' Average Equity to Stockholders' Average Equity Excluding AOCI\n(Dollars in thousands)\n(Unaudited)\nTwelve Months Ended\nDecember 31, 2017\nStockholders' average equity\n$\n8,030,184\nLess effect of AOCI: Accumulated currency translation adjustments\n(145,271\n) Unrealized appreciation of securities\n1,720,335\nPension and postretirement benefits\n(41,984\n) Stockholders' average equity, excluding AOCI\n$\n6,497,104\nREINSURANCE GROUP OF AMERICA, INCORPORATED AND SUBSIDIARIES Condensed Consolidated Statements of Income (Dollars in thousands) (Unaudited) Three Months Ended Twelve Months Ended December 31, December 31, 2017 2016 2017 2016 Revenues: Net premiums $ 2,505,186 $ 2,493,163 $ 9,841,130 $ 9,248,871 Investment income, net of related expenses 564,831 497,227 2,154,651 1,911,886 Investment related gains (losses), net: Other-than-temporary impairments on fixed maturity securities (21,659 ) (4,142 ) (42,639 ) (38,805 ) Other-than-temporary impairments on fixed maturity securities transferred to other comprehensive income — 74 — 74 Other investment related gains (losses), net 50,068 14,261 210,519 132,926 Total investment related gains (losses), net 28,409 10,193 167,880 94,195 Other revenue 134,017 68,715 352,108 266,559 Total revenues 3,232,443 3,069,298 12,515,769 11,521,511 Benefits and expenses: Claims and other policy benefits 2,147,729 2,116,045 8,518,917 7,993,375 Interest credited 152,972 64,089 502,040 364,691 Policy acquisition costs and other insurance expenses 402,001 370,134 1,466,646 1,310,540 Other operating expenses 229,411 175,634 710,690 645,509 Interest expense 37,435 41,422 146,025 137,623 Collateral finance and securitization expense 7,401 6,431 28,636 25,827 Total benefits and expenses 2,976,949 2,773,755 11,372,954 10,477,565 Income before income taxes 255,494 295,543 1,142,815 1,043,946 Provision for income taxes (961,394 ) 105,394 (679,366 ) 342,503 Net income $ 1,216,888 $ 190,149 $ 1,822,181 $ 701,443\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180129006136/en/\nReinsurance Group of America, Incorporated\nJeff Hopson, 636-736-7000\nSenior Vice President - Investor Relations\nSource: Reinsurance Group of America, Incorporated", "external_links": ["http://www.businesswire.com/news/home/20180129006136/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rgare.com&esheet=51749213&newsitemid=20180129006136&lan=en-US&anchor=www.rgare.com&index=2&md5=1715da4b98a84e05b559f7636158e82e", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rgare.com&esheet=51749213&newsitemid=20180129006136&lan=en-US&anchor=www.rgare.com&index=1&md5=1fa1d754e44b45ff7ee03cf2fdfb9f27", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rgare.com&esheet=51749213&newsitemid=20180129006136&lan=en-US&anchor=www.rgare.com&index=3&md5=d03f2c9d4a3f4ef013204b4a5dc374bf"], "published": "2018-01-30T00:15:00.000+02:00", "crawled": "2018-01-30T03:42:08.016+02:00", "highlightTitle": ""}