{"organizations": [], "uuid": "405d207f08e64c97a1378e5396e0505738599a0e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/10/21/103097871-20151007-9115-1747.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/marijuana-etf-manager-sam-masucci-interview-on-fast-money.html", "country": "US", "domain_rank": 767, "title": "Marijuana ETF manager Sam Masucci interview on Fast Money", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.215, "site_type": "news", "published": "2018-01-23T02:26:00.000+02:00", "replies_count": 0, "uuid": "405d207f08e64c97a1378e5396e0505738599a0e"}, "author": "", "url": "https://www.cnbc.com/2018/01/22/marijuana-etf-manager-sam-masucci-interview-on-fast-money.html", "ord_in_thread": 0, "title": "Marijuana ETF manager Sam Masucci interview on Fast Money", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cryptocurrency ETFs proved too risky for ETF Managers Group Founder and CEO Sam Masucci, but he threw caution to the wind with his latest marijuana ETF — and it's paying off.\n\"The business is growing, the companies entering it are growing,\" Masucci said on CNBC's \"Fast Money.\"\n\"We see this as a tremendous investment opportunity.\"\nETF Managers Group in late December launched Alternative Harvest ETF, which tracks around 30 domestic and international stocks that may benefit from the growing marijuana industry. The ETF started with $5 million in assets under management and has grown to around $400 million in just under a month, Masucci said.\nSince Attorney General Jeff Sessions rescinded the Cole Memo, sending pot stocks tumbling, there is reason to be concerned when dealing big money in marijuana. But Masucci has accepted a degree of volatility, something he wasn't willing to do with cryptocurrency.\n\"We can't explain the volatility within bitcoin. Until we are comfortable with it and we know how to trade it, we don't see ourselves getting involved,\" he said.\nA majority of Alternative Harvest's companies are based in Canada or other countries, where legalization is impending or where regulations are more lax. As far as domestic companies go, Masucci said ETF Managers Group was careful to pick those best suited to benefit from the cannabis boom, like hydroponics company Scott's Miracle Gro or cigarette manufacturer Philip Morris .\n\"We will continue to participate in those companies that are largest, and right now, the largest piece is outside of the U.S.,\" Masucci said.\nDespite Sessions' actions, Masucci has high hopes that the U.S. cannabis industry will stick around.\n\"Twenty-eight states now have approved medical marijuana, 16 more have it on the docket for this year,\" Masucci said.\n\"There are so many medical advancements now happening with the cannabidiol oils and the uses of the plant, I don't see that going away,\" he added.", "external_links": [], "published": "2018-01-23T02:26:00.000+02:00", "crawled": "2018-01-23T02:28:05.031+02:00", "highlightTitle": ""}