{"organizations": [], "uuid": "e0541172915abacd49d179be359e052285a7e9f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219640603&w=1200&r=LYNXMPEE040ZL", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews\r", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/opec-oil/opec-oil-cut-adherence-rises-in-december-as-venezuela-output-slides-survey-idINKBN1EU1MF", "country": "US", "domain_rank": 408, "title": "OPEC oil cut adherence rises in December as Venezuela output slides: survey", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T18:34:00.000+02:00", "replies_count": 0, "uuid": "e0541172915abacd49d179be359e052285a7e9f7"}, "author": "", "url": "https://in.reuters.com/article/opec-oil/opec-oil-cut-adherence-rises-in-december-as-venezuela-output-slides-survey-idINKBN1EU1MF", "ord_in_thread": 0, "title": "OPEC oil cut adherence rises in December as Venezuela output slides: survey", "locations": [], "entities": {"persons": [{"name": "venezu", "sentiment": "negative"}, {"name": "alex lawler", "sentiment": "none"}], "locations": [{"name": "venezuela", "sentiment": "none"}, {"name": "saudi arabia", "sentiment": "none"}, {"name": "austria", "sentiment": "none"}, {"name": "vienna", "sentiment": "none"}, {"name": "gulf", "sentiment": "none"}, {"name": "united arab emirates", "sentiment": "none"}, {"name": "kuwait", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "opec", "sentiment": "negative"}, {"name": "non-opec", "sentiment": "none"}, {"name": "min read  london", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "petroleum exporting countries", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - OPEC deepened compliance with an oil supply-cutting deal in December due to a further decline in Venezuelan output and extra cuts by Gulf exporters, a Reuters survey found, showing strong commitment to the deal despite higher prices.\nA flag with the Organization of the Petroleum Exporting Countries (OPEC) logo is seen during a meeting of OPEC and non-OPEC producing countries in Vienna, Austria September 22, 2017. REUTERS/Leonhard Foeger/File Photo Adherence to the curbs rose to 128 percent from 125 percent in November, the survey found. The United Arab Emirates for the first time since the deal took effect in January 2017 pumped below its OPEC target, joining Saudi Arabia and Kuwait.\nThe Organization of the Petroleum Exporting Countries is reducing output by about 1.2 million barrels per day (bpd) as part of a deal with Russia and other non-OPEC producers. The pact will run until the end of 2018.\nOil hit its highest since May 2015 this week, supported by falling inventories, strong demand and high OPEC compliance. Many producers, still suffering from a 2014 price collapse, are enjoying the rally and the extra revenues.\n“We are all pleased about it,” one official in an OPEC country said of the early 2018 price rise.\nThe survey shows no sign of producers boosting output to cash in on higher prices or to replace the decline in Venezuela, where output is dropping amid an economic crisis.\nIn the past, waning compliance as oil prices rallied has reduced the effectiveness of OPEC accords.\nTop exporter Saudi Arabia trimmed output by 60,000 bpd, according to sources in the survey who cited stable to lower exports and lower refinery processing, putting supply further below the kingdom’s OPEC target.\nProduction in Venezuela, where the oil industry is starved of funds due to a cash crunch, has fallen further below its OPEC target, the survey found. Both exports and refinery operations were lower in December.\nThe UAE, the incoming OPEC president, has cut production further and delivered its highest adherence yet, according to Reuters surveys. The UAE was a laggard on compliance for most of 2017, compared to peers like Saudi Arabia.\n“The UAE has the OPEC presidency this year and they feel they should try to do better,” said an industry source, who has discussed the issue with OPEC officials.\nLibyan output slipped by 30,000 bpd, hampered by damage to a pipeline in a suspected attack and other outages.\nAmong countries with higher output, the biggest rise came from Nigeria, whose exports in December were set to reach a 21-month high, although actual shipments fell short of that level.\nThe second-largest came from Iraq. A boost in exports from Iraq’s south, the outlet for most of its crude, to a record 3.55 million bpd in December, offset relatively low shipments from the north, the survey found.\nOutput in northern Iraq is still down after falling in mid-October when Iraqi forces retook control of oilfields from Kurdish fighters who had been there since 2014. This has had the side-effect of boosting Iraqi compliance.\nAlgerian output rose after a reduced impact from planned oilfield maintenance.\nOPEC in late 2016 announced a production target of 32.50 million bpd. The target includes Indonesia, which has since left OPEC, and does not include Equatorial Guinea, the latest country to join.\nAccording to the survey, output in December has averaged 32.28 million bpd, about 530,000 bpd above the target adjusted to remove Indonesia and not including Equatorial Guinea.\nWith Equatorial Guinea, production in December totalled 32.41 million bpd, up 20,000 bpd from November. The November total was revised down by 90,000 bpd to the lowest since April 2017, according to Reuters surveys.\nThe Reuters survey is based on shipping data provided by external sources, Thomson Reuters flows data, and information provided by sources at oil companies, OPEC and consulting firms.\nAdditional reporting by Rania El Gamal; Editing by Edmund Blair\n ", "external_links": [], "published": "2018-01-05T18:34:00.000+02:00", "crawled": "2018-01-05T18:57:17.005+02:00", "highlightTitle": ""}