{"organizations": [], "uuid": "f5efa643eb7bed3e0883ef8d6354e3be6d630975", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 11, "shares": 11, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/01/13/103302833-RTX225UB.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/19832390/device/rss/rss.html", "section_title": "Asia-Pacific News", "url": "https://www.cnbc.com/2018/01/08/investors-are-anticipating-another-connect-program-for-the-chinese-market.html", "country": "US", "domain_rank": 767, "title": "Investors are anticipating another 'connect' program for the Chinese market", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-09T06:26:00.000+02:00", "replies_count": 0, "uuid": "f5efa643eb7bed3e0883ef8d6354e3be6d630975"}, "author": "Huileng Tan", "url": "https://www.cnbc.com/2018/01/08/investors-are-anticipating-another-connect-program-for-the-chinese-market.html", "ord_in_thread": 0, "title": "Investors are anticipating another 'connect' program for the Chinese market", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "EU Investors are anticipating another 'connect' program for the Chinese market Investors are awaiting ETF Connect, which will allow investors to trade in Hong Kong, Shanghai and Shenzhen-listed ETFs, says UBS' China equities expert CNBC.com SHARES \nInvestors are eagerly awaiting another \"connect\" program that will allow them to invest in the Chinese market as exchange-traded funds become the next product to join the party, a China stocks expert said Tuesday. \nFollowing launches of the Shanghai - and Shenzhen- Hong Kong Connect programs in the last few years, Chinese regulators now have plans for international and mainland investors to trade in ETF products in the Special Administrative Region, Shanghai and Shenzhen, Hong Kong media reported . That could come as soon as 2018 . \n\"Especially for domestic investors investing overseas, if the ETF Connect happens [this year], most of the global equities market can ... list in Hong Kong. [It will also] enable Chinese investors to participate in a controlled manner through the Connect [program],\" said Thomas Fang, head of China Equities at UBS. \nMany of UBS' clients are anticipating the program, but that there are still technical issues to sort out, Fang told CNBC on the sidelines of the UBS Greater China Conference. \nInvestors will likely include domestic and institutional investors, insurance companies, mutual funds, and retail investors, he added. \nPreviously limited to domestic investors, the Chinese capital market has been opening up to the global markets in recent years. \nIn 2014, Hong Kong's Securities and Futures Commission and the China Securities Regulatory Commission launched the Shanghai -Hong Kong Connect. The link, hailed as a major step in China's efforts to open up its capital market, allows foreign investors to place buy or sell orders for Shanghai's A-share market through brokers in Hong Kong. Chinese investors, meanwhile, are be able to use mainland brokers to invest in Hong Kong's H-share market. \nThe Shenzhen-Hong Kong Connect was launched in December 2016. \nThis year, index giant MSCI will add 222 China A Large Cap stocks on a gradual basis to the index its benchmark emerging markets index.", "external_links": ["http://www.scmp.com/business/money/stock-talk/article/2126673/launch-etf-connect-expected-second-half-2018-hong-kong", "https://www.ft.com/content/9bf5c7d4-6aee-36b2-853d-1c6a22896f7a"], "published": "2018-01-09T06:26:00.000+02:00", "crawled": "2018-01-09T10:20:45.000+02:00", "highlightTitle": ""}