{"organizations": [], "uuid": "d3c9eebf07781b232f7fe1b9962e791fb99f51ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 31}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/24/104965611-HED_One_Skill_Credit_TaiLopez.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/25/tai-lopez-shares-how-to-master-one-skill-billionaires-have-in-common.html", "country": "US", "domain_rank": 767, "title": "Tai Lopez shares how to master one skill billionaires have in common", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T18:26:00.000+02:00", "replies_count": 0, "uuid": "d3c9eebf07781b232f7fe1b9962e791fb99f51ff"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/25/tai-lopez-shares-how-to-master-one-skill-billionaires-have-in-common.html", "ord_in_thread": 0, "title": "Tai Lopez shares how to master one skill billionaires have in common", "locations": [], "entities": {"persons": [{"name": "bill gates", "sentiment": "neutral"}, {"name": "tai lopez", "sentiment": "neutral"}, {"name": "lopez", "sentiment": "none"}, {"name": "warren buffett", "sentiment": "none"}, {"name": "dalai lama", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Imagine if you could start a company as an equal partner with Bill Gates, using his immense business acumen to build an empire. Consider what would happen if Warren Buffett was your personal investment advisor, showing you how to make millions in the market. Or forget money, and envision how your life would change if the Dalai Lama tutored you on how to find your purpose and feel fulfilled.\nAny of us would be lucky to have one of these people as a mentor. But what if you could have all of them, and hundreds of other billionaires, entrepreneurs, and luminaries, on speed dial?\nInvestor, speaker, and member of The Oracles , Tai Lopez believes you can. He's built an eight-figure online empire from nothing by tapping into a network of the best mentors on the planet — some of whom he doesn't even know or are no longer alive.\nHis secret? He reads an insane number of books. Lopez blazes through one book a day from some of history's greatest minds, and he credits his success in business to this ability. In the process, he's built the world's biggest book following, with over 13 million social media followers. And just from YouTube alone, Lopez has over one billion minutes watched.\nshow chapters Money classics, summed up in one sentence      9:26 AM ET Mon, 13 March 2017 | 01:30 \"Everyone wants the good life,\" he says. \"But not everyone is willing to do the reading that is required to live the good life. Reading should be about downloading knowledge, wisdom, life lessons, and installing a new mindset — gaining a different perspective of someone you want to emulate.\"\nHere, Lopez shares his secrets to read more, read better, and most importantly, translate what you read into massive real-life success.\n1. Understand the profound power of books First, you need to start looking at books as mentors, not entertainment or educational resources. Treat them just like you would an in-person mentor whom you'd do anything to meet.\nLopez says the biggest predictor of success in life is your ability to copy the results of others. Everyone who's anyone, from Alexander the Great to Oprah to Einstein, has done it. And you can do it not just by having in-person mentors, but by reading books.\n\"Some of the greatest mentors are no longer alive. If I told you people like Gandhi or Shakespeare would be at my house on Saturday, you'd show up. But they're right there in your local library or available for practically free on Amazon.\"\nThat means for just a few dollars, you have a network of mentors at your fingertips. Few people, says Lopez, understand this. He cites one of his favorite books, Sam Walton's \" Made in America .\" Walton wrote the book on his deathbed to tell everyone how he made billions building the Walmart empire. Yet when Lopez gives talks, only one or two entrepreneurs in the room have heard of the book. Most, however, would spend a fortune to spend a minute or two with Walton.\n2. Books need to be read multiple times \"See books like friends,\" Lopez says. \"You engage with them over and over again.\"\nThat means you don't just read a book once. You read it multiple times. And,like friends, you keep coming back to the same ones in your life. Lopez recommends you find 150 books that you plan on reading over and over in your life. He's listed his recommended books here if you want a place to start.\n3. Read a book a week Lopez is famous for reading a book a day. You only need to read a book a week, he estimates, to be successful. That's still a lot, but you don't always need to read the entire book to extract its value.\nDepending on a book's quality, he'll read it all or \"hack\" his way through it quicker when there's not much helpful content. \"Some books only have one or two main ideas that are valuable.\"\nshow chapters The CEO of this 7-figure snack business says he made one big mistake      1:14 PM ET Wed, 19 April 2017 | 00:50 When opening a book, he'll read the table of contents once and skim the text for a high-level overview. Then, he'll read the first and last sections of the book with any other chapters of interest. Finally, he'll focus on the chapter that interests him most, and read it closely.\n\"Think of yourself as a gold miner, if you have to. You're looking for that one valuable nugget to move your life or business forward. Note the key lessons in the back of the book, which you can revisit.\"\n4. Embrace doing what's difficult Carving out time for this much reading in your busy schedule is hard, says Lopez. But intentionally doing what is difficult often determines how successful you can become. (He learned this at an early age, living with the Amish and hustling from dawn until dusk.)\n\"When was the last time you went a week without eating sugar or taking a hot shower?\" asks Lopez. Doing things that are hard on purpose is not only valuable on its own, but it'll also make building this much reading into your schedule seem easier.\n\"When it comes to reading — and success — you need to sacrifice present pleasure for something better later.\"\nLopez recommends starting with 10 minutes a day of focused reading sitting in a chair. \"See if you can build your way up over time to an hour or more. Schedule these these 'brain-training' sessions into your daily calendar, just like you would do for the gym.\"\nWhen reading, Lopez says you should push yourself to digest as much as possible. Then, force yourself to recall the main points by teaching it to someone else — even via a Snapchat story, Instagram story, or YouTube video.\n\"Share your lessons learned. You'll soon become the most interesting person in the room.\"\nTai Lopez is an investor and advisor to many multimillion-dollar businesses, and built an eight-figure online empire; connect with Tai on Facebook , Instagram , Snapchat , or YouTube \nLike this story? Like CNBC Make It on Facebook ! \nDon't miss: 4 books that billionaire Ray Dalio thinks everyone should read \nshow chapters Lemonis: The one book every professional should read      9:04 AM ET Thu, 6 Oct 2016 | 01:01", "external_links": ["https://www.facebook.com/TaiLopezOfficial", "http://www.tailopez.com/books", "https://www.theoracles.com/", "https://www.instagram.com/tailopez/", "http://www.tailopez.com/", "http://snapchat.com/add/tailopez", "https://www.facebook.com/CNBCMakeIt/", "http://www.amazon.com/exec/obidos/ASIN/0553562835", "https://www.youtube.com/user/tailopezofficial"], "published": "2018-01-25T18:26:00.000+02:00", "crawled": "2018-01-25T17:41:40.000+02:00", "highlightTitle": ""}