{"organizations": [], "uuid": "5a074abf0b7fd408c93008ddab3c04c60a6d0c0c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180110.html", "section_title": "Archive News &amp; Video for Wednesday, 10 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/usa-trump-earmarks/rpt-drain-the-swamp-trump-suggests-reviving-earmarks-in-u-s-congress-idUSL1N1P502F", "country": "US", "domain_rank": 408, "title": "RPT-'Drain the Swamp' Trump suggests reviving 'earmarks' in U.S. Congress", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T19:00:00.000+02:00", "replies_count": 0, "uuid": "5a074abf0b7fd408c93008ddab3c04c60a6d0c0c"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-trump-earmarks/rpt-drain-the-swamp-trump-suggests-reviving-earmarks-in-u-s-congress-idUSL1N1P502F", "ord_in_thread": 0, "title": "RPT-'Drain the Swamp' Trump suggests reviving 'earmarks' in U.S. Congress", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "susan cornwell", "sentiment": "negative"}, {"name": "jeff mason", "sentiment": "negative"}, {"name": "lindsey graham", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "south carolina", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "congress", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Repeats without change)\nBy Jeff Mason and Susan Cornwell\nWASHINGTON, Jan 9 (Reuters) - President Donald Trump unexpectedly suggested on Tuesday that bringing back congressional “earmarks,” spending habits that were banished six years ago from the federal budget process, might help an often deadlocked U.S. Congress get things done.\nKnown by their supporters as the “grease” that made Washington’s wheels turn, earmarks were funds allocated for lawmakers’ pet projects that helped secure votes needed to get broader legislation passed.\n“Maybe all of you should start thinking about going back to a form of earmarks,” Trump told lawmakers who were gathered at the White House for a meeting about immigration reform.\nHis surprise suggestion prompted Senator Lindsey Graham, a South Carolina Republican, to exclaim, “Yeah!,” while drawing objections and laughter from others in the room.\nCongress resisted using earmarks routinely for decades, but they became commonplace in the 1990s and helped define Washington’s image as a “swamp” of special interests. As a 2016 presidential candidate, Trump made “Drain the Swamp” a campaign theme and popular slogan at his political rallies.\nIn the meeting on Tuesday, Trump lamented the animosity between Republicans and Democrats on Capitol Hill.\n“This system really lends itself to not getting along. It lends itself to hostility and anger,” Trump said of the difficulties of passing legislation since the practice of allowing earmarks was abandoned.\nMemorable examples of the use of earmarks were a “bridge to nowhere” in Alaska and the conviction of Republican Congressman Duke Cunningham of California for taking millions of dollars in bribes linked to special projects.\nSince the practice was banished in 2011, Congress has struggled to carry out its basic job of writing and approving annual budgets.\n“I hear so much about earmarks, the old earmark system, how there was a great friendliness when you had earmarks,” Trump said. “We have to put better controls because it got a little bit out of hand, but maybe that brings people together. Because our system right now, the way it’s set up, will never bring people together.”\nSome members of Congress have also called for reviving earmarks, but Republican Representative Mark Walker from North Carolina, who chairs a large conservative faction of the House of Representatives, drew a firm line.\n“I can tell you unequivocally most of us are going to have an issue with it,” he said. “I’m in favor of not bringing them back because of the temptation to abuse that process.”\nTrump and congressional Republicans finished 2017 with a victory by passing a landmark tax overhaul bill against the united opposition of Democrats.\nWhile Republicans have majorities in both houses of Congress, they will likely need Democrats’ votes to advance other goals this year given their narrow Senate majority.\nThe president has begun 2018 by seeking bipartisan support for immigration measures and some Democrats attended Tuesday’s meeting.\nAfter the November 2018 congressional elections though, if Republicans lose seats in Congress as historically happens midway through the first term of a new president, Trump will need Democrats even more to follow through on his policy agenda. (Additional reporting by Richard Cowan; Editing by Kevin Drawbaugh and Clive McKeef)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-10T19:00:00.000+02:00", "crawled": "2018-01-11T12:44:25.039+02:00", "highlightTitle": ""}