{"organizations": [], "uuid": "70965e39c661f7032a8f44f8bfe971fdffd842c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2016/03/art03-15_a.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/08/ceo-daily-for-january-8-2018/", "country": "US", "domain_rank": 1196, "title": "CEO Daily January 8, 2018: AI Takes Center Stage at CES | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-08T08:59:00.000+02:00", "replies_count": 0, "uuid": "70965e39c661f7032a8f44f8bfe971fdffd842c2"}, "author": "Alan Murray", "url": "http://fortune.com/2018/01/08/ceo-daily-for-january-8-2018/", "ord_in_thread": 0, "title": "CEO Daily January 8, 2018: AI Takes Center Stage at CES | Fortune", "locations": [], "entities": {"persons": [{"name": "las v", "sentiment": "negative"}, {"name": "huang", "sentiment": "none"}, {"name": "blockchain", "sentiment": "none"}, {"name": "shelly palmer", "sentiment": "none"}, {"name": "jensen huang", "sentiment": "none"}], "locations": [{"name": "east coast", "sentiment": "none"}], "organizations": [{"name": "nvidia", "sentiment": "none"}, {"name": "graphical processing units", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "6:59 AM EST \nGood morning. \nI’m leaving the East Coast deep freeze this morning and heading to Las Vegas, along with 180,000 of the tech-obsessed, for the annual CES show. The massive conference used to focus on consumer electronics, but it has broadened its remit in recent years and become a gathering place for representatives of every industry trying to understand how tech is going to rock their world. \nTop buzzwords for this year’s extravaganza, according to CES connoisseur Shelly Palmer: Artificial Intelligence, Blockchain, and Augmented Reality. For the first time ever, the conference will include an “AI Marketplace” alongside the traditional marketplaces for TVs, smart homes, drones, robotics, etc., on the massive convention center floor. Fortune will be hosting Nvidia CEO Jensen Huang tonight at its annual Brainstorm Tech dinner. Huang is the perfect representation of the change that has overtaken CES. Nvidia built its business on Graphical Processing Units used in computer games; but its stock has skyrocketed recently as its powerful GPUs have been powering more AI applications. (Huang was Fortune ’s 2017 Businessperson of the Year .) \nThis year’s CES is also becoming a battleground in the digital assistant war . Amazon’s Alexa is the early leader in the field, but Google has plastered its “Hey, Google” digital assistant wake-up call on billboards, buses and other vacant spaces all over the city. Apple’s entry into the war, HomePod, is expected early this year. \nI’ll be reporting from CES all week. News below. Alan Murray Top News \nCelgene is buying Impact for up to $7 billion. \nThe biotech firm said on Sunday that it has agreed to buy Impact Biomedicines, a smaller biotech company focused on blood-disease treatments, such as fedratinib, a kinase inhibitor that could be used to treat the blood cancer myelofibrosis. The deal calls for Celgene to pay $1.1 billion upfront and it could reach $7 billion in value over time, depending on the drug reaching certain milestones. Reuters \nApple shareholders worry about kids’ iPhone addiction. \nJana Partners and the California State Teachers’ Retirement System, two major Apple shareholders, wrote a letter to the company over the weekend urging Apple to conduct a study of how heavy smartphone usage affects mental health in children. The shareholders are concerned that Apple may have a public health crisis on its hands—one that could eventually hurt the company—and they want the company to provide parents with more options for restricting children’s access to smartphones. Bloomberg \nFed seems unlikely to hike rates faster after tax reform. \nThe White House will be pleased to hear that the Federal Reserve appears to be unlikely to speed up its planned interest rate hikes in the wake of the Trump administration’s recent tax overhaul. U.S. central bankers told Reuters that they do not expect the tax stimulus to jumpstart inflation in a way that would force the Fed to raise interest rates faster than its current timeline. Reuters \nNvidia teams with Uber, VW, Aurora for self-driving tech. \nSpeaking of Nvidia, Jensen Huang revealed at CES on Sunday night that more than 320 companies are working with Nvidia to develop self-driving technology, including the likes of Uber, Volkswagen, and Chinese internet search company Baidu. Huang also announced that Aurora—a self-driving vehicle startup from veterans of Google, Tesla, and Uber—will rely on Nvidia’s new Xavier processor to build its self-driving vehicle system. Fortune Around the Water Cooler \nExperts call Intel CEO’s stock sale “unusual.” \nSome lawyers and analysts used the words “odd” and “unusual” to describe the timing and size of Intel CEO Brian Krzanich’s November sale of half of his stock in the company, according to WSJ. Krzanich sold the most stock he was allowed to under corporate bylaws last fall in a move that came roughly six months after Intel learned about the massive security flaws in its chips that only recently became public knowledge. The Wall Street Journal \nSpaceX completes first launch of 2018. \nThe year got off to a mysterious start for SpaceX, as Elon Musk’s private aerospace company completed its first launch of 2018 on Sunday night with a rocket that carried a more or less secret payload. SpaceX’s Falcon 9 rocket carried the Zuma spacecraft, a U.S. government satellite made by Northrop Grumman (though the purpose of the satellite is not publicly known), and carried its payload into low-Earth orbit before successfully touching back down at the SpaceX landing zone in Florida. Fortune \nWho’s taking Google’s bikes? \nAccording to WSJ , as many as 250 company-provided bicycles go missing from Google’s campus in Mountain View, Calif. each week. That’s out of a fleet of roughly 1,100 “Gbikes,” which the company provides employees for use around its headquarters. In many cases, the culprits appear to be local residents—some of whom may not be on the friendliest of terms with the online search giant, which has taken to installing its bikes with GPS trackers. The Wall Street Journal ", "external_links": [], "published": "2018-01-08T08:59:00.000+02:00", "crawled": "2018-01-08T14:55:36.008+02:00", "highlightTitle": ""}