{"organizations": [], "uuid": "9bb6e13b72d21910a2bcff35fa0817889b79b671", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-WV975_postal_SOC_20180104174606.jpg", "site_section": "https://www.wsj.com/news/business", "section_title": "Business &amp; Finance News - Wall Street Journal", "url": "https://www.wsj.com/articles/todays-top-supply-chain-and-logistics-news-from-wsj-1515151698", "country": "US", "domain_rank": 387, "title": "Today’s Top Supply Chain and Logistics News From - WSJ", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T14:28:00.000+02:00", "replies_count": 0, "uuid": "9bb6e13b72d21910a2bcff35fa0817889b79b671"}, "author": "Paul Page", "url": "https://www.wsj.com/articles/todays-top-supply-chain-and-logistics-news-from-wsj-1515151698", "ord_in_thread": 0, "title": "Today’s Top Supply Chain and Logistics News From - WSJ", "locations": [], "entities": {"persons": [{"name": "jennifer smith", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "logistics news from - wsj", "sentiment": "negative"}, {"name": "wsj logistics report", "sentiment": "none"}, {"name": "dat solutions llc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Sign up: With one click, get this newsletter delivered to your inbox .\nU.S. shipping prices are reaching the highest levels in years as demand far outstrips truck capacity. Some companies are delaying non-essential shipments rather than scramble to find a truck, WSJ Logistics Report’s Jennifer Smith writes, while others are paying hefty premiums as the strong surge in business that began last year pushes into 2018 . Just one truck was available for every 12 spot-market loads needing to be shipped by the end of last week, according to DAT Solutions LLC, leaving the sector at its most unbalanced in more than 12 years. The heavy demand is tracking the strengthening economy, which just went through its biggest jump in holiday sales since 2011. At the same time, some in the industry say new regulations are helping keep trucking supply tight. The federal mandate for electronic logging devices took effect about three weeks ago, and the rollout has been patchy, which has likely left plenty of rigs parked over what was expected to be a slack shipping period.\nA severe winter storm and sub-freezing temperatures are locking down freight movements across a wide swatch of the Eastern U.S. Seaports along the Eastern seaboard were shuttered in the face of blizzard conditions, bulk vessels were trapped around the frigid Great Lakes and major roads from Virginia to Maine were rendered too treacherous for trucks by what authorities called an unusually fast-moving and fierce storm . The WSJ’s Valerie Bauerlein, Jon Kamp and Susan Carey write that passenger airlines have canceled thousands of flights, part of the broad impact the weather has had. Ocean gateways including the Port of New York and New Jersey expected to resume most operations today and sites such as South Carolina’s Port of Charleston extended hours this weekend to cope with backlogs. Truck drivers delivering fuel have been swamped, pushing back deliveries of emergency shipments even as the storm moves into New England.\nSome department stores look to have some life in them after all. Macy’s Inc. and J.C. Penney Co. both reported expanding sales for the critical holiday months, offering relatively upbeat outlooks for a retail sector that’s been upended by the consumer drive to online marketplaces. Macy’s same-store sales rose 1% in November and December from a year ago, while Penney’s increased 3.4%, the WSJ’s Suzanne Kapner and Allison Prang report, providing the first readout from major retailers on the holiday season. Not all stores are faring better: Sears Holdings Corp. added 40 locations to the dozens of stores it plans to close starting next week. The broader sector is showing stability, with overall department store sales up 1.7% in November. Macy’s is moving up the closing of 11 stores this year but the company is still forecasting sales growth this year rather than a longer list of store shutdowns.\nSUPPLY CHAIN STRATEGIES Boston on Thursday, ahead of a heavy snowfall that will be followed by sub-zero temperatures.. Photo: Bloomberg News Some Chinese companies see a path to gaining a bigger piece of a critical, high-value piece of electronic supply chains. The operators are designing semiconductors for the burgeoning field of artificial intelligence, the WSJ’s Li Yuan writes, potentially providing new inroads for a Chinese chip sector that has tried without much success to challenge the dominance of Intel Corp. and Qualcomm Inc. Companies like Horizon Robotics are part of a new crop of chip companies that think they can win the AI chip race, giving them a stronger hand in a market that is a profit-generating bulwark of international airfreight shipping. They face formidable competition from old hands such as Intel and Qualcomm and deep-pocketed new entrants such as Apple Inc. and Google. But experts say the companies are getting big financial backing and have the talent, a huge consumer market and rafts of crucial data that fuel AI programs on their side.\nQUOTABLE\n‘ Some loads that have to move are paying extremely high rates. ’\n—Mark Montague, analyst at DAT Solutions.\nNumber of the Day 59% Growth in heavy-duty truck orders in 2017 over 2016, according to ACT Research.\nIN OTHER NEWS The Trump administration wants to open up nearly all U.S. offshore areas for oil drilling, leasing areas off states like Florida and California for the first time in decades . (WSJ)\nOil prices reached a three-year high as U.S. crude stockpiles dropped at a steep rate . (WSJ)\nHiring at private U.S. employers grew by a more-than-expected 250,000 jobs in December. (WSJ)\nThe number of Americans seeking new unemployment benefits rose by 5,000 to 250,000 last week. (WSJ)\nVolkswagen AG and Hyundai Motor Co. struck partnerships with Silicon Valley startup Aurora Innovation Inc. to develop autonomous vehicles . (WSJ)\nBankrupt Westinghouse Electric Co. is being sold to Canada’s Brookfield Business Partners LP in a deal valued at $4.6 billion . (WSJ)\nShipping congestion at major Asian coal ports has helped drive up coal prices to their highest levels since 2016. (Reuters)\nGlobal commodities prices reached a three-year high on growing factory demand. (Bloomberg)\nAgriculture experts expect cotton prices to slip this year as the pace of U.S. exporting slows . (Agrimoney)\nHD Supply will buy distributor A.H. Harris Construction Suppliers for $380 million . (Industrial Distributor)\nCargill Inc. suspended business with a palm oil supplier over its failure to meet sustainability goals . (Supply Chain Dive)\nChina’s Commerce Ministry is backing efforts to expand the use of free-trade zones at the country’s ports. (South China Morning Post)\nChinese e-commerce company JD.com is opening physical grocery stores to complement its online food delivery service . (Post & Parcel)\nAlibaba Group Holding Ltd. is in talks to invest $100 million for a minority stake in Indian logistics company XpressBees. (Economic Times)\nChinese domestic express courier Deppon Logistics got the go-ahead for an initial public offering aimed at raising $458 million . (Xinhua)\nFairfax Financial Holdings will invest $250 million in container ship owner Seaspan Corp. (Splash 24/7)\nShip charter company TMS Cardiff Gas ordered three liquefied natural gas carriers from South Korea’s Hyundai Heavy Industries . (Lloyd’s List)\nDevelopers are placing logistics facilities on expensive property at U.S. seaports as shippers look to reduce drayage and positioning costs . (Journal of Commerce)\nBNSF Railway will start running a container shuttle service between Oregon’s Port of Portland and the Port of Seattle. (Maritime Professional)\nCoal company Lighthouse Resources Inc. is suing Washington’s state government for blocking construction of a coal export terminal . (The Hill)\nABOUT US Paul Page is deputy editor of WSJ Logistics Report. Follow him at @PaulPage , and follow the entire WSJ Logistics Report team: @brianjbaskin , @jensmithWSJ and @EEPhillips_WSJ . Follow the WSJ Logistics Report on Twitter at @WSJLogistics .\nWrite to Paul Page at paul.page@wsj.com", "external_links": ["https://www.joc.com/international-logistics/logistic-operations-move-closer-us-docks_20180103.html", "http://www.scmp.com/business/global-economy/article/2126709/chinas-commerce-minister-backs-plan-free-trade-ports-further", "https://www.reuters.com/article/us-asia-coal-congestion/asian-coal-prices-hit-late-2016-high-amid-huge-shipping-congestion-idUSKBN1ET0M1", "http://thehill.com/policy/energy-environment/367322-company-sues-washington-state-for-blocking-coal-export-terminal", "https://www.supplychaindive.com/news/cargill-palm-oil-supplier-procurement/514020/", "https://www.inddist.com/news/2018/01/hd-supply-acquire-construction-distributor-ah-harris-380m", "https://lloydslist.maritimeintelligence.informa.com/LL1120735/TMS-Cardiff-orders-three-LNG-carriers-at-HHI", "https://postandparcel.info/92091/news/e-commerce/jd-com-launching-7fresh-food-stores-offering-30-minute-home-delivery/", "https://twitter.com/WSJLogistics?lang=en", "https://twitter.com/EEPhillips_WSJ?lang=en", "http://www.xinhuanet.com/english/2018-01/04/c_136871749.htm", "https://www.agrimoney.com/news/icac-lifts-cotton-price-forecast---but-still-sees-decline-ahead-48303", "https://twitter.com/PaulPage", "http://splash247.com/fairfax-invests-seaspan/", "https://economictimes.indiatimes.com/small-biz/startups/newsbuzz/chinas-alibaba-on-road-to-deliver-100-million-to-xpressbees/articleshow/62320781.cms", "https://www.bloomberg.com/news/articles/2018-01-04/global-factory-boom-boosts-commodity-prices-from-oil-to-copper", "https://www.maritimeprofessional.com/news/port-portland-adds-rail-service-312589", "https://twitter.com/jensmithWSJ", "https://twitter.com/brianjbaskin?lang=en"], "published": "2018-01-05T14:28:00.000+02:00", "crawled": "2018-01-05T21:00:16.021+02:00", "highlightTitle": ""}