{"organizations": [], "uuid": "0f135656aab8f540aa47fe63e536a51317e2e566", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/liberty-oilfield-outlook-ipo/liberty-oilfield-services-ceo-sees-muted-response-to-crude-price-rise-idUSL1N1P71IL", "country": "US", "domain_rank": 408, "title": "REFILE-Liberty Oilfield Services CEO sees muted response to crude price rise", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T21:15:00.000+02:00", "replies_count": 0, "uuid": "0f135656aab8f540aa47fe63e536a51317e2e566"}, "author": "", "url": "https://www.reuters.com/article/liberty-oilfield-outlook-ipo/liberty-oilfield-services-ceo-sees-muted-response-to-crude-price-rise-idUSL1N1P71IL", "ord_in_thread": 0, "title": "REFILE-Liberty Oilfield Services CEO sees muted response to crude price rise", "locations": [], "entities": {"persons": [{"name": "liz hampton", "sentiment": "none"}, {"name": "chris wright", "sentiment": "none"}, {"name": "wright", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}], "organizations": [{"name": "refile-liberty oilfield services", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "liberty oilfield services inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "e&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 7:06 PM / Updated 11 minutes ago REFILE-Liberty Oilfield Services CEO sees muted response to crude price rise Reuters Staff \n(Refiles to change “expanding” to “expand” in first paragraph) \nBy Liz Hampton \nHOUSTON, Jan 12 (Reuters) - Oil producers are unlikely to significantly expand drilling budgets this year despite the recent run-up in crude prices, Chris Wright, chief executive of Liberty Oilfield Services Inc, told Reuters in an interview on Friday. \n“Spending budgets for E&P customers were mostly set in the last month or two, when oil was $50 a barrel,” Wright said following the company’s initial public offering of shares. “There is definitely a strong focus on capital discipline among customers.” \nOil and gas producers have been pressured by investors to shift capital to share buyback programs or dividend increases instead of more drilling, a move that could stunt future exploration and production activities. \nEven if capital spending budgets remain flat, U.S. shale production is poised for continued growth, Wright said, pointing to lower costs and improved technology. \n“U.S. production over the next three to 10 years can grow quite a bit. It can grow far beyond 10 million barrels a day,” Wright said, adding that U.S. output will need to grow to help feed global demand. \nLiberty Oilfield Services, which specializes in hydraulic fracturing of shale wells to released trapped oil and gas, is the first oilfield services company to go public this year. \nThe Denver, Colorado-based firm made its debut on the New York Stock Exchange on Friday at an initial price of $17. The shares were hovering around $21.80 in afternoon trading, up about 28 percent. \nLiberty was one of several service companies that filed to offer shares early last year, but shelved plans after crude prices declined at mid-year. Rivals are watching investors’ response to Liberty’s offering before deciding whether to go public, analysts have said. \nHouston-based competitor Nine Energy Service this week said it expects to raise $150 million in its IPO. \nPressure pumping has been a bright spot in the oilfield services industry, which is still struggling to boost profits following the 2014 downturn. \nLiberty this year will add three new hydraulic fracturing fleets, to 22 total, a signal it expects demand for its services to grow. The company has seen about a 50 to 60 percent increase in prices for its services after hitting a low in mid 2016, Wright said. \nBenchmark crude futures this week traded above $64 a barrel, the highest level in three years. (Reporting by Liz Hampton; Editing by Tom Brown)", "external_links": [], "published": "2018-01-12T21:15:00.000+02:00", "crawled": "2018-01-12T21:29:47.011+02:00", "highlightTitle": ""}