{"organizations": [], "uuid": "1e92b28b66c5c6ffc678c1800aa631d13e7062bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 8, "shares": 8, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/21/104957868-GettyImages-902821716.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/cryptocurrencies-south-korea-regulatory-jitters-simmer-many-stay-upbeat.html", "country": "US", "domain_rank": 767, "title": "Cryptocurrencies: South Korea regulatory jitters simmer, many stay upbeat", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.175, "site_type": "news", "published": "2018-01-22T09:52:00.000+02:00", "replies_count": 0, "uuid": "1e92b28b66c5c6ffc678c1800aa631d13e7062bd"}, "author": "Cheang Ming", "url": "https://www.cnbc.com/2018/01/22/cryptocurrencies-south-korea-regulatory-jitters-simmer-many-stay-upbeat.html", "ord_in_thread": 0, "title": "Cryptocurrencies: South Korea regulatory jitters simmer, many stay upbeat", "locations": [], "entities": {"persons": [], "locations": [{"name": "south korea", "sentiment": "none"}], "organizations": [{"name": "yonhap", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "ministry of strategy and finance", "sentiment": "none"}, {"name": "yonhap news agency", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A lack of clarity in South Korea's plans to regulate cryptocurrencies may be of concern , but experts continued to sound upbeat about developments in the space.\nIn the latest twist in an ongoing saga, South Korea reportedly intends to make cryptocurrency operators exchange user data with banks, local media said on Sunday, citing a single unnamed government official.\nThe plan, which will be a \"measure of tax enforcement,\" is expected to come into effect toward the end of January or at the beginning of February, Yonhap News Agency reported. A separate Yonhap report on Monday said the government would impose a tax rate not exceeding 24.2 percent on cryptocurrency exchange incomes this year.\n\"Korea Financial Intelligence Unit announced that financial companies are in the process of drawing up a guideline to prevent cryptocurrency-related money laundering, although any specific measures are yet to be confirmed,\" the Financial Services Commission said in a statement in response to the news.\n\"The financial authorities have not looked into any measure to monitor cryptocurrency users' transaction data,\" it added.\nshow chapters This company is watching the swings in cryptocurrency prices 15 Hours Ago | 02:57 The South Korean government faced an outcry earlier this month after it said it would prepare a bill to ban cryptocurrency exchanges, although it subsequently qualified those remarks, adding that more consultation would be done before a decision was made. An online petition on the presidential office's website against \"unjustifiable regulations\" in the space garnered more than 220,000 e-signatures as of Jan. 22.\nAccording to Pavel Bains, CEO and co-founder of decentralized database services start-up Bluzelle, the \"mixed messages\" were concerning to the company's South Korean business partner, blockchain accelerator Hashed.\nBut he added that a bigger problem was the lack of education among the \"new people\" coming into the market, which could result in the spread of scams or frauds.\nshow chapters This market maker welcomes more regulation for cryptocurrencies 21 Hours Ago | 02:38 Despite the volatility in cryptocurrency prices earlier in the month, potential new regulations in the space were described as a step in the right direction.\n\"We welcome that,\" said Cedric Jeanson, CEO of Bitspread, a bitcoin -focused market maker with offices in the U.S., Europe and Asia.\n\"What is really important for us is all the AML KYC (anti-money laundering and know your customer) regulation and that the processes on the exchanges actually fulfill those common, or natural, requirements ... I think Korea is going to the right direction in this respect,\" Jeanson told CNBC's \" The Rundown .\"\nHe added that consultation was necessary in the process: \"Somebody has to first throw the first stone, just to say: 'What are you guys thinking on the market?' And I think the answer has been overwhelming by Korean people, actually.\"\nFollowing the fall in bitcoin prices this year, which saw the cryptocurrency tumbling 50 percent from its December highs, many commentators on the space continued to sound positive.\nFor one, Fundstrat Global Advisors Founder Tom Lee said in a report last week that he saw bitcoin hitting $25,000 by the end of 2018.\nBitcoin was relatively stable during Asian afternoon trade on Monday, coming in around the $11,500 mark, according to industry site CoinDesk.", "external_links": [], "published": "2018-01-22T09:52:00.000+02:00", "crawled": "2018-01-22T09:52:30.003+02:00", "highlightTitle": ""}