{"organizations": [], "uuid": "585cab1a7e29af4c9c3221bd932ec3178f82d942", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180121.html", "section_title": "Archive News &amp; Video for Sunday, 21 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-markets/global-markets-stocks-dollar-sag-after-us-government-shutdown-idUSL4N1PH1KW", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-Stocks, dollar sag after US government shutdown", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T11:00:00.000+02:00", "replies_count": 0, "uuid": "585cab1a7e29af4c9c3221bd932ec3178f82d942"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-markets/global-markets-stocks-dollar-sag-after-us-government-shutdown-idUSL4N1PH1KW", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Stocks, dollar sag after US government shutdown", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "hideyuki sano", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "asia-pacific", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}], "organizations": [{"name": "s&p", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "u.s. senate", "sentiment": "none"}, {"name": "msci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* U.S. dollar slips, S&P500 futures fall\n* U.S. bond prices also drop, 10-yr yield at 3 1/2-year high\n* South African rand shines, Turkish lira drops on Syria conflict\nBy Hideyuki Sano\nTOKYO, Jan 22 (Reuters) - U.S. stock futures, Asian equities and the dollar pulled back slightly on Monday after the U.S. government was forced to shut down amid a dispute between President Donald Trump and Democrats over immigration.\nMSCI’s broadest index of Asia-Pacific shares outside Japan eased 0.1 percent while Japan’s Nikkei was down 0.15 percent.\nU.S. S&P500 mini futures dipped 0.1 percent in early trade while U.S. Treasuries price fell, pushing up the benchmark 10-year yield to as high as 2.672 percent, its highest level in 3-1/2 years.\nRepublican and Democratic leaders of the U.S. Senate held talks on Sunday seeking to break the impasse that has kept the U.S. government shut down for two days.\nBut the Senate scheduled a vote for Monday at noon (1700 GMT) on a stopgap spending measure, cancelling a planned vote for Monday at 1 a.m. (0600 GMT), ensuring the federal government will remain closed when U.S. markets open.\nWhile many see minimal impact on the economy from a short-term government shutdown, analysts say a prolonged stalemate in Washington could dampen investors’ confidence in U.S. assets.\n“The markets had not expected this shutdown. Given that U.S. share prices have rallied strongly since the beginning of the year, we have to see if this event is a trigger to change the market trend,” said Takafumi Yamawaki, head of Japan fixed income research at JPMorgan Securities.\nHe noted that during previous government shutdowns - two in 1995 and one in 2013 - U.S. bond yields have tended to slip in the first few weeks after the closure.\nIn the foreign exchange market, the dollar’s index against a basket of major currencies dropped about 0.2 percent from late last week to 90.465, not far from three-year low of 90.104 touched on Wednesday, before edging back to 90.63.\nThe euro opened the day 0.4 percent higher at $1.2275 , but it stopped short of testing Wednesday’s three-year peak of $1.2323 and pared back much of the gains to trade at $1.2230.\nThe common currency was also helped after Germany’s Social Democrats (SPD) voted on Sunday to begin formal coalition talks with Chancellor Angela Merkel’s conservatives, moving Europe’s economic powerhouse closer to a stable government after months of political deadlock.\nThe safe-haven Swiss franc gained 0.2 percent to 0.9627 franc per dollar. It hit a four-month high of 0.9536 to the dollar on Friday.\nThe Japanese yen was little changed at 110.78 yen to the dollar, not far from Wednesday’s four-month high of 110.19 while gold ticked up 0.2 percent to $1,334.5 per ounce.\nThe South African rand was the biggest mover in early Asian trade, rising almost 1 percent to 2-1/2-year highs of 12.0825 per dollar.\nLeaders of South Africa’s ruling African National Congress (ANC) met on Saturday to outline the party’s programme for the coming year amid reports that its executive planned to force Jacob Zuma to quit as the country’s president.\nMoving in the opposite direction, the Turkish lira eased 0.6 percent to 3.8280 after Turkey’s army and rebel allies battled U.S.-backed Kurdish militia in northern Syria, in a campaign that has opened a new front in Syria’s civil war.\nOil prices ticked up, pushed higher by comments from Saudi Arabia that cooperation between oil producers who are currently withholding supplies in an effort to prop up the market would continue beyond 2018.\nBrent crude futures were at $68.86, up 0.4 percent, from their last close. Brent on Jan. 15 hit its highest since December, 2014, at $70.37 a barrel.\nU.S. West Texas Intermediate (WTI) crude futures were at $63.57 a barrel, up 0.3 percent from their last settlement. WTI marked a December-2014 peak of $64.89 a barrel on Jan. 16.\nEditing by Shri Navaratnam\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T11:00:00.000+02:00", "crawled": "2018-01-22T20:44:21.003+02:00", "highlightTitle": ""}