{"organizations": [], "uuid": "4ac20e213992f85e4d47437bda18b06819c7241c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-magyar-bancorp-inc-announces-first-quarter-financial-results.html", "country": "US", "domain_rank": 767, "title": "Magyar Bancorp, Inc. Announces First Quarter Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.134, "site_type": "news", "published": "2018-01-25T17:20:00.000+02:00", "replies_count": 0, "uuid": "4ac20e213992f85e4d47437bda18b06819c7241c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-magyar-bancorp-inc-announces-first-quarter-financial-results.html", "ord_in_thread": 0, "title": "Magyar Bancorp, Inc. Announces First Quarter Financial Results", "locations": [], "entities": {"persons": [{"name": "john fitzgerald", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "new brunswick", "sentiment": "none"}], "organizations": [{"name": "magyar bancorp", "sentiment": "negative"}, {"name": "magyar bancorp, inc", "sentiment": "neutral"}, {"name": "magyar bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW BRUNSWICK, N.J., Jan. 25, 2018 /PRNewswire/ -- Magyar Bancorp (NASDAQ: MGYR) (\"Company\"), parent company of Magyar Bank, reported today the results of its operations for the three months ended December 31, 2017.\nThe Company reported net income of $329,000 for the three months ended December 31, 2017, compared to net income of $347,000 for the three months ended December 31, 2016.\nPre-tax earnings increased 52% to $893,000 for the three months ended December 31, 2017 from $587,000 for the three months ended December 31, 2016. Net income declined year-over-year due to higher income tax expense from the Company's write-down of its deferred tax asset resulting from the lower corporate tax rate imposed by the Tax Cuts and Jobs Act that was enacted on December 22, 2017.\nBasic and diluted earnings per share were $0.06 for both the three months ended December 31, 2017 and the three months ended December 31, 2016.\n\"We are pleased to start our new fiscal year off with strong results,\" stated John Fitzgerald, President and Chief Executive Officer. \"Total non-performing assets declined 10% on a linked quarter basis, and our net interest margin increased 14 basis points to 3.44% for the quarter ended December 31, 2017 from 3.30% for the quarter ended December 31, 2016. Smart loan growth combined with the Federal Reserve's interest rate hikes in 2017 resulted in a significant increase in our pre-tax earnings for this quarter. As we look ahead to the rest of the fiscal year, we expect the combination of prudent loan growth, further improvement in our balance sheet and the lower corporate tax rate to continue our positive earnings momentum.\nAbout Magyar Bancorp\nMagyar Bancorp is the parent company of Magyar Bank, a community bank headquartered in New Brunswick, New Jersey. Magyar Bank has been serving families and businesses in Central New Jersey since 1922 with a complete line of financial products and services. Magyar operates seven branch locations in New Brunswick, North Brunswick, South Brunswick, Branchburg, Bridgewater, and Edison (2). Please visit us online at www.magbank.com .\nForward Looking Statements\nThis press release contains statements about future events that constitute forward-looking statements within the meaning of the Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. Such forward-looking statements may be identified by reference to a future period or periods, or by the use of forward- looking terminology, such as \"may,\" \"will,\" \"believe,\" \"expect,\" or similar terms or variations on those terms, or the negative of those terms. Forward-looking statements are subject to numerous risks and uncertainties, including, but not limited to, those risks previously disclosed in the Company's filings with the SEC, general economic conditions, changes in interest rates, regulatory considerations, competition, technological developments, retention and recruitment of qualified personnel, and market acceptance of the Company's pricing, products and services, and with respect to the loans extended by the Bank and real estate owned, the following: risks related to the economic environment in the market areas in which the Bank operates, particularly with respect to the real estate market in New Jersey; the risk that the value of the real estate securing these loans may decline in value; and the risk that significant expense may be incurred by the Company in connection with the resolution of these loans. The Company wishes to caution readers not to place undue reliance on any such forward-looking statements, which speak only as of the date made. The Company does not undertake and specifically declines any obligation to publicly release the result of any revisions that may be made to any forward-looking statements to reflect events or circumstances after the date of such statements or to reflect the occurrence of anticipated or unanticipated events.\nView original content: http://www.prnewswire.com/news-releases/magyar-bancorp-inc-announces-first-quarter-financial-results-300588205.html\nSOURCE Magyar Bancorp", "external_links": ["http://www.prnewswire.com/news-releases/magyar-bancorp-inc-announces-first-quarter-financial-results-300588205.html", "http://www.magbank.com/"], "published": "2018-01-25T17:20:00.000+02:00", "crawled": "2018-01-25T18:19:25.008+02:00", "highlightTitle": ""}