{"organizations": [], "uuid": "71a519b4be31301295ce624547d1fd9519c09e08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/02/mpw-revised-logo-2-42.png", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/04/hoda-kotb-salary-clinton-fire-broadsheet-jan-4/", "country": "US", "domain_rank": 1196, "title": "Hoda Kotb salary, Hillary Clinton Fire: The Broadsheet Jan. 4 | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.28, "site_type": "news", "published": "2018-01-04T10:26:00.000+02:00", "replies_count": 0, "uuid": "71a519b4be31301295ce624547d1fd9519c09e08"}, "author": "Kristen Bellstrom", "url": "http://fortune.com/2018/01/04/hoda-kotb-salary-clinton-fire-broadsheet-jan-4/", "ord_in_thread": 0, "title": "Hoda Kotb salary, Hillary Clinton Fire: The Broadsheet Jan. 4 | Fortune", "locations": [], "entities": {"persons": [{"name": "hillary clinton", "sentiment": "negative"}, {"name": "hoda kotb", "sentiment": "negative"}, {"name": "kristen bellstrom", "sentiment": "negative"}, {"name": "tina smith", "sentiment": "none"}, {"name": "smith", "sentiment": "none"}, {"name": "matt lauer", "sentiment": "none"}, {"name": "eva hagberg fisher", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "minnesota", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "neutral"}, {"name": "new york times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Kristen Bellstrom 8:26 AM EST \nGood morning, Broadsheet readers! The Senate now boasts a record 22 women, there’s a fire at Hillary Clinton’s place, and—surprise, surprise—Hoda Kotb is being paid a fraction of what Matt Lauer made. Stay warm today! EVERYONE'S TALKING \n• Looking the part . I found this piece, titled “How I learned to look believable,” both heartrending and hilarious. In it, writer and Ph.D. candidate Eva Hagberg Fisher describes the various outfits she wore to the many “legal, semi-legal and legal-adjacent events” that unfolded after she filed an account of being sexual harassed by her former graduate school adviser. She brilliantly illuminates the impossibility of looking the way a victim “should look”—and reveals happens when you tell a J.Crew clerk, “I need something that looks like I’m destroying the patriarchy.” New York Times ALSO IN THE HEADLINES \n• Meet Senator Smith. Tina Smith was sworn in as Minnesota’s newest senator yesterday, becoming the 22nd woman to serve in the current U.S. Senate—a record-breaking milestone. Smith was appointed following the resignation of Al Franken over sexual harassment allegations. For more about her and how she plans to govern, check out this Teen Vogue piece. Fortune \n• Not Lauer loot . When asked if she’s making anything near the estimated $25 million a year that her predecessor Matt Lauer was taking home each year, new Today host Hoda Kotb told People , “The answer is no…I’m not making Matt Lauer money. Not even close.” (Her co-host Savannah Guthrie added, “For either of us.”) While NBC hasn’t confirmed the number, the New York Post is reporting that Kotb is now making $7 million per year. \n• The Google gap? The women suing Google for allegedly paying male employees more than their female counterparts have added a plaintiff and narrowed the proposed class of the suit to include more than two dozen specific job titles (including software engineer and project manager). Last month, a San Francisco judge ruled that the original proposed class, “all the women employed by Google in California,” was too broad. \nMOVERS AND SHAKERS: Karen Katz, CEO of Neiman Marcus group, is reportedly preparing to step down. MSNBC is promoting Colleen King and Tina Urbanski to executive producer. IN CASE YOU MISSED IT \n• We’ll miss you! Essence Communications, which includes Essence magazine and its Essence Music Festival, has been acquired by the aptly named Essence Ventures for an undisclosed amount. Previously owned by Fortune parent company Time Inc, Essence’s all-black, all-female executive team is lead by president Michelle Ebanks, who will continue in her role. Fortune \n• Apple doubles down on Reese . Apple, which has already ordered two seasons of a drama series staring Reese Witherspoon and Jennifer Aniston, is also developing a new original series with Witherspoon on board as executive producer. This one stars Octavia Spencer and is tied to the prominence of true crime podcasts like Serial in pop culture. Fortune \n• Khaled shrinks, Oprah’s bank account grows . DJ Khaled’s plans to use Weight Watchers (and, of course, share details of his slimdown on social media) have boosted shares of the company by nearly 9%. That’s a big win for Oprah Winfrey, growing the value of her 10% stake in the company by about $26 million in a 24-hour period. ", "external_links": [], "published": "2018-01-04T10:26:00.000+02:00", "crawled": "2018-01-04T16:30:14.014+02:00", "highlightTitle": ""}