{"organizations": [], "uuid": "aa1015ab460ca8ab353e77a62f9516b7e4b94919", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-keane-announces-public-secondary-offering-by-selling-stockholder.html", "country": "US", "domain_rank": 767, "title": "Keane Announces Public Secondary Offering by Selling Stockholder", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T15:43:00.000+02:00", "replies_count": 0, "uuid": "aa1015ab460ca8ab353e77a62f9516b7e4b94919"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-keane-announces-public-secondary-offering-by-selling-stockholder.html", "ord_in_thread": 0, "title": "Keane Announces Public Secondary Offering by Selling Stockholder", "locations": [], "entities": {"persons": [{"name": "houlihan lokey", "sentiment": "none"}, {"name": "scotia howard weil", "sentiment": "none"}], "locations": [{"name": "houston", "sentiment": "none"}], "organizations": [{"name": "keane", "sentiment": "negative"}, {"name": "frac", "sentiment": "negative"}, {"name": "keane group, inc.", "sentiment": "neutral"}, {"name": "citigroup", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "wells fargo securities", "sentiment": "none"}, {"name": "j.p. morgan", "sentiment": "none"}, {"name": "barclays", "sentiment": "none"}, {"name": "goldman sachs & co", "sentiment": "none"}, {"name": "keane investor holdings llc", "sentiment": "none"}, {"name": "piper jaffray & co.", "sentiment": "none"}, {"name": "bofa merrill lynch", "sentiment": "none"}, {"name": "citigroup inc.", "sentiment": "none"}, {"name": "broadridge financial service", "sentiment": "none"}, {"name": "morgan stanley", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON--(BUSINESS WIRE)-- Keane Group, Inc.(\"Keane\") (NYSE:FRAC) today announced that one of its stockholders, Keane Investor Holdings LLC (the \"Selling Stockholder\"), commenced an underwritten secondary offering of 11,000,000 shares of Keane's common stock. The Selling Stockholder also intends to grant the underwriters a 30-day option to purchase up to an additional 1,650,000 shares of Keane common stock.\nKeane is not selling any common stock in, and will not receive any proceeds from, the offering.\nCitigroup, J.P. Morgan, Barclays, BofA Merrill Lynch, Goldman Sachs & Co. LLC and Morgan Stanley are acting as joint book-running managers for the proposed offering. Piper Jaffray & Co. and Wells Fargo Securities are acting as senior co-managers for the proposed offering. Houlihan Lokey and Scotia Howard Weil are acting as co-managers for the proposed offering.\nThis offering will be made only by means of a written prospectus. A copy of the preliminary prospectus for the offering may be obtained, when available, from: Citigroup, attention: Citigroup Inc., c/o Broadridge Financial Services, 1155 Long Island Avenue, Edgewood, NY 11717, or by telephone at (800) 831-9146; J.P. Morgan Securities LLC, c/o Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, New York 11717, or by email at prospectus-eq_fi@jpmchase.com ; Barclays Capital Inc., c/o Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, NY 11717, or by telephone at (888) 603-5847, or by email at barclaysprospectus@broadridge.com ; BofA Merrill Lynch, attention: Prospectus Department, NC1-004-03-43, 200 North College Street 3rd floor, Charlotte, NC 28255-0001, or by email at dg.prospectus_requests@baml.com ; Goldman Sachs & Co. LLC, Prospectus Department, 200 West Street, New York, NY 10282, or by telephone at 1-866-471-2526, by facsimile at 212-902-9316 or by emailing Prospectus-ny@ny.email.gs.com ; or Morgan Stanley, attention: Prospectus Department, 180 Varick Street, 2 nd Floor, New York, NY 10014.\nA registration statement, including a prospectus, which is preliminary and subject to completion, relating to these securities has been filed with the Securities and Exchange Commission (\"SEC\") but has not yet become effective. These securities may not be sold nor may offers to buy be accepted prior to the time the registration statement becomes effective. This press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.\nAbout Keane Group, Inc.\nHeadquartered in Houston, Texas, Keane is one of the largest pure-play providers of integrated well completion services in the U.S., with a focus on complex, technically demanding completion solutions. Keane's primary service offerings include horizontal and vertical fracturing, wireline perforation and logging, engineered solutions and cementing, as well as other value-added service offerings.\nForward-Looking Statements\nThe statements contained in this release that are not historical facts are forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995. Words such as “may,” “will,” “could,” “should,” “expect,” “plan,” “project,” “intend,” “anticipate,” “believe,” “estimate,” “predict,” “potential,” “pursuant,” “target,” “continue,” and similar expressions are intended to identify such forward-looking statements. The statements in this press release that are not historical statements, including statements regarding Keane's plans, objectives, future opportunities for Keane's services, future financial performance and operating results and any other statements regarding Keane's future expectations, beliefs, plans, objectives, financial conditions, assumptions or future events or performance that are not historical facts, are forward-looking statements within the meaning of the federal securities laws. These statements are subject to numerous risks and uncertainties, many of which are beyond Keane's control, which could cause actual results to differ materially from the results expressed or implied by the statements. These risks and uncertainties include, but are not limited to the operations of Keane; the anticipated funding and expected delivery of the newbuild fleets; the effects of the business combination of Keane and RockPile, including the combined company’s future financial condition, results of operations, strategy and plans; potential adverse reactions or changes to business relationships resulting from the completion of the RockPile transaction; expected synergies and other benefits from the transaction and the ability of Keane to realize such synergies and other benefits; results of litigation, settlements and investigations; actions by third parties, including governmental agencies; volatility in customer spending and in oil and natural gas prices, which could adversely affect demand for Keane's services and their associated effect on rates, utilization, margins and planned capital expenditures; global economic conditions; excess availability of pressure pumping equipment, including as a result of low commodity prices, reactivation or construction; liabilities from operations; weather; decline in, and ability to realize, backlog; equipment specialization and new technologies; shortages, delays in delivery and interruptions of supply of equipment and materials; ability to hire and retain personnel; loss of, or reduction in business with, key customers; difficulty with growth and in integrating acquisitions; product liability; political, economic and social instability risk; ability to effectively identify and enter new markets; cybersecurity risk; dependence on our subsidiaries to meet our long-term debt obligations; variable rate indebtedness risk; and anti-takeover measures in our charter documents.\nAdditional information concerning factors that could cause actual results to differ materially from those in the forward-looking statements is contained from time to time in Keane's SEC filings, including the most recently filed Forms 10-Q and 10-K. and Keane's Registration Statement on Form S-1, including the preliminary prospectus, filed with the SEC on January 16, 2018. Keane undertakes no obligation to publicly update or revise any forward-looking statement.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180116006006/en/\nInvestors\nICR\nMarc Silverberg, 646-277-1293\nmarc.silverberg@icrinc.com\nSource: Keane Group, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180116006006/en/"], "published": "2018-01-16T15:43:00.000+02:00", "crawled": "2018-01-16T16:17:00.010+02:00", "highlightTitle": ""}