{"organizations": [], "uuid": "692958ec7cbe2e7e552565ff8db709a9be01b8b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219511994&w=1200&r=LYNXMPEE040A5", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-figureskating-usa-championships/figure-skating-chen-jumps-to-large-lead-after-mens-short-program-idUKKBN1EU0FV", "country": "US", "domain_rank": 408, "title": "Figure skating - Chen jumps to large lead after men's short program", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T07:27:00.000+02:00", "replies_count": 0, "uuid": "692958ec7cbe2e7e552565ff8db709a9be01b8b3"}, "author": "", "url": "https://uk.reuters.com/article/uk-figureskating-usa-championships/figure-skating-chen-jumps-to-large-lead-after-mens-short-program-idUKKBN1EU0FV", "ord_in_thread": 0, "title": "Figure skating - Chen jumps to large lead after men's short program", "locations": [], "entities": {"persons": [{"name": "chen", "sentiment": "negative"}, {"name": "adam rippon", "sentiment": "none"}, {"name": "nathan chen", "sentiment": "none"}, {"name": "jason brown", "sentiment": "none"}, {"name": "rippon", "sentiment": "none"}], "locations": [{"name": "usa", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "san jose", "sentiment": "none"}, {"name": "ca", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "sap center", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 5:29 AM / Updated 14 minutes ago Figure skating - Chen jumps to large lead after men's short program Reuters Staff 2 Min Read \n(Reuters) - Hot favourite Nathan Chen had a hiccup with his final jump but still did enough to take a big short program lead in the men’s competition at the U.S. figure skating championships on Thursday. Jan 4, 2018; San Jose, CA, USA; Nathan Chen performs in the mens short program during the 2018 U.S. Figure Skating Championships at SAP Center. Mandatory Credit: Stan Szeto-USA TODAY Sports \nProbably the best chance for American gold at next month’s Winter Olympics, the 18-year-old dazzled the crowd with his athleticism during a nearly three-minute routine in San Jose, California. \nHis technical score of 57.91 was more than eight points better than anyone else, and accounted entirely for his lead over Adam Rippon, who received a marginally better grade for artistry. \nChen received 104.45 points overall ahead of Rippon’s 96.52, with Jason Brown third on 93.23. \nChen’s short performance, ahead of Saturday’s free skate, came despite battling a cold in recent weeks and, by his own admission, struggling a little in practice. \n“The circumstances going into this competition weren’t great but I’ve struggled before with illness, with injury and I know I can push through anything and that’s what I reminded myself of here,” he said. \nThe only man to land five quad jumps in competition -- a quad refers to four spinning revolutions in the air -- Chen won the Grand Prix final in Japan on Dec. 8 and his class was on full display again on Thursday. \nHe made a confidence-boosting start by landing a quad flip-triple toe combination, and followed it up with an equally impressive quad toe. \nOnly on his final jump, a triple Axel, did he falter, stumbling upon landing but managing to regain his balance without touching his hand on the ice. \nThe U.S. championships offer a final chance for the men to impress selectors before three are named for the Pyeongchang Games. \nIn the pairs short program on Friday, the husband-and-wife duo of Chris and Alexa Knierim took the lead as they look to lock down the only U.S. berth on offer for South Korea. \n“So far it wouldn’t have gone any better,” said Alexa. \nThe championships continue with the women’s free skate on Friday night. Reporting by Andrew Both in Cary, North Carolina; editing by Amlan Chakraborty", "external_links": [], "published": "2018-01-05T07:27:00.000+02:00", "crawled": "2018-01-05T07:44:44.004+02:00", "highlightTitle": ""}