{"organizations": [], "uuid": "4ed916e4e475b12456eed83db4939ba2637c3b08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-oklahoma-drilling-patterson-uti/driller-at-center-of-oklahoma-well-blast-has-history-of-deadly-accidents-idUSKBN1FF2KN", "country": "US", "domain_rank": 408, "title": "Driller at center of Oklahoma well blast has history of deadly accidents", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T21:19:00.000+02:00", "replies_count": 0, "uuid": "4ed916e4e475b12456eed83db4939ba2637c3b08"}, "author": "", "url": "https://www.reuters.com/article/us-oklahoma-drilling-patterson-uti/driller-at-center-of-oklahoma-well-blast-has-history-of-deadly-accidents-idUSKBN1FF2KN", "ord_in_thread": 0, "title": "Driller at center of Oklahoma well blast has history of deadly accidents", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "liz hampton", "sentiment": "none"}], "locations": [{"name": "oklahoma", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}, {"name": "gulf of mexico", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "red mountain energy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON (Reuters) - Patterson-UTI Energy, the contractor at the center of the deadliest U.S. drilling accident since the Deepwater Horizon rig explosion in 2010, has the second worst worker fatality rate among its peers, according to federal workplace safety data.\nMonday’s disaster, which killed five workers drilling a well in eastern Oklahoma, put a spotlight on safety in the shale industry amid President Donald Trump’s policy of boosting U.S. output of fossil fuels. Last month, the administration proposed scaling back offshore safety regulations imposed after the Deepwater Horizon explosion in the Gulf of Mexico that killed 11 rig workers and caused a massive oil spill.\nThe cause of the Oklahoma blast, at a well being drilled for Red Mountain Energy by Patterson-UTI, has not yet been determined. The well’s blowout preventer, equipment designed to seal a well in an emergency, was damaged by the explosion and failed to work as intended, authorities have said. Among offshore regulations the Trump administration wants to remove is a requirement for third parties to certify that safety devices work under extreme conditions.\nIncluding Monday’s incident, at least 13 workers have died at Patterson-UTI drilling sites in the past decade, according to a Reuters review of data from the Occupational Safety and Health Administration (OSHA), whose functions include investigating workplace accidents.\nAndy Hendricks, Patterson-UTI’s chief executive, said in a statement earlier this week that “no one knows with certainty what happened, and it would be unwise to speculate.” The company has made “significant efforts” in safety training and protective equipment “to instill a company-wide culture where safety is the top priority for each employee,” a spokesman said.\nPatterson-UTI’s fatality rate is second only to rival Nabors Industries, which reported at least 20 worker deaths in the past decade, according to OSHA’s fatalities and catastrophes report.\nOver that same period, Helmerich & Payne - the onshore drilling company with the largest number of active rigs - has had five deaths, Precision Drilling Corp three, and Halliburton nine, according to the OSHA data.\nRepresentatives from Nabors, Helmerich & Payne and Precision Drilling did not respond to requests for comment. A Halliburton spokeswoman called safety a core value and its highest priority.\nHouston-based Patterson-UTI, formed more than a decade ago through the merger of two companies, currently has 148 rigs in operation, behind Helmerich & Payne with 213 rigs operating, according to data from researcher DrillingInfo. It bought U.S. drillers Seventy Seven Energy, which added 91 rigs to its fleet, and MS Energy Services last year.\nWhen companies make numerous acquisitions, they face challenges in ensuring a cohesive safety culture, said safety experts interviewed for this article.\n“It’s hard to integrate culture. You can’t just say, ‘you stop doing this, and you start doing this,'” said Wayne Vanderhoof, president of consultancy RJR Safety Inc, declining to comment specifically on Patterson-UTI. He estimated it takes about two years for newly-combined companies to integrate their safety practices.\nPatterson-UTI has been cited more than 110 times for “serious” safety violations in the past decade, according to OSHA, but only twice since 2015.\nIn September 2011, the regulator said it would fine Patterson-UTI $72,600 for four serious and two repeat safety violations, noting “the company repeatedly has exposed its workers to a variety of safety violations that could easily cause serious injuries.”\nThat penalty came four months after it was cited for violations following the death of a worker in Cotulla, Texas.\nAccidents during drilling kill some 100 people a year in the United States, according to the U.S. Centers for Disease Control and Prevention. Citing data from the Bureau of Labor Statistics, the CDC reported 1,189 oil and gas workers were killed in the 11 years ended 2013, a period of intense drilling in the country.\nDean Wingo, a former OSHA administrator who dealt regularly with Patterson-UTI, said of the company, “They’ve gotten a lot better. It was a family-owned company ... when it became public, that changed the management and that helped change the attitude.”\nReporting by Liz Hampton; Editing by Frances Kerry\n ", "external_links": [], "published": "2018-01-26T21:19:00.000+02:00", "crawled": "2018-01-26T21:39:14.001+02:00", "highlightTitle": ""}