{"organizations": [], "uuid": "45ea3f2d26eae1d5e62feeff7e9e1208b5b4c8ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/subjects/middle-east", "section_title": "Middle East Insight", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-turkey-redcresce/turkish-red-crescent-prepares-for-refugee-wave-from-syrias-afrin-idUSKBN1FE2EJ", "country": "US", "domain_rank": 408, "title": "Turkish Red Crescent prepares for refugee wave from Syria's Afrin", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.85, "site_type": "news", "published": "2018-01-26T00:24:00.000+02:00", "replies_count": 0, "uuid": "45ea3f2d26eae1d5e62feeff7e9e1208b5b4c8ce"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-turkey-redcresce/turkish-red-crescent-prepares-for-refugee-wave-from-syrias-afrin-idUSKBN1FE2EJ", "ord_in_thread": 0, "title": "Turkish Red Crescent prepares for refugee wave from Syria's Afrin", "locations": [], "entities": {"persons": [{"name": "kinik", "sentiment": "none"}, {"name": "kerem kinik", "sentiment": "none"}], "locations": [{"name": "turkey", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "afrin", "sentiment": "none"}, {"name": "idlib", "sentiment": "none"}, {"name": "azaz", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "turkish red crescent", "sentiment": "negative"}, {"name": "afrin istanbul", "sentiment": "negative"}, {"name": "red crescent", "sentiment": "negative"}, {"name": "afrin", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "free syrian army", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ISTANBUL (Reuters) - Turkey’s Red Crescent is preparing for a potential outflow of refugees from Syria’s Afrin region, where a Turkish offensive against a Kurdish militia entered a sixth day, the aid group said on Thursday.\nAfrin is home to about 324,000 people, more than a third of whom are internally displaced, data from the United Nations shows. The renewed fighting puts the population - 60 percent of whom were already in need of humanitarian aid before the latest violence - at risk of death, injury and further displacement.\nIn an interview with Reuters, Turkish Red Crescent President Kerem Kinik said the organization was preparing to accommodate 50,000 people in five different camps near Afrin.\nThree new campsites were being set up northeast of Afrin near Syria’s Azaz region, where most refugees are expected to head. The new camps would be additions to the two existing near Idlib, where recent fighting between Russia-backed Syrian regime forces and the Free Syrian Army (FSA) displaced 30,000, Kinik said.\nHe said the Red Crescent could accommodate many more people than expected but no civilians had come to the camps after the recent escalation in Afrin as they were not allowed to leave.\n“Up until now, (Syrian Kurdish) YPG forces have not allowed civilians to leave Afrin,” he said. “In a possible migration situation, we can house more people than our prepared capacity. We are used to unexpected numbers.”\nA YPG spokesman was not immediately available for comment.\nThe United Nations said on Tuesday that civilians’ freedom of movement had been harmed by the fighting as well as by a decision by Afrin local authorities to close all entry and exit points to the district.\nA limited number of families were reportedly able to move out of Afrin district towards some rural areas near Aleppo but were prevented from proceeding at Syrian government checkpoints, the world body said, citing local reports.\nKinik said he hoped around 150,000 people would be allowed to return home to Aleppo once the fighting in Afrin had finished. He also said he expected many civilians to leave Azaz and go back home to other towns in northern Syria.\nWhile the UN and its Office for the Coordination of Humanitarian Affairs (OCHA) have supported Turkey’s Red Crescent in accommodating Syrian refugees inside Turkey, they stopped operations in Afrin since the Turkish offensive began, Kinik said.\nAn OCHA spokesperson said that it had suspended humanitarian transport into Syria “because of insecurity”.\n“But the Turkish authorities kept the border open. Turkey did not close the border, but we suspended for security reasons our movements because of the military operation.”\nKinik said countries such as Turkey, Jordan, Lebanon and Iraq, which have shouldered most of the humanitarian needs caused by the Syrian war since it began almost seven years ago, deserved more support from the international community.\nHe described the scale of support as “truly a huge shame for humanity.”\n“Especially, the Syrian crisis, forgotten and neglected, is a crisis that people don’t want to hear about anymore.”\nEditing by William Maclean\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-26T00:24:00.000+02:00", "crawled": "2018-01-25T23:11:59.002+02:00", "highlightTitle": ""}