{"organizations": [], "uuid": "42433e602894e0859d820ef97a93f577c9c2a479", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180114&t=2&i=1221875153&w=1200&r=LYNXMPEE0D05V", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-britain-eu-farage/brexit-vote-may-be-reversed-says-british-campaigner-farage-idUKKBN1F309J", "country": "US", "domain_rank": 408, "title": "Brexit vote may be reversed, says British campaigner Farage", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T11:18:00.000+02:00", "replies_count": 0, "uuid": "42433e602894e0859d820ef97a93f577c9c2a479"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-eu-farage/brexit-vote-may-be-reversed-says-british-campaigner-farage-idUKKBN1F309J", "ord_in_thread": 0, "title": "Brexit vote may be reversed, says British campaigner Farage", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "farage", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "farage reuters staff", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "ukip", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "uk independence party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 14, 2018 / 9:18 AM / Updated 10 hours ago Brexit vote may be reversed, says British campaigner Farage Reuters Staff 2   Brexit campaigner Nigel Farage said on Sunday he was increasingly concerned that a vote for Britain to leave the European Union could be overturned by a powerful group of the bloc’s supporters. FILE PHOTO: Nigel Farage, ex-leader of Britain's anti-EU UK Independence Party (UKIP), speaks at a press conference of the Germany's far-right Alternative for Deutschland (AfD) party in Berlin, Germany, September 8, 2017. REUTERS/Hannibal Hanschke \nIn an interview with Britain’s Observer newspaper, Farage, former head of the eurosceptic UK Independence Party, said a well-organised and funded group of campaigners that wants to remain in the EU was drowning out those who want to leave. \n“The Remain side are making all the running,” said Farage. “They have a majority in parliament, and unless we get ourselves organised we could lose the historic victory that was Brexit.” \nLast week, Farage said he was warming to the idea of holding a second vote on Britain’s membership of the EU to settle the argument - an idea written off by other Brexit campaigners who urged the government to press on with exit talks with the bloc. \nIn 2016, Britons voted 52 to 48 percent in favour of ending its membership of the EU. Prime Minister Theresa May has ruled out a second referendum, saying her government was seeking an amicable divorce with the EU which will safeguard the economy and enable Britain to secure trade deals with other countries. \nBut some Brexit campaigners fear her approach has led to the watering down of several of their demands, including the ability to reduce immigration and to reclaim sovereignty by leaving the jurisdiction of the European Court of Justice. \nSeveral pro-EU campaigners say the need for a second referendum has become more pressing because public opinion is showing some signs of turning against Brexit as the difficulty of negotiations to leave the bloc becomes increasingly clear. \nOn Thursday, a ComRes poll for the Daily Mirror newspaper of 1,049 adults showed that although more people think there should not be a second referendum (51 to 43 percent), if there were to be a re-run, voters say they would opt to stay in the EU by 55 to 45 percent. Reporting by Elizabeth Piper, editing by Louise Heavens", "external_links": [], "published": "2018-01-14T11:18:00.000+02:00", "crawled": "2018-01-14T11:33:28.022+02:00", "highlightTitle": ""}