{"organizations": [], "uuid": "5a1c3a0b0180c4be0b0da2de2d989a210b037762", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/12/08/103225631-GettyImages-493361544.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/gas-tax-hike-is-the-bad-idea-that-wont-die-commentary.html", "country": "US", "domain_rank": 767, "title": "Gas tax hike is the bad idea that won't die—Commentary", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T22:05:00.000+02:00", "replies_count": 0, "uuid": "5a1c3a0b0180c4be0b0da2de2d989a210b037762"}, "author": "Jake Novak", "url": "https://www.cnbc.com/2018/01/29/gas-tax-hike-is-the-bad-idea-that-wont-die-commentary.html", "ord_in_thread": 0, "title": "Gas tax hike is the bad idea that won't die—Commentary", "locations": [], "entities": {"persons": [{"name": "charles", "sentiment": "none"}, {"name": "david koch", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "thom tillis", "sentiment": "none"}, {"name": "marsha blackburn", "sentiment": "none"}, {"name": "john cornyn", "sentiment": "none"}], "locations": [{"name": "florida", "sentiment": "none"}, {"name": "miami", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "tennessee", "sentiment": "none"}], "organizations": [{"name": "gop", "sentiment": "none"}, {"name": "u.s. chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A woman fills her vehicle with gas at a U-Gas station in Miami, Florida. \nSome ideas just never die, no matter how bad they are. \nPoliticians are particularly guilty of clinging to bad ideas. One idea too many politicians from both major parties can't seem to let go of is the belief that we should raise gas taxes to pay for infrastructure projects. \nThis idea is rearing its ugly head once again because President Donald Trump is about to unveil the details of his administration's $1 trillion to $1.7 trillion infrastructure investment program. \nThe usually anti-tax and Republican-leaning U.S. Chamber of Commerce is at the forefront of this move, promoting a five cent per gallon per year increase in the federal gas tax over the next five years. \nThere was an initial pushback on this idea from some congressional Republicans at a private GOP donor retreat hosted by billionaire industrialists Charles and David Koch this past weekend. Those going on the record to oppose it were Texas Sen. John Cornyn, North Carolina Sen. Thom Tillis, and Tennessee Rep. Marsha Blackburn. \nBut don't be fooled. There are still plenty of Republicans who lean in favor of this idea. Those Republicans definitely include some people in the Trump administration, who first reportedly floated the idea of a seven cent per gallon federal gas tax hike as recently as October. \nIn Congress, that group of Republicans seems to include the number three man in the Republican Senate leadership, John Thune of South Dakota. Thune is one of those guys who keep resurrecting the gas tax hike discussion. He first floated it in early 2015 as part of a plan to replenish the dwindling Highway Trust Fund. Then he backed off about seven months later when he realized there wasn't enough support for the idea. But Thune returned the gas tax idea when the reports of the possible Trump plan surfaced three months ago. \nOn the surface, this sounds like responsible government. The federal gas tax of 18.4 cents per gallon hasn't been raised since 1993 , and the Highway Trust Fund is often strapped for cash. There also seems to be bipartisan agreement that many of our roads and bridges need repairs now. Politicians need to do the right thing and stop being so scared of telling the voters they need to pay more for those roads we rely on every day, right? \nWrong. \nFirst off, not all the money from the gas tax actually is used for roads and bridges. \nThe last time the gas tax was raised in 1993, the entire additional tax hike was used to pay for overall federal budget deficit reduction for the first four years . But even now, about 16 percent of the money is funneled right into federal deficit reduction . It's like a tax on our taxes, if you didn't think that was possible. \nMillions of dollars also go to everything from somewhat related transportation programs like mass transit to totally unrelated pork barrel nonsense like hiking trails and a museum in honor of the defunct Packard luxury car in Ohio. If the argument is that we need to tax drivers to maintain the roads and other infrastructure they use, then using that tax money for non-driving infrastructure projects is dishonest. If mass transit maintenance costs aren't sustainable from the taxes specifically earmarked for their use, why should millions of drivers who often have no access to mass transit pay for it? \nWorse, relying on gas tax hikes also means relying on Americans continuing to drive and buy more at the pump. With fuel efficiency rising across all classes of vehicles and hybrids more available than ever, the government could tax itself right out of its own needed funding source. \nPeople may stop driving as much or start buying smaller and more fuel efficient cars if gas prices rise. In the latter scenario, the number of drivers will not go down, but the amount of gasoline purchased will fall and gasoline tax revenues along with it. That could mean raising the gas tax even higher to maintain revenues. \nDon't forget that a gas tax is really just another sales tax that adversely affects the lower middle class and the poor. Luckily, the 1993 gas tax hike came during a period of falling gas prices so its adverse impact on consumers was muted. Right now,national average gas prices have been under $3 per gallon for a few years now. But prices have been creeping up over the last few months. If that trend continues, consumers will feel a tax hike even more. Will the gas tax hike be indexed to gas price inflation at all? Don't hold your breath. \nOf course any tax hike, whether consumers feel it or not, isn't good for the economy. Every added cent spent on gas is a cent not invested or spent on clothing, dining out, etc. \nBut all of these arguments are really just parts of the same problem. That problem is that America's entire transportation system is too centrally planned and too car-centered to be safe, economically advantageous, and fiscally sustainable. \nOne of the best parts of what we've learned about the Trump infrastructure plan is that it reportedly will give priority to projects with demonstrated local demand and funding sources other than federal tax money. Boosting gas taxes by seven cents or five cents a gallon to pay for \"big idea\" projects flies in the face of that wisdom. \nBefore they raise any taxes on gasoline, the politicians need to prioritize truly needed repair projects. Then, they need to make sure the existing gas tax money is used for what it's supposed to be used for. Finally, they need to reexamine why so much money is spent for an automobile-centered culture and economy that's becoming more expensive to maintain with or without new taxes. \nCommentary by Jake Novak, CNBC.com senior columnist. Follow him on Twitter @jakejakeny . \nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": [], "published": "2018-01-29T22:05:00.000+02:00", "crawled": "2018-01-29T22:15:37.013+02:00", "highlightTitle": ""}