{"organizations": [], "uuid": "8ca663d8f49a06d4d7eda4e2221bbb1b5cd242f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223387209&w=1200&r=LYNXMPEE0I18B", "site_section": "http://feeds.reuters.com/reuters/healthNews\r", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-menopause-workplace/self-guided-course-helps-women-manage-menopause-symptoms-at-work-idUSKBN1F8218", "country": "US", "domain_rank": 408, "title": "Self-guided course helps women manage menopause symptoms at work", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T18:39:00.000+02:00", "replies_count": 0, "uuid": "8ca663d8f49a06d4d7eda4e2221bbb1b5cd242f4"}, "author": "", "url": "https://www.reuters.com/article/us-menopause-workplace/self-guided-course-helps-women-manage-menopause-symptoms-at-work-idUSKBN1F8218", "ord_in_thread": 0, "title": "Self-guided course helps women manage menopause symptoms at work", "locations": [], "entities": {"persons": [{"name": "myra s. hunter", "sentiment": "none"}, {"name": "cheryl platzman weinstock", "sentiment": "none"}], "locations": [], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}, {"name": "kings college london", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters Health) - A self-help cognitive behavioral therapy program combined with relaxation techniques can ease working women’s menopausal symptoms, according to a British study.\nThe program helps users learn strategies to control their thoughts and feelings. Working women who used it were able to significantly reduce the frequency and interference of hot flushes and night sweats, and improve their overall quality of life, researchers found.\nMenopause symptoms can be more difficult to deal with in the workplace than in other settings due to an inability to control the temperature, embarrassment, stress and other factors, coauthor Myra S. Hunter, emeritus professor of clinical health psychology, Kings College London, told Reuters Health by email.\nShe said that while hormone replacement therapy is an effective treatment for menopausal symptoms, not all women want to take it.\nCognitive behavioral therapy (CBT) has been used since the 1960s to treat a variety of medical problems, including anxiety, depression and sleep problems.\n“This study offers women who have problematic symptoms at work a brief, non-medical solution. The brief, self-help CBT helped women to manage symptoms, and also had broader impacts on sleep and wellbeing,” Hunter said.\nThe therapy also improved their work experience because they slept better, experienced less physical discomfort, social embarrassment, and memory and concentration problems.\nAs reported online January 8 in Menopause, the researchers produced a self-help CBT booklet designed to help working menopausal women learn CBT skills on their own. It included sections on work stress and how to discuss menopause at work.\nMenopause has been and still is, in many contexts, a taboo issue in the workplace, Hunter said.\nThe new study involved 124 working postmenopausal women who were having at least 10 hot flashes or night sweats per week. Half the women were randomly assigned to receive the self-help CBT booklet plus a breathing/relaxation CD. The other half were placed on a waiting list (the control group).\nOn average, the women in the study were having 56 hot flashes and/or night sweats per week. They arrived to work late, left early or stayed home from work an average of two days per month due to menopausal symptoms.\nThe participants completed follow-up questionnaires at six weeks and again at 20 weeks.\nIn the self-help group, the frequency of hot flashes and night sweats decreased by 24% over six weeks and 35% by 20 weeks.\nIn the control group, however, the frequency of hot flashes and/or night sweats had fallen by only 0.5% at six weeks and 15% at 20 weeks.\nThe self-help group also reported significant improvements in sleep quality and functioning at work, home, leisure and social situations.\nA subset of 27 women from the self-help group were interviewed after the trial. The majority, 82%, felt the intervention had helped them with hot flashes/night sweats. Fifty-two percent reported positive benefits to their work life, and roughly a third had talked about menopause to their line manager.\nOne limitation of the study was that is that it relied on subjective rather than objective measures. Also, the dropout rate was unexpectedly higher in the self-help group. Participants reported time pressures as the main problem for not following through with the intervention.\nDr. Mary Jane Minkin, clinical professor in the department of obstetrics, gynecology and reproductive sciences at Yale Medical School, New Haven, Connecticut, told Reuters Health by phone that she doesn’t see any harm in the self-help therapy.\n“The question is, how much does it really help?” said Minkin, who was not involved in the study. “Women need to be apprised that there are more effective approaches to curb menopause symptoms if they’re feeling poorly. When you really get down to it, why not use estrogen?”\nThe authors’ self-help book for women with hot flushes and night sweats, “Managing hot flushes and night sweats: a cognitive behavioral approach to the menopause,” is available from booksellers.\nSOURCE: bit.ly/2DsJpka\nMenopause 2018.\n ", "external_links": [], "published": "2018-01-19T18:39:00.000+02:00", "crawled": "2018-01-19T18:56:01.000+02:00", "highlightTitle": ""}