{"organizations": [], "uuid": "d790c5e7b0bca1ffb15e22060752d2bd2b634b70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 8, "shares": 8, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/20/104909549-GettyImages-873073022.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/09/alabamas-freshmen-stun-georgia-to-win-5th-college-football-championship-in-9-years.html", "country": "US", "domain_rank": 767, "title": "Alabama's freshmen stun Georgia to win 5th college football championship in 9 years", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T15:56:00.000+02:00", "replies_count": 0, "uuid": "d790c5e7b0bca1ffb15e22060752d2bd2b634b70"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/09/alabamas-freshmen-stun-georgia-to-win-5th-college-football-championship-in-9-years.html", "ord_in_thread": 0, "title": "Alabama's freshmen stun Georgia to win 5th college football championship in 9 years", "locations": [], "entities": {"persons": [{"name": "henry ruggs iii", "sentiment": "none"}, {"name": "tua tagovailoa", "sentiment": "none"}, {"name": "najee harris", "sentiment": "none"}, {"name": "devonta smith", "sentiment": "none"}, {"name": "jerry jeudy", "sentiment": "none"}, {"name": "harris", "sentiment": "none"}, {"name": "ruggs", "sentiment": "none"}, {"name": "tagovailoa", "sentiment": "none"}], "locations": [{"name": "georgia", "sentiment": "none"}, {"name": "alabama", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Alabama's freshmen stun Georgia to win 5th college football championship in 9 years Published 1 Hour Ago \nAlabama's latest group of hotshot recruits delivered on college football's biggest stage. \nAnd the Crimson Tide needed every big play from them. Jason Getz | USA TODAY Sports | Reuters Alabama Crimson Tide quarterback Tua Tagovailoa (13) celebrates with the College Football Championship Trophy after beating the Georgia Bulldogsin the 2018 CFP national championship college football game at Mercedes-Benz Stadium. \nQuarterback Tua Tagovailoa capped a second-half comeback with a 41-yard touchdown pass in overtime to fellow freshman DeVonta Smith in Monday night's 26-23 win over Georgia to give the Tide a fifth national championship in nine years. \nThe youth movement started well before that play. It featured runs by Najee Harris and a touchdown reception by Henry Ruggs III with help from a big catch by Jerry Jeudy. \n\"When the game that mattered most came around and we got opportunities, we made the most out of it,\" Harris said. \nThe outgoing stars passed the torch to the next wave a little earlier than expected. \nTagovailoa replaced starter Jalen Hurts to start the second half with Alabama down 13-0. He passed for 166 yards and three touchdowns and flashed some running ability, too. \nHarris ran for 64 yards on six carries and delivered some big fourth-quarter runs. He had a 16-yarder and a 35-yarder to set up a field goal and help keep Alabama alive. \nRuggs caught a 6-yard touchdown pass in the third quarter. Jeudy had a 20-yard catch on Alabama's tying touchdown drive late in the fourth. \nThen came Smith and Tagovailoa and a final freshman connection on second and 26 after a sack. \n\"I looked at Tua and said, 'Trust me,' and he nodded his head,\" Smith said. \"When I saw they were in Cover 2, I knew we had a chance.\" \nThe freshmen were matter-of-fact about their accomplishments. Making plays and winning titles is why the prized recruits came to Alabama, after all. David Rosenblum | Icon Sportswire | Getty Images Alabama Crimson Tide wide receiver DeVonta Smith (6) celebrates after making the game-winning catch in overtime the College Football Playoff National Championship Game between the Alabama Crimson Tide and the Georgia Bulldogs on January 8, 2018 at Mercedes-Benz Stadium in Atlanta, GA \n\"When they just called anybody's number, we were ready,\" Smith said. \"That's what everybody comes here to do. When your number is called, you're here just to make plays.\" \nThe players who played pivotal roles in getting Alabama to the title game — like Hurts and tailback Damien Harris — didn't seem to mind sharing the spotlight with the young 'uns. \nTagovailoa, Najee Harris, and Jeudy were all five-star recruits joining the fold of a team that reloads annually. \n\"We expect stuff like that,\" Damien Harris said. \"No matter who you are, no matter how long you're here, no matter what your experience is, whenever you get here you're expected to play to a standard. We've got a lot of young guys that were able to do that this year and in this game. We had a lot of older guys come in and contribute as well.\" \nBenched or not, Hurts was in the middle of the celebration and all smiles in the locker room. He had led Alabama to the national title game as both a freshman and sophomore but struggled in the first half. \nCoach Nick Saban benched him in what Hurts called \"an executive decision.\" \n\"As a competitor, of course you understand it,\" Hurts said. \"As a team player and as a leader, you've got to do what's best for the team. If that's what was best for the team, then I support it completely. \n\"In the national championship game, all the personal things, that's out the window. You want to win this game for the team.\"", "external_links": [], "published": "2018-01-09T15:56:00.000+02:00", "crawled": "2018-01-09T16:30:15.013+02:00", "highlightTitle": ""}