{"organizations": [], "uuid": "0457d8c449c91db3a0f5739ef7f713320a5d1115", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/business-wire-beacon-roofing-supply-completes-its-acquisition-of-allied-building-products.html", "country": "US", "domain_rank": 767, "title": "Beacon Roofing Supply Completes Its Acquisition of Allied Building Products", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T18:58:00.000+02:00", "replies_count": 0, "uuid": "0457d8c449c91db3a0f5739ef7f713320a5d1115"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/business-wire-beacon-roofing-supply-completes-its-acquisition-of-allied-building-products.html", "ord_in_thread": 0, "title": "Beacon Roofing Supply Completes Its Acquisition of Allied Building Products", "locations": [], "entities": {"persons": [{"name": "paul isabella", "sentiment": "none"}, {"name": "pres", "sentiment": "none"}], "locations": [{"name": "va.", "sentiment": "none"}, {"name": "herndon", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "upper midwest", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}], "organizations": [{"name": "crh", "sentiment": "none"}, {"name": "beacon", "sentiment": "none"}, {"name": "allied building products corp.", "sentiment": "none"}, {"name": "crg", "sentiment": "none"}, {"name": "lse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HERNDON, Va.--(BUSINESS WIRE)-- Beacon Roofing Supply, Inc. (Nasdaq: BECN) (“Beacon” or the “Company”), the largest publicly traded distributor of roofing and complementary building products in the United States and Canada, announced today the successful completion of its previously announced acquisition of Allied Building Products Corp. (“Allied”) from global diversified building products group CRH plc (LSE: CRH, ISE: CRG, NYSE: CRH) (“CRH”).\nCompletion of the Allied acquisition further strengthens Beacon’s position as one of the largest publicly traded wholesale building materials distributors in the United States and Canada, with approximately $7 billion in revenue and 589 branches throughout all 50 states and 6 provinces in Canada. Beacon also becomes the fourth largest wallboard and acoustical ceiling tile wholesale distributor in the U.S., with more than $1 billion of revenue in the interior market category. The Allied acquisition also significantly expands Beacon's geographic footprint in New York, New Jersey, the Upper Midwest and other major U.S. markets.\nPaul Isabella, President & CEO of Beacon, stated, “We are pleased to announce the completion of the Allied acquisition and we look forward to the successful integration of these two great companies. Beacon and Allied’s leadership have worked closely together on the integration planning to ensure a collaborative approach and an outcome that preserves the expertise and strengths of both organizations. I want to thank the Beacon and Allied teams for their tireless work and cooperation to successfully complete the financing and closing processes efficiently and on schedule. This combination is about driving growth through the expansion of our geographic footprint and range of products and creating increased value for our customers and shareholders. This is a milestone day in the long and successful histories of both companies and we are thrilled to start the new year as one company.”\nIn connection with the Allied acquisition, a fund managed by Clayton, Dubilier & Rice (“CD&R”), invested $400 million in Beacon and Nathan Sleeper, a CD&R partner, was appointed to Beacon’s Board of Directors, effective immediately. Mr. Sleeper previously was a member of Beacon’s Board of Directors from October 2015 through May 2016 in connection with Beacon’s previous acquisition of Roofing Supply Group (“RSG”) from a fund managed by CD&R.\nRobert R. Buck, Chairman of Beacon’s Board of Directors, added, “Together, Beacon and Allied will have more than 150 years of combined experience providing service excellence in the building products industry. Having this unique opportunity to combine two great companies of this magnitude is a testament to the dedication and hard work of the people across both organizations. I also am pleased to welcome Nate Sleeper back to our Board of Directors. His deep industrial sector expertise and leadership will prove to be extremely valuable as we continue moving our growth strategy forward.”\nThe Allied acquisition provides significant strategic and financial benefits:\nExpanded Exteriors Geographic Footprint: The expanded geographic footprint provides Beacon a presence in new markets - particularly in New York, New Jersey and the Upper Midwest. With this transaction, Beacon will operate locations in all 50 states and will expand its presence in other key markets including Texas, Florida, Colorado and California. Expansion into the Interior Business: The combination provides Beacon with entry into the adjacent interior business, including wallboard and suspended ceiling products, and strengthens the combined company's competitive positioning through extended product offerings. The interior category shares many attractive investment qualities and characteristics with the roofing products distribution business. Enhanced Growth Strategies: Beacon remains committed to increasing market share through organic growth focusing on a wide range of roofing and complementary products. Through the combination, Beacon will be well-positioned to leverage Allied's various market advantages, including its established private-label business and robust e-commerce platform, to further Beacon's organic growth strategies. Significant Cost Synergies Expected: The combined company is expected to realize $110 million in annual run-rate synergies within two years of closing.\nForward-Looking Statements\nThis release contains information about management's view of Beacon's future expectations, plans, and prospects that constitute forward-looking statements for purposes of the safe harbor provisions under the Private Securities Litigation Reform Act of 1995. You can identify forward-looking statements by the fact that they do not relate strictly to historic or current facts and often use words such as \"anticipate\", \"estimate\", \"expect\", \"believe\", \"will likely result\", \"outlook\", \"project\" and other words and expressions of similar meaning. Actual results may differ materially from those indicated by such forward-looking statements as a result of various important factors, including, but not limited to, those set forth in the \"Risk Factors\" section of Beacon's latest Form 10-K. In addition, numerous factors could cause actual results with respect to the Allied acquisition to differ materially from those in the forward-looking statements, including without limitation, the possibility that the expected synergies and cost savings and financial impacts from the Allied acquisition will not be realized, or will not be realized within the expected time period; the risk that the Beacon and Allied businesses will not be integrated successfully; disruption from the Allied acquisition making it more difficult to maintain business and operational relationships and the risk of customer attrition. The forward-looking statements included in this press release represent Beacon's views as of the date of this press release and these views could change. However, while Beacon may elect to update these forward-looking statements at some point, Beacon specifically disclaims any obligation to do so, other than as required by federal securities laws. These forward-looking statements should not be relied upon as representing Beacon's views as of any date subsequent to the date of this press release.\nAbout Beacon Roofing Supply, Inc.\nFounded in 1928, Beacon Roofing Supply, Inc. is the largest publicly traded distributor of residential and commercial roofing materials and complementary building products, operating 589 branches throughout all 50 states in the U.S. and 6 provinces in Canada. To learn more about Beacon and its family of regional brands, please visit www.becn.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180102005473/en/\nBeacon Roofing Supply, Inc.\nJoseph Nowicki, 571-323-3940\nExecutive VP & CFO\nJNowicki@becn.com\nSource: Beacon Roofing Supply, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180102005473/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.becn.com&esheet=51735868&newsitemid=20180102005473&lan=en-US&anchor=www.becn.com&index=1&md5=e4d3539a5e5d05dc830dc7e13f18f722"], "published": "2018-01-02T18:58:00.000+02:00", "crawled": "2018-01-02T19:10:34.013+02:00", "highlightTitle": ""}