{"organizations": [], "uuid": "353064318357b1276a11f424cefd82f8849d8186", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225514372&w=1200&r=LYNXMPEE0P0Z1", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-europe-hungary-visegrad/pm-fico-says-visegrad-group-are-not-black-sheep-in-eu-idUKKBN1FF1TL", "country": "US", "domain_rank": 408, "title": "CEE states want to have say in 'new blueprint' for EU", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T17:11:00.000+02:00", "replies_count": 0, "uuid": "353064318357b1276a11f424cefd82f8849d8186"}, "author": "", "url": "https://uk.reuters.com/article/uk-europe-hungary-visegrad/pm-fico-says-visegrad-group-are-not-black-sheep-in-eu-idUKKBN1FF1TL", "ord_in_thread": 0, "title": "CEE states want to have say in 'new blueprint' for EU", "locations": [], "entities": {"persons": [{"name": "orban", "sentiment": "none"}, {"name": "viktor orban", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "czech republic", "sentiment": "none"}, {"name": "visegrad", "sentiment": "none"}, {"name": "hungary", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "poland", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "slovakia", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "eu krisztina than 2 min read  budapest", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 2:03 PM / Updated 3 hours ago Eastern EU states tell Brussels to back off Krisztina Than , Gabriela Baczynska 5 Min Read \nBUDAPEST/BRUSSELS (Reuters) - The four eastern European Union states who are often at loggerheads with the bloc’s executive told Brussels on Friday not to overstep its mandate in policing national capitals. \nMeeting in Budapest, the leaders of Hungary, Poland, Slovakia and the Czech Republic agreed a joint stance for talks among all EU leaders on how to reform the bloc following Britain’s departure next year. \nThe four ex-communist countries are pushing back as leading, western EU powers Germany and France, backed by the European Commission in Brussels, are floating proposals for more integration among the remaining 27 EU states. \n“Europe needs a new blueprint. We must speak about an alliance of free nations,” said nationalist Hungarian Prime Minister Viktor Orban. \nHe was echoed by Polish counterpart Mateusz Morawiecki who said a “strong, integrated Europe” should be based on a group of sovereign, national member states rather than an increasingly centralised federation as some western states want. \nWarsaw and Budapest have become the enfants terribles of the EU under right-wing populist leaders who promote Catholic, conservative values and often clash with Brussels as it singles out deviations from EU standards on democracy and rule of law. \nPoland has drawn the sharpest criticism from Brussels since the conservative, nationalist Law and Justice (PiS) party won election in late 2015 and swiftly acted to tighten control over publicly-owned media, as well as the judiciary. \nThe bloc has taken unprecedented punitive steps against Warsaw, the largest, ex-communist EU state, for violating the rule of law and democratic principles. Warsaw has lashed back, accusing Brussels of double standards and saying its judicial overhaul is ridding Poland of lingering communist influence. \nAll four Visegrad countries have repeatedly rebuffed requests from Brussels and western EU states to host some of the hundreds of thousands of mostly Muslim refugees that have streamed into the EU since 2015. The bitter row has undermined trust between the bloc’s members and weakened their unity. \nSuch differences were redolent in a joint document issued by Bratislava, Prague, Budapest and Warsaw on Friday. FILE PHOTO: Polish Prime Minister Mateusz Morawiecki attends a joint news conference with Hungarian Prime Minister Viktor Orban (not pictured) in Budapest, Hungary January 3, 2018. REUTERS/Bernadett Szabo \n“EU institutions should treat all member states equally and act strictly within the remits of their respective... competencies. The right of member states to carry out domestic reforms within their competences should be respected,” it said. \nOn migration, the four restated their focus on “effective, responsible and enforceable (EU) external border protection to avoid obligatory quotas (being) applied, which are ineffective and have already divided Europe.” NO COMPLIANCE, NO MONEY? \nAll parties in the EU agree the quotas have proven divisive but have stuck to sharply divergent views on how to mend the bloc’s failed asylum system by a June deadline. FILE PHOTO: Slovakia's Prime Minister Robert Fico and European Commission President Jean-Claude Juncker (not pictured) hold a news conference after a meeting at the European Commission in Brussels, Belgium July 27, 2017. REUTERS/Eric Vidal \nThe four Visegrad premiers also said they should not be punished for having different opinions within the bloc. \n“I reject any criticism of us just because we have a different opinion ... about the (migration) quotas. We are not black sheep,” said Slovak Prime Minister Robert Fico. \nThey called for preserving generous EU spending on agriculture and development to help the poorer, ex-communist east catch up with wealthier peers in the west of the bloc. \nBut, as negotiations in the EU are starting to heat up on the bloc’s next budget for 2021-27, Brussels and other EU states say they want to link EU handouts to upholding the rule of law and assigning extra funds for managing migration. \nWhile the details are in the making, such decisions could cost Poland and Hungary billions of euros in the future if their nationalist-tinged feuds with Brussels are not resolved. \n“We are discussing preparing the definition of what conditions must be fulfilled by member states to be able... to receive the money of European taxpayers,” EU Justice Commissioner Vera Jourova said on Friday in Sofia. \n“The definition will be a more precise description of what we understand by the rule of law ... For me, it is a functioning system of independent judiciary, which should be in place in member states.” Editing by Mark Heinrich", "external_links": [], "published": "2018-01-26T17:11:00.000+02:00", "crawled": "2018-01-26T17:34:14.011+02:00", "highlightTitle": ""}