{"organizations": [], "uuid": "86794c37152cf3f3556be02432435636dfde60f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/subjects/middle-east", "section_title": "Middle East Insight", "url": "https://www.reuters.com/article/us-islamic-finance-ifsb/ifsb-to-develop-detailed-guidance-on-safety-nets-in-islamic-finance-idUSKBN1FE0CI", "country": "US", "domain_rank": 408, "title": "IFSB to develop detailed guidance on safety nets in Islamic finance", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.769, "site_type": "news", "published": "2018-01-25T12:55:00.000+02:00", "replies_count": 0, "uuid": "86794c37152cf3f3556be02432435636dfde60f5"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-islamic-finance-ifsb/ifsb-to-develop-detailed-guidance-on-safety-nets-in-islamic-finance-idUSKBN1FE0CI", "ord_in_thread": 0, "title": "IFSB to develop detailed guidance on safety nets in Islamic finance", "locations": [], "entities": {"persons": [{"name": "rehman khokher", "sentiment": "none"}, {"name": "khokher", "sentiment": "none"}, {"name": "zahid", "sentiment": "none"}], "locations": [{"name": "sydney", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "islamic financial services board", "sentiment": "negative"}, {"name": "ifsb", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SYDNEY (Reuters) - The Islamic Financial Services Board (IFSB) plans to develop more detailed guidance on financial safety nets to help harmonize Islamic principles with existing legal systems, as the industry body strengthens ties with financial regulators.\nThe Malaysia-based IFSB, one of the main standard-setting bodies in Islamic finance, is seeking to shed light on issues relating to sharia-compliant transactions in areas such as insolvency and bankruptcy.\nSuch efforts are important as Islamic finance expands in both established and new markets, while transactions are under heightened scrutiny due to the perceived risk of non sharia-compliance or sharia risk.\n“Soon, the IFSB plans to commence work on providing more detailed guidance on the implementation of key pillars of financial safety net for Islamic finance,” said Acting Secretary General Zahid ur Rehman Khokher.\nThis may include more detailed work on deposit insurance in its 2018 agenda, while work on dispute resolution and insolvency may be completed later, said Khokher.\nOver the past few years the IFSB has sought to develop more concrete guidance for its membership, which now includes 75 national regulators.\nLast month, the IFSB admitted eight new members, including Saudi Arabia’s Capital Market Authority, the Abu Dhabi Global Market and German financial watchdog Bafin.\nHalf of the IFSB’s 2018 implementation workshops will be held in African countries, Khokher said.\n“We are engaging with these members and are trying to be responsive to the needs of these emerging Islamic finance markets in our work plan and activities.”\nINSOLVENCY The IFSB has issued three working papers exploring safety nets, the latest covering recovery, insolvency and bankruptcy issues in sharia-compliant transactions.\nIssues raised range from the bail-in features embedded in capital-boosting Islamic bonds to the regulatory treatment of profit-sharing investment accounts offered by Islamic banks.\nIslamic debt-based contracts are also under scrutiny because dispute resolution can differ from conventional transactions.\nThis relates to the Islamic principle of insolvency, or iflas, which states that debt cannot be written off unless there is specific forgiveness by a creditor.\nUnder iflas, insolvency cannot be voluntary and unilateral but rather requires a declaration by a competent authority.\nImplementation of such principles is complicated, however, because there is no national legal system that incorporates iflas, even in Muslim-majority countries.\nReporting by Bernardo Vizcaino; Editing by Eric Meijer\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T12:55:00.000+02:00", "crawled": "2018-01-25T10:09:34.012+02:00", "highlightTitle": ""}