{"organizations": [], "uuid": "dde361e25059d506b40c86d9300ee5c1a8d67a9b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-sharps-compliance-announces-second-quarter-fiscal-2018-conference-call-and-webcast.html", "country": "US", "domain_rank": 767, "title": "Sharps Compliance Announces Second Quarter Fiscal 2018 Conference Call and Webcast", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.112, "site_type": "news", "published": "2018-01-16T19:01:00.000+02:00", "replies_count": 0, "uuid": "dde361e25059d506b40c86d9300ee5c1a8d67a9b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-sharps-compliance-announces-second-quarter-fiscal-2018-conference-call-and-webcast.html", "ord_in_thread": 0, "title": "Sharps Compliance Announces Second Quarter Fiscal 2018 Conference Call and Webcast", "locations": [], "entities": {"persons": [], "locations": [{"name": "webcast houston", "sentiment": "none"}, {"name": "sharps", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}], "organizations": [{"name": "sharps compliance corp.", "sentiment": "negative"}, {"name": "sharps compliance", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "about sharps compliance corp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON, Jan. 16, 2018 (GLOBE NEWSWIRE) -- Sharps Compliance Corp. (Nasdaq:SMED) announced today that it will release its second quarter results for the period ended December 31, 2017, before the opening of the financial markets on Tuesday, January 23, 2018. A conference call and webcast will follow at 11:00 a.m. ET, in which management will discuss the Company’s financial results, key market initiatives and business strategy.\nThe Sharps conference call can be accessed by domestic callers by dialing (877) 407-0782. International callers may access the call by dialing (201) 689-8567. The webcast can be monitored at www.sharpsinc.com .\nA telephonic replay will be available through February 23, 2018. To listen to the replay, domestic callers should dial (877) 481-4010 and international callers should dial (919) 882-2331 and enter replay ID number 24077. Transcript will also be posted to the Sharps website, once available.\nAbout Sharps Compliance Corp.\nHeadquartered in Houston, Texas, Sharps Compliance is a leading full-service national provider of comprehensive waste management services including medical, pharmaceutical and hazardous. Its key markets include healthcare facilities, pharmaceutical manufacturers, home healthcare providers, assisted living / long-term care, surgery centers, retail pharmacies and clinics, and the professional market which is comprised of physicians, dentists and veterinary practices. The Company's flagship product, the Sharps Recovery System, is a comprehensive solution for the containment, transportation, treatment and tracking of medical waste and other used healthcare materials. The Company also offers its route-based pick-up service in a twenty-three (23) state region of the South, Southeast and Northeast portions of the United States.\nMore information on the Company and its products can be found on its website at: www.sharpsinc.com\nSafe Harbor Statement\nThe information made available in this news release contains certain forward-looking statements which reflect Sharps Compliance Corp.'s current view of future events and financial performance. Wherever used, the words \"estimate,\" \"expect,\" \"plan,\" \"anticipate,\" \"believe,\" \"may\" and similar expressions identify forward-looking statements. Any such forward-looking statements are subject to risks and uncertainties and the company's future results of operations could differ materially from historical results or current expectations. Some of these risks include, without limitation, the company's ability to educate its customers, development of public awareness programs to educate the identified consumer, customer preferences, the Company's ability to scale the business and manage its growth, the degree of success the Company has at gaining more large customer contracts, managing regulatory compliance and/or other factors that may be described in the company's annual report on Form 10-K, quarterly reports on Form 10-Q and/or other filings with the Securities and Exchange Commission. Future economic and industry trends that could potentially impact revenue and profitability are difficult to predict. The Company assumes no obligation to publicly update or revise its forward-looking statements even if experience or future changes make it clear that any projected results, express or implied therein, will not be realized.\nCompany Contact:\nDiana Diaz\nSharps Compliance Corp.\nEmail: ddiaz@sharpsinc.com\nOffice: (713) 660-3547\nInvestor Contact:\nJohn Nesbett/Jennifer Belodeau\nInstitutional Marketing Services\nEmail: jnesbett@institutionalms.com\nOffice: (203) 972-9200\nSource:Sharps Compliance Corp", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/e8ca4fa9-deb7-422c-9686-2332b1c4884f", "https://www.globenewswire.com/Tracker?data=24gO_-dn_5DRxd8rmhc-CDNEfbntURWThK2xm90Y0J32SLsEZmlsml3gRWBYxNeC3Ov25gbmZ5YS2DkSLI9G8u9GIr32oxp2MXdMMVOe6XpbjEDot8rutZI_dxhLLc2nLWwOTtQO72kJ6Amuckv4u-m1HaHNOKPGJiKKOndaEOrOCBKsiyoDU-3WlXC_FxFP9OeR8tu8rHMVyVgh99CT0dsIovTU5-uPM20xNbX4y0o=", "https://www.globenewswire.com/Tracker?data=24gO_-dn_5DRxd8rmhc-CD9tib6ENIHBg8XfOotyh-GE1XiOQK2aVzp4mhblZO8txnQGaCXwXthWg5gxjBiXuA=="], "published": "2018-01-16T19:01:00.000+02:00", "crawled": "2018-01-16T18:25:20.038+02:00", "highlightTitle": ""}