{"organizations": [], "uuid": "7f84e7c78f38224f33fc1c3c0a37df7e96a7675e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/bitcoin-jamie-dimon.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/09/bitcoin-price-chase-jamie-dimon/", "country": "US", "domain_rank": 1196, "title": "Bitcoin: No, JPMorgan Chase CEO Jamie Dimon Has Not Changed His Stance | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.2, "site_type": "news", "published": "2018-01-09T02:00:00.000+02:00", "replies_count": 0, "uuid": "7f84e7c78f38224f33fc1c3c0a37df7e96a7675e"}, "author": "Robert Hackett", "url": "http://fortune.com/2018/01/09/bitcoin-price-chase-jamie-dimon/", "ord_in_thread": 0, "title": "Bitcoin: No, JPMorgan Chase CEO Jamie Dimon Has Not Changed His Stance | Fortune", "locations": [], "entities": {"persons": [{"name": "jamie dimon", "sentiment": "negative"}, {"name": "jamie", "sentiment": "none"}, {"name": "dimon", "sentiment": "none"}, {"name": "alan silbert", "sentiment": "none"}, {"name": "peter smith", "sentiment": "none"}], "locations": [], "organizations": [{"name": "jpmorgan chase", "sentiment": "negative"}, {"name": "fox business", "sentiment": "none"}, {"name": "healthcare", "sentiment": "none"}, {"name": "wall street journal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JPMorgan Chase CEO Jamie Dimon said he regrets calling Bitcoin a “ fraud ” last year. \n“I just have a different opinion than other people,” Dimon said an interview with Fox Business on Tuesday. “I’m not interested that much in the subject at all.” \nMany people seem to be interpreting Dimon’s statement as an about-face from his earlier dismissal of the cryptocurrency. Indeed, the Wall Street Journal said that the CEO is “softening his stance on bitcoin.” \nOthers have also taken the view that the bank chief is now beginning to come around to the idea of so-called digital gold as Bitcoin’s price has soared in recent months. Since Dimon made his “fraud” remarks in Sept., the cryptocurrency’s price has rocketed to more than $19,000 from around $4,000. (At press time, Bitcoin was trading at about $14,700.) \n“Backpedaling is the first step in the program towards walking the path,” Alan Silbert, senior vice president at Capital One (cof) Healthcare, wrote on Twitter . \n“Looks like Jamie has started the conversion process to the church of cyrpto [sic],” added Peter Smith, CEO of Blockchain.info, a cryptocurrency wallet and exchange startup, somewhat lightheartedly, in another Twitter post . “Give it another twelve months and @jpmorgan will be full steam ahead on cyrpto [sic] ;).” \nDespite the coverage and commentary, it’s worth noting that Dimon’s latest admission of regret does not differ in the slightest from what he has said in the past. Consider the misgivings Dimon shared at an International Institute of Finance conference three months ago. \nAs CNBC then reported , Dimon expressed regret about his weeks-earlier “fraud” remark at the event, calling it a “stupid statement.” \n“I could care less about Bitcoin. I don’t know why I said anything about it,” Dimon said at the time. \nNo, Dimon has not changed his view on Bitcoin—and honestly, he has not even changed his approach. The CEO has been trying to avoid weighing in on the cryptocurrency craze, but when asked about it, he continues to offer the same line: regret that he made scornful remarks, not regret that he disdains Bitcoin. \nWhat’s likelier than Jamie Dimon coming around on Bitcoin any time soon is his recognition that anything he might say, as the leader of the biggest bank in America, is bound to reverberate among prospective investors and potentially bolster the cryptocurrency market. (Bitcoin’s rejection by the head of JPMorgan merely serves to strengthen the resolve of its core libertarian constituency; paradoxically, any endorsement would incite mania just as well.) \nNo doubt the company is wary of running afoul of regulators. \nThe long and short term business implications for JPMorgan dissing Bitcoin remain to be seen. (While the bank does process client orders for Bitcoin-related exchange-traded notes , the company said it does not put any of its own capital into trading the cryptocurrency and so far has not offered access to Bitcoin futures contracts .) \n\nInstead, Dimon is attempting (and failing) to abstain from publicly voicing his dislike. He is apparently not sorry for his aversion to Bitcoin, he is merely sorry for feeding the frenzy. \nGet Data Sheet , Fortune’s technology newsletter. \nDimon probably never expected his “fraud” remark in Sept. to take flight the way it did. And why should he have? \nWhen Dimon spoke at Fortune’s Global Forum in 2015 , he said almost exactly the same thing he would reiterate years later. “You’re wasting your time [with Bitcoin],” Dimon said then. “There will be no currency that gets around government controls.” \nTo be clear, this is the same line Dimon has been touting for years. As Dimon most recently told Fox Business , his stance on Bitcoin has always been informed by his estimation of “what the governments are going to feel about Bitcoin if it gets really big.” \nYou can watch that clip below. \nOf course, just because Dimon is bearish on Bitcoin does not mean that he isn’t bullish on the technology behind it. He likes blockchains, the shared, digital accounting ledgers that power cryptocurrencies, as he has made clear in many interviews. He’s fine even with government- and central bank-backed cryptocurrencies, like “crypto dollars and yen,” too. \n(If you’re interested in learning more about JPMorgan’s blockchain efforts, read this Fortune cover story from September and this related feature from November.) \nNo, Dimon has not changed his tune about Bitcoin. His judgment has not wavered—though whether that will ultimately help or hurt the bank remains to be seen. \nAs Dimon told Fox Business on Bitcoin: “I’ll leave that to everyone else to figure out what they want to do with that.” SPONSORED FINANCIAL CONTENT", "external_links": [], "published": "2018-01-09T02:00:00.000+02:00", "crawled": "2018-01-10T10:05:47.034+02:00", "highlightTitle": ""}