{"organizations": [], "uuid": "a8400c1ec5ae3852017e7555a50c00d7b15f18ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224707809&w=1200&r=LYNXMPEE0N09H", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-brazil-politics-lula/brazil-braces-for-ruling-that-could-bar-lula-from-2018-race-idUSKBN1FD0FU", "country": "US", "domain_rank": 408, "title": "Brazil braces for ruling that could bar Lula from 2018 race", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T08:04:00.000+02:00", "replies_count": 0, "uuid": "a8400c1ec5ae3852017e7555a50c00d7b15f18ff"}, "author": "", "url": "https://www.reuters.com/article/us-brazil-politics-lula/brazil-braces-for-ruling-that-could-bar-lula-from-2018-race-idUSKBN1FD0FU", "ord_in_thread": 0, "title": "Brazil braces for ruling that could bar Lula from 2018 race", "locations": [], "entities": {"persons": [{"name": "lula", "sentiment": "negative"}, {"name": "luiz inacio lula da silva", "sentiment": "none"}, {"name": "lisandra paraguassu", "sentiment": "none"}], "locations": [{"name": "brazil", "sentiment": "none"}, {"name": "porto alegre", "sentiment": "none"}], "organizations": [{"name": "porto alegre", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 6:05 AM / in 11 minutes Lula's Brazil presidential run in doubt after conviction upheld Lisandra Paraguassu 5 Min Read \nPORTO ALEGRE, Brazil (Reuters) - A Brazilian appeals court unanimously upheld the corruption conviction of former President Luiz Inacio Lula da Silva on Wednesday and added to his sentence, a major blow to the popular politician’s plans to run again for the presidency this year. \nAll three appellate court judges voted to uphold Lula’s convictions on taking bribes and money laundering. They also added 2 1/2 years to his sentence, condemning him to 12 years in prison. Lula, Brazil’s first working-class leader, so far remains free pending future appeals. \nLula, 72, could now be ineligible to stand for election under Brazil’s “Ficha Limpa” or “Clean Record” law, which bans political candidates whose convictions have been upheld by an appellate court. However, an electoral court must make the final ruling on a candidacy, and would only do so once a candidate had registered. \nLula can appeal Wednesday’s decision by the appeals court in Porto Alegre to higher courts to delay a final ruling, possibly avoiding jail and stringing the process out long enough to register his candidacy by the Aug. 15 deadline. \nLula’s Workers Party called the ruling a “farce” orchestrated by Lula’s enemies to stop him returning to power. The party said it would resist the decision and push ahead with its plan to launch him as presidential candidate. \nA handful of supporters protested the court decision on Wednesday evening, setting fire to tires in downtown Porto Alegre and across a major highway in Sao Paulo, South America’s largest city. \nOpponents of Lula, meanwhile, celebrated on Sao Paulo’s main avenue with a giant blown-up figure of the ex-president dressed as a prison convict. \nLula is one of scores of powerful politicians and businessmen caught up in sweeping corruption probes that have wracked the Brazilian establishment since 2014. \nHis exclusion from the October election would radically alter the political landscape ahead of a campaign in which Lula is the early favorite, with 36 percent of voter preferences according to pollster Datafolha. That is double the percentage of his nearest rival, the far-right congressman and former army captain Jair Bolsonaro, who has been energized by anti-Lula sentiment. \nBrazil’s benchmark Bovespa stock index hit a new intraday high of 83,635 points on news of the unanimous ruling against Lula. It closed 3.32 percent higher on investor expectations his exclusion from the 2018 race will clear the way for a more market-friendly candidate who can stick to Brazil’s austerity agenda. Former Brazilian President Luiz Inacio Lula da Silva reacts as he arrives at the metallurgical trade union while the Brazilian court decides on his appeal against a corruption conviction that could bar him from running in the 2018 presidential race, in Sao Bernardo do Campo, Brazil January 24, 2018. REUTERS/Leonardo Benassatto \nBrazil’s currency, the real, firmed 3 percent against the U.S. dollar, leading gains in Latin America. \n“The ruling takes off the table the worst possible scenario for the market, the biggest downside possible in terms of the election,” said Roberto Campos, a partner at Sao Paulo-based Absolute Investimentos. “The guy who was completely not market-friendly is out.” MORE CASES Slideshow (7 Images) \nLula faces six more indictments in corruption cases ranging from receiving bribes from engineering firm Odebrecht [ODBES.UL] to obstructing justice and trafficking his influence to obtain government decisions favoring the auto industry. \nHe is among over 100 people convicted in the “Car Wash” investigation, the most sprawling of Brazil’s numerous probes. It focuses on graft involving oil firm Petroleo Brasileiro, known as Petrobras , and other state-run companies. \nSpeaking at a union rally on the outskirts of Sao Paulo on Wednesday, Lula told the crowd: “I committed no crime.” \n“The only fair decision today would be a 3-0 ruling that I was wrongly convicted and sentenced,” he said. \nLula was convicted of corruption and money laundering last year for accepting a beachside apartment from an engineering firm vying for contracts with Petrobras. \nProsecutors said the apartment and its refurbishing was a bribe worth 3.7 million reais ($1.1 million). Lula maintains he never owned the penthouse apartment, criticizing prosecutors for what Lula’s lawyers called a reliance on the plea bargain testimony of one witness, businessman Leo Pinheiro. \n“His word is not enough to incriminate Lula,” Lula’s lawyer Cristiano Zanin told the appeals court. Reporting by Lisandra Paraguassu in Porto Alegre, Writing and additional reporting by Anthony Boadle in Brasilia, Additional reporting by Bruno Federowski in Brasilia and Pablo Garcia in Sao Bernardo do Campo; Editing by Andrew Hay and Rosalba O'Brien", "external_links": [], "published": "2018-01-24T08:04:00.000+02:00", "crawled": "2018-01-24T08:15:04.014+02:00", "highlightTitle": ""}