{"organizations": [], "uuid": "4996343d63f50ae3ecdfad0f156c07cb90fda2cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/07/reed-hastings-net-worth-netflix.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/22/netflix-earnings-subscriber-growth-100-billion/", "country": "US", "domain_rank": 1196, "title": "Netflix Value Hits $100 Billion as Stock Soars on Earnings | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.222, "site_type": "news", "published": "2018-01-23T20:12:00.000+02:00", "replies_count": 0, "uuid": "4996343d63f50ae3ecdfad0f156c07cb90fda2cc"}, "author": "Tom Huddleston Jr.", "url": "http://fortune.com/2018/01/22/netflix-earnings-subscriber-growth-100-billion/", "ord_in_thread": 0, "title": "Netflix Value Hits $100 Billion as Stock Soars on Earnings | Fortune", "locations": [], "entities": {"persons": [{"name": "tom huddleston jr.", "sentiment": "negative"}], "locations": [{"name": "wall street", "sentiment": "none"}, {"name": "netfli", "sentiment": "none"}], "organizations": [{"name": "netflix", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Tom Huddleston Jr. 6:12 PM EST \nNetflix’s market value topped $100 billion for the first time ever on Monday after the streaming giant’s fourth-quarter subscriber growth blew away Wall Street’s forecasts. \nShares of Netflix soared in after-hours trading following the company’s latest quarterly earnings report, rising nearly 10% to pull Netflix’s market capitalization north of $100 billion. Netflix had already finished trading on Monday at an all-time record close of $227.58, before approaching the $250-point mark in after-hours trading. \nThe stock jump came as investors celebrated Netflix’s report that the company added a total of 8.3 million new streaming subscribers in the fourth quarter of 2017, which easily outpaced the forecast of 6.3 million new streamers from Wall Street and Netflix itself. History has shown that investors typically judge Netflix’s earnings results based on how many new subscribers are added, with the company’s shares usually jumping when subscriber growth exceeds expectations and dipping when Netflix comes up short. \nThere had been some concern that Netflix’s recent price hike , which began to roll out during the most recent quarter, may turn off some customers and drag down the number of net subscriber additions. But that clearly was not the case, as Netflix’s letter to shareholders touted the company’s “stronger than expected acquisition fueled by our original content slate and the ongoing global adoption of internet entertainment.” \nGet Data Sheet , Fortune’s technology newsletter. \nNetflix benefitted from very strong growth overseas, with almost 6.4 million of its new streaming users added in international markets in the most recent quarter. The fourth quarter included the premieres of new seasons for two breakout hit Netflix original shows, the sci-fi series Stranger Things and historical drama The Crown , as well as the release of the movie Bright , a fantasy thriller that cost Netflix a whopping $90 million. \nNetflix continues to spend more and more on its original programming—more than $8 billion this year—in an effort to keep its impressive subscriber growth humming along and, in turn, spur higher revenues. On Monday, Netflix also reported fourth-quarter revenue of $3.29 billion, up almost 33% from the same period a year earlier, which was in line with Wall Street’s expectations. \nOne area of concern for Netflix could be the company’s ever-growing negative cash flow, with a free cash flow of negative $524 million in the fourth quarter. Netflix is now forecasting a free cash flow between negative $3 billion and negative $4 billion in 2018, after ending last year at negative $2 billion. That’s a result of Netflix’s spending spree on streaming programming, which is fueling subscriber growth but could present a problem for Netflix is the streaming giant ever hits a rough patch where it struggles to churn out hit TV shows and films. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-23T20:12:00.000+02:00", "crawled": "2018-01-23T01:43:24.021+02:00", "highlightTitle": ""}