{"organizations": [], "uuid": "e7984dabb3fc441c921eb80230cf082cd7a63c47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-the-fannie-and-john-hertz-foundation-expands-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "The Fannie and John Hertz Foundation Expands Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T16:00:00.000+02:00", "replies_count": 0, "uuid": "e7984dabb3fc441c921eb80230cf082cd7a63c47"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-the-fannie-and-john-hertz-foundation-expands-board-of-directors.html", "ord_in_thread": 0, "title": "The Fannie and John Hertz Foundation Expands Board of Directors", "locations": [], "entities": {"persons": [{"name": "samuel h. fuller", "sentiment": "negative"}, {"name": "robbee baker kosak", "sentiment": "none"}, {"name": "sam", "sentiment": "none"}], "locations": [{"name": "ermore", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "john hertz foundation", "sentiment": "negative"}, {"name": "fannie", "sentiment": "negative"}, {"name": "carnegie mellon university", "sentiment": "none"}, {"name": "digital equipment corporation and analog devices inc.", "sentiment": "none"}, {"name": "hertz foundation fellowship", "sentiment": "none"}, {"name": "hertz foundation", "sentiment": "none"}, {"name": "hertz", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Hertz Fellow Samuel H. Fuller Offers Exceptional Insight into Both Higher Education and Industry\nLIVERMORE, Calif.--(BUSINESS WIRE)-- The Fannie and John Hertz Foundation, a not-for-profit organization dedicated to empowering America’s most brilliant minds in science, mathematics and engineering, has announced the election of Samuel H. Fuller to its Board of Directors. Fuller is a Hertz Fellow with a wide-ranging background, including leadership roles at Digital Equipment Corporation and Analog Devices Inc., and as an associate professor at Carnegie Mellon University.\n“The importance of our Board of Directors in leading the Hertz Foundation and shaping the evolution of our hallmark program—the prestigious Hertz Foundation Fellowship—cannot be overstated,” said Robbee Baker Kosak, president, the Fannie and John Hertz Foundation. “We are all dedicated to identifying and supporting this country’s next generation of leaders in the STEM fields. Sam brings a wealth of experience in the classroom, research lab and private industry, which provides a unique perspective on mentoring and advising students on their career goals. On behalf of the entire Board, we are delighted to welcome Sam and look forward to his contributions as we deepen our knowledge base and expertise to appeal to today’s diverse students.”\nAs a Hertz Fellow, Fuller earned his PhD in electrical engineering at Stanford University. Fuller is CTO Emeritus of Analog Devices, Inc., following service as CTO and the Vice President of R&D. He previously served as Vice President of Research and Chief Scientist at Digital Equipment Corporation, where he designed and did the performance analysis of advanced multiprocessor computer systems. He established Digital Equipment's Research Labs in the US and Europe that resulted in advanced processor architectures and the pioneering Alta Vista Internet search engine.\nHe began his career as an associate professor at Carnegie Mellon University, where he studied the design and performance of advanced multiprocessor computer systems. He is a fellow of the Institute of Electrical and Electronics Engineers (IEEE), a member of the National Academy of Engineering and a fellow of the American Association for the Advancement of Science. Fuller also serves on the Board of the Corporation for National Research Initiatives (CNRI).\n“I enjoy working with students and young professionals at all stages of their education and careers, lending my experience and insight to help them achieve their full potential,” said Fuller. “I’ve had wonderful advisors and mentors throughout my career and I’m delighted to be able to give back to the organization that helped launch me early in my career. I very much look forward to being more involved and helping expand and improve the outstanding Hertz Community and programs.”\nThe Fannie and John Hertz Foundation is the legacy of John Hertz, a Hungarian immigrant who made his fortune by capitalizing on the entrepreneurship prospects in the budding automotive industry. He believed that innovative and entrepreneurial solutions were vital to the strength, security and prosperity of our nation—and began the Foundation to support exceptionally talented students expected to have the greatest impact on the world’s problems. Today, the Hertz Community is one of the most influential groups of leaders, innovators, engineers, mathematicians and scientists in the American corporate, university, national laboratory and military sectors. To date, Hertz Fellows collectively possess more than 3,000 patents, have founded more than 200 companies and have received more than 200 major national and international awards, including two Nobel Prizes and a Turing Award.\nThe Fannie and John Hertz Foundation\nThe Fannie and John Hertz Foundation is a not-for-profit organization changing the world around us by granting freedom of American scientific research and innovation through fellowship and financial support. Celebrating 60 years in 2017, the Hertz Fellowship is the most exclusive fellowship program in the world. Our 1,200 Hertz Fellows are the leaders, shapers and disruptors of American science, engineering and mathematics. For more information on the Hertz Foundation and the innovations led by our Hertz Fellows please visit www.hertzfoundation.org .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123005098/en/\nMcGrath/Power\nAllyson Scott, 408-727-0351\nAllysonScott@mcgrathpower.com\nSource: The Fannie and John Hertz Foundation", "external_links": ["http://www.businesswire.com/news/home/20180123005098/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.hertzfoundation.org&esheet=51746191&newsitemid=20180123005098&lan=en-US&anchor=www.hertzfoundation.org&index=1&md5=f6319c1b06577fe726ac9e6bf20d1b56"], "published": "2018-01-23T16:00:00.000+02:00", "crawled": "2018-01-23T18:43:55.012+02:00", "highlightTitle": ""}