{"organizations": [], "uuid": "44d4f6a97cb4e2e14c79804cdb835bc2817c9985", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-fidelity-southern-corporation-reports-earnings-for-fourth-quarter-of-12-point-4-million-39-point-8-million-in-2017.html", "country": "US", "domain_rank": 767, "title": "Fidelity Southern Corporation Reports Earnings For Fourth Quarter Of $12.4 Million; $39.8 Million In 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-18T23:55:00.000+02:00", "replies_count": 0, "uuid": "44d4f6a97cb4e2e14c79804cdb835bc2817c9985"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-fidelity-southern-corporation-reports-earnings-for-fourth-quarter-of-12-point-4-million-39-point-8-million-in-2017.html", "ord_in_thread": 0, "title": "Fidelity Southern Corporation Reports Earnings For Fourth Quarter Of $12.4 Million; $39.8 Million In 2017", "locations": [], "entities": {"persons": [{"name": "jim miller", "sentiment": "none"}], "locations": [{"name": "atlanta", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "fidelity southern corporation", "sentiment": "negative"}, {"name": "fidelity", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "fidelity bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA, Fidelity Southern Corporation (\"Fidelity\" or the \"Company\") (NASDAQ: LION), holding company for Fidelity Bank (the \"Bank\"), today reported net income of $12.4 million, or $0.46 per diluted share for the quarter ended December 31, 2017, compared with $7.9 million, or $0.30 per diluted share, for the quarter ended September 30, 2017. For the year ended December 31, 2017, the Company reported net income of $39.8 million, or $1.49 per diluted share, compared with $38.8 million, or $1.50 per diluted share, for the same period in 2016.\nFidelity's Chairman, Jim Miller, said, \"With a little help from Washington, we made a lot of money as our \"old\" strategy played out in 2017. That strategy was modified beginning early in 2017. Interest rates are the reason. However, destructive interest rate competition in commercial credits has only now abated and our ability to compete is here. Our efforts did pay off in the 4th quarter. Much more is to come as the loan portfolio is rebalanced to higher income commercial credits as consumer lending is deemphasized to meet today's reality.\"\nPresident Palmer Proctor added, \"We have created good momentum this year in positioning the bank for future organic growth from our commercial bank and mortgage businesses, becoming more efficient and effective in all we do, and being ready for any strategic opportunities that may arise. We are very pleased with the 20% annual growth in our demand and money market deposits, continued improvements in our asset quality, and the 9% or $1.15 per share growth in our tangible book value. We are optimistic about 2018.\"\nRECENT EVENTS\nAs a result of the Tax Cuts and Jobs Act that was enacted into law on December 22, 2017, Fidelity revalued its net deferred tax liability position to reflect the reduction in the federal corporate income tax rate from 35% to 21%. This revaluation resulted in a one-time income tax benefit of approximately $4.9 million, or $0.18 of diluted earnings per common share, for the fourth quarter of 2017.\nBALANCE SHEET\nTotal assets grew by $71.4 million, or 1.6%, during the quarter, to $4.6 billion at December 31, 2017, compared to $4.5 billion at September 30, 2017, primarily due to increased loan production of $188.7 million, partially offset by a decrease in cash of $125.7 million during the quarter. Demand and money market deposits grew by $27.4 million, but this increase was partially offset by a seasonal decrease in time and savings deposits of $98.6 million, for a net decrease in deposits of $71.2 million during the quarter.\nShort-term FHLB borrowings and securities sold under repurchase agreements increased by $135.8 million, due to the increased loan production and lower deposit funding. In addition, other liabilities decreased by $6.8 million, or 15.6%, due primarily to the revaluation of the deferred tax liability at December 31, 2017, as discussed in the Income Taxes section below.\nTotal assets grew by $187.2 million or 4.3%, to $4.6 billion at December 31, 2017, compared to $4.4 billion at December 31, 2016. Primary drivers of the year over year change were loan growth of $171.1 million, or 4.5%, funded by total deposit increases of $236.6 million, or 6.5%, which allowed the Company to eliminate $92.8 million, or 38.1%, of short-term borrowings, as compared to December 31, 2016.\nLoans\nTotal loans of $3.9 billion at December 31, 2017, increased by $188.7 million, or 5.0%, as compared to September 30, 2017. Increases of $106.5 million in indirect loans, $19.6 million in commercial/SBA loans, and $40.6 million in mortgage loans were noted in the quarter. Indirect loan production increased by $88.9 million, or 34.7%, in anticipation of indirect loan sales in the first half of 2018. Loans held-for-sale increased by $17.4 million, as the pipeline for expected loan sales was raised for the quarter.\nTotal loans increased by $171.1 million, or 4.5%, compared to December 31, 2016. An increase in mortgage loans of $134.7 million accounted for most of the increase, primarily due to lower sales of mortgage loans of $226.6 million in 2017. Commercial and construction portfolios also experienced growth year over year.\nAsset Quality\nAsset quality remained strong as evidenced by the reduction in non performing assets, excluding the guaranteed portion of SBA and GNMA loans (\"adjusted NPA's\") and acquired loans. Adjusted NPA's, a non-GAAP measure, decreased by $4.6 million, or 11.5%, during 2017. The reconciliation to the comparable GAAP measure is included in the schedules accompanying this release.\nOn a linked-quarter basis, the provision for loan losses decreased by $1.4 million, while net charge-offs were flat. Gross charge-offs increased by $1.6 million, offset by an increase in gross recoveries of $1.8 million, on a linked-quarter basis, mainly due to charge-offs of specific reserves established in prior quarters on several C&I loans to operating companies. Annualized net charge-offs remained relatively flat at an increase of 0.1% of average loans. No provision for loan losses was recorded in the fourth quarter due to elevated loan recoveries.\nCompared to 2016, the provision for loan losses for the year decreased by $4.0 million, reflecting strong asset quality.\nFair Value Adjustments\nLoan servicing rights increased by $725,000, or 0.6%, to $112.6 million at December 31, 2017, compared to $111.9 million at September 30, 2017, and by $13.3 million, or 13.4%, compared to December 31, 2016. Mortgage servicing rights (\"MSRs\"), the primary component of loan servicing rights, contributed the majority of the change, increasing by $1.6 million and $14.5 million during the quarter and year, respectively.\nNew loan servicing rights capitalized on sales of mortgage loans with servicing retained decreased by $1.7 million, or 19.8%, for the quarter but increased $766,000, or 2.7%, for the year. Capitalized servicing decreased on a linked-quarter basis due to the seasonality of mortgage production. Historically, production begins to decrease after the strong summer buying season. Capitalized servicing increased for the year even though sales of loans with servicing retained decreased by $305.2 million, or 12.1%, for the year because, as a result of rising interest rates, servicing rights are expected to remain in the portfolio longer, leading to higher projected expected lives. The decrease in sales of loans sold servicing retained was primarily due to fewer originated mortgages from refinance transactions, as year over year, we originated $513.3 million, or 55.7%, fewer refinance loans. This was partially offset by increased volume of purchase money mortgages and new market expansion.\nAmortization of MSRs was flat for the linked-quarter, increasing by $48,000, or 1.4%, but was $1.6 million, or 10.2%, lower in 2017 compared to the prior year. The annual decrease is primarily the result of lower actual and predicted early prepayments in 2017, compared to 2016, as a result of the relatively more stable interest rate environment in 2017.\nMSRs impairment of $1.5 million was recorded during the quarter, an increase of $932,000, or 171.2%, compared to the prior quarter. The increase in impairment was primarily related to hi", "external_links": ["http://www.fidelitysouthern.com/", "http://www.prnewswire.com/news-releases/fidelity-southern-corporation-reports-earnings-for-fourth-quarter-of-124-million-398-million-in-2017-300584923.html"], "published": "2018-01-18T23:55:00.000+02:00", "crawled": "2018-01-19T01:03:58.011+02:00", "highlightTitle": ""}