{"organizations": [], "uuid": "f2353f44a055f8c6e976427d26613d7a3b72441e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225535385&w=1200&r=LYNXMPEE0P120", "site_section": "http://feeds.reuters.com/reuters/environment/", "section_title": "Reuters: Environment", "url": "https://www.reuters.com/article/us-france-nuclearpower/france-rules-out-increasing-co2-as-it-closes-nuclear-reactors-idUSKBN1FF28A", "country": "US", "domain_rank": 408, "title": "France rules out increasing CO2 as it closes nuclear reactors", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T18:37:00.000+02:00", "replies_count": 0, "uuid": "f2353f44a055f8c6e976427d26613d7a3b72441e"}, "author": "", "url": "https://www.reuters.com/article/us-france-nuclearpower/france-rules-out-increasing-co2-as-it-closes-nuclear-reactors-idUSKBN1FF28A", "ord_in_thread": 0, "title": "France rules out increasing CO2 as it closes nuclear reactors", "locations": [], "entities": {"persons": [{"name": "sebastien lecornu", "sentiment": "none"}, {"name": "emmanuel macron", "sentiment": "none"}, {"name": "enerpresse", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "rte", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "junior energy", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 4:38 PM / Updated 3 hours ago France rules out increasing CO2 as it closes nuclear reactors Reuters Staff 3 Min Read \nPARIS (Reuters) - France will not increase carbon emissions as it reduces its reliance on nuclear energy in coming years, a junior minister told energy newsletter Enerpresse. \nThe centrist government of French President Emmanuel Macron has launched a year-long debate about energy policy before deciding in early 2019 on the future share of nuclear energy in France’s power production. It now stands at 75 percent. \nTo assist discussions, grid operator RTE has prepared scenarios for cutting nuclear energy’s share from 56 percent to 11 percent by 2035, and an additional scenario on reducing nuclear reliance to 50 percent by 2025. \nEnvironment activists complain that the government has withheld scenarios cutting back nuclear capacity the most, when it held workshops this month to prepare for the public debate. \nJunior Energy and Environment Minister Sebastien Lecornu told Enerpresse the scenarios that would lead to the construction of new thermal power stations were held back. \n“We are clear about what we want for the energy mix, the increase of carbon emissions is not an option for us,” he said. \nFrance would not build more plants powered by coal or fuel oil, he said, but said the government would consider whether there was a role for gas, which has lower emissions than coal or other fossil fuels. \nLecornu’s office could not immediately be reached for comment. \nSustainable energy advocacy group NegaWatt said on Thursday the most ambitious scenarios for reducing nuclear reliance could be achieved without boosting CO2 emissions provided there was a stronger focus on energy efficiency and if the nuclear reactors had their lifespans’ extended a little beyond 40 years. \nThe majority of EDF’s nuclear reactors were connected to the grid between 1980 and 1990. Closing them all promptly after 40 years, their scheduled lifespan, would cut so much capacity that France would have to build new gas plants to fill the gap. \nEDF wants to extend the lifespan of its reactors to 50 years, but will need approval of nuclear regulator ASN for each reactor. The ASN has said it will rule on the principle of lifespan extensions in 2021. Reporting by Geert De Clercq; Editing by Edmund Blair", "external_links": [], "published": "2018-01-26T18:37:00.000+02:00", "crawled": "2018-01-26T19:01:19.010+02:00", "highlightTitle": ""}