{"organizations": [], "uuid": "bb23347a2fa945e5e09dc2ab854b56fd880c3a1a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222911966&w=1200&r=LYNXMPEE0H07V", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/us-china-pollution/cities-in-chinas-hebei-province-still-top-list-of-smoggiest-places-idINKBN1F70CA", "country": "US", "domain_rank": 408, "title": "Cities in China's Hebei province still top list of smoggiest places", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T05:26:00.000+02:00", "replies_count": 0, "uuid": "bb23347a2fa945e5e09dc2ab854b56fd880c3a1a"}, "author": "", "url": "https://in.reuters.com/article/us-china-pollution/cities-in-chinas-hebei-province-still-top-list-of-smoggiest-places-idINKBN1F70CA", "ord_in_thread": 0, "title": "Cities in China's Hebei province still top list of smoggiest places", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "hebei province", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "shijiazhuang", "sentiment": "none"}, {"name": "hebei", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "ministry of environmental protection", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHANGHAI (Reuters) - China’s Hebei province was the location of six of the country’s 10 smoggiest cities in 2017, the same as the previous year, despite a campaign to improve air quality during the winter when smog levels peak, according to environment ministry data published on Thursday.\nHebei, China’s biggest steel producing region, was part of a special six-month crackdown aimed at reducing smog build-ups over the winter. That is when coal consumption traditionally surges to run boilers for heating, resulting in an increase in harmful air pollutants.\nAccording to figures published by the Ministry of Environmental Protection (MEP), Hebei’s provincial capital of Shijiazhuang saw the highest average reading in all of China last year of particulate matter with a width of 2.5 microns, known as PM2.5, which is easily inhaled into the lungs to cause respiratory damage.\nHebei’s smog levels have an outsized effect on China’s capital of Beijing since the province surrounds the city.\nAlso among China’s ten worst performing cities were Hebei’s cities of Handan and Tangshan, the world’s biggest steel producing city, as well as Xingtai, Baoding and Hengshui.\nHowever, in December alone, only four Hebei cities were included in the top 10, suggesting the winter crackdown on emissions from industry, coal and transportation had a significant impact.\nHebei as a whole saw PM2.5 concentrations hit 65 micrograms per cubic meter last year, down 7.1 percent compared to 2016. It has promised to cut the figure by a further 14 percent by 2020.\nThe head of the provincial environmental bureau, Gao Jianmin, also said earlier this month that the province would strive this year to remove the cities of Shijiazhuang, Hengshui and Tangshan from the top 10 worst performer list.\nOverall, average PM2.5 readings in 338 monitored cities across China reached 43 micrograms per cubic meter in 2017, down 6.5 percent compared to the previous year, according to MEP data.\nAccording to research published by environmental group Greenpeace last week, Beijing, Hebei and other parts of northern China saw dramatic improvements in air quality over the winter as a result of the crackdown as well as more favorable weather conditions, but progress stalled in other parts of the country.\nGreenpeace estimated that nationwide PM2.5 emissions fell 4.5 percent, lower than the official MEP figure and the smallest decline since 2013.\nChina’s official PM2.5 standard is 35 micrograms, while the World Heath Organization recommends levels of no more than 10.\nReporting by David Stanway; Editing by Christian Schmollinger\n ", "external_links": [], "published": "2018-01-18T05:26:00.000+02:00", "crawled": "2018-01-18T05:41:02.007+02:00", "highlightTitle": ""}