{"organizations": [], "uuid": "cb41451fac3451be52080e7eb717837df018436d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-the-one-group-announces-preliminary-fourth-quarter-sales.html", "country": "US", "domain_rank": 767, "title": "The ONE Group Announces Preliminary Fourth Quarter Sales", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.995, "site_type": "news", "published": "2018-01-08T16:00:00.000+02:00", "replies_count": 0, "uuid": "cb41451fac3451be52080e7eb717837df018436d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-the-one-group-announces-preliminary-fourth-quarter-sales.html", "ord_in_thread": 0, "title": "The ONE Group Announces Preliminary Fourth Quarter Sales", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "one group", "sentiment": "negative"}, {"name": "one group hospitality, inc.", "sentiment": "neutral"}, {"name": "stk", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- The ONE Group Hospitality, Inc. (“The ONE Group”) (NASDAQ: STKS) today announced preliminary unaudited sales for the fourth quarter of 2017, which ended December 31, 2017.\nPreliminary sales highlights for the quarter ended December 31, 2017 are as follows:\nTotal revenues are expected to be approximately $21.0 million, compared to $20.4 million, an approximate 3.0% increase, for the same quarter last year. Comparable sales * are expected to have increased approximately 9.5% compared to the same quarter last year, including an approximate 6.0% increase in US comparable store sales and an approximate 15.5% increase in international comparable store sales.\n*Comparable sales or same store sales (\"SSS\"), represents total food and beverage sales at owned and managed units opened for a full 18-month period. This metric includes total revenue from our US owned and managed STK locations as well as the revenue reported to us with respect to comparable sales at our international managed locations (measured in constant currency), and excludes revenues where we do not directly control the event sales force (Royalton, NY and Westwood, CA).\nManny Hilario, President and CEO of The ONE Group stated, \"We are pleased with our preliminary sales results for 2017 as we continue to make progress on the four-point strategy we launched at the beginning of the year. This is evident by the notable improvement in profits for the first three quarters as well as our increased comparable store sales, the improvement in our event business, and stronger gift card sales. We will continue this focus into 2018 while we implement other important initiatives to further increase sales and continue the improvement in our performance.”\nMr. Hilario continued, “We continue to see strong interest in STK and in our hospitality program globally, and our worldwide development pipeline for 2018 remains strong as we continue to focus on our asset-light business strategy.”\nPreliminary results remain subject to the completion of normal quarter-end accounting procedures and adjustments and are subject to change. The Company currently expects to release financial and operating results for its fourth quarter and fiscal year ended December 31, 2017 in March 2018.\nAbout The ONE Group\nThe ONE Group (NASDAQ:STKS) is a global hospitality company that develops and operates upscale, high-energy restaurants and lounges and provides hospitality management services for hotels, casinos and other high-end venues both nationally and internationally. The ONE Group’s primary restaurant brand is STK, a modern twist on the American steakhouse concept with locations in major metropolitan cities throughout the U.S., Canada, Europe and the Middle East. ONE Hospitality, The ONE Group’s food and beverage hospitality services business, provides the development, management and operations for premier restaurants and turn-key food and beverage services within high-end hotels and casinos. Additional information about The ONE Group can be found at www.togrp.com .\nCautionary Statement on Forward-Looking Statements\nThis press release includes “forward-looking statements” within the meaning of the “safe harbor” provisions of the United States Private Securities Litigation Reform Act of 1995. For example, the statements related to the exploration of strategic alternatives and the potential results therefrom and the statements related to our strategic review of our operations targeting sources for 2017 and beyond are forward-looking. Forward-looking statements may be identified by the use of words such as “anticipate”, “believe”, “expect”, “estimate”, “plan”, “outlook”, and “project” and other similar expressions that predict or indicate future events or trends or that are not statements of historical matters. A number of factors could cause actual results or outcomes to differ materially from those indicated by such forward-looking statements, including but not limited to, (1) our ability to open new restaurants and food and beverage locations in current and additional markets, grow and manage growth profitably, maintain relationships with suppliers and obtain adequate supply of products and retain our key employees; (2) factors beyond our control that affect the number and timing of new restaurant openings, including weather conditions and factors under the control of landlords, contractors and regulatory and/or licensing authorities; (3) in the case of our strategic review of operations, our ability to successfully improve performance and cost, realize the benefits of our marketing efforts, and achieve improved results as we focus on developing new management and license deals; (4) changes in applicable laws or regulations; (5) the possibility that the Company may be adversely affected by other economic, business, and/or competitive factors; and (6) other risks and uncertainties indicated from time to time in our filings with the SEC, including our Annual Report on Form 10-K filed on April 5, 2017.\nInvestors are referred to the most recent reports filed with the SEC by The ONE Group Hospitality, Inc. Investors are cautioned not to place undue reliance upon any forward-looking statements, which speak only as of the date made, and we undertake no obligation to update or revise the forward-looking statements, whether as a result of new information, future events, or otherwise.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180108005603/en/\nInvestors:\nICR\nMichelle Michalski, 646-277-1224\nSource: The ONE Group Hospitality, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180108005603/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.togrp.com&esheet=51739151&newsitemid=20180108005603&lan=en-US&anchor=www.togrp.com&index=1&md5=3f14f7d5049702e72d5b118778a05dcc"], "published": "2018-01-08T16:00:00.000+02:00", "crawled": "2018-01-08T17:10:53.011+02:00", "highlightTitle": ""}