{"organizations": [], "uuid": "cba2fcf90926f73b2b92054960924594437afd5c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/southeast-asia-stocks/se-asia-stocks-most-rise-philippines-indonesia-scale-record-highs-idUSL4N1PH20H", "country": "US", "domain_rank": 408, "title": "SE Asia Stocks-Most rise; Philippines, Indonesia scale record highs", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T06:58:00.000+02:00", "replies_count": 0, "uuid": "cba2fcf90926f73b2b92054960924594437afd5c"}, "author": "", "url": "https://www.reuters.com/article/southeast-asia-stocks/se-asia-stocks-most-rise-philippines-indonesia-scale-record-highs-idUSL4N1PH20H", "ord_in_thread": 0, "title": "SE Asia Stocks-Most rise; Philippines, Indonesia scale record highs", "locations": [], "entities": {"persons": [{"name": "nicole pinto", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "philippines", "sentiment": "none"}, {"name": "asia stocks-most", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "sm prime holdings inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "dbs group research", "sentiment": "none"}, {"name": "dbs group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Nicole Pinto Jan 22 (Reuters) - Most Southeast Asian stock markets rose on Monday with the Philippine and Indonesia indexes scaling record levels, while broader Asian equities pulled back slightly after the U.S. government was forced to shut down. The Philippine Stock Exchange PSEi Index rose as much as 0.7 percent to an all-time high of 8,975.12 on optimism about the economy a day ahead of the release of fourth-quarter GDP data. DBS Group Research said in a note that it forecast GDP growth of 6.9 percent in the fourth quarter. \"Overall domestic demand is likely to remain strong in 2018, supported by the government's infrastructure push. Our current forecast pencil in steady GDP growth of 6.7 percent in 2018/19,\" said DBS Group. The country's statistics agency revised last Friday the third-quarter GDP growth rate to 7 percent from 6.9 percent. Industrial and real estate stocks led the rise. Property developer SM Prime Holdings Inc rose as much as 1.3 percent, while property investment company LT Group Inc gained as much as 5.4 percent to its highest in over four years. Indonesian shares extended gains into a sixth session and hit a life high. Energy stocks led the gains. Coal miners Indo Tambangraya Megah Tbk PT and Adaro Energy Tbk PT climbed as much as 6.6 percent and 7.8 percent, respectively. An index of the country's 45 most liquid stocks rose 0.4 percent. Vietnam shares gained as much as 1.3 percent to a more than 10-year high. Utilities and financials were the top performers, with Joint Stock Commercial Bank for Foreign Trade of Viet Nam hitting a record high and Petrovietnam Gas Joint Stock Corp rising 4.3 percent. Singapore shares were flat as gains in industrials were offset by lagging financial and consumer discretionary stocks. Index heavyweight Jardine Matheson Holdings Ltd rose as much as 3.1 percent, while United Overseas Bank Ltd fell up to 1.1 percent. Thai shares rose slightly, helped by gains in energy and industrial stocks. Data released earlier in the day showed that the country's customs-cleared annual exports rose for a tenth straight month in December, but at a slower pace than the previous month and below expectations, and posted the first trade deficit in five months. For Asian Companies click; SOUTHEAST ASIAN STOCK MARKETS AS AT 0419 GMT STOCK MARKETS Change on the day Market Current previous close Pct Move Singapore 3553.24 3550.36 0.08 Bangkok 1824.77 1821.34 0.19 Manila 8965.13 8915.92 0.55 Jakarta 6515.258 6490.896 0.38 Kuala Lumpur 1826.52 1828.83 -0.13 Ho Chi Minh 1079.19 1062.07 1.61 Change so far this year Market Current End 2017 Pct Move Singapore 3553.24 3402.92 4.42 Bangkok 1824.77 1753.71 4.05 Manila 8965.13 8558.42 4.75 Jakarta 6515.258 6355.654 2.51 Kuala Lumpur 1826.52 1796.81 1.65 Ho Chi Minh 1079.19 984.24 9.65 (Reporting by Nicole Pinto in Bengaluru; Editing by Subhranshu Sahu)\n ", "external_links": [], "published": "2018-01-22T06:58:00.000+02:00", "crawled": "2018-01-22T07:36:19.006+02:00", "highlightTitle": ""}