{"organizations": [], "uuid": "dbea518140494a044e2680406fa7ac7afd9db129", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-the-community-financial-corporation-announces-completion-of-county-first-bank-acquisition.html", "country": "US", "domain_rank": 767, "title": "The Community Financial Corporation Announces Completion of County First Bank Acquisition", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T15:30:00.000+02:00", "replies_count": 0, "uuid": "dbea518140494a044e2680406fa7ac7afd9db129"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-the-community-financial-corporation-announces-completion-of-county-first-bank-acquisition.html", "ord_in_thread": 0, "title": "The Community Financial Corporation Announces Completion of County First Bank Acquisition", "locations": [], "entities": {"persons": [{"name": "william j. pasenelli", "sentiment": "none"}], "locations": [{"name": "md.", "sentiment": "none"}, {"name": "chesapeake", "sentiment": "none"}], "organizations": [{"name": "community financial corporation", "sentiment": "negative"}, {"name": "community financial corporation announces completion of county first bank acquisition waldorf", "sentiment": "negative"}, {"name": "county first bank", "sentiment": "none"}, {"name": "community bank of the chesapeake", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WALDORF, Md., Jan. 02, 2018 (GLOBE NEWSWIRE) -- The Community Financial Corporation (NASDAQ:TCFC), the holding company for Community Bank of the Chesapeake, today announced that effective January 1, 2018, it has completed its acquisition of County First Bank (County First).\nUpon completion of the merger, the former County First Bank shareholders became entitled to receive 0.9543 shares of The Community Financial Corporation common stock and $2.20 in cash for each share of County First Bank common stock they held. The $2.20 of cash consideration includes the $1.00 per share in fixed cash consideration, plus an additional $1.20 per share of cash that represents, on a per share basis, the value of certain County First assets that were resolved prior to closing, which $1.20 amount was originally referred to as the “contingent cash consideration”.\n“We are very excited that our partnership with County First Bank has come to fruition,” stated William J. Pasenelli, Chief Executive Officer of Community Bank of the Chesapeake. “We welcome County First’s customers, shareholders and employees to the Community Bank family and the strength our combined presence brings to the Southern Maryland markets.” Michael Middleton, Chairman of the Board of The Community Financial Corporation and Community Bank of the Chesapeake added, “We are extremely pleased with this transaction, the addition of a loyal County First customer base and bringing Community Bank of the Chesapeake another source of low cost and stable core deposits. We are also very pleased to welcome E. Lawrence Sanders, III to the boards of directors of The Community Financial Corporation and Community Bank of the Chesapeake.”\nKeefe, Bruyette & Woods, Inc. and RP Financial LC. acted as financial advisors to The Community Financial Corporation. Kilpatrick, Townsend & Stockton LLP served as legal counsel to The Community Financial Corporation. Boenning & Scattergood, Inc. acted as financial advisor to County First Bank. Hunton & Williams LLP served as legal counsel to County First Bank.\nABOUT THE COMMUNITY FINANCIAL CORPORATION\nHeadquartered in Waldorf, MD, The Community Financial Corporation is the bank holding company for Community Bank of the Chesapeake, a full-service commercial bank with assets of approximately $1.6 billion. Through its branch offices and commercial lending centers, Community Bank of the Chesapeake offers a broad range of financial products and services to individuals and businesses. The Company’s banking centers are located at its main office in Waldorf, Maryland, and branch offices in Waldorf, Bryans Road, Dunkirk, Leonardtown, La Plata, Charlotte Hall, Prince Frederick, Lusby and California, Maryland; and downtown Fredericksburg, Virginia. More information about Community Bank of the Chesapeake can be found at www.cbtc.com .\nFORWARD-LOOKING STATEMENTS\nCertain statements contained in this communication may not be based on historical facts and are “ ” within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. These include, without limitation, those relating to The Community Financial Corporation and Community Bank of the Chesapeake’s future growth and management’s outlook or expectations for revenue, assets, asset quality, profitability, business prospects, net interest margin, non-interest revenue, allowance for loan losses, the level of credit losses from lending, liquidity levels, capital levels, or other future financial or business performance strategies or expectations. These forward looking statements may also include: any statements of the plans and objectives of management for future operations, products or services, including the execution of integration plans relating to the transaction; any statement of expectation or belief; projections related to certain financial metrics; and any statement of assumptions underlying the foregoing. These may be identified by reference to a future period(s) or by the use of forward-looking terminology, such as “anticipate,” “estimate,” “expect,” “foresee,” “may,” “might,” “will,” “would,” “could” or “intend,” future or conditional verb tenses, and variations or negatives of such terms.\nForward-looking statements involve known and unknown risks, uncertainties and other important factors that could cause our actual results, performance or achievements to differ materially from our expectations of future results, performance or achievements, or industry results, expressed or implied by these .\nIn addition to factors previously disclosed in The Community Financial Corporation’s reports filed with the Securities and Exchange Commission including those we file with the SEC, including in our Annual Report on Form 10-K for the year ended December 31, 2016, and those identified elsewhere in this document, the following factors among others, could cause actual results to differ materially from or historical performance: changes in The Community Financial Corporation’s and Community Bank of the Chesapeake’s operating or expansion strategy; availability of and costs associated with obtaining adequate and timely sources of liquidity; the ability to maintain credit quality; the effects of future economic, business and market conditions; weaker than anticipated market conditions in our primary market areas; changes in interest rates; governmental monetary and fiscal policies; changes in prices and values of real estate; legislative and regulatory changes, including changes in banking, securities and tax laws and regulations and their application by our regulators, including changes in the cost and scope of FDIC insurance; the failure of assumptions regarding the levels of non-performing assets and the adequacy of the allowance for loan losses; possible adverse rulings, judgments, settlements and other outcomes of pending litigation; the ability of Community Bank of the Chesapeake to collect amounts due under loan agreements; changes in consumer preferences; liquidity risks through an inability to raise funds through deposits, borrowings or other sources, or to maintain sufficient liquidity at The Community Financial Corporation separate from Community Bank of the Chesapeake’s liquidity; volatility in the capital and credit markets; effectiveness of Community Bank of the Chesapeake’s interest rate risk management strategies; difficulties and delays in integrating the County First Bank’s business or fully realizing cost savings and other benefits of the transaction in the expected timeframes, if at all; business disruption following the transaction; inflation; customer acceptance of Community Bank of the Chesapeake’s products and services; customer borrowing, repayment, investment and deposit practices; customer disintermediation; and the introduction, withdrawal, success and timing of business initiatives.\nYou are cautioned not to place undue reliance on the contained in this document in that actual results could differ materially from those indicated in such , due to a variety of", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/5417fe62-2b5c-444c-9155-369e95ea6d1d"], "published": "2018-01-02T15:30:00.000+02:00", "crawled": "2018-01-02T16:21:19.000+02:00", "highlightTitle": ""}