{"organizations": [], "uuid": "b8a78d3f0affbb2016ad00bf8137209f9f09edab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 5}, "facebook": {"likes": 9, "shares": 9, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225033499&w=1200&r=LYNXMPEE0O064", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-tennis-ausopen-wozniacki/tennis-wozniacki-survives-scare-to-reach-maiden-melbourne-park-final-idUSKBN1FE0DG", "country": "US", "domain_rank": 408, "title": "Tennis: Wozniacki survives scare to reach maiden Melbourne Park final", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T07:20:00.000+02:00", "replies_count": 0, "uuid": "b8a78d3f0affbb2016ad00bf8137209f9f09edab"}, "author": "", "url": "https://www.reuters.com/article/us-tennis-ausopen-wozniacki/tennis-wozniacki-survives-scare-to-reach-maiden-melbourne-park-final-idUSKBN1FE0DG", "ord_in_thread": 0, "title": "Tennis: Wozniacki survives scare to reach maiden Melbourne Park final", "locations": [], "entities": {"persons": [{"name": "wozniacki", "sentiment": "negative"}, {"name": "john o'brien", "sentiment": "none"}, {"name": "angelique kerber", "sentiment": "none"}, {"name": "mertens", "sentiment": "none"}, {"name": "caroline wozniacki", "sentiment": "none"}, {"name": "elise mertens", "sentiment": "none"}, {"name": "simona halep", "sentiment": "none"}, {"name": "nick mulvenney", "sentiment": "none"}], "locations": [{"name": "melbourne park", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}, {"name": "rod laver arena", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 5:24 AM / Updated 13 hours ago Tennis: Wozniacki survives scare to reach maiden Melbourne final Reuters Staff 3 Min Read \nMELBOURNE (Reuters) - Caroline Wozniacki came through a late bout of nerves to reach the Australian Open final for a first time with a 6-3 7-6(2) victory over Belgian Elise Mertens on Thursday, giving herself another shot at winning a maiden grand slam title. \nThe Dane had dominated her second Melbourne Park semi-final until she was 5-4, 30-0 up and serving for the match but suddenly faltered with a pair of double faults to allow her 22-year-old opponent back into the contest. \nMertens, playing only her fifth grand slam, took full advantage and, unleashing a string of winners, broke the former world number one and racked up two set points. \nUnlike in her 2011 semi-final against Li Na, when she blew a match point, Wozniacki was able to recover her composure and saved them both on the back of a couple of booming serves. \nAfter four deuces, the 27-year-old held with a thumping forehand then raced away with the ensuing tiebreak to seal a title-decider against either Simona Halep or Angelique Kerber. \n”I got really tired at 5-4,“ she said on court. ”After the two first good serves, I thought, ‘Calm down, it’s all good’, then it kind of wasn’t good any more. Tennis - Australian Open - Semifinals - Rod Laver Arena, Melbourne, Australia, January 25, 2018. Elise Mertens of Belgium hits a shot against Caroline Wozniacki of Denmark. REUTERS/Issei Kato \n”I felt like my legs were shaking a little bit. I was like okay ‘This is not normal, I‘m not sure what I‘m supposed to do now’, I just took a few deep breaths and once she had set point, I said, ‘Well, I guess it is the third set. I guess now you just need to go for it’. \n”(The 2011 match) was definitely on my mind out there today -- Li Na. I tried to stay calm and I was lucky to get a win. Slideshow (3 Images) \nWozniacki has yet to win a grand slam title despite spending 67 weeks as world number one and is the only player to have won more than 25 WTA titles without claiming a major title. \nShe lost six successive tour finals in 2017 but showed a more aggressive edge to her game when she saved two match points to battle back from 5-1 down in the third set to win her second round match against Jana Fett last week. \nVictory over Halep or Kerber on Saturday would take her back to the top of the world rankings but, having lost both her previous grand slam finals at the U.S Open, clearly finally landing a major title would mean far more. \n“That is a nice thing about being first on,” she said. \n“You win, you can relax and you can see the other ones play it out and obviously they are both amazing players, incredible fighters and athletes. It is going to be really difficult, but I‘m in the finals and at that point it’s the last match.” Reporting by Nick Mulvenney in Sydney; Editing by John O'Brien", "external_links": [], "published": "2018-01-25T07:20:00.000+02:00", "crawled": "2018-01-25T07:44:17.016+02:00", "highlightTitle": ""}