{"organizations": [], "uuid": "7dd49fa76fdbd82b80898b7442066ee75ce181a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/business-wire-rentschler-biopharma-se-appoints-international-biopharma-expert-dr-ralf-otto-as-chief-operating-officer.html", "country": "US", "domain_rank": 767, "title": "Rentschler Biopharma SE Appoints International Biopharma Expert Dr. Ralf Otto as Chief Operating Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T11:39:00.000+02:00", "replies_count": 0, "uuid": "7dd49fa76fdbd82b80898b7442066ee75ce181a7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/business-wire-rentschler-biopharma-se-appoints-international-biopharma-expert-dr-ralf-otto-as-chief-operating-officer.html", "ord_in_thread": 0, "title": "Rentschler Biopharma SE Appoints International Biopharma Expert Dr. Ralf Otto as Chief Operating Officer", "locations": [], "entities": {"persons": [{"name": "ralf otto", "sentiment": "negative"}, {"name": "rentschler biopharma", "sentiment": "negative"}, {"name": "otto", "sentiment": "none"}, {"name": "thomas siklosi", "sentiment": "none"}], "locations": [{"name": "laupheim", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "rentschler biopharma", "sentiment": "negative"}, {"name": "dr. rentschler holding gmbh & co", "sentiment": "none"}, {"name": "rentschler biopharma se", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LAUPHEIM, Germany--(BUSINESS WIRE)-- Rentschler Biopharma SE, a leading contract development and manufacturing organization (CDMO) for biopharmaceuticals, today appointed Dr. Ralf Otto (46) as Chief Operating Officer (COO), effective February 1, 2018. He will be responsible for development, manufacturing and quality management. After more than 20+ years at senior positions in industry and management consulting, Dr. Otto is internationally recognized and widely respected. In his career, Dr. Otto has overseen all stages of the biopharmaceutical value chain. As a strategy consultant, he has successfully led major realignments at leading industrial companies. Dr. Otto succeeds Thomas Siklosi (66) who will move to the Dr. Rentschler Holding GmbH & Co. KG in February 2018.\n\"We are very pleased to welcome Dr. Otto to the management team of Rentschler Biopharma SE. In our industry, Dr. Otto has an excellent reputation as a thought leader and proven his expertise in strategy and corporate management. He combines extensive experience in biopharmaceutical manufacturing, outstanding industry knowledge and a substantial international network. We are looking forward to Dr. Otto's proficiency, his ideas and his personality,\" explained Prof. Dr. Nikolaus F. Rentschler, Chairman of the Supervisory Board of Rentschler Biopharma SE. \"I would like to thank Thomas Siklosi for his longstanding, constructive and valuable contributions to the success of the Company.\"\nDr. Frank Mathias, CEO of Rentschler Biopharma SE, added: \"Dr. Otto joins Rentschler Biopharma at a time of important strategic course-setting and dynamic growth. With his extensive experience, Dr. Otto is a great asset for the Company and an ideal addition to the management team.\"\n\"With the outstanding experience of our employees, providing many years of know-how, a strong commitment to values and quality, Rentschler Biopharma will continue to strengthen its position in the growing biopharmaceutical market and respond to the demanding regulatory requirements and the increasing needs of our international clients,\" said Dr. Ralf Otto. \"Together with Dr. Frank Mathias and the team, we will focus on these challenges and appropriate solutions.\"\nDr. Ralf Otto has more than 20 years experience in the biotechnology industry and management consulting. Most recently, he was a Partner at McKinsey & Company and essentially built their bio division over the past five years. He led consulting projects for large, medium and small biopharmaceutical companies as well as various international organizations. Prior to this, for 12 years, he held executive positions in cell biology and biopharmaceutical manufacturing at Boehringer Ingelheim. As Vice President Biopharma Operations, Dr. Otto headed the Boehringer site in Fremont, California, USA. He started his industrial career in Laboratory and Project Management Biotechnology at Henkel. Dr. Otto studied biotechnology at the University of Stuttgart (Germany) and Lund University (Sweden) and also at the German Cancer Research Center in Heidelberg. Since winning the genius biotech award by the state of Baden-Württemberg, in 2001, Dr. Otto has also supported the development of local emerging biotechnology industries. Since a decade, he holds lectures at the University of Karlsruhe (Germany).\nAbout Rentschler Biopharma SE\nRentschler Biopharma SE, located in Laupheim, Germany, is a leading contract development and manufacturing organization (CDMO) for bioprocess development and manufacturing of biopharmaceuticals as well as for related consulting activities in terms of project management and regulatory support. The Company's clients include innovative biotech companies and major pharmaceutical companies around the world. Many years of experience and excellence in finding solutions as well as certified quality management and advanced technologies ensure Rentschler Biopharma's high quality standards. Rentschler Biopharma is a family-owned company employing approximately 800 people. For further information, please visit www.rentschler-biopharma.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180131005552/en/\nRentschler Biopharma SE\nDr. Alexander Starnecker\n+49-7392701-211\nAlexander.Starnecker@rentschler-biopharma.com\nor\nMedia Inquiries:\nMC Services AG\nRaimund Gabriel/Jessica Breu\n+49-89-210228-36\nrentschler@mc-services.eu\nSource: Rentschler Biopharma SE", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rentschler-biopharma.com&esheet=51751440&newsitemid=20180131005552&lan=en-US&anchor=www.rentschler-biopharma.com&index=1&md5=fbf39aef4a45d74346f98beda6323ac9", "http://www.businesswire.com/news/home/20180131005552/en/"], "published": "2018-01-31T11:39:00.000+02:00", "crawled": "2018-01-31T13:02:42.026+02:00", "highlightTitle": ""}