{"organizations": [], "uuid": "f2e0026b6f4532c0c2d380e221ded13392cac6fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222336279&w=1200&r=LYNXMPEE0F0C6", "site_section": "http://feeds.reuters.com/reuters/INtopNews\r", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/india-bonds/bonds-fall-after-rbi-deputy-says-banks-face-high-interest-rate-risk-idINKBN1F50HD", "country": "US", "domain_rank": 408, "title": "Bonds fall after RBI deputy says banks face high interest rate risk", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T08:07:00.000+02:00", "replies_count": 0, "uuid": "f2e0026b6f4532c0c2d380e221ded13392cac6fc"}, "author": "", "url": "https://in.reuters.com/article/india-bonds/bonds-fall-after-rbi-deputy-says-banks-face-high-interest-rate-risk-idINKBN1F50HD", "ord_in_thread": 0, "title": "Bonds fall after RBI deputy says banks face high interest rate risk", "locations": [], "entities": {"persons": [{"name": "viral acharya", "sentiment": "none"}], "locations": [{"name": "mumbai", "sentiment": "none"}, {"name": "mumbai", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "rbi", "sentiment": "negative"}, {"name": "bonds", "sentiment": "negative"}, {"name": "reserve bank of india", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 6:08 AM / Updated 13 hours ago Bonds slump after RBI deputy warns of banks' high interest rate risks Suvashree Choudhury , Swati Bhat 3 Min Read \nMUMBAI (Reuters) - Indian bonds slumped to a near two year low on Tuesday after a central bank deputy governor highlighted growing balance sheet risks for state banks due to their high exposure to government securities. A woman walks past the Reserve Bank of India (RBI) head office in Mumbai, India, December 6, 2017. REUTERS/Shailesh Andrade/Files \nAt 0646 GMT, the benchmark 10-year bond yield was at 7.56 percent, up 12 basis points on the day and the highest since March 16, 2016. \n“The size of the banking sector’s balance sheet exposure to government securities, and hence, its interest rate risk, is high in an absolute sense, and is relatively elevated, when measured in proportion to total assets, for public sector banks relative to private banks,” Deputy Governor Viral Acharya said late on Monday. \nThe speech on managing interest rate risks was given at a dinner of association of bond investors in Mumbai and was published late on Monday evening. [ bit.ly/2ELHtAv ] \nMany traders interpreted the speech as a signal to state banks to pare bond holdings. \n“After 7.10 percent, we are yield agnostic. There is no point in buying (10-year bonds) at these levels,” a senior official at a large state-run bank said. “Who would take a risk to buy and put our books at further risk when we now know for sure that RBI doesn’t want us to buy bonds?” \nIndian bonds yields have risen by 105 basis points since June last year, which has hit the books of state banks, one of the biggest investors in government securities, on concerns the government may overshoot its fiscal deficit target. Investors are also worried the RBI may raise rates sooner rather than later as inflation picks up. \nAcharya’s speech is the second stern message to state banks in four days. Last week, the banking regulator asked banks to mark down their prices sharply when they close their books for the December quarter. \nThe RBI had to reduce its tender sizes at two of its bond auctions in recent weeks, late last month and earlier this month, as a lack of investor interest pushed yields to levels the government was not willing to pay. \nTraders say Monday’s speech could create problems for the RBI when it conducts its next government bond auction for 150 billion rupees ($2.35 billion) on Friday. \nMarket participants say the RBI’s warning makes it difficult for banks to reduce their government debt holdings. \n“It is very easy to say that we should manage our risks prudently, but who is suffering losses at the end of the day? It is the banks and the government, not the RBI,” said a banker at a private bank. \n“The content of the speech is of course correct, but not the timing. He should have spoken about this when the 10-year was at 6.40 percent, then banks could have absorbed even a 10 basis points rise in yields.” \n($1 = 63.7500 Indian rupees)", "external_links": [], "published": "2018-01-16T08:07:00.000+02:00", "crawled": "2018-01-16T08:30:24.000+02:00", "highlightTitle": ""}