{"organizations": [], "uuid": "71b7db99a1a1579fc8269200d3e5d8ee9227b8ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 2}, "vk": {"shares": 0}, "linkedin": {"shares": 40}, "facebook": {"likes": 44, "shares": 44, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/07/17/102842842-GettyImages-464374641.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/25/bitcoin-trading-is-gambling-canada-central-bank-governor.html", "country": "US", "domain_rank": 767, "title": "Bitcoin trading is 'gambling': Canada central bank governor", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T16:38:00.000+02:00", "replies_count": 0, "uuid": "71b7db99a1a1579fc8269200d3e5d8ee9227b8ec"}, "author": "Karen Tso", "url": "https://www.cnbc.com/2018/01/25/bitcoin-trading-is-gambling-canada-central-bank-governor.html", "ord_in_thread": 0, "title": "Bitcoin trading is 'gambling': Canada central bank governor", "locations": [], "entities": {"persons": [{"name": "bitcoin", "sentiment": "negative"}, {"name": "stephen poloz", "sentiment": "none"}, {"name": "lars rohde", "sentiment": "none"}, {"name": "poloz", "sentiment": "none"}, {"name": "cole burston", "sentiment": "none"}, {"name": "ja", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "denmark", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "bank of canada many", "sentiment": "none"}, {"name": "bank of canada", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "j.p. morgan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Bitcoin trading is \"gambling,\" Canada's central bank governor told CNBC on Thursday, adding that he was looking to work with global regulators to develop regulations around cryptocurrencies.\nStephen Poloz, who heads up the Bank of Canada, said buyers of digital coins should \"beware\" and that he would not call cryptocurrencies assets.\n\"They are crypto but they are not currencies,\" Poloz told CNBC during an interview at The Sanctuary in Davos.\n\"I'm not really sure what they are. They are not assets really … I suppose they are securities technically … There is no intrinsic value for something like bitcoin so it's not really an asset one can analyze. It's just essentially speculative or gambling.\"\nPoloz joins a chorus of central bankers and regulators warning about the dangers of cryptocurrencies which saw huge price surges in 2017.\nLars Rohde, the head of Denmark's central bank, called bitcoin investing \"deadly\" last year.\nCole Burston | Bloomberg | Getty Images Stephen Poloz, governor of the Bank of Canada Many business leaders have also warned on the dangers of investing in bitcoin including J.P. Morgan CEO Jamie Dimon who famously called the cryptocurrency a \"fraud\" while investing legend Warren Buffett said the space will \"come to a bad ending.\"\nPoloz told CNBC that if the cryptocurrency market, which is highly volatile, were to crash, it would not have bad implications on the wider economy.\n\"One parallel we could draw would be the tech wreck. When we had the tech wreck, that was a much more widespread exposure. And the fact it had barely had perceptible effect on the real economy because it was not a stock market crash but just a segment of the stock market. But it was highly speculative, there was all kinds of bubbles there,\" Poloz explained.\n\"So I think if you take that experience to heart, if something like that were to happen in the cryptocurrency space, it would probably be smaller today … It certainly has the potential. I don't want to minimize the risk that you raised because any mania has the scope to get much bigger.\"\nPoloz told CNBC that the central bank will look to regulate cryptocurrency.\n\"I have no doubt that at least for the purposes of consumer protection … We will be developing regulations around this space in due course. But what we are being careful to do here is to not stifle innovation,\" Poloz said.\nshow chapters Bank of Canada governor: Not worried by a cryptocurrency crash 8 Hours Ago | 04:39 Blockchain 'genius' The Canadian central bank chief added though that blockchain technology which underpins cryptocurrency, is \"a true piece of genius and it will be applied to many many areas in the economy.\"\nBlockchain is the underlying technology behind bitcoin. It acts as a public record of transactions that is tamperproof and requires no central authority to clear transactions. This technology is seen as a way to make a lot of businesses processes faster and cheaper. The Bank of Canada currently has a project codenamed Jasper, which is looking into how to use the blockchain.\nshow chapters What is Blockchain? 7:14 AM ET Thu, 14 Dec 2017 | 04:44 Poloz then turned to the idea of a central bank issued digital currency, and said that if it were to create one, it would be backed by the Canadian dollar. He added that cash is \"still doing its job\" and that there is no rush to introduce it.\nThe central banker also added that any fiat-backed digital currency would not necessarily need to run on the blockchain.\n\"No one's in a rush to get this done. Will it therefore be necessary for it (blockchain) to be part of a digital currency if central banks issued it? Well the answer is I think not,\" Poloz said.\n\"The reason that it has such appeal in the case of bitcoin is it gives you finality of settlement that eventually grinds through the distributed ledger and therefore you trust that. Whereas the central bank, if the Bank of Canada, were to issue a digital currency, well you already trust the Canadian dollar, and so you don't need a distributed ledger in order to believe you just received final payment in your digital wallet.\"\nClarification: This article has been amended to make clear that the Bank of Canada is working with global regulators to create regulation around cryptocurrencies.", "external_links": [], "published": "2018-01-25T16:38:00.000+02:00", "crawled": "2018-01-25T16:10:16.013+02:00", "highlightTitle": ""}