{"organizations": [], "uuid": "37fb3f3dad421211542f80e81d81dddf907d7b59", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/25/104968505-20180123-0461-2548.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/fed-will-be-forced-to-raise-rates-more-rapidly-than-expected-cnbc-fed-survey.html", "country": "US", "domain_rank": 767, "title": "Fed will be forced to raise rates more rapidly than expected: CNBC Fed survey", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.296, "site_type": "news", "published": "2018-01-30T14:16:00.000+02:00", "replies_count": 0, "uuid": "37fb3f3dad421211542f80e81d81dddf907d7b59"}, "author": "Steve Liesman", "url": "https://www.cnbc.com/2018/01/30/fed-will-be-forced-to-raise-rates-more-rapidly-than-expected-cnbc-fed-survey.html", "ord_in_thread": 0, "title": "Fed will be forced to raise rates more rapidly than expected: CNBC Fed survey", "locations": [], "entities": {"persons": [{"name": "adam jeffery", "sentiment": "negative"}, {"name": "john roberts", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "negative"}, {"name": "fed", "sentiment": "negative"}, {"name": "cnbc fed", "sentiment": "negative"}, {"name": "hilliard lyons", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Wall Street is looking for more economic growth this year, boosted by recently adopted tax cuts, but also more interest rate hikes from the Federal Reserve.\nRespondents to the CNBC Fed Survey expect gross domestic product to rise 2.9 percent compared with last year, about half a point higher than the average forecast in the July survey. At the same time, forecasters lowered their 2019 outlook to 2.7 percent from 2.85 percent in the December survey.\nThe 40 respondents, including economists, fund managers and strategists, now see the funds rate ending 2018 at 2.24 percent, up about a quarter point from the prior survey. Next year, the rate is forecast to rise to 2.8 percent, also a quarter point higher.\n\"We believe that the Fed may be forced to raise rates more rapidly than the market is currently anticipating due to accelerating economic conditions and a heating of the economy,\" John Roberts, director of research at Hilliard Lyons, wrote in response to the survey. \"That could lead to a pullback in equity markets when combined with rising rates that make fixed-income instruments more competitive with equities.\"\nBut Chris Rupkey, chief financial economist for Mitsubishi UFJ Financial Group, thinks the market can weather the Fed. \"Never seen a calmer time when it comes to the risks that keep one up at night. The biggest risk is normally interest rate risk and the Fed isn't close to taking away the punch bowl yet if they are just thinking three baby step rate hikes this year.\"\nRespondents to the CNBC Survey on average continue to be unenthused about the outlook for stocks, seeing just 3 percent upside for the S&P 500 from current levels this year and 5 percent next year. (Respondents chased the market higher with their forecasts for most of last year.) The 10-year Treasury yield is seen rising above 3 percent this year and nearing 3.5 percent in 2019, but the forecast remains well below where it was for much of last year.\nFor the fourth time in a row, respondents raised their outlook for GDP growth for 2018. The outlook is now a half point higher for growth than it was during the summer, and much of it seems to be because of the tax cuts.\n\"The stimulative effect of the tax law change has likely been underestimated in the market,\" wrote Mike Englund, chief economist at Action Economics.\nViews about the chance of recession in the next year also fell for the fourth-straight survey. At 13.7 percent, it is the second lowest in more than six years. But the Trump administration's trade policies loom as a major concern, with many seeing it as the top threat to the expansion followed by the possibility of a Fed policy mistake.\nOut of the responses, 55 percent believe the administration's trade policies are negative for economic growth, though 21 percent say it's soon to tell. Just 16 percent say the policies are positive for growth. Just under half of the respondents believe it's also too soon to say if recent tariffs placed on solar panel and washing machine imports represent a shift in policy or an isolated incident. About 40 percent see them as part of a trend toward more import restrictions.", "external_links": [], "published": "2018-01-30T14:16:00.000+02:00", "crawled": "2018-01-30T14:17:25.006+02:00", "highlightTitle": ""}