{"organizations": [], "uuid": "b4179c85ab17061d45d68bbe9d96b47ff496e1c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-infoblox-appoints-brad-bell-as-chief-information-officer.html", "country": "US", "domain_rank": 767, "title": "Infoblox Appoints Brad Bell as Chief Information Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T17:00:00.000+02:00", "replies_count": 0, "uuid": "b4179c85ab17061d45d68bbe9d96b47ff496e1c6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-infoblox-appoints-brad-bell-as-chief-information-officer.html", "ord_in_thread": 0, "title": "Infoblox Appoints Brad Bell as Chief Information Officer", "locations": [], "entities": {"persons": [{"name": "brad bell", "sentiment": "negative"}, {"name": "jesper andersen", "sentiment": "none"}, {"name": "infoblox", "sentiment": "none"}, {"name": "andersen", "sentiment": "none"}, {"name": "bell", "sentiment": "none"}, {"name": "brad", "sentiment": "none"}], "locations": [{"name": "santa clara", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "infoblox", "sentiment": "none"}], "organizations": [{"name": "infoblox inc.", "sentiment": "negative"}, {"name": "actionable network intelligence", "sentiment": "none"}, {"name": "infoblox", "sentiment": "none"}, {"name": "bell", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SANTA CLARA, Calif., Jan. 30, 2018 /PRNewswire/ -- Infoblox Inc. , the network control company that provides Actionable Network Intelligence , today announced that it has appointed Brad Bell as chief information officer (CIO) of Infoblox. Bell will report to Infoblox president and chief executive officer Jesper Andersen. Bell will be responsible for all aspects of the company's global information technology strategy, services, and operations. A key initiative will be leading Infoblox's IT business transformation strategy and adopting a SaaS-based business model. As part of this, Bell will drive the migration of internal and external functions and applications to the cloud, creating operational efficiencies and accelerating Infoblox's ability to bring new offerings to market.\n\"Brad is an innovator and chief architect with excellent business instincts,\" said Andersen. \"He is a strategic technologist with a collaborative and transparent management style. As we transform our business for the future, it's important that we have an IT leader positioned to protect our information technology and accelerate our growth around the world. I am confident Brad's leadership will take us to this next level as we evolve into a SaaS-focused organization.\"\nBell is a veteran technology executive with over 25 years of experience leading global organizations in the high-tech industry. His most recent role was with Microsoft where he led the Global Infrastructure and Service Management/Support function at Microsoft. His span of responsibility included overseeing worldwide network, Azure cloud migrations, service management and help desk, tools development, large data visualization, applications support and acquisition integration. Prior to Microsoft, Brad was the CIO for Sonos Inc. He also spent 17 years at Cisco leading various global infrastructure teams with progressively broader leadership responsibility including driving consulting services and WebEx customer success.\n\"I feel privileged to join the Infoblox team,\" said Bell. \"It's not often one gets the opportunity to drive next-generation cloud capabilities at such a pivotal point in time as the industry and our customers embrace SaaS IT. Leading the IT organization, I hope to drive innovation, simplification and automation to create value for our customers, employees and partner experience.\"\nBell holds a BS degree in Finance at California State University, Sacramento. Additionally, he completed the Technology Leader Program from Stanford Graduate School of Business Executive Education.\nAbout Infoblox\nInfoblox delivers Actionable Network Intelligence to enterprise, government, and service provider customers around the world. As the industry leader in DNS, DHCP, and IP address management, the category known as DDI, Infoblox ( www.infoblox.com ) provides control and security from the core—empowering thousands of organizations to increase efficiency and visibility, reduce risk, and improve customer experience.\nMedia Contact:\nErica Coleman\nInfoblox\necoleman@infoblox.com\n(408) 986-5697\nView original content with multimedia: http://www.prnewswire.com/news-releases/infoblox-appoints-brad-bell-as-chief-information-officer-300590063.html\nSOURCE Infoblox Inc.", "external_links": ["http://www.prnewswire.com/news-releases/infoblox-appoints-brad-bell-as-chief-information-officer-300590063.html", "https://www.infoblox.com/", "https://www.infoblox.com/products/actionable-network-intelligence/"], "published": "2018-01-30T17:00:00.000+02:00", "crawled": "2018-01-30T18:43:32.000+02:00", "highlightTitle": ""}