{"organizations": [], "uuid": "2f9d1a179176029832151f15748cdfb7f2134432", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221100740&w=1200&r=LYNXMPEE0A0O5", "site_section": "https://www.reuters.com/finance/bonds", "section_title": "Bonds News | Reuters.com", "url": "https://www.reuters.com/article/us-germany-economy-gdp/in-surplus-and-growing-fast-german-economy-powers-on-idUSKBN1F018G", "country": "US", "domain_rank": 408, "title": "In surplus and growing fast, German economy powers on", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T18:52:00.000+02:00", "replies_count": 0, "uuid": "2f9d1a179176029832151f15748cdfb7f2134432"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-germany-economy-gdp/in-surplus-and-growing-fast-german-economy-powers-on-idUSKBN1F018G", "ord_in_thread": 0, "title": "In surplus and growing fast, German economy powers on", "locations": [], "entities": {"persons": [], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "ifo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BERLIN (Reuters) - Economic growth in Germany hit a six-year high in 2017 and its public finances posted a record surplus, fuelling hopes of another strong showing in 2018 and sharpening a debate about how its next government should manage the windfall.\nGrowth reached 2.2 percent, the federal statistics office said on Thursday. That missed a Reuters poll forecast of 2.4 percent but was still the highest since 2011 with consumer spending, boosted by ultra-low borrowing costs, record high employment and rising wages, providing the biggest impetus.\nCompany investments and exports, the traditional driver of Europe’s largest economy, also contributed as demand for ‘made in Germany’ goods picked up globally and in a euro zone experiencing its broadest recovery in a decade.\nWith the Ifo institute last month forecasting even faster growth of 2.6 percent for this year, part of the economic spotlight is falling on political leaders as, after months spent failing to form a coalition, they debate how best to build on that momentum.\n“Now it is about making sure that the economic shine continues into the future,” said Thomas Gitzel of VP Bank. “Investments are needed. The next government has a big burden. It is time to take action instead of resting on laurels.”\nConservative Chancellor Angela Merkel hopes to form a coalition with the Social Democrats (SPD) but she said on Thursday - the final day of exploratory talks that could lead to formal negotiations - that there were still hurdles to clear.\nDespite growth in 11 of the 12 years she has been in power, she has faced accusations of complacency over the economy, and economists and business lobby groups have called for an overhaul of Germany’s burdensome tax system, which some argue has inhibited private sector investments.\nMerkel’s CSU/CDU alliance favors cutting taxes to boost the upswing - which it has the fiscal leeway to do - but some economists recommend raising them or leaving them at least unchanged to avoid the risk of a bubble.\nThe SPD has suggested raising taxes on high earners to fund higher welfare spending and investments in education as well as in better daycare facilities for children.\nENOUGH STIMULUS ALREADY? FILE PHOTO: A container ship is loaded at a terminal in the harbour of Hamburg, Germany September 23, 2012. REUTERS/Fabian Bimmer/File Photo Ifo’s Timo Wollmershaeuser argued that the European Central Bank’s expansionary policies were providing enough impetus for the German economy already, meaning the next government should defer any plans to cut taxes.\n“If the economy continues to perform so well, it would be wise to postpone the planned tax cuts and implement them only gradually, ideally not until 2019 when the ECB is likely to turn off its money tap,” Wollmershaeuser said.\nBut Merkel’s alliance, which lost votes to the far-right in a national election in September, is eager to show households that they too are left with more money in their pockets and not just the government, which has run a surplus since 2014.\nSlideshow (3 Images) Separate statistics office data on Thursday showed the public sector as a whole posted a record surplus of 38.4 billion euros in 2017, making clear just how much wiggle room the government has to trim the tax burden and increase spending.\nMerkel has rejected criticism of her handling of the economy, pointing to significant public investments increases in infrastructure and on refugees.\n“Above all we need less bureaucracy, more flexibility for companies and more investments in infrastructure and education,” said Martin Wansleben, managing director of the DIHK Chambers of Industry and Commerce.\n“Tax relief for companies - and absolutely no way tax increases - are part of a good economic package.”\nA breakdown of Thursday’s GDP data showed capital investments were the second-largest growth driver, contributing 0.6 percentage points. Exports contributed 0.2 percentage points.\nGerman inflation also picked up in 2017, hitting a five-year high.\nThat will feed into a heated debate among ECB rate-setters, who must decide how and when to unwind their asset purchase program as price pressures across the euro zone gradually increase.\nediting by John Stonestreet\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-11T18:52:00.000+02:00", "crawled": "2018-01-11T17:00:03.010+02:00", "highlightTitle": ""}