{"organizations": [], "uuid": "9aea86de5a1bf886ab553ddb8dc188b0a78b647d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223348360&w=1200&r=LYNXMPEE0I0W9", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/us-pope-peru-amazon/popes-visit-to-peru-spotlights-devastation-in-rainforest-region-idINKBN1F81KD", "country": "US", "domain_rank": 408, "title": "Pope's visit to Peru spotlights devastation in rainforest region", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T15:42:00.000+02:00", "replies_count": 0, "uuid": "9aea86de5a1bf886ab553ddb8dc188b0a78b647d"}, "author": "", "url": "https://in.reuters.com/article/us-pope-peru-amazon/popes-visit-to-peru-spotlights-devastation-in-rainforest-region-idINKBN1F81KD", "ord_in_thread": 0, "title": "Pope's visit to Peru spotlights devastation in rainforest region", "locations": [], "entities": {"persons": [{"name": "pope", "sentiment": "negative"}, {"name": "francis", "sentiment": "none"}, {"name": "xavier arbex", "sentiment": "none"}, {"name": "arbex", "sentiment": "none"}, {"name": "madre de dios", "sentiment": "none"}], "locations": [{"name": "peru", "sentiment": "none"}, {"name": "maldonado", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "mitra taj", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 1:49 PM / Updated 15 minutes ago Pope's visit to Peru spotlights devastation in rainforest region Mitra Taj 5 Min Read \nPUERTO MALDONADO, Peru (Reuters) - Two decades ago, Swiss priest Xavier Arbex started sounding alarms about a looming environmental disaster in the remote Amazonian region of Peru where he had settled. \nWildcat miners who once sifted for gold alongside rivers using wheelbarrows and buckets had started tearing through pristine rainforest with heavy machinery. \n“I knew this was going to be a big problem,” Arbex said, describing his attempts to enlist heavyweight environmental groups to stop the pending disaster. “No-one listened.” \nWildcat gold mining in Peru has since flourished into a black market trade estimated to be worth billions of dollars a year. In addition to the environmental devastation, it has spawned human trafficking and violent criminal networks in distant corners of the Amazon. \nSeeking to shine a light on the problem, Pope Francis will visit the jungle region of Madre de Dios (Mother of God) on Friday. It will be the pontiff’s first stop outside the capital Lima on a three-day tour of Peru, which follows a trip to neighboring Chile. \nWhile Francis has denounced environmental degradation before, he has yet to do so in a place as threatened as Madre de Dios, parts of which have still been trod only by reclusive tribes and the odd explorer. \nIn recognition of Arbex’s cause, Francis will visit a home for troubled youth that the aging priest founded in the regional capital Puerto Maldonado, a riverside town buzzing with motorcycles and the psychedelic sounds of cumbia dance music near Peru’s border with Brazil and Bolivia. \n“We’ll finally be the center of attention,” said Eduardo Farfan, a 30-year-old owner of a menswear shop in Puerto Maldonado, where posters welcoming the pope hung from wooden homes. “When I go to Lima to buy clothes, some people have no idea where Puerto Maldonado is.” \nSuccessive political leaders in Peru have failed to slow the illegal gold rush. President Pedro Pablo Kuczynski’s plan to “formalize” miners who comply with labor and environmental laws has been derailed by crises in his center-right government. \nAs mining has become the motor of the local economy in Madre de Dios, helping elect a former wildcat miner as governor, it has turned increasingly violent. \nPark rangers are regularly harassed by miners near the Tambopata nature reserve. Last year, authorities announced the discovery of a pit near mining camps where a criminal gang incinerated at least 20 victims. In September, a police officer was killed in an ambush during an environmental patrol. \n“It’s out of control,” said Freddy Vracko, a third-generation Yugoslav-Peruvian tree farmer. FILE PHOTO: A boy carries a dog as he stands after a Peruvian police operation to destroy illegal gold mining camps in a zone known as Mega 14, in the southern Amazon region of Madre de Dios, Peru, July 14, 2015. REUTERS/Janine Costa/File Photo \nVracko’s father was shot dead by masked men in his home in December 2015 after his family endured years of death threats from encroaching miners. That prompted Vracko to run for governor in this year’s regional elections. \n“I love that the Pope is coming. Just the fact that he’ll be here ... it’s going to be a tipping point,” said Vracko. “No one has really wanted to solve this problem.” \n‘HELL OF RICHES’ \nFor Julio Cusurichi, head of a federation representing 36 indigenous communities, the illegal gold boom is only the latest sign of disdain that outsiders have shown for the Amazon and the tribes that rely on its water, plants and wildlife for survival. FILE PHOTO: An area deforested by illegal gold mining is seen in a zone known as Mega 14, in the southern Amazon region of Madre de Dios, Peru, July 13, 2015. REUTERS/Janine Costa/File Photo \nOnce enslaved and massacred by ruthless rubber barons in the 19th century, native peoples are now being forced off ancestral lands by mining mafias. Many suffer from dangerous levels of mercury in their blood. \n“Indigenous people drink water from rivers because we don’t have running water in our homes. We eat fish from rivers because we don’t buy meat from the market,” said Cusurichi, calling for the Peruvian state to defend its indigenous citizens. \nThe miners themselves, often young men fleeing poverty in Andean villages, also suffer in the makeshift mining pits they toil in clandestinely. Many girls and women lured with promises of steady work end up working in brothels, said Arbex. \n“It’s horrible. The working conditions. The sex trafficking,” Arbex said, estimating that at least 250 miners die every year in mudslides or other unreported accidents. “They prefer a hell of riches to a poor paradise.” \nThe Natural Resources Defense Council (NRDC), a U.S.-based non-profit group, said vilifying miners has kept authorities from addressing the poverty and state neglect that sustain the illegal gold trade. \nThe NRDC said it was launching a $45 million program this year to help tackle unregulated gold mining in Peru and other countries, through policies that encourage safer work practices. \nBut Arbex said it might be too late to reverse the trend. \n“I haven’t lost faith in God but I have lost faith in policy,” said Arbex. Reporting By Mitra Taj; Editing by Daniel Flynn and Frances Kerry", "external_links": [], "published": "2018-01-19T15:42:00.000+02:00", "crawled": "2018-01-19T16:15:04.037+02:00", "highlightTitle": ""}