{"organizations": [], "uuid": "59e823194fcda6c910557a19228fb8ec9bf92c2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/news/wealth", "section_title": "Reuters: Money", "url": "https://www.reuters.com/article/us-usa-mutualfunds-ici/u-s-investors-love-affair-with-bonds-unshaken-by-rising-yields-idUSKBN1F7020", "country": "US", "domain_rank": 408, "title": "U.S. investors' love affair with bonds unshaken by rising yields", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T02:22:00.000+02:00", "replies_count": 0, "uuid": "59e823194fcda6c910557a19228fb8ec9bf92c2d"}, "author": "", "url": "https://www.reuters.com/article/us-usa-mutualfunds-ici/u-s-investors-love-affair-with-bonds-unshaken-by-rising-yields-idUSKBN1F7020", "ord_in_thread": 0, "title": "U.S. investors' love affair with bonds unshaken by rising yields", "locations": [], "entities": {"persons": [{"name": "trevor hunnicutt", "sentiment": "none"}, {"name": "kristina", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "investment company institute", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ici", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 12:27 AM / Updated 14 hours ago U.S. investors' love affair with bonds unshaken by rising yields Trevor Hunnicutt 3 Min Read \nNEW YORK (Reuters) - U.S. fund investors stampeded into bonds and world stocks during the latest week, ignoring warning signs about stretched prices, according to the Investment Company Institute (ICI). \nDuring the week, nearly $17 billion poured into equities, the most in any week since June. Bonds took in even more cash, $19 billion, the most on records that date to 2013, according to the trade group. \nThe rush of cash into rising markets shows the resiliency of bonds, at least in terms of demand from investors, but also highlights people’s more ambivalent relationship with stocks. \nEquities just a week earlier recorded a $21 billion withdrawal. While they won much of that back during the most recent week, 80 percent of that money moved into products that focus on stocks abroad, not in the United States. Domestic stock funds attracted just $3.4 billion, ICI said. \n“Many investors decided that it made sense to take profits,” said Kristina Hooper, Invesco Ltd’s global market strategist, referring to the prior week. \n“By the next week it was almost as if investors had done a 180 and were pouring money into equities. The whole time we’ve seen fixed income remain popular.” \nDemand for bonds has endured yield spikes over the last two months that pushed long-dated Treasuries’ prices down sharply and led billionaire bond veteran Bill Gross of Janus Henderson Group plc to declare a bear market in bonds. The 2-year Treasury yield is at its highest levels in nearly a decade, breaching the 2 percent mark. The 10-year is near 2.6 percent, up from 2.1 percent in September. \nInvestors responded to that threat by pouring $15.8 billion into taxable bonds, the most in any week since June 2015, and another $3.2 billion into municipal bonds, the most on records dating to 2013, according to the ICI. The data covers mutual funds and exchange-traded funds (ETFs) based in the United States. \n“There may not be a lot of difference between stocks and Treasuries in terms of valuation,” said Hooper. \n“We want to be very vigilant because there’s vulnerability in stretched valuations.” Reporting by Trevor Hunnicutt; Editing by Phil Berlowitz", "external_links": [], "published": "2018-01-18T02:22:00.000+02:00", "crawled": "2018-01-18T02:41:17.016+02:00", "highlightTitle": ""}