{"organizations": [], "uuid": "79ed9e01343514b192e8db44dc28d3f040af1e4c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-alicorp-announces-general-extraordinary-shareholdersa-meeting-to-propose-potential-ma-transaction-in-bolivia.html", "country": "US", "domain_rank": 767, "title": "Alicorp Announces General Extraordinary Shareholders’ Meeting to Propose Potential M&A Transaction in Bolivia", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.724, "site_type": "news", "published": "2018-01-25T00:17:00.000+02:00", "replies_count": 0, "uuid": "79ed9e01343514b192e8db44dc28d3f040af1e4c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-alicorp-announces-general-extraordinary-shareholdersa-meeting-to-propose-potential-ma-transaction-in-bolivia.html", "ord_in_thread": 0, "title": "Alicorp Announces General Extraordinary Shareholders’ Meeting to Propose Potential M&A Transaction in Bolivia", "locations": [], "entities": {"persons": [{"name": "alic", "sentiment": "negative"}], "locations": [{"name": "bolivia lima", "sentiment": "none"}, {"name": "peru", "sentiment": "none"}, {"name": "lima", "sentiment": "none"}, {"name": "san isidro", "sentiment": "none"}, {"name": "westin hotel lima", "sentiment": "none"}], "organizations": [{"name": "alicorp s.a.a.", "sentiment": "negative"}, {"name": "lima stock exchange", "sentiment": "negative"}, {"name": "alicorp", "sentiment": "negative"}, {"name": "peruvian general corporation law", "sentiment": "none"}, {"name": "industrias del aceite s.a.", "sentiment": "none"}, {"name": "adm-sao s.a.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LIMA, Peru--(BUSINESS WIRE)-- Alicorp S.A.A. (the “Company” or “Alicorp”) (Lima Stock Exchange: ALICORC1 and ALICORI1) a leading Peruvian CPG and B2B company announced the following:\nPursuant to a resolution adopted by the Board of Directors on January 15, 2018, and in accordance with the Company’s bylaws and Peruvian General Corporation Law, Alicorp’s Board of Directors agreed to call a General Extraordinary Shareholders’ Meeting (the “Meeting”) which will take place at the Westin Hotel Lima, Las Begonias N° 450, San Isidro, Lima, Peru. The first call will take place at 11:00 a.m. (EST) on February 22, 2018. In the event that the first call does not reach quorum, the second call will take place at 11:00 a.m. (EST) on February 26, 2018. The following agenda will be discussed:\nPresentation of the potential acquisition of 100% of the businesses comprising Industrias del Aceite S.A. and ADM-SAO S.A. (the \"Potential Transaction\"), as well as the key transaction terms and any material update related to the Potential Transaction. Approval of delegation of powers to the ad-hoc Independent Committee (the “Independent Committee”) in order to adopt the necessary agreements in relation to the Potential Transaction.\nAdditional Information :\nShareholders adequately registered under their name in the Share Registry Book up to ten days before the Meeting is held, are entitled to attend the Meeting. The total number of subscribed shares with voting rights that can attend the Meeting is 847,191,731. The required quorum for the first call is fifty (50) percent of the subscribed shares with voting rights. If necessary, the required quorum for the second call is at least twenty-five (25) percent of the subscribed shares with voting rights. The submission and acceptance of the power of attorney and votes by proxy will be available until February 21, 2018, 4:00 p.m. EST at Avenida Circunvalación de Los Incas Golf Club No. 134, 11th Floor, Santiago de Surco, Lima, Peru. The documents and information related to article 130° of Peruvian General Corporation Law is available to shareholders at the address mentioned in the preceding paragraph.\nThis announcement regarding the call to the General Extraordinary Shareholders’ Meeting has been filed as a material event to the Superintendencia del Mercado de Valores (SMV) and is available on the Company's website.\nGeneral Extraordinary Shareholders’ Meeting – Logistics Information\nManagement will host a General Extraordinary Shareholders´ Meeting to propose and approve matters related to the Potential Transaction.\nDate: (i) First Call: Thursday, February 22, 2018 (ii) Second Call: Monday, February 26, 2018 Time: 11:00 a.m. Eastern Time (EST), 11:00 a.m. Lima Time Place: Westin Hotel – Las Begonias N° 450, San Isidro, Lima, Peru About Alicorp\nAlicorp is a leading CPG and B2B company headquartered in Peru, with operations in other Latin American countries, such as Argentina, Brazil, Chile, Ecuador, and exports to 23 other countries. The Company focuses on three core businesses: (1) Consumer Products (food, personal and home care products) in Peru, Brazil, Argentina, Ecuador, Colombia and other countries, (2) Industrial Food Products (industrial flour, industrial lard, pre-mix and food service products), and (3) Aquaculture (fish and shrimp balanced feed).\nForward-Looking Statements\nCertain statements contained in this news release constitute \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements represent Alicorp's expectations or beliefs concerning future events, and it is possible that the results described in this press release will not be achieved. These forward-looking statements are subject to risks, uncertainties and other factors, many of which are outside of Alicorp's control that could cause actual results to differ materially from the results discussed in the forward-looking statements.\nAny forward-looking statement speaks only as of the date on which such statement is made, and, except as required by law, Alicorp does not undertake any obligation to update or revise any forward-looking statement, whether as a result of new information, future events or otherwise. New factors emerge from time to time and it is not possible for management to predict all such factors.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124006220/en/\nAlicorp\nInvestor Relations\nAlexander Pendavis Heksner, 511-315-0800 Ext: 444410\nF: 511-315-0867\nCorporate Finance Director & IRO\napendavish@alicorp.com.pe\ninvestorrelations@alicorp.com.pe\nSource: Alicorp S.A.A.", "external_links": ["http://www.businesswire.com/news/home/20180124006220/en/"], "published": "2018-01-25T00:17:00.000+02:00", "crawled": "2018-01-25T01:37:23.000+02:00", "highlightTitle": ""}