{"organizations": [], "uuid": "42a482158274ca40da9a027acf42f12b4b6fc0c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/news/media", "section_title": "Media | Reuters.com", "url": "https://www.reuters.com/article/us-entertainment-film-trafficking/raids-and-rescues-nobel-laureate-satyarthi-film-exposes-india-child-slavery-idUSKBN1FB009", "country": "US", "domain_rank": 408, "title": "Raids and rescues: Nobel laureate Satyarthi film exposes India child slavery", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-01-22T08:06:00.000+02:00", "replies_count": 0, "uuid": "42a482158274ca40da9a027acf42f12b4b6fc0c8"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-entertainment-film-trafficking/raids-and-rescues-nobel-laureate-satyarthi-film-exposes-india-child-slavery-idUSKBN1FB009", "ord_in_thread": 0, "title": "Raids and rescues: Nobel laureate Satyarthi film exposes India child slavery", "locations": [], "entities": {"persons": [{"name": "satyarthi", "sentiment": "negative"}, {"name": "bachpan bachao andolan", "sentiment": "none"}, {"name": "kailash satyarthi", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Thomson Reuters Foundation) - Forget jargon-filled monologues, raids to rescue enslaved Indian children inject drama into a documentary about Nobel Laureate Kailash Satyarthi, who hopes the film will inspire viewers to play a part in the global fight to eradicate modern slavery.\n“Kailash”, which premiered last week at the U.S.-based Sundance Film Festival, charts Satyarthi’s rise from domestic anti-trafficking figurehead to Nobel Peace Prize winner.\nSatyarthi, 64, whose charity Bachpan Bachao Andolan has been credited with freeing at least 80,000 child slaves in India over 30 years, said the film might shock audiences and spur them to take action such as refusing to buy goods made with slave labor.\n“Many people have never thought that slavery still exists in its cruelest form,” Satyarthi told the Thomson Reuters Foundation by phone from Sundance, the independent film industry’s premiere U.S. gathering - now in its 33rd year.\n“I always feel that consciousness-raising is the first step to societal change,” added Satyarthi, joint winner of the 2014 Nobel Peace Prize with Pakistani schoolgirl Malala Yousafzai.\nIn an early scene of the documentary, one of many filmed with handheld cameras, activists working under Satyarthi’s lead storm into a New Delhi apartment housing several child laborers.\nAfter one campaigner breaks down a padlocked door, his frantic colleague eventually unearths stunned-looking children from under piles of plastic bags where they had been hidden.\nFilmmaker Derek Doneen spent two years shooting scenes with Satyarthi’s team, which the American director said had enabled him to avoid making a film dominated by data and talking heads.\n“I didn’t want to make the sad child-slavery movie that you see and maybe it affects you but you don’t want to ... talk about it because it’s too heavy,” said the “Kailash” director.\nCountless children across India are trafficked and enslaved every year - either forced to work or sold into sexual slavery.\nAbout 60 percent of the more than 23,000 trafficking victims rescued in India were children in 2016, government data shows.\nBut activists say slavery figures are hugely underestimated in the socially conservative society, where the fear of being blamed, shamed or stigmatized means victims and their families often keep quiet and choose not to report the abuses they face.\nWorldwide, about 10 million children were living as modern slaves last year - either trapped in forced labor or forced marriages - according to the United Nations International Labour Organization (ILO) and human rights group Walk Free Foundation.\nReporting by Sebastien Malo @sebastienmalo, Editing by Kieran Guilbert; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T08:06:00.000+02:00", "crawled": "2018-01-22T06:01:53.000+02:00", "highlightTitle": ""}