{"organizations": [], "uuid": "35aed27617976ac36d17864a91199192f30fa23f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222867734&w=1200&r=LYNXMPEE0G205", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-china-economy-gdp/chinas-fourth-quarter-economic-growth-likely-to-slow-amid-debt-pollution-battle-idUSKBN1F634N", "country": "US", "domain_rank": 408, "title": "China's Q4 economic growth likely to slow amid debt, pollution battle", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T01:00:00.000+02:00", "replies_count": 0, "uuid": "35aed27617976ac36d17864a91199192f30fa23f"}, "author": "", "url": "https://www.reuters.com/article/us-china-economy-gdp/chinas-fourth-quarter-economic-growth-likely-to-slow-amid-debt-pollution-battle-idUSKBN1F634N", "ord_in_thread": 0, "title": "China's Q4 economic growth likely to slow amid debt, pollution battle", "locations": [], "entities": {"persons": [{"name": "kevin yao", "sentiment": "none"}, {"name": "li keqiang", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "min read  beijing", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING (Reuters) - China is expected on Thursday to post a modest slowdown in fourth quarter economic growth from the previous three months as the government extended a crackdown on debt risks and factory pollution.\nAnalysts polled by Reuters expect the world’s second-largest economy to have grown 6.7 percent in the October-December quarter from a year earlier, cooling from the previous quarter’s 6.8 percent pace.\nChinese policymakers have been trying to contain financial risks and slow an explosive build-up in debt without stunting economic growth.\nThe expected moderation, still within Beijing’s comfort zone given its annual growth target of around 6.5 percent, comes on the back of a cooling property sector, pollution curbs that have hit factory activity and a rise in corporate funding costs.\nStill, modest upside surprises are expected by analysts after Premier Li Keqiang said last week that the economy is expected to have grown 6.9 percent last year, topping the state target and accelerating for the first time in seven years.\n“It will be surprising if Q4 growth turns out to be 6.9 percent,” said Li Huiyong, an economist at Shenwan Hongyuan Securities in Shanghai.\n“The downward trend is clear. We expect investment to come under pressure this year but we are relatively optimistic about consumption and exports.”\nInvestment could be dampened by property curbs and tighter controls on local government financing, he added.\nA Reuters poll forecast China’s economic growth would slow to 6.5 percent this year from expected 6.8 percent in 2017.\nThe release of China’s fourth-quarter and 2017 GDP data, including for December factory output, retail sales and fixed-asset investment, is scheduled for 0700 GMT on Thursday, a delay from its usual 0200 GMT release time.\nA better-than-expected gross domestic product reading could lift stocks and global commodity prices, and boost bullish sentiment on the yuan CNY=CFXS , which has gained about 1percent against the dollar so far this year, following a 6.8percent rise last year.\nAnalysts estimated gross domestic product (GDP) grew 1.6 percent quarter-on-quarter, easing from 1.7 percent in the third quarter.\nRISING BORROWING COSTS China’s exports and imports growth slowed in December after surging in the previous month, adding to signs of ebbing economic momentum. Solid exports have been a boon for Chinese policymakers.\nMeanwhile, China’s bank lending halved in December as the government kept up its campaign to curb financial system risks, but banks still managed to dole out a record amount for the year amid the tighter scrutiny.\nChina does not need to raise benchmark interest rates in the near-term as market rates and corporate borrowing costs have gone up amid a deleveraging drive, a central bank advisor said in remarks published on Tuesday.\nThe weighted average lending rate for non-financial firms, a key indicator of corporate funding costs in China, rose by 49 basis points in the first nine months of 2017 to 5.76 percent, according to central bank data.\nPolicy sources told Reuters previously that China will still keep its GDP growth target at around 6.5 percent in 2018 as Beijing seeks to balance efforts to reduce debt risks while keeping the economy on a steady footing.\nReporting by Kevin Yao; Editing by Sam Holmes\n ", "external_links": [], "published": "2018-01-18T01:00:00.000+02:00", "crawled": "2018-01-18T03:01:19.023+02:00", "highlightTitle": ""}