{"organizations": [], "uuid": "e1be5b0c93f132c95c4838729ce5c81e8836687f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/business-wire-threat-stack-appoints-aditya-joshi-as-evp-of-products-and-technology.html", "country": "US", "domain_rank": 767, "title": "Threat Stack Appoints Aditya Joshi as EVP of Products and Technology", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T16:30:00.000+02:00", "replies_count": 0, "uuid": "e1be5b0c93f132c95c4838729ce5c81e8836687f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/business-wire-threat-stack-appoints-aditya-joshi-as-evp-of-products-and-technology.html", "ord_in_thread": 0, "title": "Threat Stack Appoints Aditya Joshi as EVP of Products and Technology", "locations": [], "entities": {"persons": [{"name": "aditya joshi", "sentiment": "negative"}, {"name": "joshi", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Latest Addition to Leadership Team Comes on the Heels of a Record-Breaking Year of Growth Fueled by the Increased Risk of Cloud Data Leaks and Compliance Requirements\nBOSTON--(BUSINESS WIRE)-- Threat Stack , provider of the industry’s most comprehensive intrusion detection platform for cloud, hybrid-cloud, and on-premises environments, today announced that it has appointed Aditya Joshi (AJ) as the company’s Executive Vice President of Products and Technology. In this role, Joshi will be responsible for overseeing Threat Stack’s product management, engineering, operations, test and support organizations.\nJoshi’s appointment is the latest significant addition to the Threat Stack leadership team, and immediately follows the company closing a record-breaking 2017. Fueled by the increased risk of cloud data leaks and growing compliance requirements, Threat Stack grew its business across the board, with 235 percent year-over-year revenue growth and a 125 percent increase in workloads monitored. Overall, the Threat Stack team doubled in 2017 and has plans to once again double its Boston-based team in 2018.\n“We’re at an important time in the company’s growth and maturation; continuing to add proven talent and experience is critical in achieving our vision and growth aspirations,” said Brian M. Ahern, Threat Stack Chairman and CEO. “Joshi is a proven technology executive with a track record of helping companies drive innovation and build for scale. His understanding of modern-day cloud operations and cybersecurity will ensure Threat Stack’s industry-leading intrusion detection platform effectively protects businesses from advanced cyberattacks as public and private cloud platform technologies mature. Joshi’s ability to lead cross-disciplinary teams will help us continue to deliver customer value for all businesses looking to securely take advantage of the benefits the cloud has to offer.”\nPrior to joining Threat Stack, Joshi served as EVP of products at Intralinks. In this role, he was responsible for product management, architecture, engineering, operations and support. He worked closely with the sales and marketing leadership teams to help define, prioritize and deliver products that led to revenue growth. During his tenure, the team delivered several market-leading innovations, doubling the company’s patent portfolio, including launching a solution for GDPR compliance. Previously, Joshi held senior roles at Avid Technology as VP of products and general manager of media enterprise and cloud solutions, as well as senior leadership positions at Novell Inc. He started his career at Andersen Consulting (now Accenture) where he worked with some of the firm’s largest customers in the US, Europe and Asia.\nThreat Stack’s flagship platform combines continuous security monitoring and risk assessment to protect against intrusion, insider threats and data loss while providing IT staff with an unparalleled level of visibility. With 95 percent of enterprises using the private, public or hybrid-cloud environments , businesses need an intrusion detection solution that casts a wide net of detection points across customers’ infrastructure and goes beyond a single type of infrastructure, point of detection, or threat category.\n“Almost every business is either starting in, or strategically migrating to, public, private and hybrid-cloud environments based on their own individual needs,” said Joshi. “My goal is to help Threat Stack continue to advance the development of its intrusion detection platform to ensure security and operations staffs are able to securely, and confidently, adopt and scale cloud infrastructure regardless of what stage of cloud adoption their company is in.”\nAbout Threat Stack\nThreat Stack enables growth-driven companies to scale securely and meet complex cloud security needs by identifying and verifying insider threats, external attacks, and data loss in real time. Purpose built for today’s infrastructure, Threat Stack’s comprehensive intrusion detection platform combines continuous security monitoring and risk assessment to empowers security and operations to better manage risk and compliance across their entire infrastructure, including cloud, hybrid cloud and multi-cloud.\nFor more information, or to start a free cloud security trial, visit www.threatstack.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180129005333/en/\nPress\nfama PR\nTim Morin, 617-986-5015\nthreatstack@famapr.com\nSource: Threat Stack", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fthreatstack.com&esheet=51749908&newsitemid=20180129005333&lan=en-US&anchor=Threat+Stack&index=1&md5=8736bef817855c01dfd9329808924af9", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.rightscale.com%2Flp%2F2017-state-of-the-cloud-report%3Fcampaign%3D70170000000vFyc&esheet=51749908&newsitemid=20180129005333&lan=en-US&anchor=95+percent+of+enterprises+using+the+private%2C+public+or+hybrid-cloud+environments&index=2&md5=bb5d34fd68983b7759201e014c90973f", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.threatstack.com%2F&esheet=51749908&newsitemid=20180129005333&lan=en-US&anchor=www.threatstack.com&index=3&md5=3af8b5c2b1daf3012603d97733dadd24", "http://www.businesswire.com/news/home/20180129005333/en/"], "published": "2018-01-29T16:30:00.000+02:00", "crawled": "2018-01-29T19:59:33.000+02:00", "highlightTitle": ""}