{"organizations": [], "uuid": "22d889c79f4be6d13d09024ca3f6cb68f20e13d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-lincoln-international-promotes-seven-to-managing-director.html", "country": "US", "domain_rank": 767, "title": "Lincoln International Promotes Seven to Managing Director", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T17:30:00.000+02:00", "replies_count": 0, "uuid": "22d889c79f4be6d13d09024ca3f6cb68f20e13d5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-lincoln-international-promotes-seven-to-managing-director.html", "ord_in_thread": 0, "title": "Lincoln International Promotes Seven to Managing Director", "locations": [], "entities": {"persons": [{"name": "bobby reifman", "sentiment": "none"}, {"name": "jim lawson", "sentiment": "none"}, {"name": "martijn koops", "sentiment": "none"}, {"name": "francis tran", "sentiment": "none"}, {"name": "christine weis", "sentiment": "none"}, {"name": "richard zhu", "sentiment": "none"}, {"name": "andres middelschulte", "sentiment": "none"}, {"name": "chaim lubin", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "frankfurt", "sentiment": "none"}, {"name": "amsterdam", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "lincoln international", "sentiment": "negative"}, {"name": "lincoln international promotes seven", "sentiment": "negative"}, {"name": "lincoln", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 9, 2018 /PRNewswire/ -- Lincoln International, a leading global mid-market investment bank, is pleased to announce the promotion of seven Directors to Managing Director, the largest number of promotions to Managing Director in the firm's history.\nThe promotions of Martijn Koops (Amsterdam), Chaim Lubin (Chicago), Andres Middelschulte (Frankfurt), Bobby Reifman (Chicago), Francis Tran (Los Angeles), Christine Weis (Frankfurt) and Richard Zhu (Beijing) reflect the continued growth and success Lincoln is experiencing around the world.\n\"We are thrilled to promote these seven professionals into increased leadership roles,\" said Jim Lawson, Chairman of Lincoln International. \"Together, the group represents almost 50 years of achievement and experience at Lincoln. They have been part of our trajectory and have made important contributions in winning new assignments, client engagements and global expansion, while helping to shape the positive culture we have today. On behalf of the entire firm, we congratulate this group on their promotions, and we look forward to their continued success.\"\nThe promoted individuals are recognized experts in their areas of focus who provide global clients with advisory services in mergers and acquisitions and debt advisory. Details about the promoted professionals, in alphabetical order, include:\nMartijn Koops | Amsterdam, The Netherlands\nMartijn Koops joined Lincoln seven years ago, shortly after the firm opened a dedicated Benelux office in Amsterdam. Martijn has made an important contribution in building and establishing a flourishing Benelux sell-side practice. He has nearly 14 years of experience advising private equity firms, corporates, financial institutions and entrepreneurs on M&A transactions and capital raisings across a wide variety of industries. Martijn will be focused on further expanding Lincoln's activities in the Business Services and Technology, Media and Telecom (\"TMT\") industry in the Benelux, in close coordination with the firm's global industry groups. Before joining Lincoln, Martijn worked in the M&A practice of NIBC, focused on Benelux M&A. Martijn studied at the Vrije Universiteit in Amsterdam and the Instituto Tecnológico Autónomo de México (ITAM) in Mexico City and holds a Master's degree in economics.\nChaim Lubin | Chicago, Illinois\nChaim Lubin joined the firm as an Associate in 2008 and has honed his expertise in the electronics and solar markets as a leader in Lincoln's Electronics and Energy, Power and Infrastructure practices. Chaim advises private equity, Fortune 500 and private company clients on both domestic and cross-border mergers and acquisitions, restructuring and fairness opinions. Prior to joining Lincoln International, Chaim worked in public accounting for Feeley and Driscoll, P.C. Chaim earned a Master of Business Administration from the Kellogg School of Management at Northwestern University, a Master of Engineering Management from the McCormick School of Engineering and Applied Science at Northwestern University and a Bachelor of Science from Boston University with Honors. Chaim is a licensed CPA.\nAndres Middelschulte | Frankfurt, Germany\nAndres Middelschulte joined Lincoln's Frankfurt office in 2011 and advises private equity investors and strategic investors. Andres' experience includes numerous domestic and international M&A transactions (buy-and-sell side) as well as Debt Advisory mandates. In total, he has more than 13 years of investment banking experience serving clients in Germany, Switzerland and Austria across several industries including TMT, healthcare, industrials, financial services, real estate and construction. Prior to joining Lincoln, Andres worked in the Investment Banking Division of Barclays Capital in London and Frankfurt. Andres completed a double degree program and graduated from the International Management School Malente (Intermas) and the Anglia Ruskin University (Cambridge/UK) and holds a Diplom-Betriebswirt and a Bachelor of Arts with Honors in business administration.\nBobby Reifman | Chicago, Illinois\nSince joining Lincoln as an Associate in 2008, Bobby Reifman has gained significant M&A advisory expertise, working on numerous transactions for leading private equity firms, public companies and private and family-owned businesses as a member of the Global Industrials group. Bobby has wide ranging expertise in a variety of sectors including industrial, materials, machinery and distribution, and has keenly focused on motion control, electronics-interconnects, plastics & rubber and water & filtration matters in recent years. Prior to joining Lincoln International, Bobby worked in mergers and acquisitions at Morgan Stanley. Bobby holds a Master of Business Administration from the University of Chicago Booth School of Business, where he graduated with honors, and a Bachelor of Science in mechanical engineering from the University of Illinois at Urbana-Champaign.\nFrancis Tran | Los Angeles, California\nFrancis Tran has held a key advisory position in the Aerospace & Defense (A&D) Group since joining Lincoln in 2011. Francis advises large-cap A&D corporations, owner entrepreneurs and A&D-focused private equity firms on M&A, take-privates, leveraged buy-outs, minority interest transactions, private placements and a variety of other strategic assignments. Francis' knowledge expands into a variety of A&D subsectors, including aerostructures & components, interiors, aftermarket & MRO, services, engineered systems, composites & advanced materials and electronics, amongst others. Prior to joining Lincoln, Francis worked in a dual role at Barclays Capital / Lehman Brothers where he supported the Financial Sponsors Group, while simultaneously working to build up the firm's mid-market presence as a member of the Western Region Middle-Market Group. Francis holds a Master of Business Administration from the University of California at Los Angeles and dual Bachelor of Arts in economics and Bachelor of Arts in biochemistry degrees from the University of California at Berkeley.\nChristine Weis | Frankfurt, Germany\nChristine Weis has been with Lincoln since 2014 in the Debt Advisory Group. Christine has more than fifteen years of finance experience focused in the mid- and large-cap markets in Germany and Europe. She has significant advisory expertise in leveraged finance, acquisition financing, recapitalizations and project financings, as well as financial restructuring of corporate clients and LBO transactions. Prior to joining Lincoln, Christine most recently was Executive Director at The Royal Bank of Scotland where she was responsible for the leveraged finance portfolio in Germany. Christine studied at the University of Regensburg and Universitat de Barcelona and holds a degree in business administration.\nRichard Zhu | Beijing, China\nRichard Zhu has nearly ten years of experience in financial services and management consulting, Richard's expertise has been essential in strengthening Lincoln's Chinese M&A practice, with a focus on the growing sell-side advisory market in China. Prior to Lincoln, Richard was a Vice President at Morgan Stanley Huaxin Securities's (\"MSHX\") investment banki", "external_links": ["http://www.lincolninternational.com/uncategorized/andresmiddelschulte/", "http://www.lincolninternational.com/team/europe/benelux/martijnkoops/", "http://www.lincolninternational.com/team/north-america/francis-tran/", "http://www.lincolninternational.com/team/europe/germany-team/christine-weis/", "http://www.lincolninternational.com/team/north-america/chaim-lubin/", "http://www.lincolninternational.com/team/north-america/robert-s-reifman/", "http://www.lincolninternational.com/", "http://www.lincolninternational.com/team/richardzhu/", "http://www.prnewswire.com/news-releases/lincoln-international-promotes-seven-to-managing-director-300579398.html"], "published": "2018-01-09T17:30:00.000+02:00", "crawled": "2018-01-09T18:54:06.015+02:00", "highlightTitle": ""}