{"organizations": [], "uuid": "3fb75b6d0f249af47be69ba4b338bec35b2c3d2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/25/104968813-AP_18025701532516-1.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/25/trumps-focusing-on-the-wrong-thing-in-trade-talk-says-conservative-analyst.html", "country": "US", "domain_rank": 767, "title": "Trump's focusing on the wrong thing in trade talk, says conservative analyst", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T00:17:00.000+02:00", "replies_count": 0, "uuid": "3fb75b6d0f249af47be69ba4b338bec35b2c3d2d"}, "author": "Michelle Fox", "url": "https://www.cnbc.com/2018/01/25/trumps-focusing-on-the-wrong-thing-in-trade-talk-says-conservative-analyst.html", "ord_in_thread": 0, "title": "Trump's focusing on the wrong thing in trade talk, says conservative analyst", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump' s focus on trade deficits being a \"bad deal\" for the United States is no way to get a trade agreement, conservative economic analyst James Pethokoukis told CNBC on Thursday.\nNot only is that talk hindering NAFTA negotiations and any potential of re-entering a Pacific trade deal, the president isn't saying what it is exactly that he wants in the agreements.\n\"I am not all clear … what the president would want other than a trade surplus and that's not going to happen from these deals. That is not something you can negotiate into a deal,\" Pethokoukis said in an interview with \" Closing Bell .\"\nEvan Vucci | AP President Donald Trump listens during a dinner with European business leaders at the World Economic Forum, Thursday, Jan. 25, 2018, in Davos. In an exclusive interview at the World Economic Forum in Davos, Switzerland, on Thursday Trump told CNBC he would reconsider the Trans-Pacific Partnership (TPP) trade deal if the U.S. could strike a \"substantially better\" agreement. He pulled out of the deal last January, although it already had little chance of securing congressional approval even before he took office.\nHe also repeated his position that he may terminate the North American Free Trade Agreement (NAFTA) if the U.S. could not reach what he calls a better deal.\n\"I think we have a good chance, but we'll see what happens,\" he said of whether the U.S. would strike an agreement to stay in the three-nation deal with Canada and Mexico.\nPethokoukis, a DeWitt Wallace Fellow at the American Enterprise Institute, said Republicans in general are very confused right now about whether trade is good or bad. As for Trump, \"Until he says exactly what he wants from these deals and what would get him to 'yes,' then it's just rhetoric.\"\nshow chapters UC Berkeley's Laura Tyson: TPP was good news for the world economy      1:49 PM ET Thu, 25 Jan 2018 | 06:32 Laura Tyson, former chair of the President's Council of Economic Advisers under President Bill Clinton , also thinks Trump is going about trade the wrong way.\nJudging a deal on whether it provides the U.S. with a trade surplus \"is not a measure of whether a trade agreement is good or not,\" she said in an interview with \" Power Lunch .\"\nPlus, the American business, manufacturing and agriculture communities want NAFTA.\n\"It is very scary to them when he says 'we'll have to negotiate a better deal' or 'I don't know' … that is a threat that 'I will tear apart NAFTA if I don't get something better,'\" she said.\n— CNBC's Jacob Pramuk contributed to this report. \n— CNBC's full interview of President Trump will air on \"Squawk Box\" at 6 a.m. ET Friday. \nWATCH:  President Trump: I would do a TPP deal if we were able to make it 'substantially better' show chapters President Trump: I would do a TPP deal if we were able to make it ‘substantially’ better      1:04 PM ET Thu, 25 Jan 2018 | 02:15", "external_links": [], "published": "2018-01-26T00:17:00.000+02:00", "crawled": "2018-01-26T00:27:29.006+02:00", "highlightTitle": ""}