{"organizations": [], "uuid": "413617a7b9350e72a9444d69058831a54e867605", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 82}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://rdcnewscdn.realtor.com/wp-content/uploads/2018/01/alabama-subdivision-1024x575.jpg", "site_section": "", "section_title": "", "url": "http://www.wsj.com/articles/my-10-year-odyssey-through-americas-housing-crisis-1516981725", "country": "US", "domain_rank": 387, "title": "My 10-Year Odyssey Through America’s Housing Crisis | realtor.com®", "performance_score": 0, "site": "wsj.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T00:04:00.000+02:00", "replies_count": 0, "uuid": "413617a7b9350e72a9444d69058831a54e867605"}, "author": "Ryan Dezember", "url": "http://www.wsj.com/articles/my-10-year-odyssey-through-americas-housing-crisis-1516981725", "ord_in_thread": 0, "title": "My 10-Year Odyssey Through America’s Housing Crisis | realtor.com®", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Wall Street Journal \nIt was convenient to my newspaper office in Foley and to the school in Gulf Shores where my wife taught kindergarten. The beaches along the Gulf of Mexico were a short drive away, but far enough to pardon us from flood insurance. The Realtor walked us over to see the neighborhood playground. \nA week before Thanksgiving in 2005, we signed the papers to buy the house for $137,500. We painted the walls and hung blinds in time to have friends over for the holiday. \nTwelve years later, little about my life remained the same. I’d left Alabama to take a job at The Wall Street Journal. I was no longer married. Pierre, the dog, had died of old age. But I was still sending mortgage payments each month to a bank in Alabama. \nI would have sold the house long ago, and in fact I tried. But when the U.S. housing market collapsed in 2007 , the property’s value fell far below the amount I borrowed to buy it. \nWalking away was never an option. I’d signed papers promising to pay the money back and I intended to do so one way or another. In case my moral compass ever needed a shake, laws in Alabama, as in many states, allow lenders to pursue the difference between the mortgage debt on a property and what it fetches in a foreclosure sale. \nFor much of the past decade that number kept growing. At one point, it would have been nearly $70,000. The house in Foley, Ala., was purchased in November 2005 for $137,500. The value dropped below the mortgage debt when the housing crisis hit in 2007, putting Mr. Dezember underwater for a decade, at one point by nearly $70,000. Meggan Haller for The Wall Street Journal Housing collapse \nWhen I bought the house, I was a newlywed three years out of college, believing I had achieved a signature goal of most young Americans. Instead, I set myself up to pursue an inverted version of the American dream. Most young people aspire to buy their first home. I spent a decade trying to get rid of mine. \nTen years ago, the worst economic disaster since the Great Depression roared to life. The collapse of the U.S. housing market wiped out some $11 trillion in household wealth. \nAlmost eight million people would lose their homes to foreclosure. At its depths, more than 12 million Americans were “underwater,” meaning their homes were worth less than the balances remaining on their mortgages. \nThe collapse was particularly brutal on Alabama’s Gulf Coast, which was in the midst of an anything-goes building boom when prices crashed. The region fell into a deep funk prolonged by the Deepwater Horizon oil spill and the opioid epidemic. In Audubon Place, my subdivision of starter homes, close to a third of its 109 houses were foreclosed. One of them twice. \nAmong underwater homeowners, I was fortunate. The house, and the mortgage, were modest. I was in the early stages of my career, with greater earnings potential ahead. And I was single again, not yet 30 and had no children to support. \nMillions of homeowners moored to underwater properties had it worse, suffering in ways more subtle than those who lost houses. Many of these homeowners couldn’t relocate for better jobs, move growing families into bigger houses or enroll their children in better schools—or at least do so without draining savings. They probably couldn’t refinance their homes to take advantage of interest rates that were kept historically low in response to the collapse. \nThen, early last year, my situation began to brighten . For years I had been renting the house at a loss to help cover expenses while waiting for the market to rebound. Every so often I’d scan local listings and sales data to see how far I had to climb. Performing this routine one day last February, I saw a rental ad for a nearly identical house down the street listed for much less than what I was charging. \nMy tenants saw the ad, too. They asked the company that managed both rentals if they could break their lease with me to move to the cheaper place. \nTo most landlords this would have been a bad break. But in my upside-down situation, it was great news. \nHome prices in the subdivision had not fully recovered from the crash, but they had crept higher. Meanwhile, years of mortgage payments had worn down the balance of my debt. \nNow that it was empty, a Realtor in Alabama with whom I had been consulting for several months said that if I fixed up the house and listed it in the spring, when buyers were out and the yard was in bloom, I might be able to get $115,000 for it. That was $22,500 less than I’d paid, but it would be enough to wipe out the mortgage debt and cover most of the sale expenses. \nIn late March I took a week off work, packed a rental car with tools and a sleeping bag and headed south. Speculation \nWhen I was looking for my first home, many Americans were thinking about houses in a new way—less as shelter and more as investments. \nThis prompted huge price increases, speculation and harried construction. Few places embraced the frenzy as enthusiastically as the Gulf Coast, a region known both derisively and romantically as the Redneck Riviera. \nHurricane Ivan’s direct hit in 2004 had cleared land along the shore for new development. Insurance money poured in and zoning laws were rewritten. The next year, Hurricane Katrina kicked up demand for housing when it wiped out entire towns in neighboring Mississippi and Louisiana. \nOceanfront condominium projects that were little more than watercolor renderings and building permits sold out in minutes. Investors got their hands on paper condos for as little as a letter of credit from their bank, and flipped the units to others while the glassy towers went up. A local real-estate agency ran late-night commercials touting riches to be made flipping. Hurricane Ivan in 2004 cleared land along the Gulf of Mexico shore, including in Orange Beach, Ala., above, that was snapped up in a building boom. Justin Sullivan/Getty Images \nEveryone made money in the condo game—the developer, the lenders, the brokers and as many as a half-dozen flippers on a single unit, who could trade with almost no money down before the building was finished and the sale had to be closed. The only requirement was the existence of someone else willing to pay a higher price. \nOne group of developers proposed a residential building overlooking a swim-with-the-dolphins attraction that would be the centerpiece of a giant go-kart facility. Another group hired a band and set up a dance floor in a furniture store parking lot to pitch $450,000 lots in the woods along a man-made shipping channel. \nConstruction created plenty of overtime for anyone with a strong back. Clerks quit jobs at the outlet mall to become real-estate agents and mortgage brokers. Monthly house payments were suddenly within reach for many low-wage workers. \nMy job at the Mobile Register, where I covered the boom, could not have been going better. My 1,000-square-foot cottage was shaping up nicely, too. I installed French doors that swung open to a backyard planted with azaleas and several saplings. I spruced up the front with oleander and ferns in a bed lined with decorative stones. \nThe marriage was another story. After two years, in the summer of 2007, my college sweetheart and I split up and agreed to sell the house as part of our divorce. \nUnfortunately, the market had unraveled before our marriage. New worries \nHousing had turned from a source of profits and jubilation on Wall Street to one of worry. \nThat June in New York, as home prices began to fall and mortgage delinquencies rose, about a dozen anxious creditors gathered at a Park Avenue office tower to meet with executives from Bear Stearns. Of particular concern was the faltering performance of two of the bank’s hedge funds, which had bet more than $20 billion on mortgages granted to home buyers with poor credit. \nFor decades, the steady growth of U.S. home prices had attracted investors from all over the world to securities known as collateralized debt obligations, or CDOs, which pooled large numbers of individual mortgages into single securities. If borrowers paid their bills, investors made money. \nAs demand surged during the housing boom of the 2000s, mortgage underwriters began to cut corners. Borrowers with sketchy, or subprime, credit were lured with low teaser rates that ballooned over time. Some were approved without anyone verifying their income. These loans were folded into securities that were given ratings on par with those assigned to U.S. government bonds. \nInvestment firms also sold credit default swaps, which were essentially insurance against losses in CDOs, as well as synthetic CDOs used to bet on the performance of actual CDOs. As a result, a single ill-advised mortgage might play a role in the performance of dozens of securities. Former Treasury Secretary Timothy Geithner once said sorting it out was as tough as untangling “cooked spaghetti.” \nIn all, the trillions of dollars invested in securities backed by subprime mortgages represented a bet on U.S. housing that was considerably higher than the value of the actual property involved. \nA timeline of the crisis prepared by the Federal Reserve Bank of St. Louis points to Feb. 27, 2007, as an early sign of the brewing calamity, when the Federal Home Loan Mortgage Corp. announced it would no longer buy the riskiest type of subprime mortgages. \nFor me, the first hint was the smell of hot garbage wafting over the hedge. It was coming from the house next door. The young couple who owned it were gone. They paid $153,000 for their house around the same time we’d bought ours, setting a new high-water mark in Audubon Place. Now it was as if they had vanished. There was no note, no for-sale sign. They hadn’t even bothered to take out the trash. Inside, a half-eaten pizza festered on a countertop. \nAs the abandoned pool in their backyard filled with roof shingles and palm fronds, I prepared to sell our house. To cover sales commissions and other expenses, we’d have to sell it for more than we’d paid for it. \nThe Realtor who had sold it to us didn’t think it was even worth the trouble to try. Instead, I turned to a co-worker’s wife who had just become a real-estate agent and was eager for a listing. On Nov. 19, 2007, we listed the house for $149,000 with the understanding we’d accept much less. \nShe hosted open houses, pounded arrows into the subdivision’s entrance to point the way and tied balloons to the yard sign. She baked cookies and wrote her mother’s name in a guest book so that it would not be empty for the first arrival. \nHer foray into real estate was as ill-timed as ours. Not even the cookies got a nibble. After a few fruitless months she moved on. I stuck a for-sale-by-owner sign in the yard, hoping for a quick rebound. ‘Perfect storm’ \nAs 2008 began, a full-blown crisis was unfolding in New York. Big banks rang in the New Year by reporting tens of billions of dollars in mortgage-related losses. \nBear Stearns, near bankruptcy, fell into the arms of JPMorgan Chase & Co. in March. Five months later, the U.S. Treasury took over Fannie Mae and Freddie Mac and the more than $5 trillion in mortgages they held or had guaranteed. Lehman Brothers Holdings, the country’s oldest investment bank, filed for bankruptcy protection a week later, and Merrill Lynch was forced to sell itself to Bank of America Corp. \nThe U.S. government bailed out American International Group , which had sold about $79 billion of protection against losses from mortgage-related securities without putting nearly enough cash aside to cover the obligations. Citigroup Inc. had to be bailed out later. \nThe Federal Reserve chopped interest rates to try to slow the bleeding, but it was no use. Foreclosures swelled as droves of underwater homeowners walked away. \nIn April 2009, early in his first term, President Barack Obama said a “perfect storm of irresponsibility and poor decision-making that stretched from Wall Street to Washington to Main Street” had brought a “day of reckoning.” \nOn the Gulf Coast, condo buyers balked and home prices plummeted. Subdivision developers disappeared and cranes idled at surfside towers. Jobs vanished. It was a bonanza for bankruptcy lawyers. \nA pivot from go-karts to water park couldn’t save the swim-with-the-dolphins condo project, and the men who wanted to build a town center along the Intracoastal Waterway were bankrupted by their own misadventures in condo flipping. The woman who promised flipping riches on TV was convicted of fraud in federal court and sent to prison. Developers of Bama Bayou in Orange Beach, which was to include a residential building overlooking a swim-with-the-dolphins attraction, defaulted in 2009. Jeff and Meggan Haller/Keyhole P for The Wall Street Journal \nIn my neighborhood, luxury cars were repossessed, foreclosures piled up and opioids moved in. \nTo save money, my newspaper, the Mobile Register, shuttered the small office I’d been assigned to and told me to work from home. The front bedroom of my house, where I set up shop, offered a prime view of the neighborhood going to seed. \nSome mornings when I fetched the newspaper from the driveway, I was greeted by neighbors who were already drinking beer. A young woman who was renting next door lost custody of her children and began shuffling in her pajamas to a party house down the street. Sometimes I wouldn’t see her for days. I tossed wadded-up slices of bread over the fence for the dog she left tied up in a dusty corner of the yard. \nShe came home once when I was spraying a hose over the fence to fill the dog’s empty bowl. She said nothing and walked inside. \nAnother neighbor died from a drug overdose. Her corpse was wheeled out of the house as the afternoon school bus pulled up. On another occasion, the police arrived at a suspected drug den down the street to investigate the death of an 11-month-old boy. \nOne afternoon, I had to interrupt a phone interview that I was conducting to chase two fighting men from my front yard. They were flinging decorative stones from the flower bed at each other while they argued over a soured sale of pain pills. \nAfter I shooed them away, one of the combatants slunk back and rang my doorbell to beg for a ride home. His buddy had peeled away after an old woman who lived at the house where the fracas began shot out the truck’s windshield. \nOn a Friday morning in early June 2010, I walked outside to grab the newspaper and noticed an acrid smell. I looked over the hedge, hoping to find someone tarring the roof on the abandoned house next door. Nobody was there. \nThe odor, I soon learned, was emanating from the Gulf of Mexico, 6 miles to the south, where huge rafts of toxic goop from BP PLC’s Deepwater Horizon oil spill weeks earlier had begun to splash ashore. \nBy July, all 32 miles of beach between Mobile Bay and the Florida Panhandle had been fouled, and tourism ground to a halt. Oil from the Deepwater Horizon disaster washed ashore in Orange Beach in the summer of 2010. Kari Goodnough/Bloomberg via Getty Images \nWaiters, hotel clerks and beach attendants lost their jobs. The for-hire fishing crews who normally chased cobia and red snapper resorted to scouting for crude as part of the cleanup effort. Shrimp boats dragged oil-absorbent boom through the water instead of nets. \nThe Register, already battling competition from online advertising, suffered, too. As it laid off co-workers and slashed salaries, I started looking for a new job. Home prices continued to fall. Distressed sales \nSelling the house wasn’t an option. \nThough Washington policy makers had bailed out banks to keep them lending, pushed interest rates to historic lows and initiated programs for borrowers in danger of losing their homes, there weren’t many options for someone in my situation, which was getting worse with each new foreclosure on Audubon Drive. \nBy the summer of 2010, there had been 17, including the one that had been abandoned next door. A unit of Citigroup held the mortgage when it soured, and the New York bank bought the property from itself on the courthouse steps in February for $80,100. By October, the home had become the possession of Freddie Mac, which unloaded it to an Indiana woman for $44,900. \nDistressed sales, such as courthouse auctions, don’t factor into appraisals . I wish they did. Instead, it was the second, even lower sales, that set the value of my home. \nA September appraisal of my house came back at $76,000, down about a third from two years earlier. \nWhen I landed a job with the Journal in Houston, my only option was to rent the house until the market improved. \nDetermined to lower the payments, I drove to the bank where I had taken out the mortgage five years earlier and asked for the banker who had made my loan. I was told he no longer worked there and was handed a 1-800 number. I spoke to one call-center worker after another, spending hours on hold, restarting the conversation with each transfer or disconnection. There was a comical amount of faxed correspondence. \nThe lawyers, real-estate agents and mortgage brokers I consulted shook their heads. A few bank employees told me, candidly, to skip a payment or two and feign distress to draw the bank to the negotiating table. I tried that once. Almost immediately, I was inundated with threatening calls. \nRenting the house presented another obstacle. Though my ex-wife hadn’t been involved with the property for years, her name remained on the deed. To enroll it in a rental program with a local property manager, I needed her signature, which she declined to give, for a variety of reasons. \nIn order to move on with my life, I had to do something absurd. To rent out my house, I had to buy it from us, repaying the existing mortgage to sever her ties to the property. \nI drained my recession-battered 401(k) to pay closing costs and make up the difference between what I owed and the $122,500 that the bank was willing to lend me anew. Because the new price was still higher than the property’s appraised value, part of the loan was at 10.05%, closer to a credit-card rate. That made the prospect of breaking even more unlikely, but I had no choice if I wanted to move on in my career. Plus, I’d already moved to Texas. \nSo began my turn as a reluctant and wildly unprofitable landlord. Problem renters \nMy first tenant was a single mother with a young son. She paid $650 a month, which covered about half my monthly expenses. She agreed to keep up the yard with the mower I left behind. \nBefore long, the rent checks stopped coming. She invited relatives to move in, and they refused to leave. I hesitated to evict them around the holidays, hoping that her ability—or perhaps willingness—to pay rent might change in the New Year. It did not. \nOn a lark, I checked the county jail’s booking website. There I saw my tenant, in a fresh mug shot. She and her family left only after I filed eviction paperwork and they learned that sheriff’s deputies would be by to see them out. \nAnother renter asked permission to break her lease to take a better job out of state. Knowing what it was like to be trapped, I agreed to let her go. When she moved out, she took the microwave, washer and dryer and just about everything else that wasn’t nailed down. She even swiped the smoke detectors, which were hard-wired to the house and out-of-reach without the ladder. She took that, too. \nBut I was able to nudge the rent higher with each new tenant. Over time, a respite from major hurricanes reduced my insurance premium, and the property tax bill dwindled with the value of the property, which county assessor’s appraised in 2011 at less than $60,000. In good months, my losses could be less than $300. When rent went unpaid or costly repairs popped up, my losses could have a comma. \nFrom afar I could only imagine what was going on in Alabama. The few clues I received painted a grim picture. \nThere was the jail mug shot. A curious line item on a repair invoice following that first tenant’s particularly destructive tenure read: “pressure washed garage floor due to fish odor.” Citations from the neighborhood homeowners association alerted me to mysterious piles of vegetation piled out front and a big boat that had been parked in the driveway. \nIn one letter to homeowners, the association threatened to close the communal playground because of the used condoms, lighters and graffiti turning up. Another called for volunteers to help repair a breach in the perimeter fence that residents of a nearby trailer park were using as a shortcut to the dollar store. \n“What trailer park?” I wondered. “What dollar store?” Investors pounce \nThe housing collapse wasn’t bad for everyone. Several of my friends bought their first homes on the cheap. \nIn 2011, when the national inventory of foreclosures swelled to nearly 1.6 million, Wall Street investors pounced, snapping up tens of thousands of homes at rock-bottom prices. Some paid banks a pittance to acquire batches of nonperforming loans. \nThe roughly $40 billion that institutional investors spent on foreclosed homes was concentrated in a few of the country’s hardest hit areas, including Atlanta, Miami and Phoenix, supporting prices in those markets. Unfortunately for me, these investors weren’t buying in south Alabama. Vacationers have returned to Orange Beach, shown in June. Ty Wright/Bloomberg via Getty Images \nToward the end of 2011, the Journal moved me to New York to write about Wall Street financiers. In that role I spoke in late 2013 with Stephen Schwarzman, co-founder and chief executive of Blackstone Group LP, about his firm’s huge bet on rental houses. Following the foreclosure crisis, Blackstone spent some $10 billion buying and renovating about 50,000 properties. \nAt a private dinner the firm hosted with reporters at Manhattan’s Smith & Wollensky steakhouse, I joked with Mr. Schwarzman about being a tiny competitor of his. He made the bull case for owning rental homes. \nThen he leaned over, pointed at the ceiling and said, “Don’t sell your house.” \n“Steve,” I thought, “that won’t be a problem.” \nA few months later, I opened a letter and learned that county tax assessors had valued my property at $52,200, less than half what I owed the bank, and less than half what my insurance company deemed the house to be worth. \nSeven years after the U.S. housing market collapsed, at a time when millions of others had put the economic calamity behind them, I was still stuck. The house I owned would be twice as valuable on fire than on the market. Fresh paint \nI pulled up to the house in the early morning hours of April 1, 2017, for the first time since 2010. I was spent from the 20-hour drive from New York, but pleasantly surprised by what I saw. \nThe house was in better shape than I had expected, though it had changed enough that it no longer felt entirely mine. The front door was painted the same slate blue, but the first room beyond it was a new yellowy white. Small trees and shrubs I’d planted, which couldn’t have walked off by themselves, had gone, roots and all. \nOn the bright side, two cypress saplings the size of pencils when I planted them a decade earlier had grown some 30 feet. \nFor three days and nights I painted, planted bushes and repaired leaky faucets. I made so many trips to Lowe’s for mulch and electrical outlets that one of the cashiers expressed interest in renting the place if I couldn’t sell it. I rattled the windows with music as I worked and slept a few hours each night in sleeping bag on the floor of my old bedroom. \nAudubon Place had perked up since 2010. Older couples seeking bargain retirement homes near the beach had moved in and tidied up several of the neighborhood’s problem properties. The trash-filled pool next door had been filled in and sodded over. \nHints of seedy days remained. As I dragged my tenants’ abandoned possessions to the curb, a neighbor came by and asked if my renters had left anything good behind. There were Halloween decorations, art supplies, a couple of baby photos, trade school brochures, a Nintendo and a few dirty movies, I told him. \n“Any pills?” my neighbor asked. \nIn the conversation that followed I learned that my house had been a place to score painkillers. \nBefore I’d finished working, my Realtor called to say he’d received an offer. It was a lowball bid from an out-of-towner. I turned it down, but the quick interest bode well. \nAs I packed up my tools and prepared for the drive home to New York, I walked around back and took in the yard as the sun set. Despite all the trouble the house had caused, there were things I would miss about the place. The backyard of Mr. Dezember’s former home last spring. Ryan Dezember/The Wall Street Journal \nI spent much of the ride back making calculations in my head. What is the lowest offer I could accept? How long could I afford to leave it vacant and on the market? If it didn’t sell soon, I’d have to rent it again, postponing escape for at least another year. The deal closes \nWithin a week, a retired couple from Minnesota agreed to pay $112,000. They waived an inspection and my Realtor volunteered to cut his commission to help make the deal happen. \nThe appraisal hit the mark, no termites turned up and the deal closed in May. \nFrom the original purchase in 2005 to last year’s sale, I lost $25,500. My losses as a landlord? At least $35,000. Whatever the sum, it no longer mattered. I was free. \nAt a staff meeting last summer, my editors at the Journal put out a call for stories to commemorate the 10th anniversary of the housing crash. One colleague pitched a story about young Wall Street types who viewed the crisis as a historical event. Such a story would have never occurred to me. As far as I was concerned, the housing crisis had ended just a few weeks earlier. \nAbout 2.5 million American homes are still worth less than their mortgage debt, according to estimates by CoreLogic . That is about double what it should be in an otherwise healthy market, said Frank Nothaft, CoreLogic’s chief economist. \nThose of us who have emerged from underwater missed the chance to buy low . Home prices in many markets now exceed their 2006 peaks. \nInvestors such as Mr. Schwarzman who amassed thousands of houses to rent have bet more than $40 billion wagering that the crisis was so traumatic for people like me, and so destructive to our finances, that we’ll be renters forever. They may be right. \nAt a wedding I attended recently, I met a real-estate broker who touted the riches to be made by buying units in the glassy residential towers popping up along the waterfront in Brooklyn, where I live. No matter how slapdash the construction, she said, prices have only one direction to go. \nI had sunglasses on. She didn’t see me rolling my eyes. Popular Homes Based on your last search Editors' Picks ", "external_links": [], "published": "2018-01-27T00:04:00.000+02:00", "crawled": "2018-01-27T00:05:16.000+02:00", "highlightTitle": ""}