{"organizations": [], "uuid": "21cbb8d1553fbfcfdfbeb2c57873ca4cb18f2158", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-peoples-united-financial-reports-fourth-quarter-net-income-of-106-point-2-million-or-0-point-30-per-common-share-operating.html", "country": "US", "domain_rank": 767, "title": "People's United Financial Reports Fourth Quarter Net Income of $106.2 Million, or $0.30 Per Common Share; Operating Earnings of $0.31 Per Common Share", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T00:01:00.000+02:00", "replies_count": 0, "uuid": "21cbb8d1553fbfcfdfbeb2c57873ca4cb18f2158"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-peoples-united-financial-reports-fourth-quarter-net-income-of-106-point-2-million-or-0-point-30-per-common-share-operating.html", "ord_in_thread": 0, "title": "People's United Financial Reports Fourth Quarter Net Income of $106.2 Million, or $0.30 Per Common Share; Operating Earnings of $0.31 Per Common Share", "locations": [], "entities": {"persons": [], "locations": [{"name": "conn.", "sentiment": "none"}, {"name": "bridgeport", "sentiment": "none"}], "organizations": [{"name": "people's united financial, inc.", "sentiment": "neutral"}, {"name": "people's united financial", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BRIDGEPORT, Conn., People's United Financial, Inc. (NASDAQ: PBCT) today reported net income of $106.2 million, or $0.30 per common share, for the fourth quarter of 2017, compared to $75.9 million, or $0.24 per common share, for the fourth quarter of 2016, and $90.8 million, or $0.26 per common share, for the third quarter of 2017. For the year ended December 31, 2017, net income totaled $337.2 million, or $0.97 per common share, compared to $281.0 million, or $0.92 per common share, for 2016.\nIncluded in both the fourth quarter and full year 2017 results were the following items, which are deemed non-operating, given their non-recurring nature: merger-related expenses; security losses incurred as a tax planning strategy in response to tax reform; and a tax benefit realized in connection with tax reform. The comparable periods in the prior year included merger-related expenses and acquisition integration costs.\nOperating earnings were $104.5 million, or $0.31 per common share, for the fourth quarter of 2017, compared to $75.1 million, or $0.24 per common share, for the fourth quarter of 2016, and $89.3 million, or $0.26 per common share, for the third quarter of 2017. For the year ended December 31, 2017, operating earnings totaled $345.8 million, or $1.04 per common share, compared to $282.3 million, or $0.93 per common share, for 2016.\nThe Company's Board of Directors declared a $0.1725 per common share quarterly dividend payable February 15, 2018 to shareholders of record on February 1, 2018. Based on the closing stock price on January 17, 2018, the dividend yield on People's United Financial common stock is 3.5 percent.\n\"The Company's performance in 2017 demonstrated our commitment to enhancing profitability and building the business for the long-term,\" commented Jack Barnes, President and Chief Executive Officer. \"Full year operating earnings of $345.8 million is the highest in the bank's 175 year history, while operating earnings per common share of $1.04 increased for the eighth consecutive year. Period-end loan and deposit balances were $32.6 billion and $33.1 billion, respectively, up 10 percent and 11 percent from a year ago. These results reflect the hard work of our employees who successfully closed and integrated two acquisitions during the year and delivered continued organic growth across the franchise.\"\nBarnes concluded, \"We are excited by the opportunities in front of us to further strengthen and grow the Company. In the year ahead, we will continue to enhance technology and marketing capabilities to better serve existing relationships and develop new ones. We will also provide new and refreshed products as well as align technology-based offerings with our expert bankers to drive a unique client experience. We are confident revenue producing investments along with synergies created by recent acquisitions will result in continued improvement in operating leverage and further create value for shareholders in 2018 and beyond.\"\n\"We closed out 2017 with another quarter of strong financial performance,\" stated David Rosato, Senior Executive Vice President and Chief Financial Officer. \"Record quarterly operating earnings of $104.5 million increased 17 percent on a linked-quarter basis and generated an operating return on average tangible common equity of 14.1 percent. These results benefited from further improvement in net interest margin, higher fee income and well-controlled expenses. The quarter was also favorably impacted by a lower effective tax rate primarily due to continued investment in tax preferenced items as well as a tax benefit realized as a result of recently enacted tax reform.\"\nRosato concluded, \"Linked-quarter loan growth continued to highlight the importance of our diversified business mix. Period-end loan growth was driven by strong results across each of our equipment financing units and solid production in middle market commercial and industrial lending. These increases were partially offset by lower commercial real estate balances primarily due to market conditions and continued runoff of the transactional portion of our New York multifamily portfolio. Period-end deposits were up from the end of the third quarter reflecting higher demand deposits as well as a successful CD offering celebrating the Company's 175 th anniversary. On an average balance basis, loans and deposits increased four percent and ten percent annualized, respectively.\"\nNet loan charge-offs as a percentage of average total loans on an annualized basis were 0.08 percent in the fourth quarter of 2017, an increase from 0.06 percent in both the third quarter of 2017 and fourth quarter of 2016. For the originated loan portfolio, non-performing loans equaled 0.49 percent of loans at December 31, 2017, an improvement from both 0.59 percent at September 30, 2017 and 0.51 percent at December 31, 2016.\nReturn on average assets of 0.96 percent for the fourth quarter of 2017 was an increase from both 0.84 percent in the third quarter of 2017 and 0.75 percent in the fourth quarter of 2016. Return on average tangible common equity of 13.8 percent for the fourth quarter of 2017 was an increase from both 11.8 percent in the third quarter of 2017 and 10.7 percent in the fourth quarter of 2016.\nAt December 31, 2017, People's United Financial's common equity tier 1 capital and total risk-based capital ratios were 9.7 percent and 12.2 percent, respectively, and the tangible common equity ratio stood at 7.2 percent. For People's United Bank, N.A., the common equity tier 1 capital and total risk-based capital ratios were 10.7 percent and 12.6 percent, respectively, at December 31, 2017.\nPeople's United Financial, Inc., a diversified financial services company with $44 billion in total assets, provides commercial and retail banking, as well as wealth management services through a network of approximately 400 branches in Connecticut, New York, Massachusetts, Vermont, New Hampshire and Maine.\n4Q 2017 Financial Highlights\nSummary\nNet income totaled $106.2 million, or $0.30 per common share. Net income available to common shareholders totaled $102.7 million. Operating earnings totaled $104.5 million, or $0.31 per common share (see Non-GAAP Financial Measures and Reconciliation to GAAP). Net interest income totaled $292.3 million in 4Q17 compared to $284.6 million in 3Q17. Net interest margin increased three basis points from 3Q17 to 3.07% reflecting: Higher yields on the loan portfolio (increase of six basis points). Higher yields on the securities portfolio (increase of one basis point). Higher rates on deposits (decrease of four basis points). Provision for loan losses totaled $7.5 million. Net loan charge-offs totaled $6.5 million. Net loan charge-off ratio of 0.08% in 4Q17. Non-interest income totaled $87.3 million in 4Q17 compared to $89.3 million in 3Q17. Customer interest rate swap income increased $3.3 million. Commercial banking lending fees increased $1.8 million. Insurance revenue decreased $2.8 million, reflecting the seasonality of commercial insurance renewals. Bank service charges decreased $0.6 million. Net security losses of $9.8 million in 4Q17 include losses totaling $10.0 million incurred as a tax planning strategy in response to tax reform (see Non-GAAP Financial Measures and Reconciliation to GAAP). At December 31, 2017, assets under administration, which are ", "external_links": ["http://www.prnewswire.com/news-releases/peoples-united-financial-reports-fourth-quarter-net-income-of-1062-million-or-030-per-common-share-operating-earnings-of-031-per-common-share-300584683.html", "http://www.peoples.com/"], "published": "2018-01-19T00:01:00.000+02:00", "crawled": "2018-01-19T01:02:41.000+02:00", "highlightTitle": ""}