{"organizations": [], "uuid": "5a5113c592857d5c99497bf03b50cdbf1f9c9251", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/10/waymocastle-26.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/30/fiat-chrysler-waymo-self-driving-minivans/", "country": "US", "domain_rank": 1196, "title": "Fiat Chrysler to Produce Thousands of Self-Driving Minivans | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.908, "site_type": "news", "published": "2018-01-30T02:02:00.000+02:00", "replies_count": 0, "uuid": "5a5113c592857d5c99497bf03b50cdbf1f9c9251"}, "author": "Kirsten Korosec", "url": "http://fortune.com/2018/01/30/fiat-chrysler-waymo-self-driving-minivans/", "ord_in_thread": 0, "title": "Fiat Chrysler to Produce Thousands of Self-Driving Minivans | Fortune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Kirsten Korosec 12:02 AM EST \nFiat Chrysler Automobiles (fcau) will supply Waymo with “thousands” of modified Chrysler Pacifica Hybrid minivans as the former self-driving project that spun out to become a business under Google ‘s parent company Alphabet (goog) prepares to launch a self-driving taxi service. \nFCA will begin delivering the vehicles equipped with Waymo’s suite of self-driving hardware and software in late 2018. Waymo will use these new self-driving minivans to expand testing in multiple cities. Waymo didn’t say what “thousands” means or list what cities it would bring its self-driving minivans to. Waymo has tested its technology in 25 cities across the U.S. The company started testing the self-driving minivans in Atlanta earlier this month. Waymo is also testing on public roads in Austin, Texas, Kirkland, Wash., Mountain View, Calif., and Phoenix, Ariz. \nThe increase in self-driving minivans signals a deepening relationship between FCA and Waymo. It also shows Waymo’s progress—or at least its plans to—from research and development to a commercial enterprise. \nThe companies announced in May 2016 a collaboration to produce about 100 Chrysler Pacifica Hybrid minivans integrated with Waymo’s self-driving system. The tech company and FCA worked closely to design the minivans to easily accommodate Google’s self-driving systems, including sensors and computers. \nWaymo took the wraps off its autonomous Chrysler Pacifica Hybrid minivans in December 2016. FCA delivered another 500 self-driving Pacifica Hybrid minivans to Waymo in 2017. \n“In order to move quickly and efficiently in autonomy, it is essential to partner with like-minded technology leaders,” FCA CEO Sergio Marchionne said in a statement. “Our partnership with Waymo continues to grow and strengthen; this represents the latest sign of our commitment to this technology.” \nAbout 100 of the company’s self-driving Chrysler Pacifica minivans are now driving around Chandler, a suburb of Phoenix, without a human test driver. Waymo has been testing the self-driving Chrysler Pacifica minivans on public roads in Chandler since 2016. But the vehicles have always had a human test driver behind the wheel. The area will expand and eventually cover a large portion of the sprawling metropolis of Phoenix, about 600 square miles. \nWaymo is set to open its autonomous ride-hailing service to the public beginning in Phoenix this year. The first users will be part of Waymo’s early rider program, which launched in April in the Phoenix area. Until now, “early riders” who have hailed their self-driving minivan using an app have always had a human test driver in the vehicle. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-30T02:02:00.000+02:00", "crawled": "2018-01-30T07:15:08.005+02:00", "highlightTitle": ""}