{"organizations": [], "uuid": "fc648a9054b70b8d7933c4aec81270760da1968c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220730640&w=1200&r=LYNXMPEE09087", "site_section": "http://feeds.reuters.com/reuters/sportsNews\r", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-tennis-ausopen-russians/tennis-rublev-leading-the-russian-advance-into-melbourne-idUSKBN1EZ0D3", "country": "US", "domain_rank": 408, "title": "Tennis: Rublev leading the Russian advance into Melbourne", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T07:11:00.000+02:00", "replies_count": 0, "uuid": "fc648a9054b70b8d7933c4aec81270760da1968c"}, "author": "", "url": "https://www.reuters.com/article/us-tennis-ausopen-russians/tennis-rublev-leading-the-russian-advance-into-melbourne-idUSKBN1EZ0D3", "ord_in_thread": 0, "title": "Tennis: Rublev leading the Russian advance into Melbourne", "locations": [], "entities": {"persons": [{"name": "rublev", "sentiment": "negative"}, {"name": "martyn herman", "sentiment": "negative"}, {"name": "vera zvonareva", "sentiment": "none"}, {"name": "safin", "sentiment": "none"}, {"name": "dinara safina", "sentiment": "none"}, {"name": "maria sharapova", "sentiment": "none"}, {"name": "svetlana kuznetsova", "sentiment": "none"}, {"name": "marat safin", "sentiment": "none"}, {"name": "nikolay davydenko", "sentiment": "none"}, {"name": "andrey rublev", "sentiment": "none"}, {"name": "daniil medvedev", "sentiment": "none"}, {"name": "mikhail youzhny", "sentiment": "none"}, {"name": "karen khachanov", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "milan", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "atp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 13 AM / in 8 minutes Tennis: Rublev leading the Russian advance into Melbourne Martyn Herman 4 Min Read \n(Reuters) - “Sound the alarm! The Russians are coming” sounds like Cold War paranoia but when applied to the world of men’s tennis it might be worth sitting up and taking notice. \nSince Marat Safin won the Australian Open in 2005 no Russian man has reached a grand slam final and only Nikolay Davydenko and still active Mikhail Youzhny have come close. \nIt has been a different story in the women’s game during that period with Maria Sharapova and Svetlana Kuznetsova winning slams and Vera Zvonareva and Safin’s sister, former world number one, Dinara Safina reaching finals. \nWomen’s bragging rights might be coming to an end though. \nIn young firebrands Andrey Rublev, Karen Khachanov and Daniil Medvedev, Russia has a fearless trio of players all aged 21 or under who are determined to set the record straight. \nThey all played at the ATP’s NextGen Finals in Milan in November where Rublev reached the final. \nLast week the 20-year-old began his season in style to reach the Qatar Open final which pushed him to a career-high 32 in the rankings and a seeded position at next week’s Australian Open. \nKhachanov is not far behind at 48 while the mercurial Medvedev, who stunned three-times grand slam champion Stan Wawrinka at Wimbledon last year, has been slightly later developing and is ranked at 84. \nThe pugnacious Rublev, coached by Fernando Vicente, looks the best bet for a strong run in Melbourne where last year he was taught a lesson by Britain’s then world number one Andy Murray, gathering only five games. \nHis game has caught fire since and former world number one Mats Wilander is watching his progress with interest. \n“I think he is going to have a breakthrough in terms of rankings because mentally he is there, he is consistent, even though the way he plays is kind of inconsistent because he hits the ball so damn hard,” Wilander, who will present his daily Game, Set and Mats feature for Eurosport in Melbourne, told Reuters in an interview. \n“He fights so hard. I don’t know whether it will be top 10 or has a great slam like he did at the U.S. Open where he got to the quarter-finals. That’s his mindset now, winning slams, especially when you’ve reached a quarter-final.” BEEF UP \nRublev admitted after losing to South Korea’s Hyeon Chung in the NextGen final that he needed to beef up his physique and his work in the off-season with Vicente and Galo Blanco in Barcelona already looks to have paid dividends. \n“This time of my life, my career is the most important as I lay the foundations for a strong future,” he said in Doha. “In working with Fernando and Galo in Barcelona during the off-season, we worked on problems and weaknesses.” \nThe big-hitting Khachanov also trains in Barcelona and he and Rublev are firm friends, while Medvedev took a different path having taken up the sport seriously at a later age. \nMedvedev, 21, says the presence of a bunch of players of the same age is a motivating factor, as is the prospect of emulating the charismatic former world number one Safin. \n“It’s a big contest for us,” Medvedev, who has trained in the south of France since the age of 18, told Reuters. \n”We want to climb the rankings as a group, but at the same time each one of us wants to be the first in Russia. \n“Marat was an idol of mine, especially the way he crashed the rackets, and I hope that one of us can make half of what he did in tennis.” \nThe Russian revolution spreads further too, when considering that Germany’s rising star Alexander Zverev, now ranked fourth in the world, has Russian parentage and Canadian 18-year-old sensation Denis Shapovalov’s family also hail originally from the country, moving to Israel in the 1990s. Reporting by Martyn Herman; Editing by Toby Davis", "external_links": [], "published": "2018-01-10T07:11:00.000+02:00", "crawled": "2018-01-10T07:23:23.007+02:00", "highlightTitle": ""}