{"organizations": [], "uuid": "9a19f781f180c3173fc356d0ea7175b0ee889e0a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews/", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-health-bloodvessels-bikram-yoga/bikram-yoga-doesnt-need-hot-room-to-benefit-heart-health-idUKKBN1FK2Q3", "country": "US", "domain_rank": 408, "title": "Bikram yoga doesn’t need hot room to benefit heart health", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T20:17:00.000+02:00", "replies_count": 0, "uuid": "9a19f781f180c3173fc356d0ea7175b0ee889e0a"}, "author": "", "url": "https://uk.reuters.com/article/us-health-bloodvessels-bikram-yoga/bikram-yoga-doesnt-need-hot-room-to-benefit-heart-health-idUKKBN1FK2Q3", "ord_in_thread": 0, "title": "Bikram yoga doesn’t need hot room to benefit heart health", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 6:21 PM / Updated 29 minutes ago Bikram yoga doesn’t need hot room to benefit heart health Lisa Rapaport 5 Min Read \n(Reuters Health) - Bikram yoga, a series of 26 poses typically done in a sweat-inducingly hot room, may not need to be practiced at steam-bath temperatures to help improve blood vessel health, a small experiment suggests. \nMillions of people worldwide practice Bikram yoga, typically in 90-minute sessions that involve breathing exercises and holding poses for up to one minute or longer in a humid studio heated to around 105 degrees Fahrenheit (40.5 degrees Celsius). Previous research has linked Bikram yoga to improvements in the elasticity of blood vessels, which can help lower blood pressure and reduce the potential for arteries to harden and cause heart attacks. \nFor the current study, researchers randomly assigned 52 middle-aged adults who were sedentary but otherwise healthy to remain inactive or to do three Bikram yoga classes a week for three months, either in a hot studio or a normal, 73-degree (23-degree C) room. \nBy the end of the experiment, people in both yoga groups experienced similar improvements in blood vessel flexibility. But there were no meaningful changes for people who remained sedentary. \n“Given previous research showing some improvements in heart disease risk factors with sauna therapy, we thought that the heated environment in Bikram yoga might have augmented the changes in vascular health and possibly other outcomes as well,” said lead study author Stacy Hunter, a researcher at Texas State University in San Marcos. \n“We were certainly surprised to find no additional effect of the heat,” Hunter said by email. \nSome people are drawn to Bikram yoga because they think sweating in a hot room during their practice may help them lose weight and improve strength and flexibility, and some previous research suggests they may be on to something. It’s not for everyone, however, and it can cause dangerous side effects like severe dizziness and dehydration. \nPeople with a variety of health conditions that might make it unwise to spend 90 minutes in an extremely hot room were excluded from the study, including pregnant women and individuals with a history of heart or lung problems. \nWhen they joined the experiment, people had been generally sedentary, getting moderate-intensity physical activity less than two days a week. \nAlthough the Bikram yoga program appeared to benefit blood vessels equally when it was done with added heat or without, the researchers did find that only the hot-yoga group experienced statistically meaningful decreases in body fat measurements, and notable declines in LDL (“bad”) cholesterol. \nOne limitation of the study is that researchers only used one test of blood vessel health known as brachial artery flow-mediated dilation, and additional tests might provide a more complete picture of any changes associated with yoga, the authors note. \nBecause the study only focused on Bikram yoga, and didn’t include other forms of yoga or other exercises, it’s also not clear whether the blood vessel changes in the study might be limited to Bikram yoga or occur with other activities, said David Shannahoff-Khalsa of the Center for Integrative Medicine at the University of California, San Diego. \n“We do not know if walking alone or playing for the same amount of time would lead to the same result,” Shannahoff-Khalsa, who wasn’t involved in the study, said by email. \nThere isn’t a clear rationale for why practicing physically demanding yoga exercises in a heated room would be beneficial for the heart, said Holger Cramer of the department of internal and integrative medicine at Kliniken Essen-Mitte and the University of Duisburg-Essen in Germany. \n“Yoga, especially yogic breathing and meditation exercises, can positively influence our nervous system, reduce the stress reaction and balance certain stress-associated mediators in the brain,” Cramer, who wasn’t involved in the study, said by email. “This stress-reducing effect most likely is the active part in yoga’s effects on heart health, and there is no reason why this should be increased by increased heat.” \nSOURCE: bit.ly/2EsuBQI Experimental Physiology, online January 18, 2018.", "external_links": [], "published": "2018-01-31T20:17:00.000+02:00", "crawled": "2018-01-31T20:34:37.006+02:00", "highlightTitle": ""}