{"organizations": [], "uuid": "fcb6f5968c6aba171e3f5914556eea560c932506", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/15/104653949-IMG_6625a.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/24/us-firms-will-now-focus-on-stock-buybacks-after-tax-cuts-david-rubenstein-says.html", "country": "US", "domain_rank": 767, "title": "US firms will now focus on stock buybacks after tax cuts, David Rubenstein says", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T08:24:00.000+02:00", "replies_count": 0, "uuid": "fcb6f5968c6aba171e3f5914556eea560c932506"}, "author": "Natasha Turak", "url": "https://www.cnbc.com/2018/01/24/us-firms-will-now-focus-on-stock-buybacks-after-tax-cuts-david-rubenstein-says.html", "ord_in_thread": 0, "title": "US firms will now focus on stock buybacks after tax cuts, David Rubenstein says", "locations": [], "entities": {"persons": [{"name": "david rubenstein", "sentiment": "negative"}, {"name": "rubenstein", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}], "organizations": [{"name": "world economic forum", "sentiment": "none"}, {"name": "carlyle group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Updated 8 Hours Ago CNBC.com \"It appears right now what companies are going to do is provide bigger dividends, they're going to do stock buybacks, make more acquisitions, and I think the amount of cash in the U.S. will probably inflate the economy a bit,\" Rubenstein said. Buybacks happen when firms buy their own shares trading on the stock exchange, reducing the portion of shares in the hands of investors. Cameron Costa | CNBC David Rubenstein \nCompanies are likely to focus on bolstering their capital in the wake of massive U.S. tax cuts, although making accurate predictions on their effects is impossible, according to Carlyle Group co-founder David Rubenstein, who spoke during a panel at the World Economic Forum in Davos. \n\"We really don't know what the impacts are going to be, but it appears right now what companies are going to do is provide bigger dividends, they're going to do stock buybacks, make more acquisitions, and I think the amount of cash in the U.S. will probably inflate the economy a bit,\" Rubenstein told guests at Davos during a panel entitled \"The Next Financial Crisis\" on Tuesday. \nBuybacks happen when firms buy their own shares trading on the stock exchange, reducing the portion of shares in the hands of investors. They offer a way to return cash to shareholders — along with dividends — and usually coincide with a company's stock pushing higher as shares get scarcer. \nThe billionaire private equity investor and philanthropist emphasized the difficulty of knowing how benefits from the corporate tax windfall would manifest themselves over time. \n\"What people don't realize is that when we have these tax cuts in the United States, they're based on 10-year projections of what revenues or costs are going be, so we really don't know.\" \nOther multinational executives have echoed similar projections, with Bank of America chief Brian Moynihan telling investors last week that the \"largest portion\" of tax savings would \"flow to the bottom line through dividends and share buybacks.\" The trend would appear to contradict Republican claims that its tax package, the biggest tax overhaul in three decades, was targeted at strengthening the middle class. Check out the world leaders and celebrities who are at Davos this year CNBC takes a look at some of the top names scheduled to return to the snowy mountains of Davos, Switzerland next week. \nAsked if he believed in trickle-down economics, Rubenstein refrained from volunteering his views on the theory, replying, \"I do not want to say I believe in trickle-down economics. I do believe that when you have a tax cut of this amount, and much of it goes to the middle class as well, it will have some beneficial effects — I don't think it's only a trickle down effect.\" \nThe comments essentially delegitimize both Republican and Democratic party claims that the Tax Cuts and Jobs Act, which was passed in late December and slashes corporate tax rates from 35 percent to 21 percent, would either be a boon to the American middle class or would harm it. Supporters of the bill claim it will boost middle class wages by an average of $4,000 annually, while its detractors argue it will exacerbate income inequality and balloon the national deficit. \n\"I don't want to make it sound like the middle class is going to be the principle beneficiary (of the tax cuts),\" Rubenstein said later, speaking to CNBC after the panel. \n\"I think the middle class will get some benefits, but it's too early to know. Because when you have a massive tax bill like this, you're making projections that you don't actually know what the impact is gonna be. So nobody really knows.\" Click to show more \nData is a real-time snapshot *Data is delayed at least 15 minutesGlobal Business and Financial News, Stock Quotes, and Market Data and Analysis \nData also provided by ", "external_links": [], "published": "2018-01-24T08:24:00.000+02:00", "crawled": "2018-01-24T07:33:29.000+02:00", "highlightTitle": ""}