{"organizations": [], "uuid": "a25d0c3b3c1000a2f6ed94e1b5c86f2f6a8dfc76", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-the-medivir-board-is-seeking-issue-authorizations-to-increase-the-companys-funding-flexibility-and-calls-for-an-extraordinary.html", "country": "US", "domain_rank": 767, "title": "The Medivir Board is Seeking Issue Authorizations to Increase the Company's Funding Flexibility and Calls for an Extraordinary General Meeting", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T10:33:00.000+02:00", "replies_count": 0, "uuid": "a25d0c3b3c1000a2f6ed94e1b5c86f2f6a8dfc76"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-the-medivir-board-is-seeking-issue-authorizations-to-increase-the-companys-funding-flexibility-and-calls-for-an-extraordinary.html", "ord_in_thread": 0, "title": "The Medivir Board is Seeking Issue Authorizations to Increase the Company's Funding Flexibility and Calls for an Extraordinary General Meeting", "locations": [], "entities": {"persons": [{"name": "christer sahlberg", "sentiment": "none"}, {"name": "nils gunnar johansson", "sentiment": "none"}, {"name": "bengt julander", "sentiment": "none"}, {"name": "bo öberg", "sentiment": "none"}, {"name": "medivir", "sentiment": "none"}], "locations": [{"name": "stockholm", "sentiment": "none"}, {"name": "medivir", "sentiment": "none"}], "organizations": [{"name": "company", "sentiment": "neutral"}, {"name": "medivir board", "sentiment": "neutral"}, {"name": "medivir ab", "sentiment": "neutral"}, {"name": "medivir", "sentiment": "none"}, {"name": "linc ab", "sentiment": "none"}, {"name": "board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "STOCKHOLM, Jan. 02, 2018 /PRNewswire/ --\nMedivir AB (publ) (\"Medivir\" or the \"Company\") (Nasdaq Stockholm: MVIR) today announces a notice for an Extraordinary General Meeting, to be held on 26 January 2018, with a proposal for the Meeting to authorize the Board of Directors to resolve on a directed share issue of not more than 20 percent of the number of shares of series B. In addition, the Board of Directors proposes that the Meeting resolves to authorize the Board of Directors to issue new shares of series B with pre-emptive rights for the Company's shareholders.\nThe holders of Medivir's series A shares, i.e. Bo Öberg, Nils Gunnar Johansson and Christer Sahlberg, as well as Nordea funds and Linc AB (Bengt Julander), together holding approximately 16 percent of the number of shares in Medivir, with approximately 31 percent of the votes, have notified Medivir that they are positive to the Board of Directors' proposals and that they will vote in favor of the proposals at the Extraordinary General Meeting. The holders of Medivir's series A shares have also, as communicated in a separate press release today, declared that they will convert their series A shares in Medivir to series B shares as soon as possible following the Extraordinary General Meeting.\nMedivir has during recent months met several, Scandinavian and international, existing shareholders and potential new investors that have shown interest in the Company, its projects and future opportunities. The Board of Directors has not resolved on utilizing the proposed authorizations, but would, pursuant to the ongoing evaluation of Medivir's capital structure and possible funding options, and in order to advance more rapidly the development of the Company's clinical portfolio, wish to further increase its flexibility and possibility to pass such issue resolutions if conditions are deemed favorable.\nThe Board of Directors proposes that the Extraordinary General Meeting authorizes the Board to resolve to issue new shares of series B with deviation from the shareholders' pre-emptive rights. The total number of shares that may be issued under the authorization shall total not more than 20 percent of the number of shares of series B issued as per the date of the Meeting. In addition, the Board of Directors proposes that the Extraordinary General Meeting authorizes the Board to issue new shares of series B with pre-emptive rights for the Company's shareholders.\nIssuances of new shares under the authorizations shall be made on market terms and conditions. The authorizations replace the authorization granted by the Annual General Meeting 2017.\nThe Extraordinary General Meeting will be held on 26 January 2018. Further information is available in the separate notice.\nThis is information that Medivir AB is obliged to make public pursuant to the EU Market Abuse Regulation. The information was submitted for publication, through the agency of the contact persons set out above, at 8.15 CET on 2 January 2018.\nAbout Medivir\nMedivir is a research-based pharmaceutical company with a focus on oncology. We have a leading competence within protease inhibitor design and nucleotide/nucleoside science and we are dedicated to develop innovative pharmaceuticals that meet great unmet medical needs. Medivir is listed on the Nasdaq Stockholm Mid Cap List.\nFor further information, please contact:\nChristine Lind\nCEO Medivir AB\nphone: +46 (0) 8-5468-3100\nAnders Lundin\nCFO Medivir AB\nphone: +46 (0)73-125-1453\nThis information was brought to you by Cision http://news.cision.com\nhttp://news.cision.com/medivir/r/the-medivir-board-is-seeking-issue-authorizations-to-increase-the-company-s-funding-flexibility-and-,c2424133\nThe following files are available for download:\nhttp://mb.cision.com/Main/652/2424133/773146.pdf\nPress release (PDF)\nView original content: http://www.prnewswire.com/news-releases/the-medivir-board-is-seeking-issue-authorizations-to-increase-the-companys-funding-flexibility-and-calls-for-an-extraordinary-general-meeting-300576323.html\nSOURCE Medivir", "external_links": ["http://mb.cision.com/Main/652/2424133/773146.pdf", "http://news.cision.com/", "http://www.prnewswire.com/news-releases/the-medivir-board-is-seeking-issue-authorizations-to-increase-the-companys-funding-flexibility-and-calls-for-an-extraordinary-general-meeting-300576323.html", "http://news.cision.com/medivir/r/the-medivir-board-is-seeking-issue-authorizations-to-increase-the-company-s-funding-flexibility-and-,c2424133"], "published": "2018-01-02T10:33:00.000+02:00", "crawled": "2018-01-02T10:55:58.002+02:00", "highlightTitle": ""}