{"organizations": [], "uuid": "5153575514461e2f8d33622d41c0c9b7bcb70a44", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218785909&w=1200&r=LYNXMPEE010DD", "site_section": "https://www.reuters.com/breakingviews", "section_title": "Breakingviews | Reuters", "url": "https://www.reuters.com/article/us-italy-election-breakingviews/breakingviews-italy-will-go-back-to-its-old-ways-in-2018-idUSKBN1ER0Q5", "country": "US", "domain_rank": 408, "title": "Italy will go back to its old ways in 2018", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T19:03:00.000+02:00", "replies_count": 0, "uuid": "5153575514461e2f8d33622d41c0c9b7bcb70a44"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-italy-election-breakingviews/breakingviews-italy-will-go-back-to-its-old-ways-in-2018-idUSKBN1ER0Q5", "ord_in_thread": 0, "title": "Italy will go back to its old ways in 2018", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MILAN It’s a sunny spring day and Italians are waking up to a new legislature. None of the country’s political parties has won enough seats in the previous day’s election to safely control parliament, yet each claims victory. The anti-establishment 5-Star Movement earned the largest number of votes, Silvio Berlusconi’s Forza Italia and its Northern League ally form the biggest political group, while the centre-left Democratic Party secured the most parliamentary seats. A flawed electoral law means a coalition - a regular feature of Italian politics - seems inevitable.\nThis is the imagined scenario the euro zone’s third-largest economy could face in early 2018. As of late December, polls suggested each of the three main political groupings will attract between 24 percent and 35 percent of the vote. The risk is that gridlock tips Italy back into its old bad habits.\nThe new government’s economic inheritance is positive. Growth is at its highest rate since 2010, exports and manufacturing activity are rising and the number of Italians in work is back at pre-crisis levels. Italian banks appear to have escaped a financial meltdown, despite being saddled with around 175 billion euros of bad loans.\nPrevious prime ministers have pushed through some reforms. Mario Monti overhauled pensions in 2011 while Matteo Renzi overcame a long-held taboo by partly liberalising labour laws. The insolvency code has also been simplified. However, Italy is still grappling with hefty debt and a byzantine administrative system.\nNone of the key political parties is offering solutions to lower the country’s public debt, which at 132 percent of GDP is the highest in the European Union after Greece. Pre-electoral promises could make the problem worse: 5-Star leader Luigi Di Maio wants to introduce a universal basic income, while Berlusconi is offering to raise the minimum pension to 1,000 euros a month. Renzi’s Democratic Party and the Northern League are promising tax cuts.\nThe parties are also skirting Italy’s dysfunctional bureaucracy and complex legal system - the biggest hurdle to luring capital. While well-run cities like Milan are attracting investment and high-value employees, the south struggles with unacceptably high levels of unemployment, poverty and crime.\nThe worry is that Italians disillusioned by their current political class turn away from elections. Turnout for national polls is falling towards 70 percent, from close to 90 percent 25 years ago. In recent regional elections in Sicily, less than half of the voters cast a ballot. If that trend is replicated on a national scale, apathy could be the election’s unwelcome winner.\n ", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-02T19:03:00.000+02:00", "crawled": "2018-01-02T18:20:29.013+02:00", "highlightTitle": ""}