{"organizations": [], "uuid": "2410e34e45cf08e1f3c4d33dc42cf67c5cd8e511", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/business-wire-teridion-inc-announces-manav-mishra-as-vice-president-product-management-to-drive-next-phase-of-product-innovation-growth.html", "country": "US", "domain_rank": 767, "title": "Teridion Inc Announces Manav Mishra as Vice President, Product Management to Drive Next Phase of Product Innovation & Growth", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.029, "site_type": "news", "published": "2018-01-25T19:00:00.000+02:00", "replies_count": 0, "uuid": "2410e34e45cf08e1f3c4d33dc42cf67c5cd8e511"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/business-wire-teridion-inc-announces-manav-mishra-as-vice-president-product-management-to-drive-next-phase-of-product-innovation-growth.html", "ord_in_thread": 0, "title": "Teridion Inc Announces Manav Mishra as Vice President, Product Management to Drive Next Phase of Product Innovation & Growth", "locations": [], "entities": {"persons": [{"name": "manav mishra", "sentiment": "negative"}, {"name": "mishra", "sentiment": "none"}, {"name": "manav", "sentiment": "none"}, {"name": "saar gillai", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "teridion", "sentiment": "none"}], "organizations": [{"name": "teridion inc", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO--(BUSINESS WIRE)-- Teridion, a leader in cloud networking, today announced the appointment of Manav Mishra as Vice President of Product Management. Mishra will define and expand Teridion’s product portfolio, leveraging its unique technology to expand into new market segments. Teridion’s dynamic network fabric service leverages the surface area of public cloud providers around the world to accelerate internet performance, enabling SaaS providers to offer a great user experience anywhere on the globe.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180125005355/en/\nTeridion VP Product Management Manav Mishra (Photo: Business Wire)\n“We are very excited to welcome a world-class product leader of Manav’s caliber and experience to the team,\" says Saar Gillai, CEO of Teridion. \"Manav is an accomplished product management executive with a proven track record of defining and delivering large-scale enterprise cloud services and platforms. As Teridion enters a new stage of growth, Manav’s leadership will be instrumental in driving innovation while expanding our portfolio to further help our customers.”\n“SaaS providers are seeking ways to provide a consistent, high-quality experience to their users around the world,” Mishra says. “Teridion’s dynamic network fabric accelerates internet performance to deliver a great user experience anywhere on the globe. In addition, Teridion’s dynamic fabric can be extended to provide additional network services in the future. I am excited to join Teridion and look forward to driving our product direction and portfolio expansion.”\nMishra brings 20 years of experience in key product, business and technical leadership roles with top-tier, innovative companies. Prior to joining Teridion, he was Vice President, Product Management at HPE, where he defined and launched Helion Stackato, a container-based application platform for developing and deploying microservices and cloud native apps for devops and grew the business for the Helion Cloud Portfolio. Previous to HPE, he led product and engineering teams that delivered key cloud platforms and services at Google, Microsoft and Intel. Mishra has also authored several international publications and is an inventor on several patents.\nAbout Teridion\nTeridion empowers SaaS and content providers to deliver a user experience uncompromised by internet congestion without additional infrastructure. Teridion combines machine learning with its dynamic network fabric, which leverages the surface area of any public cloud provider around the world to enable SaaS providers to improve their users’ application experience. Teridion’s zero-capex service delivers high-performance, agility and security that SaaS providers demand.\nTeridion is backed by leading venture investors including Jerusalem Venture Partners, Magma Venture Partners and Singtel Innov8 and is relied on by Atlassian, Box, Merrill Corp., Egnyte and many other SaaS providers.\nFor more information, see teridion.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180125005355/en/\nfor Teridion\nLaurie Kretchmar, 650-274-8497\nlaurie@contentmarketingplace.com\nSource: Teridion", "external_links": ["http://www.businesswire.com/news/home/20180125005355/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.teridion.com&esheet=51748657&newsitemid=20180125005355&lan=en-US&anchor=teridion.com&index=1&md5=7e6eb6e69e72f58dd2c392f9d13bbfc1"], "published": "2018-01-25T19:00:00.000+02:00", "crawled": "2018-01-25T20:54:02.012+02:00", "highlightTitle": ""}