{"organizations": [], "uuid": "8cd40c39014cf3996ecfa3470d915b664cec3442", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223020553&w=1200&r=LYNXMPEE0H0YM", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/us-morgan-stanley-results/morgan-stanley-quarterly-profit-tanks-adjusted-profit-beats-view-idUKKBN1F71LR", "country": "US", "domain_rank": 408, "title": "Morgan Stanley quarterly profit tanks; adjusted profit beats view", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T14:32:00.000+02:00", "replies_count": 0, "uuid": "8cd40c39014cf3996ecfa3470d915b664cec3442"}, "author": "", "url": "https://uk.reuters.com/article/us-morgan-stanley-results/morgan-stanley-quarterly-profit-tanks-adjusted-profit-beats-view-idUKKBN1F71LR", "ord_in_thread": 0, "title": "Morgan Stanley quarterly profit tanks; adjusted profit beats view", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "morgan stanley", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 12:40 PM / Updated 10 minutes ago Morgan Stanley's wealth management business helps bank top estimates Reuters Staff 3 Min Read \n(Reuters) - Morgan Stanley’s ( MS.N ) quarterly profit dropped almost 60 percent on a provision related to the new U.S. tax law, but adjusted profit beat analyst expectations as strength in wealth management offset a drop in trading revenue. \nCharges taken for the tax overhaul have crimped results for most big Wall Street banks. Morgan Stanley’s one-time $1.2 billion tax provision, however, was the smallest. \n“Most of Morgan Stanley’s tax hit came from deferred tax assets, which decline in value when corporate tax rates decline,” Chief Financial Officer Jonathan Pruzan said in an interview on Thursday. \nPruzan called the fourth-quarter results strong, despite ongoing issues with trading. “It was a really challenging environment this year, particularly for the macro business, given rates and volatility,” he said. \nShares of the sixth-largest U.S. bank rose nearly 2 percent to $56.40 in pre-market trade. \nJPMorgan ( JPM.N ) took a 37 percent hit to quarterly profit due to a $2.4 billion charge related to the tax law, while Citigroup ( C.N ) flagged a $19 billion write-down, and posted a $18-billion quarterly loss on Tuesday. \nMorgan Stanley earnings fell to $686 million or 29 cents per share in the fourth quarter ended Dec. 31, from $1.67 billion or 81 cents per share, last year. \nExcluding the one-off charge and other items, adjusted profit was $1.68 billion, or 84 cents per share. Analysts on average were looking for 77 cents per share, according to Thomson Reuters I/B/E/S. \nRevenue from investment banking, which included advising on M&A and equity and fixed income underwriting, rose 12.4 percent to $1.55 billion, while wealth management rose 10.5 percent. \nTrading revenue, which is traditionally Morgan Stanley’s biggest source of income, fell 19.5 percent to $2.25 billion. \nGoldman Sachs’ ( GS.N ) earnings were also hurt by a big drop in fixed income, currency and commodity revenue as historically low market volatility rattled the struggling unit. \nBanks like Citigroup, Bank of America ( BAC.N ) and Morgan Stanley have been increasingly turning to wealth management, and targeting the rich and ultra-rich, to offset market volatility affecting their bottomlines. \n”We enter 2018 with strong momentum aided by rising interest rates, tax reform and an evolving regulatory framework,” Chief Executive Officer James Gorman said. \nReturn on equity for the full year was 9.4 percent, excluding the impact of the tax provision. \nGorman had set an ROE target of 9 percent to 11 percent last year. \nWealth management pre-tax margin of 26 percent exceeded his 23 percent to 25 percent target. \nTotal revenue rose to $9.50 billion from $9.02 billion. Analysts were looking for $9.20 billion. Reporting By Aparajita Saxena in Bengaluru; Editing by Bernard Orr", "external_links": [], "published": "2018-01-18T14:32:00.000+02:00", "crawled": "2018-01-18T14:47:48.000+02:00", "highlightTitle": ""}