{"organizations": [], "uuid": "9c8c317641ab7fc4692d6bad2e5213dfb23695ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/business-wire-aspect-software-launches-aspect-viaa-reseller-program-appoints-david-herzog-as-svp-worldwide-partners.html", "country": "US", "domain_rank": 767, "title": "Aspect Software Launches Aspect Via™ Reseller Program, Appoints David Herzog as SVP Worldwide Partners", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.161, "site_type": "news", "published": "2018-01-09T16:00:00.000+02:00", "replies_count": 0, "uuid": "9c8c317641ab7fc4692d6bad2e5213dfb23695ea"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/business-wire-aspect-software-launches-aspect-viaa-reseller-program-appoints-david-herzog-as-svp-worldwide-partners.html", "ord_in_thread": 0, "title": "Aspect Software Launches Aspect Via™ Reseller Program, Appoints David Herzog as SVP Worldwide Partners", "locations": [], "entities": {"persons": [{"name": "david herzog", "sentiment": "negative"}, {"name": "asp", "sentiment": "negative"}, {"name": "herzog", "sentiment": "none"}], "locations": [{"name": "phoenix", "sentiment": "none"}], "organizations": [{"name": "svp worldwide partners aspect via™ reseller program", "sentiment": "neutral"}, {"name": "svp of worldwide partners", "sentiment": "none"}, {"name": "worldwide partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Aspect Via™ Reseller Program will give new and existing channel partners the opportunity to sell Aspect’s complete Customer Engagement Platform in the cloud David Herzog has been appointed SVP of Worldwide Partners and will head up all channel partner initiatives\nPHOENIX--(BUSINESS WIRE)-- Aspect Software , a leading provider of native customer engagement, workforce management, and self-service solutions, today announced their first formal channel partner program for their customer engagement platform, Aspect Via™, as well as the appointment of David Herzog to Senior Vice President, Worldwide Partners. Previously, Herzog held the position of Senior Vice President of Cloud at Aspect Software. In his new role, he will be tasked with growing indirect sales, accelerating channel/business alliance partner growth, and nurturing a global partner ecosystem.\n“Aspect Via™ has been incredibly well received by both our customers and the industry so we are excited to officially offer the solution to our channel partners who are critical to Aspect’s success. We’re confident the Aspect Via™ Reseller Program will not only provide our partners with the resources they need to be successful but take our entire channel program to the next level,” said David Herzog, SVP of Worldwide Partners. “Our goal is to build a community of partners who not only enhance their product offerings by including Aspect Via™ but also increase their customer satisfaction and ultimately their bottom line.”\nThose who qualify for the Aspect Via Reseller Program can offer their customers Aspect’s one-of-a-kind customer engagement platform that covers all the customer service bases while taking full advantage of Amazon Web Service (AWS) cloud services and infrastructure. Aspect Via™ eliminates the costs of maintaining traditional, loosely integrated contact center point solutions for call center, self-service/IVR and workforce management needs. Through the channel program, partners will be certified to resell and support Aspect Via™ and Aspect Software will provide the highest level of support, training, and sales enablement to its partners to get partners off to a fast start that leads to long-term success.\n“Strategic partnerships with companies like Aspect Software are critical to the success of our business and to our customer’s businesses,” said John Marino, CEO of Waterfield Technologies. “This partnership has enabled us to offer our customers an award-winning customer engagement solution that not only benefits them but also their customers. As a leading enterprise software and professional services firm for mobile solutions, we feel adding Aspect Via to our portfolio will give us a competitive edge.”\nThe Aspect Via™ Reseller Program will be offered in two different service levels, Tier 1 and Tier 1 Plus and will be available in North America, Europe, and Australia with plans for future expansion later this year. Qualified partners will receive solution support, training, and financial benefits.\nLearn more about Aspect Via™ . For more information on the Aspect Via™ Reseller Program, email ChannelProgramOffice@aspect.com .\nAbout Aspect\nAspect helps enterprises break down the walls between people, processes, systems and data sources, allowing organizations to unite around the customer journey. By developing fully native interaction management, workforce optimization and self-service capabilities within a single customer engagement center, we enable dynamic, conversational interactions and create a truly frictionless omni-channel customer experience. Leveraging a worldwide cloud infrastructure and over 40 years of industry ingenuity, Aspect conveniently and easily connects questions to answers while helping enterprises keep service levels high and operational costs contained. For more information, visit www.aspect.com .\nFollow Aspect on Twitter at @AspectSoftware . Read our blogs at http://blogs.aspect.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180109005961/en/\nAspect Software\nTim Dreyer\n+1 630 227 8312\ntim.dreyer@aspect.com\nSource: Aspect Software", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.aspect.com%2Fsolutions%2Fcustomer-engagement-platform%2Fcustomer-engagement-center-software-aspect-via&esheet=51738339&newsitemid=20180109005961&lan=en-US&anchor=Aspect+Via%E2%84%A2&index=1&md5=54d717bd28d53fcb5f1761dcbaae25c6", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2Faspectsoftware&esheet=51738339&newsitemid=20180109005961&lan=en-US&anchor=%40AspectSoftware&index=3&md5=1becf61cbe62b3a0a859a29c12592694", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fblogs.aspect.com%2F&esheet=51738339&newsitemid=20180109005961&lan=en-US&anchor=http%3A%2F%2Fblogs.aspect.com&index=4&md5=861f5d3dee6c1daf3721e301a13f3149", "http://www.businesswire.com/news/home/20180109005961/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.aspect.com%2F&esheet=51738339&newsitemid=20180109005961&lan=en-US&anchor=www.aspect.com&index=2&md5=332fe8aa74cfb6cdef7eaf6bb23c9949"], "published": "2018-01-09T16:00:00.000+02:00", "crawled": "2018-01-09T17:53:54.016+02:00", "highlightTitle": ""}