{"organizations": [], "uuid": "de77429b188fa124bb528d2bc063c2077eaa6760", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222154519&w=1200&r=LYNXMPEE0E0Z0", "site_section": "http://www.reuters.com/resources/archive/us/20180115.html", "section_title": "Archive News &amp; Video for Monday, 15 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-carillion-restructuring-government/uk-government-questioned-over-carillion-contracts-after-profit-warnings-idUSKBN1F41SG", "country": "US", "domain_rank": 408, "title": "UK government questioned over Carillion contracts after profit warnings", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T22:04:00.000+02:00", "replies_count": 0, "uuid": "de77429b188fa124bb528d2bc063c2077eaa6760"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-carillion-restructuring-government/uk-government-questioned-over-carillion-contracts-after-profit-warnings-idUSKBN1F41SG", "ord_in_thread": 0, "title": "UK government questioned over Carillion contracts after profit warnings", "locations": [], "entities": {"persons": [{"name": "carillion", "sentiment": "none"}, {"name": "jon trickett", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "carillion", "sentiment": "negative"}, {"name": "labour’s cabinet office", "sentiment": "none"}, {"name": "labour and liberal democrat", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Britain’s government is under pressure to explain why ministers awarded construction company Carillion 1.3 billion pounds ($1.8 billion) of new contracts after it was known to be in financial difficulty.\nCarillion collapsed on Monday in one of Britain’s biggest corporate failures, throwing hundreds of large projects into doubt and forcing the government to step in to guarantee vital public services.\nBritain’s opposition Labour and Liberal Democrat parties called for an investigation into the government’s dealings with Carillion before the company collapsed.\nTussell, which runs a database of government contracts in Britain, estimates that Carillion was awarded government contracts worth 1.3 billion pounds after the company issued its first profit warning in July.\nJon Trickett, Labour’s Cabinet Office spokesman, questioned why the government awarded three contracts to the group last year despite it being government policy to designate a company as “high risk” if it had issued a profit warning.\nDUE DILIGENCE? “Alarm bells have been ringing for over six months about the state of Carillion’s finances, so the government must come forward and answer questions on exactly what due diligence measures were undertaken before awarding contracts to Carillion worth billions of taxpayers’ money,” Trickett said.\nThe leader of the Liberal Democrats, Vince Cable, called for a public inquiry to examine what he described as “very questionable decisions made in the past few months”.\nThe Carillion logo is seen at a building site in London, Britain January 15, 2018. REUTERS/Peter Nicholls Carillion’s collapse heaps more pressure on Prime Minister Theresa May’s shoulders as she grapples with the tortuous negotiations on Britain’s exit from the European Union and a deeply divided Conservative Party.\nOne of many private companies to run public services in Britain, Carillion had been fighting to survive after contract delays and a downturn in new business prompted profit warnings.\nThe company’s contract to help to build the new HS2 rail line in the north of England was awarded on July 17, a week after it issuing a profit warning in which it noted a deterioration in cash flows.\nThe following day, Carillion won part of a 158 million pound Ministry of Defence contract to provide catering, hotel and mess services at 233 military facilities.\nCarillion issued a second profit warning at the end of September and about five weeks later was awarded a 62 million pound rail contract.\nCabinet Office minister David Lidington defended the government’s handling of the company.\nHe told the BBC that the government continued to give contracts to Carillion because there were “rules on the type of information that you can take into account when taking those decisions”.\nThe government had been monitoring Carillion closely after the first profit warning and in most cases awarded joint venture contracts so the other company could take over the work if there were problems, said a spokesman for Prime Minister May.\n“If there are lessons that can be learned, they will be,” the spokesman said.\nReporting by Andrew MacAskill, additional reporting by Elizabeth Piper, graphic by Ritvik Carvalho,; Editing by Guy Faulconbridge and David Goodman\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T22:04:00.000+02:00", "crawled": "2018-01-16T13:22:00.002+02:00", "highlightTitle": ""}