{"organizations": [], "uuid": "2de9c8708520b4db6c17b41f5a0e77836c701f97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/12/104943877-GettyImages-904252210.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19789731/device/rss/rss.xml", "section_title": "U.S. Top News and Analysis", "url": "https://www.cnbc.com/2018/01/15/us-wants-to-cut-money-for-palestinian-refugees.html", "country": "US", "domain_rank": 767, "title": "US wants to cut money for Palestinian refugees", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T11:01:00.000+02:00", "replies_count": 0, "uuid": "2de9c8708520b4db6c17b41f5a0e77836c701f97"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/15/us-wants-to-cut-money-for-palestinian-refugees.html", "ord_in_thread": 0, "title": "US wants to cut money for Palestinian refugees", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "neutral"}, {"name": "u.n.", "sentiment": "neutral"}, {"name": "u.n. relief and works agency", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "state department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Trump administration is preparing to withhold tens of millions of dollars from the U.N. agency for Palestinian refugees, cutting the year's first contribution by more than half or perhaps entirely, and making additional donations contingent on major changes to the organization, according to U.S. officials.\nPresident Donald Trump hasn't made a final decision, but appears more likely to send only $60 million of the planned $125 million first installment to the U.N. Relief and Works Agency, said the officials, who weren't authorized to publicly discuss the matter and spoke on condition of anonymity.\nFuture contributions would require the agency, facing heavy Israeli criticism, to demonstrate significant changes in operations, they said, adding that one suggestion under consideration would require the Palestinians to first re-enter peace talks with Israel.\nThe State Department said Sunday that \"the decision is under review. There are still deliberations taking place.\" The White House did not immediately respond to questions about the matter.\nThe administration could announce its decision as early as Tuesday, the officials said. The plan to withhold some of the money is backed by Secretary of State Rex Tillerson and Defense Secretary James Mattis , who offered it as a compromise to demands for more drastic measures by U.N. Ambassador Nikki Haley, the officials said.\nshow chapters UN General Assembly votes to declare US recognition of Jerusalem as Israel's capital 'null and void' 4:05 PM ET Thu, 21 Dec 2017 | 01:09 Haley wants a complete cutoff in U.S. money until the Palestinians resume peace talks with Israel that have been frozen for years. But Tillerson, Mattis and others say ending all assistance would exacerbate instability in the Mideast, notably in Jordan, a host to hundreds of thousands of Palestinian refugees and a crucial U.S. strategic partner.\nIn another sign of the growing tensions in the region, Palestinian President Mahmoud Abbas railed at Trump in a fiery, two-hour-long speech on Sunday, saying \"shame on you\" for his treatment of the Palestinians and warning that he would have no problem rejecting what he suggested would be an unacceptable peace plan. The speech by Abbas ratcheted up what has been more than a month of harsh rhetoric toward Trump since the president's recognition of Jerusalem as Israel's capital\nThe U.S. is the Relief and Works Agency's largest donor, supplying nearly 30 percent of its total budget. The agency focuses on providing health care, education and social services to Palestinians in the West Bank, Gaza Strip, Jordan, Syria and Lebanon.\nHundreds of thousands of Palestinians either fled or were forced from their homes during the war that led to Israel's establishment in 1948. Today, there are an estimated 5 million refugees and their descendants, mostly scattered across the region.\nEliminating or sharply reducing the U.S. contribution could hamstring the agency and severely curtail its work, putting great pressure on Jordan and Lebanon as well as the Palestinian Authority. Gaza would be particularly hard hit. Some officials, including Israelis, warn that it might push people closer to the militant Hamas movement, which controls Gaza.\nshow chapters Trump recognizing Jerusalem as Israel's capital was ill-advised: Gates 7:49 AM ET Tue, 12 Dec 2017 | 03:06 The U.S. officials said any reduction in American assistance could be accompanied by calls for European nations and others to help make up the shortfall.\nThe U.S. donated $355 million in 2016 and was set to make a similar contribution this year; the first installment was to have sent this month.\nBut after a highly critical Jan. 2 tweet from Trump on aid to the Palestinians, the State Department opted to wait for a formal policy decision before sending any of the $125 million.\nTrump's tweet expressed frustration over the lack of progress in his attempts to broker peace between Israel and the Palestinians, and he pointed the finger at the Palestinians. \"We pay the Palestinians HUNDREDS OF MILLIONS OF DOLLARS a year and get no appreciation or respect,\" he said. \"But with the Palestinians no longer willing to talk peace, why should we make any of these massive future payments to them?\"\nAlthough Trump referred to all U.S. assistance to the Palestinians, the contribution to the refugee agency would be the first to be affected.\nThree days after the tweet, at a Jan. 5 White House meeting, senior national security officials try to find a way forward. Led by representatives from the State Department and Pentagon, all but one of the members of the \"Policy Coordination Committee\" agreed to continue the funding, officials said.\nThe lone holdout was Haley's representative, who insisted that Trump's tweet had set the policy and the money must be cut off, the officials said.\nThe meeting ended in a stalemate.\nshow chapters President Trump: Jerusalem is Israel's capital 3:39 PM ET Wed, 6 Dec 2017 | 11:23 Israeli Prime Minister Benjamin Netanyahu then weighed in, telling his Cabinet that he agreed with the critique of the agency. He said the agency only perpetuates problems and should cease operating in the region. Netanyahu and other Israelis accuse it of contributing to Palestinian militancy and allowing its facilities to be used by militants. They have also complained that some of its staff are biased against Israel.\nNetanyahu suggested transferring the agency's budget to the U.N. High Commissioner for Refugees, which aids refugee matters everywhere in the world. It was not immediately clear whether any withheld U.S. assistance would be shifted.\nNetanyahu's position, coupled with Haley's firm opposition to the funding, led Tillerson, with the support of Mattis, to propose the $60 million compromise, the officials said.\nTrump, whose Jerusalem decision last year upset the Palestinians along with the announcing plans to move the U.S. Embassy to the holy city, was said by one official to have expressed cautious backing of the compromise.", "external_links": [], "published": "2018-01-15T11:01:00.000+02:00", "crawled": "2018-01-15T11:34:08.032+02:00", "highlightTitle": ""}