{"organizations": [], "uuid": "a8956e199f20f48db0eab6ddf142ff191da66689", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-pakistan-killing/pakistan-police-killing-of-a-pashtun-youth-fuels-anger-over-encounters-idUKKBN1FG05C", "country": "US", "domain_rank": 408, "title": "Pakistan police killing of a Pashtun youth fuels anger over 'encounters'", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T06:58:00.000+02:00", "replies_count": 0, "uuid": "a8956e199f20f48db0eab6ddf142ff191da66689"}, "author": "", "url": "https://uk.reuters.com/article/uk-pakistan-killing/pakistan-police-killing-of-a-pashtun-youth-fuels-anger-over-encounters-idUKKBN1FG05C", "ord_in_thread": 0, "title": "Pakistan police killing of a Pashtun youth fuels anger over 'encounters'", "locations": [], "entities": {"persons": [{"name": "naqibullah mehsud", "sentiment": "none"}, {"name": "mehsud", "sentiment": "none"}, {"name": "syed raza hassan", "sentiment": "none"}, {"name": "anwar", "sentiment": "none"}, {"name": "anwar ahmed khan", "sentiment": "none"}, {"name": "muhammad khan mehsud", "sentiment": "none"}], "locations": [{"name": "pakistan", "sentiment": "none"}], "organizations": [{"name": "supreme court", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  karachi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 27, 2018 / 4:59 AM / Updated 21 minutes ago Pakistan police killing of a Pashtun youth fuels anger over 'encounters' Syed Raza Hassan 6 Min Read \nKARACHI (Reuters) - Nationwide protests at the police killing of a young ethnic Pashtun man in Pakistan’s largest city have shone a spotlight on allegations of persecution by the authorities against refugees from the country’s conflict-ridden northwest. \nThe country’s Supreme Court launched an inquiry on Jan. 19 into the death of 27-year-old aspiring fashion model Naqibullah Mehsud. He was one of four men killed six days earlier in what police initially said was a shoot-out with suspected Islamist militants. The Supreme Court plans to begin hearings on the case on Saturday. \nThe police team that killed Mehsud was under the command of senior superintendent Anwar Ahmed Khan, who has been suspended since Jan. 20 on the recommendation of a police inquiry committee. The committee was set up after Mehsud’s father, Muhammad Khan Mehsud, who denies his son had any militant links, filed a kidnapping and killing complaint against him. \nAnwar told Reuters he had done nothing wrong and said the investigation into his officers’ actions could allow the Taliban to regain a foothold in ethnic Pashtun parts of the city. \n“I had no knowledge of Naqibullah Mehsud. My staff told me that he is a militant with a criminal history,” he said. \nPolice data from 2011 reviewed by Reuters shows that in the seven years Anwar has been in charge of Karachi’s Malir district, which has a large Pashtun population, at least 450 people have been killed in 200 clashes with police that involved weapons. The data does not give details of the circumstances of the shootings. \nA senior police official, who asked not to be identified, said that the majority of those killed were ethnic Pashtuns. Pakistan’s ethnic Pashtun borderlands have been a hotbed of Islamist militancy in recent decades. MILITANT POLICY \nPakistani police refer to any armed clash with suspects as an “encounter”. Some human rights activists and families of victims have for years alleged that such incidents are often staged to cover up extrajudicial killings. \nAnwar told Reuters that armed operations to kill suspects were official police policy in Sindh Province, of which Karachi is the capital, to combat the threat from militants. \n“There was an on-going official policy ... for carrying out encounters to take out criminals and I have broken no law,” he said. \nThe provincial police chief denied there was such a policy. \n“I don’t need to respond to irresponsible allegations,” Inspector General of Sindh police Allah Dino Khawaja said in a brief text message in reply to Reuters’ questions. “He has to appear before the investigation to defend and prove his claims.” \nSindh police said in a statement on Jan. 20 it had launched an inquiry “to ascertain the facts regarding the police encounter in which Naqibullah Mehsud was killed”. \nSome campaigners among the sprawling city’s Pashtun community say the story is not unusual. But it is the first to receive nationwide attention - in part because Mehsud, known as Naqib, does not fit the image of the militant from Pakistan’s lawless northern heartlands. \n“He had a passion for wearing good clothes ... even in the picture of his body circulating on social media, he is seen wearing good clothes,” his cousin Noor Rehman told Reuters, while holding back tears. \nAnother senior police officer said no evidence linking Naqib to militancy had been found. \n“His particulars were checked in all the criminal databases of police and nothing came up,” the   condition of anonymity. \nPakistan’s chief justice on Tuesday summoned Anwar to appear for questioning at its first hearing this weekend. Earlier that day, he was not allowed to board a flight leaving Pakistan for Dubai, Pakistan’s Federal Investigation Agency said. \nAnwar told Reuters he does not plan to appear before the court. He said his children are studying in Dubai and he frequently visits. TARGET GROUP \nPashtuns are Pakistan’s second largest ethnic group, and many have moved to the country’s big cities to escape violence along the Afghan border. \nBut since the emergence of the Pakistani Taliban, whose leadership also comes from the Mehsud tribe in South Waziristan, Pashtuns who spoke to Reuters in Karachi say they are all now seen as potential militants. \n“This is not just about the fact that police are killing people, it is about racial profiling,” Jibran Nasir, a human rights lawyer who said he was filing a petition with the Senate’s human rights committee, told Reuters. \n“Naqib had a very public profile. Looking at pictures of Naqib modelling ... no one is willing to believe he had anything to do with Taliban. The problem here is not every Pashtun killed and profiled here is a model.” \nFigures posted by the Human Rights Commission of Pakistan (HRCP) on its website show 1,226   784 police encounters nationwide in the past two years. \nIn the days after Mehsud was killed, thousands of activists and Pashtun students staged protests in Karachi, Lahore, Peshawar, Islamabad and Quetta. \nIn Sohrab Goth, the majority Pashtun suburb of Karachi where Naqib’s family live, three families told Reuters they had lost relatives in such incidents. \nReuters was shown death certificates and newspaper clippings, but was not able to independently confirm the circumstances of their deaths. \nSohail Anwer Sial, home minister in the Sindh provincial government whose department is responsible for the police, said the authorities were taking action over the Mehsud case, but that one or two incidents did not mean the entire police force was corrupt. \n“The same police force ... eradicated violence from the city during Karachi operation’, which began in 2013 against militants,” he said. “One person’s actions cannot be allowed to malign the system.” Additional reporting and writing by Saad Sayeed; Editing by Alex Richardson and Bill Tarrant", "external_links": [], "published": "2018-01-27T06:58:00.000+02:00", "crawled": "2018-01-27T07:25:53.000+02:00", "highlightTitle": ""}