{"organizations": [], "uuid": "ed3c9a8f07b89b099a82fac687dcf8c59db5c4b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/global-metals/metals-nickel-retreats-from-2-1-2-year-high-on-profit-taking-deficit-underpins-idUSL8N1P634B", "country": "US", "domain_rank": 408, "title": "METALS-Nickel retreats from 2-1/2 year high on profit taking, deficit underpins", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T13:59:00.000+02:00", "replies_count": 0, "uuid": "ed3c9a8f07b89b099a82fac687dcf8c59db5c4b2"}, "author": "", "url": "https://www.reuters.com/article/global-metals/metals-nickel-retreats-from-2-1-2-year-high-on-profit-taking-deficit-underpins-idUSL8N1P634B", "ord_in_thread": 0, "title": "METALS-Nickel retreats from 2-1/2 year high on profit taking, deficit underpins", "locations": [], "entities": {"persons": [{"name": "maytaal angel", "sentiment": "none"}, {"name": "robin bhar", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "philippines", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "madagascar", "sentiment": "none"}], "organizations": [{"name": "societe generale", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "sumitomo corp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 12:00 PM / Updated 3 minutes ago METALS-Nickel retreats from 2-1/2 year high on profit taking, deficit underpins Reuters Staff \n* LME/ShFE arb: bit.ly/2wZSAEz (Recasts, updates prices, adds details, quote; changes dateline) \nBy Maytaal Angel \nLONDON, Jan 11 (Reuters) - Nickel fell on Thursday as traders took profits after pushing the metal to its highest level in 2-1/2 years the previous session, but falls were limited by concerns about dwindling stocks and production outages. \nFour nickel mines in the Philippines, a key nickel exporter, remain shut on environmental grounds, an official said, while Japan’s Sumitomo Corp suspended output at a mine in Madagascar following a cyclone. \n“There’s good demand (for nickel) from stainless and non-stainless sectors coupled with some supply tightness coming through because of mine closures in the Philippines. The market is in a deficit and that will continue,” said Robin Bhar, analyst at Societe Generale. \n“We should continue to hold in the $10,000-13,000 range with a bias on the upward path of that range,” he said. FUNDAMENTALS \n* NICKEL: Benchmark nickel on the London Metal Exchange (LME) fell 1 percent to $12,810 a tonne as of 1145 GMT, partly reversing Wednesday’s gains, when it touched $13,200 a tonne, its highest since June 2015. \n* PHILIPPINES: “The four mines in Zambales are still not allowed to resume production,” said Wilfredo Moncano, director of the Philippine Mines and Geosciences Bureau. “No extraction, no new mining activities. What’s only allowed is hauling of ores from their stockpiles.” \n* MADAGASCAR: Sumitomo said on Thursday its partner firms in Madagascar halted output at the Ambatovy nickel mine on Jan. 4, the day before Cyclone Ava hit the area. \n* NICKEL STOCKS: Deliverable nickel stocks in Shanghai Futures Exchange warehouses stood at 48,920 tonnes as of Jan. 5, compared with over 90,000 tonnes a year ago. \n* DOLLAR: The dollar rose after China’s regulator dismissed a report that the country could halt buying U.S. treasuries, boosting the greenback following its biggest one-day fall in a month. \n* COPPER: Three-month copper on the LME was down 0.1 percent at $7,162.50 a tonne. \n* SUPPLY SUSPENSIONS: Tongling Nonferrous Metals Group , one of China’s top copper smelters, will suspend production at its Jinguan Copper unit for three days from Friday. \n* INDONESIA: Indonesia hopes to finalise contract talks with Freeport McMoRan Inc over the Grasberg copper mine by June, although divestment issues remain unresolved. \n* ALUMINIUM: LME aluminium traded up 0.6 percent to $2,195 a tonne, recovering from a low of $2,149.50 on Jan 9. \n“This was a metal that you couldn’t give away 36 hours ago but now it seems the selling from the index rebalancing is viewed as very digestible,” said broker Marex Spectron. Additional reporting by Tom Daly; Editing by Edmund Blair", "external_links": [], "published": "2018-01-11T13:59:00.000+02:00", "crawled": "2018-01-11T14:11:41.003+02:00", "highlightTitle": ""}