{"organizations": [], "uuid": "21cdadccc451466e87b56e8ffe1c6a4d368b79db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/07/business-wire-nexif-energy-signs-epc-contract-for-110-mw-gas-fired-cogen-project-in-thailand.html", "country": "US", "domain_rank": 767, "title": "Nexif Energy Signs EPC Contract for 110 MW Gas-Fired Cogen Project in Thailand", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.272, "site_type": "news", "published": "2018-01-08T03:00:00.000+02:00", "replies_count": 0, "uuid": "21cdadccc451466e87b56e8ffe1c6a4d368b79db"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/07/business-wire-nexif-energy-signs-epc-contract-for-110-mw-gas-fired-cogen-project-in-thailand.html", "ord_in_thread": 0, "title": "Nexif Energy Signs EPC Contract for 110 MW Gas-Fired Cogen Project in Thailand", "locations": [], "entities": {"persons": [{"name": "ravi chandran", "sentiment": "none"}, {"name": "nexif", "sentiment": "none"}, {"name": "singh", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "thailand singapore", "sentiment": "none"}, {"name": "rayong province", "sentiment": "none"}, {"name": "nexif", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "thailand", "sentiment": "none"}], "organizations": [{"name": "cogen project", "sentiment": "negative"}, {"name": "nexif energy signs epc", "sentiment": "negative"}, {"name": "nexif energy", "sentiment": "negative"}, {"name": "standard chartered bank", "sentiment": "none"}, {"name": "electricity generation authority of thailand", "sentiment": "none"}, {"name": "egat", "sentiment": "none"}, {"name": "epc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SINGAPORE--(BUSINESS WIRE)-- Nexif Energy (Nexif), a leading independent power producer in Asia and Australia, announced that it has signed an engineering, procurement and construction (EPC) contract for its 110 megawatt (MW) cogeneration project in Thailand’s Rayong Province. Nexif acquired the project in June 2017 and is making rapid progress towards achieving financial close in the first quarter of 2018.\n“We are encouraged by the progress we are making in the development and financing of the project, our first in the country,” said Surender Singh, Founder and Co-CEO of Nexif. “We are pleased to serve our customers by providing reliable and competitive power and have the opportunity to contribute to the fast growing economy of Thailand.”\nThe project will supply electricity to the Electricity Generation Authority of Thailand (EGAT) under a 25-year power purchase agreement and provide energy to industrial customers. It will be financed by a consortium of leading lenders on a non-recourse basis with Standard Chartered Bank leading the financing effort.\nRavi Chandran, Executive Vice President (Development) at Nexif, added, “Our project is well structured, as it is underwritten by a long term PPA with creditworthy off-taker, has long term gas supply contracts with a leading gas supplier and has the ability to supply electricity and steam to industrial customers. We look forward to completing remaining permitting and financing by first quarter 2018.”\nThe turn key fixed price EPC Contract was signed with a consortium of Korean construction companies comprising Doosan Heavy Industries & Construction Co., Ltd (“Doosan”) and SC Engineering Co., Ltd (“SC Engineering”). It includes the supply and erection of a General Electric 6FA gas turbine operating in combined cycle with a Doosan DST-G20 steam turbine.\n“Nexif is excited to work with leading Korean firms Doosan and SC Engineering, both of whom have a track record for delivering similar projects on time and on budget,” said Srinivas Rao, Executive Vice President (Projects and Operations) at Nexif.\n“The entry into this project and the achievement of the EPC signing is yet another indication of Nexif Energy’s continued momentum in the Asia Pacific region since our formation in late 2015,” said Matthew Bartley, Founder and Co-CEO of Nexif Energy. “We are working hard to progress our pipeline of power generation projects throughout Vietnam, the Philippines, Bangladesh and Australia.”\nIn December 2017, Nexif was awarded a concession for an 80 MW wind farm project in Vietnam’s Ben Tre province. In addition, it achieved financial close on the first phase of its Lincoln Gap 212 MW wind farm and 10 MW battery project in Australia in November of last year. Nexif’s Coc San hydro project in Lao Cai province in Vietnam was acquired in early 2016 and achieved commercial operations the middle of that year.\nAbout Nexif Energy\nNexif Energy was formed in August 2015 by Nexif, a Singapore-based independent power management company, and Denham Capital, a leading global energy-focused private equity firm with more than US$9.0 billion of invested and committed capital across eight fund vehicles. Nexif Energy’s goal is to develop, finance, construct and opportunistically acquire conventional and renewable power generation assets across Asia and Australia.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180107005120/en/\nPierpont Communications\nSylvester Palacios, +1 512-448-4950 (Office)\nCell: +1 210-912-2706\nspalacios@piercom.com\nSource: Nexif Energy", "external_links": ["http://www.businesswire.com/news/home/20180107005120/en/"], "published": "2018-01-08T03:00:00.000+02:00", "crawled": "2018-01-08T04:26:16.004+02:00", "highlightTitle": ""}