{"organizations": [], "uuid": "7de231fb016f8852f05704ded6310abab1722d31", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-jeffrey-yin-joins-xo-group-inc-as-general-counsel.html", "country": "US", "domain_rank": 767, "title": "Jeffrey Yin Joins XO Group Inc. as General Counsel", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T16:00:00.000+02:00", "replies_count": 0, "uuid": "7de231fb016f8852f05704ded6310abab1722d31"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-jeffrey-yin-joins-xo-group-inc-as-general-counsel.html", "ord_in_thread": 0, "title": "Jeffrey Yin Joins XO Group Inc. as General Counsel", "locations": [], "entities": {"persons": [{"name": "jeffrey yin", "sentiment": "negative"}, {"name": "cou", "sentiment": "none"}, {"name": "mike steib", "sentiment": "none"}, {"name": "jeffrey", "sentiment": "none"}, {"name": "yin", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "xo group inc.", "sentiment": "negative"}, {"name": "xoxo", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "alberleen group", "sentiment": "none"}, {"name": "xo group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 2, 2018 /PRNewswire/ -- XO Group Inc. (NYSE: XOXO) today announced the appointment of Jeffrey Yin as General Counsel, reporting to CEO Mike Steib and serving on XO Group's executive team.\n\"I'm excited to welcome Jeffrey to XO Group,\" said Mike Steib, CEO of XO Group Inc. \"He's not only an expert legal adviser, but a strong, strategic business leader. His ability to apply his insights as a legal professional while keeping the business strategy top of mind will be a key asset to our executive team and company.\"\nMr. Yin brings to XO Group nearly 20 years of experience advising a diverse portfolio of businesses ranging from emerging growth startups to large public companies. As an expert in his field, he has served as lead attorney on numerous public offerings and acquisitions, and is a trusted adviser on securities law compliance and negotiating commercial and strategic transactions.\nMost recently, Mr. Yin served as the General Counsel of The Alberleen Group, a boutique investment bank and family office. He previously served as the Chief Compliance Officer and General Counsel of Medallion Financial Corp., a publicly traded specialty finance business. Mr. Yin's law firm experience includes Orrick, Herrington & Sutcliffe LLP and Brobeck, Phleger & Harrison LLP, in the business and technology groups.\n\"XO Group is a long-standing, successful public company in the midst of a value-creating transition,\" said Mr. Yin. \"I am excited to join the team and help drive the business forward as it continues its mission to serve couples planning and celebrating the most important moments of their lives.\"\nMr. Yin received a B.A. in Economics and Rhetoric from the University of California at Berkeley and a J.D. from the New York University School of Law.\nAbout XO Group Inc.\nOur mission is to help people navigate and truly enjoy life's biggest moments together. Our multiplatform brands guide couples through transformative lifestages—from getting married to moving in together and having a baby—and include The Knot (the #1 wedding planning resource), The Bump (a leading pregnancy and parenting brand), The Nest (the hip guide to all things home for new couples), and GigMasters (a leading event marketplace). The company is publicly listed on the New York Stock Exchange (XOXO) and is headquartered in New York City.\nForward-Looking Statements\nThis release may contain projections or other forward-looking statements regarding future events or our future financial performance. These statements are only predictions and reflect our current beliefs and expectations. Actual events or results may differ materially from those contained in the projections or forward-looking statements. It is routine for internal projections and expectations to change, and therefore it should be clearly understood that the internal projections and beliefs upon which we base our expectations may change. Although these expectations may change, we will not necessarily inform you if they do or update this release. Please refer to documents we file from time to time with the Securities and Exchange Commission for a discussion of the risks and other factors that could cause actual results to differ materially from the forward-looking statements contained herein. Forward-looking statements in this release are made pursuant to the safe harbor provisions contained in the Private Securities Litigation Reform Act of 1995.\nView original content with multimedia: http://www.prnewswire.com/news-releases/jeffrey-yin-joins-xo-group-inc-as-general-counsel-300576203.html\nSOURCE XO Group Inc.", "external_links": ["http://www.prnewswire.com/news-releases/jeffrey-yin-joins-xo-group-inc-as-general-counsel-300576203.html", "http://www.xogroupinc.com/"], "published": "2018-01-02T16:00:00.000+02:00", "crawled": "2018-01-02T16:21:30.001+02:00", "highlightTitle": ""}