{"organizations": [], "uuid": "6af7e6ce3e3370808a72743e84e8f3dc582b4a88", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219591013&w=1200&r=LYNXMPEE040OZ", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-france-macron-fakenews/french-opposition-twitter-users-slam-macrons-anti-fake-news-plans-idUKKBN1EU163", "country": "US", "domain_rank": 408, "title": "French opposition, Twitter users slam Macron's anti-fake-news plans", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T14:32:00.000+02:00", "replies_count": 0, "uuid": "6af7e6ce3e3370808a72743e84e8f3dc582b4a88"}, "author": "", "url": "https://uk.reuters.com/article/uk-france-macron-fakenews/french-opposition-twitter-users-slam-macrons-anti-fake-news-plans-idUKKBN1EU163", "ord_in_thread": 0, "title": "French opposition, Twitter users slam Macron's anti-fake-news plans", "locations": [], "entities": {"persons": [{"name": "macron", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "emmanuel macron", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "elysee palace", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 12:34 PM / Updated an hour ago French opposition, Twitter users slam Macron's anti-fake-news plans Reuters Staff 3 Min Read \nPARIS (Reuters) - French President Emmanuel Macron’s plans to legislate against fake news are running into opposition. French President Emmanuel Macron delivers his New Year wishes to members of the diplomatic corps at the Elysee Palace in Paris, France, January 4, 2018. REUTERS/Yoan Valat/Pool \nTwitter users have propelled “InventYourFakeNews” to a top trending topic, opposition lawmakers warn of a risk to civil liberties and experts say a law might not be the best tool. \nMacron’s announcement Wednesday was the latest attempt by a government to find ways to handle the worldwide spread of disinformation on social media -- “fake news”, as U.S. President Donald Trump calls it. \nHis plan would allow judges to block a website or a user account, in particular during an election, and oblige internet platforms to publish the names of those behind sponsored contents. That raises more questions than answers, critics said. \n“Only authoritarian regimes try to control what the truth is,” said senior conservative senator Bruno Retailleau. Freedom of expression carries risks, but that’s better “than the temptation to control minds,” he said. \nTwitter users in France made up their own fake news with the hashthag #InventeDesFakeNews (or InventYourFakeNews), which ranged from seeing corporate executives donate money to cut France’s debt load to seeing dead singers alive. Meanwhile, Macron’s opponents across the political spectrum slammed the plan. \n“Is France still a democracy if it muzzles its citizens? This is very worrying!” National Front leader Marine Le Pen said on Twitter. \nAttempts to regulate speech online walk a fine line, which critics says can amount to censorship. A similar law in Germany led authorities to briefly block a satirical magazine’s Twitter account on Wednesday after it parodied anti-Muslim comments. \nMajor internet platforms Facebook and Google declined to comment directly on Macron’s announcement, instead pointing out initiatives where they attempt to self-regulate or cooperate with local media, including in France, to track fake news. \n“Any regulation should be thought through together with the industry,” internet legislation lawyer Christelle Coslin said. She noted that an 1881 law already allows prosecution for the publication of fake information. It would be crucial, she said, to make sure that any ruling by a judge would be technically enforceable. \n“The real question is who can say what is a true or fake information?”, Coslin said. \nMacron has a solid majority in parliament and could get a bill approved without support from the opposition. \nConcern about fake news arose after accusations of Russian meddling in the U.S. presidential election in November 2016 and in last year’s French presidential election. Macron’s team complained then that his campaign was targeted by a “massive and coordinated” hacking operation. \nThe European Commission has opened a wide-ranging consultation on how to cope with fake news; its results are expected in the coming months. Reporting by Ingrid Melander; Additional reporting by Mathieu Rosemain and Douglas Busvine", "external_links": [], "published": "2018-01-05T14:32:00.000+02:00", "crawled": "2018-01-05T14:43:18.064+02:00", "highlightTitle": ""}