{"organizations": [], "uuid": "5738aa1d3481522a69a4ccfed2f8e00b7794f581", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/business-wire-express-inc-updates-outlook-for-the-fourth-quarter-and-full-year-2017-in-advance-of-the-20th-annual-icr-conference.html", "country": "US", "domain_rank": 767, "title": "Express, Inc. Updates Outlook for the Fourth Quarter and Full Year 2017 in Advance of the 20th Annual ICR Conference", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T14:45:00.000+02:00", "replies_count": 0, "uuid": "5738aa1d3481522a69a4ccfed2f8e00b7794f581"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/business-wire-express-inc-updates-outlook-for-the-fourth-quarter-and-full-year-2017-in-advance-of-the-20th-annual-icr-conference.html", "ord_in_thread": 0, "title": "Express, Inc. Updates Outlook for the Fourth Quarter and Full Year 2017 in Advance of the 20th Annual ICR Conference", "locations": [], "entities": {"persons": [{"name": "david kornberg", "sentiment": "none"}], "locations": [{"name": "columbus", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "inc", "sentiment": "neutral"}, {"name": "inc.", "sentiment": "none"}, {"name": "express, inc.", "sentiment": "none"}, {"name": "expr", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "COLUMBUS, Ohio--(BUSINESS WIRE)-- In advance of its presentation at the 20th Annual ICR Conference, Express, Inc. (NYSE: EXPR), a specialty retail apparel company, today updated its outlook for the fourth quarter and full year periods ending February 3, 2018, based on its performance during the 2017 holiday season.\nDavid Kornberg, Express, Inc.'s president and chief executive officer, commented: “The fourth quarter was off to a positive start in November and early December, however the key weeks leading up to Christmas were disappointing. Our performance during December was most challenging in our retail stores, where traffic was worse than expected. E-commerce sales quarter to date continue to trend positively, up double-digits versus last year. From a product perspective, dresses and sweaters were the primary drivers of the sales miss relative to our expectations. We have identified the product specific issues and are actively addressing them to improve future performance. On a positive note, January to date sales have stabilized, improving relative to the December trend. That said, based on our holiday performance, we are lowering our fourth quarter and full year 2017 outlook for comparable sales and EPS. While we are course correcting in some areas of the business, we are confident in our long-term initiatives and our ability to drive improved performance.\"\n2017 Guidance:\nFourth Quarter:\nComparable sales are currently expected to be in the range of -1% to -2%. The Company expects net income to be in the range of $24.5 to $26.0 million and diluted earnings per share to be in the range of $0.31 to $0.33 on 79.2 million weighted average shares outstanding.\nOn November 28, 2017, the Company's Board of Directors approved a new share repurchase program that authorized the Company to repurchase up to $150 million of the Company’s outstanding common stock using available cash. Under this authorization, the Company has repurchased 448,310 common shares for approximately $5.0 million and currently has $145 million remaining under its authorization. The Company’s updated fourth quarter guidance reflects such share repurchases, however does not contemplate any future share repurchases.\nFull Year:\nComparable sales are expected to be -4%. Net income is expected to be in the range of $14.3 to $15.8 million, or $0.18 to $0.20 per diluted share. Adjusted net income is expected to be in the range of $26.0 to $27.5 million, or $0.33 to $0.35 per diluted share on 78.9 million shares outstanding. Adjusted net income excludes approximately $24.2 million, or $11.7 million net of tax and $0.15 per share, related to the exit of Canada.\nConsistent with past practice, this guidance excludes any additional non-core operating items that may occur and also excludes the impact of any changes in tax legislation.\nThe Company expects to report fourth quarter and full year 2017 results during the week of March 12, 2018.\nICR Conference:\nThe Company will present at the 20 th Annual ICR Conference being held at the JW Marriott Orlando Grande Lakes in Orlando, Florida on Tuesday, January 9, 2018 at 4:00 p.m. Eastern Time (ET). David Kornberg, president and chief executive officer, and Perry Pericleous, senior vice president and chief financial officer, will host the presentation and Mark Rupe, vice president of investor relations, will be in attendance. The Company’s investor presentation will be posted on the Express website by 7:00 a.m. ET on January 9, 2018 and the conference presentation will be webcast live and available for replay for 90 days at www.express.com/investor .\nAbout Express, Inc.:\nExpress is a specialty retailer of women's and men's apparel and accessories, targeting the 20 to 30-year-old customer. Express has more than 35 years of experience offering a distinct combination of fashion and quality for multiple lifestyle occasions at an attractive value addressing fashion needs across work, casual, jeanswear, and going-out occasions. The Company currently operates more than 600 retail and factory outlet stores, located primarily in high-traffic shopping malls, lifestyle centers, and street locations across the United States and Puerto Rico. Express merchandise is also available at franchise locations and online in Latin America. Express also markets and sells its products through its e-commerce website, www.express.com , as well as on its mobile app.\nForward-Looking Statements:\nCertain statements are “forward-looking statements” made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Forward-looking statements include any statement that does not directly relate to any historical or current fact and include, but are not limited to, guidance and expectations for the fourth quarter and full year 2017, including statements regarding expected comparable sales, net income, adjusted net, income, earnings per diluted share, and adjusted earnings per diluted share, and other statements regarding future business performance, business initiatives, and share repurchases. Forward-looking statements are based on our current expectations and assumptions, which may not prove to be accurate. These statements are not guarantees and are subject to risks, uncertainties, and changes in circumstances that are difficult to predict, and significant contingencies, many of which are beyond the Company's control. Many factors could cause actual results to differ materially and adversely from these forward-looking statements. Among these factors are (1) changes in consumer spending and general economic conditions; (2) our ability to identify and respond to new and changing fashion trends, customer preferences, and other related factors; (3) fluctuations in our sales, results of operations, and cash levels on a seasonal basis and due to a variety of other factors, including our product offerings relative to customer demand, the mix of merchandise we sell, promotions, and inventory levels; (4) competition from other retailers; (5) customer traffic at malls, shopping centers, and at our stores and online; (6) our dependence on a strong brand image; (7) our ability to develop and maintain a relevant and reliable omni-channel experience for our customers; (8) the failure or breach of information systems upon which we rely; (9) our ability to protect customer data from fraud and theft; (10) our dependence upon third parties to manufacture all of our merchandise; (11) changes in the cost of raw materials, labor, and freight; (12) supply chain disruption; (13) our dependence upon key executive management; (14) our growth strategy, including our ability to improve the productivity of our existing stores, open new stores, and grow our e-commerce business; (15) our substantial lease obligations; (16) our reliance on third parties to provide us with certain key services for our business; (17) claims made against us resulting in litigation or changes in laws and regulations applicable to our business; (18) our inabil", "external_links": ["http://www.businesswire.com/news/home/20180109005227/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.express.com%2Finvestor&esheet=51739706&newsitemid=20180109005227&lan=en-US&anchor=www.express.com%2Finvestor&index=1&md5=a6615d580481e3af7b51af579eec9f89", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.express.com&esheet=51739706&newsitemid=20180109005227&lan=en-US&anchor=www.express.com&index=2&md5=46682a1b3438d3796c92bef28d7b5aa4"], "published": "2018-01-09T14:45:00.000+02:00", "crawled": "2018-01-09T15:41:16.000+02:00", "highlightTitle": ""}