{"organizations": [], "uuid": "b98d4a5fd3966de83af609f60cff23216dcaa7c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224488883&w=1200&r=LYNXMPEE0M09I", "site_section": "http://feeds.reuters.com/reuters/topNews", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-trade-nafta-poultry-analysis/dont-count-your-chickens-naftas-end-could-hit-u-s-poultry-hard-idUSKBN1FC0I3", "country": "US", "domain_rank": 408, "title": "Don't count your chickens; NAFTA's end could hit U.S. poultry hard", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T16:16:00.000+02:00", "replies_count": 0, "uuid": "b98d4a5fd3966de83af609f60cff23216dcaa7c9"}, "author": "", "url": "https://www.reuters.com/article/us-trade-nafta-poultry-analysis/dont-count-your-chickens-naftas-end-could-hit-u-s-poultry-hard-idUSKBN1FC0I3", "ord_in_thread": 0, "title": "Don't count your chickens; NAFTA's end could hit U.S. poultry hard", "locations": [], "entities": {"persons": [{"name": "david alire garcia", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "jason lange", "sentiment": "none"}, {"name": "organiz", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "texas/mexico city", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "palestine", "sentiment": "none"}], "organizations": [{"name": "nafta", "sentiment": "negative"}, {"name": "sanderson farms", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 6:08 AM / Updated 7 hours ago Don't count your chickens; NAFTA's end could hit U.S. poultry hard Jason Lange , David Alire Garcia 6 Min Read \nPALESTINE, Texas/MEXICO CITY (Reuters) - Workers at the Sanderson Farms plant in Palestine, Texas, are cutting up chickens for export to Mexico, a market that has become a pillar of the town’s economy and a key focus of the U.S. poultry sector. \nThe facility’s roughly 1,000 employees process a quarter of a million chickens a day, with parts zipping along racks to a packing area where legs and thighs are prepared for delivery to the United States’ southern neighbor. \nBut the Mexican market may find its way to the chopping block if talks to renegotiate the North American Free Trade Agreement collapse and President Donald Trump makes good on a threat to pull out of the 1994 deal with Canada and Mexico. \nThe stakes are high for the U.S. poultry sector, which exports products worth more than $1 billion a year to Mexico. \nMexico could slap a 75 percent tariff on U.S. chicken and turkey under its commitments to World Trade Organization rules, compared to the 20 percent tax on imports the Latin American nation could apply to other major U.S. exports like pork. \n“It would effectively prohibit us from selling product to Mexico,” Sanderson Farms Chief Financial Officer Mike Cockrell said. He added that the loss of the market would be comparable to the impact of Russia’s 2002 ban on U.S. chicken imports. \nThe bulk price of chicken leg quarters in 10 U.S. states including Texas sank to 18 cents a pound in March 2002, down from 26 cents a pound before the Russian ban, according to data from the U.S. Department of Agriculture. \nMexico accounted for about 4.5 percent of Sanderson Farm’s gross sales in the 12 months through October. The Trump Effect Tracking the impact of the president's policies \nMexican officials have made clear they don’t want consumers to face the price hikes that would be triggered by tariffs, although they have also said global trade rules would allow import taxes in the absence of NAFTA. \n“There is nothing standing in the way,” said Raul Urteaga, the top trade official in Mexico’s agriculture ministry and one of the people involved in the NAFTA negotiations of the 1990s. “What I can’t say is what the tariff would be.” \nMexican, Canadian and U.S. officials will meet in Montreal on Tuesday for talks to modernize the 24-year agreement, with negotiators aiming to reach a deal before Mexico’s presidential campaign kicks into gear ahead of a July election. \nEven a 25 percent tariff would make it hard to sell in Mexico, leading to a glut of chicken legs in the U.S. market, Cockrell said. \n“Nobody really goes to the Olive Garden to buy a leg quarter,” Cockrell said, referring to U.S. consumers’ general preference for white chicken meat rather than the dark meat found on leg quarters. \nLost sales to Mexico would add to the pain already felt from the virtual closure of the Chinese market to U.S. chicken. \nBeijing has lowered the stiff anti-dumping tariffs on U.S. broiler chickens that it enacted in 2010, though Washington maintains China has not gone far enough to comply with a WTO ruling against the tariffs. WAITING IN THE WINGS \nThe United States exports about 20 percent of its poultry production - it sent about $800 million in chicken and turkey meat to Mexico in 2016. Mexico buys more U.S. chicken than the next two markets combined. \nIf NAFTA disappears, U.S. poultry could face increased competition from Brazil, which is the world’s top chicken exporter and has tariff-free access to the Mexican market through 2019, as well as the possibility of lost jobs. \nPalestine Mayor Steve Presley says he is worried about the economic future of his town of 18,000. Sanderson Farm’s plant opened in 2015. \nThe poultry industry, for its part, has responded by lobbying U.S. officials. \nJames Sumner, president of the USA Poultry & Egg Export Council, said he has met with U.S. Trade Representative Robert Lighthizer to discuss the issue. Zippy Duvall, a Georgia chicken grower who is the head of the American Farm Bureau Federation, met briefly with Trump in Nashville on Jan. 8, said AFBF lobbyist Dave Salmonsen. \nTexas, Georgia, Arkansas and Mississippi are the top four states sending poultry meat to Mexico. Each is a Republican stronghold that voted heavily for Trump in the 2016 presidential election. \nSome observers speculate the potential impact of a NAFTA collapse on agriculture could prompt the Trump administration to ultimately stick with the deal. \n“It wouldn’t be in the Republicans’ interest to hit a big part of their constituency in their pockets,” Caroline Freund, a fellow at the Peterson Institute for International Economics, said earlier this month in an interview. \n(For a graphic on potential Mexican tariffs, see: tmsnrt.rs/2Ds2qQt ) Reporting by Jason Lange in Palestine, Texas and David Alire Garcia in Mexico City; Editing by Paul Simao", "external_links": [], "published": "2018-01-23T16:16:00.000+02:00", "crawled": "2018-01-23T16:35:04.006+02:00", "highlightTitle": ""}