{"organizations": [], "uuid": "2e3fc9452f80732d0777f02ae7f5b5517a3b2dab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/subjects/middle-east", "section_title": "Middle East Insight", "url": "https://www.reuters.com/article/us-israel-palestinians-un/israel-accuses-u-n-rights-forum-of-bias-over-palestinians-idUSKBN1FC14F", "country": "US", "domain_rank": 408, "title": "Israel accuses U.N. rights forum of bias over Palestinians", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T18:25:00.000+02:00", "replies_count": 0, "uuid": "2e3fc9452f80732d0777f02ae7f5b5517a3b2dab"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-israel-palestinians-un/israel-accuses-u-n-rights-forum-of-bias-over-palestinians-idUSKBN1FC14F", "ord_in_thread": 0, "title": "Israel accuses U.N. rights forum of bias over Palestinians", "locations": [], "entities": {"persons": [{"name": "raz shechter", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "aviva raz shechter", "sentiment": "none"}], "locations": [{"name": "geneva", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "west bank", "sentiment": "none"}, {"name": "jerusalem", "sentiment": "none"}, {"name": "geneva", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "united nations", "sentiment": "negative"}, {"name": "u.n.", "sentiment": "negative"}, {"name": "human rights council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GENEVA (Reuters) - Israel accused the United Nations on Tuesday of continuous discrimination against it over its treatment of Palestinians, and called for reforms of the U.N. human rights body.\nThe Human Rights Council’s regular examination of Israel’s record, the first since 2013, comes after U.S. President Donald Trump recognised Jerusalem last month as the capital of Israel, angering Palestinians, Middle East leaders and world powers.\nAviva Raz Shechter, Israel’s ambassador to the United Nations in Geneva, told the Human Rights Council that her country had always stood up for human rights.\n“It has done so while facing serious threats to its security, and while needing to integrate diverse communities and religious groups,” Raz Shechter told the Geneva forum.\nThe Council has taken a strong position against Israel’s occupation of territory seized in the 1967 Middle East war, its treatment of Palestinians there and its building of Jewish settlements.\nMost countries consider the settlements, in areas of the West Bank and Jerusalem that the Palestinians see as part of an eventual independent state, to be illegal under the Geneva Conventions. Israel disputes this and continues their expansion.\nAn “unparalleled number of one-sided biased and political resolutions adopted regularly by the automatic majority of its members testify not only to the unfair treatment of the State of Israel, but also to the deficiencies of the Council itself and its agenda,” Raz Shechter said.\nDima Asfour of Palestine’s delegation called on Israel to “end the illegal blockade of Gaza, investigate all allegations of war crimes and crimes against humanity committed during its military aggressions in Gaza and provide full reparation”.\nIsrael has imposed strict restrictions on goods that can enter the Gaza Strip, which has been ruled for a decade by the Islamist movement Hamas. Palestinians say the restrictions, which bar a range of goods that Israel says could have military uses, have destroyed the economy of the enclave, home to 2 million people, and prevented rebuilding after a 2014 war.\nIsrael should also free political prisoners, end its policy of administrative detention and halt “the use of torture against Palestinians, including children in Israeli military detention”, Asfour said.\nJason Mack of the United States, Israel’s main ally, urged Israel to minimise the number and duration of administrative detention orders and ensure detainees have access to lawyers.\nWashington says the Council is stacked with opponents of Israel and U.S. ambassador Nikki Haley told the Council last June that the United States was reviewing its participation given what it sees as its “chronic anti-Israel bias”.\nThe United States already withdrew last year from UN cultural organisation UNESCO, citing anti-Israel bias.\nReporting by Stephanie Nebehay; Editing by Peter Graff\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T18:25:00.000+02:00", "crawled": "2018-01-23T20:44:30.028+02:00", "highlightTitle": ""}