{"organizations": [], "uuid": "0521ce6c214776ac144d13998a9a850cfd4409a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/domesticNews\r", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-tennessee-murder/tennessee-man-takes-plea-deal-in-murder-of-student-holly-bobo-idUSKBN1FB37R", "country": "US", "domain_rank": 408, "title": "Tennessee man takes plea deal in murder of student Holly Bobo", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T01:59:00.000+02:00", "replies_count": 0, "uuid": "0521ce6c214776ac144d13998a9a850cfd4409a4"}, "author": "", "url": "https://www.reuters.com/article/us-tennessee-murder/tennessee-man-takes-plea-deal-in-murder-of-student-holly-bobo-idUSKBN1FB37R", "ord_in_thread": 0, "title": "Tennessee man takes plea deal in murder of student Holly Bobo", "locations": [], "entities": {"persons": [{"name": "holly bobo", "sentiment": "negative"}, {"name": "adams", "sentiment": "none"}, {"name": "c. creed mcginley", "sentiment": "none"}, {"name": "holly bobo tim ghianni", "sentiment": "none"}, {"name": "dylan adams", "sentiment": "none"}], "locations": [{"name": "tennessee", "sentiment": "none"}, {"name": "tenn.", "sentiment": "none"}, {"name": "savannah", "sentiment": "none"}, {"name": "nashville", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NASHVILLE, Tenn. (Reuters) - Dylan Adams, one of three men charged in the 2011 murder of Tennessee nursing student Holly Bobo, accepted a plea deal on Monday that will send him to prison without parole for 35 years.\nAdams entered a “best interest” plea of guilty on charges of aggravated kidnapping and facilitation of first-degree murder, a lesser charge from first-degree murder with which he was initially charged, according to a livestream of the hearing.\nAdams, 26, said little in state court in Savannah, Tennessee, other than to quietly acknowledge to Judge C. Creed McGinley that he agreed to the plea deal. He received 35 years for the kidnapping charge and 15 for the facilitation charge, with the sentences to run concurrently.\nUnder the plea, Adams does not admit guilt, only that such a plea is in the best interest of everyone and he cannot appeal.\n“This has been a long ordeal. Part of it he was ready to get something over with and get on with his life. It was a best interest plea, he’s not admitting any guilt. He faced a lot of risk if he went to trial,” his attorney, Matt Maddox, said by phone after the proceedings.\nBobo’s mother, Karen, was satisfied with the plea deal.\n“We came prepared for a trial, but for the sake of our family and just letting one more chapter be behind us, we decided we should go with this,” she said, according to WSMV, Nashville’s NBC affiliate television station.\nAdams had been scheduled to go to trial in May.\nHis brother Zachary Adams is serving a life sentence plus 50 years for the crime following his conviction last September on charges of first-degree murder, aggravated kidnapping and aggravated rape in a case.\nBobo, a cousin of country music singer Whitney Duncan, was last seen in the driveway of her rural Tennessee home in April 2011 when she was 20.\nBobo’s brother Clint, the last person to see her, said she left the family property and walked into the woods with a man in camouflage whom he mistook for her boyfriend.\nIn September 2014, two men searching for ginseng in the woods in Decatur County discovered a human skull, identified by dental records as Bobo‘s.\nNo court dates have been set for Jason Autry, the third man arrested in the case.\nReporting by Tim Ghianni; Editing by Ben Klayman and Peter Cooney\n ", "external_links": [], "published": "2018-01-23T01:59:00.000+02:00", "crawled": "2018-01-23T02:11:21.017+02:00", "highlightTitle": ""}