{"organizations": [], "uuid": "48f6198f7ba366856242031f46a1ee06826ee43a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/04/15/102590768-116034250.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/05/10-things-to-stop-wasting-your-money-on-in-2018.html", "country": "US", "domain_rank": 767, "title": "10 things to stop wasting your money on in 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T16:08:00.000+02:00", "replies_count": 0, "uuid": "48f6198f7ba366856242031f46a1ee06826ee43a"}, "author": "Kathleen Elkins", "url": "https://www.cnbc.com/2018/01/05/10-things-to-stop-wasting-your-money-on-in-2018.html", "ord_in_thread": 0, "title": "10 things to stop wasting your money on in 2018", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Most of us can find areas to cut back in. How much do you spend on takeout? Uber? What about coffee? \nIf you want to build more wealth in 2018, start by identifying where you're wasting money.\nDo any of the purchases below sound familiar? If so, try giving them up and redirecting the savings toward your savings goals or retirement account, where it could grow significantly over time .\nATM fees It'll cost you a record high of $4.57 to withdraw money from an out-of-network ATM. There's no reason to continue paying these fees, which can add up significantly over time.\nA simple 2018 resolution: If your bank's logo isn't on the ATM, don't use it.\nLate fees Like ATM fees, late fees are a pointless money suck. And there's more to late payments than simply paying a fee. Missing payments can also lower your credit score , which affects your ability to borrow money for bigger purchases, like a home or car , in the near future.\nNever miss a bill again by setting up automatic payments online for fixed costs such as cable, internet, and insurance. For expenses that can't be paid online, such as rent, set up calendar reminders and pay them at the same time each month so it becomes routine.\nshow chapters 5 lifestyle changes you can make to get rich      2:41 PM ET Wed, 27 Dec 2017 | 00:53 Underused subscriptions  While you're doing some deep cleaning and purging at the start of the new year, also go through all of the subscriptions you're signed up for.\nLook over your last couple of credit card statements and figure out exactly what you're paying for, whether it be subscriptions to magazines, software or online services. Next, ask yourself which you can eliminate, and cancel them on the spot to save a couple hundred dollars a year.\nYou could also use Trim , which automatically finds and cancels your subscriptions with a text.\nBuying lunch every day Dining out can add up quickly . The more food you can prepare at home , the better off your food budget will be. Plus, packing lunch also tends to be better for your waistline.\nOf course, it's OK to treat yourself and buy the occasional meal out, but if you're aiming to hit major financial goals in 2018, going homemade is one of the simplest ways to cut back without making dramatic sacrifices.\nshow chapters 5 easy chicken meals you can prep for the week that will save you time and money      12:48 PM ET Tue, 19 Dec 2017 | 04:46 Bottled water While you're getting into the habit of packing your lunch, start filling up a water bottle too.\nWhether it's bottled water or grabbing a coffee on your way to work, it's all too easy to spend mindlessly . But that money leaving your pocket could be directed toward your 2018 savings goals.\nUnused gym membership If you're a gym rat, power to you, but if you can't remember the last time you stepped foot inside the facilities, it may be time to cancel your membership.\nPlus, if you're ever itching to work out, there are plenty of ways to do it without a gym. Try following free YouTube workouts at home, walking, biking or hiking outside, making the most of training apps or joining a running club.\nshow chapters How to stay fit without joining a gym      3:09 PM ET Wed, 10 May 2017 | 02:35 Cable The average American spends more than $100 a month on cable . That's a large sum to pay for a service that people often don't take full advantage of.\nConsider cutting the cord in 2018 and getting your TV from the internet, through services like Netflix ($8 a month), Hulu ($8 a month) or HBO Now ($15 a month).\nExcess groceries Collectively, we waste a lot of food . Every time you throw away excess groceries, that's money down the drain.\nBefore you grocery shop, think about the meals you're going to make for the week and write down exactly what ingredients you'll need to prepare those meals. When you actually go to the store, stick to just the ingredients on your list.\nshow chapters One simple hack will help you turn your food scraps into delicious veggie stock      5:24 PM ET Mon, 18 Dec 2017 | 01:52 Brand-name products Going generic — for certain groceries, toiletries or pet supplies — is an easy way to save money over time. \nYou don't have to buy generic for everything. Identify what's really important to you and what you're willing to sacrifice. Then buy brand-name for the stuff you care about and go generic for everything else.\nImpulse buys From grocery stores to department stores, retailers have a way of tricking you into spending money mindlessly . One tactic is loading the checkout aisle with tempting products: cold sodas, candy bars and 99-cent knick-knacks. \nMake it a 2018 resolution to skip the candy or magazine. Chances are, you won't miss it, and your bank account will thank you.\nThis is an updated version of a previously published piece. \nLike this story? Like CNBC Make It on Facebook ! \nDon't miss: 7 simple money habits that will help you build wealth in 2018 \n\nshow chapters Shopping hacks that will save you thousands of dollars      11:37 AM ET Wed, 30 Nov 2016 | 01:31", "external_links": [], "published": "2018-01-05T16:08:00.000+02:00", "crawled": "2018-01-05T16:24:25.030+02:00", "highlightTitle": ""}