{"organizations": [], "uuid": "312eaa6c8e17a0616f5855bc369c2477b7a7bba6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-prologis-announces-tax-treatment-of-2017-distributions.html", "country": "US", "domain_rank": 767, "title": "Prologis Announces Tax Treatment of 2017 Distributions", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.01, "site_type": "news", "published": "2018-01-27T00:05:00.000+02:00", "replies_count": 0, "uuid": "312eaa6c8e17a0616f5855bc369c2477b7a7bba6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-prologis-announces-tax-treatment-of-2017-distributions.html", "ord_in_thread": 0, "title": "Prologis Announces Tax Treatment of 2017 Distributions", "locations": [], "entities": {"persons": [], "locations": [{"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "prologis", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "prologis, inc.", "sentiment": "neutral"}, {"name": "computershare", "sentiment": "none"}, {"name": "irs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO, Jan. 26, 2018 /PRNewswire/ -- Prologis, Inc. (NYSE: PLD), the global leader in logistics real estate, today announced the tax treatment of its 2017 distributions. While the distributions generally resulted in approximately 70% ordinary income and 30% capital gains, exhibits A and B reflect the tax treatment of distributions as prescribed by the Internal Revenue Code on Prologis, Inc. common and preferred stock, respectively.\nPersons who held shares of common stock of Prologis, Inc. in their name at any time during 2017 will receive an IRS Form 1099-DIV via Computershare, Prologis' transfer agent. Persons who held shares in \"street name\" during 2017 should note that the IRS form provided by a bank, brokerage firm or nominee may report only gross distributions. Therefore, the information herein may be needed to properly complete a federal tax return.\nThis information has been prepared using the best available information to date. Prologis, Inc.'s federal income tax return for the year ended December 31, 2017 has not yet been filed. Please note that federal tax laws affect taxpayers differently, and we cannot advise on how distributions should be reported. Please also note that state and local taxation of REIT distributions may differ from federal rules. Prologis, Inc. recommends a consultation with a tax advisor regarding the federal, state and local income tax consequences of these distributions.\nABOUT PROLOGIS\nPrologis, Inc. is the global leader in logistics real estate with a focus on high-barrier, high-growth markets. As of December 31, 2017, the company owned or had investments in, on a wholly owned basis or through co-investment ventures, properties and development projects expected to total approximately 684 million square feet (64 million square meters) in 19 countries. Prologis leases modern distribution facilities to a diverse base of approximately 5,000 customers across two major categories: business-to-business and retail/online fulfillment.\nFORWARD-LOOKING STATEMENTS\nThe statements in this document that are not historical facts are forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. These forward-looking statements are based on current expectations, estimates and projections about the industry and markets in which Prologis operates, management's beliefs and assumptions made by management. Such statements involve uncertainties that could significantly impact Prologis' financial results. Words such as \"expects,\" \"anticipates,\" \"intends,\" \"plans,\" \"believes,\" \"seeks,\" \"estimates,\" variations of such words and similar expressions are intended to identify such forward-looking statements, which generally are not historical in nature. All statements that address operating performance, events or developments that we expect or anticipate will occur in the future — including statements relating to rent and occupancy growth, development activity and changes in sales or contribution volume of properties, disposition activity, general conditions in the geographic areas where we operate, our debt and financial position, our ability to form new co-investment ventures and the availability of capital in existing or new co-investment ventures — are forward-looking statements. These statements are not guarantees of future performance and involve certain risks, uncertainties and assumptions that are difficult to predict. Although we believe the expectations reflected in any forward-looking statements are based on reasonable assumptions, we can give no assurance that our expectations will be attained and therefore, actual outcomes and results may differ materially from what is expressed or forecasted in such forward-looking statements. Some of the factors that may affect outcomes and results include, but are not limited to: (i) national, international, regional and local economic climates, (ii) changes in financial markets, interest rates and foreign currency exchange rates, (iii) increased or unanticipated competition for our properties, (iv) risks associated with acquisitions, dispositions and development of properties, (v) maintenance of real estate investment trust (\"REIT\") status and tax structuring, (vi) availability of financing and capital, the levels of debt that we maintain and our credit ratings, (vii) risks related to our investments in our co-investment ventures and funds, including our ability to establish new co-investment ventures and funds, (viii) risks of doing business internationally, including currency risks, (ix) environmental uncertainties, including risks of natural disasters, and (x) those additional factors discussed in reports filed with the Securities and Exchange Commission by Prologis under the heading \"Risk Factors.\" Prologis undertakes no duty to update any forward-looking statements appearing in this document.\nExhibit A\nTax Treatment of 2017 Common Distributions\nPrologis, Inc.\nCommon Stock\nCUSIP # 74340W103\nTicker Symbol: PLD\nRecord\nDates\nPayable\nDates\nCash\nDistribution\n($ per share)\nOrdinary\nTaxable\nDividend\n($ per share)\nQualified\nTaxable\nDividend\n($ per share)\nLong-Term\nCapital Gain\n($ per share)\nUnrecaptured\nSection 1250 Gain\n($ per share)(1)\n3/15/17\n3/31/17\n0.440000\n0.295013\n0.011869\n0.074232\n0.058886\n6/14/17\n6/30/17\n0.440000\n0.311040\n0.\n0.092283\n0.036677\n9/18/17\n9/29/17\n0.440000\n0.311040\n0.\n0.092283\n0.036677\n12/18/17\n12/29/17\n0.440000\n0.311040\n0.\n0.092283\n0.036677\n(1)\nCorporate shareholders may be subject to IRC §291(a) reduction in certain corporate preference items.\nExhibit B\nTax Treatment of 2017 Preferred Distributions\nPrologis, Inc.\nSeries Q Cumulative Redeemable Preferred Stock\nCUSIP # 74340W202\nTicker Symbol: PLDGP\nRecord\nDates\nPayable\nDates\nCash\nDistribution\n($ per share)\nOrdinary\nTaxable\nDividend\n($ per share)\nQualified Taxable\nDividend\n($ per share)\nLong-Term\nCapital Gain\n($ per share)\nUnrecaptured\nSection 1250 Gain\n($ per share)(1)\n3/17/17\n3/31/17\n1.067500\n0.651291\n0.076526\n0.107505\n0.232178\n6/19/17\n6/30/17\n1.067500\n0.754627\n0.\n0.223891\n0.088982\n9/18/17\n10/2/17\n1.067500\n0.754627\n0.\n0.223891\n0.088982\n12/18/17\n1/2/18\n1.067500\n0.754627\n0.\n0.223891\n0.088982\n(1)\nCorporate shareholders may be subject to IRC §291(a) reduction in certain corporate preference items.\nView original content with multimedia: http://www.prnewswire.com/news-releases/prologis-announces-tax-treatment-of-2017-distributions-300589026.html\nSOURCE Prologis, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/prologis-announces-tax-treatment-of-2017-distributions-300589026.html"], "published": "2018-01-27T00:05:00.000+02:00", "crawled": "2018-01-27T02:18:10.003+02:00", "highlightTitle": ""}