{"organizations": [], "uuid": "c7f0fd661dedfd22006247d69ae4ae7da074c7aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180108.html", "section_title": "Archive News &amp; Video for Monday, 08 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/nuance-commns-fairpointe/fairpointe-adds-to-shareholder-demands-over-nuance-ceo-plan-idUSL1N1P100Z", "country": "US", "domain_rank": 408, "title": "Fairpointe adds to shareholder demands over Nuance CEO plan", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.023, "site_type": "news", "published": "2018-01-09T04:00:00.000+02:00", "replies_count": 0, "uuid": "c7f0fd661dedfd22006247d69ae4ae7da074c7aa"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/nuance-commns-fairpointe/fairpointe-adds-to-shareholder-demands-over-nuance-ceo-plan-idUSL1N1P100Z", "ord_in_thread": 0, "title": "Fairpointe adds to shareholder demands over Nuance CEO plan", "locations": [], "entities": {"persons": [{"name": "fairpointe", "sentiment": "negative"}, {"name": "paul ricci", "sentiment": "none"}, {"name": "ricci", "sentiment": "none"}, {"name": "marie lorden", "sentiment": "none"}, {"name": "siri", "sentiment": "none"}, {"name": "lorden", "sentiment": "none"}], "locations": [{"name": "burlington", "sentiment": "none"}], "organizations": [{"name": "nuance communications inc", "sentiment": "negative"}, {"name": "fairpointe capital llc", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "apple inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 8 (Reuters) - Fairpointe Capital LLC, Nuance Communications Inc’s tenth largest shareholder, said on Monday it had voiced concerns to the software company’s board over its CEO succession planning, making it the third investor to do so in recent weeks.\nNuance, whose voice recognition technology helped launch Apple Inc’s voice assistant Siri, is seeking a successor to chief executive Paul Ricci, who announced in November 2016 that he would retire in 2018.\nFairpointe, a Chicago-based investment management firm with $5.3 billion under management, is seeking clarity on when Ricci will depart and who will replace him, Fairpointe portfolio manager Marie Lorden said in an interview.\nFairpointe, which owns a 1.77 percent stake in Nuance, has also sent a private letter to the company’s board in recent weeks about the issue, Lorden added.\nBurlington, Massachusetts-based Nuance did not respond to requests for comment.\nRicci said in November on a post-earnings conference call that “the search committee has made progress” and “expects to complete its work prior to the end of March.”\nFairpointe joins Neuberger Berman and Ivory Investment Management in asking the company for more details on the succession process. While these firms are not traditional activist investors, they are part of a growing cadre of U.S. money managers who have taken a page out of the activist hedge funds’ playbook by agitating for change at companies.\nNeuberger Berman sent an open letter on Dec. 12 to Nuance’s board of directors urging the company to immediately sever ties with Ricci, who has been CEO of the company since 2000. Neuberger, which owns a 1.6 percent stake in Nuance, making it the 12th largest shareholder, said it had lost confidence in the company’s management succession plan because there had not been an update on the CEO search in over a year.\nNeuberger added that the board’s governance and nominating committees “act in deference to Mr Ricci,” and that Ricci “seems to have no intention to relinquish control of the company in March 2018, and may try to continue to exert influence as CEO, Chairman, or in another capacity.”\nIvory Investment Management, the seventh largest shareholder in the company, sent a letter on Dec. 20 to Nuance’s board, expressing concern that Ricci was backtracking on his decision to retire. That letter, seen by Reuters, urged the company to quickly announce a new CEO.\nNuance, which has a market capitalization of around $5 billion, also has an image capturing business and a healthcare unit. (Reporting by Liana B. Baker in San Francisco, Editing by Rosalba O‘Brien)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-09T04:00:00.000+02:00", "crawled": "2018-01-09T17:11:34.024+02:00", "highlightTitle": ""}