{"organizations": [], "uuid": "c582caf8d13e6d997c201e58fb79dcebab43326e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1227012534&w=1200&r=LYNXMPEE0U1CR", "site_section": "http://feeds.reuters.com/reuters/UKTopNews/", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-saudi-arrests-mood/for-saudi-tycoons-freed-from-detention-cheers-and-a-business-challenge-idUKKBN1FK2JG", "country": "US", "domain_rank": 408, "title": "For Saudi tycoons freed from detention, cheers and a business challenge", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T19:18:00.000+02:00", "replies_count": 0, "uuid": "c582caf8d13e6d997c201e58fb79dcebab43326e"}, "author": "", "url": "https://uk.reuters.com/article/uk-saudi-arrests-mood/for-saudi-tycoons-freed-from-detention-cheers-and-a-business-challenge-idUKKBN1FK2JG", "ord_in_thread": 0, "title": "For Saudi tycoons freed from detention, cheers and a business challenge", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " 20 PM / Updated 21 minutes ago For Saudi tycoons freed from detention, cheers and a business challenge Stephen Kalin , Katie Paul 6 Min Read \nRIYADH (Reuters) - Cheering supporters greeted Saudi Arabian billionaire Prince Alwaleed bin Talal when he arrived at his skyscraper offices in Riyadh after his release from detention in an anti-corruption crackdown. \nBut he and other tycoons freed from a luxury hotel in the Saudi capital face a challenge to get back into the swing of running their financial empires in the uncertainty hanging over the business community since their detention in early November. \nTheir ability to do so could impact Saudi Arabia’s attempts to lure investors to big projects, an important part of Crown Prince Mohammed bin Salman’s grand vision to transform the kingdom and reduce its dependence on oil. \n“It will need another six to nine months without disruption or another witch hunt before anyone would be willing to move on anything major,” a regional banker said of the business climate. “This is not the right time to bring anything to market.” \nOnline footage showed Prince Alwaleed waving from a luxury car in a convoy trailed by police as he arrived this week at the Kingdom Center skyscraper one day after his release, and then walking inside with his private physician. \nA source familiar with the matter said the prince received an operational update on his global portfolio, which includes stakes in Twitter ( TWTR.K ), ride-hailing firm Lyft and French hotel operator Accor ( ACCP.PA ). \nIn the first few days after his detention, the share price of his investment firm Kingdom Holding ( 4280.SE ) plunged 23 percent, erasing $2.2 billion of his personal fortune on paper. \nAfter a jump this week, the stock has regained almost all that it lost, but during the prince’s detention the overall stock market rose 10 percent. Kingdom shares do not reflect that gain, indicating investors are still applying a discount to his company because of the uncertainty. \nPrince Alwaleed’s predicament suggests Saudi tycoons who have long been content to focus on amassing huge profits must now consider whether the government’s anti-corruption drive could stop them in their tracks. \nSaudi Arabia’s attorney general said on Tuesday that settlement deals had secured just over $100 billion from members of the elite. He did not provide a breakdown, and Reuters could not verify that figure. BACK IN THE DRIVING SEAT \nIn another video, property mogul Mohammed Aboud al-Amoudi sits in a black office chair at his home in Jeddah receiving kisses on the hand and forehead from a procession of well-wishers who utter thanksgiving for his safe return after nearly three months in the Ritz-Carlton Hotel in Riyadh. \nA company representative reached by phone said Amoudi was in good health. \n“It is as if he was travelling and returned, nothing more,” said the person who declined to be named, adding it was not clear if he would run the company again. \nAssociates of other released detainees, including media magnate Waleed al-Ibrahim and retail billionaire Fawaz al-Hokair, told Reuters they were at home catching up with family and close friends. \nAn email to MBC employees seen by Reuters described Ibrahim as “fit and eager to get back”. It said he would travel to Dubai in a couple of weeks to get “back in the driving seat”. \nHokair, meanwhile, is hosting dinners for guests, according to one attendee. The stock price of his company, fashion retailer Fawaz Abdulaziz Alhokair Co ( 4240.SE ), is still 13 percent below its level just before he was detained. \n“It’s as if he was on a business trip or in a summer holiday or a religious trip. He is fully motivated, full of ambitions,” the attendee said. \n“He does not talk about anything, he just says he was happy and received good treatment.” \nThese men are among the last group released from the Ritz, which had been used since November as a prison and interrogation centre for dozens of senior princes, ministers and businessmen and was cleared out on Tuesday. \nSpecific allegations against the men and the settlements they agreed before their release were kept secret. Some may have been moved to prison after refusing to admit wrongdoing and reach financial settlements; they may stand trial. \nNotably absent from the final batch of releases were Prince Turki bin Abdullah, the king’s nephew, and dismissed Economy Minister Adel Fakieh. Their fates remain unknown. \nTwo bankers said assets or corporate ownership transfers had not yet been made for the last batch of released detainees and any handovers could be shielded from public view for some time through what one banker described as “very clever lawyers and accountants.” \nCritics have described the anti-corruption campaign as a shakedown and power move by the Crown Prince. The government denies this. \nAs workers removed security barriers at the Ritz-Carlton in anticipation of the hotel’s reopening in mid-February, recently checked-out “guests” reconnected with loved ones. \nPictures shared on social media showed Alwaleed visiting an ill nephew in hospital. On Twitter, people urged him to continue his charitable activities. Additional reporting by Reem Shamseddine, Marwa Rashad and Andrew Torchia, Editing by Michael Georgy and Timothy Heritage", "external_links": [], "published": "2018-01-31T19:18:00.000+02:00", "crawled": "2018-01-31T19:35:41.003+02:00", "highlightTitle": ""}