{"organizations": [], "uuid": "822521fae0af35d435a72a045ca3855724f63278", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-the-shippers-group-hires-hugh-tait-as-senior-vp-of-customer-solutions.html", "country": "US", "domain_rank": 767, "title": "The Shippers Group Hires Hugh Tait as Senior VP of Customer Solutions", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.009, "site_type": "news", "published": "2018-01-09T18:21:00.000+02:00", "replies_count": 0, "uuid": "822521fae0af35d435a72a045ca3855724f63278"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-the-shippers-group-hires-hugh-tait-as-senior-vp-of-customer-solutions.html", "ord_in_thread": 0, "title": "The Shippers Group Hires Hugh Tait as Senior VP of Customer Solutions", "locations": [], "entities": {"persons": [{"name": "rob doyle", "sentiment": "none"}, {"name": "hugh tait", "sentiment": "none"}, {"name": "hugh", "sentiment": "none"}], "locations": [{"name": "dallas", "sentiment": "none"}], "organizations": [{"name": "customer solutions", "sentiment": "negative"}, {"name": "shippers group hires hugh tait", "sentiment": "negative"}, {"name": "georgia tech", "sentiment": "none"}, {"name": "shippers group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS, Jan. 9, 2018 /PRNewswire/ -- With a concentration on profitable growth and an eye to the future, The Shippers Group has named Hugh Tait Senior Vice President of Customer Solutions. Recognizing the importance of having a robust sales effort of warehousing, transportation, contract packaging and fulfillment to the marketplace, The Shippers Group wanted a savvy practitioner and client solutions veteran to lead the effort.\nHugh's primary responsibilities focus on customer relationships and customer solutions. His charge encompasses growth and expansion of The Shippers Group services further emerging as the industry's apparent national supply chain leader. \"Hugh is well regarded as an industry leader with expert knowledge in both operations and sales. With his vast skill set he will advance our sales effort in a collaborative and true customer solutions approach to bolster profitable growth across multiple verticals and service offerings nationwide,\" says Rob Doyle, president of The Shippers Group.\nAn engineer by training, Hugh received his Masters at Georgia Tech in 1986 and has over 25 years of logistics experience covering just about every industry and extending across all aspects of 3PL operations. Hugh has been responsible for sales, pricing, account reviews and process improvement for his entire career. His expertise is in customer relationship management, rate development and pricing solutions for new clients, enhancing operational quality levels and driving cost out of warehouse operations.\nHugh's greatest strengths are his high energy and positive attitude that he displays daily while trying to solve the supply chain problems of potential and current customers, as well as his unique ability to use an engineer's view of operations to help ensure continuous improvement in both operational and business development processes. When he's not helping Shipper's clients and prospects, Hugh is probably playing tennis or enjoying time with his wife and four children in Atlanta.\nThe Shippers Group is a leading national third-party logistics company headquartered in Dallas, Texas with distribution facilities in Texas, Georgia, California, Illinois and Virginia totaling 11 locations and 4.5 million square feet of space. In addition to warehousing and transportation services, the company provides co-packaging and e-commerce fulfillment to the food, consumer goods and automotive industries. The Shippers Group was founded in 1901 and today employs over 1200 associates nationwide. More information about The Shippers Group is available at www.shipperswarehouse.com .\nContact:\nRobin Siekerman, Vice President Marketing & Customer Solutions\nThe Shippers Group\n(678) 981-3577\nrobin.siekerman@shipperswarehouse.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/the-shippers-group-hires-hugh-tait-as-senior-vp-of-customer-solutions-300579436.html\nSOURCE The Shippers Group", "external_links": ["http://www.shipperswarehouse.com/", "http://www.prnewswire.com/news-releases/the-shippers-group-hires-hugh-tait-as-senior-vp-of-customer-solutions-300579436.html"], "published": "2018-01-09T18:21:00.000+02:00", "crawled": "2018-01-09T21:26:43.027+02:00", "highlightTitle": ""}