{"organizations": [], "uuid": "ab0525fd065560d9642926b9550160e38163cd53", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-fda-approves-xgevaa-denosumab-for-the-prevention-of-skeletal-related-events-in-patients-with-multiple-myeloma.html", "country": "US", "domain_rank": 767, "title": "FDA Approves XGEVA® (denosumab) For The Prevention Of Skeletal-Related Events In Patients With Multiple Myeloma", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.998, "site_type": "news", "published": "2018-01-05T17:00:00.000+02:00", "replies_count": 0, "uuid": "ab0525fd065560d9642926b9550160e38163cd53"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/pr-newswire-fda-approves-xgevaa-denosumab-for-the-prevention-of-skeletal-related-events-in-patients-with-multiple-myeloma.html", "ord_in_thread": 0, "title": "FDA Approves XGEVA® (denosumab) For The Prevention Of Skeletal-Related Events In Patients With Multiple Myeloma", "locations": [], "entities": {"persons": [{"name": "noopur raje", "sentiment": "none"}], "locations": [{"name": "u.s", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "fda", "sentiment": "negative"}, {"name": "amgen", "sentiment": "negative"}, {"name": "center for multiple myeloma", "sentiment": "none"}, {"name": "massachusetts general hospital cancer center", "sentiment": "none"}, {"name": "drug administration", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "THOUSAND OAKS, Calif., Amgen (NASDAQ:AMGN) today announced that the U.S. Food and Drug Administration (FDA) has approved the supplemental Biologics License Application (sBLA) for XGEVA ® (denosumab) to expand the currently approved indication for the prevention of skeletal-related events in patients with bone metastases from solid tumors to include patients with multiple myeloma. The approval is based on data from the pivotal Phase 3 '482 study, the largest international multiple myeloma clinical trial ever conducted, which enrolled 1,718 patients.\n\"Up to 40 percent of patients remain untreated for the prevention of bone complications, and the percentage is highest among patients with renal impairment at the time of diagnosis,\" said Noopur Raje, M.D., director, Center for Multiple Myeloma, Massachusetts General Hospital Cancer Center, Boston. \"Denosumab, which is not cleared through the kidneys, offers multiple myeloma patients bone protection with a convenient subcutaneous administration, providing patients with a novel treatment option.\"\n\"Bone complications can be devastating for patients with multiple myeloma. Previously, treatment options for the prevention of bone complications were limited to bisphosphonates, which unlike XGEVA, are cleared by the kidneys,\" said David M. Reese, M.D., senior vice president of Translational Sciences and Oncology at Amgen. \"We are pleased that the FDA has approved the expanded indication for XGEVA, providing a new option for patients and physicians, underscoring our commitment to advancing care for patients with multiple myeloma.\"\nXGEVA is a fully human monoclonal antibody that binds to and neutralizes RANK ligand (RANKL) – a protein essential for the formation, function and survival of osteoclasts, which break down bone – thereby inhibiting osteoclast-mediated bone destruction. XGEVA is currently the number one prescribed bone-targeting agent in the U.S. for the prevention of skeletal-related events in patients with bone metastases from solid tumors. Additional regulatory applications for XGEVA for the prevention of skeletal-related events in patients with multiple myeloma are underway and have been submitted to health authorities worldwide.\nAbout '482 Study (NCT01345019)\nThe '482 study was an international, Phase 3, randomized, double-blind, multicenter trial of XGEVA compared with zoledronic acid for the prevention of skeletal-related events in adult patients with newly diagnosed multiple myeloma and bone disease. In the study, a total of 1,718 patients (859 on each arm) were randomized to receive either subcutaneous XGEVA 120 mg and intravenous placebo every four weeks, or intravenous zoledronic acid 4 mg (adjusted for renal function) and subcutaneous placebo every four weeks. The primary endpoint of the study was non-inferiority of XGEVA versus zoledronic acid with respect to time to first on-study skeletal-related event (pathologic fracture, radiation to bone, surgery to bone or spinal cord compression). Secondary endpoints included superiority of XGEVA versus zoledronic acid with respect to time to first on-study skeletal-related event and first-and-subsequent on-study skeletal-related event and evaluation of overall survival. Progression-free survival was an exploratory endpoint. The safety and tolerability of XGEVA were also compared with zoledronic acid.\nThe study met the primary endpoint, demonstrating non-inferiority of XGEVA to zoledronic acid in delaying the time to first on-study skeletal-related event in patients with multiple myeloma (HR=0.98, 95 percent CI: 0.85, 1.14; p=0.01). The secondary endpoints, delaying time to first skeletal-related event and delaying time to first-and-subsequent skeletal-related events, did not demonstrate superiority. Overall survival was comparable between XGEVA and zoledronic acid, with a hazard ratio of 0.90 (95 percent CI: 0.70, 1.16; p=0.41). The median difference in progression-free survival favored XGEVA by 10.7 months (HR=0.82, 95 percent CI: 0.68-0.99; descriptive p=0.036). Median progression-free survival was 46.1 months (95 percent CI: 34.3 months, not estimable [NE], n=219) for XGEVA and 35.4 months (95 percent CI: 30.2 months, NE, n=260) for zoledronic acid.\nAdverse events observed in patients treated with XGEVA were generally consistent with the known safety profile of XGEVA. The most common adverse reactions (greater than or equal to 10 percent) were diarrhea (34 percent), nausea (32 percent), anemia (22 percent), back pain (21 percent), thrombocytopenia (19 percent), peripheral edema (17 percent), hypocalcemia (16 percent), upper respiratory tract infection (15 percent), rash (14 percent) and headache (11 percent). The most common adverse reaction resulting in discontinuation of XGEVA (greater than or equal to 1.0 percent) was osteonecrosis of the jaw (ONJ). In the primary treatment phase of the '482 study, ONJ was confirmed in 4.1 percent of patients in the XGEVA group (median exposure of 16 months; range: 1 - 50) and 2.8 percent of patients in the zoledronic acid group (median 15 months, range: 1 - 45 months).\nAbout Multiple Myeloma and Bone Complications\nMultiple myeloma is the second most common hematologic cancer, and it develops in plasma cells located in the bone marrow microenvironment. 1,2 It is typically characterized by osteolytic bone lesions as well as renal failure, which are both part of diagnosis (CRAB criteria). 3,4 Each year an estimated 114,000 new cases of multiple myeloma are diagnosed worldwide, resulting in more than 80,000 deaths per year. 1\nMore than 90 percent of patients develop osteolytic lesions during the course of the disease. 4 Preventing bone complications is a critical aspect of caring for patients with multiple myeloma, because these events can cause significant morbidity. 5 Current treatment options for fractures and other bone complications are limited to bisphosphonates, including zoledronic acid, which are cleared through the kidneys. 6 Approximately 60 percent of all multiple myeloma patients have or will develop renal impairment over the course of the disease. 7\nAbout XGEVA ® (denosumab)\nXGEVA targets the RANKL pathway to prevent the formation, function and survival of osteoclasts, which break down bone. XGEVA is indicated for the prevention of skeletal-related events in patients with multiple myeloma and in patients with bone metastases from solid tumors. XGEVA is also indicated for treatment of adults and skeletally mature adolescents with giant cell tumor of bone that is unresectable or where surgical resection is likely to result in severe morbidity and for the treatment of hypercalcemia of malignancy refractory to bisphosphonate therapy.\nU.S. Important Safety Information\nHypocalcemia\nPre-existing hypocalcemia must be corrected prior to initiating therapy with XGEVA ® . XGEVA ® can cause severe symptomatic hypocalcemia, and fatal cases have been reported. Monitor calcium levels, especially in the first weeks of initiating therapy, and administer calcium, magnesium, and vitamin D as necessary. Monitor levels more frequently when XGEVA ® is administered with other drugs that can also lower calcium levels. Advise patients to contact a healthcare professional for symptoms of hypocalcemia.\nAn increased risk of hypocalcemia has been observed in clinical trials of patients with increasing renal dysfunction, most commonly with severe dysfunction (creatinine clearance less than 30 mL/minute a", "external_links": ["http://imwg.myeloma.org/international-myeloma-working-group-imwg-criteria-for-the-diagnosis-of-multiple-myeloma/", "http://www.prnewswire.com/news-releases/fda-approves-xgeva-denosumab-for-the-prevention-of-skeletal-related-events-in-patients-with-multiple-myeloma-300578047.html", "http://www.xgeva.com/", "https://www.themmrf.org/multiple-myeloma/what-is-multiple-myeloma/", "http://globocan.iarc.fr/Pages/fact_sheets_population.aspx", "http://www.twitter.com/amgen", "http://www.amgen.com/", "https://stream1.newswire.ca/static/StrobeMediaPlayback.swf"], "published": "2018-01-05T17:00:00.000+02:00", "crawled": "2018-01-05T17:53:21.006+02:00", "highlightTitle": ""}