{"organizations": [], "uuid": "25583a64d832ea08cf21d27efb37d5de772f96c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-first-majestic-prices-offering-of-convertible-senior-notes.html", "country": "US", "domain_rank": 767, "title": "First Majestic Prices Offering of Convertible Senior Notes", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T15:30:00.000+02:00", "replies_count": 0, "uuid": "25583a64d832ea08cf21d27efb37d5de772f96c4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-first-majestic-prices-offering-of-convertible-senior-notes.html", "ord_in_thread": 0, "title": "First Majestic Prices Offering of Convertible Senior Notes", "locations": [], "entities": {"persons": [], "locations": [{"name": "vancouver", "sentiment": "none"}, {"name": "british columbia", "sentiment": "none"}, {"name": "frankfurt", "sentiment": "none"}, {"name": "primero", "sentiment": "none"}], "organizations": [{"name": "first majestic silver corp.", "sentiment": "negative"}, {"name": "ag", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}, {"name": "primero mining corp.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VANCOUVER, British Columbia, Jan. 25, 2018 (GLOBE NEWSWIRE) -- First Majestic Silver Corp. (TSX:FR)(NYSE:AG)(Frankfurt:FMV) (“ First Majestic ” or the “ Company ”) announced today that it has priced its previously announced offering (the “ Offering ”) of unsecured convertible senior notes due 2023 (the “ Notes ”). The Company will issue US$150 million aggregate principal amount of Notes (or US$172.5 million aggregate principal amount if the over-allotment option is exercised in full). The Notes will be issued at par value.\nThe Company intends to use the net proceeds of the Offering to fund certain costs and expenses associated with the recently announced acquisition of Primero Mining Corp. (“ Primero ”) and for general corporate purposes and, if the acquisition is not consummated, for general corporate purposes. If the acquisition of Primero is not completed, the Company may, at its option, redeem the Notes.\nThe Notes will bear cash interest semi-annually at a rate of 1.875% per annum. The initial conversion rate for the Notes will be 104.3297 common shares (“ Shares ”) per US$1,000 principal amount of Notes, equivalent to an initial conversion price of approximately US$9.59 per Share. The initial conversion rate represents a premium of approximately 35% relative to yesterday’s closing sale price of the Shares and is subject to adjustment in certain events.\nFirst Majestic will have the right to redeem the Notes in certain circumstances including, without limitation, non-completion of the acquisition of Primero. Holders will also have the right to require First Majestic to repurchase their Notes upon the occurrence of certain events.\nThe Offering is expected to close on or about January 29 , 2018, subject to customary closing conditions.\nThe Notes, and the Shares into which the Notes are convertible, have not been and will not be registered under the U.S. Securities Act of 1933, as amended (the “ Securities Act ”), or qualified by a prospectus in Canada. The Notes and the Shares may not be offered or sold in the United States absent registration under the Securities Act or an applicable exemption from registration under the Securities Act. The Notes will be offered only to “qualified institutional buyers” (as defined in Rule 144A under the Securities Act) and outside the United States to non-U.S. persons in compliance with Regulation S under the Securities Act. Offers and sales in Canada will be made only pursuant to exemptions from the prospectus requirements of applicable Canadian provincial and territorial securities laws.\nThis news release is neither an offer to sell nor the solicitation of an offer to buy the Notes or any other securities and shall not constitute an offer to sell or solicitation of an offer to buy, or a sale of, the Notes or any other securities in any jurisdiction in which such offer, solicitation or sale is unlawful.\nAbout the Company\nFirst Majestic is a mining company focused on growing primary silver production in Mexico and is aggressively pursuing the development of its existing mineral property assets. The Company presently owns and operates six producing silver mines; the La Parrilla Silver Mine, the San Martin Silver Mine, the La Encantada Silver Mine, the La Guitarra Silver Mine, Del Toro Silver Mine and the Santa Elena Silver/Gold Mine. Production from these six mines is projected to be between 10.6 to 11.8 million ounces of pure silver or 15.7 to 17.5 million ounces of silver equivalents in 2018.\nFor further information contact info@firstmajestic.com or call Investor Relations at 1-866-529-2807.\nFIRST MAJESTIC SILVER CORP.\n“signed”\nKeith Neumeyer, President & CEO\nForward Looking Statements\nThis press release contains “ ”, within the meaning of the United States Private Securities Litigation Reform Act of 1995 or forward looking information within the meaning of applicable Canadian securities legislation, concerning the business, operations and financial performance and condition of First Majestic. Forward-looking statements include, but are not limited to, statements with respect to timing of closing of the Offering and the proposed use of proceeds of the Offering. Generally, these can be identified by the use of forward-looking terminology such as “plans”, “expects” or “does not expect”, “is expected”, “budget”, “scheduled”, “estimates”, “forecasts”, “intends”, “anticipates” or “does not anticipate”, or “believes”, or variations of such words and phrases or statements that certain actions, events or results “may”, “could”, “would”, “might” or “will be taken”, “occur” or “be achieved”. Forward-looking statements are subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of First Majestic to be materially different from those expressed or implied by such , including but not limited to: failure to satisfy the conditions to closing of the Offering; risks related to the integration of acquisitions; risks related to international operations; actual results of current exploration activities; actual results of current reclamation activities; conclusions of economic evaluations; changes in project parameters as plans continue to be refined; future prices of metals; possible variations in ore reserves, grade or recovery rates; failure of plant, equipment or processes to operate as anticipated; accidents, labour disputes and other risks of the mining industry; delays in obtaining governmental approvals or financing or in the completion of development or construction activities, as well as those factors discussed in the section entitled “Description of Business - Risk Factors” in First Majestic’s Annual Information Form for the year ended December 31, 2016, available on www.sedar.com , and Form 40-F on file with the United States Securities and Exchange Commission in Washington, D.C. Although First Majestic has attempted to identify important factors that could from those contained in , there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on . First Majestic does not undertake to update any , except in accordance with applicable securities laws.\nSource:First Majestic Silver Corp", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/6db42aeb-858a-4199-92b0-4c34c741cdf0"], "published": "2018-01-25T15:30:00.000+02:00", "crawled": "2018-01-25T17:34:44.010+02:00", "highlightTitle": ""}