{"organizations": [], "uuid": "edc9c555deb7c4f68094038234ecefb4cda50d76", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-gen-michael-hayden-to-keynote-2018-cyber-risk-forum-for-ceos-and-board-directors.html", "country": "US", "domain_rank": 767, "title": "GEN Michael Hayden to Keynote 2018 Cyber Risk Forum for CEOs and Board Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T16:40:00.000+02:00", "replies_count": 0, "uuid": "edc9c555deb7c4f68094038234ecefb4cda50d76"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-gen-michael-hayden-to-keynote-2018-cyber-risk-forum-for-ceos-and-board-directors.html", "ord_in_thread": 0, "title": "GEN Michael Hayden to Keynote 2018 Cyber Risk Forum for CEOs and Board Directors", "locations": [], "entities": {"persons": [{"name": "michael hayden", "sentiment": "negative"}, {"name": "hayden", "sentiment": "none"}, {"name": "grant thornton", "sentiment": "none"}, {"name": "willis towers watson", "sentiment": "none"}, {"name": "marshall cooper", "sentiment": "none"}], "locations": [{"name": "conn.", "sentiment": "none"}, {"name": "stamford", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "corporate board m", "sentiment": "negative"}, {"name": "bitsight technologies", "sentiment": "none"}, {"name": "national security agency", "sentiment": "none"}, {"name": "central intelligence agency", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "STAMFORD, Conn., Jan. 24, 2018 /PRNewswire/ -- Chief Executive Group, publisher of Corporate Board Member and Chief Executive, announced today that GEN Michael Hayden , former director of the National Security Agency and Central Intelligence Agency will be the keynote speaker at their upcoming Cyber Risk Forum this April 16 in San Francisco.\nHeld alongside RSA® Conference , the leading international gathering for cyber security thought leaders, with sponsors Grant Thornton, Bitsight Technologies and Willis Towers Watson, the program is exclusively for CEOs and board members, and limited to 50 participants to ensure rich dialogue. It will help participants successfully understand, devise and implement enterprise-wide cybersecurity strategies.\n\"CEOs and boards know cybersecurity is among the most important issues now facing every business, a legal, bottom-line and reputational risk that cannot just be relegated to the IT department,\" said Marshall Cooper, CEO, The Chief Executive Group. \"With GEN Hayden and the rest of our speakers, we've assembled a lineup of proven leaders who understand this world like few others, and can help CEOs and directors ask the right questions and navigate the threats around the corner.\"\nOther speakers include Dawn Cappelli, VP, Global Security & Chief Information Security Officer, Rockwell Automation; Anthony Dagostino, Head of Global Cyber Risk, Willis Towers Watson, James Routh, Chief Security Officer, Aetna and John Scimone, SVP & Chief Security Officer, Dell.\nAttendees will also participate in an interactive, industry-focused cyber security simulation to provide participants with a better understanding of the potential impacts of a cyber event across various elements of their business.\nAbout GEN Michael Hayden, Principal at the Chertoff Group\nGeneral Michael Hayden is a retired four-star general who served as director of the Central Intelligence Agency and the National Security Agency when the course of world events was changing at a rapid rate. As head of the country's premier intelligence agencies, he was on the frontline of global change, the war on terrorism and the growing cyber challenge. In addition to leading the CIA and NSA, General Hayden was the country's first principal deputy director of national intelligence and the highest-ranking military intelligence officer in the country.\nHayden is a frequent expert and commentator on major news outlets and in top publications, valued for his expertise on intelligence matters like cyber security, government surveillance, geopolitics, and more. He was featured in the HBO documentary Manhunt, which looked at espionage through the eyes of the insiders who led the secret war against Osama bin Laden, and in Showtime's The Spymasters, a detailed look at the directors of the Central Intelligence Agency.\nHayden is currently a principal at the Chertoff Group and a distinguished visiting professor at the George Mason University Schar School of Policy and Government. He is on the board of directors of Motorola Solutions and serves on a variety of other boards and consultancies.\nAbout RSA Conference\nIn the digital world in which we now live, information is a very highly valued commodity. Safeguarding that information, therefore, has become a top priority. RSA Conference's mission is to connect you with the people and insights that will empower you to stay ahead of cyberthreats. We do this through our events in the US, the EMEA region and the Asia-Pacific region and through our digital outreach. However you access our community, RSA Conference is your best resource for exchanging ideas, learning the latest trends and finding the answers you are looking for.\nAbout Chief Executive Group\nChief Executive Group, the leading community for business leaders worldwide, publishes Chief Executive magazine (since 1977), chiefexecutive.net , Corporate Board Member and boardmember.com , as well as conferences and roundtables that enable CEOs to discuss key subjects and share their experiences with their peers. The Group also runs the Chief Executive Network, the leading CEO membership organization arranged by industry, and facilitates the annual \"CEO of the Year,\" a prestigious honor bestowed upon an outstanding corporate leader, nominated and selected by a group of peers. Visit www.chiefexecutive.net and www.boardmember.com for more information.\nFor more information, go to: boardmember.com/cyberforum\nOr Contact:\nSimone Bunsen\n189260@email4pr.com\n615.592-1591\nView original content: http://www.prnewswire.com/news-releases/gen-michael-hayden-to-keynote-2018-cyber-risk-forum-for-ceos-and-board-directors-300586963.html\nSOURCE Chief Executive Group", "external_links": ["http://boardmember.com/cyberforum", "http://www.prnewswire.com/news-releases/gen-michael-hayden-to-keynote-2018-cyber-risk-forum-for-ceos-and-board-directors-300586963.html", "http://www.boardmember.com/", "http://www.chiefexecutive.net/"], "published": "2018-01-24T16:40:00.000+02:00", "crawled": "2018-01-24T16:51:05.001+02:00", "highlightTitle": ""}