{"organizations": [], "uuid": "3d456204d69cc1d8b3364a25950d868dfd64d5db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/19/104956040-GettyImages-901874874.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/19/one-goldman-takeover-that-failed-the-trump-white-house.html", "country": "US", "domain_rank": 767, "title": "One Goldman takeover that failed: The Trump White House", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T22:48:00.000+02:00", "replies_count": 0, "uuid": "3d456204d69cc1d8b3364a25950d868dfd64d5db"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/19/one-goldman-takeover-that-failed-the-trump-white-house.html", "ord_in_thread": 0, "title": "One Goldman takeover that failed: The Trump White House", "locations": [], "entities": {"persons": [{"name": "gary d. cohn", "sentiment": "none"}, {"name": "dina powell", "sentiment": "none"}, {"name": "powell", "sentiment": "none"}, {"name": "anthony scaramucci", "sentiment": "none"}, {"name": "stephen k. bannon", "sentiment": "none"}, {"name": "newt gingrich", "sentiment": "none"}, {"name": "steven t. mnuchin", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [], "organizations": [{"name": "goldman sachs", "sentiment": "positive"}, {"name": "white house", "sentiment": "positive"}, {"name": "goldman", "sentiment": "positive"}, {"name": "trump white house", "sentiment": "positive"}, {"name": "house", "sentiment": "none"}, {"name": "national economic council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A year ago, with an impressive roster of Goldman Sachs alumni on their way to top White House positions, the return of \"Government Sachs\" was in full swing.\nThe newly inaugurated President Trump tapped Steven T. Mnuchin as treasury secretary, Gary D. Cohn as director of the National Economic Council and Dina Powell as White House adviser. Ms. Powell later served as both deputy national security adviser for strategy and senior counselor for economic initiatives.\nAnthony Scaramucci, another Goldman alumnus, was on the transition team en route to the post of White House communications director months later. Outranking them all was Stephen K. Bannon, the chief White House strategist, who worked at the bank early in his career and who reported directly to the president.\nDepending on one's point of view, this was either a sellout to Wall Street by a president who had railed against Goldman during the campaign, or a welcome check on some of Mr. Trump's more radical tendencies.\nAs the Trump adviser and former House speaker Newt Gingrich put it last year, \"It would be interesting to see to what degree the New York liberals change Trump and to what degree Trump changes the New York liberals.\"\nRead more from the New York Times:\nStephen Bannon out at the White House after turbulent run\nDina Powell, influential foreign policy advisor, is set to exit White House\nAnthony Scaramucci's uncensored rant: foul words and threats to have Priebus fired\nNow, the verdict would appear to be in: Mr. Trump remains the impulsive, freewheeling provocateur in chief, and much of the Goldman contingent has been banished or is leaving the White House.\n\"Everyone was wondering who would dominate the White House: Steve Bannon or the Manhattan mafia,\" Mr. Gingrich told me this week, referring to the Goldman alumni. \"It turns out Donald Trump dominated the White House. Surprise! That should have been obvious to anyone who knows anything about Trump.\"\nRoy C. Smith, a former Goldman partner and professor of management practice at New York University's Stern School of Business, agreed. \"I never really thought the Goldman crowd would tame Trump,\" he said. \"They didn't share a common agenda or a common bond.\"\nThat was almost immediately apparent as the White House descended into multiple warring factions, with the Goldman alumni often in opposing camps. The flame-throwing impulses of Mr. Bannon, in particular, were often at odds with the more measured, pragmatic styles of Mr. Cohn and Ms. Powell. (Goldman veterans told me the Bannon persona that emerged during the campaign and at the White House bears little resemblance to the clean-cut, hard-working young mergers-and-acquisitions banker they remember.)\nMr. Bannon and Mr. Scaramucci both self-destructed in spectacular, un-Goldman-like fashion. Mr. Bannon was fired from his White House job last summer and fully excommunicated after publication this month of Michael Wolff's tell-all book, \"Fire and Fury: Inside the Trump White House,\" which is filled with inflammatory Quote: s from Mr. Bannon.\nMr. Scaramucci lasted only 10 days as communications director last summer. He was dispatched after a colorful and expletive-laced rant to Ryan Lizza, who was then with The New Yorker, in which he denounced White House leakers and self-promoters, singling out Mr. Bannon in particular. (Mr. Scaramucci's attack seems less ad hominem now that Mr. Bannon has emerged as Mr. Wolff's main source.)\nIn far more dignified fashion, Ms. Powell announced her resignation in December, and her going-away party last week at Washington's Cafe Milano featured a who's who of Trump administration royalty, including Ivanka Trump and Jared Kushner. Even then, the event was overshadowed by the mounting fallout from Mr. Trump's incendiary comments earlier that day about Haiti and countries in Africa. Fortunately for Ms. Powell, she won't be called upon to defend the remarks.\nNow Mr. Cohn is widely expected to leave as well, the only question being how soon. Mr. Cohn fell out with Mr. Trump after he distanced himself from the president's racially charged comments about last summer's riots in Charlottesville, Va. Mr. Cohn drafted a resignation letter at the time, but had second thoughts and stayed.\nMr. Cohn has subsequently redeemed himself, to a large degree, by executing the president's economic agenda. He helped deliver a sweeping tax overhaul, the administration's signature achievement so far, and has stayed out of the public eye, which Mr. Trump likes. At times Mr. Trump has seemed to enjoy having a former Goldman Sachs president working for him, given that Goldman had long shunned him as a client.\nBut Mr. Trump passed over Mr. Cohn for the post of Federal Reserve chairman. In late December Mr. Cohn told the news site Axios he would still be in the administration three months hence. Earlier this month the time frame seemed to have shrunk. Asked how long he would stay at the White House, Mr. Cohn said only, \"I'm here today and I'm here next week.\"\nOur columnist Andrew Ross Sorkin and his Times colleagues help you make sense of major business and policy headlines — and the power-brokers who shape them.\nProfessor Smith of N.Y.U. said he hoped Mr. Cohn would leave soon \"because his reputation will be mangled if he stays.\"\n\"He delivered the tax legislation,\" he said. \"Whether you agree with it or not, he executed. That's his skill. And he stood up to the president after Charlottesville. People respect that. I think he could leave now with his reputation intact.\"\nAlone among the prominent Goldman alumni in the administration, Mr. Mnuchin seems likely to stay. \"He's been a good and loyal employee,\" Professor Smith said. \"But he's more of a Hollywood person now. His reputation in the professional financial sector may not matter that much to him.\"\nMr. Bannon and Mr. Scaramucci aside, \"any so-called exodus may be a function of what they achieved,\" Mr. Gingrich said of the Goldman veterans.\n\"There's nothing on the agenda this year that's nearly as exciting as reshaping the tax code,\" he said. \"They worked very hard and tried to do things that were effective. In that sense they were a real asset.\"\nAt the same time, Mr. Gingrich contended that Mr. Trump — and not his advisers — deserved the lion's share of credit for the tax bill, for building confidence in the economy, and for not launching a trade war.\n\"He has a much broader capacity than people in the District of Columbia give him credit for,\" Mr. Gingrich said of the president. \"People get so wound up in the goofier things he does, the tweets and outrageous statements. But underneath that is a very methodical and pragmatic businessman. He knows how to use competent people.\"\nWhether Mr. Trump can replace the departing Goldman alumni with people of similar stature remains to be seen. Mr. Gingrich pointed to Mr. Trump's appointment of Jerome Powell as the new Federal Reserve chairman as evidence that he will be able to recruit top economic talent.\nProfessor Smith said anyone considering a job at the White House would have to weigh the high risks of tethering his or her reputation to the Trump presidency. Even so, he said, \"you can never underestimate the allure of being a big shot in Washington.''\n\"Not that many Goldman partners are known outside the firm,'' he added. \"Why hang out at Goldman when you could be having lunch on Mount Olympus?\"", "external_links": ["https://www.nytimes.com/2017/12/08/us/politics/dina-powell-trump-resign.html", "https://www.nytimes.com/2017/07/27/us/politics/scaramucci-priebus-leaks.html", "https://www.nytimes.com/2017/08/18/us/politics/steve-bannon-trump-white-house.html"], "published": "2018-01-19T22:48:00.000+02:00", "crawled": "2018-01-19T22:25:27.004+02:00", "highlightTitle": ""}