{"organizations": [], "uuid": "4b35dbc470efc9c60f93287b40e16818d4418afd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-amerigo-announces-annual-2017-and-q4-2017-production-results.html", "country": "US", "domain_rank": 767, "title": "Amerigo Announces Annual 2017 and Q4-2017 Production Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-01-16T15:30:00.000+02:00", "replies_count": 0, "uuid": "4b35dbc470efc9c60f93287b40e16818d4418afd"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-amerigo-announces-annual-2017-and-q4-2017-production-results.html", "ord_in_thread": 0, "title": "Amerigo Announces Annual 2017 and Q4-2017 Production Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "vancouver", "sentiment": "none"}, {"name": "rancagua", "sentiment": "none"}, {"name": "chile", "sentiment": "none"}], "organizations": [{"name": "amerigo resources ltd.", "sentiment": "negative"}, {"name": "division el teniente", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "minera valle central", "sentiment": "none"}, {"name": "codelco", "sentiment": "none"}, {"name": "mvc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VANCOUVER, Jan. 16, 2018 /PRNewswire/ - Amerigo Resources Ltd. (\"Amerigo\" or the \"Company\") (TSX: ARG) announced today production results for the year 2017 and Q4-2017 from Minera Valle Central (\"MVC\"), the Company's 100% owned operation located near Rancagua, Chile.\nOperational Highlights:\nIn 2017, MVC produced record quantities of copper and molybdenum. MVC produced 62.5 million pounds of copper at a cash cost of $1.64 per pound, pursuant to a tolling agreement with Codelco's Division El Teniente. Annual molybdenum production was 1.6 million pounds.\nThe Company's robust performance met its 2017 guidance of production of 60 to 65 million pounds of copper at a cash cost of $1.60 to $1.75 per pound, and exceeded guidance of production of 1.5 million pounds of molybdenum.\nIn Q4-2017, MVC produced 15.6 million pounds of copper at a cash cost of $1.66 per pound, and 0.4 million pounds of molybdenum.\nConstruction of MVC's Cauquenes Phase Two expansion is on track for completion in Q3-2018, with full production expected in Q4-2018. The project will increase MVC's production to 85 to 90 million pounds per year, at an estimated cash cost of $1.45 to $1.60 per pound.\nIn 2018, Amerigo expects to produce 65 to 70 million pounds of copper and 1.8 million pounds of molybdenum, at a cash cost of $1.45 to $1.60 per pound.\nRob Henderson, Amerigo's President and CEO, stated \"MVC performed strongly again in 2017. The completion of the Cauquenes expansion in the second half of the year will increase production and lower unit costs, enabling Amerigo to further benefit from improved copper prices expected in 2018.\"\nSummary of 2017 Production Results:\n2017\nQ4-2017\nQ3-2017\nQ2-2017\nQ1-2017\nFresh tailings\nTonnes processed\n43,718,332\n11,290,794\n11,152,930\n10,708,437\n10,566,171\nCopper grade\n0.118%\n0.123%\n0.117%\n0.110%\n0.120%\nCopper recovery\n19.2%\n19.7%\n19.8%\n20.8%\n16.7%\nCopper produced (millions of pounds)\n21.784\n6.030\n5.700\n5.404\n4.651\nHistoric tailings\nTonnes processed\n22,658,605\n5,650,522\n5,716,546\n5,522,301\n5,769,236\nCopper grade\n0.249%\n0.247%\n0.240%\n0.253%\n0.255%\nCopper recovery\n31.6%\n31.2%\n32.4%\n33.4%\n29.6%\nCopper produced (millions of pounds)\n39.265\n9.596\n9.786\n10.290\n9.594\nMaricunga toll processing\nCopper produced (millions of pounds)\n1.466\n-\n-\n0.570\n0.896\nTotal copper produced (millions of pounds)\n62.515\n15.625\n15.487\n16.262\n15.141\nTotal copper delivered (millions of pounds)\n62.593\n15.970\n15.251\n16.197\n15.175\nCash cost ($/pound copper)\n1.64\n1.66\n1.69\n1.53\n1.71\nRelease of 2017 Annual Financial Results:\nThe Company will release 2017 annual financial results at market open on Wednesday February 21, 2018, followed by an investor conference call on Thursday February 22, 2018 at 11:00 am Pacific Standard Time/2:00 pm Eastern Standard Time.\nCall Participation:\nTo participate in the call, please dial 1-866-225-0198 (Toll-Free North America) and let the operator know you wish to participate in the Amerigo Resources conference call. Media are invited to attend on a listen-only basis. Following management's discussion of the quarterly results, the analyst and investment community will be invited to ask questions.\nAbout the Company:\nAmerigo Resources Ltd. is an innovative copper producer with a long-term partnership with Corporación Nacional del Cobre de Chile (\"Codelco\"), the world's largest copper producer. Amerigo produces copper concentrate at the MVC operation in Chile by processing fresh and historic tailings from Codelco's El Teniente mine, the world's largest underground copper mine. Tel: (604) 681-2802; Fax: (604) 682-2802; Web: www.amerigoresources.com ; Listing: ARG:TSX.\nCautionary Note Regarding Forward-Looking Information\nThis news release contains certain forward-looking information and statements as defined in applicable securities laws (collectively referred to as \"forward-looking statements\"). These statements relate to future events or the Company's future performance. All statements other than statements of historical fact are forward-looking statements. The use of any of the words \"anticipate\", \"plan\", \"continue\", \"estimate\", \"expect\", \"may\", \"will\", \"project\", \"predict\", \"potential\", \"should\", \"believe\" and similar expressions is intended to identify forward-looking statements. Although the Company believes that these assumptions were reasonable when made, because these assumptions are inherently subject to significant uncertainties and contingencies which are difficult or impossible to predict and are beyond the Company's control, the Company cannot assure that it will achieve or accomplish the expectations, beliefs or projections described in the forward-looking statements. These forward-looking statements involve known and unknown risks, uncertainties and other factors that may cause actual results or events to differ materially from those anticipated in such statements. These forward-looking statements include but are not limited to, statements concerning:\na forecasted increase in production and a reduction in operating costs; our strategies and objectives; our estimates of the availability and quantity of tailings, and the quality of our mine plan estimates; prices and price volatility for copper and other commodities and of materials we use in our operations; the demand for and supply of copper and other commodities and materials that we produce, sell and use; sensitivity of our financial results and share price to changes in commodity prices; our financial resources and our expected ability to meet our obligations for the next 12 months; interest and other expenses; domestic and foreign laws affecting our operations; our tax position and the tax rates applicable to us; the timing and costs of construction and tolling/production of, and the issuance and maintenance of the necessary permits and other authorizations required for, our expansion projects, including the expansion for the Cauquenes deposit and the timing of ramp-up to full production from Cauquenes; our ability to procure or have access to financing and to comply with our loan covenants; the production capacity of our operations, our planned production levels and future production; potential impact of production and transportation disruptions; hazards inherent in the mining industry causing personal injury or loss of life, severe damage to or destruction of property and equipment, pollution or environmental damage, claims by third parties and suspension of operations our planned capital expenditures (including our plan to upgrade our existing plant and operations) including the timing and cost of completion of our capital projects; estimates of asset retirement obligations and other costs related to environmental protection; our future capital and production costs, including the costs and potential impact of complying with existing and proposed environmental laws and regulations in the operation and closure of our operations; repudiation, nullification, modification or renegotiation of contracts; our financial and operating objectives; our environmental, health and safety initiatives; the outcome of legal proc", "external_links": ["http://www.amerigoresources.com/"], "published": "2018-01-16T15:30:00.000+02:00", "crawled": "2018-01-16T16:16:07.006+02:00", "highlightTitle": ""}