{"organizations": [], "uuid": "ab882796e6382e671f1bc15fd61be92ebff49518", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/11/04/102152130-166664587.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19854910/device/rss/rss.html", "section_title": "Tech", "url": "https://www.cnbc.com/2018/01/30/for-his-next-act-ken-chenault-turns-his-focus-on-silicon-valley.html", "country": "US", "domain_rank": 767, "title": "For His Next Act, Ken Chenault Turns His Focus on Silicon Valley", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T13:27:00.000+02:00", "replies_count": 0, "uuid": "ab882796e6382e671f1bc15fd61be92ebff49518"}, "author": "Andrew Ross Sorkin", "url": "https://www.cnbc.com/2018/01/30/for-his-next-act-ken-chenault-turns-his-focus-on-silicon-valley.html", "ord_in_thread": 0, "title": "For His Next Act, Ken Chenault Turns His Focus on Silicon Valley", "locations": [], "entities": {"persons": [{"name": "kenneth i. chenault", "sentiment": "negative"}, {"name": "ken chenault", "sentiment": "negative"}, {"name": "chenault", "sentiment": "none"}], "locations": [{"name": "silicon valley ever", "sentiment": "none"}, {"name": "airbnb", "sentiment": "none"}], "organizations": [{"name": "american express", "sentiment": "none"}, {"name": "board tesla's elon musk", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ever since Kenneth I. Chenault announced last fall that he would retire as chief executive of American Express , he has been fielding phone calls from companies looking to hire him.\nIt's not surprising. Mr. Chenault is one of the most prominent African-American chief executives in the world and the man who led American Express through 9/11 and the financial crisis. When it came to selecting his next act, he was bound to have a wide variety of choices.\nIn the last two weeks, he has announced he was joining the boards of Facebook and Airbnb. And for the last several weeks, he's been trying to keep one more secret — perhaps his biggest — about his future plans.\nMore from The New York Times:\nAmerican Express C.E.O. Ken Chenault to Step Down\nAirbnb, Edging Toward Possible I.P.O, Names Ken Chenault to Board\nTesla's Elon Musk May Have Boldest Pay Plan in Corporate History\n\"You're right,'' he said. \"I literally have been inundated,\" he reluctantly acknowledged, almost embarrassed, when we spoke Monday. \"People have talked to me about some very large companies and some digital technology companies. Obviously, I can't say from a confidentiality standpoint.\"\nThe recruiters can stop calling. On Tuesday, he will announce he has a new full-time job. Mr. Chenault, a name long synonymous with Wall Street, will soon become a staple of Silicon Valley as a venture capitalist. He will be chairman and managing director of General Catalyst Partners, one of the most successful venture firms of the past two decades, with stakes in companies like Airbnb, Snap , Stripe and Warby Parker.\nMr. Chenault 's choice to jump into the world of start-ups is more than just a business decision; to him, it is an opportunity to have a larger impact on Silicon Valley and its business culture.\nAs he assessed his opportunities, he became convinced that the tech start-up world had often come up short in meeting society's challenges.\nThis area, he said, is where he hopes he can have an impact.\nConsider Mr. Chenault some much-needed adult supervision.\n\"What I think is happening right now in the digital space is a maturation cycle and some people, as we've seen, are going to handle that well and some people are going to crash and burn,\" he said, without naming names.\nOf course, he could be talking about any of a host of companies, like Uber, Google or Facebook, the latter of which is facing a revolt among consumers and possibly regulators over the way fake news proliferates on its site.\nVenture capital firms themselves are not exempt from these problems, as my colleague Katie Benner chronicled last summer with a striking exposé of harassment by powerful investors.\n\"Given their age and the scale and size and impact that they can have on our society, unless they make a step up, we are going to have some serious problems,'' Mr. Chenault said. \"And we do have serious problems.\"\n\"Companies are starting to realize that they are growing up, and in growing up, they have to assume some broader responsibilities,\" he added. \"Companies are at different stages, from a self awareness standpoint, in accepting that reality.\"\nMr. Chenault's management skills may be a perfect fit for the role General Catalyst needs him to fill. As start-ups are staying private longer, venture capital firms are finding that someone has to actually run the companies they invest in, to think beyond the early stages of fast growth — and a quick sale or initial public offering — and to help them scale over a decade.\n\"The median time to I.P.O. has risen dramatically over the last decade, from 4.9 years in 2006 to 8.3 years in 2016,\" according to a report from Pitchbook, a data company that tracks deals. Airbnb has been private for 10 years, Uber for nine.\nWhen Mr. Chenault joined Airbnb's board last week, a company co-founder, Brian Chesky, whom Mr. Chenault has mentored for years, wrote a note to employees announcing the appointment. \"Many companies are designed to be finite,'' Mr. Chesky wrote. \"Finite companies are focused on beating their competitors and appeasing short-term interests. But business is not finite. Unlike sports, there is no time clock, so there can be no winning or losing — there is merely surviving and innovating to endure.\"\nMr. Chenault believes there is real value in trying to influence start-ups early in their life cycle, so that patience and foresight become embedded in the DNA.\nOne problem Mr. Chenault wants to address — conspicuous to anyone paying attention, but bafflingly inconspicuous to those in the Valley — is the lack of diversity, both in gender and race, in the tech industry.\n\"Diversity in the technology digital industry is a big issue,\" he said. \"If we don't make accelerated progress in that area, it will have dire consequences for our society.\"\nIt is even worse in the venture capital industry, where there are few women and even fewer African-Americans.\nThe numbers are embarrassing and depressing: African-Americans make up only 3 percent of the venture capital work force, according to a study conducted in 2016 by the National Venture Capital Association and Deloitte University Leadership Center for Inclusion. Latinos represented only 4 percent of the venture capital industry.\nMr. Chenault said he has known some of founding partners at General Catalyst for more than 20 years, including David Fialkow and Joel Cutler, who have been business partners since they met as children at Camp Cedar (a summer camp in Maine that I also attended). The fund, which has some $3.75 billion, was founded in Cambridge, Mass., in 1999 and has offices in New York; Palo Alto, Calif.; and San Francisco. Mr. Chenault said he would be based in New York.\nIn addition to Facebook and Airbnb, he is also on the boards of IBM and Procter & Gamble , which gives him insight into what's going on in the economy. He acknowledged that there might be times he has to recuse himself from dealing with board issues that conflict with one of the investments General Catalyst makes.\nBut at this stage of his career, he believes a move to venture capital is the right \"vehicle'' to try to make a difference. Mr. Chenault hopes to help companies not just make long-term plans, but to think about their role in society.\n\"Venture capital firms have to be more catalytic agents of change not just in the business development,\" he said, \"but in helping change the culture in the technology digital sector so there is a greater focus on the responsibilities they have.\"", "external_links": [], "published": "2018-01-30T13:27:00.000+02:00", "crawled": "2018-01-30T13:41:56.007+02:00", "highlightTitle": ""}