{"organizations": [], "uuid": "dcb5817d593870f1d133084f4f1796e31f61a573", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221488651&w=1200&r=LYNXMPEE0B17Y", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-usa-trump-immigration-norway/thanks-but-no-thanks-norwegians-reject-trumps-immigration-offer-idUKKBN1F1203", "country": "US", "domain_rank": 408, "title": "'Thanks, but no thanks' - Norwegians reject Trump's immigration offer", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T18:11:00.000+02:00", "replies_count": 0, "uuid": "dcb5817d593870f1d133084f4f1796e31f61a573"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-trump-immigration-norway/thanks-but-no-thanks-norwegians-reject-trumps-immigration-offer-idUKKBN1F1203", "ord_in_thread": 0, "title": "'Thanks, but no thanks' - Norwegians reject Trump's immigration offer", "locations": [], "entities": {"persons": [{"name": "trum", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "terje solsvik", "sentiment": "none"}, {"name": "erna solberg", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "camilla knudsen", "sentiment": "none"}], "locations": [{"name": "haiti", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "east room of the", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "min read  oslo", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 4:12 PM / Updated an hour ago 'Thanks, but no thanks' - Norwegians reject Trump's immigration offer Terje Solsvik , Camilla Knudsen 4 Min Read \nOSLO (Reuters) - Many Norwegians rejected on Friday a suggestion by U.S. President Donald Trump that they would be more welcome to move to the United States than immigrants from “shithole countries” such as Haiti or African nations. FILE PHOTO - U.S. President Donald Trump addresses a joint news conference with Norwegian Prime Minister Erna Solberg in the East Room of the White House in Washington, U.S., January 10, 2018. REUTERS/Jonathan Ernst \nThe Nordic country, one of the richest in the world by GDP per capita, was last year named the happiest nation on the planet and is known for a cradle-to-grave welfare state funded in part by large reserves of oil and natural gas. \nTrump mentioned Norway in derogatory comments about other countries of migration as U.S. senators briefed him on Thursday on a newly drafted bipartisan immigration bill, according to two sources who asked not to be identified. \nOne of the sources who was briefed on the conversation quoted him as saying: “Why do we want all these people from Africa here? They’re shithole countries ... We should have more people from Norway.” \nIn one of several Twitter posts on Friday, Trump defended his stance on a bipartisan Senate immigration deal, but denied using the vulgar language ascribed to him. \n“The language used by me at the DACA (Deferred Action for Childhood Arrivals) meeting was tough, but this was not the language used,” he said. He also later denied using derogatory language about Haitians. \n“On behalf of Norway: Thanks, but no thanks,” tweeted Torbjoern Saetre, a politician representing Norway’s Conservative Party in a municipality near Oslo. \nOthers condemned the U.S. president’s comments as inappropriate or racist. \n“We are not coming. Cheers from Norway,” one woman wrote. \nWhile hundreds of thousands of Norwegians emigrated to the U.S. in the 19th century, just 502 out of a population of 5.3 million people moved there in 2016, down 59 from the previous year, according to Statistics Norway. \n“Will there be more now?” the statistics agency asked in a tweet. \nGovernment officials, seeking to deflect attention, turned down a chance to comment. “We respectfully decline the opportunity,” one government official said when contacted by Reuters. \nThe reference to Norway may have been prompted by Prime Minister Erna Solberg who visited the White House on Wednesday when the president praised Norway for running a trade deficit with the United States and for buying U.S. military equipment. \nChristian Christensen, an American professor of journalism at Stockholm University in neighbouring Sweden, tweeted: \n“Of course people from #Norway would love to move to a country where people are far more likely to be shot, live in poverty, get no healthcare because they’re poor, get no paid parental leave or subsidized daycare and see fewer women in political power. #Shithole” \nBefore the “shithole” controversy, former Swedish Prime Minister Carl Bildt tweeted that, judging by Solberg’s visit, “keys to success with Trump is personal charm, a solid trade deficit with the U.S. and buying tons of U.S. military hardware.” \nSolberg, whose office also declined to comment on Trump’s remarks, is expected to announce soon an expansion of her cabinet to include Norway’s Liberal Party, a centrist group that favours strong environmental policies and more immigration. \n“The first point of order in the new government declaration: Norway will still not be a shithole country,” tweeted Kjetil Alstadheim, the political editor of financial daily Dagens Naeringsliv. Additional reporting by Henrik Stolen and Alister Doyle; Editing by Richard Balmforth", "external_links": [], "published": "2018-01-12T18:11:00.000+02:00", "crawled": "2018-01-12T18:48:26.014+02:00", "highlightTitle": ""}