{"organizations": [], "uuid": "825924a7b8dbc389552dfa5b0030ff353c1b0130", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/19/104906998-GettyImages-891084396.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/us-private-sector-added-250000-jobs-in-dec-vs-estimate-of-190000-adp.html", "country": "US", "domain_rank": 767, "title": "US private sector added 250,000 jobs in Dec, vs estimate of 190,000: ADP", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.223, "site_type": "news", "published": "2018-01-04T15:15:00.000+02:00", "replies_count": 0, "uuid": "825924a7b8dbc389552dfa5b0030ff353c1b0130"}, "author": "Jeff Cox", "url": "https://www.cnbc.com/2018/01/04/us-private-sector-added-250000-jobs-in-dec-vs-estimate-of-190000-adp.html", "ord_in_thread": 0, "title": "US private sector added 250,000 jobs in Dec, vs estimate of 190,000: ADP", "locations": [], "entities": {"persons": [], "locations": [{"name": "us", "sentiment": "none"}, {"name": "iowa", "sentiment": "none"}, {"name": "wall street", "sentiment": "none"}, {"name": "spirit lake", "sentiment": "none"}], "organizations": [{"name": "polaris industries", "sentiment": "negative"}, {"name": "moody", "sentiment": "none"}, {"name": "moody's analytics", "sentiment": "none"}, {"name": "adp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GDP outlook US private sector added 250,000 jobs in Dec, vs estimate of 190,000: ADP Private sector job creation surged in December as a strong holiday shopping season pushed companies to hire more workers, ADP and Moody's Analytics says. Companies hired 250,000 new workers to close out the year, well above Wall Street expectations of 190,000, it says. The month was the best for job creation since March. \nThe report helped send the Dow to break the 25,000 mark for the first time . \nCompanies hired 250,000 new workers to close out the year, well above Wall Street expectations of 190,000. The month was the best for job creation since March and topped the 185,000 in November, a number that was revised lower by 5,000. \nThe total brought 2017's private payroll growth as gauged by ADP and Moody's to 2.54 million, an average of 212,000 a month. \nJob growth was broad based, as professional and business services led the way with 72,000 new positions. The education and health services sector was next at 50,000 and trade, transportation and utilities contributed 45,000. Wall Street-related payrolls grew by 19,000. \nThe information services sector was the only one to lose jobs, reporting a drop of 4,000. \nBy size, businesses with between 50 and 499 employees added 100,000 jobs while small firms hired 94,000 and large companies contributed 56,000 to the total. \n\"The job market ended the year strongly,\" Moody's chief economist Mark Zandi said in a statement. \"Robust Christmas sales prompted retailers and delivery services to add to their payrolls. The tight labor market will get even tighter, raising the specter that it will overheat.\" \nOverall, service-related companies were responsible for the balance of jobs, with 222,000 new hires. Goods-producing industries added the rest, with construction growing by 16,000 and manufacturing by 9,000. \nThe private payrolls numbers come a day ahead of the government's closely watched nonfarm payrolls report. \nEconomists expect that the U.S. economy added about 189,000 jobs in December while the unemployment rate likely stayed at 4.1 percent, according to FactSet. \nEconomists and policymakers at the Federal Reserve will be watching the wages component most closely. Despite a job market that appears at full employment, salaries have been slow to rise. Average hourly earnings are projected to rise 0.3 percent for the month.", "external_links": [], "published": "2018-01-04T15:15:00.000+02:00", "crawled": "2018-01-04T15:27:27.005+02:00", "highlightTitle": ""}