{"organizations": [], "uuid": "2f7357f60cb031f9569421232530e5a4c294ba2b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/01/18/104226369-1406025_0717.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/pizza-hut-to-give-away-free-pizza-if-this-record-is-beat-at-super-bowl.html", "country": "US", "domain_rank": 767, "title": "Pizza Hut to give away free pizza if this record is beat at Super Bowl", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T14:15:00.000+02:00", "replies_count": 0, "uuid": "2f7357f60cb031f9569421232530e5a4c294ba2b"}, "author": "Sarah Whitten", "url": "https://www.cnbc.com/2018/01/22/pizza-hut-to-give-away-free-pizza-if-this-record-is-beat-at-super-bowl.html", "ord_in_thread": 0, "title": "Pizza Hut to give away free pizza if this record is beat at Super Bowl", "locations": [], "entities": {"persons": [{"name": "devin hester", "sentiment": "none"}, {"name": "hester", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "pizza hut", "sentiment": "negative"}, {"name": "pizza hut pizza hut employee", "sentiment": "negative"}, {"name": "yum brands", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sign up for Pizza Hut's loyalty program ahead of the Super Bowl and you could find yourself eating free pizza.\nThe pizza arm of Yum Brands said Monday that if the record for the fastest touchdown at a Super Bowl is broken, it will give its Hut Rewards members a free medium two-topping pizza on Feb. 9.\nThe returning team just needs to score a touchdown in less than 14 seconds of the opening kickoff on Feb. 4. The record was set by Chicago Bears wide receiver Devin Hester in 2007 after he returned the opening kickoff 92 yards in 14 seconds.\n\"I'm teaming up with Pizza Hut to challenge players in this year's Big Game to score a touchdown faster than I did in 2007,\" Hester said in a statement. \"If they do, and I hope they do, Hut Rewards members will earn free pizza.\"\nThis isn't the first Super Bowl stunt that Pizza Hut has pulled in recent years. For the 50th anniversary of the sporting event, the company sold 50 limited edition gold-covered pizzas . Last year, pizza boxes were transformed into Flick Football fields , with cardboard goal posts and football triangles.\nThis year's promotion is all about Pizza Hut's loyalty program. The pizza chain has been aggressively discounting its pizzas and offering new rewards since the beginning of the year, hoping to grab market share from competitors.\n\"When we launched Hut Rewards in 2017, we were committed to bringing the best loyalty program in the pizza category to our customers,\" said Zipporah Allen, vice president of brand marketing and consumer insights at Pizza Hut U.S.\nPizza Hut was an early adopter of digital and mobile ordering but has struggled to compete with tech-savvy Domino's .\nAs part of a $130 million investment in the brand, Yum has been upgrading Pizza Hut's equipment, technology and advertising, hoping to turn around soft sales. The result has been a newly minted loyalty program, Hut Rewards, and the hiring of about 14,000 delivery drivers by the end of 2017.\nThe loyalty program and commitment to technology is important for Pizza Hut, especially considering about half of its delivery and carryout orders are placed digitally and 70 percent of its online sales come from mobile devices.\nMobile orders offer customers an easier way to pay and often can bump the total check an average of 20 to 30 percent higher than a traditional in-store order.\nThe addition of the loyalty program gives customers an incentive to come back to earn free pizzas and other rewards. It also allows Pizza Hut to get important customer data to inform future investments and to remind customers if they haven't purchased from the brand in a while.", "external_links": [], "published": "2018-01-22T14:15:00.000+02:00", "crawled": "2018-01-22T14:20:27.014+02:00", "highlightTitle": ""}