{"organizations": [], "uuid": "ecada8cf6ca04c261c7720b6254fc7ed4fbba6c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-ekso-bionics-reports-preliminary-fourth-quarter-and-full-year-2017-financial-results.html", "country": "US", "domain_rank": 767, "title": "Ekso Bionics Reports Preliminary Fourth Quarter and Full Year 2017 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-09T16:00:00.000+02:00", "replies_count": 0, "uuid": "ecada8cf6ca04c261c7720b6254fc7ed4fbba6c7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-ekso-bionics-reports-preliminary-fourth-quarter-and-full-year-2017-financial-results.html", "ord_in_thread": 0, "title": "Ekso Bionics Reports Preliminary Fourth Quarter and Full Year 2017 Financial Results", "locations": [], "entities": {"persons": [{"name": "ekso", "sentiment": "none"}], "locations": [{"name": "richmond", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "ottobock", "sentiment": "none"}], "organizations": [{"name": "ekso bionics holdings", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "RICHMOND, Calif., Jan. 09, 2018 (GLOBE NEWSWIRE) -- Ekso Bionics Holdings, Inc. (NASDAQ:EKSO), an industry leader in exoskeleton technology for medical and industrial use, today announced preliminary top line financial results for the fourth quarter and fiscal year ended December 31, 2017.\nRevenue for the fourth quarter of 2017 was an estimated $2.5 million, including approximately $2.0 million in medical revenue. The company shipped 21 Ekso GT systems in the fourth quarter ended December 31, 2017, 15 of which were new sales and six of which were new rentals. In addition, four previously rented units were converted to a sale. Ekso also recognized revenue of approximately $330,000 on shipments of 56 units of its industrial products in the fourth quarter of 2017. Other revenue for the fourth quarter of 2017 includes a $150,000 license payment from Ottobock.\nA total of 61 Ekso GT units were shipped in 2017, a nearly 50% increase over the 41 units shipped in 2016. This brings the total number of Ekso GT systems in the field at year end to 277, including 17 rental units. At the end of the third quarter 2017, Ekso had 256 GT systems, including 15 rental units, in the field.\nTotal revenue for fiscal year 2017 was approximately $7.4 million, compared to $7.7 million in 2016, excluding a one-time recognition of $6.5 million in 2016 of deferred revenue on previously shipped units.\n“Preliminary results for the fourth quarter reflect the growing visibility of and interest in our medical products pipeline in both the United States and EMEA. The growing awareness of our industrial products is also a positive sign,” said Thomas Looby, President and Chief Executive Officer of Ekso Bionics. “As we move into 2018, we remain focused on building a solid foundation for commercial success. This includes expanding our customer base with leading rehabilitation centers in China and Asia-Pacific. Our rental program continues to be an effective source of sales, and we are working to expand the program and convert current rentals to sales in the months ahead.”\nThe Company finished the year with $27.9 million of cash on its balance sheet. The anticipated results in this press release are based on management’s preliminary unaudited analysis of ﬁnancial results for the period and year ended December 31, 2017. As of the date of this press release, the Company has not completed its financial statement reporting process for the period ended December 31, 2017. During the course of that process, the Company may identify items that would require it to make adjustments, which may be material, to the information presented above. As a result, the estimates above constitute forward-looking information and are subject to risks and uncertainties, including possible adjustments to preliminary operating results. The Company expects to report complete fourth quarter and full year 2017 financial results during the second week of March, 2018.\nAbout Ekso Bionics ®\nEkso Bionics® is a leading developer of exoskeleton solutions that amplify human potential by supporting or enhancing strength, endurance and mobility across medical, industrial and defense applications. Founded in 2005, the company continues to build upon its unparalleled expertise to design some of the most cutting-edge, innovative wearable robots available on the market. Ekso Bionics is the only exoskeleton company to offer technologies that range from helping those with paralysis to stand up and walk, to enhancing human capabilities on job sites across the globe, to providing research for the advancement of R&D projects intended to benefit U.S. defense capabilities. The company is headquartered in the Bay Area and is listed on the Nasdaq Capital Market under the symbol EKSO. For more information, visit: www.eksobionics.com .\nForward-Looking Statements\nAny statements contained in this press release that do not describe historical facts may constitute forward-looking statements. Forward-looking statements may include, without limitation, statements regarding (i) the plans and objectives of management for future operations, including plans or objectives relating to the design, development and commercialization of human exoskeletons, (ii) estimates or projection of financial results, financial condition, capital expenditures, capital structure or other financial items, (iii) the Company's future financial performance and (iv) the assumptions underlying or relating to any statement described in points (i), (ii) or (iii) above. Such forward-looking statements are not meant to predict or guarantee actual results, performance, events or circumstances and may not be realized because they are based upon the Company's current projections, plans, objectives, beliefs, expectations, estimates and assumptions and are subject to a number of risks and uncertainties and other influences, many of which the Company has no control over. Actual results and the timing of certain events and circumstances may differ materially from those described by the forward-looking statements as a result of these risks and uncertainties. Factors that may influence or contribute to the inaccuracy of the forward-looking statements or cause actual results to differ materially from expected or desired results may include, without limitation, changes resulting from the Company’s finalization of its financial statements for and as of the period and year ended December 31, 2017, information or new changes in facts or circumstances that may occur prior to the filing of the Company’s Annual Report on Form 10-K that are required to be included therein, the Company's inability to obtain adequate financing to fund the Company's operations and necessary to develop or enhance our technology, the significant length of time and resources associated with the development of the Company's products, the Company's failure to achieve broad market acceptance of the Company's products, the failure of our sales and marketing organization or partners to market our products effectively, adverse results in future clinical studies of the Company's medical device products, the failure to obtain or maintain patent protection for the Company's technology, failure to obtain or maintain regulatory approval to market the Company's medical devices, lack of product diversification, existing or increased competition, and the Company's failure to implement the Company's business plans or strategies. These and other factors are identified and described in more detail in the Company's filings with the SEC. To learn more about Ekso Bionics please visit us at www.eksobionics.com . The Company does not undertake to update these forward-looking statements.\nMedia Contact:\nCarrie Yamond\n917-371-2320\ncyamond@lazarpartners.com\nInvestor Contact:\nMatthew Ventimiglia\n212-599-1265\ninvestors@eksobionics.com\nSource:Ekso Bionics Holdings, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/b8eb3344-76d5-498f-a377-85b7a2d47c60"], "published": "2018-01-09T16:00:00.000+02:00", "crawled": "2018-01-09T17:55:57.011+02:00", "highlightTitle": ""}