{"organizations": [], "uuid": "483828579b98df717d2dc552645eda715283cd4c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-kelyniam-global-announces-key-management-changes.html", "country": "US", "domain_rank": 767, "title": "Kelyniam Global Announces Key Management Changes", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T16:00:00.000+02:00", "replies_count": 0, "uuid": "483828579b98df717d2dc552645eda715283cd4c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/pr-newswire-kelyniam-global-announces-key-management-changes.html", "ord_in_thread": 0, "title": "Kelyniam Global Announces Key Management Changes", "locations": [], "entities": {"persons": [{"name": "smith", "sentiment": "none"}, {"name": "chris breault", "sentiment": "none"}, {"name": "ross", "sentiment": "none"}, {"name": "kelyniam", "sentiment": "none"}, {"name": "ross bjella", "sentiment": "none"}, {"name": "mark v. smith", "sentiment": "none"}, {"name": "tennyson anthony", "sentiment": "none"}], "locations": [{"name": "conn.", "sentiment": "none"}, {"name": "canton", "sentiment": "none"}, {"name": "md.", "sentiment": "none"}, {"name": "canton", "sentiment": "none"}], "organizations": [{"name": "kelyniam global", "sentiment": "negative"}, {"name": "klyg", "sentiment": "negative"}, {"name": "alithias, inc.", "sentiment": "none"}, {"name": "ddn", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CANTON, Conn., Jan. 9, 2018 /PRNewswire/ -- Kelyniam Global (KLYG), a maker of custom cranial implants, announced today that it has hired Ross Bjella as Chairman and Chief Executive Officer. The company had recently appointed Chris Breault as Chief Operating Officer after the former President, Tennyson Anthony, left the company in April of this year. The company has also appointed Mark V. Smith, MD., as Vice President of Sales and Business Development.\nThe Canton, CT based company's new CEO, Ross Bjella, 56, previously worked at the formation of KLYG as a consultant and was instrumental helping the company receive the initial 510K approval and subsequent ISO 13485 certification. Ross is the current CEO of Alithias, Inc., a healthcare data analytics company. He previously served as the CEO of DDN, a leading outsourced business service company in the pharmaceutical and biotech industries.\nDr. Smith is a neurosurgeon and biomedical engineer who has worked closely with Kelyniam as a customer and advisor since 2012. Dr. Smith accepted the position of Vice President of Sales and Business Development in early September after successfully serving as a consultant in that role since last May. Dr. Smith brings over 20 years of clinical neurosurgery experience to the company. During his time with the company Dr. Smith has gained a keen understanding of Kelyniam's value proposition to both providers and payors.\n\"Ross is a highly-regarded healthcare executive, with deep experience across the industry. His knowledge of the regulatory and commercialization environment in the medical device space makes him uniquely positioned to support Kelyniam's growth.\" Said Kelyniam's Chief Operating Officer, Chris Breault. \"I have worked closely with Dr. Smith for a long time and having someone with his experience join the company in this role will allow us to strengthen our sales processes and develop new products.\"\nRoss Bjella said, \"I am excited to once again work with Chris, Dr. Smith and the Kelyniam team. Many of the key employees are still with the company since we launched the first product in 2010. Kelyniam has tremendous potential to increase current product sales and use our experience in 3D printing to develop new and innovative medical devices.\"\n\"My strong belief in Kelyniam's technology and Chris's commitment to reinvesting in product development and marketing makes this an ideal situation for me,\" said Bjella, \"We intend to increase our sales relationships while establishing better financial and administrative controls that position Kelyniam for consistent and sustainable growth.\"\nDr. Smith said, \"I am eager to help Kelyniam build strong relationships with physicians, hospitals and sales representatives, and to use my experience as a neurosurgeon and biomedical engineer as we seek to license and develop new products for surgical markets.\"\nKelyniam Inc., specializes in the rapid production of custom prosthetics utilizing computer aided design and computer aided manufacturing of advanced medical grade polymers. The Company develops, manufactures, and distributes custom cranial and craniofacial implants for patients requiring the reconstruction of cranial and certain maxillofacial structures. Kelyniam works directly with surgeons, health systems and payors to improve clinical and cost-of-care outcomes. Kelyniam's web site address is www.Kelyniam.com .\nAs a cautionary note to investors, certain matters discussed in this press release are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Such matters involve risks and uncertainties that may cause actual results to differ materially, including the following: changes in economic conditions; general competitive factors; the Company's ability to execute its service and product sales plans; changes in the status of ability to market products; and the risks described from time to time in the Company's SEC reports.\nView original content: http://www.prnewswire.com/news-releases/kelyniam-global-announces-key-management-changes-300579688.html\nSOURCE Kelyniam Global Inc", "external_links": ["http://www.prnewswire.com/news-releases/kelyniam-global-announces-key-management-changes-300579688.html", "http://www.kelyniam.com/"], "published": "2018-01-09T16:00:00.000+02:00", "crawled": "2018-01-09T17:53:27.042+02:00", "highlightTitle": ""}