{"organizations": [], "uuid": "f0a8a3c873d129868250ab75cb1bb78f5847b986", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/business-wire-juno-therapeutics-names-cindy-elkins-as-chief-information-officer.html", "country": "US", "domain_rank": 767, "title": "Juno Therapeutics Names Cindy Elkins as Chief Information Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-06T00:50:00.000+02:00", "replies_count": 0, "uuid": "f0a8a3c873d129868250ab75cb1bb78f5847b986"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/business-wire-juno-therapeutics-names-cindy-elkins-as-chief-information-officer.html", "ord_in_thread": 0, "title": "Juno Therapeutics Names Cindy Elkins as Chief Information Officer", "locations": [], "entities": {"persons": [{"name": "cindy elkins", "sentiment": "negative"}, {"name": "bishop", "sentiment": "none"}, {"name": "roche", "sentiment": "none"}, {"name": "hans bishop", "sentiment": "none"}, {"name": "elkins", "sentiment": "none"}, {"name": "cindy", "sentiment": "none"}], "locations": [{"name": "seattle", "sentiment": "none"}, {"name": "americas", "sentiment": "none"}, {"name": "genentec", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "genentech", "sentiment": "none"}, {"name": "elkins", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEATTLE--(BUSINESS WIRE)-- Juno Therapeutics, Inc. (NASDAQ: JUNO), a biopharmaceutical company developing innovative cellular immunotherapies for the treatment of cancer, today announced the appointment of Cindy Elkins as Chief Information Officer (CIO). Elkins will report to Hans Bishop, Juno’s President and CEO.\n“Cindy is a leader with a track record of increasing the impact of information technology in the biotech industry, focusing on innovation and delivering advanced technologies that support the discovery of breakthrough therapies,” said Mr. Bishop. “Her talent, passion and experience will help us advance our mission to bring better medicines to patients.”\nMs. Elkins served most recently as Vice President, IT for the Americas at Genentech, where she led the US commercial technology integration following the acquisition of Genentech by Roche. Under her leadership, Genentech became the first biotech company to implement several key technology platforms at scale, and her teams consistently provided exceptional user experience to over 44,000 people. Prior to her tenure at Genentech she was Vice President and General Manager at Ariba, a software and information technology services firm, where she helped create the world’s largest web-based trading community.\n“I am delighted to join Juno, a company that reflects my passion for vibrant, accountable, high-performing organizations seeking to transform and innovate at scale,” said Ms. Elkins. “It is an honor to be a part of a mission to fundamentally change the way cancer and other diseases are treated, and to provide the tools and infrastructure to allow Juno’s employees to do their best work.”\nShe is a member of the Board of Directors of Weight Watchers, and earned her MBA from Santa Clara University and BS in Applied Mathematics from UCLA.\nAbout Juno\nJuno Therapeutics is building a fully integrated biopharmaceutical company focused on developing innovative cellular immunotherapies for the treatment of cancer. Founded on the vision that the use of human cells as therapeutic entities will drive one of the next important phases in medicine, Juno is developing cell-based cancer immunotherapies based on chimeric antigen receptor and high-affinity T cell receptor technologies to genetically engineer T cells to recognize and kill cancer. Juno is developing multiple cell-based product candidates to treat a variety of B-cell malignancies as well as multiple solid tumors and multiple myeloma. Several product candidates have shown compelling clinical responses in clinical trials in refractory leukemia and lymphoma conducted to date. Juno's long-term aim is to leverage its cell-based platform to develop new product candidates that address a broader range of cancers and human diseases. Juno brings together innovative technologies from some of the world's leading research institutions, including the Fred Hutchinson Cancer Research Center, Memorial Sloan Kettering Cancer Center, Seattle Children's Research Institute (SCRI), the University of California, San Francisco, and The National Cancer Institute. Juno Therapeutics has an exclusive license to the St. Jude Children’s Research Hospital patented technology for CD19-directed product candidates that use 4-1BB, which was developed by Dario Campana, Chihaya Imai, and St. Jude Children’s Research Hospital. Juno’s product candidate JCAR017 was developed in collaboration with SCRI and others.\nForward-Looking Statements\nThis press release contains “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933, and Section 21E of the Securities Exchange Act of 1934, including statements regarding Juno’s mission, progress, and business plans; the ability of Juno’s executive team to advance Juno as a global leader in T cell engineering and manufacturing; and the potential of Juno’s therapies to eradicate and cure certain types of cancers and other serious diseases. Forward-looking statements are subject to risks and uncertainties that could cause actual results to differ materially from such forward-looking statements, and reported results should not be considered as an indication of future performance. These risks and uncertainties include, but are not limited to, risks associated with: the success, cost, and timing of Juno's product development activities and clinical trials; Juno's ability to obtain regulatory approval for and to commercialize its product candidates; Juno's ability to establish a commercially-viable manufacturing process and manufacturing infrastructure; regulatory requirements and regulatory developments; success of Juno's competitors with respect to competing treatments and technologies; Juno's dependence on third-party collaborators and other contractors in Juno's research and development activities, including for the conduct of clinical trials and the manufacture of Juno's product candidates; Juno’s ability to attract and retain key scientific, quality control/assurance, manufacturing or management personnel; Juno's dependence on Celgene for the development and commercialization outside of North America and China of Juno’s CD19 product candidates and any other product candidates for which Celgene exercises an option; Juno’s dependence on JW Therapeutics (Shanghai) Co., Ltd and its affiliates for the development and commercialization of product candidates in China; Juno's ability to obtain, maintain, or protect intellectual property rights related to its product candidates; amongst others. For a further description of the risks and uncertainties that could cause actual results to differ from those expressed in these forward-looking statements, as well as risks relating to Juno's business in general, see Juno's Quarterly Report on Form 10-Q filed with the Securities and Exchange Commission on November 1, 2017 and Juno’s other periodic reports filed with the Securities and Exchange Commission. These forward-looking statements speak only as of the date hereof. Juno disclaims any obligation to update these forward-looking statements.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180105005809/en/\nJuno Therapeutics, Inc.\nInvestor Relations:\nNicole Keith, 206-566-5521\nnikki.keith@junotherapeutics.com\nor\nMedia:\nChristopher Williams, 206-566-5660\nchris.williams@junotherapeutics.com\nSource: Juno Therapeutics, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180105005809/en/"], "published": "2018-01-06T00:50:00.000+02:00", "crawled": "2018-01-06T00:54:25.000+02:00", "highlightTitle": ""}