{"organizations": [], "uuid": "e06bafcfad7cc99a4e1ab81a34d772499a09aa0f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-digipath-inc-announces-record-results-for-the-fiscal-year-ended-september-30-2017.html", "country": "US", "domain_rank": 767, "title": "Digipath, Inc. Announces Record Results for the Fiscal Year Ended September 30, 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T17:00:00.000+02:00", "replies_count": 0, "uuid": "e06bafcfad7cc99a4e1ab81a34d772499a09aa0f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-digipath-inc-announces-record-results-for-the-fiscal-year-ended-september-30-2017.html", "ord_in_thread": 0, "title": "Digipath, Inc. Announces Record Results for the Fiscal Year Ended September 30, 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "las vegas", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "digipath, inc.", "sentiment": "neutral"}, {"name": "digipath, inc", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LAS VEGAS, Jan. 2, 2018 /PRNewswire/ -- Digipath, Inc. (OTCQB: DIGP) (\"DIGP\" or the \"Company\"), a service oriented independent testing laboratory and media firm focused on the developing cannabis market, today announced financial and operating results for the fiscal year ended September 30, 2017.\n2017 Company Highlights\nEnded fiscal year debt free with $380,189 of working capital, including $178,177 of cash on hand Annual sales were $1,898,172, an increase of 132% on a year-over-year basis Fourth quarter sales of $602,057 increased by 74% over the third quarter, and by 93% vs. the fourth quarter of 2016, as Nevada recreational cannabis sales commenced in July 2017, resulting in another record quarter Reduced our net loss by 71% over the comparative net loss in 2016 Adjusted EBITDA for the year was $(375,377), compared to Adjusted EBITDA of $(949,946) for the previous fiscal year, an improvement of approximately 60% on a year-over-year basis\nThe table below shows the preliminary results and key metrics:\nQuarterly Data\nQuarterly Data\nFYE September 30, 2016\nFYE September 30, 2017\nQ1\nQ2\nQ3\nQ4\nQ1\nQ2\nQ3\nQ4\n2016\n2016\n2016\n2016\n2017\n2017\n2017\n2017\nRevenues (Thousands)\n$ 102\n$ 141\n$ 264\n$ 311\n$ 410\n$ 497\n$ 389\n$ 602\nLab Revenue Growth (%YOY)\n-\n-\n-\n-\n301.2%\n252.2%\n47.4%\n93.5%\nGross Profit Margins (%)\n31.5%\n39.5%\n61.1%\n60.8%\n50.2%\n55.5%\n44.6%\n56.3%\nQuick Ratio (%)\n175.9%\n171.8%\n166.9%\n110.3%\n142.8%\n523.4%\n159.2%\n271.2%\nManagement Comment\nTodd Denkin, Digipath's President & COO, commented, \"We are extremely pleased with our results for fiscal 2017 and look forward to a full year of testing for both medical and recreational cannabis products in 2018. It is also rewarding to see our progress reflected in our recent stock price. Over $126 million of cannabis-related products have been sold in Nevada since adult use went into effect on July 1, 2017. People don't realize that Nevada had more sales than Colorado experienced in their first four months of adult-use cannabis. We anticipate a continued significant increase in demand for cannabis lab testing services in 2018. In addition, with recreational cannabis now legal in California, we continue to work with our previously announced joint venture partner to launch an independent testing lab in California during 2018 as we seek to replicate our successful Nevada operations in other legal jurisdictions.\"\nAdjusted EBITDA\nWe define Adjusted EBITDA as net earnings (loss) before (i) other income (expense), (ii) interest income, (iii) interest expense, (iv) bad debts, (v) depreciation and amortization, (vi) impairment of securities available-for-sale costs, (vii) non-cash expenses relating to share based payments recognized under ASC Topic 718, (viii) gain on early extinguishment of debt, and (ix) equity in losses of unconsolidated entity. We believe the use of this non-GAAP financial measure provides useful information to investors regarding our current financial performance; however, Adjusted EBITDA does not represent, and should not be considered an alternative to GAAP measurements. Specifically, we believe Adjusted EBITDA results provide useful information to both management and investors by excluding certain income and expenses that our management believes are not indicative of our core operating results, we believe that non-GAAP financial measures have limitations and do not reflect all of the amounts associated with our results of operations as determined in accordance with GAAP and that Adjusted EBITDA should only be used to evaluate our results of operations in conjunction with the corresponding GAAP financial measures. A reconciliation of Adjusted EBITDA to net loss is included below:\nDIGIPATH, INC. AND SUBSIDIARIES\nRECONCILIATION OF ADJUSTED EBITDA TO NET LOSS\n(Unaudited)\nFor the Years Ended\nSeptember 30,\n2017\n2016\nNet loss\n$ (1,065,140)\n$ (3,699,019)\nAdd back:\nOther income\n(282,068)\n(154,000)\nInterest income\n(10,000)\n(10,000)\nBad debts expense\n42,180\n274,375\nDepreciation and amortization\n253,535\n244,580\nStock based compensation\n636,116\n1,413,569\nLoss on impairment of securities available-for-sale\n50,000\n-\nGain on early extinguishment of debt\n-\n(12,133)\nEquity in losses of unconsolidated entity\n-\n992,682\nAdjusted EBITDA\n$ (375,377)\n$ (949,946)\nAbout Digipath, Inc. (OTCQB: DIGP)\nDigipath, Inc ., supports the cannabis industry's best practices for reliable testing, cannabis education and training, and brings unbiased cannabis news coverage to the cannabis industry.\nDigipath Labs provides pharmaceutical-grade analysis and testing to the cannabis industry to ensure producers, consumers and patients know exactly what is in the cannabis they ingest and to help maximize the quality of its client's products through analysis, research, development, and standardization.\nInformation about Forward-Looking Statements\nThis press release contains \"forward-looking statements\" that include information relating to future events. Forward-looking statements should not be read as a guarantee of future performance or results, and will not necessarily be accurate indications of the times at, or by, which that performance or those results will be achieved. Forward-looking statements are based on information available at the time they are made and/or management's good faith belief as of that time with respect to future events, and are subject to risks and uncertainties that could cause actual performance or results to differ materially from those expressed in, or suggested by, the forward-looking statements. Important factors that could cause these differences include, but are not limited to: the Company's need for additional funding, the demand for the Company's products, governmental regulation of the cannabis industry, the Company's ability to maintain customer and strategic business relationships, the impact of competitive products and pricing, growth in targeted markets, the adequacy of the Company's liquidity and financial strength to support its growth, and other risks that may be detailed from time-to-time in the Company's filings with the United States Securities and Exchange Commission. For a more detailed description of the risk factors and uncertainties affecting Digipath, please refer to the Company's recent Securities and Exchange Commission filings, which are available at www.sec.gov . The Company undertakes no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events, or otherwise.\nContact\nHarrison Phillips\nViridian Capital Advisors, LLC\n(212) 209-3086\nhphillips@viridianca.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/digipath-inc-announces-record-results-for-the-fiscal-year-ended-september-30-2017-300576306.html\nSOURCE Digipath, Inc.", "external_links": ["http://www.sec.gov/", "http://www.digipathlabs.com/", "http://www.prnewswire.com/news-releases/digipath-inc-announces-record-results-for-the-fiscal-year-ended-september-30-2017-300576306.html", "http://www.digipath.com/"], "published": "2018-01-02T17:00:00.000+02:00", "crawled": "2018-01-02T16:23:07.014+02:00", "highlightTitle": ""}