{"organizations": [], "uuid": "962584e0aff56017c1eafe3657cf4222ab7422d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223367461&w=1200&r=LYNXMPEE0I10U", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-saturday/kerber-revival-meets-sharapova-roadblock-as-melbourne-cools-idUKKBN1F81OV", "country": "US", "domain_rank": 408, "title": "Kerber revival meets Sharapova roadblock as Melbourne cools", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T17:09:00.000+02:00", "replies_count": 0, "uuid": "962584e0aff56017c1eafe3657cf4222ab7422d9"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-saturday/kerber-revival-meets-sharapova-roadblock-as-melbourne-cools-idUKKBN1F81OV", "ord_in_thread": 0, "title": "Kerber revival meets Sharapova roadblock as Melbourne cools", "locations": [], "entities": {"persons": [{"name": "sharapova", "sentiment": "negative"}, {"name": "angelique kerber", "sentiment": "none"}, {"name": "maria sharapova", "sentiment": "none"}, {"name": "novak djokovic", "sentiment": "none"}, {"name": "lauren davies", "sentiment": "none"}, {"name": "simona halep", "sentiment": "none"}, {"name": "richard gasquet", "sentiment": "none"}, {"name": "alexander zverev", "sentiment": "none"}, {"name": "roger federer", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 2:31 PM / Updated 14 minutes ago Kerber revival meets Sharapova roadblock as Melbourne cools Reuters Staff 3 Min Read \nMELBOURNE (Reuters) - Angelique Kerber’s recent revival faces its toughest test in the shape of Maria Sharapova when the only two former Australian Open champions in the women’s draw clash in round three on Saturday. \nA cool front broke the grip of the high temperatures ahead of day six of the championships but there should still be plenty of heat out on court as the players battle for the remaining spots in the fourth round. \nDefending men’s champion Roger Federer’s will look to continue his imperious advance through the draw when he meets Frenchman Richard Gasquet, while six-times champion Novak Djokovic and young gun Alexander Zverev are also in action. \nWorld number one Simona Halep looks to forge further ahead into a draw increasing devoid of seeds when she meets American Lauren Davies but there is no doubting the top women’s match of the day. \nSharapova, who won the Melbourne Park title as a 20-year-old in 2008, missed last year’s tournament because of a 15-month doping ban and is still ranked a lowly 48th in the world as she continues her comeback. \nLefthander Kerber has plummeted down the rankings from world number to 16th on the back of a year of good old fashioned poor form but has rallied with seven straight wins to start 2018. \nKerber, who joined Sharapova in the 30-something club on Thursday, beat absent reigning champion Serena Williams to win the 2016 Australian Open and is a formidable opponent when at her best. \n“I look forward to these matches. I want to be playing against opponents that are former grand slam champions,” Russian Sharapova said. \n“She’s had success here. She’s had success playing out here in these conditions on these courts. I want to see where I am on that level.” \nTheir last three meetings have gone to three sets and Kerber is expecting another tight affair. Related Coverage Factbox - Maria Sharapova v Angelique Kerber \n”I‘m looking forward to playing against her,“ the German said. ”This is the matches I‘m looking forward to have, especially at the beginning of the year. \n“I had a lot in the last few weeks. I will try to continue my run and playing good like I played also here like the last two matches.” Reporting by Nick Mulvenney in Sydney, editing by Amlan Chakraborty", "external_links": [], "published": "2018-01-19T17:09:00.000+02:00", "crawled": "2018-01-19T17:24:15.010+02:00", "highlightTitle": ""}