{"organizations": [], "uuid": "ee93084fc23d728288d6d0eff6676bcdcc66d085", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1227014365&w=1200&r=LYNXMPEE0U1D0", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-europe-transfers-pellegri/pellegri-follows-treacherous-path-after-transfer-to-monaco-idUKKBN1FK2K3", "country": "US", "domain_rank": 408, "title": "Pellegri follows treacherous path after transfer to Monaco", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T19:22:00.000+02:00", "replies_count": 0, "uuid": "ee93084fc23d728288d6d0eff6676bcdcc66d085"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-europe-transfers-pellegri/pellegri-follows-treacherous-path-after-transfer-to-monaco-idUKKBN1FK2K3", "ord_in_thread": 0, "title": "Pellegri follows treacherous path after transfer to Monaco", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 5:27 PM / Updated 41 minutes ago Pellegri follows treacherous path after transfer to Monaco Brian Homewood 4 Min Read \nZURICH (Reuters) - Pietro Pellegri’s move from Genoa to Monaco was one of the most eye-catching of the January transfer window but previous cases suggest the 16-year-old Italian is walking on a treacherous path. \nMonaco were widely reported to have paid 25 million euros (21.89 million pounds) for Pellegri who showed his enormous potential in September when he became the youngest player to score twice in a Serie A game. \nFootball can be a cruel sport, however, and numerous prodigies, such as Alexandre Pato, Freddy Adu and Reimond Manco, have slipped into relative obscurity in the last decade after an early move to a big club turned sour. \nThe routine is all-too familiar; the youngster moves to a big club, fails to make an immediate or sustained impact and is then loaned to a smaller club where he also disappoints, leading to a downwards spiral. \nBrazilian Pato is one of the most eye-catching cases. At 17, he had an extraordinary professional debut for Internacional when he scored after 94 seconds, set up two more and headed against the post in a 4-1 win over Palmeiras. \nAfter only 10 appearances – the same number that Pellegri made for Genoa -- he joined AC Milan and made a good start, only to suffer a remarkable sequence of muscle injures. \nHe returned to Brazil to join Corinthians in 2013 and, still only 28, now plays for Chinese club Tianjin Quanjian. \nPato’s international career also began well with a debut goal in a friendly against Sweden but that too petered out. He never played at a World Cup and made his last appearance five years ago. \nAdu was compared to Pele in his youth after becoming the youngest athlete to sign a professional contract in the United States at the age of 14 with DC United. \nAfter joining Benfica as an 18-year-old, he played only 11 times for the Portuguese side and ended up as a journeyman, playing for the likes of Finland’s Kuopion Palloseura, Brazil’s Bahia and Turkey’s Caykur Rizespor. EARLY PROMISE \nPeru had great hopes for Reimond Manco when he joined leading Dutch club PSV Eindhoven as an 18-year-old. Barely one year later, he returned home on loan to Juan Aurich and has never recovered his early promise. \nIt was a similar story for Swiss pair Johan Vonlanthen and Nassim Ben Khalifa. \nColombia-born Vonlanthen’s goal against France at Euro 2004 made him the youngest player to score at the European championship finals. A PSV Eindhoven player at the time, he is now with Swiss second tier side FC Wil having reconsidered a decision to retire. \nBen Khalifa helped Switzerland win the world under-17 championship in Nigeria in 2009 and a move to Bundesliga club VfL Wolfsburg seemed a logical progression - until he failed to make the first team. At 26, he is a second-choice striker for Swiss club St Gallen. \nFormer Dutch midfielder Johan Neeskens told Reuters in a recent interview that players were better off staying at their original clubs until their early twenties \n“The rich clubs are always looking for good young players, they offer them a good contract, they offer the mum and dad a job, they give them a house and of course they go,” he said. \n“The problem is that, after moving, the player does not go into the first team, he is maybe in the youth or the reserve team.” \nA more recent case is midfielder Renato Sanches who, having played a key role in Portugal’s Euro 2016 title win as an 18-year-old, is struggling with lowly English Premier League side Swansea City where he was loaned by Bayern Munich. \nTwo days after Pellegri’s move to Monaco was confirmed, 21-year-old Gabriel Barbosa was rejoining Santos in his native Brazil, only 18 months after leaving to join Inter Milan where he warmed the substitutes’ bench before being loaned to Benfica \n“It wasn’t how I expected. I didn’t get many chances,” said Barbosa. “Every player wants to play, enjoy themselves and be happy on the pitch. It didn’t work out so I decided it was the right time to return to Santos.” Writing by Brian Homewood; Editing by Toby Davis", "external_links": [], "published": "2018-01-31T19:22:00.000+02:00", "crawled": "2018-01-31T20:31:49.518+02:00", "highlightTitle": ""}