{"organizations": [], "uuid": "218905a6b7c01c4201acc824f97903585b784a5b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/usa-trump/trump-breaks-with-bannon-says-former-aide-lost-his-mind-idINKBN1ET01H", "country": "US", "domain_rank": 408, "title": "Trump breaks with Bannon, says former aide 'lost his mind'", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T02:32:00.000+02:00", "replies_count": 0, "uuid": "218905a6b7c01c4201acc824f97903585b784a5b"}, "author": "", "url": "https://in.reuters.com/article/usa-trump/trump-breaks-with-bannon-says-former-aide-lost-his-mind-idINKBN1ET01H", "ord_in_thread": 0, "title": "Trump breaks with Bannon, says former aide 'lost his mind'", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "bannon", "sentiment": "negative"}, {"name": "steve holland", "sentiment": "none"}, {"name": "donald trump jr.", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "steve bannon", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}], "organizations": [{"name": "breitbart news", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 12:33 AM / Updated 7 hours ago Trump breaks with Bannon, says former White House aide 'lost his mind' Steve Holland 7     blasted former White House chief strategist Steve Bannon on Wednesday as having “lost his mind” in the fallout over damaging comments Bannon made about Trump’s son Donald Trump Jr. in excerpts from a new book. \nTrump, who had continued to speak privately with Bannon after firing him in August, essentially cut ties with his former aide at least for now in a blistering statement issued after Bannon’s comments came to light. \n“Steve Bannon has nothing to do with me or my presidency. When he was fired, he not only lost his job, he lost his mind,” Trump said. \nTrump had relied heavily on Bannon, chairman of the right-wing Breitbart News website, for advice in the months leading up to his upset victory in the November 2016 election. \nBannon helped Trump shape a populist, anti-establishment message and has been the president’s link to his conservative base of support. It was not clear if the split would push Bannon to be even more aggressive in his campaign against the Republican establishment and whether he would now also target Trump, or would emerge much weaker. \nAccording to excerpts from “Fire and Fury: Inside the Trump White House” by Michael Wolff, to be released on Tuesday, Bannon described a June 2016 meeting with a group of Russians at Trump Tower in New York as “treasonous” and “unpatriotic.” The meeting was arranged by the president’s son and attended by top Trump campaign officials. \nTrump has in the past praised Bannon for his friendship, but the president said in his statement on Wednesday Bannon had little to do with his election victory over Democrat Hillary Clinton, calling him “a staffer who worked for me” after he had already won the Republican nomination. \nThe president said Bannon was to blame for the loss of a Republican-held U.S. Senate seat in Alabama in December when Republican Roy Moore, whose campaign was derailed by accusations of sexual misconduct with teenage girls, lost to Democrat Doug Jones. Trump and Bannon backed Moore in the campaign. \n“Now that he is on his own, Steve is learning that winning isn’t as easy as I make it look. Steve had very little to do with our historic victory, which was delivered by the forgotten men and women of this country. Yet Steve had everything to do with the loss of a Senate seat in Alabama held for more than thirty years by Republicans,” Trump said. \n‘NIGHTMARE OF BACKSTABBING, HARASSING’ \nSenate Majority Leader Mitch McConnell, who had been upset over Trump’s backing of Moore at the urging of Bannon, was clearly pleased Trump was willing to rid himself of the former aide. McConnell’s campaign organization posted on Twitter an image of the normally taciturn senator with a beaming smile. \nDonald Trump Jr. attacked Bannon in a tweet. \n“Steve had the honor of working in the White House & serving the country. Unfortunately, he squandered that privilege & turned that opportunity into a nightmare of backstabbing, harassing, leaking, lying & undermining the President. Steve is not a strategist, he is an opportunist,” he said. \nThe president, an expert at self-promotion, said Bannon was trying to promote himself by “leaking false information to the media to make himself seem far more important than he was.” FILE PHOTO:   talks to chief strategist Steve Bannon during a swearing in ceremony for senior staff at the White House in Washington, U.S. January 22, 2017. REUTERS/Carlos Barria/File Photo \n“Steve was rarely in a one-on-one meeting with me and only pretends to have had influence to fool a few people with no access and no clue, whom he helped write phony books,” said Trump, who famously values loyalty in associates and employees. \nLawyers for the president sent a cease and desist letter to Bannon on Wednesday. They said in the letter, seen by Reuters, Bannon had breached an agreement by communicating with Wolff about Trump, his family members and the campaign and made disparaging remarks about Trump and his family. \nWith elections looming in November that could cost Republicans control of Congress, Trump praised Republican lawmakers and candidates, words likely to be welcomed by McConnell and House of Representatives Speaker Paul Ryan. \n“Like me, they love the United States of America and are helping to finally take our country back and build it up, rather than simply seeking to burn it all down,” Trump said. \n‘BRAIN TRUST’ \nAs with much in the Trump White House, the story that triggered the harsh back-and-forth was an offshoot of the investigation into whether Trump campaign aides colluded with Russia to sway the election to Trump, allegations Trump and Moscow deny. \nBannon expressed derision about the June 2016 meeting in which a Russian lawyer was said to have offered damaging information about Clinton, according to the book. \nThe meeting was attended by Trump’s son, his son-in-law, Jared Kushner, and then-campaign chairman Paul Manafort. Bannon was also quoted as saying he was sure Trump Jr. would have taken the Russians who took part in the meeting to meet his father in Trump Tower. \n“The three senior guys in the campaign thought it was a good idea to meet with a foreign government inside Trump Tower in the conference room on the 25th floor - with no lawyers. They didn’t have any lawyers,” Bannon said in the book in excerpts seen by Reuters. \n“Even if you thought that this was not treasonous, or unpatriotic, or bad shit, and I happen to think it’s all of that, you should have called the FBI immediately,” he said. \nWhen an intermediary proposed the meeting, saying the Russians were offering damaging information about Clinton, Trump Jr. responded in an email: “I love it.” \nBannon was incredulous about the meeting shortly after it was revealed, according to the book, concluding sarcastically: “That’s the brain trust they had.” \nThe Wolff book, parts of which were published by New York magazine, portrayed Trump as shocked that he won the election and said his wife, Melania Trump, was in tears, and “not of joy.” \nWhite House spokeswoman Sarah Sanders called the book “trashy tabloid fiction.” \nThe first lady’s spokeswoman, Stephanie Grisham, said: “The book is clearly going to be sold in the bargain fiction section. Mrs. Trump supported her husband’s decision to run for President and in fact, encouraged him to do so. She was confident he would win and was very happy when he did.” Reporting by Steve Holland; Additional reporting by Doina Chiacu, Jim Oliphant and Brendan O'Brien; Editing by Will Dunham, Peter Cooney and Paul Tait", "external_links": [], "published": "2018-01-04T02:32:00.000+02:00", "crawled": "2018-01-04T03:00:20.000+02:00", "highlightTitle": ""}