{"organizations": [], "uuid": "019595a301d7d0516981827b06d69b21b4d45b37", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/31/reuters-america-update-6-oil-dips-for-third-day-after-build-in-u-s-inventories.html", "country": "US", "domain_rank": 767, "title": "UPDATE 6-Oil dips for third day after build in U.S. inventories", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T18:33:00.000+02:00", "replies_count": 0, "uuid": "019595a301d7d0516981827b06d69b21b4d45b37"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/31/reuters-america-update-6-oil-dips-for-third-day-after-build-in-u-s-inventories.html", "ord_in_thread": 0, "title": "UPDATE 6-Oil dips for third day after build in U.S. inventories", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Oil down as much as 1 percent on the day\n* U.S. inventories up 6.8 mln bbls -EIA\n* EIA also reports strong gasoline demand\n* U.S. production up again, expected to keep rising (New throughout, updates prices and market activity, adds inventory figures, adds additional comments details; new byline, changes dateline, previous LONDON)\nNEW YORK, Jan 31 (Reuters) - Oil prices fell on Wednesday for a third day, after the U.S. Energy Department said oil inventories rose for the first time in nearly three months, though crude futures remained on track for the fifth straight month of gains.\nU.S. oil inventories rose 6.8 million barrels in the week to Jan. 26, after 10 straight weeks of declines, which had dropped supply to its lowest levels since early 2015.\nThe increase far exceeded expectations for a rise of 126,000 barrels. Analysts noted that refiners have been cutting activity while U.S. crude production has kept rising.\nOil prices faded immediately after the news, then retraced some losses when the data showed a surprising 2 million-barrel drawdown in gasoline stocks, suggesting demand for products may be enough to limit seasonal inventory buildup.\nU.S. crude futures were down 42 cents to $64.08 a barrel, a drop of 0.6 percent as of 11:13 a.m. EST (1613 GMT), after hitting a low of $63.92 shortly after the release. Brent crude dropped 39 cents to $68.63 a barrel, a 0.6 percent decline.\n\"Strong demand in the major refined products categories is supporting the entire petroleum complex after the data release,\" said David Thompson, executive vice-president at Powerhouse, an energy-specialized commodities broker in Washington.\nMarch U.S. gasoline futures dipped 0.1 percent to $1.8828 a gallon.\n\"If this week's drop is due to weather-related, unplanned incidents it may not yet herald the onset of turnaround season. However, those days are rapidly approaching,\" Thompson said.\nThe U.S. Energy Information Administration said production rose to 9.92 million bpd, close to the country's record output of 10.04 mln bpd set in 1970.\nProduction is expected to hit 11 million bpd by 2019. This week ExxonMobil said it is wants to triple its production in Texas' Permian Basin to 600,000 bpd within seven years.\nEncouraged by higher crude prices, energy companies added 12 oil rigs last week, the biggest weekly increase since March.\n\"The rig count will only continue to rise and the U.S. system will only become more efficient,\" said Matt Stanley, a fuel broker at Freight Services International in Dubai, adding this was likely to pressure crude prices.\n\"I see a correction on the horizon down towards $60 before the inevitable OPEC minister comes out and talks about new cuts,\" he said.\nWith U.S. shale producers pumping more barrels, the Organization of the Petroleum Exporting Countries and other producers including Russia have agreed to cut their own output by 1.8 million barrels a day until the end of 2018.\n(Additional reporting by Devika Krishna Kumar in New York, Amanda Cooper in London, Henning Gloystein in Singapore and Aaron Sheldrick in Tokyo; Editing by David Gregorio)", "external_links": [], "published": "2018-01-31T18:33:00.000+02:00", "crawled": "2018-01-31T20:31:35.533+02:00", "highlightTitle": ""}