{"organizations": [], "uuid": "95686c2c10bdfc59ba8df72824b83b054a36b9ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-mill-cop-hotels-m-a-cdl/singaporean-billionaire-kwek-fails-in-attempt-to-acquire-mc-hotels-idUSKBN1FF27A", "country": "US", "domain_rank": 408, "title": "UPDATE 2-Singaporean billionaire Kwek fails in attempt to acquire M&C Hotels", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T20:05:00.000+02:00", "replies_count": 0, "uuid": "95686c2c10bdfc59ba8df72824b83b054a36b9ea"}, "author": "", "url": "https://www.reuters.com/article/us-mill-cop-hotels-m-a-cdl/singaporean-billionaire-kwek-fails-in-attempt-to-acquire-mc-hotels-idUSKBN1FF27A", "ord_in_thread": 0, "title": "UPDATE 2-Singaporean billionaire Kwek fails in attempt to acquire M&C Hotels", "locations": [], "entities": {"persons": [{"name": "kwek", "sentiment": "negative"}, {"name": "ben martin", "sentiment": "none"}, {"name": "kwek leng beng", "sentiment": "none"}, {"name": "m&c", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "millennium & copthorne hotels", "sentiment": "none"}, {"name": "cdl", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "m&c", "sentiment": "none"}, {"name": "city developments limited", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 4:31 PM / in an hour Singaporean billionaire Kwek fails in attempt to acquire M&C Hotels Ben Martin 3 Min Read \nLONDON (Reuters) - An attempt by Singaporean billionaire Kwek Leng Beng to take full control of Millennium & Copthorne Hotels (M&C) ( MLC.L ) in a deal valuing the business at 2 billion pounds collapsed after minority shareholders blocked the acquisition. \nKwek’s firm City Developments Limited (CDL), already M&C’s majority investor, secured acceptances from only 47.14 percent of the London-listed hotelier’s minority shareholders for its 620-pence-a-share offer, CDL said in a statement on Friday. \nThat fell short of the 50 percent threshold needed for the bid to become unconditional and meant the offer lapsed, sending M&C shares down 4.7 percent to close at 546 pence. \nThe deadline for investors to accept CDL’s offer was 1300 GMT. \nThe collapse of the deal brings to an end a drawn-out battle between some of M&C’s shareholders and Kwek, who is chairman of the FTSE 250 company as well as CDL. \nThe bid had faced fierce criticism from three minority investors, who rejected it last month on the grounds it did not reflect the value of the company’s property portfolio. \nM&C owns, franchises and operates 137 hotels around the world, including sites in London and New York. CDL has a 65.2 percent shareholding in the company. \nThe trio of International Value Advisers (IVA), MSD Partners and Classic Fund Management had called on other minorities to help them block the deal by spurning the offer. The three investors said in a Dec. 14 letter that they alone accounted for about 37 percent of the shares targeted by Kwek’s bid. \nShareholder dissatisfaction with the potential deal had already forced CDL to sweeten its bid from a 552.5 pence-a-share proposal, although a committee of M&C’s independent directors said in October it was ready to recommend the 552.5 pence offer. \nThe independent directors disclosed on Oct. 19 that they had privately rejected two earlier approaches by CDL in August and September, the first of which was pitched at 510 pence-a-share. \n“Shareholders have now spoken, we respect the result and will continue to work on behalf of all shareholders to deliver long-term value,” M&C’s independent committee said on Friday. \nKwek’s CDL also said it respected the decision taken by the minorities. \n“CDL remains committed to maintaining its controlling shareholding in the offeree, supporting the offeree’s strategy as a hotel owner and operator and the extensive capital expenditure program required to improve performance,” the Singaporean company said. \nA spokesman for IVA and MSD, two of the critics of the bid, declined to comment. Reporting by Ben Martin; Editing by David Evans and Edmund Blair", "external_links": [], "published": "2018-01-26T20:05:00.000+02:00", "crawled": "2018-01-26T21:17:46.024+02:00", "highlightTitle": ""}