{"organizations": [], "uuid": "546b610d220bcf9e076f02445f216460cce172c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-WK063_3j3ca_TOP_20171201103644.jpg", "site_section": "https://www.wsj.com/news/markets", "section_title": "Stock Market &amp; Finance News - Wall Street Journal", "url": "https://www.wsj.com/articles/copper-inches-higher-with-dollar-falling-bullish-growth-forecast-1516635996", "country": "US", "domain_rank": 387, "title": "Copper Inches Higher With Dollar Falling, Bullish Growth Forecast", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.157, "site_type": "news", "published": "2018-01-22T22:24:00.000+02:00", "replies_count": 0, "uuid": "546b610d220bcf9e076f02445f216460cce172c6"}, "author": "Amrith Ramkumar", "url": "https://www.wsj.com/articles/copper-inches-higher-with-dollar-falling-bullish-growth-forecast-1516635996", "ord_in_thread": 0, "title": "Copper Inches Higher With Dollar Falling, Bullish Growth Forecast", "locations": [], "entities": {"persons": [{"name": "william adams", "sentiment": "none"}, {"name": "adams", "sentiment": "none"}], "locations": [{"name": "shanghai", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "comex", "sentiment": "none"}, {"name": "new york mercantile exchange", "sentiment": "none"}, {"name": "fastmarkets", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Copper prices inched higher Monday, boosted by a falling dollar and another bullish projection for global economic growth.\nFront-month copper for January delivery climbed 0.3% to $3.1775 a pound on the Comex division of the New York Mercantile Exchange. Prices have fallen slightly from their nearly four-year highs hit late last year, but some investors expect the industrial metal to keep climbing, supported by strong global demand and supply disruptions.\nSpeculative action in the copper market has recently reached a balance, according to William Adams, head of research at FastMarkets.\n“While the other base metals have worked higher so far this year, copper came off in early January and has since gone sideways. There’s not much bearishness and the falls [in price] are being supported [by buying],” Mr. Adams said.\nWhile inventories in London and Shanghai have risen in recent weeks, speculative bullishness and improving predictions for the health of the Chinese economy in 2018 mean that relatively high copper prices “can continue to be the case,” Mr. Adams said.\nMany analysts link global economic growth and demand for copper and other base metals because the raw materials are used to construct everything from airplanes to smartphones. On Monday, the International Monetary Fund said world output, adjusted for inflation, will grow 3.9% a year in 2018 and 2019, the strongest since 2011, and an upward revision of 0.2 percentage points from the IMF’s forecasts in October.\n“It certainly doesn’t hurt, but there are other narratives that are a little bit stronger,” said Tai Wong, head of metals trading at BMO Capital Markets. Mr. Wong said he thinks the performance of the Chinese economy and the dollar are more relevant factors driving the market. China is the world’s largest base metals consumer, while a weaker dollar makes copper and other dollar-denominated commodities cheaper for overseas buyers.\nWith some investors already anticipating strong Chinese economic performance and a weaker dollar, some analysts wonder how much higher copper prices can go after an approximately 25% gain since the start of June.\n“Neither of those story lines have really changed,” Mr. Wong said. “The narratives haven’t changed, which is why you see some of the metals trade sideways.”\nOn Monday, the WSJ Dollar Index, which tracks the U.S. currency against a basket of 16 others, was down 0.2% following a sixth consecutive week of losses.\nAmong precious metals, front-month gold for January delivery swung between small gains and losses and closed down 0.1% at $1,330.90 a troy ounce. The dollar’s weakness has propelled prices to their highest level since September, but some analysts have cautioned that more investors are anticipating two or three Federal Reserve interest-rate increases this year. Gold struggles to compete with yield-bearing assets like Treasurys as borrowing costs rise.\nWrite to Amrith Ramkumar at amrith.ramkumar@wsj.com and David Hodari at David.Hodari@dowjones.com", "external_links": [], "published": "2018-01-22T22:24:00.000+02:00", "crawled": "2018-01-22T21:51:34.024+02:00", "highlightTitle": ""}