{"organizations": [], "uuid": "c2f286aa780d8e968d73883e33f14c15b3c95393", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226930478&w=1200&r=LYNXMPEE0U0SG", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-usa-trump-utah-mining/a-modern-land-run-trump-move-opens-utah-to-mining-claims-under-1872-law-idUSKBN1FK1MA", "country": "US", "domain_rank": 408, "title": "A modern land run? Trump move opens Utah to mining claims under 1872 law", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T14:00:00.000+02:00", "replies_count": 0, "uuid": "c2f286aa780d8e968d73883e33f14c15b3c95393"}, "author": "", "url": "https://www.reuters.com/article/us-usa-trump-utah-mining/a-modern-land-run-trump-move-opens-utah-to-mining-claims-under-1872-law-idUSKBN1FK1MA", "ord_in_thread": 0, "title": "A modern land run? Trump move opens Utah to mining claims under 1872 law", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "valerie volcovici", "sentiment": "none"}], "locations": [{"name": "utah", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. bureau of land management", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - U.S. President Donald Trump’s decision to withdraw federal protections from millions of acres of Utah wilderness will reopen much of the iconic terrain to gold, silver, copper, and uranium land claims under a Wild West-era mining law, according to federal officials.\nStarting at 6 a.m. on Feb. 2 – the moment Trump’s proclamation reducing the size of the Bears Ears and Grand Staircase-Escalante National Monuments takes effect – private citizens and companies will be allowed to stake claims for hard rock mining in a process governed by the General Mining Law of 1872, according to the U.S. Bureau of Land Management.\nThe process for staking a claim remains much as it did during the Gold Rush: A prospector hammers four poles into the ground corresponding to the four points of a parcel that can be as big as 20 acres, and attaches a written description of the claim onto one of them. A prospector then has 30 days to record the claim at the local BLM office.\n“We’re working on getting information and new monument maps ready for people interested in claims,” said Utah Bureau of Land Management spokesman Michael Richardson.\nThe costs of claiming are low: a $212 filing fee, and an annual maintenance fee of $150. The claims provide prospectors mineral rights, with no requirement to pay the government royalties, but not ownership of the land.\nThe law covers mining for uranium, gold, silver, copper and other precious metals, but excludes coal and petroleum.\nURANIUM RUSH? MAYBE NOT Conservation groups including the Southeastern Utah Wilderness Alliance are concerned that new prospecting in the area could cause environmental harm, but it’s unclear whether the rare opportunity to stake mining claims will draw much interest.\nThe Bears Ears area is known to have uranium deposits, but prices are currently in the dumps - at around $25 a pound compared with $130 a decade ago - due to weak domestic demand from nuclear reactors.\nKyle Kimmerle, whose family owns more than 100 uranium mining claims in Utah, said he won’t be rushing out for new land.\n“The current price of uranium is not likely to warrant any new claiming,” he said. “It would take $60-$70 for me.”\nFILE PHOTO: A man walks over a natural bridge at Butler Wash in Bears Ears National Monument near Blanding, Utah, U.S., October 27, 2017. REUTERS/Andrew Cullen/File Photo U.S.-based uranium mining companies Energy Fuels ( UUUU.A ) and Ur-Energy ( URG.A ) - both of which are pressing the White House for limits on uranium imports - also said they were not currently planning to run out into the Utah wilderness with poles to stake claims.\nEnergy Fuels wrote a letter in May asking the administration to adjust the monument’s boundaries to accommodate its existing operations and said there were “many other known uranium and vanadium deposits located within the [original boundaries] that could provide valuable energy and mineral resources in the future.”\nA spokesman for Energy Fuels said Wednesday that the company has no intention of mining in any of the re-opened land and that its request to adjust boundaries would not have opened up new mining sites.\nWhen Trump announced his decision to shrink the monuments in December, he billed it as a victory for local governments against what he called abusive federal overreach on western lands.\n“Families and communities of Utah know and love this land the best, and you know the best how to take care of your land and how to conserve this land,” he said at the time.\nThe administration has denied that it intended to boost drilling or mining in the region, a policy it has pursued on other federally protected lands.\nThe decision reduced the size of the 1.3-million-acre (0.5 million hectare) Bears Ears monument, created by President Barack Obama in 2016, by more than 80 percent. It slashed the 1.9-million-acre (768,900-hectare) Grand Staircase-Escalante monument, designated by President Bill Clinton in 1996, in half.\nRepublican Congressman John Curtis of Utah has since proposed legislation to withdraw all of Bears Ears region from future mining claims. But any claim submitted under the General Mining law before the legislation passes would be honored, Curtis’ spokeswoman Katie Thompson said.\nDemocratic Congressman Raul Grijalva of Arizona has urged quicker action, pressing Republican colleagues to ask the Interior Department to block mining claims sooner.\n”If we’re serious about preventing mining and drilling in Bears Ears, the administration needs to take concrete action now,” Grijalva said this week.\nConservation groups and Democratic lawmakers, including Senator Tom Udall of New Mexico, have long criticized the General Mining law as out-of-date.\nWriting by Richard Valdmanis; Editing by Brian Thevenot\n ", "external_links": [], "published": "2018-01-31T14:00:00.000+02:00", "crawled": "2018-01-31T14:16:19.000+02:00", "highlightTitle": ""}