{"organizations": [], "uuid": "45b92ae3259e2ae3f55caa195a8ee95156a3170f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224778953&w=1200&r=LYNXMPEE0N0Y6", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-pope-fakenews/pope-condemns-evil-of-fake-news-and-its-use-for-political-gain-idUKKBN1FD1CP", "country": "US", "domain_rank": 408, "title": "Pope condemns 'evil' of fake news and its use for political gain", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T13:13:00.000+02:00", "replies_count": 0, "uuid": "45b92ae3259e2ae3f55caa195a8ee95156a3170f"}, "author": "", "url": "https://uk.reuters.com/article/uk-pope-fakenews/pope-condemns-evil-of-fake-news-and-its-use-for-political-gain-idUKKBN1FD1CP", "ord_in_thread": 0, "title": "Pope condemns 'evil' of fake news and its use for political gain", "locations": [], "entities": {"persons": [{"name": "pope", "sentiment": "negative"}, {"name": "pope francis", "sentiment": "none"}, {"name": "francis", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "philip pullella", "sentiment": "none"}, {"name": "min read  vatican city", "sentiment": "none"}, {"name": "catholic church", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 11:15 AM / Updated 27 minutes ago Pope condemns 'evil' of fake news and its use for political gain Philip Pullella 3 Min Read \nVATICAN CITY (Reuters) - Pope Francis on Wednesday condemned the “evil” of fake news, saying journalists and social media users should shun and unmask manipulative “snake tactics” that foment division to serve political and economic interests. \n“Fake news is a sign of intolerant and hypersensitive attitudes, and leads only to the spread of arrogance and hatred. That is the end result of untruth,” Francis said in the first document by a pope on the subject. \nIt was issued after months of debate on how much fake news may have influenced the 2016 U.S. presidential campaign and the election of President Donald Trump. \nThe document, called “The truth will set you free - Fake news and journalism for peace”, was issued in advance of the Catholic Church’s World Day of Social Communications on May 13. \n“Spreading fake news can serve to advance specific goals, influence political decisions, and serve economic interests,” the pope writes, condemning the “manipulative use of social networks” and other forms of communication. \n“This false but believable news is ‘captious’, inasmuch as it grasps people’s attention by appealing to stereotypes and common social prejudices, and exploiting instantaneous emotions like anxiety, contempt, anger and frustration,” he said. \n“SATAN‘S SERPENT” \nFalse stories spread so quickly that even authoritative denials often could not contain the damage done and many people run the risk of becoming “unwilling accomplices in spreading biased and baseless ideas”, he said. \nHe called for “education for truth” that would help people discern, evaluate and understand news in order to recognise the “sly and dangerous form of seduction that worms its way into the heart with false and alluring arguments”. \nFrancis compared the use of fake news to the Bible story of the devil, who, disguised as a serpent, persuaded Eve to eat the fruit of the forbidden tree. He said she was fed wrong information by Satan. \n“We need to unmask what could be called the ‘snake-tactics’ used by those (purveyors of fake news) who disguise themselves in order to strike at any time and place,” he said. \nHe said the role of journalists was “not just a job, it is a mission” and they had particular responsibility to stem fake news. \n“Amid feeding frenzies and the mad rush for a scoop, they must remember that the heart of information is not the speed with which it is reported or its audience impact, but persons,” he said. \nHe said journalism should be “less concentrated on breaking news than on exploring the underlying causes of conflicts ... a journalism committed to pointing out alternatives to the escalation of shouting matches and verbal violence.” Reporting By Philip Pullella; editing by Ralph Boulton", "external_links": [], "published": "2018-01-24T13:13:00.000+02:00", "crawled": "2018-01-24T13:50:31.015+02:00", "highlightTitle": ""}