{"organizations": [], "uuid": "9df465f53d3197ed35d75cea8cf6fcb0f449df05", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/subjects/euro-zone", "section_title": "Euro Zone | Reuters.com", "url": "https://www.reuters.com/article/us-britain-eu-lawmaker/britain-will-get-stuck-in-long-post-brexit-transition-eu-lawmaker-idUSKBN1FJ2FG", "country": "US", "domain_rank": 408, "title": "Britain will get stuck in long post-Brexit transition - EU lawmaker", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T01:11:00.000+02:00", "replies_count": 0, "uuid": "9df465f53d3197ed35d75cea8cf6fcb0f449df05"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-britain-eu-lawmaker/britain-will-get-stuck-in-long-post-brexit-transition-eu-lawmaker-idUSKBN1FJ2FG", "ord_in_thread": 0, "title": "Britain will get stuck in long post-Brexit transition - EU lawmaker", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "lamberts", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "philippe lamberts", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BRUSSELS (Reuters) - Britain is likely to get stuck in a long transition period in which it will pay the European Union and abide by its laws but have no say in the bloc’s affairs, a European lawmaker handling Brexit said.\nThe EU legislative will have to sign off on any Brexit deal and Philippe Lamberts, one of six in the 750-strong body to deal with Brexit, said any future trade deal between Britain and the EU was irreconcilable with avoiding an Irish border.\n“The transition period will be stretched,” Lamberts told Reuters on Tuesday in referring to a period after Britain’s departure in March, 2019, which the remaining 27 EU states have now agreed should last until the end of 2020.\nMany think time is too short to negotiate a full trade agreement with London to apply from 2021, but the remaining 27 EU states have for now held off on granting Britain a longer transition to mount pressure in the negotiations.\nBritish Prime Minister Theresa May has come under fire from rivals at home who accuse her of largely accepting the transition on the EU’s terms that would see London follow all the bloc’s rules but with no direct way to shape them.\n“Indeed, you are a sort of vassal state during the transition,” said the green Belgian lawmaker, adding the transition could last five years.\n“My best scenario is that we have an extended transition period that spans until the next general election in Britain in 2022 and then we’ll see if any new British government still wants out. Or, if they are satisfied with the Norway option.”\nThough outside the EU, Norway has a very close relationship with the bloc that goes well beyond trade. In exchange, however, it pays the EU for single market access and mostly follows the bloc’s laws, without having the power to decide on them.\n“But then the transition stage could become the final stage,” Lamberts said.\nWhile some of his comments are certain to upset British Brexit supporters, he said the EU could consider London’s concerns about any new EU laws being sealed during the transition, if not give Britain a direct role in deciding them.\nHe said London, which wants to leave the EU’s single market and customs union eventually, would never be able to get an EU trade deal if it sticks to the Good Friday agreement that ended decades of violence on the island split between the Republic of Ireland and Britain’s province of Northern Ireland.\n“I hope no one wants to scrap the Good Friday agreement because that could spell disaster. But then you cannot square that circle unless you keep either Northern Ireland, or the whole of the UK, in the single market,” he said.\nEditing by Matthew Mpoke Bigg\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-31T01:11:00.000+02:00", "crawled": "2018-01-31T04:30:05.003+02:00", "highlightTitle": ""}