{"organizations": [], "uuid": "8e6be6572f31d339434297cce538b07f0df4f53a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/02/confide-platform-windows-android-iphone-watch.png", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/10/confide-messaging-app-apple-iphone-screenshot/", "country": "US", "domain_rank": 1196, "title": "iPhone: Secure Messaging App Confide Can Block Screenshots | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.86, "site_type": "news", "published": "2018-01-10T13:17:00.000+02:00", "replies_count": 0, "uuid": "8e6be6572f31d339434297cce538b07f0df4f53a"}, "author": "Jeff John Roberts", "url": "http://fortune.com/2018/01/10/confide-messaging-app-apple-iphone-screenshot/", "ord_in_thread": 0, "title": "iPhone: Secure Messaging App Confide Can Block Screenshots | Fortune", "locations": [], "entities": {"persons": [{"name": "jeff john roberts", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "apple", "sentiment": "none"}, {"name": "screenshield", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Jeff John Roberts 11:17 AM EST \nConfide, a chat app popular with executives and political staffers for its self-destructing messages, is touting a first-of-its-kind security feature: An ability to detect and block screenshots taken from Apple devices. \nThe app, which gained prominence last year when described as a messaging service for “ paranoid Republicans ,” is aimed at people who want to send texts or videos without leaving a trace of their communications. \nWhile Confide’s self-destructing message feature makes it harder for a recipient to keep a copy, there is always a risk they can take a screenshot. The company has been able to prohibit this on Android, PC, and Mac devices, but says it has been unable to do the same until now on iOS ones. \nIn a news release on Wednesday morning, Confide described the new feature called “ScreenShield” as a patented technological breakthrough and said it will license the anti-screenshot feature to other apps: \nScreenShield is a patent-pending technology that allows you to view an app’s content on your screen but prevents you from taking a screenshot of it. If you try to take a screenshot on Confide, you will now simply capture a blank screen. ScreenShield also protects against other forms of screen capture, including iOS 11 screen recording, AirPlay screen mirroring, QuickTime screen recording as well as taking screenshots from the app switcher or by using Xcode. […] \nWe initially developed ScreenShield for Confide, but quickly realized that it could be used in a large number of apps — far more than we could build ourselves. That’s why we created ScreenShieldKit  — to offer the ScreenShield technology to 3rd-party developers for use in a variety of different apps and categories. \nIn a phone interview with Fortune , Confide CEO Jon Brod said the technology was developed in part from software tools for anti-piracy initiatives that help Apple developers (aapl) prevent users capturing videos. \nGet Data Sheet , Fortune’s technology newsletter. \nApple did not respond to a request for comment about Confide’s technology. \nThe introduction of ScreenShield comes amid a general resurgence of Confide, which first appeared on the scene several years ago as a sort of Snapchat aimed at the corporate set. The app never really took off, however, until late 2016 following the election of President Donald Trump when it was embraced by political staffers looking to communicate on the sly. \nThe publicity about its use among White House aids helped spur further adoption, and Brod says it is also catching on with lawyers, HR managers, and other professionals. He declined, however, to provide details about its user numbers or revenue projections. \nBrod also says it has addressed issues over Confide’s encryption technology, which was criticized as vulnerable early last year by security researchers. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-10T13:17:00.000+02:00", "crawled": "2018-01-10T20:58:59.008+02:00", "highlightTitle": ""}