{"organizations": [], "uuid": "72e6e6fe1e6021806d90a52d1da6ec5eb58fa49d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220885653&w=1200&r=LYNXMPEE0918Y", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-pope-abuse-peru/on-eve-of-trip-pope-orders-takeover-of-catholic-group-in-peru-idUKKBN1EZ29K", "country": "US", "domain_rank": 408, "title": "On eve of trip, Pope orders takeover of Catholic group in Peru", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T19:19:00.000+02:00", "replies_count": 0, "uuid": "72e6e6fe1e6021806d90a52d1da6ec5eb58fa49d"}, "author": "", "url": "https://uk.reuters.com/article/uk-pope-abuse-peru/on-eve-of-trip-pope-orders-takeover-of-catholic-group-in-peru-idUKKBN1EZ29K", "ord_in_thread": 0, "title": "On eve of trip, Pope orders takeover of Catholic group in Peru", "locations": [], "entities": {"persons": [{"name": "francis", "sentiment": "none"}], "locations": [{"name": "peru phili", "sentiment": "none"}, {"name": "peru", "sentiment": "none"}, {"name": "vatican", "sentiment": "none"}, {"name": "chile", "sentiment": "none"}], "organizations": [{"name": "catholic", "sentiment": "negative"}, {"name": "pullella", "sentiment": "none"}, {"name": "vatican city", "sentiment": "none"}, {"name": "catholic church", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 22 PM / Updated 18 minutes ago On eve of trip, Pope orders takeover of Catholic group in Peru Philip Pullella 3 Min Read \nVATICAN CITY (Reuters) - Pope Francis has ordered the Vatican takeover of an elite Catholic society in Peru whose founder is accused of sexually and physically abusing children and former members of the group. FILE PHOTO - Pope Francis talks to diplomats during the traditional exchange of the New Year greetings in the Regal Room at the Vatican January 8, 2018. REUTERS/Andrew Medichini/Pool \nThe move, announced by the Vatican on Wednesday, is the latest step in a saga that has damaged the reputation of the Catholic Church in Peru and comes a week before Francis is due to make his first visit as pope to that country and Chile. \nIt also comes as victims of sexual abuse say he has not done enough to stop root it out. The credibility of a commission he formed in 2014 has been severely damaged by the defections of senior members who accused the Vatican of dragging its feet. \nThe Vatican said the pope had appointed an administrator to run Sodalitium Christianae Vitae (SCV), whose founder Luis Figari, a layman, is due to go on trial in Peru for the sexual abuse of minors later this year. Figari has denied wrongdoing. \nAn internal report by the group last year concluded that Figari, who founded it in 1971 and headed it until 2010, and three other high-ranking ex members had abused 19 minors and 10 adults. \nMost of the cases took place between the 1970s and 2000. \nThe report, published on the group’s website, describes Figari as a charismatic, authoritarian and cult-like leader who publicly humiliated members as part of his strategy to control them. \nPeruvian authorities opened an investigation into Figari in 2015 following the publication of a book into the alleged abuse written by Peruvian investigative journalists Pao Ugaz and Pedro Salinas. \nSalinas once belonged to the ultra-conservative Sodalitium, whose members include businessmen, writers and politicians from Peru’s upper classes and was founded as a part of a backlash to so-called “Liberation Theology”, which took the side of the poor. \nThe Vatican statement said the pope had been following the group’s situation “with worry” for years and had taken the action “after a detailed analysis of all the documentation”. \nIt said the pope was concerned about “the gravity of information regarding the internal system, (religious) formation (of members) and economic and financial management”. \nThe Vatican move came a month after a lawyer for victims said a public prosecutor was seeking pre-trial detention for Figari and three other former leaders of the group. \nThe Vatican, which officially recognised the group in 1997, last year prohibited Figari from having any contact with members. \nThe takeover of the SCV was similar to the action the Vatican took against another conservative group, the Legionaries of Christ. \nAn administrator was appointed to run the Legionaries after its founder, the late Mexican priest Marcial Maciel Degollado, was discovered to have been a sexual abuser with a secret family. \nThe Vatican said the SCV would be run by Colombian Bishop Noel Antonio Londono Buitrago. Reporting by Philip Pullella; Editing by Alison Williams", "external_links": [], "published": "2018-01-10T19:19:00.000+02:00", "crawled": "2018-01-10T19:47:04.017+02:00", "highlightTitle": ""}