{"organizations": [], "uuid": "c44550e674431a592a3d6f2b84cd7bd5e4989f0d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/ebrd-results/development-bank-ebrd-pushes-up-financing-braces-for-profit-hit-idUSL8N1PB5MV", "country": "US", "domain_rank": 408, "title": "Development bank EBRD pushes up financing, braces for profit hit", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T18:43:00.000+02:00", "replies_count": 0, "uuid": "c44550e674431a592a3d6f2b84cd7bd5e4989f0d"}, "author": "", "url": "https://www.reuters.com/article/ebrd-results/development-bank-ebrd-pushes-up-financing-braces-for-profit-hit-idUSL8N1PB5MV", "ord_in_thread": 0, "title": "Development bank EBRD pushes up financing, braces for profit hit", "locations": [], "entities": {"persons": [{"name": "turke", "sentiment": "none"}], "locations": [{"name": "middle east", "sentiment": "none"}, {"name": "mongolia", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "morocco", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "ebrd", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "european bank for reconstruction and development", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 4:44 PM / in 5 minutes Development bank EBRD pushes up financing, braces for profit hit Reuters Staff 3 Min Read (.) \nLONDON, Jan 17 (Reuters) - The European Bank for Reconstruction and Development provided a record amount of financing last year but is bracing for a drop in profits following sharp falls in currencies like Turkey’s lira and Russia’s rouble. \nPreliminary figures for 2017 published by the EBRD on Wednesday showed it invested 9.7 billion euros ($11.85 billion)across a region that has spread from its eastern European heartland as far as Morocco, Mongolia and parts of the Middle East. \nIt is expected to publish profit figures in the coming weeks but with many of the currencies it works in dropping against the bank’s reporting currency - the euro - last year, they are likely to be well down on the near 1 billion euros made in 2016. \nSet up by governments in 1991 to invest in the ex-communist economies of eastern Europe and funded by developed countries, the EBRD has expanded its mandate in the last decade and now operates in more than 30 countries. \nTurkey remained the EBRD’s number one market last year with 1.5 billion euros of investment across 51 projects. But the lira fell 18 percent versus the euro meaning it will take a hit where ‘mark-to-market’ accounting rules are used. \nThe rouble was a similar story. Even though the bank has not been lending in Russia since the 2014 Ukraine crisis, it still has around a 3 billion euro portfolio of Russian investments. The rouble fell almost 7 percent against the euro. \nOther major markets included Egypt, where it doubled its financing to 1.4 billion euros, and Ukraine, where, despite concerns about reform fatigue, investments rose to 740 million euros from 581 million. \nPoland meanwhile, which is considering starting its own development bank, saw its figures drop to 659 million euros from 776 million, which was almost matched by Greece where 614 million was loaned. \nThe EBRD also ramped up efforts on more environmentally friendly investments. It loaned 4.1 billion euros to them compared to 2.8 billion in 2016 helping it hit a 2015 Paris Agreement promise three years early to put 40 percent of its funding into ‘green’ projects. ($1 = 0.8178 euros) Reporting by Marc Jones; Graphic by Saikat Chatterjee; Editing by Peter Graff", "external_links": [], "published": "2018-01-17T18:43:00.000+02:00", "crawled": "2018-01-17T19:28:33.019+02:00", "highlightTitle": ""}