{"organizations": [], "uuid": "df13ba9a52ad03e81af821269277b6dbd7b10669", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-youngevity-hires-dr-sharmila-chatterjee-as-managing-director-for-russia-and-cis-countries.html", "country": "US", "domain_rank": 767, "title": "Youngevity Hires Dr. Sharmila Chatterjee as Managing Director for Russia and CIS Countries", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T16:30:00.000+02:00", "replies_count": 0, "uuid": "df13ba9a52ad03e81af821269277b6dbd7b10669"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-youngevity-hires-dr-sharmila-chatterjee-as-managing-director-for-russia-and-cis-countries.html", "ord_in_thread": 0, "title": "Youngevity Hires Dr. Sharmila Chatterjee as Managing Director for Russia and CIS Countries", "locations": [], "entities": {"persons": [{"name": "sharmila chatterjee", "sentiment": "negative"}, {"name": "chatterjee", "sentiment": "none"}, {"name": "luke taffuri", "sentiment": "none"}], "locations": [{"name": "ca.", "sentiment": "none"}, {"name": "san diego", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "ukraine", "sentiment": "none"}, {"name": "kazakhstan", "sentiment": "none"}], "organizations": [{"name": "globe newswire", "sentiment": "negative"}, {"name": "cis", "sentiment": "negative"}, {"name": "youngevity international, inc.", "sentiment": "neutral"}, {"name": "direct selling industry", "sentiment": "none"}, {"name": "dsa", "sentiment": "none"}, {"name": "vp of international sales & operations", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO, CA., Youngevity International, Inc. (NASDAQ: YGYI ), a leading omni-direct lifestyle company, today announced the hiring of Dr. Sharmila Chatterjee as the Managing Director for Russia and CIS countries. Since 2004, Dr. Chatterjee has broad experience working as a Managing Director in Russia, Kazakhstan and Ukraine for direct selling companies and overseeing the different functional areas of business. Dr Chatterjee also has extensive experience in developing new business, contributing to the growth of her previous company.\n“We are thrilled to have Dr. Chatterjee join our team. Her previous successes and experience should help us address more of Russian’s $2 billion direct selling market.” stated VP of International Sales & Operations, Luke Taffuri. “She has been the Treasurer and an active member of the Russian DSA and has contributed to many articles pertaining to the retail and Direct Selling Industry in the local press. Additionally she has supported many projects aimed at promoting entrepreneurship in Russia and charity programs that are affiliated with Olympic sportsmen. Our executive team all recognized her credentials, track record, experience, and knowledge of the direct selling business as the embodiment of the type of leadership qualities we sought for this extremely important position.”\nDr. Chatterjee stated, “I am very excited to have this opportunity to join Youngevity International as it continues to build upon its international growth strategy. In my opinion, Youngevity is a leader in its innovative approach to the direct sales business, and I felt this was an opportunity to join a company with a clear vision and strategy that combines ecommerce with the important elements of person to person selling. I look forward to building on my experiences and upon the commitment and foundation they have in place in this exciting market.”\nDr. Chatterjee holds a Ph.D. degree in Biophysics from Moscow State University and an MBA from Kingston University Business School, UK. She was voted 10th out of 50 Influential Women in Russia by journal ‘Company’; and was Awarded – Honorary Director 2015, Entrepreneurial Support Development Fund.\nAbout Youngevity International, Inc.\nYoungevity International, Inc. ( NASDAQ : YGYI ), is a leading omni-direct lifestyle company -- offering a hybrid of the direct selling business model, that also offers e-commerce and the power of social selling. Assembling a virtual Main Street of products and services under one corporate entity, Youngevity offers products from the six top selling retail categories: health/nutrition, home/family, food/beverage (including coffee), spa/beauty, apparel/jewelry, as well as innovative services. The Company was formed in the course of the summer 2011 merger of Youngevity Essential Life Sciences with Javalution® Coffee Company (now part of the company's food and beverage division). The resulting company became Youngevity International, Inc. in July 2013. For investor information, please visit YGYI.com . Be sure to like us on Facebook and follow us on Twitter .\nSafe Harbor Statement\nThis release includes forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 on our current expectations and projections about future events. In some cases forward-looking statements can be identified by terminology such as \"may,\" \"should,\" \"potential,\" \"continue,\" \"expects,\" \"anticipates,\" \"intends,\" \"plans,\" \"believes,\" \"estimates,\" \"encouraged\" and similar expressions. The forward-looking statements contained in this press release include statements regarding the expected contribution of Dr. Chatterjee. These forward-looking statements are based on management's expectations and assumptions as of the date of this press release and are subject to a number of risks and uncertainties, many of which are difficult to predict that could cause actual results to differ materially from current expectations and assumptions from those set forth or implied by any forward-looking statements. Important factors that that could cause actual results to differ materially from current expectations include, among others, the ability to successfully conduct business in Russia and the other factors discussed in our Annual Report on Form 10-K for the year ended December 31, 2016 and our subsequent filings with the SEC, including subsequent periodic reports on Forms 10-Q and 8-K. The information in this release is provided only as of the date of this release, and we undertake no obligation to update any forward-looking statements contained in this release based on new information, future events, or otherwise, except as required by law.\nInvestor Relations: Chuck Harbey PCG Advisory Group charbey@pcgadvisory.com P: 646.863.7997\nSource:Youngevity International, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=o0B2koGKr8VkRd1ou5WwRDqCXMNE_KwIgeh2IivJWtY7jcU4iQauSRL9PCmGjFeC", "https://www.globenewswire.com/Tracker?data=-r5dIMm9AEk-Xbo-t3CubLFo6HNjnbceR7xPtrmQMSV5MeLQRz8o0-pBqPurjBA_jSXF01ScBj8vT5zSGPbPQSDeElRPjrZ2XcGTkkIJOyI=", "https://www.globenewswire.com/Tracker?data=5pNUXsCAg_6cmQm0royqMypiMO8TzuLKsDRNdaU5xMydHBwR-E7PGli-stR5yFNBi0QvXidC6EGGiXqOSZh9CunWoJy4DN0xc3Wq8O7DBCI=", "https://www.globenewswire.com/Tracker?data=nFOMmzcvblNMNqZEF_6hU0SoY1XsibxQsdQKRiWWH_fbxLLN_GJHPZReMZbk5pc_4Q57sXt6AU-wNpBNTZdS9Mjhqb6mDREcWjlZkhhblZI=", "https://www.globenewswire.com/Tracker?data=wuXnc2EbcgI7lNPUpV2ACDJziL1dZZxRynjRGGGVHEwoujfD6DOMnil1A5XFBCTm5Z19l-mte-61ozJtQ5pb2g==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/5384eed1-8728-4ee2-8365-80bacb6f115c", "https://www.globenewswire.com/Tracker?data=Gr6Om_N8SPzfG4HUNe0FwjxH7jzfAfxzBGguFmAExCRRgqlWMY8by_eK00nnmbh2oeOiImqkSjIIjAdherxUtfim8p8XMurjeLMP5kqQwLg="], "published": "2018-01-18T16:30:00.000+02:00", "crawled": "2018-01-18T16:32:48.001+02:00", "highlightTitle": ""}