{"organizations": [], "uuid": "431e977d4ef9d8fa41ca92708cb960c2c3353c76", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-eurozone-greece-strike/greeks-strike-over-right-to-strike-paralyse-public-transport-idUKKBN1F40U6", "country": "US", "domain_rank": 408, "title": "Greeks strike over right-to-strike, paralyse public transport", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T10:27:00.000+02:00", "replies_count": 0, "uuid": "431e977d4ef9d8fa41ca92708cb960c2c3353c76"}, "author": "", "url": "https://uk.reuters.com/article/uk-eurozone-greece-strike/greeks-strike-over-right-to-strike-paralyse-public-transport-idUKKBN1F40U6", "ord_in_thread": 0, "title": "Greeks strike over right-to-strike, paralyse public transport", "locations": [], "entities": {"persons": [{"name": "george georgiopoulos", "sentiment": "none"}], "locations": [{"name": "athens", "sentiment": "none"}], "organizations": [{"name": "adedy", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "gsee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 28 AM / Updated an hour ago Greek parliament approves more bailout reforms despite protests George Georgiopoulos , Renee Maltezou 3 Min Read \nATHENS (Reuters) - Greece’s parliament on Monday passed a swathe of reforms demanded by international lenders in exchange for fresh bailout funds, a success for the government but a blow to thousands of people protesting outside. A woman and her dog are seen outside a closed metro station, during a 24-hour strike in Athens, Greece, January 15, 2018. REUTERS/Costas Baltas \nThe bill introduces a new electronic process for foreclosures on overdue loans and arrears to the state, opens up closed professions, restructures family benefits and makes it harder to call a strike. \nAbout 20,000 people rallied outside parliament during the vote. Bus, subway and city rail services were disrupted and some flights were grounded as workers went on strike to protest against the bill. \n“Parliament shouldn’t approve these measures. The government must take them back. They have exhausted us,” said 55-year-old Georgia Koutsoukou, one of the demonstrators. \nAs the vote was in progress, police fired teargas to disperse protesters who hurled stones and petrol bombs at them. The unrest was brief. A man walks outside a closed metro station, during a 24-hour strike in Athens, Greece, January 15, 2018. REUTERS/Costas Baltas \nThe vote means the government has succeeded in securing the reforms before a Jan. 22 meeting of euro zone finance ministers, who are expected to assess if Greece has done enough to conclude the third review of its current, 86 billion-euro (76.44 billion pounds), programme that expires in August. \nConcluding the review will help unlock about 6.5 billion euros in bailout loans. \n“Today’s vote is pivotal for the country to successfully emerge from bailouts in seven months,” Greek Prime Minister Alexis Tsipras told parliament, urging his lawmakers in the 300-seat parliament to approve the bill. \nThe government’s majority increased by one, to 154 seats, following the vote, after an independent deputy said she would join the ruling Syriza party’s parliamentary group. \nBut the legislation is a bitter pill to swallow for Tsipras’ Syriza whose roots are in left-wing labour activism. \nThe new law raises the threshold to call a strike to just over 50 percent, from one-third previously. Business owners and Greece’s creditors hope the measure will limit the frequency of strikes and improve productivity, which lags about 20 percent behind the European Union average. Additional reporting by Lefteris Papadimas and Karolina Tagaris; Editing by Robin Pomeroy", "external_links": [], "published": "2018-01-15T10:27:00.000+02:00", "crawled": "2018-01-15T10:54:44.015+02:00", "highlightTitle": ""}