{"organizations": [], "uuid": "97a9c20055af6f11983d99bf9a1db5eb916bc20d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-green-bancorp-inc-reports-fourth-quarter-and-full-year-2017-financial-results.html", "country": "US", "domain_rank": 767, "title": "Green Bancorp, Inc. Reports Fourth Quarter and Full Year 2017 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.024, "site_type": "news", "published": "2018-01-26T00:05:00.000+02:00", "replies_count": 0, "uuid": "97a9c20055af6f11983d99bf9a1db5eb916bc20d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-green-bancorp-inc-reports-fourth-quarter-and-full-year-2017-financial-results.html", "ord_in_thread": 0, "title": "Green Bancorp, Inc. Reports Fourth Quarter and Full Year 2017 Financial Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "gaap", "sentiment": "negative"}, {"name": "green bancorp, inc", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "2017 Fourth Quarter Significant Items (GAAP)\nFourth quarter 2017 net income totaled $2.6 million, or $0.07 per diluted common share Fourth quarter 2017 results were negatively impacted by the following: $5.8 million in tax expense, or $0.16 per diluted common share, for the deferred tax asset write-off resulting from the 2017 Tax Cuts and Jobs Act $3.1 million in salaries and employee benefits expense, or $2.0 million net of the related tax benefit, which represents $0.05 per diluted common share, for the accelerated vesting of certain performance options $3.2 million in provision for loan losses and $1.1 million in loss on held for sale loans related to the last two E&P relationships in the portfolio impacted EPS by $0.07 per diluted common share (net of tax) Total loans increased $108.2 million, 14.0% annualized from Q3 2017 Nonperforming assets decreased $21.0 million to $71.6 million Energy portfolio declined $33.3 million to $53.0 million; energy production loans represent only 0.63% and oil field services loans only 1.03% of total loans Noninterest-bearing deposits increased $118.9 million during Q4 2017 and now comprise 23.6% of total deposits\n2017 Fourth Quarter Significant Items (Non-GAAP)\nPre-tax, pre-provision operating return on average assets (annualized) was 2.01% for Q4 2017, representing the 3rd consecutive quarter over 2.00%\nHOUSTON, Green Bancorp, Inc. (NASDAQ:GNBC), the bank holding company (“Green Bancorp” or the “Company”) that operates Green Bank, N.A. (“Green Bank”), today announced results for its fourth quarter and twelve months ended December 31, 2017. The Company reported net income for the quarter of $2.6 million, or $0.07 per diluted common share.\nManny Mehos, Chairman and Chief Executive Officer of Green Bancorp, said, “We finished the year with great momentum, highlighted by double digit loan growth and strong improvement in the Bank’s credit quality as non-performing assets were reduced by 23% in the fourth quarter. Looking to 2018, we are well positioned for a return to sustained growth, as we strive to deliver consistent organic growth combined with attractive acquisition opportunities as we continue to build the franchise value of the Bank and deliver value to shareholders.”\nGeoff Greenwade, President of Green Bancorp and Chief Executive Officer of Green Bank, commented, “I am pleased with our results this quarter, as we delivered 14% annualized total loan growth and grew noninterest-bearing deposits by $119 million. Growing core deposits has been a key focus for the Bank and noninterest-bearing deposits now comprise approximately 24% of our deposit base. Importantly, our core markets of Houston, Dallas-Fort Worth and Austin remain robust and we are confident in our outlook for 7-9% loan growth for the 2018 fiscal year.”\nResults of Operations - Quarter Ended December 31, 2017 compared with Quarter Ended September 30, 2017\nNet income for the quarter ended December 31, 2017 was $2.6 million, a decrease of $8.8 million, or 77.0%, compared with $11.4 million for the quarter ended September 30, 2017. Net income per diluted common share was $0.07 for the quarter ended December 31, 2017, compared with $0.31 for the quarter ended September 30, 2017. Net income for the quarter was reduced by income tax expense of $5.8 million due to the deferred tax write-off resulting from the 2017 Tax Cuts and Jobs Act. The deferred tax write-off reduced the carrying value of the net deferred tax asset from 35% to 21%, the new tax rate effective for the Company as of January 1, 2018. Net income was also reduced by $3.1 million in stock-based compensation expense for the accelerated vesting of certain performance options, or $2.0 million net of the related tax benefit. Returns on average assets and average common equity, each on an annualized basis, for the three months ended December 31, 2017 were 0.25% and 2.23%, respectively. Green Bancorp’s efficiency ratio, which represents noninterest expense divided by the sum of net interest income and noninterest income, was 57.87% for the three months ended December 31, 2017. The Company recorded a provision for loan losses of $4.4 million, primarily related to specific reserves, including $3.2 million related to energy loans. In addition, the Company recorded a $1.1 million loss on energy loans held for sale.\nNet interest income before provision for loan losses for the quarter ended December 31, 2017 increased $541 thousand, or 1.5%, to $36.8 million, compared with $36.3 million for the quarter ended September 30, 2017. The increase in net interest income was comprised of a $689 thousand, or 1.5%, increase in interest income, offset by a $148 thousand, or 1.8%, increase in interest expense. Net interest margin for the quarter ended December 31, 2017 was 3.64%, compared with 3.65% for the quarter ended September 30, 2017.\nNoninterest income for the quarter ended December 31, 2017 was $3.9 million, an increase of $538 thousand, or 15.9%, from $3.4 million for the quarter ended September 30, 2017. The increase was primarily due to a $346 thousand increase in gain on sale of guaranteed portion of loans, a $332 thousand decrease in net loss on sale of available for sale securities, and a $196 thousand decrease in net loss on held for sale loans, offset by decreases of $167 thousand in loan fees and a $92 thousand decrease in customer service fees.\nNoninterest expense for the quarter ended December 31, 2017 was $23.6 million, an increase of $3.5 million, or 17.5%, from $20.1 million for the quarter ended September 30, 2017. The increase was primarily due to a $2.5 million increase in salaries and employee benefits, a $361 thousand increase in loan related expenses, a $281 thousand favorable change in the reserve for unfunded commitments and small changes in other expense categories. The $2.5 million increase in salaries and employee benefits includes $3.1 million in stock-based compensation expense for the accelerated vesting of certain performance options, which was offset by a decrease in stock-based compensation expense related to stock appreciation rights.\nTotal loans, which includes loans held for investment and loans held for sale, at December 31, 2017 were $3.2 billion, an increase of $108.2 million, or 3.5%, when compared with September 30, 2017. The increase is primarily due to a $137.6 million increase in commercial and industrial loans, offset by a $28.9 million reduction in construction and land loans. Energy loans of $14.4 million were transferred from loans held for sale to loan held for investment during December 2017. At December 31, 2017, energy loans totaled $53.0 million, or 1.7% of total loans. SBA loans comprise the balance of loans held for sale at December 31, 2017.\nDeposits at December 31, 2017 were $3.4 billion, a decrease of $11.1 million, or 0.3%, compared with September 30, 2017. The net decrease is comprised of decreases of $78.1 million, or 5.8%, in time deposits and $51.9 million, or 3.8%, in interest-bearing transaction and savings deposits, offset by an increase of $118.9 million, or 17.4%, in noninterest-bearing deposits. Noninterest-bearing deposits totaled 23.6% of total deposits at December 31, 2017. Average deposits increased $50.6 million, or 1.5%, for the quarter ended December 31, 2017, compared with the prior quarter.\nAsset Quality - Quarter Ended December 31, 2017 compared with Quarter Ended September 30, 2017\nNonperforming assets totaled $71.6 million, or 1.68% of period end total assets, at December 31, 2017, a decrease of $21.0 million, compared with $92.6 million, or 2.23% of period end total assets, at September 30, 2017. Accruing loans classified as troubled debt restructures and included in the nonperforming asset totals were $13.1 million at December 31, 2017, compared with $18.3 million at September 30, 2017. Real estate acquired through foreclosure totaled $802 thousand at December 31, 2017.\nThe allowance for loan losses was 0.98% of total loans held for investment at December 31, 2017, compared with 1.09% of total loans held for investment at September 30, 2017. At December 31, 2017, the Company’s allowance for loan losses to total loans held for investment, excluding acquired loans that are accounted for under ASC 310-20 and ASC 310-30 and their related allowance, was 1.12%. Further, the allowance for loan losses plus acquired loan net discount to total loans held for investment adjusted for acquired loan net discount was 1.11% as of December 31, 2017.\nThe Company recorded a provision for loan losses of $4.4 million for the quarter ended December 31, 2017 up from the $2.3 million provision for loan losses recorded for the quarter ended September 30, 2017. The fourth quarter of 2017 provision of $4.4 million was primarily related to specific reserves, including $3.2 million related to energy loans. Uncertainty related to loans in the counties affected by Hurricane Harvey has significantly diminished as we continue to monitor the loans initially identified as having some level of impact.\nNet charge-offs were $6.7 million, or 0.22% of average loans, for the quarter ended December 31, 2017, compared with net charge-offs of $811 thousand, or 0.03% of average loans, for the quarter ended September 30, 2017. Net charge-offs included partial charge-offs of $6.2 million in energy production loans.\nResults of Operations – Twelve Months Ended December 31, 2017 compared with Twelve Months Ended December 31, 2016\nNet income for the twelve months ended December 31, 2017 was $34.1 million, compared with net loss of $972 thousand for the twelve months ended December 31, 2016. Net income per diluted common share was $0.92 for the twelve months ended December 31, 2017, compared with net loss per diluted common share of $(0.03) for the twelve months ended December 31, 2016. The Company recorded a provision for loan losses of $14.4 million, which included $10.5 million in reserves on the energy portfolio. The provision for loan losses was $64.7 million for the same period in 2016, which included $50.7 million related to the energy portfolio. Net charge-offs were $9.5 million for the twelve months ended December 31, 2017, compared with net charge-offs of $71.3 million for the twelve months ended December 31, 2016, which included $68.0 million of energy loans.\nNet interest income before provision for loan losses for the twelve months ended December 31, 2017 was $141.0 million, an increase of $7.4 million, or 5.6%, compared with $133.6 million during the twelve months ended December 31, 2016. The increase in net interest income was comprised of a $16.7 million, or 10.7%, increase in interest income, offset by a $9.3 million, or 42.4%, increase in interest expense. The increase in interest income was primarily due to a $11.1 million increase in securities, driven by a $383.3 million, or 133.9%, increase in the average balance and a 81 basis point increase in rate, and a $4.8 million increase in loans due to a 27 basis point increase in rate on an average balance that decreased by $72.6 million. The increase in interest expense was comprised of increases of $3.1 million in subordinated debentures due to the issuance in December 2016, $3.5 million in interest-bearing demand and savings deposits, due to a $169.3 million increase in the average balance and a 20 basis point increase in the average rate, and $1.4 million in time deposits due to a 16 basis point increase in rate on an average balance that decreased by $72.7 million, and $1.3 million in other borrowed funds, due to a $25.0 million increase in balance and a 54 basis point increase in rate. Net interest margin for the twelve months ended December 31, 2017 was 3.60%, compared with 3.65% for the twelve months ended December 31, 2016.\nNoninterest income for the twelve months ended December 31, 2017 was $18.5 million, an increase of $4.3 million, or 30.4%, compared with $14.2 million for the twelve months ended December 31, 2016. This increase was primarily due to a $3.0 million increase in customer service fees, a $2.4 million increase in gain on sale of guaranteed portion of loans and a $541 thousand increase in loan fees, offset by a $904 thousand increase in net loss on loans held for sale and a $708 thousand decrease in derivative income.\nNoninterest expense for the twelve months ended December 31, 2017 was $84.1 million, a decrease of $399 thousand, or 0.5%, compared with $84.5 million for the twelve months ended December 31, 2016. The decrease is primarily due to decreases of $2.5 million in expense for real estate acquired by foreclosure, $2.0 million in loan related expenses and a $1.6 million favorable change in the reserve for unfunded commitments and smaller decreases in other expense categories, offset by a $5.4 million increase in salaries and employee benefits. The increase in salaries and employee benefits includes $3.1 million in stock-based compensation expense for the accelerated vesting of certain performance options recorded in the fourth quarter.\nTotal loans, which includes loans held for investment and loans held for sale, at December 31, 2017 were $3.2 billion, an increase of $75.4 million, or 2.4%, compared with $3.1 billion at December 31, 2016. Average total loans decreased $72.6 million, or 2.3%, to $3.1 billion for the twelve months ended December 31, 2017, compared with $3.1 billion for the same period in 2016. New loan production during the year was offset by the resolution of $42.5 million in energy loans in addition to the resolution of other nonperforming loans and reductions in commercial real estate.\nDeposits at December 31, 2017 were $3.4 billion, an increase of $22.4 million, or 0.7%, compared with December 31, 2016, primarily due to continued opportunities for our portfolio bankers to generate deposit growth within our target markets. Noninterest-bearing demand deposits increased $153.1 million, or 23.6%, during the twelve months ended December 31, 2017, which more than offset decreases of $103.1 million in time deposits and $27.6 million in interest-bearing transaction and savings deposits. Average deposits increased $176.0 million, or 5.5%, to $3.4 billion for the twelve months ended December 31, 2017, compared with the same period of 2016. Average noninterest-bearing deposits for the twelve months ended December 31, 2017 were $690.8 million, an increase of $79.4 million, or 13.0%, compared with the same period in 2016.\nNon-GAAP Financial Measures\nGreen Bancorp’s management uses certain non−GAAP (generally accepted accounting principles) financial measures to evaluate its performance. Specifically, Green Bancorp reviews tangible book value per common share, the tangible common equity to tangible assets ratio, the return on average tangible common equity ratio, allowance for loan losses less allowance for loan losses on acquired loans to total loans held for investment excluding acquired loans, allowance for loan losses plus acquired loans net discount to total loans held for investment adjusted for acquired loan net discount, and pre-tax, pre-provision operating return on average assets. Green Bancorp has included in this Earnings Release information related to these non-GAAP financial measures for the applicable periods presented. Please refer to the “Notes to Financial Highlights” at the end of this Earnings Release for a reconciliation of these non-GAAP financial measures.\nConference Call\nAs previously announced, Green Bancorp will hold a conference call today, January 25, 2018, to discuss its fourth quarter and full year 2017 results at 5:00 p.m. (Eastern Time). The conference call can be accessed live over the phone by dialing 1-877-407-0789, or for international callers, 1-201-689-8562 and requesting to be joined to the Green Bancorp Fourth Quarter and the Full Year 2017 Earnings Conference Call. A replay will be available starting at 8:00 p.m. (Eastern Time) on January 25, 2018 and can be accessed by dialing 1-844-512-2921, or for international callers, 1-412-317-6671. The passcode for the replay is 13675213. The replay will be available until 11:59 p.m. (Eastern Time) on February 1, 2018.\nInterested investors and other parties may also listen to a simultaneous webcast of the conference call by logging onto the investor relations section of the Company's website at investors.greenbank.com . The online replay will remain available for a limited time beginning immediately following the call.\nTo learn more about Green Bancorp, please visit the Company's website at www.greenbank.com . Green Bancorp uses its website as a channel of distribution for material Company information. Financial and other material information regarding Green Bancorp is routinely posted on the Company's website and is readily accessible.\nAbout Green Bancorp, Inc.\nHeadquartered in Houston, Texas, Green Bancorp is a bank holding company that operates Green Bank in the Houston and Dallas metropolitan areas and Austin, Louisville and Honey Grove. Commercial-focused, Green Bank is a nationally chartered bank regulated by the Office of the Comptroller of the Currency, a division of the Department of the Treasury of the United States.\nForward Looking Statement\nThe information presented herein and in other documents filed with or furnished to the Securities and Exchange Commission (the “SEC”), in press releases or other public shareholder communications, or in oral statements made with the approval of an authorized executive officer contains forward looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 giving Green Bancorp’s expectations or predictions of future financial or business performance or conditions. Forward-looking statements are typically identified by words such as “believe,” “expect,” “anticipate,” “intend,” “target,” “estimate,” “continue,” “positions,” “prospects” or “potential,” by future conditional verbs such as “will,” “would,” “should,” “could” or “may”, or by variations of such words or by similar expressions. These forward-looking statements are subject to numerous assumptions, risks and uncertainties which change over time. Forward-looking statements speak only as of the date they are made and we assume no duty to update forward-looking statements.\nYou are cautioned not to place undue reliance on any forward-looking statements, which speak only as of the date such statements are made. These statements may relate to future financial performance, strategic plans or objectives, revenues or earnings projections, or other financial information. By their nature, these statements are subject to numerous uncertainties that could cause actual results to differ materially from those anticipated in the statements.\nStatements about the expected timing, completion and effects of the proposed transactions and all other statements in this release other than historical facts constitute forward-looking statements.\nIn addition to factors previously disclosed in Green Bancorp’s reports filed with the SEC and those identified elsewhere in this communication, the following factors among others, could cause actual results to differ materially from forward-looking statements: changes in asset quality and credit risk; the inability to sustain revenue and earnings growth; changes in interest rates and capital markets; inflation; customer borrowing, repayment, investment and deposit practices; customer disintermediation; the introduction, withdrawal, success and timing of business initiatives; competitive conditions; the inability to realize cost savings or revenues or to implement integration plans and other consequences associated with mergers, acquisitions and divestitures; economic conditions; and the impact, extent and timing of technological changes, capital management activities, and other actions of the Federal Reserve Board and legislative and regulatory actions and reforms.\nAnnualized, pro forma, projected and estimated numbers are used for illustrative purpose only, are not forecasts and may not reflect actual results.\nGreen Bancorp, Inc.\nFinancial Highlights\n(Unaudited)\nDec 31, 2017 Sep 30, 2017 Jun 30, 2017 Mar 31, 2017 Dec 31, 2016 (Dollars in thousands) Period End Balance Sheet Data: Cash and cash equivalents $ 140,681 $ 179,463 $ 134,995 $ 255,581 $ 389,007 Securities 718,814 707,989 718,750 589,468 310,124 Other investments 27,283 22,443 26,002 19,057 18,649 Loans held for sale 7,156 17,673 18,030 17,350 23,989 Loans held for investment 3,190,485 3,071,761 3,123,355 3,012,275 3,098,220 Total Loans 3,197,641 3,089,434 3,141,385 3,029,625 3,122,209 Allowance for loan losses (31,220 ) (33,480 ) (31,991 ) (31,936 ) (26,364 ) Goodwill 85,291 85,291 85,291 85,291 85,291 Core deposit intangibles, net 8,503 8,835 9,215 9,595 9,975 Real estate acquired through foreclosure 802 802 921 1,356 5,220 Premises and equipment, net 24,002 29,733 30,108 30,604 25,674 Other assets 90,119 70,415 71,021 83,359 85,037 Total assets $ 4,261,916 $ 4,160,925 $ 4,185,697 $ 4,072,000 $ 4,024,822 Noninterest-bearing deposits $ 803,210 $ 684,329 $ 683,656 $ 705,480 $ 650,064 Interest-bearing transaction and savings deposits 1,331,601 1,383,514 1,324,307 1,404,988 1,359,187 Certificates and other time deposits 1,262,332 1,340,410 1,352,459 1,305,670 1,365,449 Total deposits 3,397,143 3,408,253 3,360,422 3,416,138 3,374,700 Securities sold under agreements to repurchase 5,173 5,867 5,221 4,316 3,493 Other borrowed funds 325,000 215,000 305,000 150,000 150,000 Subordinated debentures and subordinated notes 47,737 47,596 47,454 47,304 47,492 Other liabilities 23,068 21,898 15,859 16,954 18,655 Total liabilities 3,798,121 3,698,614 3,733,956 3,634,712 3,594,340 Shareholders' equity 463,795 462,311 451,741 437,288 430,482 Total liabilities and equity $ 4,261,916 $ 4,160,925 $ 4,185,697 $ 4,072,000 $ 4,024,822 Green Bancorp, Inc.\nFinancial Highlights\n(Unaudited)\nFor the Quarter Ended For the Twelve Months Ended Dec 31, 2017 Sep 30, 2017 Jun 30, 2017 Mar 31, 2017 Dec 31, 2016 Dec 31, 2017 Dec 31, 2016 (Dollars in thousands) Income Statement Data: Interest income: Loans, including fees $ 39,870 $ 39,549 $ 38,476 $ 36,371 $ 36,469 $ 154,266 $ 149,422 Securities 4,446 4,337 3,928 2,583 1,151 15,294 4,209 Other investments 241 221 197 188 184 847 761 Deposits in financial institutions and fed funds sold 671 432 331 409 522 1,843 1,152 Total interest income 45,228 44,539 42,932 39,551 38,326 172,250 155,544 Interest expense: Transaction and savings deposits 2,588 2,502 2,230 1,978 1,750 9,298 5,749 Certificates and other time deposits 4,017 4,042 3,786 3,607 3,766 15,452 14,022 Subordinated debentures and subordinated notes 1,065 1,059 1,051 1,041 456 4,216 1,182 Other borrowed funds 738 657 560 282 170 2,237 963 Total interest expense 8,408 8,260 7,627 6,908 6,142 31,203 21,916 Net interest income 36,820 36,279 35,305 32,643 32,184 141,047 133,628 Provision for loan losses 4,405 2,300 1,510 6,145 9,500 14,360 64,700 Net interest income after provision for loan losses 32,415 33,979 33,795 26,498 22,684 126,687 68,928 Noninterest income: Customer service fees 2,273 2,365 2,199 2,266 1,755 9,103 6,129 Loan fees 704 871 1,106 834 750 3,515 2,974 (Loss) gain on sale of available-for-sale securities, net — (332 ) 294 — — (38 ) — (Loss) gain on held for sale loans, net (1,098 ) (1,294 ) 222 (138 ) (1,445 ) (2,308 ) (1,404 ) Gain on sale of guaranteed portion of loans, net 1,648 1,302 878 1,927 379 5,755 3,343 Other 401 478 1,000 606 729 2,485 3,154 Total noninterest income 3,928 3,390 5,699 5,495 2,168 18,512 14,196 Noninterest expense: Salaries and employee benefits 14,996 12,487 12,653 12,406 11,804 52,542 47,169 Occupancy 2,069 2,080 2,048 1,997 2,060 8,194 8,319 Professional and regulatory fees 2,241 2,331 1,899 2,397 2,421 8,868 8,958 Data processing 981 924 995 908 1,023 3,808 3,859 Software license and maintenance 636 464 438 489 571 2,027 2,155 Marketing 259 154 163 199 232 775 1,114 Loan related 632 271 301 600 1,464 1,804 3,795 Real estate acquired by foreclosure, net 30 159 223 292 382 704 3,168 Other 1,738 1,197 891 1,551 996 5,377 5,961 Total noninterest expense 23,582 20,067 19,611 20,839 20,953 84,099 84,498 Income (loss) before income taxes 12,761 17,302 19,883 11,154 3,899 61,100 (1,374 ) Provision (benefit) for income taxes 10,142 5,895 6,985 3,942 1,355 26,964 (402 ) Net income (loss) $ 2,619 $ 11,407 $ 12,898 $ 7,212 $ 2,544 $ 34,136 $ (972 )\nGreen Bancorp, Inc.\nFinancial Highlights\n(Unaudited)\nFor the Quarter Ended For the Twelve Months Ended Dec 31, 2017 Sep 30, 2017 Jun 30, 2017 Mar 31, 2017 Dec 31, 2016 Dec 31, 2017 Dec 31, 2016 (Dollars in thousands) Per Share Data (Common Stock): Basic earnings (loss) per common share $ 0.07 $ 0.31 $ 0.35 $ 0.19 $ 0.07 $ 0.92 $ (0.03 ) Diluted earnings (loss) per share 0.07 0.31 0.35 0.19 0.07 0.92 (0.03 ) Book value per common share 12.50 12.46 12.20 11.81 11.64 12.50 11.64 Tangible book value per common share (1) 9.97 9.93 9.65 9.25 9.06 9.97 9.06 Common Stock Data: Shares outstanding at period end 37,103 37,096 37,035 37,015 36,988 37,103 36,988 Weighted average basic shares outstanding for the period 37,103 37,056 37,023 36,990 36,731 37,043 36,677 Weighted average diluted shares outstanding for the period 37,393 37,332 37,264 37,238 36,937 37,297 36,677 Selected Performance Metrics: Return on average assets(2) 0.25 % 1.10 % 1.26 % 0.73 % 0.25 % 0.83 % (0.03 )% Pre-tax, pre-provision operating return on average assets(1)(2) 2.01 2.04 2.09 1.76 1.49 1.97 1.68 Return on average equity(2) 2.23 9.90 11.62 6.71 2.37 7.57 (0.22 ) Return on average tangible common equity(1)(2) 3.02 12.74 15.04 8.88 3.35 9.84 0.02 Efficiency ratio 57.87 50.59 47.83 54.64 60.99 52.71 57.16 Loans to deposits ratio 93.92 90.13 92.95 88.18 91.81 93.92 91.81 Noninterest expense to average assets(2) 2.23 1.93 1.92 2.10 2.10 2.04 2.19 Green Bancorp Capital Ratios: Average shareholders’ equity to average total assets 11.1 % 11.1 % 10.9 % 10.8 % 10.8 % 11.0 % 11.2 % Tier 1 capital to average assets (leverage) 9.5 9.5 9.3 9.1 9.1 9.5 9.1 Common equity tier 1 capital 10.5 10.6 10.1 10.0 9.7 10.5 9.7 Tier 1 capital to risk-weighted assets 10.9 11.0 10.5 10.4 10.1 10.9 10.1 Total capital to risk-weighted assets 12.7 12.9 12.4 12.3 11.8 12.7 11.8 Tangible common equity to tangible assets (1) 8.9 9.1 8.7 8.6 8.5 8.9 8.5 Green Bank Capital Ratios: Tier 1 capital to average assets (leverage) 10.1 % 10.1 % 9.6 % 9.1 % 9.0 % 10.1 % 9.0 % Common equity tier 1 capital 11.6 11.8 10.9 10.4 10.0 11.6 10.0 Tier 1 capital to risk-weighted assets 11.6 11.8 10.9 10.4 10.0 11.6 10.0 Total capital to risk-weighted assets 12.4 12.6 11.7 11.2 10.8 12.4 10.8 (1) Refer to “Notes to Financial Highlights” at the end of this Earnings Release for a reconciliation of this non-GAAP financial measure.\n(2) Annualized ratio.\nGreen Bancorp, Inc.\nFinancial Highlights\n(Unaudited)\nFor the Quarter Ended December 31, 2017 September 30, 2017 December 31, 2016 Average\nOutstanding\nBalance Interest\nEarned/\nInterest\nPaid Average\nYield/\nRate Average\nOutstanding\nBalance Interest\nEarned/\nInterest\nPaid Average\nYield/\nRate Average\nOutstanding\nBalance Interest\nEarned/\nInterest\nPaid Average\nYield/\nRate (Dollars in thousands) Assets Interest-Earning Assets: Loans $ 3,082,005 $ 39,870 5.13 % $ 3,071,039 $ 39,549 5.11 % $ 3,077,242 $ 36,469 4.71 % Securities 713,137 4,446 2.47 712,431 4,337 2.42 316,223 1,151 1.45 Other investments 23,359 241 4.09 26,009 221 3.37 18,627 184 3.93 Interest earning deposits in financial institutions and federal funds sold 197,454 671 1.35 134,868 432 1.27 356,367 522 0.58 Total interest-earning assets 4,015,955 45,228 4.47 % 3,944,347 44,539 4.48 % 3,768,459 38,326 4.05 % Allowance for loan losses (33,708 ) (32,395 ) (34,994 ) Noninterest-earning assets 221,858 219,754 240,779 Total assets $ 4,204,105 $ 4,131,706 $ 3,974,244 Liabilities and Shareholders’ Equity Interest-bearing liabilities: Interest-bearing demand and savings deposits $ 1,387,873 $ 2,588 0.74 % $ 1,349,701 $ 2,502 0.74 % $ 1,330,734 $ 1,750 0.52 % Certificates and other time deposits 1,290,277 4,017 1.24 1,343,732 4,042 1.19 1,382,930 3,766 1.08 Securities sold under agreements to repurchase 5,153 2 0.15 5,943 2 0.13 3,469 — — Other borrowed funds 237,989 736 1.23 227,936 655 1.14 150,000 170 0.45 Subordinated debentures and subordinated notes 47,673 1,065 8.86 47,531 1,059 8.84 22,400 456 8.10 Total interest-bearing liabilities 2,968,965 8,408 1.12 % 2,974,843 8,260 1.10 % 2,889,533 6,142 0.85 % Noninterest-bearing liabilities: Noninterest-bearing demand deposits 745,707 679,851 636,218 Other liabilities 23,574 19,709 20,943 Total liabilities 3,738,246 3,674,403 3,546,694 Shareholders’ equity 465,859 457,303 427,550 Total liabilities and shareholders’ equity $ 4,204,105 $ 4,131,706 $ 3,974,244 Net interest rate spread 3.35 % 3.38 % 3.20 % Net interest income and margin (1) $ 36,820 3.64 % $ 36,279 3.65 % $ 32,184 3.40 % (1) Net interest margin is equal to net interest income divided by interest-earning assets.\nGreen Bancorp, Inc.\nFinancial Highlights\n(Unaudited)\n2017 2016 Average\nOutstanding\nBalance Interest\nEarned/\nInterest\nPaid Average\nYield/\nRate Average\nOutstanding\nBalance Interest\nEarned/\nInterest\nPaid Average\nYield/\nRate (Dollars in thousands) Assets Interest-Earning Assets: Loans $ 3,065,360 $ 154,266 5.03 % $ 3,137,994 $ 149,422 4.76 % Securities 669,588 15,294 2.28 286,299 4,209 1.47 Other investments 22,823 847 3.71 21,052 761 3.61 Interest earning deposits in financial institutions and federal funds sold 160,810 1,843 1.15 211,950 1,152 0.54 Total interest-earning assets 3,918,581 172,250 4.40 % 3,657,295 155,544 4.25 % Allowance for loan losses (31,471 ) (39,417 ) Noninterest-earning assets 225,674 242,930 Total assets $ 4,112,784 $ 3,860,808 Liabilities and Shareholders’ Equity Interest-bearing liabilities: Interest-bearing demand and savings deposits $ 1,370,503 $ 9,298 0.68 % $ 1,201,198 $ 5,749 0.48 % Certificates and other time deposits 1,317,180 15,452 1.17 1,389,834 14,022 1.01 Securities sold under agreements to repurchase 4,770 7 0.15 3,605 4 0.11 Other borrowed funds 211,407 2,230 1.05 186,453 959 0.51 Subordinated debentures 47,533 4,216 8.87 15,623 1,182 7.57 Total interest-bearing liabilities 2,951,393 31,203 1.06 % 2,796,713 21,916 0.78 % Noninterest-bearing liabilities: Noninterest-bearing demand deposits 690,786 611,388 Other liabilities 19,458 18,784 Total liabilities 3,661,637 3,426,885 Shareholders’ equity 451,147 433,923 Total liabilities and shareholders’ equity $ 4,112,784 $ 3,860,808 Net interest rate spread 3.34 % 3.47 % Net interest income and margin (1) $ 141,047 3.60 % $ 133,628 3.65 % (1) Net interest margin is equal to net interest income divided by interest-earning assets.\nGreen Bancorp, Inc.\nFinancial Highlights\n(Unaudited)\nYield Trend\nFor the Quarter Ended Dec 31, 2017 Sep 30, 2017 Jun 30, 2017 Mar 31, 2017 Dec 31, 2016 Average yield on interest-earning assets: Loans, including fees 5.13 % 5.11 % 5.02 % 4.86 % 4.71 % Securities 2.47 2.42 2.32 1.83 1.45 Other investments 4.09 3.37 3.45 4.03 3.93 Interest-earning deposits in financial institutions and federal funds sold 1.35 1.27 1.06 0.89 0.58 Total interest-earning assets 4.47 % 4.48 % 4.42 % 4.21 % 4.05 % Average rate on interest-bearing liabilities: Interest-bearing transaction and savings 0.74 % 0.74 % 0.66 % 0.58 % 0.52 % Certificates and other time deposits 1.24 1.19 1.16 1.10 1.08 Other borrowed funds 1.20 1.11 1.01 0.70 0.44 Subordinated debentures 8.86 8.84 8.90 8.88 8.10 Total interest-bearing liabilities 1.12 % 1.10 % 1.04 % 0.96 % 0.85 % Net interest rate spread 3.35 % 3.38 % 3.38 % 3.25 % 3.20 % Net interest margin (1) 3.64 % 3.65 % 3.63 % 3.47 % 3.40 % (1) Net interest margin is equal to net interest income divided by interest-earning assets.\nSupplemental Yield Trend\nFor the Quarter Ended Dec 31, 2017 Sep 30, 2017 Jun 30, 2017 Mar 31, 2017 Dec 31, 2016 Average yield on loans, excluding fees and discounts (2) 4.74 % 4.69 % 4.59 % 4.42 % 4.29 % Average cost of interest-bearing deposits 0.98 0.96 0.90 0.84 0.81 Average cost of total deposits, including noninterest-bearing 0.77 0.77 0.72 0.68 0.66 (2) Average yield on loans, excluding fees and discounts, is equal to loan interest income divided by average loan principal.\nGreen Bancorp, Inc.\nFinancial Highlights\n(Unaudited)\nPortfolio Composition\nDec 31, 2017 Sep 30, 2017 Jun 30, 2017 Mar 31, 2017 Dec 31, 2016 (Dollars in thousands) Period End Balances Commercial & industrial $ 1,286,496 40.3 % $ 1,148,850 37.4 % $ 1,144,332 36.6 % $ 1,012,982 33.6 % $ 1,053,925 34.0 % Real Estate: Owner occupied commercial 415,230 13.0 408,398 13.3 407,317 13.0 415,595 13.8 394,210 12.7 Commercial 1,067,779 33.5 1,068,742 34.8 1,109,237 35.5 1,129,031 37.5 1,143,751 36.9 Construction, land & land development 164,952 5.2 193,856 6.3 201,992 6.5 201,946 6.7 249,704 8.1 Residential mortgage 238,580 7.5 235,089 7.7 239,834 7.7 241,839 8.0 245,191 7.9 Consumer and Other 17,448 0.5 16,826 0.5 20,643 0.7 10,882 0.4 11,439 0.4 Total loans held for investment $ 3,190,485 100.0 % $ 3,071,761 100.0 % $ 3,123,355 100.0 % $ 3,012,275 100.0 % $ 3,098,220 100.0 % Deposits: Noninterest-bearing $ 803,210 23.6 % $ 684,329 20.1 % $ 683,656 20.3 % $ 705,480 20.7 % $ 650,064 19.3 % Interest-bearing transaction 200,769 5.9 201,860 5.9 207,106 6.2 208,213 6.1 168,994 5.0 Money market 1,041,954 30.7 1,085,433 31.9 1,016,453 30.3 1,089,699 31.9 1,084,350 32.1 Savings 88,878 2.6 96,221 2.8 100,748 3.0 107,076 3.1 105,843 3.1 Certificates and other time deposits 1,262,332 37.2 1,340,410 39.3 1,352,459 40.2 1,305,670 38.2 1,365,449 40.5 Total deposits $ 3,397,143 100.0 % $ 3,408,253 100.0 % $ 3,360,422 100.0 % $ 3,416,138 100.0 % $ 3,374,700 100.0 % Loan to Deposit Ratio 93.9 % 90.1 % 92.9 % 88.2 % 91.8 %\nGreen Bancorp, Inc.\nFinancial Highlights\n(Unaudited)\nAsset Quality\nAs of and for the Quarter Ended For the Twelve Months Ended Dec 31, 2017 Sep 30, 2017 Jun 30, 2017 Mar 31, 2017 Dec 31, 2016 Dec 31, 2017 Dec 31, 2016 (Dollars in thousands) Nonperforming Assets: Nonaccrual loans $ 47,892 $ 43,656 $ 43,257 $ 59,338 $ 66,673 $ 47,892 $ 66,673 Accruing loans 90 or more days past due 375 4,828 2,651 5,500 1,169 375 1,169 Restructured loans—nonaccrual 9,446 10,555 19,362 10,276 10,133 9,446 10,133 Restructured loans—accrual 13,093 18,251 7,637 11,068 16,518 13,093 16,518 Total nonperforming loans held for investment 70,806 77,290 72,907 86,182 94,493 70,806 94,493 Nonperforming loans held for sale — 14,552 1,700 — 6,598 — 6,598 Real estate acquired through foreclosure 802 802 921 1,356 5,220 802 5,220 Total nonperforming assets $ 71,608 $ 92,644\n$ 75,528\n$ 87,538\n$ 106,311\n$ 71,608 $ 106,311\nCharge-offs: Commercial and industrial $ (6,447 ) $ (840 ) $ (466 ) $ (1,312 ) $ (17,378 ) $ (9,065 ) $ (68,383 ) Owner occupied commercial real estate (126 ) — (961 ) — (250 ) (1,087 ) (1,405 ) Commercial real estate — — — — — — (492 ) Construction, land & land development — — — (95 ) (1,631 ) (95 ) (1,631 ) Residential mortgage (19 ) — — — (30 ) (19 ) (548 ) Other consumer (112 ) (10 ) (126 ) (8 ) (15 ) (256 ) (126 ) Total charge-offs (6,704 ) (850 ) (1,553 ) (1,415 ) (19,304 ) (10,522 ) (72,585 ) Recoveries: Commercial and industrial $ 6 $ 12 $ 73 $ 585 $ 206 $ 676 $ 1,000 Owner occupied commercial real estate — — — 4 — 4 17 Commercial real estate 1 4 3 — — 8 — Construction, land & land development 2 1 — 74 5 77 84 Residential mortgage 27 21 16 57 33 121 155 Other consumer 3 1 6 122 13 132 46 Total recoveries 39 39 98 842 257 1,018 1,302 Net (charge-offs) recoveries $ (6,665 ) $ (811 ) $ (1,455 ) $ (573 ) $ (19,047 ) $ (9,504 ) $ (71,283 ) Allowance for loan losses at end of period $ 31,220 $ 33,480 $ 31,991 $ 31,936 $ 26,364 $ 31,220 $ 26,364 Asset Quality Ratios: Nonperforming assets to total assets 1.68 % 2.23 % 1.80 % 2.15 % 2.64 % 1.68 % 2.64 % Nonperforming loans to total loans held for investment 2.22 2.52 2.33 2.86 3.05 2.22 3.05 Total classified assets to total regulatory capital 28.61 32.21 28.70 38.00 39.09 28.61 39.09 Allowance for loan losses to total loans held for investment 0.98 1.09 1.02 1.06 0.85 0.98 0.85 Net charge-offs (recoveries) to average loans outstanding 0.22 0.03 0.05 0.02 0.63 0.31 2.28\nGreen Bancorp, Inc.\nNotes to Financial Highlights\n(Unaudited)\nWe identify certain financial measures discussed in this release as being “non‑GAAP financial measures.” In accordance with the SEC’s rules, we classify a financial measure as being a non‑GAAP financial measure if that financial measure excludes or includes amounts, or is subject to adjustments that have the effect of excluding or including amounts, that are included or excluded, as the case may be, in the most directly comparable measure calculated and presented in accordance with generally accepted accounting principles as in effect from time to time in the United States in our statements of income, balance sheet or statements of cash flows. Non‑GAAP financial measures do not include operating and other statistical measures or ratios or statistical measures calculated using exclusively either financial measures calculated in accordance with GAAP, operating measures or other measures that are not non‑GAAP financial measures or both.\nThe non‑GAAP financial measures that we discuss in this release should not be considered in isolation or as a substitute for the most directly comparable or other financial measures calculated in accordance with GAAP. Moreover, the manner in which we calculate the non‑GAAP financial measures that we discuss in this release may differ from that of other companies reporting measures with similar names. You should understand how such other banking organizations calculate their financial measures similar or with names similar to the non‑GAAP financial measures we have discussed in this release when comparing such non‑GAAP financial measures.\nTangible Book Value Per Common Share. Tangible book value is a non‑GAAP measure generally used by financial analysts and investment bankers to evaluate financial institutions. We calculate: (a) tangible common equity as shareholders’ equity less goodwill and core deposit intangibles, net of accumulated amortization; and (b) tangible book value per common share as tangible common equity (as described in clause (a)) divided by shares of common stock outstanding. For tangible book value, the most directly comparable financial measure calculated in accordance with GAAP is our book value.\nWe believe that this measure is important to many investors in the marketplace who are interested in changes from period to period in book value per common share exclusive of changes in intangible assets. Goodwill and other intangible assets have the effect of increasing total book value while not increasing our tangible book value.\nThe following table reconciles, as of the dates set forth below, total shareholders’ equity to tangible common equity and presents our tangible book value per common share compared with our book value per common share:\nDec 31, 2017 Sep 30, 2017 Jun 30, 2017 Mar 31, 2017 Dec 31, 2016 (Dollars in thousands, except per share data) Tangible Common Equity Total shareholders’ equity $ 463,795 $ 462,311 $ 451,741 $ 437,288 $ 430,482 Adjustments: Goodwill 85,291 85,291 85,291 85,291 85,291 Core deposit intangibles 8,503 8,835 9,215 9,595 9,975 Tangible common equity $ 370,001 $ 368,185 $ 357,235 $ 342,402 $ 335,216 Common shares outstanding (1) 37,103 37,096 37,035 37,015 36,988 Book value per common share (1) $ 12.50 $ 12.46 $ 12.20 $ 11.81 $ 11.64 Tangible book value per common share (1) $ 9.97 $ 9.93 $ 9.65 $ 9.25 $ 9.06 (1) Excludes the dilutive effect of common stock issuable upon exercise of outstanding stock options. The number of exercisable options outstanding was 754,110 as of Dec 31, 2017; 467,257 as of Sep 30, 2017; 465,281 as of Jun 30, 2017; 472,653 as of Mar 31, 2017; and 493,241 as of Dec 31, 2016.\nGreen Bancorp, Inc.\nNotes to Financial Highlights\n(Unaudited)\nTangible Common Equity to Tangible Assets . Tangible common equity to tangible assets is a non‑GAAP measure generally used by financial analysts and investment bankers to evaluate financial institutions. We calculate: (a) tangible common equity as shareholders’ equity less goodwill and core deposit intangibles, net of accumulated amortization; (b) tangible assets as total assets less goodwill and core deposit intangibles, net of accumulated amortization; and (c) tangible common equity to tangible assets as tangible common equity (as described in clause (a)) divided by tangible assets (as described in clause (b)). For common equity to tangible assets, the most directly comparable financial measure calculated in accordance with GAAP is total shareholders’ equity to total assets.\nWe believe that this measure is important to many investors in the marketplace who are interested in the relative changes from period to period in common equity and total assets, each exclusive of changes in intangible assets. Goodwill and other intangible assets have the effect of increasing both total shareholders’ equity and assets while not increasing our tangible common equity or tangible assets.\nThe following table reconciles, as of the dates set forth below, total shareholders’ equity to tangible common equity and total assets to tangible assets and presents our tangible common equity to tangible assets:\nDec 31, 2017 Sep 30, 2017 Jun 30, 2017 Mar 31, 2017 Dec 31, 2016 (Dollars in thousands) Tangible Common Equity Total shareholders’ equity $ 463,795 $ 462,311 $ 451,741 $ 437,288 $ 430,482 Adjustments: Goodwill 85,291 85,291 85,291 85,291 85,291 Core deposit intangibles 8,503 8,835 9,215 9,595 9,975 Tangible common equity $ 370,001 $ 368,185 $ 357,235 $ 342,402 $ 335,216 Tangible Assets Total assets $ 4,261,916 $ 4,160,925 $ 4,185,697 $ 4,072,000 $ 4,024,822 Adjustments: Goodwill 85,291 85,291 85,291 85,291 85,291 Core deposit intangibles 8,503 8,835 9,215 9,595 9,975 Tangible assets $ 4,168,122 $ 4,066,799 $ 4,091,191 $ 3,977,114 $ 3,929,556 Tangible Common Equity to Tangible Assets 8.88 % 9.05 % 8.73 % 8.61 % 8.53 % Green Bancorp, Inc.\nNotes to Financial Highlights\n(Unaudited)\nReturn on Average Tangible Common Equity . Return on average tangible common equity is a non‑GAAP measure generally used by financial analysts and investment bankers to evaluate financial institutions. We calculate: (a) average tangible common equity as average shareholders’ equity less average goodwill and average core deposit intangibles, net of accumulated amortization; (b) net income less the effect of intangible assets as net income plus amortization of core deposit intangibles, net of taxes; and (c) return (as described in clause (a)) divided by average tangible common equity (as described in clause (b)). For return on average tangible common equity, the most directly comparable financial measure calculated in accordance with GAAP is return on average equity.\nWe believe that this measure is important to many investors in the marketplace who are interested in the return on common equity, exclusive of the impact of intangible assets. Goodwill and other intangible assets, including core deposit intangibles, have the effect of increasing total shareholders’ equity, while not increasing our tangible common equity. This measure is particularly relevant to acquisitive institutions who may have higher balances in goodwill and other intangible assets than non-acquisitive institutions.\nThe following table reconciles, as of the dates set forth below, average tangible common equity to average common equity and net income excluding amortization of core deposit intangibles, net of tax to net income and presents our return on average tangible common equity:\nAs of and for the Quarter Ended For the Twelve Months Ended Dec 31, 2017 Sep 30, 2017 Jun 30, 2017 Mar 31, 2017 Dec 31, 2016 Dec 31, 2017 Dec 31, 2016 (Dollars in thousands) Net income (loss) adjusted for amortization of core deposit intangibles Net income (loss) $ 2,619 $ 11,407 $ 12,898 $ 7,212 $ 2,544 $ 34,136 $ (972 ) Adjustments: Plus: Amortization of core deposit intangibles 330 380 380 380 382 1,472 1,587 Less: Tax benefit at the statutory rate 116 133 133 133 134 515 555 Net income (loss) adjusted for amortization of core deposit intangibles $ 2,833 $ 11,654 $ 13,145 $ 7,459 $ 2,792 $ 35,093 $ 60 Average Tangible Common Equity Total average shareholders’ equity $ 465,859 $ 457,303 $ 445,334 $ 435,695 $ 427,550 $ 451,147 $ 433,923 Adjustments: Average goodwill 85,291 85,291 85,291 85,291 85,291 85,291 85,291 Average core deposit intangibles 8,661 9,065 9,461 9,844 10,223 9,254 10,818 Average tangible common equity $ 371,907 $ 362,947 $ 350,582 $ 340,560 $ 332,036 $ 356,602 $ 337,814 Return on Average Tangible Common Equity (Annualized) 3.02 % 12.74 % 15.04 % 8.88 % 3.35 % 9.84 % 0.02 %\nGreen Bancorp, Inc.\nNotes to Financial Highlights\n(Unaudited)\nAllowance for Loan Losses less Allowance for Loan Losses on Acquired Loans to Total Loans Held for Investment excluding Acquired Loans. The allowance for loan losses less allowance for loan losses on acquired loans to total loans held for investment excluding acquired loans is a non‑GAAP measure used by management to evaluate the Company’s financial condition. Due to the application of purchase accounting, we use this non-GAAP ratio that excludes that impact of these items to evaluate our allowance for loan losses to total loans held for investment. We calculate: (a) total allowance for loan losses less allowance for loan losses on acquired loans as allowance for loan losses less the allowance for loan losses on acquired loans; (b) total loans held for investment excluding acquired loans as total loans held for investment less the carrying value of acquired loans accounted for under ASC topics 310-20 and 310-30; and (c) allowance for loan losses less allowance for loan losses on acquired loans to total loans held for investment excluding acquired loans as the allowance for loan losses less allowance for loan losses on acquired loans (as calculated in clause (a)) divided by total loans held for investment excluding acquired loans (as calculated in clause (b)). For allowance for loan losses less allowance for loan losses on acquired loans to total loans held for investment excluding acquired loans, the most directly comparable financial measure calculated in accordance with GAAP is allowance for loan losses to total loans held for investment.\nWe believe that this measure is important to many investors in the marketplace who are interested in the relative changes from period to period in the allowance for loan losses less allowance for loan losses on acquired loans to total loans held for investment excluding acquired loans. The acquired loans may have a premium or discount associated with them that includes a potential credit loss component with similar characteristics to the allowance for loan losses. This measure reports the allowance for loan loss coverage to only those loans not accounted for pursuant to ASC topics 310-20 and 310-30 which may assist the investor in evaluating the allowance coverage of loans excluding acquired loans.\nThe following table reconciles, as of the dates set forth below, allowance for loan losses less allowance for loan losses on acquired loans to total loans held for investment excluding acquired loans:\nDec 31, 2017 Sep 30, 2017 Jun 30, 2017 Mar 31, 2017 Dec 31, 2016 (Dollars in thousands) Allowance for loan losses less allowance for loan losses on acquired loans Allowance for loan losses $ 31,220 $ 33,480 $ 31,991 $ 31,936 $ 26,364 Less: Allowance for loan losses on acquired loans 1,242 1,326 1,462 2,825 2,509 Total allowance for loan losses less allowance for loan losses on acquired loans $ 29,978 $ 32,154 $ 30,529 $ 29,111 $ 23,855 Total loans held for investment excluding acquired loans Total loans held for investment $ 3,190,485 $ 3,071,761 $ 3,123,355 $ 3,012,275 $ 3,098,220 Less: Carrying value of acquired loans accounted for under ASC Topics 310-20 and 310-30 513,994 586,522 646,601 730,064 796,292 Total loans held for investment excluding acquired loans $ 2,676,491 $ 2,485,239 $ 2,476,754 $ 2,282,211 $ 2,301,928 Allowance for loan losses less allowance for loan losses on acquired loans to total loans\nheld for investment excluding acquired loans 1.12 % 1.29 % 1.23 % 1.28 % 1.04 %\nGreen Bancorp, Inc.\nNotes to Financial Highlights\n(Unaudited)\nAllowance for Loan Losses plus Acquired Loan Net Discount to Total Loans Held for Investment adjusted for Acquired Loan Net Discount. Allowance for loan losses plus acquired loan net discount to total loans held of investment adjusted for acquired loan net discount is a non‑GAAP measure used by management to evaluate the Company’s financial condition. We calculate: (a) allowance for loan losses plus acquired loan net discount as allowance for loan losses plus acquired loan net discount, net of accumulated amortization; (b) total loans held for investment adjusted for acquired loan net discount as total loans held for investment plus acquired loan net discount, net of accumulated amortization; and (c) allowance for loan losses plus acquired loan net discount to total loans held for investment adjusted for acquired loan net discount as allowance for loan losses plus acquired loan net discount (as calculated in clause (a)) divided by total loans held for investment adjusted for acquired loan net discount (as calculated in clause (b)). For allowance for loan losses to total loans excluding acquired loans, the most directly comparable financial measure calculated in accordance with GAAP is allowance for loan losses to total loans.\nWe believe that this measure is important to many investors in the marketplace who are interested in the relative changes from period to period in the allowance for loan losses plus the acquired loan net discount to total loans held for investment adjusted for the acquired loan net discount. This measure reports the combined allowance for loan loss and acquired loan net discount (or premium) as a percentage of loans held for investment inclusive of the acquired loan net discount (or premium) which may assist the investor in evaluating allowance coverage on loans inclusive of additional discount or premium resulting from purchase accounting adjustments.\nThe following table reconciles, as of the dates set forth below, allowance for loan losses plus acquired loans net discount to total loans adjusted for acquired loan net discount:\nDec 31, 2017 Sep 30, 2017 Jun 30, 2017 Mar 31, 2017 Dec 31, 2016 (Dollars in thousands) Allowance for loan losses plus acquired loan net discount Allowance for loan losses at end of period $ 31,220 $ 33,480 $ 31,991 $ 31,936 $ 26,364 Plus: Net discount on acquired loans 4,371 5,112 6,240 7,314 9,937 Total allowance plus acquired loan net discount $ 35,591 $ 38,592 $ 38,231 $ 39,250 $ 36,301 Total loans held for investment adjusted for acquired loan net discount Total loans held for investment $ 3,190,485 $ 3,071,761 $ 3,123,355 $ 3,012,275 $ 3,098,220 Plus: Net discount on acquired loans 4,371 5,112 6,240 7,314 9,937 Total loans held for investment adjusted for acquired loan net discount $ 3,194,856 $ 3,076,873 $ 3,129,595 $ 3,019,589 $ 3,108,157 Allowance for loan losses plus acquired loan net discount loans to total loans\nheld for investment adjusted for acquired loan net discount 1.11 % 1.25 % 1.22 % 1.30 % 1.17 %\nGreen Bancorp, Inc.\nNotes to Financial Highlights\n(Unaudited)\nPre-tax, Pre-provision Operating Return on Average Assets. Pre-tax, pre-provision operating return on average assets is a non‑GAAP measure used by management to evaluate the Company’s financial performance. We calculate: (a) pre-tax, pre-provision operating return as net income (loss) plus provision (benefit) for income taxes, plus provision for loan losses, plus loss (gain) on sale of securities available-for-sale, net, plus loss (gain) on held for sale loans, net, plus stock based compensation expense for performance option vesting and (b) return (as described in clause (a)) divided by total average assets. For pre-tax, pre-provision operating return, the most directly comparable financial measure calculated in accordance with GAAP is net income and for pre-tax, pre-provision operating return on average assets is return on average assets.\nWe believe that this measure is important to many investors in the marketplace who are interested in understanding the operating performance of the company before provision for loan losses, which can vary from quarter to quarter, and income taxes.\nThe following table reconciles, as of the dates set forth below, pre-tax, pre-provision operating return on average assets:\nFor the Quarter Ended For the Twelve Months Ended Dec 31, 2017 Sep 30, 2017 Jun 30, 2017 Mar 31, 2017 Dec 31, 2016 Dec 31, 2017 Dec 31, 2016 (Dollars in thousands) Pre-Tax, Pre-Provision Operating Return Net Income (loss) $ 2,619 $ 11,407 $ 12,898 $ 7,212 $ 2,544 $ 34,136 $ (972 ) Plus: Provision (benefit) for income taxes 10,142 5,895 6,985 3,942 1,355 26,964 (402 ) Plus: Provision for loan losses 4,405 2,300 1,510 6,145 9,500 14,360 64,700 Plus: Loss (gain) on sale of securities available-for-sale, net — 332 (294 ) — — 38 — Plus: Loss (gain) on held for sale loans, net 1,098 1,294 222 138 1,445 2,308 1,404 Plus: Stock based compensation expense for performance\noption vesting 3,051 — — — — 3,051 — Total pre-tax, pre-provision operating return $ 21,315 $ 21,228 $ 21,321 $ 17,437 $ 14,844 $ 80,857 $ 64,730 Total Average Assets $ 4,204,105 $ 4,131,706 $ 4,096,386 $ 4,016,744 $ 3,974,244 $ 4,112,784 $ 3,860,808 Pre-Tax, Pre-Provision Operating Return on Average\nAssets (Annualized) 2.01 % 2.04 % 2.09 % 1.76 % 1.49 % 1.97 % 1.68 % Media Contact:\nMike Barone\n713-275-8243\nmbarone@greenbank.com\nInvestor Relations:\n713-275-8220\ninvestors@greenbank.com\nSource:Green Bancorp, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/8a00f7b1-a6e1-48fc-9108-a4dd0dbbb3ed"], "published": "2018-01-26T00:05:00.000+02:00", "crawled": "2018-01-26T02:57:58.003+02:00", "highlightTitle": ""}