{"organizations": [], "uuid": "b7a198b08d5ee4be01c51319631d4011e3422389", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-water-meter-market-in-asia-pacific-forecast-to-2022.html", "country": "US", "domain_rank": 767, "title": "Water Meter Market in Asia-Pacific, Forecast to 2022", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T21:19:00.000+02:00", "replies_count": 0, "uuid": "b7a198b08d5ee4be01c51319631d4011e3422389"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-water-meter-market-in-asia-pacific-forecast-to-2022.html", "ord_in_thread": 0, "title": "Water Meter Market in Asia-Pacific, Forecast to 2022", "locations": [], "entities": {"persons": [], "locations": [{"name": "asia-pacific", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "amr", "sentiment": "none"}, {"name": "apac", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 11, 2018 /PRNewswire/ -- Read the full report: https://www.reportlinker.com/p05281643\nThe Asia-Pacific (APAC) water meter market, comprising basic water meters, automated meter reading (AMR), and advanced metering infrastructure (AMI) technologies is growing steadily due to the region-wide focus on improving metering penetration and reducing non-revenue water (NRW) losses.\nThe market is likely to grow at a modest Compound Annual Growth Rate (CAGR) of 3.5% between 2016 and 2022, propelled by the growing rate of metering in the region and the adoption of smart water metering in key developed nations. In addition to the analysis of market growth factors, this study offers insights into the broader trends influencing the water meter market and its participants.\nUtilities have realized the importance of increasing cost recovery in ensuring the financial and environment sustainability of water supply. Strong private sector investment is also expected in the market due to a shift in the investment focus from China and India toward emerging markets. This environment of change has proved beneficial to the water meter market, with the region witnessing an increase in the pace of project implementation and a leapfrogging in adoption of smart metering systems.\nThe water meter market in APAC is still nascent with a highly fragmented market. Water meter market leaders from Japan and Europe have already begun capitalizing on the largely underdeveloped Southeast Asian meter market.\nKey companies in the region include Itron, Elster, Aichi Tokei Denki, Sensus, Arad, and K-Water. While Japan and Australia are currently the markets with the most activity, developing markets such as Indonesia, Singapore, and South Korea are expected to offer strong growth opportunity in the coming years. Frontier markets such as the Philippines and Vietnam will be fail-safe long-term bets. In terms of market segment performance, the market share of basic meters will gradually be eroded by smart metering technologies due to the need for better demand management and increased cost recovery from customers.\nRead the full report: https://www.reportlinker.com/p05281643\nAbout Reportlinker\nReportLinker is an award-winning market research solution. Reportlinker finds and organizes the latest industry data so you get all the market research you need - instantly, in one place.", "external_links": ["https://www.reportlinker.com/p05281643", "https://www.reportlinker.com/"], "published": "2018-01-11T21:19:00.000+02:00", "crawled": "2018-01-11T23:45:40.023+02:00", "highlightTitle": ""}