{"organizations": [], "uuid": "185fc9e4dce10e3a969b42e7b4c0f1767da32210", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/30/the-associated-press-trump-warns-of-immigration-peril-touts-economy-in-address.html", "country": "US", "domain_rank": 767, "title": "Trump warns of immigration peril, touts economy in address", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T08:27:00.000+02:00", "replies_count": 0, "uuid": "185fc9e4dce10e3a969b42e7b4c0f1767da32210"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/30/the-associated-press-trump-warns-of-immigration-peril-touts-economy-in-address.html", "ord_in_thread": 0, "title": "Trump warns of immigration peril, touts economy in address", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — Addressing a deeply divided nation, President Donald Trump summoned the country to a \"new American moment\" of unity in his first State of the Union address, challenging Congress to make good on long-standing promises to fix a fractured immigration system and warning darkly of evil forces seeking to undermine America's way of life.\nTrump's address Tuesday night blended self-congratulation and calls for optimism amid a growing economy with ominous warnings about deadly gangs, the scourge of drugs and violent immigrants living in the United States illegally. He cast the debate over immigration — an issue that has long animated his most ardent supporters — as a battle between heroes and villains, leaning heavily on the personal stories of White House guests in the crowd. He praised a law enforcement agent who arrested more than 100 gang members, and he recognized the families of two alleged gang victims.\nHe also spoke forebodingly of catastrophic dangers from abroad, warning that North Korea would \"very soon\" threaten the United States with nuclear-tipped missiles.\n\"The United States is a compassionate nation. We are proud that we do more than any other country to help the needy, the struggling and the underprivileged all over the world,\" Trump said. \"But as president of the United States, my highest loyalty, my greatest compassion, and my constant concern is for America's children, America's struggling workers and America's forgotten communities.\"\nTrump addressed the nation with tensions running high on Capitol Hill. An impasse over immigration prompted a three-day government shutdown earlier this year, and lawmakers appear no closer to resolving the status of the \"Dreamers\" — young people living in the U.S. illegally ahead of a new Feb. 8 deadline for funding operations. The parties have also clashed this week over the plans of Republicans on the House intelligence committee to release a classified memo on the Russia investigation involving Trump's presidential campaign — a decision the White House backs but the Justice Department is fighting.\nThe controversies that have dogged Trump — and the ones he has created— have overshadowed strong economic gains during his first year in office. His approval ratings have hovered in the 30s for much of his presidency, and just 3 in 10 Americans said the United States was heading in the right direction, according to a poll by The Associated Press-NORC Center for Public Affairs Research. In the same survey, 67 percent of Americans said the country was more divided because of Trump.\nAt times, Trump's address appeared to be aimed more at validating his first year in office than setting the course for his second. He devoted significant time to touting the tax overhaul he signed at the end of last year, promising the plan will \"provide tremendous relief for the middle class and small businesses.\" He also highlighted the decision made early in his first year to withdraw the U.S. from a sweeping Asia-Pacific trade pact, declaring: \"The era of economic surrender is totally over.\"\nHe spoke about potential agenda items for 2018 in broad terms, including a call for $1.5 trillion in new infrastructure spending and partnerships with states and the private sector. He touched only briefly on issues like health care that have been at the center of the Republican Party's policy agenda for years.\nTackling the sensitive immigration debate that has roiled Washington, Trump redoubled his recent pledge to offer a path to citizenship for 1.8 million young immigrants — but only as part of a package that would also require increased funding for border security, including a wall along the U.S.-Mexico border, ending the nation's visa lottery method and revamping the current legal immigration system. Some Republicans are wary of the hardline elements of Trump's plan and it's unclear whether his blueprint could pass Congress.\n\"Americans are dreamers too,\" Trump said, in an apparent effort to reclaim the term used to describe the young immigrants in the U.S. illegally.\nA former New York Democrat, the president also played to the culture wars that have long illuminated American politics, alluding to his public spat with professional athletes who led protests against racial injustice by kneeling during the national anthem, declaring that paying tribute to the flag is a \"civic duty.\"\nRepublicans led multiple rounds of enthusiastic applause during the speech, but for the opposition party it was a more somber affair. Democrats provided a short spurt of polite applause for Trump as he entered the chamber, but offered muted reactions throughout the speech. A cluster of about two dozen Democrats, including members of the Congressional Black Caucus, remained planted firmly in their seats, staring sternly at the president and withholding applause.\nAfter devastating defeats in 2016, Democrats are hopeful that Trump's sagging popularity can help the party rebound in November's midterm elections. In a post-speech rebuttal, Massachusetts Rep. Joe Kennedy, the grandson of Robert F. Kennedy, was seeking to undercut Trump's optimistic tone and remind voters of the personal insults and attacks often leveled by the president.\n\"Bullies may land a punch,\" Kennedy said. \"They might leave a mark. But they have never, not once, in the history of our United States, managed to match the strength and spirit of a people united in defense of their future.\"\nThe arc of Trump's 80-minute speech featured the personal stories of men and women who joined first lady Melania Trump in the audience. The guests included a New Mexico policeman and his wife who adopted a baby from parents who suffered from opioid addiction, and Ji Seong-ho, a defector from North Korea and outspoken critic of the Kim Jong-un government.\nOn international affairs, Trump warned of the dangers from \"rogue regimes,\" like Iran and North Korea, terrorist groups, like the Islamic State, and \"rivals\" like China and Russia \"that challenge our interests, our economy and our values.\" Calling on Congress to lift budgetary caps and boost spending on the military, Trump said that \"unmatched power is the surest means of our defense.\"\nTrump's biggest foreign policy announcement of the night concerned the Guantanamo Bay detention center, which former President Barack Obama tried but failed to close. Reversing Obama's policy, Trump said he'd signed an executive order Tuesday directing the Pentagon to keep the prison open while re-examining the military's policy on detention.\nTrump said he was also asking Congress to ensure the U.S. had needed powers to detain Islamic State group members and other \"terrorists wherever we chase them down,\" though it was unclear whether he was referring to a new war powers authorization or some other mechanism. Trump also said he wanted Congress to pass a law ensuring U.S. foreign aid goes only \"to America's friends\" — a reference to his frustration at U.S. aid recipients that voted at the U.N. to rebuke his decision to recognize Jerusalem as Israel's capital.\nMrs. Trump arrived at the Capitol ahead of her husband to attend a reception with guests of the White House, but she rode back to the White House with him. It was the first time she was seen publicly with the president following a report that his lawyer arranged a payment to a porn star, Stormy Daniels, to prevent her from talking about an alleged affair. Daniels denied the affair in a new statement released hours before the speech.\nFollow Julie Pace at http://twitter.com/jpaceDC and Zeke Miller at http://twitter.com/zekejmiller", "external_links": [], "published": "2018-01-30T08:27:00.000+02:00", "crawled": "2018-01-31T14:28:14.001+02:00", "highlightTitle": ""}