{"organizations": [], "uuid": "82e13432130b4e7a500707038b14f500f130794a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-chronicled-announces-linklab-executives-to-join-executive-leadership-team.html", "country": "US", "domain_rank": 767, "title": "Chronicled Announces LinkLab Executives to Join Executive Leadership Team", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T17:00:00.000+02:00", "replies_count": 0, "uuid": "82e13432130b4e7a500707038b14f500f130794a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/pr-newswire-chronicled-announces-linklab-executives-to-join-executive-leadership-team.html", "ord_in_thread": 0, "title": "Chronicled Announces LinkLab Executives to Join Executive Leadership Team", "locations": [], "entities": {"persons": [{"name": "susann", "sentiment": "negative"}, {"name": "eric garvin", "sentiment": "none"}, {"name": "eric", "sentiment": "none"}, {"name": "susanne", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "somerville", "sentiment": "none"}], "organizations": [{"name": "chronicled, inc.", "sentiment": "neutral"}, {"name": "linklab", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO, Jan. 17, 2018 /PRNewswire/ -- Chronicled, Inc. today announced the addition of Susanne Somerville and Eric Garvin to its executive team. Both are joining to support the development and delivery of pharma solutions for Chronicled's platform and product offerings.\nSusanne and Eric previously served as Co-Founders and Principals of the LinkLab, a supply chain consulting practice focused on delivering solutions to meet worldwide serialization requirements. Since 2016, the LinkLab has been involved in a joint effort with Chronicled to develop new technologies to help the pharmaceutical industry become compliant with the Drug Supply Chain Security Act (DSCSA). This pilot, called the MediLedger Project, uses blockchain technology to allow the track and trace of prescription medicine while ensuring data privacy for all participating supply chain trading partners. Susanne and Eric will now look to carry out the full roadmap for implementation of the MediLedger Project as full-time members of the Chronicled leadership team.\nSusanne was previously the Vice President of Supply Chain, North America, for Genentech/Roche. She brings over twenty-five years of pharmaceutical, biotech, and supply chain experience, including responsibility for worldwide clinical supply chain at Roche. \"I am excited by the synergy we have achieved bringing industry expertise to Chronicled's leading position in smart supply chain solutions and blockchain,\" she said.\nEric has more than twenty-five years of management consulting experience in the life sciences industry with a focus on business systems implementations. He founded Global Technical Partners (GTP) in 1997 with a mission to provide industry-leading project management services to pharmaceutical, biotech, and medical device companies.\n\"We could not be more excited to have Susanne and Eric joining us on a full-time basis,\" said Chronicled CEO Ryan Orr. \"Through our work together on MediLedger, we have been able to witness first hand their incredible leadership talents, integrity, program management skills, and deep expertise in this industry. We are excited to build on our early success with Eric and Susanne as part of our leadership team.\"\nAbout Chronicled\nBased in the innovation hub of Silicon Valley, Chronicled is a technology company leveraging blockchain and IoT to power smart, secure supply chain solutions. Chronicled offers a blockchain-based Smart Supply Chain platform and secures IoT device identities, data, and event logs and automates IoT-dependent business logic using smart contracts. Chronicled is also a founding member of the Trusted IoT Alliance , with the mission of creating open source tools and standards to connect IoT and blockchain ecosystems to deliver business value.\nPress Contact\nSam Radocchia, CMO\nsam@chronicled.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/chronicled-announces-linklab-executives-to-join-executive-leadership-team-300583657.html\nSOURCE Chronicled, Inc.", "external_links": ["https://www.trusted-iot.org/", "http://www.prnewswire.com/news-releases/chronicled-announces-linklab-executives-to-join-executive-leadership-team-300583657.html"], "published": "2018-01-17T17:00:00.000+02:00", "crawled": "2018-01-17T19:16:37.009+02:00", "highlightTitle": ""}