{"organizations": [], "uuid": "aa79ccf621caa8fb0f66dbf2f38b7b77b799bc38", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-mercury-general-corporation-to-report-fourth-quarter-2017-results-on-february-5-2018.html", "country": "US", "domain_rank": 767, "title": "Mercury General Corporation To Report Fourth Quarter 2017 Results On February 5, 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T00:07:00.000+02:00", "replies_count": 0, "uuid": "aa79ccf621caa8fb0f66dbf2f38b7b77b799bc38"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-mercury-general-corporation-to-report-fourth-quarter-2017-results-on-february-5-2018.html", "ord_in_thread": 0, "title": "Mercury General Corporation To Report Fourth Quarter 2017 Results On February 5, 2018", "locations": [], "entities": {"persons": [], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "mercury general corporation", "sentiment": "negative"}, {"name": "p.m. eastern time", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "a.m. pacific time", "sentiment": "none"}, {"name": "p.m. pacific time", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES, Jan. 10, 2018 /PRNewswire/ -- Mercury General Corporation (NYSE: MCY) reported that on Monday, February 5, 2018, the Company will release results for its fourth quarter and twelve month periods ended December 31, 2017. The Company will host an investor conference call and webcast that same day at 10:00 A.M. Pacific Time (1:00 P.M. Eastern Time) to review the Company's results of operations for the fourth quarter and twelve month periods ended December 31, 2017.\nAll interested investors will be able to access the conference call at (877) 807-1888 (USA), (706) 679-3827 (International) or the webcast at http://www.mercuryinsurance.com . A replay of the call will be available beginning at 1:30 P.M. Pacific Time and running through February 12, 2018. The replay telephone numbers are (855) 859-2056 (USA) or (404) 537-3406 (International). The conference ID# is 97643188. The replay will also be available on the Company's website shortly following the call.\nMercury General Corporation and its subsidiaries are a multiple line insurance organization offering predominantly personal automobile and homeowners insurance through a network of independent producers in many states. For more information, visit the Company's website at http://www.mercuryinsurance.com .\nThe Private Securities Litigation Reform Act of 1995 provides a \"safe harbor\" for certain forward-looking statements. Certain statements contained in this press release are forward-looking statements based on the Company's current expectations and beliefs concerning future developments and their potential effects on the Company. There can be no assurance that future developments affecting the Company will be those anticipated by the Company. Actual results may differ from those projected in the forward-looking statements. These forward-looking statements involve significant risks and uncertainties (some of which are beyond the control of the Company) and are subject to change based upon various factors, including but not limited to the following risks and uncertainties: changes in the demand for the Company's insurance products, inflation and general economic conditions, including general market risks associated with the Company's investment portfolio; the accuracy and adequacy of the Company's pricing methodologies; catastrophes in the markets served by the Company; uncertainties related to estimates, assumptions and projections generally; the possibility that actual loss experience may vary adversely from the actuarial estimates made to determine the Company's loss reserves in general; the Company's ability to obtain and the timing of the approval of premium rate changes for insurance policies issued in states where the Company operates; legislation adverse to the automobile insurance industry or business generally that may be enacted in the states where the Company operates; the Company's success in managing its business in non-California states; the presence of competitors with greater financial resources and the impact of competitive pricing and marketing efforts; the ability of the Company to successfully manage its claims organization outside of California; the Company's ability to successfully allocate the resources used in the states with reduced or exited operations to its operations in other states; changes in driving patterns and loss trends; acts of war and terrorist activities; court decisions and trends in litigation and health care and auto repair costs and marketing efforts; and legal, regulatory and litigation risks. The Company undertakes no obligation to publicly update or revise any forward-looking statements, whether as the result of new information, future events or otherwise. For a more detailed discussion of some of the foregoing risks and uncertainties, see the Company's filings with the Securities and Exchange Commission.\nView original content with multimedia: http://www.prnewswire.com/news-releases/mercury-general-corporation-to-report-fourth-quarter-2017-results-on-february-5-2018-300580928.html\nSOURCE Mercury General Corporation", "external_links": ["http://www.mercuryinsurance.com/", "http://www.prnewswire.com/news-releases/mercury-general-corporation-to-report-fourth-quarter-2017-results-on-february-5-2018-300580928.html"], "published": "2018-01-11T00:07:00.000+02:00", "crawled": "2018-01-11T03:20:08.006+02:00", "highlightTitle": ""}