{"organizations": [], "uuid": "f3eb04be327f97abb3f7f4fde70d72c33ca15c64", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223783048&w=1200&r=LYNXMPEE0K03W", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-wozniacki/wozniacki-gallops-into-melbourne-quarter-finals-idUKKBN1FA034", "country": "US", "domain_rank": 408, "title": "Wozniacki gallops into Melbourne quarter-finals", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T06:36:00.000+02:00", "replies_count": 0, "uuid": "f3eb04be327f97abb3f7f4fde70d72c33ca15c64"}, "author": "", "url": "https://uk.reuters.com/article/uk-tennis-ausopen-wozniacki/wozniacki-gallops-into-melbourne-quarter-finals-idUKKBN1FA034", "ord_in_thread": 0, "title": "Wozniacki gallops into Melbourne quarter-finals", "locations": [], "entities": {"persons": [{"name": "reu", "sentiment": "negative"}, {"name": "wozniacki", "sentiment": "negative"}, {"name": "magdalena rybarikova", "sentiment": "none"}, {"name": "rod laver arena", "sentiment": "none"}, {"name": "caroline wozniacki", "sentiment": "none"}, {"name": "rybarikova", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}, {"name": "slovakia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 21, 2018 / 4:40 AM / Updated 4 hours ago Wozniacki gallops into Melbourne quarter-finals Martyn Herman 3 Min Read \nMELBOURNE (Reuters) - Second seed Caroline Wozniacki said she is playing with “nothing to lose” after galloping into the quarter-finals of the Australian Open for the first time in six years on Sunday. \nThe 27-year-old Dane crunched 25 winners in a 63-minute masterclass as she thrashed Slovakia’s Magdalena Rybarikova 6-3 6-0 to move a step closer to a long-awaited first grand slam title. \nWozniacki dropped a mere six points in the second set against the 19th-ranked Rybarikova and said her free-hitting approach was the result of almost losing in the second round. \nThe former world number one saved two match points against Croatia’s Jane Fett in the second round, recovering from 5-1 down in the decider to reel off six consecutive games. \nShe has not looked back since. \n”I feel good. I think being almost out of the tournament, you have nothing to lose after that,“ she told reporters. ”You just go out there and you enjoy yourself. I played really well from being down 5-1. \n”Since then I’ve just kept that going basically. \nSuch is her confidence that Wozniacki even attempted a between the legs ‘tweener’ in the first set. Tennis - Australian Open - Rod Laver Arena, Melbourne,   Caroline Wozniacki of Denmark celebrates winning against Magdalena Rybarikova of Slovakia. REUTERS/Edgar Su \n“I think you can tell my confidence is pretty good, I was pretty proud of that,” she said of the trick shot that failed to earn her a point but delighted the Rod Laver crowd. \n“I’ve tried a few in practice and made a couple but usually make a fool out of myself.” Slideshow (4 Images) \nRybarikova actually gained the first break of serve in the third game but Wozniacki soon settled into her rhythm and broke back immediately before taking control. \nShe brought up a match point with a flashing backhand winner down the line and pounded another sweetly-struck backhand to finish the contest at the first time of asking. \nAngelique Kerber saved a match point during her run to the title in 2016 and the way Wozniacki has responded from a similar crisis marks her out as favourite to emulate that. \nNot that she is getting carried away, especially with tricky Spanaird Carla Suarez Navarro standing in her way next. \n“We’ve played four matches, is that right, so far? There’s still three to go. There’s still a long way,” she said. \n“I‘m expecting a tough fight (against Suarez Navarro). She’s had a few injuries. She’s back playing really well.” Reporting by Martyn Herman; editing by Sudipto Ganguly", "external_links": [], "published": "2018-01-21T06:36:00.000+02:00", "crawled": "2018-01-21T08:11:18.002+02:00", "highlightTitle": ""}