{"organizations": [], "uuid": "204d36bb25560afcef5a90cead7b9dd49b27c555", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/britain-politics-fakenews/britain-to-set-up-unit-to-tackle-fake-news-mays-spokesman-idINKBN1FC29K", "country": "US", "domain_rank": 408, "title": "Britain to set up unit to tackle 'fake news': May's spokesman", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T19:30:00.000+02:00", "replies_count": 0, "uuid": "204d36bb25560afcef5a90cead7b9dd49b27c555"}, "author": "", "url": "https://in.reuters.com/article/britain-politics-fakenews/britain-to-set-up-unit-to-tackle-fake-news-mays-spokesman-idINKBN1FC29K", "ord_in_thread": 0, "title": "Britain to set up unit to tackle 'fake news': May's spokesman", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "national security council", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 4:30 PM / Updated 21 minutes ago Britain to set up unit to tackle 'fake news': May's spokesman Reuters Staff 3 Min Read \nLONDON (Reuters) - Britain will set up a new unit to beef up its efforts to counter so-called “fake news” and to try to deter disinformation campaigns by other states, a spokesman for Prime Minister Theresa May said on Tuesday. \nMay has previously accused Russia of meddling in elections and its state media of planting fake stories and photo-shopped images in an attempt to undermine western institutions. \nRussia denies interfering in foreign elections including Britain’s June 2016 referendum on leaving the European Union and the 2016 U.S. presidential race. \nThe announcement was made after a meeting of the National Security Council -- a mix of ministers and senior security officials -- which endorsed the initial findings of a wide-ranging review into Britain’s capability to respond to all types of threats. \n“We are living in an era of fake news and competing narratives,” May’s spokesman told reporters. “The government will respond with more and better use of national security communications to tackle these interconnected complex challenges.” \nHe added: “We will build on existing capabilities by creating a dedicated national security communications unit. This will be tasked with combating disinformation by state actors and others. It will more systematically deter our adversaries and help us deliver on national security priorities.” \nThe spokesman had no further information on how the unit would operate, or where it would be based. Asked what sort of state actors the government was worried about, he pointed to previous speeches made by ministers on the subject. \nBritish lawmakers conducting a separate parliament-led inquiry have demanded information from Facebook about any paid-for activity by Russian-linked Facebook accounts around the 2016 EU referendum and the 2017 UK election. \nThe issue of whether and how much Russia intervened in the 2016 U.S. presidential election is a major subject of inquiry in Washington, where it is the subject of multiple investigations. \nFrench President Emmanuel Macron announced earlier this month he would overhaul domestic media legislation to fight the spread of fake news on social media, which he said was a threat to liberal democracies. Reporting by William James; Writing by Elizabeth Piper; Editing by Catherine Evans", "external_links": [], "published": "2018-01-23T19:30:00.000+02:00", "crawled": "2018-01-23T19:54:06.025+02:00", "highlightTitle": ""}