{"organizations": [], "uuid": "c3d7060129ed3e17409ac12363b28910cac4d112", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180114&t=2&i=1221862988&w=1200&r=LYNXMPEE0D03B", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-autoshow-detroit-ranger/ford-unveils-future-ranger-pickup-for-segment-rivals-dominate-idUKKBN1F304Z", "country": "US", "domain_rank": 408, "title": "Ford unveils future Ranger pickup for segment rivals dominate", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T07:16:00.000+02:00", "replies_count": 0, "uuid": "c3d7060129ed3e17409ac12363b28910cac4d112"}, "author": "", "url": "https://uk.reuters.com/article/us-autoshow-detroit-ranger/ford-unveils-future-ranger-pickup-for-segment-rivals-dominate-idUKKBN1F304Z", "ord_in_thread": 0, "title": "Ford unveils future Ranger pickup for segment rivals dominate", "locations": [], "entities": {"persons": [{"name": "farage brexit", "sentiment": "negative"}, {"name": "joseph white", "sentiment": "none"}], "locations": [{"name": "detroit", "sentiment": "none"}, {"name": "detroit", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "ranger", "sentiment": "negative"}, {"name": "ford", "sentiment": "negative"}, {"name": "north american international auto show", "sentiment": "none"}, {"name": "farage reuters tv united", "sentiment": "none"}, {"name": "ford motor", "sentiment": "none"}, {"name": "reuters  ford", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ford motor co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brexit vote may be reversed, says Farage Brexit vote may be reversed, says Farage Brexit vote may be reversed, says Farage Reuters TV United States January 14, 2018 / 5:07 AM / Updated 4 hours ago Ford unveils future Ranger pickup for segment rivals dominate Joseph White 3 Min Read \nDETROIT (Reuters) - Ford Motor Co ( F.N ) on Sunday will officially take the wraps off its long-awaited Ranger midsize pickup truck, a year ahead of its arrival in showrooms, as rivals consolidate positions in a segment Detroit automakers once gave up for dead. The 2019 Ford Ranger is pictured in this undated handout photo obtained by Reuters January 13, 2018. Ford Motor Company/Handout via REUTERS \nFord executives did not disclose prices or fuel efficiency ratings for the new Ranger during a briefing for the media ahead of the official unveiling at the North American International Auto Show in Detroit. \nMore than two years ago Ford telegraphed its decision to re-launch the Ranger midsize truck in North America after killing the model in 2011. At the time, Ford executives said they could satisfy pickup truck demand - and make more money - by widening the price range and engine options of its larger F-150 pickup model line. Detroit rivals General Motors Co( GM.N ) and Fiat Chrysler Automobiles NV( FCHA.MI ) abandoned the segment around the same time. \nHowever, in late 2014, GM launched new Chevrolet Colorado and GMC Sierra pickups, and Japanese automakers Toyota Motor Corp( 7203.T ) and Nissan Motor Co( 7201.T ) reinvigorated their midsize pickup trucks, aiming at customers who wanted to haul bikes, surfboards and other bulky recreational gear, not sheets of plywood. \nAs gasoline prices stabilized, more customers turned to the new, smaller pickups. GM in 2017 sold more than 145,000 Colorado and Canyon trucks. Toyota, the segment leader, sold more than 198,000 Tacoma trucks in 2017, up 3.4 percent from a year earlier and 27 percent ahead of 2014, according to figures compiled by Autodata. \nSales in the U.S. compact pickup segment as a whole grew in 2017 to more than 417,000 vehicles, up more than 70 percent from 2014, according to Autodata. \n“We see more of an opportunity that didn’t exist five years ago,” Ford truck marketing manager Todd Eckert said. \nFord executives said the North American Ranger will share engineering and some design elements with a work-oriented pickup the company builds and sells in Southeast Asia and other markets. The exterior and interior styling of the North American Ranger will be aimed at a more affluent, recreational use buyer. \nThe new Ranger will start arriving in North American dealerships in early 2019 and be assembled at its Wayne, Michigan, factory in suburban Detroit. Ford’s decision to invest $850 million in the Wayne plant to build the Ranger and a new Bronco SUV won praise last year from U.S. President Donald Trump. Reporting By Joe White; Editing by Bill Trott", "external_links": [], "published": "2018-01-14T07:16:00.000+02:00", "crawled": "2018-01-14T12:38:19.007+02:00", "highlightTitle": ""}