{"organizations": [], "uuid": "60e74b49252ba444cb629e36d54e7b8edb3cd237", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/business-wire-copt-announces-fourth-quarter-and-year-end-2017-earnings-conference-call.html", "country": "US", "domain_rank": 767, "title": "COPT Announces Fourth Quarter and Year End 2017 Earnings Conference Call", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T16:00:00.000+02:00", "replies_count": 0, "uuid": "60e74b49252ba444cb629e36d54e7b8edb3cd237"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/business-wire-copt-announces-fourth-quarter-and-year-end-2017-earnings-conference-call.html", "ord_in_thread": 0, "title": "COPT Announces Fourth Quarter and Year End 2017 Earnings Conference Call", "locations": [], "entities": {"persons": [], "locations": [{"name": "md.", "sentiment": "none"}, {"name": "columbia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "corporate office properties trust", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "ofc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "COLUMBIA, Md.--(BUSINESS WIRE)-- Corporate Office Properties Trust (“COPT” or the “Company”) (NYSE: OFC) announces its fourth quarter and year end 2017 earnings release and conference call will take place as follows:\nFourth Quarter & Year End 2017:\nEarnings Release Date: Thursday, February 8, 2018 after the market closes Conference Call Date: Friday, February 9, 2018 Time: 12:00 p.m. Eastern Time Telephone Number: (within the U.S.) 855-463-9057 Telephone Number: (outside the U.S.) 661-378-9894 Passcode: 8784659 The conference call will also be available via live webcast in the ‘Investors’ section of the Company’s website at www.copt.com .\nReplay Information\nA replay of this call will be available beginning at 3:00 p.m. Eastern Time on Friday, February 9, through 3:00 p.m. Eastern Time on Friday, February 23. To access the replay within the United States, please call 855-859-2056 and use passcode 8784659. To access the replay outside the United States, please call 404-537-3406 and use passcode 8784659. A replay of the conference call will also be available immediately after the call on the ‘Investors’ section of the Company’s website.\nCompany Information\nCOPT is an office REIT that owns, manages, develops and selectively acquires office and data center properties in locations that support the United States Government and its contractors, most of whom are engaged in national security, defense and information technology (“IT”) related activities servicing priority missions (“Defense/IT Locations”). The Company also owns a portfolio of office properties located in select urban/urban-like submarkets within its regional footprint with durable Class-A office fundamentals and characteristics (“Regional Office Properties”). As of September 30, 2017, the Company derived 87% of core portfolio annualized revenue from Defense/IT Locations and 13% from its Regional Office Properties. As of September 30, 2017 and including six buildings owned through an unconsolidated joint venture, COPT’s core portfolio of 153 office properties encompassed 16.7 million square feet and was 95.1% leased. As of the same date, the Company also owned one wholesale data center with a critical load of 19.25 megawatts.\nForward-Looking Information\nThis press release may contain “forward-looking” statements, as defined in Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934, that are based on the Company’s current expectations, estimates and projections about future events and financial trends affecting the Company. Forward-looking statements can be identified by the use of words such as “may,” “will,” “should,” “could,” “believe,” “anticipate,” “expect,” “estimate,” “plan” or other comparable terminology. Forward-looking statements are inherently subject to risks and uncertainties, many of which the Company cannot predict with accuracy and some of which the Company might not even anticipate. Accordingly, the Company can give no assurance that these expectations, estimates and projections will be achieved. Future events and actual results may differ materially from those discussed in the forward-looking statements.\nImportant factors that may affect these expectations, estimates, and projections include, but are not limited to:\ngeneral economic and business conditions, which will, among other things, affect office property and data center demand and rents, tenant creditworthiness, interest rates, financing availability and property values; adverse changes in the real estate markets including, among other things, increased competition with other companies; governmental actions and initiatives, including risks associated with the impact of a prolonged government shutdown or budgetary reductions or impasses, such as a reduction in rental revenues, non-renewal of leases, and/or a curtailment of demand for additional space by the Company's strategic customers; the Company’s ability to borrow on favorable terms; risks of real estate acquisition and development activities, including, among other things, risks that development projects may not be completed on schedule, that tenants may not take occupancy or pay rent or that development or operating costs may be greater than anticipated; risks of investing through joint venture structures, including risks that the Company’s joint venture partners may not fulfill their financial obligations as investors or may take actions that are inconsistent with the Company’s objectives; changes in the Company’s plans for properties or views of market economic conditions or failure to obtain development rights, either of which could result in recognition of significant impairment losses; the Company’s ability to satisfy and operate effectively under Federal income tax rules relating to real estate investment trusts and partnerships; the Company's ability to achieve projected results; the dilutive effects of issuing additional common shares; and environmental requirements.\nThe Company undertakes no obligation to update or supplement any forward-looking statements. For further information, please refer to the Company’s filings with the Securities and Exchange Commission, particularly the section entitled “Risk Factors” in Item 1A of the Company’s Annual Report on Form 10-K for the year ended December 31, 2016.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180116005245/en/\nCorporate Office Properties Trust\nIR Contacts:\nStephanie Krewson-Kelly, 443-285-5453\nstephanie.kelly@copt.com\nor\nMichelle Layne, 443-285-5452\nmichelle.layne@copt.com\nSource: Corporate Office Properties Trust", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.copt.com&esheet=51742770&newsitemid=20180116005245&lan=en-US&anchor=www.copt.com&index=1&md5=785414cac4fbb712d837a8263538eda0", "http://www.businesswire.com/news/home/20180116005245/en/"], "published": "2018-01-16T16:00:00.000+02:00", "crawled": "2018-01-16T16:26:05.008+02:00", "highlightTitle": ""}