{"organizations": [], "uuid": "e48758c589fcb6503f40a8e5a81e5adeddb7e6e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-lozano-smith-names-three-new-equity-partners.html", "country": "US", "domain_rank": 767, "title": "Lozano Smith Names Three New Equity Partners", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.999, "site_type": "news", "published": "2018-01-11T21:03:00.000+02:00", "replies_count": 0, "uuid": "e48758c589fcb6503f40a8e5a81e5adeddb7e6e8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-lozano-smith-names-three-new-equity-partners.html", "ord_in_thread": 0, "title": "Lozano Smith Names Three New Equity Partners", "locations": [], "entities": {"persons": [{"name": "lozano smith", "sentiment": "negative"}, {"name": "karen rezendes", "sentiment": "none"}, {"name": "sloan", "sentiment": "none"}, {"name": "sims", "sentiment": "none"}, {"name": "edward sklar", "sentiment": "none"}, {"name": "sloan simmons", "sentiment": "none"}, {"name": "trevin sims", "sentiment": "none"}, {"name": "ed", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "fresno", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "llp", "sentiment": "negative"}, {"name": "lozano smith names three new equity partners", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FRESNO, Calif., Jan. 11, 2018 /PRNewswire/ -- Lozano Smith, LLP , a leading California education and public agency law firm, is pleased to announce that Trevin Sims , Edward Sklar and Sloan Simmons have been promoted to Lozano Smith's equity partnership.\n\"Trevin, Ed and Sloan are distinguished and talented attorneys who have dedicated their careers to public agencies and to the students and communities that our clients serve,\" said Karen Rezendes , Managing Partner of Lozano Smith. \"In addition to their remarkable achievements as attorneys, all have served in leadership roles within the firm helping to generate incredible success and growth for our firm. Our clients have been enriched by each attorney's depth of expertise and quality of legal services.\"\nTrevin Sims first joined Lozano Smith in 1996 and later became an office-managing non-equity partner in 2007. Throughout his career, Mr. Sims' practice has focused on virtually every area of public education law, including facilities and business, board governance, municipal finance, special education, student discipline, classified and certificated employee discipline, and school district reorganization. Trevin also leads Lozano Smith's Public Safety Practice Group , and trains public agency leaders throughout the state.\nEdward Sklar began his career with Lozano Smith in 2001 and later became a non-equity partner in January 2007. Mr. Sklar has held various leadership positions, including serving as the Charter School Practice Group co-chair since 2008 as well as the Walnut Creek office managing partner for the past eight years. Ed is an expert on charter school issues and provides statewide trainings for public entities.\nSloan Simmons' career began at Lozano Smith in 2002. He was the Student Practice Group co-chair from 2009 until 2013 when he became co-chair of the firm's Litigation Practice Group . His practice focuses on all aspects of public entity litigation, with a record of success in litigation on complex and wide impact cases, and the student arena including constitutional and other statutory student rights and requirements, student discipline, student records, and all other aspects of student-school related issues. Sloan is a regular contributor and sought-after speaker for the National School Boards Association, the California School Boards Association, the Association of California School Administrators, and other California education associations.\nGet to Know Lozano Smith\nLozano Smith is a full-service education and public agency law firm serving hundreds of California's K-12 school districts, community college districts, and numerous cities, counties, and special districts. The firm's expertise includes, but is not limited to, personnel matters, labor relations, technology, real property and construction matters, constitutional issues, special education, student discipline, school funding, charter schools, bond elections, governance, and litigation in all areas of representation. Lozano Smith has offices in 8 California locations: Bakersfield, Fresno, Los Angeles, Mission Viejo, Monterey, Sacramento, San Diego and Walnut Creek. For more information about Lozano Smith or to see full attorney bios, visit www.LozanoSmith.com or find us on Facebook or Twitter . You can also download the Lozano Smith App .\nContact: Andy Garcia\nExecutive Director\n559.431.5600\nagarcia@lozanosmith.com\nView original content: http://www.prnewswire.com/news-releases/lozano-smith-names-three-new-equity-partners-300581494.html\nSOURCE Lozano Smith", "external_links": ["http://www.lozanosmith.com/litigation.php", "http://www.lozanosmith.com/publicsafety.php", "http://www.lozanosmith.com/", "http://www.facebook.com/lozanosmith", "http://www.lozanosmith.com/students.php", "http://www.lozanosmith.com/attorneys_bio.php?id=30", "https://itunes.apple.com/us/app/lozano-smith-client-news-briefs/id496207221?mt=8", "http://www.prnewswire.com/news-releases/lozano-smith-names-three-new-equity-partners-300581494.html", "http://www.lozanosmith.com/charterschools.php", "http://www.lozanosmith.com/attorney_bio.php?id=37", "http://www.lozanosmith.com/attorney_bio.php?id=39", "http://www.lozanosmith.com/attorney_bio.php?id=38", "https://twitter.com/lozanosmith"], "published": "2018-01-11T21:03:00.000+02:00", "crawled": "2018-01-11T21:34:31.004+02:00", "highlightTitle": ""}