{"organizations": [], "uuid": "f6e29eb6ebc043f419fb226567ada3ec35fb5e1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 2, "shares": 2, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222820612&w=1200&r=LYNXMPEE0G1PV", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/us-apple-tax/apple-to-pay-38-billion-in-repatriation-tax-idUKKBN1F62FJ", "country": "US", "domain_rank": 408, "title": "Apple plans new U.S. campus, to pay $38 billion in foreign cash taxes", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T02:45:00.000+02:00", "replies_count": 0, "uuid": "f6e29eb6ebc043f419fb226567ada3ec35fb5e1d"}, "author": "", "url": "https://uk.reuters.com/article/us-apple-tax/apple-to-pay-38-billion-in-repatriation-tax-idUKKBN1F62FJ", "ord_in_thread": 0, "title": "Apple plans new U.S. campus, to pay $38 billion in foreign cash taxes", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "stephen nellis", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "apple inc", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 6:18 PM / Updated 13 minutes ago Apple plans new U.S. campus, to pay $38 billion in foreign cash taxes Stephen Nellis 6 Min Read \n(Reuters) - Apple Inc ( AAPL.O ) will open a new campus as part of a five-year, $30 billion U.S. investment plan and will make about $38 billion in one-time tax payments on its overseas cash, one of the largest corporate spending plans announced since the passage of a tax cut signed by U.S. President Donald Trump. \nThe company has been under increasing pressure to make U.S. investments since the 2016 presidential campaign, when Trump targeted the iPhone maker for making products in Asian factories. \nWhile Apple has announced no plans to change that practice and experts say it would be economically impractical to make iPhones in the United States, the company has begun to emphasize its U.S. economic impact, from developers who sell software on its App Store to the tens of billions of dollars per year it spends with U.S. suppliers. \nBetween the spending plan, hiring 20,000 people, tax payments and business with U.S.-based suppliers, Apple on Wednesday estimated it would spend $350 billion in the United States over the next five years. \nIt did not, however, say how much of the plan was new or how much of its $252.3 billion in cash abroad - the largest of any U.S. corporation - it would bring home. In addition to the $38 billion in taxes it must pay, Apple has run up $97 billion in U.S.-issued debt to pay for previous share buybacks and dividends. \nSome investors said the U.S. investments would give the company room to make more stock buybacks or pay dividends without criticism, and Apple shares rose 1.7 percent for the day. \nWalter Piecyk, managing director for TMT Research at BTIG Research, said he could not yet tell whether the U.S. expansion was an increase from a previous plan or meant investment abroad was being refocused in the United States. Reuters Breakingviews estimated that Apple could have increased U.S. headcount by 24,000 in the last five years. \nTrump described the move by Apple as a victory for his efforts. \n“I promised that my policies would allow companies like Apple to bring massive amounts of money back to the United States. Great to see Apple follow through as a result of TAX CUTS,” Trump wrote on Twitter. \nAsked in an interview with ABC News whether the job creation announcements were directly related to the Republican tax plan, Apple Chief Executive Officer Tim Cook gave a measured response. \n“Let me be clear: There are large parts of this that are a result of the tax reform, and there’s large parts of this we would have done in any situation,” Cook said in the interview. APPLE SERVICES PUSH \nAbout a third of Apple’s new spending will be on data centers to house its iCloud, App Store and Apple Music services, a sign of the rising importance of subscription services to a company known for its computers and gadgets. Apple has data centers in seven states. FILE PHOTO: The Apple Campus 2 is seen under construction in Cupertino, California in this aerial photo taken January 13, 2017. REUTERS/Noah Berger/File Photo \nThe announced U.S spending would be a significant part of Apple’s overall capital expenditures. Globally, the company spent $14.9 billion in 2017 and expects to spend $16 billion in 2018, figures that include both U.S.-based investments in data centers and other projects and Asian investments in tooling for its contract manufacturers. \nIf Apple’s overall capital expenditures continue to expand at the same rate expected this year, the $30 billion investment in the United States could represent about a third of its capital expenditures over the next five years. \nThe announced tax payment was roughly in line with expectations, said Cross Research analyst Shannon Cross. The tax bill requires companies to pay a one-time tax on foreign-held earnings whether they intend to bring them back to the United States or not. \nApple had set aside $36.3 billion in anticipation of tax payments on its foreign cash, meaning the payment would not represent a major impact on its cash flow this quarter. \nJames Cordwell of Atlantic Equities said Apple’s U.S. investment plan could make it easier for the company to give more cash to shareholders. \n“Being seen to just hand the cash back to shareholders could spark some political sensitivities,” and the spending announcement could be part of Apple’s efforts to manage this issue, Cordwell said. \nApple also said it would boost its advanced manufacturing fund, used to provide capital and support to suppliers such as Finisar Corp ( FNSR.O ) and Corning Inc ( GLW.N ), from $1 billion to $5 billion. Apple said it planned to spend $55 billion with U.S.-based suppliers in 2018, up from $50 billion last year. AMAZON VS APPLE \nApple joins Amazon.com Inc ( AMZN.O ) in scouting for a location for a new campus. Amazon finished taking applications from cities in October for its second headquarters. \nAmazon set off a scramble between cities across the nation to host the headquarters, and Apple’s announcement stirred broad interest. Chicago Mayor Rahm Emanuel told reporters on Wednesday, “We’re going to go compete and we’re going to put our best foot forward” to compete for an Apple campus. A Philadelphia Department of Commerce spokeswoman said the city would submit a proposal if Apple opened the process for bids. \nApple has not said whether it had settled on a new campus location yet, and it did not make any commitments on the size of new spending or hiring specific to the campus. It did say it would initially house technical support for customers and would announce the location later this year. \nThe facility would be in addition to its “spaceship” Apple Park headquarters in Cupertino, California; a campus in Austin, Texas, that houses customer service agents and some manufacturing; and an Elk Grove, California, unit with several thousand customer service agents and iPhones refurbishing technicians. \nApple also has built its own data centers in North Carolina, Oregon, Nevada, Arizona and a recently announced project in Iowa, and leases data center space in other states. Additional reporting by Sonam Rai, Pushkala Aripaka, Muvija M. and Laharee Chatterjee in Bengaluru; editing by Peter Henderson, Richard Chang and Leslie Adler", "external_links": [], "published": "2018-01-18T02:45:00.000+02:00", "crawled": "2018-01-18T03:07:56.009+02:00", "highlightTitle": ""}