{"organizations": [], "uuid": "e60742e807d587bc7672dce03c8bbcbeded0f852", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/globe-newswire-gentex-corporation-announces-retirement.html", "country": "US", "domain_rank": 767, "title": "Gentex Corporation Announces Retirement", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T23:00:00.000+02:00", "replies_count": 0, "uuid": "e60742e807d587bc7672dce03c8bbcbeded0f852"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/globe-newswire-gentex-corporation-announces-retirement.html", "ord_in_thread": 0, "title": "Gentex Corporation Announces Retirement", "locations": [], "entities": {"persons": [{"name": "mic", "sentiment": "negative"}, {"name": "fred bauer", "sentiment": "none"}, {"name": "bauer", "sentiment": "none"}], "locations": [{"name": "mich.", "sentiment": "none"}, {"name": "zeeland", "sentiment": "none"}, {"name": "zeeland", "sentiment": "none"}], "organizations": [{"name": "gentex corporation", "sentiment": "negative"}, {"name": "gentex corporation announces retirement", "sentiment": "negative"}, {"name": "gentex", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ZEELAND, Mich., Jan. 05, 2018 (GLOBE NEWSWIRE) -- Gentex Corporation (NASDAQ:GNTX), the Zeeland, Michigan-based manufacturer of automatic-dimming rearview mirrors, automotive electronics, dimmable aircraft windows, and fire protection products, today announced the retirement of Fred Bauer as Chief Executive Officer and Chairman of the Board of Directors and his resignation from the Board.\nDuring Mr. Bauer's remarkable career, Gentex has grown from a startup, to a company with approximately $17 million in market capitalization at its initial public offering in 1981, to approximately $6 billion in market capitalization today. While Gentex is sorry to see Mr. Bauer retire, it is pleased to continue to have access to Mr. Bauer's wealth of experience as Chairman Emeritus, Founder, and Advisor.\nMr. Bauer created the Gentex foundations of devotion to quality and innovation, ownership mentality, and unpretentious management that allowed for its historical successes. Throughout his career, he created a cohesive and cooperative management team, with depth and breadth of talent. Under Mr. Bauer’s leadership, the Company has also become widely respected as an industry leader in technology and innovation.\nAs part of Mr. Bauer’s retirement, the Board of Directors has unanimously appointed Mr. James Wallace, the current Lead Independent Director, as the Company’s Chairman of the Board. Mr. Wallace stated: \"On behalf of the entire Board of Directors and everyone at Gentex, I would like to thank Fred Bauer for his extraordinary vision, leadership, and significant track record of success as CEO and Chairman. While we all respect Fred's decision to retire from the CEO and Chairman roles, we are fortunate that the Company will still have access to Fred's knowledge and wisdom. This next step in Fred's life has been well earned and his enormous contributions will continue to be remembered for years to come.”\nMr. Wallace also stated, “Our Board has been preparing and planning for the future and believes that the current management team is well prepared and fully capable of maintaining Gentex's historic levels of innovation, growth, and financial performance. Gentex’s new Chief Executive Officer, Steve Downing, is one example of the well prepared and capable management team. He is a respected leader with 15 years of demonstrated ability to deliver results using core Gentex principles. The promotion of Mr. Downing is a logical next step to maintaining the foundations for success established by Mr. Bauer.”\nFounded in 1974, Gentex Corporation (The Nasdaq Global Select Market: GNTX) is a supplier of automatic-dimming rearview mirrors and electronics to the automotive industry, dimmable aircraft windows for aviation markets, and fire protection products to the fire protection market. Visit the Company's web site at www.gentex.com .\nContact Information:\nGentex Investor & Media Contact\nJosh O'Berski\n(616) 772-1590, ext. 5814\nSource:Gentex Corporation", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/ac6035f3-0277-41d6-9a34-93618d5f5c0b"], "published": "2018-01-05T23:00:00.000+02:00", "crawled": "2018-01-06T01:03:57.002+02:00", "highlightTitle": ""}