{"organizations": [], "uuid": "2eb81557c89243bc4e4229a4bb76f2bc4fb95e98", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222888109&w=1200&r=LYNXMPEE0H041", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-mexico-corruption/mexico-to-send-extradition-requests-for-ex-ruling-party-governor-idUKKBN1F705X", "country": "US", "domain_rank": 408, "title": "Mexico to send extradition requests for ex-ruling party governor", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T03:32:00.000+02:00", "replies_count": 0, "uuid": "2eb81557c89243bc4e4229a4bb76f2bc4fb95e98"}, "author": "", "url": "https://uk.reuters.com/article/uk-mexico-corruption/mexico-to-send-extradition-requests-for-ex-ruling-party-governor-idUKKBN1F705X", "ord_in_thread": 0, "title": "Mexico to send extradition requests for ex-ruling party governor", "locations": [], "entities": {"persons": [{"name": "enrique pena nieto", "sentiment": "none"}, {"name": "cesar duarte", "sentiment": "none"}, {"name": "duarte", "sentiment": "none"}, {"name": "elias", "sentiment": "none"}, {"name": "alberto elias", "sentiment": "none"}], "locations": [{"name": "mexico", "sentiment": "none"}, {"name": "mexico city", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "chihuahua", "sentiment": "none"}], "organizations": [{"name": "pri", "sentiment": "none"}, {"name": "institutional revolutionary party", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 1:33 AM / Updated 4 hours ago Mexico to send extradition requests for ex-ruling party governor Reuters Staff 2 Min Read \nMEXICO CITY (Reuters) - Mexico will present three extradition requests this week for the former ruling party governor of the northern border state of Chihuahua, the attorney general’s office said on Wednesday. \nCesar Duarte, who governed Chihuahua for President Enrique Pena Nieto’s Institutional Revolutionary Party (PRI) between 2010 and 2016, is wanted on graft charges. He is said by his successor in the job to be in the United States. \nActing Attorney General Alberto Elias said his office had received 11 criminal accusations against Duarte in 2017, and after processing them, would draw up the extradition requests. \n“This week, we will present three: two for the Chihuahua state attorney general’s office and one for the federal branch,” Elias told reporters. \nElias declined to say where the requests would be directed when asked if they were for the United States. He later said in a radio interview that he could not reveal if Duarte was in the United States lest he infringe due process. \nThe announcement of the extradition requests comes a day after the PRI’s presidential hopeful, Jose Antonio Meade, who is languishing in third place in opinion polls, urged Mexico to step up efforts to fight rampant corruption and impunity. \nThe situation in Chihuahua risks keeping attention on alleged PRI graft in the run-up to July’s presidential election. Tackling corruption has become a key campaign issue. \nChihuahua Governor Javier Corral, of the center-right opposition National Action Party (PAN), has taken the lead in trying to bring Duarte back to Mexico to face justice. Corral has repeatedly said Duarte is in the United States. \nLast month, Chihuahua’s government announced the arrest by state and federal authorities of Alejandro Gutierrez, a former top PRI finance official. Corral later accused Mexico’s finance ministry of withholding funds to punish his administration for launching an investigation into alleged PRI corruption. Reporting by Stefanie Eschenbacher and Diego Ore; Editing by Leslie Adler", "external_links": [], "published": "2018-01-18T03:32:00.000+02:00", "crawled": "2018-01-18T04:48:57.023+02:00", "highlightTitle": ""}