{"organizations": [], "uuid": "91f3a8a2f1a9206f447b06fcd97483c58ba76b80", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-skyline-medical-announces-corporate-name-change-to-precision-therapeutics.html", "country": "US", "domain_rank": 767, "title": "Skyline Medical Announces Corporate Name Change to Precision Therapeutics", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T16:30:00.000+02:00", "replies_count": 0, "uuid": "91f3a8a2f1a9206f447b06fcd97483c58ba76b80"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-skyline-medical-announces-corporate-name-change-to-precision-therapeutics.html", "ord_in_thread": 0, "title": "Skyline Medical Announces Corporate Name Change to Precision Therapeutics", "locations": [], "entities": {"persons": [], "locations": [{"name": "minneapolis", "sentiment": "none"}], "organizations": [{"name": "skyline medical inc", "sentiment": "negative"}, {"name": "nasdaq", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "precision therapeutics inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MINNEAPOLIS, Skyline Medical Inc (NASDAQ:SKLN) (“Skyline” or the “Company”) today announced it will change its name to Precision Therapeutics Inc., effective February 1, 2018. The new name has been chosen to better reflect the Company’s new strategic focus on applying artificial intelligence to precision medicine and drug discovery and marks a new chapter of the Company’s growth.\nIn addition to the new corporate name, the Company will change its ticker symbol on NASDAQ to ‘AIPT’. The Company will issue another press release in the near future announcing the date at which the new ticker symbol will take effect.\nPrecision Therapeutics mission is to positively improve the effectiveness of cancer therapy using the power of artificial intelligence (AI) applied to our rich data diseases data base. Through our venture with Helomics we control a diagnostic platform that generates rich molecular profiles and drug response data from the patient’s own tumor. This data is analyzed by our AI-based bioinformatics platform (D-CHIP™) which provides a precision oncology roadmap for the patient and their oncologist. Revenues are generated from the Helomics platform for the tests performed, e.g. Next Generation Sequencing (NGS) of the tumor etc. The D-CHIP platform continually learns the association between the DNA alterations and the drug response of the patient’s tumor generating actionable knowledge that is of great value to Pharma companies developing new therapies. Access to this knowledge and any lab services is offered through Helomics Contract Research (CRO) business.\nTo enhance the foundation provided by Helomics and drive both diagnostic and CRO revenues we intend to add additional strategic partnerships and acquisitions in the precision medicine space such as additional molecular tests for cancer and other diseases, companion diagnostics, microbiome assessment and other technologies to complement Next Generation Sequencing (NGS), e.g. standards.\nEvery test we perform adds to both the depth and utility of the D-CHIP knowledgebase to create a unique and highly valuable asset, allowing Precision Therapeutic to achieve its goal of positively improving patient outcomes.\nPrecision Medicine is an emerging field of healthcare that considers a patient’s genes, lifestyle, and environment in the development of effective therapies to treat disease. This is leading to better and more personalized treatments and diagnostic technologies and is rapidly becoming seen as a credible new approach to healthcare. According to research from Global Market Insights , the precision medicine market is estimated to grow at 10.5% CAGR to reach $96 billion by 2024.\nSkyline’s new growth strategy is to participate in the growth of the emerging precision medicine sector by providing customized contract research organization (“CRO”) services to pharmaceutical, diagnostic, and academic organizations as they seek to bring novel drugs and targeted therapies to the marketplace. To drive this plan, the Company has secured a 20% equity stake in Helomics Corporation, a precision diagnostic company and integrated clinical contract research organization with established operations that bridge two emerging areas of the healthcare industry: precision medicine and artificial intelligence/big data. Helomics D-Chip platform uses artificial intelligence-powered bioinformatics to find insights from patient tumor data to help disease diagnosis, produce new diagnostics and therapies and perform improved clinical trials. The Company plans to increase its investment in Helomics to 25% through the conversion of a previous $500,000 loan to Helomics.\nThrough the Company’s partnership with Helomics, the Company has also partnered with GLG Pharma, a biotechnology company focused on precision medicine, to add a collection system to the STREAMWAY System, using GLG’s Capture, Culture and Screening system. The Company also continues to explore other opportunities to partner with revenue-generating companies and create near-term and long-term value for its shareholders in the CRO space.\nThe Company believes its flagship product, the FDA approved STREAMWAY®System, is the best solution on the market for medical fluid waste management and the Company will continue to implement its enhanced sales and marketing campaign, which commenced in 2017. The Company has already seen early success with this campaign, and reported a ramp in trials and sales of the STREAMWAY System to U.S.-based hospitals in the fourth quarter of 2017 and early 2018. Due to the industry’s strong brand recognition of both Skyline Medical and the STREAMWAY System, Skyline Medical will continue to operate as a division of Precision Therapeutics, and all core elements of the fluid waste management business will remain the same.\nDr. Carl Schwartz, CEO of Skyline Medical, commented, “Our new strategic direction marks a significant step in the Company’s evolution, and by changing our name we are developing a strong corporate identity that will accurately represent our company and its services to both our customers and shareholders. Expanding into precision medicine provides our shareholders with access to a rapidly growing market that is revolutionizing the future of healthcare. Precision Therapeutics will operate two divisions: one which will be entirely focused on providing customized CRO services to pharmaceutical companies engaged in the development of precision medicine, and the other will continue to operate as Skyline Medical, the industry-leading producer of the STREAMWAY® System for automated, direct-to-drain medical fluid disposal.”\nAlong with the name change and change in NASDAQ symbol, the Company plans to adopt a new logo and new website. The Company will provide further updates to shareholders regarding these changes in the near future.\nAbout Skyline Medical\nSkyline Medical produces a fully automated, patented, FDA-cleared waste fluid disposal system that virtually eliminates staff exposure to blood, irrigation fluid and other potentially infectious fluids found in the healthcare environment. Antiquated manual fluid handling methods that require hand carrying and emptying filled fluid canisters present an exposure risk and potential liability. Skyline Medical's STREAMWAY System fully automates the collection, measurement and disposal of waste fluids and is designed to: 1) reduce overhead costs to hospitals and surgical centers; 2) improve compliance with OSHA and other regulatory agency safety guidelines; 3) improve efficiency in the operating room, and radiology and endoscopy departments, thereby leading to greater profitability; and 4) provide greater environmental stewardship by helping to eliminate the approximately 50 million potentially disease-infected canisters that go into landfills each year in the U.S. In the fourth quarter of 2017, Skyline Medical announced its intention to enter the precision medicine space through a strategic partnership with Helomics. As of February 1, 2018, the Company’s corporate name will be changed to Precision Therapeutics. For additional information, please visit www.skylinemedical.com .\nForward-looking Statements\nCertain of the matters discussed in this announcement contain forward-looking statements that involve material risks to and uncertainties in the Company's business that may cause actual results to differ materially from those anticipated by the statements made herein. Such risks and uncertainties include risks related to the proposed joint ventures, including the need to negotiate the definitive agreements for the joint ventures; possible failure to realize anticipated benefits of the joint ventures; and costs of providing funding to the joint ventures. Other risks and uncertainties relating to the Company include, among other things, current negative operating cash flows and a need for additional funding to finance our operating plan; the terms of any further financing, which may be highly dilutive and may include onerous terms; unexpected costs and operating deficits, and lower than expected sales and revenues; uncertain willingness and ability of customers to adopt new technologies and other factors that may affect further market acceptance, if our product is not accepted by our potential customers, it is unlikely that we will ever become profitable; adverse economic conditions; adverse results of any legal proceedings; the volatility of our operating results and financial condition; inability to attract or retain qualified senior management personnel, including sales and marketing personnel; our ability to establish and maintain the proprietary nature of our technology through the patent process, as well as our ability to possibly license from others patents and patent applications necessary to develop products; the Company's ability to implement its long range business plan for various applications of its technology; the Company's ability to enter into agreements with any necessary marketing and/or distribution partners and with any strategic or joint venture partners; the impact of competition, the obtaining and maintenance of any necessary regulatory clearances applicable to applications of the Company's technology; and management of growth and other risks and uncertainties that may be detailed from time to time in the Company's reports filed with the Securities and Exchange Commission, which are available for review at www.sec.gov . This is not a solicitation to buy or sell securities and does not purport to be an analysis of the Company's financial position. See the Company's most recent Annual Report on Form 10-K, and subsequent reports and other filings at www.sec.gov .\nContacts:\nSkyline Medical\nCarl Schwartz, Chief Executive Officer\n(651) 389-4800\ncschwartz@skylinemedical.com\nInvestors\nKCSA Strategic Communications\nElizabeth Barker\n(212) 896-1203\nebarker@kcsa.com\nSource:Skyline Medical Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=XnhSog7pBp_w8KdIlREri2o-fhaMvBOYjIiIPCY9pnb_hVefp2gJY7FuINbe_8aA1y6v4x60a0CN3IirI2RqWp4IQ1Dohdyd13pW6g_JL69_y8EWLQHfq0EnKQADM22mArp-S3okg1BSRHc0r1VDMZSeBHb3urlJp5U1bHGJTlX5MUi8JbJIzFXzZezp1mtpeANwJt4J0ZaTmt8MHrVL58PVOk6dhiLZlCZeCFJcM1moLVEY5zoBQN6yhq8pWSxbsGi_QOUG-D88b2t6wVwp1g==", "https://www.globenewswire.com/Tracker?data=hYnp7g2wbcspWuZ6d0SO0YoToGLUHZxKg4gtyzCd1GykaF3BoXeKNS_WIj-B-s2Zz2GnHXwe9pEcBYPfSf2aJvAYxl1aVSfIer4rtXzY0jsLrgvmPTXRq9VGhyUFfpeA3nipLExI7xtbvml-UoXqdv-1ucEY40ynojpUjKcRCbPFfTjDcemvWhOXE4glX45eejnx9dZC0nT8rrhObeBGfzF5nd31n8ihyoXoaYrAaDIAitV3IFIA7m66tOu6T_hE", "https://www.globenewswire.com/Tracker?data=sJk1zYmOJAF--9MiHQlKYw8HCVhzto6hmMI715gaoitTzSSUtuIqSFP00M9KCiG3MrO8kcVDpSh4BmGp1BciojXOd_V2Xc2ia7jt3XOfThC714AeQLzwfDrzxr3kPBxjfIrVkKWiy25IvMvvhR_NBz6X7fGDrtz5Gy58bjkwTy7x7XShbiSmapnfe0M2neoVpl6lf4P2sIeNPOrfPh5C717bZh5EGk8gaAOdHl9b6ZfglQoouYu6AKBl1TEygorr_3zkBU5aCFMgkQmpt6ruCkIDwRWhb2hNKaGhCF81sEtDxbn61sm22YNQYl5ldnEFFp4dNBsjdQj2d8wL3yvF73Dj1FgfjM2wiPBuZ2luYtMrrcTg_hO9_7DDlfhQdSS7gXauXruisPJpAs9nB8KdZ2JgwaMGq92XuBwJZtmLV34=", "https://www.globenewswire.com/Tracker?data=UqSjb3K_QfqDShlSfLP2yNhLkmgldWYuO7IJdALWoSEFQ5GzhLN6adqCdmqg7HuPVeHfPVAp63w6dv33ayYuYg==", "https://www.globenewswire.com/Tracker?data=sJk1zYmOJAF--9MiHQlKY_amTZxzkPnVzE1BZHJtr2x0YeprR-aw86fijUEINGXJhQd_O8p3vX0mUrCpLxP04XB8xMV52yHLuATgVwHcTxmPWvZlYBmAtCyoZxyYIr5gqIjJAcQXtMKWFQNXy6Pkc2nzIFfxeMPSWoixvx4OnmmKPcDLfJm1Btksl5gD3UtjP7_NbVzi7Dfc-kdKxsazIYQSoZloR1KQWPpjfaX31Nu1m0WsXlIj8SwCOb-EQYPCL8IVrlkZga0jYgPsnd7UhGtDfwrS3VKGAcxLt7zqfYuVNg6JqoRyzvNV5JHfAonpb_eGdtra-ockBpJe61rt6n8oTydkED-3WcWlfN4FR9P9kgei1Ku-6XGAq0Urd29WvH_wAJr1GL7FxtodAQ-6ZE1WW25iGGveGXYBQWIfeoo=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/50df622d-fd44-4093-a46f-dfb1236eccca", "https://www.globenewswire.com/Tracker?data=shRaLNvgChvkhrQBvNI246RWOkUQv6Ds-x8KmO2_nJo-lykH2hAXsNtBXGpvFfLyXvnycII2DR6o7kwfEjeXdA3dGt080O-hyD46WN-wxQ0=", "https://www.globenewswire.com/Tracker?data=B-RLjDahjicDPd2EkkLRkWeTQS6bALm6XKT6CIP_x4xoxxdGKH_UQHS-YwFPvQyomJepnysnOkrdgrAtrAQztrPx47X_m2et7Gq-EE-j7sgIUqrllgs3XNh2_qNgkeea"], "published": "2018-01-25T16:30:00.000+02:00", "crawled": "2018-01-25T18:16:35.007+02:00", "highlightTitle": ""}