{"organizations": [], "uuid": "85f42f07ba5040c11178c5fc009459a794142237", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219645846&w=1200&r=LYNXMPEE0410G", "site_section": "http://feeds.reuters.com/reuters/healthNews", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-richter-gedeon-esmya/hungarys-richter-expects-esmya-drug-ruling-in-first-half-ceo-idUSKBN1EU1NA", "country": "US", "domain_rank": 408, "title": "Hungary's Richter expects Esmya drug ruling in first half: CEO", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T18:57:00.000+02:00", "replies_count": 0, "uuid": "85f42f07ba5040c11178c5fc009459a794142237"}, "author": "", "url": "https://www.reuters.com/article/us-richter-gedeon-esmya/hungarys-richter-expects-esmya-drug-ruling-in-first-half-ceo-idUSKBN1EU1NA", "ord_in_thread": 0, "title": "Hungary's Richter expects Esmya drug ruling in first half: CEO", "locations": [], "entities": {"persons": [{"name": "richter", "sentiment": "negative"}, {"name": "gergely szakacs", "sentiment": "none"}, {"name": "gabor orban", "sentiment": "none"}], "locations": [{"name": "hungary", "sentiment": "none"}, {"name": "esmya", "sentiment": "none"}], "organizations": [{"name": "esmya", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  budapest", "sentiment": "none"}, {"name": "european medicines agency", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BUDAPEST (Reuters) - Hungarian drugmaker Richter expects European health inspectors to deliver a ruling on its Esmya medicine in the first half of 2018, its chief executive told Reuters, adding that uncertainty about the drug could delay earnings guidance.\nIn December the European Medicines Agency (EMA) opened a review into Esmya, used to treat non-cancerous tumors in the womb, after four reports of serious liver damage in patients treated with the drug, three of whom ended up needing liver transplants.\nRichter has said its clinical data indicated no demonstrable link between liver damage and Esmya, one of its flagship products, which accounted for about 6 percent of revenues in the first nine months of 2017.\n“We maintain the view that this is an effective and safe method of treatment for a wide population of patients,” Chief Executive Gabor Orban said in an interview on Friday.\nAsked whether the uncertainty, which sparked a sell-off in Richter’s shares early last month, spilled over into sales of the medicine, Orban said it was too early to assess any fallout.\n“Sales in the first eleven months (of 2017) were on track” for the drug to reach its full-year revenue target of 85 million euros ($102 million), Orban said.\nOrban said December sales data was generally “difficult to interpret,” while he had seen no data for January yet.\nRichter shares closed 1 percent higher at 6,735 forints ($26) on the Budapest Stock Exchange on Friday, having underperformed the blue-chip index over the past three months.\nOrban said if current levels of uncertainty around Esmya persist, Richter, which makes gynecological, cardiovascular and central nervous system drugs, may not issue earnings guidance next month, as it usually does.\nThe last time that happened was in 2009, during the global financial crisis, when the company said the market environment was too unpredictable to give reliable forecasts.\n“We will see what happens with the turnover of Esmya and the level of uncertainty in a month,” Orban said. The EMA has said it would next discuss the issue in February.\nRichter, which has a market capitalization of $4.8 billion and earns most of its revenue from exports, will publish fourth-quarter earnings on February 8. Orban said there were no further cases of liver damage since the inquiry was launched.\nAsked about a worst-case scenario, Orban said as with any medicine, that would be health regulators withdrawing the registration of Esmya, adding that he saw “zero sign” of that happening. “This is entirely unrealistic,” he said.\nOrban added that Richter, whose biggest markets are Russia and the European Union, had nearly 100 billion forints ($390 million) of cash to spend on acquisitions and while there were several possible targets, no deal was imminent.\nThe CEO also said the outcome of the Esmya probe would have no impact on dividend policy.\nReporting by Gergely Szakacs; Editing by Elaine Hardcastle\n ", "external_links": [], "published": "2018-01-05T18:57:00.000+02:00", "crawled": "2018-01-05T19:12:29.033+02:00", "highlightTitle": ""}