{"organizations": [], "uuid": "23a049b9a6f995b985791fe316c19e6253fd65a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/04/06/102563001-467701296.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/15/oil-markets-near-three-year-highs-supported-by-healthy-demand.html", "country": "US", "domain_rank": 767, "title": "Oil markets near three-year highs, supported by healthy demand", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.404, "site_type": "news", "published": "2018-01-16T04:26:00.000+02:00", "replies_count": 0, "uuid": "23a049b9a6f995b985791fe316c19e6253fd65a3"}, "author": "Getty Images", "url": "https://www.cnbc.com/2018/01/15/oil-markets-near-three-year-highs-supported-by-healthy-demand.html", "ord_in_thread": 0, "title": "Oil markets near three-year highs, supported by healthy demand", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "gonzales", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "mins ago getty", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Oil prices dropped off three-year highs on Tuesday as traders booked profit from a recent rally but healthy demand underpinned prices near $70, a level not seen since the market slump in 2014.\nPrices have been driven up by oil production curbs in OPEC nations and Russia, and demand amid healthy economic growth.\nImports to India, the world's third-biggest oil consumer, rose by about 1.8 percent in 2017 to a record 4.37 million barrels per day as the country boosted purchases to feed its expanded refining capacity.\nU.S. West Texas Intermediate (WTI) crude futures ended Tuesday's session down 57 cents at $63.73 a barrel. WTI hit a December 2014 peak of $64.89 in early trading.\nBrent futures fell $1.05, or 1.5 percent, to $69.21 a barrel by 2:29 p.m. ET. Earlier in the day, the price lost more than $1 to a low of $68.92.\nTraders said Brent was well supported overall at around $70. Brent hit $70.37 on Monday, a high from December 2014, when markets were at the beginning of a three-year decline.\nshow chapters Crude prices sit near 3-year highs 9 Hours Ago | 03:26 \"It's such a quiet day ... I think this is a pause as you try and decide what the rise in rig counts means and what the Russia comments mean,\" said Rob Haworth, senior investment strategist at U.S. Bank Wealth Management.\nReacting to the recent three-year high, Russian Energy Minister Alexander Novak said the oil market was not yet balanced and that the global deal to cut output should continue as the price rise could be due to cold weather.\nThe U.S. rig count, an early indicator of future output, rose by 10 oil rigs last week to 752 and is much higher than a year ago when only 522 rigs were active.\n\"All in all, this is still a pretty positive day because even though there is no news to drive prices, you're not giving up much ground here,\" Haworth said.\nMost analysts and market participants said oil is vulnerable to profit taking as hedge funds and money mangers have amassed a record number of bullish bets on U.S. crude.\nIn addition, trading was thin on Monday due to the Martin Luther King Jr. Day holiday in the United States.\nFundamentally, oil has been pushed higher by an effort led by the Organization of the Petroleum Exporting Countries and Russia to withhold production since January last year. The cuts are set to last through 2018.\nshow chapters Watch labor costs in estimating US crude oil output gains for 2018 8:48 PM ET Sun, 14 Jan 2018 | 04:10 The restraint has coincided with healthy oil demand, pushing up crude by almost 15 percent since early December.\n\"This rally has been driven first by robust fundamentals, with strong demand growth and high OPEC compliance accelerating,\" U.S. bank Goldman Sachs said in a note.\n\"We see increasing upside risks to our $62 per barrel Brent and $57.5 per barrel WTI forecast for the coming months.\"\nOther banks, including Bank of America Merrill Lynch, Societe Generale and Morgan Stanley, have raised their price forecasts.\n\"Our view is that prices are overheated, and will correct lower,\" SocGen said in a note. \"We believe that the current situation, with strong uplift from fundamentals, non-fundamentals, and geopolitics all at the same time, is not sustainable.\"\nA factor that held back crude prices in 2017, the surge in U.S. production, has stalled at least temporarily due to icy winter weather.\nU.S. production has fallen from 9.8 million barrels per day in December to 9.5 million bpd currently. However, most analysts still expect U.S. output to break above 10 million bpd soon.", "external_links": [], "published": "2018-01-16T04:26:00.000+02:00", "crawled": "2018-01-16T04:30:46.043+02:00", "highlightTitle": ""}