{"organizations": [], "uuid": "7cd1de65a320f6f4e56f8db8c95a59a50116aaf9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/10/president-trump-economy-stock-market.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/11/trump-tweet-fisa-house-vote/", "country": "US", "domain_rank": 1196, "title": "House Renews FISA Spying Law Despite Trump's Conflicting Tweets | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.526, "site_type": "news", "published": "2018-01-12T16:24:00.000+02:00", "replies_count": 0, "uuid": "7cd1de65a320f6f4e56f8db8c95a59a50116aaf9"}, "author": "Natasha Bach", "url": "http://fortune.com/2018/01/11/trump-tweet-fisa-house-vote/", "ord_in_thread": 0, "title": "House Renews FISA Spying Law Despite Trump's Conflicting Tweets | Fortune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Natasha Bach 2:24 PM EST \nThe House passed a measure to reauthorize controversial spying provisions Thursday, just hours after a tweet by President Donald Trump nearly derailed the vote. \nThe bill, which passed 256-164, renewed section 702 of the Foreign Intelligence Surveillance Act (FISA) for six years. The law allows intelligence agencies like the NSA to collect texts and emails of foreigners abroad without a specific warrant and was due to expire next week. It will now go to the Senate for a vote. \nWhile the bill passed handily in the House, the vote was thrown into question earlier Thursday, when Trump, whose administration had previously expressed support for FISA , posted a tweet that cast doubt about his position on the law. \nRead: Tom Malinowski, A Whistleblower on Russian Election Meddling, Is Running for Congress \nReferring to a segment that had appeared on Fox News morning show Fox & Friends that criticized FISA, Trump tweeted: “‘House votes on controversial FISA ACT today.’ This is the act that may have been used, with the help of the discredited and phony Dossier, to so badly surveil and abuse the Trump Campaign by the previous administration and others?” The dossier in question makes claims about ties between Russia, Trump, and his aides. \nThe comment references the so-called Steele dossier that was compiled by former British intelligence officer about Trump’s alleged contacts with Russians before and during his presidential campaign. It has become a major subject of debate in the special counsel’s investigation into any collusion between Trump’s campaign and Russia. “House votes on controversial FISA ACT today.” This is the act that may have been used, with the help of the discredited and phony Dossier, to so badly surveil and abuse the Trump Campaign by the previous administration and others? \n— Donald J. Trump (@realDonaldTrump) January 11, 2018 \nThe tweet threw the House into a state of chaos, as Trump appeared to be contradicting a week of statements from his own administration that supported the reauthorization. Rep. Adam Schiff (D-Calif.), the ranking Democrat on the House Intelligence Committee, told the The Daily Beast that Trump’s tweet “threw everything into turmoil.” “I can only imagine that the reaction within the intelligence community and law enforcement and among his own cabinet was the same as it was here in Congress, which is hard to describe without the use of expletives,” he continued. \nRead: Retired FBI Agent: The Real Reason Trump’s Lawyers Don’t Want a Mueller Interview \nAccording to CNN , phones at the White House “began ringing almost immediately” after Trump’s tweet, and his advisors quickly began to draft a follow-up tweet to clarify the administration’s position. Less than two hours after the original tweet, Trump tweeted , “With that being said, I have personally directed the fix to the unmasking process since taking office and today’s vote is about foreign surveillance of foreign bad guys on foreign land. We need it! Get smart!” With that being said, I have personally directed the fix to the unmasking process since taking office and today’s vote is about foreign surveillance of foreign bad guys on foreign land. We need it! Get smart! \n— Donald J. Trump (@realDonaldTrump) January 11, 2018 \nDisaster averted—for now. ", "external_links": [], "published": "2018-01-12T16:24:00.000+02:00", "crawled": "2018-01-12T00:09:51.003+02:00", "highlightTitle": ""}