{"organizations": [], "uuid": "dba89328785077ed9d982e7b84c33c157792c817", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223130949&w=1200&r=LYNXMPEE0H1VY", "site_section": "http://feeds.reuters.com/Reuters/domesticNews", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-usa-fiscal-temporary/empty-prisons-grounded-warplanes-u-s-budget-dysfunction-hits-home-idUSKBN1F72YS", "country": "US", "domain_rank": 408, "title": "Empty prisons, grounded warplanes: U.S. budget dysfunction hits home", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T22:26:00.000+02:00", "replies_count": 0, "uuid": "dba89328785077ed9d982e7b84c33c157792c817"}, "author": "", "url": "https://www.reuters.com/article/us-usa-fiscal-temporary/empty-prisons-grounded-warplanes-u-s-budget-dysfunction-hits-home-idUSKBN1F72YS", "ord_in_thread": 0, "title": "Empty prisons, grounded warplanes: U.S. budget dysfunction hits home", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "andy sullivan", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "coast guard", "sentiment": "none"}, {"name": "mar-a-lago", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 8:27 PM / in 33 minutes Empty prisons, grounded warplanes: U.S. budget dysfunction hits home Andy Sullivan 6 Min Read \nWASHINGTON (Reuters) - Three hours west of Chicago, a federal prison stands ready to take in thousands of inmates and hire hundreds of guards, but its expansion is on hold, awaiting approval from a U.S. Congress that is again paralyzed by budget disputes. \nIn Florida, the Coast Guard patrols the waters off President Donald Trump’s Mar-a-Lago resort, working off an outdated budget that has not increased to account for this new mission. \nAcross the country, with the 2018 fiscal year well under way, the U.S. government is carrying out duties ranging from nuclear weapons development to homeless assistance, but its spending levels and priorities are four months out of date. \nThat is because Congress, once again, failed last year to approve a new budget on time by Oct. 1. Instead, lawmakers since then have approved three temporary spending measures that have kept the fiscal 2017 budget in place. \nOn Thursday, congressional Republicans and Democrats were fighting furiously over the terms of a fourth temporary measure, known as a continuing resolution, that would extend funding past its Friday midnight expiration. \nCongressional leaders see another temporary extension as a better option than the alternative: a partial shutdown that would furlough hundreds of thousands of federal workers and shutter landmarks such as the Statue of Liberty. \nTheir plan would include a few exceptions. The Pentagon could go ahead with a missile defense program, for example. But otherwise it would keep government spending effectively on autopilot. \nCongress has managed to pass its spending bills on time in only four of the past 40 years, according to the Government Accountability Office (GAO), a congressional in-house watchdog. (Graphic on Congress missing deadlines to pass spending bills: ( tmsnrt.rs/2Dj1hdQ ) \nLast year, after three continuing resolutions, Trump enacted the fiscal 2017 spending bill on May 5 - 216 days late. \nMissing deadlines: tmsnrt.rs/2EUvFvM INAUGURATION BILLS \nDysfunction on this level often prevents the government from launching new projects and closing out those that have run their course. It also fails to account for inflation, salary increases and other rising costs. \n“You’re stuck with old decisions, whether or not those are the right decisions for 2018,” Marc Goldwein, senior policy director at the Committee for a Responsible Budget, said in an interview on Thursday. \nFor example, last year’s spending bill set aside $20 million to reimburse Washington-area local governments for the cost of providing security during Trump’s January inauguration. Those instructions remain in the current spending bill even though the inauguration has long since passed. \nMeanwhile, with the fiscal 2018 budget still incomplete, the Pentagon says it is waiting to launch what it says is a much-needed rebuilding effort after 16 years of continuous war. White House Office of Management and Budget (OMB) Director Mick Mulvaney arrives for meetings at the U.S. Capitol in Washington, U.S. January 18, 2018. REUTERS/Jonathan Ernst \nThe National Institutes of Health has already scaled back medical research, due to uncertainty over how much it will ultimately get from Congress. \nThe Bureau of Prisons is continuing pre-construction work on a prison in Kentucky that it says it does not need, even as the Illinois facility stands idle. \nIn Idaho, state health official Kathy Turner has abandoned the idea of strengthening a computer system for tracking outbreaks of influenza, bacterial meningitis and other diseases. \nWith funding uncertain for the U.S. Centers for Disease Control and Prevention, Turner said, she does not know whether she can budget more hours for outside data analysts to build out the system. Though her application is not due until May, Turner said, it is already too late to line up a contractor. \n“It can be disheartening,” she said. “The frustration of having this nebulous unknown sitting in front of us makes it much more difficult to plan for the future.” \nPast budget delays have curtailed food and drug inspections and slowed veterans’ benefits claims, according to a 2009 GAO report, and forced the Federal Bureau of Investigation to postpone upgrades to a computer system used in counterintelligence work. WARPLANES AND MARINES \nThis year, spending delays have forced the Pentagon to scale back training exercises, leaving Air Force planes on the ground and Marines in the barracks. Military officials also say they have postponed purchases of bombs and missiles. \nBudget delays prevent buying in bulk, as well, forcing the government to spend more on repeated, smaller contracts on everything from food to bullets. \nThe uncertainty has cost the U.S. Navy $4 billion in recent years, according to Navy Secretary Richard Spencer. “Since 2011, we have put $4 billion in the trash can, put lighter fluid on top of it, and burned it,” Spencer said at a U.S. Naval Institute forum on Dec. 4. \nFor a rural stretch of Illinois, the problem is not that dollars are burned - it is that they are frozen. \n“Just like every other government agency, we’re kind of waiting for the 2018 budget to be signed,” said Lynelle Asberry, an assistant to the warden at the federal penitentiary in Thomson, Illinois. \nThe Bureau of Prisons has spent years upgrading fencing, computers and other facilities at a prison it bought from the state of Illinois, readying it for 2,900 maximum-security prisoners. The next step is to hire 300 or so prison guards, medical staff and other personnel. \nAll that is needed now is for Congress to approve the $80 million required to finish the job. \n“We’ll believe it when we see it,” said Everett Pannier, mayor of the nearby town of Morrison, which is looking forward to an economic boost from the project. “It’s a beautiful facility, if a prison can be beautiful.” Reporting by Andy Sullivan; Editing by Kevin Drawbaugh and Matthew Lewis", "external_links": [], "published": "2018-01-18T22:26:00.000+02:00", "crawled": "2018-01-18T22:47:27.027+02:00", "highlightTitle": ""}