{"organizations": [], "uuid": "f3fc78ad5fd43d1ec9563ee6856afd2aea068984", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-trubnaya-metal-ipo/russian-pipe-maker-tmks-u-s-subsidiary-sets-ipo-price-range-idUSKBN1FI24I", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Russian pipe maker TMK's U.S. subsidiary sets IPO price range", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T18:39:00.000+02:00", "replies_count": 0, "uuid": "f3fc78ad5fd43d1ec9563ee6856afd2aea068984"}, "author": "", "url": "https://www.reuters.com/article/us-trubnaya-metal-ipo/russian-pipe-maker-tmks-u-s-subsidiary-sets-ipo-price-range-idUSKBN1FI24I", "ord_in_thread": 0, "title": "UPDATE 1-Russian pipe maker TMK's U.S. subsidiary sets IPO price range", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "tmk", "sentiment": "negative"}, {"name": "new york stock exchange", "sentiment": "none"}, {"name": "ipsco", "sentiment": "none"}, {"name": "ipsco tubulars", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 46 PM / in a minute Russian pipe maker TMK's U.S. subsidiary sets IPO price range Reuters Staff 3 Min Read \nMOSCOW (Reuters) - U.S. steel pipes producer IPSCO Tubulars and its owner, Russia’s TMK ( TRMK.MM ) aim to raise between $465 million and $535 million from IPSCO’s initial public offering (IPO) on the New York Stock Exchange, it said on Monday. \nIPSCO announced a price range for the deal amid market expectations that Washington would release reports detailing the possibilities for expanding sanctions against Moscow, including a list of prominent businessmen and potential restrictions on the holding of Russian government debt. \nWith the price range set at $20-$23 per share, IPSCO aims to sell 23,255,813 of its shares in total, of which 7,441,860 shares are to be sold by the company itself and 15,813,953 shares are to be sold by TMK, Russia’s largest maker of steel pipes for the oil and gas industry. \nUpon completion of the deal, TMK’s stake in IPSCO will drop from the current 100 percent to 62 percent, or to 58 percent if the deal underwriters use their 30-day option to purchase an additional 3,488,372 shares. \nThe Russian metals and mining industry has largely been unaffected by Western sanctions, first imposed in 2014 over Moscow’s annexation of Crimea from Ukraine, and TMK has remained in the clear. \nControlled by Russian businessman Dmitry Pumpyansky, TMK paid around $1.7 billion for the IPSCO assets in 2008 and 2009, VTB Capital said in a note in October. \nIPSCO’s business has been recently supported by a global deal between OPEC and non-OPEC states, including Russia, in which they agreed to cut oil supplies and also encouraged some U.S. shale oil producers to ramp up output. \nIPSCO plans to use the proceeds from the deal to repay a part of its debt and for general corporate purposes, it said in a statement. \nIts fourth-quarter net income was in a range of $20.7 million and $29.2 million. The revenue totaled $313-332 million, with earnings before interest, taxation, depreciation and amortization (EBITDA) at $38.2-46.3 million. \nAnalysts at Aton investment firm expect IPSCO’s 2018 EBITDA at $140-150 million. \n“We currently expect that we will commence paying cash dividends to the holders of our common stock in the future,” IPSCO said. However, no dividend payment is expected for at least the first two quarters following the deal. \nBofA Merrill Lynch and Morgan Stanley are acting as joint book-running managers for the deal. Reporting by Polina Devitt; Writing by Polina Ivanova and Polina Devitt; Editing by Vladimir Soldatkin and David Evans", "external_links": [], "published": "2018-01-29T18:39:00.000+02:00", "crawled": "2018-01-29T19:03:35.017+02:00", "highlightTitle": ""}