{"organizations": [], "uuid": "2b62147f4fe68fa72c79eed7abc115749d1a2162", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INworldNews", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/usa-turkey/turkey-says-citizens-travelling-to-united-states-face-risk-of-arbitrary-arrest-idINKBN1F10OO", "country": "US", "domain_rank": 408, "title": "Turkey says citizens travelling to United States face risk of arbitrary arrest", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T09:48:00.000+02:00", "replies_count": 0, "uuid": "2b62147f4fe68fa72c79eed7abc115749d1a2162"}, "author": "", "url": "https://in.reuters.com/article/usa-turkey/turkey-says-citizens-travelling-to-united-states-face-risk-of-arbitrary-arrest-idINKBN1F10OO", "ord_in_thread": 0, "title": "Turkey says citizens travelling to United States face risk of arbitrary arrest", "locations": [], "entities": {"persons": [{"name": "daren butler", "sentiment": "none"}, {"name": "david dolan", "sentiment": "none"}, {"name": "ezgi erkoyun", "sentiment": "none"}], "locations": [{"name": "turkey", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "ankara", "sentiment": "none"}], "organizations": [{"name": "nato", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ANKARA (Reuters) - Turkey has warned its citizens against travel to the United States, saying Turks face the risk of arbitrary arrest and should take precautions if they do decide to travel, the latest tit-for-tat volley in a diplomatic feud between the NATO allies.\nThe comments from the Turkish Foreign Ministry come after the U.S. Department of State this week warned U.S. citizens planning to visit Turkey to reconsider due to “terrorism and arbitrary detentions”.\nTies between Washington and Ankara, the biggest Muslim country in NATO and a major U.S. ally in the Middle East, have been strained by a number of disputes in recent months, including the U.S. arrest and conviction of a Turkish banker in an Iran sanctions-busting case.\n“Turkish citizens travelling to the United States may be subjected to arbitrary detentions based on testimony of unrespected sources,” the Turkish Foreign Ministry said in a statement dated Thursday.\nThe trial against the banker included testimony of corruption by senior Turkish officials. Ankara has said it was based on false evidence and supported by the network of Fethullah Gulen, a U.S.-based Turkish cleric Ankara blames for orchestrating a failed coup in Turkey in 2016.\nGulen, who has lived in self-imposed exile in the United States since 1999, has denied the charges and condemned the coup. Turkey has called for his extradition, but the United States says sufficient evidence has yet to be put to a court.\nTurkey and the United States suspended issuing visas last year after Washington complained about the detention of two locally-hired consular employees on suspicion of a role in the failed coup. Both countries resumed issuing visas last month.\nTurkey also blames Washington for supporting Kurdish fighters in Syria that Ankara sees as allies of a Kurdish group waging an insurgency in Turkey.\nSpeaking to reporters after Friday prayers, Turkish Prime Minister Binali Yildirim blamed the U.S. travel warning for harming relations.\n“The ‘Turkey is not a safe country’ statement does not benefit ties between the two countries,” Yildirim said.\nForeign Minister Mevlut Cavusoglu, who is in Los Angeles and will meet with U.S. Secretary of State Rex Tillerson on the sidelines of a conference in Vancouver, said he would discuss the matter with his counterpart.\n“An ally publishing a travel warning about us is not a serious thing, but we will discuss it with Tillerson in Vancouver,” Cavusoglu said during a televised speech at the Turkish consulate in Los Angeles.\nReporting by Ezgi Erkoyun and Tuvan Gumrukcu; Writing by Daren Butler; Editing by David Dolan\n ", "external_links": [], "published": "2018-01-12T09:48:00.000+02:00", "crawled": "2018-01-12T10:27:12.012+02:00", "highlightTitle": ""}