{"organizations": [], "uuid": "86e4ac377a7f64c023b82fc483cc967ac44771e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/europe-stocks/live-markets-morning-call-higher-idUSL8N1P70NO", "country": "US", "domain_rank": 408, "title": "LIVE MARKETS- Morning call: higher", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T08:24:00.000+02:00", "replies_count": 0, "uuid": "86e4ac377a7f64c023b82fc483cc967ac44771e8"}, "author": "", "url": "https://www.reuters.com/article/europe-stocks/live-markets-morning-call-higher-idUSL8N1P70NO", "ord_in_thread": 0, "title": "LIVE MARKETS- Morning call: higher", "locations": [], "entities": {"persons": [{"name": "kering", "sentiment": "none"}, {"name": "danilo masoni", "sentiment": "none"}], "locations": [], "organizations": [{"name": "reuters staff", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "puma", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 6:26 AM / Updated an hour ago LIVE MARKETS-Closing snapshot: European stocks end in positive territory, FTSE at a record Reuters Staff 12 Min Read \n* European shares end higher * Euro rises on German coalition hopes * FTSE on new records as GKN surges * Kering to spin off Puma * Europe stock funds post inflows Jan 12 (Reuters) - Welcome to the home for real time coverage of European equity markets brought to you by Reuters stocks reporters and anchored today by Danilo Masoni. Reach him on Messenger to share your thoughts on market moves: danilo.masoni.thomsonreuters.com@reuters.net CLOSING SNAPSHOT: EUROPEAN STOCKS END IN POSITIVE TERRITORY, FTSE AT A RECORD (1708 GMT) The STOXX 600 has ended the week with a slight gain on the back of a broad-based rally, while Britain's FTSE 100 is up at a record close, shrugging off any sterling strength. Here's your closing snapshot - have a good weekend, and see you next week for more market action! (Kit Rees) EUROPEAN STOCKS WEEKLY RECAP: ITALY LEADS, IRELAND LAGS (1545 GMT) As we enter the last leg of the trading day in Europe, here's a look at some of this week's winners and losers: ∙ STOXX 600 +0.2% this week ∙ Best performing index: Italy' FTSE MIB +3.5% ∙ Worst performing index: Ireland's ISEQ -1.2%, FTSE 250 -0.4% ∙ Best performing sector: Basic resources +3.7% ∙ Worst performing sector: Real estate -1.7% ∙ Best performing stock: Fiat Chrysler +12.8% ∙ Worst performing stock: Steinhoff -22.5% (Kit Rees) WHAT WAS THAT ON THE FTSE? AN ALGO. (1455 GMT) Sterling jumped to its highest since the Brexit vote, sending the FTSE into negative territory and a session low. But the FTSE soon returned to its previous level. What happened? Well, according to Nomura a number of machines really liked a Bloomberg story reporting that \"Spanish and Dutch finance ministers have agreed to work together to push for a Brexit deal that keeps Britain as close to the European Union as possible\". \"A big algo move driving GBP on that headline about SOFT BREXIT from the Dutch and the Spanish\", Nomura said. (Julien Ponthus) WHAT DO PREMIUMS ON ABLYNX AND GKN TELL US? (1430 GMT) Perhaps it's a sign of the buoyant market mood that Belgian biotech Ablynx is trading at an impressive 20% premium to the 30.50 euros bid it rejected from Novo Nordisk . That's enough to scare away some investors as the market is pricing \"a very optimistic scenario\", a merger arb manager commented. At 36.70 euros, not only are Ablynx buyers assuming a bid for the company will go through, but also that it will either be substantially sweetened or that a rival offer will spike the price higher, he said, adding: \"I'm not touching it\". It's easy to get vertigo when looking at the Ablynx chart. It's up 77 percent already this year after surging 91 percent in 2017. Interesting to note too that GKN, currently up 25% at 416 pence, is also trading higher than the 405 pence offered by its rejected suitor, showing shareholders agree with management that Melrose's offer undervalues the company. (Julien Ponthus) BAML RECKONS EUROPE'S EARNINGS UPSIDE STILL NOT IN THE PRICE (1131 GMT) BAML is the latest in a list of brokers voicing the thought that European equities are underappreciated. Despite strong macro data and recovering margins, BAML's European equities strategists think earnings upside for Europe is still not priced in. \"There is little evidence of euphoria on European equities,\" BAML's strategists write, pointing to inexpensive valuations (see chart below). While they don't think rising rates pose a problem for equities, they do caution against spikes in bond yields. BAML says it is positioned for the sell-off in bonds to continue, with overweights in banks and insurance and underweights in food & beverage and utilities. (Kit Rees) STOCKS SHRUG OFF EURO SPIKE (1112 GMT) The euro has spiked to a three-year high following news of a breakthrough in German coalition talks but European shares have barely moved. While a stronger euro can be a headwind for exporters and erode earnings, it appears equity investors are looking on the bright side: more political certainty is one more reason for the economy to improve. Here's a quick take from Peter Rosenstreich, head of market strategy at Swissquote Bank in Geneva: \"FX tends to be the canary in the coal mine when it comes to politics in Europe, it has always been a barometer of political uncertainty in the euro zone, less than the equity market\". As you can see from this chart, a strengthening of the single currency since the middle of last year has not stopped shares making big progress. (Danilo Masoni) **** OUTFLOWS FROM EUROPEAN EQUITY ETFS AS U.S. BECOMES FLAVOUR OF THE MONTH (1043) Signs of a preference among investors for U.S. stocks over Europe are multiplying, with some of the latest ETF flows data confirming a shift which could be related to bets on the U.S. tax bill. European equity ETFs suffered their first outflows of 2017 (-0.5 billion euros) in December while U.S. equity ETFs had their best month of the year (+2.6 billion euros), fresh data from Lyxor ETF shows. The tax bill \"could open up some short-term opportunities,\" Marlène Hassine Konqui, head of ETF research at Lyxor, said. In total over the year U.S. equity ETFs collected 12.5 billion euros of fresh money. One thing the data shows for sure is the rising popularity of index-tracking funds in Europe: Lyxor found an all-time high for inflows to equity, fixed income, and commodity ETFs listed in Europe. Here's their chart of flows: (Helen Reid) \"IT IS UP TO ITALIANS TO DECIDE HOW TO VOTE, BUT..\" (0920 GMT) Italy's general election in March is being seen as Europe's biggest political risk right now. A victory for the anti-establishment 5-Star Movement could destabilize the EU while Brussels is already having a hard time with the Polish and Hungarian governments, not to mention the UK and Brexit. It would also rock the EU agenda of French President Macron, who just gave some overt public support for incumbent Italian PM Paolo Gentiloni. \"It is up to Italians to decide how to vote, but let me say that Europe has been very lucky to have Gentiloni and I hope we can continue the work that we have started,\" Macron said yesterday at the end of a two-day visit to Rome. Just to make sure everyone got the message, Macron's office sent out the transcript of his comments this morning. (Julien Ponthus) Opening snapshot: Europe edges up (0824 GMT) European shares are slightly recovering, up 0.1 percent, from yesterday's ECB-led euro jump amid quite a heavy M&A news flow, with Kering spinning off Puma and GKN rebuffing a bid from British rival Melrose. (Julien Ponthus) PUMA: EASY TIGER? (0753 GMT) Premarket indications show that the spin-off of Puma isn't expected to send Kering surging, we have modest 1-2% rises from traders so far. Puma on the other hand is seen falling 3-6 percent as some investors believe the spin-off means no buyer could be found. (Julien Ponthus) **** WHAT YOU NEED TO KNOW (0739 GMT) European shares are expected to recover following two days of losses with futures pointing to gains of around 0.3 percent. The pan-European STOXX 600 benchmark is set to end the week little changed as the new year euphoria cools down amid a strengthening euro and ", "external_links": [], "published": "2018-01-12T08:24:00.000+02:00", "crawled": "2018-01-12T08:54:40.049+02:00", "highlightTitle": ""}