{"organizations": [], "uuid": "7a52d385d196c05f429783d4af65cdb158b52e08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-qualcomm-receives-authorization-from-the-european-commission-and-korea-fair-trade-commission-for-nxp-semiconductors.html", "country": "US", "domain_rank": 767, "title": "Qualcomm Receives Authorization from the European Commission and Korea Fair Trade Commission for NXP Semiconductors Acquisition", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.009, "site_type": "news", "published": "2018-01-18T17:25:00.000+02:00", "replies_count": 0, "uuid": "7a52d385d196c05f429783d4af65cdb158b52e08"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-qualcomm-receives-authorization-from-the-european-commission-and-korea-fair-trade-commission-for-nxp-semiconductors.html", "ord_in_thread": 0, "title": "Qualcomm Receives Authorization from the European Commission and Korea Fair Trade Commission for NXP Semiconductors Acquisition", "locations": [], "entities": {"persons": [], "locations": [{"name": "san diego", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "korea fair trade commission for nxp semiconductors acquisition", "sentiment": "negative"}, {"name": "european commission", "sentiment": "negative"}, {"name": "qualcomm incorporated", "sentiment": "negative"}, {"name": "qualcomm", "sentiment": "negative"}, {"name": "nxp semiconductors n.v.", "sentiment": "none"}, {"name": "nxp", "sentiment": "none"}, {"name": "commission", "sentiment": "none"}, {"name": "nxp's nfc", "sentiment": "none"}, {"name": "kftc", "sentiment": "none"}, {"name": "nfc", "sentiment": "none"}, {"name": "qualcomm river holdings b.v.", "sentiment": "none"}, {"name": "korean fair trade commission", "sentiment": "none"}, {"name": "korea fair trade commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO, Jan. 18, 2018 /PRNewswire/ -- Qualcomm Incorporated (NASDAQ: QCOM) today announced that the European Commission and the Korea Fair Trade Commission (KFTC) authorized the acquisition by Qualcomm River Holdings B.V., an indirect wholly owned subsidiary of Qualcomm, of NXP Semiconductors N.V. (NASDAQ: NXPI). The acquisition has now received 8 of the 9 approvals around the world, with China remaining.\nQualcomm cooperated with the Commission and the KFTC to obtain authorization, and committed to exclude certain near-field communication (NFC) patents from the proposed transaction and ensure that NXP licenses those patents to third parties. Qualcomm also committed not to assert the NFC patents it will acquire from NXP and maintain interoperability between Qualcomm's baseband chipsets and NXP's NFC chips and rivals baseband chipsets and NFC chips. Qualcomm also will continue to offer a license to MIFARE on terms commensurate with those offered by NXP today.\n\"We are pleased that both the European Commission and the Korean Fair Trade Commission have granted authorization of the NXP acquisition, and we are optimistic that China will expeditiously grant its clearance\" said Steve Mollenkopf, Chief Executive Officer, Qualcomm Incorporated. \"Acquiring NXP is complementary to Qualcomm's global portfolio, providing tremendous scale in automotive, IoT, security and networking and will greatly accelerate our ability to execute and create value in new and adjacent opportunities.\"\nAbout Qualcomm\nQualcomm's technologies powered the smartphone revolution and connected billions of people. We pioneered 3G and 4G – and now we are leading the way to 5G and a new era of intelligent, connected devices. Our products are revolutionizing industries, including automotive, computing, IoT, healthcare and data center, and are allowing millions of devices to connect with each other in ways never before imagined. Qualcomm Incorporated includes our licensing business, QTL, and the vast majority of our patent portfolio. Qualcomm Technologies, Inc., a subsidiary of Qualcomm Incorporated, operates, along with its subsidiaries, all of our engineering, research and development functions, and all of our products and services businesses, including, our QCT semiconductor business. For more information, visit Qualcomm's website, OnQ blog, Twitter and Facebook pages.\nAdditional Information and Where to Find It\nThis document is for informational purposes only and is neither an offer to purchase nor a solicitation of an offer to sell any common shares of NXP Semiconductors N.V. (\"NXP\") or any other securities. Qualcomm River Holdings B.V. (\"Buyer\"), an indirect, wholly owned subsidiary of Qualcomm Incorporated (\"Qualcomm\"), has filed a tender offer statement on Schedule TO, including an offer to purchase, a letter of transmittal, and related documents with the United States Securities and Exchange Commission (the \"SEC\") and NXP has filed a solicitation/recommendation statement on Schedule 14D-9 with the SEC with respect to the tender offer. The offer to purchase common shares of NXP is only being made pursuant to the offer to purchase, the letter of transmittal and related documents filed as a part of the Schedule TO, in each case as amended from time to time. THE TENDER OFFER MATERIALS (INCLUDING THE OFFER TO PURCHASE, THE RELATED LETTER OF TRANSMITTAL AND CERTAIN OTHER TENDER OFFER DOCUMENTS) AND THE SOLICITATION/RECOMMENDATION STATEMENT ON SCHEDULE 14D-9 CONTAIN IMPORTANT INFORMATION. SHAREHOLDERS OF NXP ARE URGED TO READ THESE DOCUMENTS, AS FILED AND AS MAY BE AMENDED FROM TIME TO TIME, CAREFULLY BECAUSE THEY CONTAIN IMPORTANT INFORMATION THAT SUCH HOLDERS SHOULD CONSIDER BEFORE MAKING ANY DECISION REGARDING TENDERING THEIR SHARES. Investors and security holders may obtain a free copy of these statements and other documents filed with the SEC at the website maintained by the SEC at www.sec.gov . In addition, free copies of these documents may be obtained by contacting Innisfree M&A Incorporated, the information agent for the tender offer, toll free at (888) 750-5834 (for shareholders) or collect at (212) 750-5833 (for banks and brokers).\nCautionary Note Regarding Forward-Looking Statements\nAny statements contained in this document that are not historical facts are forward-looking statements as defined in the U.S. Private Securities Litigation Reform Act of 1995. Words such as \"anticipate\", \"believe\", \"estimate\", \"expect\", \"forecast\", \"intend\", \"may\", \"plan\", \"project\", \"predict\", \"should\" and \"'will\" and similar expressions as they relate to Qualcomm, Buyer or NXP are intended to identify such forward-looking statements. These forward-looking statements involve risks and uncertainties concerning the parties' ability to complete the tender offer and close the proposed transaction, the expected closing date of the transaction, the financing of the transaction, the anticipated benefits and synergies of the transaction, anticipated future combined businesses, operations, products and services, and liquidity, debt repayment and capital return expectations. Actual events or results may differ materially from those described in this document due to a number of important factors. These factors include, among others, the outcome of regulatory reviews of the proposed transaction; the ability of the parties to complete the transaction; the ability of Qualcomm to successfully integrate NXP's businesses, operations (including manufacturing and supply operations), sales and distribution channels, business and financial systems and infrastructures, research and development, technologies, products, services and employees; the ability of the parties to retain their customers and suppliers; the ability of the parties to minimize the diversion of their managements' attention from ongoing business matters; Qualcomm's ability to manage the increased scale, complexity and globalization of its business, operations and employee base post-closing; and other risks detailed in Qualcomm's and NXP's filings with the SEC, including those discussed in Qualcomm's most recent Annual Report on Form 10-K and in any subsequent periodic reports on Form 10-Q and Form 8-K and NXP's most recent Annual Report on Form 20-F and in any subsequent reports on Form 6-K, each of which is on file with the SEC and available at the SEC's website at www.sec.gov . SEC filings for Qualcomm are also available in the Investor Relations section of Qualcomm's website at www.qualcomm.com , and SEC filings for NXP are available in the Investor Relations section of NXP's website at www.nxp.com . Qualcomm is not obligated to update these forward-looking statements to reflect events or circumstances after the date of this document. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of their dates.\nQualcomm Contacts:\nPete Lancia, Corporate Communications\nPhone: 1-858-845-5959\nEmail: corpcomm@qualcomm.com\nJohn Sinnott, Investor Relations\nPhone: 1-858-658-5431\nEmail: ir@qualcomm.com\nView original content: http://www.prnewswire.com/news-releases/qualcomm-receives-authorization-from-the-european-commission-and-korea-fair-trade-commission-for-nxp-semiconductors-acquisition-300584592.html\nSOURCE Qualcomm Incorporated", "external_links": ["http://www.prnewswire.com/news-releases/qualcomm-receives-authorization-from-the-european-commission-and-korea-fair-trade-commission-for-nxp-semiconductors-acquisition-300584592.html"], "published": "2018-01-18T17:25:00.000+02:00", "crawled": "2018-01-18T20:08:39.003+02:00", "highlightTitle": ""}