{"organizations": [], "uuid": "879a9cc1e8a14e0efd15db8513b3b2d66ce66aa5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 62, "shares": 62, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221093622&w=1200&r=LYNXMPEE0A0MF", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-northkorea-missiles-talks/chinas-xi-supports-progress-in-inter-korean-talks-south-koreas-blue-house-idUSKBN1F013W", "country": "US", "domain_rank": 408, "title": "China's Xi supports progress in inter-Korean talks: South Korea's Blue House", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T12:16:00.000+02:00", "replies_count": 0, "uuid": "879a9cc1e8a14e0efd15db8513b3b2d66ce66aa5"}, "author": "", "url": "https://www.reuters.com/article/us-northkorea-missiles-talks/chinas-xi-supports-progress-in-inter-korean-talks-south-koreas-blue-house-idUSKBN1F013W", "ord_in_thread": 0, "title": "China's Xi supports progress in inter-Korean talks: South Korea's Blue House", "locations": [], "entities": {"persons": [{"name": "blu", "sentiment": "negative"}, {"name": "xi jinping", "sentiment": "none"}, {"name": "hyonhee shin", "sentiment": "none"}, {"name": "moon jae-in", "sentiment": "none"}, {"name": "xi", "sentiment": "none"}, {"name": "moon", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "south", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}], "organizations": [{"name": "blue house", "sentiment": "negative"}, {"name": "min read  seoul", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "house hyonhee shin", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEOUL (Reuters) - Chinese President Xi Jinping on Thursday welcomed recent progress in inter-Korean talks during a telephone call with South Korean President Moon Jae-in, the South’s Blue House said in a statement.\nAt Tuesday’s talks, North Korea said it would attend the Winter Olympics in the South next month, and both sides agreed to resolve problems through dialogue and revive military consultations to avoid accidental conflict.\nSeoul and Beijing agreed in October to move beyond a year-long stand-off over the deployment of a U.S. anti-missile system in South Korea, a dispute that has been devastating to South Korean businesses that rely on Chinese consumers.\nMoon made his first visit to China last month.\nDuring the 30-minute call, Xi said he supported Moon’s stance that the advancement of inter-Korean ties and the denuclearisation of the peninsula should “go in parallel”, Moon’s office said.\n“The two leaders agreed to strengthen strategic communication and cooperation,” the statement said.\nIt added that the two leaders hoped the latest dialogue effort would lead to a peaceful resolution of the North Korean nuclear issue and the establishment of peace on the Korean peninsula, beyond next month’s Olympics.\nIn Beijing, the official China Daily cited Xi as telling Moon that China wanted to work with South Korea to “jointly maintain regional peace and stability”.\nIn a telephone call on Wednesday, Moon and U.S. President Donald Trump also said the dialogue “could naturally lead to talks between the United States and North Korea for the denuclearization of the Korean peninsula after the Pyeongchang Winter Olympics.”\nWashington welcomed the talks as a first step towards resolving the crisis over North Korea’s program to develop nuclear missiles capable of reaching the United States, but it has reiterated that any talks involving the U.S. must be aimed at the North’s denuclearization.\nHowever, Pyongyang said it would not discuss its nuclear weapons because they were aimed only at the United States and not its “brethren” in China, Russia and South Korea, showing that a diplomatic breakthrough to the crisis remains far off.\nReporting by Hyonhee Shin; Editing by Clarence Fernandez\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-11T12:16:00.000+02:00", "crawled": "2018-01-11T12:37:47.012+02:00", "highlightTitle": ""}