{"organizations": [], "uuid": "b6816a97225ca4e53766fdca6ff6bd4dae05f23e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-rcngrande-closes-acquisition-of-wave-broadband.html", "country": "US", "domain_rank": 767, "title": "RCN/Grande Closes Acquisition of Wave Broadband", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T00:04:00.000+02:00", "replies_count": 0, "uuid": "b6816a97225ca4e53766fdca6ff6bd4dae05f23e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-rcngrande-closes-acquisition-of-wave-broadband.html", "ord_in_thread": 0, "title": "RCN/Grande Closes Acquisition of Wave Broadband", "locations": [], "entities": {"persons": [{"name": "jim holanda", "sentiment": "none"}, {"name": "steve simmons", "sentiment": "none"}], "locations": [{"name": "west coast", "sentiment": "none"}, {"name": "kirkland", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "wash. & fort worth", "sentiment": "none"}, {"name": "kirkland", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "tpg capital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Transaction expands RCN/Grande’s footprint to the West Coast, creating the nation’s sixth largest cable company\nKIRKLAND, Wash. & FORT WORTH, Texas & SAN FRANCISCO--(BUSINESS WIRE)-- RCN/Grande, a nationwide broadband service platform controlled by TPG Capital, today closed its previously announced partnership with Wave Broadband (Wave). Wave is a leading regional broadband fiber company offering a full suite of high-speed data, video, and voice services to residential and business customers. The company continues to operate as a branded entity, headquartered in Kirkland, Washington.\n“By combining RCN/Grande and Wave, we are creating a leading, national-scale internet provider and cable TV operator with significant growth potential,” said Jim Holanda, CEO of RCN/Grande. “We are pleased to announce the close of this transaction, and look forward to our continued growth led by a strong focus on customer service and commitment to providing the highest quality high-speed internet, TV, and voice services available.”\nRCN/Grande Chairman and industry veteran Steve Simmons added, “We are excited to expand our national footprint in seven of the top 10 DMAs with almost 950,000 customers. In both the residential and business segments, our management team, joined with Wave, will continue top tier industry growth.”\nWave is a regional incumbent broadband services and cable TV provider reaching 690,000 homes and over 280,000 customers including more than 13,000 unique commercial clients in Washington, Oregon, and California. The company maintains a “high-speed data first” strategy and has nearly 8,000 miles of owned fiber supporting its market-leading enterprise fiber business. As part of the transaction, Founder and CEO Steve Weed joined RCN/Grande as a Director.\n“Together, RCN/Grande and Wave create a market-leading broadband platform with national reach,” said David Trujillo, Partner at TPG. “The combined platform is providing businesses and residents across the country with fast, high-quality, and reliable communications services that allow them to rapidly access the content they crave. We look forward to our continued work with the RCN/Grande and Wave teams.”\nOn May 22, 2017, TPG Capital announced it was backing RCN/Grande to combine with Wave Broadband for $2.365 billion. The combination creates the sixth largest cable company in the U.S. and expands RCN/Grande’s robust high-speed broadband services platform. TPG Capital acquired RCN and Grande through separate transactions in 2016. The firm has a long history of investing in digital media and entertainment, with investments such as Airbnb, CAA, ipsy, Lynda.com , RentPath, Spotify, Uber, and Vice Media.\nAbout TPG\nTPG is a leading global alternative asset firm founded in 1992 with more than $79 billion of assets under management and offices in Austin, Beijing, Boston, Dallas, Fort Worth, Hong Kong, Houston, London, Luxembourg, Melbourne, Moscow, Mumbai, New York, San Francisco, Seoul, and Singapore. TPG’s investment platforms are across a wide range of asset classes, including private equity, growth equity, real estate, credit, and public equity. TPG aims to build dynamic products and options for its investors while also instituting discipline and operational excellence across the investment strategy and performance of its portfolio. For more information, visit www.tpg.com .\nAbout RCN\nRCN Telecom Services, LLC ( www.rcn.com and www.rcn.com/business ) provides industry-leading high-speed Internet, all-digital TV and phone services for residential, small/medium and Enterprise business customers. PCMag’s Readers’ Choice Award named RCN one of the winners for best ISPs in 2013, 2015, 2016 and 2017 – RCN was rated highest in overall satisfaction. RCN is YouTube HD Verified, earning the company the highest-ranking that Google offers. RCN is also a Netflix Open Connect partner, placing in the Top rankings on the Netflix USA ISP Speed Index in the markets RCN serves. RCN's affordably priced advanced digital services are delivered through its proprietary, state-of-the-art fiber-rich network and supported by 100% U.S.-based customer service. RCN's primary service areas include Boston, Chicago, Lehigh Valley (PA), New York City, Philadelphia (Delaware County) and Washington, DC.\nAbout Grande Communications, LLC\nGrande Communications is a Texas-based broadband communications company that offers a full suite of Internet, TV and phone services for residential and business customers through its state-of-the-art, high-capacity, hybrid fiber-optic network. Since its launch 16 years ago, Grande has offered Texans a real choice in entertainment and communications services plus outstanding local customer and technical support. Grande proudly serves the following communities: Austin, San Antonio, Dallas, San Marcos, Waco, Corpus Christi, Midland and Odessa. For more information, visit mygrande.com , like Grande Communications on Facebook or follow @grandecom on Twitter.\nAbout Wave Broadband\nWave is a leading provider of fiber and broadband services on the West Coast. Wave delivers a range of solutions for businesses, including custom fiber networks, high capacity Internet access, data transport, voice services, and colocation hosting. Wave also serves residential customers with internet, TV and phone services.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124006207/en/\nTPG\nLuke Barrett, 415-743-1550\nmedia@tpg.com\nor\nRCN\nJackie Fraser, 978-358-5840\njfraser@matternow.com\nor\nWave\nMark S. Peterson, 206-390-0204\nmark@pointerpr.com\nSource: TPG", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Furldefense.proofpoint.com%2Fv2%2Furl%3Fu%3Dhttp-3A__www.rcn.com_business%26d%3DDwMGaQ%26c%3DQbuapHRvbn0JdC8vTVkPHg%26r%3DKS8gJnMGVoKWu2MbEG-Urw%26m%3D_liw8nN8WxG5BA8w1ipEd1-qKLcLNiC7vEOfGre5Egk%26s%3DoD4efhUvB0svMCogcbYW5Ek7qxbtpqP_BIq2GvMoBzg%26e%3D&esheet=51748516&newsitemid=20180124006207&lan=en-US&anchor=www.rcn.com%2Fbusiness&index=3&md5=99957fb720fb7eec23e3a62ee99a00c4", "http://www.businesswire.com/news/home/20180124006207/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Furldefense.proofpoint.com%2Fv2%2Furl%3Fu%3Dhttp-3A__www.rcn.com_%26d%3DDwMGaQ%26c%3DQbuapHRvbn0JdC8vTVkPHg%26r%3DKS8gJnMGVoKWu2MbEG-Urw%26m%3D_liw8nN8WxG5BA8w1ipEd1-qKLcLNiC7vEOfGre5Egk%26s%3DLqW2JvZUq_cRF__HnyKjyPavmhULrcMYZclLORIbtsQ%26e%3D&esheet=51748516&newsitemid=20180124006207&lan=en-US&anchor=www.rcn.com&index=2&md5=e5d1d52aba4b663d11d639f3bc671415", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.tpg.com&esheet=51748516&newsitemid=20180124006207&lan=en-US&anchor=www.tpg.com&index=1&md5=3b08f0c58ab5d4aac9ea0e8963f4acc2", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fmygrande.com&esheet=51748516&newsitemid=20180124006207&lan=en-US&anchor=mygrande.com&index=4&md5=a8b29b2c36eaf6d487482339a278dd7a"], "published": "2018-01-25T00:04:00.000+02:00", "crawled": "2018-01-25T02:32:54.011+02:00", "highlightTitle": ""}