{"organizations": [], "uuid": "dd3f23808c0a18b8e7f7c7115305180b318f660f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180113.html", "section_title": "Archive News &amp; Video for Saturday, 13 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/people-keithjackson/rpt-sportscaster-keith-jackson-voice-of-college-football-dead-at-89-idUSL1N1P80C8", "country": "US", "domain_rank": 408, "title": "RPT-Sportscaster Keith Jackson, voice of college football, dead at 89", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T03:26:00.000+02:00", "replies_count": 0, "uuid": "dd3f23808c0a18b8e7f7c7115305180b318f660f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/people-keithjackson/rpt-sportscaster-keith-jackson-voice-of-college-football-dead-at-89-idUSL1N1P80C8", "ord_in_thread": 0, "title": "RPT-Sportscaster Keith Jackson, voice of college football, dead at 89", "locations": [], "entities": {"persons": [{"name": "keith jackson", "sentiment": "negative"}, {"name": "nelli", "sentiment": "negative"}, {"name": "turi ann", "sentiment": "none"}, {"name": "keith", "sentiment": "none"}, {"name": "bob iger", "sentiment": "none"}, {"name": "bill trott", "sentiment": "none"}, {"name": "iger", "sentiment": "none"}, {"name": "jackson", "sentiment": "none"}, {"name": "nellie", "sentiment": "none"}], "locations": [], "organizations": [{"name": "abc", "sentiment": "none"}, {"name": "the walt disney co", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "abc sports", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Repeats to additional subscribers, no changes to headline or text)\n* Said he exclaimed “Whoa, Nellie” only couple of times\n* Part of first “Monday Night Football” broadcast crew\n* Broadcast his first game in 1952\nBy Bill Trott\nJan 13 (Reuters) - Sportscaster Keith Jackson, who brought a folksy, excitable demeanor and down-home exclamations such as “Whoa, Nellie!” to 40 seasons of play-by-play calling as the authoritative voice of college football for ABC Sports, died at age 89, his employer ABC reported on Saturday.\nThe legendary sportscaster died late on Friday surrounded by family.\n“For generations of fans, Keith Jackson was college football,” said Bob Iger, chairman and CEO of The Walt Disney Co , which owns ABC.\n“When you heard his voice, you knew it was a big game. Keith was a true gentleman and a memorable presence. Our thoughts and prayers go out to his wife, Turi Ann, and his family,” Iger said.\nJackson’s work for ABC covered a wide range of sports and included 10 Olympics and 11 World Series but college football was his domain. At his peak, he was associated with the sport almost as strongly as any player or coach.\nHe presided over games with a rumbling baritone, a distinctive speaking rhythm, a trace of a Southern accent and a string of colloquialisms that made a Keith Jackson broadcast sound like no other.\nIn Jackson-speak, a talented player was a “hoss” and an even more talented player was a “hoss and a half.” Hulking offensive linemen were “the big uglies down in the trenches.”\nHe would describe an especially rough game as a “slobber knocker” in which the players were “rockin’ and a-sockin’ and a-whackin’ and a-crackin’.” He referred to the prestigious Rose Bowl game as “the granddaddy of them all” and when a player dropped the ball, Jackson would roar, “Fum-buuuul!”\nThe phrase he was most associated with - and the one used by anyone who ever did a Keith Jackson impersonation - was “Whoa, Nellie!” Jackson said he did not know why the exclamation was so closely tied to him.\n“I never did use it that much, just a couple times ...,” he said in an interview with the website www.lostlettermen.com. “I don’t know how that thing got hung on me. The media likes to hang things on you and that was my bad luck, I guess.”\nSome said Dick Lane, a Los Angeles sports broadcaster, was the original source of “Whoa, Nellie” but Jackson told the Los Angeles Times in 2013 that he borrowed it from his great-grandfather.\nJackson’s style evolved from advice he was once given - never be afraid to turn a phrase.\n“The older I got, the more willing I was to go back into Southern vernacular because some of it’s funny,” he said in a 2014 interview with “Fox College Saturday.”\nJackson grew up near Carrollton, Georgia, picking cotton and plowing his poor family’s farm. After four years in the U.S. Marine Corps, he studied broadcasting at Washington State University and covered the school’s football games starting in 1952.\nAfter graduating, Jackson worked both news and sports beats for a Seattle television station before joining ABC Radio in Los Angeles in 1965. The next year he moved to the network’s television branch and joined ABC’s college football broadcasting team.\nJackson switched his focus to the National Football League in 1970 as part of ABC’s “Monday Night Football” crew when it made its debut. Frank Gifford replaced him the next season.\nBut Jackson’s major interest was always college football.\n“I think college football is a reflection of Middle America,” he told Sports Illustrated. “You go into a college football town and you will find three generations of a family sitting together. It’s a rallying point for the university, the community and the families.”\nCritics said Jackson went too far as a booster of college football, looking past its scandals and controversies, such as not compensating players for the money their play brought in for their schools.\nJackson retired from ABC in 1988. But just a few months later the network coaxed him back with a schedule that would allow him to stay relatively close to his home in Sherman Oaks, California.\nHe retired for good at age 77 after calling the 2006 Rose Bowl in which Texas defeated Southern California for the national championship. “I don’t want to die in a stadium parking lot,” he told The New York Times.\nJackson met his wife at Washington State University and the couple had three children.\nIn 2014 Washington State renamed its broadcasting building after Jackson. (Writing and reporting by Bill Trott; Additional reporting by Barbara Goldberg in New York; Editing by David Gregorio)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-14T03:26:00.000+02:00", "crawled": "2018-01-14T20:28:18.036+02:00", "highlightTitle": ""}