{"organizations": [], "uuid": "42f7a88e92aedf576c78d476ef423a55e290255f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INhealth\r", "section_title": "Reuters: Health", "url": "https://in.reuters.com/article/us-health-osteoporosis-hip-fracture/hip-fractures-on-the-rise-in-older-u-s-women-idINKBN1F42BC", "country": "US", "domain_rank": 408, "title": "Hip fractures on the rise in older U.S. women", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T19:31:00.000+02:00", "replies_count": 0, "uuid": "42f7a88e92aedf576c78d476ef423a55e290255f"}, "author": "", "url": "https://in.reuters.com/article/us-health-osteoporosis-hip-fracture/hip-fractures-on-the-rise-in-older-u-s-women-idINKBN1F42BC", "ord_in_thread": 0, "title": "Hip fractures on the rise in older U.S. women", "locations": [], "entities": {"persons": [{"name": "platzman weinstock", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}, {"name": "osteoporosis international", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters Health) - The incidence of hip fractures in older women in the U.S. is rising after more than a decade of decline, according to a large new study of Medicare recipients.\nHip fracture rates declined each year from 2002 to 2012, the researchers found. But starting in 2013, hip fracture rates leveled off and were higher than expected.\nThese injuries can cause serious disability, loss of independence and death.\nThe researchers were especially alarmed at fracture rates in women ages 65 to 69, which had risen by 2.5 percent, and in women ages 70 to 74, which had risen by 3.8 percent, from 2014 through 2015.\nOverall, the authors reported in Osteoporosis International, “the plateau in age-adjusted hip fracture incidence rate resulted in more than 11,000 additional estimated hip fractures over the time periods 2013, 2014, and 2015.”\nThe cost associated with those extra fractures was nearly $460 million, assuming a cost $40,000 per hip fracture, the research team calculated.\n“I find the trend very disturbing. When we first analyzed the data we were uncertain whether it was real or not,” Dr. E. Michael Lewiecki, one of the study authors, told Reuters Health by phone.\n“Most hip fracture patients, who almost always have osteoporosis and are at very high risk of having more fractures, are currently not being evaluated and treated to reduce fracture risk,” said Lewiecki, director of the New Mexico Clinical Research & Osteoporosis Center in Albuquerque, New Mexico.\nOsteoporosis, a disease that weakens bones, causes more than 8.9 million fractures annually, according to the International Osteoporosis Foundation (IOF).\nFor the new study, researchers analyzed Medicare claims data from 2002 to 2015, from more than 2 million women age 65 or older.\nDr. Joan McGowan, director of the division of Musculoskeletal Diseases at the U.S. National Institute of Arthritis and Musculoskeletal and Skin Diseases in Bethesda, Maryland, told Reuters Health by phone that she hopes the new study “gets the kind of attention that it needs and deserves. Having fractures is not a normal part of aging.”\nThe U.S. Preventive Services Task Force (USPSTF) recommends that women age 65 or older get screened for osteoporosis with a type of X-ray called a DXA scan to measure bone loss. Postmenopausal women under age 65, with risk factors for osteoporosis, should also be screened. Risk factors include a family history of osteoporosis, diseases such as rheumatoid arthritis, the use of certain medications, and smoking and drinking alcohol.\nThe study wasn’t designed to identify why hip fracture rates are leveling off instead of continuing to decline. Lewiecki and his colleagues can only speculate on the reasons.\nOne possible explanation, they say, is that use of DXA testing has steadily declined. Because DXA is used to diagnose osteoporosis before the first fracture occurs and to monitor the skeletal effects of treatment, a decline in its use could be related to a rise in hip fracture rates, they suggest.\nAnother factor causing hip fracture rates to rise, they say, could be a decrease in osteoporosis treatment – partly because fewer women are being screened and diagnosed, and partly because patients may fear the rare but severe side effects that have been linked with osteoporosis drugs called bisphosphonates.\nMcGowan said that for patients at risk of fractures, the benefits of medication far outweigh the risks. Worries about side effects “are overblown,” she said. “They’re quite rare.”\n“We had success in reducing hip fractures in the past. There’s loads of opportunities to change the curve,” said McGowan.\n ", "external_links": [], "published": "2018-01-15T19:31:00.000+02:00", "crawled": "2018-01-15T20:01:05.000+02:00", "highlightTitle": ""}