{"organizations": [], "uuid": "bb84f213738686dbd87e45f8561a9b928c21085c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219337476&w=1200&r=LYNXMPEE030WQ", "site_section": "http://feeds.reuters.com/reuters/domesticNews/", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/uk-usa-justice-marijuana/trump-administration-to-end-obama-era-marijuana-policy-source-idUSKBN1ET1MU", "country": "US", "domain_rank": 408, "title": "Trump administration to end Obama-era marijuana policy -source", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T18:41:00.000+02:00", "replies_count": 0, "uuid": "bb84f213738686dbd87e45f8561a9b928c21085c"}, "author": "", "url": "https://www.reuters.com/article/uk-usa-justice-marijuana/trump-administration-to-end-obama-era-marijuana-policy-source-idUSKBN1ET1MU", "ord_in_thread": 0, "title": "Trump administration to end Obama-era marijuana policy -source", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "barack obama", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "sarah n. lynch", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "justice department", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 2:39 PM / in 7 minutes Trump administration to end Obama-era marijuana policy -source Sarah N. Lynch 4 Min Read \nWASHINGTON (Reuters) - The U.S. Justice Department will rescind on Thursday a policy on marijuana that eased enforcement of federal laws as a growing number of states and localities legalized the drug, a source familiar with the matter said. \nThe ending of the policy, begun under Democratic former President Barack Obama, could sow confusion about how strictly federal laws will be enforced and potentially hamper efforts to cultivate local businesses. \nThe change under Republican President Donald Trump’s administration comes just days after California formally launched the world’s largest regulated commercial market for recreational marijuana. \nThe current policy recognized marijuana as a “dangerous drug,” but said the department expected states and localities that authorized various uses of the drug to effectively regulate and police it. \nGoing forward, federal prosecutors around the country will have leeway to enforce U.S. laws on marijuana as they see fit in their own districts, added the source, speaking on condition of anonymity. \nThere has been a surge in legalization of marijuana in U.S. states in recent years. Besides California, other states that permit the regulated sale of marijuana for recreational use include Colorado, Washington, Oregon, Alaska and Nevada. Massachusetts and Maine are on track to follow suit later this year. MARIJUANA BUSINESSES \nAmong companies that have invested in the industry, Scotts Miracle-Gro a gardening product manufacturer, has spent hundreds of millions of dollars to acquire companies that sell soil, lighting, fertilizer and other products to marijuana growers. Shares in the company dropped 3.8 percent to $104.54 after the news of the policy shift, before paring losses later in the morning. Several Canadian marijuana-related stocks also fell sharply. \nThe policy being reversed had sought to provide more clarity on how prosecutors would enforce federal laws that ban marijuana in states that have legalized it for medicinal or recreational use. \nU.S. Attorney General Jeff Sessions has made no secret about his disdain for marijuana. He has said the drug is harmful and should not be legalized, and has also called it a gateway drug for opioid addicts. \nA task force created under a February 2017 executive order by Trump and comprised of prosecutors and other law enforcement officials was supposed to study marijuana enforcement, along with many other policy areas, and issue recommendations. \nIts recommendations were due in July 2017, but the Justice Department has not made public what the task force determined was appropriate for marijuana. \nMarijuana advocates criticized the planned change to policy. \n“Jeff Sessions is acting on his warped desire to return America to the failed beliefs of the ‘Just Say No’ and Reefer Madness eras,” said Erik Altieri, the executive director of the pro-marijuana group NORML. “This action flies in the face of sensible public policy and broad public opinion.” \nRepublican Senator Cory Gardner, who represents Colorado where marijuana is legal, also criticized the move, saying on Twitter that the Justice Department was trampling on the will and rights of voters. \n“This reported action directly contradicts what Attorney General Sessions told me prior to his confirmation,” he wrote. \nGardner added he would take all steps necessary to fight the measure, including possibly holding up the Senate from voting on pending Justice Department nominees. The department still has a long line of people waiting to be confirmed, including the heads of the criminal, civil and national security divisions. Reporting by Sarah N. Lynch; Additional reporting by Susan Heavey; Editing by Chizu Nomiyama and Frances Kerry", "external_links": [], "published": "2018-01-04T18:41:00.000+02:00", "crawled": "2018-01-04T18:46:04.010+02:00", "highlightTitle": ""}