{"organizations": [], "uuid": "47ec6388104129bd3f04026dfb1363bda338571d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 19, "shares": 19, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226242543&w=1200&r=LYNXMPEE0S0JP", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-myanmar-rohingya-journalists/myanmar-advisory-panel-chief-says-it-cannot-interfere-in-court-case-against-reporters-idUSKBN1FI0T3", "country": "US", "domain_rank": 408, "title": "Myanmar advisory panel chief says it cannot interfere in court case against reporters", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T10:58:00.000+02:00", "replies_count": 0, "uuid": "47ec6388104129bd3f04026dfb1363bda338571d"}, "author": "", "url": "https://www.reuters.com/article/us-myanmar-rohingya-journalists/myanmar-advisory-panel-chief-says-it-cannot-interfere-in-court-case-against-reporters-idUSKBN1FI0T3", "ord_in_thread": 0, "title": "Myanmar advisory panel chief says it cannot interfere in court case against reporters", "locations": [], "entities": {"persons": [{"name": "kyaw soe oo", "sentiment": "none"}, {"name": "surakiart sathirathai", "sentiment": "none"}, {"name": "surakiart", "sentiment": "none"}], "locations": [{"name": "myanmar", "sentiment": "none"}, {"name": "yangon", "sentiment": "none"}, {"name": "yangon", "sentiment": "none"}, {"name": "rakhine", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "global new light of myanmar", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 8:58 AM / in 12 hours Myanmar advisory panel chief says it cannot interfere in court case against reporters Reuters Staff 4 Min Read \nYANGON (Reuters) - Myanmar’s panel of international advisers on Rohingya issues will not get involved in the case of two Reuters journalists charged with violating the Official Secrets Act, its chairman told a state newspaper in an interview published on Monday. \nReporters Wa Lone, 31, and Kyaw Soe Oo, 27, who had worked on Reuters’ coverage of the crisis in Myanmar’s Rakhine state, will appear in a Yangon court on Thursday, when the prosecution is set to continue presenting evidence against them. \nPanel chairman Surakiart Sathirathai, a former Thai foreign minister, said the case had progressed beyond the point where the board felt it could intervene. If it had been at the stage of arrests, “then maybe we can do something about it”, he told the Global New Light of Myanmar newspaper. \nSince the prosecution is in the midst of presenting its case, “I think everyone has to respect the rule of law,” he added. \nSurakiart said he raised the issue “on a personal basis” with Myanmar’s National Security Minister Thaung Tun. \n“And he has assured us that the treatment of the Reuters reporters would be in accordance with the due process of law and proper criminal justice procedure,” he added. \n“We have no intention to pressure the government to release anyone or any intention to interfere in the court procedures,” the paper quoted Surakiart as saying. \nSurakiart did not respond to a request from Reuters seeking comment.The two reporters have been jailed in Yangon’s Insein prison since their arrests on Dec. 12. \nThe Advisory Board for the Committee for Implementation of the Recommendations on Rakhine State was set up by Myanmar last year, to advise on ways of adopting the findings of an earlier commission headed by former U.N. Secretary-General Kofi Annan. ARGUMENT WITH SUU KYI \nLast week, in an interview with Reuters, advisory board member Bill Richardson said he quit the panel after getting into an argument with Myanmar leader Aung San Suu Kyi during a meeting on Monday with other board members, when he brought up the case of the two reporters. FILE PHOTO - Detained Reuters journalist Kyaw Soe Oo is escorted by police for a court hearing in Yangon, Myanmar January 23, 2018. REUTERS/Stringer \nSuu Kyi’s response was “furious”, saying the case “was not part of the work of the advisory board”, said Richardson, a former governor of the U.s. state of New Mexico. \nThe argument continued at a dinner later that evening, when Richardson also brought up the issue of a mass grave where 10 Rohingyas had been killed and buried. \n“She was upset when I said there should be an investigation of the mass graves issue, that they had to increase their international support for the treatment of the Rohingyas, the terrible refugee crisis,” Richardson said in a Reuters television interview. \n“She exploded. She was very unhappy, and it shows that she didn’t want to hear frank advice.” \nThe military stated after its own investigation into the mass grave that security forces were involved in the killings. \nSuu Kyi’s office said on Saturday it would not be commenting further on the exchange with Richardson. \n“We already published a statement and also the advisory board published a statement,” said Zaw Htay, Suu Kyi’s spokesman. \n“The judge will decide whether the journalists committed the crime or not. Even in America, they wouldn’t involve themselves in a case while the case is ongoing in a court hearing.” \nZaw Htay was not available for comment on Monday. \nAround 688,000 Rohingya Muslims have fled from Rakhine to neighboring Bangladesh after attacks on security posts in Rakhine on Aug. 25 triggered a fierce military response, which the United Nations has described as ethnic cleansing. \nMyanmar says its troops are engaged in legitimate counter-insurgency operations. Writing by Bill Tarrant; Editing by Clarence Fernandez", "external_links": [], "published": "2018-01-29T10:58:00.000+02:00", "crawled": "2018-01-29T11:15:20.000+02:00", "highlightTitle": ""}