{"organizations": [], "uuid": "0313ec1706d3897b757ef4972351668805be43b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000336/device/rss", "section_title": "Janet Yellen", "url": "https://www.cnbc.com/2018/01/29/the-associated-press-fed-is-likely-to-hold-rates-steady-at-yellens-final-meeting.html", "country": "US", "domain_rank": 767, "title": "Fed is likely to hold rates steady at Yellen's final meeting", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T18:54:00.000+02:00", "replies_count": 0, "uuid": "0313ec1706d3897b757ef4972351668805be43b3"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/29/the-associated-press-fed-is-likely-to-hold-rates-steady-at-yellens-final-meeting.html", "ord_in_thread": 0, "title": "Fed is likely to hold rates steady at Yellen's final meeting", "locations": [], "entities": {"persons": [{"name": "yellen", "sentiment": "negative"}, {"name": "janet yellen", "sentiment": "negative"}, {"name": "jerome powell", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "powell", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}], "organizations": [{"name": "fed", "sentiment": "negative"}, {"name": "federal reserve", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — Janet Yellen's final Federal Reserve policy meeting will likely bring an uneventful end this week to her four-year tenure as Fed chair but perhaps offer hints of the central bank's approach to interest rates in the months to follow.\nYellen, the first woman to lead the world's most influential central bank, will step down when her term expires at the end of this week. She will be succeeded by Jerome Powell, a Fed board member whose nomination as chairman the Senate approved 84-13 last week.\nPowell, who has served on the central bank's board since 2012, is a lawyer and investment manager by training and will be the first Fed leader in 30 years not to hold a Ph.D. in economics. President Donald Trump chose Powell for the post rather than offer Yellen a second term despite widespread praise for her performance as chair.\nThe evidence so far suggests that a Powell-led Fed will generally follow the same cautious approach to raising interest rates that Yellen pursued during her tenure as Fed chair, at least in its early months. With the job market healthy and inflation tame, most economists say there is little reason for any abrupt change in Fed policy.\n\"Chair Yellen gets to leave on a high note, with strong growth and low unemployment,\" said Diane Swonk, chief economist and a managing director at audit firm Grant Thornton.\nThe unemployment rate is at a 17-year low of 4.1 percent, and the economy expanded at a solid 2.6 percent annual rate in the October-December quarter, helping lift growth for all of 2017 to a decent 2.3 percent. Synchronized growth in major regions across the global economy has helped energize the U.S. economy. And a sweeping tax overhaul that Trump pushed through Congress last month is expected to further support U.S. growth.\nTraders in the financial markets foresee a 96 percent chance that they Fed will leave rates alone when its meeting ends Wednesday, according to data tracked by the CME Group. The next rate increase is expected in March; traders see a 78 percent likelihood then. The March policy meeting will also be the first time that Powell is scheduled to hold a news conference, something the leader of the Fed does four times a year.\nEconomists are roughly divided on whether they think Fed's policymakers will raise rates three times this year, as they did in 2017, or four times. The pivotal factor will likely be how inflation performs. For the past six years, inflation has been a no-show, running below even the Fed's target level of 2 percent. A tight job market, with pressure building for pay increases, and potentially higher consumer and business spending resulting from the Republican tax cuts, could accelerate inflation this year.\n\"I think the Fed will end up moving rates up either three or four times, and it will depend on how the data comes in,\" said Sung Won Sohn, an economics professor at California State University, Channel Islands. \"If the tax cuts lift business and consumer confidence and result in a much stronger economy, then we will see four rate hikes.\"\nMark Zandi, chief economist at Moody's Analytics, said he was foresees four rate increases this year beginning in March. Zandi expects the Fed to accelerate its pace of increases because he thinks unemployment will fall further, leading to wage increases and a pickup in inflation.\n\"Everything is pointing to a more aggressive Fed this year,\" Zandi said.\nThe Fed has modestly raised its benchmark rate five times since December 2015, when it began tightening for the first time since the height of the financial crisis in 2008. When the crisis erupted, the Fed cut its rate to a record low near zero to help rescue the financial system and the economy and then held it there for seven years.\nBecause the Fed has raised rates only gradually over the past two years to avoid slowing the economy, its key rate remains in a still-low range 1.25 percent to 1.5 percent. With most analysts foreseeing a rate increase in March, the Fed may decide to signal that likelihood when it issues a statement after its meeting ends Wednesday.\nThe lineup of Fed regional bank presidents who vote on the central bank's rate policy — a lineup that rotates each year — is expected to be somewhat more \"hawkish\" this year. Fed hawks are those who are less likely to favor low rates to maximize employment and more likely to back rate hikes to prevent future high inflation.\nWith Yellen's departure, the seven-member Fed board will have four vacancies. Marvin Goodfriend, a conservative economist, has been nominated by Trump for one of the vacant board seats. Trump has yet to make nominations for the others.", "external_links": [], "published": "2018-01-29T18:54:00.000+02:00", "crawled": "2018-01-29T19:39:42.022+02:00", "highlightTitle": ""}