{"organizations": [], "uuid": "ad11753036fc3eb672736be9b3224817b321d523", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-karen-baker-named-new-chief-executive-officer-of-pcarnsvrc.html", "country": "US", "domain_rank": 767, "title": "Karen Baker named new Chief Executive Officer of PCAR/NSVRC", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.451, "site_type": "news", "published": "2018-01-22T23:34:00.000+02:00", "replies_count": 0, "uuid": "ad11753036fc3eb672736be9b3224817b321d523"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-karen-baker-named-new-chief-executive-officer-of-pcarnsvrc.html", "ord_in_thread": 0, "title": "Karen Baker named new Chief Executive Officer of PCAR/NSVRC", "locations": [], "entities": {"persons": [{"name": "karen baker", "sentiment": "negative"}, {"name": "tomika patterson", "sentiment": "none"}, {"name": "delilah rumburg", "sentiment": "none"}, {"name": "baker", "sentiment": "none"}, {"name": "karen", "sentiment": "none"}], "locations": [{"name": "pa.", "sentiment": "none"}, {"name": "pcar/nsvrc harrisburg", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}, {"name": "nsvrc", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "nsvrc", "sentiment": "none"}, {"name": "pcar", "sentiment": "none"}, {"name": "ational sexual violence resource center", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Harrisburg, Pa., Jan. 22, 2018 (GLOBE NEWSWIRE) -- The Pennsylvania Coalition Against Rape and the National Sexual Violence Resource Center announced that Karen Baker will take the helm of the longest-standing anti-sexual assault coalition in the country on March 1. Baker will replace CEO Delilah Rumburg, who recently announced her retirement after serving PCAR/NSVRC for more than two decades.\nBaker, a Master’s Level Licensed Social Worker, has more than twenty years of experience in non-profit management and has served as the director of the NSVRC since its inception by PCAR in 2000. From the beginning, Baker has worked to establish national credibility and leadership for the center, cultivating strong diverse partnerships, and providing training, resources, and leadership to address and prevent sexual violence throughout the United States.\n“Karen is the perfect leader to carry on the mission of PCAR and the NSVRC,” PCAR Board of Directors President Tomika Patterson said. “Through nearly two decades of service to the NSVRC, she’s proven to be a progressive visionary and a dynamic leader with impeccable judgment. She has a deep understanding of the strategies necessary for the prevention of sexual abuse and the readiness for leading the charge to end sexual violence in one generation.”\nUnder Baker’s leadership, the NSVRC has flourished, receiving awards for its original resources, website, social media activities, and its annual Sexual Assault Awareness Month prevention campaign. She played an instrumental role in bringing together victim advocates, public health leaders, and sex offender treatment providers in order to promote comprehensive prevention strategies. She’s also been influential in building strong relationships with a variety of national, state, and local partners. This work includes collaboration to address issues of oppression and to improve access to, and responsiveness of, a variety of systems, including advancing the culture at colleges and universities across the country to prevent and address sexual abuse on campus.\nBaker also serves as a Managing Partner for Raliance, a Washington D.C.-based collaboration among NSVRC, the California Coalition Against Sexual Assault, and the National Alliance Ending Sexual Violence. Raliance was launched with funding from the National Football League and since 2015 has awarded $1.8 million in grants to advance best practices in supporting sexual assault survivors, preventing perpetration, and strengthening organizations.\n“It has been my honor to work with Karen since the opening of the National Sexual Violence Resource Center in 2000,” Rumburg said. “Karen has been instrumental to the growth and ongoing success of the NSVRC. Under her guidance, the NSVRC will continue to serve as a national leader in the prevention of sexual violence. PCAR and NSVRC are fortunate to have Karen as the next leader, and she will provide a smooth leadership transition in this new and exciting chapter for PCAR and NSVRC.”\nBaker’s selection culminates a four-month search led by a transition committee which yielded more than 170 responses from candidates in 20 states as well as India.\n“PCAR and NSVRC have grown tremendously in scope and influence under the visionary leadership of Delilah Rumburg, and I am honored to work with our centers and partners to build upon this legacy and move together into the next chapter,” said Baker. “Our nation is in a watershed moment for sexual violence prevention, and I am committed to our shared mission of advocating for the rights of victims, strengthening our workplaces to prevent sexual assault and sexual harassment, and creating safe communities for all.”\nRumburg’s final day as CEO will be February 28.\nABOUT THE PENNSYLVANIA COALITION AGAINST RAPE:\nFounded in 1975, PCAR works to end sexual violence and advocates for the rights and needs of sexual assault victims. PCAR partners with a network of rape crisis programs to bring help, hope and healing around issues of sexual violence in all 67 counties of the Commonwealth of Pennsylvania.\nABOUT THE NATIONAL SEXUAL VIOLENCE RESOURCE CENTER:\nNSVRC is the leading nonprofit in providing information and tools to prevent and respond to sexual violence. NSVRC translates research and trends into best practices that help individuals, communities and service providers achieve real and lasting change. The center also works with the media to promote informed reporting. Every April, NSVRC leads Sexual Assault Awareness Month (SAAM), a campaign to educate and engage the public in addressing this widespread issue. NSVRC is also one of the three founding organizations of Raliance, a national, collaborative initiative dedicated to ending sexual violence in one generation.\nKristen Houser National Sexual Violence Resource Center & Pennsylvania Coalition Against Rape 877-739-3895 ext. 144 khouser@pcar.org\nSource:National Sexual Violence Resource Center", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/6a7c5d77-9f08-4b2f-be9b-b09aa6a2c09c"], "published": "2018-01-22T23:34:00.000+02:00", "crawled": "2018-01-23T02:17:07.010+02:00", "highlightTitle": ""}