{"organizations": [], "uuid": "f8aa3ddf35dd57f8634712259215a98d872b024f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 41}, "facebook": {"likes": 43, "shares": 43, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/21/104957715-GettyImages-631888722.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/investors-can-trade-the-stock-market-24-hrs-a-day-with-td-ameritrade.html", "country": "US", "domain_rank": 767, "title": "Investors can trade the stock market 24 hrs a day with TD Ameritrade", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.041, "site_type": "news", "published": "2018-01-22T07:02:00.000+02:00", "replies_count": 0, "uuid": "f8aa3ddf35dd57f8634712259215a98d872b024f"}, "author": "Fred Imbert", "url": "https://www.cnbc.com/2018/01/22/investors-can-trade-the-stock-market-24-hrs-a-day-with-td-ameritrade.html", "ord_in_thread": 0, "title": "Investors can trade the stock market 24 hrs a day with TD Ameritrade", "locations": [], "entities": {"persons": [{"name": "david paul morris", "sentiment": "negative"}, {"name": "steven quirk", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "none"}, {"name": "holding corp.", "sentiment": "none"}, {"name": "spdr gold trust", "sentiment": "none"}, {"name": "spdr", "sentiment": "none"}, {"name": "ameritrade", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "6 Hours Ago | 00:45 \nTD Ameritrade extended trading hours on its platform starting Monday to 24 hours, five days a week for several popular exchange-traded funds. The e-broker also told CNBC that trading individual stocks around the clock may not be too far away.Traders on the TD Ameritrade platform are now able to buy and sell shares of ETFs like the SPDR S&P 500 ( SPY ), iShares MSCI Emerging Markets ETF ( EEM ) and the SPDR Gold Trust ( GLD ) at any time of the day. Trades made between 8 p.m. ET and 4 a.m. ET are placed as limit orders and are executed through electronic communication networks . \nThe move lets the Average Joe buy and sell these ETFs when market-moving news hits overnight rather than waiting until the stock market opens to react to the news. TD Ameritrade's platform is used largely by retail investors.\"What we're doing is creating a seamless session,\" Steven Quirk, executive vice president of TD Ameritrade's trader group, told CNBC. \"We know there's a lot of news that happens overnight when the market isn't open.\"To be sure, online trading platforms — including TD Ameritrade — let clients trade in the premarket session (4 a.m. ET to 9:30 a.m. ET) and after-hours (4 p.m. ET to 8 p.m. ET). But TD Ameritrade's change lets people trade during the eight-hour window between the close of the after-hours session and the start of premarket trading. Quirk said traders on the platform want the same flexibility in trading that they have in online shopping. \nHe said that TD Ameritrade would enable 24-hour trading for popular individual stocks, like Apple and Amazon, once liquidity for the SPY and other ETFs during the new session became large enough. \nAt the same time, this might be another way to get more people trading, said Richard Repetto, an analyst at Sandler O'Neill & Partners. \"They're looking to do more trades whichever way they can, whether in stocks or other products,\" he said. \nHowever, TD Ameritrade CEO Tim Hockey said in October the company averaged a record of 511, 000 trades per day during fiscal 2017, which ended Sept. 30. Mike Segar | Reuters Tim Hockey, president and chief executive officer (CEO) of TD Ameritrade. \nThe move also comes in the middle of a boom in cryptocurrency trading among retail investors. Cryptocurrencies like bitcoin — which have surged in value and popularity over the past year — trade seamlessly for 24 hours a day, 7 days a week throughout the world, possibly showing that this constant trading will appeal to people. \n\"For the more generic products that are more liquid like futures and bitcoin, 24-hour trading works\" because there is strong global demand for those products, said Larry Tabb, founder of The Tabb Group. \nHe also noted, however, that trading individual stocks outside of the regular session is riskier than trading during normal market hours. \n\"The problem with trading equities around the clock is there's not that much demand to keep a natural supply-demand balance,\" Tabb said. \"Small amounts of supply and demand can really move prices, so you have to be careful.\"", "external_links": [], "published": "2018-01-22T07:02:00.000+02:00", "crawled": "2018-01-22T07:11:33.012+02:00", "highlightTitle": ""}