{"organizations": [], "uuid": "b93a67288457bf5c1dc762070c291a06332154da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225457594&w=1200&r=LYNXMPEE0P0MW", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-gymnastics-usa-nassar/usa-gymnastics-quiet-on-board-resignation-call-after-abuse-scandal-idUKKBN1FF1BE", "country": "US", "domain_rank": 408, "title": "USA Gymnastics quiet on board resignation call after abuse scandal", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T13:17:00.000+02:00", "replies_count": 0, "uuid": "b93a67288457bf5c1dc762070c291a06332154da"}, "author": "", "url": "https://uk.reuters.com/article/uk-gymnastics-usa-nassar/usa-gymnastics-quiet-on-board-resignation-call-after-abuse-scandal-idUKKBN1FF1BE", "ord_in_thread": 0, "title": "USA Gymnastics quiet on board resignation call after abuse scandal", "locations": [], "entities": {"persons": [{"name": "nassar", "sentiment": "none"}, {"name": "kevin martinez", "sentiment": "none"}, {"name": "scott black", "sentiment": "none"}, {"name": "larry nassar", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "michigan", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "usa gymnastics", "sentiment": "negative"}, {"name": "u.s. olympic committee", "sentiment": "none"}, {"name": "espn", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 11:19 AM / Updated 27 minutes ago U.S. opens sexual abuse investigations in sports amid gymnastics scandal Jonathan Allen , David Shepardson 5 Min Read \n(Reuters) - U.S. officials opened broad investigations on Friday into sexual abuse in sports, while pressure mounted on the USA Gymnastics board of directors to resign en masse two days after the former national team doctor who molested female athletes was handed an effective life prison sentence. \nA week of gut-wrenching revelations by gymnasts, including Olympic medallists Aly Raisman and Simone Biles, led to separate investigations by the U.S. House of Representatives, the U.S. Senate and the U.S. Department of Education. \nThose investigations seek to establish if other sports officials turned a blind eye to doctor Larry Nassar’s abuses and to examine allegations of harassment by officials in other sports, including swimming and taekwondo. \nUSA Gymnastics director Michael Burns, the head men’s gymnastics coach at the University of Minnesota, said on Friday that he had resigned from the group’s board, becoming at least the fifth director to do so as a result of the scandal. \nThe U.S. Olympic Committee (USOC) has threatened to revoke the group’s authority to organise its sport if the remaining directors, a count that stands at 16 after Burns’ departure, did not step down by Wednesday. \nRaisman vowed to keep the pressure on sports organizations, to see who else knew about Nassar’s abuse. He worked for the federation through four Olympic Games, but the allegations did not come to light until 2016. \n“Everyone stood up for him,” Raisman said in an interview with ABC’s “The View.”“My work, and the army of survivors, we’re not done yet. We still have to hold these organizations accountable.” \nA USA Gymnastics spokeswoman declined to confirm if the remaining directors would resign by the deadline. \nNone of the remaining listed directors were immediately available for comment. \nInvestigators from the U.S. House of Representatives sent letters to the USOC, USA Gymnastics, USA Swimming, USA Taekwondo and Michigan State University, where Nassar also worked, asking questions about sexual abuse. U.S. Senators also announced an investigation earlier this week. \n“My heart breaks for the survivors of Larry Nassar’s disgusting crimes,” said U.S. Education Secretary Betsy DeVos, whose department will also investigate Michigan State University. “What happened at Michigan State is abhorrent. It cannot ever happen again.” \nThe school’s sports director, Mark Hollis, retired on Friday, two days after university President Lou Anna Simon stepped down. \nMichigan Attorney General Bill Schuette, whose office prosecuted Nassar, confirmed on Friday on Twitter that his office is investigating Michigan State University. \nThe USOC’s own investigation into how Nassar was able to abuse victims for years will include looking at whether any USOC officials themselves turned a blind eye to his actions. \nNassar, 54, was sentenced to up to 175 years in prison by a Michigan state judge on Wednesday for carrying out the attacks on young girls under the guise of medical treatment. More than 150 accusers recounted their stories in the courtroom. \nUSOC Chief Executive Officer Scott Blackmun called on Thursday for the resignation of all current members board of USA Gymnastics and outlined six steps that the organisation must take to achieve governance reform. \n“While the USOC encourages USAG to think and act broadly on reforming its culture, we also believe that reform must start with an entirely new board,” Blackmun wrote in a letter to USA Gymnastics’ board. \nUSA Gymnastics said in a statement that it “completely embraces” the requirements laid out by Blackmun. \nThe scandal could take a financial toll on the sports federation for years, sponsorship executives said. The group already stands to lose millions of dollars in revenue through the 2020 Olympic Games, as sponsors back away the executives said. Related Coverage Fifth USA Gymnastics board member resigns amid Nassar sex abuse case \nIn Washington on Friday, the U.S. House Energy and Commerce Committee, in announcing its investigation, said sports organizations “must have mechanisms in place to ensure complete oversight and prevent such abuses from occurring.” \nThe panel asked Michigan State to disclose if it is aware of any other abuse allegations involving other faculty members. \nThe U.S. House next week will vote on a bill approved by the Senate in November to require amateur athletics governing bodies to report sex-abuse allegations immediately to law enforcement or a child welfare agency. \nThe bill makes clear that aspiring Olympic athletes can report allegations of abuse and ensures all national governing bodies follow the strictest standards for child abuse prevention. Reporting by Jonathan Allen in New York, David Shepardson in Washington, Ben Klayman in Detroit; Editing by Scott Malone and Grant McCool", "external_links": [], "published": "2018-01-26T13:17:00.000+02:00", "crawled": "2018-01-26T13:35:30.001+02:00", "highlightTitle": ""}