{"organizations": [], "uuid": "19780dea45210daa587e714de10df5536c1ded3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/business-wire-l3-technologies-to-broadcast-fourth-quarter-conference-call-over-the-internet.html", "country": "US", "domain_rank": 767, "title": "L3 Technologies to Broadcast Fourth Quarter Conference Call Over the Internet", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T17:00:00.000+02:00", "replies_count": 0, "uuid": "19780dea45210daa587e714de10df5536c1ded3d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/business-wire-l3-technologies-to-broadcast-fourth-quarter-conference-call-over-the-internet.html", "ord_in_thread": 0, "title": "L3 Technologies to Broadcast Fourth Quarter Conference Call Over the Internet", "locations": [], "entities": {"persons": [{"name": "christopher e. kubasik", "sentiment": "none"}, {"name": "ralph g. d’ambrosio", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- L3 Technologies (NYSE:LLL) announced today that it intends to release its 2017 fourth quarter results on Thursday, January 25, before the open of the market. In conjunction with this announcement, L3 will host a conference call on the same day at 11:00 a.m. ET that will be simultaneously broadcast over the Internet. Christopher E. Kubasik, Chief Executive Officer and President, and Ralph G. D’Ambrosio, Senior Vice President and Chief Financial Officer, will host the call.\nThursday, January 25, 2018\n11:00 a.m. ET\n10:00 a.m. CT\n9:00 a.m. MT\n8:00 a.m. PT\nListeners can access the conference call live at the following website address:\nwww.L3T.com\nPlease allow 15 minutes prior to the call to visit this site to download and install any necessary audio software. The archived version of the call can be accessed at the site or by dialing 800-585-8367/Conference ID: 2677676 (for domestic callers) or 404-537-3406/Conference ID: 2677676 (for international callers) approximately two hours after the call ends and will be available until the company’s next quarterly earnings release.\nHeadquartered in New York City, L3 Technologies employs approximately 38,000 people worldwide and is a leading provider of a broad range of communication, electronic and sensor systems used on military, homeland security and commercial platforms. L3 is also a prime contractor in aerospace systems, security and detection systems, and pilot training. The company reported 2016 sales of $10.5 billion.\nTo learn more about L3, please visit the company’s website at www.L3T.com . L3 uses its website as a channel of distribution of material company information. Financial and other material information regarding L3 is routinely posted on the company’s website and is readily accessible.\nSafe Harbor Statement Under the Private Securities Litigation Reform Act of 1995\nExcept for historical information contained herein, the matters set forth in this news release are forward-looking statements. Statements that are predictive in nature, that depend upon or refer to events or conditions or that include words such as “expects,” “anticipates,” “intends,” “plans,” “believes,” “estimates,” “will,” “could” and similar expressions are forward-looking statements. The forward-looking statements set forth above involve a number of risks and uncertainties that could cause actual results to differ materially from any such statement, including the risks and uncertainties discussed in the company’s Safe Harbor Compliance Statement for Forward-Looking Statements included in the company’s recent filings, including Forms 10-K and 10-Q, with the Securities and Exchange Commission. The forward-looking statements speak only as of the date made, and the company undertakes no obligation to update these forward-looking statements.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180117005296/en/\nL3 Technologies\nCorporate Communications\n212-697-1111\nSource: L3 Technologies", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.l3t.com%2F&esheet=51744050&newsitemid=20180117005296&lan=en-US&anchor=www.L3T.com&index=2&md5=94a81036ef4e05b56f669bc9556983bb", "http://www.businesswire.com/news/home/20180117005296/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.L3T.com&esheet=51744050&newsitemid=20180117005296&lan=en-US&anchor=www.L3T.com&index=1&md5=116cdb149bb2c5649564376765e9a0b8"], "published": "2018-01-17T17:00:00.000+02:00", "crawled": "2018-01-17T19:16:20.007+02:00", "highlightTitle": ""}