{"organizations": [], "uuid": "24e8b83fba9024b755d3f1abd473be30623e1cae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 7, "shares": 7, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XD046_3gclR_TOP_20180123123321.jpg", "site_section": "http://www.wsj.com/xml/rss/3_7031.xml", "section_title": "WSJ.com: Markets", "url": "https://www.wsj.com/articles/consumer-brands-cant-cut-their-way-to-growth-1516730609", "country": "US", "domain_rank": 387, "title": "Consumer Brands Can’t Cut Their Way to Growth - WSJ", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T20:03:00.000+02:00", "replies_count": 0, "uuid": "24e8b83fba9024b755d3f1abd473be30623e1cae"}, "author": "Aaron Back", "url": "https://www.wsj.com/articles/consumer-brands-cant-cut-their-way-to-growth-1516730609", "ord_in_thread": 0, "title": "Consumer Brands Can’t Cut Their Way to Growth - WSJ", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "wsj", "sentiment": "negative"}, {"name": "p&g", "sentiment": "none"}, {"name": "kimberly-clark kmb", "sentiment": "none"}, {"name": "procter & gamble", "sentiment": "none"}, {"name": "kimberly-clark", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "1 COMMENTS Cutting costs and cutting prices won’t save consumer-products makers. Their tax-cut windfall should push companies like Procter & Gamble PG -3.51% and Kimberly-Clark KMB 0.57% to reinvigorate their product lines.\nThe trends hurting sales at these companies include younger, more cost-conscious customers who can more easily compare prices online, as well as competition from cheaper local brands in key emerging markets like China. In the case of diapers and other baby-care products, declining U.S. birth rates are also an issue.\nIn response, both companies have moved to cut prices on key products such as diapers. Kimberly-Clark, maker of Huggies, and P&G, maker of Pampers and Luvs, both saw sagging results in their diaper businesses in the three months to December. Kimberly-Clark’s personal-care segment, which includes baby care, saw sales rise just 1% from a year earlier, hit by a 3% decline in net selling prices. At P&G, the baby-and-family-care segment saw sales fall 1%, on declines in both volume and price.\nP&G, whose product portfolio is more diverse, was boosted during the quarter by stronger results in other lines such as beauty and health care. But higher input costs and price reductions, including on Gillette razors in April last year, continued to weigh on margins.\nKimberly-Clark already has a long-term cost-saving program, poignantly named FORCE (Focused On Reduced Costs Everywhere), which aims to save $1.5 billion through 2021. On top of that, the company on Tuesday announced it will cut at least 5,000 jobs, or about 13% of its workforce, to take out an additional half a billion dollars of costs by 2021.\nBut forcing costs lower won’t be enough. Investors are keen to see a return to strong sales growth at both companies. This will require continued investment in improved products, and possibly even expansion into new, more millennial-friendly product lines through acquisitions.\nInstead, both companies have continued to prioritize the short-term pampering of shareholders. Kimberly-Clark announced a 3% increase to its dividend, boasting that this was the 46th consecutive annual increase. P&G said it now expects to buy back $6 billion to $8 billion of shares through the fiscal year ending in June, up from $4 billion to $7 billion earlier.\nBut on a conference call, Bank of America Merrill Lynch analyst Olivia Tong said she was surprised by the higher buyback, because “you’ve said you aren’t suffering from a lack of ideas.” She asked how the company plans to use money from a lower tax rate over the long run, including possible acquisitions.\nWhen sell-side analysts complain you may be buying back too much stock, you have a problem. To keep investors happy, these consumer groups need to start showing some momentum.\nWrite to Aaron Back at aaron.back@wsj.com", "external_links": [], "published": "2018-01-23T20:03:00.000+02:00", "crawled": "2018-01-23T22:03:24.023+02:00", "highlightTitle": ""}