{"organizations": [], "uuid": "7c32abea7d8cffdc24fc5f7b80d2433aa3a79d66", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224116880&w=1200&r=LYNXMPEE0L0TP", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-russia-vtb-sanctions/russias-vtb-bank-head-kostin-shrugs-off-u-s-sanctions-risk-idUSKBN1FB13N", "country": "US", "domain_rank": 408, "title": "Russia's VTB bank head Kostin shrugs off U.S. sanctions risk", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T18:06:00.000+02:00", "replies_count": 0, "uuid": "7c32abea7d8cffdc24fc5f7b80d2433aa3a79d66"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-russia-vtb-sanctions/russias-vtb-bank-head-kostin-shrugs-off-u-s-sanctions-risk-idUSKBN1FB13N", "ord_in_thread": 0, "title": "Russia's VTB bank head Kostin shrugs off U.S. sanctions risk", "locations": [], "entities": {"persons": [{"name": "kostin", "sentiment": "negative"}, {"name": "vladim", "sentiment": "negative"}, {"name": "andrey kostin", "sentiment": "negative"}, {"name": "vladimir putin", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "putin", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "ukraine", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "vtb", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MOSCOW (Reuters) - Andrey Kostin, the head of Russian state bank VTB and an ally of President Vladimir Putin, said there was a high risk his name would be added to a new U.S. list of people close to Vladimir Putin, but that he was unfazed by the prospect.\nThe United States is drawing up a list of Russians with close connections to Putin after U.S. President Donald Trump signed a new sanctions package into law designed to punish Moscow for its alleged meddling in the 2016 U.S. presidential election. Russia denies the charge.\nWhile inclusion on the new list would not automatically lead to sanctions, it could make foreign politicians, banks and officials reluctant to have any dealings with named individuals. Such a risk has already prompted some of Russia’s wealthiest people to distance themselves from Putin.\nVTB, which is a cornerstone of Russia’s financial sector and has helped facilitate many large, politically important deals, is already under Western sanctions imposed over Russia’s role in the Ukraine crisis, but Kostin is not under personal sanctions.\n“To be honest, I am not very afraid of this (the risk of personal inclusion on the list). My generation grew up when they didn’t let you go anywhere abroad,” Kostin, 61, told Reuters in an interview authorized for publication on Monday.\nPersonal sanctions, if applied, could potentially prevent travel abroad or access to foreign bank accounts and freeze foreign assets, but Kostin played down their significance.\n“(Not being able to use foreign) bank accounts? Thank God there is VTB where we can keep our money,” he said.\nDescribing the risk of his name being on any new list as being “quite high”, Kostin added: “What can I do? Apologize for who I am or am not? I am who I am, and my role is what it is in this country.”\nRUSSIAN BUSINESS “CALM”\nKostin said the existing Western sanctions had proved ineffective, though he added that they had delayed plans for VTB’s privatization. He did not want to speculate on the possible impact of any new sanctions.\nThe Kremlin has said the new sanctions are designed to try to drive a wedge between the ruling elite and Putin, who will seek another six-year mandate in a March 18 presidential election.\nAsked whether he saw signs of nervousness among the elite, most of whom Kostin knows in person, he said: “Of course not.”\n“I have been in business for quite a long time and can compare. Under Putin, support for business, including business abroad, has become a part of our national policy... I don’t think that everyone will now start to run away like cockroaches that disappear through the floorboards. The business community is generally calm.”\nKostin is a regular visitor to the World Economic Forum in Davos, which Trump is expected to attend this year.\nAsked whether he expected Trump to be impeached because of a scandal about his alleged collusion with Moscow ahead of the 2016 U.S. presidential election, Kostin said: “I am not aware of a single deal where Trump did anything with Russia.”\n“From my sources, I don’t feel as if there’s a threat of impeachment.”\nWriting by Katya Golubkova; Editing by Andrew Osborn and Gareth Jones\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T18:06:00.000+02:00", "crawled": "2018-01-22T19:11:34.015+02:00", "highlightTitle": ""}