{"organizations": [], "uuid": "85fd47ccba9eefde6936b65df722ee17803093a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226588115&w=1200&r=LYNXMPEE0T0R0", "site_section": "https://www.reuters.com/subjects/euro-zone", "section_title": "Euro Zone | Reuters.com", "url": "https://www.reuters.com/article/uk-britain-eu-gibraltar/gibraltar-says-can-implement-selective-parts-of-brexit-muddying-outcome-report-idUSKBN1FJ1LU", "country": "US", "domain_rank": 408, "title": "Gibraltar says can implement Brexit selectively, muddying outcome - report", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T20:14:00.000+02:00", "replies_count": 0, "uuid": "85fd47ccba9eefde6936b65df722ee17803093a0"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/uk-britain-eu-gibraltar/gibraltar-says-can-implement-selective-parts-of-brexit-muddying-outcome-report-idUSKBN1FJ1LU", "ord_in_thread": 0, "title": "Gibraltar says can implement Brexit selectively, muddying outcome - report", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "picardo", "sentiment": "none"}, {"name": "joseph garcia", "sentiment": "none"}, {"name": "fabian picardo", "sentiment": "none"}], "locations": [{"name": "gibraltar", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Gibraltar can choose elements of any Brexit deal Britain agrees with the European Union and avoid those it considers detrimental, the chief minister of the British territory said.\nFabian Picardo told the British newspaper The Independent that Gibraltar’s constitution allowed it to decide which parts of any agreement with the European Union it would keep.\n“We will be able to determine whether aspects of what is agreed will be implemented in Gibraltar or not,” Picardo said. “It is clear that we do have a Brexit veto for Gibraltar, in Gibraltar.”\nNo one from Britain’s Brexit department was immediately available for comment.\nIn a speech in Brussels, Gibraltar’s deputy chief minister, Joseph Garcia, said that the territory should not be a “whipping boy” made to suffer the consequences of Brexit and that Spain might prevent current conditions applying in a transition period after Brexit.\nHe talked at length about the need to preserve movement of people across the border with Spain. Some 13,000 people living in Spain, including 8,000 Spaniards, cross the border to work each day.\nGarcia said Spain had used the border as a political weapon, with intensive checks, and that the Commission had intervened to smooth crossings. After Brexit, Garcia said Gibraltar risked not being protected by EU law.\nAs Britain negotiates a new trading deal with the EU, there are deep splits across the country about what sort of agreement should be sought with the bloc.\nAn analysis compiled by British officials that was leaked on Monday suggested that Britain would be worse off under three Brexit scenarios considered.\nGibraltar, which Spain ceded to Britain in 1713 but wants back, voted 96 percent in favour of staying in the EU in the 2016 referendum. Picardo said the enclave had autonomy in areas including those relating to business and social care, meaning it set different tariffs in some sectors.\nThe UK says it will seek a one-size-fits-all trade agreement with the EU which will be applicable to all parts of the UK, despite regional differences.\nGibraltar’s stance reflects other divisions within the United Kingdom. The devolved government in Scotland also wants to retain membership of the EU’s single market and customs union and has tried to further the possibility of a differential deal.\nLike Gibraltar, Scotland voted to keep its EU membership while Britain as a whole voted to leave, straining relations between London and Edinburgh.\nReporting by Elisabeth O'Leary,; additional reporting by Philip Blenkinsop in Brussels, editing by Michael Holden, Larry King\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T20:14:00.000+02:00", "crawled": "2018-01-31T04:30:13.000+02:00", "highlightTitle": ""}