{"organizations": [], "uuid": "7f23729268feb2a2d1e602ba60ea38e51a961b31", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 14}, "facebook": {"likes": 11, "shares": 11, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XC936_3mlXD_TOP_20180123042618.jpg", "site_section": "http://online.wsj.com/xml/rss/3_7031.xml", "section_title": "WSJ.com: Markets", "url": "https://www.wsj.com/articles/no-trade-war-with-chinayet-1516700909", "country": "US", "domain_rank": 387, "title": "No Trade War With China—Yet", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T11:51:00.000+02:00", "replies_count": 0, "uuid": "7f23729268feb2a2d1e602ba60ea38e51a961b31"}, "author": "Nathaniel Taplin", "url": "https://www.wsj.com/articles/no-trade-war-with-chinayet-1516700909", "ord_in_thread": 0, "title": "No Trade War With China—Yet", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "malaysia", "sentiment": "none"}], "organizations": [{"name": "samsung", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "4 COMMENTS President Trump’s long-anticipated fusillade against what he calls unfair trade has finally been launched— against Korean washing machines .\nMr. Trump was elected after campaigning on a promise to get tough on Chinese trade ,but his first year in office was notable more for rhetoric than action . The administration’s decision on Monday to slap steep new tariffs on solar-panel and washing-machine imports looks different. Is the long-feared China trade war finally here?\nThe washing-machine tariffs will mostly hit Korean manufacturers such as Samsung. Photo: SeongJoon Cho/Bloomberg News Related Coverage U.S. Imposes New Tariffs, Ramping Up ‘America First’ Trade Policy Appearances can be deceiving. China is the world’s largest solar-cell producer but already faced steep U.S. tariffs that reduced its share of panel imports to just 11% in the first 11 months of 2017, down from nearly 60% as recently as 2011. Chinese firms producing in places such as Malaysia would get hit under the new tariffs, but Chinese workers wouldn’t feel the pain directly. The washing-machine tariffs, meanwhile, will mostly hit Korean manufacturers such as Samsung and LG Electronics. Monday’s action fits a pattern of focusing on high-visibility sectors that play well with Mr. Trump’s base but won’t hit China where it hurts.\nThe narrow focus of these tariffs explains the muted reaction in markets. Shares in both Shanghai and Seoul rose 1% on Tuesday. Investors waiting for the trade-war shoe to drop will need to worry more if the Trump administration starts imposing more broad-based penalties on Chinese trade and investment following, say, its investigation into Chinese intellectual-property theft.\nIf those broader penalties show signs of materializing later in 2018, it would pay for investors to protect themselves in a hurry. Meanwhile, given strongly rebounding global growth, it probably makes sense to keep watching and waiting.\nThe risks of starting a true trade war would be large for Mr. Trump. China isn’t Korea or Japan—U.S. allies whom the U.S. can safely harass, up to a point. Trump needs China’s cooperation to have any hope of reining in North Korea without military action.\nMr. Trump also enters 2018 with the booming U.S. economy as the Republican Party’s main political advantage heading into midterm elections. A trade war with China would push up the cost of U.S. consumer goods, erode real wage growth and probably hit farmers in Mr. Trump’s rural base particularly hard. It is also harder to make the case that American manufacturers are suffering when factory run rates are at their highest level since 2005.\nBy contrast, President Xi Jinping has made it through his political crucible: The 19th Communist Party Congress in October ended with Mr. Xi as the strongest Chinese leader in decades.\nNone of this means that hotter heads won’t prevail. The most choleric anti-China voices in the administration, primarily former adviser Steve Bannon, appear to have been marginalized, but Mr. Trump’s own rhetoric shows little sign of moderating.\nIf Mr. Trump does pull the trigger—and derail the global growth rebound in the process—everyone will suffer, most notably his own party and political base. Many in the president’s circle surely understand this. Investors must hope he does too.", "external_links": [], "published": "2018-01-23T11:51:00.000+02:00", "crawled": "2018-01-23T16:27:45.004+02:00", "highlightTitle": ""}