{"organizations": [], "uuid": "940c093d8e065be9609757a63c1dff5cb610f593", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-paychex--ihs-markit-small-business-employment-watch-small-business-job-growth-rebounds-as-the-year-begins-wage-growth-also-on.html", "country": "US", "domain_rank": 767, "title": "Paychex | IHS Markit Small Business Employment Watch: Small Business Job Growth Rebounds as the Year Begins; Wage Growth Also on the Rise", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T16:30:00.000+02:00", "replies_count": 0, "uuid": "940c093d8e065be9609757a63c1dff5cb610f593"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-paychex--ihs-markit-small-business-employment-watch-small-business-job-growth-rebounds-as-the-year-begins-wage-growth-also-on.html", "ord_in_thread": 0, "title": "Paychex | IHS Markit Small Business Employment Watch: Small Business Job Growth Rebounds as the Year Begins; Wage Growth Also on the Rise", "locations": [], "entities": {"persons": [{"name": "james diffley", "sentiment": "none"}, {"name": "martin mucci", "sentiment": "none"}], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "rochester", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "ihs markit small business employment wa", "sentiment": "negative"}, {"name": "paychex", "sentiment": "negative"}, {"name": "ihs markit", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ROCHESTER, N.Y., Jan. 30, 2018 /PRNewswire/ -- The Paychex | IHS Markit Small Business Employment Watch started the year with an increase in small business job growth and wages in January. The Small Business Jobs Index stands at 99.88, a 0.18 percent increase over December. The job growth rate remains below last January's level by 0.74 percent. Hourly earnings have grown $0.72 in the past year to $26.38. January's 12-month wages growth rate of 2.81 percent marks an improvement from 2.78 percent in December.\n\"Small business job growth improved 0.18 percent in January, ending a string of ten straight declines,\" said James Diffley, chief regional economist at IHS Markit.\n\"After an extended period of uncertainty, the passing of federal tax reform at the end of last year offered clarity to business owners on the immediate future of U.S. tax policy,\" said Martin Mucci , Paychex president and CEO. \"While it's still too early to see the impacts of tax reform on net pay, we'll be keeping a close eye on this in the weeks ahead.\"\nNational Jobs Index\nDown 0.01 percent during the past quarter, the national index was essentially unchanged as January's increase mitigated the decreases of December and November. At 99.88, the Paychex | IHS Markit Small Business Jobs Index opened 2018 with a 0.18 percent increase, but remains below last year's level by 0.74 percent.\nNational Wage Report\nAt $26.38, hourly earnings gained 2.81 percent from a year ago, improving from 2.78 percent in December and 2.75 percent in November. Weekly hours growth remained positive year-over-year, but slowed from 0.37 percent in November to 0.14 percent in January. With this slowdown, weekly earnings fell below three- percent growth for the first time since March last year.\nRegional Jobs Index\nFollowing a year-end slump, the Midwest jobs index surged back above 100, increasing 0.47 percent in January. Additionally, the Midwest is down just 0.15 percent from last year, best among regions. At 99.43, the West has the lowest index among regions and the weakest one-month and 12-month growth rates as well, 0.09 percent and -0.74 percent, respectively.\nRegional Wage Report\nThe West continues to far outpace the other regions, with earnings growth at 3.44 percent hourly and 3.86 percent weekly. All other regions are well below three percent growth for both hourly and weekly earnings. At 2.12 percent, the Midwest continued a year-long deceleration in hourly earnings growth. Annualized one-month and three-month growth rates have been below two percent for the past five months.\nState Jobs Index\nAt 98.32 and down 3.10 percent from last year, Missouri has the weakest index and 12-month growth rate among states, but did recover to some extent with a solid 0.92 percent increase in January. Virginia was the only state with a significant decrease in January, 0.40 percent, and is now below 100 for the first time since January 2016. While Virginia improved nearly three percent in 2016, it has lost almost all its momentum, falling two percent in 2017 and another 0.40 percent already in 2018.\nNote: Analysis is provided for the 20 largest states based on U.S. population.\nState Wage Report\nArizona leads states with 4.92 percent hourly earnings growth, though the one-month and three-month annualized rates were lower, 3.28 percent and 4.32 percent, respectively. Midwest states Ohio, Illinois, and Indiana have hourly earnings growth below two percent, and rank in the bottom three among states. Michigan, another Midwest state, is next at just 2.03 percent growth.\nNote: Analysis is provided for the 20 largest states based on U.S. population\nMetropolitan Jobs Index\nWith an index level just below 103, Denver jumped to the top spot among metros in January for the first time since 2011. St. Louis had the best gain in January among metros, recovering most of the momentum lost during the prior three months. However, St. Louis still remains mired at 98.53, ahead of only Los Angeles and San Francisco.\nNote: Analysis is provided for the 20 largest metro areas based on U.S. population.\nMetropolitan Wage Report\nAt 5.15 percent, Phoenix maintained its hourly earnings growth lead, followed by California metros San Diego, Riverside, and Los Angeles. Both below two percent hourly earnings growth in January, Boston has been below this level for three months, while Chicago has been below two percent growth for six months.\nNote: Analysis is provided for the 20 largest metro areas based on U.S. population.\nIndustry Jobs Index\nLeisure and Hospitality led gains in January and quickly climbed back to fourth place among industry sectors after falling two spots in December. Financial Activities joined Manufacturing as the only industries with positive year-over-year growth, though both indexes remain below 100.\nNote: Analysis is provided for seven major industry sectors.\nIndustry Wage Report\nHourly earnings continued to climb higher in January for Construction, 3.36 percent, and Financial Activities, 2.97 percent. Education and Health Services ranks last in growth for earnings and hours worked among industries. Following a seven-month slowdown, Manufacturing had a slight uptick in the pace of hourly earnings growth in January, from 2.64 percent in December to 2.68 percent.\nNote: Analysis is provided for seven major industry sectors.\nFor more information about the Paychex | IHS Markit Small Business Employment Watch, including interactive charts detailing all data at a national, regional, state, metro, and industry level, visit www.paychex.com/employment-watch and sign up to receive monthly Employment Watch alerts.\n*Information regarding the professions included in the industry data can be found at the Bureau of Labor Statistics website .\nAbout the Paychex | IHS Markit Small Business Employment Watch\nThe Paychex | IHS Markit Small Business Employment Watch is released each month by Paychex, Inc., a leading provider of payroll, human resource, insurance, and benefits outsourcing solutions for small-to medium-sized businesses, and IHS Markit, a world leader in critical information, analytics, and expertise. Focused exclusively on small business, the monthly report offers analysis of national employment and wage trends, as well as examines regional, state, metro, and industry sector activity. Drawing from the payroll data of approximately 350,000 Paychex clients, this powerful tool delivers real-time insights into the small business trends driving the U.S. economy.\nAbout Paychex\nPaychex, Inc. (NASDAQ: PAYX) is a leading provider of integrated human capital management solutions for payroll, HR, retirement, and insurance services. By combining its innovative software-as-a-service technology and mobility platform with dedicated, personal service, Paychex empowers small- and medium-sized business owners to focus on the growth and management of their business. Backed by 45 years of industry expertise, Paychex serves approximately 605,000 payroll clients as of May 31, 2017, across more than 100 locations and pays one out of every 12 American private sector employees. Learn more about Paychex by visiting www.paychex.com , and stay connected on Twitter and LinkedIn .\nAbout IHS Markit ( www.ihsmarkit.com )\nIHS Markit (Nasdaq: INFO) is a world leader in critical information, analytics and solutions for the major industries and markets that drive economies worldwide. The company delivers next-generation information, analytics and solutions to customers in business, finance and government, improving their operational efficiency and providing deep insights that lead to well-informed, confident decisions. IHS Markit has more than 50,000 business and government customers, including 80 percent of the Fortune Global 500 and the world's leading financial institutions. Headquartered in London, IHS Markit is committed to sustainable, profitable growth.\nIHS Markit is a registered trademark of IHS Markit Ltd. and/or its affiliates. All other company and product names may be trademarks of their respective owners © 2018 IHS Markit Ltd. All rights reserved.\nMedia Contacts\nLisa Fleming\nPaychex, Inc.\n585-387-6402\nlfleming@paychex.com\n@PaychexNews\nKate Smith\nIHS Markit\n781-301-9311\nKatherine.smith@ihsmarkit.com\nTess Flynn\nEric Mower + Associates\n716-880-1488\ntflynn@mower.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/paychex--ihs-markit-small-business-employment-watch-small-business-job-growth-rebounds-as-the-year-begins-wage-growth-also-on-the-rise-300590012.html\nSOURCE Paychex, Inc.", "external_links": ["https://www.paychex.com/employment-watch/?utm_source=January%202018&utm_medium=press%20release&utm_campaign=employmentwatch#!/", "http://www.bls.gov/iag/tgs/iag_index_naics.htm", "http://www.ihsmarkit.com/", "https://www.paychex.com/employment-watch/?utm_source=January%202018&utm_medium=press%20release&utm_campaign=employmentwatch", "http://www.twitter.com/paychexnews", "http://www.prnewswire.com/news-releases/paychex--ihs-markit-small-business-employment-watch-small-business-job-growth-rebounds-as-the-year-begins-wage-growth-also-on-the-rise-300590012.html", "http://media.paychex.com/martin-mucci?utm_source=January%202018&utm_medium=press%20release&utm_campaign=employmentwatch", "https://www.paychex.com/employment-watch/subscribe/?utm_source=January%202018&utm_medium=press%20release&utm_campaign=employmentwatch", "http://www.twitter.com/paychex", "http://www.paychex.com/", "https://www.linkedin.com/company/4255/"], "published": "2018-01-30T16:30:00.000+02:00", "crawled": "2018-01-30T17:38:26.010+02:00", "highlightTitle": ""}