{"organizations": [], "uuid": "4088ecc4b10bd4ffaeffe7b00899d0666d7a2c30", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226551010&w=1200&r=LYNXMPEE0T0HY", "site_section": "http://feeds.reuters.com/reuters/INworldNews\r", "section_title": "Reuters: World News", "url": "https://in.reuters.com/article/spain-politics-catalonia/catalonia-postpones-vote-for-new-regional-head-sticks-with-puigdemont-idINKBN1FJ148", "country": "US", "domain_rank": 408, "title": "Catalonia postpones vote for new regional head, sticks with Puigdemont", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T11:31:00.000+02:00", "replies_count": 0, "uuid": "4088ecc4b10bd4ffaeffe7b00899d0666d7a2c30"}, "author": "", "url": "https://in.reuters.com/article/spain-politics-catalonia/catalonia-postpones-vote-for-new-regional-head-sticks-with-puigdemont-idINKBN1FJ148", "ord_in_thread": 0, "title": "Catalonia postpones vote for new regional head, sticks with Puigdemont", "locations": [], "entities": {"persons": [{"name": "carles puigdemont", "sentiment": "none"}, {"name": "mariano rajoy", "sentiment": "none"}, {"name": "jesus aguado", "sentiment": "none"}, {"name": "paul day", "sentiment": "none"}, {"name": "roger torrent", "sentiment": "none"}], "locations": [{"name": "catalonia", "sentiment": "none"}, {"name": "puigdemont   catalonia", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "puigdemont reuters", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 9:35 AM / Updated 19 minutes ago Catalonia postpones vote for new president in stand-off with Madrid Sam Edwards 3 Min Read \nBARCELONA (Reuters) - Catalonia postponed the election of a new regional president on Tuesday until further notice after Spain’s highest court said the sole nominee, separatist leader Carles Puigdemont, was ineligible while he remains a fugitive from justice in Belgium. \nThe industrial northeastern region’s drive for a split from Spain has led it to clash with the central government in Madrid and the judiciary, which say a declaration of independence is against the country’s 39-year-old constitution. \nPuigdemont, speaking in a recorded message from Belgium posted on social networks late on Tuesday, said he was disappointed at the postponed vote and said he was the only possible candidate for regional president. \n“No other candidate is possible,” he said. \nEarlier, hundreds of pro-independence protesters broke through a police cordon and climbed over a fence to reach the grounds of the regional parliament in Barcelona chanting “Puigdemont, our president” and “Where are the politicians we voted for?”, many wearing Puigdemont masks. \nA referendum on secession last October was ruled illegal by the Constitutional Court. Spanish Prime Minister Mariano Rajoy fired the region’s administration when it declared independence, and five cabinet members including Puigdemont fled to Belgium. \nThe crisis has shaken the confidence of companies in Catalonia, causing thousands to move their registered headquarters elsewhere in Spain, and has deeply divided Catalan society. Roger Torrent , Speaker of Catalonia's regional Parliament, delivers a statement in Barcelona, Spain, January 30, 2018. REUTERS/Rafael Marchante \nJUDGE‘S PERMISSION \nCourt rulings have hampered Puigdemont’s efforts to return to power since pro-independence parties won a slim majority in a December regional election. \nThe Constitutional Court said on Saturday the former journalist could not be elected unless he was physically present in the parliament, with a judge’s permission to attend. \nThese conditions make it hard for Puigdemont to stand, as he is likely to be arrested and tried on charges including sedition and rebellion if he returns to Spain. They carry a potential prison sentence of decades. \nPolice on Tuesday searched border crossings and the entrance to the parliament itself to ensure the former leader did not return to Barcelona, the Catalan capital. \nHe has said he can lead Catalonia from abroad, and on Monday ruled out seeking a judge’s permission to attend the parliament in person. \nPro-independence parties would not nominate an alternative candidate, the regional parliament speaker said on Tuesday. The separatists’ majority in the regional assembly mean Puigdemont would almost certainly win the vote. \nTheir decision to stick with Puigdemont suggests they will continue to push for secession, giving the national government in Madrid no reason to end the direct control that it imposed to block the independence drive. Additional reporting by Paul Day; Writing by Sonya Dowsett; Editing by Julien Toyer and Gareth Jones", "external_links": [], "published": "2018-01-30T11:31:00.000+02:00", "crawled": "2018-01-30T12:00:00.003+02:00", "highlightTitle": ""}