{"organizations": [], "uuid": "85dfb7ef0c21805e81b615afd1b879e4a5081cb5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/india", "section_title": "India", "url": "https://www.reuters.com/article/us-india-lawmaking-tech/indian-court-orders-probe-into-homeless-being-denied-shelter-due-to-lack-of-id-idUSKBN1F010B", "country": "US", "domain_rank": 408, "title": "Indian court orders probe into homeless being denied shelter due to lack of ID", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T17:38:00.000+02:00", "replies_count": 0, "uuid": "85dfb7ef0c21805e81b615afd1b879e4a5081cb5"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-india-lawmaking-tech/indian-court-orders-probe-into-homeless-being-denied-shelter-due-to-lack-of-id-idUSKBN1F010B", "ord_in_thread": 0, "title": "Indian court orders probe into homeless being denied shelter due to lack of ID", "locations": [], "entities": {"persons": [], "locations": [{"name": "mumbai", "sentiment": "none"}, {"name": "uttar pradesh", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "thomson reuters foundation", "sentiment": "negative"}, {"name": "supreme court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MUMBAI (Thomson Reuters Foundation) - Uttar Pradesh state officials must investigate whether homeless people are denied access to shelters because they don’t have identity cards, which they cannot obtain without an address, India’s highest court has ordered.\nIt was the latest criticism of the government’s program to issue each citizen an Aadhaar, an identity card meant to streamline welfare payments and reduce waste in public spending.\nThe Supreme Court has been holding hearings on the legitimacy of the government’s demand to make the Aadhaar mandatory for a range of services from filing taxes to booking train tickets.\nMore than 1 billion of India’s 1.25 billion population have an Aadhaar. Technology experts have raised concerns about the privacy and safety of the data, which includes a residential address, date of birth, fingerprints and iris scans.\nActivists say that people without the card are being refused welfare services, with reports of deaths linked to denial of subsidized food when verification failed.\nIn a Wednesday hearing on night shelters, the court asked Utter Pradesh authorities whether homeless people are being turned away if they do not have an Aadhaar.\n“How do homeless people get Aadhaar if they have no home or a permanent address?” asked Justice Madan Lokur during the hearing. “Does this mean that they do not exist for the Government of India?”\nAdditional Solicitor General Tushar Mehta, who is representing the state, told the court that most homeless people in cities come from villages where they have homes and can therefore get the ID card there.\nActivists say that sending homeless people back to their villages is not a solution, and that states must follow the 2014 Supreme Court ruling that the Aadhaar cannot be a requirement for welfare programs.\n“People are dying on the streets because they cannot go into shelters without an ID,” said Shivani Chaudhry, executive director of the Housing and Land Rights Network.\n“Shelters should not be asking for Aadhaar,” he told the Thomson Reuters Foundation.\nThere are 1 million urban homeless people in India, according to census data, although charities estimate the actual number to be up to three times higher.\nEvery year, hundreds die from exposure to the cold or heat on pavements and train station platforms.\nReporting by Rina Chandran @rinachandran. Editing by Jared Ferrie. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, trafficking, property rights, climate change and resilience. Visit news.trust.org to see more stories.\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-11T17:38:00.000+02:00", "crawled": "2018-01-11T17:01:18.012+02:00", "highlightTitle": ""}