{"organizations": [], "uuid": "12c91c96d913c3d4dc5733d8e177b9b1e1be20f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/10/104939410-GettyImages-822503932.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/26/us-companies-that-have-announced-bonuses-investments-after-tax-cut.html", "country": "US", "domain_rank": 767, "title": "US companies that have announced bonuses, investments after tax cut", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.012, "site_type": "news", "published": "2018-01-26T22:51:00.000+02:00", "replies_count": 0, "uuid": "12c91c96d913c3d4dc5733d8e177b9b1e1be20f2"}, "author": "Nick Wells", "url": "https://www.cnbc.com/2018/01/26/us-companies-that-have-announced-bonuses-investments-after-tax-cut.html", "ord_in_thread": 0, "title": "US companies that have announced bonuses, investments after tax cut", "locations": [], "entities": {"persons": [], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "aflac afl", "sentiment": "negative"}, {"name": "bank of america", "sentiment": "none"}, {"name": "bb&t", "sentiment": "none"}, {"name": "boeing", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "american airlines", "sentiment": "none"}, {"name": "bancorp south", "sentiment": "none"}, {"name": "alaska air", "sentiment": "none"}, {"name": "at&t", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Aflac AFL Increase 401(k) match from 50% to 100% on first 4% of employee contribution; one-time contribution of $500 to every employee's 401(k) plan; offer certain hospital and accident insurance products to employees free of charge; increase overall U.S. investment by $250 million over 3 - 5 years. Alaska Air One-time bonus of $1,000 for 23,000 employees and $118 million in incentive bonuses American Airlines One-time bonus of $1,000 to around 130,000 employees Apple $2,500 in restricted stock units to most employees AT&T T One-time $1,000 bonus to more than 200,000 U.S. employees; invest additional $1 billion in the U.S. in 2018. Bancorp South $10 million investment in employees, including pay increases and one-time bonuses Bank of America One-time $1,000 bonus for U.S. employees earning up to $150,000 per year, about 145,000 teammates\" BB&T BBT One-time $1,200 bonus for about 27,000 employees; raise minimum wage from $12/hour to $15/hour; donate $100 million to philanthropic fund. Boeing $300 million committed to charitable giving, workforce development and workplace facility enhancements Charles Schwab SCHW $1,000 bonus to around 9,000 non-executive employees last year, anticipating the tax law change and in response to the company's strong financial performance.\" Citizens Financial Group One-time $1,000 bonus to around 12,500 employees. Comcast Corp $1,000 bonuses for more than 100,000 workers Comerica One-time $1,000 bonus to 4,500 non-officer employees; raise minimum wage to $15/hour. Discover One-time $1,000 bonus to more than 15,000 non-executive employees. Disney One-time $1,000 cash bonus for more than 125,000 employees; intital $50 educational investment FedEx FDX Invest over $200 million in pay raises, about two-thirds of which will go to hourly team members; contribute $1.5 billion to pension plan\" Fifth Third One-time $1,000 bonus to 13,500 employees, raise minimum wage to $15/hour. Home Depot HD One-time cash bonus up to $1,000 for U.S. hourly associates in the fourth quarter of fiscal 2017 Honeywell Increase 401(k) match for employees in the U.S., Canada and Puerto Rico. JPMorgan Chase JPM Hire 4,000 employees and open up to 400 new Chase branches, increase minimum wage to $15 to $18/hour for 22,000 employees. Kansas City Southern One-time $1,000 bonus to qualified, non-executive employees in the U.S. and Mexico. M&T Bank Increase minimum wage to $14 to $16/hour, depending on geography. PNC Financial PNC $1,000 bonuses for about 47,500 employees in first quarter of 2018; raise minimum wage to $15/hour by year end; additional $1,500 to pension accounts for employees in the defined benefit pension plan Regions Financial RF Increase minimum wage to $15/hour, affecting around 25% of workforce; contribute $40 million to foundation; increase capex budget by $100 million for 2018 Southwest $1,000 cash bonus to all fulltime and part-time employees; incremental $5 million in chartible giving Starbucks SBUX Wage increase for all U.S. hourly and salaried partners totalling around $120 million; \"partner and family sick time\" benefit for all U.S. employees; 2018 stock grant with one-year vest Travelers Cos TRV $1,000 bonus to 14,000 employees with base salary less than $75,000; increase minimum wage to $15/hour U.S. Bank One-time $1,000 bonus to nearly 60,000 employees; raise minimum wage to $15/hour Verizon Employees other than top management to receive 50 shares of restricted stock. Visa Increase 401(k) contribution to 10 percent of base salary Walmart WMT One-time cash bonus of up to $1,000 to eligible employees; raise starting wage to $11/hour in the U.S.; expand maternity and parental leave benefits Washington Federal WAFD Employees \"in good standing\" and earning less than $100k will get 5% increase on top of normal merit increase; unspecified investments in training and development Waste Management WM One-time $2,000 to every North American employee not in a bonus or sales-incentive plan, around 34,000 employees Wells Fargo Raise minimum wage to $15/hour, target $400 million in 2018 philanthropic contributions. Zions ZION Increase compensation of more than 40% of employees; $1,000 bonuses to nearly 80% of employees this year; contribute $12 million to charitable foundation \n( Disclosure: Comcast is parent of NBCUniversal and CNBC. )", "external_links": [], "published": "2018-01-26T22:51:00.000+02:00", "crawled": "2018-01-26T22:56:50.016+02:00", "highlightTitle": ""}