{"organizations": [], "uuid": "e6f4be70ead601553167169748e52db803d5d4de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226879219&w=1200&r=LYNXMPEE0U0H1", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-europe-stocks/european-shares-claw-back-declines-capita-slumps-idUSKBN1FK0XT", "country": "US", "domain_rank": 408, "title": "European shares claw back declines, Capita slumps", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T10:42:00.000+02:00", "replies_count": 0, "uuid": "e6f4be70ead601553167169748e52db803d5d4de"}, "author": "", "url": "https://www.reuters.com/article/us-europe-stocks/european-shares-claw-back-declines-capita-slumps-idUSKBN1FK0XT", "ord_in_thread": 0, "title": "European shares claw back declines, Capita slumps", "locations": [], "entities": {"persons": [], "locations": [{"name": "london", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "intrum justitia", "sentiment": "none"}, {"name": "ericsson", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 8:45 AM / in an hour European shares slip at end of strong month Helen Reid , Danilo Masoni 4 Min Read \nLONDON/MILAN (Reuters) - European shares fell on Wednesday as investors locked in profits at the end of a strong month while results from some of the region’s biggest names also weighed. \nThe STOXX 600 index fell 0.2 percent on the day, ending at its lowest in more than three weeks and suffering its third consecutive day of losses. \nThe pan-European benchmark, however, ended January with a 2.1 percent monthly gain as optimism over earnings and economic growth outweighed recent bond market jitters and concerns over a rising euro. \n”We’ve the impression that investors are looking for a pretext to take a breather and lock in some of their gains.” said Andrea Tueni, head of sales at Saxo Banque Paris. \nResults were center stage on Wednesday, with investors particularly impatient with earnings misses in this high-valuation environment. \nEricsson ( ERICb.ST ) sank 9.2 percent after the telecoms equipment maker reported a deeper than expected loss and said the Chinese market would continue to decline. \nDebt collector Intrum Justitia ( INTRUM.ST ) tumbled by 8.9 percent after its fourth-quarter revenue and earnings missed expectations. \nShares in fashion retailer H&M ( HMb.ST ) fell 10.6 percent after fourth-quarter profit and profit margins fell and the company said it would open far fewer stores in 2018. \nIt was another dark day for struggling UK outsourcer Capita ( CPI.L ), and a pay day for short-sellers, with the shares down 47 percent after the company warned on profit, announced a rights issue and suspended its dividend. \nYet investors remained optimistic on European equities in general. \n“It has been a very strong start to the year, and with that, markets can always take a pause, but there is nothing from the earnings season so far that would not support a continued constructive view on the market,” said Britta Weidenbach, head of European equities at Deutsche Asset Management. \nYear to date in 2018, European equity funds have registered the strongest inflows across all major regions, drawing in more than $22 billion, HSBC found. Last year Europe accounted for more than a third of global equity fund flows. \nThere were some bright spots among companies reporting on Wednesday. \nElectrolux ( ELUXb.ST ) rose 6.9 percent after the home appliance maker reported a bigger than expected rise in fourth-quarter profit, while Finland’s Elisa ( ELISA.HE ) gained 5.8 percent after its results beat expectations. \nAn order boom helped truckmaker Volvo ( VOLVb.ST ) to raise its outlook, driving the shares up 0.4 percent. \nIn an early sign of the negative impact forex could have on some European businesses, Infineon ( IFXGn.DE ) shares fell 1 percent after the chipmaker cut its revenue guidance because of the weak dollar. \n“I think there will be selected companies with a potential negative impact from the dollar, but the question is, is it a net negative and what is the underlying story,” said Deutsche Bank’s Weidenbach. \nOverall fourth-quarter earnings for the STOXX 600 are expected to increase by 11.9 percent year on year, the latest Thomson Reuters data showed. Reporting by Helen Reid and Danilo Masoni; Editing by David Goodman", "external_links": [], "published": "2018-01-31T10:42:00.000+02:00", "crawled": "2018-01-31T10:59:50.033+02:00", "highlightTitle": ""}