{"organizations": [], "uuid": "b6c08d9c6b649f2bf1743e4fdf4636393f8ec1c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-amri-names-michael-mulhern-as-chief-executive-officer.html", "country": "US", "domain_rank": 767, "title": "AMRI Names Michael Mulhern as Chief Executive Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-04T22:00:00.000+02:00", "replies_count": 0, "uuid": "b6c08d9c6b649f2bf1743e4fdf4636393f8ec1c0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-amri-names-michael-mulhern-as-chief-executive-officer.html", "ord_in_thread": 0, "title": "AMRI Names Michael Mulhern as Chief Executive Officer", "locations": [], "entities": {"persons": [{"name": "michael mulhern", "sentiment": "negative"}, {"name": "mulhern", "sentiment": "none"}, {"name": "stephen h. wise", "sentiment": "none"}, {"name": "dean mihas", "sentiment": "none"}, {"name": "michael", "sentiment": "none"}, {"name": "marth", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "carlyle", "sentiment": "none"}, {"name": "william s. marth", "sentiment": "none"}], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "albany", "sentiment": "none"}], "organizations": [{"name": "amri", "sentiment": "negative"}, {"name": "the carlyle group", "sentiment": "none"}, {"name": "sterigenics international", "sentiment": "none"}, {"name": "gtcr", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ALBANY, N.Y., Jan. 4, 2018 /PRNewswire/ -- AMRI, a global pharmaceutical contract research, development and manufacturing organization, today announced that Michael Mulhern has joined the company as chief executive officer, succeeding William S. Marth. Mr. Mulhern was previously chief executive officer of Sterigenics International, a leading global provider of contract sterilization, gamma technologies and medical isotopes. Mr. Marth will remain with the company in an advisory role. AMRI is a portfolio company of The Carlyle Group and GTCR.\nStephen H. Wise, managing director and global head of healthcare for Carlyle, said, \"Michael is a highly accomplished executive with a 30-year track record of value creation in the healthcare and distribution sectors. His role as a member of AMRI's board of directors, coupled with his experience leading three private equity-backed companies, will make this a smooth transition.\"\nDean Mihas, managing director and head of healthcare for GTCR, said, \"We thank Bill for his years of successful leadership of AMRI. Since joining the board of directors in 2012 and becoming CEO in 2014, Bill has been instrumental in building AMRI into a leading contract research, development and manufacturing organization. We wish him success in his future endeavors.\"\nMr. Mulhern said, \"I am excited to join AMRI and look forward to working with such a talented group of professionals around the world to make a great company even better. I believe a cohesive, integrated AMRI will better enable us to serve our global customers. Bill and his team have accomplished great things, and I look forward to leading AMRI through its next phase of growth.\"\nSince 2002, Mr. Mulhern has been CEO of three companies backed by GTCR – Sterigenics International, Fairmont Food Group, and American Sanitary – where he established a track record of product development, operational excellence, quality customer service and global growth. He previously held roles at Baxter International and Alliant Foodservice. Mr. Mulhern earned his B.A. in economics from Pennsylvania State University.\nAbout AMRI\nAMRI, a global contract research and manufacturing organization, partners with the pharmaceutical and biotechnology industries to improve patient outcomes and quality of life. With locations in North America, Europe and Asia, AMRI's team combines scientific expertise and market-leading technology to provide a complete suite of solutions in Discovery, Development, Analytical and Solid State Services, API Manufacturing and Drug Product. For more information about AMRI, visit https://www.amriglobal.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/amri-names-michael-mulhern-as-chief-executive-officer-300577662.html\nSOURCE AMRI", "external_links": ["http://www.prnewswire.com/news-releases/amri-names-michael-mulhern-as-chief-executive-officer-300577662.html", "https://www.amriglobal.com/"], "published": "2018-01-04T22:00:00.000+02:00", "crawled": "2018-01-04T22:52:32.003+02:00", "highlightTitle": ""}