{"organizations": [], "uuid": "c67b2824311217d185d8a00e2c2045ebe6678d6b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 15, "shares": 15, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/10/13/104016947-GettyImages-524092780.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/alaweed-story-shows-saudi-crown-prince-is-in-control-commentary.html", "country": "US", "domain_rank": 767, "title": "Alaweed story shows Saudi Crown Prince is in control—Commentary", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.151, "site_type": "news", "published": "2018-01-31T00:02:00.000+02:00", "replies_count": 0, "uuid": "c67b2824311217d185d8a00e2c2045ebe6678d6b"}, "author": "Jake Novak", "url": "https://www.cnbc.com/2018/01/30/alaweed-story-shows-saudi-crown-prince-is-in-control-commentary.html", "ord_in_thread": 0, "title": "Alaweed story shows Saudi Crown Prince is in control—Commentary", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Billionaire Saudi Prince Alwaleed bin Talal is now free from his more than two-month confinement in Riyadh.\nAlwaleed must be relieved, but the real winner here is the guy who's been getting his way with startling speed and regularity for the last ten months: Crown Prince Muhammad bin Salman.\nThe clearest sign of bin Salman's victory is his cousin's very conciliatory words and insistence that his forced confinement was comfortable and all the result of a misunderstanding.\nNo harm, no foul, right?\nBut no matter how luxurious we may imagine his confinement to have been at the Riyadh Ritz-Carlton, Alwaleed is simply not the same man he was when he arrived. In a videotaped interview just before his release, the billionaire insisted he was treated well. He added that reports of torture and a move to an actual prison were not true. But in that same video, the reportedly richest man in the Arab world looks visibly thinner and grayer.\nThe big question the financial world wants answered is whether the prince is also significantly lighter in the wallet. The last published reports before his release said that the Saudi government wanted $6 billion from Alwaleed in return for his release .\nFayez Nureldine | AFP | Getty Images Saudi Defense Minister and Deputy Crown Prince Mohammed bin Salman gestures during a press conference in Riyadh, on April 25, 2016. The government does say that overall it has seized a portion of the $100 billion worth of total funds it believes has been acquired through \"systemic corruption and embezzlement\" by about 200 princes and other high ranking officials.\nPerhaps we'll never know whether Alwaleed coughed up the full $6 billion. CNBC wealth reporter Robert Frank estimates Alwaleed's wealth was at $17 billion before his confinement. If his wealth has taken a multi-billion-dollar hit, the financial world will know soon enough.\nBut we already know that Crown Prince bin Salman doesn't seem to have paid any price for detaining so many of his country's most prominent citizens without trial. What has continued is the almost complete lack of any significant outcry on behalf of Alwaleed even from his long list of supposed friends atop the business world.\nThe most likely reason for that silence isn't any dislike for Alwaleed, but tacit approval for bin Salman and what he's doing politically and culturally in his country and the region.\nOver just the last 10 months, bin Salman has achieved milestone after milestone on his way to becoming the most powerful person in Saudi Arabia.\nHe met with President Donald Trump in the White House last March, and organized the president's trip to Saudi Arabia in May. A month later, the king named bin Salman the new crown prince.\nIn September, bin Salman significantly boosted his stature in the region when he reportedly secretly visited Israel to discuss Iran and other cooperative measures. Next, he began a purge of anti-American and anti-Jewish Islamic clerics. Finally, he carried out this mass arrest and financial confiscation project.\nAll of this has occurred without Saudi Arabia breaking out into civil war, riots, or even mass protests. There has been not a peep from any key Saudi allies or international governing bodies like the U.N.\nThat silence has a lot to do with the fact that bin Salman is holding an almost unbeatable political hand at the moment. His marshalling of forces against Iran and his growing public friendship with Israel are solidifying his status with the Trump team.\nEurope is more allied with Iran, but even the European powers don't want to see Iran totally dominating the region. There is also more universal approval of the reforms Bin Salman is making against extremist clerics and the added rights he's securing for women.\nHis financial hand is strong as the impending IPO for Saudi Aramco has much of the investment world angling to get a piece of the action. The world's top investment firms all want to underwrite the deal. The world's leading stock exchanges want the primary IPO listing. Advantage: bin Salman.\nThis sure seems like a classic \"ends justify the means\" argument. The world should support the crown princes' friendship with Israel and his internal reforms against extremism. In the Arab world, these kinds of cultural changes often only come at the result of much more bloody and destructive civil wars. Jailing or expelling some radical clerics and detaining 200 rich princes and officials in a nice hotel seem far more palatable for obvious reasons.\nThe Trump administration isn't objecting. The Democrats aren't objecting. The rest of the Arab world isn't really objecting. Only Iran remains a steadfast enemy of the Saudis, and that was true even before bin Salman was born.\nAs it stands now, Saudi Arabia's de facto leader must be more emboldened than ever. The question is whether he'll use his increasing power to make more relatively bloodless and popular moves, or take his hawkish anti-Iranian stance to a more violent level that the rest of the world isn't as ready to follow.\nCommentary by Jake Novak, CNBC.com senior columnist. Follow him on Twitter @jakejakeny .\nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": [], "published": "2018-01-31T00:02:00.000+02:00", "crawled": "2018-01-31T00:08:56.003+02:00", "highlightTitle": ""}