{"organizations": [], "uuid": "2dac52e15e726bd10da1a0c3924edbe798f939cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/11/104941236-image1r.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/11/5-tips-before-you-buy-or-sell-a-home-in-cryptocurrency.html", "country": "US", "domain_rank": 767, "title": "5 tips before you buy or sell a home in cryptocurrency", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.376, "site_type": "news", "published": "2018-01-11T20:45:00.000+02:00", "replies_count": 0, "uuid": "2dac52e15e726bd10da1a0c3924edbe798f939cc"}, "author": "Diana Olick", "url": "https://www.cnbc.com/2018/01/11/5-tips-before-you-buy-or-sell-a-home-in-cryptocurrency.html", "ord_in_thread": 0, "title": "5 tips before you buy or sell a home in cryptocurrency", "locations": [], "entities": {"persons": [{"name": "diana olick", "sentiment": "none"}, {"name": "tony giordano", "sentiment": "none"}, {"name": "giordano", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "cnbc tony giordano  real", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Real estate agent Tony Giordano knows high-end real estate, and he has made it his business to know cryptocurrencies, because that is fast becoming his business. The crypto craze has made new millionaires, many of whom are looking for ways to reinvest their gains. Real estate is a logical, less volatile asset.\nSo Giordano, who specializes in the luxury real estate market, is more often than not traveling from his home base in Los Angeles to real estate conferences around the nation, teaching other agents how to deal in cryptocurrencies. The requests are coming in faster and faster.\n\"What I'm trying to teach agents is, do your research if you want to invest in it, but regardless of the investment side, this is a real currency and you'd better learn it and understand it,\" said Giordano. \"They're not realizing, it's here now as a currency to be used in the purchase and sale of a property.\"\nGiordano has already closed several cryptocurrency home sales. He now asks every one of his seller clients of a high-end home if he or she would be willing to accept any currency. The strategy is simple: The more options for the buyer, the more potential buyers, especially on the high end, where buyers often want to fly under the radar and avoid tax issues. Cryptocurrencies are still largely unregulated.\n\"That's our job in marketing property, especially luxury real estate,\" said Gioradano. \"Never assume where the buyer is going to come from. Make sure we get this property out there and say we are open to all currencies and crypto being one of them.\"\nNationwide there are already a few hundred listings that mention cryptocurrencies as an option for buyers.\nThese are Tony's tips for buyers and sellers:\nResearch : Sellers need to really take the time to learn and understand it. Cryptocurrency YouTube videos can really help. Understand : Stop thinking only about the investment side of it. It's a real currency regardless of its value (bubble or no bubble) that people can buy or sell real estate with. Hire an expert : Sellers need to make sure the agent they are interviewing to list their property is very familiar and experienced with a crypto transaction. Practice/learn : Download a cryptocurrency app (like Coinbase) and buy $20 of a bitcoin to start to understand how to buy it and then sell it back and exchange it to USD again. Keep up to date with all the main cryptocurrencies. Not just bitcoin. You want to watch bitcoin cash, ethereum, lite coin, ripple, etc.", "external_links": [], "published": "2018-01-11T20:45:00.000+02:00", "crawled": "2018-01-11T21:00:18.007+02:00", "highlightTitle": ""}