{"organizations": [], "uuid": "32532e32f15390d5937ab671035fb8e59bbc987b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218810925&w=1200&r=LYNXMPEE010KA", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-olympics-2018-alps-blueriband/alpine-skiing-speed-merchants-still-kings-of-the-hill-idUKKBN1ER112", "country": "US", "domain_rank": 408, "title": "Alpine skiing - Speed merchants still kings of the hill", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T15:46:00.000+02:00", "replies_count": 0, "uuid": "32532e32f15390d5937ab671035fb8e59bbc987b"}, "author": "", "url": "https://uk.reuters.com/article/uk-olympics-2018-alps-blueriband/alpine-skiing-speed-merchants-still-kings-of-the-hill-idUKKBN1ER112", "ord_in_thread": 0, "title": "Alpine skiing - Speed merchants still kings of the hill", "locations": [], "entities": {"persons": [{"name": "patrizia kummer", "sentiment": "none"}, {"name": "alan baldwin", "sentiment": "none"}, {"name": "atle skaardal", "sentiment": "none"}], "locations": [{"name": "norway", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "rosa khutor", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 1:20 PM / Updated 21 minutes ago Alpine skiing - Speed merchants still kings of the hill Alan Baldwin 5 Min Read \nLONDON (Reuters) - Olympic downhills have a special allure, with the fastest and bravest Alpine skiers going full tilt for gold and a place in history. FILE PHOTO: Switzerland's Patrizia Kummer celebrates in the finish area after winning the gold medal in the women's snowboard parallel giant slalom finals at the 2014 Sochi Winter Olympic Games in Rosa Khutor February 19, 2014. REUTERS/Mike Blake/File Photo \nPyeongchang will see no change there but newer events more targeted at millennials and younger audiences may be muscling in on the limelight enjoyed by the traditional blue riband races. \nThe mixed team event, run already at world championships and featuring male and female skiers in a parallel slalom format with races lasting some 25 seconds, should be a hit on its Olympic debut. \n“I think it will be one of the highlights of the Olympics,” women’s Alpine race director Atle Skaardal, a two times men’s Super-G world champion for Norway, said before the season started. \nFreestyle skiing, slopestyle and big air snowboarding -- another eye-catching 2018 Olympic newcomer -- have the added appeal of proving more accessible to skiers from non-Alpine nations. \nTraditional Alpine skiing has been woven into the fabric of the Games since 1936, even if the men’s downhill did not appear until 1948, and a core element for broadcasters and the commercial sector alike. \nThat remains the case, despite the increasing range of media platforms and fragmentation of the audience as a whole. \n“Alpine is always going to be the blue riband,” Matt Humphreys, winter sports boss at the UK division of ski suppliers Head told Reuters. \n”When you look at these other events like slopestyle, skicross, the younger sports, they do capture the imagination probably a little bit better than Alpine because it’s newer and fresher. \n“But ... I think it’s always going to be the Alpine that wins out.” DANGEROUS AND DAUNTING \nReflecting its big ticket status, the men’s downhill will be held on the opening Sunday of the Games at the Jeongseong Alpine centre. \nAbout as extreme as it gets, the dangerous and daunting discipline sees racers hurtling in excess of 130kph down the mountain -- and the winner often a surprise from far down the list of favourites. \nFor U.S. audiences the women’s race on Feb. 21 could be an even bigger deal than the men‘s, with American speed queen Lindsey Vonn and all-rounder Mikaela Shiffrin two of the more recognisable names on the slopes. FILE PHOTO: Croatia's Ivica Kostelic goes airborne during the downhill run of the men's alpine skiing super combined event at the 2014 Sochi Winter Olympics at the Rosa Khutor Alpine Center February 14, 2014. REUTERS/Stefano Rellandini/File Photo \nVonn, the most successful women’s World Cup ski racer of all-time with a record 78 victories, has a portfolio of sponsors that includes Under Armour, Red Bull and Head and was ranked by Forbes as the third highest earning athlete at the 2010 Vancouver Olympics. \nNBC television said Pyeongchang, 14 hours ahead of U.S. Eastern Time (ET), will be their “most live primetime” Winter Games yet and live Alpine skiing will feature on 11 of the 18 nights. \nThe U.S. network has already reported increased viewing figures for the North American rounds of the World Cup season. \nEurosport Chief Executive Peter Hutton said his broadcaster was also seeing increased viewing figures across snow sports, with all the Olympic competitions to be available on mobile devices. \n“Sports such as snowboarding are doing a great job to attract younger audiences,” he added. \nEurosport will also, for the first time, have a dedicated ‘Radical Van’ mobile social media studio at the PyeongChang Snowpark and other venues to cater for new audiences. \nThe growth of the newer sports, however, was not cannibalising the traditional Alpine events and was in fact benefiting them, according Rob Prazmark, founder and chief executive of 21 Sports and Entertainment Marketing Group. \n“That’s a good thing, for the Olympic Winter Games, that they are able to change up the sport to appeal to a younger and a different demographic,” he told Reuters in a telephone interview. \n”I think interest in Alpine grows because of the addition of different or extreme sports -- or sports that are really most popular with a younger demographic. The whole business of Alpine is growing. \n“Downhill Alpine is still extreme,” added Prazmark, who has been involved in every Olympics since 1984 as a consultant and rights negotiator. \nThat said, he was aware from his own family how the recreational landscape was changing. \n“I’ve got four kids. They run in ages from 34 to 21. My 21-year-old has never been on skis. She’s only been on a snowboard,” he said. \n”And she doesn’t quite understand the attraction of skis. \n”So that’s where there’s a big shift into the extreme sports, I believe. \n“It’s a generational, millennial thing as well.” Additional reporting by Mark Trevelyan, editing by Greg Stutchbury", "external_links": [], "published": "2018-01-02T15:46:00.000+02:00", "crawled": "2018-01-02T16:03:21.000+02:00", "highlightTitle": ""}