{"organizations": [], "uuid": "a5e743ac7c6aeba91ac603ed5f1f1bc8dc9864b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-mccann-health-promotes-june-laffey-to-chief-creative-officer-in-ny.html", "country": "US", "domain_rank": 767, "title": "McCann Health Promotes June Laffey To Chief Creative Officer in NY", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.015, "site_type": "news", "published": "2018-01-26T18:30:00.000+02:00", "replies_count": 0, "uuid": "a5e743ac7c6aeba91ac603ed5f1f1bc8dc9864b2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/pr-newswire-mccann-health-promotes-june-laffey-to-chief-creative-officer-in-ny.html", "ord_in_thread": 0, "title": "McCann Health Promotes June Laffey To Chief Creative Officer in NY", "locations": [], "entities": {"persons": [{"name": "mccann worldgroup", "sentiment": "negative"}, {"name": "mccann humancare", "sentiment": "none"}, {"name": "jeremy perrott", "sentiment": "none"}, {"name": "mccann health", "sentiment": "none"}, {"name": "june laffey", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "mccann health", "sentiment": "negative"}, {"name": "hcp and consumer health & wellness", "sentiment": "none"}, {"name": "mccann health new york", "sentiment": "none"}, {"name": "mccann healthcare", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, McCann Health, part of McCann Worldgroup, and winner of an unprecedented total of three Network of the Year titles from the industry's top three creative award shows in 2017, today announced the appointment of June Laffey to the new position of Executive Vice President, Chief Creative Officer, McCann Health New York. McCann Health New York, comprised of McCann HumanCare and McCann Healthcare, provides consolidated integrated communications solutions for HCP and Consumer Health & Wellness clients across all channels and audiences – from consumers to physicians.\nThis new leadership appointment in New York follows impressive growth over the last three years with McCann HumanCare more than tripling in size, and McCann Healthcare gaining a more diversified business portfolio and becoming one of the most awarded agencies in the healthcare arena.\nJeremy Perrott, Global Chief Creative Officer for McCann Health said, \"June's passion and love for this business is infectious. Her reputation as team builder, team player, collaborator, mentor and business builder go before her. But it's her creative ability to deliver consistently award-winning solutions for big and small clients, for complex brands in Rx and consumer, that her reputation comes to life. I'm excited to have June at McCann Health New York to lift the creative product even higher and build on the agency's very successful growth.\"\nJune has served as Regional Executive Creative Director for McCann Health Australia & Southeast Asia since 2016. She was Chairman of the Pharma Jury for 2017 Cannes Lions Health and also holds the distinction of being the most awarded female creative leader in the history of McCann Worldgroup Asia Pacific. She will move to New York from Sydney, Australia and take up her new post in early February.\nI've had the pleasure of working closely with June during my tenure in APAC and she is an absolute power house of creativity and talent,\" said Amar Urhekar, President, McCann Health Americas. \"I'm looking forward to welcoming June in her new role in NY and as a part of the senior leadership team across MHNA.\"\n\"I am absolutely thrilled to partner with such a word-class creative leader as June in order to take our integrated creative offering to the next level,\" said Leo Tarkovsky, President McCann Health NY. \"Together, we will strive to offer breakthrough ideas to our clients that will enable them to transform their businesses and win in the highly cluttered and competitive health and wellness category of today and tomorrow.\"\n\"I am feeling blessed and humbled at this amazing opportunity with the McCann family,\" said Ms. Laffey. \"For me, coming to New York means new beginnings and a new opportunity to make a difference with ideas that can change, empower and even save lives. Most of all, I look forward to building and creating an environment where innovation and creativity thrive in a vibrant, IdeaCentric culture.\"\nJune joined McCann Health in 2010 as Executive Creative Director, McCann Health Sydney, and under her leadership the agency quickly became the most awarded healthcare agency in the APAC region. During her nearly eight years with the network, she earned a reputation for being a great team-builder and consistently producing world-class award-winning work: work that gets recognized not just locally, but regionally and globally as well.\nJune is in high demand on the international judging circuit, and has been invited to judge in all the industry's top award shows. She served as the inaugural Jury Chair at the Spikes Asia award show and Clio Health. She is known for bringing passion, integrity, and love into every jury room she enters. June's mantra is that \"everybody is creative\", and she passionately believes in the power of teamwork.\nJune has won Gold at Lions Health and Spikes, and multiple awards at the Global Awards, Clio Health, One Show, IPA awards, Campaign AOY, and The Creative Floor.\nAbout McCann Health\nMcCann Health , two-time Network of the Year winner at Cannes Lions Health, and winner of an unprecedented total of three Network of the Year titles from the industry's top three creative award shows in 2017, is one of the world's most awarded global healthcare communications companies. McCann Health, consisting of a global creative agency network, a global medical communications network and a global consulting group, specializes in a wide array of professional, consulting and consumer health and wellness practices. McCann Health is part of McCann Worldgroup and the Interpublic Group (NYSE: IPG).\nView original content: http://www.prnewswire.com/news-releases/mccann-health-promotes-june-laffey-to-chief-creative-officer-in-ny-300588733.html\nSOURCE McCann Health", "external_links": ["http://www.mccannhealth.com/", "http://www.prnewswire.com/news-releases/mccann-health-promotes-june-laffey-to-chief-creative-officer-in-ny-300588733.html"], "published": "2018-01-26T18:30:00.000+02:00", "crawled": "2018-01-26T20:03:56.002+02:00", "highlightTitle": ""}