{"organizations": [], "uuid": "47dabb1cc7328619876f0897288c8f9ed913e199", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/healthNews\r", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-health-cancer-contraceptive-pill/lower-risk-of-certain-cancers-with-the-pill-applies-across-lifestyles-idUSKBN1FJ2WN", "country": "US", "domain_rank": 408, "title": "Lower risk of certain cancers with the Pill applies across lifestyles", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T23:14:00.000+02:00", "replies_count": 0, "uuid": "47dabb1cc7328619876f0897288c8f9ed913e199"}, "author": "", "url": "https://www.reuters.com/article/us-health-cancer-contraceptive-pill/lower-risk-of-certain-cancers-with-the-pill-applies-across-lifestyles-idUSKBN1FJ2WN", "ord_in_thread": 0, "title": "Lower risk of certain cancers with the Pill applies across lifestyles", "locations": [], "entities": {"persons": [{"name": "lisa rapaport", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "jama oncology", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 9:18 PM / in 4 minutes Lower risk of certain cancers with the Pill applies across lifestyles Lisa Rapaport 5   use oral contraceptives for at least a decade may be less likely to develop ovarian or endometrial malignancies, and this benefit doesn’t seem to be diminished by other lifestyle risk factors, a U.S. study suggests. \nIn fact, the risk-lowering effect of long-term birth control pill use was greatest for endometrial cancers among women who had other lifestyle risk factors like obesity, smoking and lack of exercise, researchers report in JAMA Oncology. \nCompared to women who used oral contraceptives for a year or less, women who took the Pill for at least 10 years were 40 percent less likely to develop ovarian cancer and 35 percent less likely to develop endometrial tumors, the study found. Among smokers, the endometrial cancer risk was 53 percent lower, among obese women it was 64 percent lower and among those who rarely exercised it was 60 percent lower with long-term Pill use. \n“Our study demonstrates that oral contraceptive use is beneficial for the prevention of ovarian and endometrial cancers for women with different underlying risks for these diseases,” said lead study author Kara Michels, a researcher at the National Cancer Institute in Bethesda, Maryland. \nWhile some previous research has linked oral contraceptives to a lower risk of ovarian, endometrial and colorectal tumors, the strength of this evidence has been mixed and left an incomplete picture of how other factors like smoking, drinking, inactivity or obesity might influence this connection, the study authors note. \nFor the current study, they examined data on 118,144 women who never used oral contraceptives as well as 34,866 women who took them for 1 to 4 years; 25,564 women who used them for 5 to 9 years; and 18,962 who were on the Pill for at least a decade. \nHalf of the women were at least 62 years old when they joined the study, and most of them had already gone through menopause and no longer required contraception, but they reported any previous contraceptive use. \nCompared with women who used birth control pills for a year or less, long-term users were more likely to be younger and premenopausal, to have completed more years of education and to drink alcohol. Long-term birth control users were also less likely to be overweight or obese, which can independently increase the risk of certain cancers. \nOverall, the study included 149,504 women who didn’t get ovarian cancer and 1,241 women who did. \nAmong non-smokers, long-term birth control users were 45 percent less likely to get ovarian cancer than women who used these contraceptives for less than a year. For current smokers, however, long-term use of birth control pills was associated with 56 percent lower odds of ovarian cancer. \nLong-term birth control users who were a healthy weight had a 45 percent lower risk of ovarian cancer than women only on the Pill briefly, if ever. Obese women who took the pill for at least a decade had 36 percent lower odds of developing ovarian tumors. \nOverall, the study didn’t find an increased risk of breast cancer   control pills, except among women who were current smokers or regular drinkers and took oral contraceptives for at least a decade. \nThe study also found no connection between colorectal cancer and oral contraceptives. \nEven so, the results provide fresh evidence that the potential for birth control pills to offer long-lasting protection against certain cancers, said Victoria Cortessis, a researcher at the Keck School of Medicine at the University of Southern California in Los Angeles. \n“Women can continue to have confidence in earlier studies - and there are many - reporting that occurrence of both ovarian cancer and endometrial cancer has been lower in groups of women who used oral contraceptives, compared to groups who did not,” Cortessis, who wasn’t involved in the study, said by email. \n“Earlier research showed that this apparent benefit likely endures even after women stop taking the pills,” Cortessis added. “What remains to be learned is which specific women are likely to benefit in this way if they use oral contraceptives.” \nSOURCE: bit.ly/2E04MJL JAMA Oncology, online January 18, 2018.", "external_links": [], "published": "2018-01-30T23:14:00.000+02:00", "crawled": "2018-01-30T23:32:04.024+02:00", "highlightTitle": ""}