{"organizations": [], "uuid": "b5511746a52642a2f86ecee99c4148266c4df7f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224030186&w=1200&r=LYNXMPEE0L06K", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-japan-stocks-retailinvesotrs/japanese-retail-investors-pull-out-of-bear-fund-as-nikkei-hits-26-year-peak-idUSKBN1FB0A5", "country": "US", "domain_rank": 408, "title": "Japanese retail investors pull out of bear fund as Nikkei hits 26-year peak", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T05:08:00.000+02:00", "replies_count": 0, "uuid": "b5511746a52642a2f86ecee99c4148266c4df7f5"}, "author": "", "url": "https://www.reuters.com/article/us-japan-stocks-retailinvesotrs/japanese-retail-investors-pull-out-of-bear-fund-as-nikkei-hits-26-year-peak-idUSKBN1FB0A5", "ord_in_thread": 0, "title": "Japanese retail investors pull out of bear fund as Nikkei hits 26-year peak", "locations": [], "entities": {"persons": [{"name": "yoshiyuki osada", "sentiment": "none"}], "locations": [{"name": "tokyo", "sentiment": "none"}], "organizations": [{"name": "nomura", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "nikkei", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TOKYO (Reuters) - Japanese retail investors are pulling out of a popular bear market fund as a rally in the benchmark Nikkei index to 26-year highs prompts many market participants to ditch their contrarian strategies.\nThe fund is designed to pay investors two times the opposite of the Nikkei benchmark index’s daily return, by making short positions in Nikkei futures. So if the Nikkei falls 1 percent, the inverse ETF rises 2 percent and if the Nikkei rises 2 percent, the inverse ETF falls 4 percent.\nThe net asset value of Nomura’s Next Funds Nikkei 225 Double Inverse Index ETF, dropped almost 24 percent to 150.1 billion yen ($1.37 billion) last week from a record peak of 196.3 billion yen set on Oct. 31.\nThat drop was a major shift from the pattern until late last year. Whenever the Nikkei had risen, investors had increased buying in the inverse ETF, whose value rises when the Nikkei falls.\nThe bear fund was very popular with individual Japanese speculators.\nThat trend appears to have changed on Nov. 9, when foreign investors poured in money to buy Japanese stocks on the back of strong earnings out of Japan Inc. firms, pushing the Nikkei average above 23,000 for the first time since 1992.\n“Those retail investors who had bought the double inverse ETF since September made a lot of losses in November, when stocks rose even higher,” said Tomoichiro Kubota, senior market analyst at Matsui Securities.\nSince then, they have become very cautious about taking short positions, Kubota said, noting that margin selling of individual shares, another way to bet on a decline in stock prices, has not increased either.\nAccording to data compiled by the Tokyo Stock Exchange, the outstanding margin sell position for the Tokyo and Nagoya bourses in total dropped to 978.1 billion yen as of Jan. 12, compared to about 1.1 trillion yen hit in late October.\nBut the swing away from contrarian bets has not necessarily translated into an increase in bullish positions on the Nikkei by Japanese investors.\nThe bull version of Nomura’s leveraged ETF, Next Funds Nikkei 225 Leveraged Index ETF, saw its net asset value falling 2.7 percent so far this year despite rise in the Nikkei.\nThe ETF is designed to give investors twice the return of the daily moves in the Nikkei average and is by far the most traded ETF in the Tokyo Stock Exchange.\nMatsui Securities’ Kubota said investors have found it difficult to find a good chance to buy because the market is supported by the central bank’s ETF buying, offering limited opportunities for bargain-hunting.\nReporting by Yoshiyuki Osada; Writing by Ayai Tomisawa; Editing by Hideyuki Sano and Sam Holmes\n ", "external_links": [], "published": "2018-01-22T05:08:00.000+02:00", "crawled": "2018-01-22T05:43:30.000+02:00", "highlightTitle": ""}