{"organizations": [], "uuid": "c58811f8eb2413ddb8270e3cb72a846082b7af28", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220848936&w=1200&r=LYNXMPEE090Y0", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-california-mudslides/california-mudslide-death-toll-up-to-15-as-rescues-continue-idUKKBN1EZ1TM", "country": "US", "domain_rank": 408, "title": "Fifteen confirmed dead in California mudslide, more casualties feared", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T17:57:00.000+02:00", "replies_count": 0, "uuid": "c58811f8eb2413ddb8270e3cb72a846082b7af28"}, "author": "", "url": "https://uk.reuters.com/article/uk-california-mudslides/california-mudslide-death-toll-up-to-15-as-rescues-continue-idUKKBN1EZ1TM", "ord_in_thread": 0, "title": "Fifteen confirmed dead in California mudslide, more casualties feared", "locations": [], "entities": {"persons": [{"name": "ellen degeneres", "sentiment": "none"}, {"name": "alex dobuzinskis", "sentiment": "none"}, {"name": "oprah winfrey", "sentiment": "none"}, {"name": "yaneris muniz", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "santa barbara", "sentiment": "none"}], "organizations": [{"name": "fifteen", "sentiment": "negative"}, {"name": "los padres national forest", "sentiment": "none"}, {"name": "min read  los angeles", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "santa barbara county joint information center", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 2:43 PM / Updated 22 minutes ago California mudslides kill 15, more feared dead in deluge Alex Dobuzinskis 5 Min Read \nLOS ANGELES (Reuters) - Rescue crews with dogs and scanners dug through waist-deep mud in an affluent stretch of California’s coast on Wednesday, hunting for up to two dozen people missing after mudslides swept through the coastal community and killed at least 15. \nThe mudslides in Santa Barbara County resulted from a downpour on Tuesday damaged historic hotels and the homes of celebrities, including Oprah Winfrey, drawn to the area sandwiched between the ocean and the sprawling Los Padres National Forest, by its natural beauty and proximity to sprawling Los Angeles. \nBut the verdant hillsides that once gave their estates a sense of seclusion were largely denuded by last month’s historic wildfires. That set the stage for the massive slides that sent boulders crashing into homes, turned highways into raging rivers and shredded cars into nearly unrecognizable tangles of metal. \n“The water was moving at 15 miles an hour (24 km per hour), taking everything in its wake, dropping boulders and debris, clogging culverts, knocking out pipes,” state Senator Hannah-Beth Jackson, who has friends in the area who are missing, said in a phone interview. \nBetween 12 and 24 people who were believed to be in the area of Montecito, near Santa Barbara, at the time of the slides remained unaccounted for, said Chris Elms, a spokesman for state firefighters. About 500 law enforcement officers and firefighters were combing mud-covered neighborhoods, using dogs, helicopters and thermal imaging equipment. \n“We are still very much in active search-and-rescue mode,” Elms said in a phone interview, warning that the current death toll of 15 confirmed fatalities could rise. “That’s a fear. We are still very hopeful that we will locate people alive.” \nMore rescuers were heading out into the field on Wednesday, to replace those who had worked through the night. \nFires smoldered in the wreckage of some houses pounded by the slides. \nAt the Pepper’s Estate historic mansion in Montecito, staff members were struggling to get by without gas or electricity, owner David Sullins said by telephone. \n“No one can leave the house, they (the authorities) don’t even want you to leave your own property, for security,” Sullins said. \nOfficials have ordered residents in a large swath of Montecito to stay in their homes so that rescuers can better go about their work. Emergency personnel evacuate local residents and their dogs through flooded waters after a mudslide in Montecito, California. Kenneth Song/Santa Barbara News-Press via REUTERS \nSanta Barbara County initially ordered 7,000 residents to evacuate and urged another 23,000 to do so voluntarily, but only 10 to 15 percent complied with mandatory orders, said Amber Anderson, a spokeswoman for the county fire department. \nAbout 300 people were stranded in a canyon. Local rescue crews were using helicopters to airlift them out, officials said. \nREAGAN‘S PLAYGROUND Slideshow (3 Images) \nThe area has long attracted California’s elite; former President Ronald Reagan and pop star Michael Jackson both owned ranches in the hills near Santa Barbara. \nThe mudslides closed several historic hotels, including The Four Seasons Biltmore, which had just reopened on Monday after repairing wildfire damage. The courtyard of the 90-year-old Montecito Inn, built by silent movie actor Charlie Chaplin, was filled with a thick crust of debris driven by the slides. \nThe disaster followed a violent rainstorm that dropped as much as 6 inches (15 cm) of precipitation in pockets northwest of Los Angeles, soaking ground that was left vulnerable after much of its vegetation burned last month. \nMedia mogul Oprah Winfrey posted videos on Instagram showing her wading through nearly knee-deep mud on her Montecito property and later inspecting the damage. \n“There used to be a fence right here. That’s my neighbor’s house. Devastated,” Winfrey said as she stood, surrounded by debris. \nA 14-year-old girl was found alive on Tuesday after firefighters using rescue dogs heard cries for help from what was left of her Montecito home, the Los Angeles Times reported. \nThe number of fatalities surpassed the death toll from a California mudslide on Jan. 10, 2005, when 10 people were killed as a hillside gave way in the town of La Conchita, less than 20 miles (30 km) south of the latest disaster. \nLast month’s wildfires, including the Thomas Fire, which became the largest in California history, not only burned away grass and shrubs that held soil in place, but also baked a waxy layer into the earth that prevents water from sinking deeply into the ground. Additional reporting by Sharon Bernstein in Sacramento, Peter Szekely in New York, Rich McKay in Atlanta and Brendan O'Brien in Milwaukee; Writing by Scott Malone; Editing by Jonathan Oatis and Chris Reese", "external_links": [], "published": "2018-01-10T17:57:00.000+02:00", "crawled": "2018-01-10T18:16:59.005+02:00", "highlightTitle": ""}