{"organizations": [], "uuid": "7e3f13d50c521fb4b963d6428d4c8731559d68ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222769660&w=1200&r=LYNXMPEE0G18W", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-figureskating-europe-fernandez/holder-fernandez-leads-at-europeans-after-short-program-idUSKBN1F623J", "country": "US", "domain_rank": 408, "title": "Holder Fernandez leads at Europeans after short program", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T18:09:00.000+02:00", "replies_count": 0, "uuid": "7e3f13d50c521fb4b963d6428d4c8731559d68ab"}, "author": "", "url": "https://www.reuters.com/article/us-figureskating-europe-fernandez/holder-fernandez-leads-at-europeans-after-short-program-idUSKBN1F623J", "ord_in_thread": 0, "title": "Holder Fernandez leads at Europeans after short program", "locations": [], "entities": {"persons": [{"name": "fernandez", "sentiment": "negative"}, {"name": "brian orser", "sentiment": "none"}, {"name": "javier fernandez", "sentiment": "none"}, {"name": "dmitri aliev", "sentiment": "none"}], "locations": [{"name": "pyeongchang", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 4:13 PM / Updated 35 minutes ago Holder Fernandez leads at Europeans, French pair upset Russian rivals Gabrielle Tetrault-Farber 3 Min Read \nMOSCOW (Reuters) - Spain’s Javier Fernandez stumbled on a quad Salchow but still took the lead after the short program at the European figure skating championships on Wednesday before French duo Vanessa James and Morgan Cipres upset their Russian rivals in the pairs. \nFernandez, a twice world champion who is bidding to win a sixth consecutive European title, beautifully executed a quad toe loop-triple toe loop combination at the start but was unstable on the quad Salchow. \nHe finished with 103.82 points, more than 12 points ahead of Russia’s second-placed Dmitri Aliev. \n“We were not looking for perfection,” Fernandez, 26, told reporters. “We were looking to have one more practice before the Olympics. I think it was a good short program facing the big competition that is coming up. We’re happy.” \nFernandez’s coach Brian Orser was satisfied with the performance and said Fernandez should not be peaking at the European championships, with the Winter Olympics coming up in Pyeongchang next month. \n“I wanted him to skate well, but I didn’t want him to knock it out of the park right now,” Orser told reporters. \n“Not every jump has been perfect in recent weeks, which is fine. It also shows me that we’re peaking at the right time. And, as important as this event is for everybody, we have to be sure that we don’t peak here.” \nAliev skated a solid short program to earn 91.33 points, while Latvia’s Deniss Vasiljevs was third with 85.11 points. \nRussia’s Mikhail Kolyada, who finished third at last year’s European championships, came fourth after struggling with his jumps. He took a step and put his hand on the ice after his opening jump, a quad Lutz, and then struggled for composure. \n“I don’t know what happened,” Kolyada said, shrugging. RUSSIANS UPSET \nJames and Cipres, who won bronze at last year’s European championships, dominated the pairs with a dynamic performance that earned them 75.52 points. James, however, said they had not been at their best. \n“We normally skate a little more smoothly and liberated, a little bit faster, more in unison,” he told reporters. \nRussia’s Natalia Zabiiako and Alexander Enbert finished second with 72.95 points, while compatriots Ksenia Stolbova and Fedor Klimov finished third with 72.05 points after Stolbova fell on the triple toe loop. \nDefending European champions and fellow Russians Evgenia Tarasova and Vladimir Morozov finished a disappointing fifth after an error-strewn program. \nTarasova, whose eyes welled up with tears after the performance, put a hand down on her triple toe loop and fell on the throw triple loop, which cost the pair a spot in the top three. Reporting by Gabrielle Tétrault-Farber; Editing by Ken Ferris and Toby Davis", "external_links": [], "published": "2018-01-17T18:09:00.000+02:00", "crawled": "2018-01-17T18:26:32.010+02:00", "highlightTitle": ""}