{"organizations": [], "uuid": "56b23d2e35c5cf0a5fca15c0b4db73b3045d5672", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/pr-newswire-qualcomm-extends-cash-tender-offer-for-all-outstanding-shares-of-nxp.html", "country": "US", "domain_rank": 767, "title": "Qualcomm Extends Cash Tender Offer for All Outstanding Shares of NXP", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-12T15:30:00.000+02:00", "replies_count": 0, "uuid": "56b23d2e35c5cf0a5fca15c0b4db73b3045d5672"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/pr-newswire-qualcomm-extends-cash-tender-offer-for-all-outstanding-shares-of-nxp.html", "ord_in_thread": 0, "title": "Qualcomm Extends Cash Tender Offer for All Outstanding Shares of NXP", "locations": [], "entities": {"persons": [], "locations": [{"name": "san diego", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}], "organizations": [{"name": "qualcomm incorporated", "sentiment": "negative"}, {"name": "qualcomm", "sentiment": "negative"}, {"name": "river holdings b.v.", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "nxp semiconductors n.v.", "sentiment": "none"}, {"name": "nxp", "sentiment": "none"}, {"name": "american stock transfer & trust company", "sentiment": "none"}, {"name": "qualcomm river holdings b.v.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO, Jan. 12, 2018 /PRNewswire/ -- Qualcomm Incorporated (NASDAQ: QCOM) today announced that Qualcomm River Holdings B.V., an indirect wholly owned subsidiary of Qualcomm, has extended the offering period of its previously announced cash tender offer to purchase all of the outstanding common shares of NXP Semiconductors N.V. (NASDAQ: NXPI). The tender offer is being made pursuant to the Purchase Agreement, dated as of October 27, 2016, by and between Qualcomm River Holdings B.V. and NXP. The tender offer is now scheduled to expire at 5:00 p.m., New York City time, on February 9, 2018, unless extended or earlier terminated, in either case pursuant to the terms of the Purchase Agreement.\nAmerican Stock Transfer & Trust Company, LLC, the depositary for the tender offer, has advised Qualcomm River Holdings B.V. that as of 5:00 p.m., New York City time, on January 11, 2018, the last business day prior to the announcement of the extension of the offer, 5,695,728 NXP common shares (excluding 18,439 shares tendered pursuant to guaranteed delivery procedures that have not yet been delivered in settlement or satisfaction of such guarantee), representing approximately 1.7% of the outstanding NXP common shares, have been validly tendered pursuant to the tender offer and not properly withdrawn. Shareholders who have already tendered their common shares of NXP do not have to re-tender their shares or take any other action as a result of the extension of the expiration date of the tender offer.\nCompletion of the tender offer remains subject to additional conditions described in the tender offer statement on Schedule TO filed by Qualcomm River Holdings B.V. with the U.S. Securities and Exchange Commission on November 18, 2016, as amended (the \"Schedule TO\"). Such conditions include the receipt of regulatory approvals in certain non-U.S. jurisdictions and at least 80% of NXP's outstanding shares being validly tendered and not withdrawn prior to the expiration of the tender offer (including any extensions). The tender offer will continue to be extended until all conditions are satisfied or waived, or until the tender offer is terminated, in either case pursuant to the terms of the Purchase Agreement by and between Qualcomm River Holdings B.V. and NXP and as described in the Schedule TO. The transaction is expected to close in early 2018.\nInnisfree M&A Incorporated is acting as information agent for Qualcomm River Holdings B.V. in the tender offer. Requests for documents and questions regarding the tender offer may be directed to Innisfree M&A Incorporated by telephone, toll-free at (888) 750-5834 for shareholders, or collect at (212) 750-5833 for banks and brokers.\nAbout Qualcomm\nQualcomm's technologies powered the smartphone revolution and connected billions of people. We pioneered 3G and 4G – and now we are leading the way to 5G and a new era of intelligent, connected devices. Our products are revolutionizing industries, including automotive, computing, IoT, healthcare and data center, and are allowing millions of devices to connect with each other in ways never before imagined. Qualcomm Incorporated includes our licensing business, QTL, and the vast majority of our patent portfolio. Qualcomm Technologies, Inc., a subsidiary of Qualcomm Incorporated, operates, along with its subsidiaries, all of our engineering, research and development functions, and all of our products and services businesses, including, our QCT semiconductor business. For more information, visit Qualcomm's website, OnQ blog, Twitter and Facebook pages.\nAdditional Information and Where to Find It\nThis document is for informational purposes only and is neither an offer to purchase nor a solicitation of an offer to sell any common shares of NXP Semiconductors N.V. (\"NXP\") or any other securities. Qualcomm River Holdings B.V. (\"Buyer\"), an indirect, wholly owned subsidiary of Qualcomm Incorporated (\"Qualcomm\"), has filed a tender offer statement on Schedule TO, including an offer to purchase, a letter of transmittal, and related documents with the United States Securities and Exchange Commission (the \"SEC\") and NXP has filed a solicitation/recommendation statement on Schedule 14D-9 with the SEC with respect to the tender offer. The offer to purchase common shares of NXP is only being made pursuant to the offer to purchase, the letter of transmittal and related documents filed as a part of the Schedule TO, in each case as amended from time to time. THE TENDER OFFER MATERIALS (INCLUDING THE OFFER TO PURCHASE, THE RELATED LETTER OF TRANSMITTAL AND CERTAIN OTHER TENDER OFFER DOCUMENTS) AND THE SOLICITATION/RECOMMENDATION STATEMENT ON SCHEDULE 14D-9 CONTAIN IMPORTANT INFORMATION. SHAREHOLDERS OF NXP ARE URGED TO READ THESE DOCUMENTS, AS FILED AND AS MAY BE AMENDED FROM TIME TO TIME, CAREFULLY BECAUSE THEY CONTAIN IMPORTANT INFORMATION THAT SUCH HOLDERS SHOULD CONSIDER BEFORE MAKING ANY DECISION REGARDING TENDERING THEIR SHARES. Investors and security holders may obtain a free copy of these statements and other documents filed with the SEC at the website maintained by the SEC at www.sec.gov . In addition, free copies of these documents may be obtained by contacting Innisfree M&A Incorporated, the information agent for the tender offer, toll free at (888) 750-5834 (for shareholders) or collect at (212) 750-5833 (for banks and brokers).\nCautionary Note Regarding Forward-Looking Statements\nAny statements contained in this document that are not historical facts are forward-looking statements as defined in the U.S. Private Securities Litigation Reform Act of 1995. Words such as \"anticipate\", \"believe\", \"estimate\", \"expect\", \"forecast\", \"intend\", \"may\", \"plan\", \"project\", \"predict\", \"should\" and \"'will\" and similar expressions as they relate to Qualcomm, Buyer or NXP are intended to identify such forward-looking statements. These forward-looking statements involve risks and uncertainties concerning the parties' ability to complete the tender offer and close the proposed transaction, the expected closing date of the transaction, the financing of the transaction, the anticipated benefits and synergies of the transaction, anticipated future combined businesses, operations, products and services, and liquidity, debt repayment and capital return expectations. Actual events or results may differ materially from those described in this document due to a number of important factors. These factors include, among others, the outcome of regulatory reviews of the proposed transaction; the ability of the parties to complete the transaction; the ability of Qualcomm to successfully integrate NXP's businesses, operations (including manufacturing and supply operations), sales and distribution channels, business and financial systems and infrastructures, research and development, technologies, products, services and employees; the ability of the parties to retain their customers and suppliers; the ability of the parties to minimize the diversion of their managements' attention from ongoing business matters; Qualcomm's ability to manage the increased scale, complexity and globalization of its business, operations and employee base post-closing; and other risks detailed in Qualcomm's and NXP's filings with the SEC, including those discussed in Qualcomm's most recent Annual Report on Form 10-K and in any subsequent periodic reports on Form 10-Q and Form 8-K and NXP's most recent Annual Re", "external_links": ["http://www.prnewswire.com/news-releases/qualcomm-extends-cash-tender-offer-for-all-outstanding-shares-of-nxp-300581810.html"], "published": "2018-01-12T15:30:00.000+02:00", "crawled": "2018-01-12T15:54:08.000+02:00", "highlightTitle": ""}