{"organizations": [], "uuid": "fd2f3b73ac3c7fb1064f0a602a9193d69354d6ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-EX140_haiti__ZG_20161005043045.jpg", "site_section": "http://feeds.marketwatch.com/marketwatch/topstories?format=xml", "section_title": "MarketWatch.com - Top Stories", "url": "https://www.wsj.com/articles/trump-administration-shuts-haiti-out-of-seasonal-worker-program/", "country": "US", "domain_rank": 387, "title": "The Wall Street Journal: Trump administration shuts Haiti out of seasonal worker program", "performance_score": 0, "site": "wsj.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T15:59:00.000+02:00", "replies_count": 0, "uuid": "fd2f3b73ac3c7fb1064f0a602a9193d69354d6ea"}, "author": "", "url": "https://www.wsj.com/articles/trump-administration-shuts-haiti-out-of-seasonal-worker-program/", "ord_in_thread": 0, "title": "The Wall Street Journal: Trump administration shuts Haiti out of seasonal worker program", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "alicia a. caldwell  the trump", "sentiment": "none"}], "locations": [{"name": "haiti", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "port-au-prince", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}], "organizations": [{"name": "wall street journal", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published: Jan 18, 2018 9:02 a.m. ET Share \nRule tightening follows end to humanitarian program that allowed tens of thousands of Haitians to live and work in U.S. Getty Images A man removes the garbage in a flooded street in the Haitian capital Port-au-Prince after Hurricane Matthew in 2016. The government notice cites high rates of fraud and abuse among Haitian recipients of the seasonal worker visas, and high rates of Haitians staying in the U.S. after their visas have expired. \nBy Alicia A. Caldwell \nThe Trump administration is further tightening immigration rules for Haitians, as it plans to remove the country from a program for temporary seasonal jobs, weeks after ending a humanitarian program that allowed tens of thousands of others to live and work in the U.S. \nAccording to a notice that was set to be officially published in the Federal Register on Thursday, Haiti is being removed from a list of countries approved for the H-2A and H-2B visa programs as its participation “is no longer in the U.S. interest.” The programs permit certain foreigners to take temporary seasonal jobs in agriculture and other industries in the U.S., including tourism. \nRead: Trump blasted after questioning protections for immigrants ‘from shithole countries’ \nHaitians represent just a fraction of foreigners participating in temporary worker programs. During the 2016 budget year, 883 temporary workers and their relatives were admitted to the U.S., according to government data. During that same 12 months, more than 218,000 such visas were issued to people from around the world. \nRead: U.S. ambassador to Panama quits, saying he can no longer serve Trump administration \nThe visa change is the latest move by the Trump administration to curb Haitian immigration to the U.S. and comes days after   last week, during a bipartisan immigration meeting at the White House, questioned the need to extend legal immigrant status to Haitians. \nLate last year, then-acting Homeland Security Secretary Elaine Duke announced the end of a humanitarian program that let roughly 50,000 Haitians live and work in the U.S. in the wake of the deadly 2010 earthquake that devastated parts of the country. They were given until July 2019 to either leave or apply for another immigration status.", "external_links": [], "published": "2018-01-18T15:59:00.000+02:00", "crawled": "2018-01-18T16:08:13.002+02:00", "highlightTitle": ""}