{"organizations": [], "uuid": "d9d99472fb1c8b5d6230d4dc6bf66373957b3468", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/globe-newswire-oil-states-completes-previously-announced-acquisition-of-geodynamics.html", "country": "US", "domain_rank": 767, "title": "Oil States Completes Previously Announced Acquisition of GEODynamics", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T01:00:00.000+02:00", "replies_count": 0, "uuid": "d9d99472fb1c8b5d6230d4dc6bf66373957b3468"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/globe-newswire-oil-states-completes-previously-announced-acquisition-of-geodynamics.html", "ord_in_thread": 0, "title": "Oil States Completes Previously Announced Acquisition of GEODynamics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON, Jan. 12, 2018 (GLOBE NEWSWIRE) -- Oil States International, Inc. (NYSE:OIS) announced today that it has completed its acquisition of GEODynamics, Inc. The acquisition was funded with a combination of $295 million of cash (net of estimated cash acquired and funded by borrowings under Oil States' amended revolving credit facility), the issuance of 8.66 million shares of Oil States’ common stock (valued at approximately $295 million based on Oil States’ share price at closing), a $25 million unsecured promissory note payable to the sellers, bearing interest at 2.5% per annum maturing in July 2019, and other closing adjustments, for total consideration of approximately $615 million.\nCindy B. Taylor, Oil States' President and Chief Executive Officer, commented, \"We believe the acquisition of GEODynamics offers a unique opportunity for our Company as it provides meaningful growth potential that combines technology with downhole consumable completion solutions that are ideal for the current operating environment. We are excited to add their products to our existing offerings and their employees to the Oil States family. Collectively, we will be able to offer our customers more customized downhole completion solutions, while assisting with their increasingly complex completion designs.\"\nAbout Oil States\nOil States International, Inc. is a global oilfield products and services company serving the drilling, completions, subsea, production and infrastructure sectors of the oil and gas industry. The Company’s manufactured products include highly engineered capital equipment as well as products consumed in the drilling, well construction and production of oil and gas. The Company is also a leading provider of completion services to the industry. Oil States is headquartered in Houston, Texas with manufacturing and service facilities strategically located across the globe. Oil States is publicly traded on the New York Stock Exchange under the symbol “OIS”.\nFor more information on the Company, please visit Oil States International’s website at www.oilstatesintl.com .\nAbout GEODynamics\nGEODynamics, Inc. creates and delivers downhole solutions that enable enhanced well economics, performance and lifespan. GEODynamics is a leading researcher, developer and manufacturer of engineered solutions to connect the wellbore with the formation in oil and gas well completions. GEODynamics’ solution-oriented product lines span the life of a well from advanced perforating systems (including patented CONNEX® reactive perforating technologies, FracIQ™ Limited Entry Perforating System, and SandIQ™ Optimized Perforating for Diversion) to an innovative line of unconventional well completion tools (including the patented SmartStart Plus™ Time Delay Test & Frac Valve, FracTrap™ Composite FracPlug System, and the FracDock™ family of patented bigbore frac solutions) and well abandonment tools (including Legacy™ plugs and cement retainers, setting equipment, and jet cutters). GEODynamics has headquarters, engineering, sales, laboratory and manufacturing facilities located in Millsap, Texas; technical sales and services in Aberdeen, Scotland and nine U.S. distribution centers. For more information about GEODynamics, visit www.perf.com .\nForward Looking Statements\nThe foregoing contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. Forward-looking statements are those that do not state historical facts and are, therefore, inherently subject to risks and uncertainties. The forward-looking statements included therein are based on then current expectations and entail various risks and uncertainties that could cause actual results to differ materially from those forward-looking statements. Such risks and uncertainties include, among other things, the ability to retain GEODynamics’ customers and employees, the ability to successfully integrate GEODynamics’ operations, product lines, technology and employees into Oil States’ operations, and the ability to achieve the expected synergies as well as accretion in earnings; risks associated with the general nature of the energy service industry; and other factors discussed in the \"Business\" and \"Risk Factors\" sections of the Form 10-K for the year ended December 31, 2016, as well as any other factors discussed in subsequent Forms 10-Q, filed by Oil States with the Securities and Exchange Commission.\nCompany Contact:\nLloyd A. Hajdik\nOil States International, Inc.\nExecutive Vice President, Chief Financial Officer and Treasurer\n713-652-0582\nPatricia Gil\nOil States International, Inc.\nDirector, Investor Relations\n713-470-4860\nSOURCE: Oil States International, Inc.\nSource:Oil States International, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/35b001a2-0c99-40dd-b403-fd2a4f176c98", "https://www.globenewswire.com/Tracker?data=0PCsUwiJegSK4t8axgOQfaszyODahYU65vGpX0NK9Tpgu94urJ3QTrT93z5CM1h__Lh_01VLYfn9HcOQL1vAMGXDhU-hO90QLw5CXYY61a8=", "https://www.globenewswire.com/Tracker?data=-QKGOZYpZIyameTj6iCeQRd29a40CZAig44apjr5eLEXQFPoJI8iDAUmqRaspsZnqLWSoSbpZgFnzh31oXV-jg=="], "published": "2018-01-13T01:00:00.000+02:00", "crawled": "2018-01-13T03:03:59.125+02:00", "highlightTitle": ""}