{"organizations": [], "uuid": "73bfe1fe81d4a9662618f42380ff822c0961c1e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221082063&w=1200&r=LYNXMPEE0A0KD", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-hungary-election/hungary-to-hold-parliamentary-election-on-april-8-president-idUSKBN1F00YW", "country": "US", "domain_rank": 408, "title": "Hungary to hold parliamentary election on April 8: President", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T11:21:00.000+02:00", "replies_count": 0, "uuid": "73bfe1fe81d4a9662618f42380ff822c0961c1e6"}, "author": "", "url": "https://www.reuters.com/article/us-hungary-election/hungary-to-hold-parliamentary-election-on-april-8-president-idUSKBN1F00YW", "ord_in_thread": 0, "title": "Hungary to hold parliamentary election on April 8: President", "locations": [], "entities": {"persons": [{"name": "gergely szakacs", "sentiment": "none"}, {"name": "sandor peto", "sentiment": "none"}, {"name": "janos ader", "sentiment": "none"}, {"name": "viktor orban", "sentiment": "none"}, {"name": "larry king", "sentiment": "none"}], "locations": [{"name": "hungary", "sentiment": "none"}, {"name": "budapest", "sentiment": "none"}], "organizations": [{"name": "fidesz", "sentiment": "none"}, {"name": "mti", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 9:22 AM / Updated 3 hours ago Hungary to hold election on April 8, PM Orban's Fidesz ahead in polls Gergely Szakacs 3 Min Read \nBUDAPEST (Reuters) - Hungary will hold a parliamentary election on April 8, President Janos Ader announced on Thursday, a contest likely to give Prime Minister Viktor Orban’s ruling Fidesz party a third successive term in power. \nOrban has used the past eight years in office to rewrite the constitution and centralize power, filling posts at the central bank, the State Audit Office and the prosecution with party loyalists. \nHis reforms, such as hefty sectoral levies and measures affecting the judiciary and the media, have triggered conflicts with the European Union. Budapest and Brussels have also tussled over migration, which Orban strongly opposes. \nBut Orban’s reforms have put the economy on track for growth of about four percent this year, the budget deficit has remained under the EU’s three percent of gross domestic product threshold and Hungary’s large debt pile has also declined in past years. \nRuling Fidesz party lawmaker Gergely Gulyas told a news conference that Fidesz, which is well ahead of the main opposition nationalist Jobbik party in the latest opinion polls, might not publish an election manifesto. \n“In case of a ruling party, no information about how we plan to govern the country is more credible than the eight years we have left behind,” Gulyas told a news conference. \nOrban’s re-election could bring about further clashes with the EU, as Budapest has already signaled it would veto any sanctions against regional neighbor Poland over its reforms affecting the judiciary. \nOrban has also ruled out taking part in any EU-wide mechanism to settle migrants from the Middle East in Hungary, saying the Christian country, which has no history of large-scale immigration, should preserve its “ethnic homogeneity.” \nWith the Socialists slipping to a distant third in the polls since the resignation of their candidate for prime minister last year, the nationalist Jobbik has emerged as Orban’s main challenger in the April vote. \nMonths before the election, Jobbik, which is projecting a moderate image to lure supporters from other mainstream parties, was slapped with a punitive fine over a political billboard campaign backed by a one-time Orban ally. \nGulyas said there was no link between the timing of the fine and the election campaign, saying any fines should be paid only after the vote. \nCritics and opposition parties have also accused Fidesz of cronyism, pointing to the rise of businessmen close to the government, such as Orban’s childhood friend, Lorinc Meszaros, who has built a sprawling business empire. Reporting by Gergely Szakacs and Sandor Peto, editing by Larry King, William Maclean", "external_links": [], "published": "2018-01-11T11:21:00.000+02:00", "crawled": "2018-01-11T11:28:43.020+02:00", "highlightTitle": ""}