{"organizations": [], "uuid": "a51419c420e9eed2a11ffceda23a449ffaab4259", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-envigo-allocates-300-million-term-loan-b-facility.html", "country": "US", "domain_rank": 767, "title": "Envigo Allocates $300 Million Term Loan B Facility", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.887, "site_type": "news", "published": "2018-01-04T17:00:00.000+02:00", "replies_count": 0, "uuid": "a51419c420e9eed2a11ffceda23a449ffaab4259"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/globe-newswire-envigo-allocates-300-million-term-loan-b-facility.html", "ord_in_thread": 0, "title": "Envigo Allocates $300 Million Term Loan B Facility", "locations": [], "entities": {"persons": [{"name": "j.p. morgan", "sentiment": "none"}, {"name": "envigo", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}], "organizations": [{"name": "avista healthcare public acquisition corp.", "sentiment": "none"}, {"name": "j.p. morgan", "sentiment": "none"}, {"name": "barclays", "sentiment": "none"}, {"name": "suntrust robinson humphrey", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "EAST MILLSTONE, N.J., Jan. 04, 2018 (GLOBE NEWSWIRE) -- Envigo , a leading provider of non-clinical contract research services and research models, today announced it has allocated a $300 million offering of senior secured term loan B due 2024, which was priced at LIBOR plus 550 basis points. Proceeds from the term loan will be used to refinance the company’s existing debt in connection with the closing of its previously-announced definitive merger agreement with Avista Healthcare Public Acquisition Corp. (NASDAQ:AHPA) (“AHPAC”), a special purpose acquisition company. As part of the term loan offering, the company will also issue a new $50 million revolving credit facility. The merger and refinancing are expected to close in the first quarter of 2018, and Envigo will subsequently become a publicly traded company.\nJ.P. Morgan is serving as the administrative agent for the refinancing and joint bookrunners are J.P. Morgan, SunTrust Robinson Humphrey and Barclays.\nAbout Envigo\nEnvigo provides mission-critical products and research services for pharmaceutical, crop protection, and chemical companies as well as universities, governments, and other research organizations. The Company is founded on the principle that research partnerships depend on unmatched expertise, unwavering dedication to customer service, and shared goals. Envigo is committed to helping customers realize the full potential of their products and research which contribute to enhancing the lives of people and animals as well as protecting the environment. With over 3,300 employees worldwide, Envigo provides comprehensive scientific expertise and a full service offering in non-clinical research and development, research models and services, regulatory consulting, and analytical support to customers. Envigo’s corporate headquarters are located in New Jersey.\n( www.envigo.com )\nAdditional Information About the Business Combination\nIn connection with the proposed business combination between Envigo and AHPAC, AHPAC filed with the Securities and Exchange Commission (“SEC”) a preliminary proxy statement and will file with the SEC and mail when available a definitive proxy statement and other relevant documentation to AHPAC’s shareholders. AHPAC’s shareholders and other interested persons are advised to read the preliminary proxy statement and, when available, the amendments thereto and the definitive proxy statement and documents incorporated by reference therein as these materials will contain important information about AHPAC, Envigo and the business combination. The definitive proxy statement will be mailed to AHPAC’s shareholders as of a record date to be established for voting on the proposed business combination when it becomes available. Shareholders will also be able to obtain a copy of the preliminary proxy statement and definitive proxy statement, once it is available, without charge, at the SEC’s website at http://sec.gov or by directing a request to: Avista Healthcare Public Acquisition Corp., 65 East 55th Street, 18th Floor, New York, NY 10022.\nAHPAC shareholders will be able to obtain free copies of these documents and other documents containing important information about AHPAC and Envigo, once such documents are filed with the SEC.\nParticipants in the Solicitation\nAHPAC and its directors, executive officers and other members of its management and employees may be deemed to be participants in the solicitation of proxies from AHPAC’s shareholders in connection with the proposed business combination. Shareholders are urged to carefully read the preliminary proxy statement filed with the SEC, and the definitive proxy statement regarding the proposed business combination when it becomes available, which contain important information. Information regarding the persons who may, under the rules of the SEC, be deemed participants in the solicitation of AHPAC’s shareholders in connection with the proposed business combination are included in the preliminary proxy statement, and will be set forth in the definitive proxy statement when it is filed with the SEC. Information about AHPAC’s executive officers and directors also are included in the preliminary proxy statement and will be set forth in the definitive proxy statement relating to the proposed business combination when it becomes available.\nDisclaimer\nThis filing shall neither constitute an offer to sell or the solicitation of an offer to buy any securities, nor shall there be any sale of securities in any jurisdiction in which the offer, solicitation, or sale would be unlawful prior to the registration or qualification under the securities laws of any such jurisdiction. This filing relates to a proposed business combination between AHPAC and Envigo.\nForward Looking Statements\nThis filing includes “forward looking statements” within the meaning of the “safe harbor” provisions of the United States Private Securities Litigation Reform Act of 1995. Forward-looking statements may be identified by the use of words such as “will,” “intend,” “seek,” “target,” “anticipate,” “believe,” “expect,” “estimate,” “plan,” “outlook,” and “project” and other similar expressions that predict or indicate future events or trends or that are not statements of historical matters. Such forward looking statements include estimated financial information. Such forward looking statements with respect to revenues, earnings, performance, strategies, prospects and other aspects of the businesses of AHPAC, Envigo or the combined company after completion of the business combination are based on current expectations that are subject to known and unknown risks and uncertainties, which could cause actual results or outcomes to differ materially from expectations expressed or implied by such forward looking statements. These factors include, but are not limited to: (1) the occurrence of any event, change or other circumstances that could give rise to the termination of the transaction agreement and the proposed business combination contemplated therein; (2) the inability to complete the transactions contemplated by the transaction agreement due to the failure to obtain approval of the stockholders of AHPAC or other conditions to closing in the transaction agreement; (3) the ability to meet applicable listing standards following the consummation of the transactions contemplated by the transaction agreement; (4) the risk that the proposed transaction disrupts current plans and operations of Envigo as a result of the announcement and consummation of the transactions contemplated by the transaction agreement; (5) the ability to recognize the anticipated benefits of the proposed business combination, which may be affected by, among other things, competition, the ability of the combined company to grow and manage growth profitably, maintain relationships with customers and suppliers and retain its management and key employees; (6) costs related to the proposed business combination; (7) changes in applicable laws or regulations; (8) the possibility that Envigo may be adversely affected by other economic, business, and/or competitive factors; and (9) other risks and uncertainties indicated from time to time in the final prospectus of AHPAC, including those under “Risk Factors” therein, and other documents filed or to be filed with the SEC by AHPAC. Investors are cautioned not to place undue reliance upon any forward-looking statements, which speak only", "external_links": ["https://www.globenewswire.com/Tracker?data=ZOJa3FjCAB20CkW8FzSna1ZELzgnRt2W6fNqul3Mjlz-ksh3qub6AInqQxh-NwdX9k3Ps8EdtZUnQYJj-PSWLw==", "https://www.globenewswire.com/Tracker?data=s3ZdtX2XqNr8kJ2MaxlnZl4MPzwTecGn8H-iHPlJnOA3BlTHqSwSrx4IFcz1HjQvo39GMV1RC18fBtfRr2erY91wt_f21SCrBN2A4hZi4NywxOtnwbkHpSQiVbkncJt56sRjgx6eMGAv0RpVoZ6M4Eo07TVRyC8fHObjaXVGISb1vbiv2bw--dAShTE_Z_BxfXjArasnbAVkrGMbBkBE5N5Qbje340gfCHoLPKexOMT8MLeexPecbxP4G_BelPFMxt2Vp618CrjUiZKsqjrgdQSi109UkaEIoiD863K83Uiv8KaX5ma8mv3DS-UH6ZiwMJ2isfwFbJ5C2ZMV9nBAvtYvPKnlgWuGayREKjf1PDI=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/e8a44ff5-98c6-4a99-ac4a-99dec9971f2d", "https://www.globenewswire.com/Tracker?data=ULQuCYdDjaN6LPaHBe0t0AKjkNAWVE4U0MXkvqReYm1XAC1it5thd9mqh9QHJbHy4Wev3Dr2fszvniSX0JnAbw==", "https://www.globenewswire.com/Tracker?data=r--u4I0TLp-JA8h7oxKw-N_dnmy1BbCXo1Nt84EG0VooNcvkQU6a_RCAG_iPStE90Yd2Hi2nYej9DmaPpZQNDWLOtiqbq4S8GkTE36QrSA8="], "published": "2018-01-04T17:00:00.000+02:00", "crawled": "2018-01-04T16:37:33.032+02:00", "highlightTitle": ""}