{"organizations": [], "uuid": "b86beaefd937d6f92aa02db49bdd2d0d0713dff7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221490947&w=1200&r=LYNXMPEE0B13S", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-germany-politics-macron/frances-macron-welcomes-merkels-deal-with-social-democrats-says-good-for-europe-idUSKBN1F11TX", "country": "US", "domain_rank": 408, "title": "France's Macron welcomes Merkel's deal with Social Democrats, says good for Europe", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T18:25:00.000+02:00", "replies_count": 0, "uuid": "b86beaefd937d6f92aa02db49bdd2d0d0713dff7"}, "author": "", "url": "https://www.reuters.com/article/us-germany-politics-macron/frances-macron-welcomes-merkels-deal-with-social-democrats-says-good-for-europe-idUSKBN1F11TX", "ord_in_thread": 0, "title": "France's Macron welcomes Merkel's deal with Social Democrats, says good for Europe", "locations": [], "entities": {"persons": [{"name": "merkel", "sentiment": "negative"}, {"name": "angela merkel", "sentiment": "none"}, {"name": "macron", "sentiment": "none"}, {"name": "sebastian kurz", "sentiment": "none"}, {"name": "emmanuel macron", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "macron", "sentiment": "negative"}, {"name": "socia", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "europe reuters staff", "sentiment": "none"}, {"name": "spd", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 3:03 PM / Updated an hour ago France's Macron welcomes Merkel's deal with Social Democrats, says good for Europe Reuters Staff 3 Min Read \nPARIS (Reuters) - French President Emmanuel Macron on Friday welcomed a deal in Germany between Chancellor Angela Merkel and Social Democrat (SPD) that paves the way for a coalition government, saying its provisional terms were good for Europe. \nMacron in September offered an ambitious vision for European renewal, but has had to wait since for a response from EU powerhouse Germany, with much on hold there after parliamentary elections. \nThe deal reached by Merkel and the SPD on Friday pledges close cooperation with France on strengthening the euro zone, in Berlin’s first substantive response to Macron’s proposals. \n“We have had this morning ... good news from the other side of the Rhine,” Macron told a news conference with Austrian Chancellor Sebastian Kurz.“We need more Europe and from what I saw of the provisional deal it acknowledges that.” \nThe terms of the deal are more favorable to the European project than previous attempts for a German coalition government did at the end of last year, Macron said, adding that he was happy to find in the deal echoes of his own proposals. \nHowever, while he welcomed the overall tone of the CDU-SPD deal, when asked about plans to turn the ESM bailout mechanism into a full-blown European Monetary Fund, which are included in the 28-page policy document agreed after all-night talks, Macron expressed some scepticism. \n“We need to finalise the banking union,” Macron said, adding that the ESM might have to undergo some changes. “But I don’t think we need a new instrument to do so,” he said. \n“I know what the International Monetary Fund is but I struggle to see what a European Monetary Fund is, if not potentially bringing some confusion between several instruments .... whose objectives are different,” he said, adding that that he was in favor of keeping the ESM as a rescue mechanism, with a separate fund to finance EU projects and a separate budgetary tool for the EU. \nThe German provisional deal also promises to devote “specific budget funds” to the economic stabilization of the single currency bloc and to support “social convergence” and structural reforms, saying this could form the basis of a future “investment budget”. Reporting by Jean-Baptiste Vey; Writing by Ingrid Melander; Editing by John Irisha and Leigh Thomas", "external_links": [], "published": "2018-01-12T18:25:00.000+02:00", "crawled": "2018-01-12T18:28:01.004+02:00", "highlightTitle": ""}