{"organizations": [], "uuid": "af66785f6acc60c742f4d2b19954155806c9e9bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2012/06/darrell_issa1.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/10/darrell-issa-retirement/", "country": "US", "domain_rank": 1196, "title": "Darrell Issa Will Not Seek Re-Election to the House | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.536, "site_type": "news", "published": "2018-01-10T15:30:00.000+02:00", "replies_count": 0, "uuid": "af66785f6acc60c742f4d2b19954155806c9e9bb"}, "author": "Natasha Bach", "url": "http://fortune.com/2018/01/10/darrell-issa-retirement/", "ord_in_thread": 0, "title": "Darrell Issa Will Not Seek Re-Election to the House | Fortune", "locations": [], "entities": {"persons": [{"name": "darrell issa", "sentiment": "negative"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "eric holder", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "issa", "sentiment": "none"}], "locations": [{"name": "benghazi", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "house", "sentiment": "negative"}, {"name": "house oversight and government reform committee", "sentiment": "none"}, {"name": "gop", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "1:30 PM EST \nRep. Darrell Issa (R-Calif.) announced Wednesday that he will not seek re-election. \nPerhaps best known as a leading conservative critic of President Obama and Hillary Clinton, Issa led the “Fast and Furious” investigation while head of the House Oversight and Government Reform Committee. The inquiry led a vote of contempt against then-Attorney General Eric Holder in 2012. \nIssa also played a prominent role in the GOP investigation of the 2012 Benghazi attack. \nIssa, 64, didn’t provide a reason for his retirement from office, and instead merely said the following in statement on his website: “Throughout my service, I worked hard and never lost sight of the people our government is supposed to serve. Yet with the support of my family, I have decided that I will not seek re-election in California’s 49th District.” \nRead: The Democratic Donor Who Wants Trump Impeached Is Pouring Millions Into the Midterms \nDespite this, he noted that he “will continue advocating on behalf of the causes that are most important to me, advancing public policy where I believe I can make a true and lasting difference, and continuing the fight to make our incredible nation an even better place to call home.” \nThe Congressman has represented California’s 49th district near San Diego since 2001. But in recent years, Issa’s hold on his constituency has diminished, and Issa barely won re-election in 2016, by just over half a percentage point. \nRead: After North Carolina, What Other States Could See Their Congressional Districts Redrawn? \nIssa is the second California Republican this week to announce his intentions not to run again. On Monday, Foreign Affairs Committee Chairman Ed Royce, 66, announced his own retirement. California has been seen as a critical part of the Democrats push to regain control of the House, and without Issa and Royce, the path to victory may be getting clearer. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-10T15:30:00.000+02:00", "crawled": "2018-01-10T23:34:14.005+02:00", "highlightTitle": ""}