{"organizations": [], "uuid": "4dd2d26995d630699394075e669ef4967191b189", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 8, "shares": 8, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226866531&w=1200&r=LYNXMPEE0U0DH", "site_section": "http://feeds.feedburner.com/reuters/businessNews/", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-netherlands-fintech-payconiq/defections-weaken-dutch-banks-fintech-defense-idUSKBN1FK0TS", "country": "US", "domain_rank": 408, "title": "Defections weaken Dutch banks' fintech defense", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T14:53:00.000+02:00", "replies_count": 0, "uuid": "4dd2d26995d630699394075e669ef4967191b189"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-netherlands-fintech-payconiq/defections-weaken-dutch-banks-fintech-defense-idUSKBN1FK0TS", "ord_in_thread": 0, "title": "Defections weaken Dutch banks' fintech defense", "locations": [], "entities": {"persons": [{"name": "payconiq", "sentiment": "none"}], "locations": [{"name": "amsterdam", "sentiment": "none"}, {"name": "netherlands", "sentiment": "none"}, {"name": "payconiq", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "ing", "sentiment": "none"}, {"name": "rabobank", "sentiment": "none"}, {"name": "abn", "sentiment": "none"}, {"name": "regiobank", "sentiment": "none"}, {"name": "volksbank", "sentiment": "none"}, {"name": "abn amro", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 7:53 AM / in 34 minutes Defections weaken Dutch banks' fintech defense Toby Sterling 6 Min Read \nAMSTERDAM (Reuters) - A new common mobile payments system for Dutch banks has been hobbled by the decision of two big lenders to focus elsewhere, highlighting the challenges major lenders face in fending off fintech rivals. \nABN Amro announced it was pulling out of the system, Payconiq, on the day of its launch last week. This week, Payconiq’s founder ING said it had paid 270 million euros ($334 million) for a controlling stake in a fintech payments company operating in an overlapping space. \nTogether with Rabobank, ING and ABN control around 90 percent of the Netherlands’ retail banking market, prompting charges that Payconiq was an attempt to corner the mobile payments market before EU legislation opens it up in June. \nDesigned to be shared by the big three banks and two others - Regiobank and Volksbank - in a continuation of a tradition of cooperation among Dutch lenders, it stood a fair chance of success, a model of how banks might fend off the fintech threat. \nEach lender will now have to thrive or wilt on its own merits as the big ones look to the next generation of payments technologies and fintechs and startups eye new opportunities. \n”The inevitable consequence of a truly European market is ... that there are fewer incentives to stick to the old tradition when faced with international competition,“ said Simon Lelieveldt,” a payments consultant and historian of Amsterdam’s development as a financial center. \nABN’s motive for leaving is the success of its own smartphone application ‘Tikkie’, which boasted on Monday it has gained some 2 million users in this nation of 17 million people since its launch in June. \nPayconiq CEO Duke Prins put a brave face on the situation in a telephone interview after his company launched in the Netherlands last week with its remaining members, six months behind schedule. \n“We are a complete replacement for card-based systems like Visa” he said, adding that ABN “are being realistic, given the state of competition”. FRAGMENTATION \nPaul Alfing, a consultant at the Payments Advisory Group, said ABN’s walk-out damages Payconiq’s prospects and could bring further fragmentation to the Dutch payment landscape. \n“If ABN is going to put all its money behind their solution, Tikkie, then some retailers will choose Payconiq, others Tikkie, others something else or nothing at all,” he said. \nThis would confuse consumers and slow overall acceptance of mobile payments, as merchants wait for a winner to emerge. \nPayconiq, founded by ING has its headquarters in Luxembourg, a significant presence in Belgium, and a pilot in Germany, where ING is the third-largest retail bank. \nAnnouncing ING’s acquisition of a 75 percent stake in Payvision on Monday, ING’s head of transaction services Mark Buitenhek said Payvision and Payconiq -- which Rabobank still intends to use -- would both woo merchants. \nPayconiq is a smartphone application, inter-operable with all its participating banks, in hopes of creating a single standard to tempt or force both brick-and-mortar stores and websites into accepting it. \nA customer could use a small QR code on the same phone app to book a flight online or pay for groceries in a shop, regardless of their home bank. \nPayvision, which competes with larger rivals such as WorldPay and fintech “unicorn” Adyen, has a much broader range. It can, for instance, allow merchants to accept Visa and Mastercard payments. \nPayvision has a small but growing presence in North America, Europe and Asia, while ABN Amro’s Tikkie is limited to the Netherlands and is now mostly used for person-to-person payments, though it has begun expanding the system for merchant use. \nWhen big banks do cooperate, they are a force to be reckoned with. \nIn Sweden, a payments system for mobile phones backed by local banks, known as “Swish”, has become the dominant form of mobile payments in recent years, and is now used by more than 50 percent of the population. \nBack in 2005, Dutch banks formed a single platform known as “iDeal” to handle online payments. As of last year its market share was above 50 percent. By contrast, in the more fragmented market in neighboring Belgium, credit cards became the most popular way to pay online, followed by individual bank debit cards and Paypal. \nPayconiq will have to compete from the start with both Tikkie and iDeal on banks’ mobile phones apps. In the longer term, mobile phones with near-field communication chips may be the bigger threat, especially in combination with payment apps built by U.S. or Asian tech giants. \nDagmar van Ravenswaay Claasen, the director of regulatory affairs at Adyen, the Dutch start-up that handles back-end of payments for Facebook and Spotify, said customers will ultimately determine who wins in the Netherlands and beyond. \n“Adyen’s position is to figure out what payment methods are gaining demand in each market,” she said. “We go where our merchants’ customers are.” \nThe rollout in the Netherlands of PSD2, the European legislation forcing banks to open their payments networks, has been delayed until June. But she said it will lead to more innovation by big and small players. \nAli Niknam, founder of “Bunq”, a startup Dutch bank that prides itself on tech savvy, said his bank rejected Payconiq and saw the feud between the big banks as an opportunity. \n“We expect the outcome to be largely defined by the technical proficiency of the companies providing the solutions,” he said. “No clear winner is defined yet.” additional reporting by Eric Auchard, Johan Ahlander and Jacob Gronholt-Pedersen; editing by John O'Donnell and Philippa Fletcher", "external_links": [], "published": "2018-01-31T14:53:00.000+02:00", "crawled": "2018-01-31T10:03:36.007+02:00", "highlightTitle": ""}