{"organizations": [], "uuid": "ec010bd52e9276e8dad14f6e19abb38c1a05b176", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220253018&w=1200&r=LYNXMPEE070NS", "site_section": "http://www.reuters.com/resources/archive/us/20180108.html", "section_title": "Archive News &amp; Video for Monday, 08 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-newsnow-jan08/monday-morning-briefing-idUSKBN1EX10Y", "country": "US", "domain_rank": 408, "title": "Monday Morning Briefing", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.009, "site_type": "news", "published": "2018-01-08T19:59:00.000+02:00", "replies_count": 0, "uuid": "ec010bd52e9276e8dad14f6e19abb38c1a05b176"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-newsnow-jan08/monday-morning-briefing-idUSKBN1EX10Y", "ord_in_thread": 0, "title": "Monday Morning Briefing", "locations": [], "entities": {"persons": [{"name": "steve bannon", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "bannon", "sentiment": "none"}, {"name": "nikki haley", "sentiment": "none"}, {"name": "kim jong un", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "hollywood", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "united nations", "sentiment": "none"}, {"name": "pentagon", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Hollywood stars don black for the Golden Globes red carpet, Steve Bannon backs off comments made about Trump’s son and an exclusive reveals the Pentagon and diplomats are to play a bigger role in U.S. arms sales.\nUnited States\nPresident Donald Trump’s former strategist Steve Bannon backed away from derogatory comments ascribed to him about Trump’s son in a new book that sparked White House outrage and could threaten Bannon’s influence as a would-be conservative power broker.\nA senior aide to Trump assailed the book, called his boss a genius and launched an attack on news coverage before a TV anchor urged him to calm down and cut off their interview .\nTrump’s tweet about having a bigger nuclear button than Kim Jong Un’s has kept the North Korean leader “ on his toes ” and made clear the risks of a nuclear standoff, U.S. Ambassador to the United Nations Nikki Haley said.\nThe Trump administration is nearing completion of a new “ Buy American ” plan that calls for U.S. military attaches and diplomats to help drum up billions of dollars more in business overseas for the American weapons industry, going beyond the assistance they currently provide, U.S. officials said.\nGovernment officials across the United States try to maintain accurate voter rolls by removing people who have died or moved away. But a case coming before the U.S. Supreme Court on Wednesday explores whether some states are aggressively purging voter rolls in a way that disenfranchises thousands of voters.\nThe bitter cold that has gripped much of the United States since the new year will last another day, forecasters said, predicting an end to a frigid spell that featured a “bomb cyclone” snowstorm and frozen iguanas falling from trees in Florida.\nBreakingviews : Trump would be wise to ease up on Seoul\nBusiness\nWorld stock markets hovered close to all-time highs as the best start to a year in eight years showed little sign of running out of steam, with the combination of strong global growth and low inflation powering the appetite for risk.\nU.S. oilfield service companies are gearing up for initial public offerings , according to regulatory filings and analysts, after several shelved equity sales last year during a weak period for oil prices.\nFederal Reserve policymakers have come to view Trump’s tax overhaul as a short-term economic boost that will neither permanently supercharge the economy, as the president says, or cause an immediate disruption that would require a central bank response, as some analysts have warned.\nChinese airlines will be able to set their own prices on more than 300 routes after the aviation regulator further liberalized fees in a major step forward for reform of the world’s fastest-growing civil aviation market.\nApple shareholders Jana Partners and the California State Teachers’ Retirement System are urging the smartphone maker to take steps to address what they say is a growing problem of young people getting addicted to Apple’s iPhones , Jana partner Charles Penner said.\nHorses are seen inside a forest near the ruins of the Greek and Roman city in Shahhat, Libya January 5, 2018. REUTERS/Esam Omran Al-Fetori World\nProtests that shook Iran were not just aimed at the economy, President Hassan Rouhani said , remarks suggesting the real targets were powerful conservatives opposed to his plans to expand individual freedoms at home and promote detente abroad.\nChancellor Angela Merkel is optimistic her conservatives and the Social Democrats can cut a deal, she said as the parties began five days of talks about reviving the ‘grand coalition’ that has governed Germany since 2013.\nRescue crews wrestled to bring a blaze on an Iranian oil tanker off China’s east coast under control as fire r aged for a second day following a collision with a grain ship, while the body of one of the 32 missing crew members was found on aboard.\nFriends of Reuters reporter Wa Lone gathered at one of the main Buddhist pagodas in Myanmar’s commercial capital Yangon to pray for his release from prison , where he has been held with a colleague on suspicion of violating the Official Secrets Act. Journalists Wa Lone, 31, and Kyaw Soe Oo, 27, were detained on Dec. 12 and are due to appear in court on Wednesday.\nIsraeli Prime Minister Benjamin Netanyahu trod carefully around a threatened U.S. aid cut to Palestinians, stopping short of backing a funding halt as he repeated calls for a U.N. agency that helps Palestinian refugees to be dismantled.\nReuters TV : Iraq sends displaced people home - despite the dangers\nGolden Globes\nDark drama “Three Billboards Outside Ebbing, Missouri” was the big winner with four Golden Globes awards on a night marked by scathing jokes about sexual harassment and passionate odes to those breaking their silence.\nOprah Winfrey became the first black woman to be awarded a Golden Globe for lifetime achievement, delivering an impassioned speech in support of those who have exposed sexual misconduct in Hollywood and beyond.\nFrom flowing gowns to tailored tuxedos, Hollywood’s film and television stars dressed in their finest black on the Golden Globes red carpet in solidarity with the Time’s Up campaign to fight sexual harassment in the workplace.\nCommentary\nThere's a better way to unite Europe than pursuing integration. \"A move to centralize, and a further weakening of national administrations in favor of 'more Europe', is unlikely to work, writes John Lloyd . \"Better now to recast the Union as a loose association of friendly states, which agrees on policies and projects where these make sense, but which remains under the aegis of national governments.\"\n ", "external_links": ["https://www.reuters.tv/v/5zs/2018/01/08/iraq-sends-displaced-people-home-despite-the-dangers", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-08T19:59:00.000+02:00", "crawled": "2018-01-09T17:14:26.019+02:00", "highlightTitle": ""}