{"organizations": [], "uuid": "b556cb79959c73d1dda8feb9363bbdee7cab9892", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/global-precious/precious-gold-up-on-weaker-dollar-heads-for-5th-gain-on-week-idUSL4N1P714R", "country": "US", "domain_rank": 408, "title": "PRECIOUS-Gold up on weaker dollar, heads for 5th gain on week", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T03:28:00.000+02:00", "replies_count": 0, "uuid": "b556cb79959c73d1dda8feb9363bbdee7cab9892"}, "author": "", "url": "https://www.reuters.com/article/global-precious/precious-gold-up-on-weaker-dollar-heads-for-5th-gain-on-week-idUSL4N1P714R", "ord_in_thread": 0, "title": "PRECIOUS-Gold up on weaker dollar, heads for 5th gain on week", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "ecb", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 12 (Reuters) - Gold prices rose for a third straight session on Friday on a weaker dollar, with the precious metal on track for a fifth straight weekly gain. FUNDAMENTALS * Spot gold edged up 0.1 percent to $1,324 an ounce by 0100 GMT. Prices hit a near four-month high of $1,326.56 an ounce on Wednesday. * Spot gold has risen 0.3 percent so far this week. * U.S. gold futures were up 0.2 percent at $1,324.60 an ounce. * The dollar index , which measures the greenback against six rival currencies, was down 0.2 percent at 91.707, after earlier falling to its lowest since Sept. 20, 2017 at 91.689. * The euro jumped against the dollar as the European Central Bank signalled it could begin to wind down its 2.5 trillion euro ($3.01 trillion) stimulus program this year. * The ECB should revisit its communication stance in early 2018, accounts of its December meeting showed, suggesting that policymakers could soon start preparing markets for the end of the bank's massive stimulus. * A stronger euro potentially boosts demand for gold by making dollar-priced bullion cheaper for European investors. * The greenback was also under pressure after data showed U.S. producer prices fell for the first time in nearly 1-1/2 years in December amid declining costs for services. * Weak inflation at the producer level could add to concerns that the factors restraining inflation could become more persistent and result in the U.S. Federal Reserve being more cautious about raising interest rates this year. * Higher rates could dent demand for non-interest-paying gold. * Brent crude prices hit $70 a barrel on signs of tightening crude stocks but settled off that level on Thursday. * Asian stocks resumed their ascent on Friday, supported by U.S. earnings optimism and a rise in oil prices. * One person was killed and part of South Africa's Royal Bafokeng Platinum's (RBPlat) conveyor belt was burnt during overnight protests at one of its shafts in the country's North West Province, the platinum producer said on Thursday. DATA AHEAD (IN GMT) N/A China Exports, Imports, Trade Balance Dec 1330 U.S. Core CPI Dec 1330 U.S. Retail Sales Dec ($1 = 0.8298 euros) (Reporting by Nallur Sethuraman in Bengaluru; Editing by Biju Dwarakanath)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-12T03:28:00.000+02:00", "crawled": "2018-01-12T03:49:43.003+02:00", "highlightTitle": ""}