{"organizations": [], "uuid": "887343f2ba21511d544ff17ed84fda1ec3df3781", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-cellect-announces-opening-of-a-second-clinical-trial-site-and-approval-from-safety-board-dsmb-for-dose-escalation.html", "country": "US", "domain_rank": 767, "title": "Cellect Announces Opening of a Second Clinical Trial Site and Approval from Safety Board (DSMB) for Dose Escalation", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.98, "site_type": "news", "published": "2018-01-16T15:00:00.000+02:00", "replies_count": 0, "uuid": "887343f2ba21511d544ff17ed84fda1ec3df3781"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-cellect-announces-opening-of-a-second-clinical-trial-site-and-approval-from-safety-board-dsmb-for-dose-escalation.html", "ord_in_thread": 0, "title": "Cellect Announces Opening of a Second Clinical Trial Site and Approval from Safety Board (DSMB) for Dose Escalation", "locations": [], "entities": {"persons": [{"name": "shai yarkoni", "sentiment": "none"}, {"name": "polina stefenski", "sentiment": "none"}, {"name": "cellect", "sentiment": "none"}], "locations": [{"name": "israel", "sentiment": "none"}, {"name": "cellect", "sentiment": "none"}], "organizations": [{"name": "cellect biotechnology ltd.", "sentiment": "negative"}, {"name": "safety board", "sentiment": "negative"}, {"name": "rambam medical center", "sentiment": "none"}, {"name": "safety monitoring board", "sentiment": "none"}, {"name": "hadassah medical center", "sentiment": "none"}, {"name": "hadassah", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TEL AVIV, Israel, Jan. 16, 2018 /PRNewswire/ -- Cellect Biotechnology Ltd. (Nasdaq: APOP), a developer of a novel stem cell selection technology, announced that it has signed an agreement with the Hadassah Medical Center to conduct clinical trials on cancer patients in Cellect's ongoing Phase I/II study. The study at Hadassah will be conducted under Prof. Polina Stefenski, the Principal Investigator of the site at Hadassah. Furthermore, following the recently announced positive interim results in the Phase I/II clinical trial with the first group of patients treated at the Rambam Medical Center, Cellect received approval from the independent Data and Safety Monitoring Board (DSMB) to escalate ApoGraft™ FasL protein dosage (Cellect's main active ingredient in ApoGraft™) to 25 ng/ml and enroll three additional patients for the clinical trial.\nDr. Shai Yarkoni, Cellect's CEO said, \"Stem cells are the key raw material for the emergence of Cell Therapy into the 21 st century as the new standard for well-being. We believe Cellect's innovative technology paves the way to make sure quality stem cells are available for mass usage on a global basis.\"\nAbout Regenerative Medicine and Cell Therapy\nRegenerative medicine is a novel approach using cells and tissues to replace or regenerate human cells, tissues or organs in a wide variety of medical indications. This could be achieved by either stimulating the body to use its own repair mechanisms to heal tissues or organs, or by growing tissues and organs in the laboratory and transplanting them into the patient.\nStem cells play a major role in the achievement of the extraordinary potential results in regenerative medicine. In cell therapies they can be injected to reconstitute the entire blood system in bone marrow transplantations. Alternatively, their injection can supply the necessary biologically active molecules to induce the patients' own cells to regain normal function, as used in immunomodulation therapy. In tissue engineering, where entire organs like the retina, bone, cartilage or the skin may be replaced, stem cells are the starting material for the growth of such tissues in the laboratory. Moreover, in tissue engineering an artificial system might be created by inducing cells to perform certain biochemical functions lost due to disease (e.g., artificial pancreas or liver).\nRegenerative medicine using cellular therapy in combination with new technologies like tissue engineering and gene transfer can be used in a virtually unlimited number of indications. The most frequently used cells are hematopoietic stem cells (HSC) due to their capability to reproduce the entire blood system in blood cancer and hematological disorders. Mesenchymal stem cells, which have the capability to differentiate to a large number of tissue types like bone, cartilage, fat, heart muscle and more, are of growing importance with a large number of clinical trials ongoing. Potential applications of cell therapies include treating cancers, autoimmune disease, urinary problems and infectious disease, rebuilding damaged cartilage in joints, repairing spinal cord injuries, improving a weakened immune system, and helping patients with neurological disorders.\nAbout Cellect Biotechnology Ltd.\nCellect Biotechnology (NASDAQ: APOP) has developed a breakthrough technology for the selection of stem cells from any given tissue that aims to improve a variety of stem cell-based therapies.\nThe Company's technology is expected to provide research, hospitals and pharma companies with the tools to rapidly isolate stem cells in quantity and quality allowing stem cell-based treatments and procedures in a wide variety of applications in regenerative medicine. The current clinical trial is aimed at bone marrow transplantations in cancer treatment.\nForward Looking Statements\nThis press release contains forward-looking statements about the Company's expectations, beliefs and intentions. Forward-looking statements can be identified by the use of forward-looking words such as \"believe\", \"expect\", \"intend\", \"plan\", \"may\", \"should\", \"could\", \"might\", \"seek\", \"target\", \"will\", \"project\", \"forecast\", \"continue\" or \"anticipate\" or their negatives or variations of these words or other comparable words or by the fact that these statements do not relate strictly to historical matters. For example, forward-looking statements are used in this press release when we discuss Cellect's intent regarding the effects of the ApoGraft™ transplantation and Cellect's aims and expectations regarding the future of its ApoGraft™ technology and stem cell based regenerative medicine. These forward-looking statements and their implications are based on the current expectations of the management of the Company only, and are subject to a number of factors and uncertainties that could cause actual results to differ materially from those described in the forward-looking statements. In addition, historical results or conclusions from procedures, scientific research and clinical studies do not guarantee that future results would suggest similar conclusions or that historical results referred to herein would be interpreted similarly in light of additional research or otherwise. The following factors, among others, could cause actual results to differ materially from those described in the forward-looking statements: changes in technology and market requirements; we may encounter delays or obstacles in launching and/or successfully completing our clinical trials; our products may not be approved by regulatory agencies, our technology may not be validated as we progress further and our methods may not be accepted by the scientific community; we may be unable to retain or attract key employees whose knowledge is essential to the development of our products; unforeseen scientific difficulties may develop with our process; our products may wind up being more expensive than we anticipate; results in the laboratory may not translate to equally good results in real clinical settings; results of preclinical studies may not correlate with the results of human clinical trials; our patents may not be sufficient; our products may harm recipients; changes in legislation; inability to timely develop and introduce new technologies, products and applications, which could cause the actual results or performance of the Company to differ materially from those contemplated in such forward-looking statements. Any forward-looking statement in this press release speaks only as of the date of this press release. The Company undertakes no obligation to publicly update or review any forward-looking statement, whether as a result of new information, future developments or otherwise, except as may be required by any applicable securities laws. More detailed information about the risks and uncertainties affecting the Company is contained under the heading \"Risk Factors\" in Cellect Biotechnology Ltd.'s Annual Report on Form 20-F for the fiscal year ended December 31, 201", "external_links": ["http://www.sec.gov/", "http://www.prnewswire.com/news-releases/cellect-announces-opening-of-a-second-clinical-trial-site-and-approval-from-safety-board-dsmb-for-dose-escalation-300583005.html", "http://www.cellect.co/"], "published": "2018-01-16T15:00:00.000+02:00", "crawled": "2018-01-16T17:07:44.000+02:00", "highlightTitle": ""}