{"organizations": [], "uuid": "d37cc4a5099ce49fb75ff59926b328194184015a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-asit-biotech-publication-related-to-a-transparency-notification.html", "country": "US", "domain_rank": 767, "title": "ASIT biotech: Publication Related to a Transparency Notification", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T19:45:00.000+02:00", "replies_count": 0, "uuid": "d37cc4a5099ce49fb75ff59926b328194184015a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-asit-biotech-publication-related-to-a-transparency-notification.html", "ord_in_thread": 0, "title": "ASIT biotech: Publication Related to a Transparency Notification", "locations": [], "entities": {"persons": [{"name": "rue joseph stallaert", "sentiment": "none"}, {"name": "rodolphe de spoelberch", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "asit", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(article 14, subparagraph 1 of the law of 2 May 2007 regarding the disclosure of important shareholdings in listed companies)\nBRUSSELS--(BUSINESS WIRE)-- Regulatory News:\nASIT biotech (ASIT - BE0974289218) (Paris:ASIT) (BSE:ASIT) , a clinical stage biopharmaceutical company focused on the research, development and future commercialization of breakthrough immunotherapy products for the treatment of allergies, today announces that it has received a transparency notification dated 25 January, 2018, the result of which is - following the acquisition of shares on that same date - that Mr. Rodolphe de Spoelberch now has 11.02% of the Company’s voting rights, and has thus increased his stake beyond the 10% threshold.\nThe statement dated 25 January, 2018 notably includes the following information:\nPurpose of the notification\nAcquisition or disposal of shares with voting rights\nNotification by\nA person that notifies alone\nPerson subject to the notification requirement\nRodolphe de Spoelberch – Rue Joseph Stallaert 20, 1050 Brussels, Belgium\nDate of the transaction\n25 January, 2018\nThreshold crossed (%)\nThe 10% threshold has been exceeded\nDenominator\nA total of 15,262,544 voting rights\nThis notification is available on ASIT biotech’s website, in the Documentation / Regulated information section:\nhttps://www.asitbiotech.com/fr/investisseurs/documentation\n***\nAbout ASIT biotech\nASIT biotech is a Belgian clinical stage biopharmaceutical company focused on the development and future commercialization of a range of breakthrough immunotherapy products for the treatment of allergies. Thanks to its innovative ASIT+™ technology platform, ASIT biotech is currently the only developer of AIT product candidates consisting of a unique mixture of highly purified natural allergen fragments in an optimal size selection. This innovation results in a short treatment, expected to improve patient compliance and real-life effectiveness. ASIT biotech’s product pipeline entails two novel ASIT+™ product candidates targeting respiratory allergy with the highest prevalence (i.e. grass pollen: gp-ASIT+™ and house dust mite: hdm-ASIT+™), that could significantly expand the current immunotherapy market. The Company believes that its innovative ASIT+™ platform is flexible and would be applicable across a range of allergies.\nASIT biotech has a headcount of 22 staff members, at its headquarters in Brussels and a laboratory in Liège, Belgium.\nFurther information can be found at www.asitbiotech.com .\nForward-looking statements\nAll statements in this announcement that do not relate to historical facts and events are “forward-looking statements”. In some cases, these forward-looking statements can be identified by the use of forward-looking terminology, including the words “believes,” “estimates,” “anticipates,” “expects,” “intends,” “may,” “will,” “plans,” “continue,” “ongoing,” “potential,” “predict,” “project,” “target,” “seek” or “should” or, in each case, their negative or other variations or comparable terminology or by discussions of strategies, plans, objectives, targets, goals, future events or intentions. Forward-looking statements include statements regarding the Company’s intentions, beliefs or current expectations. By their nature, forward-looking statements involve known and unknown risks and uncertainties because they relate to events and depend on circumstances that may or may not occur in the future. Forward-looking statements are not guarantees of future performance. Given these risks and uncertainties, you should not rely on forward-looking statements as a prediction of actual results. Any forward-looking statements are made only as of the date of this announcement and, without prejudice to the Company’s obligations under applicable law in relation to disclosure and ongoing information, the Company does not intend, and does not assume any obligation, to update the forward-looking statements set forth in this announcement.\nLegal notice\nThis announcement does not constitute, or form part of, an offer or invitation to sell or issue, or any solicitation of an offer to purchase or subscribe for shares of ASIT biotech SA (the “Company” and the “Shares”). Any purchase of, subscription for or application for, Shares to be issued in connection with the intended offering should only be made on the basis of information contained in the prospectus and any supplements thereto, as the case may be. This announcement does not constitute a prospectus and the information contained herein is for information purposes only and does not purport to be full or complete. Investors should not subscribe for any Shares except on the basis of the information contained in the prospectus that the Company expects to publish after its approval by the Belgian Financial Services and Markets Authority, and which can then be obtained at the Company’s registered office and on www.asitbiotech.com\nThis announcement is not for distribution, directly or indirectly, in or into the United States or to any U.S. person within the meaning of the U.S. Securities Act of 1933, as amended (the “Securities Act”). The Shares have not been and will not be registered under the Securities Act and may not be offered or sold in the United States, except pursuant to an exemption from the registration requirements of the Securities Act. The Company has not registered, and does not intend to register, any portion of the intended offering of Shares in the United States, and does not intend to conduct a public offering of Shares in the United States.\nThis announcement and the information contained herein are not for publication, distribution or release in or into the United States, Australia, Canada, Japan or any jurisdiction where to do so would constitute a violation of the relevant laws of such jurisdiction.\nThe Company is responsible for the information contained in this press release.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180130005980/en/\nASIT biotech\nThierry Legon, Tel.: +32 2 264 03 90\nCEO\ninvestors@asitbiotech.com\nor\nMedia and Investor Relations - France\nNewCap\nDusan Oresansky / Pierre Laurent, Tel.: +33 1 44 71 94 92\nasitbiotech@newcap.eu\nor\nMedia Relations - Belgium\nLaure-Eve Monfort, Tel.: +32 2 290 90 93\nmonfort@comfi.be\nSource: ASIT biotech", "external_links": ["https://www.asitbiotech.com/fr/investisseurs/documentation", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.asitbiotech.com&esheet=51750920&newsitemid=20180130005980&lan=en-US&anchor=www.asitbiotech.com&index=2&md5=61a68cfe74a22d33bf368ed9eb8475b7", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.asitbiotech.com%2Ffr%2Finvestisseurs%2Fdocumentation&esheet=51750920&newsitemid=20180130005980&lan=en-US&anchor=https%3A%2F%2Fwww.asitbiotech.com%2Ffr%2Finvestisseurs%2Fdocumentation&index=1&md5=89704ba26b71a2e8141addaaee7537e2", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.asitbiotech.com&esheet=51750920&newsitemid=20180130005980&lan=en-US&anchor=www.asitbiotech.com&index=3&md5=8b9d7e9069109b091cd70365c4936240", "http://www.businesswire.com/news/home/20180130005980/en/"], "published": "2018-01-30T19:45:00.000+02:00", "crawled": "2018-01-30T20:35:42.023+02:00", "highlightTitle": ""}