{"organizations": [], "uuid": "26aefd753957e3203d4cdd7f72f555f0e23207d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-happyco-expands-executive-team-crosses-one-million-units-mark.html", "country": "US", "domain_rank": 767, "title": "HappyCo Expands Executive Team, Crosses One Million Units Mark", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-08T16:00:00.000+02:00", "replies_count": 0, "uuid": "26aefd753957e3203d4cdd7f72f555f0e23207d0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-happyco-expands-executive-team-crosses-one-million-units-mark.html", "ord_in_thread": 0, "title": "HappyCo Expands Executive Team, Crosses One Million Units Mark", "locations": [], "entities": {"persons": [{"name": "phill claxton", "sentiment": "none"}, {"name": "andrew vernik", "sentiment": "none"}, {"name": "claxton", "sentiment": "none"}], "locations": [], "organizations": [{"name": "isco", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Major Milestone For Mobile Inspection Platform Follows Recent Additions To Leadership Team\nSAN FRANCISCO--(BUSINESS WIRE)-- HappyCo , a San Francisco-based software company that builds mobile and cloud applications for real-time property operations, today announced that its flagship mobile app Happy Inspector is now being used to manage inspections for more than one million rental units, underscoring the company’s standing as the leading provider of mobile solutions for conducting inspections of residential and commercial properties. The news arrives as HappyCo expands its management team: Phill Claxton will serve as VP Product and Growth and Andrew Vernik has been named VP Finance and Operations.\nClaxton, a 24-year veteran of the technology industry with experience leading startups and multinational operations, brings his expertise in digital marketing, product design and development, operations, and international commercialization to help deliver HappyCo’s solutions to more property managers and operators. Vernik’s decade-plus experience in global investment banking and corporate finance is supplemented by his experience founding his own profitable IT startup at age 15. In his new role, he will apply his skills in financial forecasting and modeling, investor relations, and efficiency and process optimization.\nAlso announced was the promotion of Joe Guarna to VP Strategic Partnerships. Guarna joined the company as its first employee and has headed every non-technical function for HappyCo including sales, marketing, support, operations, and customer success. In his new role, he will continue to broker new partnerships that expand HappyCo’s position as a best-in-class solution that integrates seamlessly with core property management software providers to deliver the most flexible solution to customers.\nAndy Larson, Vice President of Revenue, who has been with HappyCo since 2016, will expand his responsibilities to oversee account management and implementations in addition to sales. Larson has nearly 20 years of experience in the commercial real estate industry, including 15 years of delivering new and emerging technology solutions to the multifamily sector. Vernik and Claxton are part of the company’s long-standing executive team , which includes CEO Jindou Lee, CTO Andrew Mackenzie-Ross, VP of Marketing Jennifer Tyson, Larson and Guarna.\n“The one million-units mark is a key milestone for any company in the multifamily industry,” said CEO Jindou Lee. “It demonstrates to businesses and investors that we are solving real business problems and delivering real value to some of the industry’s most important players. HappyCo is proud to have reached this important landmark, and we look forward to continuing this momentum with the help of our new leadership team additions.”\nHappy Inspector , HappyCo’s flagship product, has seen rapid adoption in the past year among property management companies across the industry. The mobile app offers a sleek, easily-customizable user interface together with a cloud-based data storage solution that drive standardized, high-quality data collection for unit and property inspections to reduce risk and costs, optimize maintenance and turn, and ensure brand standards across property portfolios.\nAbout HappyCo\nHappyCo ( happy.co ) is a San Francisco-based software company that builds mobile and cloud solutions to enable real-time property operations. Its Happy Inspector product is used by thousands of companies and has captured more than 100 million items inspected. The company was founded in 2011 and is privately held.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180108005564/en/\nVerbFactory for HappyCo\nRichard Berman, 415-359-4906\nrichard@verbfactory.com\nSource: HappyCo", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fhappy.co%2Fsolutions%2Fhappy-inspector%2F&esheet=51739134&newsitemid=20180108005564&lan=en-US&anchor=Happy+Inspector&index=3&md5=06288f60cc2604d5d15d8115b501dbaa", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fhappy.co%2F&esheet=51739134&newsitemid=20180108005564&lan=en-US&anchor=happy.co&index=4&md5=5c92938d73222f07911789443b0dee16", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.happy.co&esheet=51739134&newsitemid=20180108005564&lan=en-US&anchor=HappyCo&index=1&md5=e882fba6956e66253f805776ad19a267", "http://www.businesswire.com/news/home/20180108005564/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fhappyco.com%2Fcompany%2Fmanagement-team%2F&esheet=51739134&newsitemid=20180108005564&lan=en-US&anchor=long-standing+executive+team&index=2&md5=58598abdc264b048c085b27df4814db0"], "published": "2018-01-08T16:00:00.000+02:00", "crawled": "2018-01-08T17:10:21.048+02:00", "highlightTitle": ""}