{"organizations": [], "uuid": "18ad241465c32fd872afcddd038bc98a24748c9b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.topix.com/rss/wire/business/telecom", "section_title": "", "url": "https://www.reuters.com/article/global-markets/global-markets-dollar-up-after-fed-minutes-world-shares-hold-record-highs-idUSL1N1OY1AG", "country": "US", "domain_rank": 408, "title": "Global Markets-Dollar up after Fed minutes, world shares hold record highs", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T23:49:00.000+02:00", "replies_count": 0, "uuid": "18ad241465c32fd872afcddd038bc98a24748c9b"}, "author": "", "url": "https://www.reuters.com/article/global-markets/global-markets-dollar-up-after-fed-minutes-world-shares-hold-record-highs-idUSL1N1OY1AG", "ord_in_thread": 0, "title": "Global Markets-Dollar up after Fed minutes, world shares hold record highs", "locations": [], "entities": {"persons": [{"name": "stephanie kelly", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "fed", "sentiment": "negative"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Stock markets globally start 2018 on cheerful note\n* S&P cruises past 2,700 as tech stocks advance\n* Dollar up after strong U.S. data, ahead of Fed minutes (Updates with reaction to Fed minutes; adds commentary)\nBy Stephanie Kelly\nNEW YORK, Jan 3 (Reuters) - The U.S. dollar extended gains against key currencies on Wednesday after the release of minutes from last month’s Federal Reserve meeting, while world shares smashed records on investor optimism in the new year.\nThe dollar index rose 0.33 percent, with the euro down 0.36 percent to $1.2013.\nThe euro fell to a session low versus the dollar after the release of minutes from last month’s Federal Reserve meeting. During the meeting, Fed policy makers decided to raise short-term interest rates for a third time in 2017.\nAccording to the minutes, policymakers showed worry over the fate of currently low inflation and saw recent tax changes as providing a boost to consumer spending.\n“I would say there’s a little bit of a hawkish tilt in the minutes here,” said Charlie Ripley, senior investment strategist at Allianz Investment Management in Minneapolis.\n“If you think about some of the stuff from the previous statement, there wasn’t a ton of change. Really, I think the discussion is centered around the inflation topic.”\nThe dollar had already snapped a three-week losing streak earlier on Wednesday, after stronger-than-forecast U.S. manufacturing and construction data.\nThe Japanese yen weakened 0.21 percent versus the greenback at 112.53 per dollar, while Sterling was last trading at $1.3512, down 0.54 percent on the day.\nBenchmark U.S. Treasury 10-year notes last rose 5/32 in price to yield 2.4471 percent, from 2.465 percent late on Tuesday.\nThe 30-year bond last rose 16/32 in price to yield 2.7855 percent, from 2.81 percent late on Tuesday.\nHawkish comments from two European Central Bank officials sent yields higher on Tuesday, with the 10-year German Bund yield hitting a two-month peak and the five-year U.S. yield reaching its highest level since April 2011.\nSTOCKS HOLD GAINS MSCI’s gauge of stocks, which tracks shares in 47 countries, gained 0.40 percent. In 2017, the index’s best year since 2009, it set scores of record highs and rose by one-fifth in value.\nU.S. equities also climbed to fresh highs on Wednesday, propelled by tech stocks. The benchmark S&P 500 breached the 2,700-mark for the first time, while the Nasdaq Composite and the Dow Jones Industrial Average also broke records.\nWall Street held its gains after the release of minutes from the Fed’s policy meeting last month.\n“It emphasizes the message they’ve had out there, that they’ll be data dependent and that they want to try to normalize policy unless there’s an economic slowdown or inflation doesn’t act as expected,” said Sameer Samana, global equity and technical strategist at Wells Fargo Investment Institute in St. Louis.\nThe Dow Jones Industrial Average rose 63.51 points, or 0.26 percent, to 24,887.52, the S&P 500 gained 14.59 points, or 0.54 percent, to 2,710.4 and the Nasdaq Composite added 53.77 points, or 0.77 percent, to 7,060.67.\nTechnology companies Oracle and IBM rose 2.43 percent and 2.87 percent, respectively, following brokerage upgrades. The shares helped boost the S&P technology index 0.93 percent.\nTuesday, the first day of trading in 2018, saw a strong start for the indices, with the S&P and the Nasdaq hitting record closing highs.\nIn Europe, shares closed higher on Wednesday after a rising dollar boosted exporters and Wall Street records lifted optimism as new European market rules took hold. The pan-European STOXX 600 index was up 0.48 percent.\nMeanwhile, MSCI’s broadest index of Asia-Pacific shares outside Japan closed 0.47 percent higher as manufacturing surveys pointed to a strong start for the European economy.\nEmerging market stocks rose 0.58 percent, and Japan’s Nikkei lost 0.08 percent.\nElsewhere, spot gold reached its highest since mid-September on Wednesday, before edging back to $1,312.51 per ounce.\nOil prices hit fresh two-and-a-half year highs as strong output in the United States and Russia balanced tensions from a sixth day of unrest in OPEC member Iran.\nU.S. crude rose 2.2 percent to $61.70 per barrel and Brent was last at $67.83, up 1.89 percent on the day.\nReporting by Stephanie Kelly; Additional reporting by Abhinav Ramnarayan and Oleg Vukmanovic in London, Sruthi Shankar in Bengaluru, Richard Leong, Caroline Valetkevitch and Gertrude Chavez-Dreyfuss in New York, and Henning Gloystein in Singapore; Editing by Nick Zieminski\n ", "external_links": [], "published": "2018-01-03T23:49:00.000+02:00", "crawled": "2018-01-04T00:41:48.003+02:00", "highlightTitle": ""}