{"organizations": [], "uuid": "2d38368afd2a157b5722728b1271309adcc6cd65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222250387&w=1200&r=LYNXMPEE0E1HL", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-mun-stk/united-deal-with-stoke-at-old-trafford-amid-sanchez-talk-idUKKBN1F42OH", "country": "US", "domain_rank": 408, "title": "United deal with Stoke at Old Trafford amid Sanchez talk", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T00:09:00.000+02:00", "replies_count": 0, "uuid": "2d38368afd2a157b5722728b1271309adcc6cd65"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-mun-stk/united-deal-with-stoke-at-old-trafford-amid-sanchez-talk-idUKKBN1F42OH", "ord_in_thread": 0, "title": "United deal with Stoke at Old Trafford amid Sanchez talk", "locations": [], "entities": {"persons": [{"name": "sanchez", "sentiment": "negative"}, {"name": "romelu lukaku", "sentiment": "none"}, {"name": "anthony martial", "sentiment": "none"}, {"name": "jose mourinho", "sentiment": "none"}, {"name": "alexis sanchez", "sentiment": "none"}, {"name": "moritz bauer", "sentiment": "none"}, {"name": "joe allen", "sentiment": "none"}, {"name": "antonio valencia", "sentiment": "none"}], "locations": [{"name": "old trafford", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "stoke city", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "united", "sentiment": "negative"}, {"name": "liverpool", "sentiment": "none"}, {"name": "stoke city", "sentiment": "none"}, {"name": "manchester city", "sentiment": "none"}, {"name": "stoke city", "sentiment": "none"}, {"name": "manchester united vs stoke city", "sentiment": "none"}, {"name": "manchester united", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "manchester united", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 15, 2018 / 10:11 PM / Updated 7 hours ago United deal with Stoke at Old Trafford amid Sanchez talk 3 Min Read \nMANCHESTER, England (Reuters) - - MANCHESTER UNITED 3 STOKE CITY 0 Soccer Football - Premier League - Manchester United vs Stoke City - Old Trafford, Manchester, Britain - January 15, 2018 Manchester United's Anthony Martial in action with Stoke City’s Moritz Bauer and Joe Allen REUTERS/Andrew Yates \nThe thoughts of Manchester United’s fans may have been on the possible arrival of Alexis Sanchez from Arsenal but the players stayed focussed to beat Stoke City 3-0 in the Premier League at a rainy Old Trafford on Monday. \nTwo superbly taken first-half strikes, from Antonio Valencia and Anthony Martial, put United in command against a spirited Stoke side and Romelu Lukaku made sure of the win midway through the second half with a low drive. \nIt may not have been vintage United but after leaders Manchester City lost their unbeaten league record in a 4-3 reverse at Liverpool on Sunday, it was vital Jose Mourinho’s side took the chance to close the gap at the top to 12 points. \nMourinho omitted winger Henrikh Mkhitaryan from the squad amid reports that Arsenal were interested in him as part of a swap deal for Chile forward Sanchez, who is no longer a target for Manchester City according to British media. \nFull-back Valencia blasted United into a ninth minute lead after cutting inside on to his unfavoured - but still potent - left foot and hammering into the far corner, well beyond the reach of visiting keeper Jack Butland. \nStoke’s new manager Paul Lambert, appointed earlier on Monday, watched from the stands, with the sacked Mark Hughes’ former assistant Eddie Niedzwiecki in charge of the team. SWEET FINISH Soccer Football - Premier League - Manchester United vs Stoke City - Old Trafford, Manchester, Britain - January 15, 2018 Stoke City's Ramadan Sobhi in action with Manchester United's Juan Mata REUTERS/Andrew Yates \nStoke’s Stephen Ireland, making his first start since May 2016, then missed two good chances as the visitors showed plenty of attacking intent. \nBut seven minutes before the interval, United’s French winger Martial made it 2-0 with a sweet first-time finish after being set up by Paul Pogba. Slideshow (12 Images) \nStoke responded positively again, going in at halftime after Xherdan Shaqiri had tested keeper David De Gea with a low drive, but United got a firm grip on the game after the interval. \nIt was not until the 72nd minute though that the home side got the third goal - Lukaku wriggling to find enough space for a shot into the bottom corner after good work from Martial. \n“Stoke bought players to play football, they were not afraid to play and they created us problems in the first half,” said Mourinho. \nNiedzwiecki said he was unclear whether he would remain at the club once former Norwich City and Aston Villa boss Lambert set up his own staff. \n“Paul Lambert said a few words to the players in the hotel before the game but he showed me the respect, it was my team today. I enjoyed the experience but it has been incredibly difficult personally,” he said. \n“I will find out my future in the next 48 hours. I know how the game works.” Reporting by Simon Evans; Editing by Ken Ferris", "external_links": [], "published": "2018-01-16T00:09:00.000+02:00", "crawled": "2018-01-16T00:42:22.000+02:00", "highlightTitle": ""}