{"organizations": [], "uuid": "f246c07e323d623aa85a578af245cd753e775f16", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/01/104874500-GettyImages-647709384-pony-ma.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19854910/device/rss/rss.html", "section_title": "Tech", "url": "https://www.cnbc.com/2018/01/22/tencent-wechat-mini-program-push-takes-aim-at-apple-and-google.html", "country": "US", "domain_rank": 767, "title": "Tencent WeChat mini program push takes aim at Apple and Google", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T16:46:00.000+02:00", "replies_count": 0, "uuid": "f246c07e323d623aa85a578af245cd753e775f16"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/22/tencent-wechat-mini-program-push-takes-aim-at-apple-and-google.html", "ord_in_thread": 0, "title": "Tencent WeChat mini program push takes aim at Apple and Google", "locations": [], "entities": {"persons": [{"name": "hu", "sentiment": "none"}, {"name": "hu renjie", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "south china", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "google tencent holdings", "sentiment": "negative"}, {"name": "tencent", "sentiment": "negative"}, {"name": "app store", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tencent Holdings, China's biggest internet company by market value, is on a collision course with Apple and Alphabet with its aggressive push into mini mobile applications, which allow users to bypass traditional app stores and run programs directly within its WeChat application.\nTencent has re-engineered the WeChat messaging app in a way that applications smaller than 10 megabytes can run instantly on WeChat's interface. It is now offering 580,000 mini programs after just one year of development, compared to the 500,000 mobile apps that Apple's App Store published from 2008 to 2012, according to Hu Renjie, WeChat's mini program director.\n\"The mini program is a brand new product model which can seamlessly link the offline and the online together,\" said Hu, adding that the mini program scheme has attracted 1 million developers.\nAs well as bypassing the need for app stores, mini programs offer speed of access to users because they can be loaded instantly from within WeChat on any operating system.\nMore from the South China Morning Post:\nTencent beats Amazon to launch unmanned shop in Shanghai Surveillance under the sea: how China is listening in near Guam Takeaway congee and Honour of Kings help Chinese men outspend women online Tencent's move to bundle apps within WeChat could hurt Apple and Alphabet as the two US tech giants rely on their own universe of apps to enrich the use of their respective iOS and Android systems.\nIn a measure of the size of the threat that mini programs present, WeChat already has a user base of 980 million globally, which is larger than the population of the European Union and Russia combined.\nOne mini program, the Jump Jump mobile game, attracted 400 million players in China in less than three days after becoming available on WeChat's homepage, making it the most popular mobile game in the country.\nTencent recently announced that it had more than 170 million monthly users of its mini programs since their launch in January 2017. A number of international brands, including McDonald's, KFC, Coach and carmaker Tesla, released mini programs for WeChat in the past year, with a Tesla one allowing users to monitor the acceleration rate of their vehicle.\nencent's strategy to transform WeChat into \"an app that runs apps\" is in juxtaposition to Apple and Google, who have built their own ecosystems.\nThe Chinese firm has already had a run-in with Apple, with the US firm updating its App Store review guidelines in April to emphasise that apps cannot offer programs in a \"store or store-like interface\" and asking Tencent to remove a function that allowed WeChat users to pay tips to content and app publishers.\nNormally, in-app purchases would have to go through Apple's payment platform, with Apple taking 30 per cent of the revenue generated. But WeChat's tipping feature used architecture that was not designed to include Apple.\nBut last week, The Wall Street Journal reported that Apple and WeChat had reached a deal which would allow WeChat to resume its tipping feature, while Apple would enjoy part of the profit.\nThomas Graziani, co-founder of a WeChat marketing agency start-up called WalktheChat, said the tipping feature gave WeChat \"an edge over Apple\". App developers and content generators would be incentivised to launch products on WeChat more so than on the App Store because of the tipping feature.\nThe mini program feature could also give WeChat an advantage over Google. With the Google Play app store blocked in China, there is a need for a centralised app market for Android users, which WeChat could meet.\nBut Graziani said there was still room for both platforms to exist.\n\"Mini programs will not replace the mobile app as you know it,\" he said. \"But they are very effective in helping apps like games to acquire new users.\"\nGraziani said mini games launched on WeChat were often simplified or shortened. Companies often released mini games as teasers for regular games in the hope that users would download the original games from the App Store.\nTencent's domestic rivals, Baidu and Alibaba Group Holding – owner of the South China Morning Post – have similar mini program features with their products, while Facebook Messenger has included instant games on its platform.\nAs to how much a 10-megabyte app could accomplish, Phillip Pun, founder of social networking app Plando, said: \"10 megabytes can make for good-sized software and it can be very sophisticated.\"\n\"The app I used to develop was just about 20 megabytes. but it was a full chat app and social network with photo sharing capability,\" he said.", "external_links": [], "published": "2018-01-22T16:46:00.000+02:00", "crawled": "2018-01-22T17:21:59.011+02:00", "highlightTitle": ""}