{"organizations": [], "uuid": "df056314a8f6d7189c9bfe7dcc6026ecf83a2d49", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 12}, "facebook": {"likes": 79, "shares": 79, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226140227&w=1200&r=LYNXMPEE0S00J", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-usa-qatar-airlines/qatar-to-agree-to-new-financial-disclosures-for-state-owned-airline-u-s-officials-idUSKBN1FI00W", "country": "US", "domain_rank": 408, "title": "Qatar to agree to new financial disclosures for state owned-airline: U.S. officials", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T02:25:00.000+02:00", "replies_count": 0, "uuid": "df056314a8f6d7189c9bfe7dcc6026ecf83a2d49"}, "author": "", "url": "https://www.reuters.com/article/us-usa-qatar-airlines/qatar-to-agree-to-new-financial-disclosures-for-state-owned-airline-u-s-officials-idUSKBN1FI00W", "ord_in_thread": 0, "title": "Qatar to agree to new financial disclosures for state owned-airline: U.S. officials", "locations": [], "entities": {"persons": [{"name": "david shepardson", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "qatar", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "delta air lines inc", "sentiment": "none"}, {"name": "united continental holdings inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "qatar airways", "sentiment": "none"}, {"name": "american airlines group inc", "sentiment": "none"}, {"name": "state department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - Qatar is expected to agree on Tuesday to release detailed financial information about its state-owned Qatar Airways, U.S. State Department officials said late on Sunday, a move that follows pressure from U.S. airlines for it to disclose any potential subsidies it has received.\nUnder an understanding to be announced Tuesday, Qatar Airways will issue audited financial reports within a year and within two years must disclose significant new transactions with state-owned enterprises, U.S. officials said.\nQatar Airways and the Qatari government could not immediately be reached late Sunday.\nThe largest U.S. carriers - American Airlines Group Inc ( AAL.O ), United Continental Holdings Inc ( UAL.N ) and Delta Air Lines Inc ( DAL.N ) - since 2015 have urged the U.S. government to challenge the conduct of three major Middle Eastern carriers under “Open Skies” agreements. The U.S. airlines contend the Gulf carriers are being unfairly subsidized by their governments with more than $50 billion in subsidies over the last decade.\nQatar, Etihad Airways and Emirates, have denied those accusations. The Gulf airlines operate around 200 flights per week to 12 U.S. cities.\nQatar and the United States are expected to disclose details of the understanding on aviation issues at a U.S.-Qatar strategic dialogue in Washington on Tuesday that will include U.S. Secretary of State Rex Tillerson and Defense Secretary James Mattis, along with senior Qatari officials, U.S. State Department officials said. They spoke on the condition of anonymity because the agreement has not been made public.\nThe voluntary agreement follows extensive negotiations with senior U.S. and Qatari officials in recent weeks. Qatar’s Civil Aviation authority told the U.S. government that Qatar Airways has no current plans to offer so-called “fifth freedom flights” that allow an airline to fly between foreign countries as a part of services to and from its home country.\nQatar must take steps to ensure that the transactions are conducted on commercial terms. The disclosures could help U.S. carriers make the case that the airline is getting unfair government subsidies.\nThe voluntary agreement does not to apply to Etihad or Emirates, both based in the United Arab Emirates. The State Department plans new talks with UAE as early as next week, U.S. officials said.\nIn a Sept. 14 White House memo disclosed by Reuters and other outlets in December, Trump administration officials agreed the U.S. government “should take action to address the unfair behavior of Gulf carriers.”\nU.S. smaller airlines grouped under the U.S. Airlines for Open Skies Coalition said in December it was “confident further investigation by the Trump administration will show the claims for what they are: a political ploy to protect themselves from competition and limit choice for U.S. travelers.”\nThe coalition represents Atlas Air Worldwide Holdings Inc ( AAWW.O ), FedEx Corp ( FDX.N ), Hawaiian Airlines, and JetBlue Airways Corp ( JBLU.O ).\nReporting by David Shepardson; Editing by Cynthia Osterman\n ", "external_links": [], "published": "2018-01-29T02:25:00.000+02:00", "crawled": "2018-01-29T02:36:09.086+02:00", "highlightTitle": ""}