{"organizations": [], "uuid": "c7eb477b3d262042b043a98845b58c85eea980c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-west-central-food-service-enters-new-year-with-the-deployment-of-extensive-corporate-expansion-initiatives.html", "country": "US", "domain_rank": 767, "title": "West Central Food Service Enters New Year with the Deployment of Extensive Corporate Expansion Initiatives", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T15:11:00.000+02:00", "replies_count": 0, "uuid": "c7eb477b3d262042b043a98845b58c85eea980c2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-west-central-food-service-enters-new-year-with-the-deployment-of-extensive-corporate-expansion-initiatives.html", "ord_in_thread": 0, "title": "West Central Food Service Enters New Year with the Deployment of Extensive Corporate Expansion Initiatives", "locations": [], "entities": {"persons": [{"name": "michael dodo", "sentiment": "negative"}, {"name": "danny meza", "sentiment": "none"}, {"name": "daniel meza", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "west central food service", "sentiment": "negative"}, {"name": "wcf", "sentiment": "none"}, {"name": "southern fresh produce & provisions", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES, At the start of this New Year, Michael Dodo, President and CEO of West Central Food Service, a premium wholesale food and restaurant supply distribution company, penned a multi-million dollar deal with industry leader, and former Southern Fresh Produce & Provisions President Daniel Meza. In this joint agreement, West Central Food Service not only garners Daniel Meza and his trade expertise, stellar reputation and forty plus years of industry knowledge and experience, but also the Southern Fresh Produce & Provisions key corporate assets including their expert sales force, extensive customer base, supply chain, and staff.\n\"Danny Meza brings four decades of produce knowledge and customer interaction to WCF. His wisdom and maturity adds tremendous value to my company and team of employees, and I'm simply thrilled to have him on board as new key member of our executive team.\" - Michael Dodo, President and CEO, West Central Food Service.\n\"When I decided that it was time to consider a change, I knew that our choice of partner had to be highly selective and incredibly strategic. I realized that WCF was unquestionably the right choice for us, and Mike Dodo would be an excellent colleague to help grow and evolve my legacy. I am greatly looking forward to embarking on this new chapter of my professional life at West Central Food Service.\" - Daniel Meza.\nIn addition, on January 2nd, West Central Food Service began operating out of their new state-of-the-art, 130,140 sq ft warehouse facility in Union City, CA, equipped with 31 doc doors and multiple temperature controlled storage areas.\n\"This facility expansion allows WCF to better serve our current San Francisco and Napa Valley customer base, while concurrently allowing for growth and new business development. It's a really exciting time for us at WCF.\" - Michael Dodo, President and CEO, West Central Food Service.\nABOUT WEST CENTRAL FOOD SERVICE:\nFounded in 1969, West Central Food Service is one of largest premium wholesale food, beverage and restaurant supply distributors on the West Coast. With distribution centers in Norwalk, San Diego, Union City, Arizona and Las Vegas, each facility is custom-designed with temperature controlled units to provide the best quality produce, proteins, beverages, dairy, organic, dry groceries, specialty items, and paper goods for hotels, restaurants, casinos, schools, cruise lines and catering companies. www.westcentralfoods.com\nThis press release was issued through 24-7PressRelease.com . For further information, visit http://www.24-7pressrelease.com .\n releases/west-central-food-service-enters-new-year-with-the-deployment-of-extensive-corporate-expansion-initiatives-300582879.html\nSOURCE West Central Food Service", "external_links": ["http://www.prnewswire.com/news-releases/west-central-food-service-enters-new-year-with-the-deployment-of-extensive-corporate-expansion-initiatives-300582879.html", "http://www.westcentralfoods.com/"], "published": "2018-01-16T15:11:00.000+02:00", "crawled": "2018-01-16T16:16:44.000+02:00", "highlightTitle": ""}