{"organizations": [], "uuid": "f0e14b0d8f27ca16fd5331c2c548a9825844b393", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-samson-resources-ii-llc-announces-2018-capital-program.html", "country": "US", "domain_rank": 767, "title": "Samson Resources II, LLC Announces 2018 Capital Program", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T16:00:00.000+02:00", "replies_count": 0, "uuid": "f0e14b0d8f27ca16fd5331c2c548a9825844b393"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-samson-resources-ii-llc-announces-2018-capital-program.html", "ord_in_thread": 0, "title": "Samson Resources II, LLC Announces 2018 Capital Program", "locations": [], "entities": {"persons": [{"name": "samson", "sentiment": "negative"}, {"name": "mowry", "sentiment": "none"}], "locations": [{"name": "okla.", "sentiment": "none"}, {"name": "tulsa", "sentiment": "none"}, {"name": "green river basin", "sentiment": "none"}, {"name": "wyoming", "sentiment": "none"}, {"name": "green river", "sentiment": "none"}, {"name": "powder river", "sentiment": "none"}, {"name": "powder river basin", "sentiment": "none"}], "organizations": [{"name": "llc", "sentiment": "negative"}, {"name": "samson resources ii", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "shannon / frontier / turner / niobrara", "sentiment": "none"}, {"name": "the company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TULSA, Okla., Jan. 4, 2018 /PRNewswire/ -- Samson Resources II, LLC (\"Samson\" or the \"Company\") announced today that its board of directors has approved a 2018 total capital budget in the range of $105 to $115 MM. The capital program is designed to enhance shareholder value by growing 2018 production volumes by approximately 20 percent as compared to 2017 exit production rates and advancing the delineation and development of the company's core assets while maintaining a positive net cash position. The Company anticipates spending $85 to $95 MM toward its drilling and completion program and approximately $20 MM toward its leasing, seismic, recompletion and workover program.\nSome highlights of the 2018 Capital Program are as follows:\nThe Company plans to drill approximately 25 to 30 gross wells and 15 to 20 net wells in the Powder River and the Green River Basin(s), Wyoming. The focus in the Powder River Basin will be to further delineate the potential of the Shannon / Frontier / Turner / Niobrara and Mowry formations The focus in the Green River will be to further develop the Company's extensive Fort Union / Lewis assets. Deliver anticipated cash return on invested capital of 20 percent or better. The capital program will be funded from operating cash flows and cash on–hand. Samson has approximately $200 MM of liquidity (pro-forma for the Wamsutter divestiture) with approximately $95 MM of cash available for use and a $107 MM undrawn RBL Revolver for future investment opportunities. Capital program is expected to deliver approximately 20 percent oil growth year-over-year as compared to 2017 exit volumes. The Company expects to divest an additional $40 to $60 MM of non-core assets in 2018 (which includes the previously announced sale of the Wamsutter assets, that will close in January 2018) to maintain additional financial flexibility. The Company sold over $540 MM of assets in 2017.\n\"Our 2018 investment plan will allow Samson to further delineate the large reserve potential across our assets while generating expected strong production growth at very attractive returns,\" said Joseph Mills, President and Chief Executive Officer of Samson. \"Samson is focused on delivering shareholder return with a balanced and low risk growth strategy. Samson today has a strong balance sheet and ample liquidity to drive superior returns from the drill bit.\"\nSamson is a privately held onshore exploration and production company headquartered in Tulsa, Oklahoma.\nForward-Looking Statements\nIn this press release, all statements that are not purely historical facts are forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Forward-looking statements may be identified by the words \"believe,\" \"expect,\" \"anticipate,\" \"project,\" plan,\" \"estimate,\" intend,\" \"potential\" and other similar expressions. Forward-looking statements are based on currently available business, economic, financial and other information and reflect management's current beliefs, expectations and views with respect to future developments and their potential effects on Samson. Actual results could vary materially depending on risks and uncertainties that may affect Samson and its business. Samson's actual actions and results may differ materially from what is expressed or implied by these statements due to a variety of factors, including (a) the ability of Samson to perform well and compete effectively, (b) the impact of restrictions in Samson's Senior Credit Facility on its ability to make capital investments and pursue strategic growth opportunities, (c) the ability of Samson to continue to attract and retain qualified employees, and (d) other risks and uncertainties as disclosed by Samson in the future. Samson assumes no obligation to update any forward-looking statement made in this press release to reflect subsequent events or circumstances or actual outcomes.\nView original content: http://www.prnewswire.com/news-releases/samson-resources-ii-llc-announces-2018-capital-program-300577431.html\nSOURCE Samson Resources II, LLC", "external_links": ["http://www.prnewswire.com/news-releases/samson-resources-ii-llc-announces-2018-capital-program-300577431.html"], "published": "2018-01-04T16:00:00.000+02:00", "crawled": "2018-01-04T16:35:26.001+02:00", "highlightTitle": ""}