{"organizations": [], "uuid": "4078b350d5992a0ef4e637582b8bd0391387f0e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222721036&w=1200&r=LYNXMPEE0G0TQ", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-philippines-politics/philippine-senators-say-quick-revision-of-charter-impossible-idUKKBN1F61HR", "country": "US", "domain_rank": 408, "title": "Philippine senators say quick revision of charter impossible", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T14:40:00.000+02:00", "replies_count": 0, "uuid": "4078b350d5992a0ef4e637582b8bd0391387f0e9"}, "author": "", "url": "https://uk.reuters.com/article/uk-philippines-politics/philippine-senators-say-quick-revision-of-charter-impossible-idUKKBN1F61HR", "ord_in_thread": 0, "title": "Philippine senators say quick revision of charter impossible", "locations": [], "entities": {"persons": [{"name": "duterte", "sentiment": "none"}, {"name": "rodrigo duterte", "sentiment": "none"}], "locations": [{"name": "philippines", "sentiment": "none"}, {"name": "manila", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "house of representatives", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 12:43 PM / Updated 9 minutes ago Philippine senators say quick revision of charter impossible Reuters Staff 2 Min Read \nMANILA (Reuters) - Philippine senators said on Wednesday it was not possible to amend the constitution to create a federal government in two months as proposed by the lower house which would allow the president a second term in office. \nSupporters of the change hope to complete the amendments within two months and hold a referendum in May. \nThe Senate’s opposition to the House of Representatives’ plan to hastily amend the charter makes it hard to switch to a federal system this year. Any delays would create political uncertainty. \nThe push to change the constitution has been a divisive issue in the Philippines, with critics accusing lawmakers of trying to prolong their stay in office. \nPresident Rodrigo Duterte has said he has no desire to stay longer than his current term, which ends in 2022, and, if anything, would prefer to retire early. \nThe switch to a federal system was one of Duterte’s key promises in the election campaign, aiming to remedy what he saw as neglect by a Manila-centric political establishment. \nHis allies in the lower house voted on Tuesday to amend the constitution, favouring the expansion of the two legislative chambers, longer terms for all elected officials and greater fiscal autonomy for the provinces. \nThe upper house’s second highest official, Ralph Recto, said the proposal in the House of Representatives to amend the charter with just 10 weeks of the congressional session left appeared to be “dead in the Senate”. \n“Clearly, we cannot do it in 10 session weeks,” said Recto, with some of his colleagues opposing any revision in the 1987 constitution. Other senators, who supported amendments, agreed the changes have to be studied and should not be rushed. \n(This version of the story changes day to Wednesday in the first paragraph) Reporting by Manuel Mogato; Editing by Nick Macfie", "external_links": [], "published": "2018-01-17T14:40:00.000+02:00", "crawled": "2018-01-17T14:54:50.060+02:00", "highlightTitle": ""}