{"organizations": [], "uuid": "8e93e56dc7226b6faf8613c0e33f51e6f2e81fcb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 190, "shares": 190, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180107&t=2&i=1220028315&w=1200&r=LYNXMPEE060EQ", "site_section": "http://feeds.reuters.com/reuters/topNews", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-usa-court-election/with-renewed-vigor-u-s-top-court-scrutinizes-curbs-on-voting-idUSKBN1EW0HG", "country": "US", "domain_rank": 408, "title": "With renewed vigor, U.S. top court scrutinizes curbs on voting", "performance_score": 1, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T15:12:00.000+02:00", "replies_count": 0, "uuid": "8e93e56dc7226b6faf8613c0e33f51e6f2e81fcb"}, "author": "", "url": "https://www.reuters.com/article/us-usa-court-election/with-renewed-vigor-u-s-top-court-scrutinizes-curbs-on-voting-idUSKBN1EW0HG", "ord_in_thread": 0, "title": "With renewed vigor, U.S. top court scrutinizes curbs on voting", "locations": [], "entities": {"persons": [{"name": "andrew chung", "sentiment": "none"}, {"name": "libertie", "sentiment": "none"}, {"name": "stuart naifeh", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "u.s. supreme court", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 7, 2018 / 1:12 PM / Updated 6 hours ago With renewed vigor, U.S. top court scrutinizes curbs on voting Andrew Chung 6 Min Read \nWASHINGTON (Reuters) - Government officials across the United States try to maintain accurate voter rolls by removing people who have died or moved away. But a case coming before the U.S. Supreme Court on Wednesday explores whether some states are aggressively purging voter rolls in a way that disenfranchises thousands of voters. \nThe justices will hear arguments in Republican-governed Ohio’s appeal of a lower court ruling that blocked its policy of erasing from voter registration lists people who do not regularly cast a ballot. Under the policy, such registration is deleted if the person goes six years without either voting or contacting state voting officials. \n“Voting is the foundation of our democracy, and it is much too important to treat as a ‘use it or lose it’ right,” said Stuart Naifeh, a voting rights lawyer with liberal advocacy group Demos, which is representing plaintiffs challenging Ohio’s policy along with the American Civil Liberties Union. \nVoting rights has been an important theme before the Supreme Court during their nine-month term that began in October, in particular the question of whether actions by state leaders have disenfranchised thousands of voters either by marginalizing their electoral clout or by prohibiting them from voting. \nTwo other cases could have a big impact on U.S. elections. At issue is whether Republican-drawn electoral districts in Wisconsin and Democratic-drawn districts in Maryland were fashioned to entrench the majority party in power in such an extreme way that they violated the constitutional rights of certain voters. The practice is called partisan gerrymandering. \nThe conservative-majority court also could take up other voting rights disputes this term including a bid by Texas to revive Republican-drawn electoral districts that were thrown out by a lower court for discriminating against black and Hispanic voters. \nMost states periodically cleanse their voter rolls to prevent irregularities, such as someone voting more than once on Election Day. Ohio is one of seven states, along with Georgia, Montana, Oklahoma, Oregon, Pennsylvania and West Virginia, that purge infrequent voters from registration lists, according to the plaintiffs who sued Ohio in 2016. \n“Among those, Ohio is the most aggressive. It has the shortest timeline for removing people for non-voting,” Naifeh said. \n‘EFFICIENCY AND INTEGRITY’ \nRepublican Ohio Secretary of State Jon Husted noted that the state’s policy has been in place since the 1990s under Republican and Democratic secretaries of state. “Maintaining the integrity of the voter rolls is essential to conducting an election with efficiency and integrity,” Husted said when the court agreed to hear the case last May. \nIn Ohio, registered voters do not vote for two years are sent registration confirmation notices. If they do not respond and do not vote over the following four years, they are purged. FILE PHOTO: Voting stickers are seen as voters cast their ballots for the Ohio primary at Saint Columba Social Hall in Youngstown, Ohio March 15, 2016. REUTERS/Aaron P. Bernstein/File Photo \nDemocrats have accused Republicans of taking steps at the state level, including laws requiring certain types of government-issued identification, intended to suppress the vote of minorities, poor people and others who generally favor Democratic candidates. \nA 2016 Reuters analysis found roughly twice the rate of voter purging in Democratic-leaning neighborhoods in Ohio’s three largest counties as in Republican-leaning neighborhoods. \nThe 6th U.S. Circuit Court of Appeals in Cincinnati ruled in September 2016 that Ohio’s policy ran afoul of a 1993 law that prohibits states from striking registered voters “by reason of the person’s failure to vote.” \nFollowing that ruling, about 7,500 Ohio voters who otherwise would have been barred were able to cast ballots in the November 2016 election, the state said. A total of 5.6 million ballots were cast statewide. FILE PHOTO: Voters cast their votes during the U.S. presidential election in Elyria, Ohio, U.S. November 8, 2016. REUTERS/Aaron Josefczyk/File Photo \nEven as courts have invalidated Republican-drawn electoral districts targeting racial minorities, partisan gerrymandering and purging of voter rolls have emerged as tools to suppress voting, voting rights advocates said. \n“What we’re seeing is a real moment as to whether or not we’re going to be a country that makes voting free, fair and accessible, or are we going to put a bunch of barriers in front of the ballot box,” said Myrna Pérez, director of the voting rights and elections project at New York University School of Law’s Brennan Center for Justice. \nOther experts called Ohio’s policy reasonable to maintain ballot integrity. \n“To suppress is utter nonsense. What we are doing is enforcing the law,” said Bradley Schlozman, who supervised the U.S. Justice Department’s voting section under Republican former President George W. Bush. \n“All voting cases now seem to take on this political flavor and each side now ascribes impure and partisan motives to the other. It’s unfortunate,” Schlozman added. \nOne Ohio man, a Trumbull County truck driver and Army veteran, said in an affidavit supporting the plaintiffs in the lawsuit he was “completely blindsided” after learning he was no longer registered to vote for the 2016 election. The last time he voted, he said, was in 2008. He told a county election board official by email that he is a U.S. citizen born in Ohio and should be reinstated to the rolls. \nIf not, he suggested also purging his name as a taxpayer. \n“We’ll call us square!” the man wrote. Reporting by Andrew Chung; Editing by Will Dunham", "external_links": [], "published": "2018-01-07T15:12:00.000+02:00", "crawled": "2018-01-07T15:21:20.004+02:00", "highlightTitle": ""}