{"organizations": [], "uuid": "24f04c65048d7aa2bcd05f03af729697e6469eab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224248516&w=1200&r=LYNXMPEE0L1YG", "site_section": "http://feeds.reuters.com/reuters/INentertainmentNews\r", "section_title": "Reuters: Entertainment News", "url": "https://in.reuters.com/article/fashion-paris-hautecouture-dior/with-swirls-and-cages-dior-goes-surrealist-for-haute-couture-week-idINKBN1FB2RG", "country": "US", "domain_rank": 408, "title": "With swirls and cages, Dior goes surrealist for Haute Couture week", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T21:39:00.000+02:00", "replies_count": 0, "uuid": "24f04c65048d7aa2bcd05f03af729697e6469eab"}, "author": "", "url": "https://in.reuters.com/article/fashion-paris-hautecouture-dior/with-swirls-and-cages-dior-goes-surrealist-for-haute-couture-week-idINKBN1FB2RG", "ord_in_thread": 0, "title": "With swirls and cages, Dior goes surrealist for Haute Couture week", "locations": [], "entities": {"persons": [{"name": "christian dior", "sentiment": "none"}, {"name": "rene magritte", "sentiment": "none"}, {"name": "salvador dali", "sentiment": "none"}], "locations": [{"name": "paris", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "lvmh", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 7:44 PM / Updated an hour ago With swirls and cages, Dior goes surrealist for Haute Couture week Reuters Staff 2 Min Read \nPARIS (Reuters) - Christian Dior plunged spectators into a surrealist dreamworld on Monday at Paris’ Haute Couture week, as models dressed in black-and-white hypnotic patterns took to the runway under sculptures of body parts suspended from the ceiling. \nThe LVMH ( LVMH.PA ) label unveiled its latest collection on the first day of a fashion week dedicated to the highest echelon of couturiers, which runs until Jan. 25. The creations, often handmade, are not meant for shops, and when sold are usually exclusively tailored to one person. \nDior showed off its almost completely monochrome outfits on a chequered catwalk. Models peered out from behind facemasks: some feline, others like mailboxes, all of them black. \nFamed Surrealist artists such as Salvador Dali or Rene Magritte often depicted bird cages or disjointed body parts in their art, a motif evoked in the show with giant noses and ears dangling over the runway and cage-like corsets worn on it. Slideshow (10 Images) \nGowns and capes strewn with feathers or featuring waspy, see-through fabrics also gave the collection a dream-like feel, as did the geometric patterns or swirls on many dresses. \n“Black and white is the colour of the subconscious and I think when you dream, you dream in black and white, so I decided it would be great to make a collection in black and white,” Dior’s chief designer Maria Grazia Chiuri told Reuters after the show. \nChiuri said in a press release she was also inspired by Italian Surrealist artist Leonor Fini, a friend of Christian Dior, the late founder of the house in the last 1940s. \nThe fashion house is set to host a masqued ball later on Monday, also in the grounds of Paris’ Rodin museum, the setting for the show. \nDior’s latest collection from Chiuri comes amid a shake-up at the label, as former Fendi boss Pietro Beccari prepares to replace long-standing CEO Sidney Toledano, who is moving to run several other labels in the LVMH group. Reporting by Johnny Cotton, Writing by Sarah White, Editing by William Maclean", "external_links": [], "published": "2018-01-22T21:39:00.000+02:00", "crawled": "2018-01-22T22:14:38.024+02:00", "highlightTitle": ""}