{"organizations": [], "uuid": "29da4072528d3599fb6c2818f9bdb986627f2478", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-dollar-rises-after-6-weeks-of-losses-idUSL8N1PO1I9", "country": "US", "domain_rank": 408, "title": "FOREX-Dollar rises after 6 weeks of losses", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T16:46:00.000+02:00", "replies_count": 0, "uuid": "29da4072528d3599fb6c2818f9bdb986627f2478"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-dollar-rises-after-6-weeks-of-losses-idUSL8N1PO1I9", "ord_in_thread": 0, "title": "FOREX-Dollar rises after 6 weeks of losses", "locations": [], "entities": {"persons": [{"name": "saikat chatterjee", "sentiment": "none"}, {"name": "alvin tan", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "fed", "sentiment": "none"}, {"name": "societe generale", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Dollar set to decline 3 percent on a monthly basis\n* German bond yields rise to multi-year highs\n* Graphic: World FX rates in 2017 tmsnrt.rs/2egbfVh\nBy Saikat Chatterjee\nLONDON, Jan 29 (Reuters) - The dollar edged higher against a basket of currencies on Monday, helped by rising bond yields and a week packed with U.S. data starting with a central bank policy decision, though the broader outlook remained murky for the greenback.\nConflicting signals from top U.S. officials last week did little to discourage bearish positions, with net short dollar bets increasing to their highest level since October, according to latest positioning data. The dollar is set to post its biggest monthly decline since March 2016.\n“The dollar is getting some help from higher U.S. yields and we have the Fed and the jobs data this week, but the broader story remains selling the greenback into any rallies,” said Alvin Tan, a currency strategist at Societe Generale in London.\nAgainst a basket of currencies, the dollar bounced a quarter of a percent higher to 89.30 after scoring six consecutive weeks of losses.\nOn a monthly basis it is set to fall 3 percent.\nOver the last decade, including the global financial crisis in 2008, it has fallen only 10 times by that extent, according to Thomson Reuters data.\nTreasury Secretary Steven Mnuchin gave U.S. currency bears a major boost last week with a tacit endorsement of a weak dollar. While Trump tried to row back from those comments, the damage had already been done and the dollar’s downturn since November showed little sign of abating.\nThe greenback is also losing its relative yield attraction for investors. Short-term interest rates are expected to rise in other countries as the European Central Bank and many others start to scale back their easy monetary policy.\nBond yields in Germany jumped to multi-year highs on Monday after weekend comments from Dutch central bank president Klaas Knot that the ECB should be clear on ending asset purchases after September.\nAgainst the yen, the dollar was up 0.3 percent to trade at 108.95 yen, after hitting a low of 108.28 yen on Friday, its lowest level since mid-September.\nComments from Bank of Japan Governor Haruhiko Kuroda in Davos on Friday that the central bank is finally close to the inflation target sparked expectation of an exit from its massive stimulus.\n“Many foreign players are now betting on a BOJ policy change. The dollar/yen has no major support if it falls below its September low of 107.32. A break of that level probably means a shift to a new trading range,” said Yukio Ishizuki, senior strategist at Daiwa Securities.\nThe euro traded at $1.2400, down 0.2 percent and off a three-year peak of $1.2538 touched on Thursday.\nIts failure over the past couple of days to stay above $1.25 is seen by some traders as a sign of fatigue in its six-week old rally.\nData from U.S. financial watchdog Commodity Futures Trading Commission showed speculators’ net long position in the euro/dollar futures traded in Chicago rose to a record high, suggesting that profit-taking could be on the cards.\nFor Reuters Live Markets blog on European and UK stock markets see reuters://realtime/verb=Open/url=http://emea1.apps.cp.extranet.thomsonreuters.biz/cms/?pageId=livemarkets (Reporting by Saikat Chatterjee; Additional reporting by Hideyuki Sano in TOKYO; Editing by Gareth Jones)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://emea1.apps.cp.extranet.thomsonreuters.biz/cms/?pageId=livemarkets", "http://tmsnrt.rs/2egbfVh", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-29T16:46:00.000+02:00", "crawled": "2018-01-29T15:12:32.009+02:00", "highlightTitle": ""}