{"organizations": [], "uuid": "2717110a998fe0b55c4c76b9e05fcf5953d40ccb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/11/gettyimages-872375924.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/05/fire-and-fury-author-trump-least-credible-man/", "country": "US", "domain_rank": 1196, "title": "'Fire and Fury' Author Michael Wolff Defends His Book Against Trump | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.929, "site_type": "news", "published": "2018-01-05T14:51:00.000+02:00", "replies_count": 0, "uuid": "2717110a998fe0b55c4c76b9e05fcf5953d40ccb"}, "author": "Natasha Bach", "url": "http://fortune.com/2018/01/05/fire-and-fury-author-trump-least-credible-man/", "ord_in_thread": 0, "title": "'Fire and Fury' Author Michael Wolff Defends His Book Against Trump | Fortune", "locations": [], "entities": {"persons": [{"name": "natasha bach", "sentiment": "negative"}, {"name": "michael wolff", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "sloppy steve", "sentiment": "none"}, {"name": "— donald j. trump", "sentiment": "none"}, {"name": "wolff", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [], "organizations": [{"name": "trump white house", "sentiment": "none"}, {"name": "twitter", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "nbc", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Natasha Bach 12:51 PM EST \nDonald Trump may vehemently deny much of the content in Michael Wolff’s book about the inner workings of the Trump White House, but Wolff isn’t backing down. \nWolff, the journalist and author of Fire and Fury: Inside the Trump White House , spoke on NBC’s “Today” show Friday, defending his book and reasserting that he had in fact spoken with Trump on the record—though Trump may not have realized it was an interview. \nOn Thursday, Trump took to Twitter , denying that he had given Wolff access to the White House, and called the book phony, “full of lies, misrepresentations and sources that don’t exist.” I authorized Zero access to White House (actually turned him down many times) for author of phony book! I never spoke to him for book. Full of lies, misrepresentations and sources that don’t exist. Look at this guy’s past and watch what happens to him and Sloppy Steve! \n— Donald J. Trump (@realDonaldTrump) January 5, 2018 \nIn his Friday interview with NBC, Wolff responded to Trump’s allegations, saying that “Whether he realized it was an interview or not, I don’t know, but it certainly was not off the record.” \n“I spent about three hours with the president over the course of the campaign and in the White House, so my window into Donald Trump is pretty significant,” he continued. Like “every journalist,” Wolff contended that he has recordings and notes to corroborate what he put in his book, saying that he is “in every way comfortable with everything [he’s] reported.” \nRead: Ivanka Trump Wants to Be the First Woman President, Claims New Book \nWhile some of those quoted in Wolff’s book have denied quotes attributed to them , Wolff doubled down on his overarching conclusions about the president—that Trump is “a man who has less credibility than, perhaps, anyone who has ever walked on earth” and noting the irony that his own credibility was being questioned by such a man. \nRead: A Donald Trump Business Ally Says His Quote in Michael Wolff’s Book is Fake News \nWolff told NBC that everyone he spoke to gave a similar description of Trump, saying the commander-in-chief is “like a child,” with a “need for immediate gratification.” He continued that “100% of the people around Trump…question his intelligence and fitness for office.” \nFire and Fury was released early Friday, despite an order from Trump attorney Charles Harder that the book not be published or disseminated. According to NBC News, the letter “cites defamation, libel, and ‘actual malice’ among the alleged wrongdoings in the book.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-05T14:51:00.000+02:00", "crawled": "2018-01-05T22:34:14.010+02:00", "highlightTitle": ""}