{"organizations": [], "uuid": "9f8a6e809da023eda321ead07c695886a3d3bef0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-kevin-vincent-joins-workhorse-group-as-vice-president-of-government-regulatory-and-safety-affairs.html", "country": "US", "domain_rank": 767, "title": "Kevin Vincent Joins Workhorse Group as Vice President of Government, Regulatory and Safety Affairs.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T16:00:00.000+02:00", "replies_count": 0, "uuid": "9f8a6e809da023eda321ead07c695886a3d3bef0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-kevin-vincent-joins-workhorse-group-as-vice-president-of-government-regulatory-and-safety-affairs.html", "ord_in_thread": 0, "title": "Kevin Vincent Joins Workhorse Group as Vice President of Government, Regulatory and Safety Affairs.", "locations": [], "entities": {"persons": [{"name": "kevin vincent", "sentiment": "negative"}, {"name": "vincent", "sentiment": "none"}], "locations": [{"name": "cincinnati", "sentiment": "none"}, {"name": "d.c", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "safety affairs", "sentiment": "negative"}, {"name": "workhorse group", "sentiment": "negative"}, {"name": "workhorse group inc.", "sentiment": "negative"}, {"name": "nhtsa", "sentiment": "none"}, {"name": "transportation", "sentiment": "none"}, {"name": "epa", "sentiment": "none"}, {"name": "department of transportation", "sentiment": "none"}, {"name": "dot", "sentiment": "none"}, {"name": "national highway traffic safety administration", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CINCINNATI, Jan. 31, 2018 /PRNewswire/ -- Workhorse Group Inc. (NASDAQ: WKHS), an American technology company focused on providing sustainable and cost-effective solutions to the commercial electric transportation sector, today announced that Kevin Vincent has joined the company as Vice President of Government, Regulatory and Safety Affairs.\nMr. Vincent's background includes holding the post of Chief Counsel for the National Highway Traffic Safety Administration (NHTSA), Department of Transportation, in Washington, D.C.\nIn that role, Mr. Vincent provided legal advice to the NHTSA Administrator and other DOT officials, including the General Counsel and Secretary of Transportation, on transportation safety and fuel economy issues. While at NHTSA, Mr. Vincent accelerated adoption by the automobile industry of \"green\" technologies, having managed the drafting of the Corporate Average Fuel Economy (CAFE) greenhouse gas reduction regulations jointly issued by NHTSA and the EPA, leading to adoption of new technologies to improve fuel efficiency. Mr. Vincent's efforts helped result in the historic CAFE/CHG standards for Model Years 2017-2025 light duty vehicles that will double the fuel efficiency of our nation's vehicles.\n\"I strongly support the electrification of vehicles as part of the ongoing transformation of the automobile industry,\" said Mr. Vincent. \"Workhorse is a leader in vehicle technology and electrification. I am very excited to be part of such an innovative team.\"\nIn his new role as Workhorse VP of Government, Regulatory and Safety Affairs, Mr. Vincent will oversee Regulatory Compliance, including the areas of Federal Motor Vehicle Safety Standards (FMVSS) compliance, Corporate Average Fuel Economy (CAFE) Regulations and ZEV Mandate, NHTSA Guidance, and State and Local Regulations, among others.\n\"We are excited to bring Kevin aboard the Workhorse team. Kevin is an industry leader specifically in safety and environmental regulation. His experience as the Chief Counsel of the agency that regulates U.S. auto safety ensures that safety and regulatory compliance are the top priorities for every technology platform that Workhorse develops,\" said Duane Hughes, Workhorse President & COO. \"The expertise he brings to our team is invaluable to us as we continue to introduce new technology advancements within the electric vehicle industry.\"\nAbout Workhorse Group Inc.\nWorkhorse is a technology company focused on providing sustainable and cost-effective solutions to the commercial transportation sector. As an American original equipment manufacturer, we design and build high performance battery-electric vehicles including trucks and aircraft. We also develop cloud-based, real-time telematics performance monitoring systems that are fully integrated with our vehicles and enable fleet operators to optimize energy and route efficiency. All Workhorse vehicles are designed to make the movement of people and goods more efficient and less harmful to the environment. For additional information visit www.workhorse.com .\nForward-Looking Statements\nThis press release includes forward-looking statements. These statements are made under the \"safe harbor\" provisions of the U.S. Private Securities Litigation Reform Act of 1995. These statements may be identified by words such as \"believes,\" \"expects,\" \"anticipates,\" \"estimates,\" \"projects,\" \"intends,\" \"should,\" \"seeks,\" \"future,\" \"continue,\" or the negative of such terms, or other comparable terminology. Forward-looking statements are statements that are not historical facts. Such forward-looking statements are subject to risks and uncertainties, which could cause actual results to differ materially from the forward-looking statements contained herein. Factors that could cause actual results to differ materially include, but are not limited to: our limited operations and need to expand in the near future to fulfill product orders; risks associated with obtaining orders and executing upon such orders; the ability to protect our intellectual property; the potential lack of market acceptance of our products; potential competition; our inability to retain key members of our management team; our inability to raise additional capital to fund our operations and business plan; our inability to maintain our listing of our securities on the Nasdaq Capital Market; our ability to continue as a going concern; our liquidity and other risks and uncertainties and other factors discussed from time to time in our filings with the Securities and Exchange Commission (\"SEC\"), including our annual report on Form 10-K filed with the SEC. Workhorse expressly disclaims any obligation to publicly update any forward-looking statements contained herein, whether as a result of new information, future events or otherwise, except as required by law.\nMedia Contact: Mike Dektas\n513-266-3590\nmike.dektas@workhorse.com\nView original content: http://www.prnewswire.com/news-releases/kevin-vincent-joins-workhorse-group-as-vice-president-of-government-regulatory-and-safety-affairs-300590719.html\nSOURCE Workhorse Group Inc.", "external_links": ["http://www.workhorse.com/", "http://www.prnewswire.com/news-releases/kevin-vincent-joins-workhorse-group-as-vice-president-of-government-regulatory-and-safety-affairs-300590719.html"], "published": "2018-01-31T16:00:00.000+02:00", "crawled": "2018-01-31T17:19:46.019+02:00", "highlightTitle": ""}