{"organizations": [], "uuid": "06239869802c22f92910eb5e429cba97fa03c1ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/16/reuters-america-your-money-be-a-money-superhero-and-cosplay-on-a-budget.html", "country": "US", "domain_rank": 767, "title": "YOUR MONEY-Be a money superhero and cosplay on a budget", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T17:39:00.000+02:00", "replies_count": 0, "uuid": "06239869802c22f92910eb5e429cba97fa03c1ee"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/16/reuters-america-your-money-be-a-money-superhero-and-cosplay-on-a-budget.html", "ord_in_thread": 0, "title": "YOUR MONEY-Be a money superhero and cosplay on a budget", "locations": [], "entities": {"persons": [{"name": "joe", "sentiment": "none"}, {"name": "burbanks mark chu-lin", "sentiment": "none"}, {"name": "chu-lin", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(The writer is a Reuters contributor. The opinions expressed are his own.)\nNEW YORK, Jan 16 (Reuters) - If you ever happen to run into Burbanks Mark Chu-Lin, he might not respond if you call out to him by name.\nThis will be because he is in character as G.I. Joe - or War Machine from the \"Iron Man\" series, or one of the biker scouts from \"Return of the Jedi.\"\nThe 44-year-old is one of the millions of Americans devoted to cosplay those rabid fans of comics and superhero movies who dress up as their favorite characters, and populate massive events all over the country, with the crown jewel being San Diegos annual Comic-Con convention.\nBe forewarned: Cosplay is not cheap. If you are going to role play, it might help if your superhero power is \"Bottomless Bank Account.\"\nChu-Lin, a project analyst, has sometimes spent over $10,000 a year on his hobby even up to $15,000. There are conventions, travel and hotels, attendance badges, souvenirs, and the costumes themselves. Suffice it to say, it all adds up, he said.\nCosplay lovers were estimated to spend $17.8 billion on costumes worldwide in 2017, according to Shanghai-based research firm CRI. And ticketing firm Eventbrite tabulated more than $600 million in annual fandom convention spending in North America, when it analyzed the data in 2013.\nIt is a world that is growing like crazy, said Robin Rosenberg, a New York City clinical psychologist and executive coach who has written papers on the costs and meaning of cosplay. People do it for the fun, for the crafting, for the community.\nAt events like Comic-Con, 59 percent of fans report sending between $100-$500 on merchandise not even including basic costs like tickets, food and parking, according to Eventbrite. And 10 percent say they spend more than $500 per show.\nThen there are the costumes themselves, which as any cosplay fan knows, can be extremely detailed and elaborate. Thirty percent of cosplay fans report spending between $100-$200 per costume, Rosenberg noted in her research paper Expressions of Fandom. Meanwhile 24 percent spent between $200-$400, and 13 percent said they spent $400 or more.\nAmong that last group: Caitlin Kagawa, a 29-year-old student from Los Angeles, who has been going out recently as Poe Dameron, the hunky X-Wing pilot in the recent \"Star Wars\" movies.\nCosplay does not necessarily have to break the bank, but you do have to be strategic to prevent spending from getting out of control.\nSome advice from cosplay veterans:\n* Volunteer\nMany diehards get free access to the big shows by helping out. That will eat up some of your time, but the savings are significant: It costs San Diego Comic-Con currently costs over $250 to attend the whole show - if you can even get passes (they are already sold out for 2018).\n* Get crafty\nBreak out the sewing machine and the BeDazzler.\nThat is what Caitlin Kagawa did to transform herself into Poe Dameron - getting a specialty kit to make the helmet, doing some 3D printing, and ordering high-quality twill fabric. It still cost me a fortune, she lamented. Im trying to approximate the real fabrics in the film, but Im working with personal money and they have Disney and Lucasfilm money!\n* Choose your character wisely.\nIf you have to stick to a tight budget, Chu-Lin advises something simple and classic like a Star Trek redshirt (those unfortunate staffers who tend to get killed in battle). A corollary of this character choice: If you are traveling to a show that is not local, a bulky, elaborate costume will have to be shipped ahead. And that costs money, too.\n* Ask for help.\nCosplay fans are a tight-knit community, and very generous, said Rosenberg. So if your outfit is falling apart, someone from your fandoms Facebook groups or message boards will undoubtedly step in. (Super glue and duct tape help too, she added.)\nIn the same manner, buddying up with fellow fans to go to conventions will save a bundle. Kagawa usually splits a hotel room with others when she goes to San Diego, and so only has to pay around $350 for lodging for multiple days.\nDo it because you love it, said Kagawa. \"Because its not cheap. (Editing by Beth Pinsker and Andrew Hay)", "external_links": [], "published": "2018-01-16T17:39:00.000+02:00", "crawled": "2018-01-17T07:26:56.007+02:00", "highlightTitle": ""}