{"organizations": [], "uuid": "2392f1a48889369b52682cc5f4091fa7f5b61c94", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-ameriprise-financial-reports-fourth-quarter-and-full-year-2017-results.html", "country": "US", "domain_rank": 767, "title": "Ameriprise Financial Reports Fourth Quarter and Full Year 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T00:10:00.000+02:00", "replies_count": 0, "uuid": "2392f1a48889369b52682cc5f4091fa7f5b61c94"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-ameriprise-financial-reports-fourth-quarter-and-full-year-2017-results.html", "ord_in_thread": 0, "title": "Ameriprise Financial Reports Fourth Quarter and Full Year 2017 Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "minneapolis", "sentiment": "none"}], "organizations": [{"name": "ameriprise financial reports fourth quarter", "sentiment": "negative"}, {"name": "ameriprise financial, inc.", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fourth quarter 2017 net income per diluted share was $1.18; Operating EPS was $1.18\nOne-time negative impact of the Tax Cuts and Jobs Act (“Tax Act”) in the quarter of $2.08 per diluted share\nFourth quarter 2017 net income per diluted share excluding the impact from the Tax Act was $3.26; Operating EPS excluding the impact from the Tax Act was $3.26, up 19 percent\nFull year 2017 net income per diluted share excluding the impact from the Tax Act was $11.49; Operating EPS excluding the impact from the Tax Act was $12.27, up 45 percent\nMINNEAPOLIS--(BUSINESS WIRE)-- Ameriprise Financial, Inc. (NYSE: AMP) today reported fourth quarter 2017 net income of $181 million, or $1.18 per diluted share, and operating earnings of $182 million, or $1.18 per diluted share. Results included a $320 million, or $2.08 per diluted share, impact from the enactment in the fourth quarter of the Tax Cuts and Jobs Act (“Tax Act”). The Tax Act will be an ongoing benefit to the company, with the estimated effective tax rate in the 17 to 19 percent range over the near term.\nExcluding the impact of the Tax Act, fourth quarter 2017 operating earnings increased 13 percent to $502 million, with operating earnings per share up 19 percent to $3.26.\nFourth quarter 2017 return on equity excluding AOCI was 24.8 percent and operating ROE excluding AOCI was 26.9 percent. Excluding the impact of the Tax Act, operating ROE excluding AOCI was 32.3 percent compared to 22.2 percent in the prior year.\nFull year 2017 net income per diluted share was $9.44 and operating earnings per diluted share was $10.23. Excluding the impact of the Tax Act, operating earnings per diluted share was $12.27, up 45 percent compared to 2016.\n“Ameriprise had an excellent fourth quarter and a strong 2017 as we served more clients and experienced good asset growth across the firm,” said Jim Cracchiolo, chairman and chief executive officer. “We’re well positioned to build on our momentum and further differentiate Ameriprise as a financial services leader.”\n“Our strong growth, driven by our wealth management business, reflects the value of the advice and solutions we provide, and we are increasingly being recognized for high client satisfaction, loyalty, trust and forgiveness.\n“The lower corporate tax rate will increase cash flow generation, providing additional flexibility to invest for business growth and to generate a differentiated capital return to shareholders. While our fourth quarter earnings were negatively impacted, we expect the ongoing benefits from tax reform will more than offset the one-time accounting impacts in short order.”\nGAAP Results – Fourth quarter\nNet revenues were $3.2 billion driven by strong growth in Advice & Wealth Management that was partially offset by the impact of 12b-1 fee changes.\nExpenses of $2.6 billion decreased 1 percent, or $33 million, from a year ago.\nOperating Results – Fourth quarter\nOperating net revenue increased 10 percent to $3.2 billion after normalizing for the net impacts of 12b-1 fees and the one-time impact of the Tax Act. Advice & Wealth Management net revenues increased 17 percent driven by growth in client assets after normalizing for the net impacts of 12b-1 fees.\nOperating expenses of $2.5 billion increased 4 percent from a year ago. General and administrative expenses increased 6 percent reflecting the timing of accruals and payments for performance-related compensation, as well as foreign exchange translation. Adjusting for these items, underlying general and administrative expenses remained well managed and were essentially flat.\nTaxes\nThe fourth quarter 2017 operating effective tax rate included a $320 million impact primarily from the remeasurement of net deferred tax assets using the lowered corporate tax rate, repatriation tax and lower future tax benefits from low income housing assets. This was a one-time, primarily non-cash, accounting adjustment. Excluding these impacts, the operating effective tax rate was 23.0 percent. Taxes in the current quarter also reflect the adoption of stock compensation accounting guidance in the first quarter of 2017, which had a favorable $13 million impact in the quarter and reduced the tax rate by 2 percentage points.\nThe company estimates that its ongoing effective tax rate will be in the 17 to 19 percent range over the near term. The lower corporate tax rate will have an ongoing benefit to earnings and the company expects to earn back the initial charge within two years.\nAmeriprise Financial, Inc. Fourth Quarter Summary (in millions, except per share amounts, unaudited)\nQuarter Ended\nDecember 31,\nPer Diluted Share\nQuarter Ended\nDecember 31,\n2017 2016 %\nBetter/\n(Worse)\n2017 2016 %\nBetter/\n(Worse)\nGAAP net income $ 181 $ 400 (55 )% $ 1.18 $ 2.46 (52 )% Operating earnings including Tax Act impacts((1)) (see reconciliation on p. 15) $ 182 $ 443 (59 )% $ 1.18 $ 2.73 (57 )% Operating earnings excluding Tax Act impacts (see reconciliation on p. 15) $ 502 $ 443 13 % $ 3.26 $ 2.73 19 % Weighted average common shares outstanding: Basic 151.0 160.4 Diluted 153.8 162.4 Ameriprise Financial, Inc. Full Year Summary (in millions, except per share amounts, unaudited)\nYear Ended\nDecember 31,\nPer Diluted Share\nYear Ended\nDecember 31,\n2017 2016 %\nBetter/\n(Worse)\n2017 2016 %\nBetter/\n(Worse)\nGAAP net income $ 1,480 $ 1,314 13 % $ 9.44 $ 7.81 21\n% Operating earnings including Tax Act impacts ((1)) (see reconciliation on p. 16) $ 1,603 $ 1,427 12 % $ 10.23 $ 8.48 21 % Operating earnings excluding Tax Act impacts (see reconciliation on p. 16) $ 1,923 $ 1,427 35 % $ 12.27 $ 8.48 45 % Weighted average common shares outstanding: Basic 154.1 166.3 Diluted 156.7 168.2\n(1)\nThe company believes the presentation of operating earnings best represents the economics of the business. Operating earnings, after-tax, exclude the consolidation of certain investment entities; net realized investment gains or losses, net of deferred sales inducement costs (“DSIC”) and deferred acquisition costs (“DAC”) amortization, unearned revenue amortization and the reinsurance accrual; integration and restructuring charges; the market impact on variable annuity guaranteed benefits, net of hedges and related DSIC and DAC amortization; the market impact on indexed universal life benefits, net of hedges and related DAC amortization, unearned revenue amortization, and the reinsurance accrual; the market impact on fixed indexed annuity benefits, net of hedges and the related DAC amortization; the market impact of hedges to offset interest rate changes on unrealized gains or losses for certain investments; and income or loss from discontinued operations. Fourth Quarter 2017 Highlights\nAmeriprise is transforming its business mix\nTotal assets under management and administration increased 14 percent to a record $897 billion reflecting ongoing strength in Ameriprise advisor client net inflows and market appreciation. Advice & Wealth Management and Asset Management generated 73 percent of pretax operating earnings in the quarter, excluding the corporate and other segment. In the quarter, the company repurchased 1.9 million shares of common stock for $302 million and paid $123 million in quarterly dividends. For the full year, the company repurchased 9.9 million shares for $1.3 billion and paid $502 million in quarterly dividends, which represented 96 percent of 2017 operating earnings, excluding the tax impact. Additionally, the company completed its acquisitions of Investment Professionals Inc. (IPI) and Lionstone Investments (Lionstone). The company’s risk-based capital ratio declined to approximately 435 percent at year-end primarily due to the Tax Act and the ratio is expected to increase during 2018 from improved cash generation from the lower tax rate.\nWealth manager generating strong results\nAdvice & Wealth Management client assets increased to a record $560 billion reflecting continued strength in fee-based investment advisory (wrap) net inflows, with net inflows of $5.0 billion in the quarter. Total wrap assets were $248 billion, one of the largest in the industry. Operating net revenue per advisor increased 15 percent normalizing for net 12b-1 fee impacts. Growth reflects the full service financial planning advisors provide clients, industry-leading technology and tools, as well as dedicated field leadership and support. The company is an attractive destination for productive advisors, with 99 experienced advisors joining the firm during the quarter.\nGlobal asset manager with broad capabilities and competitive margins\nAsset Management AUM grew to $495 billion, reflecting market appreciation partially offset by net outflows. Investment performance in retail and institutional equity, fixed income and multi-asset portfolios and strategies remains strong. At quarter end, the company had 114 four- and five-star Morningstar-rated funds. The company completed its acquisition of Lionstone, a leading national real estate investment firm specializing in investment strategies based upon proprietary analytics. The acquisition added $5.4 billion in assets. Columbia Threadneedle launched the Columbia Adaptive Retirement Series for the retirement marketplace and won the Multi-Asset Manager of the Year Award at the Professional Pensions Investment Awards 2017 in London.\nAnnuities and Protection businesses focused on serving our wealth management clients\nVariable annuity account balances increased 7 percent to $80 billion and VUL/UL account balances increased 9 percent to $12.5 billion. RiverSource Annuities launched the RiverSource Assured SM Fixed Index annuity, a long-term retirement savings vehicle that can add stability to clients’ retirement portfolios by helping to protect principal from market downturns and provide opportunities for growth.\nValues-based, client-focused firm\nAmeriprise ranked #1 in customer loyalty in the investment industry in Temkin Group’s Temkin Loyalty Index, which evaluates the loyalty of 10,000 U.S. consumers on how likely they are to perform five behaviors: recommending the company to others, forgiving the company if it makes a mistake, trusting the company, repurchasing from the company and trying the company’s new offerings. On November 10, 2017, more than 8,000 Ameriprise employees, financial advisors and clients participated in a day of service serving meals, sorting donations and stacking shelves at 450 company-sponsored events nationwide. The November event provided more than 1 million meals for people in need ahead of the holiday season. For the 12th consecutive year, Ameriprise received a 100 percent rating on the Human Rights Campaign Corporate Equality Index, a national benchmarking report measuring corporate policies and practices related to LGBTQ workplace equality. Ameriprise debuted its Responsible Business Report that discusses how the company is evolving its corporate social responsibility efforts. The report summarizes how we operate responsibly, including how we serve clients, manage the business, engage employees and financial advisors and help strengthen our communities. The report is available on our website at www.ameriprise.com/financial-planning/about/responsible-business/ .\nAmeriprise Financial, Inc. Advice & Wealth Management Segment Operating Results (in millions, unaudited) Quarter Ended December 31, % Better/\n(Worse)\n2017 2016 Advice & Wealth Management Net revenues $ 1,480 $ 1,316 12 % Expenses 1,154 1,062 (9 )% Pretax operating earnings $ 326 $ 254 28 % Pretax operating margin 22.0 % 19.3 % Quarter Ended December 31, % Better/\n(Worse)\n2017 2016 Retail client assets (billions) $ 560 $ 479 17 % Wrap net flows (billions) $ 5.0 $ 3.3 51 % Brokerage cash balance (billions) $ 26.2 $ 26.8 (2 )% Operating net revenue per advisor normalizing for the net impact of 12b-1 fee changes (trailing 12 months - thousands)\n$ 558\n$ 492 13\n% Operating net revenue per advisor normalizing for the net impact of 12b-1 fee changes (quarterly - thousands)\n$ 149\n$ 130 15 % Advice & Wealth Management pretax operating earnings increased 28 percent to $326 million driven by asset growth and higher earnings on cash balances. This drove strong margin expansion, with a pretax operating margin of 22.0 percent and significant margin expansion of 270 basis points from a year ago.\nOperating net revenues were $1.5 billion, up 17 percent, normalizing for the 12b-1 fee net impacts, reflecting strong net inflows into wrap accounts, higher earnings on cash balances and market appreciation. Client asset growth remains strong with growth in fee-based wrap accounts outpacing growth in brokerage account balances.\nOperating expenses increased 9 percent to $1.2 billion primarily from higher distribution expenses related to growth in client assets. General and administrative expenses were $286 million and included expenses from the timing of accruals for performance-related compensation and the inclusion of IPI. Adjusting for these items, general and administrative expenses were up 5 percent.\nTotal retail client assets increased to a new high of $560 billion driven by client net inflows, client acquisition and market appreciation. Wrap net inflows were $5.0 billion in the quarter and wrap assets grew 23 percent to $248 billion. Client cash balances were $26.2 billion, down slightly from a year ago, and certificates balances grew 8 percent to $6.4 billion.\nOperating net revenue per advisor on a trailing 12-month basis increased to $558,000 after normalizing for the net impact from eliminating 12b-1 fees in advisory accounts. Operating net revenue per advisor on a quarterly basis increased 15 percent after normalizing for this item.\nTotal advisors increased to 9,896 reflecting good recruiting and retention of advisors, with 99 experienced advisors moving their practices to Ameriprise in the quarter.\nAmeriprise Financial, Inc. Asset Management Segment Operating Results (in millions, unaudited) Quarter Ended December 31, % Better/\n(Worse)\n2017 2016 Asset Management Net revenues $ 825 $ 761 8 % Expenses 611 592 (3 )% Pretax operating earnings $ 214 $ 169 27 % Pretax operating margin 25.9 % 22.2 % Adjusted net pretax operating margin (1) 39.2 % 36.5 % Item included in operating earnings:\nNet performance fees and CLO unwinds $ 32 $ 18 NM Quarter Ended December 31, % Better/\n(Worse)\n2017 2016 Total segment AUM (billions) $ 495 $ 454 9 % Net Flows (billions)\nFormer parent company related net new flows $ (2.5 ) $ (2.0 ) (26 )% Global Retail net flows, excl. former parent flows 5.1 0.5 NM Global Institutional net flows, excl. former parent flows (5.6 ) (0.6 ) NM Inflows from acquisitions 5.4 — NM Total segment net flows $ 2.4 $ (2.1 ) NM (1) See reconciliation on page 19\nNM Not Meaningful — variance equal to or greater than 100% Asset Management pretax operating earnings increased 27 percent to $214 million, reflecting market appreciation and expense discipline, partially offset by the cumulative impact of net outflows. Earnings in the quarter also included $32 million of performance fees and gains from the unwinding of two CLOs, which was $14 million higher than a year ago. Fourth quarter adjusted net pretax operating margin grew to 39.2 percent from 36.5 percent a year ago.\nOperating net revenues grew 8 percent to $825 million driven by asset growth from market appreciation, partially offset by the cumulative impact of net outflows. Normalizing for the 12b-1 fee change, operating net revenues grew 10 percent. AUM increased 9 percent to $495 billion.\nOperating expenses of $611 million increased 3 percent reflecting lower distribution expenses that were offset by the timing of accruals for performance-related compensation and the unfavorable impact of foreign exchange. Underlying expense discipline remains strong.\nNet inflows were $2.4 billion in the quarter. Global retail net inflows, excluding former parent assets, were $5.1 billion and included $6.5 billion of reinvested dividends. Positive flow momentum continued in EMEA retail with $500 million of inflows in the quarter, which partially offset continued pressure on U.S. retail flows. The majority of outflows in the quarter were low fee, including $2.5 billion of outflows of former parent assets. Institutional outflows included $4.3 billion from three mandates where the weighted fee rate was four basis points on average. Flows also included $5.4 billion of inflows from the Lionstone acquisition.\nAmeriprise Financial, Inc. Annuities Segment Operating Results (in millions, unaudited) Quarter Ended December 31, % Better/\n(Worse)\n2017 2016 Annuities Net revenues $ 638 $ 617 3 % Expenses 490 490 — % Pretax operating earnings $ 148 $ 127 17 % Variable annuity pretax operating earnings $ 134 $ 107 25 % Fixed annuity pretax operating earnings 14 20 (30 )% Total pretax operating earnings $ 148 $ 127 17 % Item included in operating earnings: Market impact on DAC and DSIC (mean reversion) $ 11 $ 4 NM Quarter Ended December 31, % Better/\n(Worse)\n2017 2016 Variable annuity ending account balances (billions) $ 80.3 $ 74.8 7 % Variable annuity net flows (millions) $ (898) $ (732 ) (23 )% Fixed deferred annuity ending account balances (billions) $ 9.3 $ 10.0 (7 )% Fixed deferred annuity net flows (millions) $ (246) $ (251 ) 2 % NM Not Meaningful — variance equal to or greater than 100% Annuities pretax operating earnings were $148 million compared to $127 million a year ago.\nVariable annuity earnings increased 25 percent to $134 million from growth in account balances and market appreciation. Variable annuity account balances increased 7 percent to $80 billion from market appreciation, partially offset by net outflows. Variable annuity cash sales increased 1 percent—a third of which did not have living benefits.\nFixed annuity operating earnings decreased to $14 million reflecting continued spread compression given the extended period of low interest rates and lower account balances. Account balances declined 7 percent from limited new product sales and continued lapses.\nAmeriprise Financial, Inc. Protection Segment Operating Results (in millions, unaudited) Quarter Ended December 31, % Better/\n(Worse)\n2017 2016 Protection Net revenues $ 528 $ 548 (4 )% Expenses 481 475 (1 )% Pretax operating earnings $ 47 $ 73 (36 )% Life and Health insurance: Net revenues $ 256 $ 256 — % Expenses 183 193 5 % Pretax operating earnings $ 73 $ 63 16 % Auto and Home: Net revenues $ 272 $ 292 (7 )% Expenses 298 282 (6 )% Pretax operating earnings/(loss) $ (26 ) $ 10 NM Items included in operating earnings: Auto and Home catastrophe losses $\n(38 ) $\n(15 ) NM Auto and Home reserve changes — 12 NM Total Auto and Home impact $ (38 ) $ (3 ) NM\nQuarter Ended December 31, % Better/\n(Worse)\n2017 2016 Life insurance in force (billions) $ 196 $ 196 — % VUL/UL ending account balances (billions) $ 12.5 $ 11.5 9 % Auto and Home policies in force (thousands) 942 943 — % NM Not Meaningful — variance equal to or greater than 100% Protection pretax operating earnings were $47 million compared to $73 million a year ago.\nLife and Health insurance earnings increased to $73 million from $63 million a year ago driven by markets and favorable disability insurance claims. Overall claims experience remains within expected ranges. VUL/UL cash sales were $84 million, down 5 percent due to particularly strong sales in the prior year.\nAuto & Home pretax operating loss was $26 million, including net catastrophe losses of $38 million, primarily driven by California wildfires. Excluding catastrophe losses, operating earnings were $12 million and reflected the benefit of continued rate increases, enhanced underwriting and claims processing, as well as additional use of reinsurance to manage catastrophe risk. The prior-year quarter included a $12 million favorable reserve adjustment.\nAmeriprise Financial, Inc. Corporate & Other Segment Operating Results (in millions, unaudited) Quarter Ended December 31, % Better/\n(Worse)\n2017 2016 Corporate & Other, Excluding Long Term Care Pretax operating loss $ (121 ) $ (74 ) (64 )% Tax Act impact on low income housing assets (51 ) — NM Pretax operating loss excluding the Tax Act impact $ (70 ) $ (74 ) 5 % Long Term Care Pretax operating loss $ (13 ) $ (14 ) 7 % Items included in operating earnings: DOL planning and implementation expenses (6 ) (11 ) 45 % Severance expense (7 ) (12 ) 42 % Long term care adjustments — (10 ) NM Total corporate & other impact $ (13 ) $ (33 ) 61 % NM Not Meaningful — variance equal to or greater than 100% Corporate & Other pretax operating loss excluding long term care was $121 million for the quarter, which included a negative $51 million impact from the Tax Act on low income housing assets. Excluding this item, the corporate pretax operating loss was within expectations. Incremental DOL expenses were $6 million, down from $11 million a year ago.\nLong Term Care pretax operating loss was $13 million in the quarter primarily driven by elevated new claim severity at the beginning of the quarter. Claim severity returned to a more expected level in December and the company remains comfortable with long term claims estimates.\nAt Ameriprise Financial, we have been helping people feel confident about their financial future for more than 120 years. With a nationwide network of 10,000 financial advisors and extensive asset management, advisory and insurance capabilities, we have the strength and expertise to serve the full range of individual and institutional investors’ financial needs. For more information, visit ameriprise.com .\nAmeriprise Financial Services, Inc. offers financial planning services, investments, insurance and annuity products. Columbia Funds are distributed by Columbia Management Investment Distributors, Inc., member FINRA and managed by Columbia Management Investment Advisers, LLC. Threadneedle International Limited is an SEC- and FCA-registered investment adviser affiliate of Columbia Management Investment Advisers, LLC based in the U.K. Auto and home insurance is underwritten by IDS Property Casualty Insurance Company, or in certain states, Ameriprise Insurance Company, both in De Pere, WI. RiverSource insurance and annuity products are issued by RiverSource Life Insurance Company, and in New York only by RiverSource Life Insurance Co. of New York, Albany, New York. Only RiverSource Life Insurance Co. of New York is authorized to sell insurance and annuity products in the state of New York. These companies are all part of Ameriprise Financial, Inc. CA License #0684538. RiverSource Distributors, Inc. (Distributor), Member FINRA.\nForward-Looking Statements\nThis news release contains forward-looking statements that reflect management’s plans, estimates and beliefs. Actual results could differ materially from those described in these forward-looking statements. Examples of such forward-looking statements include:\nthe statement that the company expects the ongoing benefits from tax reform will more than offset the one-time accounting impacts in short order and within two years; the statement that the company expects the ongoing effective tax rate to be in the 17 to 19 percent range over the near term; the statement that the company remains comfortable with its long-term claims estimates within long-term care; the statement that the company expects its risk-based capital ratio to increase during 2018 from improved cash generation from the lower tax rate; statements of the company’s plans, intentions, positioning, expectations, objectives or goals, including those relating to asset flows, mass affluent and affluent client acquisition strategy, client retention and growth of our client base, financial advisor productivity, retention, recruiting and enrollments, the introduction, cessation, terms or pricing of new or existing products and services, acquisition integration, general and administrative costs, consolidated tax rate, return of capital to shareholders, and excess capital position and financial flexibility to capture additional growth opportunities; other statements about future economic performance, the performance of equity markets and interest rate variations and the economic performance of the United States and of global markets; and statements of assumptions underlying such statements.\nThe words “believe,” “expect,” “anticipate,” “optimistic,” “intend,” “plan,” “aim,” “will,” “may,” “should,” “could,” “would,” “likely,” “forecast,” “on pace,” “project” and similar expressions are intended to identify forward-looking statements but are not the exclusive means of identifying such statements. Forward-looking statements are subject to risks and uncertainties, which could cause actual results to differ materially from such statements.\nSuch factors include, but are not limited to:\nconditions in the interest rate, credit default, equity market and foreign exchange environments, including changes in valuations, liquidity and volatility; changes in and the adoption of relevant accounting standards and securities rating agency standards and processes, as well as changes in the litigation and regulatory environment, including ongoing legal proceedings and regulatory actions, the frequency and extent of legal claims threatened or initiated by clients, other persons and regulators, and developments in regulation and legislation, including the rules, exemptions and regulations implemented or that may be implemented or modified in connection with the Dodd-Frank Wall Street Reform and Consumer Protection Act or in light of the U.S. Department of Labor rule and exemptions pertaining to the fiduciary status of investment advice providers to 401(k) plan, plan sponsors, plan participants and the holders of individual retirement or health savings accounts; investment management performance and distribution partner and consumer acceptance of the company’s products; effects of competition in the financial services industry, including pricing pressure, the introduction of new products and services and changes in product distribution mix and distribution channels; changes to the company’s reputation that may arise from employee or advisor misconduct, legal or regulatory actions, perceptions of the financial services industry generally, improper management of conflicts of interest or otherwise; the company’s capital structure, including indebtedness, limitations on subsidiaries to pay dividends, and the extent, manner, terms and timing of any share or debt repurchases management may effect as well as the opinions of rating agencies and other analysts and the reactions of market participants or the company’s regulators, advisors, distribution partners or customers in response to any change or prospect of change in any such opinion; changes to the availability and cost of liquidity and the Company’s credit capacity that may arise due to shifts in market conditions, the company’s credit ratings and the overall availability of credit; risks of default, capacity constraint or repricing by issuers or guarantors of investments the company owns or by counterparties to hedge, derivative, insurance or reinsurance arrangements or by manufacturers of products the company distributes, experience deviations from the company’s assumptions regarding such risks, the evaluations or the prospect of changes in evaluations of any such third parties published by rating agencies or other analysts, and the reactions of other market participants or the company’s regulators, advisors, distribution partners or customers in response to any such evaluation or prospect of changes in evaluation; experience deviations from the company’s assumptions regarding morbidity, mortality and persistency in certain annuity and insurance products, or from assumptions regarding market returns assumed in valuing or unlocking DAC and DSIC or market volatility underlying our valuation and hedging of guaranteed living benefit annuity riders, or from assumptions regarding interest rates assumed in our loss recognition testing of our Long Term Care business, or from assumptions regarding anticipated claims and losses relating to our automobile and home insurance products; changes in capital requirements that may be indicated, required or advised by regulators or rating agencies; the impacts of the company’s efforts to improve distribution economics and to grow third party distribution of its products; the ability to pursue and complete strategic transactions and initiatives, including acquisitions, divestitures, restructurings, joint ventures and the development of new products and services the ability to realize the financial, operating and business fundamental benefits of strategic transactions and initiatives the company has completed, is pursuing or may pursue in the future, which may be impacted by the ability to obtain regulatory approvals, the ability to effectively manage related expenses and by market, business partner and consumer reactions to such strategic transactions and initiatives; the ability and timing to realize savings and other benefits from re-engineering and tax planning; interruptions or other failures in our communications, technology and other operating systems, including errors or failures caused by third party service providers, interference or failures caused by third party attacks on our systems, or the failure to safeguard the privacy or confidentiality of sensitive information and data on such systems; and general economic and political factors, including consumer confidence in the economy and the financial industry, the ability and inclination of consumers generally to invest as well as their ability and inclination to invest in financial instruments and products other than cash and cash equivalents, the costs of products and services the company consumes in the conduct of its business, and applicable legislation and regulation and changes therein (such as the ongoing negotiations following the June 2016 UK referendum on membership in the European Union and the uncertain regulatory environment in the U.S. after the 2016 presidential election), including tax laws, tax treaties, fiscal and central government treasury policy, and policies regarding the financial services industry and publicly held firms, and regulatory rulings and pronouncements.\nManagement cautions the reader that the foregoing list of factors is not exhaustive. There may also be other risks that management is unable to predict at this time that may cause actual results to differ materially from those in forward-looking statements. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date on which they are made. Management undertakes no obligation to update publicly or revise any forward-looking statements. The foregoing list of factors should be read in conjunction with the “Risk Factors” discussion under Part 1, Item 1A of and elsewhere in our Annual Report on Form 10-K for the year ended December 31, 2016 available at ir.ameriprise.com .\nThe financial results discussed in this news release represent past performance only, which may not be used to predict or project future results. The financial results and values presented in this news release and the below-referenced Statistical Supplement are based upon asset valuations that represent estimates as of the date of this news release and may be revised in the company’s Annual Report on Form 10-K for the year ended December 31, 2017. For information about Ameriprise Financial entities, please refer to the Fourth Quarter 2017 Statistical Supplement available at ir.ameriprise.com and the tables that follow in this news release.\nAmeriprise Financial announces financial and other information to investors through the company’s investor relations website at ir.ameriprise.com , as well as SEC filings, press releases, public conference calls and webcasts. Investors and others interested in the company are encouraged to visit the investor relations website from time to time, as information is updated and new information is posted. The website also allows users to sign up for automatic notifications in the event new materials are posted. The information found on the website is not incorporated by reference into this release or in any other report or document the company furnishes or files with the SEC.\nReconciliation Tables\nAmeriprise Financial, Inc. Reconciliation Table: Net Income Per Diluted Share Quarter Ended Quarter Ended December 31, December 31, (in millions, except per share amounts, unaudited) 2017 2016 2017 2016 Net income $ 181 $ 400 $ 1.18 $ 2.46 Tax Act impact:\nLess: Tax impact on low income housing assets (51 ) — (0.33 ) — Less: Tax effect of adjustments (1) (269 ) — (1.75 ) — Total Tax Act impact (320 ) — (2.08 ) — Net income excluding Tax Act impact\n$ 501 $ 400 $ 3.26 $ 2.46 Weighted average common shares outstanding: Basic 151.0 160.4 Diluted 153.8 162.4\n(1)\nAmounts represent the impact of the Tax Act including remeasurement of net deferred tax assets using the lowered corporate tax rate, repatriation tax and the tax effect of low income housing assets. Ameriprise Financial, Inc. Reconciliation Table: Net Income Per Diluted Share Year Ended Year Ended December 31, December 31, (in millions, except per share amounts, unaudited) 2017 2016 2017 2016 Net income $ 1,480 $ 1,314 $ 9.44 $ 7.81 Tax Act impact:\nLess: Tax impact on low income housing assets (51 ) — (0.33 ) — Less: Tax effect of adjustments (1) (269 ) — (1.72 ) — Total Tax Act impact (320 ) — (2.05 ) — Net income excluding Tax Act impact\n$ 1,800 $ 1,314 $ 11.49 $ 7.81 Weighted average common shares outstanding: Basic 154.1 166.3 Diluted 156.7 168.2\n(1)\nAmounts represent the impact of the Tax Act including remeasurement of net deferred tax assets using the lowered corporate tax rate, repatriation tax and the tax effect of low income housing assets. Ameriprise Financial, Inc. Reconciliation Table: Earnings Per Diluted Share Quarter Ended Quarter Ended December 31, December 31, (in millions, except per share amounts, unaudited) 2017 2016 2017 2016 Net income $ 181 $ 400 $ 1.18 $ 2.46 Less: Net income (loss) attributable to consolidated investment entities — (1 ) — (0.01 ) Add: Integration/restructuring charges (1) 4 — 0.02 — Add: Market impact on variable annuity guaranteed benefits (1)\n34 138 0.22 0.85 Add: Market impact on indexed universal life benefits (1) (20 ) (5 ) (0.13 ) (0.03 ) Add: Market impact of hedges on investments (1) (6 ) (57 ) (0.04 ) (0.35 ) Add: Net realized investment (gains) losses (1) (11 ) (11 ) (0.07 ) (0.07 ) Add: Tax effect of adjustments (2) — (23 ) — (0.14 ) Operating earnings 182 443 1.18 2.73 Tax Act impact:\nLess: Tax impact on low income housing assets (51 ) — (0.33 ) — Less: Tax effect of adjustments (3) (269 ) — (1.75 ) — Total Tax Act impact (320 ) — (2.08 ) — Operating earnings excluding Tax Act impact\n$ 502 $ 443 $ 3.26 $ 2.73 Weighted average common shares outstanding: Basic 151.0 160.4 Diluted 153.8 162.4\n(1)\nPretax operating adjustment. (2)\nCalculated using the statutory tax rate of 35%. (3)\nAmounts represent the impact of the Tax Act including remeasurement of net deferred tax assets using the lowered corporate tax rate, repatriation tax and the tax effect of low income housing assets. Ameriprise Financial, Inc. Reconciliation Table: Earnings Per Diluted Share Year Ended Year Ended December 31, December 31, (in millions, except per share amounts, unaudited) 2017 2016 2017 2016 Net income $ 1,480 $ 1,314 $ 9.44 $ 7.81 Less: Net income (loss) attributable to consolidated investment entities 1 (2 ) — (0.01 ) Add: Integration/restructuring charges (1) 5 — 0.03 — Add: Market impact on variable annuity guaranteed benefits (1)\n232 216 1.48 1.28 Add: Market impact on indexed universal life benefits (1) (4 ) (36 ) (0.02 ) (0.21 ) Add: Market impact of hedges on investments (1) 2 (3 ) 0.01 (0.02 ) Add: Net realized investment (gains) losses (1) (44 ) (6 ) (0.28 ) (0.03 ) Add: Tax effect of adjustments (2) (67 ) (60 ) (0.43 ) (0.36 ) Operating earnings 1,603 1,427 10.23 8.48 Tax Act impact:\nLess: Tax impact on low income housing assets (51 ) — (0.32 ) — Less: Tax effect of adjustments (3) (269 ) — (1.72 ) — Total Tax Act impact (320 ) — (2.04 ) — Operating earnings excluding Tax Act impact\n$ 1,923 $ 1,427 $ 12.27 $ 8.48 Weighted average common shares outstanding: Basic 154.1 166.3 Diluted 156.7 168.2\n(1)\nPretax operating adjustment. (2)\nCalculated using the statutory tax rate of 35%. (3)\nAmounts represent the impact of the Tax Act including remeasurement of net deferred tax assets using the lowered corporate tax rate, repatriation tax and the tax effect of low income housing assets. Ameriprise Financial, Inc. Reconciliation Table: Total Net Revenues Quarter Ended December 31, (in millions, unaudited) 2017 2016 Total net revenues $ 3,160 $ 3,062 Less: CIEs revenue 24 51 Less: Net realized investment gains (losses) 11 11 Less: Market impact on indexed universal life benefits 8 6 Less: Market impact of hedges on investments 6 57 Operating total net revenues 3,111 2,937 Less: Net impacts of transitioning advisory accounts to share classes without 12b-1 fees\n10 61 Less: Tax impact on low income housing assets (51 ) — Operating total net revenues excluding 12b-1 and tax impact $ 3,152 $ 2,876 Ameriprise Financial, Inc. Reconciliation Table: Total Expenses Quarter Ended December 31, (in millions, unaudited) 2017 2016 Total expenses $ 2,560 $ 2,593 Less: CIEs expenses 24 52 Less: Integration/restructuring charges 4 — Less: Market impact on variable annuity guaranteed benefits 34 138 Less: Market impact on indexed universal life benefits (12 ) 1 Less: DAC/DSIC offset to net realized investment gains (losses) — — Operating expenses $ 2,510 $ 2,402\nAmeriprise Financial, Inc. Reconciliation Table: General and Administrative Expense Quarter Ended December 31, (in millions, unaudited) 2017 2016 General and administrative expense $ 807 $ 756 Less: CIEs expenses — — Less: Integration/restructuring charges 4 — Operating general and administrative expense 803 756 Less: Timing of accruals 27 — Less: Payments for performance-related compensation\n24\n14\nLess: Foreign exchange translation 7 — Operating general and administrative expense excluding items $ 745\n$ 742\nAmeriprise Financial, Inc. Reconciliation Table: Pretax Operating Earnings Quarter Ended December 31, (in millions, unaudited) 2017 2016 Operating total net revenues $ 3,111 $ 2,937 Operating expenses 2,510 2,402 Pretax operating earnings $ 601 $ 535 Ameriprise Financial, Inc. Reconciliation Table: Effective Tax Rate Quarter Ended December 31, 2017 (in millions, unaudited) GAAP Operating Pretax income $ 600 $ 601 Income tax provision $ 419 $ 419 Effective tax rate 69.8\n%\n69.7 % Ameriprise Financial, Inc. Reconciliation Table: Effective Tax Rate Quarter Ended December 31, 2016 (in millions, unaudited) GAAP Operating Pretax income $ 469 $ 535 Income tax provision $ 69 $ 92 Effective tax rate 14.5 % 17.2 % Ameriprise Financial, Inc. Reconciliation Table: Effective Tax Rate Quarter Ended (in millions, unaudited) December 31, 2017 Pretax operating earnings $ 601 Tax impact on low income housing assets (51 ) Pretax operating earnings excluding Tax Act impact $ 652 Operating income tax provision $ 419 Tax Act impact 269 Operating income tax provision excluding Tax Act impact 150 Benefit from adoption of stock compensation accounting guidance (13 ) Operating income tax provision excluding Tax Act impact and benefit from adoption of stock compensation accounting guidance $ 163 Operating effective tax rate 69.7 % Operating effective tax rate excluding Tax Act impact 23.0 % Operating effective tax rate excluding Tax Act impact and benefit from adoption of stock compensation accounting guidance 25.0 % Ameriprise Financial, Inc. Reconciliation Table: Advice & Wealth Management Operating Net Revenues Quarter Ended December 31, (in millions, unaudited) 2017 2016 Operating net revenues $ 1,480 $ 1,316 Less: Net impact of transitioning advisory accounts to share classes without 12b-1 fees 10 61 Operating total net revenues normalized for 12b-1 impact\n$ 1,470\n$ 1,255 Ameriprise Financial, Inc. Reconciliation Table: Advice & Wealth Management Operating Net Revenues (trailing 12 months) Quarter Ended December 31, (in millions, unaudited) 2017 2016 Operating net revenues $ 5,506 $ 5,036 Less: Net impact of transitioning advisory accounts to share classes without 12b-1 fees 60 253 Operating total net revenues normalized for 12b-1 impact\n$ 5,446\n$ 4,783\nAmeriprise Financial, Inc. Reconciliation Table: Advice & Wealth Management General and Administrative Expense Quarter Ended December 31, (in millions, unaudited) 2017 2016 Operating general and administrative expense $ 286 $ 263 Less: Timing of accruals 6 — Less: IPI 4 — Operating general and administrative expense excluding items $ 276 $ 263 Ameriprise Financial, Inc. Reconciliation Table: Asset Management Operating Net Revenues Quarter Ended December 31, (in millions, unaudited) 2017 2016 Operating net revenues $ 825 $ 761 Less: Net impact of transitioning advisory accounts to share classes without 12b-1 fees — 13 Operating total net revenues excluding 12b-1 impact $ 825 $ 748 Ameriprise Financial, Inc. Reconciliation Table: Asset Management Adjusted Net Pretax Operating Margin Quarter Ended December 31, (in millions, unaudited)\n2017 2016 Operating total net revenues $ 825 $ 761 Less: Distribution pass through revenues 203 204 Less: Subadvisory and other pass through revenues 94 94 Adjusted operating revenues $ 528 $ 463 Pretax operating earnings $ 214 $ 169 Less: Operating net investment income 12 5 Add: Amortization of intangibles 5 5 Adjusted operating earnings $ 207 $ 169 Pretax operating margin 25.9 % 22.2 % Adjusted net pretax operating margin 39.2 % 36.5 % Ameriprise Financial, Inc. Reconciliation Table: Return on Equity (ROE) Excluding Accumulated Other Comprehensive Income “AOCI” Twelve Months Ended December 31, (in millions, unaudited)\n2017 2016 Net income $ 1,480 $ 1,314 Less: Adjustments (1) (123 ) (113 ) Operating earnings 1,603 1,427 Less: Tax Act impact (320 ) — Operating earnings excluding Tax Act impact $ 1,923 $ 1,427 Total Ameriprise Financial, Inc. shareholders’ equity $ 6,214 $ 6,877 Less: Accumulated other comprehensive income, net of tax 251 426 Total Ameriprise Financial, Inc. shareholders’ equity excluding AOCI 5,963 6,451 Less: Equity impacts attributable to the consolidated investment entities 1 27 Operating equity $ 5,962 $ 6,424 Return on equity excluding AOCI 24.8 % 20.4 % Operating return on equity excluding AOCI (2) 26.9 % 22.2 % Operating return on equity excluding AOCI and Tax Act impact 32.3 % 22.2 %\n(1)\nAdjustments reflect the trailing twelve months’ sum of after-tax net realized investment gains/losses, net of deferred sales inducement costs (“DSIC”) and deferred acquisition costs (“DAC”) amortization, unearned revenue amortization and the reinsurance accrual; market impact on variable annuity guaranteed benefits, net of hedges and related DSIC and DAC amortization; the market impact on indexed universal life benefits, net of hedges and related DAC amortization, unearned revenue amortization, and the reinsurance accrual; the market impact on fixed indexed annuity benefits, net of hedges and the related DAC amortization; the market impact of hedges to offset interest rate changes on unrealized gains or losses for certain investments; integration/restructuring charges; and the impact of consolidating certain investment entities. After-tax is calculated using the statutory tax rate of 35%. (2)\nOperating return on equity excluding accumulated other comprehensive income (AOCI) is calculated using the trailing twelve months of earnings excluding the after-tax net realized investment gains/losses, net of deferred sales inducement costs (“DSIC”) and deferred acquisition costs (“DAC”) amortization, unearned revenue amortization and the reinsurance accrual; market impact on variable annuity guaranteed benefits, net of hedges and related DSIC and DAC amortization; the market impact on indexed universal life benefits, net of hedges and related DAC amortization, unearned revenue amortization, and the reinsurance accrual; the market impact on fixed indexed annuity benefits, net of hedges and the related DAC amortization; the market impact of hedges to offset interest rate changes on unrealized gains or losses for certain investments; integration/restructuring charges; the impact of consolidating certain investment entities; and discontinued operations in the numerator, and Ameriprise Financial shareholders’ equity excluding AOCI and the impact of consolidating investment entities using a five-point average of quarter-end equity in the denominator. After-tax is calculated using the statutory tax rate of 35%. Ameriprise Financial, Inc. Consolidated GAAP Results (in millions, unaudited) Quarter Ended December 31, % Better/\n(Worse)\n2017 2016 Revenues Management and financial advice fees $ 1,723 $ 1,489 16 % Distribution fees 460 457 1 Net investment income 355 486 (27 ) Premiums 359 377 (5 ) Other revenues 277 263 5 Total revenues 3,174 3,072 3 Banking and deposit interest expense 14 10 (40 ) Total net revenues 3,160 3,062 3 Expenses Distribution expenses 894 831 (8 ) Interest credited to fixed accounts 147 158 7 Benefits, claims, losses and settlement expenses 581 712 18 Amortization of deferred acquisition costs 78 55 (42 ) Interest and debt expense 53 81 35 General and administrative expense 807 756 (7 ) Total expenses 2,560 2,593 1 Pretax income 600 469 28 Income tax provision 419 69 NM Net income $ 181 $ 400 (55 )% NM Not Meaningful — variance equal to or greater than 100% Ameriprise Financial, Inc. Consolidated GAAP Results (in millions, unaudited) Year Ended December 31, % Better/\n(Worse)\n2017 2016 Revenues Management and financial advice fees $ 6,392 $ 5,778 11 % Distribution fees 1,770 1,795 (1 ) Net investment income 1,509 1,576 (4 ) Premiums 1,394 1,491 (7 ) Other revenues 1,010 1,095 (8 ) Total revenues 12,075 11,735 3 Banking and deposit interest expense 48 39 (23 ) Total net revenues 12,027 11,696 3 Expenses Distribution expenses 3,399 3,202 (6 ) Interest credited to fixed accounts 656 623 (5 ) Benefits, claims, losses and settlement expenses 2,233 2,646 16 Amortization of deferred acquisition costs 267 415 36 Interest and debt expense 207 241 14 General and administrative expense 3,051 2,977 (2 ) Total expenses 9,813 10,104 3 Pretax income 2,214 1,592 39 Income tax provision 734 278 NM Net income $ 1,480 $ 1,314 13 % NM Not Meaningful — variance equal to or greater than 100%\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124006184/en/\nAmeriprise Financial\nInvestor Relations:\nAlicia A. Charity, 612-671-2080\nalicia.a.charity@ampf.com\nor\nStephanie Rabe, 612-671-4085\nstephanie.m.rabe@ampf.com\nor\nMedia Relations:\nPaul W. Johnson, 612-671-0625\npaul.w.johnson@ampf.com\nSource: Ameriprise Financial", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fir.ameriprise.com&esheet=51748158&newsitemid=20180124006184&lan=en-US&anchor=ir.ameriprise.com&index=5&md5=3c971065a023c4f17e08aeda57052bb7", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fameriprise.com&esheet=51748158&newsitemid=20180124006184&lan=en-US&anchor=ameriprise.com&index=2&md5=b4faca0ba344bd407a76e174c6d13f9e", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fir.ameriprise.com&esheet=51748158&newsitemid=20180124006184&lan=en-US&anchor=ir.ameriprise.com&index=3&md5=485430dee57b70f538946f22bb373528", "http://www.businesswire.com/news/home/20180124006184/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fir.ameriprise.com&esheet=51748158&newsitemid=20180124006184&lan=en-US&anchor=ir.ameriprise.com&index=4&md5=6534da9cd247d8639d1cb8cbc5b80d5f", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ameriprise.com%2Ffinancial-planning%2Fabout%2Fresponsible-business%2F&esheet=51748158&newsitemid=20180124006184&lan=en-US&anchor=www.ameriprise.com%2Ffinancial-planning%2Fabout%2Fresponsible-business%2F&index=1&md5=44c6eb9de534314d123d7a904795b762"], "published": "2018-01-25T00:10:00.000+02:00", "crawled": "2018-01-25T02:19:59.004+02:00", "highlightTitle": ""}