{"organizations": [], "uuid": "7af9917059f52c9a770bf3c0ff179300f856b82e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226269856&w=1200&r=LYNXMPEE0S0PZ", "site_section": "http://feeds.reuters.com/reuters/INtechnologyNews", "section_title": "Reuters: Technology News", "url": "https://in.reuters.com/article/apple-iphonex/apple-set-to-halve-first-quarter-iphone-x-production-target-nikkei-idINKBN1FI173", "country": "US", "domain_rank": 408, "title": "Apple shares skid on report of iPhone X production cut", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T17:12:00.000+02:00", "replies_count": 0, "uuid": "7af9917059f52c9a770bf3c0ff179300f856b82e"}, "author": "", "url": "https://in.reuters.com/article/apple-iphonex/apple-set-to-halve-first-quarter-iphone-x-production-target-nikkei-idINKBN1FI173", "ord_in_thread": 0, "title": "Apple shares skid on report of iPhone X production cut", "locations": [], "entities": {"persons": [], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "apple inc", "sentiment": "none"}, {"name": "ubs", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 11:09 AM / Updated 23 minutes ago Apple shares skid on report of iPhone X production cut Muvija M 3 Min Read \n(Reuters) - Apple Inc will halve its iPhone X production target for the first quarter to around 20 million units, Nikkei reported on Monday, sending its shares down more than 2 percent in early trading. \nThe report added to growing concerns around weak sales of the $999 phone, making investors jittery about the company’s financial outlook for the year when it reports first-quarter results on Thursday. \n“Apple earnings should handily beat December quarter expectations, but March guidance could moderately disappoint,” UBS analysts said. “We don’t think F18 will be a ‘supercycle’ year”. \nThe production cut was prompted by slower-than-expected sales in the holiday shopping season in Europe, the United States and China, the Japanese newspaper reported, without citing a source. ( s.nikkei.com/2BASQZU ) \nAnalysts have lowered their estimates for iPhone X shipments in the past few weeks, citing high price of the device among other factors, with at least three downgrading their rating on the stock. \nA survey of people planning to buy the iPhone showed that the percentage of them looking to buy the iPhone X has dropped to 37 percent from 43 percent in an earlier survey, UBS analysts wrote in a note on Monday. \nVerizon Communications Inc said last week their postpaid device activations were lower than last year as people were keeping phones longer. \nThe iPhone X, which features an edge-to-edge display and facial recognition technology to unlock the phone, went on sale in November in the United States. \nAsian supply chain checks suggest that iPhone X orders have been weakening recently, with first-quarter production likely to be about 20 million units, JP Morgan analyst wrote in a note dated Jan. 24. \nQuite a few of Apple’s iPhone parts suppliers are based in Asia. Shares of Foxconn, one of Apple’s main suppliers and formally known as Hon Hai Precision Industry Co Ltd, fell 0.7 percent on Monday. \nCanaccord Genuity analysts have lowered their second-quarter iPhone shipment estimates to 59.9 million units from 66 million units, citing their own survey. \n“Our survey work indicates iPhone X sales were strong during the December quarter but sales appear slower in January, more in line with normal seasonal trends,” they wrote in a note. \nApple was not immediately available for comment. \nShares of U.S.-listed Apple suppliers such as Qorvo Inc and Micron Technology Inc edged lower following the report. Reporting by Muvija M in Bengaluru; Editing by Saumyadeb Chakrabarty", "external_links": [], "published": "2018-01-29T17:12:00.000+02:00", "crawled": "2018-01-29T17:46:38.008+02:00", "highlightTitle": ""}