{"organizations": [], "uuid": "085f8c9fdd2212a15a9bf33ea9dcd612aabd4228", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219126903&w=1200&r=LYNXMPEE02166", "site_section": "http://feeds.reuters.com/Reuters/PoliticsNews\r", "section_title": "Reuters: Politics", "url": "https://www.reuters.com/article/us-usa-congress-agenda-factbox/factbox-trump-congress-face-a-long-to-do-list-in-2018-idUSKBN1ES1T8", "country": "US", "domain_rank": 408, "title": "Factbox: Trump, Congress face a long to-do list in 2018", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T21:40:00.000+02:00", "replies_count": 0, "uuid": "085f8c9fdd2212a15a9bf33ea9dcd612aabd4228"}, "author": "", "url": "https://www.reuters.com/article/us-usa-congress-agenda-factbox/factbox-trump-congress-face-a-long-to-do-list-in-2018-idUSKBN1ES1T8", "ord_in_thread": 0, "title": "Factbox: Trump, Congress face a long to-do list in 2018", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - U.S. President Donald Trump and the Republican-led Congress have set their sights on an infrastructure initiative and welfare reform as two of their top legislative priorities for 2018. Lawmakers also have must-pass budget bills and other unfinished business they need to tackle after the holiday break.\nFollowing is a rundown of the major items on the legislative agenda.\nINFRASTRUCTURE Business groups are eager for Trump and Congress to tackle a major transportation bill that would spur construction of highways, airports, and other infrastructure. Republicans have yet to lay out how they would pay for such an ambitious project when traditional funding mechanisms, such as an increase in the gas tax, remain politically unpopular.\nWELFARE REFORM After passing a massive tax-cut package, House Speaker Paul Ryan and other conservative Republicans are eager to overhaul food stamps and other anti-poverty programs. Lawmakers could add work requirements for able-bodied recipients or lump a range of programs together to give states more control over how they are administered.\nThat could run into a brick wall in the Senate, where Republicans’ narrow 51-49 majority requires them to work with Democrats on most issues, and Senate Republican Leader Mitch McConnell said last month that he did not think welfare reform would make much headway.\nWith congressional elections looming in November, Democrats already are portraying the effort as an attack on the poor, coming on the heels of a tax rewrite that delivered its biggest benefits to businesses and wealthy people.\nOutside of Congress, Trump could trim benefits on his own by reducing the time people are eligible for government aid and requiring them to provide more frequent updates on their efforts to find work, said Robert Doar, a welfare specialist at the conservative-leaning American Enterprise Institute.\nGOVERNMENT FUNDING The federal government has been operating on a series of temporary spending measures since the fiscal year started on Oct. 1 as lawmakers have been unable to pass the detailed spending bills that are supposed to be approved on an annual basis.\nRepublicans are pushing for a big increase in military spending, while Democrats say that must be matched by a similar hike for domestic programs like environmental protection and public housing. To avoid a partial government shutdown, the two sides must either resolve their differences in a massive spending bill before funding runs out on January 19 or approve another temporary spending measure.\nSTABILIZING OBAMACARE Though Republicans have failed to repeal President Obama’s signature Affordable Care Act, Trump has taken steps to undermine the law’s subsidized insurance exchanges. Republican Senator Susan Collins of Maine has secured a promise from Republican leaders that the Senate will vote on a bipartisan plan to continue those subsidies, although the effort might be a tougher sell in the House.\nIMMIGRATION President Trump has removed protections for some 800,000 young people who entered the country illegally as children, giving Congress until March 5 to come up with legislation that would prevent the so-called “Dreamers” from deportation. Democrats insist that any spending bill must include permanent protections for Dreamers, while Republicans say the issue should be dealt with separately and should be paired with provisions for stronger border security and new restrictions on legal immigration.\nDEBT CEILING The federal government could have trouble paying its bills and face default if Congress does not raise its borrowing authority in the coming months. The nonpartisan Congressional Budget Office estimates the Treasury Department will run out of cash by late March or early April if Congress does not act by then.\nCHILDREN‘S’ HEALTH\nCongress also is struggling to agree on funding for the Children’s Health Insurance Program. Funding for the program, which provides coverage to almost 9 million low-income children, has been temporarily extended until March 31.\nReporting by Andy Sullivan; Editing by Bill Trott\n ", "external_links": [], "published": "2018-01-03T21:40:00.000+02:00", "crawled": "2018-01-04T00:12:11.007+02:00", "highlightTitle": ""}