{"organizations": [], "uuid": "f7ecd2241f094303dd981802f4c9acb79091d0cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-mid-penn-bancorp-inc-completes-merger-with-the-scottdale-bank-trust-company.html", "country": "US", "domain_rank": 767, "title": "Mid Penn Bancorp, Inc. completes merger with The Scottdale Bank & Trust Company", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T16:15:00.000+02:00", "replies_count": 0, "uuid": "f7ecd2241f094303dd981802f4c9acb79091d0cf"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-mid-penn-bancorp-inc-completes-merger-with-the-scottdale-bank-trust-company.html", "ord_in_thread": 0, "title": "Mid Penn Bancorp, Inc. completes merger with The Scottdale Bank & Trust Company", "locations": [], "entities": {"persons": [{"name": "rory g. ritrievi", "sentiment": "none"}, {"name": "sandler o’neill", "sentiment": "none"}], "locations": [{"name": "millersburg", "sentiment": "none"}, {"name": "pa.", "sentiment": "none"}, {"name": "westmoreland", "sentiment": "none"}, {"name": "mid penn", "sentiment": "none"}, {"name": "fayette", "sentiment": "none"}, {"name": "scottdale", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}], "organizations": [{"name": "the scottdale bank & trust company", "sentiment": "negative"}, {"name": "mid penn bancorp, inc.", "sentiment": "neutral"}, {"name": "penn bancorp, inc.", "sentiment": "neutral"}, {"name": "mid penn bank", "sentiment": "none"}, {"name": "scottdale bank & trust", "sentiment": "none"}, {"name": "mid penn", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MILLERSBURG, Pa., Jan. 09, 2018 (GLOBE NEWSWIRE) -- Mid Penn Bancorp, Inc. (“Mid Penn”) (NASDAQ:MPB) today announced that its merger with The Scottdale Bank & Trust Company was completed on January 8, 2018. Scottdale has been merged with and into Mid Penn’s subsidiary bank, Mid Penn Bank, and is now operating as “Scottdale Bank & Trust, a Division of Mid Penn Bank.”\nThe transaction was valued at approximately $59.1 million and expands Mid Penn’s footprint into western Pennsylvania including Westmoreland and Fayette counties. As a result of the merger, Mid Penn now operates a total of 29 retail locations in Pennsylvania. The consolidated assets of the combined company are valued at approximately $1.4 billion as of September 30, 2017.\n“It is truly an honor and a privilege to welcome Scottdale Bank & Trust customers and employees,” said Mid Penn Bank President and CEO Rory G. Ritrievi. “We look forward to providing customers with new products, services and conveniences while enhancing our community involvement in western Pennsylvania.\"\nSandler O’Neill + Partners, L.P. acted as financial advisor and Stevens & Lee acted as legal advisor to Mid Penn in the transaction. Ambassador Financial Group, Inc. acted as financial advisor and Tucker Arensberg, P.C. acted as legal advisor to Scottdale.\nAbout Mid Penn Bancorp, Inc.\nMid Penn Bancorp, Inc. (NASDAQ:MPB), headquartered in Millersburg, Pa., has been serving the community since 1868. Mid Penn has 29 retail locations in the state of Pennsylvania. Its footprint includes Cumberland, Dauphin, Fayette, Lancaster, Luzerne, Northumberland, Schuylkill and Westmoreland counties. The bank offers a comprehensive portfolio of products and services to meet the banking needs of the communities it serves. To learn more about Mid Penn Bank, visit midpennbank.com .\nSPECIAL CAUTIONARY NOTICE REGARDING FORWARD-LOOKING STATEMENTS\nThis press release, and oral statements made regarding the subjects of this release, contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements are not historical facts and include expressions about management's confidence and strategies and management's current views and expectations about new and existing programs and products, relationships, opportunities, technology and market conditions. These statements may be identified by such forward-looking terminology as \"continues,\" \"expect,\" \"look,\" \"believe,\" \"anticipate,\" \"may,\" \"will,\" \"should,\" \"projects,\" \"strategy\" or similar statements. Actual results may differ materially from such forward-looking statements, and no reliance should be placed on any forward-looking statement. Factors that may cause results to differ materially from such forward-looking statements include, but are not limited to, changes in interest rates, spreads on earning assets and interest-bearing liabilities, and interest rate sensitivity; prepayment speeds, loan originations, credit losses and market values on loans, collateral securing loans, and other assets; sources of liquidity; common shares outstanding; common stock price volatility; fair value of and number of stock-based compensation awards to be issued in future periods; the impact of changes in market values on securities held in Mid Penn’s portfolio; legislation affecting the financial services industry as a whole, and Mid Penn and Mid Penn Bank individually or collectively, including tax legislation; regulatory supervision and oversight, including monetary policy and capital requirements; changes in accounting policies or procedures as may be required by the Financial Accounting Standards Board or regulatory agencies; increasing price and product/service competition by competitors, including new entrants; rapid technological developments and changes; the ability to continue to introduce competitive new products and services on a timely, cost-effective basis; the mix of products/services; containing costs and expenses; governmental and public policy changes; protection and validity of intellectual property rights; reliance on large customers; technological, implementation and cost/financial risks in large, multi-year contracts, including integration of systems of acquired entities; the outcome of future litigation and governmental proceedings, including tax-related examinations and other matters; continued availability of financing; financial resources in the amounts, at the times and on the terms required to support Mid Penn and Mid Penn Bank’s future businesses; and material differences in the actual financial results of merger, acquisition and investment activities compared with Mid Penn’s initial expectations, including the full realization of anticipated cost savings and revenue enhancements. For a list of other factors which would affect our results, see Mid Penn’s filings with the SEC, including those risk factors identified in the \"Risk Factor\" section and elsewhere in our Annual Report on Form 10-K for the year ended December 31, 2016. The statements in this press release are made as of the date of this press release, even if subsequently made available by Mid Penn on its website or otherwise. Mid Penn assumes no obligation for updating any such forward-looking statements at any time, except as required by law.\nContact: Brittany M. Zolko (717) 692-7187 brittany.zolko@midpennbank.com\nSource:Mid Penn Bancorp", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/c01160c9-6d5d-4841-a2b6-d69ec126a06c"], "published": "2018-01-09T16:15:00.000+02:00", "crawled": "2018-01-09T17:55:02.025+02:00", "highlightTitle": ""}