{"organizations": [], "uuid": "82612d4dd26215c266c46489e886e32c82f7e2ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKHealthNews/", "section_title": "Reuters: Health News", "url": "https://uk.reuters.com/article/us-health-iodine-fertility-women/iodine-deficiency-may-contribute-to-womens-fertility-problems-idUKKBN1FE365", "country": "US", "domain_rank": 408, "title": "Iodine deficiency may contribute to women’s fertility problems", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T00:27:00.000+02:00", "replies_count": 0, "uuid": "82612d4dd26215c266c46489e886e32c82f7e2ab"}, "author": "", "url": "https://uk.reuters.com/article/us-health-iodine-fertility-women/iodine-deficiency-may-contribute-to-womens-fertility-problems-idUKKBN1FE365", "ord_in_thread": 0, "title": "Iodine deficiency may contribute to women’s fertility problems", "locations": [], "entities": {"persons": [{"name": "carolyn crist", "sentiment": "none"}, {"name": "james mills", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "bethesda", "sentiment": "none"}, {"name": "maryland", "sentiment": "none"}], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "eunice kennedy shriver national institute of child health and human development", "sentiment": "none"}, {"name": "min read", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 10:28 PM / Updated 10 hours ago Iodine deficiency may contribute to women’s fertility problems Carolyn Crist 5 Min Read \n(Reuters Health) - Women who are deficient in iodine and trying to get pregnant may have half the chance of conceiving compared to women with healthy iodine levels, according to a recent U.S. study. \nResearchers followed more than 500 women trying to conceive over about five years and found that, overall, those with moderate to severe iodine deficiency had 46 percent lower odds, per cycle, of becoming pregnant. \n“Our finding that moderate deficiency is associated with difficulty conceiving has important public health implications,” said lead study author Dr. James Mills of the Eunice Kennedy Shriver National Institute of Child Health and Human Development in Bethesda, Maryland. \n“We were surprised that moderate to severe deficiency was so common and that it reduced the chance of a woman becoming pregnant by almost 50 percent in each menstrual cycle,” he told Reuters Health by email. \nIodine plays a vital role in brain development during pregnancy, but past research finds that about 30 percent of women of childbearing age have iodine blood levels below the target of 100 micrograms per liter, the authors note in Human Reproduction. \nCurrent U.S. guidelines suggest that pregnant and breastfeeding women take a supplement containing 150 micrograms of iodine, but these recommendations don’t address what women should do before they become pregnant. \nMills and his colleagues analyzed data from 2005 to 2009 on 501 women who, when they enrolled in the study, had recently discontinued contraception to become pregnant. At the outset, researchers collected urine samples for iodine analysis. Women also reported on risk factors related to infertility during interviews and then over the next 12 months kept daily journals and used fertility monitors to time sexual intercourse and ovulation. They also used digital pregnancy tests at home to identify pregnancies and menstruation cycles. \nThe research team found that 44 percent of the urine samples were in the deficient range for iodine. Almost a quarter of all samples were in the moderate to severe deficiency range, with less than half of the recommended level. \nAt 12 months after enrollment, 332 women (71 percent) had become pregnant, 42 (10 percent) did not, and the rest dropped out of the study for various reasons. \nFuture studies will also examine the relationship between iodine status and other aspects of reproduction, such as thyroid problems and fetus development. \n“Although it is challenging to find women who are about to try to become pregnant and monitor them, it is important to replicate these findings,” Mills said. \nIt’s tough to give advice to women regarding iodine levels, testing and supplements, said Sarah Bath of the University of Surrey in the UK. \n“Unfortunately, there is no method of assessing iodine status in individuals, so people cannot get tested to know whether they have an adequate amount,” she told Reuters Health by email. “The test used in this study can only be applied to large groups.” \nThe study also didn’t look at the effect of iodine supplements on conception, only the comparison between a group of women with inadequate iodine versus a group with adequate iodine, she added. \n“This study doesn’t provide evidence that iodine supplementation is beneficial in those trying to conceive,” she said. “If people do consider an iodine supplement, however, they should not take a kelp or seaweed supplement, as this can lead to excessive iodine intake.” \nChoosing a diet with an adequate amount of iodine is key, both Mills and Bath advised. Iodine levels in food can vary by country and type of food, and high levels of iodine can also be an issue, so “more is better” isn’t necessarily true either, they added. Good sources of iodine can be found in fish, especially white fish, seafood, milk and dairy products, however. Some salts contain iodine, but women shouldn’t consume more salt just to get more iodine. \n“This issue has not yet been addressed for women trying to conceive,” Mills added. “Therefore, choosing the right diet is prudent . . . and many experts believe that taking prenatal vitamins that contain iodine is a good idea.” \nSOURCE: bit.ly/2Ff1pvz Human Reproduction, online January 11, 2018.", "external_links": [], "published": "2018-01-26T00:27:00.000+02:00", "crawled": "2018-01-26T02:27:26.021+02:00", "highlightTitle": ""}