{"organizations": [], "uuid": "76cda57f48ea8d208ac5bdffc8ce4dc2dfac8af2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/globe-newswire-oceanfirst-financial-corp-and-sun-bancorp-inc-announce-january-29-2018-election-deadline-for-merger-consideration.html", "country": "US", "domain_rank": 767, "title": "OceanFirst Financial Corp. and Sun Bancorp, Inc. Announce January 29, 2018 Election Deadline for Merger Consideration", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-12T17:00:00.000+02:00", "replies_count": 0, "uuid": "76cda57f48ea8d208ac5bdffc8ce4dc2dfac8af2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/globe-newswire-oceanfirst-financial-corp-and-sun-bancorp-inc-announce-january-29-2018-election-deadline-for-merger-consideration.html", "ord_in_thread": 0, "title": "OceanFirst Financial Corp. and Sun Bancorp, Inc. Announce January 29, 2018 Election Deadline for Merger Consideration", "locations": [], "entities": {"persons": [{"name": "sun", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "mount laurel", "sentiment": "none"}, {"name": "sun", "sentiment": "none"}], "organizations": [{"name": "oceanfirst financial corp", "sentiment": "negative"}, {"name": "oceanfirst financial corp.", "sentiment": "negative"}, {"name": "sun bancorp, inc", "sentiment": "neutral"}, {"name": "sun bancorp, inc.", "sentiment": "none"}, {"name": "oceanfirst", "sentiment": "none"}, {"name": "mercury merger sub corp.", "sentiment": "none"}, {"name": "sun", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TOMS RIVER, N.J. and MOUNT LAUREL, N.J., Jan. 12, 2018 (GLOBE NEWSWIRE) -- OceanFirst Financial Corp. (NASDAQ:OCFC) (“OceanFirst”) and Sun Bancorp, Inc. (NASDAQ:SNBC) (“Sun”) today announced that the “ Election Deadline ” (as described in the election materials previously provided to holders of record of Sun common stock (the “Sun Common Stock”), as well as holders of Sun restricted stock awards and restricted stock unit awards (collectively, the “Sun Holders”)) is 5:00 p.m. Eastern Time on January 29, 2018 . The Election Deadline is based on OceanFirst’s and Sun’s current expectation that the proposed merger transaction (the “Transaction”) will be completed on January 31, 2018, as previously disclosed. However, the completion of the Transaction remains subject to the satisfaction or waiver of certain customary conditions contained in that certain Agreement and Plan of Merger, dated as of June 30, 2017 (the “Merger Agreement”), by and among OceanFirst, Sun and Mercury Merger Sub Corp., a wholly-owned subsidiary of OceanFirst.\nThe Election Deadline, as provided in the Merger Agreement, is the deadline by which Sun Holders may elect to receive cash, shares of OceanFirst common stock or both as “merger consideration” in connection with the Transaction pursuant to a formula, and subject to allocation and proration procedures, set forth in the Merger Agreement.\nSun Holders wishing to make an election must deliver to American Stock Transfer & Trust Company, LLC (the “Exchange Agent”), a properly completed Election Form, by the Election Deadline of 5:00 p.m. Eastern Time on January 29, 2018, except as discussed in the following paragraph with respect to Sun Holders who hold shares of Sun Common Stock in “street name.” Each Sun Holder should have received a copy of the Election Form.\nThe election materials do not provide for a guaranteed delivery procedure. Sun Holders bear the risk of ensuring proper and timely delivery of their election materials.\nSun Holders who hold their shares through a bank, broker or other nominee or employees who hold their shares through the Sun 401(k) may be subject to an earlier deadline than the Election Deadline for making their elections, based on the instructions of their brokers, banks or other nominees or trustees. Any Sun Holder that holds shares of Sun Common Stock through a broker should contact their broker for more information .\nSubject to the allocation and proration procedures set forth in the Merger Agreement, Sun Holders may elect to receive, with respect to each share of Sun Common Stock held by such Sun Holder or underlying such Sun Holder’s restricted stock awards or restricted stock unit awards, either\nan amount in cash (the “Cash Consideration”) equal to the sum, rounded to the nearest one-tenth of a cent, of (A) $3.78 and (B) the product, rounded to the nearest one-tenth of a cent, of 0.7884 multiplied by the volume-weighted average trading price of shares of common stock, par value $0.01 per share, of OceanFirst (the “OceanFirst Common Stock”) on the NASDAQ Global Select Market (as reported by The Wall Street Journal ) for the five full trading days ending on the last trading day preceding January 31, 2018 (the “OceanFirst Share Closing Price”); or\na number of shares of OceanFirst Common Stock equal to the quotient (the “Exchange Ratio”), rounded to the nearest one-ten thousandth, of (A) the Cash Consideration divided by (B) the OceanFirst Share Closing Price (the “Stock Consideration” and, together with the Cash Consideration and any cash (without interest) in lieu of fractional shares of Company Common Stock, the “Merger Consideration”).\nAs a result of the allocation and proration procedures set forth in the Merger Agreement, Sun Holders may receive cash and OceanFirst common stock in a different proportion from what they elected, depending on whether either form of consideration is oversubscribed under the terms of the Merger Agreement. The aggregate amount of the Cash Consideration will not exceed the product of (x) $3.78 and (y) the total number of shares of Sun Common Stock issued and outstanding immediately prior to the effective time of the Transaction. Sun Holders will not receive any consideration if the closing of the Transaction does not occur.\nSun Holders who do not submit properly completed election materials to the Exchange Agent by the Election Deadline will be deemed to have made no election and such Sun Holders will have no control over the type of consideration to be received by such Sun Holders in the Transaction.\nThe documents necessary to make an election were previously mailed to Sun Holders reflected in the records of Sun as of December 27, 2017. Sun Holders may obtain additional copies of the election materials by contacting D.F. King & Co., Inc., the information agent, at (877) 478-5041 (toll-free) or (212) 493-3910.\nA more detailed description of the Merger Consideration and the allocation and proration procedures applicable to elections is contained in the Joint Proxy Statement/Prospectus dated September 20, 2017. Sun Holders are urged to read the Joint Proxy Statement/Prospectus carefully and in its entirety. Copies of the Joint Proxy Statement/Prospectus may be obtained for free by following the instructions below under “Additional Information About the Proposed Transaction.”\nCautionary Notes on Forward-Looking Statements\nThis joint press release contains forward-looking statements. These forward-looking statements may include: management plans relating to the Transaction; the expected timing of the completion of the Transaction; the ability to complete the Transaction; any statements of the plans and objectives of management for future operations, products or services, including the execution of integration plans; any statements of expectation or belief; and any statements of assumptions underlying any of the foregoing. Forward-looking statements are typically identified by words such as “believe,” “expect,” “anticipate,” “intend” and other similar words and expressions. Forward-looking statements are subject to numerous assumptions, risks and uncertainties, which change over time and are beyond our control. Forward-looking statements speak only as of the date they are made. Neither OceanFirst nor Sun assumes any duty or undertakes to update forward-looking statements. Because forward-looking statements are subject to assumptions and uncertainties, actual results or future events could differ, possibly materially, from those that OceanFirst or Sun anticipated in its forward-looking statements and future results could differ materially from historical performance. Factors that could cause or contribute to such differences include, but are not limited to, those included under Item 1A “Risk Factors” in Sun’s Annual Report on Form 10-K, those included under Item 1A “Risk Factors” in OceanFirst’s Annual Report on Form 10-K, those included under Item 1A “Risk Factors” in Sun’s most recent Quarterly Report on Form 10-Q, those included under Item 1A “Risk Factors” in OceanFirst’s most recent Quarterly Report on Form 10-Q, those disclosed in Sun’s and OceanFirst’s respective other periodic reports filed with the Securities and Exchange Commission (the “SEC”), as well as the possibility that expected benefits may not materialize in the timeframe expected or at all, or may be more costly to achieve; that the Transaction may not be timely completed, if at all; that prio", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/2bad282d-f47d-4669-8e84-2b829fd15b69", "https://www.globenewswire.com/NewsRoom/AttachmentNg/076c3670-6724-47cf-9403-311fb89d0df1/en"], "published": "2018-01-12T17:00:00.000+02:00", "crawled": "2018-01-12T17:56:58.000+02:00", "highlightTitle": ""}