{"organizations": [], "uuid": "3c4cf77409748e3931a61a4064d0ecad38146d56", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/09/29/103980450-GettyImages-94967904.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/ubs-deutsche-bank-and-hsbc-to-pay-millions-in-spoofing-settlement.html", "country": "US", "domain_rank": 767, "title": "UBS, Deutsche Bank and HSBC to pay millions in spoofing settlement, CFTC says", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.756, "site_type": "news", "published": "2018-01-29T21:29:00.000+02:00", "replies_count": 0, "uuid": "3c4cf77409748e3931a61a4064d0ecad38146d56"}, "author": "Liz Moyer", "url": "https://www.cnbc.com/2018/01/29/ubs-deutsche-bank-and-hsbc-to-pay-millions-in-spoofing-settlement.html", "ord_in_thread": 0, "title": "UBS, Deutsche Bank and HSBC to pay millions in spoofing settlement, CFTC says", "locations": [], "entities": {"persons": [{"name": "deutsc", "sentiment": "negative"}, {"name": "brendan hoffman", "sentiment": "none"}], "locations": [], "organizations": [{"name": "ubs", "sentiment": "negative"}, {"name": "deutsche bank", "sentiment": "negative"}, {"name": "venture capital ubs", "sentiment": "negative"}, {"name": "cftc", "sentiment": "negative"}, {"name": "hsbc", "sentiment": "negative"}, {"name": "bank", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "fbi", "sentiment": "none"}, {"name": "department of justice", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Until now, an illegal trading technique called \"spoofing\" has been associated with two-bit commodities outfits and lone wolf traders operating in the shadows of the markets.\nBut prosecutors revealed on Monday that their investigations have hit the big time.\nDeutsche Bank , UBS and HSBC will collectively pay nearly $47 million to settle civil regulatory charges some of their traders engaged in spoofing in precious metals. Deutsche Bank will pay $30 million and UBS $15 million of that total in a wide-reaching investigation by the Commodity Futures Trading Commission that also names six individuals. HSBC will pay $1.6 million. All three banks cooperated with the investigation.\nIn addition, the Justice Department said Monday it has charged eight individuals with crimes related to deceptive trading, including seven who have been charged with spoofing. Five of these people were employees of global financial institutions, two were traders at large commodities trading firms and one owned a technology consulting firm.\nSpoofing involves placing buy and sell orders with the intent to cancel them before completing the transactions. The orders create the illusion of demand, which distorts prices in a way that benefits the trader's positions. So-called high frequency trading, in which traders use computers to rapidly trade in and out of positions, has been a focus of investigators.\nThe traders named individually, ranging in age from 30 to 55, face accusations they manipulated various futures markets, including S&P index and precious metals, by placing hundreds, in some cases thousands, of \"spoof\" orders to induce other market participants to trade at prices, quantities or times they otherwise would not have traded, the Justice Department said.\nThey traded from their workplaces scattered around the world, from Chicago, New York, London, Zurich, Sydney and Singapore. Six of the individuals were named in both the CFTC and criminal charges. Two others were named in a criminal case.\n\"Spoofing is a particularly pernicious example of bad actors seeking to manipulate the market through the abuse of technology,\" said James McDonald, the CFTC's enforcement director. \"The technological developments that enabled electronic and algorithmic trading have created new opportunities in our markets.\"\nIn a separate statement, John Cronan of the criminal division of the Justice Department said, \"Conduct like this pose significant risk of eroding confidence in U.S. markets and creates an uneven playing field for legitimate traders and investors.\"\nHigh frequency trading, which gained steam as a strategy more than a decade ago with the popularity of electronic and computer-driven trading, brought with it a modern twist on trading abuses that have long affected financial markets. Though traders in past eras faced similar accusations of price manipulation, high speed trading made it possible to carry out a scheme on a grander level.\nAnti-spoofing rules were spelled out in the 2010 Dodd Frank financial reforms, designed to clean up Wall Street after the financial crisis. Prosecutors and the CFTC set out to find cases but until now had only named traders working for smaller outfits or for themselves.\nMichael Coscia, a New Jersey-based trader, was the first person to be tried. He was sentenced to three years in prison in 2016 for spoofing and commodities fraud, and his conviction was upheld on appeal last year. Prosecutors said Coscia made more than $1 million manipulating the prices of gold and other commodity futures using computer-generated trading strategies.", "external_links": [], "published": "2018-01-29T21:29:00.000+02:00", "crawled": "2018-01-29T21:29:18.014+02:00", "highlightTitle": ""}