{"organizations": [], "uuid": "42ef73631aed480151c2fc6149759d9efa4dae61", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220275135&w=1200&r=LYNXMPEE070UK", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-germany-crime-soccer/germany-investigates-shots-fired-at-german-turkish-soccer-players-car-idUKKBN1EX1BJ", "country": "US", "domain_rank": 408, "title": "Germany investigates shots fired at German-Turkish soccer player's car", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T15:52:00.000+02:00", "replies_count": 0, "uuid": "42ef73631aed480151c2fc6149759d9efa4dae61"}, "author": "", "url": "https://uk.reuters.com/article/uk-germany-crime-soccer/germany-investigates-shots-fired-at-german-turkish-soccer-players-car-idUKKBN1EX1BJ", "ord_in_thread": 0, "title": "Germany investigates shots fired at German-Turkish soccer player's car", "locations": [], "entities": {"persons": [{"name": "naki", "sentiment": "none"}, {"name": "deniz naki", "sentiment": "none"}, {"name": "tayyip erdogan", "sentiment": "none"}, {"name": "katja schlenkermann-pitts", "sentiment": "none"}], "locations": [{"name": "germany", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}, {"name": "aachen", "sentiment": "none"}], "organizations": [{"name": "pkk", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "hannover", "sentiment": "none"}, {"name": "die welt", "sentiment": "none"}, {"name": "fc st. pauli", "sentiment": "none"}, {"name": "kurdistan workers party", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 1:54 PM / Updated 20 minutes ago German-Kurdish soccer player shot at in Germany, fears political motive Reuters Staff 4 Min Read \nBERLIN (Reuters) - A German-Kurdish soccer player convicted in Turkey of support for Kurdish separatists said he feared he had been attacked for his views after shots were fired at his car in Germany on Sunday night. FILE PHOTO: FC St. Pauli's Deniz Naki controls the ball during their German Bundesliga first division soccer match against Hannover 96 in Hanover October 1, 2010. REUTERS/Christian Charisius/File Photo \nLocal prosecutors said they were investigating the incident as an attempted murder and a leading opposition politician said Berlin should investigate whether Turkish hit squads were operating in Germany. \nDeniz Naki, 28, was born in Germany but now plays for a Kurdish team in Turkey. He was given an 18-month suspended sentence in April for “terrorist propaganda” in support of the banned Kurdistan Workers’ Party (PKK). \nNaki told the newspaper Die Welt that two shots had hit his car on the motorway near his home town of Dueren in western Germany as he was returning late in the evening from visiting a friend. \n“I believe it was an MIT (Turkish intelligence) agent or someone else who doesn’t like my views,” he was quoted as saying. \nHe said he had not received any specific threats in recent weeks but frequently received threatening messages on social media. \nKatja Schlenkermann-Pitts, a senior prosecutor in Aachen, said on Monday that her office could not confirm Naki’s concerns but that prosecutors were looking “in all directions”. Turkish officials could not immediately be reached for comment. STRANIED RELATIONS FILE PHOTO: FC St. Pauli's Deniz Naki celebrates with supporters their victory after the German Bundesliga second division soccer match against Greuther Fuerth in Fuerth, Germany, May 2, 2010. REUTERS/Michaela Rehle/File Photo \nGermany and Turkey are trying to mend relations following Ankara’s crackdown after an abortive coup attempt in 2016 and the arrests of German citizens in Turkey. \nTurkey has repeatedly accused Germany of failing to act against supporters of the PKK in Germany, which is home to about 3 million people of Turkish descent. Slideshow (2 Images) \nBerlin, for its part, was angered by Turkish political campaigning in Germany last year, and is investigating possible spying by Turkish intelligence agents on opponents of President Tayyip Erdogan. \nSahra Wagenknecht, parliamentary leader of the radical Left party, said Berlin should investigate whether “Turkish death squads are active in Germany” and demanded a decisive crackdown on “criminal activities by Erdogan supporters in Germany”. \nTurkish media on Dec. 20 cited a member of the pro-Kurdish Peoples’ Democratic Party (HDP) as saying that members of Turkish minorities living in Europe, especially Germany, were at risk of politically motivated attacks. \n“We’re talking about homicide units organised by shadowy hands in Turkey to carry out armed assassinations,” Paylan said.Ankara’s chief prosecutor has opened an investigation into the allegations. \nHundreds of militants, security force members and civilians have been killed in largely Kurdish southeast Turkey since the collapse of a ceasefire between the Turkish army and PKK in 2015, reviving a conflict that has killed 40,000 since 1984. \n“I could have died,” Naki told the newspaper. “It was so close. I was scared to death.” He said the shots were fired from a black station wagon that was diagonally behind him, and two bullets struck his car.He said he would not let the incident stop him speaking out against the Turkish government. Reporting by Thorsten Severin, Sabine Siebold, Andrea Shalal in Berlin and Ali Kucukgocmen in Istanbul; Editing by Kevin Liffey", "external_links": [], "published": "2018-01-08T15:52:00.000+02:00", "crawled": "2018-01-08T16:11:37.002+02:00", "highlightTitle": ""}