{"organizations": [], "uuid": "9684ccf24bf9e68690cbc09253afcfa50953aff0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-lake-shore-bancorp-inc-announces-full-year-2017-and-fourth-quarter-financial-results.html", "country": "US", "domain_rank": 767, "title": "Lake Shore Bancorp, Inc. Announces Full Year 2017 and Fourth Quarter Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-31T00:00:00.000+02:00", "replies_count": 0, "uuid": "9684ccf24bf9e68690cbc09253afcfa50953aff0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-lake-shore-bancorp-inc-announces-full-year-2017-and-fourth-quarter-financial-results.html", "ord_in_thread": 0, "title": "Lake Shore Bancorp, Inc. Announces Full Year 2017 and Fourth Quarter Financial Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "fourth quarter financial results dunkirk", "sentiment": "none"}], "organizations": [{"name": "lake shore bancorp, inc.", "sentiment": "neutral"}, {"name": "lake shore bancorp, inc", "sentiment": "neutral"}, {"name": "lake shore savings bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DUNKIRK, N.Y., Jan. 30, 2018 (GLOBE NEWSWIRE) -- Lake Shore Bancorp, Inc. (the “Company”) (NASDAQ:LSBK), the holding company for Lake Shore Savings Bank (the “Bank”), announced unaudited results for the three months and year ended December 31, 2017.\n2017 Fourth Quarter and Full Year Highlights:\nTotal assets at December 31, 2017 increased $29.8 million, or 6.1%, to $519.0 million when compared to December 31, 2016 and exceeded $500 million for the first time in Company history during 2017; Loans receivable, net increased 11.9% to $365.1 million at December 31, 2017 from $326.4 million at December 31, 2016 primarily due to net organic commercial loan growth of $41.8 million, or 30.0%, during 2017; Total deposits grew by $19.3 million, or 5.0%, to $405.2 million at December 31, 2017 when compared to December 31, 2016, which included net core (non-time) deposit growth of $18.0 million; Net interest income increased $1.6 million, or 10.2%, for the year ended December 31, 2017 when compared to the prior year primarily due to commercial loan growth; Fourth Quarter 2017 net interest margin was 3.51%, an increase of six basis points from fourth quarter 2016 primarily due to commercial loan growth; Net interest margin was 3.61% for the year ended December 31, 2017, up 17 basis points when compared to the year ended December 31, 2016 primarily due to an increased volume of commercial loans and a 75 basis point increase in the Prime rate during 2017; Income tax expense during the fourth quarter of 2017 included a $262,000 income tax charge due to the revaluation of net deferred tax assets required by the Tax Cuts and Jobs Act (“Tax Act”); and Non-performing loans as a percent of total loans decreased from 1.80% as of December 31, 2016 to 1.05% as of December 31, 2017 primarily due to the payoff of non-performing commercial loans during 2017.\n“We are pleased to report steady growth in our 2017 balance sheet, especially in commercial loans and core deposits, resulting in a 10.2% increase in net interest income and total assets in excess of the $500 million threshold in 2017,” stated Daniel P. Reininga, President and Chief Executive Officer. “Our financial results continue to reflect our commitment to understanding the individual needs of our customers through an array of innovative solutions designed to help them to achieve their financial goals.”\nNet income for fourth quarter 2017 was $580,000, or $0.09 per diluted share, compared to net income of $140,000, or $0.02 per diluted share, for fourth quarter 2016. The $440,000 increase in fourth quarter 2017 net income reflected a $755,000 decrease in provision for loan losses and a $350,000 increase in net interest income which was partially offset by a $565,000 increase in income tax expense and a $102,000 increase in non-interest expense when compared to the fourth quarter of 2016.\nThe increase in income tax expense during fourth quarter 2017 was primarily due to a $262,000 net deferred tax asset write-down as a result of the revaluation of net deferred tax assets due to the reduction in the U.S. corporate tax rate as of December 31, 2017. The Tax Act lowered the corporate tax rate from 34% to 21%, which will lower the Company’s provision for Federal income taxes in future years. The Tax Act was signed into law during the fourth quarter of 2017 and generally accepted accounting principles requires that the impact of the provisions of the Tax Act be accounted for in the period of enactment. As such, the Company was required to write down the value of its net deferred tax assets as of December 31, 2017, to reflect the reduction in the corporate tax rate. The fourth quarter 2017 increase in income tax expense was also due to higher pre-tax income during the 2017 fourth quarter.\nNet income for the year ended December 31, 2017 was $3.4 million, or $0.55 per diluted share, compared to net income of $3.5 million, or $0.58 per diluted share, for the year ended December 31, 2016. Net income for the year ended December 31, 2017 was impacted by a $1.4 million decrease in non-interest income when compared to the year ended December 31, 2016. During the year ended December 31, 2016, the Company recorded a $1.6 million pre-tax realized gain on the sale of securities as compared to a $244,000 pre-tax realized gain on the sale of securities during the year ended December 31, 2017. Additionally, net income for the year ended December 31, 2017 reflected a $1.6 million increase in net interest income and a $615,000 decrease in the provision for loan losses, which was partially offset by a $481,000 increase in non-interest expense and a $410,000 increase in income tax expense, when compared to the year ended December 31, 2016. The increase in income tax expense was primarily due to the $262,000 net deferred tax asset write-down during the fourth quarter of 2017 as a result of the Tax Act, as well as higher pre-tax income during the year ended December 31, 2017.\nNet Interest Income\nFourth quarter 2017 net interest income increased $350,000, or 9.1%, to $4.2 million as compared to the 2016 fourth quarter. Net interest income increased $1.6 million, or 10.2%, to $16.8 million for the year ended December 31, 2017 as compared to 2016.\nInterest income for the fourth quarter of 2017 was $4.9 million, an increase of $519,000, or 11.8%, compared to the fourth quarter of 2016. The increase was attributable to a $39.9 million, or 12.3%, increase in the average balance of loans, partially offset by a $13.3 million decline in the average balance of the Bank’s securities portfolio from the fourth quarter of 2016.\nInterest income for the year ended December 31, 2017 was $19.4 million, an increase of $1.9 million, or 10.8%, compared to 2016. The increase was primarily attributable to a $40.0 million, or 12.8%, increase in the average balance of loans, partially offset by an $18.1 million decline in the average balance of the Bank’s securities portfolio from the year ended December 31, 2016. The increase in the average loan balance was primarily due to growth in the commercial real estate, home equity and commercial business loan portfolios, partially offset by a decrease in residential, one- to four-family loans since December 31, 2016. The decrease in the average balance of the securities portfolio was primarily due to the Company’s strategy to reinvest paydowns and sales proceeds received on the securities portfolio into adjustable rate commercial loan originations in order to be in a better position to take advantage of future increases in market interest rates. The increase in interest income during the year ended December 31, 2017 was also due to the receipt of $202,000 in past due interest related to the pay-off of one non-performing commercial real estate loan.\nInterest expense for the 2017 fourth quarter was $741,000, an increase of 29.5%, from $572,000 for the 2016 fourth quarter. The increase was primarily due to a 19 and 16 basis points increase in the average interest rates being paid on money market and time deposit accounts, respectively, as well as a $25.3 million, or 7.9%, increase in average deposits since the 2016 fourth quarter. The increase was also due to a $47,000 increase in interest paid on borrowings in the fourth quarter 2017 as compared to the fourth quarter 2016. The average balance for borrowings increased $8.0 million and the average rate paid on borrowings increased to 2.07% in the fourth quarter 2017 from 1.96% since the 2016 fourth quarter.\nInterest expense for the year ended December 31, 2017 was $2.6 million, an increase of $336,000, or 14.6%, from the year ended December 31, 2016. Average core deposits increased by $19.3 million since the year ended December 31, 2016, partially offset by a $3.1 million decrease in higher cost average time deposits. Average interest rates paid on money market and time deposit accounts increased by eight basis points during the year ended December 31, 2017 when compared to the prior year. The increase was also due to a $95,000 increase in interest paid on borrowings in 2017 as compared to 2016. The average balance for borrowings increased $3.8 million and the average rate paid on borrowings increased to 2.03% for the year ended December 31, 2017 as compared to 1.94% for the year ended December 31, 2016.\nNon-Interest Income\nNon-interest income was $601,000 in the fourth quarter of 2017 as compared to $599,000 for the fourth quarter of 2016. Non-interest income was primarily impacted by a $16,000, or 21.6%, increase in earnings on bank owned life insurance, a $4,000 increase in gains on impaired securities and a $3,000 increase in other income during the fourth quarter of 2017. The increase in bank owned life insurance earnings was due to the purchase of an additional $2.5 million in bank owned life insurance during December 2016. These increases were partially offset by a $21,000 decrease in various service charges and fees on deposit and loan accounts during the 2017 fourth quarter.\nNon-interest income decreased by $1.4 million, or 34.8%, to $2.7 million for the year ended December 31, 2017 as compared to $4.1 million for the year ended December 31, 2016. The decrease was primarily due to a $1.6 million pre-tax realized gain on the sale of securities during the year ended December 31, 2016 as compared to a $244,000 pre-tax realized gain on the sale of securities during the year ended December 31, 2017. The decrease was also due to a $107,000, or 88.4%, decrease in gains on the sale of loans during the year ended December 31, 2017 as compared to the prior year. These decreases were partially offset by a $77,000, or 27.4% increase in earnings on bank owned life insurance during the year ended December 31, 2017.\nNon-Interest Expense\nNon-interest expense was $3.7 million for the fourth quarter of 2017, an increase of $102,000, or 2.9%, compared to the same quarter in the prior year. The current year fourth quarter had higher expenses for salary and benefits, FDIC insurance and data processing, partially offset by lower expenses for professional services, occupancy and equipment and postage and supplies.\nNon-interest expense was $14.4 million for the year ended December 31, 2017, an increase of $481,000, or 3.5%, compared to the prior year. Salary and benefits expense increased by $380,000, or 5.2%, due to annual salary increases and grants of stock awards. Data processing expenses increased $138,000, or 12.3%, due to implementation of new technology associated with enhanced product features and growth in deposit and loan accounts. Increases in advertising expenses and other expenses in the year ended December 31, 2017 were partially offset by decreases in professional service fees, FDIC insurance expense and occupancy and equipment expenses.\nAsset Quality\nThe fourth quarter 2017 provision for loan losses was $60,000, a decrease of $755,000, or 92.6%, as compared to the same quarter in the prior year. The decrease in the provision was primarily due to a $390,000 specific reserve set aside for the impairment of one commercial real estate loan and higher commercial loan growth during the fourth quarter of 2016.\nThe provision for loan losses for the year ended December 31, 2017 was $510,000, a decrease of $615,000, or 54.7%, as compared to the prior year. The decrease in provision expense was primarily due to a decrease in provision set aside for impaired loans as a result of non-performing commercial loan payoffs during 2017, as well as an improvement in non-performing loan ratios during the year ended December 31, 2017.\nNon-performing loans as a percent of total loans at December 31, 2017 were 1.05%, a 75 basis points decrease from 1.80% at December 31, 2016, primarily due to payoffs received on non-performing commercial real estate and commercial business loans during 2017. The Company’s allowance for loan losses as a percent of total loans was 0.90% at December 31, 2017 and 0.88% at December 31, 2016.\nBalance Sheet Summary\nTotal assets at December 31, 2017 were $519.0 million. Loans receivable, net at December 31, 2017 were $365.1 million, a $38.7 million, or 11.9%, increase as compared to $326.4 million at December 31, 2016. The increase in total loans was primarily due to an increase in commercial real estate, construction, commercial business and home equity loans, partially offset by a decrease in residential, one- to four-family loans. Total deposits at December 31, 2017 were $405.2 million, an increase of $19.3 million, or 5.0%, compared with $385.9 million at December 31, 2016. The increase in deposits was primarily due to an increase in net core deposits. Core deposits at December 31, 2017 were $256.7 million, an increase of $18.0 million, or 7.5%, from December 31, 2016.\nLong-term debt at December 31, 2017 was $27.0 million, an increase of $8.0 million, or 42.2%, as compared to $19.0 million at December 31, 2016. The additional borrowings taken down during 2017 allowed the Bank to take advantage of low fixed-rates in order to fund loan growth. Stockholders’ equity at December 31, 2017 was $78.4 million, an increase of $2.3 million, or 3.1%, compared with $76.0 million at December 31, 2016. The increase in stockholders’ equity was primarily attributed to net income in 2017 which was partially offset by dividend payments and a decrease in accumulated other comprehensive income.\nAbout Lake Shore\nLake Shore Bancorp, Inc. (NASDAQ:LSBK) is the mid-tier holding company of Lake Shore Savings Bank, a federally chartered, community-oriented financial institution headquartered in Dunkirk, New York. The Bank has eleven full-service branch locations in Western New York, with five locations in Chautauqua County, New York and six locations in Erie County, New York. The Bank offers a broad range of retail and commercial lending and deposit services. The Company’s common stock is traded on the NASDAQ Global Market as “LSBK”. Additional information about the Company is available at www.lakeshoresavings.com .\nSafe-Harbor\nThis release contains certain within the meaning of the Private Securities Litigation Reform Act of 1995, that are based on current expectations, estimates and projections about the Company’s and the Bank’s industry, and management’s beliefs and assumptions. Words such as anticipates, expects, intends, plans, believes, estimates and variations of such words and expressions are intended to identify . Such statements are not guarantees of future performance and are subject to certain risks, uncertainties and assumptions that are difficult to forecast. Therefore, actual results may differ materially from those expressed or forecast in such . The Company and Bank undertake no obligation to update publicly any , whether as a result of new information or otherwise.\nInvestor/Media Contact\nRachel A. Foley\nChief Financial Officer and Treasurer\nLake Shore Bancorp, Inc.\n31 East Fourth Street\nDunkirk, New York 14048\n(716) 366-4070 ext. 1220\nLake Shore Bancorp, Inc.\nSelected Financial Information\nSelected Financial Condition Data December 31, December 31, 2017 2016 (Unaudited) (Dollars in thousands) Total assets $ 518,977 $ 489,174 Cash and cash equivalents 40,913 45,479 Securities available for sale 80,421 86,335 Loans receivable, net 365,063 326,365 Deposits 405,153 385,893 Long-term debt 26,950 18,950 Stockholders’ equity 78,375 76,030\nStatements of Income Three Months Ended Years Ended December 31, December 31, 2017 2016 2017 2016 (Unaudited) (Dollars in thousands, except per share amounts) Interest income $ 4,929 $ 4,410 $ 19,408 $ 17,518 Interest expense 741 572 2,630 2,294 Net interest income 4,188 3,838 16,778 15,224 Provision for loan losses 60 815 510 1,125 Net interest income after provision for loan losses 4,128 3,023 16,268 14,099 Total non-interest income 601 599 2,655 4,070 Total non-interest expense 3,668 3,566 14,360 13,879 Income before income taxes 1,061 56 4,563 4,290 Income tax expense (benefit) 481 (84 ) 1,185 775 Net income $ 580 $ 140 $ 3,378 $ 3,515 Basic and diluted earnings per share $ 0.09 $ 0.02 $ 0.55 $ 0.58 Dividends declared per share $ 0.08 $ 0.07 $ 0.32 $ 0.28\nLake Shore Bancorp, Inc.\nSelected Financial Information\nSelected Financial Ratios Three Months Ended Years Ended December 31, December 31, 2017 2016 2017 2016 (Unaudited) Return on average assets (1) 0.45 % 0.12 % 0.67 % 0.74 % Return on average equity (1) 2.95 % 0.72 % 4.34 % 4.58 % Average interest-earning assets to average interest-bearing liabilities 127.35 % 130.27 % 128.07 % 129.18 % Interest rate spread 3.34 % 3.30 % 3.45 % 3.29 % Net interest margin 3.51 % 3.45 % 3.61 % 3.44 % (1) Annualized for the three months ended December 31, 2017 and 2016.\nDecember 31, December 31, 2017 2016 (Unaudited) Asset Quality Ratios: Non-performing loans as a percent of total net loans 1.05 % 1.80 % Non-performing assets as a percent of total assets 0.82 % 1.28 % Allowance for loan losses as a percent of total net loans 0.90 % 0.88 % Allowance for loan losses as a percent of non-performing loans 85.65 % 49.12 %\nSource:Lake Shore Bancorp, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=1RtKut43vPKRabfKweKfmXZo-gHnCJT1jXMfu_WzwEuVC8FqpdD24qGLUoZSUMA-L1mJyqeoaxBy_xPP0U2vY4cgcyw2B8dsC-1_b1vJUy8="], "published": "2018-01-31T00:00:00.000+02:00", "crawled": "2018-01-31T02:29:42.021+02:00", "highlightTitle": ""}