{"organizations": [], "uuid": "e2426ccc3659730c99a44f3655cf72aefdf0c385", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-rws-entertainment-group-announces-major-expansion-with-launch-of-theatrical-and-development-department-and-new-casting.html", "country": "US", "domain_rank": 767, "title": "RWS Entertainment Group Announces Major Expansion with Launch of Theatrical and Development Department and New Casting Divisions", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T17:30:00.000+02:00", "replies_count": 0, "uuid": "e2426ccc3659730c99a44f3655cf72aefdf0c385"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-rws-entertainment-group-announces-major-expansion-with-launch-of-theatrical-and-development-department-and-new-casting.html", "ord_in_thread": 0, "title": "RWS Entertainment Group Announces Major Expansion with Launch of Theatrical and Development Department and New Casting Divisions", "locations": [], "entities": {"persons": [{"name": "bruston manuel", "sentiment": "none"}, {"name": "ryan stana", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "broadway", "sentiment": "none"}], "organizations": [{"name": "rws entertainment group", "sentiment": "negative"}, {"name": "rws-owned binder casting", "sentiment": "none"}, {"name": "development department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 16, 2018 /PRNewswire/ -- RWS Entertainment Group (RWS), a New York City based full-service production company that creates award-winning custom entertainment, live events, and branded experiences worldwide, today announced the launch of a Theatrical and Development Department, which will produce theatrical shows for Broadway, off-Broadway, and more. Additionally, RWS-owned Binder Casting will open two new divisions – commercial and film – operating alongside the already established theatrical team. The announcement was made today by CEO and founder Ryan Stana and COO, Bruston Manuel.\nThe innovative expansion transforms the Emmy Award-winning RWS into a one-of-a-kind company that brings producing, creative development, general management, production management, casting, wardrobe, rehearsal studios and other production services under one roof, saving producers time and money. RWS can leverage current staff, relationships, brand partnerships, and resources to develop new content and IP for the commercial theatre on Broadway, on the road, and in non-traditional spaces around the world. RWS will now be able to utilize its vast resources to not only provide shows and experiences to 32 theme parks, 17 cruise ships, 10 resorts and over 100 corporate events in 2018, but also develop and produce commercial theatre and arena shows for Broadway and touring markets.\nRWS's new Theatrical and Development Department will be led by theatrical general management veteran Joe Christopher who joins RWS as Vice President, Commercial Theatre Ventures. Christopher has more than 12 years of experience in the industry managing a variety of projects ranging from tours to Broadway and off-Broadway shows. Joining this new RWS department will be legendary casting director Jay Binder who will step into the role of Director of Theatrical Development. The move marks a natural expansion for RWS, allowing the company to take over 15 years of production experience around the globe into the commercial theater marketplace.\n\"RWS Entertainment Group began 15 years ago in the corner of my apartment, and since launching, we've become a leading production company creating Broadway-caliber entertainment and experiences at top resorts, cruise lines, and theme parks,\" said Stana. \"We're ready to take RWS to the next level using our wealth of knowledge, key connections in the global entertainment industry, and amazing new talent to create a company unlike any other. With the launch of the Theatrical and Development Department and two new Binder Casting divisions, RWS will become the go-to one-stop-shop for actors, producers, designers, and entertainment professionals around the world.\"\nJoe Christopher adds, \"One of the many reasons I joined RWS is because it stands uniquely positioned to develop theatrical projects in a truly innovative way. The demand for commercial theatre content has never been greater but our industry's current approach to development, especially new works, takes too long, is too costly and at times frustratingly inefficient. In keeping with RWS' mission to 'Raise Your Experience,' we are going to innovate the model for how theater is developed in order to raise the experience for our audiences, talent, creative teams, clients and producing partners.\"\nWith over 35 years of experience in the Broadway casting world, the 12-time Artios Award-winning Binder Casting will open two new divisions—commercial and film. Spearheading these divisions will be several to-be-announced new hires. The new Binder Casting office will work side-by-side with RWS Casting, the company's internal casting department that already travels to over 54 cities throughout the world auditioning performers for branded entertainment. This synergy will create a true global reach. In 2018, Binder Casting will be able to provide an unprecedented amount of opportunities for actors from film, television and radio to commercials, regional theatres, national tours and Broadway.\nCelebrating 15 years in business, RWS is North America's largest provider of branded stage shows and experiences, providing a full-service approach to custom entertainment for clients that range from NBCUniversal and Westfield to Macy's and Mattel. Working with clients such as Holland America Line and Hard Rock Resorts International, RWS is now the foremost turn-key solution in the industry, providing full design and installation services for interactive experiences, theming, decor, and more to create one-of-a-kind immersive experiences.\nAbout RWS Entertainment Group:\nOperating out of a 40,000 square foot office and rehearsal studio complex together with performer housing in New York City, Emmy Award-winning RWS Entertainment Group is North America's largest provider of branded stage shows and experiences.\nFounded in 2003, led by Ryan Stana, CEO & Bruston Manuel, COO, the multi-award winning live entertainment production company has produced innovative productions and custom brand experiences for top resorts, cruise lines, theme parks, corporate events and NYC fashion events for an impressive roster of clients that include Holland America Line, Hard Rock Resorts, Prada, NBCUniversal, Cedar Fair, Hershey Entertainment and Resorts, Westfield, Macy's, Vera Wang, Mattel, to name a few. RWS is now the foremost turn-key solution in the industry, providing full design and installation services for interactive experiences, theming, décor and more, to create unparalleled immersive experiences.\nIn July 2016, RWS acquired 12-time Artios Award-winning Binder Casting, a leading casting firm for Broadway, film, television and commercials. For more information about RWS Entertainment Group, please visit rwsnyc.com , bindecasting.com , Facebook , Instagram , and Twitter .\nFor more information, please contact:\nEd James | High10 Media for RWS | ed@high10media.com | 917-593-4628\nLuke Carron | High10 Media for RWS | luke@high10media.com | 212-918-2042\nView original content with multimedia: http://www.prnewswire.com/news-releases/rws-entertainment-group-announces-major-expansion-with-launch-of-theatrical-and-development-department-and-new-casting-divisions-300583127.html\nSOURCE RWS Entertainment Group", "external_links": ["http://www.prnewswire.com/news-releases/rws-entertainment-group-announces-major-expansion-with-launch-of-theatrical-and-development-department-and-new-casting-divisions-300583127.html", "https://www.facebook.com/rwsentgroup/", "https://www.instagram.com/rws_nyc/", "https://www.rwsnyc.com/", "https://twitter.com/rwsnyc", "http://bindecasting.com/"], "published": "2018-01-16T17:30:00.000+02:00", "crawled": "2018-01-16T18:33:03.011+02:00", "highlightTitle": ""}