{"organizations": [], "uuid": "0e265caf541dc0607b458b6a6bbba80b16e0e41f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/deals", "section_title": "Deals News | Reuters", "url": "https://www.reuters.com/article/us-gulf-qatar-ipo/qatar-dairy-producer-baladna-to-ipo-in-first-half-expand-into-new-areas-idUSKBN1F301I", "country": "US", "domain_rank": 408, "title": "Qatar dairy producer Baladna to IPO in first half, expand into new areas", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-14T10:03:00.000+02:00", "replies_count": 0, "uuid": "0e265caf541dc0607b458b6a6bbba80b16e0e41f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-gulf-qatar-ipo/qatar-dairy-producer-baladna-to-ipo-in-first-half-expand-into-new-areas-idUSKBN1F301I", "ord_in_thread": 0, "title": "Qatar dairy producer Baladna to IPO in first half, expand into new areas", "locations": [], "entities": {"persons": [{"name": "baladna", "sentiment": "negative"}], "locations": [{"name": "baladna", "sentiment": "none"}, {"name": "qatar", "sentiment": "none"}, {"name": "dubai", "sentiment": "none"}, {"name": "saudi arabia", "sentiment": "none"}, {"name": "egypt", "sentiment": "none"}, {"name": "united arab emirates", "sentiment": "none"}, {"name": "bahrain", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "ipo", "sentiment": "negative"}, {"name": "qnb capital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DUBAI (Reuters) - Qatari company Baladna, which is creating a dairy industry in the desert to help the country withstand a boycott by other Arab states, plans an initial public offer of its shares in the next few months and aims to move into other farming sectors.\n“In partnership with a group of businessmen and local citizens, Baladna plans to launch its IPO in the first half of 2018,” the company, which flew 3,400 cows into Qatar during the initial weeks of the boycott to address a shortage of fresh milk, said on Sunday.\nBaladna has appointed QNB Capital to arrange the IPO, which still needs approval by regulatory authorities, it added. Reuters reported in December that the company planned an IPO to raise funds and bring in strategic investors.\nThe IPO underlines one way in which Qatar is reacting to the boycott: it is building up domestic companies to develop local production of key goods and services.\nSaudi Arabia, the United Arab Emirates, Bahrain and Egypt cut diplomatic and trade ties with Qatar last June. This closed Qatar’s border with Saudi Arabia, across which most of its fresh food was imported, and disrupted its Gulf shipping routes.\nSo the Qatari government has been giving logistical and other support to companies such as Baladna, which is owned by Qatari businessmen Moutaz and Ramez Al-Khayyat, to foster domestic production.\nSunday’s statement did not give financial details of the IPO but one source familiar with the company told Reuters earlier that it might value Baladna at about 2 billion riyals ($550 million). The source stressed a final figure had not been fixed.\nFollowing its initial airlift of cows, Baladna plans two sea shipments - each of 3,300 animals - into Qatar by February, its chief executive told Reuters in November. Another consignment of 3,000 cows was on the cards but not yet ordered.\nThe company said on Sunday that it planned to begin producing fresh juice and animal feed in May this year - projects that could also help to advance Qatar’s goal of increasing food security for its population of 2.7 million.\nIn addition, Baladna plans to build chicken farms producing meat and eggs. Construction of these facilities will begin this month and they will be ready in the middle of 2019, the firm said. The facilities would eventually be able to produce 42 million broiler chickens and 200 million eggs annually.\nThe company said it also planned to convert all waste in its farms to organic fertilisers to meet market demand. It did not give details.\nQatar’s stock market was hit hard by the global financial crisis at the end of the last decade and there have been only three IPOs since 2010. Qatari conglomerate Investment Holding Group was the latest, in August last year.\nEditing by Andrew Torchia\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-14T10:03:00.000+02:00", "crawled": "2018-01-14T07:49:21.009+02:00", "highlightTitle": ""}