{"organizations": [], "uuid": "e3ee5fbb5376507ee36679678a0d904fbac02e1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/southeast-asia-stocks/se-asia-stocks-singapore-hits-near-3-wk-high-on-growth-data-idUSL4N1OX1J5", "country": "US", "domain_rank": 408, "title": "SE Asia Stocks-Singapore hits near 3-wk high on growth data", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T12:10:00.000+02:00", "replies_count": 0, "uuid": "e3ee5fbb5376507ee36679678a0d904fbac02e1d"}, "author": "", "url": "https://www.reuters.com/article/southeast-asia-stocks/se-asia-stocks-singapore-hits-near-3-wk-high-on-growth-data-idUSL4N1OX1J5", "ord_in_thread": 0, "title": "SE Asia Stocks-Singapore hits near 3-wk high on growth data", "locations": [], "entities": {"persons": [{"name": "irvin seah", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}], "organizations": [{"name": "dbs group holdings ltd", "sentiment": "none"}, {"name": "dbs bank", "sentiment": "none"}, {"name": "aditya soni jan", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "oversea-chinese banking corp ltd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 10:11 AM / Updated an hour ago SE Asia Stocks-Singapore hits near 3-wk high on growth data Reuters Staff 3 Min Read \nBy Aditya Soni Jan 2 (Reuters) - Singapore shares climbed nearly 1 percent on Tuesday, buoyed by data showing the city-state's economy grew last year at its fastest pace since 2014, while Indonesia reversed course to end lower after touching a record high. The Singapore index closed at its highest since Dec. 14, with financials leading the gainers. Index heavyweight DBS Group Holdings Ltd was up 1.4 percent, while Oversea-Chinese Banking Corp Ltd rose 0.8 percent. \"Today's data affirm that the recovery is broadening out,\" said Irvin Seah, an economist at DBS Bank. \"The services sector is likely to take over from the manufacturing sector as the main engine of growth in 2018.\" Although advance estimates showed Singapore's economic growth slowing in the fourth quarter as factories lost steam, a services sector recovery has bolstered expectations the central bank could tighten monetary policy as early as April. The affluent-state's full-year growth came in at the top end of the government's official 3.0-3.5 percent forecast range, its fastest expansion in three years. In Indonesia, shares closed down 0.3 percent, dragged down by financials and stocks of telecommunication services providers. It hit a record high earlier in the session. Bank Mandiri lost 1.9 percent, while clove cigarettes maker Gudang Garam fell 2.7 percent. Malaysia snapped three consecutive sessions of gains, led by consumer staples and telecommunication services. \"This is most likely the reaction towards strong share prices in the previous (trading) days,\" said Jolynn Kek, investment manager at Aberdeen Asset Management. \"It's only the first day of trading for the year, so it's hard to say (if) it's indicative of a longer term trend.\" Sime Darby Plantation Bhd slumped 8.5 percent, while Malayan Banking Bhd slipped 1.4 percent. Vietnam shares rose for a seventh straight session to end at their highest since November 2007, with financial stocks leading. BIDV climbed to a more than two-year high, while VPBank hit a record high. Stock markets in Thailand and the Philippines were closed for a holiday. For Asian Companies click; SOUTHEAST ASIAN STOCK MARKETS Change on day Market Current Previous close Pct Move Singapore 3430.3 3402.92 0.80 Jakarta 6339.238 6355.654 -0.26 Kuala Lumpur 1782.7 1796.81 -0.79 Ho Chi Minh 995.77 984.24 1.17 Change on year Market Current End 2017 Pct Move Singapore 3430.3 3402.92 0.80 Jakarta 6339.238 6,355.65 -0.26 Kuala Lumpur 1782.7 1796.81 -0.79 Ho Chi Minh 995.77 984.24 1.17 (Reporting by Aditya Soni in Bengaluru; Additional reporting by Liz Lee from Kuala Lumpur; Editing by Biju Dwarakanath)", "external_links": [], "published": "2018-01-02T12:10:00.000+02:00", "crawled": "2018-01-02T13:35:11.000+02:00", "highlightTitle": ""}