{"organizations": [], "uuid": "35f5eb199586ced379303fedfca2941b31fbb052", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-ballard-expects-to-report-record-financial-results-for-fiscal-2017-provides-comments-on-short-seller-report.html", "country": "US", "domain_rank": 767, "title": "Ballard Expects to Report Record Financial Results For Fiscal 2017; Provides Comments on Short-Seller Report", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T10:00:00.000+02:00", "replies_count": 0, "uuid": "35f5eb199586ced379303fedfca2941b31fbb052"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-ballard-expects-to-report-record-financial-results-for-fiscal-2017-provides-comments-on-short-seller-report.html", "ord_in_thread": 0, "title": "Ballard Expects to Report Record Financial Results For Fiscal 2017; Provides Comments on Short-Seller Report", "locations": [], "entities": {"persons": [{"name": "ballard", "sentiment": "negative"}, {"name": "randy macewen", "sentiment": "none"}], "locations": [{"name": "vancouver", "sentiment": "none"}], "organizations": [{"name": "ballard power systems", "sentiment": "none"}, {"name": "tsx", "sentiment": "none"}, {"name": "bldp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VANCOUVER, Jan. 29, 2018 /PRNewswire/ - To ensure the company's shareholders have accurate information about the company's performance and prospects, Ballard Power Systems (NASDAQ: BLDP; TSX: BLDP) today previewed its anticipated year-end financial results and provided comments on a recent short-seller report.\nBased on preliminary unaudited financial statements for fiscal 2017 Ballard expects to report record annual revenue of approximately $120 million, positive Adjusted EBITDA, and year-ending cash on hand of approximately $60 million. A conference call to review fourth quarter and full-year 2017 operating results will be held March 1, 2018.\n\"We believe these results fully validate our long-held belief that Ballard is uniquely positioned to capitalize on the worldwide trend toward zero-emission transportation,\" said Randy MacEwen, President and CEO. \"Nothing we have seen in the short-seller report fundamentally changes our outlook for the business. To the contrary, we note that some of the statements upon which the short-seller bases its argument are demonstrably false, while others amount to little more than what we believe is unduly negative speculation about the obvious and well-disclosed risks and uncertainties of commercializing new technologies in emerging markets.\"\nBallard notes the short-seller's report contains a number of unsubstantiated forward-looking statements, assumptions and opinions, as well as other statements and assertions that are simply false. Following are illustrative examples, among others, of important factual errors in the short-seller's report:\nA false claim that the Synergy Ballard joint venture is only able to produce a few hundred fuel cell stacks per year. In fact, the joint venture has produced 1,145 stacks since beginning operations in September 2017, including 558 stacks manufactured in December alone; and A false claim that there are no fuel cell bus demonstration lines operating in Guangdong, Sanshui or Yunfu. In fact, according to the local transit operators, 11 of the previously commissioned fuel cell buses powered by Ballard technology have been operating in the Cities of Foshan and Yunfu since October 2016, traveling a total of more than 240,000 kilometers to date. The remaining 13 commissioned fuel cell buses are ready for operation, subject to receipt of license plates from the appropriate local authorities.\nAs these examples indicate, Ballard shareholders would be well-advised to view any communication from these types of investors with a healthy degree of skepticism, particularly since short-sellers profit when a target company's shares decline in value.\nBallard will continue to demonstrate the strength of its strategy and will let the results of its business efforts speak for themselves.\nInvestor Conference Call – March 1, 2018\nAs previously announced, the Company will host its next quarterly conference call on Thursday, March 1st, 2018 at 8:00 a.m. Pacific Time (11:00 a.m. Eastern Time). At that time, management will review Ballard's anticipated record fourth quarter and full-year 2017 operating results, as well as the Company's solid business outlook for 2018. This will include updates regarding execution of the Company's growth strategy in China and the growing opportunities for Heavy Duty Motive fuel cell electric vehicle applications in Asia, Europe and North America.\nAbout Ballard Power Systems\nBallard Power Systems (NASDAQ: BLDP; TSX: BLDP) provides clean energy products that reduce customer costs and risks, and helps customers solve difficult technical and business challenges in their fuel cell programs. To learn more about Ballard, please visit www.ballard.com .\nThis release contains forward-looking statements concerning anticipated product performance, customer benefits and market demand for our products. These forward-looking statements reflect Ballard's current expectations as contemplated under section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Any such forward-looking statements are based on Ballard's assumptions relating to its financial forecasts and expectations regarding its product development efforts, manufacturing capacity, and market demand.\nThese statements involve risks and uncertainties that may cause Ballard's actual results to be materially different, including general economic and regulatory changes, detrimental reliance on third parties, successfully achieving our business plans and achieving and sustaining profitability. For a detailed discussion of these and other risk factors that could affect Ballard's future performance, please refer to Ballard's most recent Annual Information Form. Readers should not place undue reliance on Ballard's forward-looking statements and Ballard assumes no obligation to update or release any revisions to these forward looking statements, other than as required under applicable legislation.\nSOURCE Ballard Power Systems Inc.", "external_links": ["http://www.ballard.com/"], "published": "2018-01-29T10:00:00.000+02:00", "crawled": "2018-01-29T10:27:44.000+02:00", "highlightTitle": ""}