{"organizations": [], "uuid": "ef972c42d114d094cc19b7766d9ae79dc4968c9b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/hna-group-creditors/update-1-chinas-hna-may-face-2-4-bln-liquidity-shortfall-in-q1-bloomberg-idUSL4N1PP266", "country": "US", "domain_rank": 408, "title": "UPDATE 1-China's HNA may face $2.4 bln liquidity shortfall in Q1 -Bloomberg", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T08:26:00.000+02:00", "replies_count": 0, "uuid": "ef972c42d114d094cc19b7766d9ae79dc4968c9b"}, "author": "", "url": "https://www.reuters.com/article/hna-group-creditors/update-1-chinas-hna-may-face-2-4-bln-liquidity-shortfall-in-q1-bloomberg-idUSL4N1PP266", "ord_in_thread": 0, "title": "UPDATE 1-China's HNA may face $2.4 bln liquidity shortfall in Q1 -Bloomberg", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "hainan", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "hna", "sentiment": "negative"}, {"name": "hna group", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 27 AM / in 12 minutes UPDATE 1-China's HNA may face $2.4 bln liquidity shortfall in Q1 -Bloomberg Reuters Staff \n* HNA briefed major creditors on liquidity issue last week - Bbg \n* Firm raising funds after $50 bln deal spree caused cash crunch \n* Firm expects funding pressures to ease in Q2 - Bbg (Adds details from report, context) \nBEIJING, Jan 30 (Reuters) - China’s HNA Group has told creditors it potentially faces a liquidity shortfall of at least 15 billion yuan ($2.4 billion) in the first quarter as repayments to creditors come due, Bloomberg reported on Tuesday citing unnamed sources. \nThe report said HNA briefed major creditors and provincial government officials during a meeting last week in the Chinese island province of Hainan and that some creditors are considering banding together to exert further pressure on HNA. \nHNA declined to comment on the report. \nHNA has been looking to sell off assets and raise funds after a $50 billion acquisition spree over the past two years sparked scrutiny of its opaque ownership and use of leverage. \nThe aviation-to-financial services conglomerate is now facing rising financing costs and has seen around half of its listed units suspend trading in their shares ahead of an anticipated restructuring. \nThe group said earlier this month it had reached a deal to sell a building in Sydney for around $166 million, part of a series of measures to raise funds. \nHNA told creditors at the meeting it expected pressure on its finances to ease in the second quarter as the group stepped up disposals, Bloomberg reported, citing two of the people. \nHNA chairman Chen Feng acknowledged a liquidity issue linked to its spate of deals earlier this month, but expressed confidence the firm could manage its cash crunch and would continue to receive support from its lenders. \nThe conglomerate has about 65 billion yuan in debt it needs to repay during the first quarter, Bloomberg said citing one unnamed source. \nHNA’s group borrowing, including bank loans and bonds, surged by more than one-third over the first 11 months last year to 637.5 billion yuan, according to a China bond market filing by HNA. Group assets reached 1.2 trillion yuan at the end of June, according to a separate bond market filing. ($1 = 6.3323 Chinese yuan renminbi) (Reporting by Beijing Monitoring Desk and Matthew Miller in BEIJING and Adam Jourdan in SHANGHAI; Editing by Shri Navaratnam and Muralikumar Anantharaman)", "external_links": [], "published": "2018-01-30T08:26:00.000+02:00", "crawled": "2018-01-30T08:43:15.006+02:00", "highlightTitle": ""}