{"organizations": [], "uuid": "6782893ef2b752f70ce71a5fdf2170d3ad696be1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225416283&w=1200&r=LYNXMPEE0P0EX", "site_section": "http://feeds.reuters.com/reuters/UKStocksAndSharesNews/", "section_title": "Reuters: Stocks & Shares News", "url": "https://uk.reuters.com/article/uk-europe-view-friday/daily-briefing-trump-takes-america-first-to-globalists-idUKKBN1FF0U1", "country": "US", "domain_rank": 408, "title": "Daily Briefing: Trump takes America First to globalists", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T10:27:00.000+02:00", "replies_count": 0, "uuid": "6782893ef2b752f70ce71a5fdf2170d3ad696be1"}, "author": "", "url": "https://uk.reuters.com/article/uk-europe-view-friday/daily-briefing-trump-takes-america-first-to-globalists-idUKKBN1FF0U1", "ord_in_thread": 0, "title": "Daily Briefing: Trump takes America First to globalists", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "davos", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "steven mnuchin", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "america", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "white house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 8:28 AM / Updated 20 minutes ago Daily Briefing: Trump takes America First to globalists Reuters Staff 4 Min Read \nLONDON (Reuters) - Donald Trump is the star turn of Davos today with a scheduled 1300 GMT speech to the forum . \nWhite House aides said his message would be the same that he has given during other trips abroad over the past year: The United States wants strong ties with its allies but is also determined to reduce its chronic trade deficits with many of them. Meanwhile his comments in favour of a strong dollar may help allay fears of a currency war triggered by his Treasury Secretary Steven Mnuchin earlier this week. \nWildly differing views on Brexit continue to tug British PM Theresa May's cabinet apart. Her office publicly rebuked finance minister Philip Hammond last night for his Davos speech suggesting the expected end-point was merely a \"modest\" change in Britain's economic ties with the continent, countering that Brexit and its goals were anything but modest. Steven Mnuchin, U.S. Secretary of the Treasury, attends the World Economic Forum annual meeting in Davos \nBrexit minister David Davis will today play up the hoped-for liberating effects on the UK economy even during the transition phase of Brexit, arguing it will still be able to sign new trade deals elsewhere (something for which the EU may well signal acceptance on Monday). All this comes against a backdrop of a sluggish UK economy, which Bank of England governor Mark Carney said this morning was lagging the growth acceleration seen globally . \nA first reading of GDP in the last three months of 2017 due later is expected to show growth remained at 0.4 percent, according to the median forecast in the Reuters poll: not great but well off the recession some economists initially forecast after the Brexit vote. \nIn the Czech Republic, pro-EU academic Jiri Drahos is seeking to unseat anti-immigration veteran Milos Zeman, who has sought closer relations with Russia and China, in a tight run-off of the presidential election starting on Friday. Although the president's post has been largely considered symbolic in the past, the vote has taken on greater proportions, pitting as it does a pro-West liberal democrat against the brashly authoritarian, Trump-supporting Zeman. \nVoting continues through till tomorrow. In a final poll released on Monday, Drahos led with 47 percent to 43 percent for Zeman, while 10 percent were undecided. Bookmakers have however tilted their odds in favour of Zeman’s victory.", "external_links": [], "published": "2018-01-26T10:27:00.000+02:00", "crawled": "2018-01-26T11:14:42.015+02:00", "highlightTitle": ""}