{"organizations": [], "uuid": "9024ee513ac80392af695d3ca9b5c07bdca48d55", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/healthNews\r", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-health-stroke/study-confirms-late-clot-extraction-can-save-brain-cells-of-stroke-victims-idUSKBN1FD2SI", "country": "US", "domain_rank": 408, "title": "Study confirms late clot extraction can save brain cells of stroke victims", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T21:23:00.000+02:00", "replies_count": 0, "uuid": "9024ee513ac80392af695d3ca9b5c07bdca48d55"}, "author": "", "url": "https://www.reuters.com/article/us-health-stroke/study-confirms-late-clot-extraction-can-save-brain-cells-of-stroke-victims-idUSKBN1FD2SI", "ord_in_thread": 0, "title": "Study confirms late clot extraction can save brain cells of stroke victims", "locations": [], "entities": {"persons": [{"name": "gregory albers", "sentiment": "none"}], "locations": [{"name": "palo alto", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "reuters health", "sentiment": "none"}, {"name": "stanford stroke center", "sentiment": "none"}, {"name": "gene emery", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters Health) - Early treatment is always best for stroke, but a new study adds to the evidence that removing a major brain clot up to 16 hours after the patient was last known to be healthy can still dramatically reduce death and disability.\nPatients in the trial had a small area of dead brain tissue and a larger area weakened by lack of blood due to a clot in one of the large arteries feeding the brain.\nResearchers called an early halt to the study because the impact of extracting the clot was so dramatic: 45 percent of patients who underwent the procedure were functionally independent versus 17 percent of those who received conventional medical therapy.\nIn addition, the number of stroke patients normally destined for a nursing home was almost cut in half.\n“That’s unprecedented,” chief author Dr. Gregory Albers, director of the Stanford Stroke Center in Palo Alto, California, told Reuters Health by phone.\nThe results were released at the American Heart Association International Stroke Conference in Los Angeles and online by The New England Journal of Medicine.\nThey follow an earlier study, released in November, showing comparable benefits when clot removal was performed within six to 24 hours after stroke symptoms began.\nThe new findings are expected to change the Heart Association’s guidelines, which now recommend that treatment be given within six hours of symptom onset.\n“It’s true that maybe in 50% of the population, a stroke grows very quickly. But there’s a substantial population where the stroke doesn’t grow for many hours” after symptoms appear, said Dr. Albers.\nIn the latter group, the area affected by the stroke “is very small for 12, 14, 16 hours before it takes off,” he said. “It gives us a tremendous opportunity for people who wake up with their stroke, or who have a stroke far away from a major medical institution, to still give them a shot at a functional outcome.”\n“There’s no hint that our benefit was waning at all toward the end of the window,” said Dr. Albers. “It would be surprising if the guideline do not go out to 24 hours.”\nThe Albers study, known as DEFUSE 3, didn’t just find that delayed clot removal, known as thrombectomy, improved the odds of functional independence. The benefits were also reflected in the 90-day mortality rates of 14 percent among the 92 patients in the clot-extraction group compared to 26 percent in the 90-member control group.\nRates of serious side effects did not differ significantly between the two groups - 43 percent with thrombectomy and 53 percent with standard care. Symptomatic intra-brain bleeding rates were also similar, at 7 percent with thrombectomy and 4 percent without it.\n“The results were better than we’d hoped for,” said Dr. Albers.\nThe earlier study, known as DAWN, found that clot extraction can help patients if it’s done six to 24 hours after symptoms develop. At 90 days, 49 percent of the 107 patients who received a thrombectomy along with standard care were functionally independent versus 13 percent of the 99 who received standard care alone.\nAlthough that study did not see a reduction in mortality, “for every 2.8 patients who underwent thrombectomy, one additional patient had functional independence at 90 days,” the researchers concluded, and the benefits were seen regardless of age, stroke severity, time to treatment, and whether the stroke happened when the person was awake or asleep.\nDr. Albers said DEFUSE 3, conducted at 38 U.S. medical centers, included a broader category of patients - 40 percent of the patients in the new trial would not have met the stricter criteria in the DAWN trial.\nSo DEFUSE 3 “extends the number of patients who can be treated” with clot extraction, he said.\nNone of this should detract from the urgency of quickly getting treatment for a stroke victim, Dr. Albers said.\nThe first line of therapy - clot-dissolving drugs - needs to be given within four and a half hours of the beginning of symptoms.\n“It’s important to get both treatments,” he said. “Clot-busting drugs are much better for smaller clots. Thrombectomy is for the bigger ones.”\nThe National Stroke Association ( bit.ly/2DF1cW4 ) recommends the mnemonic F-A-S-T as an easy way to remember the most common symptoms of a stroke. FACE – Ask the person to smile. Does one side of the face droop? ARMS – Ask the person to raise both arms. Does one arm drift downward? SPEECH – Ask the person to repeat a simple phrase. Is their speech slurred or strange? TIME – If you see any of these signs, call for an ambulance immediately.\nSOURCE: bit.ly/2oXfJpu The New England Journal of Medicine, online January 24, 2018.\n ", "external_links": [], "published": "2018-01-24T21:23:00.000+02:00", "crawled": "2018-01-24T21:31:42.013+02:00", "highlightTitle": ""}