{"organizations": [], "uuid": "e95688f90c9efb46b8899e0a2b748291ee82b19f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222154805&w=1200&r=LYNXMPEE0E0Z5", "site_section": "http://www.reuters.com/resources/archive/us/20180115.html", "section_title": "Archive News &amp; Video for Monday, 15 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-olympics-2018-skel-yarnold/coaching-innovation-adds-meat-to-gbs-skeleton-prowess-idUSKBN1F41SM", "country": "US", "domain_rank": 408, "title": "Coaching, innovation adds meat to GB's skeleton prowess", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.053, "site_type": "news", "published": "2018-01-15T22:06:00.000+02:00", "replies_count": 0, "uuid": "e95688f90c9efb46b8899e0a2b748291ee82b19f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-olympics-2018-skel-yarnold/coaching-innovation-adds-meat-to-gbs-skeleton-prowess-idUSKBN1F41SM", "ord_in_thread": 0, "title": "Coaching, innovation adds meat to GB's skeleton prowess", "locations": [], "entities": {"persons": [{"name": "laura deas", "sentiment": "none"}, {"name": "amy williams", "sentiment": "none"}, {"name": "danny holdcroft", "sentiment": "none"}, {"name": "lizzy yarnold", "sentiment": "none"}, {"name": "yarnold", "sentiment": "none"}], "locations": [{"name": "great britain", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BATH(Reuters) - When Great Britain set out an ambitious plan in 2002 to develop a fruitful bobsleigh and skeleton program with the aim of winning Olympic medals, many would have, in the words of the team’s head of performance Danny Holdcroft, laughed at the idea.\nHowever, since the scheme began, there has been a female British skeleton athlete on the podium in every Olympics, including golds for Amy Williams in 2010 and Lizzy Yarnold, who was Britain’s sole gold medalist in Sochi, four years later.\nWith Yarnold returning for Pyeongchang next month and improving compatriot Laura Deas arriving in South Korea in top form, the team are expectant of further glory.\nWhat makes the success even more remarkable is the fact that Britain does not possess a single ice track and a majority of the team’s training takes place on the dry push-start track at Bath University in southwest England.\nBritain may lack ice and snow but it more than makes up for that in technical innovation and world class coaching.\n“It is a real odd one that we have become so good as a nation in women’s skeleton,” Yarnold admitted at Bath University.\n”I think it is a very particular equation where we get fantastic athletes from talent searches, who are good at the push-start aspect and then we teach them how to slide through having the best coaches in the world.\n“Then it is a combination of fantastic equipment that we keep innovating over the years and a great team ethos here.”\nAnother principle of the program is flexibility. In 2016, having won every accolade possible in the sport, Yarnold was feeling jaded and wanted a break from the relentless training and preparation.\nTeam GB allowed their star athlete a year’s sabbatical, during which time she got married and recharged her batteries, and Yarnold has returned hungrier than ever for further success.\n“I knew that after winning the World Championships, the European Championships and the Olympics that I had achieved everything I had ever wanted to,” she added.\nFILE PHOTO: Skeleton - BMW IBSF Bob & Skeleton World Championships - Women's second race - Koenigssee, Germany - 25/2/17 - Lizzy Yarnold of Britain reacts. REUTERS/Arnd Wiegmann/File Photo “I knew I wanted to compete at Pyeongchang, so having that break was important to sort of refresh, reset and re-motivate myself to go again.”\nACHIEVING THE IMPOSSIBLE Those thoughts are echoed by Holdcroft, a former professional soccer goalkeeper, who leads the unlikely team behind Britain’s skeleton success.\n“We have a sort of saying inside the program of achieving the impossible,” Holdcroft said.\n“I think if you set the vision, set it well with transparency and get great people on board, seeing the same dream and the same opportunities, then I think you can achieve a lot. As a program, we have epitomized that quite well.”\nSharing a vision is one thing but delivering on it is another.\nThis Olympics may prove the toughest yet for Britain’s athletes, with both Germany and Canada possessing strong teams capable of sweeping the podium in February.\nYarnold herself has struggled for form and is languishing outside the world’s top 10 following a disappointing World Cup campaign.\nHowever, the 29-year-old is used to delivering when it really matters and remains unconcerned by her form going into the Olympics.\nShe also has fond memories of the track being used in Pyeongchang, having finished fourth at the World Cup event there last season.\n“It is a long track, it is very technical. It is a track I do love but it is hard. I came fourth last year at the World Cup so it is looking good,” Yarnold said with her usual carefree smile.\nBritain is used to being the underdog at the Winter Olympics and it’s a role they have embraced before to startling effect in the women’s skeleton and there’s a fair chance the team could be celebrating five podiums in a row in Pyeongchang.\nReporting by Jack Tarrant; Editing by John O'Brien\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-15T22:06:00.000+02:00", "crawled": "2018-01-16T13:28:23.012+02:00", "highlightTitle": ""}