{"organizations": [], "uuid": "a18514e824ae0d2c46e53e3ed9eece349e9a2d85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/18/reuters-america-u-s-consumer-financial-protection-bureau-seeks-no-new-operating-funds.html", "country": "US", "domain_rank": 767, "title": "U.S. Consumer Financial Protection Bureau seeks no new operating funds", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T18:00:00.000+02:00", "replies_count": 0, "uuid": "a18514e824ae0d2c46e53e3ed9eece349e9a2d85"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/18/reuters-america-u-s-consumer-financial-protection-bureau-seeks-no-new-operating-funds.html", "ord_in_thread": 0, "title": "U.S. Consumer Financial Protection Bureau seeks no new operating funds", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON, Jan 18 (Reuters) - The acting head of the U.S. Consumer Financial Protection Bureau is requesting no new operating funds, opting instead to finance a slimmed-down budget by shrinking a reserve fund established by his predecessor at the agency that has been fiercely criticized by the financial industry.\nMick Mulvaney, interim chief of the agency named by President Donald Trump, informed the Federal Reserve in a letter sent Wednesday that he wanted no new money to fund its operations, saying the bureau wants to be \"responsible stewards of taxpayer dollars.\"\nThe move by Mulvaney, a vocal agency critic who is also is Trump's budget chief, has spurred concerns among consumer advocates that a tighter budget could make the agency less effective at protecting consumers from fraud, predatory loans and other abuse by banks and financial firms. Under President Barack Obama, the CFPB regularly sought hundreds of millions of dollars to fund its operations.\nMulvaney's intended budget for the agency is one-third lower than the last funding request from his predecessor, Richard Cordray, who resigned in November. However, Cordray sought a similar amount one year ago for agency operations.\n\"Mulvaney reveals his intentions for zCFPB no need for rainy day fund to protect consumers. Bad sign of what's to come,\" tweeted Senator Mark Warner, a Democrat.\nThe CFPB, created after the 2007-2009 financial crisis to police consumer lending laws, makes quarterly requests to the Federal Reserve for funding. Mulvaney's request of zero new dollars for the second quarter of the year was first reported by Politico.\nInstead of getting new funds from the Fed, Mulvaney said he plans to spend down a $177 million reserve fund established by his predecessor, Richard Cordray, who resigned from the agency in November.\n\"I see no practical reason for such a large reserve, he wrote. \"It is my intent to spend down the reserve until it is of a much smaller size.\"\nCordray told the Fed in October that he anticipated the bureau would need $217 million for operations in the first quarter of 2018. Mulvaney said he expects the agency only needs $145 million in the second quarter.\nMulvaney announced Wednesday he would be soliciting public comment on nearly all of the agency's operations, as part of a broader revamp of its operations. (Reporting by Pete Schroeder; Editing by David Gregorio)", "external_links": [], "published": "2018-01-18T18:00:00.000+02:00", "crawled": "2018-01-19T03:20:04.059+02:00", "highlightTitle": ""}