{"organizations": [], "uuid": "b7e4ac91d3af77fb62f32126daaa0fa6e0da3324", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226475112&w=1200&r=LYNXMPEE0T051", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-usa-trump-russia-schiff/house-panel-votes-to-release-republican-memo-alleging-anti-trump-bias-idUKKBN1FJ0B0", "country": "US", "domain_rank": 408, "title": "House panel votes to release Republican memo alleging anti-Trump bias", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T05:12:00.000+02:00", "replies_count": 0, "uuid": "b7e4ac91d3af77fb62f32126daaa0fa6e0da3324"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-trump-russia-schiff/house-panel-votes-to-release-republican-memo-alleging-anti-trump-bias-idUKKBN1FJ0B0", "ord_in_thread": 0, "title": "House panel votes to release Republican memo alleging anti-Trump bias", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 3:14 AM / Updated an hour ago House panel votes to release Republican memo alleging anti-Trump bias Patricia Zengerle , John Walcott 4 Min Read \nWASHINGTON (Reuters) - The U.S. House Intelligence Committee voted along party lines on Monday to release a classified memo that Republicans say shows anti-Trump bias by the FBI and the Justice Department in seeking a warrant to conduct an intelligence eavesdropping operation. \nIn approving the release under a rule never before invoked, the Republican majority ignored a warning from Assistant Attorney General Stephen Boyd that making the document public would be “extraordinarily reckless” without submitting it to a security review. \nThe move added new fuel to bitter partisan wrangling over investigations by congressional committees and Special Counsel Robert Mueller into alleged Russian meddling in the 2016 election. \nCalling it a “sad day” for the intelligence committee, top Democratic Representative Adam Schiff said the panel also voted against releasing a Democratic memo that countered the Republican report and rejected his call for a briefing by Federal Bureau of Investigation Director Christopher Wray. \n“Today this committee voted to put the president’s personal interest, perhaps their own political interests, above the national interest,” Schiff said. \nThe memo was commissioned by Representative Devin Nunes, the committee’s Republican chairman. A Nunes spokesman did not immediately respond for a request for a statement. \nThe Department of Justice declined comment. \nTwo sources familiar with the memo said it accuses the FBI and the Justice Department of abusing their authority in asking a Foreign Intelligence Surveillance Court judge to approve a request to extend an eavesdropping operation on Carter Page, an adviser to Trump’s 2016 campaign. \nThe memo charges that the FBI and the Justice Department based the request on a dossier compiled by a former British spy hired to dig up negative information on Trump by a research firm partially financed by the Democratic National Committee and Hillary Clinton’s presidential campaign, the sources said. \nThe dossier, however, was only part of the material on which the request was based, and any portion of the dossier used as evidence first would have been independently confirmed by U.S. or allied intelligence or law enforcement agencies, one of the sources said. \n“There is no way any court would approve a warrant – any warrant, let alone one for surveillance on an American citizen – based on uncorroborated information,” said this source, who spoke on condition of anonymity. \nThe second source, also speaking on condition of anonymity, said the memo accuses Deputy Attorney General Rod Rosenstein and Andrew McCabe, who on Monday announced his resignation as deputy FBI director, of allowing pro-Democratic sentiments to color Mueller’s investigation. \nThe New York Times first reported the contents of the memo. \nDemocrats have criticized the document as “highly misleading,” based on a selective use of highly classified materials and intended to discredit Mueller, who was appointed by Rosenstein. \nRussia denies interfering in the 2016 election, and Trump repeatedly has denied there was any collusion. \nThe House vote gave Trump up to five days to decide whether to release the classified document under a rule that has never before been used. \nBut Hogan Gidley, the White House deputy press secretary, told CNN that the vote has no bearing for Trump because if he takes no action, the memo will become public. \nRepresentative Mike Conaway, a senior committee Republican, said Republicans voted against releasing the Democrats’ memo because the House of Representatives had not had a chance to read it. He said the committee agreed to let House members read it and would consider making it public after that. Reporting by Patricia Zengerle, Jonathan Landay and Eric Beech; Editing by Cynthia Osterman and Lisa Shumaker", "external_links": [], "published": "2018-01-30T05:12:00.000+02:00", "crawled": "2018-01-30T05:24:06.011+02:00", "highlightTitle": ""}