{"organizations": [], "uuid": "b2d96ddeae3c3b8bafbedede8049a99a7b508f35", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/business-wire-alexion-and-elliott-agree-to-collaborate-on-identifying-a-new-board-member.html", "country": "US", "domain_rank": 767, "title": "Alexion and Elliott Agree to Collaborate on Identifying a New Board Member", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T00:05:00.000+02:00", "replies_count": 0, "uuid": "b2d96ddeae3c3b8bafbedede8049a99a7b508f35"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/business-wire-alexion-and-elliott-agree-to-collaborate-on-identifying-a-new-board-member.html", "ord_in_thread": 0, "title": "Alexion and Elliott Agree to Collaborate on Identifying a New Board Member", "locations": [], "entities": {"persons": [{"name": "elliott", "sentiment": "negative"}, {"name": "an elliott", "sentiment": "none"}, {"name": "david brennan", "sentiment": "none"}], "locations": [{"name": "conn.", "sentiment": "none"}], "organizations": [{"name": "new board", "sentiment": "negative"}, {"name": "alexion", "sentiment": "negative"}, {"name": "alxn", "sentiment": "negative"}, {"name": "alexion pharmaceuticals, inc.", "sentiment": "neutral"}, {"name": "alexion board", "sentiment": "none"}, {"name": "company’s board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW HAVEN, Conn.--(BUSINESS WIRE)-- Alexion Pharmaceuticals, Inc. (NASDAQ:ALXN) said today that its Board of Directors and Elliott have agreed to work collaboratively to promptly identify a new member to join the Alexion Board. Alexion announced in November that it had a search underway to fill an open Board seat and is seeking candidates who represent a range of backgrounds, perspectives, skills, and expertise, with an emphasis on maintaining a diverse Board.\nDavid Brennan, Chairman of Alexion’s Board of Directors, said, “This agreement is in line with our ongoing efforts to maintain active and constructive dialogue with all of our shareholders and to identify a new board member with a proven track record of building value. We have been actively working to expand and diversify our Board, and we welcome input from Elliott to identify a strong director candidate to further strengthen Alexion’s Board.”\nAn Elliott spokesperson stated, “Elliott is pleased to reach agreement with Alexion to identify a new independent director to join the Company’s Board of Directors. We are encouraged by actions taken under Ludwig’s leadership to improve financial performance and re-set Alexion’s strategy. Enhancing the strength of the Board is another step toward maximizing value creation for all shareholders.”\nAbout Alexion\nAlexion is a global biopharmaceutical company focused on serving patients and families affected by rare diseases through the innovation, development and commercialization of life-changing therapies. Alexion is the global leader in complement inhibition and has developed and commercializes the first and only approved complement inhibitor to treat patients with paroxysmal nocturnal hemoglobinuria (PNH), atypical hemolytic uremic syndrome (aHUS), and anti-acetylcholine receptor (AchR) antibody-positive generalized myasthenia gravis (gMG). In addition, Alexion has two highly innovative enzyme replacement therapies for patients with life-threatening and ultra-rare metabolic disorders, hypophosphatasia (HPP) and lysosomal acid lipase deficiency (LAL-D). As the leader in complement biology for over 20 years, Alexion focuses its research efforts on novel molecules and targets in the complement cascade, and its development efforts on the core therapeutic areas of hematology, nephrology, neurology, and metabolic disorders. This press release and further information about Alexion can be found at: www.alexion.com .\n[ALXN-G]\nForward-Looking Statements\nThis press release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. These forward-looking statements often include words such as \"anticipate,\" \"believe,\" \"expect,\" \"will,\" or similar expressions. Forward-looking statements are subject to factors that may cause Alexion's results and plans to differ from those expected, including the risks set forth from time to time in Alexion's filings with the U.S. Securities and Exchange Commission, including but not limited to the risks discussed in Alexion's Quarterly Report on Form 10-Q for the period ended September 30, 2017 and in our other filings with the U.S. Securities and Exchange Commission. Alexion does not intend to update any of these forward-looking statements to reflect events or circumstances after the date hereof, except when a duty arises under law.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180102005790/en/\nAlexion Pharmaceuticals, Inc.\nMedia:\nKim Diamond, 475-230-3775\nExecutive Director, Corporate Communications\nor\nInvestors:\nElena Ridloff, CFA, 475-230-3601\nVice President, Investor Relations\nor\nCatherine Hu, 475-230-3599\nDirector, Investor Relations\nSource: Alexion Pharmaceuticals, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180102005790/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.alexion.com&esheet=51736742&newsitemid=20180102005790&lan=en-US&anchor=www.alexion.com&index=1&md5=a73bef32aaa8bf69c66a9695cd49815b"], "published": "2018-01-03T00:05:00.000+02:00", "crawled": "2018-01-03T02:06:05.004+02:00", "highlightTitle": ""}