{"organizations": [], "uuid": "374724b085e360f474dc9c5a3d3bbf6bf7e6414f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 4}, "facebook": {"likes": 9, "shares": 9, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223978352&w=1200&r=LYNXMPEE0K0Y2", "site_section": "http://feeds.reuters.com/reuters/UKTopNews/", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-facebook-europe/facebook-to-open-digital-training-hubs-in-europe-idUKKBN1FA175", "country": "US", "domain_rank": 408, "title": "Facebook to open digital training hubs in Europe", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T01:14:00.000+02:00", "replies_count": 0, "uuid": "374724b085e360f474dc9c5a3d3bbf6bf7e6414f"}, "author": "", "url": "https://uk.reuters.com/article/uk-facebook-europe/facebook-to-open-digital-training-hubs-in-europe-idUKKBN1FA175", "ord_in_thread": 0, "title": "Facebook to open digital training hubs in Europe", "locations": [], "entities": {"persons": [{"name": "sheryl sandberg", "sentiment": "none"}, {"name": "julia fioretti", "sentiment": "none"}], "locations": [{"name": "europ", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "poland", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  brussels", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 21, 2018 / 11:11 PM / Updated 7 hours ago Facebook to open digital training hubs in Europe Julia Fioretti 3 Min Read \nBRUSSELS (Reuters) - Facebook said on Monday it will open three new centres in Europe to train people in digital skills and committed to training one million people over the next two years, part of the social media giant’s drive to show its contribution to the bloc. \nThe U.S. company - which has faced regulatory pressure in Europe over issues ranging from privacy to antitrust - said it would open three “community skills hubs” in Spain, Poland and Italy as well as investing 10 million euros (8.78 million pounds) in France through its artificial intelligence research facility. \n“People are worried that the digital revolution is leaving people behind and we want to make sure that we’re investing in digital skills to get people the skills they need to fully participate in the digital economy,” Sheryl Sandberg, Facebook’s chief operating officer, told Reuters. \nThe community hubs will offer training in digital skills, media literacy and online safety to groups with limited access to technology, including old people, the young and refugees. \nFacebook also committed to having trained one million people and business owners by 2020. \n“Absolutely we want to make sure that people see that we are investing locally, we’re investing in technology, we’re investing in humans,” Sandberg said. \nFacebook’s move comes as EU states discuss proposals to raise the tax bill of tech multinationals after pressure from large states that accuse firms like Amazon, Google, Apple and Facebook of slashing their tax bills by re-routing their EU profits to low-tax countries such as Luxembourg and Ireland. \nSmaller EU countries, like Luxembourg or Malta, argue that a solo EU move on corporate tax reform would damage its economy and favour competitors. \nEuropean Union states could have lost 5.4 billion euros in tax revenues from Google and Facebook between 2013 and 2015, according to a report by an EU lawmaker last year. \nFacebook executives are fanning out across Europe this week to address the social media giant’s slow response to abuses on its platform, seeking to avoid further legislation along the lines of a new hate speech law in Germany it says goes too far. \nThrough its Community Boost EU programme, Facebook will work with small businesses and start-ups to help them grow and hire. \nIt said it would conduct in-person training for 100,000 small- and medium-sized businesses by 2020 and online training for 250,000 businesses. \n“What we’re finding is when small businesses use technology, when small businesses use Facebook, they hire,” Sandberg said. \nThe European Union’s executive has stressed the need to boost Europeans’ digital skills to help bring down unemployment and enable Europe to create its own digital giant. \nFacebook has opened similar centres in countries such as Nigeria and Brazil. Reporting by Julia Fioretti; Editing by Adrian Croft", "external_links": [], "published": "2018-01-22T01:14:00.000+02:00", "crawled": "2018-01-22T01:34:30.004+02:00", "highlightTitle": ""}