{"organizations": [], "uuid": "24a46bddc4122579640a1aebf774f0dbfd0a3cd5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/07/18/103797573-GettyImages-533073356.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/15/rio-tinto-targets-modest-hike-in-2018-iron-ore-shipments.html", "country": "US", "domain_rank": 767, "title": "Rio Tinto targets modest hike in 2018 iron ore shipments", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.301, "site_type": "news", "published": "2018-01-16T04:32:00.000+02:00", "replies_count": 0, "uuid": "24a46bddc4122579640a1aebf774f0dbfd0a3cd5"}, "author": "Michael Nagle", "url": "https://www.cnbc.com/2018/01/15/rio-tinto-targets-modest-hike-in-2018-iron-ore-shipments.html", "ord_in_thread": 0, "title": "Rio Tinto targets modest hike in 2018 iron ore shipments", "locations": [], "entities": {"persons": [{"name": "michael nagle", "sentiment": "none"}, {"name": "jean-sebastien jacques", "sentiment": "none"}, {"name": "rio", "sentiment": "none"}], "locations": [{"name": "rio tinto", "sentiment": "none"}], "organizations": [{"name": "rio tinto", "sentiment": "negative"}, {"name": "metals rio tinto", "sentiment": "negative"}, {"name": "bloomberg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Materials and Metals Rio Tinto targets modest hike in 2018 iron ore shipments Rio Tinto said Tuesday it could ship up to an additional 10 million tonnes of iron ore worth $780 million after reporting a 1 percent rise in 2017 shipments \"The business performed well in the fourth quarter, and we finished the year in line with guidance across all major products,\" Chief Executive Jean-Sebastien Jacques said For 2017, aluminium production eased 1 percent and mined copper output fell 9 percent Published 9 Hours Ago SHARES Michael Nagle | Bloomberg | Getty Images \nGlobal miner Rio Tinto , said on Tuesday it could ship up to an additional 10 million tonnes of iron ore in 2018 worth $780 million at today's prices after reporting a 1 percent rise in 2017 shipments. \nThe slight lift in 2017 output to 330.1 million tonnes came as the average sales price for its ore jumped 20 percent over the year to $64.80, buoyed by strong demand from Chinese steelmakers. \nThe price rise helped the world's no. 2 iron ore miner boost returns to shareholders after a bumper first-half profit. Rio is due to report its 2017 full-year profit on Feb. 7, with forecasts centred around $8.5 billion, up 85 percent. \nRio on Tuesday also stuck to a target of 330-340 million tonnes of iron ore from its new Silvergrass mine, which is ramping up operations in Australia's Pilbara. \nSilvergrass yielded about 2 million tonnes in 2017 and at peak production should yield 10 million tonnes a year, according to the company. \nThe iron ore price stood at $78.05 per tonne on Jan. 12, according to Metal Bulletin. However, uncertainty over Chinese demand has led to forecasts for prices to fall as the year progresses, which could cut Rio's take from any additional sales. \n\"The business performed well in the fourth quarter, and we finished the year in line with guidance across all major products,\" Chief Executive Jean-Sebastien Jacques said in a statement. \nFourth-quarter iron ore shipments rose 3 percent to 90 million tonnes from the same period a year ago and 5 percent against the previous quarter. \nThe last quarter is typically the strongest as miners boost exports ahead of the first quarter, a high cyclone-risk period in Australia. \nIn other commodities, Rio Tinto stuck to a 2018 target of 510,000-610,000 tonnes of mined copper and 225,000-265,000 tonnes of refined copper. Aluminium production will reach 3.5-3.7 million tonnes. \nFor 2017, aluminium production eased 1 percent and mined copper output fell 9 percent. \nThe mined copper decline followed a 43-day strike at Rio's Escondida mine in Chile in the first quarter and a 22 percent drop in output from the Oyu Tolgoi open pit mine in Mongolia as sources of higher grade ore were fully depleted. \nThe slippage in copper output should be more than offset by better copper prices, which have climbed 25 percent in the past year, said Shaw and Partners analyst Peter O'Connor. \nSeparately on Tuesday, Rio Tinto subsidiary Turquoise Hill Resources said it was being asked to pay $155 million in tax arrears by Mongolia after an audit of Oyu Tolgoi's tax payments between 2013 and 2015. \nTurquoise Hill, which is 51 percent owned by Rio Tinto, said it was of the \"firm view\" the mine had paid all required taxes and charges. Turquoise Hill holds 66 percent of Oyu Tolgoi. Related Securities", "external_links": [], "published": "2018-01-16T04:32:00.000+02:00", "crawled": "2018-01-16T04:33:15.016+02:00", "highlightTitle": ""}