{"organizations": [], "uuid": "9887f261e9f9eb4bfe837f6a24cbf3f171dec583", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-vectra-co-announces-agreement-to-sell-its-eaglepicher-technologies-business-to-affiliates-of-gtcr.html", "country": "US", "domain_rank": 767, "title": "Vectra Co. Announces Agreement To Sell Its EaglePicher Technologies Business To Affiliates Of GTCR", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T01:00:00.000+02:00", "replies_count": 0, "uuid": "9887f261e9f9eb4bfe837f6a24cbf3f171dec583"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-vectra-co-announces-agreement-to-sell-its-eaglepicher-technologies-business-to-affiliates-of-gtcr.html", "ord_in_thread": 0, "title": "Vectra Co. Announces Agreement To Sell Its EaglePicher Technologies Business To Affiliates Of GTCR", "locations": [], "entities": {"persons": [], "locations": [{"name": "gtcr st. louis", "sentiment": "none"}], "organizations": [{"name": "vectra co.", "sentiment": "negative"}, {"name": "vectra co", "sentiment": "negative"}, {"name": "eaglepicher", "sentiment": "none"}, {"name": "gtcr llc", "sentiment": "none"}, {"name": "apollo global management", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ST. LOUIS, Jan. 23, 2018 /PRNewswire/ -- Vectra Co. (\"Vectra\"), a portfolio company of certain funds managed by affiliates of Apollo Global Management, LLC (NYSE: APO) and a leading technology-driven diversified company, announced today that it has signed a definitive agreement to sell its EaglePicher business to affiliates of GTCR LLC (\"GTCR\"), a leading private equity firm with over $13 billion in assets under management.\nEaglePicher is a leader in providing advanced power and energy solutions for mission-critical applications with over 170 years of materials and electrochemistry expertise. EaglePicher is focused on specialized applications within high growth areas of defense, aerospace and medical products. As part of the transaction, it is anticipated that the existing management team at EaglePicher and its approximately 800 employees will remain with the business upon the closing. Terms of the agreement were not disclosed. The transaction is expected to close in the first quarter of 2018, subject to the receipt of customary regulatory approvals and fulfillment of customary closing conditions.\n\"The EaglePicher business is well positioned to continue its strong growth trajectory driven by innovation, quality and its mission-critical products. It has been a pleasure to partner with the dedicated employees and management team at EaglePicher and to be a part of this unique business with its storied history and exciting future in defense, aerospace and medical devices. Today's announcement is testament to the strength of the EaglePicher business, the quality of its management and employees, and the professionalism of the GTCR team,\" said Jim Voss, Vectra's CEO.\n\"The management team at EaglePicher greatly enjoyed working with the broader Vectra team, and have appreciated their strategic insight and support for our growth and innovation strategy. We are extremely excited about our partnership with GTCR as we begin a new chapter in the EaglePicher story,\" said Gordon Walker, EaglePicher's President.\nThe transaction is structured as a sale of Vectra Co., the parent company of EaglePicher. Vacuumschmelze, Vectra's magnetic technologies business, will be separated immediately prior to closing and continue to be owned by affiliates of Apollo Global Management going forward.\nFinancial advisor to Vectra is Goldman Sachs & Co. LLC and legal advisors to Vectra are Paul, Weiss, Rifkind, Wharton & Garrison LLP and O'Melveny & Myers LLP (with respect to environmental matters).\nAbout Vectra Co.\nVECTRA is a technology-driven diversified industrial company serving attractive global markets, including automotive systems, electronic devices, aerospace and defense, industrial and medical. Its business platforms use technology to address customers' complex applications and demanding requirements. For more information, visit Vectra's website at www.vectraco.com\nAbout Apollo Global Management\nAPOLLO is a leading global alternative investment manager with offices in New York, Los Angeles, Houston, Chicago, Bethesda, Toronto, London, Frankfurt, Madrid, Luxembourg, Mumbai, Delhi, Singapore, Hong Kong and Shanghai. Apollo had assets under management (AUM) of approximately $242 billion as of September 30, 2017 in private equity, credit and real assets funds invested across a core group of nine industries where Apollo has considerable knowledge and resources. For more information about Apollo, please visit www.agm.com .\nAbout GTCR\nGTCR is a leading private equity firm focused on investing in growth companies in the Financial Services & Technology, Healthcare, Technology, Media & Telecommunications and Growth Business Services industries. The Chicago-based firm pioneered The Leaders Strategy™ – finding and partnering with management leaders in core domains to identify, acquire and build market-leading companies through transformational acquisitions and organic growth. Since its inception, GTCR has invested more than $13 billion in over 200 companies. For more information, please visit www.gtcr.com .\nView original content: http://www.prnewswire.com/news-releases/vectra-co-announces-agreement-to-sell-its-eaglepicher-technologies-business-to-affiliates-of-gtcr-300587042.html\nSOURCE Vectra Co.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.agm.com&esheet=51738425&newsitemid=20180105005360&lan=en-US&anchor=www.agm.com&index=3&md5=bc8b2715bb3f60d85d2bbe4268c4ac4f", "http://www.prnewswire.com/news-releases/vectra-co-announces-agreement-to-sell-its-eaglepicher-technologies-business-to-affiliates-of-gtcr-300587042.html", "http://www.gtcr.com/", "http://www.vectraco.com/"], "published": "2018-01-24T01:00:00.000+02:00", "crawled": "2018-01-24T01:38:52.008+02:00", "highlightTitle": ""}