{"organizations": [], "uuid": "c2bf63e978890000c58cfd93d8c1d69af6a8ec66", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-emmis-announces-third-quarter-earnings.html", "country": "US", "domain_rank": 767, "title": "Emmis Announces Third Quarter Earnings", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T14:00:00.000+02:00", "replies_count": 0, "uuid": "c2bf63e978890000c58cfd93d8c1d69af6a8ec66"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-emmis-announces-third-quarter-earnings.html", "ord_in_thread": 0, "title": "Emmis Announces Third Quarter Earnings", "locations": [], "entities": {"persons": [{"name": "miller kaplan", "sentiment": "none"}, {"name": "jeff smulyan", "sentiment": "none"}], "locations": [{"name": "indianapolis", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "emmis communications corporation", "sentiment": "negative"}, {"name": "emmis", "sentiment": "negative"}, {"name": "kpwr-fm", "sentiment": "none"}, {"name": "terre haute", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "INDIANAPOLIS, Jan. Emmis Communications Corporation (NASDAQ: EMMS) today announced results for its third fiscal quarter ending November 30, 2017.\nEmmis' radio net revenues for the third fiscal quarter were $34.0 million, compared to $42.5 million in the prior year. Due to the sale of the company's Terre Haute radio stations in January 2017, KPWR-FM in Los Angeles in August 2017, and magazine sales last fiscal year, reported results are not comparable year-over year. Emmis pro forma radio revenues per Miller Kaplan (which excludes barter and syndication revenues), were down 4% in markets that were down 2%. Excluding political advertising, Emmis pro forma radio revenues in the third quarter would have been down 3%.\n\"Overall it was a disappointing quarter, but I am encouraged going forward by the ratings trends at our radio stations. This fiscal year, our radio stations have been growing their ratings vis-à-vis our competitors, which should manifest itself in better revenue performance in Q4 and into the next fiscal year,\" said Jeff Smulyan, CEO & Chairman of the Board of Emmis.\n\"Another bright spot is the continuing progress of NextRadio, the Emmis-developed app embraced by the radio industry that provides a unique, measurable platform for radio content,\" Smulyan added. \"This week at the Consumer Electronics Show in Las Vegas, NextRadio announced a first-to-market connected car solution: JVCKENWOOD has adopted NextRadio's technology to provide an enhanced local FM radio listening experience. Samsung , the largest Android handset maker in the world, is the latest device OEM to continue its support for NextRadio by unlocking the FM chip in upcoming smartphone models in the U.S. and Canada. In addition, NextRadio recently had a significant win when a major prepaid wireless carrier in the United States agreed to begin preloading NextRadio on its devices starting in early 2018. These are terrific wins and sustain our momentum.\"\nA conference call regarding earnings will be hosted today at 9 a.m. Eastern today by dialing 1-517-623-4891. Questions may be submitted via email to ir@emmis.com . A digital playback of the call will be available until Thursday, January 18 by dialing 1-203-369-0773.\nEmmis has included supplemental pro forma net revenues, station operating expenses, and certain other financial data on its website, www.emmis.com under the \"Investors\" tab.\nEmmis generally evaluates the performance of its operating entities based on station operating income. Management believes that station operating income is useful to investors because it provides a meaningful comparison of operating performance between companies in the industry and serves as an indicator of the market value of a group of stations or publishing entities. Station operating income is generally recognized by the broadcast and publishing industries as a measure of performance and is used by analysts who report on the performance of broadcasting and publishing groups. Station operating income does not take into account Emmis' debt service requirements and other commitments, and, accordingly, station operating income is not necessarily indicative of amounts that may be available for dividends, reinvestment in Emmis' business or other discretionary uses.\nStation operating income is not a measure of liquidity or of performance, in accordance with accounting principles generally accepted in the United States, and should be viewed as a supplement to, and not a substitute for, our results of operations presented on the basis of accounting principles generally accepted in the United States. Operating income is the most directly comparable financial measure in accordance with accounting principles generally accepted in the United States.\nMoreover, station operating income is not a standardized measure and may be calculated in a number of ways. Emmis defines station operating income as revenues net of agency commissions and station operating expenses, excluding depreciation, amortization and non-cash compensation. A reconciliation of station operating income to operating income is attached to this press release.\nThe information in this news release is being widely disseminated in accordance with the Securities & Exchange Commission's Regulation FD.\nEmmis Communications – Great Media, Great People, Great Service®\nEmmis Communications Corporation is a diversified media company, principally focused on radio broadcasting. Emmis owns 15 FM and 3 AM radio stations in New York, St. Louis, Austin (Emmis has a 50.1% controlling interest in Emmis' radio stations located there) and Indianapolis. Emmis also developed and licenses TagStation®, a cloud-based software platform that allows a broadcaster to manage album art, metadata and enhanced advertising on its various broadcasts, and developed NextRadio®, a smartphone application that marries over-the-air FM radio broadcasts with visual and interactive features on smartphones.\nNote: Certain statements included in this press release which are not statements of historical fact, including but not limited to those identified with the words \"expect,\" \"will\" or \"look\" are intended to be, and are, by this Note, identified as \"forward-looking statements,\" as defined in the Securities and Exchange Act of 1934, as amended. Such statements involve known and unknown risks, uncertainties and other factors that may cause the actual results, performance or achievements of the Company to be materially different from any future result, performance or achievement expressed or implied by such forward-looking statement. Such factors include, among others:\ngeneral economic and business conditions; fluctuations in the demand for advertising and demand for different types of advertising media; our ability to service our outstanding debt; competition from new or different technologies; increased competition in our markets and the broadcasting industry including our competitors changing the format of a station they operate to more directly compete with a station we operate in the same market; our ability to attract and secure programming, on-air talent, writers and photographers; inability to obtain (or to obtain timely) necessary approvals for purchase or sale transactions or to complete the transactions for other reasons generally beyond our control; increases in the costs of programming, including on-air talent; inability to grow through suitable acquisitions or to consummate dispositions; changes in audience measurement systems new or changing regulations of the Federal Communications Commission or other governmental agencies; war, terrorist acts or political instability; and other factors mentioned in documents filed by the Company with the Securities and Exchange Commission.\nEmmis does not undertake any obligation to publicly update or revise any forward-looking statements because of new information, future events or otherwise\nEMMIS COMMUNICATIONS CORPORATION AND SUBSIDIARIES\nCONDENSED CONSOLIDATED FINANCIAL DATA\n(Unaudited, amounts in thousands, except per share data", "external_links": ["http://www.emmis.com/", "https://www.samsung.com/us/", "http://www.prnewswire.com/news-releases/emmis-announces-third-quarter-earnings-300581151.html"], "published": "2018-01-11T14:00:00.000+02:00", "crawled": "2018-01-11T15:13:50.000+02:00", "highlightTitle": ""}