{"organizations": [], "uuid": "6353e5e2c473e05536c168a71b0cd43ad3e3687a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/davos.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/24/data-sheet-davos-wef-uber-paypal/", "country": "US", "domain_rank": 1196, "title": "Data Sheet—Davos World Economic Forum: What It's Like to Go | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.415, "site_type": "news", "published": "2018-01-24T10:43:00.000+02:00", "replies_count": 0, "uuid": "6353e5e2c473e05536c168a71b0cd43ad3e3687a"}, "author": "Aaron Pressman", "url": "http://fortune.com/2018/01/24/data-sheet-davos-wef-uber-paypal/", "ord_in_thread": 0, "title": "Data Sheet—Davos World Economic Forum: What It's Like to Go | Fortune", "locations": [], "entities": {"persons": [{"name": "adam lashinsky", "sentiment": "negative"}, {"name": "aaron pressman", "sentiment": "negative"}, {"name": "davos", "sentiment": "none"}, {"name": "mckinsey", "sentiment": "none"}, {"name": "fei-fei li", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}], "organizations": [{"name": "stanford", "sentiment": "none"}, {"name": "google cloud", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Aaron Pressman and Adam Lashinsky 8:43 AM EST \nThis is the web version of Data Sheet, Fortune’s daily newsletter on the top tech news. To get it delivered daily to your in-box, sign up here . \nI imagine that from afar understanding just what goes on in Davos at the World Economic Forum’s annual meeting is a bit opaque. If it’s any comfort, it isn’t that clear to many us here either. Davos is an often byzantine maze of formal, informal, and completely off-the-grid events attended by thousands of attendees, journalists, and a multitude of hangers-on. \nWith that in mind I thought I’d tell you about my Tuesday, the full first day of forum proceedings. My day is likely to be quite different from any ten other people, but it’ll show you how one person navigates this most intimidating of events. \nI started by hosting a panel on artificial intelligence hosted by McKinsey. Yesterday I noted that the reputed computer scientist Fei-Fei Li of Google Cloud and Stanford spoke. She wowed the crowd with her clear and entertaining portrait of the field, including the need for organizations not as well endowed with PhDs as Google to reach out for help. Bill Ready, chief operating officer of PayPal and formerly the top guy at Braintree, which PayPal acquired to get millennial-oriented payment service Venmo, made a similar point. Despite its own ample resources, PayPal relies on Facebook Messenger for certain customer interactions, taking advantage of Facebook’s superior attributes. \nAfter breakfast I entered the fortified convention center where formal WEF events take place. I caught a Maria Bartiromo-hosted panel on financial markets, and what stuck with me was being reminded how softly Blackstone Founder Stephen Schwarzman speaks. I’m sure he said something important—quietly. After schmoozing a bit in the hallways—a core competency of any attendee—I watched another panel, this one hosted by Andrew Ross Sorkin on the subject of “trust and tech.” The main takeaway: New Uber CEO Dara Khosrowshahi more politely packages the same message on rider and driver safety as Travis Kalanick used to peddle—that with Uber’s huge numbers of rides, bad actors inevitably will act. \nAt lunch I hosted a panel for Chinese retailer JD.com. The event was off the record, but I can tell you a few things about the meal, which took place in a sun-speckled glass room with stunning views of the Alps. Richard Liu, founder and CEO of JD.com is charismatic and youthful. JD.com’s major U.S. partner is Walmart , and its U.S. president (and former head of China) Greg Foran spoke. JD.com sells a ton of printers and PCs made by HP , whose CEO Dion Weisler praised JD.com’s sophistication. And it is thinking about working with Italian men’s luxury brand Ermenegildo Zegna, whose third-generation and exceedingly charming namesake CEO wore an elegant light gray “wash and go” Zegna suit. \nAfter lunch I hosted a live webcasted panel for Accenture, whose top HR executive Ellyn Shook has just completed a report on the future of the workforce. Her shocking stat: Companies are increasing spending on AI by 60%, but only 3% of CEOs are contemplating re-skilling. That’s a wake-up call. I also slipped and slid over to an elegant hotel across town to meet with Anthony Tan, CEO of Grab, the Singapore-based “Uber” of Southeast Asia. He’s as excited by a “wallet” system Grab has created for its 8-country cash-intensive market as he is by ride hailing. “We are a tech company that solves big problems,” he said boldly, proving he’d fit in well in Silicon Valley. Among his biggest investors are SoftBank, Didi (which he insists doesn’t covet the Southeast Asian market), and Hillhouse Capital. \nThe cocktail hour is busy in Davos. I went into a competitor’s den to attend drinks hosted by The Wall Street Journa l. (C’mon … I’ve been around a while and have more than a few friends there from past lives.) I promptly bumped into none other than Travis Kalanick, just arrived from the airport and looking fresh and rejuvenated. He assured me he’s moving on and already is thinking about what comes next. \nFinally, I was one of a handful of men who attended a dinner hosted by the Female Quotient , a group dedicated to boosting professional women, including at Davos, where 21% of attendees are women, up from 18% last year and nowhere near good enough. I was grateful to be there, and as I told the room when I spoke near the end, my only other memory of being so obviously in the minority was the year I lived in Japan. It’s an experience all members of any majority should experience. The table-to-table format of the event focused on “rules” that should be put in workplaces to improve the lot of women. I amplified a point made by journalist Joanne Lipman, whose new book , That’s What She Said: What Men Need to Know (And Women Need to Tell Them) About Working Together , comes out next week. Involve men in these conversations, I implored. We’re eager to at least try to change and certainly to listen. \nWhen my dinner ended various people I knew headed off to a posh party hosted by infamous hedge fund big Stevie Cohen and others to one hosted by Forbes , which Fortune once considered an arch-foe. I bundled up and made for my hotel room instead. \nAs I went to bed I was gratified by the flood of emails responding to my announcement Tuesday of a new Fortune conference, Brainstorm Reinvent , aimed at bringing critical technology trends to c0-level executives in the industrial economy. The event is Sept. 24-25 in Chicago. Please keep the requests for invitations coming. I also received from my friend Michael Schrage of MIT an article he wrote for HBR, “Is ‘Murder by Machine Learning’ the New Death by PowerPoint’? ” It nicely summarizes a lot of the challenges with artificial intelligence and machine learning about which its corporate adherents are well aware but don’t always emphasize. \nMore tomorrow, though perhaps with fewer words, when Winter Storm Donald likely will be in full force. Adam Lashinsky @adamlashinsky NEWSWORTHY \nPay for (not) play . The European Union fined Qualcomm nearly €1 billion, or $1.2 billion, for paying Apple not to use competitors’ mobile chips. “This meant that no rival could effectively challenge Qualcomm in this market, no matter how good their products were,” EU competition chief Margrethe Vestager explained . Qualcomm said it would appeal. \nDeep breath . Salesforce.com CEO Marc Benioff is apparently no fan of social networks like Facebook and Twitter , as he called for strict regulation. “You do it exactly the same way that you regulated the cigarette industry,” Benioff said in an appearance on CNBC on Tuesday. “Here’s a product: cigarettes. They’re addictive, they’re not good for you.” \nBig time pay . Elon Musk’s new 10-year compensation agreement with Tesla will award him stock options worth $1 billion if the company reaches a market cap of $100 billion. (It’s at $59 billion now.) Revenue or adjusted earnings also have to rise 70%. If the company reaches numerous other milestones, including hitting a market cap of $650 billion, Musk gets options worth $56 billion. \nJumping ship . We don’t know yet how much Anthony Noto is getting paid to take the top job at suffering online lender Social Finance . Noto announced Tuesday he was leaving Twitter for SoFi, which is trying to move past the sexual harassment scandal surrounding the departure of former CEO Mike Cagney. \nAccelerating departures . For those of you following the cord cutting trend, Comcast reported Wednesday morning that it lost 38,000 residential video subscribers in the fourth quarter, slightly more than the 29,000 Verizon lost on its FiOS service. For the year, Comcast lost 186,000 home video customers (versus a gain of 103,000 in 2016). Verizon lost 75,000 after gaining 59,000 last year. \nFinally . Apple said it will bring its smart speaker, the HomePod , to market on February 9. The $349 wireless speaker with Siri built in, which was originally due by year end 2017, will be able to interact with connected home appliances and some third-party apps, Apple said. \nIt’s not you, it’s me . Payment platform Stripe is ending support for bitcoin . “Of the businesses that are accepting Bitcoin on Stripe, we’ve seen their revenues from Bitcoin decline substantially,” product manager Tom Karlo wrote in a blog post . “Empirically, there are fewer and fewer use cases for which accepting or paying with Bitcoin makes sense.” FOOD FOR THOUGHT \nBuried deep within the new tax law was a change that could have a huge impact on how tech companies treat their intellectual property. Google, Microsoft, and others have long assigned IP rights to overseas subsidiaries in a bid to shift profits around and lower their U.S. taxes. But the new law lowers the U.S. tax hit on income derived from IP rights to about 13% (from 35% under the old rules). Sam Schechner in the Wall Street Journal explains the possible impact: \nIn recent years, pressure from countries in Europe and the Organization for Economic Cooperation and Development, a group of rich nations, has led to an update of tax rules that generally requires companies to keep their IP in places where they have substantial operations. That has led countries, including Ireland, to close loopholes that allowed structures like the Double Irish to exist and has set off a race among companies to find a new home for their IP. \nFor companies that produce much of their intellectual property on American soil, the U.S. is now an option, advisers say. \n“Now the U.S. has to enter your consideration, absolutely,” said Anna Scally, head of the tech and media practice in Ireland for accounting firm KPMG. She added that firms are currently crunching numbers to find the best alternative locales that comply with tax rules. “It’s not a slam dunk,” Ms. Scally said of the U.S. “But it is an option.” IN CASE YOU MISSED IT ", "external_links": [], "published": "2018-01-24T10:43:00.000+02:00", "crawled": "2018-01-24T21:21:18.023+02:00", "highlightTitle": ""}