{"organizations": [], "uuid": "4b74d9cc97d03611672153acfb2dd695921960ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-bunge-acquires-grupo-minsas-u-s-corn-milling-business.html", "country": "US", "domain_rank": 767, "title": "Bunge acquires Grupo Minsa's U.S. corn milling business", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.037, "site_type": "news", "published": "2018-01-31T00:15:00.000+02:00", "replies_count": 0, "uuid": "4b74d9cc97d03611672153acfb2dd695921960ee"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-bunge-acquires-grupo-minsas-u-s-corn-milling-business.html", "ord_in_thread": 0, "title": "Bunge acquires Grupo Minsa's U.S. corn milling business", "locations": [], "entities": {"persons": [{"name": "todd bastean", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "st. louis", "sentiment": "none"}, {"name": "iowa", "sentiment": "none"}, {"name": "bunge north america", "sentiment": "none"}, {"name": "indiana", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "muleshoe", "sentiment": "none"}, {"name": "worthington", "sentiment": "none"}], "organizations": [{"name": "bunge", "sentiment": "negative"}, {"name": "grupo minsa", "sentiment": "negative"}, {"name": "bunge north america", "sentiment": "negative"}, {"name": "minsa corporation", "sentiment": "none"}, {"name": "grupo minsa s.a.b. de c.v.", "sentiment": "none"}, {"name": "bg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ST. LOUIS, Jan. 30, 2018 /PRNewswire/ -- Bunge North America, the North American operating arm of Bunge Limited (NYSE: BG), announced that it has purchased Minsa Corporation, a wholly-owned U.S. subsidiary of Grupo Minsa S.A.B. de C.V., valued at $75 million. The acquisition includes corn flour mills in Red Oak, Iowa and Muleshoe, Texas.\nCorn masa, the primary ingredient for tortillas, tortilla chips, and other foods, is a key growth category in packaged food and food service channels, with sales projected to steadily increase.\n\"This acquisition is an important strategic step to strengthen our Food & Ingredients business in the U.S., and could provide additional growth opportunities for the company's other regions,\" said Todd Bastean, president Bunge North America. \"These assets, together with our existing plant in Worthington, Indiana, make Bunge a leading U.S. producer of corn masa, a product that is experiencing significant growth not only here, but around the globe.\"\nThe acquisition creates scale in Bunge's masa milling capacity and brings additional products and capabilities including specialty products such as organic and non-GMO masa and on-trend colors such as blue and red corn. In addition to traditional bulk, tote and 50 pound bags used by food manufacturers and food service customers, both the Iowa and Texas locations can produce one kilo/2.2 pound packages commonly sold by retailers under their own store brands.\n\"With additional locations throughout the U.S., we will be better able to provide customers with a high-quality, reliable supply of products nationwide,\" said Daniel Maldonado, managing director, Bunge Milling. \"We look forward to partnering with customers to help build their brands and using our strong innovation capabilities to further support them in meeting evolving consumer needs with an on-trend portfolio.\"\nIn addition to a full line of masa products, Bunge's portfolio of shortenings and oils makes it the only major supplier of all key ingredients used to manufacture tortillas and related products. For more information about Bunge's product offerings, visit www.bungecreativesolutions.com .\nBunge was advised by Rothschild & Co. on the transaction.\nAbout Bunge North America\nBunge North America ( www.bungenorthamerica.com ), the North American operating arm of Bunge Limited (NYSE: BG), is a vertically integrated food and feed ingredient company, supplying raw and processed agricultural commodities and specialized food ingredients to a wide range of customers in the animal feed, food processor, foodservice and bakery industries. With headquarters in St. Louis, Missouri, Bunge North America and its subsidiaries operate grain elevators, oilseed processing plants, edible oil refineries and packaging facilities, and corn, wheat and rice mills in the U.S., Canada and Mexico.\nAbout Bunge Limited\nBunge Limited ( www.bunge.com , NYSE: BG) is a leading global agribusiness and food company operating in over 40 countries with approximately 32,000 employees. Bunge buys, sells, stores and transports oilseeds and grains to serve customers worldwide; processes oilseeds to make protein meal for animal feed and edible oil products for commercial customers and consumers; produces sugar and ethanol from sugarcane; mills wheat, corn and rice to make ingredients used by food companies; and sells fertilizer in South America. Founded in 1818, the company is headquartered in White Plains, New York.\nCautionary Statement Concerning Forward-Looking Statements\nThis press release contains both historical and . All statements, other than statements of historical fact are, or may be deemed to be, within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. These are not based on historical facts, but rather reflect our current expectations and projections about our future results, performance, prospects and opportunities. We have tried to identify these by using words including \"may,\" \"will,\" \"should,\" \"could,\" \"expect,\" \"anticipate,\" \"believe,\" \"plan,\" \"intend,\" \"estimate,\" \"continue\" and similar expressions. These are subject to a number of risks, uncertainties and other factors that could cause our actual results, performance, prospects or opportunities to differ expressed in, or implied by, these . The following important factors, among others, could affect our business and financial performance: industry conditions, including fluctuations in supply, demand and prices for agricultural commodities and other raw materials and products used in our business; fluctuations in energy and freight costs and competitive developments in our industries; the effects of weather conditions and the outbreak of crop and animal disease on our business; global and regional agricultural, economic, financial and commodities market, political, social and health conditions; the outcome of pending regulatory and legal proceedings; our ability to complete, integrate and benefit from acquisitions, dispositions, joint ventures and strategic alliances; our ability to achieve the efficiencies, savings and other benefits anticipated from our cost reduction, margin improvement and other business optimization initiatives; changes in government policies, laws and regulations affecting our business, including agricultural and trade policies, tax regulations and biofuels legislation; and other factors affecting our business generally. The included in this release are made only as of the date of this release, and except as otherwise required by federal securities law, we do not have any obligation to publicly update or revise any to reflect subsequent events or circumstances.\nView original content: http://www.prnewswire.com/news-releases/bunge-acquires-grupo-minsas-us-corn-milling-business-300590484.html\nSOURCE Bunge North America", "external_links": ["http://www.bungenorthamerica.com/", "http://www.prnewswire.com/news-releases/bunge-acquires-grupo-minsas-us-corn-milling-business-300590484.html", "http://www.bungecreativesolutions.com/", "http://www.bunge.com/"], "published": "2018-01-31T00:15:00.000+02:00", "crawled": "2018-01-31T02:50:17.005+02:00", "highlightTitle": ""}