{"organizations": [], "uuid": "80e332da32cce66c0477cccbd7ee6a6f03d30ebd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-markets/refile-global-markets-stocks-break-records-oil-reaches-highest-since-2015-idUSL8N1OZ2XW", "country": "US", "domain_rank": 408, "title": "REFILE-GLOBAL MARKETS-Stocks break records, oil reaches highest since 2015", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T21:27:00.000+02:00", "replies_count": 0, "uuid": "80e332da32cce66c0477cccbd7ee6a6f03d30ebd"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-markets/refile-global-markets-stocks-break-records-oil-reaches-highest-since-2015-idUSL8N1OZ2XW", "ord_in_thread": 0, "title": "REFILE-GLOBAL MARKETS-Stocks break records, oil reaches highest since 2015", "locations": [], "entities": {"persons": [{"name": "dow jones", "sentiment": "none"}, {"name": "marc jones", "sentiment": "none"}, {"name": "michael metcalfe", "sentiment": "none"}], "locations": [{"name": "asia-pacific", "sentiment": "none"}, {"name": "tokyo", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "fed", "sentiment": "none"}, {"name": "msci", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Fixes typo in headline; no change in text.)\n* Upbeat growth data pushes world stocks higher\n* Volatility gauge near record low as risk seen limited\n* Oil hits highest since mid 2015\n* Fed minutes show uncertainty over tax cut plan impact\n* Graphic: World FX rates in 2018 tmsnrt.rs/2egbfVh\nBy Marc Jones\nLONDON, Jan 4 (Reuters) - Market bulls resumed their charge on Thursday, as strong data from the world’s biggest economies sent stock index records tumbling and oil prices to their highest since mid-2015.\nIn an apparent acceleration of last year’s global equity boom, MSCI’s world index and London’s FTSE both set records in Europe, and the Dow Jones was expected to break the 25,000 barrier when Wall Street reopens.\nTokyo’s Nikkei - Asia’s biggest market - had earlier shot to its highest since 1991 with a 3.3 percent surge. Asia-Pacific excluding Japan scaled a decade-high peak as a fifth day of gains in China helped emerging market stocks to a 6 1/2-year high as well .\n“It is a continuation of the goldilocks story,” said Michael Metcalfe, State Street Global Markets’ head of macro strategy. “The main theme last year was strong growth and accommodative (monetary) policy, and the data we have had so far suggest that the growth is expected to accelerate, and without inflation.”\nThe data published on Thursday reinforced expectations that solid world growth will boost demand for goods, including oil, and lift corporate earnings.\nChina’s services sector activity hit its highest level in more than three years, manufacturing data from Japan came in strong and euro zone surveys showed the bloc enjoying its strongest run in nearly seven years.\nIHS Markit’s Final Composite Purchasing Managers’ Index - considered a good overall growth indicator for euro zone - rose to 58.1 in December from 57.5 in November and up slightly from a flash estimate of 58.0.\n“A stellar end to 2017 for the euro zone rounded off the best year for over a decade, continuing to confound widely held fears that rising political uncertainty would curb economic growth,” said Chris Williamson, chief business economist at IHS Markit.\nAnother factor behind the upbeat mood was that minutes of the Federal Reserve’s mid-December meeting released on Wednesday did little to change that view that it will stick to measured increases in U.S. interest rates.\nThey showed policymakers expect U.S. President Donald Trump’s tax overhaul will to boost consumer spending but are still uncertain about the wider impact the stimulus would have on things like inflation.\nFed funds rate futures moved to price a 75 percent chance of a rate hike by March, compared with around 60 percent at the end of last year. But markets are still not fully pricing in the three rate increases many Fed officials expect this year.\nThe dollar climbed off a three-month low after the minutes but was backsliding before U.S. markets re-opened. The dollar was at 112.64 yen and the euro up 0.4 percent at $1.2063. If the single currency gets above September’s peak of $1.2092, it would return to ground last trod in early 2015.\nAnalysts are now wondering whether the strength of the euro zone economy could even encourage the European Central Bank to start raising its still-negative interest rates. “We see some very positive euro sentiment in the market right now,” said Commerzbank currency strategist Esther Reichelt in Frankfurt.\nOIL ON THE BOIL Yields on French bonds held at 0.80 percent as neighbouring Germany’s 10-year rates inched up to 0.45 percent . But Spain’s yields saw their biggest drop in almost two months as it easily sold 4.6 billion euros of bonds.\nThe bigger focus, though, was on commodity prices, which often have a big influence on global inflation.\nOil prices were touching levels not seen since before commodity markets slumped in 2014 and 2015, boosted by tensions in key producer Iran and ongoing OPEC-led output cuts.\nU.S. West Texas Intermediate (WTI) crude futures rose as high as $62.17 per barrel, their highest level since mid-2015 before easing back. International benchmark Brent rose to a 2 1/2-year high of $68.19 a barrel.\nAt the same time, inflation expectations indicated by the gap between 10-year U.S. inflation-linked bonds and conventional bonds was above 2 percent, at the highest level since March.\n“Oil appears to be traded at a premium compared to economic fundamentals because of concerns over development in Iran,” said Motofumi Okoshi, senior economist at Nomura Securities.\nAt the moment though, forward contracts are trading cheaper than expected spot prices, a condition known as “backwardation”, suggesting investors expect any supply shortages to be temporary.\n“If conditions in Iran deteriorate further, I expect forward contracts will begin to be bought as well,” Okoshi said.\nPolitical concerns were also supporting safe-haven gold, which fetched $1,310 per ounce, after hitting a 3 1/2-month high of $1,321.5 on Wednesday.\nStill, investors expect financial markets to stay stable overall. The Cboe Volatility index, which measures implied price volatility of U.S. stocks in the next one month, closed at 9.15 on Wednesday, just short of its record closing low of 9.14 touched on Nov. 3.\nAdditional reporting by Jemima Kelly in London and Hideyuki Sano in London; editing by Larry King\n ", "external_links": ["http://tmsnrt.rs/2egbfVh", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-04T21:27:00.000+02:00", "crawled": "2018-01-04T21:17:53.000+02:00", "highlightTitle": ""}