{"organizations": [], "uuid": "3c8345647273a556a89dec57df77c3f3e56318bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-arcapita-acquires-leading-us-signage-company-for-over-100-million.html", "country": "US", "domain_rank": 767, "title": "Arcapita Acquires Leading US Signage Company for Over $100 Million", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-08T13:27:00.000+02:00", "replies_count": 0, "uuid": "3c8345647273a556a89dec57df77c3f3e56318bb"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-arcapita-acquires-leading-us-signage-company-for-over-100-million.html", "ord_in_thread": 0, "title": "Arcapita Acquires Leading US Signage Company for Over $100 Million", "locations": [], "entities": {"persons": [{"name": "atif a. abdulmalik", "sentiment": "none"}], "locations": [{"name": "manama", "sentiment": "none"}, {"name": "bahrain", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "arcapita", "sentiment": "negative"}, {"name": "arcapita acquires leading us signage company", "sentiment": "negative"}, {"name": "mc sign", "sentiment": "none"}, {"name": "mc sign company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MANAMA, Bahrain, January 8, 2018 /PRNewswire/ --\nArcapita, the global investment firm, announced today that is has acquired a controlling interest in MC Sign Company (\"MC Sign\" or the \"Company\"), the leading nationwide provider of signage and lighting services in the United States, for a total transaction value in excess of $100 million.\nAtif A. Abdulmalik, Arcapita's Chief Executive Officer, commented, \"We are excited to complete a US private equity transaction and pleased to partner with the management team at MC Sign to help grow the Company's suite of services and customer base. MC Sign is led by a very experienced team of professionals who have grown the business considerably over the past few years, and we believe the Company is well positioned to acquire market share in a highly fragmented industry that is dominated by locally-focused, sub-scale service providers. Over 75% of MC Sign's customers are blue chip companies with national presence and, attesting to the Company's value proposition, MC Sign has averaged an industry-leading customer retention rate of 99% since 2012.\"\nMartin Tan, Arcapita's Chief Investment Officer, said, \"MC Sign acts as a comprehensive one-stop-shop for customers, eliminating the need to manage multiple relationships with local vendors across diverse geographies. This is especially beneficial for companies with a national or regional footprint. We believe the Company has significant potential to grow organically and through acquiring smaller regional service providers. Given the repeat nature of customer demand, MC Signs also benefits from a sizable and growing recurring revenue base. We are excited to bring this opportunity to our investors and are optimistic about the Company's growth prospects.\"\nFounded in 1953, MC Sign provides signage and lighting services to customers across the US through a highly-scalable, vendor-managed, and asset-light business model. The Company's customer base is comprised of nationally recognized blue chip companies in the retail, banking, hospitality, quick service restaurant and petroleum/C-store segments throughout the US and Canada. MC Sign has over 275 customers, many of whom have been with the Company for over a decade.\nMC Sign provides its customers with a comprehensive suite of signage services including new installations, rebrandings, and refurbishments, as well as on-demand sign maintenance and emergency repairs. The Company has also steadily grown its lighting services business which completes interior and exterior lighting installations and is currently capitalizing on the high-growth LED retrofit/conversion market in the United States. Through its headquarters in Cleveland, Ohio, MC Sign processes over 40,000 work orders per year through over 5,000 field service partners, and has 225 employees.\nAbout Arcapita\nArcapita is a global Shari'ah compliant alternative investment manager, with offices in Bahrain, Atlanta, London and Singapore. Arcapita's principal lines of business are private equity and real estate, and its management team has a 20-year track record of over 70 investments worth a total transaction value of approximately $30 billion.\nFurther details on Arcapita can be found at http://www.arcapita.com .\nSOURCE Arcapita", "external_links": [], "published": "2018-01-08T13:27:00.000+02:00", "crawled": "2018-01-08T15:15:46.000+02:00", "highlightTitle": ""}