{"organizations": [], "uuid": "c5a4e9ac492fcadb5e7285cbd132b532009046c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-all-def-media-hires-brooke-goldstein-as-coo-names-chris-blackwell-co-president-and-promotes-scott-weintrob-to-executive.html", "country": "US", "domain_rank": 767, "title": "All Def Media Hires Brooke Goldstein As COO, Names Chris Blackwell Co-President And Promotes Scott Weintrob To Executive Creative Director", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T21:00:00.000+02:00", "replies_count": 0, "uuid": "c5a4e9ac492fcadb5e7285cbd132b532009046c4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-all-def-media-hires-brooke-goldstein-as-coo-names-chris-blackwell-co-president-and-promotes-scott-weintrob-to-executive.html", "ord_in_thread": 0, "title": "All Def Media Hires Brooke Goldstein As COO, Names Chris Blackwell Co-President And Promotes Scott Weintrob To Executive Creative Director", "locations": [], "entities": {"persons": [{"name": "brooke goldstein", "sentiment": "neutral"}, {"name": "chris blackwell", "sentiment": "neutral"}, {"name": "scott weintrob", "sentiment": "neutral"}, {"name": "goldstein", "sentiment": "none"}, {"name": "eralp", "sentiment": "none"}, {"name": "osman eralp", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "esp", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": [{"name": "wpp", "sentiment": "none"}, {"name": "esp properties", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES, Jan. 19, 2018 /PRNewswire/ -- All Def Media (ADM), the leading media company and hub for youth culture rooted in hip hop, has recruited WPP ad sales veteran Brooke Goldstein as co-president and chief operating officer, and promoted Chris Blackwell to co-president and chief digital officer, it was announced today by Osman Eralp, chief executive officer of ADM. The company has also promoted Scott Weintrob to executive creative director.\nThe co-presidents will report to Eralp as the company continues to deepen its high engagement series and events in music, comedy and social justice across multiple platforms to further propel the brand's growth beyond its 300 million active monthly viewers.\nGoldstein is a highly respected industry veteran with more than 20 years of experience who joins All Def from ESP Properties, North America, where she was head of sales for the key WPP division working with digital start-ups. During the past four years at ESP, she advised numerous companies on their overall market approach, differentiation, creating brand partnerships and tactics for driving sales. At All Def Media, she will be responsible for the overall revenue growth of the company. Prior to working at WPP, she was senior vice president of sales at The Hub and she also spent 16 years working on the agency side, leading client service, strategy and planning for some of the largest blue chip advertisers in the industry.\nBlackwell has been with All Def Media practically from inception starting as a social media manager and has been key to the growth of the company since he joined late in 2014. He was the 8th employee at ADD and helped develop the company's multi-platform strategy. He also helped develop the plan that saw subscribers grow from 500K to over 6.4 million today. He was one of the champions of the company's successful live music events programming including All Def's presence at SXSW, which included such first year performers as Lil Yachty, 21 Savage, and Lil Uzi Vert, which led the company to launch ADD's music vertical All Def Music. Blackwell also was key in ideating All Def's first premium music series \"Traffic Jams.\" He has served as the company's head of music and marketing and will continue to oversee those key roles for the company.\nWeintrob has been All Def's in-house creative director since the summer of 2016 working with numerous studio partners including Universal Pictures, Sony Pictures, Lionsgate, Blumhouse, Annapurna and brands such as T-Mobile and Verizon to develop unique, bespoke campaigns that are organically tailored to their special marketing needs. His work includes high-impact branded music videos with compelling hip hop narratives and a unique All Def touch for films including Get Out, Detroit, and Don't Breathe as well as recent ad campaigns such as the T-Mobile: Unlimited Freestyle spot featuring Kyle to promote this year's American Music Awards.\nAs a commercial director he has helmed global spots for brands including Audi, Ford, Hyundai, Lenovo, Cadillac, Volvo, and Acura. He recently designed and directed the 2017 Michelin campaign with Vice Media. Weintrob also directed four seasons of Top Gear for the BBC.\n\"The foundational plan at All Def has always been to embrace and lean heavily into our cultural authenticity, high emotional engagement and sales excellence. We could not be more blessed than to have recruited and promoted executives who exemplify both functional excellence and a deep knowledge of hip hop power and evolution today in 2018. Our platforms attract more than 300 million monthly viewers because we are immersed, invested and a genuine part of this culture and community and we deliver the best new and emerging artists in hip hop, comedy and music,\" said Eralp.\n\"For the last several years, I've worked with many digital start-ups and few have the unique ability to tell a story, make people laugh or shine a light on an artist in the way that All Def Media can,\" said Goldstein. \"I am excited to be working with Osman, Chris and the rest the team at ADM. They do things differently here. They create content that's authentic, speaks to a new generation, and engages an audience like no other. It's an amazing and an incredibly creative group and I am proud to be a part of this team.\"\n\"Since inception, All Def has placed an emphasis on culture, engagement, and data at scale. We're excited to give the next generation of artists, creators, and thought leaders a home base to create culturally authentic and relevant content while paying homage to all those who helped us get here,\" said Blackwell. \"All Def is poised to be our culture's platform of choice and I'm honored to be a part of that process.\"\n\"The brands working with us at All Def recognize that hip hop is truly youth culture and the way that we integrate and connect artists with our clients is creatively holistic and results in amazing collaborations,\" said Weintrob.\nADM produces and distributes viral, digestible original content through its own media properties, social channels, traditional and premium television including programming such as the #6 show on Facebook Watch \"Dad Jokes,\" HBO's \"All Def Comedy,\" and theatrical motion pictures such as \"Romeo is Bleeding,\" \"King of the Dancehall\" and live events, and brand partnerships. ADM also manages a curated network of emerging and established talent including social video stars, stand-up comics, writers, actors, poets and hip hop recording artists. The fastest growing media brand in urban youth programming, with over 6.4 million subscribers and fans monthly across YouTube, Facebook/Instagram, and Snapchat, All Def's growth is also punctuated by category-leading engagement and video retention metrics.\nThe company is headquartered in downtown Los Angeles, with offices in New York. Its investors include Nu Horizons, Greycroft Partners, Third Wave Digital Partners, e.ventures, Advancit Capital, Andreessen Horowitz, and WPP.\nSteve Elzer\nElzer & Associates\nsteve@elzerassociates.com\n213-607-3591\nView original content: http://www.prnewswire.com/news-releases/all-def-media-hires-brooke-goldstein-as-coo-names-chris-blackwell-co-president-and-promotes-scott-weintrob-to-executive-creative-director-300585285.html\nSOURCE All Def Media", "external_links": ["http://www.prnewswire.com/news-releases/all-def-media-hires-brooke-goldstein-as-coo-names-chris-blackwell-co-president-and-promotes-scott-weintrob-to-executive-creative-director-300585285.html"], "published": "2018-01-19T21:00:00.000+02:00", "crawled": "2018-01-19T22:38:05.000+02:00", "highlightTitle": ""}