{"organizations": [], "uuid": "85c19e9b18c54ae260cbd4c445b385db42fbe566", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1227037683&w=1200&r=LYNXMPEE0U1HP", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-britain-eu-trade/trade-rules-mean-even-soft-brexit-may-hit-investment-into-uk-expert-idUKKBN1FK2TP", "country": "US", "domain_rank": 408, "title": "Trade rules mean even soft Brexit may hit investment into UK - expert", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T21:02:00.000+02:00", "replies_count": 0, "uuid": "85c19e9b18c54ae260cbd4c445b385db42fbe566"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-eu-trade/trade-rules-mean-even-soft-brexit-may-hit-investment-into-uk-expert-idUKKBN1FK2TP", "ord_in_thread": 0, "title": "Trade rules mean even soft Brexit may hit investment into UK - expert", "locations": [], "entities": {"persons": [{"name": "conconi", "sentiment": "none"}, {"name": "tom miles", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "paola conconi", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "geneva", "sentiment": "none"}], "organizations": [{"name": "wto", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "université libre de bruxelles", "sentiment": "none"}, {"name": "min read  geneva", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "world trade organization", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 6:59 PM / Updated 2 hours ago Trade rules mean even soft Brexit may hit investment into UK - expert Tom Miles 3 Min Read \nGENEVA (Reuters) - The fine print of any future trade agreement between Britain and the European Union will have to be very carefully managed if London wants to avoid losing investment, a leading researcher on “rules of origin” in trade deals said on Wednesday. \nRules of origin - the eligibility criteria for goods to get preferential treatment within international trade deals - can have a similar effect to tariffs in distorting the flow of trade, said Paola Conconi, professor of economics at the Université Libre de Bruxelles. \nBut they are little understood and present a potential pitfall for UK negotiators as they go it alone after Brexit, said Conconi, who was presenting research to trade negotiators and experts at the World Trade Organization (WTO) in Geneva. \nRules of origin will come into play if Britain opts for a trade agreement with the EU rather than a customs union. \nEven following the Norway model, widely seen as a relatively “soft” Brexit because of Oslo’s membership of the European Free Trade Agreement, would risk a loss of investment. \nDespite its close ties to the EU, Norway loses potential foreign direct investment (FDI) to Sweden because investors want to avoid having to comply with the rules of origin, she said. \n“They are similar economies, but one is in the customs union with no rules of origin. So if you can set up your complex manufacturing in Sweden, then you get zero tariff, no rules of origin. If you decide instead to go to Norway, you get zero tariff, conditional on all this sourcing.” \nThe lack of investment meant Norway’s exports to the EU were basically raw materials such as fish and oil. \n“There’s very little complex manufacturing, which is a concern for the UK now, which has attracted a lot of these kind of downstream industries, and now it may lose it as a result of this move,” she said. \n“NITTY-GRITTY” \nConconi said British members of parliament were unaware of how investment could be affected by the choice between a customs union and a free trade agreement, while Brussels had many trade experts who understood the “nitty gritty”. \n“If you are the EU-27 negotiating with the UK on the FTA, you will say: ‘Okay they don’t know very much... Let me put more stringent rules so all the multinationals that come through here are going to come to me’.” \nBritain, which is due to leave the EU in March 2019 and is eyeing a two-year transition period thereafter to give businesses and individuals time to adapt, should seek the most flexible rules possible, Conconi said. \n“But I’m not sure this is going to be the outcome. And I’m not sure they are going to do it in two years,” she said. Reporting by Tom Miles; Editing by Gareth Jones", "external_links": [], "published": "2018-01-31T21:02:00.000+02:00", "crawled": "2018-01-31T21:15:01.004+02:00", "highlightTitle": ""}