{"organizations": [], "uuid": "815c3320681f4fca693e9790f04b33a770515be5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222599799&w=1200&r=LYNXMPEE0G04R", "site_section": "https://www.reuters.com/politics", "section_title": "Politics &amp; Political News | Reuters", "url": "https://www.reuters.com/article/us-usa-trump-medical-test/cognitive-test-given-to-trump-is-a-10-minute-routine-screening-idUSKBN1F6094", "country": "US", "domain_rank": 408, "title": "Cognitive test given to Trump is a 10-minute routine screening", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.104, "site_type": "news", "published": "2018-01-17T10:35:00.000+02:00", "replies_count": 0, "uuid": "815c3320681f4fca693e9790f04b33a770515be5"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-trump-medical-test/cognitive-test-given-to-trump-is-a-10-minute-routine-screening-idUSKBN1F6094", "ord_in_thread": 0, "title": "Cognitive test given to Trump is a 10-minute routine screening", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "ronny jackson", "sentiment": "none"}, {"name": "james mastrianni", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "montreal", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - The cognitive test on which U.S. President Donald Trump received a perfect score is considered a good screening tool for mental decline in an otherwise healthy person, medical experts said.\nTrump asked to be administered a mental test and was given the Montreal Cognitive Assessment as part of a medical exam by Dr. Ronny Jackson, the White House physician, who on Tuesday said he had absolutely no concerns about Trump’s neurological function. Trump scored 30 out of 30.\nCognitive testing looks for signs of mild cognitive impairment and/or Alzheimer’s disease. Sample questions on the Montreal test include repeating a set of numbers in order both forwards and backwards and remembering a list of common words. Test takers are asked to identify animals, and draw a clock face, putting in all of the numbers and setting the clock hands to a specific time, as well. It takes about 10 minutes to administer.\nIn general, patients with good or average memory forget one of the five words and can still be within the normal range, said Dr. James Mastrianni, an expert in memory disorders and other neurodegenerative conditions at the University of Chicago Medicine.\nWhite House, Presidential physician Ronny Jackson answers question about U.S. President Donald Trump's health after the president's annual physical during the daily briefing at the White House in Washington, DC, U.S., January 16, 2018. REUTERS/Carlos Barria “It’s a screening assessment that we use routinely in the clinics to determine whether someone has some degree of cognitive impairment or not,” he said.\n“If they score poorly on that assessment, then usually there is more detailed evaluation that follows. But if they score well that usually indicates there is pretty good cognitive function. They are essentially intact,” Mastrianni added.\nThe standard version of the test is “pretty good” but “not definitive” said Dr. Ronald Petersen, an Alzheimer’s disease expert at the Mayo Clinic in Rochester, Minnesota. Petersen said he could not comment specifically on the president’s cognitive health.\nThe test does not assess the president’s psychiatric fitness and the president did not undergo a psychiatric evaluation, according to his doctor.\nAccording to the Alzheimer’s Association, there is no single test that proves a person has Alzheimer’s disease. That diagnosis is made through a complete assessment that considers all possible causes.\nReporting by Julie Steenhuysen; Additional reporting by Roberta Rampton; Editing by Peter Henderson and Leslie Adler\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T10:35:00.000+02:00", "crawled": "2018-01-17T12:02:15.056+02:00", "highlightTitle": ""}