{"organizations": [], "uuid": "146fc7ff1323c85ece72a817928b82387984cda0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221240590&w=1200&r=LYNXMPEE0A1T2", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-gawker-thiel/peter-thiel-submits-bid-for-gawker-faces-challenges-idUSKBN1F02V2", "country": "US", "domain_rank": 408, "title": "Peter Thiel submits bid for Gawker, faces challenges", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T22:56:00.000+02:00", "replies_count": 0, "uuid": "146fc7ff1323c85ece72a817928b82387984cda0"}, "author": "", "url": "https://www.reuters.com/article/us-gawker-thiel/peter-thiel-submits-bid-for-gawker-faces-challenges-idUSKBN1F02V2", "ord_in_thread": 0, "title": "Peter Thiel submits bid for Gawker, faces challenges", "locations": [], "entities": {"persons": [{"name": "jessica dinapoli", "sentiment": "negative"}, {"name": "gawker", "sentiment": "negative"}, {"name": "peter thiel", "sentiment": "negative"}, {"name": "gawke", "sentiment": "none"}, {"name": "thiel", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "facebook inc", "sentiment": "none"}, {"name": "paypal inc", "sentiment": "none"}, {"name": "univision holdings inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - Venture capitalist Peter Thiel has made an offer for Gawker, hoping to overcome legal hurdles and rival bidders for the online news site the billionaire helped shutter by funding litigation against it, people familiar with the matter said on Thursday. \nGawker, which has been inactive for more than a year, is conducting an auction of its remaining assets, including its domain names and nearly 200,000 archived articles. Most of its assets, including its sister pages Deadspin, a sports site, and Jezebel, a feminist blog, were bought in 2016 for $135 million by media company Univision Holdings Inc. \nThiel has not said why he wants Gawker, though the potential acquisition would let him take down stories regarding his personal life that are still available on the website, and remove the scope for further litigation between him and Gawker. Thiel, who is Facebook Inc’s first major investor and a co-founder of payment service PayPal Inc, did not respond to a request for comment. \nGawker’s bankruptcy plan administrator Will Holden, of consulting firm Dacarba LLC, and the website’s bankruptcy attorney Gregg Galardi, of law firm Ropes & Gray LLP, have tried to block Thiel’s bid, according to court papers. \nGalardi in late November asked a U.S. bankruptcy court judge to deny Thiel’s request to bid, according to court papers. He also argued Thiel is “not a ‘proper’ purchaser” because he could end up as the target of litigation, according to court papers. \nThiel funded former professional wrestler Hulk Hogan’s lawsuit against Gawker after the site published a sex tape featuring Hogan. The former wrestler, whose real name is Terry Bollea, won a $140 million judgment against the site, and later settled for $31 million. \nGawker in 2007 published a story about Thiel’s homosexuality. \nMultiple bidders have submitted offers for the site, Holden said in a phone interview on Thursday. Holden will choose a winner as soon as this month, and then request approval for the deal from a U.S. bankruptcy court judge, the sources said. If Holden excludes Thiel’s bid, Thiel could ask the judge to consider it if it is higher than rival offers. \nThe value of Thiel’s bid could not be learned, though the sources said Gawker is only now worth a few million dollars. \nKevin Lee, the co-founder and executive chairman of Didit, a marketing firm, said he also submitted a bid, without disclosing its value. If successful, Lee said, he plans to use the site to raise money for readers’ preferred charities. \nThe terms of the Univision sale restrict new articles from being published on Gawker until March 9. \nA group of former Gawker employees this week abandoned their effort to bid, one of the sources said. They had launched a campaign seeking $500,000 in donations through fundraising site Kickstarter, but failed to reach their goal and have returned the approximately $90,000 they did collect. \nReporting by Jessica DiNapoli; Editing by Daniel Wallis\n ", "external_links": [], "published": "2018-01-11T22:56:00.000+02:00", "crawled": "2018-01-11T23:06:52.049+02:00", "highlightTitle": ""}