{"organizations": [], "uuid": "f4be4094f80c24cbf7c42602d6a57a9c3fe0a0e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-cyient-reports-well-rounded-revenue-growth-in-q3-2018.html", "country": "US", "domain_rank": 767, "title": "Cyient Reports Well-Rounded Revenue Growth in Q3 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.995, "site_type": "news", "published": "2018-01-18T16:47:00.000+02:00", "replies_count": 0, "uuid": "f4be4094f80c24cbf7c42602d6a57a9c3fe0a0e5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-cyient-reports-well-rounded-revenue-growth-in-q3-2018.html", "ord_in_thread": 0, "title": "Cyient Reports Well-Rounded Revenue Growth in Q3 2018", "locations": [], "entities": {"persons": [], "locations": [{"name": "hyderabad", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "- Financial Release\n- QoQ revenue growth of 1.3% - highest ever at $152 Mn\n- Services Revenue QoQ growth of 4.2%, 4.4% in CC\n- Operating margin sustained at 14.6% QoQ\n- YoY Operating profit growth of 16.5%\n- Cash & cash equivalents at ₹10,770 Mn\n- Declared a second interim dividend of ₹4.0/Share\nHYDERABAD, India, Cyient (Estd: 1991, NSE: CYIENT), a global provider of engineering, manufacturing, geospatial, network and operations management services to global industry leaders, today reported its consolidated financial results for the third quarter (Q3) of FY 2018 ending December 31, 2017.\nFinancial Highlights\nQoQ revenue growth of 1.3% - highest ever at $152 Mn, YoY growth of 11.9% Services revenue QoQ growth of 4.2% (4.4% in CC) - highest ever at $139.9 Mn, YoY growth of 15.6% Operating margin sustained at 14.6% QoQ and 116 bps expansion YoY , despite the headwind of higher pay days Operating profit at ₹1,431 Mn – QoQ growth of 1.6%, YoY growth of 16.5% PAT for the quarter stood at ₹878 Mn, ₹ 1,088 Mn without one offs, YoY growth of 15.5% Cash & cash equivalents at ₹10,770 Mn / $168 Mn – highest ever , DLM generated ₹38 Mn Free Cash Flow generated at 67% of EBITDA, at ₹1,136Mn (incl. IASI sale is ₹1,749Mn) Company declared a dividend of ₹4.0/Share , second one for the year\nBusiness Highlights\nWell rounded growth across all Business Units and Geographies Six out of eight BUs' growth is in double digits in YoY terms EMEA, Americas and APAC posted a robust growth of ~16%, ~10% & ~10% YoY in $ terms\nMessage from the Management\nCommenting on the results, Mr. Krishna Bodanapu, MD & CEO , said, \"Q3 FY18 was in line with our expectations both in revenue and margin. We are coming off a strong quarter in Q2 and Q3 is a seasonally weak quarter due to lower working days. Despite this we recorded the highest ever revenue of $152 Mn in the quarter, an increase of 11.9% YoY and 1.3% QoQ. Our services business recorded a revenue of $139.9 Mn an increase of 4.2% QoQ. The growth in our services business was driven by Utilities & Geospatial (U&G), Transportation, Industrial, Energy and Natural Resources (IENR) and Aerospace business units. The Design Led Manufacturing (DLM) business recorded a de-growth of 23.2% due to pushout of an order to Q4. Our operating margin for the quarter stood at 14.6%, an increase of 116 bps YoY & flat QoQ. The services OPM at 15.7% is lower by 51 bps QoQ and higher by 93 bps YoY.\nThis quarter we were awarded with the Golden Peacock Award for Risk Management under the IT category. The award is a recognition of Cyient's commitment towards taking proactive, risk-mitigating measures to safeguard the interest of its business and stakeholders. This quarter we also received two prestigious Pratt & Whitney 2017 Awards, Supplier Innovation Award for the 5th year in row and the Higher Productivity Award for the 2nd year in a row.\nOur outlook for FY 18 is strong, backed by a strong pipeline and order backlog. We expect a double digit growth in our services business while DLM business is expected to grow around 20%. Our margin will improve by 50 bps driven by improvement in operational efficiency through the year. We expect to deliver double digit earnings growth in the year.\nMr. Ajay Aggarwal, President & CFO , said, \"I am pleased to share that during Q3 FY18, we saw a well-rounded growth both across top line which grew 11.9% YoY and 1.3% QoQ despite headwind of furloughs, operating margin at 14.6% expanding 116 basis points YoY and flat sequentially despite higher pay days in Q3 FY 18. The focus on operating profit has shown good results with 16.5% growth YoY. This quarter the Free Cash to EBITDA stood at a robust ~67% culminating into a highest ever cash balance of $168 Mn. We completed the sale of IASI to Pratt & Whitney, which generated a net cash receipt of $9 Mn. We also declared a second interim dividend of Rs. 4/ share. We continue to focus on organic and inorganic strategic investments. We expect the momentum to continue for the rest of FY18. We remain deeply focused on growth, improvement in operating margin, cash generation and thus maximizing value for our shareholders.\"\nBusiness Update\nAerospace & Defense\nThe Aerospace and Defense BU witnessed a growth of 12.7% YoY and 4.1% QoQ. Despite the seasonality challenges of lower on-site working days in Q3, the BU witnessed growth led by key clients and two large projects. We won the Supplier Innovation (5th year in a row) Award and Productivity Savings Award (2nd year in a row) from one of our largest customers.\nWe continue to see strong demand for Design-Build projects while some of our key risk-reward projects have started generating financial returns. We expect our growth to be driven by Avionics, Aftermarket, Manufacturing related Services and Defense.\nCommunications\nThe Communication BU witnessed a growth of 15.6% YoY and 1.6% QoQ. Our growth in the business was predominantly driven by strong volume growth in key clients and CAF II program rollout. In the quarter, we also signed a global partnership with an Australian Telecom Research company. We are also evaluating inorganic pursuits to build strong capabilities to be an end to end player across \"plan-build-operate\".\nOur outlook for the year continues to be strong. We expect the growth to be driven by some of our key client engagements.\nUtilities & Geospatial\nThe Utilities & Geospatial BU witnessed a growth of 11.5% YoY and 8.8% QoQ. The growth was predominantly driven by the top 3 clients across North America and Europe. During the quarter we continued to invest in two new solution offerings for the utility market. We expect these solutions to generate revenue in Q4.\nOur outlook for the year continues to be strong and we expect to close the year with highest ever revenue in the quarter\nTransportation\nThe Transportation BU witnessed a growth of 43.6% YoY and 8.4% QoQ. The growth was predominantly driven by key clients and new project wins. This quarter we also initiated our engagement with one of the world's largest Rail OEM and we now work with all the top 5 global OEMs. Our strategy execution continues to gain momentum, especially around Rolling Stock and Signalling solutions. Our Digitalization and Design Led Manufacturing capabilities will also help us consolidate our leadership position in the industry.\nOur outlook for the year and beyond continues to be strong, driven by growth in the industry, long term relationships, healthy opportunity pipeline and momentum in strategy execution.\nIndustrial, Energy and Natural Resources\nThe IE&NR BU witnessed a growth 6.9% YoY and 4.3% QoQ. The growth in the business was predominantly driven by strong performance across key clients in Energy, Mining and Heavy Equipment and Analytics. We invested in our connected equipment and predictive analytics platforms and are seeing good traction in the market.\nWe expect a muted Q4, but will continue to see growth in manufacturing and predictive maintenance. Manufacturing, Software and Connected equipment's continue to be key areas of focus.\nSemiconductor, IoT and Analytics\nThe Semiconductor, IoT and Analytics BU witnessed a growth of 10.4% YoY and de-growth of 6.1% QoQ due to seasonality and closing of projects. Despite this, we saw traction in 3 new customers that will start ramping ", "external_links": ["https://twitter.com/cyient", "http://www.cyient.com/", "http://www.prnewswire.com/news-releases/cyient-reports-well-rounded-revenue-growth-in-q3-2018-300584574.html"], "published": "2018-01-18T16:47:00.000+02:00", "crawled": "2018-01-18T20:47:36.000+02:00", "highlightTitle": ""}