{"organizations": [], "uuid": "8c801eafc7d5ddc12d2c76c6d43a65b0225db971", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-wec-energy-group-posts-strong-2017-results.html", "country": "US", "domain_rank": 767, "title": "WEC Energy Group posts strong 2017 results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T15:00:00.000+02:00", "replies_count": 0, "uuid": "8c801eafc7d5ddc12d2c76c6d43a65b0225db971"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-wec-energy-group-posts-strong-2017-results.html", "ord_in_thread": 0, "title": "WEC Energy Group posts strong 2017 results", "locations": [], "entities": {"persons": [{"name": "gale klappa", "sentiment": "none"}], "locations": [{"name": "milwaukee", "sentiment": "none"}], "organizations": [{"name": "wec", "sentiment": "negative"}, {"name": "wec energy group", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "gaap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MILWAUKEE, Jan. 31, 2018 /PRNewswire/ -- WEC Energy Group (NYSE: WEC) recorded net income based on generally accepted accounting principles (GAAP) of $1.20 billion or $3.79 per share for 2017. This compares to earnings of $939 million or $2.96 per share for 2016.\nThe 2017 results include earnings from recurring operations of $3.14 per share and the net impact of one-time, non-cash adjustments totaling 65 cents per share. These one-time adjustments reflect the application of the new tax law to the company's non-utility assets and to the assets of the parent company.\nAdjusted earnings were $3.14 per share for 2017 versus adjusted earnings of $2.97 in 2016.\n\"These latest results reflect a disciplined focus on cost control, efficiency gains and executing on the fundamentals of our business,\" said Gale Klappa, chairman and chief executive officer.\nFor the fourth quarter of 2017, WEC Energy Group recorded net income based on GAAP of $432.6 million or $1.36 per share. This compares to earnings of $194.4 million or 61 cents per share for the fourth quarter of the previous year.\nResults for the fourth quarter of 2017 include one-time, non-cash adjustments of 65 cents per share related to the new tax law. Excluding this amount, WEC Energy Group's adjusted earnings for the fourth quarter of 2017 were 71 cents per share. Comparable results for the fourth quarter of 2016 totaled 61 cents per share with no adjustments.\n\"On virtually every meaningful measure – from network reliability to customer satisfaction to community involvement – the company continued to perform at a high level during 2017,\" Klappa said.\nWe Energies, WEC Energy Group's largest utility, was recognized as the most reliable utility in America in 2017 and the best in the Midwest for the seventh year in a row by PA Consulting, an independent firm that analyzes data on electric outages, restoration times and service quality.\nAt the end of 2017, WEC Energy Group utilities were serving approximately 11,000 more electric and 20,000 more natural gas customers than at the same time a year ago.\nFor the full year, retail deliveries of electricity for the Wisconsin and Michigan utilities – excluding the iron ore mine in Michigan's Upper Peninsula – were down by 1.6 percent. Residential electricity use decreased by 3.3 percent. Electricity consumption by small commercial and industrial customers declined by 1.4 percent.\nElectricity use by large commercial and industrial customers – excluding the iron ore mine – decreased by 0.4 percent during 2017.\nThese decreases were driven by significantly cooler summer temperatures compared to the summer of 2016.\nOn a weather-normal basis for 2017, retail deliveries of electricity – excluding the iron ore mine – decreased by 0.4 percent. \"We continue to work with our customers on the efficient use of electricity as they grow their businesses,\" Klappa said.\nNatural gas deliveries in Wisconsin, excluding gas used for power generation, rose by 4.3 percent during 2017. On a weather-normal basis, natural gas deliveries grew by 3.7 percent during the year.\n\"The company is introducing 2018 earnings guidance in the range of $3.26 to $3.30 per share – in line with our long-term goal of growing earnings at a rate of 5 to 7 percent per year,\" Klappa said.\nThe tables below include a reconciliation of GAAP to adjusted earnings.\nNet income\n(millions)\n2017 Full Year\n2016 Full Year\nWEC Energy Group GAAP\n$1,203.7\n$939.0\nTax benefit related to Tax Cuts and Jobs Act of 2017\n$(206.7)\n—\nAcquisition costs - pre-tax\n—\n$3.5\nTax impact of acquisition costs\n—\n$(1.4)\nWEC Energy Group adjusted net income\n$997.0\n$941.1\nEarnings per share\n2017 Full Year\n2016 Full Year\nWEC Energy Group GAAP\n$3.79\n$2.96\nTax benefit related to Tax Cuts and Jobs Act of 2017\n$(0.65)\n—\nAcquisition costs\n—\n$0.01\nWEC Energy Group adjusted EPS\n$3.14\n$2.97\nDiluted average shares outstanding (millions)\n317.2\n316.9\nConsolidated revenue for the fourth quarter of 2017 totaled $2.06 billion. This compares with consolidated revenue of $1.96 billion in the fourth quarter of 2016.\nNet income\n(millions)\n2017 Q4\n2016 Q4\nWEC Energy Group GAAP\n$432.6\n$194.4\nTax benefit related to Tax Cuts and Jobs Act of 2017\n$(206.7)\n—\nWEC Energy Group adjusted net income\n$225.9\n$194.4\nEarnings per share\n2017 Q4\n2016 Q4\nWEC Energy Group GAAP\n$1.36\n$0.61\nTax benefit related to Tax Cuts and Jobs Act of 2017\n$(0.65)\n—\nWEC Energy Group adjusted EPS\n$0.71\n$0.61\nDiluted average shares outstanding (millions)\n317.2\n316.7\nEarnings per share listed in this news release are on a fully diluted basis.\nConference call\nA conference call is scheduled for 1 p.m. Central time on Wednesday, Jan. 31. The call will review 2017 fourth-quarter and full-year earnings, and will discuss the company's outlook for the future.\nAll interested parties, including stockholders, news media and general public, are invited to listen. Access the call at 844-840-1623 up to 15 minutes before it begins. The number for international callers is 631-625-3204. The conference ID is 4699428.\nConference call access also is available at wecenergygroup.com . Select 'Fourth Quarter Earnings Release and Conference Call' and then select 'Webcast.' In conjunction with this earnings announcement, WEC Energy Group will post on its website a package of detailed financial information on its fourth-quarter and full-year performance. The materials will be available at\n6:30 a.m. Central time on Wednesday, Jan. 31.\nReplay\nA replay will be available on the website and by phone after the call. Access to the webcast replay will be available on the website approximately two hours after the call. Access to a phone replay also will be available approximately two hours after the call and remain accessible through Feb. 13, 2018. Domestic callers should dial 855-859-2056. International callers should dial 404-537-3406. The replay conference ID is 4699428.\nNon-GAAP earnings measures\nWe have provided adjusted earnings (non-GAAP earnings) in this press release as a complement to, and not as an alternative to, reported earnings presented in accordance with GAAP. Adjusted earnings exclude a one-time reduction in income tax expense related to a revaluation of our deferred taxes as a result of the Tax Cuts and Jobs Act of 2017 as well as costs related to the acquisition of Integrys, neither of which is indicative of the company's operating performance. Therefore, we believe that the presentation of adjusted earnings is relevant and useful to investors to understand WEC Energy Group's operating performance. Management uses such measures internally to evaluate the company's performance and manage its operations.\nWEC Energy Group (NYSE: WEC), based in Milwaukee, is one of the nation's premier energy companies, serving 4.4 million customers in Wisconsin, Illinois, Michigan and Minnesota.\nThe company's principal utilities are We Energies, Wisconsin Public Service, Peoples Gas, North Shore Gas, Michigan Gas Utilities, Minnesota Energy Resources and Upper Michigan Energy Resources. The company's other major subsidiary, We Power, designs, builds and owns electric generating plants.\nWEC Energy Group ( wecenergygroup.com ), a component of the S&P 500, has more than $31 billion of assets, 8,000 employees and 50,000 stockholders of record.\nForward-looking Statements\nCertain statements contained in this press release are \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. These statements are based upon management's current expectations and are subject to risks and uncertainties that could cause our actual results to differ materially from those contemplated in the statements. Readers are cautioned not to place undue reliance on these statements. Forward-looking statements include, among other things, statements concerning management's expectations and projections regarding earnings and future results. In some cases, forward-looking statements may be identified by reference to a future period or periods or by the use of forward-looking terminology such as \"anticipates,\" \"believes,\" \"estimates,\" \"expects,\" \"forecasts,\" \"guidance,\" \"intends,\" \"may,\" \"objectives,\" \"plans\" \"possible,\" \"potential,\" \"projects,\" \"should,\" \"targets,\" \"will\" or similar terms or variations of these terms.\nFactors that could cause actual results to differ materially from those contemplated in any forward-looking statements include, but are not limited to: general economic conditions, including business and competitive conditions in the company's service territories; timing, resolution and impact of rate cases and other regulatory decisions; the company's ability to continue to successfully integrate the operations of its subsidiaries; availability of the company's generating facilities and/or distribution systems; unanticipated changes in fuel and purchased power costs; key personnel changes; varying weather conditions; continued industry consolidation; continued adoption of distributed generation by the company's customers; energy conservation efforts; cyber-security threats and data security breaches; construction risks; equity and bond market fluctuations; changes in the company's and its subsidiaries' ability to access the capital markets; the impact of tax reform and any other legislative and regulatory changes, including changes to environmental standards; political developments; current and future litigation and regulatory investigations; changes in accounting standards; the financial performance of the American Transmission Company; goodwill and its possible impairment; and other factors described under the heading \"Factors Affecting Results, Liquidity and Capital Resources\" in Management's Discussion and Analysis of Financial Condition and Results of Operations and under the headings \"Cautionary Statement Regarding Forward-Looking Information\" and \"Risk Factors\" contained in the company's Form 10-K for the year ended Dec. 31, 2016 and in subsequent reports filed with the Securities and Exchange Commission. The company expressly disclaims any obligation to publicly update or revise any forward-looking information.\nTables follow\nWEC ENERGY GROUP, INC.\nCONSOLIDATED INCOME STATEMENTS (Unaudited)\nThree Months Ended\nYear Ended\nDecember 31\nDecember 31\n(in millions, except per share amounts)\n2017\n2016\n2017\n2016\nOperating revenues\n$\n2,055.0\n$\n1,963.0\n$\n7,648.5\n$\n7,472.3\nOperating expenses\nCost of sales\n797.2\n745.5\n2,822.8\n2,647.4\nOther operation and maintenance\n593.6\n614.5\n2,047.0\n2,185.5\nDepreciation and amortization\n205.1\n193.1\n798.6\n762.6\nProperty and revenue taxes\n47.0\n48.2\n194.9\n194.7\nTotal operating expenses\n1,642.9\n1,601.3\n5,863.3\n5,790.2\nOperating income\n412.1\n361.7\n1,785.2\n1,682.1\nEquity in earnings of transmission affiliate\n31.4\n38.8\n154.3\n146.5\nOther income, net\n19.4\n8.2\n64.6\n80.8\nInterest expense\n105.3\n102.6\n415.7\n402.7\nOther expense\n(54.5)\n(55.6)\n(196.8)\n(175.4)\nIncome before income taxes\n357.6\n306.1\n1,588.4\n1,506.7\nIncome tax (benefit) expense\n(75.3)\n111.4\n383.5\n566.5\nNet income\n432.9\n194.7\n1,204.9\n940.2\nPreferred stock dividends of subsidiary\n0.3\n0.3\n1.2\n1.2\nNet income attributed to common shareholders\n$\n432.6\n$\n194.4\n$\n1,203.7\n$\n939.0\nEarnings per share\nBasic\n$\n1.37\n$\n0.62\n$\n3.81\n$\n2.98\nDiluted\n$\n1.36\n$\n0.61\n$\n3.79\n$\n2.96\nWeighted average common shares outstanding\nBasic\n315.6\n315.6\n315.6\n315.6\nDiluted\n317.2\n316.7\n317.2\n316.9\nDividends per share of common stock\n$\n0.520\n$\n0.495\n$\n2.080\n$\n1.980\nWEC ENERGY GROUP, INC.\nCONSOLIDATED BALANCE SHEETS (Unaudited)\nDecember 31,\nDecember 31,\n(in millions, except share and per share amounts)\n2017\n2016\nAssets\nCurrent assets\nCash and cash equivalents\n$\n38.9\n$\n37.5\nAccounts receivable and unbilled revenues, net of reserves of $143.2 and $108.0, respectively\n1,350.7\n1,241.7\nMaterials, supplies, and inventories\n539.0\n587.6\nPrepayments\n210.0\n204.4\nOther\n74.9\n97.5\nCurrent assets\n2,213.5\n2,168.7\nLong-term assets\nProperty, plant, and equipment, net of accumulated depreciation of $8,618.5 and $8,214.6, respectively\n21,347.0\n19,915.5\nRegulatory assets\n2,803.2\n3,087.9\nEquity investment in transmission affiliate\n1,553.4\n1,443.9\nGoodwill\n3,053.5\n3,046.2\nOther\n619.9\n461.0\nLong-term assets\n29,377.0\n27,954.5\nTotal assets\n$\n31,590.5\n$\n30,123.2\nLiabilities and Equity\nCurrent liabilities\nShort-term debt\n$\n1,444.6\n$\n860.2\nCurrent portion of long-term debt\n842.1\n157.2\nAccounts payable\n859.9\n861.5\nAccrued payroll and benefits\n169.1\n163.8\nOther\n553.6\n388.9\nCurrent liabilities\n3,869.3\n2,431.6\nLong-term liabilities\nLong-term debt\n8,746.6\n9,158.2\nDeferred income taxes\n2,999.8\n5,146.6\nDeferred revenue, net\n543.3\n566.2\nRegulatory liabilities\n3,718.6\n1,563.8\nEnvironmental remediation liabilities\n617.4\n633.6\nPension and OPEB obligations\n397.4\n498.6\nOther\n1,206.3\n1,164.4\nLong-term liabilities\n18,229.4\n18,731.4\nCommitments and contingencies\nCommon shareholders' equity\nCommon stock – $0.01 par value; 325,000,000 shares authorized; 315,574,624 and 315,614,941 shares outstanding, respectively\n3.2\n3.2\nAdditional paid in capital\n4,278.5\n4,309.8\nRetained earnings\n5,176.8\n4,613.9\nAccumulated other comprehensive income\n2.9\n2.9\nCommon shareholders' equity\n9,461.4\n8,929.8\nPreferred stock of subsidiary\n30.4\n30.4\nTotal liabilities and equity\n$\n31,590.5\n$\n30,123.2\nWEC ENERGY GROUP, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS (Unaudited)\nYear Ended\nDecember 31\n(in millions)\n2017\n2016\nOperating activities\nNet income\n$\n1,204.9\n$\n940.2\nReconciliation to cash provided by operating activities\nDepreciation and amortization\n798.6\n762.6\nDeferred income taxes and investment tax credits, net\n271.7\n493.8\nContributions and payments related to pension and OPEB plans\n(120.5)\n(28.7)\nEquity income in transmission affiliate, net of distributions\n(4.8)\n(46.6)\nChange in –\nAccounts receivable and unbilled revenues\n(86.4)\n(180.7)\nMaterials, supplies, and inventories\n49.3\n100.0\nOther current assets\n(6.0)\n103.1\nAccounts payable\n8.5\n34.4\nOther current liabilities\n161.8\n(20.8)\nOther, net\n(197.5)\n(53.8)\nNet cash provided by operating activities\n2,079.6\n2,103.5\nInvesting activities\nCapital expenditures\n(1,959.5)\n(1,423.7)\nBluewater acquisition\n(226.0)\n—\nCapital contributions to transmission affiliate\n(109.6)\n(42.3)\nProceeds from the sale of assets and businesses\n24.0\n166.3\nWithdrawal of restricted cash from Rabbi trust for qualifying payments\n19.5\n26.6\nOther, net\n12.0\n3.0\nNet cash used in investing activities\n(2,239.6)\n(1,270.1)\nFinancing activities\nExercise of stock options\n30.8\n41.6\nPurchase of common stock\n(71.3)\n(108.0)\nDividends paid on common stock\n(656.5)\n(624.9)\nIssuance of long-term debt\n435.0\n400.0\nRetirement of long-term debt\n(154.5)\n(306.0)\nChange in short-term debt\n584.4\n(234.8)\nOther, net\n(6.5)\n(13.6)\nNet cash provided by (used in) financing activities\n161.4\n(845.7)\nNet change in cash and cash equivalents\n1.4\n(12.3)\nCash and cash equivalents at beginning of year\n37.5\n49.8\nCash and cash equivalents at end of year\n$\n38.9\n$\n37.5\nView original content: http://www.prnewswire.com/news-releases/wec-energy-group-posts-strong-2017-results-300590659.html\nSOURCE WEC Energy Group", "external_links": ["http://www.prnewswire.com/news-releases/wec-energy-group-posts-strong-2017-results-300590659.html", "http://www.wecenergygroup.com/", "http://wecenergygroup.com/"], "published": "2018-01-31T15:00:00.000+02:00", "crawled": "2018-01-31T15:50:00.005+02:00", "highlightTitle": ""}