{"organizations": [], "uuid": "d7bffdf9572117b3a59a89553a77c2d7cbf7f4c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/business-wire-resources-connection-inc-reports-second-quarter-results-for-fiscal-2018.html", "country": "US", "domain_rank": 767, "title": "Resources Connection, Inc. Reports Second Quarter Results for Fiscal 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-04T00:05:00.000+02:00", "replies_count": 0, "uuid": "d7bffdf9572117b3a59a89553a77c2d7cbf7f4c2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/business-wire-resources-connection-inc-reports-second-quarter-results-for-fiscal-2018.html", "ord_in_thread": 0, "title": "Resources Connection, Inc. Reports Second Quarter Results for Fiscal 2018", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "asia pacific", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "irvine", "sentiment": "none"}], "organizations": [{"name": "ebitda", "sentiment": "negative"}, {"name": "inc", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "resources global professionals", "sentiment": "none"}, {"name": "demand ag", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Revenue of $156.7 million for the quarter\nNet income of $8.1 million and adjusted EBITDA* of $13.4 million for the quarter\nDiluted earnings per share of $0.27 for the quarter\nCompany continues to make progress on strategic initiatives to enhance revenue and profitability\nIRVINE, Calif.--(BUSINESS WIRE)-- Resources Connection, Inc. (NASDAQ: RECN), a multinational business consulting firm, operating as Resources Global Professionals (the “Company” or “RGP”), today announced its financial results for the second quarter ended November 25, 2017.\nRevenue for the second quarter of 2018 was $156.7 million, up 6.2% year over year and 11.0% sequentially. Revenue in Europe improved for the eighth successive quarter, up 20.9% year over year excluding revenue from the Company’s August 31, 2017 acquisition of taskforce-Management on Demand AG (“taskforce”) and up 44.0% including taskforce. Revenue in the U.S. increased 1.5% year-over-year. The Company’s Asia Pacific business rebounded from a disappointing first quarter, improving 12.1% sequentially, although slightly down year over year.\nNet income for the quarter was $8.1 million (5.2% of revenue), with an adjusted EBITDA* of $13.4 million (8.5% of revenue). Net income per diluted share was $0.27 for the second quarter of 2018, including $0.08 per diluted share related to the reversal of valuation allowances on international deferred tax assets, offset by costs of $0.06 per diluted share related to severance, acquisition, transformation and integration expenses during the quarter. The Company also paid a quarterly cash dividend on September 21, 2017 of $0.12 per share, resulting in a total dividend payment of $3.6 million.\n“I am pleased with our performance this quarter and the continued progress we have made towards implementing our strategic initiatives,” said Kate Duchene, President and Chief Executive Officer of RGP. “Our international performance remains strong, and I am especially proud of our eighth successive quarter of revenue growth in Europe. Additionally, our performance in North America is strengthening, and we believe we can experience further growth in our third quarter as our core business continues to grow and we integrate our recent acquisition, Accretive, into RGP.”\n*Adjusted EBITDA is defined as earnings before interest, income taxes, depreciation, amortization and stock-based compensation.\nACQUISITIONS\nOn November 1, 2017, the Company announced it had signed a definitive agreement to acquire substantially all of the assets and assume certain liabilities of Accretive Solutions, Inc. (“Accretive”) for $19.4 million in cash and 1,150,000 shares of Resources Connection, Inc. restricted common stock. Accretive is a professional services firm headquartered in Chicago with eight offices across the United States and approximately 500 professional staff. This acquisition supports our middle market growth strategy and offers strong capabilities in accounting and finance, enterprise governance, business technology and business transformation, in addition to providing a back office suite of services to startups through its Countsy brand. The acquisition closed on December 4, 2017. The Accretive transaction follows RGP’s September 1, 2017 acquisition of taskforce, a German professional services firm that provides clients with senior interim management and project management expertise. RGP’s consolidated financial results for the second quarter include taskforce revenue of approximately $3.7 million and EBITDA of $0.3 million.\nUPDATE ON STRATEGIC INITIATIVES\nRGP continues to make progress against its previously announced strategic initiatives. The Company has advanced its initiative to cultivate a more robust sales culture during the second quarter. The Company launched a new learning and development program to enhance training and accountability across the organization – including providing training on new management techniques and processes. RGP continued to roll out its new compensation programs to drive accountability and profitable growth. The Company’s Strategic Client Program is performing well with revenue of this program up 8.0% since the beginning of the fiscal year, and is expected to deliver improved growth in fiscal year 2018. RGP expects to complete substantially all of its sales transformation by the end of the fiscal year.\nWith regard to the second initiative to redesign the Company’s business model to enhance client offerings, the redesign is close to completion, with focus on building the Company’s integrated solutions capabilities and delivering multi-disciplinary offerings to its clients in three areas of focus – Transaction Services, Technical Accounting Services, and Data & Analytics. In the second quarter, the Company implemented the new operating model for sales, talent and integrated solutions within RGP for all of North America.\nWith respect to the cost containment initiative, the Company continues its efforts to lower selling, general and administrative expenses (“SG&A”) as a percentage of revenue. The Company made progress this quarter and will continue to focus on improved leverage and cost synergies in the core business and with the Accretive acquisition. The Company remains committed to managing its cost structure to achieve improved SG&A performance as measured against revenue.\nFISCAL SECOND QUARTER REVIEW\nRevenue for the second quarter of fiscal 2018 increased by 6.2% (5.3% constant currency) to $ 156.7 million compared to $147.6 million in the prior year second quarter. Without taskforce’s revenue of $3.7 million in the quarter, revenue was up 3.7%. On a sequential basis, second quarter revenue increased by 11.0% (10.6% constant currency) from $141.2 million in the first quarter of fiscal 2018. Year over year constant currency results for international revenue are computed using the comparable second quarter fiscal 2017 conversion rates, and the sequential quarter constant currency international revenue is computed using the comparable first quarter fiscal 2018 conversion rates.\nRevenue in the U.S. increased by 1.5% year over year, reflecting increased activity and bill rates in several of the Company’s largest markets. The company believes the increase in these markets is partially attributable to the Company’s strategic initiatives, including its focus on improvement in bill rates per hour. U.S. revenue increased 5.6% sequentially. International revenue improved by 24.7% year over year (20.3% constant currency) and 32.9% sequentially (30.9% constant currency), reflecting strength in the Company’s United Kingdom, Ireland and Sweden practices. Revenue in Europe grew 20.9% year over year and 27.3% sequentially, excluding revenue attributable to the taskforce acquisition.\nNet income improved in the second quarter of fiscal 2018 to $8.1 million, or $0.27 per diluted share, including $0.08 per diluted share related to the reversal of valuation allowances on international deferred tax assets, offset by costs of $0.06 per diluted share related to severance, acquisition and transformation related expenses during the quarter; this compares to net income of $5.7 million, or $0.16 per diluted share, in the prior year second quarter. Adjusted EBITDA was $13.4 million (8.5% of revenue) and $12.3 million (8.3% of revenue) for the quarter ended November 25, 2017 and November 26, 2016, respectively.\nGross margin was 37.9% in the second quar", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rgp.com&esheet=51737524&newsitemid=20180103006201&lan=en-US&anchor=http%3A%2F%2Fwww.rgp.com&index=1&md5=a0207e5289a9fbc16f04437a794a4f8a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rgp.com&esheet=51737524&newsitemid=20180103006201&lan=en-US&anchor=http%3A%2F%2Fwww.rgp.com&index=2&md5=9236c65683d8cd0858c20c9221afdb06", "http://www.businesswire.com/news/home/20180103006201/en/"], "published": "2018-01-04T00:05:00.000+02:00", "crawled": "2018-01-04T00:36:35.002+02:00", "highlightTitle": ""}