{"organizations": [], "uuid": "5728bb9579d93738c7732c8da92c499ef9734cdf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219560715&w=1200&r=LYNXMPEE040I0", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-britain-economy-productivity/uk-economic-productivity-up-by-most-since-2011-in-q3-2017-idUKKBN1EU0UO", "country": "US", "domain_rank": 408, "title": "UK economic productivity up by most since 2011 in Q3 2017", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T11:55:00.000+02:00", "replies_count": 0, "uuid": "5728bb9579d93738c7732c8da92c499ef9734cdf"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-economy-productivity/uk-economic-productivity-up-by-most-since-2011-in-q3-2017-idUKKBN1EU0UO", "ord_in_thread": 0, "title": "UK economic productivity up by most since 2011 in Q3 2017", "locations": [], "entities": {"persons": [{"name": "david milliken", "sentiment": "none"}, {"name": "andy bruce", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "office for national statistics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 5, 2018 / 9:52 AM / Updated 7 hours ago UK productivity growth hits six-year high after weakest decade since 1820s David Milliken 5 Min Read \nLONDON (Reuters) - Britain’s economic productivity perked up in the three months to the end of September, growing at its fastest rate in more than six years, in contrast to its historically weak performance over the previous decade. FILE PHOTO - City workers are seen at their offices in the financial district of the City of London, Britain, January 7, 2016. REUTERS/Toby Melville/File Photo \nProductivity in Britain has stagnated since the global financial crisis even more than in most other advanced economies, and has played a key role in squeezing Britons’ living standards. \nOver the past 10 years productivity growth was the weakest since modern records began and appears to be the slowest since the early 1820s, when Britain was emerging from the Napoleonic wars, the Office for National Statistics said on Friday. \nDuring the third quarter of 2017, output per hour worked grew by 0.9 percent compared with the three months before, its first rise since late 2016 and the biggest increase since the second quarter of 2011, the ONS said. \nHowever, the upturn reflected a fall in the number of people in work over the period rather than strong economic growth, which was a lacklustre 0.4 percent. \nBritain’s economy slowed last year, despite strong global growth, as the plunge in the pound that followed its 2016 vote to leave the European Union triggered higher inflation that hurt consumer spending. \nThe uncertainty generated by Brexit has also weighed on businesses’ willingness to invest. UNCERTAIN OUTLOOK \nProductivity dropped in the first half of 2017 as businesses hired staff faster than they increased output. Compared with a year before, third-quarter productivity was just 0.8 percent higher, less than half its pre-crisis growth rate. \nLate last year Britain’s government forecasters revised down their long-run productivity forecasts to around 1 percent a year, after previous expectations for it to pick up to nearer 2 percent were repeatedly disappointed. \nA weaker productivity outlook also drove the BoE’s decision in November to raise interest rates for the first time in more than a decade, as it judged the economy would struggle to grow much faster than 1.5 percent a year without creating excessive inflation. \nThat said, Friday’s data showed unit labour costs - a measure of how much it costs to produce a given amount of output, and a key driver of inflation - rose by the least since the second quarter of 2015, increasing 1.3 percent. \nHoward Archer, an economist at forecasters EY ITEM Club, said productivity was likely to have recovered further in the final three months of 2017. Early indications suggest growth remained solid while the number of people in work fell. \nBut he was less positive about the longer term. \n“A major risk is that prolonged uncertainty and concerns over the UK’s economic outlook ends up weighing down markedly on business investment and damages productivity,” he said. \nBritain’s government has launched repeated efforts to boost productivity, and says past weakness is partly due to strong job creation, which has pushed unemployment to its lowest in more than 40 years. \nONS data also show a drag from the declining North Sea oil and gas sector, and from heavy losses in financial services after the global crisis. Low investment and inconsistent management quality also weigh on productivity, economists say. Graphic by Andy Bruce; Editing by Gareth Jones", "external_links": [], "published": "2018-01-05T11:55:00.000+02:00", "crawled": "2018-01-05T12:05:10.022+02:00", "highlightTitle": ""}