{"organizations": [], "uuid": "7f5e681d8912143f2be395bb26fb51978f4f674e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219100566&w=1200&r=LYNXMPEE020WZ", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-mnu-analysis/mourinho-faces-defining-year-as-city-overshadow-united-idUKKBN1ES1EP", "country": "US", "domain_rank": 408, "title": "Mourinho faces defining year as City overshadow United", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T19:27:00.000+02:00", "replies_count": 0, "uuid": "7f5e681d8912143f2be395bb26fb51978f4f674e"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-mnu-analysis/mourinho-faces-defining-year-as-city-overshadow-united-idUKKBN1ES1EP", "ord_in_thread": 0, "title": "Mourinho faces defining year as City overshadow United", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 4:16 PM / Updated 6 hours ago Mourinho faces defining year as City overshadow United Neil Robinson 5 Min Read \nLONDON (Reuters) - Jose Mourinho finds himself in the unaccustomed position of having to prove himself all over again as he prepares to open up a final trophy front with Manchester United on Friday. FILE PHOTO - Soccer Football - Premier League - Everton vs Manchester United - Goodison Park, Liverpool, Britain - January 1, 2018 Manchester United manager Jose Mourinho REUTERS/Andrew Yates \nMuch of the heat on the Portuguese comes as a blowback from the other side of Manchester where City have blazed such a scorching Premier League trail that has overshadowed United’s second place in the table and easy progress to the Champions League knockout phase. \nUnited are favourites to see off Championship side Derby County in the FA Cup third round on Friday. But being cast as Manchester’s support act clearly grates with Mourinho, particularly when combined with suggestions that he is tactically inferior to his rival, Pep Guardiola. \nMourinho’s recent grouchiness, when he hit out at former United player turned pundit Paul Scholes, bemoaned his lack of spending power and even slapped down City supporter and former-Oasis guitarist Noel Gallagher has added to the impression that he is weighed down by his battle with the Spaniard. \nAlthough the pair’s relationship appears healthier than when they were last pitted against each other as managers of Real Madrid and Barcelona in La Liga, Mourinho is clearly struggling with being seen as second best. \nTo an extent, he has been unfairly treated and he was right to point out that the United squad he inherited was inferior to the one Guardiola took over at City, which had the likes of David Silva, Sergio Aguero and Kevin De Bruyne in place. \nWhile the media has acclaimed the Spaniard’s impact on such players as Raheem Sterling and Fabian Delph at City, the re-emergence of United’s Jesse Lingard, Juan Mata and Anthony Martial under Mourinho has not received equal billing. \nLingard, in particular, has been a revelation since Mourinho switched him to a more central role, scoring six Premier League goals since the start of December. Only Tottenham’s Harry Kane has a better record. \n“This role, further inside, allows me to be closer to the striker, to get in the box, create more things and obviously have more shots at goal,” he recently told MUTV. ATTACKING ALTERNATIVES \nThe next month could prove crucial on many fronts for both club and manager. With Romelu Lukaku and Zlatan Ibrahimovic both injured, Mourinho has the opportunity to continue with the 4-3-3 formation that worked so well in Monday’s 2-0 Premier League win at Everton. \nThe absence of a recognised frontman provided freedom to others, with Martial, who scored an excellent goal at Goodison Park, and a more advanced Paul Pogba the obvious beneficiaries. \nIf that formation represents the future then it is also a throwback to the one Mourinho first employed when he arrived at Chelsea in 2004, although to persist now without a Didier Drogba or Lukaku-type focus would be a departure. \nOne of the criticisms levelled against Mourinho this season is that he is too rigid in his thinking. It is pointed out that while Guardiola happily works with different backroom staff, soaking up new ideas at each club, Mourinho relies on the same, tight support team. \nHaving tasted success all over Europe in his 15 years of management, to put himself on a par with Alex Ferguson in terms of continual silverware at United, particularly in the shadow of Guardiola, represents the final challenge of Mourinho’s career. \nYet even winning the Champions League this season may still see Mourinho’s methods criticised because so much emphasis is now placed on the way teams play. Even though United are just nine league goals short of the 54 they managed last term, they have been cast as dour and unwilling to go toe-to-toe with City and Liverpool. \nMourinho won’t worry too much about that, but clearly feels the need to reinforce some parts of the team and is expected to bring in an extra midfielder and a full back this transfer window. The club will provide the resources to support his vision, which could yet yield the Champions League and FA Cup plus a second-placed league finish this season. \nPerhaps only Guardiola would bet against him; for Mourinho, there remains everything to play for. Reporting by Neil Robinson; Editing by Christian Radnedge", "external_links": [], "published": "2018-01-03T19:27:00.000+02:00", "crawled": "2018-01-04T00:11:03.010+02:00", "highlightTitle": ""}