{"organizations": [], "uuid": "52abdadff85c4d988b77c4d2aff5edf5d7714e53", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222650229&w=1200&r=LYNXMPEE0G0CY", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-china-indoor-farming-plenty/u-s-indoor-farming-startup-plenty-eyes-rollout-in-china-japan-ceo-idUSKBN1F60GA", "country": "US", "domain_rank": 408, "title": "U.S. indoor farming startup Plenty eyes rollout in China, Japan: CEO", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T14:56:00.000+02:00", "replies_count": 0, "uuid": "52abdadff85c4d988b77c4d2aff5edf5d7714e53"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-china-indoor-farming-plenty/u-s-indoor-farming-startup-plenty-eyes-rollout-in-china-japan-ceo-idUSKBN1F60GA", "ord_in_thread": 0, "title": "U.S. indoor farming startup Plenty eyes rollout in China, Japan: CEO", "locations": [], "entities": {"persons": [{"name": "barnard", "sentiment": "none"}, {"name": "matt barnard", "sentiment": "none"}, {"name": "jeff bezos", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "seattle", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "shenzhen", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "plenty inc", "sentiment": "negative"}, {"name": "softbank corp", "sentiment": "none"}, {"name": "amazon inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING (Reuters) - Ambitious U.S. indoor farming startup Plenty Inc is seeking urban sites for new farms in Chinese cities as part of a global drive to set up high-tech facilities growing organic vegetables in warehouses under banks of LED lights.\nMatt Barnard, chief executive of the San Francisco-based firm which counts Amazon Inc. ( AMZN.O ) founder Jeff Bezos and Japanese tech player SoftBank Corp ( 9984.T ) among its backers, told Reuters on Wednesday that China could potentially host at least 300 of Plenty’s farms.\nPlenty is currently hiring in China and scouting for locations and distributors in Beijing, Shanghai and Shenzhen, Barnard said in an interview in Beijing. The company has already hired a team in Japan and has “locked down” a few farm sites there, according to Barnard, also a co-founder.\nHe did not disclose financial or investment targets for the expansion of the firm which currently operates just one farm, in San Francisco, with another due to open in Seattle in the first-half of 2018.\n“We see a massive opportunity to get people product that tastes better and also has health and safety that far surpasses anything on the market today,” Barnard said.\nPlenty’s farming model means growing vegetables and herbs on vertical towers indoors, with hydroponic systems delivering nutrients to plants and LED lighting designed to stimulate rapid growth all-year round. Enclosed farms reduce pests and allow the firm to optimise growing conditions.\nThat could be a big draw in China, which has less than a third of the arable land per person compared with the United States, and in many places, soil contaminated by heavy metals and pesticides.\nMatt Barnard, Chief Executive Officer of U.S.-based vertical farming start-up Plenty, poses for a picture in Beijing, China January 17, 2018. REUTERS/Jason Lee A Plenty farm is designed to be 3 to 10 acres (1.2 to 4 hectares), and can produce between 150 and 350 times the output of a field farm, said Barnard.\nConcerns among Chinese consumers over food safety are also a major opportunity. Chinese farms will be accompanied by ‘experience centres’ where people can taste the product and see how it is produced.\n“It’s super important that people can trust it,” added Barnard, who expects the China market to contribute 25 to 50 percent of the firm’s business in the future.\nThe company is talking to restaurants, online grocers and some supermarkets to distribute the product, which will be priced higher than much of the produce available in Chinese markets.\nIndoor farms can be located close to cities, cutting out the transport from field to supermarket that impacts the freshness of produce. That allows Plenty to grow varieties for their flavour and not for their ability to withstand transport.\nOne potential concern for Barnard is the cost of operating the lighting systems.\n“China power prices are more expensive than in California,” he said, adding that as long as farms are located in places with the best rates farms can still be successful.\nReporting by Dominique Patton; Editing by Kenneth Maxwell and Christian Schmollinger\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T14:56:00.000+02:00", "crawled": "2018-01-17T10:48:00.037+02:00", "highlightTitle": ""}