{"organizations": [], "uuid": "d0271548f2aa0ad0e874940ff0ef2c1fb7673cff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-brian-crutcher-to-become-next-ceo-of-ti-on-june-1-and-current-ceo-rich-templeton-continues-as-chairman.html", "country": "US", "domain_rank": 767, "title": "Brian Crutcher to become next CEO of TI on June 1 and current CEO Rich Templeton continues as chairman", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T00:03:00.000+02:00", "replies_count": 0, "uuid": "d0271548f2aa0ad0e874940ff0ef2c1fb7673cff"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-brian-crutcher-to-become-next-ceo-of-ti-on-june-1-and-current-ceo-rich-templeton-continues-as-chairman.html", "ord_in_thread": 0, "title": "Brian Crutcher to become next CEO of TI on June 1 and current CEO Rich Templeton continues as chairman", "locations": [], "entities": {"persons": [{"name": "rich templeton", "sentiment": "negative"}, {"name": "brian crutcher", "sentiment": "negative"}, {"name": "brian", "sentiment": "none"}, {"name": "templeton", "sentiment": "none"}, {"name": "rich", "sentiment": "none"}, {"name": "crutcher", "sentiment": "none"}], "locations": [{"name": "dallas", "sentiment": "none"}], "organizations": [{"name": "texas instruments incorporated", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS, Jan. 18, 2018 /PRNewswire/ -- Texas Instruments Incorporated (TI) (NASDAQ: TXN) today said that its board of directors has selected Brian Crutcher to become the company's next president and chief executive officer (CEO), effective June 1. Crutcher, a 22-year veteran of TI, succeeds current president and CEO, Rich Templeton, who will transition out of these roles over the next four months but will remain the company's chairman. The transition is a well-planned succession that follows Crutcher's promotion to senior vice president in 2010, executive vice president in 2014, chief operating officer in 2017 and election to the board of directors last July.\n\"Brian is an exceptional leader who inspires others and delivers great results,\" Templeton said. \"His disciplined focus on our business, manufacturing and sales channels has heightened the value we offer customers and the return we provide shareholders. TI operations and people are well guided by his experience and intelligence.\"\n\"This is an exciting time to lead TI. I am honored to succeed Rich, whose leadership and vision have made our company stronger today than ever, and provides a solid foundation to build upon,\" said Crutcher. \"Our semiconductors are inside tens of thousands of different types of electronics. We have the right products, analog and embedded; are focused on the right markets, industrial and automotive; and remain committed to helping our customers find new ways to solve problems. I am energized by the opportunities we have ahead of us and look forward to working with TIers around the world to continue making TI a better supplier, employer and investment.\"\n\"The directors have had a number of years to assess Brian's ability, results and style, and we are highly confident he is TI's next great leader,\" said Wayne Sanders, lead director of the TI Board and chairman of the governance and stockholder relations committee. \"TI is in excellent shape, operationally, financially and strategically, thanks to Rich's leadership over the last 14 years. He has been a transformative CEO, one of industry's finest. TI's operating profit margin has doubled, the stock price has more than quadrupled and free cash flow per share has grown by a factor of 6. Additionally, Rich built and developed an excellent and deep bench of leaders, who continue to work closely with Brian. There could not be a better time for an effective transition.\"\nFor biographical information, see the following links:\nRich Templeton\nBrian Crutcher\nAbout Texas Instruments\nTexas Instruments Incorporated (TI) is a global semiconductor design and manufacturing company that develops analog ICs and embedded processors. By employing the world's brightest minds, TI creates innovations that shape the future of technology. TI is helping approximately 100,000 customers transform the future, today. Learn more at www.ti.com .\nTXN-G\nView original content: http://www.prnewswire.com/news-releases/brian-crutcher-to-become-next-ceo-of-ti-on-june-1-and-current-ceo-rich-templeton-continues-as-chairman-300584937.html\nSOURCE Texas Instruments Incorporated", "external_links": ["http://www.ti.com/corp/docs/investor_relations/leadership.html#templeton_exc", "http://www.ti.com/corp/docs/investor_relations/leadership.html#crutcher", "http://www.ti.com/", "http://www.prnewswire.com/news-releases/brian-crutcher-to-become-next-ceo-of-ti-on-june-1-and-current-ceo-rich-templeton-continues-as-chairman-300584937.html"], "published": "2018-01-19T00:03:00.000+02:00", "crawled": "2018-01-19T01:02:25.018+02:00", "highlightTitle": ""}