{"organizations": [], "uuid": "3dad672823621573d29f8e1892942aecbab0810a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224329133&w=1200&r=LYNXMPEE0M02J", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-global-oil/oil-rises-on-economic-growth-opec-russian-supply-curbs-idUSKBN1FC060", "country": "US", "domain_rank": 408, "title": "Oil rises on IMF economic growth outlook, OPEC-Russian supply curbs", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.825, "site_type": "news", "published": "2018-01-23T10:08:00.000+02:00", "replies_count": 0, "uuid": "3dad672823621573d29f8e1892942aecbab0810a"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-global-oil/oil-rises-on-economic-growth-opec-russian-supply-curbs-idUSKBN1FC060", "ord_in_thread": 0, "title": "Oil rises on IMF economic growth outlook, OPEC-Russian supply curbs", "locations": [], "entities": {"persons": [], "locations": [{"name": "singapore", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "imf", "sentiment": "negative"}, {"name": "opec", "sentiment": "none"}, {"name": "international monetary fund", "sentiment": "none"}, {"name": "bnp paribas", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - Oil rose more than 1 percent on Tuesday with benchmark Brent crude above $70 a barrel for the first time in a week on Tuesday, boosted by healthy world economic growth prospects and expectations for continued production curbs by OPEC, Russia and their allies.\nBrent crude futures LCOc1 were up $1.06 at $70.09 a barrel as of 11:02 a.m. EST (1602 GMT), not far off the three-year high of $70.37 reached on Jan. 15.\nU.S. West Texas Intermediate (WTI) crude futures CLc1 rose $1 to $64.59 a barrel. WTI reached its highest since December 2014 on Jan. 16 at $64.89.\nThe International Monetary Fund on Monday revised upward its forecast for world economic growth to 3.9 percent for 2018 and 2019, a 0.2 percentage point increase from its last update in October.\n“The IMF’s upward revision of its growth forecast is generating tailwind,” Commerzbank analysts wrote. “This further improves the already fairly rosy demand prospects on the oil market.”\nThe demand growth comes at a time of supply curbs by the Organization of the Petroleum Exporting Countries, Russia and other producers, which began in January 2017 and are due to run until the end of 2018.\nSaudi Energy Minister Khalid al-Falih told CNBC on Tuesday that while he is “still anxious” about the fragility of the oil market, “we think we’re on our way.”\nOPEC’s main objective for the cuts is to eliminate a global surplus in oil stocks and rebalance the market. There is some expectation that OPEC will let the agreement expire at the end of 2018, but major producers have not yet suggested that this is in the offing.\nIn addition, the sharp plunge in Venezuelan production is offsetting increases from the United States, which is on the cusp of breaking its all-time production record of 10.04 million barrels per day.\nU.S. Energy Department oil inventory figures will be released Wednesday morning; industry group the American Petroleum Institute will issue data on stocks Tuesday afternoon at 4:30 p.m. EST. [EIA/S]\nVenezuela’s output fell to a meager 2 million bpd in 2017, far short of expectations for 2.5 million bpd, and the International Energy Agency said it could keep declining in 2018.\n“Six months ago there was a lot of consternation about how fast (U.S.) production might grow but that’s been offset by Venezuelan volatility,” said Tony Scott, managing director of analytics at BTU Analytics in Denver.\nHe added that with Saudi and Iranian production likely to remain steady throughout the year, it was hard to see an increase in supply that would undermine the rally.\nFrench bank BNP Paribas said it expects inventories to rise near the end of the year. The bank raised its 2018 oil price forecasts by $10 a barrel, expecting WTI to average $60 and Brent $65.\nAdditional reporting by Henning Gloystein in Singapore; Editing by Marguerita Choy and Edmund Blair\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-23T10:08:00.000+02:00", "crawled": "2018-01-23T07:19:32.017+02:00", "highlightTitle": ""}