{"organizations": [], "uuid": "86e532c894abf508a0034b79b01eecb1c96ceb48", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225144165&w=1200&r=LYNXMPEE0O0XY", "site_section": "http://feeds.reuters.com/reuters/UKTopNews/", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-davos-meeting-brexit-hammond/britain-will-not-reverse-brexit-hammond-tells-ceos-in-davos-idUKKBN1FE1QQ", "country": "US", "domain_rank": 408, "title": "Britain will not reverse Brexit, Hammond tells CEOs in Davos", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T14:52:00.000+02:00", "replies_count": 0, "uuid": "86e532c894abf508a0034b79b01eecb1c96ceb48"}, "author": "", "url": "https://uk.reuters.com/article/uk-davos-meeting-brexit-hammond/britain-will-not-reverse-brexit-hammond-tells-ceos-in-davos-idUKKBN1FE1QQ", "ord_in_thread": 0, "title": "Britain will not reverse Brexit, Hammond tells CEOs in Davos", "locations": [], "entities": {"persons": [{"name": "hammond", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "davos reuters", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "european council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 12:53 PM / Updated 22 minutes ago Hammond calls for a very modest Brexit divorce Reuters Staff 4 Min Read \nDAVOS (Reuters) - Britain’s finance minister called for a modest Brexit on Thursday that would keep the world’s sixth-largest economy as closely aligned as possible with the European Union after its 2019 exit. \nBritain is due to exit the EU on March 29, 2019, but there are deep divisions inside Prime Minister Theresa May’s government and party about what sort of relationship should replace 46 years of membership. \nPhilip Hammond, who in the 2016 referendum voted to stay in the EU, sought to allay investor concerns over Brexit turmoil by calling for arrangements that would ensure free and smooth trade and for the “closest possible future relationship”. \n“We are taking two completely interconnected and aligned economies with high levels of trade between them, and selectively, moving them, hopefully very modestly, apart,” Hammond said at the World Economic Forum in Davos. \nThe EU and Britain agreed last month to move Brexit talks onto trade and a transition pact but some of the EU’s most powerful leaders have cautioned that the final year of divorce negotiations before Britain’s exit could be fraught with peril. \nThe outcome of the negotiations will shape the future of Britain’s $2.7 trillion economy, and determine whether London can keep its place as the only global financial centre to rival New York. \nMay’s finance chief said that hurting London’s financial centre would push business to New York and Singapore to the detriment of Europe as a whole and called for a bespoke trade deal with the EU. \nBrexit is cast by supporters and opponents alike as the most significant shift in British policy since World War Two. BREXIT TRANSITION Britain's Chancellor of the Exchequer Philip Hammond attends the World Economic Forum (WEF) annual meeting in Davos, Switzerland January 25, 2018. REUTERS/Denis Balibouse \nSupporters of Brexit say warnings of economic chaos are overblown and that Britain will eventually prosper once it leaves what they cast as a decaying German-dominated experiment in European integration. \nSome of May’s Brexit-supporting lawmakers, such as Jacob Rees-Mogg, said Britain’s government must start promoting the opportunities from leaving the European Union and its negotiators should stop being “cowed by the EU”. \nThe Sun newspaper that the Conservative lawmaker in charge of any leadership contest has asked his colleagues not to submit any more formal demands for a challenge to May, who lost her party its majority in a snap election in June. \nIn an effort to avoid a Brexit shock that could sow chaos through financial markets, halt trade and disrupt supply chains across Europe, Britain wants a transition deal agreed by the end of March that would roll for about two years after exit. \nUnder current plans, Britain will remain an EU member in everything but name but will have no representation in EU decision-making bodies. Britain would remain part of the EU’s customs union and internal market but also be bound by EU laws. \n“A transition period which allows us to continue under the present rules where everybody understands those rules gives us time to do this in an orderly fashion and gives us time to address some of the financial stability challenges,” Hammond said. \nBut opponents of Brexit say there is little clarity on where Britain is transitioning to and hope to force a halt to the divorce, a prospect Hammond dismissed. \n“This decision is not going to be reversed. That is a matter of political reality,” Hammond said. \nSome businesses, and many international banks in London, are concerned that either the detail of any transition deal could be lacking or that any deal could collapse due to domestic political upheaval in the months before Britain exits. \n“It’s all or nothing,” said a senior executive at one of the largest banks in London. “They can’t even give us political certainty, let alone legal certainty until much, much later in the process.” Writing by Guy Faulconbridge and Andrew MacAskill, editing by Angus MacSwan", "external_links": [], "published": "2018-01-25T14:52:00.000+02:00", "crawled": "2018-01-25T15:25:29.010+02:00", "highlightTitle": ""}