{"organizations": [], "uuid": "968a98c14f2d16e0817bec293ade4c97cadd5e76", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218912494&w=1200&r=LYNXMPEE0110D", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-mci-wat-guardiola/guardiola-loses-jesus-for-up-to-six-weeks-slams-festive-fixtures-idUKKBN1ER1WA", "country": "US", "domain_rank": 408, "title": "Guardiola loses Jesus for up to six weeks, slams festive fixtures", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T01:21:00.000+02:00", "replies_count": 0, "uuid": "968a98c14f2d16e0817bec293ade4c97cadd5e76"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-mci-wat-guardiola/guardiola-loses-jesus-for-up-to-six-weeks-slams-festive-fixtures-idUKKBN1ER1WA", "ord_in_thread": 0, "title": "Guardiola loses Jesus for up to six weeks, slams festive fixtures", "locations": [], "entities": {"persons": [{"name": "jesus", "sentiment": "negative"}, {"name": "guardiola", "sentiment": "negative"}, {"name": "gabriel jesus", "sentiment": "none"}, {"name": "pep guardiola", "sentiment": "none"}, {"name": "simon evans", "sentiment": "none"}, {"name": "gabriel", "sentiment": "none"}, {"name": "kyle walker", "sentiment": "none"}, {"name": "kevin de bruyne", "sentiment": "none"}], "locations": [{"name": "manchester", "sentiment": "none"}, {"name": "watford - etihad stadium", "sentiment": "none"}, {"name": "manchester city", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "reuters/jason cairnduff  jesus", "sentiment": "none"}, {"name": "crystal palace", "sentiment": "none"}, {"name": "watford", "sentiment": "none"}, {"name": "manchester city", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 11:25 PM / Updated 2 hours ago Guardiola loses Jesus for up to six weeks, slams festive fixtures Simon Evans 3 Min Read \nMANCHESTER, England (Reuters) - Manchester City manager Pep Guardiola will be without Brazilian striker Gabriel Jesus for up to six weeks and warned that the intense festive fixture programme in the Premier League was risking players’ health. Soccer Football - Premier League - Manchester City vs Watford - Etihad Stadium, Manchester, Britain - January 2, 2018 Manchester City manager Pep Guardiola reacts Action Images via Reuters/Jason Cairnduff \nJesus picked up a knee injury in Sunday’s goalless draw at Crystal Palace and is set for a spell on the sidelines. \n“Gabriel will be out four to six weeks, maybe a bit longer, hopefully as soon as possible,” Guardiola told reporters after Tuesday’s 3-1 home win over Watford. \nKevin De Bruyne, who survived a wild challenge at Palace, was able to play but Guardiola has another injury concern with Kyle Walker struggling in the latter stages on Tuesday and set for further tests. \nWhile acknowledging the tradition in England of playing through the holiday period, Guardiola was critical of making his team play on Sunday and then Tuesday. \n“What everyone saw in the last weeks how many injuries the players have. We are going to kill them. The bosses at the federation have to reflect. It’s not normal to play the 31st and two days later,” he said. \n”I know the show must go on, but they have to control it. They don’t protect the players, the people come to watch, not the managers or the press conferences but the players. \n“In England, you don’t protect the players. You can’t play every two days. The tradition is the tradition, we have to think about it a little bit. The players are artists and they are the reason we are here. You have to look for the quality not the quantity,” he said. \nThe former Barcelona and Bayern Munich manager said he would be happy to see games over the festive season but more spread out. \n“I‘m not saying change Boxing Day, the great tradition.... but it’s not basketball or tennis, the players need recovery. Just see how many players have muscular injuries.” \nGuardiola was able to call on forward David Silva, who had missed recent games for personal reasons but said he could skip other games due to the same issues. \n”We are very happy he is back with us. We don’t know how long he will be with us but you saw again today he essential player with us. He showed how important he is for us,” said the Spaniard. \n“He is free to stay or to leave. It depends. He wants to stay but family is the most important thing in life. The family is most important, I would never push him,” he added. Reporting by Simon Evans, editing by Ed Osmond", "external_links": [], "published": "2018-01-03T01:21:00.000+02:00", "crawled": "2018-01-03T01:53:43.000+02:00", "highlightTitle": ""}