{"organizations": [], "uuid": "d69e5bf8417b3f31d5fac1cf00abdbd8088ec50d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/business-wire-build-a-bear-workshop-inc-issues-preliminary-sales-and-pre-tax-earnings-expectations-ahead-of-presentation-at-icr-conference.html", "country": "US", "domain_rank": 767, "title": "Build-A-Bear Workshop, Inc. Issues Preliminary Sales and Pre-Tax Earnings Expectations Ahead of Presentation at ICR Conference", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T14:00:00.000+02:00", "replies_count": 0, "uuid": "d69e5bf8417b3f31d5fac1cf00abdbd8088ec50d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/business-wire-build-a-bear-workshop-inc-issues-preliminary-sales-and-pre-tax-earnings-expectations-ahead-of-presentation-at-icr-conference.html", "ord_in_thread": 0, "title": "Build-A-Bear Workshop, Inc. Issues Preliminary Sales and Pre-Tax Earnings Expectations Ahead of Presentation at ICR Conference", "locations": [], "entities": {"persons": [], "locations": [{"name": "st. louis", "sentiment": "none"}], "organizations": [{"name": "build-a-bear workshop, inc", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "build-a-bear workshop, inc.", "sentiment": "none"}, {"name": "bbw", "sentiment": "none"}, {"name": "gaap", "sentiment": "none"}, {"name": "consolidated", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FY 2017 GAAP pre-tax income expected to be within guidance in the range of $12 million to $13 million, as compared to GAAP pre-tax income of $5.3 million inclusive of $5.7 million in negative adjustments in fiscal 2016 FY 2017 consolidated comparable sales expected to decrease 6.5% The Company repurchased over 500,000 shares of its common stock during fiscal 2017 including over 400,000 shares in the fiscal 2017 fourth quarter\nST. LOUIS--(BUSINESS WIRE)-- Build-A-Bear Workshop, Inc. (NYSE:BBW) today issued preliminary sales and guidance for pre-tax income for the fourth quarter and fiscal year 2017 ended December 30, 2017, in conjunction with its presentation at the 20 th Annual ICR Conference. The Company also provided preliminary expectations for fiscal 2018, the year ending February 2, 2019.\nOn a preliminary basis, for the Fourth Quarter (13-weeks ended December 30, 2017, compared to the 13-weeks ended December 31, 2016) the Company expects:\nTotal revenues of approximately $105 million compared to $110.3 million in the fiscal 2016 fourth quarter; Consolidated net retail sales of approximately $103 million compared to $107.7 million in the fiscal 2016 fourth quarter; Consolidated comparable sales to decrease 7.9%, including a 6.4% decrease in North America and a 13.0% decrease in Europe; notably consolidated comparable E-Commerce sales are expected to increase 11.9%; GAAP retail gross margin of 50.0%, an approximate 400 basis point improvement from 46.0% in the fiscal 2016 fourth quarter; and GAAP pre-tax income in the range of $8 million to $9 million compared to GAAP pre-tax income of $3.5 million, including $4.7 million in adjustments in the 2016 fourth quarter.\nOn a preliminary basis, for the 2017 Fiscal Year (52-weeks ended December 30, 2017, compared to the 52-weeks ended December 31, 2016) the Company expects:\nTotal revenues of approximately $356 million compared to $364.2 million in fiscal 2016; Consolidated net retail sales of approximately $348 million compared to $357.6 million in the 2016 fiscal year; Consolidated comparable sales to decrease 6.5%, including a 6.4% decrease in both North America and Europe; notably consolidated comparable E-Commerce sales are expected to increase 2.9%; GAAP Retail gross margin of 46.5%, an approximate 130 basis points improvement from 45.2% in the 2016 fiscal year; GAAP pre-tax income in the range of $12 million to $13 million compared to a GAAP pre-tax income of $5.3 million, including $5.7 million in adjustments in the 2016 fiscal year; and Capital expenditures to approximate $18 million to $19 million; depreciation and amortization is expected to be approximately $16 million.\nIn addition:\nThe Company repurchased 401,400 shares of its common stock for $3.7 million in the fiscal 2017 fourth quarter bringing total shares repurchased to 513,725 for the fiscal year. At year end, the Company had $15.3 million remaining on its share repurchase authorization. At the end of the fiscal 2017 year, the Company operated 362 corporately-managed locations, including 302 in North America and 60 outside of North America.\nThe Company noted that its revenue, sales and profit expectations are estimated and preliminary and subject to quarter and year-end closing adjustments. As the Company has not completed its quarter and year-end fiscal close or the audit of its 2017 financial statements, the revenue, sales and profit expectations presented in this press release may change.\nSharon Price John, Build-A-Bear Workshop Chief Executive Officer commented, “Although we were successfully able to move forward on a number of our stated strategic initiatives for the year and the quarter, our estimated revenue did not meet our expectations. However, because of our ongoing operational improvements, we expect to deliver our pre-tax profit within guidance. We also began to realize the initial benefits of the new web platform that was launched in the fourth quarter with E-commerce sales rising double-digits. In addition to the website launch, we continued to transition our real estate portfolio to be more aligned to the evolving consumer shopping patterns and accelerated the development of new relationships to increase the diversification of revenue streams, including our recent announcement of a new Chinese franchise partnership. With a strong balance sheet and positive cash flow, we believe we are well-positioned to continue to evolve the company to be able to leverage the strength of the Build-A-Bear brand.”\n2018 Preliminary Expectations\nThe Company is providing preliminary expectations for fiscal year 2018, the year ending February 2, 2019.\nOn a preliminary basis, the Company expects:\nRevenue in the range of flat to up low single digits; Earnings before interest and taxes (EBIT) and diluted earnings per share (EPS) to increase over fiscal year 2017*; and Capital expenditures to be in the range of $15 to $18 million.\n*Given the potential impact of anticipated accounting changes and recent tax changes, the Company will provide further specificity with regard to its expectations for EBIT and EPS growth when it reports fiscal 2017 results in February.\nFiscal Year Change\nThe Company's Board of Directors has authorized a change in the Company’s fiscal year end which previously ended on the Saturday closest to December 31 to the Saturday closest to January 31. This change will be effective with the start of the Company’s 2018 fiscal year. The one fiscal month transition period, December 31, 2017 through February 3, 2018, will be reported on the Company’s Form 10-Q along with results for the quarter ended May 5, 2018. The first 12-month fiscal year under the new calendar will encompass February 4, 2018, through February 2, 2019.\nCorporate Tax Reform\nOn December 22, 2017, H.R.1 - An Act to provide for reconciliation pursuant to titles II and V of the concurrent resolution on the budget for fiscal year 2018, also known as the Tax Cuts and Jobs Act, (the “Act”) was enacted which among other items reduces the federal corporate tax rate to 21% effective January 1, 2018. The Company is currently reviewing the components of the Act and evaluating its impact, which could have a material negative effect on the Company’s fiscal year 2017 consolidated financial statements and related disclosures, including a one-time, non-cash expense related to a decrease in the value of the Company’s net deferred tax assets.\nICR Conference\nThe Company is scheduled to present at the 20th Annual ICR Conference held at the Grand Lakes Resort in Orlando, Florida, on Tuesday, January 9, 2018, at 8:30 a.m. EST. The presentation will be broadcast over the internet and can be accessed at the Company’s investor relations website, http://IR.buildabear.com . The presentation is expected to conclude by 8:55 a.m. EST. A replay of the broadcast will remain on the Company’s investor relations website for one year.\nAbout Build-A-Bear\nFounded in St. Louis in 1997, Build-A-Bear is a global brand kids love and parents trust that seeks to add a little more heart to life. Build-A-Bear Workshop has over 450 stores worldwide where guests can create customizable furry friends, including corporately-managed stores in the United States, Canada, Denmark, Ireland, Puerto Rico, the United Kingdom and China, and franchise sto", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fbuildabear.com&esheet=51739987&newsitemid=20180109005482&lan=en-US&anchor=buildabear.com&index=2&md5=33ca5b06e754cbbcc743ed2c4d76ed19", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2FIR.buildabear.com&esheet=51739987&newsitemid=20180109005482&lan=en-US&anchor=http%3A%2F%2FIR.buildabear.com&index=1&md5=470c10cb354d554dce5b4afd061b9ab7", "http://www.businesswire.com/news/home/20180109005482/en/"], "published": "2018-01-09T14:00:00.000+02:00", "crawled": "2018-01-09T15:39:53.000+02:00", "highlightTitle": ""}