{"organizations": [], "uuid": "92b2cbe6b99bad4c3509a83c3739c8a3b39da88c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/16/the-associated-press-autonomous-cars-loom-but-the-detroit-auto-show-goes-on.html", "country": "US", "domain_rank": 767, "title": "Autonomous cars loom, but the Detroit auto show goes on", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T01:34:00.000+02:00", "replies_count": 0, "uuid": "92b2cbe6b99bad4c3509a83c3739c8a3b39da88c"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/16/the-associated-press-autonomous-cars-loom-but-the-detroit-auto-show-goes-on.html", "ord_in_thread": 0, "title": "Autonomous cars loom, but the Detroit auto show goes on", "locations": [], "entities": {"persons": [], "locations": [{"name": "detroit", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "general motors", "sentiment": "none"}, {"name": "chevrolet silverado", "sentiment": "none"}, {"name": "fiat chrysler", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DETROIT (AP) — The North American International Auto Show in Detroit opened to the press this week with one big question hanging in the air: How will autonomous vehicles change the industry?\nThe answer is still unclear. In the meantime, automakers continue to put out new vehicles of all shapes and sizes, including small cars, SUVs and the all-mighty pickup truck, which dominated the show.\nAll will be on display when the show opens to the public Saturday, with a charity preview on Friday night.\nHere are five things we learned from the preview this week:\nTRUCKS ARE KING\nPickups are the most popular vehicles in the U.S., and trucks unveiled at the show make clear that will continue for a long time.\nGeneral Motors spent heavily to update its top-selling Chevrolet Silverado pickup, cutting up to 450 pounds of weight by using more aluminum and lighter high-strength steel. The truck also gets two new V8 engines that can run on one to eight cylinders depending on how much power is needed.\nFiat Chrysler's Ram also got big updates, losing more than 200 pounds and giving it a gas-electric hybrid engine option. Both the Silverado and Ram were given more athletic stances and meaner looks. Ford added a diesel engine to its F-150 and rolled out the midsize Ranger.\nAutomakers turn big profits on large pickups. Sales rose nearly 6 percent last year to almost 2.4 million, even though total U.S. auto sales dropped 2 percent. Ford's F-Series is the country's top-selling vehicle, followed by the Silverado and Ram.\nTAX REFORM BOOST?\nU.S. auto sales are likely to fall to around 16.7 million in 2018 from 17.2 million last year, says Michelle Krebs, an executive analyst with the car buying site Autotrader.com .\nBut that would still make it one of the 10 best sales years in history, so the market remains strong.\nU.S. income tax code changes this year may stimulate new auto sales, but any increase likely will be offset by rising interest rates and the abundant supply of late-model used cars that pull buyers from new vehicles, Toyota Motor Corp.'s top North American executive says.\nNorth American CEO Jim Lentz expects a sales boost of 200,000 vehicles as tax cuts put more money in people's pockets. But the increase could be negated as rising rates keep some people on the sidelines, and some buyers opt for a lower-cost but nice off-lease used car.\nTax cuts could boost pickup truck sales because businesses can write off the expenses immediately under the new code, Lentz said.\nBut he expects luxury new-car sales to be flat this year even though tax rates were reduced for higher-income earners. Any decrease could be wiped out by caps on deductions for mortgage interest and local and state taxes in big luxury-car states such as New York and California, Lentz said.\nTRADE DEAL\nMany auto executives interviewed at the auto show say they're afraid the U.S. might pull out of the 24-year-old North American Free Trade Agreement, but they can't prepare for it because they don't know what, if anything will replace it.\nIn ongoing negotiations with Mexico and Canada, the Trump administration is seeking to ensure that more vehicles are made in America, among other changes. But Jim Lentz, Toyota's North American CEO, says ending the agreement would likely raise costs. That, in turn, would raise vehicle prices and cut demand, forcing manufacturing layoffs. It also would make the U.S. less competitive than the world's other manufacturing centers, he said. Ending the agreement also could force some suppliers to stop making parts.\nCharlie Chesbrough, the chief economist for Cox Automotive, said it's hard to imagine there will be much change in production, because automakers need a long lead time to act and they know the next president could reverse Trump's actions. But some automakers are already taking pre-emptive steps to show the administration they're willing to boost U.S. production. Fiat Chrysler said ahead of the auto show that it will move heavy duty truck production from Mexico to Michigan in 2020.\nHEDGING ON ROBOT CARS\nAutomakers are hedging their bets when it comes to autonomous vehicles and whether they will someday cut into or even end personal car ownership.\nIn interviews through the week, executives said they're preparing for a time when people hire self-driving ride services to get around instead of spending on personal vehicles.\nBut they don't know just when that will take place, so they also must continue to spend millions to develop conventional vehicles as well.\n\"These proclamations that we hear about the advent of electrification and artificial intelligence ... are all things that, at best, are conjecture,\" said Fiat Chrysler CEO Sergio Marchionne.\nAlthough some companies plan to deploy driverless cars to carry passengers in coming months, Marchionne says it will take years for the vehicles to be in widespread use.\nMark Reuss, General Motors' head of product development says he wishes he knew exactly when and where the switch would take place. But for now, GM and other companies have to be in both places.\n\"We can go either way and that agility is priceless,\" said Reuss.\nGOOD OLD DAYS\nDespite the new wheels on the show floor, one of the biggest hits is a 50-year-old Mustang GT fastback in need of a paint job. It was one of the original cars used in the 1968 film \"Bullitt,\" which put the Mustang on the map with a famous chase scene.\nFord Motor Co. rolled it out to help celebrate a special \"Bullitt\" edition Mustang, which goes on sale this summer. The faded green car got a huge cheer when it rumbled onto the stage.", "external_links": [], "published": "2018-01-17T01:34:00.000+02:00", "crawled": "2018-01-17T07:26:29.003+02:00", "highlightTitle": ""}