{"organizations": [], "uuid": "2ef7a2a1437df33dffc3aafc19a406d07a24ea10", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220909464&w=1200&r=LYNXMPEE091DG", "site_section": "http://feeds.reuters.com/reuters/INformulaOne", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/people-michael-douglas/actor-michael-douglas-makes-pre-emptive-move-to-deny-sexual-misconduct-idINKBN1EZ2JK", "country": "US", "domain_rank": 408, "title": "Actor Michael Douglas makes pre-emptive move to deny sexual misconduct", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T21:09:00.000+02:00", "replies_count": 0, "uuid": "2ef7a2a1437df33dffc3aafc19a406d07a24ea10"}, "author": "", "url": "https://in.reuters.com/article/people-michael-douglas/actor-michael-douglas-makes-pre-emptive-move-to-deny-sexual-misconduct-idINKBN1EZ2JK", "ord_in_thread": 0, "title": "Actor Michael Douglas makes pre-emptive move to deny sexual misconduct", "locations": [], "entities": {"persons": [{"name": "michael douglas", "sentiment": "negative"}, {"name": "douglas", "sentiment": "none"}, {"name": "reuters/carlo allegri", "sentiment": "none"}], "locations": [{"name": "hollywood", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "film society of lincoln center", "sentiment": "none"}, {"name": "deadline.com", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 7:09 PM / Updated 3 hours ago Actor Michael Douglas makes pre-emptive move to deny sexual misconduct Reuters Staff 3 Min Read \nLOS ANGELES (Reuters) - Oscar winning actor Michael Douglas has issued a pre-emptive denial of a sexual misconduct accusation, saying he wanted to get ahead of a potential story being investigated by Hollywood publications. Actor Michael Douglas arrives for the Chaplin Awards at the Film Society of Lincoln Center in the Manhattan borough of New York, U.S. May 8, 2017. REUTERS/Carlo Allegri \nIn a lengthy interview with entertainment industry website Deadline.com, published late on Tuesday, Douglas denied that he had masturbated in front of a woman who worked for him about 32 years ago. \n“This is a complete lie, fabrication, no truth to it whatsoever,” Douglas said. \nThe accusation by the unidentified woman has not been published but Douglas said he had been informed by his attorneys in December that The Hollywood Reporter and other publications were investigating her claim. \n“I felt the need to get ahead of this,” Douglas, 73, told Deadline. \n“I had the choice of waiting for a story to come out, one that will clearly get picked up by other newspapers and magazines, and then I have to sit there and try to defend myself.” \nThe double Oscar-winner is the second celebrity to get his version of events out before being publicly accused of sexual impropriety in a scandal that has rocked Hollywood and led to many men being fired or cut out of projects. \nDocumentary filmmaker Morgan Spurlock posted a social media message last month saying he was “part of the problem,” saying he had in the past been accused of rape and had settled a sexual harassment lawsuit. \nDouglas told Deadline he had been informed by his attorney that the woman also accused him of using coarse language around her, but not to her, and claimed that he had “blackballed” her in the industry after firing her. \nThe actor denied blackballing the women but admitted using “colorful language” in conversations with friends in his home and office. \nDouglas said he supported the #MeToo movement by those breaking their silence over past sexual harassment, and that he had the support of his wife, actress Catherine Zeta-Jones, and his children. \nRepresentatives of the actor did not respond on Wednesday to a Reuters request for further comment. Reporting by Jill Serjeant", "external_links": [], "published": "2018-01-10T21:09:00.000+02:00", "crawled": "2018-01-10T21:35:55.010+02:00", "highlightTitle": ""}