{"organizations": [], "uuid": "c1d1d3e0822667a09606c32a1b60a2b1e1197f09", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/britain-companies-regulator/update-1-uk-watchdog-proposes-wider-access-to-banks-complaints-scheme-idUSL8N1PH2I7", "country": "US", "domain_rank": 408, "title": "UPDATE 1-UK watchdog proposes wider access to banks complaints scheme", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T13:43:00.000+02:00", "replies_count": 0, "uuid": "c1d1d3e0822667a09606c32a1b60a2b1e1197f09"}, "author": "", "url": "https://www.reuters.com/article/britain-companies-regulator/update-1-uk-watchdog-proposes-wider-access-to-banks-complaints-scheme-idUSL8N1PH2I7", "ord_in_thread": 0, "title": "UPDATE 1-UK watchdog proposes wider access to banks complaints scheme", "locations": [], "entities": {"persons": [{"name": "huw jones", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "am / updated", "sentiment": "negative"}, {"name": "financial conduct authority", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "fca", "sentiment": "none"}, {"name": "lloyds banking group", "sentiment": "none"}, {"name": "royal bank of scotland", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "financial ombudsman service", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 11:45 AM / Updated 37 minutes ago UPDATE 2-UK watchdog proposes wider access to bank complaints scheme Reuters Staff \n* Lawmaker group says stronger action is required \n* FCA says can’t go further without new law \n* Small business lobby calls for new dispute body (Adds lawmaker, small business reaction) \nBy Huw Jones \nLONDON, Jan 22 (Reuters) - More companies should be allowed to complain to the Financial Ombudsman Service to seek redress if they feel they have been treated badly by their banks, Britain’s markets watchdog said on Monday. \nThe Financial Conduct Authority said only very small firms with fewer than 10 staff and balance sheet of up to two million pounds ($2.8 million) currently have access to the FOS, which can arbitrate on a complaint and order compensation. \nThe FCA came under pressure from lawmakers to extend access to the FOS following scandals at Royal Bank of Scotland and Lloyds Banking Group, both of which got state bailouts during the financial crisis. \nWithout access to the free FOS resolution service, a business would have to take a bank to court, a costly and time-consuming process. \n“Our evidence suggests some small businesses currently find it hard to achieve a fair outcome in disputes with financial services firms because court action is not a realistic option for them,” FCA Chief Executive Andrew Bailey said in a statement. \nThe FCA proposals extend this access to all businesses with fewer than 50 employees, annual turnover of under 6.5 million pounds ($9 million) and an annual balance sheet total of under 5 million pounds. \n“In total, we estimate around 160,000 more businesses will have access to the Ombudsman as a result of our proposals,” the FCA said. Charities and trusts falling within the new thresholds would also be eligible. \nThe FCA set out its proposals in a 64-page consultation paper. Final rules will be published in the summer and come into force on Dec. 1. TOO WEAK \nThe FCA said the proposals go as far as its powers allow without the need for a new law. \nBut the All Party Parliamentary Group (APPG) on fair business banking and finance said the proposals don’t go far enough, and that a specialist transition tribunal could be set up without the need for a new law. \n“We call upon the FCA and the Treasury to work with us to make sure we deliver the right solution as quickly as possible,” said Kevin Hollinrake, APPG vice-chair. \nThe Federation of Small Businesses said many critical reforms were needed that go beyond a simple change in who can complain to the ombudsman. \n“Alongside a much needed expansion of the FOS, we need to give serious consideration to legislating for a separate dispute mechanism,” the federation said. \nRBS and Lloyds set up voluntary compensation schemes after lending and business turnaround scandals involving small companies, but the two schemes have been criticised by firms for being unfair. \nLawmakers published last week a “Just Hit Budget!” sales memo from RBS’s former business restructuring unit, which said “Rope: Sometimes you need to let customers hang themselves.” \n“As long as a complainant is eligible, the ombudsman can consider complaints about any regulated activity; it can also consider complaints about some unregulated activities, such as, lending to companies or the activities of business turnaround units,” the FCA said. \nThe watchdog said its proposals will provide access to the FOS for more than 80 percent of the approximately 200,000 small and medium sized enterprises that are not currently eligible. \nThe FOS can order a bank to pay redress of up to 150,000 pounds, and raising this limit would require legislation. ($1 = 0.7193 pounds) (Reporting by Huw Jones; Editing by Keith Weir and Adrian Croft)", "external_links": [], "published": "2018-01-22T13:43:00.000+02:00", "crawled": "2018-01-22T14:25:07.014+02:00", "highlightTitle": ""}