{"organizations": [], "uuid": "7ba972ca91b952dd48db8f4d06f1ba754fe66491", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/steinhoff-intlnl-lawsuit/update-2-south-african-union-pension-fund-join-forces-over-steinhoff-idUSL8N1PK2PV", "country": "US", "domain_rank": 408, "title": "UPDATE 2-South African union, pension fund join forces over Steinhoff", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T18:03:00.000+02:00", "replies_count": 0, "uuid": "7ba972ca91b952dd48db8f4d06f1ba754fe66491"}, "author": "", "url": "https://www.reuters.com/article/steinhoff-intlnl-lawsuit/update-2-south-african-union-pension-fund-join-forces-over-steinhoff-idUSL8N1PK2PV", "ord_in_thread": 0, "title": "UPDATE 2-South African union, pension fund join forces over Steinhoff", "locations": [], "entities": {"persons": [{"name": "steinhoff", "sentiment": "negative"}, {"name": "wendell roelf  cape town", "sentiment": "none"}], "locations": [{"name": "poundland", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "psg group", "sentiment": "none"}, {"name": "steinhoff reuters staff", "sentiment": "none"}, {"name": "public investment corporation", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 4:05 PM / in an hour UPDATE 2-South African union, pension fund join forces over Steinhoff Reuters Staff \n(Adds Steinhoff) \nBy Wendell Roelf \nCAPE TOWN, Jan 25 (Reuters) - South Africa’s civil servants union has teamed up with the government pension fund to pursue Steinhoff for around $1.4 billion of pensioners’ money lost as a result of an accounting scandal at the troubled retailer. \nSteinhoff, which owns more than 40 brands including Poundland in Britain, admitted “accounting irregularities” last month, sparking an 85 percent share price slide that wiped more than $10 billion off its market capitalisation. \nThis has left investors such as the Public Investment Corporation (PIC), which has around 2 trillion rand of government employees’ pensions under its custody and is Steinhoff’s second-largest shareholder, nursing big losses. \nSteinhoff faces a liquidity shortfall following the accounting problems and on Monday it sold a stake in investment firm PSG Group for 7.1 billion rand, after securing 60 million euros from South African lenders the previous week. \nBut roughly 2 billion euros of the company’s 10.7 billion euros in debts mature this year and it has called a meeting with some of its European-based creditors on Friday. \nCreditors have been joining forces to position themselves for a potential debt restructuring, people close to the matter said this week. \n“We want to recoup as much as possible and that is why we have an agreement with PIC to have a joint class action to make sure that happens… to try and recoup the losses of those investments,” Tahir Maepa, deputy general manager at the Public Servants Association (PSA) told a news conference. \nPSA said documents it had obtained from Steinhoff painted a picture of a company with a “complete collapse” of corporate governance and “real maladministration” of its tax system \nSteinhoff said auditing firm PricewaterhouseCoopers (PwC) had been hired to conduct a full forensic investigation without limitation, as the board sought to uncover what went on. \n”When we have the results of the PwC investigation, we will take appropriate action against anyone found to have been involved in maladministration and dishonesty, it said. \n“Steinhoff is unable to comment on the merits of any legal action that is not before us,” it added in response to questions from Reuters. \nSteinhoff shares fell as much as 8 percent and 6 percent in Johannesburg and Frankfurt during Thursday. They were trading down 1 percent at 744 rand at 1600 GMT in Johannesburg and 3.4 percent lower at 0.48 euros in Frankfurt. ($1 = 11.8781 rand) (Reporting by Wendell Roelf; Writing by Tiisetso Motsoeneng; Editing by Jason Neely/Hugh Lawson/Alexander Smith)", "external_links": [], "published": "2018-01-25T18:03:00.000+02:00", "crawled": "2018-01-25T18:53:52.000+02:00", "highlightTitle": ""}