{"organizations": [], "uuid": "141823ccaa6595c1febf41de36b30f3777d5ae1c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225545580&w=1200&r=LYNXMPEE0P12Q", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-davos-meeting-ceo-dinner/an-aspirin-a-day-as-trump-tells-european-corporate-bosses-at-davos-idUSKBN1FF2B8", "country": "US", "domain_rank": 408, "title": "An aspirin a day, as Trump tells European corporate bosses at Davos", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T19:22:00.000+02:00", "replies_count": 0, "uuid": "141823ccaa6595c1febf41de36b30f3777d5ae1c"}, "author": "", "url": "https://www.reuters.com/article/us-davos-meeting-ceo-dinner/an-aspirin-a-day-as-trump-tells-european-corporate-bosses-at-davos-idUSKBN1FF2B8", "ord_in_thread": 0, "title": "An aspirin a day, as Trump tells European corporate bosses at Davos", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "kaeser", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "joe kaeser", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "davos", "sentiment": "negative"}, {"name": "siemens", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "davos reuters staff", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 5:23 PM / in 15 minutes An aspirin a day, as Trump tells European corporate bosses at Davos Reuters Staff 3 Min Read \nDAVOS, Switzerland (Reuters) - European corporate bosses outdid each other in bragging about their U.S. businesses to President Donald Trump at a dinner late on Thursday, who responded by saying he likes German elevators and takes an aspirin a day. \nAt the event, taking place during the World Economic Forum in Davos, leaders of Europe’s top industrial, oil, healthcare and tech groups all rushed to briefly describe their activities in the United States in hope of a favorable response. \nSitting to Trump’s left, Joe Kaeser, chief executive of German industrials group Siemens, kicked things off by saying that company was doing well in the United States, where it employs 56,000 workers. \n“And since you have been successful with tax reform, we decided to develop next-generation gas turbines in the United States,” Kaeser said according to a transcript of the event, referring to the corporate tax cuts approved last month. \nTrump, the first sitting U.S. president to visit the summit for 18 years, said this was a “big thing” before listening to similar pitches from the bosses of Nestle, Nokia, Volvo and Adidas. U.S. President Donald Trump attends a dinner with business men and CEO's during the World Economic Forum (WEF) annual meeting in Davos, Switzerland January 25, 2018. REUTERS/Carlos Barria \nResponding to comments from Werner Baumann, CEO of Bayer which is currently in the process of taking over U.S. seed maker Monsanto, Trump said he was a regular user of one of the German healthcare group’s mainstays: aspirin. \n“I take one a day ... So far, it’s been working,” he told his guests, also including the CEOs of SAP and Total, who were treated to a meal of grilled beef tenderloin with green pea puree or fried Swiss pike perch with purple carrot puree. \nTrump has left numerous foreign companies uneasy in light of his ‘America First’ agenda, which includes recently announced import duties on solar cells, a threat to end the North American Free Trade Agreement and possible tariffs on steel. \nDespite this, European blue-chips continue to invest, produce and create jobs in the world’s biggest economy. \nHeinrich Hiesinger, the CEO of German steel and engineering conglomerate Thyssenkrupp, said he was very proud that the group had supplied all of the elevators to New York’s One World Trade Center, the office building which replaced the twin towers destroyed in 2001. \nTrump, whose own iconic Trump Tower is located 5 miles north, said he was no stranger to the Thyssenkrupp brand: “I’ve used your product, as you know. Great product. Thank you very much.” Writing by Christoph Steitz; Editing by Peter Graff", "external_links": [], "published": "2018-01-26T19:22:00.000+02:00", "crawled": "2018-01-26T19:29:46.013+02:00", "highlightTitle": ""}