{"organizations": [], "uuid": "8061ede67ad9911be00e1391429ffbb90396d141", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-recro-pharma-announces-key-executive-promotions-to-the-financial-team.html", "country": "US", "domain_rank": 767, "title": "Recro Pharma Announces Key Executive Promotions to the Financial Team", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.007, "site_type": "news", "published": "2018-01-03T15:00:00.000+02:00", "replies_count": 0, "uuid": "8061ede67ad9911be00e1391429ffbb90396d141"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-recro-pharma-announces-key-executive-promotions-to-the-financial-team.html", "ord_in_thread": 0, "title": "Recro Pharma Announces Key Executive Promotions to the Financial Team", "locations": [], "entities": {"persons": [{"name": "mike", "sentiment": "none"}, {"name": "ryan", "sentiment": "none"}, {"name": "ryan d. lake", "sentiment": "none"}, {"name": "gerri henwood", "sentiment": "none"}, {"name": "michael celano", "sentiment": "none"}], "locations": [{"name": "financial team malvern", "sentiment": "none"}, {"name": "pa.", "sentiment": "none"}, {"name": "recro", "sentiment": "none"}], "organizations": [{"name": "recro pharma announces key executive promotions", "sentiment": "negative"}, {"name": "recro pharma, inc.", "sentiment": "neutral"}, {"name": "fda", "sentiment": "none"}, {"name": "recro pharma", "sentiment": "none"}, {"name": "u.s. food and drug administration", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MALVERN, Pa., Jan. 03, 2018 (GLOBE NEWSWIRE) -- Recro Pharma, Inc. (Nasdaq:REPH), a revenue generating specialty pharmaceutical company focused on therapeutics for the hospital and other acute care settings, today announced several key promotions to its executive leadership team: Michael Celano has been promoted to Chief Operating Officer, and Ryan D. Lake has been promoted to Chief Financial Officer. Both promotions are effective January 3, 2018.\n“I am pleased to announce the promotions of Mike and Ryan, two critical members of our financial leadership team,” said Gerri Henwood, President and Chief Executive Officer of Recro Pharma. “With the sustained, strong performance and significant contribution of the contract development and manufacturing (CDMO) facility to Recro, as well as the active pre-commercialization efforts for IV meloxicam 30mg in anticipation of launch following the potential approval by the U.S. Food and Drug Administration (FDA) next year, it is imperative that we have a strong and skilled team in place capable of executing across both divisions of Recro. I look forward to continuing to work with both Mike and Ryan in their new roles during this transformative time for the Company.”\nMr. Celano has over 35 years of senior financial leadership experience in the life sciences and biopharmaceutical industries. Mr. Celano joined Recro in July 2016 as Chief Financial Officer. During his tenure, he has provided financial leadership through several Phase III clinical trials, the filing of the New Drug Application (NDA) for IV meloxicam 30mg and preparing for commercial launch, as well as through the continued strong performance of the Company’s manufacturing division. In his new role as Chief Operating Officer, Mr. Celano will continue to lead finance and administration for Recro, and he will assume responsibility for the Company’s CDMO division. Prior to joining Recro, Mr. Celano served as Chief Financial Officer at Kensey Nash, a Nasdaq-listed, medical device company, and BioRexis, a venture-funded, life sciences company. Mr. Celano serves on the board of OraSure Technologies (Nasdaq:OSUR). Prior to entering the biopharmaceutical industry, Mr. Celano was a Partner at Arthur Andersen/KPMG, where he worked from 1980 until 2004, and led its life sciences practices. Mr. Celano received a bachelor’s degree in accounting from Saint Joseph’s University.\nMr. Lake joined Recro in June 2017 as the Company’s Chief Accounting Officer, and he has over 15 years of senior financial leadership experience. Prior to joining Recro, Mr. Lake served as Chief Financial Officer and Vice President of Finance of Aspire Bariatrics, Inc., a privately-held, commercial-stage, medical device company. From 2012 to 2015, Mr. Lake held executive management and senior finance positions, including Director of the Natural Materials Division, Controller and Senior Director of Finance, at DSM Biomedical (successor to Kensey Nash after its acquisition in 2012), a division of Royal DSM (listed on Euronext Amsterdam), a global science-based company active in health, nutrition and materials. From 2002 to 2012, Mr. Lake held various senior financial positions of increasing responsibility, most notably Senior Director of Finance and Interim CFO, with Kensey Nash Corporation, a Nasdaq-listed, medical device company. Earlier in his career, Mr. Lake worked at Deloitte & Touche, LLP. Mr. Lake is a Certified Public Accountant, Chartered Global Management Accountant and holds a B.S. degree in Accounting from West Chester University of Pennsylvania.\nAbout Recro Pharma, Inc.\nRecro Pharma is a specialty pharmaceutical company that operates through two business divisions, an Acute Care, hospital product division and a revenue-generating contract development and manufacturing, or CDMO division, located at the Company’s Gainesville facility. The Acute Care division is primarily focused on developing innovative products for hospital and other acute care settings. The Company’s lead product candidate is a proprietary injectable form of meloxicam, a long-acting preferential COX-2 inhibitor. IV meloxicam 30mg has successfully completed two pivotal Phase III clinical efficacy trials in patients following bunionectomy and abdominoplasty surgeries, a large double blind Phase III safety trial, four Phase II clinical trials for the management of moderate to severe post-operative pain, as well as other safety studies. As injectable meloxicam is in the non-opioid class of drugs, the Company believes it will overcome many of the issues associated with commonly prescribed opioid therapeutics, including respiratory depression, constipation, excessive nausea and vomiting, as well as having no addictive potential while maintaining meaningful analgesic effects for relief of pain. The Company’s CDMO division leverages its formulation expertise to develop and manufacture pharmaceutical products using its proprietary delivery technologies and other manufacturing services for commercial partners who commercialize or plan to commercialize these products. These collaborations can result in revenue streams including royalties, profit sharing, research and development and manufacturing fees, which support continued operations for its CDMO division and it contributes non-dilutive funding for the development and pre-commercialization activities of its Acute Care division.\nCautionary Statement Regarding Forward Looking Statements\nThis press release contains forward-looking statements that involve risks and uncertainties. Such forward looking statements reflect Recro's expectations about its future performance and opportunities that involve substantial risks and uncertainties. When used herein, the words \"anticipate,\" \"believe,\" \"estimate,\" \"upcoming,\" \"plan,\" \"target\", \"intend\" and \"expect\" and similar expressions, as they relate to Recro or its management, are intended to identify such forward-looking statements. These forward looking statements are based on information available to Recro as of the date of this press release and are subject to a number of risks, uncertainties, and other factors that could cause Recro’s performance to differ materially from those expressed in, or implied by, these forward looking statements. Recro assumes no obligation to update any such forward-looking statements. Factors that could cause Recro’s actual performance to materially differ from those expressed in the forward-looking statements set forth in this press release include, without limitation: the ability to obtain and maintain regulatory approval of injectable meloxicam and the labeling under any such approval; regulatory developments in the United States and foreign countries; results and timing of the clinical trials of injectable meloxicam, the Company’s ability to achieve its financial goals, including financial guidance; the Company’s ability to raise future financing for continued development, product commercialization and the payment of milestones; the Company’s ability to pay its debt; customer product performance and ordering patterns, the performance of third-party suppliers and manufacturers; the Company’s ability to obtain, maintain and successfully enforce adequate patent and other intellectual property protection; and the successful commercialization of injectable meloxicam. The forward looking statements in this press release should be considered together with the risks and uncertainties that may affect Recro’s ", "external_links": ["https://www.globenewswire.com/Tracker?data=ePxisLNKO2IcJWjDxoQzE9Qq6tjKXhyur5IUGxxFQBGygbwfN0fH0VYxLzp_OBHRZ0U_OofTzi9bbylOnntvZhf1llPelr4FjPrM-h6wtLE=", "https://www.globenewswire.com/Tracker?data=DYLNmVoUdjF9XGU2SJwG1xXoCYQxpjOBRHLC2soz1gD9D5LPkKyDqJJK62VntfLSC8GNctkd-BXhrXwu-nWtUomNidzQGj_xz5X4E_vkYrI=", "https://www.globenewswire.com/Tracker?data=EsS3KHuG3aZt09dMe9uXgJ1Hf4PWfErY5TS4bXe6hn61lxKfuROwT1H356yCoAIXtndwouIF97BcAWOmNZEw1nIdMoSYwo3bqsZgmJodsSc=", "https://www.globenewswire.com/Tracker?data=ZDBVDi9NjlpOHEiiFixtFr39WQVyIWZ3ymcIIIMdnTwZ1J4xI9hQy3pm-Bf5qAKzXj17XPJI-Y_3L2lJ-hOybuGeGtCcg7x-CaImbjnwtt6440QPhp1miNMa24ryl1ntSNlRpVd8j_5dCB8tk0w1koNNKqZDe159fvD9bs4MXoY3mQggUjm2hVNaz4APNh37BwpmlVSfZO0ov7fO98RJKloSfCl9XTZ5CQeUnkQYg-vMS85QBvhkyoeMFQSgBEulPX2vRDbXiQ-oWOO3VCEZ2oeGccb3ZMPUJgQpZaIp8725H3o6ppWbLuqm7zrpIi1035RVpJFYL5Oi-CiPN7yQWpEwgILPK07GDMGIOdIGd85omYnT4cA--MLTZNw5UFBGYs7Nn5ENtja_8mxthtbVao6Y3Qh3UccVxGpiTUgVxA3pNgJQG2UQIqbURAXEqvsfdX_i4xng84TkZWc6CBEUXiodgkMx8urdXQ05gyX", "https://www.globenewswire.com/NewsRoom/AttachmentNg/3d6dbe46-d587-4369-afa5-a5ba7044727f", "https://www.globenewswire.com/Tracker?data=hShtyBG8W7Cp2noUt1pZNJgU8cZV4IAv_XSXebGUIsK3_ptvjaI4T9yPyrs6oKlz585HS_wDA24zD9ks8bXqJ0Ofqsq0yv_x404l-kTcEWg="], "published": "2018-01-03T15:00:00.000+02:00", "crawled": "2018-01-03T17:06:45.006+02:00", "highlightTitle": ""}