{"organizations": [], "uuid": "eb869f921a8ce0be98682ba5f999b88d363a5e73", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-new-oriental-announces-results-for-the-second-fiscal-quarter-ended-november-30-2017.html", "country": "US", "domain_rank": 767, "title": "New Oriental Announces Results for the Second Fiscal Quarter Ended November 30, 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.487, "site_type": "news", "published": "2018-01-23T11:03:00.000+02:00", "replies_count": 0, "uuid": "eb869f921a8ce0be98682ba5f999b88d363a5e73"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-new-oriental-announces-results-for-the-second-fiscal-quarter-ended-november-30-2017.html", "ord_in_thread": 0, "title": "New Oriental Announces Results for the Second Fiscal Quarter Ended November 30, 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "beijing", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "new oriental education and technology group inc.", "sentiment": "negative"}, {"name": "new oriental", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING, Jan. 23, 2018 /PRNewswire/ -- New Oriental Education and Technology Group Inc. (the \"Company\" or \"New Oriental\") (NYSE: EDU), the largest provider of private educational services in China, today announced its unaudited financial results for the second fiscal quarter ended November 30, 2017, which is the second quarter of New Oriental's fiscal year 2018.\nFinancial Highlights for the Second Fiscal Quarter Ended November 30, 2017\nTotal net revenues increased by 36.9% year-over-year to US$467.2 million for the second fiscal quarter of 2018. Operating loss was US$13.1 million for the second fiscal quarter of 2018, compared to an income of US$0.2 million in the same period of the prior fiscal year. Non-GAAP operating loss, which excludes share-based compensation expenses, was US$3.8 million, compared to an income of US$2.4 million in the same period of the prior fiscal year. Net income attributable to New Oriental decreased by 58.7% year-over-year to US$4.3 million for the second fiscal quarter of 2018. Non-GAAP net income attributable to New Oriental, which excludes share-based compensation expenses, increased by 8.5% year-over-year to US$13.6 million for the second fiscal quarter of 2018.\nKey Financial Results\n(in thousands US$, except per ADS (1) data)\n2Q FY2018\n2Q FY2017\n% of change\nNet revenues\n467,183\n341,238\n36.9%\nOperating income / (loss)\n(13,070)\n214\n—\nNon-GAAP operating income / (loss) (2)(3)\n(3,757)\n2,379\n—\nNet income attributable to New Oriental\n4,279\n10,360\n(58.7)%\nNon-GAAP net income attributable to New Oriental (2)(3)\n13,592\n12,525\n8.5%\nNet income per ADS attributable to New Oriental - basic\n0.03\n0.07\n(58.9)%\nNet income per ADS attributable to New Oriental - diluted\n0.03\n0.07\n(58.8)%\nNon-GAAP net income per ADS attributable to New Oriental\n- basic (3)(4)\n0.09\n0.08\n8.1%\nNon-GAAP net income per ADS attributable to New Oriental\n- diluted (3)(4)\n0.09\n0.08\n8.2%\n(in thousands US$, except per ADS (1) data)\n1H FY2018\n1H FY2017\n% of change\nNet revenues\n1,128,348\n875,307\n28.9%\nOperating income\n148,007\n152,798\n(3.1)%\nNon-GAAP operating income (2)(3)\n160,446\n155,844\n3.0%\nNet income attributable to New Oriental\n162,672\n151,422\n7.4%\nNon-GAAP net income attributable to New Oriental (2)(3)\n175,111\n154,468\n13.4%\nNet income per ADS attributable to New Oriental - basic\n1.03\n0.96\n7.0%\nNet income per ADS attributable to New Oriental - diluted\n1.03\n0.96\n7.1%\nNon-GAAP net income per ADS attributable to New Oriental\n- basic (3)(4)\n1.11\n0.98\n12.9%\nNon-GAAP net income per ADS attributable to New Oriental\n- diluted (3)(4)\n1.11\n0.98\n13.0%\n(1) Each ADS represents one common share.\n(2) GAAP represents Generally Accepted Accounting Principles in the United States of America.\n(3) New Oriental provides net income attributable to New Oriental, operating income / (loss) and net income per ADS attributable to New Oriental on a non-GAAP basis that excludes share-based compensation expenses to provide supplemental information regarding its operating performance. For more information on these non-GAAP financial measures, please see the section captioned \"About Non-GAAP Financial Measures\" and the tables captioned \"Reconciliations of Non-GAAP Measures to the Most Comparable GAAP Measures\" set forth at the end of this release.\n(4) The Non-GAAP net income per ADS is computed using Non-GAAP net income and the same number of shares and ADSs used in GAAP basic and diluted EPS calculation.\nOperating Highlights for the Second Fiscal Quarter Ended November 30, 2017\nTotal student enrollments in academic subjects tutoring and test preparation courses increased by 43% year-over-year to approximately 1,877,100 for the second fiscal quarter of 2018. The total number of schools and learning centers was 940 as of November 30, 2017, an increase of 151 compared to 789 as of November 30, 2016, and a net increase of 41 compared to 899 as of August 31, 2017. The total number of schools was 82 as of November 30, 2017.\nMichael Minhong Yu, New Oriental's Executive Chairman, commented, \"We continued to see strong momentum in our key business units for the second quarter of fiscal year 2018 and achieved an accelerated revenue growth of 36.9% year-over-year, exceeding our initial expectation once again. It is also encouraging to see our deferred revenue balance recorded US$1,137.3 million at the end of the quarter, up 48.7% year-over-year. The solid top line growth is mainly driven by student enrollments. Our K-12 all-subjects after-school tutoring business growth was augmented in the second quarter with revenue up approximately 47% and enrollment up approximately 52% year-over-year. Moreover, our U-Can middle and high school all-subjects after-school tutoring business achieved revenue growth of approximately 45% and the revenue of POP Kids program rose approximately 51% year-over-year.\"\nChenggang Zhou, New Oriental's Chief Executive Officer, added, \"Guided by our well-proven 'Optimize the Market' strategy, we are steadily facilitating our capacity expansion across cities with strong growth potential and where we could achieve better operating efficiency. During this quarter, we added a net of 34 learning centers in 19 existing cities and tapped into the cities of Yinchuan, Shaoxing and Huzhou with our dual-teacher model classes implemented in three new schools and three learning centers. In addition, we acquired one kindergarten in Hong Kong, bringing our high-quality preschool education offerings to key cities in China. Altogether, our total square meters of classroom area by the end of this quarter expanded approximately 38% year-over-year. On the other hand, we continued to enhance our online and offline integrated standardized teaching system in the K-12 business with improved customer acquisition and retention, which markedly benefited our results in the second quarter. We also made continued progress in rolling out the standardized teaching system for overseas test preparation business, such as IELTS, TOEFL and SAT programs, in some of the large cities in China. Meanwhile, our pure online education platform, Koolearn.com , obtained year-over-year revenue growth of approximately 59.6%, with a significant rise of approximately 82% for registered users and 23% for paid users. It validates the success of our strategy to acquire and effectively retain customers and expand capacity, and we believe it will help taking more and more market shares and solidify our leadership position.\"\nStephen Zhihui Yang, New Oriental's Chief Financial Officer, commented, \"Despite the fact that the second quarter is traditionally the slowest quarter in the year, we still managed to improve the utilization of facilities compared with last quarter. This helps to lessen the pressure on margins as we continued the investment in capacity expansion and as expected we are on the right track to recover from the impact on the margins in the previous quarter. For the second quarter, the year-over-year decline of gross margin narrowed to 70 basis points from 280 basis points in the previous quarter, while Non-GAAP operating margin declined 150 basis points year-over-year, which is also recovering compared to 390 basis points in the previous quarter. We will continue to make efforts to enhance cost efficiency and improve utilization of facilities to drive the top line and bottom line growth. We still believe margin pressure will gradually lessen over the coming quarters. More importantly, we will increasingly benefit from economies of scale as we continue to push ahead our expansion strategy and work to deliver long-term value for our customers and shareholders.\"\nFinancial Results for the Second Fiscal Quarter Ended November 30, 2017\nNet Revenues\nFor the second fiscal quarter of 2018, New Oriental reported net revenues of US$467.2 million, representing a 36.9% increase year-over-year. Net revenues from educational programs and services for the second fiscal quarter were US$422.6 million, representing a 35.4% increase year-over-year. The growth was mainly driven by increases in student enrollments in K-12 after-school tutoring courses.\nTotal student enrollments in academic subjects tutoring and test preparation courses in the second fiscal quarter of 2018 increased by 43% year-over-year to approximately 1,877,100.\nOperating Costs and Expenses\nOperating costs and expenses for the quarter were US$480.3 million, representing a 40.8% increase year-over-year. Non-GAAP operating costs and expenses for the quarter, which exclude share-based compensation expenses, were US$470.9 million, representing a 39.0% increase year-over-year.\nCost of revenues increased by 39.1% year-over-year to US$227.3 million, primarily due to increases in teachers' compensation for more teaching hours and rental cost for increased number of schools and learning centers in operation. Selling and marketing expenses increased by 38.2% year-over-year to US$72.1 million, primarily due to increases in brand promotion expenses and selling and marketing staff's compensation. General and administrative expenses for the quarter increased by 44.2% year-over-year to US$180.9 million. Non-GAAP general and administrative expenses, which exclude share-based compensation expenses, were US$171.6 million, representing a 39.2% increase year-over-year, primarily due to increased headcount as the Company expanded its network of schools and learning centers, as well as increases in R&D expenses and human resources expenses related to the development of our online and offline integrated education ecosystem.\nIn the second quarter, total share-based compensation expenses, which were allocated to related operating costs and expenses, increased by 330.2% year-over-year to US$9.3 million, due to the grants of a total of 1.5 million restricted share units of the Company to employees and directors in October 2017 with graded vesting over three years.\nOperating Income (Loss) and Operating Margin\nOperating loss was US$13.1 million, compared to an income of US$0.2 million in the same period of the prior fiscal year. Non-GAAP operating loss for the quarter was US$3.8 million, compared to an income of US$2.4 million in the same period of the prior fiscal year.\nOperating margin for the quarter was negative 2.8%, compared to a positive operating margin of 0.1% in the same period of the prior fiscal year. Non-GAAP operating margin, which excludes share-based compensation expenses, for the quarter was negative 0.8%, compared to a positive operating margin of 0.7% in the same period of the prior fiscal year.\nNet Income and EPS\nNet income attributable to New Oriental for the quarter was US$4.3 million, representing a 58.7% decrease from the same period of the prior fiscal year. Basic and diluted earnings per ADS attributable to New Oriental were US$0.03 and US$0.03, respectively.\nNon-GAAP Net Income and Non-GAAP EPS\nNon-GAAP net income attributable to New Oriental for the quarter was US$13.6 million, representing a 8.5% increase from the same period of the prior fiscal year. Non-GAAP basic and diluted earnings per ADS attributable to New Oriental were US$0.09 and US$0.09, respectively.\nCash Flow\nNet operating cash flow for the second fiscal quarter of 2018 was approximately US$168.5 million. Capital expenditures for the quarter were US$45.7 million, which were primarily attributable to the opening of four new schools and 59 learning centers and renovations at existing learning centers.\nBalance Sheet\nAs of November 30, 2017, New Oriental had cash and cash equivalents of US$818.1 million, compared to US$641.0 million as of May 31, 2017. In addition, the Company had US$87.5 million in term deposits and US$1,522.8 million in short-term investment as of November 30, 2017.\nNew Oriental's deferred revenue balance, which is cash collected from registered students for courses and recognized proportionally as revenue as the instructions are delivered, at the end of the second quarter of fiscal year 2018 was US$1,137.3 million, an increase of 48.7% from US$764.7 million in the same period of the prior fiscal year.\nFinancial Results for the Six Months Ended November 30, 2017\nFor the first six months of fiscal year 2018, New Oriental reported net revenues of US$1,128.3 million, representing a 28.9% increase year-over-year.\nTotal student enrollments in academic subjects tutoring and test preparation courses in the first six months of fiscal year 2018 increased by 29.2% to approximately 3,410,000.\nOperating income for the first six months of fiscal year 2018 was US$148.0 million, representing a 3.1% decrease year-over-year. Non-GAAP operating income for the first six months of fiscal year 2018 was US$160.4 million, representing a 3.0% increase year-over-year.\nOperating margin for the first six months of fiscal year 2018 was 13.1%, compared to 17.5% for the same period of the prior fiscal year. Non-GAAP operating margin, which excludes share-based compensation expenses for the first six months of fiscal year 2018, was 14.2%, compared to 17.8% for the same period of the prior fiscal year.\nNet income attributable to New Oriental for the first six months of fiscal year 2018 was US$162.7 million, representing a 7.4% increase year-over-year. Basic and diluted net income per ADS attributable to New Oriental for the first six months of fiscal year 2018 amounted to US$1.03 and US$1.03, respectively.\nNon-GAAP net income attributable to New Oriental for the first six months of fiscal year 2018 was US$175.1 million, representing a 13.4% increase year-over-year. Non-GAAP basic and diluted net income per ADS attributable to New Oriental for the first six months of fiscal year 2018 amounted to US$1.11 and US$1.11, respectively.\nOutlook for Third Quarter of Fiscal Year 2018\nNew Oriental expects total net revenues in the third quarter of fiscal year 2018 (December 1, 2017 to February 28, 2018) to be in the range of US$591.1 million to US$604.2 million, representing a year-over-year growth in the range of 35% to 38%.\nThis forecast reflects New Oriental's current and preliminary view, which is subject to change.\nConference Call Information\nNew Oriental's management will host an earnings conference call at 8 AM on January 23, 2018, U.S. Eastern Time (9 PM on January 23, 2018, Beijing/Hong Kong Time).\nDial-in details for the earnings conference call are as follows:\nUS:\n+1-845-675-0437\nHong Kong:\n+852-3018-6771\nUK:\n+44-20-3621-4779\nPlease dial in 10 minutes before the call is scheduled to begin and provide the passcode to join the call. The passcode is \"New Oriental Earnings Call.\"\nA replay of the conference call may be accessed by phone at the following number until January 31, 2018:\nInternational:\n+61-2-8199-0299\nPasscode:\n3097948\nAdditionally, a live and archived webcast of the conference call will be available at http://investor.neworiental.org .\nAbout New Oriental\nNew Oriental is the largest provider of private educational services in China based on the number of program offerings, total student enrollments and geographic presence. New Oriental offers a wide range of educational programs, services and products consisting primarily of language training and test preparation, primary and secondary school education, online education, content development and distribution, overseas study consulting services, pre-school education and study tour. New Oriental's ADSs, each of which represents one common share, currently trade on the New York Stock Exchange under the symbol \"EDU.\"\nFor more information about New Oriental, please visit http://www.neworiental.org/english/ .\nSafe Harbor Statement\nThis announcement contains forward-looking statements. These statements are made under the \"safe harbor\" provisions of the U.S. Private Securities Litigation Reform Act of 1995. These forward-looking statements can be identified by terminology such as \"will,\" \"expects,\" \"anticipates,\" \"future,\" \"intends,\" \"plans,\" \"believes,\" \"estimates\" and similar statements. Among other things, the outlook for the third quarter of fiscal year 2018, quotations from management in this announcement, as well as New Oriental's strategic and operational plans, contain forward-looking statements. New Oriental may also make written or oral forward-looking statements in its reports filed or furnished to the U.S. Securities and Exchange Commission, in its annual reports to shareholders, in press releases and other written materials and in oral statements made by its officers, directors or employees to third parties. Statements that are not historical facts, including statements about New Oriental's beliefs and expectations, are forward-looking statements. Forward-looking statements involve inherent risks and uncertainties. A number of factors could cause actual results to differ materially from those contained in any forward-looking statement, including but not limited to the following: our ability to attract students without a significant decrease in course fees; our ability to continue to hire, train and retain qualified teachers; our ability to maintain and enhance our \"New Oriental\" brand; our ability to effectively and efficiently manage the expansion of our school network and successfully execute our growth strategy; the outcome of ongoing, or any future, litigation or arbitration, including those relating to copyright and other intellectual property rights; competition in the private education sector in China; changes in our revenues and certain cost or expense items as a percentage of our revenues; the expected growth of the Chinese private education market; Chinese governmental policies relating to private educational services and providers of such services; health epidemics and other outbreaks in China; and general economic conditions in China. Further information regarding these and other risks is included in our annual report on Form 20-F and other documents filed with the Securities and Exchange Commission. New Oriental does not undertake any obligation to update any forward-looking statement, except as required under applicable law. All information provided in this press release and in the attachments is as of the date of this press release, and New Oriental undertakes no duty to update such information, except as required under applicable law.\nAbout Non-GAAP Financial Measures\nTo supplement New Oriental's consolidated financial results presented in accordance with GAAP, New Oriental uses the following measures defined as non-GAAP financial measures by the SEC: net income excluding share-based compensation expenses, operating income excluding share-based compensation expenses, operating costs and expenses excluding share-based compensation expenses, general and administrative expenses excluding share-based compensation expenses, operating margin excluding share-based compensation expenses, and basic and diluted net income per ADS and per share excluding share-based compensation expenses. The presentation of these non-GAAP financial measures is not intended to be considered in isolation or as a substitute for the financial information prepared and presented in accordance with GAAP. For more information on these non-GAAP financial measures, please see the tables captioned \"Reconciliations of non-GAAP measures to the most comparable GAAP measures\" set forth at the end of this release.\nNew Oriental believes that these non-GAAP financial measures provide meaningful supplemental information regarding its performance and liquidity by excluding share-based compensation expenses that may not be indicative of its operating performance from a cash perspective. New Oriental believes that both management and investors benefit from referring to these non-GAAP financial measures in assessing its performance and when planning and forecasting future periods. These non-GAAP financial measures also facilitate management's internal comparisons to New Oriental's historical performance and liquidity. New Oriental computes its non-GAAP financial measures using the same consistent method from quarter to quarter. New Oriental believes these non-GAAP financial measures are useful to investors in allowing for greater transparency with respect to supplemental information used by management in its financial and operational decision making. A limitation of using these non-GAAP measures is that they exclude share-based compensation charge that has been and will continue to be for the foreseeable future a significant recurring expense in our business. Management compensates for these limitations by providing specific information regarding the GAAP amounts excluded from each non-GAAP measure. The accompanying tables have more details on the reconciliations between GAAP financial measures that are most directly comparable to non-GAAP financial measures.\nContacts\nFor investor and media inquiries, please contact:\nMs. Cara O'Brien\nFTI Consulting\nTel: +852-3768-4537\nEmail: cara.obrien@fticonsulting.com\nMs. Sisi Zhao\nNew Oriental Education and Technology Group Inc.\nTel: +86-10-6260-5568\nEmail: zhaosisi@xdf.cn\nNEW ORIENTAL EDUCATION & TECHNOLOGY GROUP INC.\nCONDENSED CONSOLIDATED BALANCE SHEETS\n(In thousands)\nAs of November 30\nAs of May 31\n2017\n2017\n(Unaudited)\n(Audited)\nUSD\nUSD\nASSETS:\nCurrent assets:\nCash and cash equivalents\n818,138\n641,018\nRestricted cash, current\n44\n44\nTerm deposits\n87,473\n195,085\nShort term investments\n1,522,787\n1,312,942\nAccounts receivable, net\n4,539\n3,343\nInventory, net\n34,775\n31,742\nPrepaid expenses and other current assets, net\n188,049\n119,397\nAmounts due from related parties, current\n1,636\n5,948\nLong term investments due within one year\n-\n16,743\nTotal current assets\n2,657,441\n2,326,262\nProperty and equipment, net\n365,016\n282,800\nLand use rights, net\n3,725\n3,668\nAmounts due from related parties, non-current\n1,592\n1,748\nDeferred tax assets, net\n26,579\n28,858\nLong term deposit\n32,770\n24,023\nLong term prepaid rent\n256\n849\nRestricted cash, non-current\n3,346\n3,608\nIntangible assets, net\n7,876\n4,005\nGoodwill, net\n29,225\n14,083\nLong term investments, net\n242,099\n217,259\nOther non-current assets\n7,146\n17,816\nTotal assets\n3,377,071\n2,924,979\nLIABILITIES AND EQUITY\nCurrent liabilities:\nAccounts payable (including accounts payable of the consolidated\nVIE without recourse to New Oriental of US$24,138 and\nUS$33,917 as of May 31, 2017 and November 30, 2017, respectively)\n34,292\n24,258\nAccrued expenses and other current liabilities (including accrued\nexpenses and other current liabilities of the consolidated VIE\nwithout recourse to New Oriental of US$238,864 and US$245,284\nas of May 31, 2017 and November 30, 2017, respectively)\n280,993\n260,700\nIncome taxes payable (including income tax payable of the\nconsolidated VIE without recourse to New Oriental of US$40,306\nand US$48,393 as of May 31, 2017 and November 30, 2017, respectively)\n54,423\n51,045\nAmounts due to related parties (including amounts due to related\nparties of the consolidated VIE without recourse to New Oriental of\nUS$48 and US$17 as of May 31, 2017 and November 30, 2017, respectively)\n17\n48\nDeferred revenue (including deferred revenue of the consolidated\nVIE without recourse to New Oriental of US$833,932 and\nUS$1,131,694 as of May 31, 2017 and November 30, 2017,\nrespectively)\n1,137,304\n866,630\nTotal current liabilities\n1,507,029\n1,202,681\nDeferred tax liabilities (including deferred tax liabilities of the\nconsolidated VIE without recourse to New Oriental of US$2,174\nand US$3,558 as of May 31, 2017 and November 30, 2017,\nrespectively)\n3,734\n2,220\nTotal long-term liabilities\n3,734\n2,220\nTotal liabilities\n1,510,763\n1,204,901\nNoncontrolling interests\n45,225\n39,130\nTotal New Oriental Education & Technology Group Inc. shareholders'\nequity\n1,821,083\n1,680,948\nTotal shareholders' equity\n1,866,308\n1,720,078\nTotal liabilities and shareholders' equity\n3,377,071\n2,924,979\nNEW ORIENTAL EDUCATION & TECHNOLOGY GROUP INC.\nCONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS\n(In thousands except for per share and per ADS amounts)\nFor the Three Months Ended November 30\n2017\n2016\n(Unaudited)\n(Unaudited)\nUSD\nUSD\nNet Revenues:\nEducational programs and services\n422,606\n312,193\nBooks and others\n44,577\n29,045\nTotal net revenues\n467,183\n341,238\nOperating costs and expenses (note 1):\nCost of revenues\n227,258\n163,408\nSelling and marketing\n72,091\n52,172\nGeneral and administrative\n180,904\n125,444\nTotal operating costs and expenses\n480,253\n341,024\nOperating (Loss) Income :\n(13,070)\n214\nOther income, net\n23,578\n15,884\nProvision for income taxes\n(2,973)\n(2,870)\nIncome (Loss) from equity method investments\n224\n(846)\nNet income\n7,759\n12,382\nNet gain attributable to the noncontrolling interests\n(3,480)\n(2,022)\nNet income attributable to New Oriental Education &\nTechnology Group Inc.\n4,279\n10,360\nNet income per share attributable to New Oriental-Basic\n0.03\n0.07\nNet income per share attributable to New Oriental-Diluted\n0.03\n0.07\nNet income per ADS attributable to New Oriental-Basic\n(note 2)\n0.03\n0.07\nNet income per ADS attributable to New Oriental-Diluted\n(note 2)\n0.03\n0.07\nNEW ORIENTAL EDUCATION & TECHNOLOGY GROUP INC.\nRECONCILIATION OF NON-GAAP MEASURES TO THE MOST COMPARABLE GAAP MEASURES\n(In thousands except for per share and per ADS amounts)\nFor the Three Months Ended November 30\n2017\n2016\n(Unaudited)\n(Unaudited)\nUSD\nUSD\nGeneral and administrative expenses\n180,904\n125,444\nShare-based compensation expense in general\nand administrative expenses\n(9,313)\n(2,165)\nNon-GAAP general and administrative expenses\n171,591\n123,279\nTotal operating costs and expenses\n480,253\n341,024\nShare-based compensation expenses\n(9,313)\n(2,165)\nNon-GAAP operating costs and expenses\n470,940\n338,859\nOperating (loss) income\n(13,070)\n214\nShare-based compensation expenses\n9,313\n2,165\nNon-GAAP operating (loss) income\n(3,757)\n2,379\nOperating margin\n-2.8%\n0.1%\nNon-GAAP operating margin\n-0.8%\n0.7%\nNet income attributable to New Oriental\n4,279\n10,360\nShare-based compensation expenses\n9,313\n2,165\nNon-GAAP net income\n13,592\n12,525\nNet income per ADS attributable to New\nOriental- Basic (note 2)\n0.03\n0.07\nNet income per ADS attributable to New\nOriental- Diluted (note 2)\n0.03\n0.07\nNon-GAAP net income per ADS attributable to\nNew Oriental - Basic (note 2)\n0.09\n0.08\nNon-GAAP net income per ADS attributable to\nNew Oriental - Diluted (note 2)\n0.09\n0.08\nWeighted average shares used in calculating\nbasic net income per ADS (note 2)\n158,119,910\n157,470,996\nWeighted average shares used in calculating\ndiluted net income per ADS (note 2)\n158,322,404\n157,865,564\nNon-GAAP income per share - basic\n0.09\n0.08\nNon-GAAP income per share - diluted\n0.09\n0.08\nNotes:\nNote 1: Share-based compensation expenses (in thousands) are included in the\noperating costs and expenses as follows:\nFor the Three Months Ended November 30\n2017\n2016\n(Unaudited)\n(Unaudited)\nUSD\nUSD\nGeneral and administrative\n9,313\n2,165\nTotal\n9,313\n2,165\nNote 2: Each ADS represents one common share.\nNEW ORIENTAL EDUCATION & TECHNOLOGY GROUP INC.\nCONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS\n(In thousands except for per share and per ADS amounts)\nFor the Six Months Ended November 30\n2017\n2016\n(Unaudited)\n(Unaudited)\nUSD\nUSD\nNet Revenues:\nEducational programs and services\n1,027,077\n806,500\nBooks and others\n101,271\n68,807\nTotal net revenues\n1,128,348\n875,307\nOperating costs and expenses (note 1):\nCost of revenues\n497,452\n366,778\nSelling and marketing\n145,994\n110,637\nGeneral and administrative\n336,895\n245,094\nTotal operating costs and expenses\n980,341\n722,509\nOperating income :\n148,007\n152,798\nOther income, net\n48,511\n29,931\nProvision for income taxes\n(29,851)\n(25,581)\nIncome(Loss) from equity method investments\n249\n(2,683)\nNet income\n166,916\n154,465\nNet gain attributable to the noncontrolling interests\n(4,244)\n(3,043)\nNet income attributable to New Oriental Education &\nTechnology Group Inc.\n162,672\n151,422\nNet income per share attributable to New Oriental-Basic\n1.03\n0.96\nNet income per share attributable to New Oriental-Diluted\n1.03\n0.96\nNet income per ADS attributable to New Oriental-Basic\n(note 2)\n1.03\n0.96\nNet income per ADS attributable to New Oriental-Diluted\n(note 2)\n1.03\n0.96\nNEW ORIENTAL EDUCATION & TECHNOLOGY GROUP INC.\nRECONCILIATION OF NON-GAAP MEASURES TO THE MOST COMPARABLE GAAP MEASURES\n(In thousands except for per share and per ADS amounts)\nFor the Six Months Ended November 30\n2017\n2016\n(Unaudited)\n(Unaudited)\nUSD\nUSD\nGeneral and administrative expenses\n336,895\n245,094\nShare-based compensation expense in\ngeneral and administrative expenses\n(12,439)\n(3,046)\nNon-GAAP general and administrative\nexpenses\n324,456\n242,048\nTotal operating costs and expenses\n980,341\n722,509\nShare-based compensation expenses\n(12,439)\n(3,046)\nNon-GAAP operating costs and expenses\n967,902\n719,463\nOperating income\n148,007\n152,798\nShare-based compensation expenses\n12,439\n3,046\nNon-GAAP operating income\n160,446\n155,844\nOperating margin\n13.1%\n17.5%\nNon-GAAP operating margin\n14.2%\n17.8%\nNet income attributable to New Oriental\n162,672\n151,422\nShare-based compensation expenses\n12,439\n3,046\nNon-GAAP net income\n175,111\n154,468\nNet income per ADS attributable to New\nOriental- Basic (note 2)\n1.03\n0.96\nNet income per ADS attributable to New\nOriental- Diluted (note 2)\n1.03\n0.96\nNon-GAAP net income per ADS attributable to\nNew Oriental - Basic (note 2)\n1.11\n0.98\nNon-GAAP net income per ADS attributable to\nNew Oriental - Diluted (note 2)\n1.11\n0.98\nWeighted average shares used in\ncalculating basic net income per ADS\n(note 2)\n158,051,290\n157,459,296\nWeighted average shares used in\ncalculating diluted net income per ADS\n(note 2)\n158,277,981\n157,847,481\nNon-GAAP income per share - basic\n1.11\n0.98\nNon-GAAP income per share - diluted\n1.11\n0.98\nNotes:\nNote 1: Share-based compensation expenses (in thousands) are included in the\noperating costs and expenses as follows:\nFor the Six Months Ended November 30\n2017\n2016\n(Unaudited)\n(Unaudited)\nUSD\nUSD\nGeneral and administrative\n12,439\n3,046\nTotal\n12,439\n3,046\nNote 2: Each ADS represents one common share.\nView original content: http://www.prnewswire.com/news-releases/new-oriental-announces-results-for-the-second-fiscal-quarter-ended-november-30-2017-300586516.html\nSOURCE New Oriental Education and Technology Group Inc.", "external_links": ["http://www.neworiental.org/english/", "http://www.prnewswire.com/news-releases/new-oriental-announces-results-for-the-second-fiscal-quarter-ended-november-30-2017-300586516.html", "http://investor.neworiental.org/"], "published": "2018-01-23T11:03:00.000+02:00", "crawled": "2018-01-23T11:58:37.002+02:00", "highlightTitle": ""}