{"organizations": [], "uuid": "f9f1e579edb3ebd3b855aa09406c699f0f88dfc6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKCricketNews", "section_title": "Reuters: Cricket News", "url": "https://uk.reuters.com/article/cricket-ashes-khawaja/cricket-seven-years-after-that-37-khawaja-finally-gets-his-ashes-ton-idUKL4N1P1052", "country": "US", "domain_rank": 408, "title": "Cricket-Seven years after 'that' 37, Khawaja finally gets his Ashes ton", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T10:58:00.000+02:00", "replies_count": 0, "uuid": "f9f1e579edb3ebd3b855aa09406c699f0f88dfc6"}, "author": "", "url": "https://uk.reuters.com/article/cricket-ashes-khawaja/cricket-seven-years-after-that-37-khawaja-finally-gets-his-ashes-ton-idUKL4N1P1052", "ord_in_thread": 0, "title": "Cricket-Seven years after 'that' 37, Khawaja finally gets his Ashes ton", "locations": [], "entities": {"persons": [{"name": "khawaja", "sentiment": "negative"}, {"name": "usman khawaja", "sentiment": "none"}, {"name": "nick mulvenney", "sentiment": "none"}], "locations": [{"name": "sydney", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 6, 2018 / 9:00 AM / Updated 7 hours ago Cricket-Seven years after 'that' 37, Khawaja finally gets his Ashes ton Nick Mulvenney 3 Min Read \nSYDNEY, Jan 6 (Reuters) - Seven years after Usman Khawaja was pronounced the saviour of Australian cricket when he scored a stylish 37 on debut, the 31-year-old finally notched up his first Ashes century on Saturday. \nIn 2011 at the Sydney Cricket Ground, with the hosts heading for an innings defeat and 3-1 Ashes series loss, his elegant strokes were a light in a very dark sky for Australia. \nAlthough he has not always been able to live up to the high expectations aroused by that innings, on Saturday he was a batsman at the very top of his game as he notched up 171 runs to put Australia on course for a 4-0 series triumph. \nThe fist pump with which he celebrated reaching the milestone was a rare public display of emotion and a clear indication that he had achieved a lifelong ambition. \n“I’ve said a few times, that 37 was a bit embarrassing. There was a lot of carry on for a 37,” the quietly spoken 31-year-old recalled. \n“Playing in the Ashes was a dream. Did that. Winning an Ashes was a dream. We won. Scoring a hundred in the Ashes has always been something I always wanted to do. I’ve done that now too.” \nTest cricket has not always been kind to the left-hander, who has been dropped and recalled from the team several times with questions raised over his ability to play spin and his work ethic. \nSo while captain Steve Smith played his fifth test that January day in 2011 and has now racked up 61, Khawaja has managed less than half that number. \n”It’s disappointing,“ Khawaja said of the criticism. ”When I am scoring runs, I‘m elegant and when I‘m not scoring runs I‘m lazy. I can’t seem to win, when things aren’t going well. \n”It’s disappointing to hear but it’s something I have dealt with throughout my career. When I play nothing really changes for me. I go out there and try and score runs every single time. \n“Sometimes the game feels really simple and easy and other times it is a bit of a grind. That’s the way it is.” \nA move to Queensland couple of years ago helped revive his international career but it was still particularly pleasurable to finally get a test hundred in front of his family and friends in Sydney. \n“The SCG was where I grew up playing cricket for New South Wales and an Ashes century is something I have wanted for a long time and I haven’t been able to achieve, so it was very satisfying,” he said. \nAs for the future, Khawaja is hoping to continue scoring runs to secure his place in the test side, both at home and abroad. \n“I love playing for Australia every single test match, every chance I get,” he said. \n”All I can do is try and go out there and score runs for my team and do well in the top order. \n“I like to be playing every single game, but you can’t look too far ahead either.” (Editing by Sudipto Ganguly)", "external_links": [], "published": "2018-01-06T10:58:00.000+02:00", "crawled": "2018-01-06T11:28:16.004+02:00", "highlightTitle": ""}