{"organizations": [], "uuid": "fe9edc2b5c4afd213ac174fb5ff90f095efa9e61", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-northrim-bancorp-earns-13-point-2-million-or-1-point-88-per-diluted-share-in-2017-gain-from-sale-of-subsidiary-revaluation.html", "country": "US", "domain_rank": 767, "title": "Northrim BanCorp Earns $13.2 million, or $1.88 per Diluted Share, in 2017 Gain from Sale of Subsidiary, Revaluation of Deferred Tax Assets, and Other Non-Operating Items Impact Profits", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T00:15:00.000+02:00", "replies_count": 0, "uuid": "fe9edc2b5c4afd213ac174fb5ff90f095efa9e61"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-northrim-bancorp-earns-13-point-2-million-or-1-point-88-per-diluted-share-in-2017-gain-from-sale-of-subsidiary-revaluation.html", "ord_in_thread": 0, "title": "Northrim BanCorp Earns $13.2 million, or $1.88 per Diluted Share, in 2017 Gain from Sale of Subsidiary, Revaluation of Deferred Tax Assets, and Other Non-Operating Items Impact Profits", "locations": [], "entities": {"persons": [{"name": "joe schierhorn", "sentiment": "none"}], "locations": [{"name": "anchorage", "sentiment": "none"}, {"name": "ala.", "sentiment": "none"}], "organizations": [{"name": "sale of subsidiary", "sentiment": "neutral"}, {"name": "northrim bancorp", "sentiment": "neutral"}, {"name": "northrim", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ANCHORAGE, Ala., Jan. 29, 2018 (GLOBE NEWSWIRE) -- Northrim BanCorp, Inc. (NASDAQ:NRIM) (“Northrim” or the \"Company\") today reported profits for both the fourth quarter and full year in 2017. Net income attributable to the Company (\"net income\") was $13.2 million, or $1.88 per diluted share, in 2017, compared to $14.4 million, or $2.06 per diluted share, in 2016. In the fourth quarter of 2017, Northrim's net income was $214,000, or $0.03 per diluted share compared to $5.5 million, of $0.79 per diluted share in the preceding quarter and $3.6 million, or $0.51 per diluted share, in the fourth quarter of 2016. Net income was reduced by $0.16 per share in 2017 and by $0.41 per share in 2016 due to a number of one-time or non-operating items, detailed in the table below.\n“We recorded additional tax expense of $2.7 million, or $0.39 per diluted share, due to the downward revision to our net deferred tax asset (\"DTA\") value in the fourth quarter of 2017 to comply with the recently enacted federal tax legislation,” said Joe Schierhorn, President and CEO. “Going forward, we expect we will recoup this write-down in approximately one year, reflecting the lower tax rates effective in 2018. We believe our effective tax rate will decline to between 19% and 20% from 32% in 2017 (excluding the fourth quarter 2017 DTA charge), and that earnings will increase between 15% and 16% based on the 21% top tax rate applicable to earnings in 2018 and beyond.”\nSeveral items impacted the quarterly and full year comparisons including:\nThe revaluation of the DTA reduced net income by $2.7 million, or $0.39 per diluted share, in the fourth quarter of 2017. The sale of Northrim’s interest in Northrim Benefits Group (NBG) contributed $4.4 million pretax and $2.6 million after tax, or $0.38 per diluted share, to both third quarter and full year 2017 net income. NBG contributed revenues of $2.5 million in 2017, $609,000 in the third quarter of 2017, and $871,000 in the fourth quarter of 2016. There was no fourth quarter 2017 provision for loan losses compared to $2.5 million recorded in the third quarter of 2017 and $743,000 in the fourth quarter a year ago. In 2017, the provision for loan losses was $3.2 million compared to $2.3 million in 2016. The increase in the provision for loan losses in 2017 is the result of the increase in nonperforming loans and an increase in the specific allowance for impaired loans of $352,000 in 2017. The conversion to a new core banking system was successfully completed in May of 2017. The conversion added one-time costs of $943,000, or $0.14 per diluted share in 2017 and $179,000, or $0.03 per diluted share in the third quarter of 2017. The third quarter of 2016 includes a non-cash, one-time accounting correction which resulted in an increase in expenses, net of tax, of $1.4 million, or $0.20 per diluted share due to a change in accounting treatment for the earn-out payments associated with the Company's 2014 acquisition of Residential Mortgage, LLC (\"RML\"). In the fourth quarter of 2017, the Company wrote down the carrying value of its minority ownership interest in another mortgage origination business owned by RML by $686,000, or $404,000 after tax, or $0.06 per diluted share.\nThe following tables summarize one-time and other non-operating items for the periods presented:\nThree Months Ended (Dollars in thousands, except per share data) December 31, 2017 September 30, 2017 June 30, 2017 March 31, 2017 December 31, 2016 Net income attributable to Northrim BanCorp $ 214 $ 5,523 $ 3,589 $ 3,825 $ 3,590 Impact of one-time and other non-operating items: Gain on sale of Northrim Benefits Group (2 ) (4,443 ) — — — Core conversion costs — 179 633 131 — Writedown minority interest in equity method investment 686 — — — — Compensation expense, net RML acquisition payments (193 ) 149 — 174 708 Provision for income taxes related to above one-time items (202 ) 1,692 (260 ) (125 ) (291 ) Provision for income taxes, change in DTA valuation 2,678 — — — — Operating net income * $ 3,181 $ 3,100 $ 3,962 $ 4,005 $ 4,007 Average diluted shares 6,963,125 6,959,035 6,997,727 6,993,726 6,983,771 Operating diluted earnings per share * $ 0.46 $ 0.45 $ 0.57 $ 0.57 $ 0.57\nYear-to-date (Dollars in thousands, except per share data) December 31, 2017 December 31, 2016 One Year % Change Net income attributable to Northrim BanCorp $ 13,151 $ 14,411 -9 % Impact of one-time and other non-operating items: Gain on sale of Northrim Benefits Group (4,445 ) — NM Core conversion costs 943 — NM Writedown minority interest in equity method investment 686 — NM Compensation expense, net RML acquisition payments 130 4,775 -97 % Provision for income taxes related to above items 1,104 (1,963 ) Provision for income taxes, change in DTA valuation 2,678 — Operating net income * $ 14,247 $ 17,223 -17 % Average diluted shares 6,977,910 6,974,864 — % Operating diluted earnings per share * $ 2.04 $ 2.47 -17 %\nOther highlights for the fourth quarter and full year in 2017 include the following:\nThe allowance for loan losses was $21.5 million at December 31, 2017, which equates to 100% of total nonperforming loans at December 31, 2017. The Company repurchased 58,341 shares of its common stock in the third quarter of 2017 at an average price of $27.56, leaving 168,901 shares available under the previously announced repurchase authorization. Northrim redeemed $8.0 million in junior subordinated debt held at Northrim Capital Trust 1. This liability bore interest at a floating rate of 90-day LIBOR plus 3.15%, or 4.33% at the time it was redeemed, and had a final maturity of May 15, 2033. In 2016, total interest expense on this debt was $310,000. Interest expense on this debt in 2017 through the date of redemption on August 15, 2017 was $212,000. This redemption decreased Tier 1 Capital to Risk Adjusted Assets and Total Capital to Risk Adjusted Assets by 62 basis points each. An interest rate swap executed in September 2017 effectively converts the floating rate of interest on the remaining $10.0 million in outstanding junior subordinated debt from 90-day LIBOR plus 1.37%, or 2.96% as of December 31, 2017, to a fixed rate of 3.72% through the junior subordinated debt's final maturity date of March 15, 2036.\n“In addition to increasing cash dividends to shareholders, we plan to invest future tax savings in infrastructure, enhanced employee benefits, and additions to our branch network in 2018,” Schierhorn said. “We are also introducing new products and services to better meet the needs of our customers, by leveraging the improved features of our new core operating system. And, we are expanding our expertise in several areas by hiring team members with experience in lending, technology, and financial management. While the economic recession in Alaska continues to reduce employment statewide, the rate of job losses is expected to be slower in 2018 than it was in either 2017 or 2016. While, growth of loans and deposits remains a challenge, we believe that these planned investments will position us to grow through increased market share.”\nFinancial Highlights Three Months Ended (Dollars in thousands, except per share data) December 31, 2017 September 30, 2017 June 30, 2017 March 31, 2017 December 31, 2016 Total assets $ 1,519,109 $ 1,523,341 $ 1,493,205 $ 1,512,580 $ 1,526,540 Total portfolio loans $ 955,667 $ 989,253 $ 991,209 $ 960,832 $ 975,015 Average portfolio loans $ 980,351 $ 1,003,751 $ 969,051 $ 970,493 $ 977,678 Total deposits $ 1,258,283 $ 1,258,317 $ 1,234,310 $ 1,247,073 $ 1,267,653 Average deposits $ 1,254,566 $ 1,262,808 $ 1,244,583 $ 1,230,947 $ 1,265,214 Total shareholders' equity $ 192,802 $ 194,427 $ 191,777 $ 189,452 $ 186,712 Net income attributable to Northrim BanCorp $ 214 $ 5,523 $ 3,589 $ 3,825 $ 3,590 Operating net income * $ 3,181 $ 3,100 $ 3,962 $ 4,005 $ 4,007 Diluted earnings per share $ 0.03 $ 0.79 $ 0.51 $ 0.55 $ 0.51 Operating diluted earnings per share * $ 0.46 $ 0.45 $ 0.57 $ 0.57 $ 0.57 Return on average assets 0.06 % 1.44 % 0.96 % 1.04 % 0.94 % Operating return on average assets * 0.83 % 0.81 % 1.05 % 1.09 % 1.05 % Return on average shareholders' equity 0.43 % 11.25 % 7.43 % 8.30 % 7.96 % Operating return on average shareholders' equity * 6.40 % 6.32 % 8.21 % 8.69 % 8.88 % Net interest margin (\"NIM\") 4.25 % 4.28 % 4.20 % 4.15 % 4.01 % Tax equivalent NIM * 4.31 % 4.34 % 4.26 % 4.22 % 4.07 % Efficiency ratio 80.92 % 61.31 % 76.95 % 72.95 % 75.57 % Operating efficiency ratio * 78.74 % 71.26 % 74.36 % 71.62 % 72.65 % Total shareholders' equity/total assets 12.69 % 12.76 % 12.84 % 12.53 % 12.23 % Tangible common equity/tangible assets * 11.75 % 11.82 % 11.88 % 11.57 % 11.28 % Book value per share $ 28.06 $ 28.37 $ 27.75 $ 27.42 $ 27.07 Tangible book value per share * $ 25.70 $ 26.00 $ 25.40 $ 25.06 $ 24.70 Dividends per share $ 0.22 $ 0.22 $ 0.21 $ 0.21 $ 0.20 * References to operating net income, operating diluted earnings per share, operating return on average assets, operating return on average shareholders' equity, tax equivalent NIM, operating efficiency ratio, tangible book value per share, tangible common equity and tangible assets (all of which exclude intangible assets) represent non-GAAP financial measures. Management has presented these non-GAAP measurements in this earnings release, because it believes these measures are useful to investors. See the end of this release for reconciliations of these non-GAAP financial measures to GAAP financial measures.\nTotal revenue, which includes net interest income plus other operating income, was $22.6 million in the fourth quarter of 2017, compared to $28.8 million in the third quarter of 2017, and $24.3 million in the same period a year ago. For the full year in 2017, total revenues were $98.2 million compared to $99.6 million in 2016.\n• Community Banking contributed 75% to total revenues and 92% to net income in 2017.\n• Home Mortgage Lending contributed 25% to total revenues and 8% of net income in 2017. Net interest income in the fourth quarter of 2017 increased 6% to $14.7 million as compared to $13.9 million in the year ago quarter, mainly as a result of a change in the mix of assets, and was down 2% from $14.9 million in the preceding quarter due to a change in the mix of assets and a decline in average interest-earning assets. Both net interest margin (\"NIM\") at 4.25% and net interest margin on a tax equivalent basis (\"NIMTE\") * at 4.31% increased in the fourth quarter of 2017, compared to 4.01% and 4.07%, respectively, in the fourth quarter of 2016, primarily due to an improved mix of assets in the current quarter. The Company's NIMTE * remains above peer averages 1 . Northrim paid a quarterly cash dividend of $0.22 per share in December 2017, up from the $0.20 per share dividend paid in December 2016. The dividend provides an annual yield of approximately 2.6% at current market share prices. Book value per share increased 3.7% to $28.06 at the end of the fourth quarter of 2017 from $27.07 a year ago, while tangible book value per share * increased 4.0% to $25.70 at the end of the fourth quarter of 2017 from $24.70 a year ago. At year end, total non-performing assets, net of government guarantees increased to $28.7 million, or 1.89% of assets, compared to $26.2 million, or 1.72% of assets, at September 30, 2017 and $19.3 million, or 1.27% of assets a year ago. Total adversely classified loans remained consistent at $33.8 million at year end 2017, compared to $33.8 million at September 30, 2017 and decreased slightly from $35.6 million a year ago. Following net charge-offs of $1.4 million in 2017, the allowance for loan losses to portfolio loans grew to 2.25% at year end, compared to 2.02% a year ago. Northrim remains well-capitalized with Tier 1 Capital to Risk Adjusted Assets of 14.65%, total shareholders' equity to total assets of 12.69%, and tangible common equity to tangible assets * of 11.75% at December 31, 2017.\n1 As of September 30, 2017, the SNL US Bank Index tracked 150 banks with assets between $1 billion and $5 billion with averages for the following ratios: NIM (tax equivalent) 3.69%, loan loss reserves to gross loans of 0.95%, return on average assets (ROAA) 1.01%, and return on average equity (ROAE) 9.31%.\nAlaska Economic Update\n(Note: sources for information included in this section are included on page 13.)\n“Alaska is expected to lose jobs again in 2018, although the losses appear to be tapering. Total employment is forecasted to decline by 0.5% in 2018 (-1,800 jobs) after falling 1.1% in 2017 and 1.9% in 2016,” said Karinne Wiebold of the Alaska Department of Labor and Workforce Development. “Losses were deepest in 2016 when the state’s economy shed 6,300 jobs, primarily in oil and gas and in state government. Then in 2017, Alaska lost an estimated 3,600 jobs. If it hadn’t been for strong health care growth, the overall job loss would have been deeper. If employment follows the forecasted pattern this year, that would put Alaska’s total loss from 2015 through 2018 at 11,700 jobs (-3.5 %).”\nPreliminary seasonally adjusted unemployment in December was 7.3% compared to 4.1% for the United States. Not seasonally adjusted unemployment in Alaska in December was also 7.3%, up from 7.1% in November compared to 3.9% for the nation, placing Alaska at 50th in the country for both unemployment and job growth. However, Alaska’s ranking rose to 8th on per capita personal income, and also improved to 8th for average hourly earnings in the leisure and hospitality sectors in November 2017.\nThroughput in the Trans Alaska Pipeline System increased in 2017, marking the second straight year-over-year increase in volume of oil transported following thirteen years of declining volume. “More oil flowing through TAPS means a safer, more efficient and more sustainable pipeline system,” said Tom Barrett, Alyeska President. “Increased throughput also signals a stronger economy for Alaska and more opportunities for Alaskans.”\n“This winter will be the biggest exploration drilling program that ConocoPhillips, formerly Alaska’s top explorer, has conducted on the North Slope since 2002,” said Joe Marushack, ConocoPhillips Alaska President.\n“The increase in drilling activity this winter is a good sign for the long-term health of the Alaska economy, bringing high-paying jobs and new tax revenues for the state and local communities,” said Schierhorn.\nNorthrim Bank sponsors the Alaskanomics blog to provide news, analysis, and commentary on Alaska’s economy. Join the conversation at Alaskanomics.com , or for more information on the Alaska economy, visit: www.northrim.com and click on the “Business Banking” link and then click “Learn”. Information from our website is not incorporated into, and does not form a part of this press release.\nReview of Income Statement\nConsolidated Income Statement\nIn the fourth quarter of 2017, Northrim generated return on average assets (\"ROAA\") of 0.06% and a return on average equity (\"ROAE\") of 0.43%, compared to 0.94% and 7.96%, respectively in the fourth quarter of 2016. Excluding the one-time and other non-operating items detailed above, ROAA * was 0.83% and ROAE * was 6.40% in the fourth quarter of 2017. These results were below the average 1.01% ROAA and the 9.31% ROAE posted by the 150 banks that make up the SNL U.S. Bank Index with assets between $1 billion and $5 billion as of September 30, 2017. NIM and NIMTE* for the fourth quarter of 2017 were 4.25% and 4.31%, respectively, compared to 3.69% NIMTE* for the index peers 1 .\nFor the full year in 2017, ROAA was 0.87% and ROAE was 6.81%, compared to 0.96% and 7.93%, respectively, for 2016. Excluding the one-time and other non-operating items detailed above, ROAA * was 0.94% and ROAE * was 7.38% for 2017 compared to 1.14% and 9.48%, respectively, in 2016. The decline in these ratios is primarily due to lower net income from the Home Mortgage Lending segment and the increase in the provision for loan losses.\nNet Interest Income/Net Interest Margin\nNet interest income grew 6% to $14.7 million in the fourth quarter of 2017 compared to $13.9 million in the fourth quarter of 2016 and was down 2% from $14.9 million in the third quarter of 2017. For the full year in 2017, net interest income increased 2% to $57.7 million from $56.4 million in 2016.\nHigher total interest income, coupled with lower total interest expense, contributed to the increases in net interest income and NIMTE* in the fourth quarter and for the full year compared to the same periods in 2016 primarily due to a higher yield on interest-earning assets. Net interest income and NIMTE* declined in the fourth quarter of 2017 compared to the third quarter of 2017 primarily due to lower average earning-asset balances and a less favorable mix. The cost of funds declined in the fourth quarter compared to the preceding quarter and compared to the same quarter last year, and also declined for the full year 2017 compared to 2016.\nNIMTE * was 4.31% in the fourth quarter of 2017 compared to 4.34% in the preceding quarter and 4.07% from the same quarter a year ago. For 2017, NIMTE * improved to 4.28% from 4.20% in 2016. The following table summarizes the components of these changes:\n4Q17 vs. 3Q17 4Q17 vs. 4Q16 Nonaccrual interest adjustments 0.01 % 0.04 % Interest rates and loan fees 0.02 % 0.19 % Volume and mix of interest-earning assets (0.06 )% 0.01 % Change in NIMTE* (0.03 )% 0.24 %\nYTD17 vs.YTD16 Nonaccrual interest adjustments — % Interest rates and loan fees 0.08 % Volume and mix of interest-earning assets — % Change in NIMTE* 0.08 % “The repayment of one of our higher-cost floating rate liabilities, completed in August of this year, is expected to reduce interest expense going forward by at least $300,000 per year, and the impact is higher in the future if interest rates continue to rise,” said Jed Ballard, Chief Financial Officer. “We believe the elimination of this interest expense will help to sustain or improve NIM in the coming quarters.\"\n“We expect NIM will continue to increase in 2018 to 4.40% and NIMTE * to increase to approximately 4.45% in 2018, as we anticipate that interest rates will continue to rise, and that our earning assets will continue to reprice higher throughout the year. Our investment portfolio has an average duration of 1.9 years, with approximately $160 million in securities either maturing or repricing in 2018,\" Ballard continued.\nProvision for Loan Losses\nThere was no provision for loan losses in the fourth quarter of 2017 primarily due to decreases in portfolio loans, nonperforming loans, and the portion of the allowance specific to impaired loans, which decreased by $548,000 in the third quarter. The decrease in the reserve on impaired loans is the result of principal pay downs on several impaired loans, and the receipt of additional collateral for one impaired loan.\nFor the full year in 2017, the provision for loan losses increased to $3.2 million as a result of an increase in nonperforming loans, net of government guarantees, during the year and a $350,000 increase in the portion of the allowance specific to impaired loans compared to December 31, 2016.\nThe allowance for loan losses is 100% of nonperforming loans, net of government guarantees, at December 31, 2017.\nOther Operating Income\nIn addition to home mortgage lending, Northrim has interests in other businesses that complement its core community banking activities. It provides financial services to businesses and individuals through these interests, including purchased receivables financing and wealth management. In August 2017, Northrim sold its interest in NBG recognizing a gain of $4.4 million, or $2.6 million net of tax, which represents approximately 7 times 2016 net profits from NBG. In addition, revenues from two months prior to the sale contributed $609,000 to third quarter 2017 revenues. This income stream will not recur in future quarters. These complementary business activities, including home mortgage lending and other noninterest income, contributed $8.0 million, or 35% of total revenues in the fourth quarter of 2017, as compared to $13.9 million, or 48% of revenues in the third quarter of 2017 and $10.4 million, or 43% of revenues in the fourth quarter of 2016.\nFor 2017, other operating income decreased 6% to $40.5 million from $43.3 million in 2016. The decrease in other operating income for 2017 compared to a year ago is primarily due to a decline in mortgage banking income in 2017, partially offset by the gain on sale from NBG.\nOther Operating Expenses\nOperating expenses were $18.3 million in the fourth quarter 2017, compared to $17.7 million in the third quarter of 2017 and $18.4 million in the fourth quarter of 2016. Items impacting the comparative periods include a $686,000 write down of the carrying value the Company's minority ownership interest in another mortgage origination business owned by RML, which is included in other operating expense in the fourth quarter of 2017, a $563,000 write down on one land development project included in other real estate owned (\"OREO\") in the fourth quarter of 2017, and the changes in compensation expense related to the acquisition of RML that fluctuate with expected earnings from RML. In addition, $179,000 of the one-time costs related to the core conversion were recorded in the third quarter of 2017.\nOperating expenses for 2017 decreased 7% to $71.2 million, from $76.3 million for 2016, primarily due to the accounting adjustment in 2016 related to the acquisition of RML and a decrease in expenses in the home mortgage lending segment, net of the write down on the carrying value of the equity method investment noted above due to lower variable costs on lower production volume. These decreases were only partially offset by the OREO valuation adjustment noted above and the $943,000 in one-time costs related to the core conversion.\nCommunity Banking\n“We believe that we are well positioned to capitalize on opportunities in the greater Alaska market despite the slowdown in the economy, which has impacted growth in both our loan and deposit portfolios,” said Schierhorn. “With the continuing commitments to the development of North Slope oil reserves, we believe that our economy will recover from the recessionary pressures currently impacting our market. Net interest income in the Community Banking segment increased 6% in the fourth quarter compared to the same quarter in 2016, demonstrating the strength of our core franchise.”\nNet income generated in the Community Banking segment increased to $10.2 million in 2017 from $9.9 million in 2016, primarily due to the gain on the sale of NBG in 2017 and the accounting correction recorded in 2016, net of the increase in the provision for loan losses and the one-time costs associated with the core conversion, as well as the write down of net deferred tax assets resulting from the recently enacted federal tax legislation.\nThe following table provides highlights of the Community Banking segment of Northrim, and detail significant one-time and other non-operating items impacting the periods presented:\nThree Months Ended (Dollars in thousands, except per share data) December 31, 2017 September 30, 2017 June 30, 2017 March 31, 2017 December 31, 2016 Net interest income $ 14,381 $ 14,566 $ 13,952 $ 13,549 $ 13,584 Provision for loan losses — 2,500 300 400 743 Other operating income 2,685 7,635 3,412 3,455 3,399 Compensation expense, net RML acquisition payments (193 ) 149 — 174 708 Other operating expense 13,113 12,252 13,284 11,622 12,151 Income before provision for income taxes 4,146 7,300 3,780 4,808 3,381 Provision for income taxes 4,754 2,452 871 1,422 727 Net income (608 ) 4,848 2,909 3,386 2,654 Less: net income attributable to the noncontrolling interest — 78 152 97 105 Net income attributable to Northrim BanCorp ($608 ) $ 4,770 $ 2,757 $ 3,289 $ 2,549 Average diluted shares 6,963,125 6,959,035 6,997,727 6,993,726 6,983,771 Diluted earnings per share ($0.09 ) $ 0.69 $ 0.39 $ 0.47 $ 0.36\nThree Months Ended (Dollars in thousands, except per share data) December 31, 2017 September 30, 2017 June 30, 2017 March 31, 2017 December 31, 2016 Net income attributable to Northrim BanCorp ($608 ) $ 4,770 $ 2,757 $ 3,289 $ 2,549 Impact of one-time and other non-operating items: Gain on sale of Northrim Benefits Group (2 ) (4,443 ) — — — Core conversion costs — 179 633 131 — Compensation expense, net RML acquisition payments (193 ) 149 — 174 708 Provision for income taxes related to above items 80 1,692 (260 ) (125 ) (291 ) Provision for income taxes, change in DTA valuation 3,411 — — — — Operating net income * $ 2,688 $ 2,347 $ 3,130 $ 3,469 $ 2,966 Average diluted shares 6,963,125 6,959,035 6,997,727 6,993,726 6,983,771 Operating diluted earnings per share * $ 0.39 $ 0.34 $ 0.45 $ 0.50 $ 0.42\nYear-to-date (Dollars in thousands, except per share data) December 31, 2017 December 31, 2016 Net interest income $ 56,448 $ 55,247 Provision for loan losses 3,200 2,298 Other operating income 17,187 13,756 Compensation expense, net RML acquisition payments 130 4,775 Other operating expense 50,271 48,610 Income before provision for income taxes 20,034 13,320 Provision for income taxes 9,499 2,867 Net income 10,535 10,453 Less: net income attributable to the noncontrolling interest 327 579 Net income attributable to Northrim BanCorp $ 10,208 $ 9,874 Average diluted shares 6,977,910 6,974,864 Diluted earnings per share $ 1.46 $ 1.41\nYear-to-date (Dollars in thousands, except per share data) December 31, 2017 December 31, 2016 Net income attributable to Northrim BanCorp $ 10,208 $ 9,874 Impact of one-time and other non-operating items: Gain on sale of Northrim Benefits Group (4,445 ) — Core conversion costs 943 — Compensation expense - RML acquisition payments 130 4,775 Provision for income taxes related to above items 1,386 (1,963 ) Provision for income taxes, change in DTA valuation 3,411 — Operating net income * $ 11,633 $ 12,686 Average diluted shares 6,977,910 6,974,864 Operating diluted earnings per share * $ 1.67 $ 1.82 Home Mortgage Lending\n“The mortgage market that generated very strong revenues in the past few years has cooled noticeably this year for all originators. Northrim’s Home Mortgage Lending segment in 2017 was no exception, with loans funded down 18% in the quarter and 22% for the year which was primarily the result of the general slowing of the Alaska economy, rising interest rates and normal market cycles,” said Ballard. \"Despite this decline, the housing market in Alaska remains stable due to balanced supply and demand for homes in most price ranges, and we expect the Home Mortgage Lending segment to remain profitable despite the slowdown.\nBallard continued, “We are continuing to build our mortgage servicing business, which was initiated in the fourth quarter of 2015 to service loans for the Alaska Housing Finance Corporation. Northrim now services 1,630 loans in its $406.3 million home mortgage servicing portfolio, which is a 49% increase from the $272.4 million serviced a year ago.” Mortgage servicing contributed $1.5 million to fourth quarter of 2017 revenues up from $701,000 in the third quarter of 2017 and $1.2 million in the fourth quarter a year ago. Total mortgage servicing income fluctuates based on the amount of mortgage servicing rights originated during the period, and also based on changes in the fair value of mortgage servicing rights, which are driven by interest rate volatility and fluctuations in estimated prepayment speeds, which are based on industry averages.\nLastly, the $686,000 pre-tax write down of the carrying value of the Company's minority ownership interest in another mortgage origination business owned by RML discussed above is recorded in the Home Mortgage Lending segment.\nThe following table provides highlights of the Home Mortgage Lending segment of Northrim:\nThree Months Ended (Dollars in thousands, except per share data) December 31, 2017 September 30, 2017 June 30, 2017 March 31, 2017 December 31, 2016 Mortgage commitments $ 43,602 $ 68,601 $ 80,068 $ 67,589 $ 62,421 Mortgage loans funded for sale $ 132,606 $ 162,470 $ 143,944 $ 115,058 $ 169,235 Mortgage loan refinances to total fundings 17 % 12 % 12 % 24 % 25 % Mortgage loans serviced for others $ 406,291 $ 362,983 $ 332,485 $ 307,502 $ 272,442 Net realized gains on mortgage loans sold $ 4,084 $ 5,218 $ 4,990 $ 3,721 $ 5,987 Change in fair value of mortgage loan commitments, net (551 ) (23 ) 299 128 (551 ) Total production revenue 3,533 5,195 5,289 3,849 5,436 Mortgage servicing revenue 1,450 997 838 1,153 1,194 Change in fair value of mortgage servicing rights, net 2 64 (296 ) (48 ) 282 (3 ) Total mortgage servicing revenue, net 1,514 701 790 1,435 1,191 Other mortgage banking revenue 220 323 272 166 333 Total mortgage banking income $ 5,267 $ 6,219 $ 6,351 $ 5,450 $ 6,960 Net interest income $ 303 $ 352 $ 291 $ 284 $ 307 Provision for loan losses — — — — — Other operating income 5,267 6,219 6,351 5,450 6,960 Other operating expense 5,417 5,290 5,226 4,819 5,495 Income before provision for income taxes 153 1,281 1,416 915 1,772 Provision for income taxes (669 ) 528 584 379 731 Net income attributable to Northrim BanCorp $ 822 $ 753 $ 832 $ 536 $ 1,041 Average diluted shares 6,963,125 6,959,035 6,997,727 6,993,726 6,983,771 Diluted earnings per share $ 0.12 $ 0.11 $ 0.12 $ 0.08 $ 0.15 2 Principally reflects changes in discount rates and prepayment speed assumptions, which are primarily affected by changes in interest rates, net of collection/realization of expected cash flows over time.\nThree Months Ended (Dollars in thousands, except per share data) December 31, 2017 September 30, 2017 June 30, 2017 March 31, 2017 December 31, 2016 Net income attributable to Northrim BanCorp $ 822 $ 753 $ 832 $ 536 $ 1,041 Impact of one-time and other non-operating items: Writedown minority interest in equity method investment 686 — — — — Provision for income taxes related to above items (282 ) — — — — Provision for income taxes, change in DTA valuation (733 ) — — — — Operating net income * $ 493 $ 753 $ 832 $ 536 $ 1,041 Average diluted shares 6,963,125 6,959,035 6,997,727 6,993,726 6,983,771 Operating diluted earnings per share * $ 0.07 $ 0.11 $ 0.12 $ 0.08 $ 0.15\nYear-to-date (Dollars in thousands, except per share data) December 31, 2017 December 31, 2016 Mortgage loans funded for sale $ 554,077 $ 735,799 Mortgage loan refinances to total fundings 16 % 21 % Net realized gains on mortgage loans sold $ 18,013 $ 25,413 Change in fair value of mortgage loan commitments, net (147 ) (354 ) Total production revenue 17,866 25,059 Mortgage servicing revenue 4,438 3,710 Change in fair value of mortgage servicing rights, net 2 2 (526 ) Total mortgage servicing revenue, net 4,440 3,184 Other mortgage banking revenue 981 1,264 Total mortgage banking income $ 23,287 $ 29,507 Net interest income $ 1,230 $ 1,110 Other operating income 23,287 29,507 Other operating expense 20,752 22,895 Income before provision for income taxes 3,765 7,722 Provision for income taxes 822 3,185 Net income attributable to Northrim BanCorp $ 2,943 $ 4,537 Average diluted shares 6,977,910 6,974,864 Diluted earnings per share $ 0.42 $ 0.65 2 Principally reflects changes in discount rates and prepayment speed assumptions, which are primarily affected by changes in interest rates, net of collection/realization of expected cash flows over time.\nYear-to-date (Dollars in thousands, except per share data) December 31, 2017 December 31, 2016 Net income attributable to Northrim BanCorp $ 2,943 $ 4,537 Impact of one-time and other non-operating items: Writedown minority interest in equity method investment 686 — Provision for income taxes related to above items (282 ) — Provision for income taxes, change in DTA valuation (733 ) — Operating net income * $ 2,614 $ 4,537 Average diluted shares 6,977,910 6,974,864 Operating diluted earnings per share * $ 0.37 $ 0.65 Balance Sheet Review\nNorthrim’s assets were $1.52 billion at December 31, 2017, virtually unchanged from both preceding and year ago quarters. Average interest earnings assets were also relatively unchanged in the quarter and full year periods.\nAverage investment securities increased 1% in the fourth quarter of 2017 from the preceding quarter and decreased 7% from the fourth quarter a year ago. The investment portfolio generated an average net tax equivalent yield of 1.77% for the fourth quarter of 2017. The average estimated duration of the investment portfolio was 1.9 years, at December 31, 2017.\nAverage loans held for sale decreased 25% to $43.3 million in the fourth quarter of 2017 compared to the preceding quarter and decreased 20% from the same quarter a year ago, primarily reflecting the seasonality of the mortgage business and the reduced demand for home loans in the Alaska marketplace.\nPortfolio loans were down to $955.7 million at the end of the fourth quarter of 2017 compared to both the preceding and year ago quarters. Average portfolio loans in the fourth quarter of 2017 were $980.4 million, up slightly from a year ago and down 2.3% from the preceding quarter. Seasonality, the slowing Alaska economy, and some larger loan payoffs contributed to moderate declines in all loan categories for the quarter and the year.\nAlaskans account for substantially all of Northrim’s deposit base, which is primarily made up of low-cost transaction accounts. Balances in transaction accounts at December 31, 2017, represented 92% of total deposits. At December 31, 2017, total deposits were $1.26 billion, unchanged from the immediate prior quarter and down slightly from $1.27 billion from a year ago.\nAverage total deposits were stable in both the fourth quarter and full year in 2017 compared to the respective periods in 2016.\nShareholders’ equity increased 3% to $192.8 million, or $28.06 per share, at December 31, 2017, compared to $186.7 million, or $27.07 per share, a year ago. Tangible book value per share * was $25.70 at December 31, 2017, compared to $24.70 per share a year ago. Northrim continues to maintain capital levels in excess of the requirements to be categorized as “well-capitalized” under the Basel III and Dodd Frank regulatory standards with Tier 1 Capital to Risk Adjusted Assets of 14.65% at December 31, 2017. “The repayment of the $8 million in junior subordinated debt in August brought our capital ratios down, which is expected to improve profitability without reducing liquidity significantly,” said Schierhorn.\nAsset Quality\nNonperforming assets, net of government guarantees, increased to $28.7 million at December 31, 2017, compared to $26.2 million at the end of the preceding quarter due to a $4.4 million addition to OREO, net of government guarantees, from a previously disclosed single lending relationship that was previously accruing but adversely classified at the end of the third quarter of 2017. The $4.4 million that was previously adversely classified but still accruing interest was categorized in this manner because the real estate loan was collateralized and payments of principal and interest were covered by rental income being generated from the property. This increase in OREO was partially offset by principal paydowns on nonaccrual loans, net of government guarantees, and the $563,000 writedown on one OREO property discussed above.\nNonperforming assets, net of government guarantees increased to $28.7 million at December 31, 2017, compared to $19.3 million a year ago, due to one $8.3 million commercial business and one commercial relationships for $2.9 million, in the medical industry. These relationships, along with one other $7.7 million commercial relationship in the medical industry, represent 88% of total nonperforming loans, net of government guarantees, as of December 31, 2017. The additions to nonperforming assets in 2017 were partially offset by pay downs on nonaccrual loans and the sale of several OREO properties totaling $2.5 million in 2017 for a net gain on sales of $371,000.\nAdversely classified loans, net of government guarantees, were $33.8 million at the end of the fourth quarter of 2017 as compared to $33.8 million at the end of the third quarter of 2017 and $35.6 million one year ago. Net charge-offs in the fourth quarter of 2017 were minimal and $1.4 million for the full year. “None of these charge-offs were related directly to the oil sector,” said Ballard.\nThe following table details loan charge-offs, by industry:\n(Dollars in thousands) Three Months Ended December 31, 2017 September 30, 2017 December 31, 2016 Charge-offs: Construction $ — $ — $ 535 Transportation and warehousing 24 339 — Other services 5 48 31 Retail trade — — 4 News media — 731 — Consumer 26 85 21 Total charge-offs $ 55 $ 1,203 $ 591 Performing restructured loans that were not included in nonaccrual loans at the end of the fourth quarter of 2017 were $7.7 million, unchanged from the preceding quarter and up from $6.1 million a year ago. The increase in the fourth quarter of 2017 compared to the year ago quarter is primarily due to the addition of one commercial loan. Borrowers who are in financial difficulty and who have been granted concessions that may include interest rate reductions, term extensions, or payment alterations are categorized as restructured loans. The Company presents restructured loans that are performing separately from those that are classified as nonaccrual to provide more information on this category of loans and to differentiate between accruing performing and nonperforming restructured loans.\nAdversely classified loans are loans that Northrim has classified as substandard, doubtful, and loss, net of government guarantees. As of December 31, 2017, $25.2 million, or 74% of adversely classified loans net of government guarantees are attributable to five relationships in the following sectors; two commercial businesses, two medical businesses, and one oilfield services commercial business.\nNorthrim estimates that $70.8 million, or approximately 7% of portfolio loans as of December 31, 2017, had direct exposure to the oil and gas industry in Alaska, and $4.2 million of these loans are adversely classified. Northrim has an additional $53.5 million in unfunded commitments to companies with direct exposure to the oil and gas industry in Alaska, and none of these unfunded commitments are considered to be adversely classified loans. “We continue to have no loans to oil producers or exploration companies,” added Ballard. “We define direct exposure to the oil and gas sector as loans to borrowers that provide oilfield services and other companies that we have identified as significantly reliant upon activity in Alaska related to the oil and gas industry, such as lodging, equipment rental, transportation and other logistics services specific to this industry.”\nAbout Northrim BanCorp\nNorthrim BanCorp, Inc. is the parent company of Northrim Bank, an Alaska-based community bank with 14 branches in Anchorage, the Matanuska Valley, Juneau, Fairbanks, Ketchikan, and Sitka serving 90% of Alaska’s population; and an asset based lending division in Washington; and a wholly-owned mortgage brokerage company, Residential Mortgage Holding Company, LLC. The Bank differentiates itself with its detailed knowledge of Alaska’s economy and its “Customer First Service” philosophy. Pacific Wealth Advisors, LLC is an affiliated company of Northrim BanCorp.\nwww.northrim.com\nForward-Looking Statement\nThis release may contain “forward-looking statements” as that term is defined for purposes of Section 21E of the Securities Exchange Act of 1934. These statements are, in effect, management’s attempt to predict future events, and thus are subject to various risks and uncertainties. Readers should not place undue reliance on forward-looking statements, which reflect management’s views only as of the date hereof. All statements, other than statements of historical fact, regarding our financial position, business strategy and management’s plans and objectives for future operations are forward-looking statements. When used in this report, the words “anticipate,” “believe,” “estimate,” “expect,” and “intend” and words or phrases of similar meaning, as they relate to Northrim and its management are intended to help identify forward-looking statements. Although we believe that management’s expectations as reflected in forward-looking statements are reasonable, we cannot assure readers that those expectations will prove to be correct. Forward looking statements are subject to various risks and uncertainties that may cause our actual results to differ materially and adversely from our expectations as indicated in the forward-looking statements. These risks and uncertainties include: our ability to maintain strong asset quality and to maintain or expand our market share or net interest margins; and our ability to execute our business plan. Further, actual results may be affected by our ability to compete on price and other factors with other financial institutions; customer acceptance of new products and services; the regulatory environment in which we operate; and general trends in the local, regional and national banking industry and economy as those factors relate to our cost of funds and return on assets. In addition, there are risks inherent in the banking industry relating to collectability of loans and changes in interest rates. Many of these risks, as well as other risks that may have a material adverse impact on our operations and business, are identified in the “Risk Factors” section of our Annual Report on Form 10-K for the fiscal year ended December 31, 2016, and from time to time are disclosed in our other filings with the Securities and Exchange Commission. However, you should be aware that these factors are not an exhaustive list, and you should not assume these are the only factors that may cause our actual results to differ from our expectations. These forward-looking statements are made only as of the date of this release, and Northrim does not undertake any obligation to release revisions to these forward-looking statements to reflect events or conditions after the date of this release.\nReferences:\nhttp://labor.alaska.gov/trends/\nhttp://labor.state.ak.us/news/2018/news18-02.pdf\nhttp://www.petroleumnews.com/pntruncate/992348319.shtml\nhttp://www.alyeska-pipe.com/assets/uploads/pagestructure/NewsCenter_MediaResources_PressRelease_Entries\n/636504966895432028_pr1470_2017ThroughputIncrease%202.pdf\nIncome Statement (Dollars in thousands, except per share data) Three Months Ended (Unaudited) December 31, September 30, Three Month December 31, Year-Over-Year 2017 2017 % Change 2016 % Change Interest Income: Interest and fees on loans $ 13,861 $ 14,341 -3 % $ 13,423 3 % Interest on portfolio investments 1,168 1,060 10 % 1,032 13 % Interest on deposits in banks 203 118 72 % 67 203 % Total interest income 15,232 15,519 -2 % 14,522 5 % Interest Expense: Interest expense on deposits 382 429 -11 % 447 -15 % Interest expense on borrowings 166 173 -4 % 184 -10 % Total interest expense 548 602 -9 % 631 -13 % Net interest income 14,684 14,917 -2 % 13,891 6 % Provision for loan losses — 2,500 -100 % 743 -100 % Net interest income after provision for loan losses 14,684 12,417 18 % 13,148 12 % Other Operating Income: Mortgage banking income 5,267 6,219 -15 % 6,960 -24 % Gain on sale of Northrim Benefits Group 2 4,443 NM — NM Employee benefit plan income — 609 -100 % 871 -100 % Purchased receivable income 758 752 1 % 703 8 % Bankcard fees 694 664 5 % 675 3 % Service charges on deposit accounts 360 406 -11 % 473 -24 % Loss on sale of securities — (3 ) NM — NM Other income 871 765 14 % 677 29 % Total other operating income 7,952 13,855 -43 % 10,359 -23 % Other Operating Expense: Salaries and other personnel expense 10,971 11,115 -1 % 11,332 -3 % Occupancy expense 1,761 1,706 3 % 1,590 11 % Data processing expense 1,340 1,509 -11 % 1,293 4 % Professional and outside services 457 674 -32 % 780 -41 % Marketing expense 833 332 151 % 596 40 % Insurance expense 239 475 -50 % 179 34 % OREO expense, net rental income and gains on sale 621 (44 ) -1,511 % 28 2,118 % Gain on disposal of premises and equipment — — — % (13 ) -100 % Intangible asset amortization expense 21 26 -19 % 29 -28 % Compensation expense, net RML acquisition payments (193 ) 149 -230 % 708 -127 % Other operating expense 2,287 1,749 31 % 1,832 25 % Total other operating expense 18,337 17,691 4 % 18,354 — % Income before provision for income taxes 4,299 8,581 -50 % 5,153 -17 % Provision for income taxes 4,085 2,980 37 % 1,458 180 % Net income 214 5,601 -96 % 3,695 -94 % Less: Net income attributable to the noncontrolling interest — 78 -100 % 105 -100 % Net income attributable to Northrim BanCorp $ 214 $ 5,523 -96 % $ 3,590 -94 % Basic EPS $ 0.03 $ 0.80 -96 % $ 0.52 -94 % Diluted EPS $ 0.03 $ 0.79 -96 % $ 0.51 -94 % Average basic shares 6,865,753 6,872,273 0 % 6,897,890 0 % Average diluted shares 6,963,125 6,959,035 0 % 6,983,771 0 %\nIncome Statement (Dollars in thousands, except per share data) Twelve months ended December 31, (Unaudited) Year-Over-Year 2017 2016 % Change Interest Income: Interest and fees on loans $ 55,041 $ 54,777 0 % Interest on portfolio investments 4,634 3,936 18 % Interest on deposits in banks 433 205 111 % Total interest income 60,108 58,918 2 % Interest Expense: Interest expense on deposits 1,707 1,870 -9 % Interest expense on borrowings 723 691 5 % Total interest expense 2,430 2,561 -5 % Net interest income 57,678 56,357 2 % Provision for loan losses 3,200 2,298 39 % Net interest income after provision for loan losses 54,478 54,059 1 % Other Operating Income: Mortgage banking income 23,287 29,507 -21 % Gain on sale of Northrim Benefits Group 4,445 — NM Employee benefit plan income 2,506 3,770 -34 % Purchased receivable income 2,975 2,347 27 % Bankcard fees 2,597 2,670 -3 % Service charges on deposit accounts 1,614 1,998 -19 % Gain (loss) on sale of securities 11 (11 ) 200 % Other income 3,039 2,982 2 % Total other operating income 40,474 43,263 -6 % Other Operating Expense: Salaries and other personnel expense 44,721 46,752 -4 % Occupancy expense 6,752 6,462 4 % Data processing expense 5,549 4,879 14 % Marketing expense 2,566 2,449 5 % Professional and outside services 2,365 2,797 -15 % Insurance expense 1,161 1,023 13 % OREO expense, net rental income and gains on sale 837 98 754 % Compensation expense - RML acquisition payments 130 4,775 -97 % Intangible asset amortization expense 100 135 -26 % Loss on disposal of premises and equipment 3 352 -99 % Other operating expense 6,969 6,558 6 % Total other operating expense 71,153 76,280 -7 % Income before provision for income taxes 23,799 21,042 13 % Provision for income taxes 10,321 6,052 71 % Net income 13,478 14,990 -10 % Less: Net income attributable to the noncontrolling interest 327 579 -44 % Net income attributable to Northrim BanCorp $ 13,151 $ 14,411 -9 % Basic EPS $ 1.91 $ 2.09 -9 % Diluted EPS $ 1.88 $ 2.06 -9 % Average basic shares 6,889,621 6,883,663 0 % Average diluted shares 6,977,910 6,974,864 0 %\nBalance Sheet (Dollars in thousands) (Unaudited) December 31, September 30, Three Month December 31, One Year 2017 2017 % Change 2016 % Change Assets: Cash and due from banks $ 25,016 $ 13,960 79 % $ 34,485 -27 % Interest bearing deposits in other banks 52,825 73,309 -28 % 16,066 229 % Portfolio investments 312,750 271,248 15 % 332,118 -6 % Investment in Federal Home Loan Bank stock 2,115 2,116 0 % 1,965 8 % Loans held for sale 43,778 59,214 -26 % 43,596 — % Portfolio loans 955,667 989,253 -3 % 975,015 -2 % Allowance for loan losses (21,461 ) (21,464 ) 0 % (19,697 ) 9 % Net portfolio loans 934,206 967,789 -3 % 955,318 -2 % Purchased receivables, net 22,231 12,930 72 % 20,491 8 % Mortgage servicing rights 7,305 6,181 18 % 4,157 76 % Other real estate owned, net 8,651 3,505 147 % 6,574 32 % Premises and equipment, net 37,867 40,046 -5 % 39,318 -4 % Goodwill and intangible assets 16,224 16,245 0 % 16,324 -1 % Other assets 56,141 56,798 -1 % 56,128 — % Total assets $ 1,519,109 $ 1,523,341 0 % $ 1,526,540 0 % Liabilities: Demand deposits $ 414,686 $ 426,946 -3 % $ 449,206 -8 % Interest-bearing demand 252,009 240,274 5 % 201,349 25 % Savings deposits 247,458 251,266 -2 % 241,088 3 % Money market deposits 243,603 233,768 4 % 244,295 — % Time deposits 100,527 106,063 -5 % 131,715 -24 % Total deposits 1,258,283 1,258,317 0 % 1,267,653 -1 % Securities sold under repurchase agreements 27,746 31,084 -11 % 27,607 1 % Other borrowings 7,362 7,387 0 % 4,338 70 % Junior subordinated debentures 10,310 10,310 — % 18,558 -44 % Other liabilities 22,606 21,816 4 % 21,672 4 % Total liabilities 1,326,307 1,328,914 0 % 1,339,828 -1 % Shareholders' Equity: Northrim BanCorp shareholders' equity 192,802 194,427 -1 % 186,594 3 % Noncontrolling interest — — — % 118 -100 % Total shareholders' equity 192,802 194,427 -1 % 186,712 3 % Total liabilities and shareholders' equity $ 1,519,109 $ 1,523,341 0 % $ 1,526,540 0 %\nAdditional Financial Information\n(Dollars in thousands)\n(Unaudited)\nComposition of Portfolio Investments December 31, 2017 September 30, 2017 December 31, 2016 Balance % of total Balance % of total Balance % of total U.S. Treasury securities $ 49,877 15.9 % $ 30,012 11.1 % $ 30,063 9.1 % U.S. Agency securities 199,583 63.9 % 179,088 65.9 % 233,298 70.2 % U.S. Agency mortgage-backed securities — 0.0 % — 0.0 % 2 — % Corporate bonds 42,863 13.7 % 40,883 15.1 % 49,699 15.0 % Collateralized loan obligations 6,005 1.9 % 3,002 1.1 % — — % Alaska municipality, utility, or state bonds 9,752 3.1 % 13,502 5.0 % 14,296 4.3 % Other municipality, utility, or state bonds 4,670 1.5 % 4,761 1.8 % 4,760 1.4 % Total portfolio investments $ 312,750 $ 271,248 $ 332,118\nComposition of Portfolio Loans December 31, 2017 September 30, 2017 June 30, 2017 March 31, 2017 December 31, 2016 Balance % of total Balance % of total Balance % of total Balance % of total Balance % of total Commercial loans $ 313,769 33 % $ 315,512 32 % $ 309,493 31 % $ 275,809 29 % $ 278,178 28 % CRE owner occupied loans 132,097 14 % 135,053 14 % 139,475 14 % 140,102 15 % 152,178 16 % CRE nonowner occupied loans 359,871 37 % 386,294 39 % 401,662 40 % 408,472 41 % 402,003 41 % Construction loans 111,294 12 % 111,427 11 % 98,713 10 % 94,004 10 % 98,220 10 % Consumer loans 42,792 4 % 44,942 4 % 46,010 5 % 46,838 5 % 48,870 5 % Subtotal 959,823 993,228 995,353 965,225 979,449 Unearned loan fees, net (4,156 ) (3,975 ) (4,144 ) (4,393 ) (4,434 ) Total portfolio loans $ 955,667 $ 989,253 $ 991,209 $ 960,832 $ 975,015\nComposition of Deposits December 31, 2017 September 30, 2017 June 30, 2017 March 31, 2017 December 31, 2016 Balance % of total Balance % of total Balance % of total Balance % of total Balance % of total Demand deposits $ 414,686 33 % $ 426,946 34 % $ 395,310 32 % $ 421,867 33 % $ 449,206 36 % Interest-bearing demand 252,009 20 % 240,274 19 % 231,073 19 % 194,414 16 % 201,349 16 % Savings deposits 247,458 20 % 251,266 20 % 249,275 20 % 252,218 20 % 241,088 19 % Money market deposits 243,603 19 % 233,768 19 % 231,780 19 % 244,881 20 % 244,295 19 % Time deposits 100,527 8 % 106,063 8 % 126,872 10 % 133,693 11 % 131,715 10 % Total deposits $ 1,258,283 $ 1,258,317 $ 1,234,310 $ 1,247,073 $ 1,267,653\nAdditional Financial Information\n(Dollars in thousands)\n(Unaudited)\nAsset Quality December 31, September 30, December 31, 2017 2017 2016 Nonaccrual loans $ 21,626 $ 24,317 $ 13,893 Loans 90 days past due and accruing 252 214 456 Total nonperforming loans 21,878 24,531 14,349 Nonperforming loans guaranteed by government (467 ) (1,846 ) (1,413 ) Net nonperforming loans 21,411 22,685 12,936 Other real estate owned 8,651 3,505 6,574 Other real estate owned guaranteed by government (1,333 ) — (195 ) Net nonperforming assets $ 28,729 $ 26,190 $ 19,315 Nonperforming loans / portfolio loans, net of government guarantees 2.24 % 2.29 % 1.33 % Nonperforming assets / total assets, net of government guarantees 1.89 % 1.72 % 1.27 % Performing restructured loans $ 7,668 $ 7,687 $ 6,131 Nonperforming loans plus performing restructured loans, net of government guarantees $ 29,079 $ 30,372 $ 19,067 Nonperforming loans plus performing restructured loans / portfolio loans, net of government guarantees 3.04 % 3.07 % 1.96 % Nonperforming assets plus performing restructured loans / total assets, net of government guarantees 2.48 % 2.22 % 1.68 % Adversely classified loans, net of government guarantees $ 33,845 $ 33,789 $ 35,634 Loans 30-89 days past due and accruing, net of government guarantees / portfolio loans 0.22 % 0.70 % 0.22 % Allowance for loan losses / portfolio loans 2.25 % 2.17 % 2.02 % Allowance for loan losses / nonperforming loans, net of government guarantees 100 % 95 % 152 % Gross loan charge-offs for the quarter $ 55 $ 1,203 $ 591 Gross loan recoveries for the quarter ($53 ) ($106 ) ($66 ) Net loan charge-offs (recoveries) for the quarter $ 2 $ 1,097 $ 525 Net loan charge-offs year-to-date $ 1,435 $ 1,433 $ 754 Net loan charge-offs for the quarter / average loans, for the quarter 0.00 % 0.11 % 0.05 % Net loan charge-offs year-to-date / average loans, year-to-date annualized 0.15 % 0.19 % 0.08 %\nAdditional Financial Information\n(Dollars in thousands)\n(Unaudited)\nNonperforming Assets Rollforward Balance at Additions Payments Writedowns Transfers to Transfers to Sales Balance at September 30, 2017 this quarter this quarter /Charge-offs\nthis quarter OREO Performing Status\nthis quarter this quarter December 31, 2017 Commercial loans $ 22,794 $ 321 ($1,440 ) ($29 ) ($1,333 ) ($156 ) $ — $ 20,157 Commercial real estate 1,331 — — — — — — 1,331 Construction loans — — — — — — — — Consumer loans 406 12 (2 ) (26 ) — — — 390 Non-performing loans guaranteed by government (1,846 ) — 23 — 1,333 23 — (467 ) Total non-performing loans 22,685 333 (1,419 ) (55 ) — (133 ) — 21,411 Other real estate owned 3,505 5,744 — (563 ) — — (35 ) 8,651 Other real estate owned guaranteed by government — (1,333 ) — — — — — (1,333 ) Total non-performing assets, net of government guarantees $ 26,190 $ 4,744 ($1,419 ) ($618 ) $ — ($133 ) ($35 ) $ 28,729\nAdditional Financial Information\n(Dollars in thousands)\n(Unaudited)\nAverage Balances, Yields, and Rates Three Months Ended December 31, 2017 September 30, 2017 December 31, 2016 Average Average Average Average Tax Equivalent Average Tax Equivalent Average Tax Equivalent Balance Yield/Rate Balance Yield/Rate Balance Yield/Rate Assets Interest bearing deposits in other banks $ 61,030 1.30 % $ 37,349 1.24 % $ 37,328 0.54 % Portfolio investments 287,393 1.77 % 284,806 1.63 % 309,519 1.48 % Loans held for sale 43,259 4.28 % 57,346 3.74 % 54,266 3.54 % Portfolio loans 980,351 5.45 % 1,003,751 5.49 % 977,678 5.31 % Total interest-earning assets 1,372,033 4.46 % 1,383,252 4.51 % 1,378,791 4.25 % Nonearning assets 147,832 142,226 142,987 Total assets $ 1,519,865 $ 1,525,478 $ 1,521,778 Liabilities and Shareholders' Equity Interest-bearing deposits $ 829,295 0.18 % $ 839,743 0.20 % $ 804,334 0.22 % Borrowings 48,376 1.35 % 49,223 1.36 % 51,879 1.38 % Total interest-bearing liabilities 877,671 0.25 % 888,966 0.27 % 856,213 0.29 % Noninterest-bearing demand deposits 425,271 423,065 460,880 Other liabilities 19,857 18,744 25,247 Shareholders' equity 197,066 194,703 179,438 Total liabilities and shareholders' equity $ 1,519,865 $ 1,525,478 $ 1,521,778 Net spread 4.21 % 4.24 % 3.96 % Net interest margin (\"NIM\") 4.25 % 4.28 % 4.01 % Tax equivalent NIM * 4.31 % 4.34 % 4.07 % Average portfolio loans to average interest-earning assets 71.45 % 72.56 % 70.91 % Average portfolio loans to average total deposits 78.14 % 79.49 % 77.27 % Average non-interest deposits to average total deposits 33.90 % 33.50 % 36.43 % Average interest-earning assets to average interest-bearing liabilities 156.33 % 155.60 % 161.03 %\nAdditional Financial Information\n(Dollars in thousands)\n(Unaudited)\nAverage Balances, Yields, and Rates Year-to-date December 31, 2017 December 31, 2016 Average Average Average Tax Equivalent Average Tax Equivalent Balance Yield/Rate Balance Yield/Rate Assets Interest bearing deposits in other banks $ 36,944 1.15 % $ 37,074 0.50 % Portfolio investments 305,211 1.66 % 296,214 1.46 % Loans held for sale 44,047 3.95 % 52,012 3.59 % Portfolio loans 981,001 5.47 % 976,613 5.46 % Total interest-earning assets 1,367,203 4.46 % 1,361,913 4.38 % Nonearning assets 143,849 144,609 Total assets $ 1,511,052 $ 1,506,522 Liabilities and Shareholders' Equity Interest-bearing deposits $ 829,918 0.21 % $ 803,877 0.23 % Borrowings 50,523 1.40 % 50,095 1.35 % Total interest-bearing liabilities 880,441 0.27 % 853,972 0.30 % Noninterest-bearing demand deposits 418,415 446,366 Other liabilities 19,067 24,556 Shareholders' equity 193,129 181,628 Total liabilities and shareholders' equity $ 1,511,052 $ 1,506,522 Net spread 4.19 % 4.08 % NIM 4.22 % 4.14 % NIMTE * 4.28 % 4.20 % Average portfolio loans to average interest-earning assets 71.75 % 71.71 % Average portfolio loans to average total deposits 78.58 % 78.11 % Average non-interest deposits to average total deposits 33.52 % 35.70 % Average interest-earning assets to average interest-bearing liabilities 155.29 % 159.48 %\nCapital Data (At quarter end) December 31, 2017 September 30, 2017 December 31, 2016 Book value per share $ 28.06 $ 28.37 $ 27.07 Tangible book value per share * $ 25.70 $ 26.00 $ 24.70 Total shareholders' equity/total assets 12.69 % 12.76 % 12.23 % Tangible Common Equity/Tangible Assets * 11.75 % 11.82 % 11.28 % Tier 1 Capital / Risk Adjusted Assets 14.65 % 13.50 % 14.54 % Total Capital / Risk Adjusted Assets 15.90 % 14.75 % 15.80 % Tier 1 Capital / Average Assets 12.41 % 11.54 % 12.59 % Shares outstanding 6,871,963 6,852,338 6,897,890 Unrealized gain (loss) on AFS securities, net of income taxes ($369 ) $ 147 ($397 )\nAdditional Financial Information\n(Dollars and shares in thousands)\n(Unaudited)\nProfitability Ratios December 31, 2017 September 30, 2017 June 30, 2017 March 31, 2017 December 31, 2016 For the quarter: Net interest margin (\"NIM\") 4.25 % 4.28 % 4.20 % 4.15 % 4.01 % Tax equivalent NIM * 4.31 % 4.34 % 4.26 % 4.22 % 4.07 % Efficiency ratio 80.92 % 61.40 % 76.95 % 72.95 % 75.57 % Return on average assets 0.06 % 1.44 % 0.96 % 1.04 % 0.94 % Return on average equity 0.43 % 11.25 % 7.43 % 8.30 % 7.96 %\nDecember 31, 2017 December 31, 2016 Year-to-date: NIM 4.22 % 4.14 % NIMTE * 4.28 % 4.20 % Efficiency ratio 72.39 % 76.44 % Return on average assets 0.87 % 0.96 % Return on average equity 6.81 % 7.93 %\n*Non-GAAP Financial Measures\n(Dollars and shares in thousands, except per share data)\n(Unaudited)\nTax equivalent NIM\nTax equivalent NIM is a non-GAAP performance measurement in which interest income on non-taxable investments and loans is presented on a tax equivalent basis using a combined federal and state statutory rate of 41.11% in both 2017 and 2016. The most comparable GAAP measure is net interest margin and the following table sets forth the reconciliation of tax equivalent NIM to net interest margin.\nThree Months Ended December 31, 2017 September 30, 2017 June 30, 2017 March 31, 2017 December 31, 2016 Net interest income $ 14,684 $ 14,917 $ 14,244 $ 13,833 $ 13,891 Divided by average interest-bearing assets 1,372,033 1,383,252 1,360,961 1,352,171 1,378,791 Net interest margin (\"NIM\") 3 4.25 % 4.28 % 4.20 % 4.15 % 4.01 % Net interest income $ 14,684 $ 14,917 $ 14,244 $ 13,833 $ 13,891 Plus: reduction in tax expense related to tax-exempt interest income 204 220 224 224 209 $ 14,888 $ 15,137 $ 14,468 $ 14,057 $ 14,100 Divided by average interest-bearing assets 1,372,033 1,383,252 1,360,961 1,352,171 1,378,791 Tax equivalent NIM 3 4.31 % 4.34 % 4.26 % 4.22 % 4.07 %\n(Dollars and shares in thousands, except per share data)\n(Unaudited)\nYear-to-date December 31, 2017 December 31, 2016 Net interest income $ 57,678 $ 56,357 Divided by average interest-bearing assets 1,367,203 1,361,913 Net interest margin (\"NIM\") 4 4.22 % 4.14 % Net interest income $ 57,678 $ 56,357 Plus: reduction in tax expense related to tax-exempt interest income 872 808 $ 58,550 $ 57,165 Divided by average interest-bearing assets 1,367,203 1,361,913 Tax equivalent NIM 4 4.28 % 4.20 % 3 Calculated using actual days in the quarter divided by 365 for quarters ended in 2017 and actual days in the quarter divided by 366 for quarters ended in 2016.\n4 Calculated using actual days in the year divided by 365 for year-to-date period ended in 2017 and actual days in the year divided by 366 for year-to-date period ended in 2016.\nTangible Book Value\nTangible book value is a non-GAAP measure defined as shareholders' equity, less intangible assets, divided by shares outstanding. The following table sets forth the reconciliation of tangible book value per share and book value per share.\nDecember 31, 2017 September 30, 2017 June 30, 2017 March 31, 2017 December 31, 2016 Total shareholders' equity $ 192,802 $ 194,427 $ 191,177 $ 189,452 $ 186,712 Divided by shares outstanding 6,872 6,852 6,911 6,910 6,898 Book value per share $ 28.06 $ 28.37 $ 27.66 $ 27.42 $ 27.07\nDecember 31, 2017 September 30, 2017 June 30, 2017 March 31, 2017 December 31, 2016 Total shareholders' equity $ 192,802 $ 194,427 $ 191,777 $ 189,452 $ 186,712 Less: goodwill and intangible assets 16,224 16,245 16,271 16,298 16,324 $ 176,578 $ 178,182 $ 175,506 $ 173,154 $ 170,388 Divided by shares outstanding 6,872 6,852 6,911 6,910 6,898 Tangible book value per share $ 25.70 $ 26.00 $ 25.40 $ 25.06 $ 24.70\n(Dollars and shares in thousands, except per share data)\n(Unaudited)\nTangible Common Equity to Tangible Assets\nTangible common equity to tangible assets is a non-GAAP ratio that represents total equity less goodwill and intangible assets divided by total assets less goodwill and intangible assets. This ratio has received more attention over the past several years from stock analysts and regulators. The most comparable GAAP measure of shareholders' equity to total assets is calculated by dividing total shareholders' equity by total assets.\nNorthrim BanCorp, Inc. December 31, 2017 September 30, 2017 June 30, 2017 March 31, 2017 December 31, 2016 Total shareholders' equity $ 192,802 $ 194,427 $ 191,777 $ 189,452 $ 186,712 Total assets 1,519,109 1,523,341 1,493,205 1,512,580 1,526,540 Total shareholders' equity to total assets 12.69 % 12.76 % 12.84 % 12.53 % 12.23 %\nNorthrim BanCorp, Inc. December 31, 2017 September 30, 2017 June 30, 2017 March 31, 2017 December 31, 2016 Total shareholders' equity $ 192,802 $ 194,427 $ 191,777 $ 189,452 $ 186,712 Less: goodwill and other intangible assets, net 16,224 16,245 16,271 16,298 16,324 Tangible common shareholders' equity $ 176,578 $ 178,182 $ 175,506 $ 173,154 $ 170,388 Total assets $ 1,519,109 $ 1,523,341 $ 1,493,205 $ 1,512,580 $ 1,526,540 Less: goodwill and other intangible assets, net 16,224 16,245 16,271 16,298 16,324 Tangible assets $ 1,502,885 $ 1,507,096 $ 1,476,934 $ 1,496,282 $ 1,510,216 Tangible common equity ratio 11.75 % 11.82 % 11.88 % 11.57 % 11.28 %\nO perating diluted earnings per share\nOperating diluted earnings per share is a non-GAAP ratio that represents operating net income divided by average diluted shares. The most comparable GAAP measure is diluted earnings per share. The following table provides a reconciliation of operating diluted earnings per share with diluted earnings per share:\nNorthrim BanCorp, Inc. Three Months Ended December 31, 2017 September 30, 2017 June 30, 2017 March 31, 2017 December 31, 2016 Net income $ 214 $ 5,523 $ 3,589 $ 3,825 $ 3,590 Divided by weighted-average diluted shares outstanding 6,963,125 6,959,035 6,997,727 6,993,726 6,983,771 Diluted earnings per share $ 0.03 $ 0.79 $ 0.51 $ 0.55 $ 0.51\nNorthrim BanCorp, Inc. Three Months Ended December 31, 2017 September 30, 2017 June 30, 2017 March 31, 2017 December 31, 2016 Operating net income $ 3,181 $ 3,100 $ 3,962 $ 4,005 $ 4,007 Divided by weighted-average diluted shares outstanding 6,963,125 6,959,035 6,997,727 6,993,726 6,983,771 Operating diluted earnings per share $ 0.46 $ 0.45 $ 0.57 $ 0.57 $ 0.57\n(Dollars and shares in thousands, except per share data)\n(Unaudited)\nNorthrim BanCorp, Inc. Year-to-date December 31, 2017 December 31, 2016 Net income $ 13,151 $ 14,411 Divided by weighted-average diluted shares outstanding 6,977,910 6,974,864 Diluted earnings per share $ 1.88 $ 2.06\nNorthrim BanCorp, Inc. Year-to-date December 31, 2017 December 31, 2016 Operating net income $ 14,247 $ 17,223 Divided by weighted-average diluted shares outstanding 6,977,910 6,974,864 Operating diluted earnings per share $ 2.04 $ 2.47\nCommunity Banking Three Months Ended December 31, 2017 September 30, 2017 June 30, 2017 March 31, 2017 December 31, 2016 Net income ($608 ) $ 4,770 $ 2,757 $ 3,289 $ 2,549 Divided by weighted-average diluted shares outstanding 6,963,125 6,959,035 6,997,727 6,993,726 6,983,771 Diluted earnings per share ($0.09 ) $ 0.69 $ 0.39 $ 0.47 $ 0.36\nCommunity Banking Three Months Ended December 31, 2017 September 30, 2017 June 30, 2017 March 31, 2017 December 31, 2016 Operating net income $ 2,688 $ 2,347 $ 3,130 $ 3,469 $ 2,966 Divided by weighted-average diluted shares outstanding 6,963,125 6,959,035 6,997,727 6,993,726 6,983,771 Operating diluted earnings per share $ 0.39 $ 0.34 $ 0.45 $ 0.50 $ 0.42\nCommunity Banking Year-to-date December 31, 2017 December 31, 2016 Net income $ 10,208 $ 9,874 Divided by weighted-average diluted shares outstanding 6,977,910 6,974,864 Diluted earnings per share $ 1.46 $ 1.41\nCommunity Banking Year-to-date December 31, 2017 December 31, 2016 Operating net income $ 11,633 $ 12,686 Divided by weighted-average diluted shares outstanding 6,977,910 6,974,864 Operating diluted earnings per share $ 1.67 $ 1.82\n(Dollars and shares in thousands, except per share data)\n(Unaudited)\nHome Mortgage Lending Three Months Ended December 31, 2017 September 30, 2017 June 30, 2017 March 31, 2017 December 31, 2016 Net income $ 822 $ 753 $ 832 $ 536 $ 1,041 Divided by weighted-average diluted shares outstanding 6,963,125 6,959,035 6,997,727 6,993,726 6,983,771 Diluted earnings per share $ 0.12 $ 0.11 $ 0.12 $ 0.08 $ 0.15\nHome Mortgage Lending Three Months Ended December 31, 2017 September 30, 2017 June 30, 2017 March 31, 2017 December 31, 2016 Operating net income $ 493 $ 753 $ 832 $ 536 $ 1,041 Divided by weighted-average diluted shares outstanding 6,963,125 6,959,035 6,997,727 6,993,726 6,983,771 Operating diluted earnings per share $ 0.07 $ 0.11 $ 0.12 $ 0.08 $ 0.15\nHome Mortgage Lending Year-to-date December 31, 2017 December 31, 2016 Net income $ 2,943 $ 4,537 Divided by weighted-average diluted shares outstanding 6,977,910 6,974,864 Diluted earnings per share $ 0.42 $ 0.65\nHome Mortgage Lending Year-to-date December 31, 2017 December 31, 2016 Operating net income $ 2,614 $ 4,537 Divided by weighted-average diluted shares outstanding 6,977,910 6,974,864 Operating diluted earnings per share $ 0.37 $ 0.65\n(Dollars and shares in thousands, except per share data)\n(Unaudited)\nOperating efficiency ratio\nThe operating efficiency ratio is a non-GAAP ratio that is calculated by dividing operating other operating expense (which exclude certain non-operating expense items), exclusive of intangible asset amortization, by the sum of net interest income and operating other operating income (which exclude certain non-operating income items). The following tables set forth the calculation of the operating efficiency ratio:\nNorthrim BanCorp, Inc. Three Months Ended December 31, 2017 September 30, 2017 June 30, 2017 March 31, 2017 December 31, 2016 Total other operating expense $ 18,337 $ 17,691 $ 18,510 $ 16,615 $ 18,354 Less: core conversion costs — 179 633 131 — Less: writedown minority interest in equity method investment 686 — — — — Less: compensation expense, net RML acquisition payments (193 ) 149 — 174 708 Operating other operating expense $ 17,844 $ 17,363 $ 17,877 $ 16,310 $ 17,646 Less: intangible asset amortization 21 26 27 26 29 $ 17,823 $ 17,337 $ 17,850 $ 16,284 $ 17,617 Other operating income $ 7,952 $ 13,855 $ 9,762 $ 8,905 $ 10,359 Less: gain on sale of Northrim Benefits Group 2 4,443 — — — Operating other operating income $ 7,950 $ 9,412 $ 9,762 $ 8,905 $ 10,359 Plus: net interest income 14,684 14,917 14,244 13,833 13,891 $ 22,634 $ 24,329 $ 24,006 $ 22,738 $ 24,250 Operating efficiency ratio 78.74 % 71.26 % 74.36 % 71.62 % 72.65 %\nOperating return on average assets ratio\nThe operating return on average assets ratio is a non-GAAP ratio that is calculated by dividing operating net income (which exclude certain non-operating income and expense items) by average assets. The following tables set forth the calculation of the operating return on average assets ratio:\nNorthrim BanCorp, Inc. Three Months Ended December 31, 2017 September 30, 2017 June 30, 2017 March 31, 2017 December 31, 2016 Operating net income $ 3,181 $ 3,100 $ 3,962 $ 4,005 $ 4,007 Divided by average assets 1,519,865 1,525,478 1,506,820 1,491,576 1,521,778 Operating return on average assets ratio 0.83 % 0.81 % 1.05 % 1.09 % 1.05 %\nNorthrim BanCorp, Inc. Year-to-date December 31, 2017 December 31, 2016 Operating net income $ 14,247 $ 17,223 Divided by average assets 1,511,052 1,506,522 Operating return on average assets ratio 0.94 % 1.14 %\n(Dollars and shares in thousands, except per share data)\n(Unaudited)\nOperating return on average equity ratio\nThe operating return on average equity ratio is a non-GAAP ratio that is calculated by dividing operating net income (which exclude certain non-operating income and expense items) by average shareholders' equity. The following tables set forth the calculation of the operating return on average equity ratio:\nNorthrim BanCorp, Inc. Three Months Ended December 31, 2017 September 30, 2017 June 30, 2017 March 31, 2017 December 31, 2016 Operating net income $ 3,181 $ 3,100 $ 3,962 $ 4,005 $ 4,007 Divided by average shareholders' equity 197,066 194,703 193,656 186,960 179,438 Operating return on average equity ratio 6.40 % 6.32 % 8.21 % 8.69 % 8.88 %\nNorthrim BanCorp, Inc. Year-to-date December 31, 2017 December 31, 2016 Operating net income $ 14,247 $ 17,223 Divided by average shareholders' equity 193,129 181,628 Operating return on average equity ratio 7.38 % 9.48 %\nContact: Joe Schierhorn, President, CEO, and COO (907) 261-3308 Jed Ballard, Chief Financial Officer (907) 261-3539\nSource:Northrim BanCorp Inc", "external_links": ["http://labor.alaska.gov/trends/", "http://www.petroleumnews.com/pntruncate/992348319.shtml", "http://www.alyeska-pipe.com/assets/uploads/pagestructure/NewsCenter_MediaResources_PressRelease_Entries", "https://www.globenewswire.com/NewsRoom/AttachmentNg/4b42edf4-5916-435e-92eb-37da55ba9108", "http://labor.state.ak.us/news/2018/news18-02.pdf"], "published": "2018-01-30T00:15:00.000+02:00", "crawled": "2018-01-30T03:41:39.000+02:00", "highlightTitle": ""}