{"organizations": [], "uuid": "b408dffe3d2fbc530461c884f7b9af5bd88ad790", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/business-wire-altapacific-bancorp-announces-2017-year-end-performance-results-and-declares-5-percent-stock-dividend.html", "country": "US", "domain_rank": 767, "title": "AltaPacific Bancorp Announces 2017 Year End Performance Results and Declares 5% Stock Dividend", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T02:20:00.000+02:00", "replies_count": 0, "uuid": "b408dffe3d2fbc530461c884f7b9af5bd88ad790"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/business-wire-altapacific-bancorp-announces-2017-year-end-performance-results-and-declares-5-percent-stock-dividend.html", "ord_in_thread": 0, "title": "AltaPacific Bancorp Announces 2017 Year End Performance Results and Declares 5% Stock Dividend", "locations": [], "entities": {"persons": [], "locations": [{"name": "santa rosa", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "altapacific bancorp", "sentiment": "negative"}, {"name": "acific bank", "sentiment": "none"}, {"name": "board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SANTA ROSA, Calif.--(BUSINESS WIRE)-- AltaPacific Bancorp (OTCBB: ABNK), the parent company of AltaPacific Bank, today reported year-to-date net income totaling $3,973,000, or $0.65 per diluted share, and quarterly net income totaling $593,000, or $0.10 per diluted share, for the period ending December 31, 2017, respectively. The Company also reported that the Board of Directors recently approved the payment of a 5% stock dividend per common share payable on February 23, 2018 to shareholders of record as of February 9, 2018.\nOn December 22, 2017, the Tax Cuts and Jobs Act was signed into law. Among other changes is a permanent reduction in the federal corporate income tax rate from 35% to 21% effective January 1, 2018. As a result of the reduction in the corporate income tax rate, the Company revalued its net deferred tax asset as of December 31, 2017. This resulted in a reduction in the value of our net deferred tax asset of $762,000 or $0.13 per diluted share, which was recorded as additional income tax expense for the fourth quarter of 2017.\nAssets totaled $418,634,000 at December 31, 2017, representing a decrease of $4.9 million (1.2%) over September 30, 2017 and an increase of $67.2 million (19.1%) over December 31, 2016. At December 31, 2017, gross loans totaled $295,684,000 representing an increase of $26.8 million (10.0%) over September 30, 2017 and an increase of $62.6 million (26.8%) over December 31, 2016. Deposits totaled $335,147,000 at December 31, 2017 representing a decrease of $5.4 million (1.6%) over September 30, 2017 and an increase of $58.4 million (21.1%) over December 31, 2016.\nAt December 31, 2017, the Allowance for Loan and Lease Losses totaled $3,686,000, representing 1.5% of Gross Loans originated. At December 31, 2017, nonaccrual loans totaled $46,000 and there were no other loans past due in excess of 30 days.\nThe Company’s Share Repurchase Program, which was adopted in 2012, has resulted in the repurchase and retirement of 1,042,141 shares of company stock at an average cost of $9.95. During 2017, the Company repurchased and retired 266,708 shares at an average cost of $11.45.\n“AltaPacific Bank experienced loan and deposit growth in excess of 20% this past year. The growth is directly attributable to the tremendous effort put forth by our seasoned team of banking professionals,” reported Charles O. Hall, Chief Executive Officer. Continuing, Mr. Hall stated, “It has been wonderful to achieve this level of core growth while at the same time maintaining our focus on finding appropriate acquisition candidates.”\nAltaPacific Bancorp is the parent company for AltaPacific Bank. The Company’s stock trades over the counter under the symbol ABNK. AltaPacific Bank is an independent business bank headquartered in Santa Rosa, California and has additional banking offices in Covina, Ontario, Riverside, San Bernardino and Temecula, California. The bank is focused on meeting the specialized needs of small to medium-sized businesses and professionals throughout California. For additional information, please contact us at (707) 236-1500 or online at www.apbconnect.com .\nThe following is a summary of the Company’s financial performance (unaudited) as of December 31, 2017:\n(Dollars in thousands) December 31, 2016 September 30, 2017 December 31, 2017 Gross Loans $ 233,099 $ 268,901 $ 295,684 Allowance for Loan Losses 3,336 3,486 3,686 Net Loans 229,763 265,415 291,998 Total Assets 351,389 423,544 418,634 Total Deposits 276,706 340,562 335,147 Shareholders’ Equity 57,165 58,961 58,028 (Dollars in thousands,\nexcept per share amounts)\nThree Month Period Ending Year-to-Date September 30,\n2017\nDecember 31,\n2017\nDecember 31,\n2016\nDecember 31,\n2017\nInterest Income $ 4,939 $ 5,831 $ 20,102 $ 20,227 Interest Expense 444 451 1,456 1,736 Net Interest Income 4,495 5,380 18,646 18,491 Provision for Loan Losses - 200 100 350 Noninterest Income 160 146 966 2,027 Noninterest Expense 3,200 3,501 12,086 13,791 Pretax Income 1,455 1,825 7,426 6,377 Provision for Income Taxes 580 1,232 3,051 2,404 Net Income 875 593 4,375 3,973 Return on Average Assets 0.83% 0.55% 1.19% 0.97% Return on Average Equity 5.93% 4.04% 7.95% 6.81% Efficiency Ratio 68.74% 63.36% 61.63% 67.21% EPS Basic $ 0.14 $ 0.10 $ 0.72 $ 0.65 EPS Diluted $ 0.13 $ 0.10 $ 0.70 $ 0.65 Book Value Per Common Share $ 9.78 $ 9.81 $ 9.25 $ 9.81 Forward-Looking Statements\nThis press release may contain forward-looking statements about AltaPacific Bancorp and its subsidiaries, including descriptions of plans or objectives of its management for future operations, products or services, and forecasts of its revenues, earnings or other measures of economic performance. Forward-looking statements can be identified by the fact that they do not relate strictly to historical or current facts. They often include the words \"believe,\" \"expect,\" \"anticipate,\" \"intend,\" \"plan,\" \"estimate,\" or words of similar meaning, or future or conditional verbs such as \"will,\" \"would,\" \"should,\" \"could,\" or \"may.\" Forward-looking statements, by their nature, are subject to risks and uncertainties. A number of factors — many of which are beyond AltaPacific’s control — could cause actual conditions, events or results to differ significantly from those described in the forward-looking statements. Factors that may cause actual results to differ materially from those contemplated by such forward-looking statements include, among others, the following possibilities: (1) competitive pressures among depository and other financial institutions may increase significantly; (2) revenues may be lower than expected; (3) changes in the interest rate environment may reduce interest margins; (4) general economic conditions, either nationally or regionally, may be less favorable than expected, resulting in, among other things, a deterioration in credit quality and/or a reduced demand for credit; (5) legislative or regulatory changes, including changes in accounting standards and tax laws, may adversely affect the businesses in which AltaPacific is engaged; (6) competitors may have greater financial resources and develop products that enable such competitors to compete more successfully than AltaPacific; and (7) adverse changes may occur in the securities markets or with respect to inflation. Forward-looking statements speak only as of the date they are made. Except as required by law, AltaPacific does not undertake to update forward-looking statements to reflect subsequent circumstances or events.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180119005839/en/\nAltaPacific Bancorp\nCharles O. Hall, 707-236-1500\nChief Executive Officer\nSource: AltaPacific Bancorp", "external_links": ["http://www.businesswire.com/news/home/20180119005839/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.apbconnect.com&esheet=51746329&newsitemid=20180119005839&lan=en-US&anchor=www.apbconnect.com&index=1&md5=a39af5575e87b03f69d39e96cfedfab2"], "published": "2018-01-20T02:20:00.000+02:00", "crawled": "2018-01-20T02:58:11.011+02:00", "highlightTitle": ""}