{"organizations": [], "uuid": "b90c04262ef36d459858f28f64aa5b6cde1997c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-capspecialtya-acquires-renewal-rights-to-rockhill-insurance-groups-environmental-business.html", "country": "US", "domain_rank": 767, "title": "CapSpecialty® Acquires Renewal Rights to Rockhill Insurance Group's Environmental Business", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T08:01:00.000+02:00", "replies_count": 0, "uuid": "b90c04262ef36d459858f28f64aa5b6cde1997c0"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-capspecialtya-acquires-renewal-rights-to-rockhill-insurance-groups-environmental-business.html", "ord_in_thread": 0, "title": "CapSpecialty® Acquires Renewal Rights to Rockhill Insurance Group's Environmental Business", "locations": [], "entities": {"persons": [{"name": "stephen sills", "sentiment": "none"}, {"name": "keefe", "sentiment": "none"}, {"name": "rockhill", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "rockhill", "sentiment": "none"}], "organizations": [{"name": "capitol indemnity corporation", "sentiment": "negative"}, {"name": "acquires renewal rights to rockhill insurance group's environmental business", "sentiment": "neutral"}, {"name": "capitol specialty insurance corporation", "sentiment": "none"}, {"name": "state auto insurance group (state auto", "sentiment": "none"}, {"name": "stifel company", "sentiment": "none"}, {"name": "bruyette & woods, inc.", "sentiment": "none"}, {"name": "rockhill insurance group", "sentiment": "none"}, {"name": "state auto", "sentiment": "none"}, {"name": "alleghany corporation", "sentiment": "none"}, {"name": "rockhill", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 16, 2018 /PRNewswire/ -- Capitol Indemnity Corporation, a wholly-owned subsidiary of CapSpecialty, Inc. (CapSpecialty), announces that it has acquired the renewal rights to Rockhill Insurance Group's (Rockhill) environmental book of business. CapSpecialty is an indirect wholly-owned subsidiary of Alleghany Corporation and Rockhill is a member of the State Auto Insurance Group (State Auto). CapSpecialty, through its specialty carrier, Capitol Specialty Insurance Corporation, will begin quoting all new business submissions made to Rockhill as well as renewals sometime in the first quarter of 2018. Financial terms of the transaction were not disclosed. Keefe, Bruyette & Woods, Inc., a Stifel Company, served as financial advisor to State Auto in the transaction.\nStephen Sills, CEO of CapSpecialty, commented, \"By adding Rockhill's environmental book to CapSpecialty's existing environmental book, the Company will further strengthen its presence in this important coverage segment for small to mid-sized businesses. Rockhill's brokers will be happy to hear that we are bringing on the Rockhill employees currently working on this book. \"\n\"CapSpecialty is committed to offering our wholesale brokers and insured customers access to strong environmental coverage, and Rockhill's appetite, products and focus on small to mid-sized business are all well aligned with those of CapSpecialty,\" said Tony Anzalone, Head of Specialty Casualty at CapSpecialty.\nMike LaRocco, president and CEO of State Auto, noted, \"We're pleased we've reached this agreement with CapSpecialty, which will leverage the strong Rockhill environmental team that's already in place. I wish them all great success.\"\nAbout State Auto\nState Automobile Mutual Insurance Company, headquartered in Columbus, Ohio, is a super-regional property and casualty insurance holding company. The company is primarily engaged in writing personal and business insurance products exclusively through independent insurance agencies in 33 states and is proud to be a Trusted Choice ® company partner.\nState Auto Mutual is part of the State Auto Group. The State Auto Group markets its insurance products throughout the United States, through independent insurance agencies, which include retail agencies and wholesale brokers. The State Auto Group is rated A- (Excellent) by the A.M. Best Company and includes State Automobile Mutual, State Auto Financial Corporation, State Auto Property & Casualty, State Auto Ohio, State Auto Wisconsin, Milbank, Meridian Security, Patrons Mutual, Rockhill Insurance, Plaza Insurance, American Compensation and Bloomington Compensation. Additional information can be found online at http://www.StateAuto.com .\nAbout CapSpecialty\nCapSpecialty, Inc. provides specialty insurance solutions for small and mid-sized business across the U.S. CapSpecialty's experienced management and underwriting teams come from top insurance companies and bring with them a wealth of knowledge and an innovative approach to risk, providing the pricing its customers need for the exposures they are trying to protect. CapSpecialty's affiliates, Capitol Indemnity Corporation, Platte River Insurance Company, and Capitol Specialty Insurance Corporation, offer a full inventory of specialty lines, including casualty, fidelity, surety, healthcare, professional lines and commercial property on both an admitted and non-admitted basis. CapSpecialty's affiliates are rated A (Excellent) by the A.M. Best Company.\nView original content with multimedia: http://www.prnewswire.com/news-releases/capspecialty-acquires-renewal-rights-to-rockhill-insurance-groups-environmental-business-300582143.html\nSOURCE CapSpecialty", "external_links": ["http://www.prnewswire.com/news-releases/capspecialty-acquires-renewal-rights-to-rockhill-insurance-groups-environmental-business-300582143.html"], "published": "2018-01-16T08:01:00.000+02:00", "crawled": "2018-01-16T08:30:43.053+02:00", "highlightTitle": ""}