{"organizations": [], "uuid": "dcfbb7c239e29a0aa746c799dc4e9675de71b318", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224411931&w=1200&r=LYNXMPEE0M0IV", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-indonesia-usa-mattis/indonesia-looks-to-u-s-to-relax-limits-on-its-special-forces-idUSKBN1FC0WG", "country": "US", "domain_rank": 408, "title": "Indonesia looks to U.S. to relax limits on its special forces", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T10:54:00.000+02:00", "replies_count": 0, "uuid": "dcfbb7c239e29a0aa746c799dc4e9675de71b318"}, "author": "", "url": "https://www.reuters.com/article/us-indonesia-usa-mattis/indonesia-looks-to-u-s-to-relax-limits-on-its-special-forces-idUSKBN1FC0WG", "ord_in_thread": 0, "title": "Indonesia looks to U.S. to relax limits on its special forces", "locations": [], "entities": {"persons": [{"name": "ryamizard ryacudu", "sentiment": "none"}, {"name": "kopassus", "sentiment": "none"}, {"name": "phil stewart", "sentiment": "none"}, {"name": "jim mattis", "sentiment": "none"}, {"name": "mattis", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "indonesia", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "jakarta", "sentiment": "none"}, {"name": "east timor", "sentiment": "none"}], "organizations": [{"name": "min read  jakarta", "sentiment": "none"}, {"name": "agustinus beo da costa", "sentiment": "none"}, {"name": "kopassus", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "defense", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JAKARTA (Reuters) - Indonesia said on Tuesday it was pinning its hopes on U.S. Defense Secretary Jim Mattis to help ease American limitations on ties with an elite Indonesian special forces unit, imposed over human rights abuses in the 1990s.\nThe United States announced in 2010 that it had lifted its outright ban on U.S. military contacts with the 6,000-member Indonesian unit, known as Kopassus, which was accused of rights abuses in East Timor as it prepared for independence.\nBut legal restrictions meant to ensure the U.S. military does not become entangled with rights abusers prevented contacts with Kopassus from advancing beyond preliminary levels, U.S. officials say.\nMattis, following talks with Indonesian Defense Minister Ryamizard Ryacudu, said he believed Kopassus had reformed enough that more cooperation was warranted under existing law. But he did not say how much cooperation to expect, or how soon.\nRyacudu was hopeful that restrictions on Kopassus could be lifted.\n“For a while there have been sanctions against Kopassus ... (Mattis) will try to remove this,” Ryacudu told reporters in Jakarta after the talks with Mattis.\n“One of the sanctions is clearly that they are not allowed to go to America. They can’t do training together, and he will reopen this.”\nThe talks about Kopassus came as the United States looks to deepen defense cooperation with Indonesia, the world’s third largest democracy and the most populous Muslim-majority nation. That includes things like arms sales, military exercises and educational exchanges.\nMattis noted that many of the allegations against Kopassus were some two decades old, and added he would work within existing U.S. law to explore ways to deepen cooperation.\n“Under our rules there are established procedures for rehabilitating a unit that has been alleged or has committed certain acts,” Mattis told a small group of reporters.\n“And we will go through the established procedures.”\nIndonesia's Defence Minister Ryamizard Ryacudu and visiting U.S. Secretary of Defence Jim Mattis are seen during a welcome ceremony in Jakarta, Indonesia January 23, 2018. REUTERS/Darren Whiteside NORTH NATUNA SEA Mattis’ trip came as Indonesia, a vast archipelago of 17,000 islands, appears increasingly ready to assert its sovereignty in the contested South China Sea.\nIndonesia has clashed with China over fishing rights around the Natuna Islands, detaining Chinese fishermen and expanding its military presence in the area in recent years.\nSlideshow (2 Images) In July, Indonesia renamed the northern reaches of its exclusive economic zone in the South China Sea as the North Natuna Sea, a move seen as a significant act of resistance to China’s territorial ambitions in the South China Sea.\nMattis seized upon Indonesia’s name for the waterway as he praised the country’s strategic maritime reach, calling the country “a maritime fulcrum of the Indo-Pacific area.”\n“It’s critical,” Mattis said of Indonesia.\n“We can help maintain maritime domain awareness in the South China Sea, the North Natuna Sea. This is something that we look forward to doing.”\nThe United States is one of Indonesia’s top arms suppliers, recently delivering Boeing’s Apache helicopters and 24 of Lockheed Martin’s F-16 fighter jets. But Indonesia also buys arms from U.S. rivals, including Russia.\nU.S. officials said Indonesia asked for pricing for an additional 48 F-16 aircraft, a deal which could be worth $4.5 billion. But Indonesia played down any imminent purchase and suggested it was still evaluating how many more aircraft it needed.\nRyacudu said Indonesia would buy weaponry when it “has the money.”\n“We only just bought F16s and everything. In (the) future there will definitely be (more purchases) because, as the years go by, there are things that must be replaced,” he said.\nReporting by Phil Stewart; Editing by Edward Davies and Nick Macfie\n ", "external_links": [], "published": "2018-01-23T10:54:00.000+02:00", "crawled": "2018-01-23T11:10:49.013+02:00", "highlightTitle": ""}