{"organizations": [], "uuid": "730af031cdc36c88ade287db849196da22dc94a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180128&t=2&i=1226049038&w=1200&r=LYNXMPEE0R0N3", "site_section": "http://www.reuters.com/resources/archive/us/20180128.html", "section_title": "Archive News &amp; Video for Sunday, 28 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-tennis-ausopen-federer-quotes/twenty-majors-down-federer-thrilled-as-fairytale-continues-idUSKBN1FH0PK", "country": "US", "domain_rank": 408, "title": "Twenty majors down, Federer thrilled as fairytale continues", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T23:45:00.000+02:00", "replies_count": 0, "uuid": "730af031cdc36c88ade287db849196da22dc94a0"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-tennis-ausopen-federer-quotes/twenty-majors-down-federer-thrilled-as-fairytale-continues-idUSKBN1FH0PK", "ord_in_thread": 0, "title": "Twenty majors down, Federer thrilled as fairytale continues", "locations": [], "entities": {"persons": [{"name": "roger federer", "sentiment": "negative"}, {"name": "federer", "sentiment": "negative"}, {"name": "andy murray", "sentiment": "none"}, {"name": "nadal", "sentiment": "none"}, {"name": "rafael nadal", "sentiment": "none"}, {"name": "novak djokovic", "sentiment": "none"}, {"name": "marin cilic", "sentiment": "none"}, {"name": "ken rosewall", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "rod laver arena", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MELBOURNE (Reuters) - Roger Federer savored the latest chapter of a late-career fairytale that delivered a sixth Australian Open crown on Sunday and a very “special” 20th grand slam title.\nFederer, a nervous defending champion, survived a second set ‘freeze’ and a late rally by sixth seed Marin Cilic before winning 6-2 6-7(5) 6-3 3-6 6-1 under the closed roof of Rod Laver Arena.\nAfter a five-year drought, a rejuvenated Federer has bagged three grand slam titles in the past 12 months, emulating Australia’s Ken Rosewall who claimed the same number after his 35th birthday.\nSince his maiden major title at Wimbledon in 2003, several generations of young pretenders have come and gone, yet Federer has outlasted them all.\nHe has now shared the last five grand slam titles with 31-year-old Spanish great and long-time rival Rafael Nadal, a state of affairs, the Swiss said, he could scarcely believe.\nBut with his other ‘Big Four’ rivals -- Nadal, Novak Djokovic and Andy Murray -- struggling with injuries and the ‘NextGen’ talents yet to make a breakthrough, the tally could well rise if he manages his body and schedule correctly.\n“Honestly, I don’t know. I have no idea. I’ve won three slams now in 12 months. I can’t believe it myself,” the 36-year-old Federer told reporters.\n”I just got to keep a good schedule, stay hungry, then maybe good things can happen. Then I don’t think age is an issue, per se. It’s just a number.\n”But I need to be very careful in my planning, really decide beforehand what are my goals, what are my priorities.\n“I think that’s what’s going to dictate how successful I will be,” added Federer, whose decision to skip the entire claycourt season last year despite being fit paid off when he claimed a record eighth Wimbledon title last July.\n“Exciting times ahead.”\nTennis - Australian Open - Melbourne, Australia, January 28, 2018. Fans react as they wait for men's singles winner Roger Federer of Switzerland to appear with the trophy. REUTERS/Issei Kato Although speeding to victory in the deciding set, Federer came into the match a bundle of nerves, having been denied a proper semi-final against South Korea’s Chung Hyeon, who retired hurt in the second set.\n“I didn’t fall asleep very well after the Chung match,” said Federer.\n”I think it surprised me that at this stage of a competition in semis, to get a walkover, that was very odd for me.\nTennis - Australian Open - Men's singles final - Rod Laver Arena, Melbourne, Australia, January 28, 2018. Supporters of Roger Federer of Switzerland display a sign during Federer's match against Marin Cilic of Croatia. REUTERS/Thomas Peter ”I couldn’t fall asleep until about three in the morning.\n”All of the next day I was already thinking about how should I play Marin, ‘how cool would it be to win 20?', but no, don’t think of it, ‘but how horrible would it be to lose it’.\n“I had it for over 36 hours, to be honest. It was a lot.”\nCilic roared back into the match after the opening set and had break points on Federer’s serve early in the decider.\nThe Swiss said experience and “a bit of luck” had got him over the line to equal Djokovic and Roy Emerson’s record of six Australian Open titles.\n“Defending my title from last year, sort of the fairytale continues,” he said.\n”That’s what stands out for me, maybe not equalling Emerson or Novak. They had their own unbelievable careers.\n“It’s definitely a very special moment in my life again.”\nEditing by Pritha Sarkar\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-28T23:45:00.000+02:00", "crawled": "2018-01-29T21:58:59.000+02:00", "highlightTitle": ""}