{"organizations": [], "uuid": "d8a2e73dc2d19bb387a86e126e26556c84009dbe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226247288&w=1200&r=LYNXMPEE0S0KT", "site_section": "http://www.reuters.com/resources/archive/us/20180129.html", "section_title": "Archive News &amp; Video for Monday, 29 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/uk-britain-eu-energy/uk-risks-higher-energy-prices-supply-shortages-from-brexit-lawmakers-idUSKBN1FI001", "country": "US", "domain_rank": 408, "title": "UK risks higher energy prices, supply shortages from Brexit - lawmakers", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-29T08:52:00.000+02:00", "replies_count": 0, "uuid": "d8a2e73dc2d19bb387a86e126e26556c84009dbe"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/uk-britain-eu-energy/uk-risks-higher-energy-prices-supply-shortages-from-brexit-lawmakers-idUSKBN1FI001", "ord_in_thread": 0, "title": "UK risks higher energy prices, supply shortages from Brexit - lawmakers", "locations": [], "entities": {"persons": [{"name": "holland", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "france", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "neutral"}, {"name": "european union", "sentiment": "neutral"}, {"name": "internal energy market", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Britain’s decision to leave the European Union could lead to higher energy prices and energy supply shortages if the exit is not managed properly, a report by an upper-house parliamentary committee said on Monday.\nBritain imports around 5-6 percent of its electricity via power links with France, Holland and Ireland, while around 40 percent of the country’s gas supply comes via Norwegian and European pipelines.\nThe report, published by the cross-party House of Lords, said post-Brexit, Britain’s energy trading outside of Europe’s Internal Energy Market will likely be less efficient than the current arrangements.\n“This creates the potential for higher energy bills, and leaving the EU could risk supply shortages in the event of extreme weather or unplanned generation outages,” it said.\nThe report said the government should carry out a full assessment on the impact of leaving Europe’s energy market and set out plans on how it expects to manage any severe supply shortages.\nThe EU operates a solidarity principle regarding gas, which means in the event of a serious crisis member states are expected to help each other maintain supplies.\nBritain’s role in the arrangement, once it leaves the European Union in March 2019 is unclear.\nThe report also called on the government to review the possibility of creating a special transition period arrangement for the country’s participation the European Atomic Energy Community (Euratom), separate from the wider Brexit process.\nThe government said it was working on its future relationship with the EU, including arrangements for trading energy and nuclear material.\n“We are also committed to a domestic nuclear safeguards regime that is as robust and as comprehensive as that provided by Euratom. This regime will be created by the Nuclear Safeguards Bill, which is currently in Parliament and recently passed its Commons Committee stage,” a spokeswoman said.\nExperts have said that if Britain leaves Euratom, there is a risk of new-build projects being delayed or put on hold while new stand-alone nuclear cooperation treaties are negotiated with countries in the EU and outside it.\nNuclear plants supply around 20 percent of Britain’s electricity and the government hopes a new fleet of plants, starting with EDF’s ( EDF.PA ) Hinkley Point C, will be built to help replace ageing coal and nuclear plants set to close in the 2020s.\n“Failure to replace (Euratom‘s) provisions by the point of withdrawal could result in the UK being unable to import nuclear materials, bringing the UK’s civil nuclear industry to a halt,” the report said.\nReporting by Susanna Twidale; additional reporting by Nina Chestney; Editing by Elaine Hardcastle and Louise Heavens\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-29T08:52:00.000+02:00", "crawled": "2018-01-30T18:55:50.001+02:00", "highlightTitle": ""}