{"organizations": [], "uuid": "d43f3f0014a5ceb3c589a82691c49dda412dda1c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/30/104976185-GettyImages-860933734_1.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/sterling-predicted-to-hit-pre-brexit-vote-level-before-the-end-of-2018.html", "country": "US", "domain_rank": 767, "title": "Sterling predicted to hit pre-Brexit vote level before the end of 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.015, "site_type": "news", "published": "2018-01-30T15:27:00.000+02:00", "replies_count": 0, "uuid": "d43f3f0014a5ceb3c589a82691c49dda412dda1c"}, "author": "Silvia Amaro", "url": "https://www.cnbc.com/2018/01/30/sterling-predicted-to-hit-pre-brexit-vote-level-before-the-end-of-2018.html", "ord_in_thread": 0, "title": "Sterling predicted to hit pre-Brexit vote level before the end of 2018", "locations": [], "entities": {"persons": [{"name": "stephen gallo", "sentiment": "none"}, {"name": "matt cardy", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}], "organizations": [{"name": "european union sterling", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "wto", "sentiment": "none"}, {"name": "u.s. federal reserve", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "world trade organization", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sterling had been on a downward trend since the U.K.'s vote to leave the European Union in 2016, but reduced concerns over an abrupt break-up with the EU are sending the currency higher.\nThe pound traded at $1.40 against the dollar Tuesday morning, not only boosted by a weaker dollar, but also because traders are more confident that the U.K. will strike a deal with the EU and thus avoid a so-called hard Brexit , where the U.K. and the EU would be trading under World Trade Organization (WTO) rules.\n\"(Prime Minister) Theresa May does not have the political capital or the unity within the government to implement a 'hard Brexit,'\" Stephen Gallo, head of European forex strategy at BMO Capital Markets told CNBC via email Tuesday.\n\"Other factors like the Irish border issue have also tied her hands in this regard. Conservative, pro-Brexit ministers and MPs are loathe to undermine Theresa May out of fears of toppling the government and paving the way for a snap election. For these reasons, we revised up our 12-month view in GBP-USD to $1.45 last October,\" he said.\nOn June 23, 2016, the day the U.K. held a referendum on its EU membership, sterling was at $1.48. It tumbled on the following day to $1.36 and touched $1.20 in January 2017. According to Gallo's predictions, if Brexit negotiations produce some sort of deal between the U.K. and the EU, sterling could be back to its pre-Brexit values by the end of the year.\n\"We also think the big debate on the U.K.'s post-Brexit relationship with the EU will be kicked into the two-year transition and implementation period, which begins on March 30, 2019. In the context of a weak U.S. dollar and strong global growth, our new 12-month GBP-USD view is now $1.52.\"\nshow chapters Sterling hits post-Brexit high versus the US dollar 6:56 AM ET Fri, 19 Jan 2018 | 02:10 Kallum Pickering, senior U.K. economist at Berenberg, told CNBC on Tuesday that he expects cable, the exchange rate between the British pound and the U.S. dollar, to trade at $1.45 by the end of the year.\n\"Sterling would likely make further gains over the course of 2018,\" he said in an email. \"Is sterling undervalued? Yes — as long as the U.K. avoids a hard Brexit. Currently, sterling embodies a range of potential outcomes for Brexit. That includes the risk of a hard Brexit.\n\"If the U.K. avoids this risk. sterling is probably undervalued on real trade-weighted basis by between 5 and 10 percent.\"\nThe EU proposed Monday a transition period of one year and seven months, from March 29, 2019 until the end of 2020, which is in line with the length of time that the U.K. government was seeking.\nHowever, the EU has also asked for more clarity from the U.K. government on how it wants the future relationship to be. So far, London and Brussels have made some agreements on citizens' rights, the Irish border and the exit bill, but there are still many detailed subjects to define. These range from fishing quotas to energy transmissions to financial services, just to name a few.\nOn Tuesday a leaked report showed an analysis from the U.K. government saying that the country will be worse off outside the EU in every possible scenario.\nFed rate pattern could influence cable Seamus Mac Gorain, senior fixed income portfolio manager at J.P. Morgan Asset Management, told CNBC that an agreement over a Brexit transition period, a weaker dollar and a stronger-than-expected U.K. economy are sterling supportive and he therefore sees downside risks to cable trade.\nHowever, he warned that the market could be potentially downplaying an important factor: how many rate hikes the U.S. Federal Reserve puts through over the year. He told CNBC that if the Fed hikes more than three times, there is the risk that the dollar could strengthen and thus reduce the scope for sterling appreciation.\nThe same factor is making Samuel Tombs, chief U.K. economist at Pantheon Macroeconomics, more bearish on sterling than some of his peers.\n\"I think sterling will struggle to rise further against the dollar. Markets now are pricing-in little risk of a hard Brexit. I agree with them, but the risks are all to the downside,\" he said.\n\"In addition, while markets' expectations for U.K. rate hikes look about right, we think investors are underestimating how far the U.S. Fed will raise rates this year. So, I see sterling falling back to $1.38 by the middle of this year.\"", "external_links": [], "published": "2018-01-30T15:27:00.000+02:00", "crawled": "2018-01-30T15:28:47.044+02:00", "highlightTitle": ""}