{"organizations": [], "uuid": "aa74ae96f6d8bf9c23fbef7fa54fa77db07433d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225279781&w=1200&r=LYNXMPEE0O1OK", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-gymnastics-usa-nassar-lawsuits-analys/victim-testimony-raises-settlement-pressure-in-u-s-nassar-suit-idUKKBN1FE32M", "country": "US", "domain_rank": 408, "title": "Victim testimony raises settlement pressure in U.S. Nassar suit", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T23:39:00.000+02:00", "replies_count": 0, "uuid": "aa74ae96f6d8bf9c23fbef7fa54fa77db07433d3"}, "author": "", "url": "https://uk.reuters.com/article/uk-gymnastics-usa-nassar-lawsuits-analys/victim-testimony-raises-settlement-pressure-in-u-s-nassar-suit-idUKKBN1FE32M", "ord_in_thread": 0, "title": "Victim testimony raises settlement pressure in U.S. Nassar suit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 9:42 PM / Updated 2 hours ago Victim testimony raises settlement pressure in U.S. Nassar suit Tina Bellon 6 Min Read \nNEW YORK (Reuters) - Searing victim testimony during former American gymnastics team doctor Larry Nassar’s sentencing hearing has ratched up pressure on the sport’s U.S. governing body and Michigan State University to settle civil lawsuits by girls and women seeking to hold them responsible for his years of sexual abuse, legal experts said. \nThe lawsuits seeking unspecified monetary damages from USA Gymnastics, which used Nassar as team doctor for years, and Michigan State, where he worked as a professor, were filed in January 2017 in federal court in Grand Rapids, Michigan, and were later consolidated into a single case. \nSettlement talks between the defendants and lawyers representing 140 of Nassar’s victims broke down in December, said David Mittleman, an attorney representing some of the plaintiffs. He declined to say why the talks ended but said plaintiffs’ lawyers were now preparing to go to trial. \nLegal experts said USA Gymnastics and Michigan State would need to consider the potential public relations disaster of aggressively challenging a group of very sympathetic plaintiffs in court. \n“You can win the battle, but lose the war,” said Karen Bitar, a New York lawyer who specializes in defending universities. \nA Michigan judge on Wednesday sentenced Nassar to 40 to 175 years in prison for sexually abusing young female athletes in his care. Nassar, 54, served as the U.S. gymnastics team physician for several Olympic Games through 2012 and worked at Michigan State since the 1990s. \nMany lawyers compared a potential settlement in the case with the $93 million paid by another university, Penn State, to resolve 30 rape and abuse claims brought against former assistant football coach Jerry Sandusky, who was convicted in 2012 and is serving a 30- to 60-year prison sentence. \nThe current case involves more than four times as many claimants as the Penn State litigation, and Mittleman said more Nassar abuse victims are expected to come forward. \nUSA Gymnastics and Michigan State did not respond to requests for comment on whether they would resume settlement talks. Both have asked the judge to dismiss the litigation, arguing, among other things, that they owed no duty of care to the victims. \nNassar was sentenced followed an extraordinary week-long hearing in which 160 of his victims, most of whom were minors at the time they were abused, unflinchingly told their stories. \nThese included star Olympic gymnasts like gold medallists Aly Raisman and Jordyn Wieber, Michigan State athletes and other girls whose parents had sought him out based on his high profile within the sport. Nassar family friend Kyle Stephens was only 6 years old when Nassar began molesting her, and she testified that the abuse ripped apart her family and may have caused her father’s suicide. \n“I’ve never seen anything like it,” said Eric MacLeish, a Cambridge, Massachusetts lawyer who represented hundreds of sexual abuse victims in cases against the Catholic church involving paedophile priests. \n‘LIGHT YEARS AWAY’ \nMacLeish predicted that the public outcry stemming from the victim testimony and sentencing would drive the defendants back to the negotiating table to reach a settlement. \n“December seems like light years away in terms of all the outrage and publicity,” MacLeish said, referring to when the settlement talks ended. \nIn their lawsuit, the plaintiffs claim that USA Gymnastics and Michigan State representatives were aware of Nassar’s conduct as early as 1998 but failed to take action, resulting in the sexual abuse of dozens of girls until 2016, when the university fired Nassar. \nThe pressure on Michigan State was illustrated by the resignation of the school’s president, Lou Anna Simon, just hours after the sentencing. \nIn motions filed this month to dismiss the lawsuits, USA Gymnastics and Michigan State argued that most of the allegations were barred by a statute of limitations requiring personal injury claims in Michigan to be brought within three years. \nUSA Gymnastics also argued that, because Nassar was a volunteer rather than a paid employee, it is not responsible for his actions. It also said it cannot be held liable for Nassar’s victims who were not gymnasts participating in events it sanctioned. \nMichigan State argued that much of Nassar’s abuse fell outside the scope of his employment. The public university also argued that it is shielded by the doctrine of sovereign immunity, which limits lawsuits against government bodies. \nPeter Henning, a law professor at Wayne State University in Michigan, said sovereign immunity protections are substantial and could lead a judge to dismiss many of the claims against Michigan State. \nStatutes of limitations often are the biggest impediment to lawsuits over sexual abuse from many years ago. \nBitar, the New York lawyer, said there was danger in pushing such defences. \n“All those legal arguments may be extraordinarily valid, but you don’t want to give the impression that you got out on a simple legal technicality,” Bitar said. Reporting by Tina Bellon; Editing by Anthony Lin and Will Dunham", "external_links": [], "published": "2018-01-25T23:39:00.000+02:00", "crawled": "2018-01-26T00:49:52.018+02:00", "highlightTitle": ""}