{"organizations": [], "uuid": "133caa412bc4f9c53cb9dc610d9b9ebf61c2b3d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/15/business-wire-yokogawa-electric-kbc-signs-consultancy-agreement-for-integration-of-oil-refineries-in-chinas-shandong-province.html", "country": "US", "domain_rank": 767, "title": "Yokogawa Electric: KBC Signs Consultancy Agreement for Integration of Oil Refineries in China's Shandong Province", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T05:00:00.000+02:00", "replies_count": 0, "uuid": "133caa412bc4f9c53cb9dc610d9b9ebf61c2b3d2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/15/business-wire-yokogawa-electric-kbc-signs-consultancy-agreement-for-integration-of-oil-refineries-in-chinas-shandong-province.html", "ord_in_thread": 0, "title": "Yokogawa Electric: KBC Signs Consultancy Agreement for Integration of Oil Refineries in China's Shandong Province", "locations": [], "entities": {"persons": [], "locations": [{"name": "tokyo", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "shandong province tokyo", "sentiment": "none"}, {"name": "shandong province", "sentiment": "none"}, {"name": "guangrao county", "sentiment": "none"}], "organizations": [{"name": "yokogawa electric", "sentiment": "negative"}, {"name": "yokogawa electric corporation", "sentiment": "negative"}, {"name": "kbc signs consultancy agreement for integration of oil refineries", "sentiment": "negative"}, {"name": "china energy engineering north co., ltd.", "sentiment": "none"}, {"name": "sinomec", "sentiment": "none"}, {"name": "china state energy engineering corp", "sentiment": "none"}, {"name": "kbc advanced technologies", "sentiment": "none"}, {"name": "kbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TOKYO--(BUSINESS WIRE)-- Yokogawa Electric Corporation (TOKYO: 6841) announces that its subsidiary, KBC Advanced Technologies, has signed a consultancy agreement with China Energy Engineering North Co., Ltd. for the integration of operations at six oil refineries in China’s Shandong Province. These refineries are being acquired and will be operated by China State Energy Engineering Corp. Ltd. (SINOMEC), a state-owned company, and China Energy Engineering North Co., Ltd., a SINOMEC group company.\nThere are many small-scale oil refineries in Shandong Province. To improve efficiency and better meet market needs, SINOMEC has decided to upgrade facilities and integrate operations at these six oil refineries, which are located in Guangrao County. KBC will provide consulting services to assist SINOMEC in meeting these objectives.\nThe consulting services offered by KBC are as follows:\n1. Conduct an integration study that will identify synergies for maximizing yield and profit.\n2. Verify a plan to expand and diversify production.\nKBC provides software and consultancy services that help to improve efficiency and profitability in the oil and gas upstream (exploration and production) and downstream (refining) sectors. The company’s services are held in high regard by customers around the world.\nThe decision to award KBC this contract took into consideration the company’s detailed knowledge of the oil industry and Yokogawa’s solid track record in China. Through its introduction of highly reliable control systems, products, and other advanced solutions, Yokogawa will help this customer achieve profitability, ensure safety, and protect the environment.\nAbout Yokogawa\nYokogawa's global network of 113 companies spans 60 countries. Founded in 1915, the US$3.5 billion company engages in cutting-edge research and innovation. Yokogawa is active in the industrial automation and control (IA), test and measurement, and aviation and other businesses segments. The IA segment plays a vital role in a wide range of industries including oil, chemicals, natural gas, power, iron and steel, pulp and paper, pharmaceuticals, and food. Targeting this segment, Yokogawa helps companies maximize their profits by offering a wide range of highly reliable products and working with the subsidiary KBC Advanced Technologies to provide premium solutions and services. For more information about Yokogawa, please visit www.yokogawa.com\nAbout KBC\nKBC is a wholly-owned subsidiary of Yokogawa Electric Corporation. KBC is the leading technology-based consulting company to the process industries which creates and sustains value for clients by effectively converting their strategies into results through technical and commercial excellence under-pinned by engineering simulation and analytics. Thereafter KBC sustains performance through the implementation of winning operating models and best practices that are powered by cloud, manufacturing execution system (MES) and automation technologies. For more information, visit www.kbcat.com\nThe names of companies, products, and brands in this text are registered trademarks or trademarks of the respective holders.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180115005246/en/\nYokogawa Electric Corporation\nPublic Relations, Integrated Communications Center\nYokogawa-pr@cs.jp.yokogawa.com\nSource: Yokogawa Electric Corporation", "external_links": ["http://www.businesswire.com/news/home/20180115005246/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.kbcat.com&esheet=51742942&newsitemid=20180115005246&lan=en-US&anchor=www.kbcat.com&index=2&md5=89166c500046d81667e2490d66849581", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.yokogawa.com%2F&esheet=51742942&newsitemid=20180115005246&lan=en-US&anchor=www.yokogawa.com&index=1&md5=f2c17f7d9c7c713918764fdedd663576"], "published": "2018-01-16T05:00:00.000+02:00", "crawled": "2018-01-16T06:54:22.002+02:00", "highlightTitle": ""}