{"organizations": [], "uuid": "459f1ec7d8dc20b9de720ad7e5ff30c9a7f30201", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226751728&w=1200&r=LYNXMPEE0T1N3", "site_section": "http://feeds.reuters.com/Reuters/domesticNews\r", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-new-york-bodycameras/new-york-city-says-accelerating-rollout-of-police-body-cameras-idUSKBN1FJ34X", "country": "US", "domain_rank": 408, "title": "New York City says accelerating rollout of police body cameras", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T01:37:00.000+02:00", "replies_count": 0, "uuid": "459f1ec7d8dc20b9de720ad7e5ff30c9a7f30201"}, "author": "", "url": "https://www.reuters.com/article/us-new-york-bodycameras/new-york-city-says-accelerating-rollout-of-police-body-cameras-idUSKBN1FJ34X", "ord_in_thread": 0, "title": "New York City says accelerating rollout of police body cameras", "locations": [], "entities": {"persons": [{"name": "gina cherelus", "sentiment": "none"}, {"name": "patrick lynch", "sentiment": "none"}, {"name": "bill de blasio", "sentiment": "none"}], "locations": [{"name": "new york city", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "benevolent association", "sentiment": "none"}, {"name": "pba", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - New York City said on Tuesday it would equip all police officers on patrol with body cameras by the end of 2018, advancing a program that began last year and drawing criticism from the city’s largest police union.\n“There are so many unresolved issues regarding the use of body cams, including the very basic question of whether they actually produce a meaningful change in the interaction between police officers and civilians on the street,” Patrick Lynch, president of the Patrolmen’s Benevolent Association, said in a statement.\nThe PBA sued the city in January over the release of body camera footage, months after the city released body camera footage from four officers who were involved in shooting.\nThe largest U.S. police department will start distributing body cameras this month and expects to have issued 18,000 units by the end of 2018, a year earlier than previously planned, Mayor Bill de Blasio’s office said in a statement.\n“You know that you’re going to be wearing that body camera, your actions are going to be seen by all. It’s a good reminder of how to approach situations,” de Blasio said at a news conference.\nThe police department said that only officers and detective specialists on patrol would be outfitted with body cameras. There are approximately 28,988 police officers and detectives on staff, according to the police department.\nWhen the program began as a pilot in April 2017, the police department said every patrol officer and detective would have cameras by the end of 2019. The city decided to accelerate the program after studying thousands of hours of video from 2,470 body cameras that have already been deployed.\n“I know that in some situations, these cameras have a great potential to deescalate rather than escalate,” Police Commissioner James O‘Neill said at a news conference on Tuesday. “It’s just not enough to keep people safe, you have to make sure people feel safe, too.”\nThe program will cost $5.9 million in 2018, $12 million in 2019 and $9.5 million in 2020 for cameras and technology upgrades.\nNew York City is among many U.S. cities that have approved or expanded the use of body cameras since August 2014, when a white police officer fatally shot Michael Brown, an unarmed black teenager in Ferguson, Missouri.\nThe incident, which was not captured on video, triggered protests and a national debate about the use of excessive force by police.\nDe Blasio said at the news conference that officers who failed to properly operate cameras would be penalized.\nReporting by Gina Cherelus; Editing by Frank McGurty\n ", "external_links": [], "published": "2018-01-31T01:37:00.000+02:00", "crawled": "2018-01-31T02:00:11.025+02:00", "highlightTitle": ""}