{"organizations": [], "uuid": "8d8391fb5bb0c8d107e7bda7e528d9bf4a0e6731", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180120&t=2&i=1223695984&w=1200&r=LYNXMPEE0J0SW", "site_section": "http://feeds.reuters.com/Reuters/domesticNews", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-usa-congress-shutdown-tourists/in-new-york-tourists-left-high-and-dry-as-statue-of-liberty-shuts-down-idUSKBN1F913C", "country": "US", "domain_rank": 408, "title": "In New York, tourists left high and dry as Statue of Liberty shuts down", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.723, "site_type": "news", "published": "2018-01-21T04:25:00.000+02:00", "replies_count": 0, "uuid": "8d8391fb5bb0c8d107e7bda7e528d9bf4a0e6731"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-congress-shutdown-tourists/in-new-york-tourists-left-high-and-dry-as-statue-of-liberty-shuts-down-idUSKBN1F913C", "ord_in_thread": 0, "title": "In New York, tourists left high and dry as Statue of Liberty shuts down", "locations": [], "entities": {"persons": [{"name": "mendez", "sentiment": "none"}, {"name": "brunella pettoroso", "sentiment": "none"}, {"name": "amparo mendez", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "battery park", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "new york harbor", "sentiment": "none"}, {"name": "ellis island", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "national park service", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 20, 2018 / 8:25 PM / Updated an hour ago In New York, tourists left high and dry as Statue of Liberty shuts down Chris Francescani , Ian Simpson 4 Min Read \nNEW YORK/WASHINGTON (Reuters) - Tourists who came to Battery Park in lower Manhattan hoping to catch a ferry to the Statue of Liberty in New York Harbor got an unpleasant surprise on Saturday, learning the must-see destination was closed thanks to a U.S. government shutdown. \nThe National Park Service announced on Friday afternoon that it would close the historic statue and nearby Ellis Island to visitors if Congress failed to reach a funding deal by midnight. \nApparently, not everyone got the word. \n“If they knew it was being shut down, they should have told us,” said Amparo Mendez, 17, an Argentine exchange student who came to Battery Park with a friend, having purchased tickets online last week to visit the statue and Ellis Island. \n“We came with the notion to see the Statue of Liberty, and it’s not the same to see it from here,” her friend, Brunella Pettoroso, 16, said, looking out over the harbor at the towering, green-tinged statue, a symbol of American democracy. \nNeither of them were aware of the government shutdown, and when the Washington deadlock was explained to them, Mendez rolled her eyes. \n“We’re not coming back,” Pettoroso said. \nIn Washington, open-air parks and monuments remained open despite the shutdown, including the Lincoln Memorial and the National Mall, where thousands of protesters gathered for the second annual Women’s March, staged on the first anniversary of President Donald Trump’s inauguration. \nAlso open was the Smithsonian Institution, but its museums and the National Zoo will close on Monday if lawmakers still have not reached a deal, it said in a statement. People look toward the Statue of Liberty from Battery Park following a U.S. government shutdown in Manhattan, New York, U.S., January 20, 2018. REUTERS/Andrew Kelly \nDallas Kay, a 26-year-old restaurant worker from Bend, Oregon, arrived at the Lincoln Memorial just after dawn on Saturday. He said he hoped for a quick resolution of the dispute, especially to keep national monuments and parks open. \n“These monuments and parks belong to the people,” he said. “Them getting shut down is a travesty.” \nHowever, Battery Park at the southern tip of Manhattan, where large groups of visitors often gather for ferry ride to the Statue of Liberty, it was unusually quiet for a Saturday. Slideshow (4 Images) \n“People have been a little bummed out, but they’re not mad at us,” said Matthew Rutter, an employee of Statue Cruises, which operates ferries to the islands, among New York’s most popular tourist destinations. “They are mad at the government.” \nStephen O’Malley, a retired medical professional from Fort Lauderdale, Florida, bought tickets months ago, when he and his wife, accountant Mary Hawks, began planning a trip to the statue and Ellis Island, the gateway for millions of U.S. immigrants in the late 19th and 20th centuries. The couple both blamed Washington lawmakers. \n“I have to put more blame on the Republicans, because they have all the control right now,” O’Malley said. \n“But I don’t blame it all on them. They should have been able to make a deal,” he said of both Republicans and Democrats, before heading off to walk across the Brooklyn Bridge. \nAndrew Riano, 25, of New York City’s Staten Island borough, was in Battery Park dressed as the Statue of Liberty. He said he gets tips from tourists who pose for pictures with him. But the regular crowds he sees on sunny weekend days were nowhere to be found. \n“A lot of people are disappointed,” he said, taking a break on a park bench. “They pay to go to the statue and they can’t go.” Writing by Frank McGurty; Editing by Jonathan Oatis", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-21T04:25:00.000+02:00", "crawled": "2018-01-20T23:06:33.004+02:00", "highlightTitle": ""}