{"organizations": [], "uuid": "625f858df46c3f3c5f1401ab1445b2a6478202b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/business-wire-midocean-partners-acquires-bh-cosmetics-a-leading-color-cosmetics-brand.html", "country": "US", "domain_rank": 767, "title": "MidOcean Partners Acquires BH Cosmetics, a Leading Color Cosmetics Brand", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-04T20:30:00.000+02:00", "replies_count": 0, "uuid": "625f858df46c3f3c5f1401ab1445b2a6478202b5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/business-wire-midocean-partners-acquires-bh-cosmetics-a-leading-color-cosmetics-brand.html", "ord_in_thread": 0, "title": "MidOcean Partners Acquires BH Cosmetics, a Leading Color Cosmetics Brand", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "midocean partners acquires bh cosmetics", "sentiment": "negative"}, {"name": "midocean partners", "sentiment": "negative"}, {"name": "bh cosmetics", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "bh", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- MidOcean Partners (“MidOcean”), a premier middle market private equity firm focused on consumer and business services, announced today that it has acquired BH Cosmetics (“BH” or the “Company”), a leading digitally native color cosmetics brand. MidOcean’s investment will be used to drive BH’s continued growth and expansion. BH’s founders will retain a significant ownership stake in the Company. Financial terms of the transaction were not disclosed.\nLaunched in 2009, BH is a leading, direct-to-consumer color cosmetics brand focused on the Millennial / Generation Z consumer. BH offers a full suite of high-quality color cosmetics including products for the face, lips, eyes, brows as well as brushes and accessories. The Company has a worldwide social media following across multiple platforms and utilizes a deep influencer network to drive brand awareness and customer acquisition. Given the Company’s heritage as a digitally native e-commerce color cosmetics brand, BH has developed an advanced e-commerce platform with proven capabilities in customer acquisition, consumer engagement and customer loyalty.\nMidOcean has maintained a longtime focus on the beauty sector, including its acquisition of IMAGE Skincare in August 2015. Consistent with its theme-driven investment approach, MidOcean worked closely with its management resources in identifying and evaluating opportunities in the beauty sector, resulting in the acquisition of BH.\nBH will continue to be led by founders Fred Sadovskiy (CEO), Kirill Trachtenberg (Chief Strategy Officer), and Robert Sefaradi (COO), under whose leadership the Company has grown into an internationally-recognized brand in the color cosmetics market. BH will look to expand the Company’s reach in current and new markets in partnership with MidOcean’s considerable operating resources.\nFred Sadovskiy, BH Co-Founder and CEO, commented, “We are very excited to begin our partnership with MidOcean. MidOcean has tremendous resources and experience building branded consumer products platforms and has a proven track record of helping take founder-led consumer businesses to the next level. We are confident that MidOcean will be an excellent partner for BH as we look to continue BH’s expansion in the color cosmetics market.”\nKirill Trachtenberg, BH Co-Founder and Chief Strategy Officer, added, “BH was launched in 2009 with a focus on eye palettes and has since developed a full suite of cosmetics with high quality products at value price points. The partnership with MidOcean will enable us to dedicate additional resources to key areas of our business including innovation and product development, marketing and branding and customer service. We believe there is a tremendous opportunity to accelerate BH’s growth and have been very impressed with MidOcean’s collaborative approach to developing and helping implement a growth strategy for BH.”\nRobert Sefaradi, BH Co-Founder and COO, further stated, “MidOcean’s experience building leading consumer brands and deep understanding of the industry makes them the ideal partner for BH. We have successfully accelerated BH’s growth in recent years by expanding into wholesale and international markets. With MidOcean’s partnership and guidance, BH will have the resources, industry knowledge and expertise to help take our Company and brand to the next level.”\nJonathan Marlow, Managing Director at MidOcean, concluded, “We are incredibly excited to partner with BH, a leading color cosmetics brand with a strong direct-to-consumer and digital marketing business model and multiple levers for continued growth. MidOcean has significant experience building strong consumer brands with founder-owned businesses and we believe that BH Cosmetics has substantial opportunities for continued growth and expansion fueled by appropriate investments in people, infrastructure and marketing. We see numerous opportunities to increase BH’s presence across channels and geographies and look forward to working with Fred, Kirill, Robert and the talented team at BH to drive this growth.”\nKirkland & Ellis acted as legal advisor to MidOcean. The Sage Group acted as exclusive financial advisor and Sheppard Mullin Richter & Hampton LLP acted as legal advisor to BH Cosmetics.\nAbout BH Cosmetics\nBH Cosmetics is a leading digitally native color cosmetics brand offering a full suite of high-quality color cosmetics including products for the face, lips, eyes, brows as well as brushes and accessories. Born and raised in the City of Angels, BH Cosmetics thrives on the cultural and stylistic diversity that makes Los Angeles unique. We’re proud to bring you high-performance makeup in vivid colors that unite style and glam—a philosophy that continues to make us a leader in the beauty industry. Constantly evolving, we’re passionate about discovering new beauty innovations and surpassing expectations at every turn. We believe that when you look good, you feel good and when you feel good, you do great things! That’s why BH Cosmetics is here to help you express your individuality one bold, brilliant, and beautiful color at a time. For additional information, please visit BH Cosmetic’s website ( www.bhcosmetics.com ).\nAbout MidOcean Partners\nEstablished in 2003, MidOcean Partners is a premier New York-based alternative asset manager that specializes in middle market private equity and alternative credit investments. Since inception, the focus of the private equity funds has been on high-quality middle market companies with attractive strategic, operational and financial growth opportunities in the consumer and business services sectors. MidOcean Credit Partners was launched in 2009 and manages approximately $6.9 billion across a series of alternative credit strategies, collateralized loan obligations (“CLOs”), and customized separately managed accounts as of November 30, 2017. For more information, please visit MidOcean’s website ( www.midoceanpartners.com ).\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180104005972/en/\nMidOcean Media Relations\nGasthalter & Co.\nNathaniel Garnick/Amanda Klein\n212-257-4170\nmidocean@gasthalter.com\nor\nMidOcean Investor Relations\nMidOcean Partners\nSpencer Potts/Bradley Tipper\nIR@midoceanpartners.com\nSource: MidOcean Partners", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.bhcosmetics.com&esheet=51738007&newsitemid=20180104005972&lan=en-US&anchor=www.bhcosmetics.com&index=1&md5=a50564f35b01e790ece1ce3ede8352e8", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.midoceanpartners.com&esheet=51738007&newsitemid=20180104005972&lan=en-US&anchor=www.midoceanpartners.com&index=2&md5=a5ad0f591e3445813d6c5de0f1a02473", "http://www.businesswire.com/news/home/20180104005972/en/"], "published": "2018-01-04T20:30:00.000+02:00", "crawled": "2018-01-04T23:05:26.000+02:00", "highlightTitle": ""}