{"organizations": [], "uuid": "2dbe91d74cbca9dca44331206ef2e3ee361bc9f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/sportsNews/", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-basketball-nba/celtics-76ers-out-to-put-on-a-show-for-london-nba-fans-idUSKBN1EZ2A8", "country": "US", "domain_rank": 408, "title": "Celtics, 76ers out to put on a show for London NBA fans", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T19:26:00.000+02:00", "replies_count": 0, "uuid": "2dbe91d74cbca9dca44331206ef2e3ee361bc9f4"}, "author": "", "url": "https://www.reuters.com/article/us-basketball-nba/celtics-76ers-out-to-put-on-a-show-for-london-nba-fans-idUSKBN1EZ2A8", "ord_in_thread": 0, "title": "Celtics, 76ers out to put on a show for London NBA fans", "locations": [], "entities": {"persons": [{"name": "kyrie irving", "sentiment": "none"}, {"name": "gordon hayward", "sentiment": "none"}, {"name": "ben simmons", "sentiment": "none"}, {"name": "jack tarrant", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}], "organizations": [{"name": "london nba", "sentiment": "negative"}, {"name": "celtics", "sentiment": "negative"}, {"name": "boston celtics", "sentiment": "none"}, {"name": "irving", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "nba", "sentiment": "none"}, {"name": "ba", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - The Boston Celtics and Philadelphia 76ers are set to meet in a London showdown on Thursday evening in a clash of two of the NBA’s in-form teams.\nFans have flooded into the British capital from across Europe, excited at the prospect of the bright young sides going head to head.\nThe Celtics – led by free agent acquisition Kyrie Irving – have been the surprise story of the season, recovering from losing star player Gordon Hayward five minutes into the campaign to lead the Eastern Conference with a 33-10 record.\nThey face the 19-19 76ers, who are battling for the playoff spots behind the Celtics in the Eastern Conference, and come into the game on a run of four consecutive wins.\nThe Celtics, however, have won six in a row and Irving, speaking at a media day ahead of the game, believes his team are refreshed and ready to deal with the 76ers and their rookie sensation Ben Simmons.\n“We have been off for about three days now and so the guys are pretty fresh, ready to get back out there, focus on the game and prepare as we always do. Demand excellence and go and put on a show,” said Irving, who joined the Celtics last year from the Cleveland Cavaliers.\n“Those guys are so young and active and they do a great job of getting to their spots, led by Ben Simmons. He does a great job about getting everybody involved and being aggressive.\n“For us, we just have to bring our unique intensity on the defensive end and make it uncomfortable and really give the fans a show. Bring the Celtic pride over here to London.”\nFor the 76ers, much has been made of their maligned rebuilding program in recent years, referred to as “the process”.\nLed by coach Brett Brown, it has been a difficult period for 76ers fans, as the team posted losing records for the past five seasons, including only winning 10 games in 2015-16.\nHowever, the high draft picks acquired through poor performance have led to an upsurge in performances, led by rookie Simmons and All-Star Joel Embiid.\n“I missed the first year of the process, but I feel like I have seen everything, I have been through everything. I was here when we only won 10 games in a season, which is awful,” Embiid said.\n”I take it personal too. I think some people might have lost their jobs because of me so every time I am on the court I try and do my best, I give it my all.”\nSimmons, seen by most analysts as a certainty to win Rookie of the Year honors, admitted it takes time to build a great team, but remains excited for the future of such a young and dynamic squad.\nVictory in London for the Celtics would extend their lead over the Toronto Raptors atop the Eastern Conference as they look to return to the Conference Final for the second consecutive season.\nReporting by Jack Tarrant, editing by Ed Osmond\n ", "external_links": [], "published": "2018-01-10T19:26:00.000+02:00", "crawled": "2018-01-10T19:51:40.024+02:00", "highlightTitle": ""}