{"organizations": [], "uuid": "07a55d5c2fe1caa198a9278ec9b7ee5e135e49e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180125.html", "section_title": "Archive News &amp; Video for Thursday, 25 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/japan-economy-cpi/update-1-japans-consumer-inflation-steady-in-dec-poses-challenge-for-boj-idUSL4N1PK1UL", "country": "US", "domain_rank": 408, "title": "REFILE-UPDATE 1-Japan's consumer inflation steady in Dec, poses challenge for BOJ", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-26T08:06:00.000+02:00", "replies_count": 0, "uuid": "07a55d5c2fe1caa198a9278ec9b7ee5e135e49e6"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/japan-economy-cpi/update-1-japans-consumer-inflation-steady-in-dec-poses-challenge-for-boj-idUSL4N1PK1UL", "ord_in_thread": 0, "title": "REFILE-UPDATE 1-Japan's consumer inflation steady in Dec, poses challenge for BOJ", "locations": [], "entities": {"persons": [{"name": "abe", "sentiment": "none"}, {"name": "leika kihara", "sentiment": "none"}], "locations": [{"name": "tokyo", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "boj", "sentiment": "negative"}, {"name": "bank of japan", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "internal affairs ministry", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Refiles to fix slug)\n* Dec nationwide core CPI up 0.9 pct yr/yr, matching f‘cast\n* Tokyo-area Jan core CPI up 0.7 pct yr/yr vs forecast +0.8 pct\n* Analysts watch oil prices, spring wage talks for price trend\n* Abe calls for wage hikes by 3 pct or more as labour talks begin\nBy Leika Kihara\nTOKYO, Jan 26 (Reuters) - Japan’s core consumer prices were steady in December, reinforcing signs a strengthening economy isn’t doing enough to drive inflation in a challenge to the central bank’s efforts to achieve its 2 percent price target.\nSubdued inflation would mean the Bank of Japan’s massive monetary stimulus is unlikely to be unwound in a hurry, although some investors expect the BOJ to raise rates this year as other central banks head towards an exit from unconventional policies.\nThe rise in the nationwide core consumer price index, which includes oil products but excludes volatile fresh food prices, rose 0.9 percent in December year-on-year, data from the Internal Affairs ministry showed on Friday.\nThat matched a median market forecast and the rate in November.\nWhen the effect of fresh food and energy are stripped away, prices rose 0.3 percent in December from a year earlier, the data showed.\nThe core consumer prices in Tokyo, available a month before the nationwide data, rose 0.7 percent in January, slowing a touch from a 0.8 percent gain in the previous month.\nThe relatively lower inflation rate has been the biggest discouraging factor in an otherwise robust economy, which is in its best shape in years as an exports boom has lifted business confidence and profits.\nThe BOJ kept monetary settings unchanged on Tuesday and its governor Haruhiko Kuroda reiterated that he saw no immediate need to raise its yield targets given inflation remained distant from its target.\nEconomists expect the core consumer inflation will remain around the same level in the coming few months. Oil prices and annual wage negotiations this spring hold the key for price trends, they say.\nPrime Minister Shinzo Abe has been pushing companies to raise wages by 3 percent or more to spur consumer spending, piling pressure on firms to spend their huge cash pile to broaden the benefits of the strengthening economy. (Reporting by Leika Kihara; Editing by Shri Navaratnam)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-26T08:06:00.000+02:00", "crawled": "2018-01-26T21:16:08.008+02:00", "highlightTitle": ""}