{"organizations": [], "uuid": "20f7d3fb97867c68de302f6cd5ec103de5aa2042", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219093472&w=1200&r=LYNXMPEE020W3", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/cyber-intel/design-flaw-found-in-intel-chips-fix-causes-them-to-slow-report-idINKBN1ES1BM", "country": "US", "domain_rank": 408, "title": "Security flaws put virtually all phones, computers at risk", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T00:27:00.000+02:00", "replies_count": 0, "uuid": "20f7d3fb97867c68de302f6cd5ec103de5aa2042"}, "author": "", "url": "https://in.reuters.com/article/cyber-intel/design-flaw-found-in-intel-chips-fix-causes-them-to-slow-report-idINKBN1ES1BM", "ord_in_thread": 0, "title": "Security flaws put virtually all phones, computers at risk", "locations": [], "entities": {"persons": [{"name": "douglas busvine", "sentiment": "none"}, {"name": "stephen nellis", "sentiment": "none"}], "locations": [{"name": "seoul", "sentiment": "none"}], "organizations": [{"name": "intel corp", "sentiment": "none"}, {"name": "google project zero", "sentiment": "none"}, {"name": "arm holdings", "sentiment": "none"}, {"name": "alphabet inc", "sentiment": "none"}, {"name": "advanced micro devices inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "arm", "sentiment": "none"}, {"name": "intel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FRANKFURT/SAN FRANCISCO (Reuters) - Security researchers on Wednesday disclosed a set of security flaws that they said could let hackers steal sensitive information from nearly every modern computing device containing chips from Intel Corp, Advanced Micro Devices Inc and ARM Holdings.\nFILE PHOTO: Intel's logo is pictured during preparations at the CeBit computer fair, which will open its doors to the public on March 20, at the fairground in Hanover, Germany, March 19, 2017. REUTERS/Fabian Bimmer/File Photo One of the bugs is specific to Intel but another affects laptops, desktop computers, smartphones, tablets and internet servers alike. Intel and ARM insisted that the issue was not a design flaw, but it will require users to download a patch and update their operating system to fix.\n“Phones, PCs, everything are going to have some impact, but it’ll vary from product to product,” Intel CEO Brian Krzanich said in an interview with CNBC Wednesday afternoon.\nResearchers with Alphabet Inc’s Google Project Zero, in conjunction with academic and industry researchers from several countries, discovered two flaws.\nThe first, called Meltdown, affects Intel chips and lets hackers bypass the hardware barrier between applications run by users and the computer’s memory, potentially letting hackers read a computer’s memory and steal passwords. The second, called Spectre, affects chips from Intel, AMD and ARM and lets hackers potentially trick otherwise error-free applications into giving up secret information.\nThe researchers said Apple Inc and Microsoft Corp had patches ready for users for desktop computers affected by Meltdown. Microsoft declined to comment and Apple did not immediately return requests for comment.\nDaniel Gruss, one of the researchers at Graz University of Technology who discovered Meltdown, called it “probably one of the worst CPU bugs ever found” in an interview with Reuters.\nGruss said Meltdown was the more serious problem in the short term but could be decisively stopped with software patches. Spectre, the broader bug that applies to nearly all computing devices, is harder for hackers to take advantage of but less easily patched and will be a bigger problem in the long term, he said.\nSpeaking on CNBC, Intel’s Krzanich said Google researchers told Intel of the flaws “a while ago” and that Intel had been testing fixes that device makers who use its chips will push out next week. Before the problems became public, Google on its blog said Intel and others planned to disclose the issues on Jan. 9. Google said it informed the affected companies about the “Spectre” flaw on June 1, 2017 and reported the “Meltdown” flaw after the first flaw but before July 28, 2017.\nThe flaws were first reported by tech publication The Register. It also reported that the updates to fix the problems could causes Intel chips to operate 5 percent to 30 percent more slowly. ( bit.ly/2CsRxkj )\nIntel denied that the patches would bog down computers based on Intel chips.\nFILE PHOTO - Intel processors are displayed at a store in Seoul June 21, 2012. REUTERS/Choi Dae-woong/File Photo “Intel has begun providing software and firmware updates to mitigate these exploits,” Intel said in a statement. “Contrary to some reports, any performance impacts are workload-dependent, and, for the average computer user, should not be significant and will be mitigated over time.”\nARM spokesman Phil Hughes said that patches had already been shared with the companies’ partners, which include many smartphone manufacturers.\n“This method only works if a certain type of malicious code is already running on a device and could at worst result in small pieces of data being accessed from privileged memory,” Hughes said in an email.\nAMD chips are also affected by at least one variant of a set of security flaws but that it can be patched with a software update. The company said it believes there “is near zero risk to AMD products at this time.”\nGoogle said in a blog post that Android phones running the latest security updates are protected, as are its own Nexus and Pixel phones with the latest security updates. Gmail users do not need to take any additional action to protect themselves, but users of its Chromebooks, Chrome web browser and many of its Google Cloud services will need to install updates.\nAmazon Web Services, a cloud computing service used by businesses, said that most of its internet servers were already patched and the rest were in the process of being patched.\nThe defect affects the so-called kernel memory on Intel x86 processor chips manufactured over the past decade, The Register reported citing unnamed programmers, allowing users of normal applications to discern the layout or content of protected areas on the chips.\nThat could make it possible for hackers to exploit other security bugs or, worse, expose secure information such as passwords, thus compromising individual computers or even entire server networks.\nDan Guido, chief executive of cyber security consulting firm Trail of Bits, said that businesses should quickly move to update vulnerable systems, saying he expects hackers to quickly develop code they can use to launch attacks that exploit the vulnerabilities. “Exploits for these bugs will be added to hacker’s standard toolkits,” said Guido.\nShares in Intel were down by 3.4 percent following the report but nudged back up 1.2 percent to $44.70 in after-hours trading while shares in AMD were up 1 percent to $11.77, shedding many of the gains they had made earlier in the day when reports suggested its chips were not affected.\nIt was not immediately clear whether Intel would face any significant financial liability arising from the reported flaw.\n“The current Intel problem, if true, would likely not require CPU replacement in our opinion. However the situation is fluid,” Hans Mosesmann of Rosenblatt Securities in New York said in a note, adding it could hurt the company’s reputation.\nReporting by Douglas Busvine in Frankfurt and Stephen Nellis and Salvador Rodriguez in San Francisco; Additional reporting by Jim Finkle in Toronto and Laharee Chatterjee in Bengaluru; Editing by Peter Henderson and Lisa Shumaker\n ", "external_links": [], "published": "2018-01-04T00:27:00.000+02:00", "crawled": "2018-01-04T00:53:14.026+02:00", "highlightTitle": ""}