{"organizations": [], "uuid": "ca2b4639927d48bac059331f97850fb6417fbba9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-ose-immunotherapeutics-announces-appointment-of-garard-tardy-as-chairman-of-companyas-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "OSE Immunotherapeutics Announces Appointment of Gérard Tardy as Chairman of Company’s Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T22:00:00.000+02:00", "replies_count": 0, "uuid": "ca2b4639927d48bac059331f97850fb6417fbba9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-ose-immunotherapeutics-announces-appointment-of-garard-tardy-as-chairman-of-companyas-board-of-directors.html", "ord_in_thread": 0, "title": "OSE Immunotherapeutics Announces Appointment of Gérard Tardy as Chairman of Company’s Board of Directors", "locations": [], "entities": {"persons": [{"name": "gérard tardy", "sentiment": "none"}, {"name": "guy châtelain", "sentiment": "none"}, {"name": "tardy", "sentiment": "none"}, {"name": "emile loria", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}], "organizations": [{"name": "ose immunotherapeutics announces appointment of gérard tardy", "sentiment": "negative"}, {"name": "ose immunotherapeutics", "sentiment": "negative"}, {"name": "nantes", "sentiment": "negative"}, {"name": "ose", "sentiment": "none"}, {"name": "investment committee of mérieux développement", "sentiment": "none"}, {"name": "board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NANTES, France, Jan. 03, 2018 (GLOBE NEWSWIRE) -- OSE Immunotherapeutics (ISIN:FR0012127173) (Mnémo:OSE), today announces that the Company’s Board of Directors, meeting on January 3, 2018, has appointed Gérard Tardy as Director and new Chairman of the Board. Mr. Tardy is a long-time healthcare investor, and is currently a member of the Investment Committee of Mérieux Développement, a specialized healthcare fund.\nMr. Tardy will replace Emile Loria, founder of OSE, who, following more than 30 years in key functions in the biotechnology industry, has resigned for personal reasons. The co-optation and appointment of Mr. Tardy will be subject to shareholder approval at the Annual General Meeting. Separately, the resignation for personal reasons of another Director, Guy Châtelain, also will become effective during the next AGM and the Board thanks him warmly for his contribution to their work.\n\"On behalf of all the Directors and the whole OSE team, I thank Emile Loria for his significant contribution and strong commitment to the Company’s growth strategy. We are at a pivotal time for the company with Tedopi® resuming Phase 3 trial in lung cancer, targeting patients for which checkpoint inhibitors have failed. This is a great opportunity in a very promising market with a strong medical need and no available treatments for these patients in immunological escape,\" said Dominique Costantini, CEO and Director of OSE Immunotherapeutics.\n\" We are delighted to welcome Gérard Tardy, whose rich international experience, both in finance and healthcare, fits perfectly with our growth strategy as we are developing a new generation of immunotherapies highly attractive for the pharmaceutical industry: a myeloid checkpoint inhibitor, OSE-172, an immunomodulator targeting the IL7 receptor, OSE-127 and the CD28 antagonist, FR104. In fact, the latter two products are already part of license agreements with pharmaceutical companies potentially totalling more than €400M,\" concluded Dominique Costantini.\nMr. Tardy stated , \"I thank the Board for placing their trust in me at a moment of significant opportunity, as cancer and autoimmune disease immunotherapy represents a therapeutic transformation. The expertise developed by OSE with immunity agonists and antagonists positions the company very well for future success in the field, and I look forward to working closely with the management team to increase its visibility globally.”\n\"I am very proud to have contributed to the creation of OSE, its initial growth phase and current position as a leader in the development of immunotherapies. I wish Gérard success in his new role, and look forward to future innovations from OSE”, said Mr. Loria .\nBased in London, Mr. Tardy has significant experience in private equity in Europe. Previously, he created and managed two private equity funds in Paris, Cititcorp Venture Capital and Schroder Ventures. In 1999, Mr. Tardy formed his own investment company, Sitka Limited, in London, through which he has invested in several healthcare companies. Mr. Tardy currently serves on the Board of multiple healthcare companies in Europe and Asia. He graduated from HEC in Paris.\nABOUT OSE Immunotherapeutics\nOur ambition is to become a world leader in activation and regulation immunotherapies:\nOSE Immunotherapeutics is a biotechnology company focused on the development of innovative immunotherapies for immune activation and regulation in the fields of immuno-oncology, autoimmune diseases and transplantation. The company has several scientific and technological platforms: neoepitopes, agonist or antagonist monoclonal antibodies, ideally positioned to fight cancer and autoimmune diseases. Its first-in-class clinical portfolio offers a diversified risk profile.\nIn immuno-oncology:\nTedopi® , 10 combined neo-epitopes to induce specific T activation in immuno-oncology. Phase III trial in advanced NSCLC: after temporary pause of new patient accrual end of June 2017, new recruitment strategy defined in December 2017 to focus the trial on patients who failed a previous treatment with a PD-1/PD-L1 immune checkpoint inhibitor. Enrollment will resume after formal approval of the new recruitment strategy from the Competent Authorities.\nPhase II with Tedopi® in combination with an immune checkpoint inhibitor planned in advanced pancreatic cancer, in collaboration with GERCOR, a cooperative group of clinical research. OSE-172 , new generation checkpoint inhibitor targeting myeloid cells via the SIRP-α receptor - In preclinical development for several cancer models. Clinical program planned end of 2018. OSE-703 , cytotoxic monoclonal antibody against the alpha chain of IL-7R - Under a research collaboration with Memorial Sloan Kettering Cancer Center, New York.\nIn auto-immune diseases and transplantation:\nFR104 , CD28-antagonist in immunotherapy - Phase 1 trial completed – For the treatment of autoimmune diseases and for use with transplantation - Licensed to Janssen Biotech Inc. to pursue clinical development. Phase 2 planned end of 2018 in rheumatoid arthritis. OSE-127 , interleukin receptor-7 antagonist - In preclinical development for inflammatory bowel diseases and other autoimmune diseases. Clinical phase planned end of 2018. License option agreement with Servier for the development and commercialization.\nThe portfolio’s blockbuster potential gives OSE Immunotherapeutics the ability to enter global agreements at different stages of development with major pharmaceutical players.\nImmunotherapy is a highly promising and growing market. By 2023 Immunotherapy of cancer could represent nearly 60% of treatments against less than 3% at present * and the projected market is estimated at $67 billion in 2018 **. There are more than 80 autoimmune diseases that represent a significant market including major players in the pharmaceutical industry with sales towards $10 billion for the main products. The medical need is largely unmet and requires the provision of new innovative products involved in the regulation of the immune system.\n* Citi Research Equity\n**BCC Research\nClick and follow us on Twitter and Linkedln\nTwitter\nLinkedIn\nContacts\nOSE Immunotherapeutics\nSylvie Détry\nSylvie.detry@ose-immuno.com\n+33 143 297 857\nFrench Media: FP2COM\nFlorence Portejoie\nfportejoie@fp2com.fr\n+33 607 768 283 U.S. Media: LifeSci Public Relations\nMatt Middleman, M.D.\nmatt@lifescipublicrelations.com\n+1 646 627 8384\nU.S. and European Investors\nChris Maggos\nchris@lifesciadvisors.com\n+41 79 367 6254 Forward-looking statements\nThis press release contains express or implied information and statements that might be deemed forward-looking information and statements in respect of OSE Immunotherapeutics. They do not constitute historical facts. These information and statements include financial projections that are based upon certain assumptions and assessments made by OSE Immunotherapeutics’ management in light of its experience and its perception of historical trends, current economic and industry conditions, expected future developments and other factors they believe to be appropriate.\nThese forward-looking statements includ", "external_links": ["https://www.globenewswire.com/Tracker?data=3Tl5xeRWskvyWWKfBYP30NXBTEqAA0wpY2rvxI7gLfNoUwrpS8lrgPXvYI-3SHkIMfSEcrfqL9w4awxcd7bMB79empzZbGcplVrEl9Fs9ZY=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/3c8809af-90f1-43a3-bc87-4de5b36d8f0c", "https://www.globenewswire.com/Tracker?data=Msdw_3YnRYn27_iNaGqBanQd5cR_v7phMXTOFgMZO8jlqHodR14WZzSKe4mdkvy20Nuotki-rEjVEw9-FpeLzQ=="], "published": "2018-01-03T22:00:00.000+02:00", "crawled": "2018-01-03T22:46:06.008+02:00", "highlightTitle": ""}