{"organizations": [], "uuid": "7a47c66e70f31dd451a13af60a1f59bcd2aefa9f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220240897&w=1200&r=LYNXMPEE070LV", "site_section": "http://feeds.reuters.com/reuters/businessNews", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-usa-banks-results-preview/u-s-bank-gains-from-tax-law-start-with-red-ink-idUSKBN1EX0XF", "country": "US", "domain_rank": 408, "title": "U.S. bank gains from tax law start with red ink", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T13:15:00.000+02:00", "replies_count": 0, "uuid": "7a47c66e70f31dd451a13af60a1f59bcd2aefa9f"}, "author": "", "url": "https://www.reuters.com/article/us-usa-banks-results-preview/u-s-bank-gains-from-tax-law-start-with-red-ink-idUSKBN1EX0XF", "ord_in_thread": 0, "title": "U.S. bank gains from tax law start with red ink", "locations": [], "entities": {"persons": [{"name": "david henr", "sentiment": "negative"}, {"name": "catherine ngai", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "bank of america corp", "sentiment": "none"}, {"name": "min read  new york", "sentiment": "none"}, {"name": "citigroup inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "goldman sachs group inc", "sentiment": "none"}, {"name": "jpmorgan chase & co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 13 AM / Updated 6 hours ago U.S. bank gains from tax law start with red ink David Henry , Catherine Ngai 5 Min Read \nNEW YORK (Reuters) - U.S. bank executives and investors expect a long-term boost from the new federal tax code, but the biggest lenders will first need to book multi-billion-dollar charges that will muddle fourth-quarter results. \nBanks will adjust deferred tax assets and liabilities to account for a lower corporate rate, and also take charges related to other tax changes. But analysts said the overall benefit from lower taxes will make up for any short-term hit. \nCitigroup Inc ( C.N ) could report a quarterly loss of more than $15 billion and Goldman Sachs Group Inc ( GS.N ) will likely have lost about $3 billion, based on analyst estimates and recent profit warnings. \nJPMorgan Chase & Co, ( JPM.N ) which reports first on Friday morning, could show a 35 percent plunge in net income from a year earlier. Bank of America Corp ( BAC.N ), which reports the following Wednesday, could show a 50 percent drop. \n“It is no doubt going to be a messy quarter,” said Jason Goldberg, bank stock analyst at Barclays. \nCitigroup is expected to take a $20 billion charge, largely because its losses during the 2007-2009 financial crisis will offset future taxes less now that the corporate tax rate has been cut to 21 percent from 35 percent. \nGoldman is expected to take a $5 billion charge, mostly due to a new repatriation tax on income kept outside of the United States. \nMeanwhile, banks with deferred tax liabilities will be able to write those down thanks to the lower tax rates. \nIn an extreme case, Wells Fargo & Co ( WFC.N ) is expected to report a $2.5 billion boost to its bottom line largely because it will owe less tax in the future on income from a set of businesses including mortgage servicing. \nBut most analysts and institutional investors brush aside big one-time items, viewing them as accounting charges that reveal little about underlying financial performance or future profits. \nInstead, they are confident that big banks will be largely better off from paying a lower tax rate. Still, just how much each bank will benefit will vary based on where they earn their income. \nBank of America could earn $4.5 billion, or 19 percent, more in 2019 than it would have without the lower rates, said Keefe, Bruyette & Woods analyst Brian Kleinhanzl. That would more than cover an expected $3 billion fourth-quarter charge. \nBut Citigroup might get a profit pickup in 2019 of only $1.7 billion, or 11 percent, Kleinhanzl said. That would be far less than the $19.7 billion he expects in total fourth-quarter charges. \nBank of America earns about 90 percent of its income in the United States, according to estimates by analyst Richard Ramsden of Goldman Sachs. Citigroup, meanwhile, has been getting only about 50 percent of its earnings at home, so will not benefit as much from lower U.S. tax rates. \nAnalysts plan to push executives in conference calls for clues about whether investors will benefit as much as they hope. \nBanks could provide a boon by putting more money toward stock buybacks and dividends. But there is worry they will be too quick to shift those dollars towards trying to beat competitors with lower prices on loans and better services for customers. \n“Banks benefit from a lower corporate tax rate,” said Barclays’ Goldberg, “but what will they do (with the extra money)?” Reporting by David Henry and Catherine Ngai in New York; Editing by Lauren Tara LaCapra and Meredith Mazzilli", "external_links": [], "published": "2018-01-08T13:15:00.000+02:00", "crawled": "2018-01-08T13:27:27.074+02:00", "highlightTitle": ""}