{"organizations": [], "uuid": "7c5df7c6b066ffe40b5a849f5dcabe70c716e441", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-guggenheim-q1-2018-high-yield-and-bank-loan-outlook-be-wary-of-eroding-investor-protections.html", "country": "US", "domain_rank": 767, "title": "Guggenheim Q1 2018 High-Yield and Bank Loan Outlook: Be Wary of Eroding Investor Protections", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T18:00:00.000+02:00", "replies_count": 0, "uuid": "7c5df7c6b066ffe40b5a849f5dcabe70c716e441"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-guggenheim-q1-2018-high-yield-and-bank-loan-outlook-be-wary-of-eroding-investor-protections.html", "ord_in_thread": 0, "title": "Guggenheim Q1 2018 High-Yield and Bank Loan Outlook: Be Wary of Eroding Investor Protections", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "libor", "sentiment": "none"}], "organizations": [{"name": "bank loan outlook", "sentiment": "negative"}, {"name": "guggenheim investments", "sentiment": "negative"}, {"name": "globe newswire", "sentiment": "negative"}, {"name": "fed", "sentiment": "none"}, {"name": "ebitda", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "guggenheim partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 18, 2018 (GLOBE NEWSWIRE) -- Guggenheim Investments, the global asset management and investment advisory business of Guggenheim Partners, today provided its First Quarter 2018 High-Yield and Bank Loan Outlook .\nAmong the highlights in the 14-page report:\nThe lowering of bank loan London interbank offered rate (Libor) floors from a range of 0.75–1.25 percent to 0 percent puts loan investors at risk of earning poor returns in a scenario where the Fed returns to the lower bound in the medium term. We believe the market is underestimating this risk. Our primary concern for the average high-yield investor is in the limited compensation they are willing to accept for high-yield bonds. We estimate that an average high-yield corporate bond portfolio would earn little more than a current 10-year Treasury on a loss-adjusted basis. Given some of the negative repercussions of tax reform, we recommend that investors focus on companies with less than 30 percent of interest expense to earnings before interest, taxes, depreciation, and amortization (EBITDA), positive cash flow generation, and steady capital expenditures. Many of these same companies are tapping into primary markets to issue debt with fewer protections and at tighter spreads. Altogether, we believe these trends are creating a perfect storm for a significant shakeout in the high-yield universe that will not end well for the average high-yield investor. Now more than ever, investors should take a company-by-company approach to credit selection, and avoid making general decisions based on industry preferences.\nFor more information, please visit http://www.guggenheiminvestments.com .\nAbout Guggenheim Investments\nGuggenheim Investments is the global asset management and investment advisory division of Guggenheim Partners, with $243 billion 1 in assets across fixed income, equity, and alternative strategies. We focus on the return and risk needs of insurance companies, corporate and public pension funds, sovereign wealth funds, endowments and foundations, consultants, wealth managers, and high-net-worth investors. Our 275+ investment professionals perform rigorous research to understand market trends and identify undervalued opportunities in areas that are often complex and underfollowed. This approach to investment management has enabled us to deliver innovative strategies providing diversification and attractive long-term results.\n1. Guggenheim Investments total asset figure is as of 9.30.2017. The assets include leverage of $11.6bn for assets under management and $0.4bn for assets for which we provide administrative services. Guggenheim Investments represents the following affiliated investment management businesses: Guggenheim Partners Investment Management, LLC, Security Investors, LLC, Guggenheim Funds Investment Advisors, LLC, Guggenheim Funds Distributors, LLC, Guggenheim Real Estate, LLC, GS GAMMA Advisors, LLC, Guggenheim Partners Europe Limited, and Guggenheim Partners India Management.\nThis material is distributed or presented for informational or educational purposes only and should not be considered a recommendation of any particular security, strategy or investment product, or as investing advice of any kind. This material is not provided in a fiduciary capacity, may not be relied upon for or in connection with the making of investment decisions, and does not constitute a solicitation of an offer to buy or sell securities. The content contained herein is not intended to be and should not be construed as legal or tax advice and/or a legal opinion. Always consult a financial, tax and/or legal professional regarding your specific situation.\nThis material contains opinions of the author but not necessarily those of Guggenheim Partners, LLC or its subsidiaries. The opinions contained herein are subject to change without notice. Forward looking statements, estimates, and certain information contained herein are based upon proprietary and non-proprietary research and other sources. Information contained herein has been obtained from sources believed to be reliable, but are not assured as to accuracy. Past performance is not indicative of future results. There is neither representation nor warranty as to the current accuracy of, nor liability for, decisions based on such information. No part of this material may be reproduced or referred to in any form, without express written permission of Guggenheim Partners, LLC.\nMedia Contact\nIvy McLemore\nGuggenheim Partners\n212.518.9859\nIvy.McLemore@GuggenheimPartners.com\nSource: Guggenheim Investments", "external_links": ["https://www.globenewswire.com/Tracker?data=zCyGxQ-b0u6Vg40B38fHW9Ypho42DCN_kXv0pa7JKJFRrVBoQSGWVCUWcLVZY9KkBhbPsFqJfASdHdEUB2OBHXWWNgGW03ADKSwkB02HJJwj36H2WNqb6FTfPbr0JRMZGRoLD3ioyjGToiGhWSN5l0yWOe-PFqhtkac4YQPXUTk=", "https://www.globenewswire.com/Tracker?data=uTB6WILxQh6OP9lXgovdU5D3o-QDXscImyn8OEYnzZHmGTRNek78_b5Zx5s3pEwoXgH0ibpkgwq8YfjqqGOK2CjqDsukspNlTlQ01-lWXjlYw5Ysg1ZAjOlKN1F_WSY6", "https://www.globenewswire.com/Tracker?data=GTXAt6ecnzNhDSKUs2NW15Dxx-eHdJ04jlYFcKxKVUPPoxvojqopbaJ2MUiH0nH8K8LWUkGihUbSmzpsQ6ZIRlBBSvpTNUgdIHZlhXhyvVLNNfnCQlY-G66XWgoBjIdFvzjYQG8Ikhzxq-TwQ5HCgQ=="], "published": "2018-01-18T18:00:00.000+02:00", "crawled": "2018-01-18T20:10:40.002+02:00", "highlightTitle": ""}