{"organizations": [], "uuid": "8e379c8eebf7a171b5b691caf4cde6f637a859d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://www.top10b.info/wp-content/uploads/2018/01/104977846-rsz_gettyimages-888701514.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/the-cdc-director-bought-tobacco-and-health-care-stocks-while-in-office.html/", "country": "US", "domain_rank": 767, "title": "The CDC Director bought tobacco and health-care stocks while in office - Top10 World", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.081, "site_type": "news", "published": "2018-01-31T10:14:00.000+02:00", "replies_count": 0, "uuid": "8e379c8eebf7a171b5b691caf4cde6f637a859d8"}, "author": "", "url": "https://www.cnbc.com/2018/01/30/the-cdc-director-bought-tobacco-and-health-care-stocks-while-in-office.html/", "ord_in_thread": 0, "title": "The CDC Director bought tobacco and health-care stocks while in office - Top10 World", "locations": [], "entities": {"persons": [{"name": "fitzgerald", "sentiment": "none"}, {"name": "richard pain", "sentiment": "none"}, {"name": "brenda fitzgerald", "sentiment": "none"}], "locations": [{"name": "georgia", "sentiment": "none"}], "organizations": [{"name": "cdc", "sentiment": "neutral"}, {"name": "philip morris international", "sentiment": "none"}, {"name": "reynolds american, british american tobacco", "sentiment": "none"}, {"name": "centers for disease control and prevention", "sentiment": "none"}, {"name": "altria group", "sentiment": "none"}, {"name": "imperial brands", "sentiment": "none"}, {"name": "georgia department of public health", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Home / Politics / The CDC Director bought tobacco and health-care stocks while in office The CDC Director bought tobacco and health-care stocks while in office 1 min ago \nThe head of the Centers for Disease Control and Prevention — a leader in smoking-cessation efforts — bought stock shares in a large tobacco company just one month after taking office, a bombshell POLITICO report reveals. \nDirector Brenda Fitzgerald, a Trump administration appointee, already owned stock in five other tobacco companies when she assumed leadership of the CDC. Documents revealed Fitzgerald had holdings in Reynolds American, British American Tobacco, Imperial Brands, Philip Morris International, and Altria Group. \nBefore the CDC, Fitzgerald worked as an obstetrician-gynecologist for three decades and served as Georgia Department of Public Health commissioner from 2011 to 2017. She listed tobacco cessation as one of her primary public health priorities as commissioner in Georgia. \n“You don’t buy tobacco stocks when you are the head of the CDC. It’s ridiculous, it gives a terrible appearance,” Richard Painter, George W. Bush’s chief ethics lawyer told POLITICO. \n“It stinks to high heaven,” Painter added. \nAlong with her Japan Tobacco purchases, documents confirm Fitzgerald also bought thousands of dollars of shares in several health-care companies, including Merck & Co, Bayer and Humana, which the U.S. Department of Health and Human Services deemed a conflict of interest, POLITICO reported. \n“Like all presidential personnel, Dr. Fitzgerald’s financial holdings were reviewed by the HHS Ethics Office, and she was instructed to divest of certain holdings that may pose a conflict of interest. During the divestiture process, her financial account manager purchased some potentially conflicting stock holdings. These additional purchases did not change the scope of Dr. Fitzgerald’s recusal obligations, and Dr. Fitzgerald has since also divested of these newly acquired potentially conflicting publicly traded stock holdings,” an HHS spokesperson told POLITICO. \nRecords obtained by POLITCO confirm Fitzgerald sold tobacco on Oct. 26 and all stock holdings above $1,000 by Nov. 21. It took her four months into her tenure as CDC Director to sell her shares. ", "external_links": [], "published": "2018-01-31T10:14:00.000+02:00", "crawled": "2018-01-31T10:20:58.005+02:00", "highlightTitle": ""}