{"organizations": [], "uuid": "ec1cd567a73e463da108f4a78c8ef161d04fe43a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180116&t=2&i=1222322127&w=1200&r=LYNXMPEE0F09N", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-southkorea-economy-rates/bank-of-korea-seen-staying-on-hold-amid-soaring-won-weak-inflation-idUSKBN1F50CX", "country": "US", "domain_rank": 408, "title": "Bank of Korea seen staying on hold amid soaring won, weak inflation", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T12:50:00.000+02:00", "replies_count": 0, "uuid": "ec1cd567a73e463da108f4a78c8ef161d04fe43a"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-southkorea-economy-rates/bank-of-korea-seen-staying-on-hold-amid-soaring-won-weak-inflation-idUSKBN1F50CX", "ord_in_thread": 0, "title": "Bank of Korea seen staying on hold amid soaring won, weak inflation", "locations": [], "entities": {"persons": [], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "korea", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "krw", "sentiment": "none"}, {"name": "eci", "sentiment": "none"}, {"name": "krocrt", "sentiment": "none"}, {"name": "bank of korea", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEOUL (Reuters) - South Korea’s central bank is widely expected to keep its benchmark interest rate unchanged on Thursday after raising it in November for the first time in more than six years, a Reuters poll found on Tuesday.\nAll 17 analysts surveyed by Reuters between Jan. 8 and Jan. 15 predicted the Bank of Korea (BOK) would keep its benchmark interest rate KROCRT=ECI unchanged at 1.50 percent as it monitors the effects of its November move, which was seen as a potential turning point for tighter monetary policy in the region.The BOK is not expected to start 2018 with another interest rate hike after raising the rate from a record-low 1.25 percent on Nov. 30, ending a five-year easing cycle as a sustained export boom lifts growth.\nDespite the BOK rate hike, the overall economic position appears mixed. December inflation was at 1.5 percent, below the BOK’s target of 2 percent, while November factory output barely rebounded after contracting a month earlier - even though exports boomed for much of 2017.\nThe uncertain economic outlook, together with the won KRW= at a three-year high against the dollar, supports broad consensus that the central bank's monetary tightening will be gradual this year.\n“The easing of growth momentum in fourth-quarter 2017 and the retreat in CPI inflation to below 2 percent should reduce the need for the BOK to hike rates immediately again after the November move,” said Ma Tieying, an economist at DBS Group Holdings Ltd.\nThe Jan. 18 meeting will be Governor Lee Ju-yeol’s second last before his term ends on March 31. Terms for six other members at the bank’s monetary policy board vary.\n“We don’t expect this (the end of Lee’s term) to lead to a drastic change in the BOK’s policy decision-making. Experience from the past decade shows that the BOK sets interest rates closely based on the output gap and inflation, despite changes in central bank leadership,” Ma said when asked if the end of Lee’s term would affect monetary policy this year.\nInvestors will also watch the expected revision of South Korea’s official growth forecasts for this year and last, which may be upgraded from the current 3 percent for 2017 to reflect improved exports. The government expects revised growth of 3.2 percent in 2017.\nThe BOK is also under pressure to use smoothing operations to take the heat out of the won, currently trading at a three-year high against the dollar, without upsetting Washington and risking accusations of currency manipulation.\n“The bank is closely watching the won’s gains against the dollar. (Policymakers) will probably take their earlier stance that the exchange rate cannot be the sole factor in setting monetary policy,” said Kim Ji-na, a fixed-income analyst at IBK Securities.\nThe won was Quote: d at 1,064.1 per dollar on the onshore settlement platform KRW=KFTC as of 0345 GMT, hovering near the three-year high of 1,056.67 reached on Jan. 14.\nReporting Cynthia Kim; Additional eporting by Dahee Kim, Haejin Choi, Yuna Park and Heekyong Yang; Editing by Eric Meijer\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-16T12:50:00.000+02:00", "crawled": "2018-01-16T10:06:54.028+02:00", "highlightTitle": ""}