{"organizations": [], "uuid": "268ed864861bb76db2886c7f0e7e972c0b77be08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKTennisNews/", "section_title": "Reuters: Tennis News", "url": "https://uk.reuters.com/article/tennis-ausopen/highlights-tennis-australian-open-day-two-idUKL3N1PB04Z", "country": "US", "domain_rank": 408, "title": "HIGHLIGHTS-Tennis-Australian Open day two", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T02:38:00.000+02:00", "replies_count": 0, "uuid": "268ed864861bb76db2886c7f0e7e972c0b77be08"}, "author": "", "url": "https://uk.reuters.com/article/tennis-ausopen/highlights-tennis-australian-open-day-two-idUKL3N1PB04Z", "ord_in_thread": 0, "title": "HIGHLIGHTS-Tennis-Australian Open day two", "locations": [], "entities": {"persons": [{"name": "novak", "sentiment": "none"}, {"name": "wilander  edmund out-guns anderson", "sentiment": "none"}, {"name": "shapovalov", "sentiment": "none"}, {"name": "ostapenko", "sentiment": "none"}, {"name": "djokovic", "sentiment": "none"}, {"name": "stephens", "sentiment": "none"}, {"name": "greg stutchbury", "sentiment": "none"}, {"name": "dimitrov", "sentiment": "none"}, {"name": "nick mulvenney", "sentiment": "none"}, {"name": "hardik vyas", "sentiment": "none"}, {"name": "kyrgios", "sentiment": "none"}, {"name": "sharapova", "sentiment": "none"}], "locations": [{"name": "melbourne  coco", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}, {"name": "melbourne park", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "williams", "sentiment": "none"}, {"name": "belinda bencic", "sentiment": "none"}, {"name": "djokovic", "sentiment": "none"}, {"name": "donald young  nadal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 16, 2018 / 12:40 AM / Updated an hour ago CORRECTED-HIGHLIGHTS-Tennis-Australian Open day two 4 Min Read \n(Fixes final set score in Djokovic match) \nMELBOURNE, Jan 16 (Reuters) - Highlights of Tuesday’s second day of the Australian Open, the first grand slam tournament of the year: 0610 DOMINANT DJOKOVIC BOOKS SECOND ROUND SPOT \nSix-time Australian Open champion Novak Djokovic beat American Donald Young 6-1 6-2 6-4 to reach the second round for a 12th consecutive year. \n“A month ago I didn’t know if I was going to come to Australia or not because the elbow was still not prepared for this level of competition,” Djokovic, playing his first match since Wimbledon last year, said in an on-court interview. READ MORE \nDjokovic elbows Young out to reach second round \nKerber consigns 2017 to the history books \nRaonic slumps to early exit at Melbourne Park \nSharapova enjoys winning return to Melbourne \nPrize money row rumbling behind the scenes \nAggressive Konta makes light work of Brengle \nOrder of play on Tuesday \nOrder of play on Wednesday 0555 WAWRINKA PREVAILS IN TRICKY RETURN \nFormer Australian Open champion Stan Wawrinka battled to a 6-3 6-4 2-6 7-6(2) victory over Lithuanian Ricardas Berankis in his first competitive match since July. 0530 BOUCHARD ENDS LOSING STREAK \nCanadian Eugenie Bouchard ended a six-match losing run on the tour by beating France’s Oceane Dodin 6-3 7-6(5). 0525 GOFFFIN BEGINS 2018 IN STYLE \nSeventh seed David Goffin started his 2018 season with 55 winners to seal a 6-7(3) 6-3 6-2 6-4 win over German qualifier Matthias Bachinger. 0520 KERBER LOOKS AHEAD AFTER FIRST ROUND WIN \nFormer Australian Open champion Angelique Kerber, flying from her title-winning run in Sydney, needed a little more than an hour to fellow German Anna-Lena Friedsam 6-0 6-4. \n“2017, I have said goodbye already, I am not looking back,” Kerber, who failed to claim a title last year, said after the match. \n“I‘m feeling good and trying to continue how I have played in the last few weeks. I‘m just trying to enjoy it again on court.” 0430 ZVEREV SAILS THROUGH \nWorld number four Alexander Zverev opened with a 6-1 7-6(5) 7-5 first round victory over Italian Thomas Fabbiano. 0330 QUERREY ADVANCES \nAmerican Sam Querrey, a quarter-finalist last year, began his campaign with a 6-3 6-4 6-2 win over Spanish veteran Feliciano Lopez. 0325 SASNOVICH ADVANCES \nBrisbane finalist Aliaksandra Sasnovich claimed a convincing 6-3 6-2 win over American Christina McHale. 0320 SHARAPOVA STROLLS INTO ROUND TWO \nFormer world number one Maria Sharapova, the 2008 winner in Melbourne, progressed to the second round with a 6-1 6-4 victory over German Tatjana Maria. 0220 VERDASCO POWERS PAST BAUTISTA AGUT \nSpaniard Fernando Verdasco, a semi-finalist in 2009, recorded 41 winners to upset 20th-seeded compatriot Roberto Bautista Agut 6-1 7-5 7-5. 0150 PLISKOVA THROUGH TO ROUND TWO \nSixth seed Karolina Pliskova kept her hopes of lifting a maiden grand slam titles alive with a 6-3 6-4 victory over Paraguayan Veronica Cepede Royg in the first round. \n“The first one is always the toughest for me... Hopefully I take it match-by-match and I think I’ll have a good chance,” Pliskova, who reached the quarter-finals in Melbourne last year, said after the match. 0140 GARCIA SURGES PAST WITTHOEFT \nEighth seed Caroline Garcia overcame big-hitting German Carina Witthoeft 7-5 6-3. 0130 KONTA CRUISES PAST BRENGLE \nNinth seeded Briton Johanna Konta skipped past Madison Brengle into the second round, overpowering the American 6-3 6-1 in 66 minutes on Hisense Arena. \n”I am very happy with that match,“ said the Australian-born 26-year-old. ”I knew it would be tough, she gets a lot of balls back and makes her opponents work for it. 0030 PLAY UNDERWAY ON DAY TWO \nPlay got underway on schedule at 11 a.m. local time (0000 GMT) at Melbourne Park, where the temperature is around 21 degrees with very little chance of rain forecast. Read our preview of the day’s action here: (Compiled by Nick Mulvenney and Hardik Vyas; Editing by Greg Stutchbury/Peter Rutherford/John O‘Brien)", "external_links": [], "published": "2018-01-16T02:38:00.000+02:00", "crawled": "2018-01-16T03:35:40.039+02:00", "highlightTitle": ""}