{"organizations": [], "uuid": "9e032f75782b47c86e9019eeadbe005fb1509f1a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218815465&w=1200&r=LYNXMPEE010LM", "site_section": "https://www.goldreview.com/?feed=linkfeed", "section_title": "Gold Review » Gold Review", "url": "https://www.reuters.com/article/us-global-precious/gold-hits-three-month-peak-after-late-december-rally-idUSKBN1ER130", "country": "US", "domain_rank": 408, "title": "Gold hits three-month peak after late December rally", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T16:24:00.000+02:00", "replies_count": 0, "uuid": "9e032f75782b47c86e9019eeadbe005fb1509f1a"}, "author": "cmullen", "url": "https://www.reuters.com/article/us-global-precious/gold-hits-three-month-peak-after-late-december-rally-idUSKBN1ER130", "ord_in_thread": 0, "title": "Gold hits three-month peak after late December rally", "locations": [], "entities": {"persons": [{"name": "jan harvey", "sentiment": "none"}, {"name": "jonathan butler", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "mitsubishi", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Gold hit its highest since late September on Tuesday, extending a year-end rally that saw the metal rise 4.4 percent in the last three weeks of 2017, as a further retreat in the dollar drove prices above $1,310 an ounce.\nPalladium prices meanwhile bounced to a new 17-year high, within $5 of their all-time peak, as tightening emissions controls and a swing away from diesel cars in Europe fuelled fears of a shortage of the metal after years of market deficit.\nSpot gold was up 0.8 percent at $1,312.52 an ounce at 1505 GMT, while U.S. gold futures for February delivery were up $4.90 an ounce at $1,314.20.\nThe weaker dollar, which posted its biggest annual drop since 2003 last year, helped to lift gold by more than 13 percent in 2017. The metal surged $55 an ounce in the last three weeks of the year alone.\nWhile technical analysts warn that gold’s rally is now looking overstretched, spot prices rose to a peak of $1,313.88 an ounce earlier on Tuesday.\n“Gold starts 2018 at the highest level since September, and the highest January opening since 2013,” Mitsubishi analyst Jonathan Butler said. “It is only the fourth time ever that gold has opened the year above $1,300.”\n“The key questions for gold in 2018 will be how quickly developed economies can normalise interest rates after more than a decade of monetary largesse; how much further global equity market rallies can extend; what the longer-term impact of the Trump tax reforms will be on corporates and on U.S. government debt levels; and when inflation will finally start to pick up.”\nFurther dollar weakness could support gold in the near term, he said. The U.S. currency slipped to a four-month low against the euro on Tuesday on optimism over a brightening economic picture in the euro zone, while stocks had a groggy start to the year. [FRX/] [MKTS/GLOB]\nGold has benefited from technical strength over the past two weeks, but the bulk of its rally came during the holiday period with much lower-than-normal average daily volumes, Jeffrey Halley, senior market analyst at OANDA, said, adding that the metal is looking overbought.\nAmong other precious metals, spot silver was up 1.1 percent at $17.13. Spot platinum was 1.2 percent higher at $937.\nPalladium was up 2.3 percent at $1,084.95. Earlier it reached $1,090.60, its highest since Jan. 2001, when it peaked at a record $1,095. It was the standout performer among major precious metals last year, rising 56 percent to hit a series of multi-year highs.\n“The fundamentals are strong, it’s true... but this has the mark of a spec squeeze especially given today’s thin trading, right at the start of the year with many market participants still enjoying holidays,” Mitsubishi’s Butler said.\nAdditional reporting by Nallur Sethuraman in Bengaluru; editing by Jason Neely and Adrian Croft\n ", "external_links": [], "published": "2018-01-02T16:24:00.000+02:00", "crawled": "2018-01-02T17:19:32.032+02:00", "highlightTitle": ""}