{"organizations": [], "uuid": "ca6a9d6b320b946306beb519cc4dcee49538c3b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/europe-stocks/live-markets-opening-snapshot-earnings-dominate-quiet-start-to-european-trading-idUSL8N1PK1RK", "country": "US", "domain_rank": 408, "title": "LIVE MARKETS-Opening snapshot: earnings dominate quiet start to European trading", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T10:20:00.000+02:00", "replies_count": 0, "uuid": "ca6a9d6b320b946306beb519cc4dcee49538c3b7"}, "author": "", "url": "https://www.reuters.com/article/europe-stocks/live-markets-opening-snapshot-earnings-dominate-quiet-start-to-european-trading-idUSL8N1PK1RK", "ord_in_thread": 0, "title": "LIVE MARKETS-Opening snapshot: earnings dominate quiet start to European trading", "locations": [], "entities": {"persons": [{"name": "julien ponthus", "sentiment": "none"}], "locations": [], "organizations": [{"name": "software ag", "sentiment": "none"}, {"name": "ecb", "sentiment": "none"}, {"name": "clariant", "sentiment": "none"}, {"name": "elekta", "sentiment": "none"}, {"name": "elior group", "sentiment": "none"}, {"name": "white tale", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "diageo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 8:21 AM / in 17 minutes LIVE MARKETS-Opening snapshot: earnings dominate quiet start to European trading Reuters Staff 7 Min Read (Changes headline to lower case) Jan 25 (Reuters) - Welcome to the home for real time coverage of European equity markets brought to you by Reuters stocks reporters and anchored today by Julien Ponthus. Reach him on Messenger to share your thoughts on market moves: julien.ponthus.thomsonreuters.com@reuters.net OPENING SNAPSHOT: EARNINGS DOMINATE QUIET START (0812 GMT) Ahead of the ECB meeting, European shares have opened slightly lower, while earnings are the main driver behind early moves. Software AG is down sharply after its results. Swiss chemicals maker Clariant is taking a hit after activist White Tale sold its stake of almost 25 percent. White Tale managed to scupper Clariant's planned merger but failed more recently to secure an independent strategic review and board seats. Elekta, Elior Group, and STMicro are all gaining ground following updates. Shares in Diageo have advanced a meagre 0.8 percent after its sales growth was curbed by forex - is this a taste of things to come on the currency side for big international firms? Incidentally, Next is up after RBC turned bullish on the stock, citing a strong pound and improved sales outlook. Here's your opening snapshot: (Kit Rees) WHAT YOU NEED TO KNOW BEFORE EUROPE OPENS (0735 GMT) Futures point to a lower European opening after a surging euro and a faltering dollar rattled European bourses yesterday. The monthly ECB meeting and comments from U.S. officials in Davos will be under intense scrutiny. There is enough corporate news to animate the market outside of macroeconomic issues - in tech we had trading updates for SAP and STMicro. Investors are continuously assessing whether the sector is too expensive given its hefty multiples. Germany's Siemens said it is preparing for an eventual consolidation of platforms competing to provide businesses with factory software, which might trigger some speculative M&A positioning. Swedish banking group Nordea raised its dividend marginally more than expected for 2017 even though profits for the fourth quarter fell short of analyst expectations. Northern European banks with their strong capital ratios have been investors’ sweethearts for a while but with confidence rising for southern lenders, it’s interesting to see whether a change of heart could progressively occur. In the realm of “special sits”, activist White Tale is selling its nearly 25 percent stake in speciality chemicals group Clariant to Saudi Basic Industries. Merger arbs, which are already quite busy looking into the bids for the likes of Ablynx, GKN, or Sky, will also focus on Cineworld's attempt to buy U.S. rival Regal Entertainment, dealt a blow after advisory group Institutional Shareholder Services told investors to oppose the $3.6 billion deal. Here's a round-up of headlines: Activist White Tale sells Clariant stake to Saudi's SABIC Diageo sales growth curbed by forex Anglo American reports 5 pct rise in 2017 output European pilot group demands Ryanair meet unions collectively Siemens prepares for industrial software consolidation Nordea Q4 profit lags estimate, raises dividend UK's Asos beats forecasts for Christmas sales​ STMicro posts surge in year-end results but eyes seasonal Q1 dip Poland's PKN Q4 net profit falls 11 pct, misses forecast Software AG Q4 margins hit record; IoT business may double in 2018 ISS advises Cineworld shareholders to oppose Regal deal Block of Steinhoff loans successfully auctioned as lenders sell out Engie buys majority in hydrogen-based storage specialist EPS Italy's Tod's sees benefits from new management starting in H2 UK's Restaurant Group's 2017 comparable sales down 3 percent UK estate agents Foxtons foresees challenging 2018 BRIEF-Daily Mail group confirms outlook, Q1 ad revenue up 2 pct More oil and gas firms expect to hike capital spending in 2018 - survey Seadrill postpones restructuring plan hearing until Feb. 7 Wealth manager St. James's Place Q4 assets up on inflows, market gains Fingerprint Cards says to cut staff after warning of Q4 loss Aryzta's problems deepen as Europe, U.S. weakness leads to profit warning (Julien Ponthus and Tom Pfeiffer) IS THE RISK OF A STOCK MARKET CORRECTION RISING? (0715 GMT) On the theme of if/when we see a market pullback, economists at Oxford Economics say that short-term risks are broadly balanced between a downward correction and a further 'melt-up' rally, according to their analysis. But a continued 'melt-up' could risk an equity correction of \"well over 10%\". Oxford Economics reckons a stock market correction of 25 percent could cut U.S. growth to around 1 percent by 2019. (Kit Rees) EUROPEAN STOCK FUTURES POINT TO A START IN THE RED (0703 GMT) Earlier financial spreadbetters' indications made it hard to call in what direction European markets would open but futures now seem to point downward. (Julien Ponthus) WANTED: \"HEALTHY PULLBACK\" (0630 GMT) Just spotted an interesting quote in Chuck Mikolajczak's Wall Street report which highlights the fact that the continuous rise of markets is actually making some investors so nervous that a slight correction would be greeted with relief. \"The trend is higher and it is so universally, and with such conviction believed that any meaningful pullback is going to be aborted because investors simply don’t want to miss out,\" said Peter Kenny, senior market strategist at Global Markets Advisory Group in New York. \"So we are not seeing that healthy pullback that most investors would actually welcome.\" (Julien Ponthus)", "external_links": [], "published": "2018-01-25T10:20:00.000+02:00", "crawled": "2018-01-25T10:48:08.009+02:00", "highlightTitle": ""}