{"organizations": [], "uuid": "126caaa36e1577cb7ddda03dfa9956b0d769d399", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-493527752.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/23/hedge-funds-buying-bitcoin/", "country": "US", "domain_rank": 1196, "title": "Commentary: Hedge Funds Buying Bitcoin Could Be Because of Office | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.166, "site_type": "news", "published": "2018-01-23T10:54:00.000+02:00", "replies_count": 0, "uuid": "126caaa36e1577cb7ddda03dfa9956b0d769d399"}, "author": "Sina Esteky", "url": "http://fortune.com/2018/01/23/hedge-funds-buying-bitcoin/", "ord_in_thread": 0, "title": "Commentary: Hedge Funds Buying Bitcoin Could Be Because of Office | Fortune", "locations": [], "entities": {"persons": [{"name": "sina esteky", "sentiment": "negative"}, {"name": "bill miller", "sentiment": "none"}], "locations": [{"name": "bitcoin", "sentiment": "none"}], "organizations": [{"name": "miller value partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Sina Esteky 8:54 AM EST \nBitcoin, with its current $200 billion market cap, has proven to be one of the most mesmerizing investment vehicles in modern history—with unprecedented ups and downs. Many hedge funds are all-in on Bitcoin. Miller Value Partners, run by renowned investor Bill Miller, is one of them, with roughly 50% of its money in Bitcoin , an unusually high percentage allocated to just one investment. It’s the same story at many other big-name hedge funds. But don’t assume such risky investments were made based on objective analysis, forecasting, or even mere speculation. New research in consumer psychology suggests there are other, less obvious, factors at play. \nStepping back from the crypto-hype for a minute, let’s really think about why people may decide to invest in Bitcoin—or conversely, stay away from it. Normative economics theory would argue that a decision to invest in Bitcoin may depend on factors such as its past performance and predicted trajectory, supply and demand, regulatory issues, etc. But deep down, what’s the difference between a person who jumps on the bandwagon that may soon be worth a fortune—or zilch—and a bystander who decides to passively watch the best/worst investment opportunity of the century pass by? \nBehavioral researchers and economists have come up with a long list of reasons why some people seek risk while others avoid it. Much of this literature is based on the famed work of Daniel Kahneman—which earned him the Nobel prize in Economic Sciences in 2002—and Amos Tversky. These explanations range from personality traits to social pressure, cognitive biases, and cultural norms. However, in a recent paper published in the Journal of Consumer Psychology , my colleagues and I identified an entirely new and unexpected category of influences that can lead to risky investing, including in Bitcoin: a person’s location in a building. \nUsing archival data from more than half of the entire hedge fund industry (over 3,000 hedge funds, accounting for total assets of over $500 billion), we found that hedge funds were more likely to have volatile earnings if their managers had offices on higher floors of buildings. In fact, more than $800 million in investments was determined by managers’ office locations alone. These results suggest that one of the driving forces that may have led many hedge funds to invest heavily in Bitcoin is their physical environment, rather than objective analysis and forecasting of Bitcoin. Put differently, heavy Bitcoin investment among hedge funds may be partially due to one of the most prized possessions in corporate life: a stunning office view. (It’s worth mentioning that Miller Value Partners looks out over Baltimore’s Inner Harbor.) \nInterestingly, this phenomenon is not just applicable to those with the “Wolf of Wall Street” mentality—drunken with money and power. But in fact, it applies to practically everyone. Four field studies conducted across 22 states confirmed that being in higher stories of buildings leads to feeling more powerful, which then leads to increased risk-seeking behavior, such as gambling, risky betting, and risky investments. Surprisingly, people’s likelihood of investing in a risky asset increased by as much as 100% as a direct result of being at a high elevation. This is basically unwarranted risk-seeking—the kind that works against rational judgment and interests. \n\nThere’s a silver lining though. We also found that being in higher stories of a building without having a view does not lead to increased risk-taking. In practical terms, this means that if your financial adviser’s office is on the 20th floor, but he/she doesn’t have that stunning view, there’s no need to worry about how a subtle factor such as office location may inadvertently affect your investment performance. \nPhysical environment is more powerful than you might think. So, next time you are pondering over Bitcoin, or any other tempting investment opportunity for that matter, take a moment to consider your surroundings. It may be hard to believe, but that great office view you worked so hard to get may be working against you. \nSina Esteky is an assistant professor of marketing at Miami University’s Farmer School of Business. He holds dual doctorate degrees in marketing and architecture from the University of Michigan. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-23T10:54:00.000+02:00", "crawled": "2018-01-23T18:37:33.001+02:00", "highlightTitle": ""}