{"organizations": [], "uuid": "6fa300281605af8ea9ea46d3ed9bb63a84fe7b85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/04/104753011-_Y2A0009.1910x1000.JPG", "site_section": "http://www.cnbc.com/id/19854910/device/rss/rss.html", "section_title": "Tech", "url": "https://www.cnbc.com/2018/01/09/more-female-leaders-may-lead-to-fewer-harassment-cases-microsoft-exec.html", "country": "US", "domain_rank": 767, "title": "More female leaders may lead to fewer harassment cases: Microsoft exec", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T20:48:00.000+02:00", "replies_count": 0, "uuid": "6fa300281605af8ea9ea46d3ed9bb63a84fe7b85"}, "author": "Kellie Ell", "url": "https://www.cnbc.com/2018/01/09/more-female-leaders-may-lead-to-fewer-harassment-cases-microsoft-exec.html", "ord_in_thread": 0, "title": "More female leaders may lead to fewer harassment cases: Microsoft exec", "locations": [], "entities": {"persons": [{"name": "kirsten gillibrand", "sentiment": "none"}, {"name": "lindsey graham", "sentiment": "none"}, {"name": "smith", "sentiment": "none"}, {"name": "brad smith", "sentiment": "none"}], "locations": [{"name": "d-new york", "sentiment": "none"}, {"name": "r-south carolina", "sentiment": "none"}], "organizations": [{"name": "microsoft", "sentiment": "negative"}, {"name": "netflix", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Microsoft 's president said on Tuesday there would probably be fewer reports on sexual harassment if there were more women in leadership.\n\"I just don't believe that any institution that has a strong representation of women at the leadership level is likely to face some of the problems we've been reading about,\" said Brad Smith, president and chief legal officer at the software giant.\n\"We need to do a lot more to address diversity issues in the tech sector,\" he added on CNBC's \"Squawk Alley.\" \"There is no substitute for getting more women in more positions of leadership.\"\nSmith, also a board member at Netflix , said Microsoft and the general tech industry needs to take \"concrete steps\" in 2018 to address diversity issues, such as using the buzz from the #metoo and #timesup discussion as a starting point, \"so that women's voices can always be heard if they're facing a sexual harassment problem.\"\nLast month, Microsoft endorsed the Ending Forced Arbitration of Sexual Harassment Act, a bipartisan bill from Sens. Kirsten Gillibrand, D-New York, and Lindsey Graham, R-South Carolina, that would ensure that anyone who faced sexual harassment in the workplace could make their case in a public court. \n\"As each new story about sexual harassment demonstrates, current approaches in this area have proven insufficient,\" Smith wrote on the Microsoft blog in December. \"Even as we look squarely at the sins of the past, we must take stronger steps to prevent these problems in the future.\"\nThe computer software company does not enforce an arbitration provision relating to sexual harassment, according to Smith. But, he noted, Microsoft has contractual clauses requiring pre-dispute arbitration for a small number of employees.\nThe tech industry is ripe with diversity and gender issues. Most recently, for the second year in a row, no female leaders were among the keynote speakers at the Consumer Electronics Show, the tech industry's largest annual trade show in Las Vegas that's underway this week. The lack of female voices at the convention caused a backlash on social media with the hashtag #CESSoMale.\nMicrosoft also came under fire in October 2014 when its then-new CEO Satya Nadella advocated for women to not ask for pay raises. Nadella was speaking at a conference for women in computing, one of the largest gatherings of women in the world, when he told the audience to have \"faith in the system.\"\n\"That I think might be one of the additional super powers that, quite frankly, women who don't ask for a raise have,\" Nadella said at the time. \"Because that's good karma.\" He later apologized and said the response was a misunderstanding.\nMicrosoft is now taking steps to change the hiring process and the way senior executives are paid in order to reflect diversity progress, Smith told CNBC Tuesday.\n\"Satya has been driving a different culture here at Microsoft that bodes well for this,\" Smith said of his boss. \"It's all about trying to empathize and understand each other and learn together.\"", "external_links": [], "published": "2018-01-09T20:48:00.000+02:00", "crawled": "2018-01-09T20:54:53.012+02:00", "highlightTitle": ""}