{"organizations": [], "uuid": "d68bb3c32791b426c80e46497264ea37bc37ef07", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/business-wire-first-trust-high-income-longshort-fund-increases-its-monthly-common-share-distribution-to-0-point-128-per-share-for-february.html", "country": "US", "domain_rank": 767, "title": "First Trust High Income Long/Short Fund Increases its Monthly Common Share Distribution to $0.128 Per Share for February", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T00:51:00.000+02:00", "replies_count": 0, "uuid": "d68bb3c32791b426c80e46497264ea37bc37ef07"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/business-wire-first-trust-high-income-longshort-fund-increases-its-monthly-common-share-distribution-to-0-point-128-per-share-for-february.html", "ord_in_thread": 0, "title": "First Trust High Income Long/Short Fund Increases its Monthly Common Share Distribution to $0.128 Per Share for February", "locations": [], "entities": {"persons": [], "locations": [{"name": "wheaton", "sentiment": "none"}, {"name": "ill.", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WHEATON, Ill.--(BUSINESS WIRE)-- First Trust High Income Long/Short Fund (the \"Fund\") (NYSE: FSD) has increased its regularly scheduled monthly common share distribution to $0.128 per share from $0.1278 per share. The distribution will be payable on February 15, 2018, to shareholders of record as of February 2, 2018. The ex-dividend date is expected to be February 1, 2018. The monthly distribution information for the Fund appears below.\nFirst Trust High Income Long/Short Fund (FSD):\nDistribution per share: $0.128 Distribution Rate based on the January 19, 2018 NAV of $18.01: 8.53% Distribution Rate based on the January 19, 2018 closing market price of $16.57: 9.27% Increase from previous distribution of $0.1278: 0.16% A portion of this distribution may come from net investment income, net short-term realized capital gains or return of capital. The final determination of the source and tax status of all 2018 distributions will be made after the end of 2018 and will be provided on Form 1099-DIV.\nEffective with the monthly distribution declared on February 21, 2017, and continuing for all distributions declared during the following eleven months, the Fund's Board of Trustees approved the commencement of a distribution policy that provides for the declaration of monthly distributions to common shareholders of the Fund at an annual minimum fixed rate of 8.5% based on the Fund's average monthly NAV per share over the prior twelve months.\nThe Fund is a diversified, closed-end management investment company that seeks to provide current income. The Fund has a secondary objective of capital appreciation. The Fund seeks to achieve its investment objectives by investing, under normal market conditions, a majority of its assets in a diversified portfolio of U.S. and foreign (including emerging markets) high yield corporate fixed-income securities of varying maturities that are rated below-investment grade at the time of purchase.\nFirst Trust Advisors L.P., the Fund's investment advisor, along with its affiliate, First Trust Portfolios L.P., are privately-held companies which provide a variety of investment services, including asset management and financial advisory services, with collective assets under management or supervision of approximately $118 billion as of December 31, 2017 through unit investment trusts, exchange-traded funds, closed-end funds, mutual funds and separate managed accounts.\nMacKay Shields LLC (\"MacKay\") serves as the Fund's investment sub-advisor. MacKay is an indirect wholly-owned subsidiary of New York Life Insurance Company and a wholly-owned subsidiary of New York Life Investment Management Holdings LLC. MacKay is an income and equity solutions investment management firm, specializing in taxable and municipal fixed income credit and less efficient segments of global equity markets where proprietary research and unique portfolio construction techniques can generate attractive client oriented outcomes. MacKay serves a prominent group of pension funds, government and financial institutions, family offices, high net worth individuals, endowments and foundations from across the globe. As of December 31, 2017, MacKay manages approximately $114.0 billion in assets*.\n*Assets and information provided herein reflects the addition of Cornerstone Capital Management Holdings LLC's investment teams that joined MacKay on January 1, 2018.\nPast performance is no assurance of future results. Investment return and market value of an investment in the Fund will fluctuate. Shares, when sold, may be worth more or less than their original cost.\nPrincipal Risk Factors: The Fund invests in non-investment grade debt instruments, commonly referred to as \"high-yield securities\". High-yield securities are subject to greater market fluctuations and risk of loss than securities with higher ratings. Lower-quality debt tends to be less liquid than higher-quality debt.\nThe debt securities in which the Fund invests are subject to certain risks, including issuer risk, reinvestment risk, prepayment risk, credit risk, and interest rate risk. Issuer risk is the risk that the value of fixed-income securities may decline for a number of reasons which directly relate to the issuer. Reinvestment risk is the risk that income from the Fund's portfolio will decline if the Fund invests the proceeds from matured, traded or called bonds at market interest rates that are below the Fund portfolio's current earnings rate. Prepayment risk is the risk that, upon a prepayment, the actual outstanding debt on which the Fund derives interest income will be reduced. Credit risk is the risk that an issuer of a security will be unable or unwilling to make dividend, interest and/or principal payments when due and that the value of a security may decline as a result. Interest rate risk is the risk that fixed-income securities will decline in value because of changes in market interest rates.\nIn times of unusual or adverse market, economic, regulatory or political conditions, the Fund may not be able, fully or partially, to implement its short selling strategy. Short selling creates special risks which could result in increased volatility of returns and may result in greater gains or greater losses.\nThe Fund invests in securities of non-U.S. issuers which are subject to higher volatility than securities of U.S. issuers. Because the Fund invests in non-U.S. securities, you may lose money if the local currency of a non-U.S. market depreciates against the U.S. dollar.\nThe risks of investing in the Fund are spelled out in the shareholder reports and other regulatory filings.\nThe information presented is not intended to constitute an investment recommendation for, or advice to, any specific person. By providing this information, First Trust is not undertaking to give advice in any fiduciary capacity ERISA and the Internal Revenue Code. First Trust has no knowledge of and has not been provided any information regarding any investor. Financial advisors must determine whether particular investments are appropriate for their clients. First Trust believes the financial advisor is a fiduciary, is capable of evaluating investment risks independently and is responsible for exercising independent judgment with respect to its retirement plan clients.\nThe Fund’s daily closing New York Stock Exchange price and net asset value per share as well as other information can be found at www.ftportfolios.com or by calling 1-800-988-5891.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180122006595/en/\nFirst Trust High Income Long/Short Fund\nPress Inquiries: Jane Doyle, 630-765-8775\nAnalyst Inquiries: Jeff Margolin, 630-915-6784\nBroker Inquiries: Jeff Margolin, 630-915-6784\nSource: First Trust High Income Long/Short Fund", "external_links": ["http://www.businesswire.com/news/home/20180122006595/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ftportfolios.com&esheet=51747165&newsitemid=20180122006595&lan=en-US&anchor=www.ftportfolios.com&index=1&md5=c654df5998c0b3b74103be26418daace"], "published": "2018-01-23T00:51:00.000+02:00", "crawled": "2018-01-23T02:14:55.035+02:00", "highlightTitle": ""}