{"organizations": [], "uuid": "3b3032041fdcbed519c52a17e092d60f76034af9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-essa-announces-filing-of-amended-and-restated-prospectus-supplement-and-an-update-to-previously-announced-equity-offering.html", "country": "US", "domain_rank": 767, "title": "ESSA Announces Filing of Amended and Restated Prospectus Supplement and an Update to Previously Announced Equity Offering", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T03:45:00.000+02:00", "replies_count": 0, "uuid": "3b3032041fdcbed519c52a17e092d60f76034af9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/pr-newswire-essa-announces-filing-of-amended-and-restated-prospectus-supplement-and-an-update-to-previously-announced-equity-offering.html", "ord_in_thread": 0, "title": "ESSA Announces Filing of Amended and Restated Prospectus Supplement and an Update to Previously Announced Equity Offering", "locations": [], "entities": {"persons": [{"name": "essa", "sentiment": "none"}], "locations": [{"name": "tx", "sentiment": "none"}, {"name": "vancouver", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "essa", "sentiment": "negative"}, {"name": "essa pharma inc.", "sentiment": "negative"}, {"name": "epi", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON, TX and VANCOUVER, Jan. 2, 2018 /PRNewswire/ - ESSA Pharma Inc. (TSXV: EPI; NASDAQ: EPIX) (\" ESSA \" or the \" Company \") announces a further update to its previously announced equity offering. The Company intends to issue up to 125,000,000 common shares of the Company (\" Common Shares \") at a price of US$0.20 per Common Share (the \" Offering Price \") for aggregate gross proceeds of up to US$25 million (the \" Offering \"). In lieu of a Common Share, purchasers may elect to receive one pre-funded common share purchase warrant of the Company (a \" Warrant \"). Each Warrant will entitle the holder thereof to acquire, for a nominal exercise price, one common share in the capital of the Company (each, a \" Warrant Share \") until 4:30 p.m. (Toronto time) on the date that is 60 months following its date of issuance.\nThe Offering will be undertaken on a best efforts basis pursuant to the terms and conditions of an amended and restated agency agreement dated January 2, 2018 between the Company and the Canadian agent as the Company's sole agent for the Offering in Canada (the \" Canadian Agent \"). The price and the number of Common Shares and Warrants were determined by negotiation between the Company and the Canadian Agent in the context of the market.\nThe Company has granted to the Canadian Agent an over-allotment option, exercisable at any time up to January 17, 2018, to arrange for the purchase from the Company of up to that number of additional Common Shares and Warrants as is equal to 15% of the Common Shares and Warrants sold under the Offering on the same basis as the Common Shares and Warrants to cover the Canadian Agent's over-allocation position, if any, and for market stabilization purposes.\nThe Common Shares and Warrants may also be offered for sale in the United States through United States registered broker dealers appointed by the Canadian Agent. The selling group will be: (a) paid a cash commission equal to 7.0% of the gross proceeds of the Offering (except in respect of Common Shares and Warrants issued in certain circumstances to specified purchasers, in which case the cash commission will be reduced to 3.5%); and (b) issued broker warrants (the \" Broker Warrants \") representing 5% of the aggregate number of Common Shares and Warrants issued and sold under the Offering. No Broker Warrants will be issuable with respect to any Common Shares or Warrants purchased in certain circumstances to specified purchasers. Each Broker Warrant entitles the holder thereof to acquire one common share of the Company (a \" Broker Warrant Share \") at the Offering Price for a period of 60 months following its date of issuance.\nThe Company intends to use the net proceeds of the Offering primarily to continue the ongoing preclinical development of the Company's next-generation Aniten compounds. The net proceeds will also be used for the interest and principal payments on the Company's outstanding debt and for working capital and general corporate purposes.\nThe Company will apply to list the Common Shares, the Warrant Shares and the Broker Warrant Shares on the TSX Venture Exchange (\" TSXV \") and the NASDAQ Capital Market (\" NASDAQ \"). Listing will be subject to satisfying all of the requirements of the TSXV and the NASDAQ. The Company expects to close the Offering in one or more closings, with the first closing to occur on or about January 5, 2018 or such other date as may be mutually agreed to by the Company and the Canadian Agent, subject to satisfaction of customary closing conditions, including, but not limited to, the receipt of all necessary stock exchange approvals, such as the conditional approval of the TSXV and the NASDAQ.\nThe Offering is to be effected in each of the provinces of British Columbia, Alberta and Ontario by way of an amended and restated prospectus supplement dated January 2, 2018 to ESSA's base shelf prospectus dated December 22, 2015 and elsewhere on a private placement basis.\nThe securities described herein have not been registered under the United States Securities Act of 1933, as amended (the \" U.S. Securities Act \"), or any state securities laws, and accordingly, may not be offered or sold to, or for the account or benefit of, persons in the United States or \"U.S. persons,\" as such term is defined in Regulation S promulgated under the U.S. Securities Act (\" U.S. Persons \"), except in compliance with the registration requirements of the U.S. Securities Act and applicable state securities requirements or pursuant to exemptions therefrom. This press release does not constitute an offer to sell or a solicitation of an offer to buy any of the Company's securities to, or for the account of benefit of, persons in the United States or U.S. Persons.\nForward-Looking Statement Disclaimer\nThis release contains certain information which, as presented, constitutes \"forward-looking information\" within the meaning of the Private Securities Litigation Reform Act of 1995 and/or applicable Canadian securities laws. Forward-looking information involves statements that relate to future events and often addresses expected future business and financial performance, containing words such as \"anticipate\", \"believe\", \"plan\", \"estimate\", \"expect\", and \"intend\", statements that an action or event \"may\", \"might\", \"could\", \"should\", or \"will\" be taken or occur, or other similar expressions and includes, but is not limited to, statements about the timing of the initial closing of the Offering, the satisfaction and timing of the receipt of required stock exchange approvals and other conditions to closing of the Offering, the jurisdictions in which the Common Shares and Warrants will be offered and the intended use of proceeds of the Offering.\nForward-looking statements and information are subject to various known and unknown risks and uncertainties, many of which are beyond the ability of ESSA to control or predict, and which may cause ESSA's actual results, performance or achievements to be materially different from those expressed or implied thereby. Such statements reflect ESSA's current views with respect to future events, are subject to risks and uncertainties and are necessarily based upon a number of estimates and assumptions that, while considered reasonable by ESSA as of the date of such statements, are inherently subject to significant medical, scientific, business, economic, competitive, political and social uncertainties and contingencies. In making forward looking statements, ESSA may make various material assumptions, including but not limited to (i) the accuracy of ESSA's financial projections; (ii) obtaining positive results of clinical trials; (iii) obtaining necessary regulatory approvals; and (iv) general business, market and economic conditions.\nForward-looking information is developed based on assumptions about such risks, uncertainties and other factors set out herein and in ESSA's Annual Report on Form 20-F dated December 11, 2017 under the heading \"Risk Factors\", a copy of which is available on ESSA's profile on the SEDAR website at www.sedar.com , ESSA's profile on EDGAR at www.sec.gov , and as otherwise disclosed from time to time on ESSA's SEDAR profile. Forward-looking statements are made based on management's beliefs, estimates and opinions on the date that statements are made and ESSA undertakes n", "external_links": [], "published": "2018-01-03T03:45:00.000+02:00", "crawled": "2018-01-03T04:11:18.009+02:00", "highlightTitle": ""}