{"organizations": [], "uuid": "69e3f45ffd08cdb965a24079545808e902b9856c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 314}, "facebook": {"likes": 3286, "shares": 3286, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/08/104640101-Dimon-Intv-102.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/09/jamie-dimon-says-he-regrets-calling-bitcoin-a-fraud.html", "country": "US", "domain_rank": 767, "title": "Jamie Dimon says he regrets calling bitcoin a fraud", "performance_score": 10, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T14:42:00.000+02:00", "replies_count": 0, "uuid": "69e3f45ffd08cdb965a24079545808e902b9856c"}, "author": "Tae Kim", "url": "https://www.cnbc.com/2018/01/09/jamie-dimon-says-he-regrets-calling-bitcoin-a-fraud.html", "ord_in_thread": 0, "title": "Jamie Dimon says he regrets calling bitcoin a fraud", "locations": [], "entities": {"persons": [{"name": "jamie dimon", "sentiment": "negative"}, {"name": "dimon", "sentiment": "none"}], "locations": [], "organizations": [{"name": "j.p. morgan chase", "sentiment": "negative"}, {"name": "institute of international finance", "sentiment": "none"}, {"name": "fox business", "sentiment": "none"}, {"name": "icos", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Let friends in your social network know what you are reading about Facebook J.P. Morgan Chase CEO Jamie Dimon says he regrets calling bitcoin a fraud J.P. Morgan Chase CEO said he regrets calling bitcoin a fraud. Dimon remains concerned about how \"governments are going to feel about bitcoin when it gets really big.\" Post to Facebook A link has been posted to your Facebook feed. Join the Nation's Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs J.P. Morgan Chase CEO Jamie Dimon says he regrets calling bitcoin a fraud Tae Kim, CNBC Published 9:18 a.m. ET Jan. 9, 2018 CLOSE A proven currency, or a predictable flop? Whatever side you're on, Bitcoin has taken the financial world by surprise in 2017. And, as Kate King reports, warnings about the cyrptocurrency are increasing. Video provided by Reuters Newslook In this Wednesday, June 13, 2012, file photo, JPMorgan Chase CEO Jamie Dimon, head of the largest bank in the United States, testifies before the Senate Banking Committee on Capitol Hill in Washington. (Photo: J. Scott Applewhite, AP) CONNECT COMMENT EMAIL MORE J.P. Morgan Chase Chairman and CEO Jamie Dimon is backpedaling a bit on his earlier criticisms on cryptocurrencies. In September, Dimon called bitcoin a fraud. On Tuesday, he regretted making that comment. \"The blockchain is real,\" Dimon told Fox Business. \"You can have crypto dollars in yen and stuff like that. ICOs ... you got to look at every one individually. The bitcoin was always to me what the governments are going to feel about bitcoin when it gets really big. And I just have a different opinion than other people.\" ICOs stands for initial coin offerings, a controversial way some cryptocurrency companies are raising funds. More: Parody cryptocurrency just broke $2 billion for its market cap \"I'm not interested that much in the subject at all,\" Dimon added in the interview. Along with his earlier bitcoin is a \"fraud\" statement the executive also blasted digital currency investors last year. \"If you're stupid enough to buy it, you'll pay the price for it one day,\" he said in response to a moderator question at an Institute of International Finance conference in October. The price of bitcoin declined 1.4% to $14,760 Tuesday, according to data from industry website CoinDesk. The digital currency is up more than 1,500% in the past 12 months. © CNBC is a USA TODAY content partner offering financial news and commentary. Its content is produced independently of USA TODAY. CLOSE These celebrities are jumping on the cryptocurrency bandwagon. Time CONNECT COMMENT EMAIL MORE", "external_links": [], "published": "2018-01-09T14:42:00.000+02:00", "crawled": "2018-01-09T15:20:54.048+02:00", "highlightTitle": ""}