{"organizations": [], "uuid": "f31c8a8e3a102e4f0cd716822dbeb57261195651", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-guggenheim-currencysharesa-exchange-traded-products-declare-monthly-distributions.html", "country": "US", "domain_rank": 767, "title": "Guggenheim CurrencyShares® Exchange Traded Products Declare Monthly Distributions", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T19:28:00.000+02:00", "replies_count": 0, "uuid": "f31c8a8e3a102e4f0cd716822dbeb57261195651"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-guggenheim-currencysharesa-exchange-traded-products-declare-monthly-distributions.html", "ord_in_thread": 0, "title": "Guggenheim CurrencyShares® Exchange Traded Products Declare Monthly Distributions", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "guggenheim investments", "sentiment": "negative"}, {"name": "nyse", "sentiment": "none"}, {"name": "singapore dollar trust", "sentiment": "none"}, {"name": "trust", "sentiment": "none"}, {"name": "guggenheim partners", "sentiment": "none"}, {"name": "fxsg currencyshares singapore dollar trust", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 02, 2018 (GLOBE NEWSWIRE) -- Guggenheim Investments, the investment management division of Guggenheim Partners, today announced the distribution declarations for CurrencyShares ® Australian Dollar Trust (NYSE:FXA) and CurrencyShares ® Singapore Dollar Trust (NYSE:FXSG).\nNYSE\nTicker Fund Name Declaration\nDate Ex-\ndividend\nDate Record\nDate Payable\nDate/Share\nDistribution FXA CurrencyShares Australian\nDollar Trust 12.29.2017 1.2.2018 1.3.2018 1.9.2018 $0.03543 FXSG CurrencyShares\nSingapore Dollar Trust 12.29.2017 1.2.2018 1.3.2018 1.9.2018 $0.00931 Distributions are made to shareholders on a pro-rata basis (in accordance with the number of shares that are owned) only in the event that the interest earned by the Trust exceeds the sum of the sponsor’s fee for the prior month plus other Trust expenses, if any. There is no guarantee that distributions will be made on a monthly basis.\nCurrencyShares ® offer investors and institutions a convenient and cost-effective method of gaining investment benefits similar to that of holding foreign currencies, including potential diversification and hedging benefits. More details about the products are available at www.currencyshares.com .\nAbout Guggenheim Investments\nGuggenheim Investments is the global asset management and investment advisory division of Guggenheim Partners, with $243 billion 1 in total assets across fixed income, equity, and alternative strategies. We focus on the return and risk needs of insurance companies, corporate and public pension funds, sovereign wealth funds, endowments and foundations, consultants, wealth managers, and high-net-worth investors. Our 275+ investment professionals perform rigorous research to understand market trends and identify undervalued opportunities in areas that are often complex and underfollowed. This approach to investment management has enabled us to deliver innovative strategies providing diversification opportunities and attractive long-term results.\nDiversification neither assures a profit nor eliminates the risk of experiencing investment losses.\nCurrencyShares are subject to risks similar to those of stocks and may not be suitable for all investors. The value of the shares of each CurrencyShares Trust relates directly to the value of the foreign currency held by the particular Trust. This creates a concentration risk associated with fluctuations in the price of the applicable foreign currency. Accordingly, a decline in the price of that currency will have an adverse effect on the value of the shares of the particular CurrencyShares Trust. Factors that may have the effect of causing a decline in the price of a foreign currency include national debt levels and trade deficits, domestic and foreign interest rates, investment and trading activities of institutions and global or regional political, economic or financial events and situations. Investors should consider the investment objectives, risks, charges and expenses of these products carefully before investing. The prospectus pertaining to each product contains this and other information about the product. Please read the applicable prospectus, including the Risk Factors section, carefully before you invest. Shares can be bought and sold through a broker and the purchasers or sellers may have to pay brokerage commissions in connection with the transaction. Investment returns and principal value will fluctuate so that shares may be worth more or less than original cost. Shares may only be redeemed directly from the Trust by Authorized Participants via baskets (as defined in the prospectus). There can be no assurance that an active trading market for the shares will develop or be maintained. The CurrencyShares Trusts are not investment companies registered under the Investment Company Act of 1940. As a result the Trust(s) are not subject to the regulatory requirements of investment companies.\nThe CurrencyShares® Australian Dollar Trust , CurrencyShares® British Pound Sterling Trust , CurrencyShares® Canadian Dollar Trust , CurrencyShares® Chinese Renminbi Trust , CurrencyShares® Euro Trust , CurrencyShares® Japanese Yen Trust , CurrencyShares® Singapore Dollar Trust , CurrencyShares® Swiss Franc Trust and CurrencyShares® Swedish Krona Trust (each a “Trust” and collectively, the “Trusts”) has filed a registration statement (including a prospectus) with the SEC for the offerings to which this communication relates. Before you invest in the shares of a Trust, you should read the prospectus in the registration statement and other documents the Trust has filed with the SEC for more complete information about the Trust and its offering. You may get these documents for free by visiting EDGAR on the SEC web site at www.sec.gov . Alternatively, you may click the links above or the Trust will arrange to send you its prospectus if you request it by calling toll-free 800.820.0888.\nThe CurrencyShares Trusts are distributed by Guggenheim Funds Distributors, LLC. Guggenheim Investments represents the investment management businesses of Guggenheim Partners, LLC (“Guggenheim”), which includes Security Investors, LLC (“SI”). Guggenheim Specialized Products, LLC (“GSP”), the Sponsor for the CurrencyShares Trusts, is a wholly owned subsidiary of SI. Guggenheim Funds Distributors, LLC, is affiliated with Guggenheim, SI and GSP.\nNot FDIC Insured – No Bank Guarantee –May Lose Value.\nThis material is not intended as a recommendation or as investment advice of any kind, including in connection with rollovers, transfers, and distributions. Such material is not provided in a fiduciary capacity, may not be relied upon for or in connection with the making of investment decisions, and does not constitute a solicitation of an offer to buy or sell securities. All content has been provided for informational or educational purposes only and is not intended to be and should not be construed as legal or tax advice and/or a legal opinion. Always consult a financial, tax and/or legal professional regarding your specific situation.\nMedia Contact\nIvy McLemore\nManaging Director, Investment Communications\nGuggenheim Investments\n212.518.9859\nIvy.mclemore@guggenheimpartners.com\nTEMP 29613\n1 Guggenheim Investments total asset figure is as of 9.30.2017. The assets include leverage of $11.6bn for assets under management and $0.4bn for assets for which we provide administrative services. Guggenheim Investments represents the following affiliated investment management businesses of Guggenheim Partners, LLC: Guggenheim Partners Investment Management, LLC, Security Investors, LLC, Guggenheim Funds Investment Advisors, LLC, Guggenheim Funds Distributors, LLC, Guggenheim Real Estate, LLC, GS GAMMA Advisors, LLC, Guggenheim Partners Europe Limited, and Guggenheim Partners India Management.\nSource: Guggenheim Investments", "external_links": ["https://www.globenewswire.com/Tracker?data=fCGUBQgj_Cjaj7_s37M73QzkpAveAfPDTVYeEGY6FiMipup_h7YIneThmJoadcMW6l6LMal8sLoD0sNyPRjHOWSQQT5fYW6GlZpX7oEOfiQe2Z-pGEBQe7XL2HHXLRrMBmOYZyu1-UxNRpqmML5lY-z0vM5Cnl3DOL7-szc_2dkAqWjF1BmMdNf7mf5m6gas", "https://www.globenewswire.com/Tracker?data=fCGUBQgj_Cjaj7_s37M73W-R_xjsy2CCCfaKxjXMwWRtcyHOzfpJm51vtfPtmDxH9PzYPrLmi3NoIohWIrZbnP6jYY_UjzMRI3u3jysfNKGwlaMDCCUiQc_BjKu8W6MCcYsfQB_aHqPU4P5c4f9NrtaSaCY0rDZFy0_GgYncnZI56dGhmKZ_fZDlS_07cJ_u", "https://www.globenewswire.com/Tracker?data=fCGUBQgj_Cjaj7_s37M73SFTwUfS0XODvTA1Xv6Dv1-KOUsFaPTUmmHxi_o6-2DTsM0_M4JgC4th0AS0k6jlxrhwbDx39CodQXxZxAFSe9t_-tpo3lwZCWOZ2Bcae7TlFWHy24PcT_9eEZc7G_gYoMA70dH379yr99hL5j-LqBw=", "https://www.globenewswire.com/Tracker?data=fCGUBQgj_Cjaj7_s37M73XNBsCNYGiC2UJpeqnGUGlUU3tJlNZu7UK8ck4WXIunQrrGQAyngLDGfAX4UVLYriW0z16kMoQZxjITNDqMyOoh_ZqSt1IpWSzzHj6heIHbpdFV6lIhbsdgch9J_UiHfG66Ou8N2iaHEW9hsdJYetRDfqMIIHVubfOn94ZWo8S3W", "https://www.globenewswire.com/Tracker?data=yN4BAH_HRRHBGC4B7vs6aeN8DVCbkqVh-_vOs1CyULYVovKsnRblBml08rRzmd30BSIckblAtFEQcL58Vvb-1Q==", "https://www.globenewswire.com/Tracker?data=-Wu_d0ImcIWzxzxYESv4-iVe7RyPxyMtoU3bxO-N8cJ1krae16qwlDnZpMz84KZ9UCMeGiCnHB7HyDSEFAjOrCNDmEHQrK0EnmcKm2yhX8Y=", "https://www.globenewswire.com/Tracker?data=fCGUBQgj_Cjaj7_s37M73dAkJjvSRjrD9lrJ0By82dYNNswn4haEkwwloLlrb6EvZcMN6ULd_p4-O9Ncr1KoyJRXKldD1yLDR6TZ6e-dXpwh5v5ZoIQDuZxs0geo0uZLr_FfyBjdnfgFRyoAYR0iaGDyZfWKB_FCWZtxwKMp439Y5Ceg6bs7PhJf02E798-y", "https://www.globenewswire.com/Tracker?data=fCGUBQgj_Cjaj7_s37M73dV4g1_CfJZhKrTF68M1EXSuX3--f1h-RlRT8ya5ixm68HK71ys27gCTAVDURuuWfudGLYuZNhLU3PW20GNDR970GigI3QiFdzhBU6G0t8qqk2GipO5KxHNtfRSlXcHoV0iZCeEkgoesIE2izgkX7do=", "https://www.globenewswire.com/Tracker?data=rtAk3NMN-E_bakCMut0VGvJmT-D-ZN7svECQnBXkyTVhclsHtqzuEPJx_wgoQ3fxWQQX1OSQdMjwRq0e_cRS8oodWCHPZ7JuhegWXV5FI3u2SqsErY3D42KSKlGLDm2SHwrR1KI-w4SS67VE47pzIQ==", "https://www.globenewswire.com/Tracker?data=fCGUBQgj_Cjaj7_s37M73XoknkHK65wt-rikhj1uAP5q-R6_LLLS7Q2tXiISdzYp3NWX5utfgoo07N8VeXKMWOFJJe6n4ofYDAxlsvF7V4jjhjRKVu6Os7E1yGPsnuRiMw_OKfyCqzNzj1-6_QFQfx5xImScfwbW_LvEt4Q7qHTvXqAULNtxH1sSb_-ZgDBe", "https://www.globenewswire.com/Tracker?data=fCGUBQgj_Cjaj7_s37M73WvUY55jmLBjEdaqnY5RiJh8QLzIvhgpFT2lD6H1nk8gpkdnK3xB58FgMovhIpLeuYPuqt7PObD9MrvbT_88mOCqsDbj1jHijNBm3A1pqMJpPT1i-cNydbMmyYASpe_-qOz9fToarx9NTwFS1CudXixh4qDVFBCgJdPNMvRU1V20", "https://www.globenewswire.com/Tracker?data=fCGUBQgj_Cjaj7_s37M73chmmK8PFFJpS41dVOUVeWm0hlx9p-2SjXP4P-lXwDRdxiIocx2TFANz4nhMnLUc8rdp-aggeZaCJBNWacnEuyB8s4Gbg-NMW51bHxQt1Wg_la9UdcwVrvy29VsbDbF3FYm9U6BM2SsaoPJ7-lqJi9w="], "published": "2018-01-02T19:28:00.000+02:00", "crawled": "2018-01-02T19:09:54.007+02:00", "highlightTitle": ""}