{"organizations": [], "uuid": "9b33b19aad94cd4b2832abc71b410b2bc5f10297", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-two-wealth-managers-join-first-republic-in-san-francisco.html", "country": "US", "domain_rank": 767, "title": "Two Wealth Managers Join First Republic in San Francisco", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.999, "site_type": "news", "published": "2018-01-08T17:00:00.000+02:00", "replies_count": 0, "uuid": "9b33b19aad94cd4b2832abc71b410b2bc5f10297"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-two-wealth-managers-join-first-republic-in-san-francisco.html", "ord_in_thread": 0, "title": "Two Wealth Managers Join First Republic in San Francisco", "locations": [], "entities": {"persons": [{"name": "wechsler", "sentiment": "none"}, {"name": "stu", "sentiment": "none"}, {"name": "jeffrey schottenstein", "sentiment": "none"}, {"name": "stuart wechsler", "sentiment": "none"}, {"name": "schottenstein", "sentiment": "none"}, {"name": "bob thornton", "sentiment": "none"}, {"name": "jeff", "sentiment": "none"}], "locations": [{"name": "san francisco san francisco", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "connecticut", "sentiment": "none"}, {"name": "first republic", "sentiment": "none"}, {"name": "greenwich", "sentiment": "none"}], "organizations": [{"name": "first republic bank", "sentiment": "negative"}, {"name": "schottenstein & wechsler group", "sentiment": "none"}, {"name": "merrill lynch", "sentiment": "none"}, {"name": "first republic investment management", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO--(BUSINESS WIRE)-- First Republic Bank (NYSE: FRC), a leading private bank and wealth management company, today announced that Jeffrey Schottenstein and Stuart Wechsler of the Schottenstein & Wechsler Group have joined First Republic Investment Management as Managing Directors and Wealth Managers.\nSchottenstein and Wechsler, who each have more than 20 years of experience, will work in First Republic’s offices in San Francisco and Greenwich, Connecticut. Together, they will continue to provide wealth management services to individuals, families, businesses, nonprofits and foundations.\n“First Republic is pleased to welcome Jeffrey Schottenstein and Stuart Wechsler to our wealth management team,” said Bob Thornton, President of First Republic Private Wealth Management. “Jeff and Stu are very experienced wealth managers who are quite successful in helping clients achieve their investment objectives. They both share First Republic’s commitment to exceptional client service.”\nSchottenstein most recently worked for Merrill Lynch as a Managing Director and Private Wealth Advisor. Prior to that, he was a Principal with Thomas Weisel Partners. He began his career with Montgomery Securities in San Francisco. Schottenstein was named by Barron’s as one of the nation’s top 15 financial advisors. Schottenstein currently serves on the Board of Directors of the Gastric Cancer Foundation and formerly served as President of the Board of Directors of First Graduate, a nonprofit organization helping students become the first in their families to graduate from college. Schottenstein earned an MBA from the Northwestern University Kellogg School of Management and a bachelor’s degree from the University of Wisconsin - Madison.\nWechsler most recently worked for Merrill Lynch as a Managing Director and Private Wealth Advisor. Prior to that, he was a Principal with Thomas Weisel Partners. He began his career with Montgomery Securities in New York. Wechsler is an active supporter of many charities that benefit children, education and cancer research including Gilda’s Club, the Solomon Schechter School and the Ronald McDonald House. He earned a Bachelor of Business Administration degree from Emory University’s Goizueta Business School.\nAbout First Republic Bank\nFounded in 1985, First Republic and its subsidiaries offer private banking, private business banking and private wealth management, including investment, trust and brokerage services. First Republic specializes in delivering exceptional, relationship-based service, with a solid commitment to responsiveness and action. Services are offered through preferred banking or wealth management offices primarily in San Francisco, Palo Alto, Los Angeles, Santa Barbara, Newport Beach and San Diego, California; Portland, Oregon; Boston, Massachusetts; Palm Beach, Florida; Greenwich, Connecticut; New York, New York; and later in 2018, Jackson, Wyoming. First Republic offers a complete line of banking products for individuals and businesses, including deposit services, as well as residential, commercial and personal loans. For more information, visit firstrepublic.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180108005260/en/\nInvestors:\nAddo Communications\nAndrew Greenebaum, 310-829-5400\nagreenebaum@addoir.com\nLasse Glassen, 310-829-5400\nlglassen@addoir.com\nor\nMedia:\nBlue Marlin Partners\nGreg Berardi, 415-239-7826\ngreg@bluemarlinpartners.com\nSource: First Republic Bank", "external_links": ["http://www.businesswire.com/news/home/20180108005260/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.firstrepublic.com%2F&esheet=51738935&newsitemid=20180108005260&lan=en-US&anchor=firstrepublic.com&index=1&md5=62b4af36952ccb1fa44833980ab9fc84"], "published": "2018-01-08T17:00:00.000+02:00", "crawled": "2018-01-08T19:04:22.002+02:00", "highlightTitle": ""}