{"organizations": [], "uuid": "1000dfeb912381efd1d1d405b8cbfa3f6d28c9cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-stmicroelectronics-reports-2017-fourth-quarter-and-full-year-financial-results.html", "country": "US", "domain_rank": 767, "title": "STMicroelectronics Reports 2017 Fourth Quarter and Full Year Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T09:01:00.000+02:00", "replies_count": 0, "uuid": "1000dfeb912381efd1d1d405b8cbfa3f6d28c9cc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-stmicroelectronics-reports-2017-fourth-quarter-and-full-year-financial-results.html", "ord_in_thread": 0, "title": "STMicroelectronics Reports 2017 Fourth Quarter and Full Year Financial Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "stmicroelectronics", "sentiment": "negative"}, {"name": "st", "sentiment": "none"}, {"name": "nyse", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PR No. C2842C\nSTMicroelectronics Reports 2017 Fourth Quarter\nand Full Year Financial Results\nQ4 net revenues of $2.47 billion, up 15.5% sequentially and gross margin of 40.6%, both above the mid-point of ST's guidance Q4 operating income of $408 million, operating margin of 16.5% 2017 net revenues of $8.35 billion, up 19.7% year-over-year on broad-based growth 2017 net income of $802 million, free cash flow (1) of $338 million\nGeneva, January 25, 2018 - STMicroelectronics (NYSE: STM), a global semiconductor leader serving customers across the spectrum of electronics applications, reported financial results for the fourth quarter and full year ended December 31, 2017.\nFourth quarter net revenues totaled $2.47 billion, gross margin was 40.6%, and net income was $308 million or $0.34 diluted earnings per share.\n\"ST delivered a strong finish to 2017. Fourth quarter net revenues were up 32.6% year-over-year with double-digit growth across all product groups, gross margin reached 40.6%, and operating margin was at 16.5%,\" commented Carlo Bozotti, STMicroelectronics President & CEO. \"On a sequential basis, fourth quarter revenues grew significantly better than seasonal at 15.5% and were 200 basis points above the high-end of our guidance, mainly thanks to higher than expected revenues in Imaging products and Microcontrollers.\n\"Full Year 2017 net revenues increased 19.7% on strong growth across all product groups and geographies; gross margin expanded 400 basis points, operating margin increased 880 basis points to 11.9% and net income improved by $637 million to $802 million.\n\"This successful year also marked the 30 th anniversary of the formation of ST. We celebrate this milestone with a solid product leadership in Internet of Things, Smartphones, Industrial and Smart Driving applications, a strong market position with major customers and in Distribution, a world-class team of engaged employees, a sustainable financial performance and an industry-leading return on invested capital.\"\nFinancial Summary (US$ Million)\nU.S. GAAP\n(Million US$) Q4 2017 Q3 2017 Q4\n2016 FY 2017 FY 2016 Net Revenues 2,466 2,136 1,859 8,347 6,973 Gross Margin 40.6% 39.5% 37.5% 39.2% 35.2% Operating Income 408 278 129 993 214 Net Income attributable to parent company 308 236 112 802 165 Net cash from operating activities 587 463 378 1,707 1,043\nNon-U.S. GAAP (1)\n(Million US$) Q4\n2017 Q3\n2017 Q4\n2016 FY\n2017 FY\n2016 Operating Income before impairment & restructuring charges 428 292 153 1,038 307 Free cash flow 145 80 135 338 316 Net financial position 489 446 513 489 513 (1) Non-U.S. GAAP measure. See Appendix for reconciliation to U.S. GAAP and additional information explaining why the Company believes these measures are important.\nQuarterly Financial Summary by Product Group\nCommencing in the fourth quarter of 2017, the Company transferred the Imaging Product Division, previously reported in Others, into the Analog and MEMS Group (AMG) to create the new organization Analog, MEMS and Sensors Group (AMS) led by Benedetto Vigna.\nProduct Group Revenues\n(Million US$) Q4\n2017 Q3\n2017 Q4\n2016 FY\n2017 FY\n2016 Automotive and Discrete Group (ADG) 821 775 716 3,059 2,813 Analog, MEMS and Sensors Group (AMS) (a) 896 652 527 2,613 1,847 Microcontrollers and Digital ICs Group (MDG) 740 701 610 2,646 2,285 Others (b) 9 8 6 29 28 Total 2,466 2,136 1,859 8,347 6,973 (a) Reflects the transfer of the Imaging Product Division, previously reported in Others, to AMS as of the fourth quarter of 2017, the Company has reclassified prior-period revenues.\n(b) Net revenues of \"Others\" includes revenues from sales of Subsystems, assembly services, and other revenue.\nFourth Quarter Review\nFourth quarter net revenues increased 15.5% sequentially, a better than seasonal performance, and 200 basis points above the high-end of the Company's guidance range mainly due to higher than expected revenues in Imaging products and Microcontrollers. On a sequential basis, Analog, MEMS and Sensors Group (AMS) revenues increased 37.4% led by the Imaging Product Division which registered, as expected, triple-digit sequential growth. Automotive and Discrete Group (ADG) revenues were up 5.9% and Microcontrollers and Digital ICs Group (MDG) revenues increased 5.6%.\nOn a year-over-year basis, fourth quarter net revenues increased by 32.6% on double-digit growth across all product groups with strong traction of new products. Analog, MEMS and Sensors Group (AMS) fourth quarter revenues grew 70.1% year-over-year due to triple-digit growth in Imaging, a sharp recovery in Analog and solid growth in MEMS. Microcontrollers and Digital ICs Group (MDG) fourth quarter revenues grew 21.4% year-over-year on very strong growth for general purpose microcontrollers, in part offset by lower sales of businesses undergoing phase-out. Automotive and Discrete Group (ADG) fourth quarter revenues increased 14.6% compared to the year-ago quarter on strong results for both Automotive and Power Discrete.\nBy region of shipment, revenues grew on a sequential basis across all regions. Specifically, Asia Pacific revenues grew by 24.5%, EMEA increased by 2.2% and the Americas was up by 0.4%. On a year-over-year basis, Asia Pacific revenues were up by 43.1%, EMEA increased by 21.5% and the Americas grew by 8.0%.\nFourth quarter gross profit was $1.00 billion and gross margin was 40.6%. On a sequential basis, gross margin increased 110 basis points due to improved product mix and increased manufacturing efficiency, partially offset mainly by normal price pressure and negative currency effects, net of hedging. Gross margin increased 310 basis points year-over-year largely driven by improved manufacturing efficiency and better product mix partially offset mainly by normal price pressure as well as negative currency effects, net of hedging.\nCombined R&D and SG&A expenses were $592 million compared to $558 million and $570 million in the prior and year-ago quarter, respectively, increasing mainly due to seasonality and inflationary dynamics.\nFourth quarter other income and expenses, net, registered income of $18 million compared to $5 million in the prior quarter due to higher than anticipated R&D funding.\nImpairment and restructuring charges in the fourth quarter were $20 million compared to $14 million and $24 million in the prior and year-ago quarter, respectively, mainly related to the set-top box restructuring plan announced in January 2016.\nOperating income in the fourth quarter rose sharply on a sequential and year-over-year basis to $408 million compared to $278 million and $129 million in the prior quarter and year-ago quarter, respectively. By product group, MDG operating margin increased to 19.6% from 17.9% in the prior quarter. ADG operating margin improved to 12.3% compared to 10.9% in the prior quarter. AMS operating margin expanded to 20.9% from 13.2% in the prior quarter, benefiting from an improved product mix, as well as leveraging higher revenues and improved manufacturing performance.\nFourth quarter operating income before impairment and restructuring charges (1) increased sequentially by $136 million to $428 million, equivalent to 17.3% of net revenues, driven by a higher level of revenues and improved gross margin and resulted in a return on invested capital of 35.7%. On a year-over-year basis, operating income before impairment and restructuring charges (1) increased by $275 million reflecting higher revenues, manufacturing efficiencies and improved product mix.\nIn the fourth quarter of 2017, the Company recorded a one-time, non-cash charge of $46 million as a result of the recently enacted Tax Cuts and Jobs Act (TCJA) in the United States. This charge results from the revaluation of the Company's deferred tax assets as of December 31, 2017.\nFourth quarter net income increased significantly both on a sequential and year-over-year basis to $308 million, or $0.34 diluted earnings per share, compared to net income of $236 million, or $0.26 diluted earnings per share, in the prior quarter and net income of $112 million, or $0.13 diluted earnings per share, in the year-ago quarter.\n(1) Non-U.S. GAAP measure. See Appendix for additional information and reconciliation to U.S. GAAP.\nFull Year 2017 Review\nNet revenues for the full year 2017 increased 19.7% to $8.35 billion from $6.97 billion in 2016. By product group, full year 2017 Analog, MEMS and Sensors Group (AMS) revenues were up 41.4%, on triple-digit growth in Imaging and strong growth in both Analog and MEMS. Microcontrollers and Digital ICs Group (MDG) revenues increased 15.8% compared to 2016 on strong growth in general purpose microcontrollers partially offset by lower revenues for products undergoing phase-out. Automotive and Discrete Group (ADG) revenues increased 8.8% for the full year of 2017 compared to the full year of 2016 on growth in both Automotive and Discrete.\nFull year 2017 gross profit was $3.27 billion. Gross margin improved by 400 basis points to 39.2% from 35.2% in full year 2016. Specifically, the 2017 gross margin benefited from manufacturing efficiencies, better product mix, and improved fab loading partially offset by normal price pressure.\nCombined R&D and SG&A expenses increased 1.7% to $2.29 billion in 2017 compared to $2.25 billion in 2016.\nOther income and expenses, net, registered income of $55 million in 2017 compared to $99 million in 2016 mainly due to a lower level of R&D grants.\nIn 2017, impairment and restructuring charges were $45 million compared to $93 million in 2016, mostly related to the set-top box restructuring plan.\nOperating income in 2017 improved by $779 million to $993 million compared to 2016.\nFull year 2017 operating income and operating margin before impairment and restructuring charges (1) increased sharply to $1.04 billion, equivalent to 12.4% of net revenues, compared to $307 million, equivalent to 4.4% of net revenues in 2016, on higher revenues, gross margin expansion and strong operating leverage.\nIncome tax expense in 2017 was $143 million, including the one-time impact related to tax reform in the United States, reflecting an effective tax rate of 15.0%.\nFull year 2017 net income was $802 million, or $0.89 fully diluted earnings per share, compared to net income of $165 million, or $0.19 fully diluted earnings per share for the full year 2016.\n(1) Non-U.S. GAAP measure. See Appendix for additional information and reconciliation to U.S. GAAP.\nCash Flow and Balance Sheet Highlights\nReflecting the strong growth in revenues and improvement in operating profitability, net cash from operating activities was $587 million and $1.71 billion for the fourth quarter and full year 2017, respectively. Full Year 2016 net cash from operating activities was $1.04 billion.\nCapital expenditure payments, net of proceeds from sales, were $407 million and $1.30 billion during the fourth quarter and full year of 2017, respectively. Full year 2016 capital expenditures, net of proceeds from sales, were $607 million.\nFree cash flow (1) was $145 million and $338 million during the fourth quarter and full year of 2017, respectively, favorably impacted by improved operating results and higher than expected revenues in the fourth quarter. Full year 2016 free cash flow was $316 million.\nInventory was $1.33 billion at December 31, 2017. Inventory in the fourth quarter of 2017 was at 4.4 turns or 82 days compared to 3.9 turns or 92 days in the third quarter.\nThe Company paid cash dividends to shareholders of $54 million and $214 million for the fourth quarter and full year 2017, respectively. In addition, the Company launched and completed over the course of 2017, a share buy-back program of 18.6 million shares for an aggregate amount of $297 million.\nST's net financial position (1) was $489 million at December 31, 2017 compared to $446 million at September 30, 2017. At December 31, 2017, ST's total financial resources were $2.19 billion; total financial debt was $1.70 billion; and total equity, including non-controlling interest, was $5.47 billion.\nIn 2017, ST issued a $1.5 billion dual-tranche offering at 0% of new senior unsecured convertible bonds due 2022 and 2024. The proceeds, net of the cost of the share buyback, were partially used to early redeem, via net share settlement, both the 2019 and the 2021 convertible bonds issued in 2014 for a total of $1 billion and 26.8 million shares from Treasury stock. As of the end of the year, the Company has significantly reduced its overall cash cost of debt to 0.44%.\n(1) Non-U.S. GAAP measure. See Appendix for additional information and reconciliation to U.S. GAAP.\nFirst Quarter 2018 Business Outlook\nMr. Bozotti commented, \"We exited 2017 with very strong revenue growth, and significant improvement in our operating profitability and net income. In 2018, our objective is to leverage our achievements to continue to drive sustainable and profitable growth thanks to our product leadership.\n\"We continue to see solid demand across product groups and geographies and in the first quarter we anticipate a better than seasonal trend for Smart Driving and Internet of Things applications, and the unfavorable seasonal dynamics for smartphone applications. Based upon that, as well as our much stronger than expected revenue growth in the previous quarter, we anticipate first quarter revenues to decrease by about 10% on a sequential basis, representing year-over-year growth of about 22% at the mid-point of our guidance range. We expect the gross margin to decrease to about 39.5% at the mid-point.\n\"In order to support our anticipated product portfolio mix and to fuel strong revenue growth in the second half of 2018 compared to the first half, we expect to invest this year approximately $1.0 to $1.1 billion. \"\nThe Company expects first quarter 2018 revenues to decrease about 10% on a sequential basis, plus or minus 3.5 percentage points. Gross margin in the first quarter is expected to be about 39.5% plus or minus 2.0 percentage points.\nThis outlook is based on an assumed effective currency exchange rate of approximately $1.18 = €1.00 for the 2018 first quarter and includes the impact of existing hedging contracts. The first quarter will close on March 31, 2018.\nRecent Corporate Developments\nOn November 22, ST has been awarded a position on 2017 \"A\" List for water and \"A-\" List for climate change by CDP, the non-profit global environmental disclosure platform. On December 12, ST announced its acquisition of software-development tools specialist Atollic for a cash payment of $7 million and a deferred earn-out contingent on certain conditions, which ST estimates will be about $1 million. Atollic is the supplier of TrueSTUDIO®, a professionally-recognized and highly regarded Integrated Development Environment (IDE) for the embedded development community focusing on Arm® Cortex®-M microcontrollers, like ST's market-leading STM32 family of 32-bit microcontrollers (MCUs).\nQ4 2017 - Product and Technology Highlights\nAutomotive and Discrete Group (ADG)\nWon a major award with multifunction ASSP Umbrella-Chip for a transmission with a major European customer; Captured a design win with the latest Chorus SPC58 32-bit automotive MCU, which contains the most advanced security subsystem, in a high-end body computer from a leading European premium car maker; Earned multiple design wins for electrification - battery management, on-board chargers, and DC/DC converters - for SPC5 32-bit automotive MCUs with top Tier1s in China, Europe, and Japan; Landed several design wins for power-management ICs in ADAS applications with major European and Japanese players; Landed awards for VIPower family for mid-power DC motor control with award for mechatronic power-lift gates from a worldwide leader; Extended penetration among global mobile manufacturer leaders with qualification of single-line ESD protection devices with a major Chinese mobile phone maker; Qualified new generation of Transil(TM) avalanche diodes in flat SMD package with a major disk-drive manufacturer; Gained multiple design wins for 650V and 1200V SiC diodes for server, lighting and EV applications; Won several design-ins with 3 rd -generation 1200V SiC MOSFET for main inverter applications from three key European automotive customers, while continuing to win awards for 2 nd -generation 650V and 1200V for DC-DC converters and on-board chargers at key European automotive players; Recorded multiple wins for super-junction MOSFETs in on-board chargers, EV chargers, and LEDs for a switched-mode power supply with top manufacturers; Earned a design win and order for new IGBT in an electronic ignition from global leader; Awarded a design win for 2 nd -generation intelligent power module from a leading Asian air conditioning supplier; Won a design for low-voltage MOSFETs for 48V DC/DC converter and parking-brake projects from leading automotive players; Introduced Telemaco3P, a dedicated telematics processor with built-in security, and an open development platform to secure car-connectivity applications.\nAnalog, MEMS and Sensors Group (AMS)\nKept strong momentum with 6-axis ultra-low-power series in mobile phone market by winning several sockets at key players in China; Won sockets for waterproof pressure sensors with design wins and production launches at 1st tier wearables players; Captured new business award in Automotive to develop a high-accuracy inertial motion-sensing combo from a Tier1 player to address highly assisted driving function; Achieved record sales in Automotive sensing with strong contributions from car alarm and sensor-assisted driving systems; Ramped production of a new STSPIN motor driver with embedded 32-bit MCU for motion control in battery-operated robots and appliances; Began production of advanced wireless-charging IC that enables faster charging of smartphones and tablets; Launched new metering program with a major European provider; Introduced a System-in-Package that includes full-bridge MOSFETs, gate drivers, and protection devices; Won design with low noise low-drop out regulator from major Chinese smartphone makers; Captured design award for a new power-management IC for printers from a major player; Landed a design win for USB Type-C products from a French manufacturer.\nMicrocontrollers and Digital ICs Group (MDG)\nAcquired recognized Integrated Development Environment supplier Atollic to better support STM32 developers with powerful free design tools; Introduced STM32L4+ series of ultra-low-power microcontrollers with exceptional features and outstanding performance; Revealed that the STM32H7 series MCU combines new Platform Security Architecture from Arm® with advanced security features and services to boost protection for connected smart devices; Won slots for 15 STM32s in the bill-of-materials for a robotic lawn-mower platform at a key maker; Captured design wins for STM32L4 and L4+ in sport watches at a key OEM; Earned design-ins for STM32F103 in laptops as a touchpad controller from a major OEM; Landed wins for STM32F091 in the user interface for a consumer appliance at a leading OEM; Announced ST53G compact contactless module with boostedNFC(TM) Technology, extending secure payment to wearables; the module was a Trustech 2017 Sesame Award finalist; Revealed the ST25 NFC Tags have been certified by the NFC Forum and launched Software Development Kit for ST25 tags and dynamic tags; Began production ramp of ST25DV for an asset-tracking application at a major OEM and of an eSIM solution based on the latest ST33J 40nm Secure Micro in a tablet from a leading OEM; Ramped production of 2 new ASICs in 55nm BiCMOS for a key optical networking OEM.\nUse of Supplemental Non-U.S. GAAP Financial Information\nThis press release contains supplemental non-U.S. GAAP financial information, including operating income (loss) before impairment and restructuring charges, operating margin before impairment and restructuring charges, adjusted net earnings per share, free cash flow and net financial position.\nReaders are cautioned that these measures are unaudited and not prepared in accordance with U.S. GAAP and should not be considered as a substitute for U.S. GAAP financial measures. In addition, such non-U.S. GAAP financial measures may not be comparable to similarly titled information from other companies.\nSee the Appendix of this press release for a reconciliation of the Company's non-U.S. GAAP financial measures to their corresponding U.S. GAAP financial measures. To compensate for these limitations, the supplemental non-U.S. GAAP financial information should not be read in isolation, but only in conjunction with the Company's consolidated financial statements prepared in accordance with U.S. GAAP.\nForward-looking information\nSome of the statements contained in this release that are not historical facts are statements of future expectations and other forward-looking statements (within the meaning of Section 27A of the Securities Act of 1933 or Section 21E of the Securities Exchange Act of 1934, each as amended) that are based on management's current views and assumptions, and are conditioned upon and also involve known and unknown risks and uncertainties that could cause actual results, performance, or events to differ materially from those anticipated by such statements, due to, among other factors:\nUncertain macro-economic and industry trends, which may impact end-market demand for our products; Customer demand that differs from projections; The ability to design, manufacture and sell innovative products in a rapidly changing technological environment; Unanticipated events or circumstances, which may impact our ability to execute the planned reductions in our net operating expenses and / or meet the objectives of our R&D Programs, which benefit from public funding; Changes in economic, social, labor, political, or infrastructure conditions in the locations where we, our customers, or our suppliers operate, including as a result of macro-economic or regional events, military conflicts, social unrest, labor actions, or terrorist activities; The Brexit vote and the perceptions as to the impact of the withdrawal of the U.K. may adversely affect business activity, political stability and economic conditions in the U.K., the Eurozone, the EU and elsewhere. While we do not have material operations in the U.K. and have not experienced any material impact from Brexit on our underlying business to date, we cannot predict its future implications; Financial difficulties with any of our major distributors or significant curtailment of purchases by key customers; The loading, product mix, and manufacturing performance of our production facilities; The functionalities and performance of our IT systems, which support our critical operational activities including manufacturing, finance and sales, and any breaches of our IT systems or those of our customers or suppliers; Variations in the foreign exchange markets and, more particularly, the U.S. dollar exchange rate as compared to the Euro and the other major currencies we use for our operations; The impact of intellectual property (\"IP\") claims by our competitors or other third parties, and our ability to obtain required licenses on reasonable terms and conditions; The ability to successfully restructure underperforming business lines and associated restructuring charges and cost savings that differ in amount or timing from our estimates; Changes in our overall tax position as a result of changes in tax rules, new or revised legislation, the outcome of tax audits or changes in international tax treaties which may impact our results of operations as well as our ability to accurately estimate tax credits, benefits, deductions and provisions and to realize deferred tax assets; The outcome of ongoing litigation as well as the impact of any new litigation to which we may become a defendant; Product liability or warranty claims, claims based on epidemic or delivery failure, or other claims relating to our products, or recalls by our customers for products containing our parts; Natural events such as severe weather, earthquakes, tsunamis, volcano eruptions or other acts of nature, health risks and epidemics in locations where we, our customers or our suppliers operate; Availability and costs of raw materials, utilities, third-party manufacturing services and technology, or other supplies required by our operations; Industry changes resulting from vertical and horizontal consolidation among our suppliers, competitors, and customers; The ability to successfully ramp up new programs that could be impacted by factors beyond our control, including the availability of critical third party components and performance of subcontractors in line with our expectations; and Theft, loss, or misuse of personal data about our employees, customers, or other third parties, and breaches of global privacy legislation, including the EU's General Data Protection Regulation (\"GDPR\").\nSuch forward-looking statements are subject to various risks and uncertainties, which may cause actual results and performance of our business to differ materially and adversely from the forward-looking statements. Certain forward-looking statements can be identified by the use of forward looking terminology, such as \"believes,\" \"expects,\" \"may,\" \"are expected to,\" \"should,\" \"would be,\" \"seeks\" or \"anticipates\" or similar expressions or the negative thereof or other variations thereof or comparable terminology, or by discussions of strategy, plans or intentions.\nSome of these risk factors are set forth and are discussed in more detail in \"Item 3. Key Information - Risk Factors\" included in our Annual Report on Form 20-F for the year ended December 31, 2016, as filed with the SEC on March 3, 2017. Should one or more of these risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially from those described in this release as anticipated, believed, or expected. We do not intend, and do not assume any obligation, to update any industry information or forward-looking statements set forth in this release to reflect subsequent events or circumstances.\nSTMicroelectronics Conference Call and Webcast Information\nThe management of STMicroelectronics will conduct a live webcast of its conference call on January 25, 2018 at 9:30 a.m. Central European Time (CET) / 3:30 a.m. U.S. Eastern Time (ET) / 12:30 a.m. U.S. Pacific Time (PT), to discuss performance for the fourth quarter and full year of 2017.\nThe live webcast of the conference call will be available by accessing http://investors.st.com . Those accessing the webcast should go to the Web site at least 15 minutes prior to the call, in order to register, download and install any necessary audio software. The webcast will be available until February 9, 2018.\nAbout STMicroelectronics\nST is a global semiconductor leader delivering intelligent and energy-efficient products and solutions that power the electronics at the heart of everyday life. ST's products are found everywhere today, and together with our customers, we are enabling smarter driving and smarter factories, cities and homes, along with the next generation of mobile and Internet of Things devices.\nBy getting more from technology to get more from life, ST stands for life.augmented.\nIn 2017, the Company's net revenues were $8.35 billion, serving more than 100,000 customers worldwide.\nFurther information can be found at www.st.com .\nFor further information, please contact:\nINVESTOR RELATIONS:\nTait Sorensen\nGroup VP, Investor Relations\nSTMicroelectronics\nTel: +1 602 485 2064\ntait.sorensen@st.com\nMEDIA RELATIONS:\nAlexis Breton\nDirector, PR & Media Operations\nSTMicroelectronics\nTel: + 33 6 59 16 79 08\nalexis.breton@st.com\nSTMicroelectronics N.V. Consolidated Statements of Income (in millions of U.S. dollars, except per share data ($)) Three Months Ended (Unaudited) (Unaudited) December 31, December 31, 2017 2016 Net sales 2,457 1,846 Other revenues 9 13 NET REVENUES 2,466 1,859 Cost of sales (1,464) (1,161) GROSS PROFIT 1,002 698 Selling, general and administrative (265) (230) Research and development (327) (340) Other income and expenses, net 18 25 Impairment, restructuring charges and other related closure costs (20) (24) Total Operating Expenses (594) (569) OPERATING INCOME 408 129 Interest expense, net (6) (5) Income (loss) on equity-method investments - (1) Loss on financial instruments, net (11) - INCOME BEFORE INCOME TAXES 391 123 AND NONCONTROLLING INTEREST Income tax expense (81) (9) NET INCOME 310 114 Net income attributable to noncontrolling interest (2) (2) NET INCOME ATTRIBUTABLE TO PARENT COMPANY 308 112 EARNINGS PER SHARE (BASIC) ATTRIBUTABLE TO PARENT COMPANY STOCKHOLDERS 0.35 0.13 EARNINGS PER SHARE (DILUTED) ATTRIBUTABLE TO PARENT COMPANY STOCKHOLDERS 0.34 0.13 NUMBER OF WEIGHTED AVERAGE SHARES USED IN CALCULATING DILUTED EARNINGS PER SHARE 910.2 888.9\nSTMicroelectronics N.V. Consolidated Statements of Income (in millions of U.S. dollars, except per share data ($)) Twelve Months Ended (Unaudited) (Audited) December 31, December 31, 2017 2016 Net sales 8,308 6,944 Other revenues 39 29 NET REVENUES 8,347 6,973 Cost of sales (5,079) (4,518) GROSS PROFIT 3,268 2,455 Selling, general and administrative (983) (911) Research and development (1,302) (1,336) Other income and expenses, net 55 99 Impairment, restructuring charges and other related closure costs (45) (93) Total Operating Expenses (2,275) (2,241) OPERATING INCOME 993 214 Interest expense, net (22) (20) Income (loss) on equity-method investments (2) 7 Loss on financial instruments, net (16) - INCOME BEFORE INCOME TAXES 953 201 AND NONCONTROLLING INTEREST Income tax expense (143) (31) NET INCOME 810 170 Net income attributable to noncontrolling interest (8) (5) NET INCOME ATTRIBUTABLE TO PARENT COMPANY 802 165 EARNINGS PER SHARE (BASIC) ATTRIBUTABLE TO PARENT COMPANY STOCKHOLDERS 0.91 0.19 EARNINGS PER SHARE (DILUTED) ATTRIBUTABLE TO PARENT COMPANY STOCKHOLDERS 0.89 0.19 NUMBER OF WEIGHTED AVERAGE SHARES USED IN CALCULATING DILUTED EARNINGS PER SHARE 906.1 886.3\nSTMicroelectronics N.V. CONSOLIDATED BALANCE SHEETS As at December 31, September 30, December 31, In millions of U.S. dollars 2017 2017 2016 (Unaudited) (Unaudited) (Audited) ASSETS Current assets: Cash and cash equivalents 1,759 2,188 1,629 Marketable securities 431 433 335 Trade accounts receivable, net 1,149 1,057 939 Inventories 1,335 1,321 1,173 Other current assets 425 404 311 Total current assets 5,099 5,403 4,387 Goodwill 123 122 116 Other intangible assets, net 209 193 195 Property, plant and equipment, net 3,094 2,882 2,287 Non-current deferred tax assets 624 662 528 Long-term investments 57 57 57 Other non-current assets 475 442 434 4,582 4,358 3,617 Total assets 9,681 9,761 8,004 LIABILITIES AND EQUITY Current liabilities: Short-term debt 118 486 117 Trade accounts payable 893 847 620 Other payables and accrued liabilities 897 867 750 Dividends payable to stockholders 60 112 59 Accrued income tax 52 47 42 Total current liabilities 2,020 2,359 1,588 Long-term debt 1,583 1,689 1,334 Post-employment benefit obligations 385 380 347 Long-term deferred tax liabilities 11 6 5 Other long-term liabilities 215 178 134 2,194 2,253 1,820 Total liabilities 4,214 4,612 3,408 Commitment and contingencies Equity Parent company stockholders' equity Common stock (preferred stock: 540,000,000 shares authorized, not issued; common stock: Euro 1.04 nominal value, 1,200,000,000 shares authorized, 911,110,420 shares issued, 896,590,286 shares outstanding) 1,157 1,157 1,157 Capital surplus 2,718 2,866 2,818 Retained earnings 973 667 431 Accumulated other comprehensive income 688 677 371 Treasury stock (132) (285) (242) Total parent company stockholders' equity 5,404 5,082 4,535 Noncontrolling interest 63 67 61 Total equity 5,467 5,149 4,596 Total liabilities and equity 9,681 9,761 8,004\nSTMicroelectronics N.V. SELECTED CASH FLOW DATA Cash Flow Data (in US$ millions) Q4 2017 Q3 2017 Q4 2016 Net Cash from operating activities 587 463 378 Net Cash used in investing activities (442) (482) (243) Net Cash used in financing activities (576) 546 (163) Net Cash increase (decrease) (429) 534 (46) Selected Cash Flow Data (in US$ millions) Q4 2017 Q3 2017 Q4 2016 Depreciation & amortization 179 165 161 Net payment for Capital expenditures (407) (365) (228) Dividends paid to stockholders (54) (59) (53) Change in inventories, net (5) (41) 35\nAppendix\nSTMicroelectronics\nSupplemental Financial Information\nST aligns its product families into three product groups to better leverage the product synergies around its strategic focus on Smart Driving and Internet of Things applications: Automotive and Discrete Group (ADG); Analog and MEMS Group (AMG); and Microcontrollers and Digital ICs Group (MDG). Commencing in the fourth quarter of 2017, the Company transferred the Imaging Product Division, previously reported in Others, into the Analog and MEMS Group (AMG) to create the new organization Analog, MEMS and Sensors Group (AMS).\nProduct Group Data\n(Million US$) Q4 2017 Q3 2017 Q2 2017 Q1 2017 FY\n2017 Q4 2016 Q3 2016 Q2\n2016 Q1 2016 FY 2016 Automotive & Discrete (ADG) - Net Revenues 821 775 755 708 3,059 716 704 721 671 2,813 - Operating Income 101 85 65 38 289 53 58 61 39 211 Analog, MEMS & Sensors (AMS) (a) - Net Revenues 896 652 550 514 2,613 527 499 419 403 1,847 - Operating Income 187 86 53 40 365 53 39 (24) (22) 46 Microcontrollers & Digital ICs (MDG) - Net Revenues 740 701 612 593 2,646 610 587 556 532 2,285 - Operating Income (Loss) 145 125 71 60 402 59 44 9 (3) 108 Others (b) - Net Revenues 9 8 6 6 29 6 7 7 7 28 - Operating Income (Loss) (25) (18) (11) (9) (63) (36) (51) (18) (47) (151) Total - Net Revenues 2,466 2,136 1,923 1,821 8,347 1,859 1,797 1,703 1,613 6,973 - Operating Income (Loss) 408 278 178 129 993 129 90 28 (33) 214 (a) Reflects the transfer of the Imaging Product Division, previously reported in Others, to AMS as of the fourth quarter of 2017, the Company has reclassified prior-period revenues.\n(b) Net revenues of \"Others\" includes revenues from sales of Subsystems, assembly services, and other revenue. Operating income (loss) of \"Others\" includes items such as unused capacity charges, impairment, restructuring charges and other related closure costs, phase out and start-up costs, and other unallocated expenses such as: strategic or special research and development programs, certain corporate-level operating expenses, patent claims and litigations, and other costs that are not allocated to product groups, as well as operating earnings of Subsystems and other products. \"Others\" includes:\n(Million US$) Q4 2017 Q3 2017 Q2 2017 Q1 2017 FY\n2017 Q4 2016 Q3 2016 Q2 2016 Q1 2016 FY\n2016 Unused Capacity Charges 1 1 1 1 3 4 11 8 10 33 Impairment & Restructuring Charges 20 14 6 5 45 24 29 12 28 93\nQ4 2017 Q3 2017 Q2 2017 Q1 2017 FY\n2017 Q4 2016 Q3 2016 Q2 2016 Q1 2016 FY\n2016 €/$ Effective Rate 1.15 1.13 1.09 1.08 1.11 1.10 1.12 1.12 1.10 1.11\nNet Revenues By Market Channel (%) Q4 2017 Q3 2017 Q2 2017 Q1 2017 FY\n2017 Q4 2016 Q3 2016 Q2 2016 Q1 2016 FY 2016 Total OEM 68% 66% 66% 66% 66% 67% 67% 66% 67% 67% Distribution 32% 34% 34% 34% 34% 33% 33% 34% 33% 33% (Appendix - continued)\nSTMicroelectronics\nSupplemental Non-U.S. GAAP Financial Information\nU. S. GAAP - Non-U.S. GAAP Reconciliation\nIn Million US$ Except Per Share Data\nThe supplemental non-U.S. GAAP information presented in this press release is unaudited and subject to inherent limitations. Such non-U.S. GAAP information is not based on any comprehensive set of accounting rules or principles and should not be considered as a substitute for U.S. GAAP measurements. Also, our supplemental non-U.S. GAAP financial information may not be comparable to similarly titled non-U.S. GAAP measures used by other companies. Further, specific limitations for individual non-U.S. GAAP measures, and the reasons for presenting non-U.S. GAAP financial information, are set forth in the paragraphs below. To compensate for these limitations, the supplemental non-U.S. GAAP financial information should not be read in isolation, but only in conjunction with our consolidated financial statements prepared in accordance with U.S. GAAP.\nOperating income (loss) before impairment and restructuring charges and one-time items is used by management to help enhance an understanding of ongoing operations and to communicate the impact of the excluded items, such as impairment, restructuring charges and other related closure costs. Adjusted net earnings and earnings per share (EPS) are used by management to help enhance an understanding of ongoing operations and to communicate the impact of the excluded items like impairment, restructuring charges and other related closure costs attributable to ST and other one-time items, net of the relevant tax impact.\nThe Company believes that these non-GAAP financial measures provide useful information for investors and management because they measure the Company's capacity to generate profits from its business operations, excluding the effect of acquisitions and expenses related to the rationalizing of its activities and sites that it does not consider to be part of its on-going operating results, thereby offering, when read in conjunction with the Company's GAAP financials, (i) the ability to make more meaningful period-to-period comparisons of the Company's on-going operating results, (ii) the ability to better identify trends in the Company's business and perform related trend analysis, and (iii) an easier way to compare the Company's results of operations against investor and analyst financial models and valuations, which usually exclude these items.\nQ4 2017\n(US$ millions, except per share data ($)) Gross Profit Operating Income Net Earnings Corresponding EPS U.S. GAAP 1,002 408 308 0.34 Impairment & Restructuring 20 20 Estimated Income Tax Effect (1) Non-U.S GAAP 1,002 428 327 0.36\nQ3 2017\n(US$ million, except per share data ($)) Gross Profit Operating Income Net Earnings Corresponding EPS U.S. GAAP 845 278 236 0.26 Impairment & Restructuring 14 14 Estimated Income Tax Effect (1) Non-U.S GAAP 845 292 249 0.28\nQ4 2016\n(US$ millions, except per share data ($)) Gross Profit Operating Income Net Earnings\nCorresponding EPS U.S. GAAP 698 129 112 0.13 Impairment & Restructuring 24 24 Estimated Income Tax Effect 1 Non-U.S GAAP 698 153 137 0.15\n(Appendix - continued)\nNet financial position: resources (debt), represents the balance between our total financial resources and our total financial debt. Our total financial resources include cash and cash equivalents, marketable securities, short-term deposits and restricted cash, and our total financial debt includes short-term borrowings, current portion of long-term debt and long-term debt, all as reported in our consolidated balance sheet. We believe our net financial position provides useful information for investors and management because it gives evidence of our global position either in terms of net indebtedness or net cash position by measuring our capital resources based on cash, cash equivalents and marketable securities and the total level of our financial indebtedness. Net financial position is not a U.S. GAAP measure.\nNet Financial Position (in US$ millions) December 31, 2017 September 30, 2017 December 31, 2016 Cash and cash equivalents 1,759 2,188 1,629 Marketable securities 431 433 335 Total financial resources 2,190 2,621 1,964 Short-term debt (118) (486) (117) Long-term debt (1,583) (1,689) (1,334) Total financial debt (1,701) (2,175) (1,451) Net financial position - Non-U.S. GAAP 489 446 513 Free cash flow is defined as net cash from operating activities minus net cash from (used in) investing activities, excluding payment for purchases (proceeds from the sale of) marketable securities, short-term deposits and restricted cash. We believe free cash flow provides useful information for investors and management because it measures our capacity to generate cash from our operating and investing activities to sustain our operating activities. Free cash flow is not a U.S. GAAP measure and does not represent total cash flow since it does not include the cash flows generated by or used in financing activities. In addition, our definition of free cash flow may differ from definitions used by other companies.\nFree cash flow (in US$ millions) Q4 2017 Q3 2017 Q2 2017 Q1 2017 FY 2017 Q4 2016 Q3 2016 Q2 2016 Q1 2016 FY 2016 Net cash from operating activities 587 463 369 289 1,707 378 332 192 141 1,043 Net cash used in investing activities (442) (482) (317) (227) (1,468) (243) (230) (144) (110) (727) Payment for purchase and proceeds from sale of marketable securities, investment in short-term deposits, restricted cash - 99 - - 99 - - - - - Free cash flow - Non-U.S. GAAP 145 80 52 62 338 135 102 48 31 316 Attachments:\nhttp://www.globenewswire.com/NewsRoom/AttachmentNg/78ef2b15-56ef-42b4-8ec0-bf2b7e0fcf24\nSource:STMicroelectronics N.V.", "external_links": ["http://www.globenewswire.com/NewsRoom/AttachmentNg/78ef2b15-56ef-42b4-8ec0-bf2b7e0fcf24", "https://www.globenewswire.com/Tracker?data=VL0zRGcpV93REgB50IwAVs6B1smYNIqwODvbhKe0m8_DvEh_mln_4EILclMQefM9mcYuoVZsoUVhmFVVm7xSyOQwpOr_hf-qJ7v3ryfQTgeVncKW8sNAqsGhUUpysLHCjSNCTs5FiO3T0WvEDnf_fvhWqL6G9fsEq8WmHEr6TUoHpDUB7haD6TQNZSVbzIlEgnEgYimqREyaG-23Jn50cm0hL5tCruBT0cf7YX9mMGyBySnXyyloMIqe4-VvBUkD0frjAUDVQIMR4_lHnGW4wQ==", "https://www.globenewswire.com/Tracker?data=3Y7rxkB3bxe_2Ml0m35et3TAh1ca-6qrCdkYSxqt6WTLU9yI9dkZ7ydd65LI-j1-hfB2_cnL7NaBDhnQH7Bq9XVi13nAWw3KO3q9NjD7sqs=", "https://www.globenewswire.com/Tracker?data=o8bSpMrERo710HHg4QA9qpP_u8lXtOghtOa2q3cHtiNeADDMq_WCZvcfGQ8mzt9lNpkh3l9n7Bk02Z5pMn0t88Yzmpd0CfHnqvNiu1gJoVY=", "https://www.globenewswire.com/Tracker?data=EspHt3661TYdHuZwuIGqp3Jjk99fi4ElIN9NBbvXAj7Kte1CJ2eOKc7w0UXS-AUNZpbH5PAsK83BLRXXcPF0xA=="], "published": "2018-01-25T09:01:00.000+02:00", "crawled": "2018-01-25T09:09:52.000+02:00", "highlightTitle": ""}