{"organizations": [], "uuid": "0e37d112bbc41e80adfe0dd901f7c660353e2781", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1218938291&w=1200&r=LYNXMPEE0202Q", "site_section": "http://feeds.reuters.com/reuters/UKCricketNews/", "section_title": "Reuters: Cricket News", "url": "https://uk.reuters.com/article/uk-cricket-australia-squad/no-maxwell-in-australia-odi-squad-for-england-series-idUKKBN1ES04I", "country": "US", "domain_rank": 408, "title": "Cricket-No Maxwell in Australia ODI squad for England series", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T04:01:00.000+02:00", "replies_count": 0, "uuid": "0e37d112bbc41e80adfe0dd901f7c660353e2781"}, "author": "", "url": "https://uk.reuters.com/article/uk-cricket-australia-squad/no-maxwell-in-australia-odi-squad-for-england-series-idUKKBN1ES04I", "ord_in_thread": 0, "title": "Cricket-No Maxwell in Australia ODI squad for England series", "locations": [], "entities": {"persons": [{"name": "cricket-no maxwell", "sentiment": "negative"}, {"name": "glenn maxwell", "sentiment": "none"}, {"name": "smith", "sentiment": "none"}, {"name": "reuters/adnan abidi  maxwell", "sentiment": "none"}, {"name": "steve smith", "sentiment": "none"}, {"name": "nick mulvenney", "sentiment": "none"}], "locations": [{"name": "england", "sentiment": "none"}, {"name": "no maxwell", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "kolkata", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "min read  sydney", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 2:15 AM / Updated 10 hours ago No Maxwell in Australia ODI squad for England series Nick Mulvenney 3 Min Read \nSYDNEY (Reuters) - Australia have left masterblaster batsman Glenn Maxwell out of their squad for the five-match one-day international series against England that follows this week’s fifth Ashes test. Cricket - India v Australia - Second One Day International Match - Kolkata, India – September 21, 2017 – Australia's Glenn Maxwell walks off the field as it rains. REUTERS/Adnan Abidi \nMaxwell, who has played 80 ODIs for his country, can be one of the most destructive and entertaining batsmen in world cricket on his day but captain Steve Smith said he needed to be more consistent. \n“We’ve all seen the way he can come out and play, all his funky stuff and he’s pretty cool with that,” Smith told reporters   Ground. \n”But when he puts his head down, he’s actually a really good batsman. If he keeps his head switched on, and trains really well, and focuses on basic things probably more than expansive things, then I think that’ll help him have his consistency. \n“If he can find that consistency, he’s certainly a guy you’d want in your team.” \nWicketkeeper Tim Paine has also been recalled for the series nearly seven years after his last one-day international, replacing incumbent Matthew Wade as he did in the test side for the Ashes. \n“Tim forced his way into the Twenty20 international squad last summer and after coming back into the test squad at the beginning of the Ashes series he has made a terrific contribution,” said head selector Trevor Hohns. \n“He deserves his opportunity in this form of the game and the challenge for Matthew is to return to the type of form that saw him score a one-day international hundred against Pakistan last summer.” \nSmith said he thought that with batsmen like Chris Lynn, Mitchell Marsh and Marcus Stoinis in the squad, Australia had enough big-hitting even without Maxwell. \n“I think we’ve got a really strong side, lots of power hitting in the middle,” he added. \n“It’s obviously unlucky on Glenn ... we want to keep seeing consistent performances from him and keep putting his name up there.” \nSquad: Steve Smith, David Warner, Patrick Cummins, Aaron Finch, Josh Hazlewood, Travis Head, Chris Lynn, Mitchell Marsh, Tim Paine, Jhye Richardson, Mitchell Starc, Marcus Stoinis, Andrew Tye, Adam Zampa", "external_links": [], "published": "2018-01-03T04:01:00.000+02:00", "crawled": "2018-01-03T04:56:06.004+02:00", "highlightTitle": ""}