{"organizations": [], "uuid": "237ce0c8156341309e56c6218db5c8af1bcf4a79", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/03/14/104340607-RTX30OJF.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/30/narendra-modi-public-bank-recapitalization-reforms-for-india-bad-debt.html", "country": "US", "domain_rank": 767, "title": "Narendra Modi public bank recapitalization, reforms for India bad debt", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.197, "site_type": "news", "published": "2018-01-30T08:01:00.000+02:00", "replies_count": 0, "uuid": "237ce0c8156341309e56c6218db5c8af1bcf4a79"}, "author": "Yen Nee Lee", "url": "https://www.cnbc.com/2018/01/30/narendra-modi-public-bank-recapitalization-reforms-for-india-bad-debt.html", "ord_in_thread": 0, "title": "Narendra Modi public bank recapitalization, reforms for India bad debt", "locations": [], "entities": {"persons": [{"name": "narendra modi", "sentiment": "negative"}, {"name": "srikanth vadlamani", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}], "organizations": [{"name": "moody", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "moody's", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The latest attempt by the Indian government to rescue troubled state-owned banks falls \"far short of what is really required,\" ratings agency Moody's said Tuesday.\nAuthorities in the third-largest economy in Asia announced last week their plans to inject 881.4 billion rupees ($13.8 billion) into 20 state-run lenders by March. But to receive the much-needed funds to clean up their balance sheets, the banks must implement a series of reforms.\n\"What the government has done is extremely necessary for the near term, which is you simply need to recapitalize these banks appropriately,\" Srikanth Vadlamani, a vice president and senior credit officer at Moody's, told CNBC.\n\"At the same time, the government recognizes that there are significant corporate governance issues and they have been saying that capital infusion will be accompanied by corporate governance reforms. But when we look at what are the actual reforms that have been announced, we think they fall far short of what is really required,\" he added.\nThe reforms requested by the government include having board members monitor a bank's performance more frequently, improving due diligence when handing out loans and implementing a better system to recover stressed assets. Those measures, while helpful, are merely the \"fine tuning\" of some internal processes, noted Vadlamani.\n\"(The banking trouble) has not been a one-off phenomenon. There are structural underlying corporate governance issues and we don't think the government goes far enough to address them,\" he said.\nAdnan Abidi | Reuters An ongoing bad debt problem in India has been brewing since 2012 when banks expanded lending at a fast pace, including to a number of problematic sectors such as telecommunications and mining.\nThe amount of stressed assets in the Indian banking system has risen every year since then. Bad debt hit 9.46 trillion rupees at the end of September 2017, accounting for 12.2 percent of total loans, Reuters reported, citing \"unpublished central bank data\" that it viewed. The same report said state-owned lenders contributed 8.25 trillion rupees to that pile of bad loans.\nState-owned lenders such as the State Bank of India and IDBI Bank are major sources of credit in India. The banks' deteriorating balance sheets have limited their ability to lend, and that's affected India's growth.\nThis isn't the first time\nThe government has in the past used taxpayer's money to boost troubled lenders, and the latest rescue package — to cost 2.11 trillion rupees over two years — is one of the largest to date.\nBut injecting funds into the banks may become more difficult because of New Delhi's tight finances — plus, public sector banks are not the only ones hoping for government funds.\nshow chapters How can India clean up its banking sector? 8:57 PM ET Tue, 16 Jan 2018 | 03:20 Tackling the root of the banking system's problems should therefore be the government's top priority so as to avoid another acceleration of bad loans, said Rajiv Biswas, IHS Markit's Asia Pacific chief economist.\n\"The Indian government reform measures are an important positive step in the near-term, although further steps towards consolidation of public sector banks are needed in the medium-term,\" he told CNBC in an email.\nThere are 21 state-owned banks in India currently, which many analysts said is excessive. The government has pushed weaker lenders to sell non-core assets, reduce overheads and shut loss-making branches, but more can be done to improve efficiency in the banking sector as a whole, according to a recent report by the Brookings Institution .\nThe dominance of public sector banks, which account for 70 percent of total banking assets in India, has resulted in a \"lack of dynamism\" in the finance industry, the report said.\n\"It is time to re-evaluate the benefits of having a banking system dominated by public sector banks and the benefits that greater private ownership can bring about,\" it added.", "external_links": [], "published": "2018-01-30T08:01:00.000+02:00", "crawled": "2018-01-30T08:01:24.006+02:00", "highlightTitle": ""}