{"organizations": [], "uuid": "b60c70ceff998cd6eee35382472db501e7db20f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226200663&w=1200&r=LYNXMPEE0S0BX", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/india-stocks/sensex-nifty-hit-record-high-before-economic-survey-bonds-rupee-flat-idINKBN1FI0EI", "country": "US", "domain_rank": 408, "title": "Sensex, Nifty hit record high before economic survey; bonds, rupee flat", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T07:30:00.000+02:00", "replies_count": 0, "uuid": "b60c70ceff998cd6eee35382472db501e7db20f3"}, "author": "", "url": "https://in.reuters.com/article/india-stocks/sensex-nifty-hit-record-high-before-economic-survey-bonds-rupee-flat-idINKBN1FI0EI", "ord_in_thread": 0, "title": "Sensex, Nifty hit record high before economic survey; bonds, rupee flat", "locations": [], "entities": {"persons": [{"name": "vishal sridhar", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}], "organizations": [{"name": "sensex", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MUMBAI (Reuters) - Indian shares touched record highs on Monday after a government report predicted India would have the fastest growing major economy in the coming fiscal year, but bonds slumped as the report also said the government could tolerate some slippage on reducing its fiscal deficit.\nThe economic survey released earlier in the day projected economic growth would be 7.0-7.5 percent in the year starting in April, up from a projected 6.75 percent for the current fiscal year.\nBut the survey also noted “a pause in general government fiscal consolidation relative to 2016-17 cannot be ruled out”, In reaction, benchmark 10-year bond yields rose to 7.62 percent, up 14 basis points from their previous close.\nLosses in bonds were exacerbated after Arvind Subramanian, the Finance Ministry’s chief economic adviser who authored the survey, told a news conference he saw less scope for monetary policy easing because of a recent acceleration in inflation.\nThe recently introduced 7.17 percent 10-year bond rose 13 bps to 7.44 percent, while the rupee weakened to 63.5725 compared to its 63.5475 close on Thursday.\nIndian markets were shut on Friday for Republic Day.\nThe survey, an annual report the health of the economy, comes ahead of the release on Thursday of the federal budget for the year to begin on April 1.\nBond markets have priced in expectations the government will widen its fiscal deficit target for 2018/19 to 3.2 percent from the current projection of 3.0 percent, but some traders expressed jitters about whether New Delhi would set a higher number after the release of the survey.\nMost analysts said any loosening of the fiscal deficit target for 2018/19 was likely be modest.\nSuvodeep Rakshit, a senior economist with Kotak Institutional Equities, said the deficit for 2018/19 would likely be “somewhere around 3.2 percent”.\n“The government will remain on the fiscal consolidation path,” he said.\nStronger economic growth would also reinforce stock market expectations for earnings to improve after th so far postive results posted for the October-December quarter.\nThe broader NSE index rose 0.55 percent to end at a record close of 11,130.40 points, while the benchmark BSE index gained 0.65 percent to an all-time closing high of 36,283.25 points.\nAmong gainers, Maruti Suzuki India Ltd rose 3.8 percent. The country’s top-selling car maker reported a 3 percent rise in quarterly profit on Thursday and also approved a revision in its method of calculating royalty payments for new models.\nReporting by Vishal Sridhar in BENGALURU and Rafael Nam in MUMBAI; Editing by Sunil Nair and Simon Cameron-Moore\n ", "external_links": [], "published": "2018-01-29T07:30:00.000+02:00", "crawled": "2018-01-29T07:54:12.019+02:00", "highlightTitle": ""}