{"organizations": [], "uuid": "c80c9c1783055ab4a996d224207e067b7fc83b78", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-neptune-flood-secures-2-point-0-million-seed-financing-round-led-by-c1-bank-founder-former-ceo-trevor-burgess.html", "country": "US", "domain_rank": 767, "title": "Neptune Flood Secures $2.0 million Seed Financing Round Led by C1 Bank Founder & Former CEO Trevor Burgess", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T16:00:00.000+02:00", "replies_count": 0, "uuid": "c80c9c1783055ab4a996d224207e067b7fc83b78"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-neptune-flood-secures-2-point-0-million-seed-financing-round-led-by-c1-bank-founder-former-ceo-trevor-burgess.html", "ord_in_thread": 0, "title": "Neptune Flood Secures $2.0 million Seed Financing Round Led by C1 Bank Founder & Former CEO Trevor Burgess", "locations": [], "entities": {"persons": [{"name": "trevor burgess", "sentiment": "negative"}, {"name": "jim albert", "sentiment": "none"}, {"name": "jonathan carlon", "sentiment": "none"}], "locations": [{"name": "neptune", "sentiment": "none"}, {"name": "fla.", "sentiment": "none"}, {"name": "st. petersburg", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "bank", "sentiment": "negative"}, {"name": "neptune flood", "sentiment": "negative"}, {"name": "neptune flood's board of directors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ST. PETERSBURG, Fla., Neptune Flood, a revolutionary flood insurance provider, announced today that it has secured over $2 Million in seed round funding. The investment was led by Trevor Burgess, the founder and former CEO of C1 Bank, with participation from existing investor and Neptune CEO, Jim Albert. The investment will help the company aggressively expand its sales and marketing efforts nationwide and accelerate the next generation of its data driven, private flood insurance technology. Trevor Burgess and Jonathan Carlon will join Neptune Flood's Board of Directors.\nThe financing builds on a tremendous year for Neptune Flood (Neptune) which saw a rapidly growing roster of distribution partners eager to integrate the newly launched, innovative technology. Currently available in Florida, Virginia and Texas, Neptune will open across more than a dozen US states in early 2018. The product is available today via digital agencies, MGAs and strategic partnerships with homeowner's insurance carriers. By summer 2018, Neptune will deploy a transformative direct to consumer platform, giving consumers the intuitive, effortless, online shopping experience they demand from other industries.\n\"Neptune utilizes advanced technology and predictive analytics to more accurately evaluate and price flood insurance. In less than three minutes, and without elevation certificates, homeowners can save up to 25% off their insurance with the National Flood Insurance Program (NFIP). It's easy, cost effective, and secure,\" said founder and CEO Jim Albert.\n\"Neptune Flood has an amazing combination of advanced analytics, a fun brand and a team that is passionate about helping manage the flood risk for the American consumer,\" said investor Trevor Burgess adding, \"Neptune Flood is not only for homes in high risk flood zones but for all homeowners who are concerned about protecting the value of their home.\"\nKey features and benefits of the Neptune private flood insurance policy include:\nPolicies backed by A rated Lloyd's, the world's leading insurance market. Unprecedented customer experience and engagement, buy insurance in less than 3 minutes, without an elevation certificate or other documentation that is required to obtain government insurance (NFIP) Better pricing, higher limits, and coverage options not available through the NFIP Same day coverage, with no waiting period vs. 30-day wait for the NFIP\nChief Operating Officer, Stephanie Lee, who teamed with Jim to build the Neptune user experience and distribution model, added, \"We have experienced tremendous demand from insurance agents who are tired of the slow and paper laden NFIP process. Neptune is so easy to Quote: and bind, provides superior coverage, and can often save money for consumers.\"\n\"We are just starting our journey to change the way people think about and buy flood insurance - our data driven approach can help more families protect their homes during a flood event. The financial support and entrepreneurial spirit that Trevor Burgess and his team bring to the table will help us execute our vision in a first-class way,\" said CEO Jim Albert.\nAbout Neptune Flood Inc.\nNeptune Flood utilizes advanced mapping technologies and aerial remote sensing to create sophisticated algorithms for the risk of flooding. This revolutionary approach to pricing flood risk often results in superior coverage and savings over the National Flood Insurance Program of up to 25%, and is available to households in all designated flood zones.\nNeptune Flood was founded in 2016 by insurance and technology industry veterans Jim Albert and Bill Martin, with a goal of bringing advanced analytics and extreme ease of use to the flood insurance marketplace. Neptune Flood's policies are currently backed by Lloyd's of London, rated \"A\" (Excellent) by A.M. Best with an issuer credit of A+. Neptune launched its insurance product in early 2017 in Florida, and later in the year achieved the designation of Lloyd's Coverholder with authority to provide flood insurance throughout the US.\nAbout Trevor Burgess\nTrevor is the Chairman of TRB Development, a diversified residential real estate development and consulting company. Trevor is the former President & CEO of C1 Bank and its bank holding company, C1 Financial (NYSE: BNK). C1 Bank was a $1.7Bn bank focused on the needs of entrepreneurs with headquarters in St. Petersburg, Florida and had 31 offices throughout Florida. Trevor was named the 2014 American Banker Community Banker of the Year and was recognized as the 2013 Ernst & Young Florida Entrepreneur of the Year in the financial services category. In 2014 SNL named C1 Bank the 6th fastest growing bank in the country over the prior five years. Mr. Burgess served as a director of C1 Bank since acquiring control of C1 Bank's predecessor bank on December 3, 2009. C1 Bank was acquired by Bank of the Ozarks in July 2016 generating a 47% return for its IPO investors in less than 24 months.\nMr. Burgess is a prolific financial-technology inventor with four patents awarded and seven more under application. Mr. Burgess served as a Managing Director of Morgan Stanley, where he executed initial public offerings and other capital raising transactions as an investment banker in the Equity Capital Markets Division. During his nearly ten years at Morgan Stanley (1998 - 2008) he executed over 100 transactions raising over $50 billion for his clients. After graduating from Dartmouth College in 1994 Mr. Burgess was a Consultant at Michael Porter's Monitor Company in Cambridge, Massachusetts.\nView original content with multimedia: http://www.prnewswire.com/news-releases/neptune-flood-secures-20-million-seed-financing-round-led-by-c1-bank-founder--former-ceo-trevor-burgess-300588030.html\nSOURCE Neptune Flood", "external_links": ["http://www.prnewswire.com/news-releases/neptune-flood-secures-20-million-seed-financing-round-led-by-c1-bank-founder--former-ceo-trevor-burgess-300588030.html"], "published": "2018-01-25T16:00:00.000+02:00", "crawled": "2018-01-25T17:37:46.017+02:00", "highlightTitle": ""}