{"organizations": [], "uuid": "a9765796bda90f55f8a28e0b1f2852726f18db13", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/egypt-economy-inflation/update-1-egypts-heady-inflation-drops-as-election-season-approaches-idUSL8N1P50YR", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Egypt's heady inflation drops as election season approaches", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T16:37:00.000+02:00", "replies_count": 0, "uuid": "a9765796bda90f55f8a28e0b1f2852726f18db13"}, "author": "", "url": "https://www.reuters.com/article/egypt-economy-inflation/update-1-egypts-heady-inflation-drops-as-election-season-approaches-idUSL8N1P50YR", "ord_in_thread": 0, "title": "UPDATE 1-Egypt's heady inflation drops as election season approaches", "locations": [], "entities": {"persons": [{"name": "abdel fattah al-sisi", "sentiment": "none"}, {"name": "hany farahat", "sentiment": "none"}, {"name": "arwa gaballa", "sentiment": "none"}], "locations": [{"name": "cairo", "sentiment": "none"}, {"name": "egypt", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 2:39 PM / Updated 37 minutes ago UPDATE 1-Egypt's heady inflation drops as election season approaches Reuters Staff \n(Adds core inflation, economists quotes) \nBy Arwa Gaballa \nCAIRO, Jan 10 (Reuters) - Egypt’s annual inflation rates dropped in December to their lowest levels since the country floated its pound currency in November 2016, sending prices shooting up. \nBringing down inflation is key for President Abdel Fattah al-Sisi who has yet to announce his intention to run for a March election, but is expected to win himself another term. \nUrban consumer price inflation eased to 21.9 percent in December year-on-year from 26 percent in November, with its month-on-month rate falling to -0.2 percent, the first time prices decreased since Dec 2015, according to official data. \nCore inflation, which strips out volatile items such as food, fell to 19.86 percent in December from 25.53 percent the previous month. \n“The drop is positive and supports our expectations of lower inflation ahead, towards our 18 percent forecast in the first quarter of 2018,” said Hany Farahat, senior economist at CI Capital. \nInflation reached a record high of 35 percent in July after energy subsidies were cut in line with reforms agreed with the International Monetary Fund for a $12 billion loan, but has gradually eased since then. \nEgypt’s finance minister said on Wednesday he expected the rate to fall below 20 percent next month and to 10-12 percent during 2018 before falling below 10 percent in 2019. \nEgypt’s central bank has raised key interest rates by 700 basis points since November 2016 in an attempt to ease soaring inflation. \nEconomists expect the bank to start cutting rates in coming months as inflationary pressure eases. The central bank’s next monetary policy meeting is on Feb. 15. \n“We expect a 200 basis points cut in interest rates could occur at the MPC meeting on Feb 15,” said Reham El Desoki, senior economist at Arqaam Capital. \nDesoki expected a hold in the March and May meetings and a hike of 200 basis points in June following further cuts in energy subsidies. \nEgypt hiked fuel prices by up to 50 percent in June and electricity prices by up to 42 percent in July in an effort to tighten its spending as part of the three-year IMF deal. Another wave of energy cuts is expected this year as per the recommendation of the International Monetary Fund. \nSisi has to balance between pushing with economic reforms to revive an economy hit hard by political turmoil and maintaining support to win the upcoming election. Reporting by Arwa Gaballa Editing and Graphic by Jeremy Gaunt.", "external_links": [], "published": "2018-01-10T16:37:00.000+02:00", "crawled": "2018-01-10T17:06:22.000+02:00", "highlightTitle": ""}