{"organizations": [], "uuid": "d1099dce2f7f96c2e4bc2921b5b6d6c3e4c51b77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226502422&w=1200&r=LYNXMPEE0T08K", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-deutsche-bank-wealth/deutsches-asia-wealth-unit-looks-to-bolster-recovery-with-more-hires-idUSKBN1FJ0JC", "country": "US", "domain_rank": 408, "title": "Deutsche's Asia wealth unit looks to bolster recovery with more hires", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T07:42:00.000+02:00", "replies_count": 0, "uuid": "d1099dce2f7f96c2e4bc2921b5b6d6c3e4c51b77"}, "author": "", "url": "https://www.reuters.com/article/us-deutsche-bank-wealth/deutsches-asia-wealth-unit-looks-to-bolster-recovery-with-more-hires-idUSKBN1FJ0JC", "ord_in_thread": 0, "title": "Deutsche's Asia wealth unit looks to bolster recovery with more hires", "locations": [], "entities": {"persons": [{"name": "john geddie", "sentiment": "none"}, {"name": "yim", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "asia pacific", "sentiment": "none"}], "organizations": [{"name": "deutsche", "sentiment": "negative"}, {"name": "deutsche bank wealth management", "sentiment": "none"}, {"name": "min read  singapore", "sentiment": "none"}, {"name": "anshuman daga", "sentiment": "none"}, {"name": "deutsche bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SINGAPORE (Reuters) - Asia is at the heart of Deutsche Bank Wealth Management’s plan to rebuild after a shaky few years with further staff hires expected to complement a recovery in assets that is outpacing the global trend, its regional head said on Tuesday.\nDeutsche Bank dropped out of the world’s top 15 private banks in 2016, after it withdrew from a number of countries, saw some high profile departures and German’s biggest lender was lumped with a hefty fine for mis-selling mortgage-backed securities before the 2007-2009 financial crisis.\nLok Yim, its head of Asia Pacific wealth management, said that period was now firmly in the past and he planned to add 20-25 mostly client-focused executives per annum in his unit going forward on top of 50 hired over the last year.\n“Having taken away the uncertainties and done the recovery, you now go to the growth mode,” Yim said.\n“The growth is going to be driven by Asia, and we are going to take a larger proportion of the investments and the growth aspiration.”\nYim was appointed Asia head in late 2016 to replace Ravi Raju who left for UBS after nearly 10 years at the bank.\nThe private bank’s global assets under management fell from 374 billion euros ($462.5 billion) in 2015 to 300 billion euros in 2016, while Asia Pacific saw a drop from 51 billion euros to 45 billion euros.\nBut since then, Asia has staged a recovery while global assets have held steady. As of the third quarter of 2017, Asian assets were up at 48 billion euros while global assets were unchanged at 300 billion euros. Full-year data will be unveiled this week.\n“The expectation of a mass exodus actually never happened. Client confidence came back very quickly,” Yim said.\nAsia’s private banking sector has seen consolidation in recent years, with local players such as Singapore’s DBS Group emerging to challenge global firms in the race to service a region that boasts more billionaires than anywhere else.\nLim said Deutsche’s focus will be on ultra high net worth clients in the region, those with more than $25 million, and the top end of the $5-$25 million high net worth bracket, he said.\nYim said Deutsche differentiates itself with its global reach and its investment bank capabilities in structured finance.\nHe said growth in the region was centered on the major economies of India, China and Indonesia, but he also picked out Taiwan, Hong Kong, the Philippines and Thailand.\nEditing by Jacqueline Wong\n ", "external_links": [], "published": "2018-01-30T07:42:00.000+02:00", "crawled": "2018-01-30T08:07:26.001+02:00", "highlightTitle": ""}