{"organizations": [], "uuid": "d1e35ad7310b7eda6db7845cecd4ad2750229de1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224212700&w=1200&r=LYNXMPEE0L0BF", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-usa-shutdown-workers/anxiety-for-u-s-federal-workers-facing-government-shutdown-furloughs-idUSKBN1FB0EU", "country": "US", "domain_rank": 408, "title": "Federal workers learn their fate as workweek begins in U.S. shutdown", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T13:05:00.000+02:00", "replies_count": 0, "uuid": "d1e35ad7310b7eda6db7845cecd4ad2750229de1"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-shutdown-workers/anxiety-for-u-s-federal-workers-facing-government-shutdown-furloughs-idUSKBN1FB0EU", "ord_in_thread": 0, "title": "Federal workers learn their fate as workweek begins in U.S. shutdown", "locations": [], "entities": {"persons": [{"name": "debbie jennings", "sentiment": "none"}, {"name": "jennings", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "maine", "sentiment": "none"}, {"name": "kittery", "sentiment": "none"}, {"name": "portsmouth naval shipyard", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "international federation of professional and technical engineers", "sentiment": "none"}, {"name": "u.s. senate", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - Thousands of federal employees began the week on Monday trying to figure out if they would be working and getting paid, as U.S. Senate leaders tried to reach a deal to reopen the government open hours before a full Senate vote.\nDuring shutdowns, non-essential government employees are furloughed, or placed on temporary unpaid leave. Those deemed essential, including those in public safety and national security, keep working.\nAt the Portsmouth Naval Shipyard in Kittery, Maine, some 5,300 civilian workers were told to show up on Monday, the third day of the shutdown, regardless of whether they had been scheduled to work that day, to learn if they would be furloughed.\nThe 1,800 members of the International Federation of Professional and Technical Engineers who work at the base maintaining nuclear submarines were distressed by the news, said Debbie Jennings, president of the IFPTE Local 4.\n“They don’t know who is going to be furloughed and who is not, or why some and not others,” Jennings said in an interview. “We were just notified that all union officials will be furloughed, which we don’t think is right.”\nThose who were furloughed were being given two to four hours to shut down their work stations, Jennings said.\nPentagon officials said more than half of the Defense Department’s civilian workers would be furloughed. A spokeswoman for the Portsmouth Naval Yard did not immediately respond to a request for comment.\nThe shipyard was just one of thousands of federal operations whose funding ran out at midnight on Friday and was not renewed amid a dispute between U.S. President Donald Trump and other Republicans and Democrats over immigration.\nThe federal Office of Personnel Management warned on Twitter it may not be able to provide updates on the government’s operating status on its social media accounts due to the shutdown.\nA sign announcing the closure of the Statue of Liberty, due to the U.S. government shutdown, sits near the ferry dock to the Statue of Liberty at Battery Park in Manhattan, New York, U.S. January 21, 2018. REUTERS/Shannon Stapleton “This is incredibly stressful,” said Jessica Klement, vice president at the National Active and Retired Federal Employees Association, which represents more than 20,000 workers.\n“Essential employees must report to work without knowing when they’ll be paid next,” she said. “Non-essential employees will be forced to stay home without pay, not knowing if back pay will be provided.”\nThe Smithsonian Museum said on its website that its District of Columbia museums, research centers and the National Zoo would remain open on Monday using existing funds, but their status beyond then was uncertain.\nEnvironmental Protection Agency Administrator Scott Pruitt instructed all staff to work this week, telling employees in an email over the weekend that the agency has enough resources to remain open for a limited amount of time.\nThe last shutdown in October 2013 lasted more than two weeks, and more than 800,000 federal employees were furloughed.\nThere is no official tally of how many would be furloughed this time. But local economies could suffer in communities where thousands of non-essential personnel are likely to be temporarily off the job - from Norfolk, Virginia, and Fayetteville, North Carolina, to Lakewood, Washington, and Oceanside, California.\nThe Centers for Medicare and Medicaid Services will continue to process applications for health insurance open enrollment, officials said, and the Medicare program for the elderly and disabled is expected to function largely without disruption.\nIn Atlanta, Tom Chapel, a health scientist at the U.S. Centers for Disease Control and Prevention, was at home Monday due to the furlough and awaiting the news from Washington on when he could go back to work.\n“I’ve got plenty of stuff I can get done around the house,” Chapel said. “If it goes on real long, I‘m going to get both concerned and bored.”\nChapel did not blame either party for the shutdown, saying lawmakers were having a legitimate debate on important issues: “It happens periodically.”\nReporting by Valerie Volcovici and Idress Ali in Washington; Additional reporting by David Beasley in Atlanta and Chris Kenning in Chicago; Writing by Scott Malone; Editing by Lisa Von Ahn and Jeffrey Benkoe\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T13:05:00.000+02:00", "crawled": "2018-01-22T19:12:17.000+02:00", "highlightTitle": ""}