{"organizations": [], "uuid": "88b85663da4b266de2f27433f394d6c1b78e9c23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-prospect-capital-schedules-second-quarter-earnings-release-and-conference-call.html", "country": "US", "domain_rank": 767, "title": "Prospect Capital Schedules Second Quarter Earnings Release and Conference Call", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.106, "site_type": "news", "published": "2018-01-31T05:00:00.000+02:00", "replies_count": 0, "uuid": "88b85663da4b266de2f27433f394d6c1b78e9c23"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-prospect-capital-schedules-second-quarter-earnings-release-and-conference-call.html", "ord_in_thread": 0, "title": "Prospect Capital Schedules Second Quarter Earnings Release and Conference Call", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "psec", "sentiment": "negative"}, {"name": "prospect capital corporation", "sentiment": "negative"}, {"name": "prospect capital schedules", "sentiment": "negative"}, {"name": "securities and exchange commission", "sentiment": "none"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 30, 2018 (GLOBE NEWSWIRE) -- Prospect Capital Corporation (NASDAQ:PSEC) (or “Company”) announced today that it expects to file with the Securities and Exchange Commission its report on Form 10-Q containing its second fiscal quarter results for the three and six months ended December 31, 2017 on Wednesday, February 7, 2018 after the close of the markets. The Company also expects to issue its earnings press release on Wednesday, February 7, 2018 after the close of the markets.\nThe Company will host a conference call on Thursday, February 8, 2018 at 11:00 a.m. Eastern Time. The conference call dial-in number will be 888-338-7333. A recording of the conference call will be available for approximately 30 days. To hear a replay, call 877-344-7529 and use passcode 10116503.\nThe conference call will also be available via a live listen-only webcast on the Company’s website, www.prospectstreet.com . Please allow extra time prior to the call to visit the site and download any necessary software that may be needed to listen to the Internet broadcast. A replay of the audio webcast will be available on the Company's website for approximately 30 days following the conference call.\nABOUT PROSPECT CAPITAL CORPORATION\nProspect Capital Corporation ( www.prospectstreet.com ) is a business development company that focuses on lending to and investing in private businesses. Our investment objective is to generate both current income and long-term capital appreciation through debt and equity investments.\nWe have elected to be treated as a business development company under the Investment Company Act of 1940 (“1940 Act”). We are required to comply with a series of regulatory requirements under the 1940 Act as well as applicable NASDAQ, federal and state rules and regulations. We have elected to be treated as a regulated investment company under the Internal Revenue Code of 1986. Failure to comply with any of the laws and regulations that apply to us could have an adverse effect on us and our shareholders.\nThis press release contains within the meaning of the Private Securities Litigation Reform Act of 1995, whose safe harbor for does not apply to business development companies. Any such statements, other than statements of historical fact, are highly likely to be affected by other unknowable future events and conditions, including elements of the future that are or are not under our control, and that we may or may not have considered; accordingly, such statements cannot be guarantees or assurances of any aspect of future performance. Actual developments and results are highly likely to vary materially from any . Such statements speak only as of the time when made, and we undertake no obligation to update any such statement now or in the future.\nFor additional information, contact:\nGrier Eliasek, President and Chief Operating Officer\ngrier@prospectstreet.com\nTelephone (212) 448-0702\nSource: Prospect Capital Corporation", "external_links": ["https://www.globenewswire.com/Tracker?data=99k9oLGXbAEvsaF_IkdjUez8Mqxy3EOOdpro0OPazi2QaFoovcv_34hhNEEtXlsp17F5kq393svA3UuKnvD_4vvGfMow9c5YdKL3dg5YXDM=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/2d478e81-d2a7-4975-94e0-a3e8bbc6c81a"], "published": "2018-01-31T05:00:00.000+02:00", "crawled": "2018-01-31T05:32:12.034+02:00", "highlightTitle": ""}