{"organizations": [], "uuid": "3e19b236a62ff7646d8d58129e7bc38b0e2f0aa5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 49}, "facebook": {"likes": 29, "shares": 29, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1223012652&w=1200&r=LYNXMPEE0H0WC", "site_section": "http://feeds.reuters.com/reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-carillion-restructuring-nationwide/britains-nationwide-to-guarantee-250-carillion-contractor-jobs-idUKKBN1F71H4", "country": "US", "domain_rank": 408, "title": "Nationwide to guarantee 250 Carillion contractor jobs", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T14:01:00.000+02:00", "replies_count": 0, "uuid": "3e19b236a62ff7646d8d58129e7bc38b0e2f0aa5"}, "author": "", "url": "https://uk.reuters.com/article/uk-carillion-restructuring-nationwide/britains-nationwide-to-guarantee-250-carillion-contractor-jobs-idUKKBN1F71H4", "ord_in_thread": 0, "title": "Nationwide to guarantee 250 Carillion contractor jobs", "locations": [], "entities": {"persons": [{"name": "jason neely", "sentiment": "none"}, {"name": "lawrence white", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}], "organizations": [{"name": "carillion", "sentiment": "none"}, {"name": "nationwide building society", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 11:57 AM / Updated 3 hours ago Britain's banks provide support for firms hit by Carillion collapse Lawrence White , Emma Rumney 3 Min Read \nLONDON (Reuters) - Britain’s biggest banks have announced a range of measures to support firms and contractors hit by the collapse of construction outsourcing company Carillion. \nThe banks, including the Royal Bank of Scotland, Lloyds Banking Group and HSBC, said on Thursday they would open funds for business customers in Carillion’s supply chain. \nMeanwhile Nationwide Building Society ( POB_p.L ) will employ around 250 contractors from the company, meaning their jobs will be saved. The 250 contractors provide services such as cleaning and security. \nLloyds said it would make 50 million pounds available, while RBS and HSBC said they would open funds worth 75 million pounds and 100 million pounds respectively. \nBusiness customers of these banks that were experiencing financial difficulty as a result of Carillion’s collapse would be able to apply for payment holidays, fee support or, in the case of Lloyds, working capital, the banks said. \nBritain’s biggest corporate failure in a decade took place after banks pulled the plug on lending to the company. As a result, Carillion went into liquidation, forcing the government to step in to guarantee public services provided by the company ranging from school meals to road works. \nBarclays is contacting its small business customers affected by the Carillion collapse to offer advice and assistance on overdrafts, a bank spokesman said. \nThe bank has also set up a dedicated hotline for such customers, he said. \nThe measures by the banks follow a statement by the banking sector’s trade body UK Finance on Wednesday, which said that lenders were offering overdraft extensions and other emergency measures. UK Finance said banks were taking steps to ease the impact on small firms affected by the liquidation. \nNationwide said in its statement there were another 1,500 staff engaged by separate, third-party suppliers who work on Nationwide contracts with Carillion. \nThose suppliers will now have their contracts directly with the building society, Nationwide said. Editing by Jason Neely and Jane Merriman", "external_links": [], "published": "2018-01-18T14:01:00.000+02:00", "crawled": "2018-01-18T14:17:16.029+02:00", "highlightTitle": ""}