{"organizations": [], "uuid": "6d92900e68a61e3d0e3cbe3e438847a6a4458d53", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-lsi-industries-inc-reports-operating-results-for-the-second-quarter-ended-december-31-2017-and-declares-regular-cash.html", "country": "US", "domain_rank": 767, "title": "LSI Industries Inc. Reports Operating Results for the Second Quarter Ended December 31, 2017, and Declares Regular Cash Dividend", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T14:45:00.000+02:00", "replies_count": 0, "uuid": "6d92900e68a61e3d0e3cbe3e438847a6a4458d53"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/globe-newswire-lsi-industries-inc-reports-operating-results-for-the-second-quarter-ended-december-31-2017-and-declares-regular-cash.html", "ord_in_thread": 0, "title": "LSI Industries Inc. Reports Operating Results for the Second Quarter Ended December 31, 2017, and Declares Regular Cash Dividend", "locations": [], "entities": {"persons": [], "locations": [{"name": "cincinnati", "sentiment": "none"}], "organizations": [{"name": "lsi industries inc", "sentiment": "negative"}, {"name": "lsi industries inc.", "sentiment": "negative"}, {"name": "tcja", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "gaap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CINCINNATI, Jan. 25, 2018 (GLOBE NEWSWIRE) -- LSI Industries Inc. (NASDAQ:LYTS) today announced :\nSecond Quarter Summary\nSales increased 8% compared to Q2 of the prior year Adjusted Operating Income increased 31%, with adjusted operating margin improving 90 basis points Adjusted Net Income increased 32% versus prior year (see reconciliation in Non-GAAP items below) Recorded one-time incremental $4.7 million after-tax charge to reduce the value of its deferred tax assets related to the new Tax Cuts and Jobs Act legislation GAAP reported EPS was a loss of $(0.06) versus $0.08 in prior year Q2. Adjusted EPS of $0.12 compared to $0.10 in Q2 prior year\nNet sales in the second quarter of fiscal 2018 were $92,305,000, an increase of 8% compared to the $85,658,000 reported in the second quarter of the prior year. The Company reported a one-time after-tax charge of $4,676,000 to reduce the value of its deferred tax assets as a result of the new lower corporate tax rate included in the recently enacted “Tax Cut and Jobs Act” (TCJA) legislation. As a result, the Company reported a GAAP net loss of $(1,468,000). See reconciliation in Non-GAAP measures below. Adjusted net income was $3,267,000 in Q2 FY 2018 versus $2,477,000 in Q2 FY 2017. GAAP EPS after the tax adjustment was a loss of $(0.06) versus $0.08 in the second quarter of FY 2017. Adjusted EPS of $0.12 is $0.02 above second quarter of the prior year. The Company declared a regular cash dividend of $0.05 per share payable February 13, 2018 to shareholders of record on February 5, 2017.\nManagement Comments and Outlook\nDennis W. Wells, Chief Executive Officer and President, commented, “Our Q2 results reflect a continuation of the improved performance generated in Q1. The emphasis of the management team throughout the first half was: focus on higher quality sales growth opportunities; achieve value for our investments in new products and technology; strengthen and leverage our service capabilities; and continue to drive productivity and cost control initiatives. The results indicate our team is working on the right priorities and these efforts are generating a positive influence on our results. Our Q2 gross margin increased 160 basis points compared to prior year, driven primarily by the progress on these priorities. Results were achieved despite overall market conditions which remain challenging. Lighting specifically, according to published reference information, was again soft in Q2.\n“We communicated previously our efforts to intentionally shift away from low margin, conventional technology sales opportunities, instead focusing almost exclusively on LED and other technology solutions. Our LED sales in Q2 increased 25% versus Q2 prior year and now represent 92% of our lighting product sales. The soft market and reduction in low margin sales were responsible for a 9% decline in organic sales.\n“As mentioned, we continue to focus on higher quality sales opportunities in Lighting. Multiple initiatives have been deployed to drive growth in both the stock and flow distribution segment of the business, as well as executing an improved approach to managing project business opportunities. Let me reference several examples. Our Atlas brand is a strong player in the “stock and flow” segment, and again delivered solid performance in the second quarter. We continue to achieve key synergy targets, including distribution expansion and select cross-branding. In another vertical category, our dedicated efforts on the renovation opportunities have produced a 94% growth rate in the first half of the fiscal year.\n“Another example is our continued investment and innovation in new technologies related to lighting control and retail solutions. With increasing frequency, these wireless technologies intersect and fall into a category popularly referred to as IoT. The technologies and enabling business models are managed using a process that LSI refers to as the incubation model. Some are advancing very nicely – the digital signage business generated growth of 100+% in the first half of the fiscal year, and our lighting control business has more than doubled. Others, including specific wireless applications such as our Airlink™ indoor ambient lighting solution, and SmartVision® platform, are in earlier stages of adoption. LSI is collaborative in its approach to new technologies, embracing a partnership model that provides flexibility for customer choices and preferences. The IoT is creating new opportunities for retailers to create digital experiences, not only to improve operational efficiencies, but to enhance customer relationships, spending, and loyalty. LSI is positioned to assist our retail customers achieve these benefits.\n“We are excited about several key new lighting products announced late in Q2, which we expect to generate a positive sales impact throughout the second half of fiscal 2018. These include the completely redesigned Scottsdale® Vertex™ under-canopy fixture, intended to solidify our market leading position in petroleum and c-store applications. Also announced was a new linear product for high bay applications, designed to service the growing warehousing and other high bay segments. The product represents a significantly reduced fixture size, improved lumen performance, and is priced at competitive market levels. Lastly, we strengthened our outdoor area lighting offering with the latest generation of Mirada products. The first products have already been introduced with the balance of the range scheduled in Q3. The new Mirada has industry leading photometry utilizing LSI’s exclusive new silicone optical system, and is available with integral and wireless controls.\n“The Graphics Segment delivered a solid quarter with sales increasing 12% versus prior year, and generating significantly improved operating earnings. The improvement was led by growth in our SOAR digital signage business which, as noted above, generated sales growth of 100+% versus prior year. We’re successful in the conventional graphics segment as well, adding a number of new customers in the quarter. Investments in critical technology equipment in 2017 have assisted in further improving our lead-time and service capabilities, a critical element of the demanding graphics business model.\n“We continue to keep a watchful eye on commodity prices. While stabilized at the recent high levels, projections indicate the market may incur additional movement in steel, aluminum and other select commodities utilized in the production of lighting products. As a result, we continue to be aggressive in all areas of cost reduction and management utilizing our LSI business system framework. These productivity efforts have been successful in offsetting the impact of inflation throughout the first half of fiscal 2018.\n“The business generated positive cash flow in Q2 and our overall financial position remains strong. The Board approved a quarterly dividend payment of $0.05 per share.\n“In December, the President signed the Tax Cut and Jobs Act (TCJA) legislation into law. Management is optimistic that the tax cuts will stimulate investment and generate growth in both new and retrofit non-residential construction, generating demand for lighting products. In addition, as a result of the reduction in the federal corporation tax rate from 35% to 21%, we expect TCJA to favorably impact future LSI net income, earnings per share, and cash flow. For full year fiscal 2018, we forecast that the Company’s blended consolidated effective income tax rate will be approximately 29% before discrete items, as compared to approximately 34% for fiscal 2017. The full year impact of TCJA will be realized in 2019 and our effective tax rate is currently estimated at 24%. With the passage of TCJA however, we were required to record a one-time after-tax charge related to valuation of our net deferred tax assets.\n“We are encouraged about the future prospects for the lighting market. Recent indicators such as the Dodge non-residential construction momentum index are improving. Coupled with the TCJA, we believe the probability of an improved market environment is increasing. However, these developments will not necessarily have a significant influence to our fiscal Q3, but will more likely impact fiscal Q4 and forward. That said, we will continue to work diligently on the priorities outlined earlier: focus on higher quality sales growth opportunities; achieve value for our investments in new products and technology; strengthen and leverage our service capabilities; and continue to drive productivity and cost control initiatives. With this focus, we are confident the business will be positioned to capitalize on developing market growth opportunities.”\nMr. Wells continued, “I want to thank Ronald (Ron) S. Stowell for his dedicated service to LSI Industries for over 25 years. Ron has been an invaluable resource and partner to me since I joined the Company in October 2014. During the past six months, he has worked closely with James (Jim) E. Galeese, Executive Vice President and Chief Financial Officer, to ensure a smooth transition. I wish Ron the very best as he embarks upon new adventures during his retirement.”\nFinancial Highlights (In thousands, except per share data; unaudited) Three Months Ended\nDecember 31 Six Months Ended\nDecember 31 2017 2016 % Change 2017 2016 % Change Net Sales $ 92,305 $ 85,658 8 % $ 179,771 $ 169,817 6 % Operating Income (Loss) as reported $ 4,547 $ 2,818 61 % $ (20,267 ) $ 3,884 n/m Goodwill impairment -- -- n/m 28,000 -- n/m Restructuring costs and plant closure costs -- 697 n/m -- 1,753 n/m Severance costs 83 28 n/m 83 173 (52 )% Operating Income as adjusted (a) $ 4,630 $ 3,543 31 % $ 7,816 $ 5,810 35 % Net Income (Loss) as reported $ (1,468 ) $ 2,006 n/m $ (17,097 ) $ 2,835 n/m Net Income as adjusted $ 3,267 $ 2,477 32 % $ 5,001 $ 4,098 22 % Earnings (Loss) per share (diluted) as reported $ (0.06 ) $ 0.08 n/m $ (0.66 ) $ 0.11 n/m Earnings per share (diluted) as adjusted $ 0.12 $ 0.10 20 % $ 0.19 $ 0.16 19 %\nFinancial Highlights (continued) (In thousands) 12/31/17 6/30/17 Working Capital $ 72,750 $ 61,704 Total Assets $ 238,374 $ 256,680 Long-Term Debt $ 52,149 $ 49,698 Shareholders’ Equity $ 142,328 $ 160,078 (a) The Company recorded pre-tax goodwill impairment of $28,000,000 in the first quarter of fiscal 2018 and a $4.7 million tax charge related to the revaluation of the Company’s deferred tax assets in the second quarter of fiscal 2018. The Company recorded pre-tax restructuring costs and plant closure costs totaling $697,000 in the second quarter of fiscal 2017 and $1,753,000 in the first half of fiscal 2017. The Company incurred net pre-tax other severance expense of $83,000 and $28,000 in the second quarter of fiscal 2018 and fiscal 2017, respectively, and incurred net pre-tax severance expense of $173,000 in the first half of fiscal 2017. Operating income, net income, and earnings per share (diluted) before the goodwill impairment, one-time tax charge, restructuring costs, plant closure costs and severance expense are Non-GAAP financial measures (see below for a reconciliation).\nSecond Quarter Fiscal 2018 Results\nNet sales in the second quarter of fiscal 2018 were $92,305,000, up 7.8% from last year’s second quarter net sales of $85,658,000. Lighting Segment net sales of $69,174,000 were up 6.3% from last year’s second quarter net sales and Graphics Segment net sales increased 12.4% to $23,131,000. The former Technology Segment net sales and operating results are now included in the Lighting Segment and prior year segment results have been revised accordingly. In the second quarter of fiscal 2017 the Company recorded pre-tax restructuring costs of $697,000 ($640,000 was expensed in Cost of Products Sold and $57,000 was expensed in Selling and Administrative expenses). The Company incurred net pre-tax other severance expense of $83,000 and $28,000 in the second quarter of fiscal 2018 and fiscal 2017, respectively. The fiscal 2018 second quarter net loss of $(1,468,000), or $(0.06) per share, compared to the fiscal 2017 second quarter net income of $2,006,000 or $0.08 per share. The fiscal 2018 second quarter net loss includes a one-time after-tax charge of $4.7 million tax adjustment related to the revaluation of the Company’s deferred tax assets as a result of the lower tax rates included in the Tax Cut and Jobs Act. Earnings per share represents diluted earnings per share.\nFirst Half Fiscal 2018 Results\nNet sales in the first half of fiscal 2018 were $179,771,000, an increase of 5.9% as compared to last year’s first half net sales of $169,817,000. Lighting Segment net sales increased 5.5% to $137,602,000 and Graphics Segment net sales increased 6.8% to $42,169,000. The former Technology Segment net sales and operating results are now included in the Lighting Segment and prior year segment results have been revised accordingly. In the first half of fiscal 2017 the Company recorded pre-tax restructuring costs of $1,353,000 ($1,143,000 was expensed in Cost of Products Sold and $210,000 was expensed in Selling and Administrative expenses) and plant closure costs related to an inventory write-down of $400,000 as the Company exited the manufacturing of fluorescent lighting fixtures -- combining to a total of $1,753,000. Additionally, the Company recorded other severance costs of $83,000 and $173,000 in the first half of fiscal 2018 and 2017, respectively. The first half fiscal 2018 net loss of $(17,097,000), or $(0.66), compared to the fiscal 2017 first half net income of $2,835,000, or $0.11 per share. The fiscal 2018 first half net loss includes a one-time after-tax charge of $4.7 million related to the revaluation of the Company’s deferred tax assets as a result of the lower tax rates included in the Tax Cut and Jobs Act and a pre-tax goodwill impairment in the Lighting Segment of $28,000,000. Earnings per share represents diluted earnings per share.\nBalance Sheet\nThe balance sheet at December 31, 2017 included current assets of $115.3 million, current liabilities of $42.5 million and working capital of $72.8 million, which includes cash of $3.2 million. The current ratio was 2.7 to 1. The Company has shareholders’ equity of $142.3 million and $52.1 million of long-term debt on its balance sheet as of December 31, 2017. With continued strong cash flow, a sound balance sheet, and $47.9 million available in its credit facility, LSI Industries believes its financial condition is sound and is capable of supporting the Company’s planned growth, including acquisitions, if any.\nCash Dividend Actions\nThe Board of Directors declared a regular quarterly cash dividend of $0.05 per share in connection with the second quarter of fiscal 2018 payable February 13, 2018 to shareholders of record as of February 5, 2018. The indicated annual cash dividend rate is $0.20 per share. The Board of Directors has adopted a policy regarding dividends which indicates that dividends will be determined by the Board of Directors in its discretion based upon its evaluation of earnings, cash flow requirements, financial condition, debt levels, stock repurchases, future business developments and opportunities, and other factors deemed relevant.\nNon-GAAP Financial Measures\nThis press release includes adjustments to GAAP net income and earnings per share for the three and six month periods ended December 31, 2017 and 2016. Adjusted net income and earnings per share, which exclude the impact of a goodwill impairment, a tax charge related to the revaluation of the Company’s Deferred Tax Assets, restructuring and plant closure costs, and other severance costs, are non-GAAP financial measures. We believe that these are useful as supplemental measures in assessing the operating performance of our business. These measures are used by our management, including our chief operating decision maker, to evaluate business results. We exclude these non-recurring items because they are not representative of the ongoing results of operations of our business. Below is a reconciliation of these non-GAAP financial measures to the net income and earnings per share reported for the periods indicated.\n(in thousands, except per share data; unaudited) Second Quarter Diluted Diluted FY 2018 EPS FY 2017 EPS Reconciliation of net income to adjusted net income: Net income and earnings per share as reported $ (1,468 ) $ (0.06 ) $ 2,006 $ 0.08 Tax impact from the reduction of the Deferred Tax Assets 4,676 $ 0.18 -- -- Adjustment for restructuring and plant closure costs, inclusive of the income tax effect -- -- 448 $ 0.02 Adjustment for other severance costs, inclusive of the income tax effect 59 -- 23 -- Adjusted net income and earnings per share $ 3,267 $ 0.12 $ 2,477 $ 0.10\n(in thousands, except per share data; unaudited) Six Month Period Diluted Diluted FY 2018 EPS FY 2017 EPS Reconciliation of net income to adjusted net income: Net income and earnings per share as reported $ (17,097 ) $ (0.66 ) $ 2,835 $ 0.11 Adjustment for goodwill impairment, inclusive of the income tax effect 17,361 $ 0.67 -- -- Tax impact from the reduction of the Deferred Tax Assets 4,676 $ 0.18 -- -- Adjustment for restructuring and plant closure costs, inclusive of the income tax effect -- -- 1,143 0.04 Adjustment for other severance costs, inclusive of the income tax effect 59 -- 120 -- Adjusted net income and earnings per share $ 5,001 $ 0.19 $ 4,098 $ 0.16 The reconciliation of reported net income and earnings per share to adjusted net income and earnings per share may not agree due to rounding differences and due to the difference between basic and dilutive weighted average shares outstanding in the computation of earnings per share.\n\"Safe Harbor\" Statement under the Private Securities Litigation Reform Act of 1995\nThis document contains certain forward-looking statements that are subject to numerous assumptions, risks or uncertainties. The Private Securities Litigation Reform Act of 1995 provides a safe harbor for forward-looking statements. Forward-looking statements may be identified by words such as “estimates,” “anticipates,” “projects,” “plans,” “expects,” “intends,” “believes,” “seeks,” “may,” “will,” “should” or the negative versions of those words and similar expressions, and by the context in which they are used. Such statements, whether expressed or implied, are based upon current expectations of the Company and speak only as of the date made. Actual results could differ materially from those contained in or implied by such forward-looking statements as a result of a variety of risks and uncertainties over which the Company may have no control. These risks and uncertainties include, but are not limited to, the impact of competitive products and services, product demand and market acceptance risks, potential costs associated with litigation and regulatory compliance, reliance on key customers, financial difficulties experienced by customers, the cyclical and seasonal nature of our business, the adequacy of reserves and allowances for doubtful accounts, fluctuations in operating results or costs whether as a result of uncertainties inherent in tax and accounting matters or otherwise, failure of an acquisition or acquired company to achieve its plans or objectives generally, unexpected difficulties in integrating acquired businesses, the ability to retain key employees, unfavorable economic and market conditions, the results of asset impairment assessments, the ability to maintain an effective system of internal control over financial reporting, the ability to remediate any material weaknesses in internal control over financial reporting and any other risk factors that are identified herein. You are cautioned to not place undue reliance on these forward-looking statements. In addition to the factors described in this paragraph, the risk factors identified in our Form 10-K and other filings the Company may make with the SEC constitute risks and uncertainties that may affect the financial performance of the Company and are incorporated herein by reference. The Company does not undertake and hereby disclaims any duty to update any forward-looking statements to reflect subsequent events or circumstances.\nAbout the Company\nWe are a customer-centric company that positions itself as a value-added, trusted partner in developing superior image solutions through our world-class lighting, graphics, and technology capabilities. Our core strategy of \"Lighting + Graphics + Technology = Complete Image Solutions\" differentiates us from our competitors.\nWe are committed to advancing solid-state LED technology to make affordable, high performance, energy-efficient lighting and custom graphic products that bring value to our customers. We have a vast offering of innovative solutions for virtually any lighting or graphics application. In addition, we provide sophisticated lighting and energy management control solutions to help customers manage their energy performance. Further, we provide a full range of design support, engineering, installation and project management services to our customers.\nWe are a vertically integrated U.S.-based manufacturer concentrating on serving customers in North America and Latin America. Our major markets include commercial / industrial lighting, petroleum / convenience store and multi-site retail (including automobile dealerships, restaurants and national retail accounts). Headquartered in Cincinnati, Ohio, LSI has facilities in Ohio, California, Kentucky, New York, North Carolina and Texas. The Company’s common shares are traded on the NASDAQ Global Select Market under the symbol LYTS.\nFor further information, contact either Dennis Wells, Chief Executive Officer and President, or Jim Galeese, Executive Vice President and Chief Financial Officer at (513) 793-3200.\nConference Call\nAs previously disclosed, Dennis Wells and Jim Galeese will host a conference call later this morning at 10:00 a.m. EST to discuss Q2 results. The call will contain forward looking statements and other material information.\nAccess to the live Webcast will be available via the Investor Relations page of the Company’s website:\nhttp://www.lsi-industries.com\nA replay of the Webcast will be posted to the Investor Relations page of the Company’s website shortly after the completion of the conference call, where it will be archived for twelve months.\nAdditional note: Today’s news release, along with past releases from LSI Industries, is available on the Company’s internet site at www.lsi-industries.com or by email or fax, by calling the Investor Relations Department at (513) 793-3200.\nCondensed Consolidated Statements of Operations (in thousands, except per share data; unaudited) Three Months Ended\nDecember 31 Six Months Ended\nDecember 31 2017 2016 2017 2016 Net sales $ 92,305 $ 85,658 $ 179,771 $ 169,817 Cost of products and services sold 66,998 63,611 130,761 126,432 Restructuring costs – cost of sales -- 640 -- 1,143 Gross profit 25,307 21,407 49,010 42,242 Selling and administrative expenses 20,760 18,532 69,277 38,148 Restructuring costs – SG&A expense -- 57 -- 210 Operating income 4,547 2,818 (20,267 ) 3,884 Interest (income) expense, net 417 (20 ) 820 (34 ) Income before income taxes 4,130 2,838 (21,087 ) 3,918 Income tax expense 5,598 832 (3,990 ) 1,083 Net income $ (1,468 ) $ 2,006 $ (17,097 ) $ 2,835 Income per common share Basic $ (0.06 ) $ 0.08 $ (0.66 ) $ 0.11 Diluted $ (0.06 ) $ 0.08 $ (0.66 ) $ 0.11 Weighted average common shares outstanding Basic 25,858 25,314 25,824 25,924 Diluted 25,858 25,803 25,824 25,859\nCondensed Consolidated Balance Sheets (in thousands, unaudited) December 31, June 30, 2017 2017 Current Assets $ 115,291 $ 107,129 Property, Plant and Equipment, net 44,863 47,354 Other Assets 78,220 102,197 $ 238,374 $ 256,680 Current Liabilities $ 42,541 $ 45,425 Long-Term Debt 52,149 49,698 Other Long-Term Liabilities 1,356 1,479 Shareholders’ Equity 142,328 160,078 $ 238,374 $ 256,680 CONTACT: DENNIS WELLS or JIM GALEESE (513) 793-3200\nSource:LSI Industries Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=HuW1xr40piIdnbEP9cFfnpXR_Xoyx3WptABP6P7EB3_zsBjbct4y4Sj-ZuSM_yfN9n6C84JWa3gcs6fjXEbiGIT7NN56DesJC50EWvMYVpDPmfYZjOGrgUB1FXbzr4VW", "https://www.globenewswire.com/Tracker?data=Z2Rlew99fwRI0oBrpZA89MHzidRKuSsP1c2XOW5Y2x27zEIr6ZcIZkEjdz1FAC_EDWvYXuKUbHrcK8BKtN9Q6zbEZi8kPIOgvL0EQNo6Hfg=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/0023f1e7-5543-4c82-83eb-378980391de1"], "published": "2018-01-25T14:45:00.000+02:00", "crawled": "2018-01-25T14:24:55.000+02:00", "highlightTitle": ""}