{"organizations": [], "uuid": "031d1f49fd42ed5e1df27d41eb739067ab6b5df5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-great-elm-capital-corp-prices-public-offering-of-43-point-0-million-of-6-point-75-percent-notes-due-2025.html", "country": "US", "domain_rank": 767, "title": "Great Elm Capital Corp. Prices Public Offering of $43.0 Million of 6.75% Notes Due 2025", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T03:30:00.000+02:00", "replies_count": 0, "uuid": "031d1f49fd42ed5e1df27d41eb739067ab6b5df5"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-great-elm-capital-corp-prices-public-offering-of-43-point-0-million-of-6-point-75-percent-notes-due-2025.html", "ord_in_thread": 0, "title": "Great Elm Capital Corp. Prices Public Offering of $43.0 Million of 6.75% Notes Due 2025", "locations": [], "entities": {"persons": [{"name": "januar", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "waltham", "sentiment": "none"}], "organizations": [{"name": "great elm capital corp", "sentiment": "negative"}, {"name": "great elm capital corp.", "sentiment": "negative"}, {"name": "gecc", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WALTHAM, Mass., Jan. 11, 2018 (GLOBE NEWSWIRE) -- Great Elm Capital Corp. (NASDAQ:GECC) (the “Company”) announced today the pricing of its public offering of $43.0 million aggregate principal amount of its 6.75% notes due 2025 (the “Notes”), which will result in net proceeds to the Company of approximately $41.2 million after payment of underwriting discounts and commissions and estimated offering expenses payable by the Company.\nThe Notes will mature on January 31, 2025, and may be redeemed in whole or in part at any time or from time to time at the Company’s option on or after January 31, 2021. The Notes will bear interest at a rate of 6.75% per year payable quarterly on March 31, June 30, September 30 and December 31 of each year, beginning on March 31, 2018. The Company has also granted the underwriters a 30-day option to purchase up to an additional approximately $6.5 million aggregate principal amount of Notes to cover over-allotments, if any.\nThe closing of the transaction is subject to customary closing conditions, and the Notes are expected to be delivered on or about January 19, 2018. The Company intends to apply to list the Notes on the NASDAQ Stock Market under the trading symbol “GECCM,” and if the application is approved, expects trading in the Notes to begin within 30 days from the original issue date.\nThe Company intends to use the net proceeds from this offering to make investments consistent with its investment objectives and for general corporate purposes. The Company may also invest the net proceeds of this offering in cash, cash equivalents, U.S. Government securities and other high-quality debt instruments that mature in one year or less, or \"temporary investments\", as appropriate.\nLadenburg Thalmann & Co. Inc., a subsidiary of Ladenburg Thalmann Financial Services Inc. (NYSEMKT:LTS), Janney Montgomery Scott LLC and Oppenheimer & Co. Inc. are acting as book-running managers for the offering. Incapital LLC and Wedbush Securities Inc. are acting as co-managers for the offering.\nThis press release does not constitute an offer to sell or the solicitation of an offer to buy the securities in this offering or any other securities nor will there be any sale of these securities or any other securities referred to in this press release in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to the registration or qualification under the securities laws of such state or jurisdiction.\nA registration statement relating to these securities is on file with and has been declared effective by the Securities and Exchange Commission. The offering may be made only by means of a prospectus, copies of which may be obtained, when available, from:\nLadenburg Thalmann & Co. Inc.\n277 Park Avenue, 26th Floor\nNew York, New York 10172\nor:\n1-800-573-2541\nor:\nprospectus@ladenburg.com\nInvestors are advised to carefully consider the investment objectives, risks and charges and expenses of the Company before investing. The preliminary prospectus, dated January 9, 2018, which has been filed with the Securities and Exchange Commission, contains a description of these matters and other important information about the Company and should be read carefully before investing.\nAbout Great Elm Capital Corp.\nGreat Elm Capital Corp. is an externally managed, specialty finance company focused on investing in debt instruments of middle market companies. GECC elected to be regulated as a business development company under the Investment Company Act of 1940, as amended. GECC focuses on special situations and catalyst-driven investments as it seeks to generate attractive, risk-adjusted returns through both current income and capital appreciation.\nCautionary Statement Regarding Forward-Looking Statements\nStatements in this communication that are not historical facts are “forward-looking” statements within the meaning of the federal securities laws. These statements are often, but not always, made through the use of words or phrases such as “believe,” “expect,” “anticipate,” “should,” “planned,” “will,” “may,” “intend,” “estimated,” “aim,” “target,” “opportunity,” “tentative,” “positioning,” “designed,” “create,” “seek,” “would,” “could”, “continue,” “ongoing,” “upside,” “increases,” and “potential,” and similar expressions. All such forward-looking statements involve estimates and assumptions that are subject to risks, uncertainties and other factors that could cause actual results to differ materially from the results expressed in the statements. Among the key factors that could cause actual results to differ materially from those projected in the forward-looking statements are the following: conditions in the credit markets, the price of GECC common stock, performance of GECC’s portfolio and investment manager. Additional information concerning these and other factors can be found in GECC’s registration statement. GECC assumes no obligation to, and expressly disclaims any duty to, update any forward-looking statements contained in this document or to conform prior statements to actual results or revised expectations except as required by law. Readers are cautioned not to place undue reliance on these forward-looking statements that speak only as of the date hereof.\nMedia & Investor Contact:\nMeaghan K. Mahoney\nSenior Vice President\n+1 (617) 375-3006\ninvestorrelations@greatelmcap.com\nSource:Great Elm Capital Corp.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/22f7fdba-a6fd-44a2-9c83-f1ff3d064ce6", "https://www.globenewswire.com/Tracker?data=A7vT7w36DAGNUr5YJyMTKugbBU0Q5FSz0hI4WEfyzKMbQsKFbWVdhmbAur_ZpjJgPuFfUXRJ31qfR2u3GJrgXB5ngNUD40uXyEs60TnjGEY=", "https://www.globenewswire.com/Tracker?data=taaqdgnj742-Lf0LVa8W8hV8eOqdQ4Igy8hBgvdJLTSOFFaO4HwC3IDzVDChkGM52sG0K_SSw1ASIiiJ2jWnnPK9wmq2-uxKDPE1NPVNO43J-yjPNZsrxRt819m42AoP"], "published": "2018-01-12T03:30:00.000+02:00", "crawled": "2018-01-12T06:16:04.011+02:00", "highlightTitle": ""}