{"organizations": [], "uuid": "490f6d9e92fc9c6b13395ef914884c5ff6bd57d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180108.html", "section_title": "Archive News &amp; Video for Monday, 08 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-dollar-edges-up-from-3-1-2-month-lows-euro-pauses-after-rally-idUSL4N1P3179", "country": "US", "domain_rank": 408, "title": "FOREX -Dollar edges up from 3-1/2-month lows; euro pauses after rally", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T13:48:00.000+02:00", "replies_count": 0, "uuid": "490f6d9e92fc9c6b13395ef914884c5ff6bd57d1"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-dollar-edges-up-from-3-1-2-month-lows-euro-pauses-after-rally-idUSL4N1P3179", "ord_in_thread": 0, "title": "FOREX -Dollar edges up from 3-1/2-month lows; euro pauses after rally", "locations": [], "entities": {"persons": [{"name": "satoshi okagawa", "sentiment": "none"}, {"name": "masayuki kitano", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}], "organizations": [{"name": "fed", "sentiment": "none"}, {"name": "bank of canada", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Dollar index firmer, inches up from recent 3-1/2 month lows\n* U.S. jobs data showed slower-than-expected rise in payrolls\n* But market expectations for Fed policy outlook little changed\n* Canadian dollar buoyed by Bank of Canada rate hike expectations (Updates prices, adds comments)\nBy Masayuki Kitano\nSINGAPORE, Jan 8 (Reuters) - The dollar inched higher against a basket of major peers on Monday as data showing slower U.S. jobs growth did little to dent expectations for further Federal Reserve interest rate increases this year.\nThe dollar’s index against a basket of six major currencies rose 0.1 percent to 92.051, up from its Jan. 2 low of 91.751, which was its weakest level since Sept. 20.\nU.S. nonfarm payrolls increased by 148,000 jobs last month, after a surge of 252,000 in November, according to data on Friday. Economists polled by Reuters had expected a December rise of 190,000.\nInitially, the dollar slipped after the payrolls figures, but later regained some composure.\n“The recent trend of dollar-selling is taking a bit of a pause,” said Satoshi Okagawa, senior global markets analyst for Sumitomo Mitsui Banking Corporation in Singapore, adding that the dollar drew some support after U.S. Treasury yields nudged higher on Friday.\nThe U.S. currency had begun 2018 on the defensive, after the dollar index fell about 9.9 percent in 2017, its weakest performance since 2003.\nA synchronised global recovery has prompted other countries’ central banks to start moving towards tighter monetary policy in recent months, helping bolster their currencies.\nAfter the U.S. jobs data, traders of U.S. short-term interest rate futures continued to bet the Fed would raise interest rates two times this year, including a probable increase in March.\nComments by some Fed officials on Friday and over the weekend suggested the U.S. central bank remained on track to raise interest rates in 2018.\nSan Francisco Fed President John Williams told Reuters in an interview on Saturday that the Fed should raise interest rates three times this year given the already strong economy will get a boost from tax cuts, and can tighten more or less aggressively if needed.\nFederal Reserve Bank of Cleveland President Loretta Mester told Reuters in an interview on Friday she expected roughly four interest rate hikes this year, as U.S. economic growth picks up and unemployment remains low.\nAgainst the yen, the dollar firmed about 0.1 percent to 113.20 yen, having traded in a range of roughly 112.00 yen to 113.75 yen over the past month.\nThe euro held steady at $1.2027. Having started the year on a firm footing, the common currency rose to $1.2089 on Thursday, nearing a 2-1/2 year peak of $1.2092 set in early September.\nThe euro faces some headwinds after its recent gains, said Roy Teo, investment strategist for LGT Bank in Singapore.\nThese include signs that speculative long positions in the euro are “getting overcrowded”, potential risks from Italian elections coming up in March, as well as the fact that core inflation in the euro zone remains subdued, Teo said.\nSpeculators trading currency futures increased their net long positions in the euro to a record high of 127,868 contracts in the week ended Jan. 2, data from the U.S. Commodity Futures Trading Commission showed.\nThe Canadian dollar last traded at C$1.2400 per U.S. dollar, up 0.1 percent from late U.S. trade on Friday.\nThe so-called loonie had jumped to a three-month high of C$1.2355 on Friday after jobs data that blew past expectations boosted market expectations for Canada’s central bank to raise interest rates in January. (Reporting by Masayuki Kitano; Editing by Shri Navaratnam and Neil Fullick)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-08T13:48:00.000+02:00", "crawled": "2018-01-09T16:51:48.000+02:00", "highlightTitle": ""}