{"organizations": [], "uuid": "4259eaa49d3cf639acf11cad682834e731e96aa4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180120&t=2&i=1223676895&w=1200&r=LYNXMPEE0J0QG", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-stk-hdd-wagner/stoke-showed-more-aggression-admits-beaten-huddersfield-boss-idUKKBN1F910T", "country": "US", "domain_rank": 408, "title": "Stoke showed more aggression, admits beaten Huddersfield boss", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T20:42:00.000+02:00", "replies_count": 0, "uuid": "4259eaa49d3cf639acf11cad682834e731e96aa4"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-stk-hdd-wagner/stoke-showed-more-aggression-admits-beaten-huddersfield-boss-idUKKBN1F910T", "ord_in_thread": 0, "title": "Stoke showed more aggression, admits beaten Huddersfield boss", "locations": [], "entities": {"persons": [{"name": "neil ro", "sentiment": "negative"}, {"name": "wagner", "sentiment": "none"}, {"name": "david wagner", "sentiment": "none"}, {"name": "powell  wagner", "sentiment": "none"}, {"name": "paul lambert", "sentiment": "none"}], "locations": [{"name": "stoke-on-trent", "sentiment": "none"}, {"name": "stoke city", "sentiment": "none"}], "organizations": [{"name": "huddersfield", "sentiment": "negative"}, {"name": "stoke", "sentiment": "none"}, {"name": "stoke city", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "huddersfield town", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 44 PM / Updated 8 minutes ago Stoke showed more aggression, admits beaten Huddersfield boss Neil Robinson 2   Huddersfield Town manager David Wagner said his side lost out to Stoke City’s aggressive approach at the bet365 Stadium as the visitors slumped to their third successive Premier League defeat on Saturday. \nHuddersfield appeared overawed by opponents keen to prove themselves to new manager Paul Lambert as a passionate home crowd delighted in the 2-0 win. \n”I am unsure if all opponents will be as aggressive as Stoke today,“ said Wagner. ”Stoke and their supporters were really on it. They limited us and I felt they deserved it. They limited our offensive game. \n“It shouldn’t be a surprise that Stoke is a top quality side, even if they are not in the best position in the table. We fought and tried everything but were limited offensively, football-wise.” Soccer Football - Premier League - Stoke City vs Huddersfield Town - bet365 Stadium, Stoke-on-Trent,   Huddersfield Town manager David Wagner applauds the fans at the end of the match REUTERS/Peter Powell \nWagner’s side, who have now gone six league games without a win, have been criticised for their failure to keep possession at crucial moments this season and the German noted that they struggled to retain the ball, with new signing Alex Pritchard unable to assert himself in midfield. \n“We have to be stronger in ball possession too. It wasn’t a game for technical players today. It was a fighting game with a lot of tackles,” Wagner said. “We changed our idea of playing football and wanted to go more direct which worked for a big part of the game but not long enough.” \nWagner knows his side, who occupy 14th place, just three points above the drop zone, face a fight to stay in the division after one season but indicated that the key to survival lies in refusing to panic. \n”We keep cool heads since we were promoted,“ he said. ”We will not get ahead of ourselves after positive or negative results. \n“I have to accept where we are in the table. It’s only us who can change it. We have fought since the first day of the season and even though we have now six games with only three points, we know we have to collect more points to survive.” Reporting by Neil Robinson; Editing by Christian Radnedge", "external_links": [], "published": "2018-01-20T20:42:00.000+02:00", "crawled": "2018-01-20T21:02:47.000+02:00", "highlightTitle": ""}