{"organizations": [], "uuid": "430f6001312f8ac8759711d5a9725b523719871d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-blockchain-infusion-in-mobile-payment-solutions-to-substantially-improve-more-secure-and-seamless-payment-transactions.html", "country": "US", "domain_rank": 767, "title": "Blockchain Infusion in Mobile Payment Solutions to Substantially Improve More Secure and Seamless Payment Transactions", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.112, "site_type": "news", "published": "2018-01-23T16:50:00.000+02:00", "replies_count": 0, "uuid": "430f6001312f8ac8759711d5a9725b523719871d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-blockchain-infusion-in-mobile-payment-solutions-to-substantially-improve-more-secure-and-seamless-payment-transactions.html", "ord_in_thread": 0, "title": "Blockchain Infusion in Mobile Payment Solutions to Substantially Improve More Secure and Seamless Payment Transactions", "locations": [], "entities": {"persons": [], "locations": [{"name": "florida", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PALM BEACH, Florida, January 23, 2018 /PRNewswire/ --\nMarketNewsUpdates.com News Commentary\nIt was inevitable that the mobile payment landscape would be significant influenced by the rise of blockchain technologies and cryptocurrencies, and mobile pay companies in the industry are making headlines through the acquisition of blockchain platforms in order to strengthen their overall platforms. There is a rising need for new applications or products in a fast-growing market for a secure device or platform that can simplify the use of cryptocurrency across multiple applications. As a growing number of consumers are demanding those devices and applications to become mainstream, companies are racing to develop innovative solutions that allow the user to seamlessly convert between different currencies across different mobile devices and platforms. Experts are forecasting strong growth for the mobile payment industry moving forward and as the numbers continue to rise steadily, the infusion of blockchain technologies will only become more frequent as the demand for robust and secure applications grows quickly. Active in blockchain market today includes: Social Play USA, Inc. (OTC: SPLY), Glance Technologies (OTC: GLNNF) (CSE: GET), International Business Machines Corporation (NYSE: IBM), Global Blockchain Technologies Corporation (TSX-V: BLOC.V) (OTC: BLKCF), Cisco Systems Inc. (NASDAQ: CSCO).\nSocial Play USA, Inc. (OTC: SPLY), announces that it is finalizing negotiations to acquire Spot And Pay Inc. ( http://www.spotandpay.com ) and its Spot&Pay Mobile Payment Platform. Details of the agreement, which is subject to approval by the board of directors of each company, will be announced in the coming weeks.\nSocialPlay identified Spot&Pay as an acquisition target due to its unique mobile payment application that is used in connection with third party QR codes that have been generated for specific uses; i.e. individual consumer products, specific services or group of services offered to the general public, B2B product and service offerings, monetary donations to charitable organizations, and quick and easy bill payments on recurring monthly accounts. Read this and more news for Social Play USA, Inc. at: http://www.marketnewsupdates.com/news/sply.html\nThe Company's software development plan has evolved to include a substantially more robust proprietary platform wallet feature that will allow users to create their own wallet so that they may buy and sell bitcoin and other cryptocurrencies directly from the Spot&Pay platform. It also provides seamless abilities to transfer money within the Spot&Pay user network instantly from one account to another without any processing delays.\nAs part of its strategy going forward, SocialPlay will focus significant development efforts on the integration of cryptocurrency and blockchain technologies into its product offerings. The Company believes that the future of financial transactions will be in the mobile space, and the security of these types of financial transactions will rely on blockchain verification and its unique, decentralized ledger. Distributed blockchain ledgers provide a highly secure identity verification and authentication methodology of user data, resulting in the most secure platform for users to initiate and complete financial transactions. In addition to developing its own proprietary blockchain technology, the Company will also seek to acquire existing, complementary blockchain technologies.\nIn other industry developments and stock performance of note in the markets:\nGlance Technologies Inc. (OTC: GLNNF) (CSE: GET.CN) announced it has agreed to grant Fobi Pay Technologies Inc., a non-exclusive license to use the Glance Pay mobile payment, security, anti-fraud and Glance Coin blockchain technology for a $5 million fee for a one year initial term, renewable annually for $10,000 per year.\"Fobi Pay will offer big data analytics for networks of related businesses. Our value prop is in merging purchase basket and historical data with social media and mobile data to create highly personalized customer journeys,\" says Rob Anson, CEO of Fobi Pay. \"By licensing the Glance technology we will be able to offer a closed loop digital media and mobile strategy for our industry partners.\"\nInternational Business Machines Corporation (NYSE: IBM), in an article published by ComputerWorld.com , is in the mobile payments industry when it unveiled a cross-border blockchain payments service with a Polynesian payments system provider designed to improve efficiency and reduce the cost of making global payments for business and consumers. The new payment network uses IBM's Blockchain Platform, a cloud service, to enable the electronic exchange of 12 different currencies across Pacific Islands as well as Australia, New Zealand and the United Kingdom. The new IBM-based service is designed to improve efficiency and reduce the cost of making global payments for business and consumers, and for Klickex and Stellar.org , developing nations\nGlobal Blockchain Technologies Corporation (TSX-V: BLOC.V) (OTC: BLKCF) announced last week that Overstock.com's blockchain subsidiary, 0.com , Inc. (\"tZero\") intends to provide advisory services in connection with the recently announced KodakOne Coin Security Token Offering. In addition, tZero will advise on secondary trading of the Kodak Coin. This is the first third party coin to be announced that tZero will be listing and trading on its much anticipated regulated ICO exchange. Utilizing blockchain technology, the KodakOne platform is an encrypted, digital ledger of rights ownership for photographers to register both new and archived work that they can then license within the platform. With the Kodak Coin, participating photographers are invited to take part in a new economy for photography, receive payment for licensing their work immediately upon sale, receive a share of overall platform revenue, and for both professional and amateur photographers, sell their work confidently on a secure blockchain platform.\nCisco Systems Inc. (NASDAQ: CSCO) is in the industry as the company released information last year it had co-founded the Trusted IoT Alliance, a consortium of 17 companies to help establish a protocol for a blockchain-based Internet of Things (IoT). The mission of this new alliance is to set the standard for an open source blockchain protocol in major industries worldwide. In retail, IoT simply describes the network of systems, sensors, wireless, software, and other technologies that enable digitization of the store. In practical terms, it's the network that you already have, but better connected to help you take the next step in growing your business. The alliance will also work to create a roadmap powered by the IoT ecosystem.\nDISCLAIMER: MarketNewsUpdates.com (MNU) is a third party publisher and news dissemination service provider, which disseminates electronic information through multiple online media channels. MNU is NOT affiliated in any manner with any company mentioned herein. MNU and its affiliated companies are a news dissemination solutions provider and are NOT a registered broker/dealer/analyst/adviser, holds no investment licenses and may NOT sell, offer to sell or offer to buy any security. MNU's market updates, news alerts and corporate profiles are NOT a solicitation or recommendation to buy, sell or hold securities. The material in this release is intended to be strictly informational and is NEVER to be construed or interpreted as research material. All readers are strongly urged to perform research and due diligence on their own and consult a licensed financial professional before considering any level of investing in stocks. All material included herein is republished content and details which were previously disseminated by the companies mentioned in this release. MNU is not liable for any investment decisions by its readers or subscribers. Investors are cautioned that they may lose all or a portion of their investment when investing in stocks. For current services performed MNU has been compensated forty four hundred dollars for news coverage of the current press release issued by Social Play USA, Inc. by a non affiliated third party. MNU HOLDS NO SHARES OF ANY COMPANY NAMED IN THIS RELEASE.\nThis release contains \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E the Securities Exchange Act of 1934, as amended and such forward-looking statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. \"Forward-looking statements\" describe future expectations, plans, results, or strategies and are generally preceded by words such as \"may\", \"future\", \"plan\" or \"planned\", \"will\" or \"should\", \"expected,\" \"anticipates\", \"draft\", \"eventually\" or \"projected\". You are cautioned that such statements are subject to a multitude of risks and uncertainties that could cause future circumstances, events, or results to differ materially from those projected in the forward-looking statements, including the risks that actual results may differ materially from those projected in the forward-looking statements as a result of various factors, and other risks identified in a company's annual report on Form 10-K or 10-KSB and other filings made by such company with the Securities and Exchange Commission. You should consider these factors in evaluating the forward-looking statements included herein, and not place undue reliance on such statements. The forward-looking statements in this release are made as of the date hereof and MNU undertakes no obligation to update such statements.\nContact Information:\nMedia Contact email:\ninfo@marketnewsupdates.com\n+1(561)325-8757\nSOURCE MarketNewsUpdates.com", "external_links": ["http://www.marketnewsupdates.com/news/sply.html", "https://www.computerworld.com/article/3233187/mobile-wireless/fintech-builds-on-blockchain-for-international-mobile-payments.html"], "published": "2018-01-23T16:50:00.000+02:00", "crawled": "2018-01-23T17:48:05.002+02:00", "highlightTitle": ""}