{"organizations": [], "uuid": "607a665dbdea693d9fc44dba90cd0ad83dcdec9e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/22/104960563-GettyImages-623036708.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/23/china-needs-to-push-ahead-with-urbanization-says-award-winning-writer-of-a-dystopian-beijing.html", "country": "US", "domain_rank": 767, "title": "China needs to push ahead with urbanization, says award-winning writer of a dystopian Beijing", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-01-23T07:03:00.000+02:00", "replies_count": 0, "uuid": "607a665dbdea693d9fc44dba90cd0ad83dcdec9e"}, "author": "Huileng Tan", "url": "https://www.cnbc.com/2018/01/23/china-needs-to-push-ahead-with-urbanization-says-award-winning-writer-of-a-dystopian-beijing.html", "ord_in_thread": 0, "title": "China needs to push ahead with urbanization, says award-winning writer of a dystopian Beijing", "locations": [], "entities": {"persons": [{"name": "hao jingfang", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing davos - world economic forum china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "beijing china", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "china development research foundation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Davos - World Economic Forum China needs to push ahead with urbanization, says award-winning writer of a dystopian Beijing China needs to push ahead with urbanization to close in on the yawning divide between the rich and the poor, said Hao Jingfang, an award-winning writer and economist at the China Development Research Foundation A recent World Economic Forum report said \"China still exhibits high levels of inequality\" 15 Hours Ago | 04:27 \nChina needs to push ahead with urbanization to close in on the yawning divide between the rich and the poor, an award-winning science fiction writer of a dystopian Beijing told CNBC. \nThe biggest factor in decreasing inequality in China so far has been the country's rapid urbanization, said Hao Jingfang, the writer of \"Folding Beijing.\" That is, as \"peasants and poor farmers\" move into cities, their incomes rise and their families benefit. \n\"That process is the main source of making people richer and helping the whole country get out of poverty,\" she said on the sidelines of the World Economic Forum (WEF) in Davos, Switzerland. \"So I think that urbanization of people has to be carried on in the future.\" \nHao's science fiction novelette about social inequality won a Hugo Award in 2016 — beating out an entry by horror maestro, Stephen King. \nIn Hao's vision of a dystopian Beijing, three social classes occupy different surfaces in the same city. They are separated and do not interact. Sunlight is rationed by social class. \nIn her day job, Hao is an economist at the state-backed China Development Research Foundation, which promotes economic development and social progress. \nLarge cities in China such as Beijing and Shanghai are hosts to massive populations of migrant workers from the countryside seeking economic opportunities. Cities have also benefited economically from the influx of the vast pool of cheap labor. \nHowever, a strict residency permit system known as \"hukou\" prevents migrant workers from accessing local public services such as education for their children, resulting in numerous social problems. \nHao acknowledged that a key issue in large cities is the demand for public services like education and health care, which she said she hopes the Chinese government can ramp up. \nAuthorities in Beijing have come under unusually direct criticism from a range of intellectuals and commentators recently for the eviction of migrants from their housing. \nAccording to the WEF Inclusive Development Index 2018 released on Monday, China ranks 26th among 74 emerging economies for a composite of a host of economic performance metrics. \n\"China still exhibits high levels of inequality,\" said the report.", "external_links": [], "published": "2018-01-23T07:03:00.000+02:00", "crawled": "2018-01-23T07:09:51.003+02:00", "highlightTitle": ""}