{"organizations": [], "uuid": "c937cfe504f74f481a739be4f5705da3060795d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/01/gettyimages-631813788.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/22/how-president-trump-will-play-at-davos/", "country": "US", "domain_rank": 1196, "title": "Davos World Economic Forum Ponders Trump, Income Inequality | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.132, "site_type": "news", "published": "2018-01-22T11:06:00.000+02:00", "replies_count": 0, "uuid": "c937cfe504f74f481a739be4f5705da3060795d1"}, "author": "Adam Lashinsky", "url": "http://fortune.com/2018/01/22/how-president-trump-will-play-at-davos/", "ord_in_thread": 0, "title": "Davos World Economic Forum Ponders Trump, Income Inequality | Fortune", "locations": [], "entities": {"persons": [{"name": "adam lashinsky", "sentiment": "negative"}, {"name": "bremmer", "sentiment": "none"}, {"name": "ian bremmer", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "eurasia group", "sentiment": "none"}, {"name": "world economic forum", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Adam Lashinsky 9:06 AM EST \nThis article first appeared in Data Sheet, Fortune’s daily newsletter on the top tech news. Sign up here . \nGood morning from Davos, Switzerland, where I’m attending the annual meeting of the World Economic Forum. It is a one-of-a-kind event, a mixture of unalloyed commerce, high-minded do-gooderism, and brass-tacks policy discussions, attended by corporate bigwigs, journalists, academics, non-governmental organizations, and top government officials. \nTo prepare for my trip last week I called Ian Bremmer, my favorite globalist and the head of his own political-analysis consultancy, the Eurasia Group. I asked Bremmer the three things Davos attendees either will or should be discussing this week. His take: \n* The global economy. Leading plutocrats will be pinching themselves on how well things are going a decade after the financial crisis, says Bremmer. “If you are in the top .001% you’re just minting it,” he says. “This is a happy group.” Risks abound, including the sustainability of the expansion and the durability of low interest rates. But by and large the well-heeled attendees have every reason to feel quite good this year. \n* The big geopolitical underside. Bremmer says major keynote speeches by India’s Modi, France’s Macron, and Germany’s Merkel are likely to avoid the topic. But in hushed conversations leading globalists will express their concern about the “undermining of the old political system.” Which leads to the topic certain to dominate every other in Davos … \n* Donald Trump. Bremmer calls the U.S. president’s entourage “the big circus,” much as the jumbo-jet of Chinese officials and executives traveling with Xi Jinping dominated last year’s event. Trump is as unlikely a Davosian as Xi was. “His relationship with the WEF globally is kind of like with The New York Times in the U.S.,” says Bremmer. “He craves their praise but will antagonize them all the same.” Bremmer reckons that if Trump’s approval is nearly 40% in his own country it is closer to 5% among attendees in Davos. He predicts fireworks. “There will be missteps. His ability to do damage to himself on the global stage is pretty high.” And just as Trump’s tweets are simultaneously artifice and impactful, Bremmer predicts Trump’s appearance in Davos holds the potential for real harm. “What he says doesn’t matter in the sense that it’s not policy,” says Bremmer. “But what he says matters in that he’s the antithesis of leading by example. He gives other world leaders more reason to move away from the U.S.” \nBremmer is tough to contain to just three thoughts, and as we kept talking he raised two other topics for the week, both involving China. The beleaguered top honchos of the U.S. tech giants undoubtedly will be scrambling to figure out how to minimize the ongoing public-policy and public-opinion backlash against them. But Bremmer thinks they also will be huddling on what to do about their lack of access to the China market. \nChina itself, predicts Bremmer, will be the silent elephant in the room in Davos. Last year Xi made a splash on the eve of Trump’s inauguration. Bremmer thinks Xi doesn’t have much use for the WEF anymore. “He’s building alternative infrastructures,” says Bremmer, of Xi, noting that the Chinese leader’s “One Belt, One Road” initiative will spend seven times what the Marshall Plan spent. And if the Chinese can opt out of the Davos discussion, as Bremmer predicts, “that means we don’t live in a global market anymore.” \nAnd that will eventually make the Davos party less festive. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-22T11:06:00.000+02:00", "crawled": "2018-01-22T17:45:22.011+02:00", "highlightTitle": ""}