{"organizations": [], "uuid": "fa9441a9fe9d82e6101c99008956ef60554de33e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/20/104909990-GettyImages-896192504.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/tax-cuts-good-for-short-term-profits-but-long-term-not-so-rosy.html", "country": "US", "domain_rank": 767, "title": "Tax cuts good for short-term profits, but long term not so rosy", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.185, "site_type": "news", "published": "2018-01-04T21:26:00.000+02:00", "replies_count": 0, "uuid": "fa9441a9fe9d82e6101c99008956ef60554de33e"}, "author": "Ron Insana", "url": "https://www.cnbc.com/2018/01/04/tax-cuts-good-for-short-term-profits-but-long-term-not-so-rosy.html", "ord_in_thread": 0, "title": "Tax cuts good for short-term profits, but long term not so rosy", "locations": [], "entities": {"persons": [{"name": "saul loeb", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}], "locations": [{"name": "south lawn of the white house", "sentiment": "none"}, {"name": "washington, dc", "sentiment": "none"}], "organizations": [{"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SHARES Saul Loeb | AFP | Getty Images President Donald Trump speaks about the passage of tax reform legislation on the South Lawn of the White House in Washington, DC, December 20, 2017. \nFor obvious reasons, Wall Street has been very excited about the tax reform package that was signed into law in the final days of 2017. \nWhile the White House and Congressional Republicans have touted it as a major force in helping companies to grow, the economy to expand and job creation to accelerate, one has to wonder if the impact might be much more limited. \nWhile I am less convinced that, after final revisions, the tax plan will be a drag on growth, given its relatively modest impact on individual incomes, what occurred to me this morning is that there could be a real issue for corporations that analysts have not yet admitted to themselves. \nThe true benefit to corporations from the large reduction in both the stated and effective tax rates is to boost profitability, to be sure. \nThat does not, however, mean that corporate profits will enjoy additional organic growth. It simply means that profit margins will expand, and after-tax profits will be larger. \nSome could complain that this is mere semantics. But it is not. For tax reform to deliver excess growth that drives pre-tax profits higher, GDP would have to accelerate meaningfully, driving revenue higher, as well. \nMost Wall Street analysts look at a company's pre-tax profits, and/or cash flow, to determine a firm's organic rate of growth. \nIt is altogether possible, though somewhat unlikely, that corporate revenue and profits could be flat in 2018 relative to 2017, but lower effective tax rates would still boost the bottom line and expand corporate profit margins without the benefit of organic growth. \nOf course, the global and domestic economies appear to be accelerating in 2018, raising the chances that corporations will benefit from both stronger growth and lower tax rates, factors now being priced into what would be otherwise richly valued stocks. \nIn addition, the year-long decline in the value of the U.S. dollar, which suffered its worst performance in a decade last year, will boost the profitability of U.S.-based multinational corporations by making their exports more attractive in overseas markets. That's another plus for stocks, broadly speaking. \nTogether, those factors would explain the increasingly rapid pace of stock price appreciation and record closing highs for the major stock market averages. The Dow Jones industrial average notched 71 closing highs in 2017, the most ever. It also had 12 consecutive months of gains — the longest unbroken streak of appreciation on record. \nAnalysts have dramatically raised their earnings estimates for 2018, thanks to all those developments. \nHowever, there will be limited benefits to the reduction in tax rates when it comes to apples-to-apples earnings comparisons in 2019. \nIf corporate profitability surges in 2018, it might be much harder to post year-over-year gains in profits a year from now. Certainly that's not something to worry about immediately, but as the second half of 2018 approaches, the market will begin to look ahead to the following year's prospects. \nThis is where the trouble could start. \nIf the economy continues to heat up, profits peak and the Federal Reserve raises interest rates more rapidly than expected as growth accelerates, the calculus begins to change markedly for the market. \nI was mistakenly far too cautious about stocks beginning in March of 2017. I was concerned about the multiplicity of economic, political and geopolitical risks. \nAnd while those issues remain, the real problems ahead for the stock market may be far more prosaic. \nIt could be that there's a more traditional end to a near-record business cycle expansion as the economy overheats and is cooled by a Fed finally having to react to rapid growth and rising inflation. \nHence, this early year strength in stocks may be more of a \"blow-off top\" than a continuation of the trend. \nWe are, at the very least, due for a correction. There are budding signs of speculative excesses in the markets, at home and abroad. \nBut my growing concern is that tax reform offers only a one-time lift to stocks and it may all be discounted by the stock market before this month is over. \nOf course, I could be wrong. But the concern about a one-off upward adjustment to corporate profits merits some serious consideration as investors adjust their portfolios to yet another \"new normal.\"", "external_links": [], "published": "2018-01-04T21:26:00.000+02:00", "crawled": "2018-01-04T21:26:43.016+02:00", "highlightTitle": ""}