{"organizations": [], "uuid": "69849a930e7f8a5a6b244c2531c36f01ccd653f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220169083&w=1200&r=LYNXMPEE0708A", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews/", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-philippines-politics/philippines-vp-derides-self-serving-idea-to-cancel-polls-extend-terms-idUKKBN1EX09X", "country": "US", "domain_rank": 408, "title": "Philippines VP derides 'self-serving' idea to cancel polls, extend terms", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T06:46:00.000+02:00", "replies_count": 0, "uuid": "69849a930e7f8a5a6b244c2531c36f01ccd653f0"}, "author": "", "url": "https://uk.reuters.com/article/uk-philippines-politics/philippines-vp-derides-self-serving-idea-to-cancel-polls-extend-terms-idUKKBN1EX09X", "ord_in_thread": 0, "title": "Philippines VP derides 'self-serving' idea to cancel polls, extend terms", "locations": [], "entities": {"persons": [{"name": "duterte", "sentiment": "none"}, {"name": "pantaleon alvarez", "sentiment": "none"}, {"name": "leni robredo", "sentiment": "none"}, {"name": "enrico dela cruz", "sentiment": "none"}, {"name": "rodrigo duterte", "sentiment": "none"}], "locations": [{"name": "philippines", "sentiment": "none"}, {"name": "quezon city reception house", "sentiment": "none"}, {"name": "metro manila", "sentiment": "none"}, {"name": "manila", "sentiment": "none"}], "organizations": [{"name": "house", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 4:48 AM / Updated an hour ago Philippines VP derides 'self-serving' idea to cancel polls, extend terms Enrico Dela Cruz 3 Min Read \nMANILA (Reuters) - The Philippines’ vice president has joined a chorus of opposition to a possible cancellation of mid-term elections and extensions to terms in office, including that of the president, amid a renewed push for a shift to federalism. Philippines' Vice President Leni Robredo speaks during a Reuters interview, at the Quezon City Reception House, Metro Manila, Philippines December 12, 2016. REUTERS/Ezra Acayan \nPresident Rodrigo Duterte is keen to follow through on his election campaign promise to introduce federalism, saying it would be more equitable for Filipinos and would bring peace and development, especially in the country’s restive south. \nHouse Speaker and Duterte ally Pantaleon Alvarez has said it was possible May 2019 mid-term elections would be cancelled if proposed constitutional amendments, to introduce federalism, pass a plebiscite this year. \nBut the no-election scenario has not sat well among Duterte’s critics, who also expressed concern that changing the constitution could see him prolong his stay in power beyond the end of his term in 2022. Philippine presidents are allowed to serve one term only, lasting six years. \nVice President Leni Robredo, who was not Duterte’s running mate, comes from an opposition party and has clashed with him on numerous occasions, said it was “self-serving” if moves were made to extend terms of incumbent executives. \n“We are very much against this no-election proposal because holding elections sums up democracy,” she said during her weekly radio programme on Sunday. \n“This is the only way for ordinary Filipinos to participate in the process of choosing who should lead them.” \nFilipinos are due to elect 12 senators, about 300 congressmen and thousands of local government officials in next year’s elections. \nSpeaker Alvarez said the house planned to convene as a constituent assembly early this year to tackle constitutional amendments, including the shift to federalism. \nPresidential spokesman Harry Roque said Duterte has no intention to prolong his stay in power and is even willing to cut short his term. \n“He’s willing to let go because he’s not keen really on staying (longer) as president. That’s the truth,” Roque told CNN Philippines on Monday. \nBut lawyer Christian Monsod, one of those who helped design the 1987 Constitution, questioned motives of the pro-Duterte camp in Congress. \n“Is it really necessary to change the constitution?,” he told news channel ANC. \n“My bet is it would be amended, revised to suit the interests of the clans and dynasties in Congress.” Editing by Martin Petty and Michael Perry", "external_links": [], "published": "2018-01-08T06:46:00.000+02:00", "crawled": "2018-01-08T08:02:14.002+02:00", "highlightTitle": ""}