{"organizations": [], "uuid": "58d8bf552b58e9dd090ecfed62d712d35680d76e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/cb-outlook/update-1-qatars-commercial-bank-seeks-to-benefit-from-qatars-turkish-ties-idUSL8N1PQ3DE", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Qatar's Commercial Bank seeks to benefit from Qatar's Turkish ties", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T14:39:00.000+02:00", "replies_count": 0, "uuid": "58d8bf552b58e9dd090ecfed62d712d35680d76e"}, "author": "", "url": "https://www.reuters.com/article/cb-outlook/update-1-qatars-commercial-bank-seeks-to-benefit-from-qatars-turkish-ties-idUSL8N1PQ3DE", "ord_in_thread": 0, "title": "UPDATE 1-Qatar's Commercial Bank seeks to benefit from Qatar's Turkish ties", "locations": [], "entities": {"persons": [{"name": "hadeel al sayegh", "sentiment": "none"}, {"name": "joseph abraham", "sentiment": "none"}], "locations": [{"name": "qatar", "sentiment": "none"}, {"name": "saudi arabia", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "egypt", "sentiment": "none"}, {"name": "ankara", "sentiment": "none"}, {"name": "united arab emirates", "sentiment": "none"}, {"name": "bahrain", "sentiment": "none"}], "organizations": [{"name": "commercial bank", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "alternatifbank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 12:39 PM / in 37 minutes UPDATE 1-Qatar's Commercial Bank seeks to benefit from Qatar's Turkish ties Reuters Staff \n(Adds quote, detail, context) \nBy Hadeel Al Sayegh \nDOHA, Jan 31 (Reuters) - Commercial Bank, Qatar’s third largest bank by assets, is deploying more capital and focusing more on Turkey to benefit from closer political ties, its chief executive said. \nAnkara has emerged as a strong ally as Qatar faces off against Saudi Arabia, United Arab Emirates, Bahrain and Egypt in a regional diplomatic and commercial rift. \nAnd Qatari lenders have sought to diversify funding sources since June when the four Arab countries boycotted Qatar, alleging it finances terrorism, something it denies. \n“The very close political and economic relationship between Qatar and Turkey will be beneficial for us,” Joseph Abraham told reporters, adding that the bank was adding more capital and focus in the market as part of a new strategic plan for Turkey. \nCommercial Bank had brought in a new management team and two new board directors to Alternatifbank, its 100 percent-owned Turkish subsidiary, in a bid to raise profitability, he said. \nLoan growth at Commercial Bank would be around 7 to 9 percent in 2018, in line with the market, Abraham added. \nThat is down from loan growth of 14.6 percent in 2017 and matches that of Qatar National Bank (QNB), the Gulf state’s largest bank, reflecting the expectations of analysts that a drop in state spending on new projects should weaken loan growth in 2018. \nStrong spending by the government on projects and an injection of public sector deposits has helped Qatari banks to weather the impact of the crisis. QNB estimates around $177.4 billion of projects will be delivered across oil and gas, transport and construction - including the soccer World Cup in 2022 - between 2018 and 2028. \nCommercial Bank aimed to deepen its lending to the government and public sector in 2018, at the same time as continuing to exit from exposure to sectors and borrowers it deemed higher risk, he said. \nThe small size of the Qatar market has pushed some of the state’s lenders to seek overseas expansion. \nCommercial Bank, which also owns a stake in an Omani bank, on Monday agreed to extend by another 30 days an exclusivity agreement to sell its 40 percent stake in United Arab Emirates-based United Arab Bank to UAE’s Tabarak Investment. \nProceeds from the exit, which is not a forced sale, would be re-invested in Qatar and Turkey, he said. \nCommercial Bank was planning a “Formosa” bond issue and also considering potential deals in Swiss Francs and Australian dollars. The bank expects to pay 15 and 20 basis points more on future debt issuance than before the boycott, he added. (Writing by Tom Arnold; editing by Alexander Smith)", "external_links": [], "published": "2018-01-31T14:39:00.000+02:00", "crawled": "2018-01-31T15:30:11.024+02:00", "highlightTitle": ""}