{"organizations": [], "uuid": "4b9f186bb90a083e6724e5c109fd9eadd2ca6a66", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-spain-mad-carvajal/real-caught-in-a-storm-after-villarreal-defeat-idUKKBN1F20VQ", "country": "US", "domain_rank": 408, "title": "Real caught in a storm after Villarreal defeat", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-13T22:10:00.000+02:00", "replies_count": 0, "uuid": "4b9f186bb90a083e6724e5c109fd9eadd2ca6a66"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-spain-mad-carvajal/real-caught-in-a-storm-after-villarreal-defeat-idUKKBN1F20VQ", "ord_in_thread": 0, "title": "Real caught in a storm after Villarreal defeat", "locations": [], "entities": {"persons": [{"name": "villarreal", "sentiment": "neutral"}, {"name": "dani carvajal", "sentiment": "none"}, {"name": "pablo fornals", "sentiment": "none"}, {"name": "carvajal", "sentiment": "none"}, {"name": "cristiano ronaldo", "sentiment": "none"}], "locations": [{"name": "santiago bernabeu", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}], "organizations": [{"name": "la liga", "sentiment": "none"}, {"name": "real madrid", "sentiment": "none"}, {"name": "barcelona", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 13, 2018 / 8:12 PM / Updated 16 minutes ago Real caught in a storm after Villarreal defeat Reuters Staff 3 Min Read \nMADRID (Reuters) - Real Madrid defender Dani Carvajal said his side were in the eye of a tornado after succumbing to a second successive home defeat in the La Liga by losing 1-0 to Villarreal on Saturday, but he was at a loss to explain his side’s predicament. \nReal had nearly triple the amount of shots on goal as Villarreal and also had Cristiano Ronaldo hit the woodwork twice at a rainswept Santiago Bernabeu, but Pablo Fornals’s 87th minute strike inflicted a third home defeat on the floundering champions this season. \n“This wasn’t about a lack of focus, the ball just didn’t want to go in,” Carvajal told reporters. \n“The result doesn’t reflect what happened in the 90 minutes as we played a complete first half and could have been several goals up. Tiredness caught up with us in the second half but we still had more chances than them.” \nReal are fourth in the Liga standings and only one point ahead of Villarreal, while runaway leaders Barcelona could stride a remarkable 19 points clear of Zinedine Zidane’s side if they beat Real Sociedad on Sunday. \n“This is very difficult for us, it seems like everything is bad at the moment and we are in the middle of a tornado, but I think deep inside we are strong and we believe in each other, but anyone who doesn’t should get off the boat,” Carvajal added. \nLast season Real became the first team since 1991 to successfully defend the Champions League and also swept to the Liga title but they appear to have paid the price for not freshening up their squad and failing to replace departing forwards James Rodriguez and Alvaro Morata. \nReal scored in 73 consecutive games across 16 months between April 24, 2016 and Sept. 20, 2017 but they have drawn a blank in five games this season, while Saturday’s defeat marked the first time since 2000 they had lost back-to-back home games in the league in which they had also failed to score. \n“It’s very difficult to explain what is going on, everyone in the dressing room feels awful, but this is football, the team that scores more goals wins and today that was Villarreal,” Carvajal said. \n“We seem fine physically and we are still training hard, we don’t know what has happened. There’s no problem with our attitude, we are practically the same squad and have the same desire, but we’re just not getting the results.” Reporting by Richard Martin; Editing by Christian Radnedge", "external_links": [], "published": "2018-01-13T22:10:00.000+02:00", "crawled": "2018-01-13T22:33:36.000+02:00", "highlightTitle": ""}