{"organizations": [], "uuid": "84825cb5a71a18a28ebecbc420ad279e8fd52583", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/INhealth\r", "section_title": "Reuters: Health", "url": "https://in.reuters.com/article/us-cherokee-opioids/judge-deals-setback-to-cherokee-nation-lawsuit-over-opioids-idINKBN1EZ2J6", "country": "US", "domain_rank": 408, "title": "Judge deals setback to Cherokee Nation lawsuit over opioids", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T21:03:00.000+02:00", "replies_count": 0, "uuid": "84825cb5a71a18a28ebecbc420ad279e8fd52583"}, "author": "", "url": "https://in.reuters.com/article/us-cherokee-opioids/judge-deals-setback-to-cherokee-nation-lawsuit-over-opioids-idINKBN1EZ2J6", "ord_in_thread": 0, "title": "Judge deals setback to Cherokee Nation lawsuit over opioids", "locations": [], "entities": {"persons": [{"name": "kern", "sentiment": "none"}, {"name": "lenzy krehbiel-burton", "sentiment": "none"}, {"name": "terence kern", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "okla.", "sentiment": "none"}, {"name": "oklahoma", "sentiment": "none"}, {"name": "tulsa", "sentiment": "none"}], "organizations": [{"name": "cherokee nation", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TULSA, Okla. (Reuters) - A federal judge in Oklahoma has dealt a blow to a Cherokee Nation lawsuit seeking to stop the flow of addictive opioid painkillers in its territory by issuing a preliminary injunction to prevent the case from being heard in tribal court.\nIn a decision late Tuesday, U.S. District Judge Terence Kern ruled the tribal court lacked jurisdiction because the lawsuit involving six wholesale drug distributors and pharmacy operators does not directly concern tribal self-government.\n“While noting Defendants’ (Cherokee Nation‘s) evidence of the harm opioid abuse has caused to individual tribal members and families, and costs borne by the tribe, the Court cannot plausibly find that such harm is ‘catastrophic for tribal self-government’,” Kern said.\nThe Cherokee Nation in April 2017 became the first major Native American tribe to seek redress in tribal court from wholesale drug distributors and pharmacy operators.\nThe tribe said the highly addictive painkillers were saturating its territory and contributing to violence, delinquency and mortality. It argued in its lawsuit that the defendants had turned a blind eye to problems in their supply chains by failing to protect opioids from theft or refusing to fulfill suspicious orders by pharmacies, doctors and patients.\nThe suit came as several states, local governments and tribes have sued drug makers and distributors over a drug crisis declared a national public health emergency by U.S. President Donald Trump.\nWholesale drug distributors and pharmacy operators McKesson Corp, Cardinal Health Inc, AmerisourceBergen, CVS Health, Walgreens Boots Alliance Inc and Wal-Mart Stores Inc responded with a lawsuit in federal court in Tulsa in June 2017, saying the tribe lacked jurisdiction.\nThe companies said the lawsuit attempted to civilly enforce a federal statute, the Controlled Substances Act, under the guise of the tribe’s statutory and common law.\nIn a statement on Wednesday, Cherokee Nation Attorney General Todd Hembree said, “We continue to believe in our case, and we are prepared to fight to hold these companies accountable in state court.”\nThe sovereign Cherokee Nation is the largest tribal nation in the United States with 335,000 citizens, according to the tribe’s court filing.\nThe lawsuit said that from 2003 to 2014, more than 350 opioid-related deaths occurred within the Cherokee Nation, which comprises 14 counties in northeast Oklahoma.\nThe case is McKesson Corporation, et al, v. Hembree, et al, U.S. District Court, Northern District of Oklahoma, No. 17-cv-323.\nReporting by Lenzy Krehbiel-Burton; additional reporting by Nate Raymond in Boston, writing by Jon Herskovitz; editing by Colleen Jenkins and Marguerita Choy\n ", "external_links": [], "published": "2018-01-10T21:03:00.000+02:00", "crawled": "2018-01-10T21:34:29.040+02:00", "highlightTitle": ""}