{"organizations": [], "uuid": "2b0726293a82cf1fe1b253d0c1b0b306de71f363", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/05/104930723-GettyImages-883439420.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/05/how-saying-no-helps-solange-knowles-reach-her-career-goals.html", "country": "US", "domain_rank": 767, "title": "How saying 'no' helps Solange Knowles reach her career goals", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-05T21:02:00.000+02:00", "replies_count": 0, "uuid": "2b0726293a82cf1fe1b253d0c1b0b306de71f363"}, "author": "Zameena Mejia", "url": "https://www.cnbc.com/2018/01/05/how-saying-no-helps-solange-knowles-reach-her-career-goals.html", "ord_in_thread": 0, "title": "How saying 'no' helps Solange Knowles reach her career goals", "locations": [], "entities": {"persons": [{"name": "solange knowles", "sentiment": "negative"}, {"name": "michael kovac", "sentiment": "negative"}, {"name": "knowles", "sentiment": "none"}, {"name": "solange", "sentiment": "none"}, {"name": "susan sobbott", "sentiment": "none"}, {"name": "virgil abloh", "sentiment": "none"}], "locations": [], "organizations": [{"name": "american express", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "American singer and songwriter Solange Knowles spent much of 2017 celebrating the success of her album \"A Seat at the Table,\" which led to her first Grammy Award and distinction as a 2017 Glamour Magazine \"Woman of the Year.\"\nKnowles, 31, recently revealed what enabled her to reach this latest career accomplishment: her ability to say \"no\" to opportunities that don't fit her long-term goals.\n\"I think we live in such an immediate gratification society, such that for me, it's about really about envisioning where I'd like to be in five and 10 years,\" Knowles said during an American Express OPEN Success Makers panel discussion with American Express executive Susan Sobbott and renowned creative designer and DJ Virgil Abloh.\nWhat an honor to be named #womenoftheyear by @glamourmag ✨I also want to thank Glamour, Ana, and Petra for capturing and selecting an image of who I am, and want to be in this moment. \nA post shared by Solange (@saintrecords) on Oct 30, 2017 at 10:16am PDT \n\"It ain't easy. I have to say 'no' to so much. But in the line of strategy where I'd like to challenge myself within five years, within 10 years, it's just what I've had to do,\" Knowles said.\nThe artist added that she felt excited about closing out 2017 because she had accomplished eight out of 10 goals from a list she put together.\nAnother simple trick Knowles follows to meet her goals is one billionaire Richard Branson also follows to meet his New Year's resolutions: writing them down .\n\"I think it's pretty cheesy and simple, but just writing out your goals [helps], having them in a tangible way so you can look back and say, 'How can I make the ones that didn't cross the line or dot the I's work for me next year?'\" Knowles said.\nshow chapters The smart strategies Jay-Z’s built a massive business with      11:41 AM ET Fri, 30 June 2017 | 01:22 But it was ultimately thanks to turning down even the best opportunities that came her way, \"no matter how good they feel or if they're going to enable me to financially invest back into my art or back into community building,\" she said, that Knowles stayed on track with her plans.\n\"When the record came out, I had these opportunities,\" Knowles said. \"It was so exciting and I was like, 'Wow, I've been working for this moment' and then I thought, 'Wait this doesn't actually line up with what I'm saying that I want to do and represent in five years.'\"\nKnowles shared one example of being offered to star on the cover of one of her favorite magazines in the world (she did not mention the title). Although the cover story would allow her to reach people who might not know about her work, she decided to only take up the opportunity if it provided her the agency over how her body, her work and her voice were represented.\n\"It comes down to the line of, 'Yes, it's a great opportunity,' but how is it working for me? How is it working against me?\" Knowles said.\nBy staying true to her own mission and values, Knowles has unlocked a way to stick to her goals.\n\"So, it's not always easy, but for me at this point, it's not even about the opportunity. It's about what I'm able to do with the opportunity,\" she said.\nLike this story? Like CNBC Make It on Facebook . \nDon't miss:\n3 warning signs you're miserable at work, according to a happiness expert \nBillionaire Richard Branson: Here's the secret to sticking to your New Year's resolutions \nshow chapters Simone Biles reveals her personal pep talk before competing      12:32 PM ET Tue, 22 Nov 2016 | 00:50", "external_links": [], "published": "2018-01-05T21:02:00.000+02:00", "crawled": "2018-01-05T21:11:58.017+02:00", "highlightTitle": ""}