{"organizations": [], "uuid": "4f6abbae6e346c2f4ed634b5fff8c1b6ca6b47f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180120&t=2&i=1223672161&w=1200&r=LYNXMPEE0J0PG", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-spain/atletico-title-hopes-hit-by-girona-montella-earns-sevilla-win-idUKKBN1F90Z4", "country": "US", "domain_rank": 408, "title": "Atletico title hopes hit by Girona, Montella earns Sevilla win", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T20:16:00.000+02:00", "replies_count": 0, "uuid": "4f6abbae6e346c2f4ed634b5fff8c1b6ca6b47f8"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-spain/atletico-title-hopes-hit-by-girona-montella-earns-sevilla-win-idUKKBN1F90Z4", "ord_in_thread": 0, "title": "Atletico title hopes hit by Girona, Montella earns Sevilla win", "locations": [], "entities": {"persons": [{"name": "richar", "sentiment": "negative"}, {"name": "montella", "sentiment": "negative"}, {"name": "jan oblak", "sentiment": "none"}, {"name": "liga", "sentiment": "none"}, {"name": "oblak", "sentiment": "none"}, {"name": "diego simeone", "sentiment": "none"}, {"name": "michael olunga", "sentiment": "none"}, {"name": "martin", "sentiment": "none"}, {"name": "bernardo espinoza", "sentiment": "none"}, {"name": "antoine griezmann", "sentiment": "none"}, {"name": "koke", "sentiment": "none"}, {"name": "portu", "sentiment": "none"}], "locations": [{"name": "girona", "sentiment": "none"}], "organizations": [{"name": "atletico", "sentiment": "negative"}, {"name": "sevilla", "sentiment": "negative"}, {"name": "catalans", "sentiment": "none"}, {"name": "liga", "sentiment": "none"}, {"name": "barcelona", "sentiment": "none"}, {"name": "diego costa", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  barcelona", "sentiment": "none"}, {"name": "atletico madrid", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 20, 2018 / 6:19 PM / Updated 25 minutes ago Atletico title hopes hit by Girona, Montella earns Sevilla win Richard Martin 3 Min Read \nBARCELONA (Reuters) - Atletico Madrid’s faint hopes of chasing down runaway Liga leaders Barcelona suffered a fresh blow on Saturday as they were held to a 1-1 draw at home to Girona, meaning they could fall 11 points behind the Catalans by the end of the weekend. \nAntoine Griezmann capitalised on a cushioned Diego Costa header to volley Atletico ahead in the 34th minute and score for the first time in five league games, but Liga debutants Girona have caused problems for the top teams all season and hit back. \nVisiting striker Portu slid in to beat goalkeeper Jan Oblak in the 73rd minute after Atletico midfielder Koke failed to properly clear the danger in the area and the ball landed at the feet of Bernardo Espinoza who played the ball through. \nAtletico were fortunate not to have Oblak sent off late on when the Slovenian rushed out of his area and brought down Kenyan forward Michael Olunga but was only shown a yellow card. \nDiego Simeone’s second-placed side have 43 points from 20 games but Barca can stretch their advantage if they win at Real Betis on Sunday, while third-placed Valencia could move level with Atletico if they beat Las Palmas away later on Saturday. \nSevilla coach Vincenzo Montella earned his first win in La Liga at the third attempt earlier on Saturday as his impressive side secured a 3-0 win at Espanyol to go fifth in the standings. Soccer Football - La Liga Santander - Atletico Madrid vs Girona - Wanda Metropolitano, Madrid, Spain - January 20, 2018 Atletico Madrid's Diego Costa sets up Antoine Griezmann to score their first goal REUTERS/Sergio Perez \nFranco Vazquez knocked in a loose ball on the rebound after a well crafted move to put Sevilla in front in the 15th minute, the first time they had taken the lead in a Liga game under the Italian coach, who succeeded Eduardo Berizzo in December. \nPablo Sarabia added another before halftime and Luis Muriel rounded off the victory with a late third. Soccer Football - La Liga Santander - Atletico Madrid vs Girona - Wanda Metropolitano, Madrid, Spain - January 20, 2018 Girona's Portu celebrates scoring their first goal REUTERS/Sergio Perez \nSevilla lost to Real Betis and Alaves in their first two Liga games under Montella but were lifted by a late fightback that saw them beat Atletico Madrid 2-1 in their King’s Cup quarter-final first leg on Wednesday. \nOn Saturday, Montella’s side doubled their advantage against Espanyol in the 34th minute with a scorching run through the defence and a top corner finish by midfielder Sarabia. \nEspanyol, who defeated city rivals Barcelona 1-0 in their King’s Cup first leg in midweek, improved after the interval and should have pulled a goal back when Leo Baptistao received the ball unmarked from close range but sent it flying over the bar. \nSevilla’s Colombia forward Muriel netted the third goal in the 90th minute with an impressive run past three defenders in the box and a powerful finish. \nSevilla, who face Manchester United in the last 16 of the Champions League, now have 32 points although Villarreal could climb back above them when they host Levante later on Saturday. Reporting by Richard Martin; Editing by Ken Ferris", "external_links": [], "published": "2018-01-20T20:16:00.000+02:00", "crawled": "2018-01-20T20:31:57.001+02:00", "highlightTitle": ""}