{"organizations": [], "uuid": "761c037b2e3ad569ac4a9c4105da27687531d884", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/01/104922865-2017-12-22T163305Z_1251005168_HP1EDCM19Z480_RTRMADP_3_USA-TAX.1910x1000.JPG", "site_section": "https://www.cnbc.com/id/15837362/device/rss/rss.html", "section_title": "U.S. News", "url": "https://www.cnbc.com/2018/01/01/new-york-times-digital-democrats-in-high-tax-states-plot-to-blunt-impact-of-new-tax-law.html", "country": "US", "domain_rank": 767, "title": "Democrats in high-tax states plot to blunt impact of new tax law", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.011, "site_type": "news", "published": "2018-01-01T14:03:00.000+02:00", "replies_count": 0, "uuid": "761c037b2e3ad569ac4a9c4105da27687531d884"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/01/new-york-times-digital-democrats-in-high-tax-states-plot-to-blunt-impact-of-new-tax-law.html", "ord_in_thread": 0, "title": "Democrats in high-tax states plot to blunt impact of new tax law", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "google", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Democrats in high-cost, high-tax states are plotting ways to do what their states’ representatives in Congress could not: blunt the impact of the newly passed Republican tax overhaul.\nGovernors and legislative leaders in New York, California and other states are considering legal challenges to elements of the law that they say unfairly single out parts of the country. They are looking at ways of raising revenue that aren’t penalized by the new law. And they are considering changing their state tax codes to allow residents to take advantage of other federal tax breaks — in effect, restoring deductions that the tax law scaled back.\nOne proposal would replace state income taxes, which are no longer fully deductible under the new law, with payroll taxes on employers, which are deductible. Another idea would be to allow residents to replace their state income tax payments with tax-deductible charitable contributions to their state governments.\nRead more from The New York Times:\nTax law offers a carrot to gig workers—but it may have costs\nHow do you vote? 50 million Google images give a clue\nWith Cuomo assist, homeowners rush to soften tax bill's impact\nSuch ideas may sound far-fetched. And until recently, they were mostly the province of tax professors and bloggers. But they are now getting serious consideration in state capitols where some lawmakers see the Republican law as a thinly veiled assault on parts of the country that typically vote for Democrats.\nCompanies, of course, have long sought to exploit loopholes in the tax code. Governments, as a rule, have not. State leaders, however, said Congress, in singling out certain states, had broken an implicit compact with the states.\n“The game has changed,” said Stephen M. Sweeney, the Democratic president of New Jersey’s Senate. “They’ve completely turned the tables against us.”\nIn particular, officials in the high-tax states object to the law’s $10,000 cap on state and local tax deductions, which were previously unlimited. That provision will be particularly painful for residents of states like New York, New Jersey, California and Connecticut, which have high housing costs and high tax rates.\nEven in those states, most residents will get a temporary tax cut because of other provisions of the law, including lower tax rates and an increase in the standard deduction. But the cap on the state and local tax deduction could pose a serious threat to state budgets, because it makes state taxes more expensive for residents. That could make it harder for states to raise taxes, particularly on wealthy residents, and could increase pressure to cut spending.\nThe law could also have broader economic consequences . Business leaders, for example, have said they worry about attracting workers if New York and other cities become even more expensive than lower-tax areas.\nState leaders are still figuring out their response to the new law, and few have yet endorsed specific proposals. But they are moving quickly. Gov. Andrew M. Cuomo of New York, a Democrat, recently said he expected to provide a more detailed plan when he presented his state budget in mid-January.\n“They want to target us for certain provisions?” Mr. Cuomo asked at a recent news conference. “Well, let’s see if we can redesign our tax code to get out of the federal trap that they set.”\nMr. Cuomo fired one of the first shots when he signed an executive order that let New Yorkers prepay their 2018 property taxes in 2017, before the new deduction cap takes effect. Several other state and local governments followed suit.\nBut in an indication of the hard road ahead for Democrats, the Internal Revenue Service issued guidance on Wednesday limiting the prepayment option . And the option was only a temporary reprieve — at best, homeowners could delay the impact by a single year.\nU.S. President Donald Trump sits at his desk while signing the $1.5 trillion tax overhaul plan in the Oval Office of the White House in Washington, U.S., Dec. 22, 2017. State leaders are looking for longer-term solutions. Some have raised the possibility of shifting away from taxes on individuals toward taxes on corporations, which are still fully deductible under federal law. But that could cause its own problems: Raising taxes on businesses could make it harder for those states to compete for companies and jobs.\nOther lawmakers have floated the idea of seeking out new sources of revenue, perhaps by legalizing — and taxing — marijuana.\nSome proposals are more complex. Kirk Stark, a law professor at the University of California, Los Angeles, has suggested that states encourage residents to donate money to their state governments, then let the governments credit those donations against their state income taxes. Such donations would qualify as charitable donations, which are still fully deductible on federal taxes.\nMr. Stark noted that such programs already existed, albeit in a much more limited form. Several states let residents count donations to private schools as state tax payments under certain circumstances, an initiative that conservatives have promoted as a step toward school vouchers.\nAnother idea would be for states to partly or completely replace their income taxes with payroll taxes paid by employers, similar to existing taxes for Social Security and unemployment insurance.\nIn theory, such a move wouldn’t change after-tax income for either companies or individuals. It would just change where the tax checks were coming from. Companies would reduce workers’ pay by the amount of the payroll tax, and would be able to deduct the payments on their federal taxes. Because they would never receive the money, workers wouldn’t be taxed on it.\n“In effect, it preserves the state income tax deduction,” said Dean Baker, a liberal economist who has been pushing for the plan.\nBoth ideas — and others like them — would face logistical hurdles, legal challenges and, most likely, opposition from Congress and the federal government. But they are nonetheless rapidly moving from the realm of academic theory into actual policymaking.\nKevin de León, a Democrat who is president pro tem of the California Senate, has announced plans to introduce legislation aimed at reducing the impact of the tax law. He is consulting with Mr. Stark, among others, to develop the legislation.\nMr. de León and other legislators concede that they are trying to game the system. But they argue that Congress left them little choice.\n“This is highly unusual tax policymaking,” said Mr. de León, who has announced plans to run for the United States Senate next year. “However, this is a highly unusual time in the history of this country.”\nRepublicans argue there is a much simpler solution for high-tax states: lower their taxes.\nJoseph Pennacchio, a Republican state senator in New Jersey, said that he opposed limiting the state and local tax deduction but that New Jersey should focus less on gaming the system and more on lowering its tax burden. There are signs that may be happening. Mr. Sweeney, the Senate president, said that because of the new tax law, he had “pressed the pause button” on a plan to impose a new tax on millionaires.\n“Maybe people are starting to realize,” Mr. Pennacchio said, “you’ve got to tiptoe when it comes to raising taxes, because it can do more harm than good.”\nStill, lawmakers from both parties said it would be hard to cut taxes enough to offset the impact of the new tax law. For one ", "external_links": ["https://www.nytimes.com/interactive/2017/12/05/us/politics/tax-bill-salt.html?action=click&contentCollection=Business%20Day&module=RelatedCoverage&region=Marginalia&pgtype=article", "https://www.nytimes.com/2017/12/31/business/economy/tax-work.html", "https://www.nytimes.com/2017/12/27/business/prepaying-your-property-taxes-irs-cautions-it-might-not-pay-off.html", "https://www.nytimes.com/2017/12/22/nyregion/cuomo-assist-as-homeowners-rush-to-prepay-property-tax-bill.html", "https://www.nytimes.com/2017/12/04/business/economy/tax-bill-new-york.html?action=click&contentCollection=Business%20Day&module=RelatedCoverage&region=Marginalia&pgtype=article", "https://www.nytimes.com/2017/11/10/business/economy/california-republican-tax-bills.html", "https://www.nytimes.com/2017/12/31/technology/google-images-voters.html"], "published": "2018-01-01T14:03:00.000+02:00", "crawled": "2018-01-01T21:23:13.074+02:00", "highlightTitle": ""}