{"organizations": [], "uuid": "0e2e111f8608a4c691c5e36fb17631f706ecf30f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220510397&w=1200&r=LYNXMPEE080NS", "site_section": "https://www.reuters.com/finance/currencies", "section_title": "Currency Converter, Currencies News | Reuters.com", "url": "https://www.reuters.com/article/uk-britain-sterling-open/sterling-snaps-three-day-rally-but-outlook-improves-idUSKBN1EY12E", "country": "US", "domain_rank": 408, "title": "Sterling snaps three-day rally but outlook improves", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T19:00:00.000+02:00", "replies_count": 0, "uuid": "0e2e111f8608a4c691c5e36fb17631f706ecf30f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/uk-britain-sterling-open/sterling-snaps-three-day-rally-but-outlook-improves-idUSKBN1EY12E", "ord_in_thread": 0, "title": "Sterling snaps three-day rally but outlook improves", "locations": [], "entities": {"persons": [{"name": "lee hardman", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "mufj", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Sterling snapped a three-day rising streak and weakened on Tuesday as investors took profits after a rally although expectations that Brexit talks will have a positive outcome continued to underpin the British currency.\nExternal factors have also proved supportive for the pound with the U.S. dollar struggling to gain much traction against its rivals in the opening days of the year.\n“We expect to see progress towards securing a transitional deal (on leaving the European Union) in the coming months and that should be constructive for sterling,” said Lee Hardman, a currency strategist at MUFJ in London. He expects the pound to rise to 1.40 against the dollar over the next six months.\nOn Tuesday, sterling edged 0.3 percent lower to $1.3529 but remained within striking distance of a four-month high of $1.3614 hit last week.\nAgainst the euro, it has been a more mixed picture, with sterling oscillating around the 88 cents line over the last month.\nNet long bets on sterling are near their highest levels in more than three years, according to data released by the U.S. Commodity Futures Trading Commission on Friday, suggesting some investors have warmed to the bullish sterling theme.\nThat optimism has also filtered through to the currency derivatives markets, with gauges of expected volatility plummeting to more than three-year lows.\nThe drop in expected price swings has gathered steam since Prime Minister Theresa May secured progress in the complicated process of leaving the EU last month -- so much so that expected volatility in sterling in options with up to one-year maturities is now below even some major rivals, such as the Japanese yen and the euro.\nBut some investors remain unconvinced that sterling is a buy, pointing to structural weaknesses of the British economy such as widening deficits.\n“We remain underweight on the pound as we see the balance of payments on a deteriorating trend,” said Alessio de Longis, portfolio manager at Oppenheimer Funds, which manages $235 billion in global assets.\n(Graphic for UK CAD, click reut.rs/2D9K5Z1 )\nReporting by Saikat Chatterjee; Editing by Catherine Evans\n ", "external_links": ["http://reut.rs/2D9K5Z1", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-09T19:00:00.000+02:00", "crawled": "2018-01-09T15:07:42.008+02:00", "highlightTitle": ""}