{"organizations": [], "uuid": "5f4c7de283ce19ecc4e8d75e9efd307b1039563b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/business-wire-conocophillips-to-hold-fourth-quarter-earnings-conference-call-on-thursday-feb-1.html", "country": "US", "domain_rank": 767, "title": "ConocoPhillips to Hold Fourth-Quarter Earnings Conference Call on Thursday, Feb. 1", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T18:00:00.000+02:00", "replies_count": 0, "uuid": "5f4c7de283ce19ecc4e8d75e9efd307b1039563b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/business-wire-conocophillips-to-hold-fourth-quarter-earnings-conference-call-on-thursday-feb-1.html", "ord_in_thread": 0, "title": "ConocoPhillips to Hold Fourth-Quarter Earnings Conference Call on Thursday, Feb. 1", "locations": [], "entities": {"persons": [], "locations": [{"name": "houston", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "libya", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}], "organizations": [{"name": "conocophillips", "sentiment": "negative"}, {"name": "conocophillips conocophillips", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON--(BUSINESS WIRE)-- ConocoPhillips (NYSE: COP) will host a conference call webcast on Thursday, Feb. 1, 2018 at 12:00 p.m. EST to discuss fourth-quarter and full-year 2017 financial and operating results. The company’s financial and operating results will be released before the market opens on Feb. 1.\nTo access the webcast, visit ConocoPhillips’ Investor Relations site, www.conocophillips.com/investor , and click on the \"Register\" link in the Investor Presentations section. You should register at least 15 minutes prior to the start of the webcast. The event will be archived and available for replay later the same day. The presentation, along with a transcript, will also be available on the Investor Relations site.\n--- # # # ---\nAbout ConocoPhillips\nConocoPhillips is the world’s largest independent E&P company based on production and proved reserves. Headquartered in Houston, Texas, ConocoPhillips had operations and activities in 17 countries, $75 billion of total assets, and approximately 11,600 employees as of Sept. 30, 2017. Production excluding Libya averaged 1,403 MBOED for the nine months ended Sept. 30, 2017, and proved reserves were 6.4 billion BOE as of Dec. 31, 2016. For more information, go to www.conocophillips.com .\nCAUTIONARY STATEMENT FOR THE PURPOSES OF THE \"SAFE HARBOR\" PROVISIONS OF THE PRIVATE SECURITIES LITIGATION REFORM ACT OF 1995\nThis news release contains forward-looking statements. Forward-looking statements relate to future events and anticipated results of operations, business strategies, and other aspects of our operations or operating results. In many cases you can identify forward-looking statements by terminology such as \"anticipate,\" \"estimate,\" \"believe,\" \"continue,\" \"could,\" \"intend,\" \"may,\" \"plan,\" \"potential,\" \"predict,\" \"should,\" \"will,\" \"expect,\" \"objective,\" \"projection,\" \"forecast,\" \"goal,\" \"guidance,\" \"outlook,\" \"effort,\" \"target\" and other similar words. However, the absence of these words does not mean that the statements are not forward-looking. Where, in any forward-looking statement, the company expresses an expectation or belief as to future results, such expectation or belief is expressed in good faith and believed to have a reasonable basis. However, there can be no assurance that such expectation or belief will result or be achieved. The actual results of operations can and will be affected by a variety of risks and other matters including, but not limited to, changes in commodity prices; changes in expected levels of oil and gas reserves or production; operating hazards, drilling risks, unsuccessful exploratory activities; difficulties in developing new products and manufacturing processes; unexpected cost increases; international monetary conditions; potential liability for remedial actions under existing or future environmental regulations; potential liability resulting from pending or future litigation; limited access to capital or significantly higher cost of capital related to illiquidity or uncertainty in the domestic or international financial markets; and general domestic and international economic and political conditions; as well as changes in tax, environmental and other laws applicable to our business. Other factors that could cause actual results to differ materially from those described in the forward-looking statements include other economic, business, competitive and/or regulatory factors affecting our business generally as set forth in our filings with the Securities and Exchange Commission. Unless legally required, ConocoPhillips undertakes no obligation to update publicly any forward-looking statements, whether as a result of new information, future events or otherwise.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180111005289/en/\nConocoPhillips\nDaren Beaudo, 281-293-2073 (media)\ndaren.beaudo@conocophillips.com\nor\nAndy O’Brien, 281-293-5000 (investors)\nandy.m.obrien@conocophillips.com\nSource: ConocoPhillips", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.conocophillips.com%2Finvestor&esheet=51741646&newsitemid=20180111005289&lan=en-US&anchor=www.conocophillips.com%2Finvestor&index=1&md5=7ffa4d55df5f4199ada75d1ac6c42d69", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.conocophillips.com%2F&esheet=51741646&newsitemid=20180111005289&lan=en-US&anchor=www.conocophillips.com&index=2&md5=ef484b542c9288d26de53f9783bfa2c0", "http://www.businesswire.com/news/home/20180111005289/en/"], "published": "2018-01-11T18:00:00.000+02:00", "crawled": "2018-01-11T18:52:14.049+02:00", "highlightTitle": ""}