{"organizations": [], "uuid": "163b8cd674b1425096f7182d26b73ae3f009daba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-tsys-reports-fourth-quarter-and-full-year-earnings.html", "country": "US", "domain_rank": 767, "title": "TSYS Reports Fourth Quarter and Full Year Earnings", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-24T00:15:00.000+02:00", "replies_count": 0, "uuid": "163b8cd674b1425096f7182d26b73ae3f009daba"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-tsys-reports-fourth-quarter-and-full-year-earnings.html", "ord_in_thread": 0, "title": "TSYS Reports Fourth Quarter and Full Year Earnings", "locations": [], "entities": {"persons": [{"name": "cayan", "sentiment": "none"}, {"name": "m. troy woods", "sentiment": "none"}], "locations": [{"name": "columbus", "sentiment": "none"}, {"name": "ga.", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "tsys", "sentiment": "negative"}, {"name": "tss", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Provides 2018 Outlook for Revenue and Earnings per Share\nCOLUMBUS, Ga.--(BUSINESS WIRE)-- TSYS (NYSE: TSS) today reported results for the fourth quarter and full year of 2017.\n“2017 proved to be a truly exceptional year for our company. We delivered outstanding financial results, continued to expand our merchant business with the Cayan acquisition announcement and finished the year having met or exceeded our goals,” said M. Troy Woods, chairman, president and chief executive officer of TSYS.\nHighlights for the fourth quarter of 2017 vs. 2016:\nTotal revenues were $1.3 billion, an increase of 12.5%. Net revenue (non-GAAP), which excludes reimbursable items, interchange and payment network fees, was $870.6 million, an increase of 10.8%. Net income attributable to TSYS common shareholders was $242.2 million, an increase of 227.5%, which includes $135.9 million of tax benefit from the Tax Cuts and Jobs Act. Diluted EPS were $1.31, an increase of 227.4%. Adjusted earnings (non-GAAP) were $151.0 million, an increase of 16.5%. Adjusted diluted EPS (non-GAAP) were $0.82, an increase of 16.5%. Adjusted EBITDA (non-GAAP) was $293.3 million, an increase of 10.0%. 3.45 million shares were purchased for $255.0 million.\nHighlights for the full year of 2017 vs. 2016:\nTotal revenues were $4.9 billion, an increase of 18.2%. Net revenue (non-GAAP), which excludes reimbursable items, interchange and payment network fees, was $3.4 billion, an increase of 11.8%. Net income attributable to TSYS common shareholders was $586.2 million, an increase of 83.4%, which includes $135.9 million of tax benefit from the Tax Cuts and Jobs Act. Diluted EPS were $3.16, an increase of 82.4%. Adjusted earnings (non-GAAP) were $624.2 million, an increase of 20.9%. Adjusted diluted EPS (non-GAAP) were $3.37, an increase of 20.2%. Adjusted EBITDA (non-GAAP) was $1.2 billion, an increase of 15.1%. 3.85 million shares were purchased for $282.6 million. Debt was reduced by $400 million and totaled $800 million over the past two years.\n“We expect the momentum of 2017 to carry over into 2018. We are projecting strong organic revenue growth as we remain laser focused on executing on our strategic plan and delivering outstanding results,” said Woods.\n2018 Outlook\nOn January 1, 2018, TSYS adopted Accounting Standards Codification (ASC) 606 “Revenue from Contracts with Customers” using the modified retrospective transition method. The 2018 guidance is below and includes the expected impact of the adoption of the new revenue standard, the expected impact of the acquisition of Cayan, the expected impact of the new tax law (the Tax Cuts and Jobs Act) and the expected effective date of October 2018 of the prepaid rules by the Consumer Financial Protection Bureau.\n2018\nFinancial Outlook\nRange (1)\nPercent\nChange\n(in millions, except per share amounts) Revenue: Total revenues (GAAP) $3,850 to $3,950 (22 %) to (20 %) Net revenue (non-GAAP) $3,650 to $3,750 7 % to 10 % Earnings per share: Diluted EPS (GAAP) $2.85 to $2.95 (10 %) to (7 %) Adjusted diluted EPS attributable to TSYS common shareholders (non-GAAP)\n$4.10\nto\n$4.20\n22\n%\nto\n25\n%\nWeighted average diluted shares outstanding 184 (1) The estimated impact of the adoption of ASC 606 on TSYS’ 2018 Outlook is as follows:\nTotal revenues ($1,600) to ($1,575) Net revenue ($62) to ($69) Diluted EPS ($0.04) to ($0.03) Adjusted diluted EPS ($0.04) to ($0.03) The most significant impact of adopting ASC 606 in 2018 is primarily the result of gross versus net presentation of interchange and payment network fees. In 2018, these fees collected on behalf of the payment networks and card issuers will be presented “net” of the amounts paid to them, as opposed to the “gross” presentation for certain of these fees in 2017.\nConference Call\nTSYS will host its quarterly conference call at 5:00 p.m. ET on Tuesday, January 23. The conference call can be accessed via simultaneous Internet broadcast on the “Investor Relations” section of TSYS’ website at investors.tsys.com where an accompanying slide presentation will also be available. The replay will be archived for 12 months and will be available approximately 30 minutes after the completion of the call.\nNon-GAAP Measures\nThis press release contains information prepared in conformity with GAAP as well as non-GAAP information. It is management’s intent to provide non-GAAP financial information to enhance understanding of its consolidated financial information as prepared in accordance with GAAP. This non-GAAP information should be considered by the reader in addition to, but not instead of, the financial statements prepared in accordance with GAAP. Each non-GAAP financial measure and the most directly comparable GAAP financial measure are presented so as not to imply that more emphasis should be placed on the non-GAAP measure. The non-GAAP financial information presented may be determined or calculated differently by other companies.\nAdditional information about non-GAAP financial measures, including, but not limited to, net revenue, adjusted earnings, adjusted EBITDA and adjusted diluted EPS, and a reconciliation of those measures to the most directly comparable GAAP measures is included on pages 12 to 15 in the financial schedules of this release.\nAbout TSYS\nTSYS ® (NYSE: TSS) is a leading global payments provider, offering seamless, secure and innovative solutions across the payments spectrum — from issuer processing and merchant acquiring to prepaid program management. We succeed because we put people, and their needs, at the heart of every decision. It’s an approach we call ‘People-Centered Payments ® ’.\nOur headquarters are located in Columbus, Ga., U.S.A., with approximately 11,800 team members and local offices spread across 13 countries. TSYS generated revenue of $4.9 billion in 2017. We are a member of The Civic 50 and were named one of the 2017 World's Most Ethical Companies by Ethisphere magazine. TSYS is a member of the S&P 500 and routinely posts all important information on its website. For more, visit tsys.com .\nForward-Looking Statements\nThis press release contains “forward-looking statements” – that is, statements related to future, not past, events. Forward-looking statements often address our expected future business and financial performance and often contain words such as “expect,” “anticipate,” “intend,” “believe,” “should,” “plan,” “potential,” “will,” “could,” and similar expressions. These forward-looking statements include, among others, statements regarding the expectation that the momentum of 2017 will carry over into 2018, the projected strong organic revenue growth and TSYS’ earnings guidance for 2018 total revenues, net revenue, diluted EPS and adjusted diluted EPS, and the assumptions underlying such statements, including with respect to TSYS’ earnings guidance for 2018 those set forth under the caption “2018 Outlook” above. These statements are based on the current beliefs and expectations of TSYS’ management, are based on management’s assumptions and are subject to significant risks and uncertainties. Actual results may differ materially from those contemplated by the forward-looking statements. A number of important factors could cause actual results or events to differ materially from those contemplated by our forward-looking statements in this press release. Many of these factors are beyond TSYS’ ability to control or predict. These factors include, but are not limited to, the material breach of security of any of TSYS’ systems; TSYS’ ability to integrate acquisitions and achieve the anticipated growth opportunities and other benefits of the acquisitions, particularly the recently completed Cayan acquisition; the effect of current domestic and worldwide economic conditions; risks associated with foreign operations, including adverse developments with respect to foreign currency exchange rates, and in particular with respect to the current environment, adverse developments with respect to foreign currency exchange rates as a result of the United Kingdom’s decision to leave the European Union (Brexit); expenses incurred associated with the signing of a significant client; TSYS does not convert clients’ portfolios as scheduled; the deconversion of a significant client; changes occur in laws, rules, regulations, credit card association rules, prepaid industry rules or other industry standards affecting TSYS and our clients that may result in costly new compliance burdens on TSYS and our clients and lead to a decrease in the volume and/or number of transactions processed or limit the types and amounts of fees that can be charged to customers, and in particular the CFPB’s new rule regarding prepaid financial products, including its effective date; the costs and effects of litigation, investigations or similar matters or adverse facts and developments relating thereto; adverse developments with respect to the payment card industry in general, including a decline in the use of cards as a payment mechanism; and growth rates of TSYS’ existing clients are lower than anticipated or attrition rates of existing clients are higher than anticipated. Additional risks and other factors that could cause actual results or events to differ materially from those contemplated in this release can be found in TSYS’ filings with the Securities and Exchange Commission, including our most recent Annual Report on Form 10-K. We believe these forward-looking statements are reasonable; however, undue reliance should not be placed on any forward-looking statements, which are based on current expectations. TSYS disclaims any obligation to update any forward-looking statements as a result of new information, future developments or otherwise except as required by law.\nTSYS Financial Highlights (unaudited) (in thousands, except per share data) Three Months Ended Twelve Months Ended December 31, December 31, Percent Percent 2017 2016 Change 2017 2016 Change Total revenues $ 1,273,289 1,132,224 12.5 % $ 4,927,965 4,170,077 18.2 % Cost of services 939,106 826,332 13.6 3,577,320 2,993,062 19.5 Selling, general and administrative expenses 160,262 175,345 (8.6 ) 616,601 603,633 2.1 Total expenses 1,099,368 1,001,677 9.8 4,193,921 3,596,695 16.6 Operating income 173,921 130,547 33.2 734,044 573,382 28.0 Nonoperating expenses* (27,702 ) (30,125 ) 8.0 (116,482 ) (112,350 ) (3.7 ) Income before income taxes and equity in income of equity investments\n146,219 100,422 45.6 617,562 461,032 34.0 Income tax (benefit)/expense (88,039 ) 33,209 nm 65,878 161,175 (59.1 ) Income before equity in income of equity investments 234,258 67,213 nm 551,684 299,857 84.0 Equity in income of equity investments, net of tax* 9,613 7,162 34.2 40,532 26,115 55.2 Net income 243,871 74,375 nm 592,216 325,972 81.7 Net income attributable to noncontrolling interests (1,663 ) (425 ) nm (6,031 ) (6,334 ) 4.8 Net income attributable to TSYS common shareholders $ 242,208 73,950 nm % $ 586,185 319,638 83.4 % Earnings per share (EPS): Basic EPS $ 1.33 0.40 nm % $ 3.19 1.74 83.3 % Diluted EPS $ 1.31 0.40 nm % $ 3.16 1.73 82.4 % Weighted average shares outstanding: (includes participating securities) Basic 182,661 183,665 183,745 183,655 Diluted 184,639 184,533 185,430 184,448 Dividends declared per share $ 0.13 0.10 30.0 % $ 0.46 0.40 15.0 % Non-GAAP measures:**\nNet revenue $ 870,613 785,709 10.8 % $ 3,400,332 3,041,876 11.8 % Adjusted EBITDA $ 293,277 266,547 10.0 % $ 1,197,673 1,040,551 15.1 % Adjusted earnings $ 151,036 129,620 16.5 % $ 624,183 516,419 20.9 % Adjusted diluted EPS $ 0.82 0.70 16.5 % $ 3.37 2.80 20.2 % * Certain prior year amounts have been reclassified between nonoperating expenses and equity in income of equity investments, net of tax. ** See reconciliation of non-GAAP measures. nm = not meaningful TSYS Segment Breakdown (unaudited) (in thousands) Three Months Ended December 31, Twelve Months Ended December 31, Change Change 2017 2016 $ % 2017 2016 $ % Adjusted operating income by segment: Issuer Solutions (a) $ 145,671 132,506 13,165 9.9 % $ 574,580 525,025 49,555 9.4 % Merchant Solutions (b) 94,915 88,539 6,376 7.2 391,466 307,595 83,871 27.3 Netspend (c) 38,831 34,834 3,997 11.5 182,082 160,371 21,711 13.5 Corporate admin and other\n(37,395 ) (36,166 ) (1,229 ) (3.4 ) (148,564 ) (135,996 ) (12,568 ) (9.2 ) Adjusted segment operating income (d) 242,022 219,713 22,309 10.2 999,564 856,995 142,569 16.6 Less: Share-based compensation 13,946 9,937 4,009 40.3 42,409 43,728 (1,319 ) (3.0 ) TransFirst and Cayan M&A and integration expenses 3,281 2,267 1,014 44.7 13,367 28,176 (14,809 ) (52.6 ) Litigation, claims, judgments or settlements 43 21,719 (21,676 ) (99.8 ) 1,947 21,719 (19,772 ) (91.0 ) Acquisition intangible amortization 50,831 55,243 (4,412 ) (8.0 ) 207,797 189,990 17,807 9.4 Operating income 173,921 130,547 43,374 33.2 734,044 573,382 160,662 28.0 Nonoperating expenses (27,702 ) (30,125 ) 2,423 8.0 (116,482 ) (112,350 ) (4,132 ) (3.7 ) Income before income taxes and equity in income of equity investments\n$ 146,219 100,422 45,797 45.6 % $ 617,562 461,032 156,530 34.0 % Net revenue by segment: Issuer Solutions (e) $ 413,869 380,446 33,423 8.8 % $ 1,594,959 1,515,462 79,497 5.2 % Merchant Solutions (f) 282,714 253,960 28,754 11.3 1,103,682 898,533 205,149 22.8 Netspend (g) 186,422 160,617 25,805 16.1 746,870 663,579 83,291 12.6 Segment net revenue 883,005 795,023 87,982 11.1 3,445,511 3,077,574 367,937 12.0 Less: Intersegment revenues 12,392 9,314 3,078 33.0 45,179 35,698 9,481 26.6 Net revenue (h) 870,613 785,709 84,904 10.8 3,400,332 3,041,876 358,456 11.8 Add: reimbursable items, interchange and payment network fees 402,676 346,515 56,161 16.2 1,527,633 1,128,201 399,432 35.4 Total revenues $ 1,273,289 1,132,224 141,065 12.5 % $ 4,927,965 4,170,077 757,888 18.2 % Adjusted segment operating margin on segment net revenue: Issuer Solutions (a)/(e) 35.2 % 34.8 % 36.0 % 34.6 % Merchant Solutions (b)/(f) 33.6 % 34.9 % 35.5 % 34.2 % Netspend (c)/(g) 20.8 % 21.7 % 24.4 % 24.2 % Adjusted segment operating margin on net revenue (d)/(h) 27.8 % 28.0 % 29.4 % 28.2 % TSYS Segment Breakdown (unaudited) (in thousands) Three Months Ended December 31, Twelve Months Ended December 31, Change Change 2017 2016 $ % 2017 2016 $ % Depreciation and amortization by segment: Issuer Solutions $ 38,627 35,450 3,177 9.0 % $ 147,914 141,309 6,605 4.7 % Merchant Solutions 7,487 6,851 636 9.3 29,477 25,553 3,924 15.4 Netspend 3,782 3,667 115 3.1 15,838 13,133 2,705 20.6 Depreciation and amortization 49,896 45,968 3,928 8.5 193,229 179,995 13,234 7.4 Acquisition intangible amortization 50,831 55,243 (4,412 ) (8.0 ) 207,797 189,990 17,807 9.4 Corporate admin and other 1,358 866 492 56.8 4,880 3,561 1,319 37.0 Total depreciation and amortization\n$ 102,085 102,077 8 0.0 % $ 405,906 373,546 32,360 8.7 % Segment statistical data:\nIssuer Solutions\nTotal transactions (in millions) 5,863.5 5,224.8 638.7 12.2 % 21,575.6 19,858.1 1,717.5 8.6 % Total Accounts on file (AOF) (in millions) 797.5 751.5 46.0 6.1 % Total Traditional AOF (in millions) 571.9 521.8 50.1 9.6 % Merchant Solutions\nPoint-of-sale transactions (in millions) 1,221.8 1,120.5 101.3 9.0 % 4,844.1 4,548.1 296.0 6.5 % Dollar sales volume (in millions) $ 32,439.0 28,710.2 3,728.8 13.0 % $ 124,165.1 97,735.1 26,430.0 27.0 % Segment net revenue per transaction $ 0.231 0.227 0.005 2.1 % $ 0.228 0.198 0.030 15.3 % Netspend\nGross dollar volume (in millions) $ 7,579.7 6,579.1 1,000.6 15.2 % $ 32,034.8 28,722.3 3,312.5 11.5 % Direct deposit 90-day active cards (in thousands) 2,395.1 2,136.0 259.1 12.1 % 90-day active cards (in thousands) 4,902.9 4,295.0 607.9 14.2 % % of 90-day active cards with direct deposit 48.9 % 49.7 % TSYS Condensed Balance Sheet (unaudited) (in thousands) December 31, 2017 December 31, 2016 Assets Current assets: Cash and cash equivalents $ 450,357 425,354 Accounts receivable, net 412,322 432,847 Other current assets 176,770 164,488 Total current assets 1,039,449 1,022,689 Goodwill 3,264,071 3,270,952 Software and other intangible assets, net 1,106,741 1,329,864 Property and equipment, net 325,218 282,345 Other long term assets 552,672 460,327 Total assets $ 6,288,151 6,366,177 Liabilities Current liabilities: Accounts payable $ 58,191 38,712 Current portion of long-term borrowings, capital leases and license agreements 565,812 50,727 Other current liabilities 328,478 330,914 Total current liabilities 952,481 420,353 Long-term borrowings, capital leases and license agreements, excluding current portion 2,628,002 3,313,276 Deferred income tax liabilities 238,317 419,552 Other long-term liabilities 112,670 88,983 Total liabilities 3,931,470 4,242,164 Redeemable noncontrolling interest 14,283 24,093 Equity 2,342,398 2,099,920 Total liabilities and equity $ 6,288,151 6,366,177 TSYS Selected Cash Flow Highlights (unaudited) (in thousands) Twelve Months Ended December 31, 2017 2016 Cash flows from operating activities: Net income $ 592,216 325,972 Adjustments to reconcile net income to net cash provided by operating activities:\nEquity in income of equity investments, net of tax (40,532 ) (26,115 ) Dividends received from equity investments 20,589 15,246 Depreciation and amortization 405,906 373,546 Amortization of debt issuance costs 4,307 13,570 Share-based compensation 42,409 43,728 Deferred income tax (benefit) expense (172,488 ) 7,435 Other noncash adjustments 78,498 52,169 Changes in operating assets and liabilities (74,413 ) (87,522 ) Net cash provided by operating activities 856,492 718,029 Purchases of property and equipment (70,039 ) (51,132 ) Additions to licensed computer software from vendors (25,916 ) (11,551 ) Additions to internally developed computer software (30,265 ) (34,043 ) Additions to contract acquisition costs (69,806 ) (45,847 ) Cash used in acquisitions, net of cash acquired - (2,345,493 ) Other investing activities (2,718 ) (4,930 ) Net cash used in investing activities (198,744 ) (2,492,996 ) Principal payments on long-term borrowings, capital lease obligations and license agreements\n(421,306 ) (724,084 ) Proceeds from long-term borrowings 200,000 2,666,295 Debt issuance costs - (26,555 ) Purchase of noncontrolling interests (70,000 ) (5,878 ) Dividends paid on common stock (79,017 ) (73,378 ) Proceeds from exercise of stock options 21,832 11,708 Repurchase of common stock (284,237 ) (30,275 ) Other financing activities (5,997 ) 4,357 Net cash (used in) provided by financing activities (638,725 ) 1,822,190 Cash and cash equivalents: Effect of exchange rate changes on cash and cash equivalents 5,980 (11,197 ) Net increase in cash and cash equivalents 25,003 36,026 Cash and cash equivalents at beginning of period 425,354 389,328 Cash and cash equivalents at end of period $ 450,357 425,354 Supplemental Capital expenditures $ 196,026 142,573 Free cash flow (non-GAAP)* $ 660,466 575,456 * See reconciliation of non-GAAP measures. TSYS Supplemental Information (unaudited) Other AOF: Total Accounts on File (in millions) At\nDecember 2017\nAt\nDecember 2016\n% Change\nConsumer 481.3 442.9 8.7 Commercial 54.2 47.9 13.2 Other 36.4 31.0 17.4 Traditional AOF 571.9 521.8 9.6 Prepaid*/Stored Value 38.6 57.8 (33.3 ) Government Services 95.0 88.7 7.2 Commercial Card Single Use 92.0 83.2 10.7 Total AOF 797.5 751.5 6.1 * Prepaid does not include Netspend accounts Growth in Accounts on File (in millions):\nDecember 2016 to December 2017\nDecember 2015 to December 2016\nBeginning balance 751.5 732.5 Change in accounts on file due to: Internal growth of existing clients 53.1 53.1 New clients 29.8 27.8 Purges/Sales (36.4 ) (12.9 ) Deconversions (0.5 ) (49.0 ) Ending balance 797.5 751.5 Reconciliation of GAAP to Non-GAAP Financial Measures Non-GAAP Measures The schedules below provide a reconciliation of revenues and operating results on a constant currency basis to reported revenues and operating income. This non-GAAP measure presents fourth quarter and year-to-date 2017 financial results using the previous year’s foreign currency exchange rates. On a constant currency basis, TSYS’ total year-to-date revenues for the fourth quarter of 2017 grew 18.5% as compared to a reported GAAP increase of 18.2%. The schedules below also provide a reconciliation of diluted EPS to adjusted diluted EPS. The schedules below also provide a reconciliation of net income to adjusted EBITDA. The schedules below also provide a reconciliation of cash flows from operating activities and capital expenditures to free cash flow. The schedules below also provide a reconciliation of 2018 guidance of total revenues to net revenue and diluted EPS to adjusted diluted EPS. The tax rate used in the calculation of adjusted diluted EPS for the quarter and year is equal to an estimate of our annual effective tax rate on GAAP income. This effective rate is estimated annually and may be adjusted during the year to take into account events or trends that materially impact the effective tax rate including, but not limited to, significant changes resulting from tax legislation, material changes in the mix of revenues and expenses by entity and other significant events. TSYS believes that non-GAAP financial measures are important to enable investors to understand and evaluate its ongoing operating results. Accordingly, TSYS includes non-GAAP financial measures when reporting its financial results to shareholders and potential investors in order to provide them with an additional tool to evaluate TSYS’ ongoing business operations. TSYS believes that the non-GAAP financial measures are representative of comparative financial performance that reflects the economic substance of TSYS’ current and ongoing business operations. Although non-GAAP financial measures are often used to measure TSYS’ operating results and assess its financial performance, they are not necessarily comparable to similarly titled measures of other companies due to potential inconsistencies in the method of calculation. TSYS believes that its provision of non-GAAP financial measures provides investors with important key financial performance indicators that are utilized by management to assess TSYS’ operating results, evaluate the business and make operational decisions on a prospective, going-forward basis. Hence, management provides disclosure of non-GAAP financial measures to give shareholders and potential investors an opportunity to see TSYS as viewed by management, to assess TSYS with some of the same tools that management utilizes internally and to be able to compare such information with prior periods. TSYS believes that inclusion of non-GAAP financial measures provides investors with additional information to help them better understand its financial statements just as management utilizes these non-GAAP financial measures to better understand the business, manage budgets and allocate resources. Reconciliation of GAAP to Non-GAAP Constant Currency Comparison (unaudited) (in thousands) Three Months Ended December 31, Twelve Months Ended December 31, Percent Percent 2017 2016 Change 2017 2016 Change Consolidated\nConstant currency (1) $ 1,267,420 1,132,224 11.9 % $ 4,943,433 4,170,077 18.5 % Foreign currency impact (2) 5,869 - (15,468 ) - Total revenues $ 1,273,289 1,132,224 12.5 % $ 4,927,965 4,170,077 18.2 % Constant currency (1) $ 865,131 785,709 10.1 % $ 3,414,749 3,041,876 12.3 % Foreign currency impact (2) 5,482 - (14,417 ) - Net revenue $ 870,613 785,709 10.8 % $ 3,400,332 3,041,876 11.8 % Constant currency (1) $ 172,499 130,547 32.1 % $ 742,966 573,382 29.6 % Foreign currency impact (2) 1,422 - (8,922 ) - Operating income $ 173,921 130,547 33.2 % $ 734,044 573,382 28.0 % Issuer Solutions\nConstant currency (1) $ 461,735 430,555 7.2 % $ 1,816,232 1,719,211 5.6 % Foreign currency impact (2) 5,903 - (15,378 ) - Total revenues $ 467,638 430,555 8.6 % $ 1,800,854 1,719,211 4.7 % Constant currency (1) $ 408,353 380,446 7.3 % $ 1,609,285 1,515,462 6.2 % Foreign currency impact (2) 5,516 - (14,326 ) - Segment net revenue $ 413,869 380,446 8.8 % $ 1,594,959 1,515,462 5.2 % (1) Reflects current period results on a non-GAAP basis as if foreign currency rates did not change from the comparable prior year period. (2) Reflects the impact of calculated changes in foreign currency rates from the comparable period. Net Revenue (unaudited) (in thousands) Three Months Ended December 31, Twelve Months Ended December 31, Percent Percent 2017 2016 Change 2017 2016 Change Total revenues $ 1,273,289 1,132,224 12.5 % $ 4,927,965 4,170,077 18.2 % Less: reimbursable items, interchange and payment network fees 402,676 346,515 16.2 1,527,633 1,128,201 35.4 Net revenue $ 870,613 785,709 10.8 % $ 3,400,332 3,041,876 11.8 % Reconciliation of GAAP to Non-GAAP Adjusted Diluted Earnings per Share (unaudited) (in thousands, except per share data) Three Months Ended December 31, Twelve Months Ended December 31, Percent Percent 2017 2016 Change 2017 2016 Change Net income attributable to TSYS common shareholders (GAAP)\n$ 242,208 73,950 nm % $ 586,185 319,638 83.4 % Adjust for amounts attributable to TSYS common shareholders: Add: Acquisition intangible amortization $ 50,683 54,967 (7.8 ) $ 207,172 188,887 9.7 Add: Share-based compensation 13,944 9,925 40.5 42,399 43,691 (3.0 ) Add: TransFirst and Cayan M&A expenses* 3,281 2,268 44.7 13,306 37,957 (64.9 ) Add: Litigation, claims, judgments or settlements** 43 19,913 (99.8 ) 1,947 19,913 (90.2 ) Less: Tax impact of adjustments*** (23,252 ) (31,403 ) 26.0 (90,955 ) (93,667 ) 2.9 Less: Impact of Tax Cuts and Jobs Act**** (135,871 ) - na (135,871 ) - na Adjusted earnings (non-GAAP) $ 151,036 129,620 16.5 % $ 624,183 516,419 20.9 % Diluted EPS - Net income attributable to TSYS common shareholders\nAs reported (GAAP) $ 1.31 0.40 nm % $ 3.16 1.73 82.4 % Adjusted diluted EPS (non-GAAP) $ 0.82 0.70 16.5 % $ 3.37 2.80 20.2 % Weighted average diluted shares outstanding 184,639 184,533 185,430 184,448 * Costs associated with the TransFirst and Cayan acquisition and integration that are both included in selling, general and administrative expenses and nonoperating expenses. ** Litigation settlement or settlement discussions and related legal expenses. *** Certain of these merger and acquisition costs are nondeductible for income tax purposes. Income tax impact includes a discrete item as a result of the acquisitions. ****On December 22, 2017, President Trump signed into law the Tax Cuts and Jobs Act (the “Tax Act”). Based on its preliminary analysis of the Tax Act, including the reduction in the federal corporate income tax rate, TSYS estimates that it will receive an additional, non-recurring income tax benefit of approximately $135.9 million due to the reduction of certain deferred tax liabilities and the repatriation of foreign earnings as a result of the Tax Act.\nAdjusted EBITDA (unaudited) (in thousands) Three Months Ended December 31, Twelve Months Ended December 31, Percent Percent 2017 2016 Change 2017 2016 Change Net income (GAAP) (a) $ 243,871 74,375 nm % $ 592,216 325,972 81.7 % Adjust for: Less: Equity in income of equity investments (9,613 ) (7,162 ) (34.2 ) (40,532 ) (26,115 ) (55.2 ) Less: Income tax (benefit)/expense (88,039 ) 33,209 nm 65,878 161,175 (59.1 ) Add: Interest expense, net 28,217 29,823 (5.4 ) 116,028 113,523 2.2 Add: Depreciation and amortization 102,085 102,077 0.0 405,906 373,546 8.7 Less: (Gain)/loss on foreign currency translations (343 ) (84 ) nm 907 (1,748 ) nm Less: Other nonoperating (income)/expenses (172 ) 386 nm (453 ) 575 nm Add: Share-based compensation 13,947 9,937 40.4 42,409 43,728 (3.0 ) Add: TransFirst and Cayan M&A expenses* 3,281 2,267 44.7 13,367 28,176 (52.6 ) Add: Litigation, claims, judgments or settlements 43 21,719 (99.8 ) 1,947 21,719 (91.0 ) Adjusted EBITDA (non-GAAP) (b) $ 293,277 266,547 10.0 % $ 1,197,673 1,040,551 15.1 % Total revenues (c) $ 1,273,289 1,132,224 $ 4,927,965 4,170,077 Net income margin on total revenues (GAAP) (a)/(c) 19.2 % 6.6 % 12.0 % 7.8 % Net revenue (d) $ 870,613 785,709 $ 3,400,332 3,041,876 Adjusted EBITDA margin on net revenue (non-GAAP) (b)/(d) 33.7 % 33.9 % 35.2 % 34.2 % * Costs associated with the TransFirst and Cayan acquisition and integration that are both included in selling, general and administrative expenses. nm = not meaningful na = not applicable Reconciliation of GAAP to Non-GAAP Free Cash Flow (unaudited) (in thousands) Twelve Months Ended Free cash flow: December 31, 2017 2016 Net cash provided by operating activities (GAAP) $ 856,492 718,029 Capital expenditures (196,026 ) (142,573 ) Free cash flow (non-GAAP) $ 660,466 575,456 Guidance Summary (unaudited) (in millions, except per share data) Revenue: 2018 (1)\n% Change Total revenues (GAAP) $ 3,850 to $ 3,950 (22.0 %) to (20.0 %) Less: reimbursable items, interchange and payment network fees\n200 to 200 Net revenue (non-GAAP) $ 3,650 to $ 3,750 7.0 % to 10.0 % Earnings per share (EPS): Diluted EPS (GAAP) $ 2.85 to $ 2.95 (10.0 %) to (7.0 %) Acquisition intangible amortization, share-based compensation, litigation, claims, judgments or settlements and for TransFirst and Cayan M&A expenses, less the tax impact of adjustments\n1.25 to 1.25 Adjusted diluted EPS attributable to TSYS common shareholders* (non-GAAP)\n$ 4.10 to $ 4.20 22.0 % to 25.0 % * Weighted average diluted shares outstanding 184 (1) The estimated impact of the adoption of ASC 606 on TSYS' 2018 Outlook is as follows: Total revenues ($1,600) to ($1,575), Net revenue ($62) to ($69), Diluted EPS and Adjusted diluted EPS of ($0.04) to ($0.03). The most significant impact of adopting ASC 606 in 2018 is primarily the result of gross versus net presentation of interchange and payment network fees. In 2018, these fees collected on behalf of the payment networks and card issuers will be presented \"net\" of the amounts paid to them, as opposed to the \"gross\" presentation for certain of these fees in 2017.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123006403/en/\nTSYS Media Relations\nCyle Mims, +1-706-644-3110\ncylemims@tsys.com\nor\nTSYS Investor Relations\nShawn Roberts, +1-706-644-6081\nshawnroberts@tsys.com\nSource: TSYS", "external_links": ["http://www.businesswire.com/news/home/20180123006403/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Finvestors.tsys.com%2F&esheet=51747690&newsitemid=20180123006403&lan=en-US&anchor=investors.tsys.com&index=1&md5=c9467542005866d29315e4932e5ac7cb", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Ftsys.com%2F&esheet=51747690&newsitemid=20180123006403&lan=en-US&anchor=tsys.com&index=2&md5=32a97da9e0e47a9ca66b2a3704b58369"], "published": "2018-01-24T00:15:00.000+02:00", "crawled": "2018-01-24T01:21:30.007+02:00", "highlightTitle": ""}