{"organizations": [], "uuid": "20a71110eadeafc3da378d5d94fc8837d71e7161", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225328014&w=1200&r=LYNXMPEE0P02S", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-global-oil/oil-dips-as-dollar-halts-slide-short-term-demand-outlook-weakens-idUKKBN1FF04X", "country": "US", "domain_rank": 408, "title": "Oil dips as dollar halts slide, short-term demand outlook weakens", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T06:08:00.000+02:00", "replies_count": 0, "uuid": "20a71110eadeafc3da378d5d94fc8837d71e7161"}, "author": "", "url": "https://uk.reuters.com/article/uk-global-oil/oil-dips-as-dollar-halts-slide-short-term-demand-outlook-weakens-idUKKBN1FF04X", "ord_in_thread": 0, "title": "Oil dips as dollar halts slide, short-term demand outlook weakens", "locations": [], "entities": {"persons": [{"name": "henning gloystein", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "steven mnuchin", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "min read  singapore", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 1:20 AM / Updated 7 minutes ago Oil firms as dollar falls further, but weaker crude demand looms Henning Gloystein 3 Min Read \nSINGAPORE (Reuters) - Oil prices reversed earlier falls on Friday as ongoing weakness in the U.S. dollar was seen supporting fuel consumption. \nBrent crude futures LCOc1 were at $70.40 per barrel at 0756 GMT, down 3 cents from their last close, after dropping as low as $70.07 earlier in the day. \nU.S. West Texas Intermediate (WTI) crude futures CLc1 were at $65.52 a barrel, up 1 cent from their previous close, recovering from a session-low of $64.91 a barrel. \nCrude oil futures have received support from a weakening dollar, which on Friday hit fresh 2014 lows against a basket of other leading currencies .DXY. \nAs oil is traded in dollars, swings in the greenback can also impact oil demand as it affects the price of fuel purchases for countries using other currencies. \n“The weakening of the U.S. dollar against a basket of global currencies ... has positioned 2018 to lead off with strong levels of oil demand,” said BMI Research. \nDespite this, crude prices were prevented from further rises by a seasonally weakening demand outlook. \nGeorgi Slavov, head of research at commodities brokerage Marex Spectron, said despite a generally healthy outlook for oil demand, there were short-term headwinds due to the upcoming end of the peak-demand period during the northern hemisphere winter season. \nMany refiners shut down after winter for maintenance, resulting in lower orders for crude, their most important feedstock. \n“Demand is starting to weaken as ... refining capacity was taken out of the market,” Slavov said. \nU.S. bank Jefferies said “a fairly heavy maintenance season” was starting in the United States, adding there was also upcoming “scheduled maintenance in the Middle East (including the 400,000 barrels per day Aramco Jubail refinery).” \nThis is reflecting in oil inventories. \n“Global oil stocks built overall in the week ending Jan. 19, as both crude and product stocks saw small builds,” U.S. bank Morgan Stanley said. \nOn the supply side, U.S. oil production C-OUT-T-EIA is expected to hit 10 million bpd soon, after reaching 9.88 million bpd last week. \nOutput has grown by more than 17 percent since mid-2016 and is now on par with top exporter Saudi Arabia‘s. \nOnly Russia produces more, averaging 10.98 million bpd in 2017. \nRising U.S. output threatens to undermine the supply restraint led by the Organization of the Petroleum Exporting Countries (OPEC) and Russia, aimed at propping up prices. \nThe cuts, coupled with demand growth, have contributed to a near 60 percent rise in oil prices since mid-2017 as excess crude inventories have been drawn down. Reporting by Henning Gloystein; Editing by Joseph Radford and Christian Schmollinger", "external_links": [], "published": "2018-01-26T06:08:00.000+02:00", "crawled": "2018-01-26T06:52:14.014+02:00", "highlightTitle": ""}