{"organizations": [], "uuid": "e1a5f2b7dbd55db9a2df8f4ff9bd26e20f8c851a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/11/alaweed-bin-talal.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/27/prince-al-waleed-bin-talal-freed/", "country": "US", "domain_rank": 1196, "title": "Saudi Arabia Frees Prince Alwaleed bin Talal and Other Billionaires | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.815, "site_type": "news", "published": "2018-01-27T14:15:00.000+02:00", "replies_count": 0, "uuid": "e1a5f2b7dbd55db9a2df8f4ff9bd26e20f8c851a"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/27/prince-al-waleed-bin-talal-freed/", "ord_in_thread": 0, "title": "Saudi Arabia Frees Prince Alwaleed bin Talal and Other Billionaires | Fortune", "locations": [], "entities": {"persons": [{"name": "getty", "sentiment": "negative"}, {"name": "matthew lloyd", "sentiment": "negative"}, {"name": "alwaleed bin talal", "sentiment": "negative"}, {"name": "prince alwaleed", "sentiment": "none"}, {"name": "waleed al-ibrahim", "sentiment": "none"}, {"name": "alwaleed", "sentiment": "none"}, {"name": "fawaz al hokair", "sentiment": "none"}], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "ritz-carlton", "sentiment": "none"}, {"name": "riyadh", "sentiment": "none"}], "organizations": [{"name": "bloomberg", "sentiment": "negative"}, {"name": "bloomberg bloomberg", "sentiment": "none"}, {"name": "citigroup inc.", "sentiment": "none"}, {"name": "kingdom holding co.", "sentiment": "none"}, {"name": "twitter inc.", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Saudi Arabia Frees Prominent Billionaires From Ritz-Carlton Jail Matthew Lloyd—Bloomberg via Getty Images Bloomberg Bloomberg via Getty Images By Bloomberg 12:15 PM EST \nSaudi Arabia freed Prince Alwaleed bin Talal and several of the kingdom’s most prominent businessmen from detention this weekend, clearing out the Ritz-Carlton hotel that served as a jail for the country’s elite during a controversial crackdown on corruption. \nPrince Alwaleed, the billionaire chairman of Riyadh’s Kingdom Holding Co. who owns stakes in Citigroup Inc. and Twitter Inc., returned home on Saturday after reaching a settlement with authorities, a senior government official said on condition of anonymity. He will remain at the helm of his company, the official said, declining to provide the other terms of the deal. Waleed al-Ibrahim, head of a major media firm, and retail billionaire Fawaz Al Hokair were also freed after agreeing to deals, another government official said. \nThe prince’s release came just hours after Alwaleed told Reuters in an interview that he expected to go home soon and retain control of his company, calling his detention a “misunderstanding” and expressing support for the kingdom’s rulers. With the suspects’ names and evidence against them never officially announced, the detentions had raised concerns about transparency among foreign investors — vital to Crown Prince Mohammed bin Salman’s plan to diversify the economy away from oil. \nKingdom Holding didn’t immediately respond to a request for comment. Saudi Windfall \nThe departures from the hotel mark the end of the first phase of Prince Mohammed’s anti-corruption campaign, which shook the kingdom when it was launched in November. Hundreds of suspects were arrested, including some of the country’s richest men and its top economic policymaker. Officials say the government expects to reap more than $100 billion from settlements with detainees in exchange for their freedom. Others have been transferred to prison to face trial, the Wall Street Journal reported. \nAlso released this weekend after agreeing to settlements were Khalid al-Tuwaijri, head of the royal court under the late King Abdullah, and Prince Turki bin Nasser, who was involved in a massive arms sale that led to corruption probes in the U.K. and the U.S., one of the government officials said. \nSeveral of those released from detention earlier appear to be returning to their lives as usual. Among them is former finance minister and minister of state, Ibrahim al-Assaf, who recently led Saudi Arabia’s delegation to the World Economic Forum in Davos, Switzerland. \n“If they can just go back to their old jobs, it would appear that the campaign was just a warning signal, and an effort to raise money,” said Gregory Gause, a professor of international affairs and Saudi specialist at Texas A&M University. “If that is all that it was, I wonder if anything will change.” \nFor more on Saudi Arabia’s crackdown, click here Lack of Transparency \nThe identities of the detainees and some of the allegations against them were leaked to media, but few details have been provided on their cases or on the settlements many have reached since then. Critics say Prince Mohammed initiated the drive to intimidate potential opponents and consolidate his grip on the country. Government officials have denied that accusation. \n“The end of the current phase of the corruption campaign during Davos is signaling a shift in Saudi strategy for welcoming investors who have been deeply disturbed by this episode,” said Theodore Karasik, a senior adviser at Gulf State Analytics in Washington. Settlement Terms \nThe allegations against Prince Alwaleed were never formally made public, though a senior official told Bloomberg at the time of his detention that he was accused of money laundering, bribery and extortion. The billionaire maintained his innocence in his interview with Reuters, saying all his dealings had been appropriate and that it was “very important to come out of this clean and pure.” \nThe senior official said he couldn’t confirm or deny if the prince had been found innocent. \n“Settlements don’t happen unless the accused acknowledges violations and documents that in writing and pledges that he won’t repeat them,” the official said. “This is the general principle of all who were detained in corruption cases recently and not only Alwaleed bin Talal.” \nDuring his detention, the Middle East Broadcasting Center’s chairman, al-Ibrahim, was pressured by the government to give up a controlling stake in his Dubai-based company, according to two people familiar with the matter. The terms of his release aren’t clear. Al-Ibrahim will return to running the media company as usual, one of the people said, and Reuters reported that his ownership hasn’t changed, citing an official. \nThe purge has pleased some Saudis by showing that Prince Mohammed’s economic shakeup is affecting the wealthy as well as the poor, said Tom Coghlan, director for the Middle East and North Africa at K2 Intelligence in London. \nBut observers should not “underestimate the anger among the Saudi elite,” Coghlan said. “There is a significant flight-of-capital risk.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-27T14:15:00.000+02:00", "crawled": "2018-01-27T19:16:24.000+02:00", "highlightTitle": ""}