{"organizations": [], "uuid": "8710380acac5490497745622706ad73a9ec4a150", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-laredo-petroleum-announces-29-percent-growth-in-year-end-proved-reserve-estimates.html", "country": "US", "domain_rank": 767, "title": "Laredo Petroleum Announces 29% Growth in Year-End Proved Reserve Estimates", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T01:08:00.000+02:00", "replies_count": 0, "uuid": "8710380acac5490497745622706ad73a9ec4a150"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/globe-newswire-laredo-petroleum-announces-29-percent-growth-in-year-end-proved-reserve-estimates.html", "ord_in_thread": 0, "title": "Laredo Petroleum Announces 29% Growth in Year-End Proved Reserve Estimates", "locations": [], "entities": {"persons": [], "locations": [{"name": "tulsa", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "laredo petroleum", "sentiment": "negative"}, {"name": "laredo petroleum, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TULSA, OK, Jan. 24, 2018 (GLOBE NEWSWIRE) -- Laredo Petroleum, Inc. (NYSE:LPI) (\"Laredo\" or \"the Company\") today announced year-end reserve estimates and preliminary annual production for 2017, selected preliminary and unaudited operating results for the fourth quarter of 2017 and its 2018 capital budget and production forecast. The Company also announced preliminary results for its commodity derivatives for fourth-quarter and full-year 2017, basic and diluted shares outstanding and that it will host a conference call on February 15, 2018 to discuss its fourth-quarter and full-year 2017 financial and operating results.\nYear-End 2017 Reserves and Operating Results Highlights\n17% increase in production in 2017 to a Company record 21.3 million barrels of oil equivalent (\"MMBOE\") 36% organic growth in proved developed reserves, an increase of 50 MMBOE 336% of production replaced organically with proved developed reserves at a proved developed finding and development (\"F&D\") cost, a non-GAPP financial measure, of $7.90 per BOE 81% increase in the value of the Company's reserves to approximately $1.8 billion\nPlease see supplemental financial information at the end of this news release for the calculation of the non-GAAP financial measure.\n\"Laredo's 2017 development plan generated impressive results,\" stated Randy A. Foutch, Chairman and CEO. \"Above type curve productivity, on average, from the 62 horizontal wells completed during the year drove our 17% production growth, impressive proved developed finding and development costs and preliminary field-level returns on invested capital exceeding 30%. We were able to achieve all of this while continuing to test completion design, well spacing and new areas and landing points.\"\n\"Initial confirmatory data from recent spacing tests has the potential to positively impact long-term corporate-level returns and value creation,\" continued Mr. Foutch. \"Our 2018 development program is expected to capitalize upon the 2017 testing program while generating greater than 10% production growth and aligning capital expenditures with operating cash flow by the end of the year. Expected operational efficiencies from increased development density in our premium Upper and Middle Wolfcamp formations anchor this concept. Larger well packages targeting these formations, well productivity in-line with our type curve, longer lateral lengths and measured increases in activity are anticipated drivers of accelerated value creation in 2018 and beyond.\"\nReserves\nThe value of Laredo's proved reserves increased to approximately $1.8 billion at year-end 2017, an 81% increase from year-end 2016. The increase in value of the Company's total proved reserves was driven by a 29% increase in proved reserve volumes and wellhead product price increases of 24% for oil and 57% for natural gas liquids, which combined represent 68% of the Laredo's total proved reserves.\nConsistent with the booking methodology for proved undeveloped (\"PUD\") reserves Laredo adopted at year-end 2015, the Company booked a minimal number of PUD locations. For year-end 2017, the Company booked 26 PUD locations, a decrease from 31 locations booked at year-end 2016, although estimated reserves associated with PUD bookings only decreased by 1 MMBOE from year-end 2016. All 31 PUD locations booked at year-end 2016 were drilled and converted to proved developed locations in 2017.\nChanges in total proved reserves for 2017 are summarized in the following table:\nNatural Oil Oil NGL Gas Equivalents (1) (MMBbls) (MMBbls) (Bcf) (MMBOE) Beginning of year - December 31, 2016 64 50 317 167 Revisions of previous estimates 10 13 74 35 Extensions, discoveries and other additions 15 10 60 35 Sales of reserves in place — — — — Production (9 ) (6 ) (36 ) (21 ) End of year - December 31, 2017 (1) 79 67 415 216 Standardized measure of discounted future net cash flows - ($ millions) $ 1,770 (1) Figures may not add due to rounding.\nLaredo added proved developed reserves of 71 MMBOE during 2017, including increases due to positive pricing and performance revisions. Proved developed reserve additions replaced 336% of Company-record production and were added at a preliminary proved developed F&D cost of $7.90 per BOE. At year-end 2017, proved developed reserves represented 89% of the Company's total proved reserves by volume and 94% by value.\n2018 Capital Budget\nLaredo's Board of Directors has approved a $555 million capital budget for 2018, excluding acquisitions. The budget includes approximately $470 million for drilling and completions activities and approximately $85 million for production facilities, land and other capitalized costs. The budget is based on an average of approximately $600,000 per well in anticipated savings from the utilization of in-basin sand, performance improvements and completion design changes and assumes current service cost pricing.\nThe Company continues to increase operational efficiencies. The budgeted 2018 development plan increases activity levels from 2017 based on completed lateral feet while utilizing, on average, fewer drilling rigs. Laredo is currently operating three horizontal rigs and expects to increase to four horizontal rigs in the second half of 2018. In 2018, Laredo anticipates completing 60-65 net wells with an average completed lateral length of 10,400 feet.\nLaredo's current 2018 development plan primarily targets the Company's premium Upper and Middle Wolfcamp formations. Knowledge gained from the accelerated 2017 testing program will be applied to new well packages as the Company designs spacing tests that co-develop multiple landing zones in the Upper and Middle Wolfcamp formations. The 2018 development plan is expected to generate both liquids and total production growth of more than 10% compared to full-year 2017 volumes.\nThe Company's 2018 budget is based on benchmark pricing of $55 per barrel for oil and $3 per thousand cubic feet for natural gas. Laredo expects cash flow from operations to fund capital expenditures by the end of 2018.\nFourth-Quarter 2017 Operational Update\nIn the fourth quarter of 2017, the Company completed 18 wells and had total capital expenditures of approximately $182 million. The completion total was less than anticipated due to increased cycle time that shifted some completions from the fourth quarter of 2017 into early 2018. The increased cycle time was related to testing new landing points and drilling in a new area of our western Glasscock acreage. As the Company accelerates development activities in the area and operations are optimized, cycle time is expected to benefit.\nTotal production in the fourth quarter of 2017 was a Company record 61,922 BOE per day, comprised of 43% oil, 28% NGL and 29% natural gas. In addition to delays pushing well completions later into the quarter and into 2018, production was adversely impacted by two horizontal wells in the Company's western Glasscock acreage that encountered operational issues, resulting in permanently reduced production from those wells.\nAlthough management does not expect these numbers to change, they are preliminary and unaudited.\nTax Rate Change\nIn response to recent changes in the tax code, the Company will modify its statutory tax rate to 22% in its calculation of Adjusted EPS, a non-GAAP financial measure, beginning in the fourth quarter of 2017. Previously, Laredo included at statutory tax rate of 36%.\nCommodity Derivatives Update\nFor the three months ended December 31, 2017, Laredo paid approximately $9.5 million of net cash settlements on matured derivatives, including associated premiums paid. For the fourth quarter of 2017, the Company expects to report a loss on derivatives of approximately $37.8 million, reflecting both matured and new contracts and future market prices in the forward curves of oil, natural gas liquids and natural gas. For the 12 months ended December 31, 2017, Laredo received approximately $16.0 million of net cash settlements on matured derivatives and early terminations of derivative contracts, net of premiums paid. For full-year 2017, the Company expects to report a gain on derivatives of approximately $0.3 million, reflecting both matured and new contracts and future market prices in the forward curves of oil, natural gas liquids and natural gas. Although management does not expect these numbers to change, they are preliminary and unaudited.\nLaredo maintains a disciplined hedging program to reduce the variability in its anticipated cash flow due to fluctuations in commodity prices. The Company utilizes a combination of puts, swaps and collars, entering into contracts solely with banks that are part of its Senior Secured Credit Facility. Laredo currently has hedges in place for approximately 90% of anticipated oil production in 2018 and has increased oil hedges through 2020. Laredo has also entered into NGL and natural gas hedges through 2018 and basis hedges through 2019. Details of the Company's hedge position are included in the YE-17 Reserves & 2018 Budget Presentation available on the Company's website at www.laredopetro.com .\nLaredo records all derivatives on its balance sheet as either assets or liabilities measured at their estimated fair value. Laredo has not designated any derivatives as hedges for accounting purposes and Laredo does not enter into such instruments for speculative trading purposes. Gain (loss) on derivatives is reported under \"Non-operating income (expense)\" in Laredo's consolidated statement of operations.\nWeighted-Average Shares Outstanding\nFor the three months ended December 31, 2017, basic and diluted weighted-average shares outstanding were approximately 239.332 million and 240.289 million, respectively. For the 12 months ended December 31, 2017, basic and diluted weighted-average shares outstanding were approximately 239.096 million and 240.122 million, respectively.\nFourth-Quarter and Full-Year 2017 Earnings Conference Call\nLaredo plans to release complete fourth-quarter and full-year 2017 earnings on Wednesday, February 14, 2018 after the market close and the Company will host a conference call on Thursday, February 15, 2018 at 7:30 a.m. CT (8:30 a.m. ET) to discuss its fourth-quarter and full-year 2017 financial and operating results. Individuals who would like to participate on the call should dial 877.930.8286 (international dial-in 253.336.8309), using conference code 2795428 or listen to the call via the Company's website at www.laredopetro.com , under the tab for \"Investor Relations.\" A telephonic replay will be available approximately two hours after the call on February 15, 2018 through Thursday, February 22, 2018. Participants may access this replay by dialing 855.859.2056, using conference code 2795428.\nAbout Laredo\nLaredo Petroleum, Inc. is an independent energy company with headquarters in Tulsa, Oklahoma. Laredo’s business strategy is focused on the acquisition, exploration and development of oil and natural gas properties and the gathering of oil and liquids-rich natural gas from such properties, primarily in the Permian Basin of West Texas.\nAdditional information about Laredo may be found on its website at www.laredopetro.com .\nForward-Looking Statements\nThis press release and any oral statements made regarding the subject of this release, including in the conference call referenced herein, contain forward-looking statements as defined under Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. All statements, other than statements of historical facts, that address activities that Laredo assumes, plans, expects, believes, intends, projects, estimates or anticipates (and other similar expressions) will, should or may occur in the future are forward-looking statements. The forward-looking statements are based on management’s current belief, based on currently available information, as to the outcome and timing of future events.\nGeneral risks relating to Laredo include, but are not limited to, the decline in prices of oil, natural gas liquids and natural gas and the related impact to financial statements as a result of asset impairments and revisions to reserve estimates, the increase in service costs, the impact of Laredo's sale of its interest in the Medallion-Midland Basin pipeline system, hedging activities, possible impacts of pending or potential litigation and other factors, including those and other risks described in its Annual Report on Form 10-K for the year ended December 31, 2016, and those set forth from time to time in other filings with the Securities and Exchange Commission (\"SEC\"). These documents are available through Laredo’s website at www.laredopetro.com under the tab “Investor Relations” or through the SEC’s Electronic Data Gathering and Analysis Retrieval System at www.sec.gov . Any of these factors could cause Laredo’s actual results and plans to differ materially from those in the forward-looking statements. Therefore, Laredo can give no assurance that its future results will be as estimated. Laredo does not intend to, and disclaims any obligation to, update or revise any forward-looking statement.\nThe SEC generally permits oil and natural gas companies, in filings made with the SEC, to disclose proved reserves, which are reserve estimates that geological and engineering data demonstrate with reasonable certainty to be recoverable in future years from known reservoirs under existing economic and operating conditions and certain probable and possible reserves that meet the SEC’s definitions for such terms. In this press release and the conference call, the Company may use the terms “resource potential” and “estimated ultimate recovery,” or \"EURs,\" each of which the SEC guidelines restrict from being included in filings with the SEC without strict compliance with SEC definitions. These terms refer to the Company’s internal estimates of unbooked hydrocarbon quantities that may be potentially added to proved reserves, largely from a specified resource play. A resource play is a term used by the Company to describe an accumulation of hydrocarbons known to exist over a large areal expanse and/or thick vertical section potentially supporting numerous drilling locations, which, when compared to a conventional play, typically has a lower geological and/or commercial development risk. EURs are based on the Company’s previous operating experience in a given area and publicly available information relating to the operations of producers who are conducting operations in these areas. Unbooked resource potential or EURs do not constitute reserves within the meaning of the Society of Petroleum Engineer’s Petroleum Resource Management System or SEC rules and do not include any proved reserves. Actual quantities of reserves that may be ultimately recovered from the Company’s interests may differ substantially from those presented herein. Factors affecting ultimate recovery include the scope of the Company’s ongoing drilling program, which will be directly affected by the availability of capital, decreases in oil and natural gas prices, drilling costs and production costs, availability of drilling services and equipment, drilling results, lease expirations, transportation constraints, regulatory approvals, negative revisions to reserve estimates and other factors as well as actual drilling results, including geological and mechanical factors affecting recovery rates. Estimates of unproved reserves may change significantly as development of the Company’s core assets provides additional data. In addition, our production forecasts and expectations for future periods are dependent upon many assumptions, including estimates of production decline rates from existing wells and the undertaking and outcome of future drilling activity, which may be affected by significant commodity price declines or drilling cost increases.\nLaredo Petroleum, Inc.\nSupplemental non-GAAP financial measure\nNon-GAAP financial measure\nThe non-GAAP financial measure of proved developed Finding & Development Cost, as defined by us, may not be comparable to similarly titled measures used by other companies. Therefore, this non-GAAP measure should be considered in conjunction with net income or loss and other performance measures prepared in accordance with GAAP, such as operating income or loss or cash flow from operating activities. Proved developed Finding and Development Cost should not be considered in isolation or as a substitute for GAAP measures, such as net income or loss, operating income or loss, standardized measure of discounted future net cash flows or any other GAAP measure of liquidity or financial performance.\nProved Developed Finding and Development Cost (Unaudited)\nProved developed finding and development (\"F&D\") cost is calculated by dividing (x) development costs for the period, by (y) proved developed reserve additions for the period, defined as the change in proved developed reserves, less purchased reserves, plus sold reserves and plus sales volumes during the period. The method we use to calculate our proved developed F&D cost may differ significantly from methods used by other companies to compute similar measures. As a result, our proved developed F&D cost may not be comparable to similar measures provided by other companies. We believe that providing the measure of proved development F&D cost is useful in evaluating the cost, on a per BOE basis, to added proved developed reserves.\nHowever, this measure is provided in addition to, and not as an alternative for, and should be read in conjunction with, the information contained in our financial statements prepared in accordance with GAAP. Due to various factors, including timing differences in the addition of proved reserves and the related costs to develop those reserves, proved developed F&D cost do not necessarily reflect precisely the costs associated with particular proved reserves. As a result of various factors that could materially affect the timing and amounts of future increases in proved reserves and the timing and amounts of future costs, we cannot assure you that our future proved developed F&D cost will not differ materially from those presented.\n(dollars in millions, except per BOE amount, reserves and sales volumes in MMBOE) Proved developed\nF&D Development costs (x) $ 561 Proved developed reserves: As of December 31, 2017 191 As of December 31, 2016 (141 ) Change in proved developed reserves 50 Plus sales of proved developed reserves during 2017 — Plus 2017 sales volumes 21 Proved developed reserve additions (y) 71 Proved developed F&D cost per BOE $ 7.90 Contacts:\nRon Hagood: (918) 858-5504 - RHagood@laredopetro.com\n18-1\nSource:Laredo Petroleum, Inc.", "external_links": ["https://www.globenewswire.com/Tracker?data=LptNoV5l9TtqqIFZk1-mCcPTJ-cE2U1DBPalLg8B5mUQ9K0rPFtJ8stByNpGkVixvWinnXB973wjyv4p4PzizEKpeOn38ts3r_bdUCegogA=", "https://www.globenewswire.com/Tracker?data=LptNoV5l9TtqqIFZk1-mCTN7M9x8Ds8c9iOM2-6tFnkzimj_tm2x2QeGEoTk7eAUL_csaZTN1NlV3dp3JQ_tUdeuObkQhEKhRM3VBebvwlg=", "https://www.globenewswire.com/Tracker?data=DRCp8z-UFctXZspCGakD1vudK1KiPCsks0X62oBHkwZB4Cj9vgCWtri0egeWqjbSqqec-A-cdRuNONywxhPaCA==", "https://www.globenewswire.com/Tracker?data=LptNoV5l9TtqqIFZk1-mCYHvtQGulFoIjxsrWnhPRrcfyN604EVHknm_9QSyWV9V5AprVFT5lyUV6h5fAqT4hsPd3YIG2Yf085p2zxaC7bM=", "https://www.globenewswire.com/Tracker?data=LptNoV5l9TtqqIFZk1-mCenp0mH0Ar51BzMwf4kkOh9a6cIf28GmQtOQvFmu4PkjviEqn3fPYjnev3dUWqHUXhfuscxg3rDEi_STyYK97io=", "https://www.globenewswire.com/Tracker?data=P17dtP0Bs7sDEgUVmaU7RyYhEaO7Ofs-RLWfOFv3HCfHFcuoeyoGEpYa0y3KEs5FsaViMbZrA_4Jf-1JfGtVxWHOvB9Rbm8nH9aH5hWWu4g="], "published": "2018-01-25T01:08:00.000+02:00", "crawled": "2018-01-25T01:50:15.011+02:00", "highlightTitle": ""}