{"organizations": [], "uuid": "becdd6d46bf3ced597c8d77c98ebf2f616c360a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/business-wire-carl-buddig-and-company-expands-manufacturing-footprint-in-illinois.html", "country": "US", "domain_rank": 767, "title": "Carl Buddig and Company Expands Manufacturing Footprint in Illinois", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.447, "site_type": "news", "published": "2018-01-22T18:32:00.000+02:00", "replies_count": 0, "uuid": "becdd6d46bf3ced597c8d77c98ebf2f616c360a6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/business-wire-carl-buddig-and-company-expands-manufacturing-footprint-in-illinois.html", "ord_in_thread": 0, "title": "Carl Buddig and Company Expands Manufacturing Footprint in Illinois", "locations": [], "entities": {"persons": [{"name": "carl buddig", "sentiment": "negative"}], "locations": [{"name": "illinois", "sentiment": "none"}, {"name": "il", "sentiment": "none"}, {"name": "montgomery", "sentiment": "none"}], "organizations": [{"name": "company expands manufacturing footprint in illinois company purchases montgomery", "sentiment": "negative"}, {"name": "rupari food services", "sentiment": "none"}, {"name": "business wire", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Company Purchases Montgomery, Illinois, Facility to Meet the Growing Demands of Customers\nCHICAGO--(BUSINESS WIRE)-- Carl Buddig and Company has acquired an additional manufacturing facility in Montgomery, Illinois. The location is the company’s fourth manufacturing site in the state. Production at the 280,000-square-foot facility will begin this spring. The sale closed on January 19th, and the acquisition will expand the Carl Buddig Illinois-based workforce to more than 1,800 employees. Previously, in June 2017, the company purchased Rupari Food Services in a bankruptcy sale that saved the jobs of 200 employees\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180122006106/en/\nRendering of the new Montgomery, IL, manufacturing facility for Carl Buddig and Company. Production at the 280,000-square-foot site will begin this spring. (Photo: Business Wire)\n“Expanding our manufacturing footprint to relieve pressure from current facilities and add capacity to address growing production demands from our customers has been a #1 priority for the company,” said Bob Buddig, CEO of Carl Buddig and Company. Buddig added, “When the Montgomery facility became available, we jumped on the opportunity immediately. The new plant enables the company to significantly expand production of existing products and new products to be developed in the future.”\nTom Buddig, Executive Vice President of Marketing of Carl Buddig and Company commented, “It is fitting the company is undertaking this expansion in the same year of celebrating its 75 Anniversary. Servicing our customers’ needs and serving up great tastes for consumers got us to where we are today. This expansion is an important step in making sure this continues and prepares our family owned company for the next 75 years and generations to follow.”\n“It is also important to note the expansion will create an additional 250 to 300 jobs in the coming year,” commented Dan Wynn, Chief Operating Officer of Carl Buddig and Company. Wynn added, “We are not simply transferring jobs from our current facilities. We are creating new jobs to accommodate growth and work more efficiently. Buddig’s Corporate office will remain in Homewood, IL, and production will continue in all of the South Holland, IL, facilities.”\nKaren Noble, Executive Vice President of Human Resources added, “Since the Montgomery facility was previously used as meat processing plant before closing in July 2017, we believe there may be a number of trained and qualified workers living in the area. We have already posted open job positions for the new Montgomery location on the Careers page of our Buddig.com website. We encourage anyone interested in working at the new Montgomery location to apply.”\nAbout Carl Buddig and Company\nCarl Buddig and Company, based in Homewood, Illinois, is owned and operated by third generation Buddig Family members. The Company is also proud that in recent years fourth generation family members have also joined the organization. In 2018, Carl Buddig and Company will celebrate its 75 th year of feeding family traditions with the very best in taste, variety and convenience. In addition to manufacturing and distributing great-tasting lunch meat products, Carl Buddig and Company is also the parent company responsible for manufacturing and distribution of Old Wisconsin® hardwood-smoked sausage and meat snack products in supermarkets across the country. In June 2017, Carl Buddig and Company entered the barbecue and specialty meats business and is now manufacturing products under the Kingsford Brand. To learn more, please visit www.buddig.com and www.oldwisconsin.com and www.KingsfordBBQMeats.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180122006106/en/\nNicole Friedman\nJacobson/Rost\n(312) 274-3343\nNFriedman@JacobsonRost.com\nSource: Carl Buddig and Company", "external_links": ["http://www.businesswire.com/news/home/20180122006106/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.buddig.com%2F&esheet=51746725&newsitemid=20180122006106&lan=en-US&anchor=Carl+Buddig+and+Company&index=1&md5=257654d7bcfc0496a96cee542e7ba77a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.oldwisconsin.com%2F&esheet=51746725&newsitemid=20180122006106&lan=en-US&anchor=www.oldwisconsin.com&index=4&md5=d6c724ed7ef841abaf3941a2cb3a1260", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.buddig.com%2F&esheet=51746725&newsitemid=20180122006106&lan=en-US&anchor=Buddig.com&index=2&md5=b58bbe5585e7df03d27d28959fecffca", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.buddig.com%2F&esheet=51746725&newsitemid=20180122006106&lan=en-US&anchor=www.buddig.com&index=3&md5=81212789e793fbe65342587580db1541", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.KingsfordBBQMeats.com&esheet=51746725&newsitemid=20180122006106&lan=en-US&anchor=www.KingsfordBBQMeats.com&index=5&md5=0527a38004b39905b622cc15b95c77cd"], "published": "2018-01-22T18:32:00.000+02:00", "crawled": "2018-01-22T20:27:36.000+02:00", "highlightTitle": ""}