{"organizations": [], "uuid": "e42df15473c1e9596992d1abdcd422b8e160c90a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-green-bancorp-inc-announces-fourth-quarter-and-full-year-2017-financial-results-release-date-and-conference-call.html", "country": "US", "domain_rank": 767, "title": "Green Bancorp, Inc. Announces Fourth Quarter and Full Year 2017 Financial Results Release Date and Conference Call", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T00:05:00.000+02:00", "replies_count": 0, "uuid": "e42df15473c1e9596992d1abdcd422b8e160c90a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/globe-newswire-green-bancorp-inc-announces-fourth-quarter-and-full-year-2017-financial-results-release-date-and-conference-call.html", "ord_in_thread": 0, "title": "Green Bancorp, Inc. Announces Fourth Quarter and Full Year 2017 Financial Results Release Date and Conference Call", "locations": [], "entities": {"persons": [], "locations": [{"name": "houston", "sentiment": "none"}], "organizations": [{"name": "green bancorp, inc", "sentiment": "neutral"}, {"name": "green bancorp, inc.", "sentiment": "neutral"}, {"name": "green bank", "sentiment": "none"}, {"name": "green bancorp fourth quarter", "sentiment": "none"}, {"name": "eastern time", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON, Jan. 11, 2018 (GLOBE NEWSWIRE) -- Green Bancorp, Inc. (NASDAQ:GNBC), the bank holding company that operates Green Bank, N.A., today announced that the company will release its fourth quarter and full year 2017 results after the market close on Thursday, January 25, 2018 and will host a conference call at 5:00 p.m. (Eastern Time) on the same day.\nThe conference call can be accessed live by dialing 1-877-407-0789, or for international callers, 1-201-689-8562, and requesting to be joined to the Green Bancorp Fourth Quarter and Full Year 2017 Earnings Conference Call. A replay will be available starting at 8:00 p.m. (Eastern Time) on January 25, 2018 and can be accessed by dialing 1-844-512-2921, or for international callers, 1-412-317-6671. The passcode for the replay is 13675213. The replay will be available until 11:59 p.m. (Eastern Time) on February 1, 2018.\nInterested investors and other parties may also listen to a simultaneous webcast of the conference call by logging onto the investor relations section of the company's website at investors.greenbank.com . The on-line replay will remain available for a limited time beginning immediately following the call.\nTo learn more about Green Bancorp, please visit the company's website at www.greenbank.com . Green Bancorp uses its website as a channel of distribution for material company information. Financial and other material information regarding Green Bancorp is routinely posted on the company's website and is readily accessible.\nAbout Green Bancorp, Inc.\nHeadquartered in Houston, Green Bancorp, Inc. is a bank holding company that operates Green Bank, N.A., in Houston, Dallas and Austin. Commercial-focused, Green Bank is a federally chartered bank regulated by the Office of the Comptroller of the Currency, a division of the Department of the Treasury of the United States.\nForward Looking Statements\nThe information presented herein and in other documents filed with or furnished to the Securities and Exchange Commission (the “SEC”), in press releases or other public shareholder communications, or in oral statements made with the approval of an authorized executive officer contains forward looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 giving Green Bancorp’s expectations or predictions of future financial or business performance or conditions. Forward-looking statements are typically identified by words such as “believe,” “expect,” “anticipate,” “intend,” “target,” “estimate,” “continue,” “positions,” “prospects” or “potential,” by future conditional verbs such as “will,” “would,” “should,” “could” or “may”, or by variations of such words or by similar expressions. These forward-looking statements are subject to numerous assumptions, risks and uncertainties which change over time. Forward-looking statements speak only as of the date they are made and we assume no duty to update forward-looking statements.\nYou are cautioned not to place undue reliance on any forward-looking statements, which speak only as of the date such statements are made. These statements may relate to future financial performance, strategic plans or objectives, revenues or earnings projections, or other financial information. By their nature, these statements are subject to numerous uncertainties that could cause actual results to differ materially from those anticipated in the statements. Statements about the expected timing, completion and effects of the proposed transactions and all other statements in this release other than historical facts constitute forward-looking statements.\nIn addition to factors previously disclosed in Green Bancorp’s reports filed with the SEC and those identified elsewhere in this communication, the following factors among others, could cause actual results to differ materially from forward-looking statements: difficulties and delays in integrating the Green Bancorp and Patriot businesses or fully realizing cost savings and other benefits; business disruption following the merger; changes in asset quality and credit risk; the inability to sustain revenue and earnings growth; changes in interest rates and capital markets; inflation; customer borrowing, repayment, investment and deposit practices; customer disintermediation; the introduction, withdrawal, success and timing of business initiatives; competitive conditions; the inability to realize cost savings or revenues or to implement integration plans and other consequences associated with mergers, acquisitions and divestitures; economic conditions; and the impact, extent and timing of technological changes, capital management activities, and other actions of the Federal Reserve Board and legislative and regulatory actions and reforms.\nMedia Contact:\nMike Barone\n713-275-8243\nmbarone@greenbank.com\nInvestor Relations:\n713-275-8220\ninvestors@greenbank.com\nSource:Green Bancorp, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/8a00f7b1-a6e1-48fc-9108-a4dd0dbbb3ed"], "published": "2018-01-12T00:05:00.000+02:00", "crawled": "2018-01-12T02:38:26.000+02:00", "highlightTitle": ""}