{"organizations": [], "uuid": "2f42c58d12d48a3aacb4283d1dad36e83a4745ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/25/104968238-physical_therapist1.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/29/13-jobs-that-will-help-you-get-in-shape.html", "country": "US", "domain_rank": 767, "title": "13 jobs that will help you get in shape", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T19:31:00.000+02:00", "replies_count": 0, "uuid": "2f42c58d12d48a3aacb4283d1dad36e83a4745ce"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/29/13-jobs-that-will-help-you-get-in-shape.html", "ord_in_thread": 0, "title": "13 jobs that will help you get in shape", "locations": [], "entities": {"persons": [{"name": "glassdoor", "sentiment": "none"}], "locations": [{"name": "america", "sentiment": "none"}, {"name": "glassdoor", "sentiment": "none"}], "organizations": [{"name": "colarelli construction", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "If one of your new year's resolutions is to get in shape and another is to find a new job, why not combine the two?! There are plenty of professions that won't leave you stuck behind a desk, but instead will keep you on your feet moving and feeling physically fit. Here are 13 jobs that pay well and pay off when it comes to keeping you in shape. Apply now and get the compensation and the body you've always dreamed of!\nConstruction Project Manager Average base pay: $110,263\nJob description: Think there's no money in construction? Think again. As a Construction Project Manager , you could pull in six figures as you supervise the teams that build structures like houses, office buildings, bridges and more on site, which will definitely keep you active. And perhaps just as exciting, this job ranked among Glassdoor's Best Jobs in America in 2017.\nCompanies hiring: S3 Builders , Colarelli Construction , Feldco Factory Direct & more\nMore from Glassdoor: \n20 companies hiring for the best jobs In America \n8 signs you're the toxic co-worker in the office \nHere's what the perfect resume looks like \nProduction Assistant Average base pay: $39,184\nJob description: If you're interested in making it big in film or television, working as a Production Assistant (PA) is one of the best ways to launch your career. As a PA, you'll be running around all day (or night) doing everything from going on coffee runs to assisting with props — whatever it takes to keep the production going smoothly.\nCompanies hiring: NBC , CGI Communications , History Channel & more\nshow chapters SNL star Sasheer Zamata explains why office jobs gave her an edge in showbiz      10:31 AM ET Tue, 2 May 2017 | 01:03 Nurse Average base pay: $65,976\nJob description: While it will require a degree and licensure, becoming a nurse is a great option for those interested in healthcare, helping others and well-paying jobs. Besides going from room to room to assist patients, you'll likely also be doing physical activities like lifting or moving patients and administering medication.\nCompanies hiring: US Department of Veteran Affairs , Kaiser Permanente , Carolinas HealthCare System and more\nWarehouse Worker Average base pay: $28,979\nJob description: Many of these jobs will keep you fit, but this job might just make you buff. As a Warehouse Worker , you won't just be on your feet — you'll be regularly lifting, organizing and handling (sometimes heavy) packages.\nCompanies hiring: Target , Mattress Warehouse , Penske Logistics and more\nLand Surveyor Average base pay: $59,350\nJob description: Land surveyors prepare sites for construction by making precise measurements to determine property boundaries. It is as much mathematical as it is physical. Surveyors need the ability to cut brush using chain saw or machete; ability to dig with a shovel or digging bars; ability to walk and hike through rough terrain, snow, and ice.\nCompanies hiring: DOWL , Pape-Dawson Engineers , National Grid USA and more\nshow chapters High-paying jobs that make getting a graduate degree worth it      9:51 AM ET Wed, 5 April 2017 | 00:50 Electrician Average base pay: $52,621\nJob description: Electricians are specialized handymen (and women!) who design, install, maintain and troubleshoot electrical wiring systems. As such, electricians must be in good shape to reach high places and the low places in a home or business to install wiring.\nCompanies hiring: X3 Tradesmen, Specialty Granules, Arandell, Pechanga Resort and Casino and more.\nOutdoor Education Instructor Average pay: $300 per week\nJob description: High energy and endurance are a must to be an outdoor education instructor . Add to that a love for working with kids, an interest in experiential education, enthusiasm for hard work, and a ton of patience.\nCompanies hiring: YMCA, REI, North Carolina State University and more\nSurgeon Average base pay: $273,922\nJob description: Standing on your feet for hours at a turn, holding your arms and hands in very precise positions to meticulously cut, sew, adjust and mend — a surgeon is perhaps one of the most physically and mentally demanding jobs around.\nCompanies hiring: Veterans Administration, Northeastern Vermont Regional Hospital, Vohra Wound Physicians and more\nFirefighter Average Base Pay: $52,103\nJob Description: Firefighters fight to minimize loss of life and property in the event of fire. They control and extinguish fires, and serve as a fully trained member of a firefighting crew and serves as a team member. They must be physically able to operate a variety of machines, tools and equipment which includes a motor vehicle, computer, generator, fire pump, fire hydrant, axe, shovel, hydraulic tools, power tools, hand tools, medical equipment, etc.\nCompanies Hiring: City of Brentwood, TN; City of Portsmouth, NH; Del-Jen ; and more\nProperty manager Average base pay: $50,764\nJob description: In addition to managing tenants and leases, property managers are regularly tasked with walking the property regularly, overseeing maintenance work, inspecting the property and performing light housekeeping as needed.\nCompanies hiring: New Land Enterprises, Bold Property Management, Drucker and Falk LLC and more\nshow chapters These are the best colleges for jobs in tech      1:31 PM ET Tue, 23 May 2017 | 01:01 Massage therapist Average base pay: $41,729\nJob description: One of the most overlooked job requirements of being a massage therapist is the physical rigor involved in the profession. Imagine kneading dough for 6 to 8 hours a day? Working on a patient to alleviate muscle tension, pain, stiffness or just to provide relaxation requires you to be healthy and fit, and take care of your own wrists, elbows, shoulders and back.\nCompanies hiring: Massage Retreat & Spa, St. Croix Hospice, Breckenridge Grand Vacations and more\nDog walker Average base pay: $24,000\nJob description: In addition to loving dogs and being comfortable with dogs of all shapes and sizes, dog walkers must be able to keep up with the physical demands of being on your feet and walking for much of the day. Plus, walkers need to be able to cope with inclement weather (rain, snow, cold, or heat wave, you can walk through it all).\nCompanies hiring: Wag!, Barkly Pets, Out-U-Go, NYC Pooch and more\nPhysical therapist Average base pay: $69,464\nJob description: An important member of treatment, rehabilitation, and prevention plans, they help individuals manage pain and improve movement from injuries caused by accidents, injuries related to work or sports, or from fractures and sprains, arthritis, neurological disorders, and other chronic conditions. Needless to say, you'll get a work out as you're working out your patients.\nCompanies hiring: MedCare Pediatric Group, Veterans Administration, Capital Region Medical Center and more\nLike this story? Like CNBC Make It on Facebook ! \nDon't miss: Hundreds of people have applied for these 3 jobs working for the royal family \nThis article originally appeared on Glassdoor. \nshow chapters These are the best and worst paying jobs in America ranked by state      1:48 PM ET Fri, 2 June 2017 | 01:00", "external_links": [], "published": "2018-01-29T19:31:00.000+02:00", "crawled": "2018-01-29T21:05:22.028+02:00", "highlightTitle": ""}