{"organizations": [], "uuid": "a46757eb8f8e243cd0a0aeaf2a07f13cf58f8d8e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-preferred-apartment-communities-inc-announces-acquisition-of-a-class-a-office-property-in-atlanta-georgia-through-its-wholly.html", "country": "US", "domain_rank": 767, "title": "Preferred Apartment Communities, Inc. Announces Acquisition of a Class A Office Property in Atlanta, Georgia Through its Wholly-Owned Subsidiary, Preferred Office Properties, LLC", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-30T00:20:00.000+02:00", "replies_count": 0, "uuid": "a46757eb8f8e243cd0a0aeaf2a07f13cf58f8d8e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-preferred-apartment-communities-inc-announces-acquisition-of-a-class-a-office-property-in-atlanta-georgia-through-its-wholly.html", "ord_in_thread": 0, "title": "Preferred Apartment Communities, Inc. Announces Acquisition of a Class A Office Property in Atlanta, Georgia Through its Wholly-Owned Subsidiary, Preferred Office Properties, LLC", "locations": [], "entities": {"persons": [{"name": "boone dupree", "sentiment": "none"}], "locations": [{"name": "atlanta", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "llc atlanta", "sentiment": "none"}, {"name": "buckhead", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "midtown atlanta", "sentiment": "none"}], "organizations": [{"name": "preferred office properties", "sentiment": "neutral"}, {"name": "preferred apartment communities, inc.", "sentiment": "neutral"}, {"name": "preferred apartment communities, inc", "sentiment": "neutral"}, {"name": "nyse", "sentiment": "neutral"}, {"name": "llc", "sentiment": "none"}, {"name": "pac", "sentiment": "none"}, {"name": "ups", "sentiment": "none"}, {"name": "armour yards", "sentiment": "none"}, {"name": "j.p. morgan asset management", "sentiment": "none"}, {"name": "coyote logistics", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA, Jan. 29, 2018 /PRNewswire/ -- Preferred Apartment Communities, Inc. (NYSE: APTS) (\"PAC\" or the \"Company\") today announced that it acquired four recently delivered Class A adaptive re-use office buildings totaling approximately 186,779 square feet in a development known as Armour Yards from Third & Urban and institutional investors advised by J.P. Morgan Asset Management. Armour Yards is strategically located directly between Buckhead and Midtown Atlanta. The buildings together are 96% leased to a diverse mix of credit-worthy tenants led by Coyote Logistics, a subsidiary of UPS, with a weighted average remaining lease term of more than seven years. The acquisition increases the size of our office portfolio to five assets totaling more than 1.5 million square feet across the Southeast and Texas.\nPAC acquired this asset through its wholly-owned subsidiary, Preferred Office Properties, LLC. Boone DuPree, the Chief Executive Officer of Preferred Office Properties stated, \"Armour Yards is a high quality development that gives us exposure to a growth segment of the market by catering to customers that want a different workplace experience from the traditional glass tower. This acquisition provides us the opportunity to invest in an asset having a stable, impressive rent roll and located in what we believe is an irreplaceable infill site.\" Mr. DuPree added, \"Third & Urban and J.P. Morgan developed a first class project and we are pleased to continue their vision.\"\nThe Company financed the acquisition utilizing a non-recourse first mortgage loan from John Hancock. The first mortgage loan is approximately $40.0 million, bears interest at a fixed rate of 4.10% per annum, has a ten-year term and amortizes beginning in year three based on a 30-year schedule. There are no loan guaranties provided by PAC or our operating partnership.\nAbout Preferred Office Properties, LLC\nPreferred Office Properties, LLC is a wholly-owned subsidiary of Preferred Apartment Communities Inc., formed in 2016 to invest in Class A office properties across the U.S. The company sources portfolio assets through acquisitions of operating properties as well as strategic, structured participation in new development.\nAbout Preferred Apartment Communities, Inc.\nPreferred Apartment Communities, Inc. is a Maryland corporation formed primarily to acquire and operate multifamily properties in select targeted markets throughout the United States. As part of our business strategy, we may enter into forward purchase contracts or purchase options for to-be-built multifamily communities and we may make real estate related loans, provide deposit arrangements, or provide performance assurances, as may be necessary or appropriate, in connection with the development of multifamily communities and other properties. As a secondary strategy, we may acquire or originate senior mortgage loans, subordinate loans or real estate loans secured by interests in multifamily properties, membership or partnership interests in multifamily properties and other multifamily related assets and invest a lesser portion of our assets in other real estate related investments, including other income-producing property types, senior mortgage loans, subordinate loans or real estate loans secured by interests in other income-producing property types, membership or partnership interests in other income-producing property types as determined by our manager as appropriate for us. At September 30, 2017, the Company was the approximate 97.5% owner of Preferred Apartment Communities Operating Partnership, L.P., the Company's operating partnership. Preferred Apartment Communities, Inc. has elected to be taxed as a real estate investment trust under the Internal Revenue Code of 1986, as amended, commencing with its tax year ended December 31, 2011. Learn more at www.pacapts.com .\nForward-Looking Statements\nThis press release may contain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. These statements may be identified by the use of forward-looking terminology such as \"may\", \"trend\", \"will\", \"expects\", \"plans\", \"estimates\", \"anticipates\", \"projects\", \"intends\", \"believes\", \"goals\", \"objectives\", \"outlook\" and similar expressions. Because such statements include risks, uncertainties and contingencies, actual results may differ materially from the expectations, intentions, beliefs, plans or predictions of the future expressed or implied by such forward-looking statements. These risks, uncertainties and contingencies include, but are not limited to, those disclosed in PAC's filings with the Securities and Exchange Commission. PAC undertakes no obligation to update these forward-looking statements to reflect events or circumstances after the date hereof or to reflect the occurrence of unanticipated events, except as may be required by law.\nAdditional Information\nThe SEC has declared effective the registration statement (including prospectus) filed by the Company for each of the offerings to which this communication may relate. Before you invest, you should read the final prospectus, and any prospectus supplements, forming a part of the registration statement and other documents the Company has filed with the SEC for more complete information about the Company and the offering to which this communication may relate. In particular, you should carefully read the risk factors described in the final prospectus and in any related prospectus supplement and in the documents incorporated by reference in the final prospectus and any related prospectus supplement to which this communication may relate. You may obtain these documents for free by visiting EDGAR on the SEC website at www.sec.gov . Alternatively, the Company or its dealer manager, Preferred Capital Securities, LLC, with respect to PAC's mShares Redeemable Preferred Stock Offering and Series A Redeemable Preferred Stock and Warrant Unit Offering, and JonesTrading Institutional Services LLC, with respect to PAC's ATM Common Stock Offering, will arrange to send you a prospectus if you request it by calling Leonard A. Silverstein at (770) 818-4100, 3284 Northside Parkway NW, Suite 150, Atlanta, Georgia 30327.\nThe ATM Common Stock Offering prospectus supplement, dated July 10, 2017, including a base prospectus, dated May 17, 2016, can be accessed through the following link:\nhttps://www.sec.gov/Archives/edgar/data/1481832/000148183217000110/atmprospectusspring2017.htm\nThe mShares Redeemable Preferred Stock Offering prospectus, dated January 19, 2017, can be accessed through the following link:\nhttps://www.sec.gov/Archives/edgar/data/1481832/000148183217 8/a424prospectus-mshares1.htm\nThe Series A Redeemable Preferred Stock and Warrant Unit Offering prospectus, dated March 16, 2017, can be accessed through the following link:\nhttps://www.sec.gov/Archives/edgar/data/1481832/000148183217000061/a424prospectus-15bseriesar.htm\nView original content with multimedia: http://www.prnewswire.com/news-releases/preferred-apartment-communities-inc-announces-acquisition-of-a-class-a-office-property-in-atlanta-georgia-through-its-wholly-owned-subsidiary-preferred-office-properties-llc-300589541.html\nSOURCE Preferred Apartment Communities, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/preferred-apartment-communities-inc-announces-acquisition-of-a-class-a-office-property-in-atlanta-georgia-through-its-wholly-owned-subsidiary-preferred-office-properties-llc-300589541.html", "https://www.sec.gov/Archives/edgar/data/1481832/000148183217000008/a424prospectus-mshares1.htm", "http://www.pacapts.com/", "https://www.sec.gov/Archives/edgar/data/1481832/000148183217000061/a424prospectus-15bseriesar.htm", "http://www.sec.gov/", "https://www.sec.gov/Archives/edgar/data/1481832/000148183217000110/atmprospectusspring2017.htm"], "published": "2018-01-30T00:20:00.000+02:00", "crawled": "2018-01-30T03:41:58.059+02:00", "highlightTitle": ""}