{"organizations": [], "uuid": "590303bbffeeaebe4af63a502ba34c7dbc974c76", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-russia-chechnya-rights/activists-sound-alarm-after-chechnya-detains-human-rights-group-head-idUKKBN1EZ15B", "country": "US", "domain_rank": 408, "title": "Activists sound alarm after Chechnya detains human rights group head", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T13:21:00.000+02:00", "replies_count": 0, "uuid": "590303bbffeeaebe4af63a502ba34c7dbc974c76"}, "author": "", "url": "https://uk.reuters.com/article/uk-russia-chechnya-rights/activists-sound-alarm-after-chechnya-detains-human-rights-group-head-idUKKBN1EZ15B", "ord_in_thread": 0, "title": "Activists sound alarm after Chechnya detains human rights group head", "locations": [], "entities": {"persons": [{"name": "andrew osborn", "sentiment": "none"}, {"name": "oyub titiev", "sentiment": "none"}, {"name": "natalia estemirova", "sentiment": "none"}, {"name": "titiev", "sentiment": "none"}], "locations": [{"name": "chechnya", "sentiment": "none"}], "organizations": [{"name": "min read  moscow", "sentiment": "none"}, {"name": "interior ministry", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 11:22 AM / Updated 11 minutes ago Activists sound alarm after Chechnya detains human rights group head Andrew Osborn 3 Min Read \nMOSCOW (Reuters) - Rights activists said on Wednesday they suspected a set-up, a day after police in Chechnya detained a human rights activist, saying they had found a substance in his car that smelled like marijuana, a crime punishable by up to 10 years in jail. \nChechnya’s interior ministry said in a statement on Tuesday police had detained Oyub Titiev, who runs the office of the Memorial Human Rights Centre in Chechnya, which has reported disappearances, torture, and punitive house burnings in the internal majority-Muslim Russian republic. \nTitiev’s predecessor, Natalia Estemirova, was kidnapped and shot dead in 2009. Nobody has been convicted for her murder. Titiev continued her work, despite colleagues saying he received threats to desist. \nThe interior ministry said police had found what looked like 180 grams of cannabis in Titiev’s car after stopping him to check his documents. The substance has been sent for checks, it said. \nThe illegal possession of such a quantity of cannabis is punishable with a jail term of between three and 10 years and a fine. Titiev says the drugs were planted. \nKatya Sokirianskaia, director at the Conflict Analysis and Prevention Centre and someone with extensive experience working in the region, told Reuters Titiev’s detention looked like an attempt to squeeze Memorial and “all remaining seeds of activism” out of Chechnya. U.S. SANCTIONS \nCritics have accused the Kremlin of turning a blind eye to rights abuses in Chechnya saying it values stability above the rule of law. Chechnya fought two wars against Russia after the 1991 Soviet collapse, but now, in return for generous subsidies and a wide degree of autonomy, pledges loyalty to Moscow. \nA Kremlin spokesman on Wednesday referred a question about Titiev’s case to the police, saying specific allegations against the activist had been made. \nSokirianskaia said Chechen officials had stepped up their rhetoric against rights defenders after the United States in December sanctioned Ramzan Kadyrov, the Kremlin-backed head of Chechnya, for alleged rights abuses. \nKadyrov was removed from the Facebook and Instagram social networks as a result, platforms he used assiduously for public relations purposes. \n“The Chechen authorities directly blamed human rights defenders for this,” said Sokirianskaia. \nKadyrov, who calls himself a foot soldier of President Vladimir Putin, denies any abuses, casting his critics as being motivated by foreign grants and a desire to weaken Russia. \nTanya Lokshina, of New York-based Human Rights Watch, said framing people for drug crimes had ”become an increasingly frequent tactic used by Chechnya’s authorities“ to punish and discredit their critics.” \nNils Muiznieks, the Council of Europe’s commissioner for human rights, called on Russia to free Titiev immediately, saying he’d been detained “under dubious charges that lack credibility.” Editing by Richard Balmforth", "external_links": [], "published": "2018-01-10T13:21:00.000+02:00", "crawled": "2018-01-10T13:36:48.000+02:00", "highlightTitle": ""}