{"organizations": [], "uuid": "e6b297adaf3e8619e52de76aa9c2ac7b545cc4a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/pr-newswire-fda-approves-first-treatment-for-breast-cancer-with-a-certain-inherited-genetic-mutation.html", "country": "US", "domain_rank": 767, "title": "FDA approves first treatment for breast cancer with a certain inherited genetic mutation", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.102, "site_type": "news", "published": "2018-01-12T17:39:00.000+02:00", "replies_count": 0, "uuid": "e6b297adaf3e8619e52de76aa9c2ac7b545cc4a8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/pr-newswire-fda-approves-first-treatment-for-breast-cancer-with-a-certain-inherited-genetic-mutation.html", "ord_in_thread": 0, "title": "FDA approves first treatment for breast cancer with a certain inherited genetic mutation", "locations": [], "entities": {"persons": [{"name": "richard pazdur", "sentiment": "none"}, {"name": "lynparza", "sentiment": "none"}], "locations": [{"name": "md.", "sentiment": "none"}], "organizations": [{"name": "fda", "sentiment": "negative"}, {"name": "u.s. food and drug administration", "sentiment": "negative"}, {"name": "center for drug evaluation and research", "sentiment": "none"}, {"name": "oncology center of excellence", "sentiment": "none"}, {"name": "office of hematology and oncology products", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SILVER SPRING, Md., Jan. 12, 2018 /PRNewswire-USNewswire/ -- The U.S. Food and Drug Administration today expanded the approved use of Lynparza (olaparib tablets) to include the treatment of patients with certain types of breast cancer that have spread (metastasized) and whose tumors have a specific inherited (germline) genetic mutation, making it the first drug in its class (PARP inhibitor) approved to treat breast cancer, and it is the first time any drug has been approved to treat certain patients with metastatic breast cancer who have a \"BRCA\" gene mutation. Patients are selected for treatment with Lynparza based on an FDA-approved genetic test, called the BRACAnalysis CDx.\n\"This class of drugs has been used to treat advanced, BRCA-mutated ovarian cancer and has now shown efficacy in treating certain types of BRCA-mutated breast cancer,\" said Richard Pazdur, M.D., director of the FDA's Oncology Center of Excellence and acting director of the Office of Hematology and Oncology Products in the FDA's Center for Drug Evaluation and Research. \"This approval demonstrates the current paradigm of developing drugs that target the underlying genetic causes of a cancer, often across cancer types.\"\nBreast cancer is the most common form of cancer in the United States. The National Cancer Institute at the National Institutes of Health estimates approximately 252,710 women will be diagnosed with breast cancer this year, and 40,610 will die of the disease. Approximately 20-25 percent of patients with hereditary breast cancers and 5-10 percent of patients with any type of breast cancer have a BRCA mutation. BRCA genes are involved with repairing damaged DNA and normally work to prevent tumor development. However, mutations of these genes may lead to certain cancers, including breast cancers.\nLynparza is a PARP (poly ADP-ribose polymerase) inhibitor that blocks an enzyme involved in repairing damaged DNA. By blocking this enzyme, DNA inside the cancerous cells with damaged BRCA genes may be less likely to be repaired, leading to cell death and possibly a slow-down or stoppage of tumor growth. Lynparza was first approved by the FDA in 2014 to treat certain patients with ovarian cancer and is now indicated for the treatment of patients with germline breast cancer susceptibility gene (BRCA) mutated, human epidermal growth factor receptor 2 (HER2)-negative metastatic breast cancer, who have been previously treated with chemotherapy. Patients with hormone receptor (HR)-positive breast cancer should have been treated with a prior hormonal (endocrine) therapy or be considered inappropriate for endocrine treatment.\nToday, the FDA also expanded the approval of the BRACAnalysis CDx, an approved companion diagnostic to Lynparza, to include the detection of BRCA mutations in blood samples from patients with breast cancer.\nThe safety and efficacy of Lynparza for the treatment of breast cancer was based on a randomized clinical trial of 302 patients with HER2-negative metastatic breast cancer with a germline BRCA mutation. The trial measured the length of time the tumors did not have significant growth after treatment (progression-free survival). The median progression-free survival for patients taking Lynparza was 7 months compared to 4.2 months for patients taking chemotherapy only.\nCommon side effects of Lynparza include low levels of red blood cells (anemia), low levels of certain white blood cells (neutropenia, leukopenia), nausea, fatigue, vomiting, common cold (nasopharyngitis), respiratory tract infection, influenza, diarrhea, joint pain (arthralgia/myalgia), unusual taste sensation (dysgeusia), headache, indigestion (dyspepsia), decreased appetite, constipation and inflammation and sores in the mouth (stomatitis).\nSevere side effects of Lynparza include development of certain blood or bone marrow cancers (myelodysplastic syndrome/acute myeloid leukemia) and inflammation in the lungs (pneumonitis). Lynparza can cause harm to a developing fetus; women should be advised of the potential risk to the fetus and to use effective contraception. Women taking Lynparza should not breastfeed as it could cause harm to a newborn baby.\nThis application was granted Priority Review , under which the FDA's goal is to take action on an application within 6 months where the agency determines that the drug, if approved, would significantly improve the safety or effectiveness of treating, diagnosing or preventing a serious condition.\nLynparza is also approved for the treatment of patients with BRCA-mutated, advanced ovarian cancer who have received three or more treatments of chemotherapy, and for the maintenance treatment of patients with recurrent epithelial ovarian, fallopian tube or primary peritoneal cancer whose tumors have completely or partially responded to chemotherapy.\nThe FDA granted the approval of Lynparza to AstraZeneca Pharmaceuticals LP. The approval of the BRACAnalysis CDx was granted to Myriad Genetic Laboratories, Inc.\nFor more information:\nFDA: Office of Hematology and Oncology Products\nFDA: Approved Drugs: Questions and Answers\nFDA: Fast Track, Breakthrough Therapy, Accelerated Approval, Priority Review\nNIH: Breast Cancer\nThe FDA, an agency within the U.S. Department of Health and Human Services, protects the public health by assuring the safety, effectiveness, and security of human and veterinary drugs, vaccines and other biological products for human use, and medical devices. The agency also is responsible for the safety and security of our nation's food supply, cosmetics, dietary supplements, products that give off electronic radiation, and for regulating tobacco products.\nMedia Inquiries: Angela Stark, 301-796-0397, angela.stark@fda.hhs.gov\nConsumer Inquiries: 888-INFO-FDA\nView original content with multimedia: http://www.prnewswire.com/news-releases/fda-approves-first-treatment-for-breast-cancer-with-a-certain-inherited-genetic-mutation-300581977.html\nSOURCE U.S. Food and Drug Administration", "external_links": ["http://www.fda.gov/Drugs/ResourcesForYou/Consumers/ucm054420.htm", "http://www.fda.gov/ForPatients/Approvals/Fast/ucm405405.htm", "https://www.fda.gov/ForPatients/Approvals/Fast/default.htm", "http://www.fda.gov/AboutFDA/CentersOffices/OfficeofMedicalProductsandTobacco/CDER/ucm091745.htm", "https://www.cancer.gov/types/breast", "http://www.prnewswire.com/news-releases/fda-approves-first-treatment-for-breast-cancer-with-a-certain-inherited-genetic-mutation-300581977.html"], "published": "2018-01-12T17:39:00.000+02:00", "crawled": "2018-01-12T17:41:15.005+02:00", "highlightTitle": ""}