{"organizations": [], "uuid": "f319a41d24067c896334829ee6ab0cb427acb650", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220583474&w=1200&r=LYNXMPEE0814Z", "site_section": "http://feeds.reuters.com/Reuters/PoliticsNews", "section_title": "Reuters: Politics", "url": "https://www.reuters.com/article/us-usa-politics-arpaio/former-arizona-sheriff-arpaio-says-running-for-u-s-senate-idUSKBN1EY1Z3", "country": "US", "domain_rank": 408, "title": "Former Arizona Sheriff Arpaio says running for U.S. Senate", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T18:40:00.000+02:00", "replies_count": 0, "uuid": "f319a41d24067c896334829ee6ab0cb427acb650"}, "author": "", "url": "https://www.reuters.com/article/us-usa-politics-arpaio/former-arizona-sheriff-arpaio-says-running-for-u-s-senate-idUSKBN1EY1Z3", "ord_in_thread": 0, "title": "Former Arizona Sheriff Arpaio says running for U.S. Senate", "locations": [], "entities": {"persons": [{"name": "arpaio", "sentiment": "negative"}, {"name": "blake brittain", "sentiment": "none"}, {"name": "joe arpaio", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "jeff flake", "sentiment": "none"}, {"name": "tim ahmann", "sentiment": "none"}], "locations": [{"name": "arizona", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "u.s. senate", "sentiment": "negative"}, {"name": "make america great again", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Joe Arpaio, a former Arizona sheriff known for his tough stance on illegal immigration and a close ally of President Donald Trump, said on Tuesday he would run for the U.S. Senate to replace Trump critic Jeff Flake, a fellow Republican who is retiring.\n“I am running for the U.S. Senate from the Great State of Arizona, for one unwavering reason: to support the agenda and policies of President Donald Trump in his mission to Make America Great Again,” Arpaio said on Twitter.\nHe promised in an email to supporters that he would represent “a conservative vote” on which Trump, a fellow Republican, could count.\nHis candidacy added a twist to the hopes of the Democratic Party in one of only two Republican-held Senate seats Democrats see as possible to flip in November’s midterm elections. Republicans hold a 51-49 edge in the U.S. Senate.\nArpaio, 85, was convicted in July of criminal contempt of court in a racial profiling case that highlighted tensions over U.S. immigration policy, but was pardoned by Trump the following month. The pardon\nA federal judge had ruled that Arpaio wilfully violated a 2011 injunction barring his officers from detaining Latino drivers solely on the suspicion that they were in the county illegally.\nThe U.S. Department of Justice said in a 2011 report that Arpaio had nurtured a culture in his office of racially discriminating against Latinos in breach of the U.S Constitution, a charge Arpaio denied.\nArpaio, who dubbed himself “the toughest sheriff in America,” lost a bid for re-election in 2016 in Arizona’s Maricopa County, one of the largest counties in the United States, after 24 years in office.\nHis tenure, including his hard stance on illegal immigration, made him one of the most widely known sheriffs in the country. He reinstated chain gangs, made inmates wear uniforms that were pink or had old-fashioned black-and-white stripes and forbade them coffee, salt and pepper.\nFILE PHOTO: Maricopa County Sheriff Joe Arpaio arrives at a campaign rally for Republican U.S. Presidential candidate Donald Trump in Phoenix, Arizona, U.S. June 18, 2016. REUTERS/Nancy Wiechec/File Photo Flake said in October he would step down from his Arizona seat in a speech on the Senate floor, criticizing Trump’s manner of governing as “reckless, outrageous and undignified” and saying he felt out of step with the rest of his party.\nFlake, speaking to reporters at the U.S. Capitol on Tuesday, was dismissive of Arpaio’s Senate bid, the Washington Examiner reported.\n“Write about it fast because it won’t last long,” the paper Quote: d Flake as saying.\nFILE PHOTO: Maricopa County, Arizona, Sheriff Joe Arpaio speaks in front of an image of a border fence during the last day of the Republican National Convention in Cleveland, Ohio, U.S. July 21, 2016. REUTERS/Mike Segar Arpaio, in his email to supporters, said he would defend gun owners, oppose abortion and work to reduce the national debt.\nKrysten Sinema, a Democrat who was the first openly bisexual person elected to Conress, is hoping to flip the seat to her party in November.\nKelli Ward, a former doctor and Arizona state senator, positioned her candidacy as a Republican to the right of Flake, but may now find herself overshadowed by Arpaio’s candidacy at the primary contests in August.\n“Joe Arpaio has 100 percent name recognition with voters,” Stan Barnes, a Republican political strategist in Arizona, said in a telephone interview. “And for all intents and purposes he’s going to be wearing a Donald Trump mask and run as if he is Donald Trump, and with that added together he cannot be dismissed as a candidate.”\nWard has “great respect” for Arpaio and welcomed him to the race, her campaign chairman, Ed Rollins, said in a statement.\n“His candidacy shows that conservatives in Arizona are fed up with the status quo and know that we need senators who support President Trump and the (president‘s) America First agenda,” Rollins said.\nMartha McSally, a Republican congresswoman for the state seen as a more moderate candidate by the national party, is due to announce her run for Flake’s seat on Friday, CNN reported on Tuesday.\nReporting by Jonathan Allen in New York and Blake Brittain in Washington; editing by Susan Thomas and Jonathan Oatis\n ", "external_links": [], "published": "2018-01-09T18:40:00.000+02:00", "crawled": "2018-01-09T18:57:32.032+02:00", "highlightTitle": ""}