{"organizations": [], "uuid": "e96b0a27af58b2c08872619cfb84f7b4d622c5c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180127&t=2&i=1225850832&w=1200&r=LYNXMPEE0Q0R7", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-volkswagen-emissions-monkey-study/german-carmakers-condemn-use-of-monkeys-in-diesel-fumes-study-idUKKBN1FG0W8", "country": "US", "domain_rank": 408, "title": "German carmakers condemn use of monkeys in diesel fumes study", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T22:22:00.000+02:00", "replies_count": 0, "uuid": "e96b0a27af58b2c08872619cfb84f7b4d622c5c0"}, "author": "", "url": "https://uk.reuters.com/article/uk-volkswagen-emissions-monkey-study/german-carmakers-condemn-use-of-monkeys-in-diesel-fumes-study-idUKKBN1FG0W8", "ord_in_thread": 0, "title": "German carmakers condemn use of monkeys in diesel fumes study", "locations": [], "entities": {"persons": [], "locations": [{"name": "frankfurt", "sentiment": "none"}, {"name": "new mexico", "sentiment": "none"}, {"name": "albuquerque", "sentiment": "none"}], "organizations": [{"name": "daimler", "sentiment": "none"}, {"name": "european research group on environment and health", "sentiment": "none"}, {"name": "volkswagen", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "eugt", "sentiment": "none"}, {"name": "bmw", "sentiment": "none"}, {"name": "lrri", "sentiment": "none"}, {"name": "lovelace respiratory research institute", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 27, 2018 / 8:25 PM / Updated 16 minutes ago German carmakers condemn use of monkeys in diesel fumes study Reuters Staff 3 Min Read \nFRANKFURT (Reuters) - German carmakers Daimler ( DAIGn.DE ) BMW ( BMWG.DE ) and Volkswagen ( VOWG_p.DE ) on Saturday denounced a scientific experiment which exposed monkeys to toxic diesel fumes, the latest aftershock from an exhaust-rigging scandal rocking the auto industry. \nThe New York Times on Friday said German carmakers had used the European Research Group on Environment and Health in the Transport Sector, also known as EUGT, to commission a study designed to defend the use of diesel following revelations that the fuel’s exhaust fumes were carcinogenic. \nThe EUGT commissioned the Lovelace Respiratory Research Institute (LRRI) in Albuquerque, New Mexico, which then designed an experiment where monkeys squatted in airtight chambers, inhaling fumes from a diesel Volkswagen Beetle, the New York Times reported. \nEUGT received all of its funding from Volkswagen, Daimler and BMW, the New York Times said. It remains unclear whether the carmakers were aware of monkeys being used in the experiments conducted by EUGT. \nGerman carmakers on Saturday condemned the use of animals in the experiment. \n“Volkswagen Group explicitly distances itself from all forms of animal cruelty. Animal testing contradicts our own ethical standards,” VW said, adding it apologised for the misconduct and lack of judgment shown by individuals. \nThe EUGT study was ended June 30, 2017, and its findings had never been published, VW said. Slideshow (3 Images) \nRival carmakers joined in the condemnation. \n“The BMW Group in no way influenced the design or methodology of studies carried out on behalf of the EUGT,” BMW said, adding it does not carry out experiments involving animals and had no direct role in this study. \nThe New York Times said the study had been conducted in 2014. \nDaimler, parent company of the Mercedes-Benz brand said, “We distance ourselves from the LRRI study done under EUGT.” the Stuttgart-based carmaker said it was conducting a review to understand how the experiment had been commissioned. \n“Daimler does not tolerate or support unethical treatment of animals,” the carmaker said, adding that it felt such an experiment was abhorrent and superfluous. \nThe EUGT research was designed to counter a 2012 decision by the World Health Organization to classify diesel exhaust as a carcinogen, the New York Times said. \nIn 2015, Volkswagen admitted to using illegal “defeat devices” to mask higher pollution levels by installing software to detect when a car was being tested in a lab. \nThe automakers’ research group was created in 2007, as Volkswagen was readying a major push to market diesel technology in the United States, the New York Times said, adding that the car used in the EUGT experiment was equipped with illegal cheating software. Reporting by Edward Taylor, editing by Louise Heavens", "external_links": [], "published": "2018-01-27T22:22:00.000+02:00", "crawled": "2018-01-27T22:46:30.021+02:00", "highlightTitle": ""}