{"organizations": [], "uuid": "30e4c2cb8a542323db5885087403ed6f60427eac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 60, "shares": 60, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/19/104956148-6ED3-REQ-TRUMP-011918.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/20/white-house-blames-shutdown-on-obstructionist-loser-democrats.html", "country": "US", "domain_rank": 767, "title": "White House blames shutdown on 'obstructionist loser' Democrats", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T13:38:00.000+02:00", "replies_count": 0, "uuid": "30e4c2cb8a542323db5885087403ed6f60427eac"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/20/white-house-blames-shutdown-on-obstructionist-loser-democrats.html", "ord_in_thread": 0, "title": "White House blames shutdown on 'obstructionist loser' Democrats", "locations": [], "entities": {"persons": [{"name": "sarah huckabee sanders", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "white house", "sentiment": "none"}], "organizations": [{"name": "white house", "sentiment": "negative"}, {"name": "congress", "sentiment": "negative"}, {"name": "deferred action for childhood arrivals", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Even before the official deadline for Congress to keep the government open passed at 12:01 a.m. ET Saturday, the White House had put out a statement blaming the shutdown on Democrats — \"obstructionist losers.\"\nThe statement, attributed to press secretary Sarah Huckabee Sanders , declared that the White House would not \"negotiate the status of unlawful immigrants\" until Democrats agreed to pass a bill to reopen the government.\nThat's a reference to the negotiations over the fate of the 690,000 young unauthorized immigrants facing the loss of their protections from deportation as the Deferred Action for Childhood Arrivals program is wound down. President Trump himself upended those negotiations last week, and they haven't advanced enough since to convince either party that it was worth keeping the government open to let them conclude.\nTrump has often seemed less anxious to avoid a shutdown than might be expected. In the days leading up to this shutdown, his White House was as likely to preemptively blame Congress as to try to work toward a solution.\nThis is the One Year Anniversary of my Presidency and the Democrats wanted to give me a nice present. #DemocratShutdown\n— Donald J. Trump (@realDonaldTrump) January 20, 2018 While Trump likes to claim the brand of a dealmaker, the tendency to blame first and ask questions later has been a hallmark of his presidency — and we're about to see what happens to that in the context of a government shutdown, in which an issue is on the line that pits public opinion and bipartisan sympathy against the ideology that has claimed Trump as its standard-bearer.\nThe full White House statement:\n\"Senate Democrats own the Schumer Shutdown. Tonight, they put politics above our national security, military families, vulnerable children, and our country's ability to serve all Americans. We will not negotiate the status of unlawful immigrants while Democrats hold our lawful citizens hostage over their reckless demands. This is the behavior of obstructionist losers, not legislators. When Democrats start paying our armed forces and first responders we will reopen negotiations on immigration reform. During this politically manufactured Schumer Shutdown, the President and his Administration will fight for and protect the American people.\"", "external_links": [], "published": "2018-01-20T13:38:00.000+02:00", "crawled": "2018-01-20T14:30:39.013+02:00", "highlightTitle": ""}