{"organizations": [], "uuid": "65db12205e1aed84b4146770e72f2efaab250e97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/business-wire-txcell-announces-4th-quarter-2017-financials-and-participation-at-upcoming-scientific-conferences.html", "country": "US", "domain_rank": 767, "title": "TxCell Announces 4th Quarter 2017 Financials and Participation at Upcoming Scientific Conferences", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T19:45:00.000+02:00", "replies_count": 0, "uuid": "65db12205e1aed84b4146770e72f2efaab250e97"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/business-wire-txcell-announces-4th-quarter-2017-financials-and-participation-at-upcoming-scientific-conferences.html", "ord_in_thread": 0, "title": "TxCell Announces 4th Quarter 2017 Financials and Participation at Upcoming Scientific Conferences", "locations": [], "entities": {"persons": [], "locations": [{"name": "valbonne", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "txcell sa", "sentiment": "negative"}, {"name": "txcell", "sentiment": "none"}, {"name": "yorkville advisors global lp", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VALBONNE, France--(BUSINESS WIRE)--\nRegulatory News:\nTxCell SA (FR0010127662 – TXCL) (Paris:TXCL), a developer of cellular immunotherapies based on regulatory T cells (Tregs) for inflammation, autoimmunity and transplantation, today reports its fourth quarter 2017 financials and provides an update on its financing. Additionally, the company announces its participation in upcoming scientific conferences.\nFinancials:\nAs of December 31, 2017, TxCell’s cash and cash equivalents amounted to €4.9 million 1 (compared to €3.5 million as of December 31, 2016). This includes €1.4 million for the partial pre-funding of TxCell’s 2017 research tax credit.\nTxCell’s operating cash burn amounted to approximately €9 million for the year 2017. This is lower than the €13 million guidance previously provided by the Company, thanks to strict cost control and working capital optimization measures.\nTxCell did not generate revenues during the fourth quarter of 2017.\nFinancing:\nIn October 2017, TxCell renegotiated its OCABSA financing program with Yorkville Advisors Global LP to reduce the cost of capital for the Company and the dilution for its shareholders. The amended contract provides for a total financing of up to €15 million guaranteed in monthly installments now at TxCell’s sole discretion.\nIn January 2018, TxCell obtained an interest-free loan from Bpifrance, a French government agency, for the preclinical development of its transplantation CAR-Treg program. TxCell expects to receive the €1.2 million funding during the first quarter of 2018.\nBased on these elements, the Company considers that its resources are sufficient to finance its activities until early 2019, even if listed cash warrants issued in February 2017 are not fully exercised by February 26, 2018. This should enable the Company to reach a major milestone, the regulatory filing for the start of its first-in-man study with a CAR-Treg, which is expected in Q4 2018.\nUpcoming scientific conferences:\nIn Q1 2018, TxCell will participate in a wide range of scientific conferences, including:\nDr. Li Zhou, VP Cell Engineering of TxCell, will chair the ‘CAR-T, Tregs & Autoimmunity: Expanding the Applications of Chimeric Antigen Receptors Outside of Oncology’ session at the Combined CAR-T Congress Europe , to be held January 30-31, 2018 in Berlin, Germany. This session will take place on Tuesday, January 30, 2018 at 2:00pm local time. Dr. Megan Levings, Professor, Department of Surgery, University of British Columbia (UBC) and Head, Childhood Diseases Research Theme, BC Children's Hospital in Vancouver, Canada, will present TxCell’s most advanced CAR-Treg program targeting graft rejection at the Keystone conference: Emerging cellular therapies: T cells and beyond , to be held February 11-15, 2018 in Keystone, Colorado. Prof. Levings’ presentation, entitled: ‘HLA-A2 Directed CAR-Tregs’, will take place on Wednesday, February 14, 2018, during the morning session (8:00-11:15am local time). Dr. Pierre Heimendinger, VP Pharmaceutical Development of TxCell, will give a presentation entitled: ‘Development of first manufacturing process to produce CAR-Treg cells for clinical use’ at the CAR-TCR Summit Europe , to be held February 20-22, 2018 in London, United Kingdom. Dr. Heimendinger’s presentation will take place on Thursday, February 22, 2018 at 2:30pm local time. Stéphane Boissel, CEO of TxCell, will give a presentation, entitled: ‘CAR-Tregs: CARs for autoimmune disease’ at the Combined CAR-T Congress USA to be held on March 21-22, 2018 in Boston. Mr. Boissel’s presentation will take place on Thursday, March 22, 2018 at 2:30pm local time.\nIn addition, TxCell will sponsor the first scientific conference exclusively dedicated to Tregs, entitled: Treg Summit 2018: Treg Directed Therapies for Autoimmune Disorders . This event will be held on May 22-24, 2018 in Boston. Several attendees from TxCell will participate in this conference.\nParticipation in other events during the period will be considered depending on the timing of communicable scientific data.\nNext financial milestones\nFull-year 2017 financial results: Wednesday, March 14, 2018 (post-market) Q1 2018 financial information: Wednesday, April 25, 2018 (post-market)\nAbout TxCell – www.txcell.com\nTxCell is a biotechnology company that develops platforms for innovative, personalized T cell immunotherapies for the treatment of severe inflammatory and autoimmune diseases with high unmet medical need. TxCell is targeting transplant rejection as well as a range of autoimmune diseases (both T-cell and B-cell-mediated), including multiple sclerosis, lupus nephritis and bullous pemphigoid.\nTxCell’s cellular immunotherapies are based on regulatory T lymphocytes (Tregs). Tregs are a T cell population discovered in the nineties for which anti-inflammatory properties have been demonstrated. Contrary to conventional approaches based on non-specific polyclonal Tregs, TxCell is exclusively developing engineered antigen-specific Tregs, where the antigen specificity is brought by a Chimeric Antigen Receptor (CAR) (CAR-Treg cells).\nBased in Sophia-Antipolis, France, TxCell is listed on Euronext Paris and currently has 46 employees.\nForward-Looking Statements\nThis press release contains certain forward-looking statements relating to the business of TxCell, which shall not be considered per se as historical facts, including TxCell’s ability to develop, market, commercialize and achieve market acceptance for specific products, estimates for future performance and estimates regarding anticipated operating losses, future revenues, capital requirements, needs for additional financing. In addition, even if the actual results or development of TxCell are consistent with the forward-looking statements contained in this press release, those results or developments of TxCell may not be indicative of their in the future.\nIn some cases, you can identify forward-looking statements by words such as \"could,\" \"should,\" \"may,\" \"expects,\" \"anticipates,\" \"believes,\" \"intends,\" \"estimates,\" \"aims,\" \"targets,\" or similar words. Although the management of TxCell believes that these forward-looking statements are reasonably made, they are based largely on the current expectations of TxCell as of the date of this press release and are subject to a number of known and unknown risks and uncertainties and other factors that may cause actual results, performance or achievements to be materially different from any future results, performance or achievement expressed or implied by these forward-looking statements. In particular, the expectations of TxCell could be affected by, among other things, uncertainties involved in the development of the Company’s products, which may not succeed, or in the delivery of TxCell’s products marketing authorizations by the relevant regulatory authorities and, in general, any factor that could affects TxCell capacity to commercialize the products it develops, as well as, any other risk and uncertainties developed or identified in any public documents filed by TxCell with the AMF, included those listed in chapter 4 “Risk factors” of the 2016 document de référence (registration document) approved by the AMF on April 26, 2017 under number R.17-024. In light of these risks and uncertainties, there can be no assurance that the forward-looking statements made in this press release will in fact be realized. Notwithstanding the compliance with article 223-1 of the General Regulation of the AMF (the information disclosed must be “accurate, precise and fairly presented”), TxCell is providing the information in these materials as of this press release, and disclaims any intention or obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events, or otherwise.\n1 Unaudited data.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180124005860/en/\nTxCell\nCaroline Courme, Tel: +33(0) 4 97 21 83 00\nIR & Communication Director\ncaroline.courme@txcell.com\nor\nImage Box – Press relations\nNeil Hunter / Michelle Boxall, Tel: +44(0) 20 8943 4685\nneil.hunter@imageboxpr.co.uk\nmichelle.boxall@imageboxpr.co.uk\nor\nNewCap – Investor relations\nJulien Perez / Mathilde Bohin, Tel: +33 (0)1 44 71 98 52\ntxcell@newcap.eu\nSource: TxCell", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.txcell.com&esheet=51748310&newsitemid=20180124005860&lan=en-US&anchor=www.txcell.com&index=1&md5=cf2d4f8c4f3fc6ad5caf762c4ad3d383", "http://www.businesswire.com/news/home/20180124005860/en/"], "published": "2018-01-24T19:45:00.000+02:00", "crawled": "2018-01-24T20:59:33.031+02:00", "highlightTitle": ""}