{"organizations": [], "uuid": "18aba1e02ce0c95003ed2814470415895a6ff2da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225342668&w=1200&r=LYNXMPEE0P04S", "site_section": "https://www.reuters.com/politics", "section_title": "Politics &amp; Political News | Reuters", "url": "https://www.reuters.com/article/us-usa-immigration-trump-factbox/factbox-what-is-in-trumps-framework-for-immigration-legislation-idUSKBN1FF09C", "country": "US", "domain_rank": 408, "title": "Factbox: What is in Trump's framework for immigration legislation", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T10:33:00.000+02:00", "replies_count": 0, "uuid": "18aba1e02ce0c95003ed2814470415895a6ff2da"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-immigration-trump-factbox/factbox-what-is-in-trumps-framework-for-immigration-legislation-idUSKBN1FF09C", "ord_in_thread": 0, "title": "Factbox: What is in Trump's framework for immigration legislation", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "white house", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "white house", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - The White House on Thursday released a list of requirements for immigration legislation that it said President Donald Trump would support, offering a path to citizenship for up to 1.8 million young illegal immigrants, while tightening border security and clamping down on family sponsorship.\n“This is kind of a bottom line for the president,” a senior official told reporters, saying it would be up to lawmakers to determine some of the details. “If it’s realistic, then he’ll sign it. If it isn’t realistic, then he won’t sign it.”\nThe White House made clear that all four elements would need to be included in any bill, rejecting ideas for a narrower approach. Here is what the White House wants to see:\n“DREAMERS”\n- Expand protections from deportation to 1.8 million immigrants who were brought illegally to the country as children, up from the 700,000 people currently signed up for the program.\n- The increase would include people who were eligible for the protections but did not initially sign up. The time frame for eligibility would be adjusted to cover 1.8 million people.\n- Allow “Dreamers” to become citizens in 10 to 12 years, with to-be-determined requirements for work and education, as long as they do not commit crimes.\nBORDER SECURITY - Establish a $25 billion trust fund to pay for a wall on the southern border with Mexico and security improvements on the northern border with Canada. The trust fund would mean future Congresses could not claw back the money.\n- Agree to spend more money to hire border guards, immigration judges and other law enforcement personnel, and overhaul the hiring system and pay grades. Trump estimated that would cost $5 billion, but the White House said it was subject to further discussion.\n- Immediately deport illegal immigrants who cross the southern or northern border even if they are not from Mexico or Canada. That would affect Central American migrants who often arrive at the U.S. border after crossing through Mexico.\nFAMILY SPONSORSHIP - Limit immigration sponsorship to spouses and minor children, ending the ability to sponsor parents, older children and siblings.\n- That change would cut at least 287,700 green cards a year, according to the Migration Policy Institute.\n- The change would apply prospectively, meaning people caught in the backlog would still be processed by the old rules.\nEND DIVERSITY VISA LOTTERY - End a lottery for green cards offered to applicants from countries with low immigration rates. The program offers up to 50,000 visas a year.\nReporting by Roberta Rampton; Editing by Peter Cooney\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-26T10:33:00.000+02:00", "crawled": "2018-01-26T12:02:37.005+02:00", "highlightTitle": ""}