{"organizations": [], "uuid": "311178d71e36ad619e02588542301a1ee5dedb27", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/15/pr-newswire-vermilion-energy-inc-announces-acquisition-of-oil-assets-in-southeast-saskatchewan-and-southwest-manitoba.html", "country": "US", "domain_rank": 767, "title": "Vermilion Energy Inc. Announces Acquisition of Oil Assets in Southeast Saskatchewan and Southwest Manitoba", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T00:15:00.000+02:00", "replies_count": 0, "uuid": "311178d71e36ad619e02588542301a1ee5dedb27"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/15/pr-newswire-vermilion-energy-inc-announces-acquisition-of-oil-assets-in-southeast-saskatchewan-and-southwest-manitoba.html", "ord_in_thread": 0, "title": "Vermilion Energy Inc. Announces Acquisition of Oil Assets in Southeast Saskatchewan and Southwest Manitoba", "locations": [], "entities": {"persons": [{"name": "privateco", "sentiment": "none"}], "locations": [{"name": "southeast saskatchewan", "sentiment": "none"}, {"name": "southwest manitoba calgary", "sentiment": "none"}, {"name": "privateco", "sentiment": "none"}, {"name": "saskatchewan", "sentiment": "none"}], "organizations": [{"name": "vermilion energy inc.", "sentiment": "negative"}, {"name": "vermilion energy inc", "sentiment": "negative"}, {"name": "announces acquisition of oil assets", "sentiment": "negative"}, {"name": "privateco", "sentiment": "none"}, {"name": "tsx", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CALGARY, Jan. 15, 2018 /PRNewswire/ - Vermilion Energy Inc. (\"Vermilion\", the \"Company\", \"We\" or \"Our\") (TSX, NYSE: VET) is pleased to announce that we have entered into an arrangement agreement (the \"Arrangement\") to acquire a private southeast Saskatchewan producer (\"Privateco\") for total cash consideration of $90.8 million (the \"Purchase Price\").\nUnder the terms of the Arrangement, Vermilion has agreed to acquire (the \"Acquisition\") all of the issued and outstanding common shares (\"Privateco Shares\") in the capital of Privateco, including all Privateco Shares issuable, in accordance with the terms of existing grants of options or warrants, prior to the effective time of the Arrangement, and assume all outstanding debt of the Privateco. The Purchase Price will be funded from Vermilion's existing credit facilities.\nThe Board of Directors of Privateco has unanimously approved the Arrangement and recommended that Privateco shareholders vote in favour of the Arrangement. The Arrangement remains subject to customary closing conditions, including receipt of applicable court, Privateco shareholder and regulatory approvals, and is expected to close on or about February 15 th , 2018.\nThe Acquisition is comprised of high netback, low base decline, light oil producing fields in the Sinclair and Fertile areas, straddling the Saskatchewan/Manitoba border, approximately 55 km northeast of Vermilion's existing operations in southeast Saskatchewan (the \"Assets\"). The Assets include approximately 42,600 net acres of land (approximately 100% W.I.), three oil batteries, and associated pipelines, along with the necessary water infrastructure to facilitate the existing seven waterflood projects and initiate up to eight additional waterflood projects. The Assets produced approximately 1,150 bbl/d of 40° API oil during Q4 2017, sourced from the Bakken/Three Forks formation. All of the current production and infrastructure will be 100% owned and operated by Vermilion.\nTotal proved plus probable (\"2P\") reserves attributed to the Assets at December 31, 2017 are 6.7 (1) mmboe (100% crude oil), based on an independent evaluation by GLJ Petroleum Consultants Ltd. The Assets demonstrate a low base decline rate of approximately 15% at present, and are expected to have even lower decline rates over time. Areas under waterflood have decline rates of less than 10% with certain areas of flat or increasing production. Approximately 45% of the production comes from active waterflood projects, leaving significant opportunity to expand the waterflood.\nThe Acquisition is accretive on a fully-diluted per share basis for all pertinent metrics including production, fund flows from operations (2) , reserves and net asset value. Making no deduction for undeveloped land value, transaction metrics equate to $13.55 per boe of 2P reserves, and $79,000 per flowing barrel of production. Based on 2018 WTI strip pricing of US$61.83/bbl, the operating netback for the Assets is estimated at approximately $51.80 (2) per boe. Using the 2P finding, development and acquisition cost (based on the reserves in the GLJ report) of $19.02 per boe (including future development capital), the Assets are expected to deliver a 2P after-tax fund flows recycle ratio of 2.7 times.\nUsing the same strip pricing assumption, the total Acquisition cost (including assumed debt) is approximately 5.1 times estimated annualized 2018 fund flows from operations (\"FFO\"), after deducting incremental interest expense. Calculated on a debt-adjusted cash flow basis, the total Acquisition cost (including assumed debt) is approximately 4.6 times. Pro-forma the acquisition, our year end 2018 debt-to-FFO ratio is forecast to be 2.0 times based on January 11, 2018 strip pricing, as compared to 1.9 times prior to the acquisition.\nThe Acquisition complements our current southeast Saskatchewan operations and will be managed out of our existing field office in the area. Furthermore, the Acquisition aligns with our sustainable growth-and-income model by targeting low risk assets with high netbacks, strong free cash flow generation, low base decline rates and strong capital efficiencies on future development.\nAs a result of the Acquisition, and based on a mid-February closing date, we are revising our 2018 production guidance to between 75,000 and 77,500 boe/d (from 74,500 to 76,500 boe/d previously). We are also increasing our 2018 capital budget to $325 million (from $315 million previously) to reflect additional capital activity on these assets planned for the second half of the year.\nAbout Vermilion\nVermilion is an international energy producer that seeks to create value through the acquisition, exploration, development and optimization of producing properties in North America, Europe and Australia. Our business model emphasizes organic production growth augmented with value-adding acquisitions, along with providing reliable and increasing dividends to investors. Vermilion is targeting growth in production primarily through the exploitation of light oil and liquids-rich natural gas conventional resource plays in Canada and the United States, the exploration and development of high impact natural gas opportunities in the Netherlands and Germany, and through oil drilling and workover programs in France and Australia. Vermilion currently holds an 18.5% working interest in the Corrib gas field in Ireland. Vermilion pays a monthly dividend of Canadian $0.215 per share, which provides a current yield of approximately 5.5%.\nVermilion's priorities are health and safety, the environment, and profitability, in that order. Nothing is more important to us than the safety of the public and those who work with us, and the protection of our natural surroundings. We have been recognized as a top decile performer amongst Canadian publicly listed companies in governance practices, as a Climate Leadership level (A-) performer by the CDP, and a Best Workplace in the Great Place to Work® Institute's annual rankings in Canada, France and the Netherlands. In addition, Vermilion emphasizes strategic community investment in each of our operating areas.\nEmployees and directors hold approximately 6.5% of our fully diluted shares, are committed to consistently delivering superior rewards for all stakeholders, and have delivered over 20 years of market outperformance. Vermilion trades on the Toronto Stock Exchange and the New York Stock Exchange under the symbol VET.\nNatural gas volumes have been converted on the basis of six thousand cubic feet (\"mcf\") of natural gas to one barrel equivalent of oil. Barrels of oil equivalent (boe) may be misleading, particularly if used in isolation. A boe conversion ratio of six thousand cubic feet to one barrel of oil is based on an energy equivalency conversion method primarily applicable at the burner tip and does not represent a value equivalency at the wellhead.\n(1)\nEstimated total proved and proved plus probable reserves attributable to the Assets as evaluated by GLJ Petroleum Consultants Ltd. in a report dated January 12, 2018 with an effective date of December 31, 2017, in accordance with National Instrument 51-101 – Standards for Disclosure for Oil and Gas Activities of the Ca", "external_links": ["http://www.vermilionenergy.com/"], "published": "2018-01-16T00:15:00.000+02:00", "crawled": "2018-01-16T00:29:45.005+02:00", "highlightTitle": ""}