{"organizations": [], "uuid": "ce6e40a923c64e822ac58e439ff71f488a550417", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 2}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 2122, "shares": 2122, "comments": 1}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/04/moneygram-sign.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/11/ripple-moneygram-xrp-cryptocurrency-bank-transfers/", "country": "US", "domain_rank": 1196, "title": "Ripple, MoneyGram Announce XRP Currency Transfers | Fortune", "performance_score": 10, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.025, "site_type": "news", "published": "2018-01-11T10:59:00.000+02:00", "replies_count": 0, "uuid": "ce6e40a923c64e822ac58e439ff71f488a550417"}, "author": "Jeff John Roberts", "url": "http://fortune.com/2018/01/11/ripple-moneygram-xrp-cryptocurrency-bank-transfers/", "ord_in_thread": 0, "title": "Ripple, MoneyGram Announce XRP Currency Transfers | Fortune", "locations": [], "entities": {"persons": [{"name": "jeff john roberts", "sentiment": "negative"}, {"name": "brad garlinghouse", "sentiment": "none"}], "locations": [], "organizations": [{"name": "moneygram", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Jeff John Roberts 8:59 AM EST \nRipple, a blockchain company and rival to bitcoin, on Thursday announced a tie-up with Dallas-based money transfer giant MoneyGram. \nThe move is significant because the arrangement involves the use of XRP, Ripple’s digital currency, which has recently soared in value but also faced questions about its practical uses. \nThe partnership will see MoneyGram pilot the use of XRP through a new Ripple service, called xRapid, designed to provide liquidity to financial institutions. In a release announcing the news, the companies touted the speed and efficiency of XRP: \nXRP remains the most efficient digital asset for payments with transaction fees at just fractions of a penny, compared to Bitcoin fees of about $30 per transaction. Similarly, the average transaction time for XRP is 2-3 seconds with other top digital assets ranging from 15 minutes to an hour. \nIn a statement, Ripple CEO Brad Garlinghouse described the MoneyGram tie-up as a strategic one, and said it would demonstrate XRP’s ability to lower costs for money transfers between friends and families. \nWhile banks around the world are experimenting with blockchain (the underlying technology behind bitcoin and Ripple) to lower money transfer costs, skeptics of Ripple say its XRP currency is unnecessary to carry out transactions. \nGarlinghouse, however, makes the case that XRP obviates the need for money transfer shops to maintain local currency accounts (so-called nostro and vostro accounts) in far-flung locations. In an earlier interview , he told Fortune that the use of XRP will allow firms to free up idle capital for other purposes. \nThis notion of using digital currency as a form of bridge funding is not unique to XRP. Last year, IBM and a consortium of banks in the South Pacific announced a blockchain transfer arrangement that entails the use of a cryptocurrency called Stellar. \nFor MoneyGram, the tie-up with Ripple may provide a way to maintain its share of the money transfer market. Like its longtime rival Western Union , MoneyGram has faced competition from a new generation of low-cost Internet-based services like TransferWise. \n“Every day blockchain technology is changing the norm and encouraging innovation. Ripple is at the forefront of blockchain technology and we look forward to piloting xRapid. We’re hopeful it will increase efficiency and improve services to MoneyGram’s customers,” said CEO Alex Holmes in a statement. \nRipple’s venture with MoneyGram comes several months after the company announced a partnership with American Express (axp) . And in November, a prominent tech figure, Michael Arrington, announced the creation of a $100 million hedge fund denominated in XRP. \nIn recent weeks, Ripple has been the subject of intense scrutiny as XRP soared exponentially to briefly become the world’s second most valuable cryptocurrency after bitcoin. It reached all-time highs of over $3.50 and a market cap of over $120 billion in early January, but has since fallen more than 50%. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-11T10:59:00.000+02:00", "crawled": "2018-01-11T16:10:44.001+02:00", "highlightTitle": ""}