{"organizations": [], "uuid": "77d54ba60d3c66bcfad72b23338c276dc0994cc1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XF929_3jq5b_TOP_20180130180300.jpg", "site_section": "https://www.wsj.com/news/economy", "section_title": "Economy News - Wall Street Journal", "url": "https://www.wsj.com/articles/yellen-to-hand-off-go-slow-approach-to-rate-rises-as-she-departs-fed-1517392800", "country": "US", "domain_rank": 387, "title": "Yellen to Hand Off Go-Slow Approach to Rate Rises as She Departs Fed", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.015, "site_type": "news", "published": "2018-01-31T13:00:00.000+02:00", "replies_count": 0, "uuid": "77d54ba60d3c66bcfad72b23338c276dc0994cc1"}, "author": "Nick Timiraos", "url": "https://www.wsj.com/articles/yellen-to-hand-off-go-slow-approach-to-rate-rises-as-she-departs-fed-1517392800", "ord_in_thread": 0, "title": "Yellen to Hand Off Go-Slow Approach to Rate Rises as She Departs Fed", "locations": [], "entities": {"persons": [{"name": "yellen", "sentiment": "negative"}, {"name": "janet yellen", "sentiment": "negative"}, {"name": "jerome powell", "sentiment": "none"}], "locations": [], "organizations": [{"name": "she departs fed when federal reserve", "sentiment": "negative"}, {"name": "fed", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "10 COMMENTS As Federal Reserve Chairwoman Janet Yellen concluded her last policy meeting Wednesday with a decision to hold rates steady, she left her successor the challenge of deciding whether to pick up the pace of rate increases to prevent the economy from overheating.\nFed governor Jerome Powell, who is scheduled to be sworn in as chairman Monday, will have to weigh how closely to stick with Ms. Yellen’s approach of very gradually raising interest rates from still-low levels.\nMr. Powell’s choices could shape how history remembers Ms. Yellen’s four-year term as chief.\nIf he moves too slowly, low borrowing costs risk fueling an asset bubble like those that triggered recessions in 2001 and 2007.\nAlternately, her record could be tarnished if inflation continues to limp below the central bank’s 2% target, confounding the Fed’s forecasts and damaging officials’ credibility.\nThe Fed on Wednesday held short-term interest rates steady and said it will continue along its path of gradual increases aimed at keeping the economy on track. It offered nothing to dispel market expectations that it will deliver its next rate increase in March. Such a move would extend the central bank’s pattern, since December 2016, of announcing steps to remove economic stimulus at every other meeting.\nThe policy statement issued Wednesday made few changes from December to officials’ economic outlook and affirmed a solid outlook for U.S. growth. It offered little sign that officials’ thinking about the economy has changed materially.\nFed officials want inflation to rise to 2%, a level they view as healthy for an expanding economy, but they don’t want it to surge out of control. Policy makers have penciled in three quarter-percentage-point rate increases this year. But if they expect the tax cut to raise domestic demand without expanding the labor force or lifting workers’ productivity, which could fuel a burst of inflation, they might want to raise interest rates more.\nThe Fed held short-term rates near zero from late 2008 until late 2015. Under Ms. Yellen, who became chairwoman in February 2014, officials raised the benchmark federal-funds rate five times, most recently in December . In October, the Fed started shrinking its more than $4 trillion portfolio of bonds purchased to stimulate the economy by lowering long-term rates.\n“She guided us through an exit strategy that wasn’t straightforward,” said Boston Fed President Eric Rosengren in an interview. “We are the only central bank in the world that has successfully started the reduction” in the bond portfolio.\nRelated\nFed, Holding Rates Steady, Sees ‘Solid’ Economic Gains Parsing the Fed: How the January Statement Changed From December See Markets React to the Fed in 9 Charts Capital Account: Long After Yellen Leaves, Interest Rates Will Bear Her Mark Yellen Leaving Fed With Full Employment, but Her Legacy Still Is Being Written (Jan. 30) Jerome Powell’s Candidacy Offers Continuity in Fed Policy (Nov. 1, 2017) When Ms. Yellen became chairwoman, Fed officials were anxious to avoid a repeat of the so-called taper tantrum, the market turbulence triggered by then-Fed Chairman Ben Bernanke’s comments in May 2013 suggesting the Fed might soon slow its asset purchases.\nThe episode hung over many of Ms. Yellen policy moves as an example of the costs of imprecise communications during an unprecedented policy shift.\nIn each of her first three years as chairwoman, critics warned Ms. Yellen was risking excessive inflation by moving so slowly to raise borrowing costs. The Fed lifted rates just once in 2015 and once in 2016. Once she did start raising rates, other critics said the moves risked smothering the fitful economic recovery.\nSo far, neither outcome has materialized, which Ms. Yellen’s allies say vindicates her approach. “She held off when moving would have been a mistake, but she also correctly perceived when gradual liftoff could begin without great threat to the economy,” said Daniel Tarullo, who served as a Fed governor from 2009 until last April.\nJerome Powell testified before lawmakers during his nomination hearing to be Fed chairman last November. Now a Fed governor, he is scheduled to be sworn in as chairman Monday. Photo: MICHAEL REYNOLDS/EPA/Shutterstock The portfolio unwinding involved more than a year of discussions, focusing as much on how to communicate the plan as on what it would entail. When it was announced and launched last year, markets shrugged.\nFed officials view the reaction as a major success because it could make those programs less controversial if they are needed in the next downturn.\nOfficials appear unlikely to change the process of reducing the holdings now.\nAfter the taper tantrum, many expected the rest of the process of withdrawing economic stimulus “would be an utter nightmare,” said Andrew Levin, a Dartmouth College economist and former Fed adviser. “I’m not sure even the most optimistic person four or five years ago would have expected it would have gone this smoothly.”\nWith Jerome Powell on track to become the next chair of the Federal Reserve, here's a look back at Janet Yellen's term in the job. Photo: Getty Images (Originally published Nov. 2, 2017) President Donald Trump opted not to nominate Ms. Yellen for a second term as Fed chief, breaking with a 35-year precedent in which new presidents have offered a second term to the sitting Fed chairman regardless of party.\nStill, in picking Mr. Powell , an ally of Mr. Bernanke and then Ms. Yellen during his 5½ years on the Fed’s board, Mr. Trump signaled his preference for an evolution rather than a revolution in monetary policy.\n“There is strong consensus in the committee for the gradual approach that we’ve been pursuing, and governor Powell has been part of that consensus,” Ms. Yellen said at a December press conference.\nHistory’s view of Ms. Yellen’s record will be shaped by how Mr. Powell manages two puzzles the Fed has wrestled with over the past year.\nThe first concerns inflation, which has confounded the central bank’s expectations by running below 2% despite low unemployment and solid economic growth. If price pressures never materialize, “people will say, ‘Why did she raise rates at all?’” said Lewis Alexander, chief U.S. economist at Nomura Securities.\nThe second centers on lofty prices for stocks, real estate and other assets. It remains to be seen whether the Fed’s recent efforts to beef up bank regulation will be enough to contain wider damage to the economy if new financial bubbles crop up.\nFormer Fed Chairman Alan Greenspan left office in 2006 on a cloud of praise, only to have his performance reassessed after the housing bust set off the 2008 financial crisis.\nThe history of monetary policy includes so many unforced errors that not making one is itself an accomplishment, wrote John Cochrane, an economist at Stanford University’s Hoover Institution, reflecting on Ms. Yellen’s record last November. “Not screwing up doesn’t earn you as big a place in history,” he said, “but perhaps it should.”\nWrite to Nick Timiraos at nick.timiraos@wsj.com", "external_links": [], "published": "2018-01-31T13:00:00.000+02:00", "crawled": "2018-01-31T13:04:44.046+02:00", "highlightTitle": ""}