{"organizations": [], "uuid": "c5a6db222490f7556e3b55d8aed6e0c83aeb2b74", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2015/11/gettyimages-558175165.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/17/digital-health-bupa-healthtap/", "country": "US", "domain_rank": 1196, "title": "HealthTap, Bupa Line Up Massive Digital Health Partnership | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.15, "site_type": "news", "published": "2018-01-17T09:00:00.000+02:00", "replies_count": 0, "uuid": "c5a6db222490f7556e3b55d8aed6e0c83aeb2b74"}, "author": "Sy Mukherjee", "url": "http://fortune.com/2018/01/17/digital-health-bupa-healthtap/", "ord_in_thread": 0, "title": "HealthTap, Bupa Line Up Massive Digital Health Partnership | Fortune", "locations": [], "entities": {"persons": [{"name": "healthtap", "sentiment": "negative"}, {"name": "ron gutman", "sentiment": "none"}, {"name": "sy mukherjee", "sentiment": "none"}, {"name": "gutman", "sentiment": "none"}], "locations": [], "organizations": [{"name": "bring digital health care", "sentiment": "negative"}, {"name": "bupa line up massive digital health partnership | fortune this company", "sentiment": "negative"}, {"name": "brainstorm health daily", "sentiment": "none"}, {"name": "est  digital", "sentiment": "none"}, {"name": "healthtap", "sentiment": "none"}, {"name": "bupa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "This Company's AI-Fueled Tech Is About to Bring Digital Health Care to Millions What if your phone could be an actual online portal? Photograph by Getty Images By Sy Mukherjee 7:00 AM EST \nDigital health firm HealthTap and Bupa , a health care provider that offers both insurance and medical services to millions around the world, are teaming up in a massive strategic partnershipthat could make “digital end-to-end” medical services a widespread reality, HealthTap CEO Ron Gutman told Fortune in an early interview previewing the arrangement. \nGutman describes it as the “biggest digital health deal” he knows of. That’s a bold claim; but the company’s new partnership with Bupa can’t be easily brushed off. Bupa does both the grunt work of medical care services (through hospitals and clinics) and the more heady business of insurance; it employs about 80,000 people around the world and has a far larger consumer base that stretches across the globe. \nSubscribe to Brainstorm Health Daily , our newsletter about the most exciting health innovations. \nBy combining forces with Bupa, HealthTap’s artificial intelligence-powered services —which can allow patients to figure out whether they need to immediately go to a hospital if they’re feeling sick, access doctors through virtual visits, receive reminders about taking or refilling prescription medications, and generally keep one, unified record of their medical history—will be available to millions, according to the companies. \nThose are all goals (and technologies) that plenty of other digital health upstarts are seeking. So what makes HealthTap’s latest collaboration different? “Everything in one app,” says Gutman. He describes it as a true “end-to-end” digital service for medicine, where even the insurance part of the equation is taken care of within the app. \n“Over the past year we have worked together to implement a number of solutions for day-to-day customer needs, such as easily finding local doctors covered by Bupa insurance, scheduling physiotherapy, immunizations, and doctor visits with local clinics, and connecting residents in our care homes with doctors by video chat,” added Bupa Group CEO Evelyn Bourke in a statement. \nGutman says that one way HealthTap sets itself apart from competitors is through its near-decade-long accumulation of data, including billions of virtual medical queries answered by the more than 100,000 doctors in its network. The fact that a group of Bupa’s size is willing to take a gamble on the firm’s tech doesn’t hurt, either. \nThe big question is whether or not this collaboration will, over the long term, validate the digital health revolution’s greatest hopes—lowering costs while improving patients’ health and providing a simple interface to do so. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-17T09:00:00.000+02:00", "crawled": "2018-01-17T17:50:12.004+02:00", "highlightTitle": ""}