{"organizations": [], "uuid": "bd9c1d3a329f93cb7d3039c1f2e0f4dabf6a693f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224171663&w=1200&r=LYNXMPEE0L1CF", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-orange-deutsche-telekom-m-a/orange-deutsche-telekom-shares-rise-on-report-of-2017-merger-talks-idUSKBN1FB1VW", "country": "US", "domain_rank": 408, "title": "Orange, Deutsche Telekom shares rise on report of 2017 merger talks", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T22:25:00.000+02:00", "replies_count": 0, "uuid": "bd9c1d3a329f93cb7d3039c1f2e0f4dabf6a693f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-orange-deutsche-telekom-m-a/orange-deutsche-telekom-shares-rise-on-report-of-2017-merger-talks-idUSKBN1FB1VW", "ord_in_thread": 0, "title": "Orange, Deutsche Telekom shares rise on report of 2017 merger talks", "locations": [], "entities": {"persons": [{"name": "gwenaelle barzic", "sentiment": "none"}, {"name": "maria sheahan", "sentiment": "none"}, {"name": "julien ponthus", "sentiment": "none"}, {"name": "helen reid", "sentiment": "none"}, {"name": "mark potter", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "deutsche telekom", "sentiment": "negative"}, {"name": "deutsche telekom and orange", "sentiment": "none"}, {"name": "le monde", "sentiment": "none"}, {"name": "orange", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 2:25 PM / Updated 2 hours ago Orange, D.Telekom held 2017 merger talks, but matter 'closed': source Reuters Staff 4 Min Read \nLONDON/PARIS (Reuters) - Deutsche Telekom ( DTEGn.DE ) and France’s Orange ( ORAN.PA ) held merger talks last year that fizzled out because it was not feasible to put the companies on an equal footing, a source close to the situation said, adding the matter was now closed. \nShares in Deutsche Telekom closed up 2.1 percent at 14.735 euros, while Orange’s ended up 2.2 percent at 14.765 euros, after Le Monde newspaper reported negotiations were held between May and September. \nThe German and French governments own sizeable stakes in the respective companies and the source told Reuters that the talks ended before any bank was mandated to work on a deal. \n“It was studied by internal teams. But people quickly came to the conclusion that nothing could be done as Deutsche Telekom is far bigger than Orange,” the source said. \n“The matter is now closed,” the source added. \nDeutsche Telekom and Orange declined to comment. \nEurope’s telecoms industry is highly fragmented compared with the U.S. market, hampering the efforts of companies to increase investment at a time they face mounting competition from internet players such as Amazon and Netflix. \nA purchasing joint venture between Orange and Deutsche Telekom and some overlap in Poland, Slovakia and Romania reduce the business logic for such a deal, which would be further complicated by politics, analysts at Bernstein said. \n“Where would the headquarters be? Who would take on senior roles at board and executive level and how would a Franco/German balance be maintained over time?” they wrote in a briefing note. \nA banking source aware of the discussions said Orange and Deutsche Telekom had been talking on and off for years and that the latest round followed the May 7 election of France’s business-friendly President Emmanuel Macron. \nMacron, a former investment banker, has urged more cross-border mergers to boost Europe’s competitiveness in globalised industries and backed one politically sensitive deal that saw Germany’s Siemens ( SIEGn.DE ) and French engineering group Alstom ( ALSO.PA ) merge their rail businesses. \nAmid a renewed Franco-German push to deepen European cooperation on matters ranging from industry to defense to the euro zone, the banking source said another round of talks this year could not be ruled out. \nBut that source said a tie-up looked unlikely for now as the current size of Deutsche Telekom meant any deal would be structured as a full takeover of Orange and Paris was not yet ready to give up its telecom champion. \nDeutsche Telekom currently has a market value of around 70 billion euros, compared with about 40 billion for Orange. \nAn outline coalition agreement between German Chancellor Angela Merkel’s Christian Democrats and the Social Democratic Party (SPD) makes no mention of privatising Deutsche Telekom. \nTelecoms stocks across the region rose, with the industry’s index .SXKP closing up 1.4 percent. Reporting by Helen Reid and Pamela barbaglia in London, Gwenaelle Barzic in Paris and Douglas Busvine in Munich; Writing by Richard Lough; Editing by Mark Potter", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-22T22:25:00.000+02:00", "crawled": "2018-01-22T19:12:10.028+02:00", "highlightTitle": ""}