{"organizations": [], "uuid": "dc069aee28895ff6898f2e9b212d161ed1079111", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/business-wire-actuant-announces-executive-appointment.html", "country": "US", "domain_rank": 767, "title": "Actuant Announces Executive Appointment", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T00:30:00.000+02:00", "replies_count": 0, "uuid": "dc069aee28895ff6898f2e9b212d161ed1079111"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/business-wire-actuant-announces-executive-appointment.html", "ord_in_thread": 0, "title": "Actuant Announces Executive Appointment", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MILWAUKEE--(BUSINESS WIRE)-- Actuant Corporation (NYSE:ATU) today announced the appointment of John Jeffrey (“Jeff”) Schmaling as Executive Vice President, Industrial and Energy segments.\nMr. Schmaling brings more than 30 years of experience with industry leading international manufacturers of heavy equipment and services in the mining, construction, agricultural and industrial sectors. He most recently held the position of President, North America for Komatsu Mining Corporation (formerly Joy Global Inc.) since 2010. Prior to that, he served as Senior Director Dealer Development and Account Management at Case International Harvester, a Division of Fiat S.p.A. Earlier in his career he held various sales, marketing and product development roles. He was awarded a BS from the School of Life Sciences at the University of Illinois, Champaign-Urbana.\nRandy Baker, President and Chief Executive Officer of Actuant stated, “I am pleased to welcome Jeff to Actuant. I had the privilege of working with Jeff in the past and know firsthand his proven record of accomplishment in sales, product management, marketing, dealer development and P&L leadership achieved through a focus on building strong teams and driving ownership for safety, financial performance, continuous improvement and growth at every level of an organization. I am confident that Jeff will be instrumental in driving world class operations while delivering superior support to the end users of our mission critical products and services provided by the Energy and Industrial segment businesses.”\nAbout Actuant\nActuant Corporation is a diversified industrial company serving customers from operations in more than 30 countries. The Actuant businesses are leaders in a broad array of niche markets including branded hydraulic tools and solutions, specialized products and services for energy markets and highly engineered position and motion control systems. The Company was founded in 1910 and is headquartered in Menomonee Falls, Wisconsin. Actuant trades on the NYSE under the symbol ATU. For further information on Actuant and its businesses, visit the Company's website at www.actuant.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180125005246/en/\nActuant Corporation\nKaren Bauer\nCommunications & Investor Relations Leader\n262-293-1562\nSource: Actuant Corporation", "external_links": ["http://www.businesswire.com/news/home/20180125005246/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.actuant.com&esheet=51748625&newsitemid=20180125005246&lan=en-US&anchor=www.actuant.com&index=1&md5=6f2f3360625b69c217a86c0c6769da6f"], "published": "2018-01-26T00:30:00.000+02:00", "crawled": "2018-01-26T01:23:05.013+02:00", "highlightTitle": ""}