{"organizations": [], "uuid": "b3942e00e1164dcff9523a892c7801d53a0a9e0a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-barracuda-acquires-phishline.html", "country": "US", "domain_rank": 767, "title": "Barracuda Acquires PhishLine", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T16:00:00.000+02:00", "replies_count": 0, "uuid": "b3942e00e1164dcff9523a892c7801d53a0a9e0a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/pr-newswire-barracuda-acquires-phishline.html", "ord_in_thread": 0, "title": "Barracuda Acquires PhishLine", "locations": [], "entities": {"persons": [{"name": "barracuda", "sentiment": "none"}], "locations": [{"name": "barracuda acquires phishline campbell", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "neutral"}, {"name": "barracuda networks, inc", "sentiment": "neutral"}, {"name": "llc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CAMPBELL, Calif., Jan. 3, 2018 /PRNewswire/ -- Barracuda Networks, Inc . (NYSE: CUDA), a leading provider of cloud-enabled security and data protection solutions, today announced it has acquired PhishLine , LLC, a leading SaaS platform for social engineering simulation and training. Combining Barracuda's AI-driven protection against phishing and spear phishing with PhishLine's platform gives customers comprehensive defense against email-borne targeted attacks and social engineering.\nEmail remains the most targeted threat vector and one that requires both security technology and the human layer of defense. PhishLine offers data analytics and reporting to allow customers to measure and report on risks at macro and micro levels across the human and process layers. With this transaction, Barracuda combines gateway security, data protection, AI-based targeted threat protection, and user awareness training to deliver comprehensive protection against email-borne threats.\n\"Security awareness training is an important and quickly evolving area, particularly with increasingly targeted attacks making the human element a critical link in the security value chain,\" said BJ Jenkins, president and CEO at Barracuda. \"PhishLine has a culture of developing innovative email protection solutions, including social engineering and data analysis offerings. Combining the power of the Barracuda security technologies with PhishLine's capabilities gives us the opportunity to deliver integrated, adaptive security training aimed at preventing email security threats.\"\n\"An effective security strategy demands a collaborative effort between the employees using the network and the security technology designed to protect it,\" said Mark T. Chapman, president and CEO at PhishLine. \"Barracuda's innovations around targeted attacks, AI, archiving, and data protection complement PhishLine's solutions well. Our combined strengths offer a comprehensive, data-driven approach to help customers fight smarter, mitigate risks, eliminate threats, and gain greater peace of mind.\"\nEmail threats continue to become more targeted, making a multi-layered approach critical in successfully protecting targeted employees, applications, and data. With this acquisition, Barracuda offers a broad solution against email-borne targeted attacks and social engineering. Highlights include:\nComprehensive email protection – Barracuda provides customers comprehensive protection against email-borne threats to their businesses, including email security, data resiliency, and business continuity. Protection for people, brands, and businesses – The breadth of Barracuda's security portfolio and AI platform integrated with PhishLine's aggregated data insights and training capabilities creates a powerful combination to protect customers' technical assets, people, brands, and businesses. Continued email security innovation leadership – Barracuda was the first email security company to add advanced AI to address spear phishing and cyber fraud. The PhishLine capabilities offer customers the ability to further improve security process, accuracy, and effectiveness. Protecting customers of all sizes – Barracuda's solutions are full featured, yet elegantly simple, making them suited to protect organizations of all sizes.\nPhishLine is recognized as a Visionary within Gartner's Magic Quadrant for Security Awareness Computer-Based Training 1 based on its completeness of vision and ability to execute. PhishLine has three issued and eight pending patents for its SaaS platform, which includes multivariable attack simulations across email, text message, voice, and USB/mobile media; best-in-class data capture, analytics and reporting; and continual, complex analysis of employee performance.\n1- Gartner, \"Magic Quadrant for Security Awareness Computer-Based Training,\" Joanna G. Huisman, 26 October 2017.\nGartner does not endorse any vendor, product or service depicted in its research publications, and does not advise technology users to select only those vendors with the highest ratings or other designation. Gartner research publications consist of the opinions of Gartner's research organization and should not be construed as statements of fact. Gartner disclaims all warranties, expressed or implied, with respect to this research, including any warranties of merchantability or fitness for a particular purpose.\nAbout Barracuda Networks, Inc. (NYSE: CUDA)\nBarracuda (NYSE: CUDA) simplifies IT with cloud-enabled solutions that empower customers to protect their networks, applications and data, regardless of where they reside. These powerful, easy-to-use and affordable solutions are trusted by more than 150,000 organizations worldwide and are delivered in appliance, virtual appliance, cloud and hybrid deployment configurations. Barracuda's customer-centric business model focuses on delivering high-value, subscription-based IT solutions that provide end-to-end network and data protection. For additional information, please visit barracuda.com .\nBarracuda Networks, Barracuda, and the Barracuda Networks logo are registered trademarks of Barracuda Networks, Inc. in the US and other countries.\nForward-Looking Statements\nThis announcement contains forward-looking statements related to our strategy and potential benefits of the PhishLine products and technology including security awareness training, data analytics and product integration, the potential benefits of Barracuda email security products, and the potential benefits of the combined solution. You should not place undue reliance on these forward-looking statements because they involve known and unknown risks, uncertainties and other factors that are, in some cases, beyond the Company's control and that could cause the Company's results to differ materially from those expressed or implied by such forward-looking statements. Factors that could materially affect the Company's business and financial results include, but are not limited to customer response to the Company's products, as well as those factors set forth in the Company's filings with the Securities and Exchange Commission. The Company expressly disclaims any intent or obligation to update the forward-looking information to reflect events that occur or circumstances that exist after the date of this press release.\nContacts\nInvestor Relations: Maria Riley; 415-217-7722; ir@barracuda.com\nPublic Relations: Jesse Kimbrel; 408-342-5683; jkimbrel@barracuda.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/barracuda-acquires-phishline-300576856.html\nSOURCE Barracuda Networks, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/barracuda-acquires-phishline-300576856.html", "https://www.phishline.com/", "https://www.barracuda.com/"], "published": "2018-01-03T16:00:00.000+02:00", "crawled": "2018-01-03T18:41:23.017+02:00", "highlightTitle": ""}