{"organizations": [], "uuid": "37e663a79cff28e295b7b4cb60de302c3f8ea5f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224784641&w=1200&r=LYNXMPEE0N10E", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-fintech-delays/fintechs-impatient-as-british-banks-seek-extra-time-to-open-up-idUKKBN1FD1FP", "country": "US", "domain_rank": 408, "title": "Fintechs impatient as British banks seek extra time to open up", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T13:37:00.000+02:00", "replies_count": 0, "uuid": "37e663a79cff28e295b7b4cb60de302c3f8ea5f3"}, "author": "", "url": "https://uk.reuters.com/article/uk-fintech-delays/fintechs-impatient-as-british-banks-seek-extra-time-to-open-up-idUKKBN1FD1FP", "ord_in_thread": 0, "title": "Fintechs impatient as British banks seek extra time to open up", "locations": [], "entities": {"persons": [{"name": "emma rumney", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 11:37 AM / Updated an hour ago Fintechs impatient as British banks seek extra time to open up Emma Rumney 5 Min Read \nLONDON (Reuters) - Financial technology firms were supposed to start breaking into mainstream banking this month when new rules forced Britain’s nine big banks to loosen their grip on the industry. \nBut many fintech companies are still waiting with frustration on the sidelines after the banks delayed making the changes. \nThe impact of the rules, which require the banks to open up their data so other companies can target their customers with tailored products and deals, was always expected to be gradual. \nBut six of the nine banks have asked Britain’s regulator for an extension to the January 13 deadline for putting in place the ‘open banking’ regulation, which overlaps with a new European Union directive known as PSD2. \nA number of Britain’s most well-known fintech firms told Reuters they have had to put their own plans on hold or decided to put off making them altogether. \n“We have decided to postpone our open banking implementation until all the banks can prove they have... all the required data available,” said Steve Tigar, CEO of app Money Dashboard, which allows users to see all their bank accounts in one place. \nThe rules could shake up British banking by letting smaller rivals challenge the dominance of large players. \nOnly Lloyds Banking Group, Dankse Bank UK and Allied Irish Banks had launched all the technology needed to share their all of their customers’ data by the deadline. \nThe other six asked for extensions of between a couple of weeks and a year, for some or all of their customers’ data. \nFintech firms can start testing their own systems with what is available now, but the firms Reuters spoke to said they wanted all the banks to be up to speed first. A DOWNSIDE SCENARIO \nThe Royal Bank of Scotland (RBS), HSBC, Barclays, Santander UK, Bank of Ireland and Nationwide Building Society ( POB_p.L ) all asked the CMA for more time to make the changes. \nA senior executive at one of Britain’s biggest banks said the regulations and increased competition could cost the industry between six and ten percent of revenues. \nThe Bank of England has estimated the largest lenders could lose more than one billion pounds in aggregate profits by 2023. \nFor some, this meant the delays were not surprising. \n“There’s very little incentive for (banks) to play ball with this, because it’s just a pure downside scenario,” said Steve Graham founder of fintech firm Teller. \nThe banks said they needed more time due to complexity in implementing the changes or to ensure the technology required to share data was secure. They say they are committed to the new rules, which present an opportunity to deliver a better service to their own clients. \n“The lack of competition in the industry has favoured big banks so far, so its unsurprising that they’ve been slow to implement,” said Paul Rippon, co-founder and deputy CEO of digital bank Monzo. \n“We made a conscious decision not to rely on open banking in the immediate term.” \nFintech firms Revolut, Plum and peer-to-peer lender RateSetter also said they had not planned any imminent initiatives based on open banking, as they thought the benefits would take some time to materialise. READY TO GO \nThe rules require banks to make customers’ account data available, with their consent, via standardised platforms known as application programming interfaces (APIs). \nBuilding these on time meant the banks contending with complex corporate structures and large customer bases, legacy IT infrastructure and requirements from a suite of other incoming regulatory changes. \nPeer-to-peer lender MarketInvoice had built some simple technologies to integrate its operations with the banks’ APIs, but these are now sitting idle. \n“We have been ready to integrate with open banking for some time and are keen to get hold of open banking data,” said its CEO, Anil Stocker. \nLast summer, one of Britain’s largest peer-to-peer lenders, Funding Circle, was also preparing to scale up its data infrastructure and hire more than 80 new developer staff with open banking in mind. By the end of the year, it had decided to direct all of these resources elsewhere. \n“We took a decision to do that rather than try and build any systems not knowing actually what’s going to come and when it is going to come,” James Meekings, its co-founder, told Reuters in an interview earlier in January. \nFor fintech firms that had bet on the changes, however, the consequences of delays can be more serious. \nToken, which employs 40 people in San Francisco and London, was founded in 2015 and builds ready-made technology to help banks comply with the changes and others to capitalise on them. \n“It impacts us because we were expecting to go live,” said Steve Kirsch, its chief executive. “That’s going to just delay our revenues.” Editing by Anna Willard", "external_links": [], "published": "2018-01-24T13:37:00.000+02:00", "crawled": "2018-01-24T13:51:29.000+02:00", "highlightTitle": ""}