{"organizations": [], "uuid": "3185940f6cc0859c35c66d2f861941b22e44ff84", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180117.html", "section_title": "Archive News &amp; Video for Wednesday, 17 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/us-canada-economy/bank-of-canada-trade-uncertainty-u-s-tax-changes-to-weigh-on-business-investment-idUSKBN1F61WU", "country": "US", "domain_rank": 408, "title": "Bank of Canada: trade uncertainty, U.S. tax changes to weigh on business investment", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-17T23:12:00.000+02:00", "replies_count": 0, "uuid": "3185940f6cc0859c35c66d2f861941b22e44ff84"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-canada-economy/bank-of-canada-trade-uncertainty-u-s-tax-changes-to-weigh-on-business-investment-idUSKBN1F61WU", "ord_in_thread": 0, "title": "Bank of Canada: trade uncertainty, U.S. tax changes to weigh on business investment", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "ottawa", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "bank of canada", "sentiment": "negative"}, {"name": "nafta", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OTTAWA (Reuters) - Uncertainty around U.S. trade policy and recent tax reforms south of the border are expected to knock about 2.5 percent off business investment in Canada over the next two years, the Bank of Canada said on Wednesday.\nThe central bank said underlying fundamentals are strong and would support more robust investment growth were it not for the heightened trade risks and increased incentive for businesses to move investment from Canada to the United States.\nCanada is currently renegotiating the North American Free Trade Agreement (NAFTA) with the United States and Mexico. With U.S. President Donald Trump repeatedly threatening to pull out of the pact, concerns have risen ahead of the next round of talks later this month.\nThe trade uncertainty is expected to reduce the level of investment by about 2 percent by the end of 2019, the bank said in its Monetary Policy Report. That is an increase of 0.5 percentage points compared to its October projection.\n“Although their investment intentions indicate plans to boost spending, respondents to the Business Outlook Survey are increasingly concerned about the ongoing NAFTA negotiations and rising protectionism more generally,” the central bank said, referring to its quarterly survey.\nThe updated projections were released as the central bank raised interest rates to 1.25 percent, saying that while more hikes are probably warranted, some continued monetary policy accommodation will likely be needed to maintain optimal growth and inflation.\nThe bank also introduced into its projection the potential negative effects of recent U.S. tax reforms, estimating they will take another 0.5 percent off Canadian investment by the end of next year.\n“Firms may decide to redirect some of their planned investment spending from Canada to the United States to benefit from the lower corporate taxes,” the bank said.\nOverall, the bank forecast business investment will contribute 0.4 percentage points to economic growth this year and 0.3 percentage points in 2019, unchanged from its October forecast.\nExports were expected to be impacted by the tax and trade factors as well. Although the tax changes were seen benefiting the U.S. economy and therefore boosting the level of Canadian exports by about 1 percent by the end of 2019, that was tempered by an expected 0.7 percent drag from trade uncertainty over the same time frame.\n“Canada’s ability to benefit from an improving global outlook continues to be hindered by uncertainty around the status of trade arrangements,” the bank said.\nReporting by Leah Schnurr,; editing by Andrea Hopkins\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-17T23:12:00.000+02:00", "crawled": "2018-01-18T16:09:36.023+02:00", "highlightTitle": ""}