{"organizations": [], "uuid": "ba9e7368b6adc81125811d77b788717ce8c3f112", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224360918&w=1200&r=LYNXMPEE0M073", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews/", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-philippines-militants-islamicstate/exclusive-looted-cash-gold-helps-islamic-state-recruit-in-philippines-idUKKBN1FC0E4", "country": "US", "domain_rank": 408, "title": "Exclusive: Looted cash, gold helps Islamic State recruit in Philippines", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T06:47:00.000+02:00", "replies_count": 0, "uuid": "ba9e7368b6adc81125811d77b788717ce8c3f112"}, "author": "", "url": "https://uk.reuters.com/article/uk-philippines-militants-islamicstate/exclusive-looted-cash-gold-helps-islamic-state-recruit-in-philippines-idUKKBN1FC0E4", "ord_in_thread": 0, "title": "Exclusive: Looted cash, gold helps Islamic State recruit in Philippines", "locations": [], "entities": {"persons": [{"name": "najib", "sentiment": "none"}, {"name": "abu dar", "sentiment": "none"}, {"name": "humam abdul najib", "sentiment": "none"}, {"name": "tom allard", "sentiment": "none"}], "locations": [{"name": "philippines", "sentiment": "none"}, {"name": "southeast asia", "sentiment": "none"}, {"name": "marawi", "sentiment": "none"}, {"name": "marawi city", "sentiment": "none"}, {"name": "marawi city", "sentiment": "none"}], "organizations": [{"name": "islamic state", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 4:46 AM / Updated an hour ago Exclusive: Looted cash, gold helps Islamic State recruit in Philippines Tom Allard 8 Min Read \nMARAWI CITY, Philippines (Reuters) - Islamist insurgents looted cash, gold and jewellery worth tens of millions of dollars when they occupied a southern Philippines town last year, treasure one of their leaders has used to recruit around 250 fighters for fresh attacks. \nThe military said Humam Abdul Najib escaped from Marawi City, which the militants had hoped to establish as a stronghold for Islamic State in Southeast Asia, before it was recaptured by the military in October after five months of ferocious battles and aerial bombardment. \nSince then, Najib, also known as Abu Dar, has used the booty looted from bank vaults, shops and homes in Marawi to win over boys and young men in the impoverished southern province of Lanao del Sur, military officers in the area said. Hardened mercenaries are also joining, lured by the promise of money. \nAs a result, Islamic State followers remain a potent threat in Southeast Asia even though hundreds of militants were killed in the battle for Marawi, the officers said. \n“Definitely they haven’t abandoned their intent to create a caliphate in Southeast Asia,” Colonel Romeo Brawner, the deputy commander of Joint Task Force Marawi, told Reuters. \n“That’s the overall objective, but in the meantime while they are still trying to recover and build up again - fighters and weapons - our estimate is they are going to launch terrorist attacks.” \nOn Saturday, militants wounded eight soldiers in two attacks in Lanao del Sur, Brawner said, the first such violence since the recapture of Marawi. \nIn the early days of the occupation of Marawi last May, as black-clad fighters burned churches, released prisoners and cut the power supply, other militants targeted banks and the homes of wealthy citizens, commandeering hostages to help with the plunder. \n“It was in the first week. They divided us into three groups with seven people each,” said J.R. Montesa, a Christian construction worker who was captured by the militants. \nUsing explosives, the militants blew open the vaults of the city’s three main banks, Landbank, the Philippine National Bank and the Al Amanah Islamic Bank, Montesa told Reuters in a town near Marawi. They trucked away the booty, easily slipping out of Marawi because a security cordon was not fully in place. \nThey also raided jewellery stores, pawnshops and businesses. \nLandbank and Al Amanah did not respond to requests for comment. Philippine National said recovering losses because of the Marawi fighting was a concern, but did not give details. \nThe Islamic celebration of Ramadan was looming at the time the militants struck and banks, businesses and homes had more money than usual, said Marawi City police chief Ebra Moxsir. The Maranaos, the ethnic group that dominates the area around Marawi, are mostly Muslims. \n“There was a lot of money inside the battle area,” he told Reuters. “Maranaos keep millions of pesos in safety vaults in their homes. Gold, also. It is a tradition of the Maranao to give gifts of money (during Ramadan).” \nMontesa said vans they loaded with the spoils of the raids were “overflowing”, with money, gold and other valuables stuffed into every crevice of the vehicles. \n“They were saying it was a gift from Allah. They would say ‘Allahu Akbar’ (God is greatest) while we were stealing.” DANGEROUS REGROUPING \nThe military and police have also been accused by rights groups and by Marawi residents of looting during the conflict. \nBrawner said a small number of soldiers had been disciplined for looting but the practice was not widespread. \nHowever, the centre of Marawi - home to its major banks, main market and grandest residences - was under the control of militants for months. \nBrawner said authorities were unclear exactly how much was taken by the militants. A view of the damaged facade of Marawi's Grand Mosque, which was used as a hideout by Islamic State militants during the five-month siege in Marawi, Philippines January 13, 2018. REUTERS/Tom Allard \n“It’s hard for us to say. We have heard about 2 billion pesos ($39.4 million) but that’s just an estimate.” \n“In the first days, when we were not able to establish that security cordon around the main battle area, that was the time when they were able to slip out with their war booty.” \nThe government also said the regrouping of militants in Mindanao, the southern region of the Philippines that has been marred by Islamic and Communist uprisings for decades, was dangerous. \nPresidential spokesman Harry Roque told Reuters: “There is always the danger of these groups regaining strength enough to mount another Marawi-like operation.” \nNajib is believed to have fled Marawi early in the battle. There are conflicting reports about whether he had a dispute with other leaders or left as part of a preconceived plan. \nHe attempted to return in August with 50-100 more fighters to reinforce the militants, who by then were losing ground, but he was prevented by an improved security cordon, said Brawner. \n“According to reports, they were able to recruit another 100 to 150. So the estimate is 250 all in all, and this includes children,” Brawner said. “They are trying to recruit orphans, relatives of the fighters who died and sympathisers.” Slideshow (2 Images) \nParents of children are offered as much as 70,000 pesos ($1,380) plus a monthly salary of as much as 30,000 pesos ($590) to hand over their sons to the group, according to security sources and community leaders briefed on the recruitment. \nThe average family income in the Philippines is 22,000 pesos per month, according to a 2015 government survey. It was about half that in the Autonomous Region of Muslim Mindanao, where Marawi and surrounding areas lie. \nBrawner said local residents had told the military that the militant group was also offering bonuses of up to 10,000 pesos ($200) for killing a soldier. \nRommel Banlaoi, a Manila-based security expert, said more experienced fighters had also been recruited. These were “mercenaries” attracted by the payouts, he said, but Najib has also tapped into disaffection among Maranao angered by the destruction of large parts of Marawi by the Philippine military’s bombing campaign. \n“That kind of narrative is being used by ISIS to lure people to continue the fight,” Banlaoi said, using an acronym for Islamic State. NEXT EMIR? \nWith the looted funds and a loyal following, Najib, could become the new “emir” of Islamic State in Southeast Asia following the death of Isnilon Hapilon in the battle for Marawi, security analysts say. \nNajib is a hardened fighter and cleric who studied in the Middle East and reportedly trained with militants in Afghanistan, they say. \nHe co-founded Khalifa Islamiyah Mindanao, an insurgent group formed in about 2012 that launched a series of bombings in Mindanao. \n“He is a very, very important person because he has been there from the start,” said Banlaoi. \nNajib had links to Al Qaeda, which earned him the nickname “al Zarqawi of the Philippines”, a reference to the slain leader of Al Qaeda in Iraq (AQI), Abu Musab al Zarqawi. AQI morphed into Islamic State, to which Najib pledged allegiance in 2014. \nAccording to Banlaoi, Najib worked closely with Mahmud Ahmad, a Malaysian militant believed to have died in Marawi who was the key conduit between the Philippines fighters and the Islamic State leadership in Syria and Iraq. \nBanlaoi said the recruitment effort by the pro-Islamic State remnants led by Najib was “massive and systematic”. \n“If you are well funded, you can do a lot of things.” Additional reporting by Martin Petty, Neil Jerome Morales and Manuel Mogato; Editing by John Chalmers and Raju Gopalakrishnan", "external_links": [], "published": "2018-01-23T06:47:00.000+02:00", "crawled": "2018-01-23T07:08:43.010+02:00", "highlightTitle": ""}