{"organizations": [], "uuid": "06563d1bfee71533f5ae70a29b4a134ccb42f8f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-spectrum-global-solutions-reports-positive-net-income-for-the-fiscal-period.html", "country": "US", "domain_rank": 767, "title": "Spectrum Global Solutions Reports Positive Net Income for the Fiscal Period", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-23T17:03:00.000+02:00", "replies_count": 0, "uuid": "06563d1bfee71533f5ae70a29b4a134ccb42f8f6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/globe-newswire-spectrum-global-solutions-reports-positive-net-income-for-the-fiscal-period.html", "ord_in_thread": 0, "title": "Spectrum Global Solutions Reports Positive Net Income for the Fiscal Period", "locations": [], "entities": {"persons": [{"name": "ponder", "sentiment": "none"}, {"name": "roger ponder", "sentiment": "none"}], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "longwood", "sentiment": "none"}, {"name": "puerto rico", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}], "organizations": [{"name": "spectrum global solutions, inc.", "sentiment": "neutral"}, {"name": "ure group, ltd.", "sentiment": "none"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONGWOOD, Fla., Jan. 23, 2018 (GLOBE NEWSWIRE) -- Spectrum Global Solutions, Inc. (f/k/a Mantra Venture Group, Ltd.) (the \"Company\") (OTC PINK:SGSIF), reported financial results for the fiscal period ended November 30, 2017.\nRoger Ponder, CEO of the Company stated, “Revenue exceeded $2 million for the quarter despite the negative impact of two hurricanes on our Florida and Puerto Rico operations. We have now fully recovered from the effects of the hurricanes and continue to execute on our work in progress and pipeline of sales opportunities.\"\nMr. Ponder continued: “We are experiencing revenue growth from our AW Solutions subsidiary, and expect to continue this growth both organically and through strategic, accretive acquisitions.”\nMantra Energy Alternatives did not report revenues for the period ended November 30, 2017 and the Company is evaluating its options related to energy technologies and associated strategies for that subsidiary.\nFinancial Highlights:\nRevenue for the three-month period ended November 30, 2017 was $2,006,933 as compared to $0 for the same period in 2016. Gross profit was $10,888, attributable to the subsidiaries acquired in April 2017, and was negatively affected by the hurricanes in Florida and Puerto Rico. The Company had a net income attributable to common stockholders of $1,687,801 during the period ended November 30, 2017 compared to net loss of $(1,856,399) for the comparable period of 2016. The increase in net income was primarily due to revenue derived from our new subsidiaries and decreases in derivative liabilities and other non-cash expenses.\nOur operating results for the Period ended November 30, 2017 and 2016 are summarized as follows:\nThree Months Ended\nNovember 30, 2017 Three Months Ended\nNovember 30,2016 Statement of Operations Data: Revenues $ 2,006,933 $ 0 Gross profit 10,888 0 Operating expenses 775,504 150,538 Loss from operations (764,616 ) (150,538 ) Total other income (expense) 2,379,912 (1,705,861 ) Net Income (loss) attributable to common stockholders 1,687,801 (1,856,786 ) Balance sheet data for period ended November 30, 2017: Cash $ 0 Accounts receivable, net 1,911,831 Total current assets 1,958,609 Goodwill and intangible assets, net 1,503,633 Total assets 4,913,628 Total current liabilities 8,762,792 Derivative liabilities 1,866,786 Stockholders' (deficit) equity (3,849,164 ) About Spectrum Global Solutions:\nSpectrum Global Solutions, Inc. (SGSIF) operates through its AW Solutions and Mantra Energy Alternatives subsidiaries.\nAW Solutions (AWS) is a leading provider of telecommunications engineering and infrastructure services across the United States, Canada, Puerto Rico, Guam and Caribbean. The Company’s subsidiary Mantra Energy Alternatives is developing electrochemical technologies designed to make reducing greenhouse gas emissions profitable. For more information about the Company and its technologies visit the Company’s public filings at SEC.gov .\nForward Looking Statements\nStatements in this press release regarding the Company that are not historical facts are forward-looking statements and are subject to risks and uncertainties that could cause actual future events or results to differ materially from such statements. Any such forward-looking statements, including, but not limited to, financial guidance, are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Forward-looking statements include all statements that do not directly or exclusively relate to historical facts. In some cases, you can identify forward-looking statements by terms such as “may,” “will,” “should,” “could,” “would,” “expects,” “plans,” “anticipates,” “believes,” “estimates,” “projects,” “forecasts,” “predicts,” “potential,” or the negative of those terms, and similar expressions and comparable terminology. These include, but are not limited to, statements relating to future events or our future financial and operating results, plans, objectives, expectations and intentions. Although we believe that the expectations reflected in these forward-looking statements are reasonable, these expectations may not be achieved. Forward-looking statements represent our intentions, plans, expectations, assumptions and beliefs about future events and are subject to known and unknown risks, uncertainties and other factors outside of our control that could cause our actual results, performance or achievement to differ materially from those expressed or implied by these forward-looking statements. In addition to the risks described above, these risks and uncertainties include: our ability to successfully execute our business strategies, including integration of acquisitions and the future acquisition of other businesses to grow our company; customers’ cancellation on short notice of master service agreements from which we derive a significant portion of our revenue or our failure to renew such master service agreements on favorable terms or at all; our ability to attract and retain key personnel and skilled labor to meet the requirements of our labor-intensive business or labor difficulties which could have an effect on our ability to bid for and successfully complete contracts; our failure to compete effectively in our highly competitive industry could reduce the number of new contracts awarded to us or adversely affect our market share and harm our financial performance; our ability to adopt and master new technologies and adjust certain fixed costs and expenses to adapt to our industry’s and customers’ evolving demands; our history of losses, deficiency in working capital and a stockholders’ deficit and our ability to achieve sustained profitability; material weaknesses in our internal control over financial reporting and our ability to maintain effective controls over financial reporting in the future; our substantial indebtedness could adversely affect our business, financial condition and results of operations and our ability to meet our payment obligations; the impact of new or changed laws, regulations or other industry standards that could adversely affect our ability to conduct our business; and changes in general market, economic and political conditions in the United States and global economies or financial markets, including those resulting from natural or man-made disasters.\nThese forward-looking statements represent our estimates and assumptions only as of the date of this release and, except as required by law, we undertake no obligation to update or revise publicly any forward-looking statements, whether as a result of new information, future events or otherwise after the date of this release. Given these uncertainties, you should not place undue reliance on these forward-looking statements and should consider various factors, including the risks described, among other places, in our most recent Annual Report on Form 10-K and in our Quarterly Reports on Form 10-Q, as well as any amendments thereto, filed with the SEC.\nCONTACT:\nInvestor Relations\nSpectrum Global Solutions, Inc.\n561-672-7068\nSource:Spectrum Global Solutions, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/9b1dcfe3-b317-41df-a69a-5c4ff6829381"], "published": "2018-01-23T17:03:00.000+02:00", "crawled": "2018-01-23T17:37:03.045+02:00", "highlightTitle": ""}