{"organizations": [], "uuid": "99f7b14733d5e9ab9461ea789aed29e80874fa0c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220530363&w=1200&r=LYNXMPEE080TF", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-italy-election-league/italys-northern-league-chief-rules-out-government-role-for-party-moderate-idUSKBN1EY1CR", "country": "US", "domain_rank": 408, "title": "Italy's Northern League chief rules out government role for party moderate", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T14:33:00.000+02:00", "replies_count": 0, "uuid": "99f7b14733d5e9ab9461ea789aed29e80874fa0c"}, "author": "", "url": "https://www.reuters.com/article/us-italy-election-league/italys-northern-league-chief-rules-out-government-role-for-party-moderate-idUSKBN1EY1CR", "ord_in_thread": 0, "title": "Italy's Northern League chief rules out government role for party moderate", "locations": [], "entities": {"persons": [{"name": "matteo salvini", "sentiment": "none"}, {"name": "crispian balmer", "sentiment": "none"}, {"name": "roberto maroni", "sentiment": "none"}, {"name": "maroni", "sentiment": "none"}], "locations": [{"name": "italy", "sentiment": "none"}, {"name": "milan", "sentiment": "none"}, {"name": "lombardy", "sentiment": "none"}], "organizations": [{"name": "northern league", "sentiment": "neutral"}, {"name": "min read  rome", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ROME (Reuters) - The leader of Italy’s far-right Northern League ruled out on Tuesday any future government role for party moderate Roberto Maroni, who has been touted as a possible prime minister if the center-right bloc wins the March election.\nMaroni, a former interior minister, unexpectedly announced at the weekend that he would not seek re-election this year as president of the wealthy Lombardy region, which is centered on Italy’s business capital Milan.\nHe told reporters he was standing aside for unspecified “personal reasons”, but said he would be ready to help his allies in future, adding: “I know what it means to govern.”\nWith the center-right bloc leading in opinion polls ahead of the March 4 ballot, Italian newspapers interpreted Maroni’s words as meaning that he wanted to return to central government, perhaps as prime minister.\nNorthern League leader Matteo Salvini, who has pushed the group to the far right during his four years at the helm, was caught off-guard by Maroni’s announcement and moved quickly to temper the political ambitions of the popular party veteran.\nAsked by Radio 24 if Maroni might have a future government role, Salvini said: “If you leave Lombardy ... which is worth much more than many ministries, if you feel you have reached the end of the road there, then obviously no”.\nSalvini has aligned the League with hard-right parties across Europe, including France’s National Front and the anti-Islam Freedom Party in the Netherlands. He wants Italy to exit the euro and promises zero tolerance on illegal immigration.\nPREMIER CANDIDATE Berlusconi has repeatedly told reporters that the League is a moderate party, saying Salvini is talking tough for electoral purposes. But Forza Italia officials in private acknowledge they find it much easier to work with League stalwart Maroni.\n“We have worked very well with Maroni in Lombardy and this is the model we would expect to reproduce at a national level if we win power,” said a Forza Italia lawmaker, who was not authorized to talk to the press and declined to be named.\nIn the event of a center-right victory, Berlusconi and Salvini have agreed that the party that takes more votes will decide who to put forward as prime minister. Salvini says he is the League’s candidate for premier, while Berlusconi, who cannot return to high office because of a 2013 conviction for tax fraud, has yet to decide on a name.\nLatest polls put Forza Italia roughly one percentage point ahead of the League. All surveys suggest the center-right bloc will not win enough seats to claim an overall majority, meaning they will need external allies to govern.\nSalvini has ruled out any deals with the center-left but shown a willingness to work with the anti-establishment 5-Star Movement. Marking a major difference between the two parties, Berlusconi has said his main enemy is 5-Star and Maroni echoed his sentiments in a news conference on Monday.\n“The equilibrium between the two main center-right allies will be solid up to the elections, but afterwards it could prove to be more fragile than it seems,” Italy’s top-selling broadsheet Corriere della Sera newspaper wrote on Tuesday.\nAdditional reporting by Stefano Bernabei; editing by Mark Heinrich\n ", "external_links": [], "published": "2018-01-09T14:33:00.000+02:00", "crawled": "2018-01-09T14:41:28.006+02:00", "highlightTitle": ""}