{"organizations": [], "uuid": "81e3e42156426675d9539e37e865e4a1dc46b822", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/ecb-banks-loans/ecb-set-to-delay-tackling-of-euro-zones-pile-of-bad-loans-sources-idUSL8N1PI5AS", "country": "US", "domain_rank": 408, "title": "ECB set to delay tackling of euro zone's pile of bad loans: sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T12:26:00.000+02:00", "replies_count": 0, "uuid": "81e3e42156426675d9539e37e865e4a1dc46b822"}, "author": "", "url": "https://www.reuters.com/article/ecb-banks-loans/ecb-set-to-delay-tackling-of-euro-zones-pile-of-bad-loans-sources-idUSL8N1PI5AS", "ord_in_thread": 0, "title": "ECB set to delay tackling of euro zone's pile of bad loans: sources", "locations": [], "entities": {"persons": [{"name": "balazs koranyi", "sentiment": "none"}, {"name": "francesco canepa", "sentiment": "none"}], "locations": [{"name": "frankfurt", "sentiment": "none"}, {"name": "italy", "sentiment": "none"}], "organizations": [{"name": "ecb", "sentiment": "negative"}, {"name": "european central bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "npl", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Wed Jan 24, 2018 / 5:26 AM EST ECB set to delay tackling of euro zone's pile of bad loans: sources Reuters Staff \n* Rules on NPL stock face delay \n* ECB could set out principles in March \n* Details would be ironed out in following months \n* Code on new NPLs also due out in March ADVERTISEMENT \nBy Francesco Canepa and Balazs Koranyi \nFRANKFURT, Jan 24 (Reuters) - European Central Bank supervisors are likely to postpone publishing new rules aimed at tackling a huge pile of unpaid loans weighing down euro zone banks after fierce criticism from lawmakers and bankers, sources have told Reuters. \nThe delay is the latest climbdown in the ECB's attempt to reduce the bloc's 759 billion euros ($935 billion) of soured credit inherited from the financial crisis - a priority since it became the euro zone's top banking supervisor in 2014. ADVERTISEMENT \nBankers and European parliamentarians, particularly from Italy, fear that forcing banks to set aside more money against their bad loans will strangle lending in economies that are already missing out on a brisk economic expansion in other parts of the euro zone. \nECB supervisors still aim to publish in March a first draft of new measures targeting soured loans that are sitting on banks' balance sheets - a big issue in countries such as Italy, Portugal, Ireland and Slovenia - the three sources close to the matter said. \nBut they added this document was increasingly likely to be a mere placeholder setting out principles, while the nuts and bolts of the new rules could be decided in the following months. No final decision on the matter had yet been made. \nAn ECB spokeswoman declined to comment. \nBankers fear the need to stash away more money will force them to tap the market - a feat that has eluded Monte Paschi and other struggling lenders in the past 1-1/2 years. \nECB supervisors are now carrying out an assessment of the impact that these new measures would have on the euro zone's banking sector, the sources said. \nThis study includes scenarios modelled on the ECB's draft guidelines on new non-performing loans (NPLs), which give banks seven years to provide for credit backed by collateral and two years for unsecured debt, the sources said. \nOne of the variables is whether the new measures will be applied to all banks with above-average levels of NPLs or only with those where the issue is at its worst, they added. \nJust over 5 percent of loans at large euro zone banks were not being repaid at the end of September 2017, down from 6.5 percent a year earlier, ECB data showed. \nBut this ratio is as high as 46 percent in Greece, 34 percent in Cyprus, 18 percent in Portugal and 12-13 percent in Slovenia, Ireland and Italy. \nBankers have said the ECB wants large banks to cut soured loans below 10 percent of total lending and have kept the pressure on individual lenders. \nItaly's Intesa Sanpaolo, for instance, announced earlier this month a shift in strategy over bad debts, in a move that sources have said was driven by the ECB’s proposed new rules and the regulator’s stance. \nThe delay will also allow the ECB to take stock of the European Commission's upcoming legislative measures on the matter and avert a new conflict with Brussels. FLOW ADVERTISEMENT \nThe ECB's separate, long-postponed guidelines on new non-performing loans are also expected to see the light of day by the end of March, the sources said. \nBut banks will likely have to start providing for loans that sour only from the following quarter, they added. \nSpeaking in Frankfurt on Wednesday, the ECB's chief banking supervisor Daniele Nouy said the code for new NPLs will be will be finalised in the first quarter of the year but its application may be delayed. \nUnveiled in October and originally due to come into force at the start of this year, the regime has been put on hold due to strong criticism received during a public consultation. \nThe sources added the substance of the reform is unlikely to change, as flagged by Nouy herself in a recent meeting with Italian bankers. \nThe wording of the rules will be tweaked, however, to inject flexibility into the way they are applied. \nThis was seen as especially relevant for secured NPLs, which will have to be fully provided for despite the high probability of recovering some money, albeit after a long time, the sources said. \nThe new wording will also seek to assuage EU lawmakers' criticism that the code encroached on their prerogatives by creating new legislation for all banks, rather than implementing existing law on a case-by-case basis. \n($1 = 0.8116 euros) (Additional reporting by Frank Siebelt; Editing by Toby Chopra) ", "external_links": [], "published": "2018-01-24T12:26:00.000+02:00", "crawled": "2018-01-24T12:50:05.015+02:00", "highlightTitle": ""}