{"organizations": [], "uuid": "8f521ba925e3c56c4cac7abb9d9136040a286eef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/19/the-associated-press-correction-uber-autonomous-vehicles-story.html", "country": "US", "domain_rank": 767, "title": "Correction: Uber-Autonomous Vehicles story", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T22:00:00.000+02:00", "replies_count": 0, "uuid": "8f521ba925e3c56c4cac7abb9d9136040a286eef"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/19/the-associated-press-correction-uber-autonomous-vehicles-story.html", "ord_in_thread": 0, "title": "Correction: Uber-Autonomous Vehicles story", "locations": [], "entities": {"persons": [{"name": "eric meyhofer", "sentiment": "none"}], "locations": [{"name": "detroit", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "associated press", "sentiment": "negative"}, {"name": "ap", "sentiment": "negative"}, {"name": "advanced technology group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DETROIT (AP) — In a story Jan. 17 about autonomous vehicles, The Associated Press, relying on incorrect information from Uber, reported erroneously that the company has test vehicles carrying passengers with human backup drivers in Toronto and San Francisco. The company is testing autonomous vehicles in both cities but is not carrying passengers.\nA corrected version of the story is below:\nUber nearing autonomous cars without human backup driver\nUber's automous vehicle chief says the service plans to carry passengers in autonomous vehicles without human backup drivers in about the same time frame as competitors, which expect to be on the road at the latest sometime next year\nBy TOM KRISHER\nAP Auto Writer\nDETROIT (AP) — Uber plans to carry passengers in autonomous vehicles without human backup drivers in about the same time frame as competitors, which expect to be on the road at the latest sometime next year, the service's autonomous vehicle chief said Wednesday.\nAdvanced Technology Group leader Eric Meyhofer wouldn't give a specific start date but he said Uber won't deploy the driverless cars without human backups unless they are proved safe.\n\"Once we can check that box, which we call passing the robot driver's license test, that's when we can remove the vehicle operator,\" Meyhofer said in an interview at an auto industry investors conference Detroit. \"We're going aggressively too.\"\nWaymo, the name of the autonomous car unit of Alphabet Inc.'s Google, currently is testing on public roads in the Phoenix area without human backups and plans to carry passengers soon. General Motors Co.'s Cruise Automation has promised to start sometime next year in an unspecified location.\nMeyhofer said Volvo XC-90 SUVs are being prepared for the work. Uber Technologies Inc. has 215 test vehicles carrying passengers with human backups in Phoenix and Pittsburgh. They travel 80,000 miles per week gathering data and have given 50,000 paid rides, he said.\nUber also is testing autonomous vehicles in Toronto and San Francisco but says it is not carrying passengers in them.\nSan Francisco-based Uber started carrying passengers with autonomous vehicles in 2016, first with two Uber employees on board, Meyhofer said. The person in the passenger seat documented the vehicle's behavior while the one on the driver's side would intervene if the car needed help. The vehicles have improved to the point where Uber has removed one of the humans and now the backup driver enters data on a screen in rare cases, Meyhofer said.\nThe ride service now has 1,600 people working on autonomous vehicles in the four test locations.\nWaymo said in November that it plans to carry passengers without human backups in a few months but gave no definite date. The testing would be done in a relatively small area that is covered by detailed three-dimensional maps.\nMeyhofer said Uber would start in the same way, gradually expanding the size of the area as mapping is done and vehicles become more capable. Currently the cars are limited to 40 miles per hour, Meyhofer said.\nSuch testing likely will be done in warm-weather areas that don't get snow. Meyhofer said Uber is still working on use of the cars when snow covers the lane lines and can't be seen by cameras. \"That's all well within our scope. It's just not in our scope today,\" he said.\nThe developments on the road come as self-driving car technologies are being battled over in court. Waymo has alleged that one of its top self-driving car engineers, Anthony Levandowski, stole its trade secrets before founding a startup that he sold to Uber for $680 million. Uber has denied the allegations.", "external_links": [], "published": "2018-01-19T22:00:00.000+02:00", "crawled": "2018-01-20T19:01:25.006+02:00", "highlightTitle": ""}