{"organizations": [], "uuid": "8864cc65edf1c0641c340da347a5251a61374c7a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219324808&w=1200&r=LYNXMPEE030Q0", "site_section": "https://www.reuters.com/places/russia", "section_title": "Russia", "url": "https://www.reuters.com/article/us-newsnow-jan04/thursday-morning-briefing-idUSKBN1ET1D4", "country": "US", "domain_rank": 408, "title": "Thursday Morning Briefing", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-04T20:55:00.000+02:00", "replies_count": 0, "uuid": "8864cc65edf1c0641c340da347a5251a61374c7a"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-newsnow-jan04/thursday-morning-briefing-idUSKBN1ET1D4", "ord_in_thread": 0, "title": "Thursday Morning Briefing", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "bannon", "sentiment": "negative"}, {"name": "donald trump jr.", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "steve bannon", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "u.s. east coast", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Trump blasts Bannon as having “lost his mind” over comments made in a new book, heavy snow and winds continue to pummell the U.S. East Coast and researchers reveal security flaws that put virtually all phones and laptops at risk.\nUnited States\nPresident Donald Trump blasted former White House chief strategist Steve Bannon as having “ lost his mind ” in the fallout over damaging comments Bannon made about Trump’s son Donald Trump Jr. in excerpts from a new book. Trump, who had continued to speak privately with Bannon after firing him in August, essentially cut ties with his former aide at least for now in a blistering statement issued after Bannon’s comments came to light.\nEmboldened by his victory in the passage of the biggest U.S. tax overhaul in decades, Trump now wants to rein in social welfare programs even though some Republicans are wary of tackling the volatile issue in a congressional election year.\nTrump is ramping up calls on the U.S. Congress to stop legal immigrants from sponsoring extended family members who want to move to the United States, saying so-called “chain migration” poses a threat to national security.\nTrump’s former campaign manager Paul Manafort sued Special Counsel Robert Mueller , alleging that his office’s investigation into possible collusion between the Trump campaign and Russia exceeds its legal authority.\nTrump shut down a presidential commission charged with looking into allegations of electoral fraud during the 2016 election, after many states refused to provide it with data, the White House said.\nA former U.S. National Security Agency contractor has agreed to plead guilty to stealing classified information, according to court filings, in what may have been the largest heist of U.S. government secrets in history.\nHeavy snow and high winds pounded the U.S. East Coast along a front stretching from Maine as far south as North Carolina, knocking out power, icing over roadways and closing hundreds of schools.\nWorld\nThe head of U.S. forces in South Korea warned against raising hopes over North Korea’s peace overture amid a war of words between the United States and the reclusive North over its nuclear and missile programs.\nTrump’s administration has been informing members of Congress that it will announce plans to cut off “ security assistance ” to Pakistan, congressional aides said on Wednesday, a day after the White House warned Islamabad it would have to do more to maintain U.S. aid.\nTurkey said a U.S. jury’s decision to convict a Turkish banker for helping Iran evade sanctions was an unprecedented interference in its internal affairs, and dismissed the court case as a political plot.\nIran’s army chief said police forces had already quelled anti-government unrest that has killed 21 people but that his troops were ready to intervene if needed, official media reported, as new state-sponsored protests were held.\nEver since Reuters Myanmar reporters Wa Lone and Kyaw Soe Oo were arrested on Dec. 12 on suspicion of violating the Official Secrets Act, friends and former colleagues have poured out their hearts and expressed hopes for their release on social media .\nFormer British prime minister Tony Blair told voters that time was running out to reverse Brexit , a folly that he said would torpedo Britain’s remaining clout and be regretted for generations to come.\nMembers of the Shembe faith (Nazareth Baptist Church), a religious hybrid of Christianity and African traditions, walk during their annual pilgrimage near Inanda, South Africa, January 3, 2018. REUTERS/Rogan Ward Business\nMarket bulls resumed their charge as strong data from the world’s biggest economies sent stock index records tumbling and oil prices to their highest since mid-2015.\nDespite the strongest start for oil prices in four years, the world’s top oil companies are hesitating to accelerate the search for new resources as a determination to retain capital discipline trumps the hope of making bonanza discoveries.\nBreakingviews: Oil bulls look to Trump rather than Iran protests\nDrugstore chain Walgreens Boots Alliance reported a 22.1 percent fall in quarterly profit , partly hurt by an impairment charge related to its investment in Chinese wholesale partner Guangzhou Pharmaceuticals.\nAT&T, the No. 2 U.S. wireless carrier, said it would l aunch fifth-generation (5G) mobile network service in a dozen cities in the United States by late 2018, after international wireless standards for the network were finalised last month.\nMusic streaming service Spotify has filed confidentially with U.S. regulators for an initial public offering and is targeting a direct listing in the first half of 2018 that would allow some longtime investors to cash out, a source familiar with the matter said.\nTesla delayed a production target for its new Model 3 sedan for the second time, disappointing investors even as it claimed “major progress” overcoming manufacturing challenges that have hampered the vehicle’s rollout.\nReuters TV : Uber competitor Didi expands from China to Brazil\nTech\nSecurity researchers disclosed a set of security flaws that they said could let hackers steal sensitive information from nearly every modern computing device containing chips from Intel Corp, Advanced Micro Devices Inc and ARM Holdings.\nFactbox: What you need to do about newly discovered computer chip flaws\nBitcoin was the star of the white-knuckle ride that cryptocurrencies offered in 2017 but lesser-known names, such as Ripple and Ethereum, are seen gaining prominence in 2018.\nCommentary\nIt's time to figure out the fine print of the Paris climate agreement, writes John Light . The accord appears \"surprisingly strong\" in spite of Donald Trump's decision to withdraw from the deal, but the specific rules governing countries' obligations will have to be written by the end of 2018. Top of the to-do list: figuring out transparent - and realistic - regulations on how different countries can accurately report their carbon emissions.\n ", "external_links": ["https://www.reuters.tv/v/5Ts/2018/01/03/uber-competitor-didi-expands-from-china-to-brazil", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-04T20:55:00.000+02:00", "crawled": "2018-01-04T21:21:06.006+02:00", "highlightTitle": ""}