{"organizations": [], "uuid": "d54135fac3e5a6754e4f32d7975721af74d6cc16", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 62, "shares": 62, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180131&t=2&i=1226858907&w=1200&r=LYNXMPEE0U0C8", "site_section": "http://feeds.reuters.com/reuters/technologyNews", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-nintendo-results/nintendos-third-quarter-operating-profit-soars-on-switch-raises-outlook-idUSKBN1FK0PW", "country": "US", "domain_rank": 408, "title": "Nintendo's third quarter operating profit soars on Switch, raises outlook", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T15:24:00.000+02:00", "replies_count": 0, "uuid": "d54135fac3e5a6754e4f32d7975721af74d6cc16"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-nintendo-results/nintendos-third-quarter-operating-profit-soars-on-switch-raises-outlook-idUSKBN1FK0PW", "ord_in_thread": 0, "title": "Nintendo's third quarter operating profit soars on Switch, raises outlook", "locations": [], "entities": {"persons": [{"name": "makiko yamazaki", "sentiment": "none"}, {"name": "himani sarkar", "sentiment": "none"}], "locations": [{"name": "osaka", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "nintendo", "sentiment": "negative"}, {"name": "nintendo co ltd", "sentiment": "negative"}, {"name": "thomson reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OSAKA (Reuters) - Japanese videogames maker Nintendo Co Ltd ( 7974.T ) reported its biggest third-quarter operating profit in eight years, driven by smashing demand for its new Switch games console, and said it expected annual earnings to outstrip its previous estimate.\nGrowing popularity of the hybrid home-portable Switch has led to a near-doubling of Nintendo’s stock price to nine-year highs since the device’s launch in March. Sales have exceeded initial estimates, on track to beat the lifetime numbers of its predecessor Wii U, leaving suppliers scrambling for parts.\nSwitch console sales will likely hit 15 million units in the year to March and climb to 20 million next year, Nintendo said, fuelling hopes of a repeat of the success of the first Wii that debuted in late 2006 and sold more than 100 million units.\n“The momentum for Switch over the last 10 months has been stronger than that of the Wii,” Nintendo President Tatsumi Kimishima said at an earnings briefing on Wednesday.\n“The key to Switch’s success in the second year will be to attract non-gamers,” he added.\nAnalysts believe Nintendo’s plan to launch “Labo”, LEGO-style accessories for the console that kids can build themselves on cardboard sheets, could bring in a younger audience.\n“This is exactly the kind of crazy idea that Nintendo is known for which we believe will help expand the company’s audience,” analysts at Macquarie wrote in a recent research note. It will be “appealing to younger audience which has not been addressed by Nintendo for some time”.\nNintendo sold 7.2 million Switch consoles in the three months through December and raised its annual sales forecast by a million from an earlier projection of 14 million units.\nThat already exceeds sales of 13.56 million consoles for the Wii U that was on the market from late 2012 through 2017.\n“Switch sales during the holiday season were stronger than expected in Japan, the United States and Europe,” Kimishima said at the briefing.\nQ3 BLOWS PAST CONSENSUS Stellar demand for Switch pushed Nintendo’s operating profit up almost four-fold to 116.50 billion yen ($1.07 billion) for the third quarter. This was the highest ever it has earned for the October-December period since 2009.\nThe results beat consensus estimate of around 67 billion yen from six analysts polled by Thomson Reuters I/B/E/S.\nThe Kyoto-based company raised its profit forecast for the year ending March to 160 billion yen, from 120 billion yen, versus analysts’ estimate of 144 billion yen.\nThe company’s annual profit hit a record high of 555 billion yen in the year to March 2009, driven by Wii sales.\nShares of Nintendo closed up 2 percent before the quarterly results were announced, versus the wider market .N225 that closed down about 1 percent.\nNintendo, which relies heavily on Switch to drive its earnings, is looking to diversify its revenue sources by moving into new areas such as smartphone gaming and theme parks with its roster of popular characters.\nBut its efforts in smartphone gaming have produced lackluster results.\nIt has released four smartphone titles over the last two years, but recently decided to ditch the first one, a social networking service-style application called Miitomo, due to sluggish demand.\nPokemon GO was a phenomenal success, but Nintendo receives profits only through an affiliate which developed the game with a Google spinoff.\n“The smartphone business is yet to become a profit pillar for Nintendo,” Kimishima said. “We still have a lot to do.”\n($1 = 108.6900 yen)\nReporting by Makiko Yamazaki; Editing by Himani Sarkar\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-31T15:24:00.000+02:00", "crawled": "2018-01-31T09:31:38.001+02:00", "highlightTitle": ""}