{"organizations": [], "uuid": "2a090fdae0536219a42637761636264b6639a26a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180107&t=2&i=1220099124&w=1200&r=LYNXMPEE060OV", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-spain-fcb-coutinho/versatile-coutinho-will-be-great-asset-for-barca-says-coach-idUKKBN1EW0UO", "country": "US", "domain_rank": 408, "title": "Versatile Coutinho will be great asset for Barca, says coach", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T23:29:00.000+02:00", "replies_count": 0, "uuid": "2a090fdae0536219a42637761636264b6639a26a"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-spain-fcb-coutinho/versatile-coutinho-will-be-great-asset-for-barca-says-coach-idUKKBN1EW0UO", "ord_in_thread": 0, "title": "Versatile Coutinho will be great asset for Barca, says coach", "locations": [], "entities": {"persons": [{"name": "coutinho", "sentiment": "negative"}, {"name": "philippe coutinho", "sentiment": "none"}, {"name": "reuters/albert gea", "sentiment": "none"}, {"name": "valverde", "sentiment": "none"}, {"name": "ernesto valverde", "sentiment": "none"}], "locations": [{"name": "liverpool", "sentiment": "none"}], "organizations": [{"name": "barca", "sentiment": "negative"}, {"name": "fc barcelona", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "levante", "sentiment": "none"}, {"name": "barcelona", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 7, 2018 / 9:33 PM / Updated an hour ago Versatile Coutinho will be great asset for Barca, says coach   Philippe Coutinho’s versatility makes him a great acquisition for Barcelona, coach Ernesto Valverde said on Sunday as the Brazilian made his first public appearance at the Nou Camp following his 142-million-pound move from Liverpool. Soccer Football - FC Barcelona present new   - Auditorium 1899,   FC Barcelona's new   during the presentation REUTERS/Albert Gea \n“I think he will give us many things -- he has a good goal-scoring record, he gives assists, he’ll be able to help us a lot in attack and can play in the middle or on the wing,” Valverde said. \nThe coach has yet to decide where the new signing will fit into his fluid side, who are unbeaten in the Liga and Champions League. \n“He’s versatile and we can make the most of that. We’re going to see how he trains first and then we’ll decide,” Valverde said. \n“I’ve seen him play in a lot of positions for Liverpool and for his country, although I don’t imagine we’ll be putting him in goal.” \nBarca beat Levante 3-0 at home on Sunday with goals from Lionel   Paulinho, to   the La Liga standings and after the game Coutinho put on a club tracksuit to   at the Nou Camp. \nCoutinho, who will sign his five-year contract with Barca and be officially presented to the media on Monday, is the third most expensive transfer ever after Neymar Jr. and Kylian Mbappe, both at Paris St Germain, and ahead of new Barca team mate Ousmane Dembele, who cost the Catalans 105 million euros ($126.35 million). \nBarcelona midfielder Ivan Rakitic told reporters he was looking forward to seeing Coutinho play at the club. \n“My opinion about his price doesn’t matter, it went up a bit, the market dictates how much you have to pay, but we are the biggest club in the world, we want another player, and he is one of the best around,” he said. \n“The important thing is that every player feels welcome so we can fight for our objectives together. We will welcome him as one more member of the family. We all know all about him and we’re going to really enjoy his football.” \nCoutinho was also welcomed to Barca by former Liverpool team mate Suarez, with whom he spent two years at Anfield, coming agonisingly close to winning the Premier League title in 2014. \n“I‘m very happy as a team mate and a friend of his, I think he’s going to contribute a lot to the team,” Suarez said. \n“Everyone knows how much quality he has, he has spent many years at the elite level. We will help make him feel at home and ensure he adapts well.” \nCoutinho’s Barca debut could be delayed due to a thigh injury which kept him out of Liverpool’s last two games against Burnley and Everton, while he cannot play again in the Champions League this season after already appearing in the competition. Reporting by Richard Martin; editing by Clare Fallon", "external_links": [], "published": "2018-01-07T23:29:00.000+02:00", "crawled": "2018-01-08T00:22:45.004+02:00", "highlightTitle": ""}