{"organizations": [], "uuid": "eca4b1d488c008ef80b0403ee19ff2cbd83df401", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/12/rtx3vkfj.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/17/bitcoin-bubble-burst/", "country": "US", "domain_rank": 1196, "title": "Did Bitcoin Just Burst? How It Compares to History's Big Bubbles | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.801, "site_type": "news", "published": "2018-01-17T13:46:00.000+02:00", "replies_count": 0, "uuid": "eca4b1d488c008ef80b0403ee19ff2cbd83df401"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/17/bitcoin-bubble-burst/", "ord_in_thread": 0, "title": "Did Bitcoin Just Burst? How It Compares to History's Big Bubbles | Fortune", "locations": [], "entities": {"persons": [{"name": "bitcoin", "sentiment": "none"}], "locations": [{"name": "mississippi", "sentiment": "none"}, {"name": "south sea", "sentiment": "none"}], "organizations": [{"name": "bloomberg 11:46 am est  bitcoin", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Bloomberg 11:46 AM EST \nBitcoin’s recent wobbles have given fresh urgency to a question that’s gripped market observers for much of the past year: Will the cryptocurrency go down as one of history’s most infamous bubbles, alongside tulipmania and the dot-com craze? \nThe magnitude of Bitcoin’s boom (before it lost as much as 50 percent from its Dec. 18 high) suggests investors have reason to be worried. \nAs the chart shows, the cryptocurrency’s nearly 60-fold increase during the past three years was truly extraordinary. \nIt dwarfed the Nasdaq Composite Index’s gain during the headiest days of the 1990s. Going further back, it comfortably outstripped the Mississippi and South Sea bubbles of the 1700s. It even topped the Dutch tulipmania of the 1630s, though that last comparison should be taken with a grain of salt given the scarcity of recorded tulip values. (The chart includes prices for just one varietal; consistent post-peak figures were unavailable.) \nBulls say that Bitcoin’s boom is far from over, and that there’s more to analyzing a market than just measuring price gains. While the recent tumble has alarmed some investors, the cryptocurrency has bounced back from several previous swoons exceeding 50 percent. If Bitcoin did become a widely-accepted form of digital gold, as predicted by Cameron Winklevoss of Facebook fame, it could have a lot further to surge. \nThere’s also more than one way to slice a rally. On an annualized basis, Bitcoin’s three-year rise has been slower than the gains seen during several of history’s biggest manias — most notably the Mississippi and South Sea bubbles. \nStill, skeptics abound. Howard Wang of New York-based Convoy Investments LLC and Jeremy Grantham of GMO LLC have analyzed Bitcoin’s advance relative to past frenzies and concluded that it’s unsustainable. Grantham, who helps oversee about $74 billion as GMO’s chief investment strategist, summed up his concerns in a Jan. 3 letter to investors: \n“Having no clear fundamental value and largely unregulated markets, coupled with a storyline conducive to delusions of grandeur, makes this more than anything we can find in the history books the very essence of a bubble,” he wrote. \nThe strategist has a mixed record of success with such warnings. While Grantham was correct to call the 1990s surge in tech stocks a bubble, he exited too soon and missed out of some of the market’s biggest gains. \nOnly time will tell whether Grantham and other bears are right, wrong, or just too early when it comes to Bitcoin. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-17T13:46:00.000+02:00", "crawled": "2018-01-17T22:15:44.022+02:00", "highlightTitle": ""}