{"organizations": [], "uuid": "1d7d25332116e6851b7ee6bdd8d3914bd7db44ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/27/the-associated-press-with-few-breakouts-or-oscar-pics-the-sundance-market-cools.html", "country": "US", "domain_rank": 767, "title": "With few breakouts or Oscar pics, the Sundance market cools", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T18:44:00.000+02:00", "replies_count": 0, "uuid": "1d7d25332116e6851b7ee6bdd8d3914bd7db44ab"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/27/the-associated-press-with-few-breakouts-or-oscar-pics-the-sundance-market-cools.html", "ord_in_thread": 0, "title": "With few breakouts or Oscar pics, the Sundance market cools", "locations": [], "entities": {"persons": [], "locations": [{"name": "aleppo", "sentiment": "none"}], "organizations": [{"name": "netflix", "sentiment": "none"}, {"name": "amazon studios", "sentiment": "none"}, {"name": "universal pictures", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The 2018 Sundance Film Festival had a lot of cultural forces working in its favor with #MeToo and a batch of the previous year's films celebrating Oscar nominations. But as the annual indie film showcase inches to a close, Sunday, with few big deals and even fewer potential breakouts, it seems the excitement has cooled and a marketplace is in flux.\nLast year, the festival hosted the premieres of best picture nominees \"Get Out\" and \"Call Me By Your Name,\" and other awards favorites like the romantic comedy \"The Big Sick\" and the historical drama \"Mudbound\" — both of which also scored Oscar nominations. And more than half of the Oscars' documentary crop are Sundance premieres — \"Icarus,\" ''Strong Island\" and \"Last Men in Aleppo.\"\nThe deals were sizable too, as the deep-pocketed streaming services pushed more traditional studios to bid more. Amazon Studios shelled out $12 million for \"The Big Sick,\" which more than paid off with over $55.8 million in box office receipts, and Netflix spent $12.5 million on \"Mudbound.\" ''Get Out\" was already set to be distributed by Universal Pictures, but even producer Jason Blum credits some of its eventual massive success to the buzz it got from its surprise midnight showing.\n\"A lot of people weren't so sure about that. I really felt like It was the right thing to do, and it could have gone either way,\" Blum said. \"I was proud we made that decision.\"\nThis year, Amazon and Netflix were quiet. The biggest acquisition so far is Neon/AGBO's $10 million deal for the teen girls versus misogynists genre film \"Assassination Nation.\" Among the next highest was the $7 million HBO Films spent for \"The Tale,\" starring Laura Dern as a woman who suffered sexual abuse when she was 13. It's a challenging and provocative film based on the director's life that some, like Vulture senior editor Kyle Buchanan believed was among the best shots for awards love. Now \"The Tale\" won't even get a theatrical release.\n\"I can't argue with the idea that if you really want your movie to be seen, a streaming service or television is a way you can make that happen,\" Buchanan said. \"But it's interesting, I think film distributors are shying away from provocative content these days and leaving that room for other, newer, less traditional outlets to make the sort of noise that they would have once had exclusively.\"\nBrent Lang, a senior film and media editor for Hollywood trade magazine Variety, broke the story of the HBO acquisition of \"The Tale.\"\n\"It's just a sign of where the quality adult entertainment is going,\" Lang said. \"There is a lot of uncertainty in this space. Usually Fox Searchlight would have come out with a lot of big acquisitions but I think with their ownership change with Disney, it didn't seem like they were quite as aggressive.\"\nFox Searchlight is the independent arm of 21st Century Fox which has in the past acquired films like \"Little Miss Sunshine\" out of the festival, held in Park City, Utah. The past few years had been difficult on Searchlight, however, with misses like the record $17.5 million deal for \"Birth of a Nation,\" ''Me and Earl and the Dying Girl\" and \"Patti Cake$.\" Then in December, Disney struck a deal to buy a large part of Fox, including its movie and television studios, for about $52.4 billion.\nLang noted that Searchlight, Netflix and Amazon have been doing more in-house productions and fewer acquisitions.\n\"That kind of depressed the market and changed things,\" he said.\nIt left more room for smaller distributors to scoop up films like \"Monsters and Men\" (Neon), \"Sorry to Bother You\" (Annapurna), \"Blindspotting\" (Lionsgate), \"Colette\" (Bleecker Street and 30West), \"Leave No Trace\" and \"Search\" (Sony Pictures Worldwide Acquisitions), \"American Animals\" (The Orchard) and \"Hearts Beat Loud\" (Gunpowder & Sky).\nAnd some of the more positively reviewed films, like comedian Bo Burnham's \"Eighth Grade\" (A24), and Gus Van Sant's \"Don't Worry, He Won't Get Far on Foot\" (Amazon) came into the festival with distribution in place. But there seems to be no one film that everyone is buzzing about, especially when it comes to next year's Oscars.\n\"You came out of last year thinking there are four strong best picture contenders here which were \"Call Me By Your Name,\" ''Get Out,\" ''Mudbound\" and \"The Big Sick,\" Buchanan said. \"This year, I don't necessarily sense that there's a best picture nominee among these movies. That said there are all sorts of ways that the mood of the country or the plan of the distributor could help push one of these movies to the forefront. But I think that we'll mostly see the Sundance films contending in other categories besides (best) picture.\"\nFor full coverage of awards season, visit: https://apnews.com/tag/AwardsSeason", "external_links": [], "published": "2018-01-27T18:44:00.000+02:00", "crawled": "2018-01-28T16:56:27.000+02:00", "highlightTitle": ""}