{"organizations": [], "uuid": "11471c9e5a08d076965ecf073f6f3eb93d150232", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/12/22/104183192-GettyImages-535708454.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/trump-aims-to-open-arctic-pacific-and-atlantic-to-offshore-drilling-in-ambitious-new-plan.html", "country": "US", "domain_rank": 767, "title": "Trump aims to open Arctic, Pacific and Atlantic to offshore drilling in ambitious new plan", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.011, "site_type": "news", "published": "2018-01-04T20:21:00.000+02:00", "replies_count": 0, "uuid": "11471c9e5a08d076965ecf073f6f3eb93d150232"}, "author": "Tom Dichristopher", "url": "https://www.cnbc.com/2018/01/04/trump-aims-to-open-arctic-pacific-and-atlantic-to-offshore-drilling-in-ambitious-new-plan.html", "ord_in_thread": 0, "title": "Trump aims to open Arctic, Pacific and Atlantic to offshore drilling in ambitious new plan", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "sergey anisimov", "sentiment": "negative"}, {"name": "ryan zinke", "sentiment": "none"}], "locations": [{"name": "pacific", "sentiment": "none"}, {"name": "atlantic", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "alaska", "sentiment": "none"}, {"name": "gulf of mexico", "sentiment": "none"}, {"name": "north aleutians basin", "sentiment": "none"}, {"name": "california", "sentiment": "none"}], "organizations": [{"name": "anadolu agency", "sentiment": "negative"}, {"name": "trump interior department", "sentiment": "none"}, {"name": "interior", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Trump Interior Department on Thursday announced plans to offer blocks in the Arctic, Atlantic and Pacific oceans for oil and gas exploration in an ambitious new five-year offshore lease plan.\nInterior Secretary Ryan Zinke said the proposal for offshore leasing between 2019 and 2024 would offer about 90 percent of the U.S. outer continental shelf, the largest lease sale ever. The only area that will not be included is the North Aleutians Basin in Alaska.\nThe plan would open the door for drilling in areas far beyond the U.S. epicenter of offshore drilling in the central and western Gulf of Mexico, giving oil and gas companies the opportunity to explore areas left out of leases for decades.\nBut the move also sets up a battle with environmental groups and coastal governors opposed to drilling off the shores of states from California to North Carolina. Additionally, it comes at a time when oil prices are on the rise, but stuck in a range that makes multi-billion-dollar projects in new offshore areas unattractive for many drillers.\nIt would also overturn indefinite bans on drilling in much of the Arctic Ocean and parts of the Atlantic announced during the final days of the Obama administration, potentially sparking a court battle over executive authority .\nThe administration's expansive lease schedule was widely anticipated.\nIn April, Trump signed the America First Offshore Energy Executive Order instructing Zinke to revise the current-five year schedule for leasing blocks of the U.S. outer continental shelf, the waters off the U.S. shore that the federal government governs. At the time, he explicitly said it reversed the Obama administration's ban on Arctic leases.\n\nRevisions are not uncommon when a new president takes office; Obama initiated a new five-year planning process in his first term.\nThe revision process, which includes conducting environmental impact studies and taking public comments, has taken about two years in the past, said Connie Gillette, chief of public affairs for the Bureau of Ocean Energy Management, the unit of the Interior Department that oversees the lease schedule. Gillette confirmed to CNBC that BOEM will attempt to finalize the plan by 2019, but would not circumvent the process.\nZinke on Thursday said Interior would try to complete the process in \"months.\"\nIn its latest plan for the 2017-2022 period, the Obama administration offered a conservative selection of leases in the western and central Gulf of Mexico and Alaska's Cook Inlet, leaving contested areas like the Atlantic, Pacific and eastern Gulf of Mexico off the table.\nDrilling in the Atlantic and Pacific outer continental shelf faces stiff opposition from many governors, including Trump allies like Florida Governor Rick Scott.\n\"I have already asked to immediately meet with Secretary Zinke to discuss the concerns I have with this plan and the crucial need to remove Florida from consideration,\" Scott said in a statement.\n@FL:GovScott: Governor Scott's Statement on Trump Administration's Plan on Offshore Oil Drilling: \nSen. Bill Nelson (D-Fl) also plans to challenge the Trump administration's plans to relax offshore drilling safety rules put in place after the Deepwater Horizon oil spill in 2010.\nIt also remains unclear whether the oil and gas industry has the appetite for leases in largely uncharted territory.\nRecent federal lease sales have generated a tepid response, said Imran Khan, who leads Wood Mackenzie's commercial valuation team for oil and gas projects in the Gulf of Mexico. There is also limited infrastructure in the western Gulf of Mexico and questions surrounding reserves in eastern waters off the coast of Florida.\nAfter a period of prolonged low oil prices, many offshore drillers are focusing on tying new wells in the Gulf of Mexico to existing infrastructure, rather than investing billions in new offshore platforms, he said. Further, offshore drilling faces competition from onshore U.S. shale drilling, which can be started up and shut down quickly as oil prices fluxuate.\n\"The issue is there's always a concern now that the market is going to get flooded again with oil and prices are going to come back down,\" Khan told CNBC.\n\"I don't think the industry has faith that oil prices are remaining at this level for the money on the offshore side to start flowing.\"", "external_links": [], "published": "2018-01-04T20:21:00.000+02:00", "crawled": "2018-01-04T20:22:01.024+02:00", "highlightTitle": ""}