{"organizations": [], "uuid": "0086e84f8681cdddc80cd1377665182452721e61", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/11/29/104867503-20171129-7100-2519.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/31/att-earnings-q4-2017.html", "country": "US", "domain_rank": 767, "title": "AT&T earnings Q4 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.778, "site_type": "news", "published": "2018-01-31T22:31:00.000+02:00", "replies_count": 0, "uuid": "0086e84f8681cdddc80cd1377665182452721e61"}, "author": "Christine Wang", "url": "https://www.cnbc.com/2018/01/31/att-earnings-q4-2017.html", "ord_in_thread": 0, "title": "AT&T earnings Q4 2017", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CNBC.com Adam Jeffery | CNBC Randall Stephenson, CEO of AT&T speaking at the New York Economic Club on Nov. 29th, 2017. \nAT&T posted fourth-quarter results that bested Wall Street expectations on Wednesday. \nThe company said it saw strong wireless customer growth as well as fewer subscriber cancellations than the Street had projected. AT&T also gave strong guidance for fiscal 2018. \nThe stock rose more than 3 percent in after-hours trade as more than 5 million shares changed hands. \nHere's how the company did compared with what analysts expected: EPS: 78 cents vs. 65 cents expected according to Thomson Reuters Revenue: $41.68 billion vs. $41.19 billion expected according to Thomson Reuters Postpaid churn rate: 0.89% vs. 1.15% expected according to StreetAccount \nAT&T said it added 4.1 million wireless customers in the fourth quarter. \nThe company also said it saw its lowest-ever fourth-quarter subscriber cancellation rate. The postpaid churn rate was 0.89 percent for the quarter. The total was lower, therefore better, than Wall Street's expectation of 1.15 percent, according to StreetAccount. \nFor 2018, AT&T said it expects adjusted earnings of about $3.50 per share. Analysts had previously forecast that the company would report full-year earnings of $3.05 per share. \nIn December, AT&T said it will give $1,000 bonuses to more than 200,000 U.S. employees, citing the passage of tax reform. The company also said it plans to spend an additional $1 billion in the United States after the recent tax overhaul. \nThe new tax law slashes the corporate tax rate to 21 percent from the previous rate of 35 percent. AT&T said in its 2016 annual report that its effective tax rate was 32.7 percent. \nLate last year, the Justice Department challenged AT&T's pending merger with Time Warner. President Donald Trump has said the deal is \" not good for the country \" because it might lead to higher prices for consumers. \nBut the company could stand to benefit from the FCC's recent repeal of net neutrality regulation. This new landscape allows AT&T more flexibility to control the pricing and speed of content for its internet customer. AT&T has said, however, it will not make big changes to the way internet services are delivered. \n— CNBC's Anita Balakrishnan and Ari Levy contributed to this report.", "external_links": [], "published": "2018-01-31T22:31:00.000+02:00", "crawled": "2018-01-31T22:30:57.001+02:00", "highlightTitle": ""}