{"organizations": [], "uuid": "6628d04d930a39bbf1a95c6ab9dac1490b6ad58e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219166016&w=1200&r=LYNXMPEE021AE", "site_section": "http://feeds.reuters.com/reuters/worldNews?format=xml", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-iran-rallies-monarchy/u-s-should-clear-way-for-tech-companies-to-help-iranians-former-crown-prince-idUSKBN1ES23V", "country": "US", "domain_rank": 408, "title": "U.S. should clear way for tech companies to help Iranians: former crown prince", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T00:58:00.000+02:00", "replies_count": 0, "uuid": "6628d04d930a39bbf1a95c6ab9dac1490b6ad58e"}, "author": "", "url": "https://www.reuters.com/article/us-iran-rallies-monarchy/u-s-should-clear-way-for-tech-companies-to-help-iranians-former-crown-prince-idUSKBN1ES23V", "ord_in_thread": 0, "title": "U.S. should clear way for tech companies to help Iranians: former crown prince", "locations": [], "entities": {"persons": [{"name": "reza pahlavi", "sentiment": "none"}, {"name": "pahl", "sentiment": "none"}, {"name": "reza shah", "sentiment": "none"}, {"name": "pahlavi", "sentiment": "none"}, {"name": "yeganeh torbati", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "islamic republic", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 10:55 PM / Updated 13 hours ago U.S. should clear way for tech companies to help Iranians: former crown prince Yeganeh Torbati 5 Min Read \nWASHINGTON (Reuters) - The Trump administration should encourage U.S. technology companies to provide communication services to Iranians as they protest their country’s clerical rulers, said Reza Pahlavi, the last heir to the Iranian monarchy. \nIn an interview with Reuters on Wednesday, Pahlavi also criticized the Trump administration’s ban on travel to the United States by most Iranians, calling it “ridiculous”. \nAnti-government protests have gripped Iran for nearly a week in the most sustained challenge to the Islamic Republic’s clerical elite in almost a decade. \nPahlavi has lived in exile for nearly four decades, since his father, the U.S.-backed shah, was overthrown in the 1979 Islamic Revolution. \nThe opposition to Iran’s clerical government is atomized, with no clear recognized leader. But some demonstrators have in recent days chanted slogans in favor of Pahlavi’s grandfather, Reza Shah, breaking a longstanding taboo. \nPahlavi said he wants to see Iranians “determine their own fate out of their own free will,” and praised U.S. President Donald Trump and members of his cabinet for speaking in support of Iranian protesters. \nBut he said they also should take steps to ensure that Iranians have access to communication and social media tools, which they have used to share videos and messages documenting protests and clashes with security forces. \nIran, which bars the use of major social media platforms, also has restricted access to the Telegram messaging app, and Iranian users in recent days have reported major hurdles in accessing the internet. \n“We need more than lip service. We need to see concrete actions,” Pahlavi said. “This has to be immediate ... As we speak, the regime is attempting yet again to try to shut down whatever it is, whether it’s Instagram or Telegram.” \nThere is a precedent for this type of U.S. intervention. In 2009, amid mass protests over a disputed election, an Obama administration official asked Twitter executives to delay scheduled maintenance so Iranians could continue to use the service to communicate. Reza Pahlavi, the last heir apparent to the defunct throne of the Imperial State of Iran and the current head of the exiled House of Pahlavi speaks during an interview with Reuters in Washington, U.S., January 3, 2018. REUTERS/Joshua Roberts \nTechnology experts have documented numerous examples of commercial services being denied to Iranians, often because of concerns about running afoul of U.S. sanctions. \nActivists have urged tech companies to loosen their Iran policies, but say the Trump administration could expand exemptions to make clear that some services are allowed. \nState Department spokeswoman Heather Nauert said in a news briefing on Tuesday that the United States wants to see Iranians have access to social media and other tools. But when asked if Google was “over-interpreting” U.S. sanctions on Iran by blocking access to one of its services there, Nauert said she had “no idea.” \nAsked if the State Department is urging tech companies to do more to ensure access for Iranians, a State Department spokeswoman did not answer directly but said U.S. support for the free flow of information to Iranians “is a key element of the President’s new U.S. strategy for Iran.” EXEMPTIONS TO SANCTIONS \nThe Obama administration approved exemptions to U.S. sanctions that allowed for providing chat, email, social networking, photo sharing, web browsing, blogging and other personal communication services. \nTwitter and messaging service Signal did not immediately respond to requests for comment. Facebook and Google declined to comment. \n“The policies of these companies are not really clear,” said Amir Rashidi, an internet security researcher at the Center for Human Rights in Iran, a non-governmental organization based in New York. \nPahlavi critiqued the Trump administration’s decision to ban nearly all Iranian travelers and immigrants from the United States as part of a broader travel ban targeting several mostly Muslim countries. \n“Iranian diplomats still can travel (here) but innocent Iranians who in fact work and have built this country are barred from coming,” said Pahlavi, who lives in the United States. “Why? Because they’re under the so-called ban. That’s ridiculous.” \nA State Department spokeswoman said U.S. support for the Iranian people “is a fundamentally separate issue” from the travel ban. Reporting by Yeganeh Torbati, additional reporting by Paresh Dave and David Ingram in San Francisco; Editing by John Walcott and James Dalgleish", "external_links": [], "published": "2018-01-04T00:58:00.000+02:00", "crawled": "2018-01-04T01:03:42.000+02:00", "highlightTitle": ""}