{"organizations": [], "uuid": "a12b61680add2efd321c9325ad97106741b3ba8a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-netherlands-usa-hoekstra/trumps-new-netherlands-envoy-sheds-no-light-on-muslim-chaos-comment-idUSKBN1EZ1TO", "country": "US", "domain_rank": 408, "title": "Trump's new Netherlands envoy sheds no light on 'Muslim chaos' comment", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T20:03:00.000+02:00", "replies_count": 0, "uuid": "a12b61680add2efd321c9325ad97106741b3ba8a"}, "author": "", "url": "https://www.reuters.com/article/us-netherlands-usa-hoekstra/trumps-new-netherlands-envoy-sheds-no-light-on-muslim-chaos-comment-idUSKBN1EZ1TO", "ord_in_thread": 0, "title": "Trump's new Netherlands envoy sheds no light on 'Muslim chaos' comment", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "hoekstra", "sentiment": "none"}, {"name": "pete hoekstra", "sentiment": "none"}], "locations": [{"name": "netherlands", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "michigan", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "david horowitz freedom center", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "THE HAGUE (Reuters) - U.S. President Donald Trump’s new ambassador to the Netherlands, who two years ago said Muslim migrants had sown chaos in the country, cut short questions seeking clarification of those remarks in his first meeting with its media on Wednesday.\nPete Hoekstra, a former Republican congressman for Michigan, was repeatedly asked about the comments, made at an event sponsored by the right-wing David Horowitz Freedom Center.\n“The Islamic movement is now gotten to a point where they have put Europe into chaos,” Hoekstra had said at the November 2015 gathering, during a recorded panel discussion about migration from Muslim states.\n“Chaos in the Netherlands - there are cars being burned. There are politicians that are being burned and, yes, there are no-go zones in the Netherlands.”\nThere are no instances in modern Dutch history of politicians being set alight, and no areas of the country considered no-go zones.\nHoekstra last month denied making the comments, telling a reporter with current affairs program Nieuwsuur they were “an incorrect statement... fake news”.\nHe later apologized, saying in a tweet on Dec. 23: “I made certain remarks in 2015 and regret the exchange during the Nieuwsuur interview. Please accept my apology.”\nOn Wednesday at his new residence in The Hague, Dutch reporters repeatedly asked him to clarify if he believed local politicians had been set on fire.\nHoekstra repeated that he regretted the filmed exchange, which went viral on social media last month, but refused to comment further, angering reporters who were cut off by press officers.\n“Please answer the question,” the Nieuwsuur reporter said. “This is not how we do things here.”\nDutch-U.S. political and military ties go back four centuries and American officials rarely face hostility from Dutch media.\nPresident Donald Trump nominated Netherlands-born Hoekstra as ambassador to The Hague last July and the Senate confirmed the posting in November.\nHoekstra served as a Congressman from 1993 to 2011. He chaired the House Permanent Select Committee on Intelligence or was the ranking Republican on the Committee from 2004-2011.\nReporting by Anthony Deutsch; editing by John Stonestreet\n ", "external_links": [], "published": "2018-01-10T20:03:00.000+02:00", "crawled": "2018-01-10T20:19:58.032+02:00", "highlightTitle": ""}