{"organizations": [], "uuid": "d22333b1934c2ea6747c02f86f73561a2e813243", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226304793&w=1200&r=LYNXMPEE0S0YQ", "site_section": "http://feeds.reuters.com/Reuters/worldNews\r", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-mexico-election/mexican-presidential-poll-shows-leftist-in-the-lead-idUSKBN1FI1MQ", "country": "US", "domain_rank": 408, "title": "Mexico presidency race tightens; leftist stays out front: poll", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T18:05:00.000+02:00", "replies_count": 0, "uuid": "d22333b1934c2ea6747c02f86f73561a2e813243"}, "author": "", "url": "https://www.reuters.com/article/us-mexico-election/mexican-presidential-poll-shows-leftist-in-the-lead-idUSKBN1FI1MQ", "ord_in_thread": 0, "title": "Mexico presidency race tightens; leftist stays out front: poll", "locations": [], "entities": {"persons": [{"name": "andres manuel lopez obrador", "sentiment": "none"}, {"name": "lopez obrador", "sentiment": "none"}, {"name": "meade", "sentiment": "none"}, {"name": "jose antonio meade", "sentiment": "none"}, {"name": "ricardo anaya", "sentiment": "none"}], "locations": [{"name": "mexico", "sentiment": "none"}, {"name": "mexico city", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "pri", "sentiment": "none"}, {"name": "el universal", "sentiment": "none"}, {"name": "buendia & laredo", "sentiment": "none"}, {"name": "institutional revolutionary party", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "national action party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 1:30 PM / Updated 12 minutes ago Mexico presidency race tightens; leftist stays out front: poll Reuters Staff 3 Min Read \nMEXICO CITY (Reuters) - Leftist politician Andres Manuel Lopez Obrador has consolidated support in his bid for the Mexican presidency, but the race has tightened as another opposition contender gained ground while the ruling party hopeful trailed, a poll showed on Monday. \nThe Jan. 19-25 voter survey by Buendia & Laredo showed Lopez Obrador winning 32 percent of support, while Ricardo Anaya, the former chairman of the conservative National Action Party (PAN) leading a right-left coalition, had 26 percent. \nBack in third place, with 16 percent support ahead of the July 1 election, was Jose Antonio Meade, an ex-finance minister seeking the nomination of the ruling Institutional Revolutionary Party (PRI), the poll published in newspaper El Universal showed. \nThe PRI will not formally choose its candidate until Feb. 18. However, the party’s leaders are behind Meade, and he is widely expected to be confirmed as their candidate despite some internal grumbling about how the campaign is proceeding. \nA separate survey earlier this month also showed Meade failing to gain traction. If that trend persists, it would turn the election into a head-to-head contest between former Mexico City mayor Lopez Obrador, 64, and Anaya, 38. \nA Dec. 6 Buendia & Laredo poll gave Lopez Obrador 31 percent backing of voters, Anaya 23 percent and Meade 16 percent. FILE PHOTO: Mexican presidential candidate Andres Manuel Lopez Obrador of the National Regeneration Movement (MORENA), smiles to supporters during a pre-campaign rally in Mexico City, Mexico December 17, 2017. REUTERS/Ginnette Riquelme/File Photo \nHowever, the December survey had only 13 percent undecided voters, while there were 20 percent in this month’s poll. That means the gaps separating the three main contenders would be wider in January if those voters were discounted. \nLopez Obrador, the runner-up in the past two presidential contests, has been a polarizing figure in Mexican politics, especially since he brought much of the capital to a standstill with massive protests when he narrowly lost the 2006 election. Slideshow (2 Images) \nBut the new survey showed his image had improved. \nSome 49 percent of respondents held a positive view of him in January, compared with 44 percent in December. At the same time, the percentage of respondents with a negative opinion of him fell to 25 percent from 32 percent. \nThat net positive balance of 24 points was well ahead of Anaya, whose positives outweighed his negatives by 11 points. \nThe latest poll was based on 1,002 interviews and had a margin of error of 3.53 percentage points. Writing by Dave Graham; Editing by Lisa Von Ahn", "external_links": [], "published": "2018-01-29T18:05:00.000+02:00", "crawled": "2018-01-29T18:22:42.017+02:00", "highlightTitle": ""}