{"organizations": [], "uuid": "43c1d594a93be1165845b958abfa9de79a8f13cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/10/24/104793331-20171024-3437-2505.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/05/ethereum-hits-record-high-bitcoin-briefly-recovers-16000.html", "country": "US", "domain_rank": 767, "title": "Ethereum hits record high; bitcoin briefly recovers $16,000", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.038, "site_type": "news", "published": "2018-01-05T18:11:00.000+02:00", "replies_count": 0, "uuid": "43c1d594a93be1165845b958abfa9de79a8f13cb"}, "author": "Evelyn Cheng", "url": "https://www.cnbc.com/2018/01/05/ethereum-hits-record-high-bitcoin-briefly-recovers-16000.html", "ord_in_thread": 0, "title": "Ethereum hits record high; bitcoin briefly recovers $16,000", "locations": [], "entities": {"persons": [{"name": "joseph lubin", "sentiment": "negative"}, {"name": "coinmarketcap", "sentiment": "none"}, {"name": "vitalik buterin", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cnbc", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Digital currency ethereum climbed Friday to a record high, while bitcoin attempted to recover from a recent slump.\nEthereum briefly rose 9.6 percent to an all-time high of $1,075.39 Friday, according to CoinMarketCap. The digital currency had pared gains midmorning Friday and was trading about 3 percent higher near $1,014. It had a market capitalization of about $98 billion, remaining in third place behind ripple.\nBitcoin , the largest digital currency by market cap, jumped more than 11.5 percent Friday and was last trading around $16,249, according to Coinbase. That was still about 18 percent below its record high hit in mid-December.\nEthereum three-month performance\nSource: CoinMarketCap\nIn contrast to bitcoin, ethereum allows developers to build applications on its network. The digital cat breeding and trading game CryptoKitties is based on ethereum, as are the majority of initial coin offerings.\nEthereum is up more than 30 percent in January alone. On Tuesday, the digital currency's co-founder, Vitalik Buterin, announced in a blog post the launch of two subsidy programs for improving the ability of the ethereum network to process more transactions. Grant amounts can range from $50,000 to $1 million, the post said.\n\"I think there's an increasing probability of [a viable upgrade] getting done and that's why you're seeing the price increase,\" said Benjamin Roberts, co-founder and CEO of Citizen Hex, an ethereum-focused start-up backed by three Canadian venture funds.\n\"The value of any one of these cryptocurrencies is very, very correlated with the utility. Speculators will only take it so far and people won't hold it any more if they can't use it,\" Roberts said. \"I think people are just starting to wake up and realize the differences.\"\nSmaller, lesser-known digital currencies such as ripple have taken the spotlight in the last few weeks as they surged dramatically to join the ranks of the 10 largest cryptocurrencies by market capitalization.\nRipple , or XRP, has a market cap of nearly $122 billion and traded slightly lower near $3.15 Friday morning, after reaching an all-time high of $3.84 Thursday. The coin has surged more than 35 percent in January so far.\n\"I think the market will likely soon shift its denomination back to the larger, more liquid, and more trusted assets like bitcoin, driving up their price while sending some smaller assets falling steeply as large holders exit on thinly traded markets,\" Alex Sunnarborg, founding partner of cryptocurrency fund Tetras Capital, said in an email.\nWATCH: Six ways to protect your bitcoin and ethereum investments from hackers show chapters Six ways to protect your bitcoin and ethereum investments from hackers 9:04 AM ET Fri, 3 Nov 2017 | 03:40", "external_links": [], "published": "2018-01-05T18:11:00.000+02:00", "crawled": "2018-01-05T18:32:24.001+02:00", "highlightTitle": ""}