{"organizations": [], "uuid": "d9c0b76f10419a40955bd5ce453f51ec043fca1f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222718387&w=1200&r=LYNXMPEE0G0SV", "site_section": "http://feeds.reuters.com/reuters/politicsNews", "section_title": "Reuters: Politics", "url": "https://www.reuters.com/article/us-usa-election-pennsylvania/pennsylvania-race-to-test-democrats-hopes-for-anti-trump-wave-idUSKBN1F61GC", "country": "US", "domain_rank": 408, "title": "Pennsylvania race to test Democrats' hopes for anti-Trump wave", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T14:25:00.000+02:00", "replies_count": 0, "uuid": "d9c0b76f10419a40955bd5ce453f51ec043fca1f"}, "author": "", "url": "https://www.reuters.com/article/us-usa-election-pennsylvania/pennsylvania-race-to-test-democrats-hopes-for-anti-trump-wave-idUSKBN1F61GC", "ord_in_thread": 0, "title": "Pennsylvania race to test Democrats' hopes for anti-Trump wave", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "john whitesides", "sentiment": "none"}, {"name": "conor lamb", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "rick saccone", "sentiment": "none"}], "locations": [{"name": "pennsylvania", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}, {"name": "pa.", "sentiment": "none"}, {"name": "alabama", "sentiment": "none"}, {"name": "virginia", "sentiment": "none"}, {"name": "pittsburgh", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "none"}, {"name": "marine", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 12:30 PM / Updated 5 hours ago Pennsylvania race to test Democrats' hopes for anti-Trump wave John Whitesides 5 Min Read \nHOUSTON, Pa. (Reuters) - The conservative southwest corner of Pennsylvania, a patchwork of small towns, farms and Pittsburgh suburbs where voters backed Republican Donald Trump by 20 percentage points in 2016, seems an unlikely spot for a possible Democratic renaissance. \nBut the fledgling candidacy of Conor Lamb, a 33-year-old Marine veteran and former assistant U.S. attorney, has Democrats there dreaming of an upset in a special congressional election that could offer the best test yet of the strength of a possible Democratic wave forming for November’s congressional elections. \nTrump is expected to visit the district on Thursday to appear with Republican candidate Rick Saccone, underscoring the high stakes in the March 13 special election - and the level of concern in Republican circles. \nBuoyed by a sweeping win in Virginia and a shocking Senate upset in conservative Alabama, Democrats feel they can compete everywhere - and see Lamb’s gold-plated resume and moderate policy stances as a strong contrast to Saccone’s hard-edged conservatism. \n“If the Democrats can pull off a win, it would be a sign of much bigger and better things to come in November - and it would strike fear into Republicans,” said Mike Mikus, a Democratic strategist who lives in the district. \nIn a district where Trump remains popular and Democrats have not even fielded a candidate in the previous two congressional elections, Saccone has tied himself closely to the president. The conservative 59-year-old state legislator has joked he “was Trump before Trump was Trump.” \nDemocrat Lamb, who hails from a prominent Pennsylvania political family, rarely mentions Trump, focusing on economic issues, healthcare and protecting Social Security and Medicare. \nTo head off Republican charges he would be a loyal follower of Democratic House of Representatives leader Nancy Pelosi, he said he would not support her for speaker and has promised to work with Trump if it would help the district. \n“The overriding thing I hear from people is they want someone to go down to Washington and work with the other side,” Lamb said in an interview after a recent campaign event in Houston, a small town about 25 miles (40 km) southwest of Pittsburgh. \n‘NOT DOING ITS JOB’ \n“People know there will be disagreements, they know the issues are complex, but they feel like what they are getting now is a government that is not doing its job,” Lamb said. \nSaccone is a staunch Christian conservative, backing gun and abortion rights and introducing a resolution declaring 2012 to be “the year of the Bible.” While Democrats were surprised a more moderate candidate was not chosen to oppose Lamb, Christopher Nicholas, a Pennsylvania-based Republican consultant, said Saccone “fits the district.” FILE PHOTO: Conor Lamb's supporter Mary Ellen Donohue, of South Fayette, Pennsylvania, picks up a yard sign during Lamb's campaign rally in Houston, Pennsylvania, U.S. January 13, 2018. REUTERS/Alan Freed/File Photo \n“He obviously speaks the language, and Conor Lamb hasn’t figured out what the language is yet,” Nicholas said. \nThe special election to replace eight-term Republican Tim Murphy, who resigned in October after he was reported to have urged his mistress to have an abortion, will be the fifth competitive special House election since Trump took office. \nRepublicans won the first four last year, all in Republican-leaning districts, but Democrats improved their performance from previous elections in each race. Democrats need to pick up 24 seats to recapture control of the House in November elections. \nOutside Republican groups have rushed to Pennsylvania to offer support, and Vice President Mike Pence is expected to visit the district on Saccone’s behalf. \nEnding Spending Inc, a Republican Super PAC, is reported to be spending at least $1 million on advertisements to support Saccone. The Congressional Leadership Fund, a PAC aligned with House Speaker Paul Ryan, has hired a coordinator and brought in 50 canvassers with a goal of knocking on 250,000 doors before the election. \nCorry Bliss, the fund’s executive director, said the group wanted to start early to tie Lamb to Pelosi and help frame the race. He shrugged off Lamb’s promise not to support Pelosi as irrelevant. \n“If he were to go to Congress, he would be nothing more than a rubber stamp for her liberal agenda,” he said. \nThe blue-collar district, dotted with manufacturing facilities and closed coal mines, is about 93 percent white. Only one-third of residents have a college degree, and nearly one in five is above the age of 64. \nLarry Maggi, a Democratic Washington County commissioner who challenged Murphy in 2012 and lost by more than 25 percentage points, said linking Lamb to unpopular national Democrats could be an effective tactic in the district. \n“I‘m a conservative Democrat, and I had a difficult time separating myself from President Obama and Speaker Pelosi,” Maggi said. \nDemocrat Ron Demicheli, 71, of Bethel Park, a Navy veteran who served on river patrol boats in Vietnam, said he was optimistic about Lamb’s chances. \n“He’s a fresh face with new ideas - he absolutely can win this seat,” Demicheli said. Editing by Caren Bohan and Peter Cooney", "external_links": [], "published": "2018-01-17T14:25:00.000+02:00", "crawled": "2018-01-17T14:45:00.004+02:00", "highlightTitle": ""}