{"organizations": [], "uuid": "149ebe541d1bff352f19dec736fe1c0c8d9b6421", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219167446&w=1200&r=LYNXMPEE021AV", "site_section": "http://feeds.reuters.com/reuters/politicsNews/", "section_title": "Reuters: Politics", "url": "https://www.reuters.com/article/us-new-york-tax/new-york-reviewing-tax-system-changes-after-new-federal-tax-bill-idUSKBN1ES243", "country": "US", "domain_rank": 408, "title": "New York reviewing tax system changes after new federal tax bill", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T01:04:00.000+02:00", "replies_count": 0, "uuid": "149ebe541d1bff352f19dec736fe1c0c8d9b6421"}, "author": "", "url": "https://www.reuters.com/article/us-new-york-tax/new-york-reviewing-tax-system-changes-after-new-federal-tax-bill-idUSKBN1ES243", "ord_in_thread": 0, "title": "New York reviewing tax system changes after new federal tax bill", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "cuomo", "sentiment": "none"}, {"name": "stephanie kelly", "sentiment": "none"}, {"name": "andrew cuomo", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "state", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK (Reuters) - New York Governor Andrew Cuomo said on Wednesday the state is developing a plan to restructure its current income and payroll tax system in reaction to the massive U.S. federal tax overhaul passed along party lines in late December.\nCuomo, a Democrat and outspoken critic of the legislative changes, outlined in his 2018 State of the State agenda he will also challenge the new law in court as unconstitutional on the grounds that the first federal double taxation in U.S. history violates states’ rights and equal protection.\n“This law will hurt New York,” the agenda said. “These damaging reforms risk driving people from the state and reducing our ability to attract businesses.”\nThe sweeping Republican tax bill signed into law by U.S. President Donald Trump last month introduces a cap, of $10,000, on deductions of state and local income and property taxes, known as SALT. The tax overhaul was the party’s first major legislative victory since Trump took office in January 2017.\nThe SALT provision will hit many taxpayers in states with high incomes, property values and taxes. These include New York, New Jersey and California. Those states are generally Democratic leaning.\nOther states are also parsing options. The state of Connecticut is considering taking legal action against the overhaul in addition to reviewing possible changes to its tax code, Kelly Donnelly, a spokesperson for Connecticut Governor Dannel Malloy, also a Democrat, told Reuters.\n“We do believe that the Republican tax plan is discriminatory in nature against a lot of Connecticut residents,” Donnelly said.\nFollowing Governor Cuomo’s address, the Partnership for New York City, which represents business leaders and employers in the city, said they “applaud” the governor’s commitment to address the loss of state and local deductibility.\n“The business community is prepared to offer its cooperation and expertise to help explore how any negative impact on the state and its resident taxpayers might be offset, through such measures as a payroll tax or a public charitable fund,” the partnership’s CEO Kathryn Wylde said in a statement.\nReporting by Stephanie Kelly; Editing by Daniel Bases and Susan Thomas\n ", "external_links": [], "published": "2018-01-04T01:04:00.000+02:00", "crawled": "2018-01-04T01:15:50.000+02:00", "highlightTitle": ""}