{"organizations": [], "uuid": "cc0ad5d5ad1d723a7158387d8da541e3378f0438", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222242796&w=1200&r=LYNXMPEE0E1GE", "site_section": "http://feeds.reuters.com/reuters/topNews", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-northkorea-missiles-diplomacy/north-korea-meeting-to-stress-importance-of-sanctions-canada-idUSKBN1F42MQ", "country": "US", "domain_rank": 408, "title": "North Korea meeting to stress importance of sanctions: Canada", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T23:28:00.000+02:00", "replies_count": 0, "uuid": "cc0ad5d5ad1d723a7158387d8da541e3378f0438"}, "author": "", "url": "https://www.reuters.com/article/us-northkorea-missiles-diplomacy/north-korea-meeting-to-stress-importance-of-sanctions-canada-idUSKBN1F42MQ", "ord_in_thread": 0, "title": "North Korea meeting to stress importance of sanctions: Canada", "locations": [], "entities": {"persons": [{"name": "kim jong", "sentiment": "none"}, {"name": "david ljunggren", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "north korea", "sentiment": "none"}, {"name": "vancouver", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "pyongyang", "sentiment": "none"}], "organizations": [{"name": "united nations security council", "sentiment": "none"}, {"name": "min read  vancouver", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 28 PM / Updated 12 minutes ago North Korea meeting to stress importance of sanctions: Canada David Ljunggren 3 Min Read \nVANCOUVER (Reuters) - A summit on curbing North Korea’s nuclear ambitions will focus in part on how to ensure countries fully implement all the sanctions imposed on the reclusive state, a Canadian government source said on Monday. \nSenior officials from 20 nations will gather in Vancouver on Tuesday for the full-day meeting, which is designed to increase diplomatic and financial pressure on Pyongyang to scrap its nuclear programs. Canada and the United States are co-hosts. \nThe United Nations Security Council, which has already imposed a wide range of sanctions, last month approved new punitive measures seeking to limit Pyongyang’s access to refined petroleum products and crude oil and its earnings from workers abroad. \nNorth Korean leader Kim Jong Un shows little sign of bowing to the pressure. \nThe Canadian government source said some nations had less experience than others when it came to sanctions. \n“It is not insignificant to talk about how we can ensure an even application of those sanctions everywhere, not just by some of the larger or more developed countries,” said the source, who spoke on the condition of anonymity. \nU.S. officials say the meeting will probe how to boost maritime security around North Korea to intercept ships trying to defy sanctions. \nEric Walsh, Canada’s ambassador to South Korea, said the uneven way punitive measures were being applied meant “there are a lot of gaps.” A girl looks toward the North through a pair of binoculars near the demilitarized zone separating the two Koreas in Paju, South Korea, January 3, 2018. REUTERS/Kim Hong-Ji \nWalsh told a panel at the University of British Columbia on Monday that “one of the things we want to do is look at how we can improve enforcement.” \nAlthough immediate fears of war have eased after the first round of intra-Korean talks in more than two years last week, tensions over Kim’s missile tests remain high. \nA Japanese government source said the world needed to “force North Korea to change its policy by maximizing pressure through all available means, including through full implementation of U.N. Security Council resolutions and autonomous sanctions.” \nScott Snyder, director of the U.S.-Korea policy program at the Council on Foreign Relations in Washington, said if Pyongyang felt the tougher sanctions constituted a blockade, it might interpret them as an act of war. \n“If sanctions are going to be effective in achieving the objective of bringing about diplomacy, (they) have to be used not as a hammer but actually as a nutcracker or a scalpel,” he told the university panel. \nChina, North Korea’s main ally and principal trading partner, is not at the conference, which diplomats say will limit what can be achieved. \nLast month U.S. President Donald Trump accused China of allowing oil into North Korea. Beijing denied the charge. \nBritish Foreign Secretary Boris Johnson, who will be in Vancouver, on Monday said the international community had to stand united. \n“Sanctions are biting but we need to maintain diplomatic pressure on Kim Jong Un’s regime,” he said in a statement. Additional reporting by Linda Sieg in Tokyo and Elizabeth Piper in London; Editing by Matthew Lewis", "external_links": [], "published": "2018-01-15T23:28:00.000+02:00", "crawled": "2018-01-15T23:37:34.007+02:00", "highlightTitle": ""}