{"organizations": [], "uuid": "e08bd61194815de3c948afde73510720101b14ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-digital-media-veteran-mike-peralta-takes-on-new-role-at-criteo-as-executive-vice-president-central-sales-operations.html", "country": "US", "domain_rank": 767, "title": "Digital Media Veteran Mike Peralta Takes On New Role at Criteo as Executive Vice President, Central Sales & Operations", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-23T16:00:00.000+02:00", "replies_count": 0, "uuid": "e08bd61194815de3c948afde73510720101b14ae"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-digital-media-veteran-mike-peralta-takes-on-new-role-at-criteo-as-executive-vice-president-central-sales-operations.html", "ord_in_thread": 0, "title": "Digital Media Veteran Mike Peralta Takes On New Role at Criteo as Executive Vice President, Central Sales & Operations", "locations": [], "entities": {"persons": [{"name": "mike peralta", "sentiment": "negative"}, {"name": "peralta", "sentiment": "none"}, {"name": "criteo", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "criteo", "sentiment": "none"}], "organizations": [{"name": "criteo s.a.", "sentiment": "negative"}, {"name": "digital media veteran", "sentiment": "negative"}, {"name": "central sales & operations", "sentiment": "none"}, {"name": "commerce marketing ecosystem", "sentiment": "none"}, {"name": "criteo", "sentiment": "none"}, {"name": "criteo audience match beta", "sentiment": "none"}, {"name": "criteo customer acquisition beta", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 23, 2018 /PRNewswire/ -- Criteo S.A. (NASDAQ: CRTO), the leading commerce marketing technology company, today named Mike Peralta as Executive Vice President (EVP), Central Sales & Operations. Peralta brings more than 20 years of management and internet technology experience with deep expertise in the advertising technology and digital advertising industries. In his new role with Criteo, he will oversee the central sales team to drive forward revenue operations and demand for Criteo's newly launched products, including Criteo Audience Match BETA and Criteo Customer Acquisition BETA .\nPeralta has global experience in effective sales strategies development, data management and performance advertising platform management. As a trusted executive and leader, Peralta will be instrumental in amplifying Criteo's focus on innovation through its Commerce Marketing Ecosystem. His proven track record of maximizing customer ROI, and ability to evolve companies into multi-product powerhouses, make him an ideal addition to Criteo. As part of his role, Peralta will also spearhead the rollout of a new incentive management platform, and actively integrate Criteo Brand Solutions into the larger, global organization. He will report directly to Mollie Spilman, Criteo's Chief Operating Officer, who is regarded as one of the most respected executives shaping today's commerce marketing landscape.\n\"The constant evolution of our industry demands a strong lineup of products and services that align with the sales, profitability and ROI goals of our clients, and even stronger stewards to help transform it,\" said Mollie Spilman, Chief Operating Officer at Criteo. \"Having previously worked with Mike for several years at AOL, I can attest to his impressive background developing and maintaining lucrative revenue channels, and his ability to cultivate meaningful relationships with clients and partners. We're confident his leadership and management skills will be instrumental to the continued success and satisfaction of our customers.\"\n\"It's abundantly clear that today's shoppers are savvier than ever, and brands and retailers are in need of products that support a true omnishopping strategy. Between Criteo's notable industry research, new product introductions and focus on data collaboration, it's poised to successfully bring its customers into this new age of omnishopping, and I'm thrilled to have the opportunity to be a part of it,\" said Mike Peralta, Executive Vice President, Central Sales & Operations at Criteo. \"I am looking forward to joining this team during this pivotal time of retail resurgence.\"\nPrior to his position at Criteo, Peralta was President and CEO of AudienceScience where he oversaw all functional areas of the company, and serviced P&G's global advertising budget. Previously, he held numerous executive positions in the U.S., Europe and Asia, including roles as the CRO of MediaMath, COO of Magnetic, CRO of Tumri and an SVP at AOL and Advertising.com . He holds a Bachelor's degree in Environmental and Civil Engineering from Rensselaer Polytechnic Institute, and has done graduate work in Management and Public Policy from New York University. In addition, Peralta was a member of IAB Leadership Board and serves as an advisory board member to a number of start-ups and VC funds.\nAbout Criteo\nCriteo (NASDAQ: CRTO) the leader in commerce marketing, is building the highest performing and open commerce marketing ecosystem to drive profits and sales for retailers and brands. More than 2,700 Criteo team members partner with over 17,000 customers and thousands of publishers across the globe to deliver performance at scale by connecting shoppers to the things they need and love. Designed for commerce, Criteo Commerce Marketing Ecosystem sees over $550 billion in annual commerce sales data. For more information, please visit www.criteo.com .\nMedia Contact:\nKenya Hayes\nk.hayes@criteo.com\n(703) 589-7595\nView original content with multimedia: http://www.prnewswire.com/news-releases/digital-media-veteran-mike-peralta-takes-on-new-role-at-criteo-as-executive-vice-president-central-sales--operations-300586107.html\nSOURCE Criteo", "external_links": ["https://www.criteo.com/for-marketers/products/criteo-customer-acquisition/", "http://www.criteo.com/", "https://www.criteo.com/for-marketers/products/criteo-audience-match/", "http://www.prnewswire.com/news-releases/digital-media-veteran-mike-peralta-takes-on-new-role-at-criteo-as-executive-vice-president-central-sales--operations-300586107.html"], "published": "2018-01-23T16:00:00.000+02:00", "crawled": "2018-01-23T18:45:10.025+02:00", "highlightTitle": ""}