{"organizations": [], "uuid": "817d92b5e294960cd01218280bd0aed1303f6505", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-martin-instrument-and-western-data-systems-wds-announce-merger-to-create-allterra-central.html", "country": "US", "domain_rank": 767, "title": "Martin Instrument and Western Data Systems (WDS) announce merger to create AllTerra Central", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.019, "site_type": "news", "published": "2018-01-18T19:59:00.000+02:00", "replies_count": 0, "uuid": "817d92b5e294960cd01218280bd0aed1303f6505"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/pr-newswire-martin-instrument-and-western-data-systems-wds-announce-merger-to-create-allterra-central.html", "ord_in_thread": 0, "title": "Martin Instrument and Western Data Systems (WDS) announce merger to create AllTerra Central", "locations": [], "entities": {"persons": [{"name": "bobby hempfling", "sentiment": "none"}, {"name": "hempfling", "sentiment": "none"}, {"name": "mike minick", "sentiment": "none"}], "locations": [{"name": "allterra central austin", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "tx", "sentiment": "none"}, {"name": "oklahoma", "sentiment": "none"}, {"name": "austin", "sentiment": "none"}], "organizations": [{"name": "martin instrument and western data systems", "sentiment": "negative"}, {"name": "trimble optical", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "AUSTIN, Texas, Jan. 18, 2018 /PRNewswire/ -- Martin Instrument and Western Data Systems (WDS) today announced that the companies have completed a merger agreement to create AllTerra Central. The combined staff will allow AllTerra Central to better focus on bringing Trimble Optical, GNSS and GIS solutions and complete field supply availability to the Surveying, Mapping, Engineering and Construction markets across Texas and Oklahoma. The Management team will be headed up by Bobby Hempfling as President and Mike Minick as Vice President, with continued operation supported by the all the great employees of both companies.\n\"Both of our companies have prospered for more than 25 years because of their technical knowledge, strong customer relationships and focus on great customer service. When the opportunity became available to merge the talents of both, everyone involved knew that something incredible would result. This company will be unstoppable in providing support and high-tech solutions to the industry,\" said Hempfling.\nThe new AllTerra Central will be headquartered in Austin, TX, with locations in Houston, Dallas/Ft Worth, San Antonio, McAllen, Oklahoma City and Midland/Odessa.\n\"We have long admired Bobby and Mike and the incredible success story they have created at Martin Instrument. I strongly support the AllTerra vision for the future and the culture of innovation and great customer service,\" said Michael Hefer, owner of WDS.\nAllTerra Central will continue to provide sales of both new and used equipment, service centers to repair that equipment, and rental/leasing services to various industries/municipalities. Additionally, it will operate the most complete VRS network in TX and OK, and will continue to serve customers with a robust online solution - allowing easy access to products, services, and information to everyone.\nFor questions about this exciting news, please contact Bobby Hempfling at 512-282-4099 or at bobby.hempfling@allterracentral.com . Or visit www.allterracentral.com .\nAbout Martin Instrument\nMartin Instrument is Trimble's Premier Authorized Dealer for Survey Equipment. The team is comprised of highly experienced and dedicated people committed to providing the best knowledge and customer service in the surveying equipment industry. Martin Instrument was founded 23 years ago by Marty and Gina Richardson. Martin Instrument sells new and pre-owned Trimble, Nikon, and Spectra Precision survey products with a large selection of pre–owned GPS Systems, total stations, data collectors, and accessories, available online at martininstrument.com or at our stores in Austin and San Antonio, Texas.\nAbout Western Data Systems\nWestern Data Systems provides cutting edge positioning technology and solutions to the Geospatial Industries through Trimble Sales, Rentals, Training, Service, and Support of the best products at the best prices. WDS was founded by Michael Hefer in 1983 and is committed to building long‐term personal and professional relationships through genuine concern and appreciation for our customers, our vendors, our company, and our team members: thereby providing opportunities for growth and development for each.\nView original content with multimedia: http://www.prnewswire.com/news-releases/martin-instrument-and-western-data-systems-wds-announce-merger-to-create-allterra-central-300584714.html\nSOURCE Martin Instrument", "external_links": ["http://www.martininstrument.com/", "http://www.prnewswire.com/news-releases/martin-instrument-and-western-data-systems-wds-announce-merger-to-create-allterra-central-300584714.html"], "published": "2018-01-18T19:59:00.000+02:00", "crawled": "2018-01-18T22:05:51.004+02:00", "highlightTitle": ""}