{"organizations": [], "uuid": "8a99825f82a177019b991f8ddb0e7eea02f57443", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223359754&w=1200&r=LYNXMPEE0I10X", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-britain-outsourcing-carillion-insight/road-to-ruin-carillion-collapse-puts-spotlight-on-uk-outsourcing-model-idUKKBN1F81NI", "country": "US", "domain_rank": 408, "title": "Road to ruin? Carillion collapse puts spotlight on UK outsourcing model", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T16:18:00.000+02:00", "replies_count": 0, "uuid": "8a99825f82a177019b991f8ddb0e7eea02f57443"}, "author": "", "url": "https://uk.reuters.com/article/uk-britain-outsourcing-carillion-insight/road-to-ruin-carillion-collapse-puts-spotlight-on-uk-outsourcing-model-idUKKBN1F81NI", "ord_in_thread": 0, "title": "Road to ruin? Carillion collapse puts spotlight on UK outsourcing model", "locations": [], "entities": {"persons": [{"name": "alasdair pal", "sentiment": "none"}, {"name": "kate holton", "sentiment": "none"}, {"name": "elisabeth o'leary", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "balmedie", "sentiment": "none"}], "organizations": [{"name": "carillion", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 19, 2018 / 2:19 PM / Updated 5 hours ago Road to ruin? Carillion collapse puts spotlight on UK outsourcing model Kate Holton , Alasdair Pal , Elisabeth O'Leary 9 Min Read \nLONDON/BALMEDIE, Scotland (Reuters) - In Balmedie, a village on the northeast coast of Scotland, an unfinished 12 km stretch of dual carriageway is a stark illustration of why British construction company Carillion went bust this week. \nThe road project fell behind schedule and rose above budget, helping tip the contractor over the edge. Britain’s biggest corporate failure in almost a decade threatens thousands of jobs and has forced the government to step in to guarantee a slew of public services that the firm had provided. \nA handful of workers in high-visibility jackets could be seen still on the building site this week, on a bitterly cold day, nine months after that section of the route was expected to open. \nCarillion’s collapse has ignited a row over Britain’s system of outsourcing public services - everything from school meals and prison security to the maintenance of nuclear warheads - to competing private companies who rely on government work for a large part of their income. \nCritics including opposition politicians say it encouraged a risk-taking culture that saw Carillion bid aggressively for contracts and accept slender margins, leaving it little room for manoeuvre and leading to it racking up more and more debt when projects hit snags. \nThe company, working with two partners, took on the Scottish project - the Aberdeen Western Peripheral Route that bypasses the port city - about three years ago with a fixed-price contract of about 550 million pounds under which it would only be paid as it completed sections of the road. \nHowever one stretch of the project, from Balmedie to Tipperty, fell behind schedule due to the harsh Scottish winter. To compound matters, Carillion was not only struggling in Aberdeen but also in the delivery of two major hospitals in England and on sites in the Middle East and Canada. \nWith the group failing to bring in cash and its costs rising, debts ballooned. Worth 1 billion pounds a year ago, its value fell to 61 million pounds before the directors filed for liquidation at London’s High Court at 0600 GMT on Monday. \nCourt documents show it owed almost 1.3 billion pounds to lenders and had only 29 million pounds in cash reserves. \n“They have been too quick to book revenues upfront and they have slotted the costs in further down the line,” said Matthew Earl, founder of ShadowFall Capital & Research. “You can only do that for so long before it comes back to haunt you.” POLITICAL FIREFIGHT \nOutsourcing was pioneered in Britain by Margaret Thatcher in the 1980s. The country has since been the leader in Europe, and second only to the United States globally, in its use of companies such as Carillion, G4S, Serco and Capita to provide essential services. \nSuccessive governments of different parties have argued that private companies are more efficient at running services and that the outsourcing system allowed infrastructure investments to be made without adding considerably to the state’s debts. \n“What we want is to provide good-quality public services delivered at best value to the taxpayer,” Prime Minister Theresa May said after Carillion’s collapse. She also said the government was “a customer of Carillion, not the manager of Carillion”. \nYet the government was left carrying the can, in some respects. \nThe Aberdeen road was just one of 450 state projects Carillion was working on when it collapsed, including the building and maintenance of hospitals and schools, defence sites and a high-speed rail line. Its liquidation forced the government to step in to guarantee services. \nAnd Carillion is part of a wider outsourcing system. \nIn the 2015-16 financial year, Britain spent 251.5 billion pounds, or a third of total government spend, through external suppliers, according to National Audit Office estimates. \n“This isn’t one isolated case,” opposition Labour Party leader Jeremy Corbyn, a left-winger who favours nationalising certain public services like railways, said this week about the contractor’s collapse. “As the ruins of Carillion lie around her will the prime minister act to end this costly racket?” \nABERDEEN: ‘AMBITIOUS TIMETABLE’ \nEmploying 43,000 people around the world, Carillion helped to build major projects such as the Channel Tunnel, while also cleaning and providing meals for prisons, schools and hospitals. \nIt first signalled it was in trouble in July when a profit warning forced its CEO out. The company, which was burning through its cash reserves, wrote down the value of soured contracts by 845 million pounds. Construction takes place on the Western Peripheral Route in Aberdeen, Scotland, Britain January 17, 2018. REUTERS/Russell Cheyne \nThe construction of the Aberdeen Western Peripheral Route was one of the contracts taking its toll. The work had been won by Carillion and two joint venture partners, Balfour Beatty and Galliford Try in December 2014. \nLarry Irwin, a lawyer representing rural landowners affected by the build, said the project had been dogged by drainage and design issues which came to light once construction had started. \n“When we met with agents of the consortium, before they had been given the formal decision on the tender, they were suggesting it was an ambitious timetable to do it in three years,” he told Reuters. \nMore than three years on, most payments are yet to be made. “As is the case with most contracts of this nature, (the joint venture) receive payments once agreed sections of the road have opened to traffic,” said government agency Transport Scotland. \nStephen Rawlinson, director at industry consultants Applied Value, said delays meant that more of the project had to be carried out in the winter than originally intended. \nHe estimates costs rose at least 350 million pounds above budget. \nGalliford and Balfour declined to comment on details about cost and timetable problems. \nGalliford said earlier this week that Carillion owed up to 80 million pounds on the project when it collapsed, a sum picked up by the other two partners, who had stronger balance sheets. Slideshow (13 Images) \nOne of the few groups to benefit from Carillion’s demise was the hedge funds that bet against it, alerted by the fact the company was struggling to collect the money it was owed and taking longer to pay its suppliers. \n(Graphic for Carillion's problems laid bare, click reut.rs/2DdOs4z ) UNDER-CAPITALISED COMPANIES \nCarillion is not the first contractor to go bust and not the first outsourcer to grab the headlines. Rail maintenance firm Jarvis and property services group Connaught collapsed in 2010. \nIn 2012 G4S failed at the last minute to provide enough security guards for the London Olympics, forcing the organisers to call in the army, and both it and Serco have admitted charging to monitor criminals who were either dead or in prison. \nThe revelations prompted the government to take a much tougher line when awarding contracts. Coupled with a slowdown in new work due to the uncertainty of Brexit, many of Britain’s outsourcers have issued profit warnings in recent years. Related Coverage RBS offers support to customers hit by coll", "external_links": [], "published": "2018-01-19T16:18:00.000+02:00", "crawled": "2018-01-19T16:42:31.006+02:00", "highlightTitle": ""}