{"organizations": [], "uuid": "59ad843e8b2d0ece31fd8fc726b50d67992c703d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/02/04/102397221-462666156.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/15837362/device/rss/rss.html", "section_title": "U.S. News", "url": "https://www.cnbc.com/2018/01/25/trump-boosts-his-infrastructure-investment-plan-to-1-point-7-trillion.html", "country": "US", "domain_rank": 767, "title": "Trump boosts his infrastructure investment plan to $1.7 trillion", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T15:17:00.000+02:00", "replies_count": 0, "uuid": "59ad843e8b2d0ece31fd8fc726b50d67992c703d"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/25/trump-boosts-his-infrastructure-investment-plan-to-1-point-7-trillion.html", "ord_in_thread": 0, "title": "Trump boosts his infrastructure investment plan to $1.7 trillion", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "thune", "sentiment": "none"}, {"name": "john thune", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "commerce committee", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. President Donald Trump said on Wednesday that his long-awaited plan to help rebuild the nation's infrastructure would result in about $1.7 trillion in overall investment over the next 10 years, a larger figure than he previously announced.\nThe plan, which will be detailed in part at next week's State of the Union address, \"will actually probably end up being about $1.7 trillion,\" Trump told a gathering of mayors at the White House. Trump previously valued the plan, which is expected to feature a mix of federal and local investment, at $1 trillion.\nThe administration is expected to ask Congress for $200 billion in federal spending on infrastructure aimed at encouraging more than $1 trillion in state, local and private financing to build and repair the nation's bridges, highways, waterworks and other infrastructure.\nRepublican Senator John Thune , who chairs the Commerce Committee, told Reuters in an interview on Tuesday that the big challenge \"would be how do you pay for it and the (Trump administration is) talking about spending cuts, which are unspecified.\"\nThune said it was probably going to be \"tough\" to get Democrats to support a deal without the federal government raising additional revenue for improvements.\nHe said in order to get a bill approved this year, it would need to be moving through both the House of Representatives and Senate by late spring or early summer. Trump will need to make a big push to win approval, Thune added.\nReuters reported last week that the plan involved $100 billion in cost-sharing payments for projects and $50 billion for rural projects, with the remaining $50 billion largely split among \"transformative\" projects such as high-speed trains, and funds for federal transportation lending projects.\nA leaked document released this week, which an administration official confirmed was \"largely accurate,\" shows that the administration plans to reduce the cost-sharing for projects to no more than 20 percent of the costs from the traditional 80 percent federal share. That would result in a higher overall infrastructure boost if states agree to shoulder more of the costs.\nDemocrats have criticized that proposal and argued the Trump administration should back more direct federal spending.\nThe bill will also aim to streamline environmental reviews and it makes it easier to build highways and other projects and allow for greater tolling on roadways.", "external_links": [], "published": "2018-01-25T15:17:00.000+02:00", "crawled": "2018-01-25T16:46:23.010+02:00", "highlightTitle": ""}