{"organizations": [], "uuid": "b39fc9638da0fd8942216d0aeb16c5f905a0f9e4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-coffee-holding-co-inc-reports-year-end-results.html", "country": "US", "domain_rank": 767, "title": "Coffee Holding Co., Inc. Reports Year End Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T00:35:00.000+02:00", "replies_count": 0, "uuid": "b39fc9638da0fd8942216d0aeb16c5f905a0f9e4"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-coffee-holding-co-inc-reports-year-end-results.html", "ord_in_thread": 0, "title": "Coffee Holding Co., Inc. Reports Year End Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "staten island", "sentiment": "none"}], "organizations": [{"name": "coffee holding co., inc", "sentiment": "neutral"}, {"name": "coffee holding co., inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "STATEN ISLAND, N.Y., Jan. 29, 2018 (GLOBE NEWSWIRE) -- Coffee Holding Co., Inc. (Nasdaq:JVA) (the “Company”) today announced its operating results for the fiscal year ended October 31, 2017.\nThe Company had net income of $467,262 or $0.08 per share basic and diluted, for the fiscal year ended October 31, 2017 compared to a net income of $2,212,288, or $0.36 per share basic and diluted for the fiscal year ended October 31, 2016. The decrease in net income was due primarily to the reasons described below.\nNet sales totaled $77,127,595 for the fiscal year ended October 31, 2017, a decrease of $1,820,633, or 2.3%, from $78,948,228 for the fiscal year ended October 31, 2016. The decrease in net sales reflects reduced wholesale transactions with our largest wholesale green coffee customer during fiscal 2017 of approximately $16,775,000, partially offset by increased sales to both new and existing customers including a fourth quarter increase in revenues of $4,300,000 or 25.0%.\nCost of sales for the fiscal year ended October 31, 2017 was $64,977,632, or 84.3% of net sales, as compared to $67,066,050, or 85.0% of net sales, for the fiscal year ended October 31, 2016. Cost of sales consists primarily of the cost of green coffee and packaging materials and realized and unrealized gains or losses on hedging activity. The decrease in cost of sales reflects the change in the product mix due to the Company’s reduced wholesale transactions with its largest wholesale green coffee customer.\nGross profit for the fiscal year ended October 31, 2017 was $12,149,963, an increase of $267,785 from $11,882,178 for the fiscal year ended October 31, 2016. Gross profit as a percentage of net sales increased to 15.8% for the fiscal year ended October 31, 2017 from 15.0% for the fiscal year ended October 31, 2016. Although we experienced improved margins on our wholesale and roasted business during the year our margins have not increased as expected due to our integration of our acquisition of Comfort Foods and reduced profitability of our OPTCO subsidiary.\nTotal operating expenses increased by $2,908,136 to $10,927,246 for the fiscal year ended October 31, 2017 from $8,019,110 for the fiscal year ended October 31, 2016. Selling and administrative expenses increased $2,864,796, or 39.0%, to $10,228,506 for the fiscal year ended October 31, 2017 from $7,363,710 for the fiscal year ended October 31, 2016. The primary reasons for this increase were the acquisition of Comfort Foods, the full year of integration of Sonofresco and the increase in our freight costs as we increased and expanded our product distribution. Officers’ salary increased by $43,340 or 6.6% to $698,740 for the fiscal year ended October 31, 2017 from $655,400 for the fiscal year ended October 31, 2016.\n“The 2017 fiscal year marked a turning point for us following several years of declines as we increased our revenues during the last two quarters, replacing almost $17 million in lost revenues following the change in ownership at our former largest green coffee customer. During the third and fourth quarters of 2017, our revenues increased by 3.6% or approximately $625,000, and by 25.0% or approximately $4.3 million, respectively, as compared to the prior year periods. We achieved this growth through increased marketing of our branded and private label business as we added several new large retailers and wholesalers during the 2017 fiscal year. Our sales of roasted and green coffee are now back to their traditional levels of a 50-50 split where they had been for the majority of our company’s history,” stated Andrew Gordon, CEO and President of the Company.\n“We believe this sales balance represents a better mix of sales, which will allow us to continue to expand our overall gross margin as well as build our brand equity at our most important retail and wholesale accounts. We also believe the increased sales of both our branded and private label products are sustainable as we continue to see improved customer loyalty at our existing retail accounts due to expanded product distribution and increased promotional activity designed to gain trial of our products. In order to achieve this growth, we had an increase in freight expense of $636,000, which was the second largest increase in our SG&A after the costs associated with the purchase of Comfort Foods,” added Mr. Gordon.\n“In addition, we were awarded several new private label contracts in late fiscal 2017 and will begin manufacturing product in the second quarter of fiscal 2018. We also signed a two-year extension with our current largest private label customer.”\n“We believe the biggest headwind over the past nine months has been the integration of Comfort Foods, which has taken longer than expected to become a profitable integration. During our last nine months, Comfort Foods had an operating loss of approximately $300,000 which negatively impacted our overall earnings by approximately $.05 per share. We did expect a loss as we engineered a turnaround and we believe we are almost at the breakeven point in operations. Strategically, we believe this acquisition will allow us to begin bidding on business in the North East which we could not do previously though our Colorado facility for logistical reasons. In addition, the Harmony Bay brand has a strong following in New England and we recently placed it in over 700 Food Lion stores in the Mid-Atlantic States.\n“We look forward to a successful 2018 as our focus will once again be to continue to grow our sales and increase the distribution of our brands to build on the success achieved during the second half of fiscal 2017,” concluded Mr. Gordon.\nAbout Coffee Holding\nCoffee Holding Co., Inc. is a leading integrated wholesale coffee roaster and dealer in the United States and one of the few coffee companies that offers a broad array of coffee products across the entire spectrum of consumer tastes, preferences and price points. Coffee Holding has been a family-operated business for three generations and has remained profitable through varying cycles in the coffee industry and the economy. The Company’s private label and branded coffee products are sold throughout the United States, Canada and abroad to supermarkets, wholesalers, and individually owned and multi-unit retail customers.\nAny statements that are not historical facts contained in this release are “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995, including the Company’s outlook on future margin performance and its share repurchase program. Forward-looking statements include statements with respect to our beliefs, plans, objectives, goals, expectations, anticipations, assumptions, estimates, intentions, and future performance, and involve known and unknown risks, uncertainties and other factors, which may be beyond our control, and which may cause our actual results, performance or achievements to be materially different from future results, performance or achievements expressed or implied by such forward-looking statements. All statements other than statements of historical fact are statements that could be forward-looking statements. We have based these forward-looking statements upon information available to management as of the date of this release and management’s expectations and projections about certain future events. It is possible that the assumptions made by management for purposes of such statements may not materialize. Such statements may involve risks and uncertainties, including but not limited to those relating to product demand, pricing, market acceptance, hedging activities, the effect of economic conditions, intellectual property rights, the outcome of competitive products, risks in product development, the results of financing efforts, the ability to complete transactions, and other factors discussed from time to time in the Company’s Securities and Exchange Commission filings. The Company undertakes no obligation to update or revise any forward-looking statement for events or circumstances after the date on which such statement is made.\nCompany Contact\nCoffee Holding Co., Inc.\nAndrew Gordon\nPresident & CEO\n718-832-0800\nCOFFEE HOLDING CO., INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\nOCTOBER 31, 2017 AND 2016 2017 2016 - ASSETS - CURRENT ASSETS: Cash $ 2,325,650 $ 3,227,981 Accounts receivable, net of allowances of $144,000 for 2017 and 2016 13,441,802 13,517,892 Inventories 16,310,572 14,276,290 Prepaid green coffee 171,350 435,577 Prepaid expenses and other current assets 593,825 535,456 Prepaid and refundable income taxes 472,814 481,977 Due from broker - 134,722 Deferred income tax asset 339,748 81,545 TOTAL CURRENT ASSETS 33,655,761 32,691,440 Machinery and equipment, at cost, net of accumulated depreciation of $5,557,899 and $4,819,828 for 2017 and 2016, respectively 2,439,338 2,269,863 Customer list and relationships, net of accumulated amortization of $72,250 and $50,250 for 2017 and 2016, respectively 367,750 219,750 Trademarks and tradenames 820,000 180,000 Other intangible assets 331,124 - Goodwill 1,794,265 1,017,905 Equity method investments 94,643 95,598 Deposits and other assets 497,529 549,337 TOTAL ASSETS $ 40,000,410 $ 37,023,893 - LIABILITIES AND STOCKHOLDERS’ EQUITY - CURRENT LIABILITIES: Accounts payable and accrued expenses $ 4,430,626 $ 4,062,573 Line of credit 8,407,527 6,958,375 Due to broker 210,862 - Income taxes payable 1,346 1,050 TOTAL CURRENT LIABILITIES 13,050,361 11,021,998 Deferred income tax liabilities 629,680 167,470 Deferred rent payable 240,379 231,216 Deferred compensation payable 488,529 489,668 TOTAL LIABILITIES 14,408,949 11,910,352 Redeemable common stock: Common stock subject to possible redemption, at $200,004; -0- and 38,364 shares issued and outstanding at redemption value as of October 31, 2017 and 2016, respectively - 200,004 COMMITMENTS AND CONTINGENCIES STOCKHOLDERS’ EQUITY: Coffee Holding Co., Inc. stockholders’ equity: Preferred stock, par value $.001 per share; 10,000,000 shares authorized; none issued - - Common stock, par value $.001 per share; 30,000,000 shares authorized, 6,494,680 shares issued; 5,805,935 and 5,824,938 shares outstanding for 2017 and 2016 6,494 6,456 Additional paid-in capital 16,104,075 15,904,109 Retained earnings 12,345,490 11,878,228 Less: Treasury stock, 688,745 and 631,378 common shares, at cost for 2017 and 2016 (3,504,510 ) (3,249,590 ) Total Coffee Holding Co., Inc. Stockholders’ Equity 24,951,549 24,539,203 Noncontrolling interest 639,912 374,334 TOTAL EQUITY 25,591,461 24,913,537 TOTAL LIABILITIES AND STOCKHOLDERS’ EQUITY $ 40,000,410 $ 37,023,893\nCOFFEE HOLDING CO., INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF INCOME\nYEARS ENDED OCTOBER 31, 2017 AND 2016 2017 2016 NET SALES $ 77,127,595 $ 78,948,228 COST OF SALES (which include purchases of approximately $6.7 million and $8.5 million in fiscal years 2017 and 2016, respectively, from a related party) 64,977,632 67,066,050 GROSS PROFIT 12,149,963 11,882,178 OPERATING EXPENSES: Selling and administrative 10,228,506 7,363,710 Officers’ salaries 698,740 655,400 TOTAL 10,927,246 8,019,110 INCOME FROM OPERATIONS 1,222,717 3,863,068 OTHER INCOME (EXPENSE): Interest income 19,436 41,176 Loss from equity method investments (956 ) (972 ) Interest expense (264,261 ) (187,310 ) TOTAL (245,781 ) (147,106 ) INCOME BEFORE PROVISION FOR INCOME TAXES AND NON-CONTROLLING INTEREST IN SUBSIDIARY 976,936 3,715,962 Provision for income taxes 244,096 1,365,920 NET INCOME BEFORE NON-CONTROLLING INTEREST IN SUBSIDIARY 732,840 2,350,042 Less: Net income attributable to the non-controlling interest in subsidiary (265,578 ) (137,754 ) NET INCOME ATTRIBUTABLE TO COFFEE HOLDING CO., INC. $ 467,262 $ 2,212,288 Basic and diluted earnings per share $ .08 $ .36 Weighted average common shares outstanding: Basic and diluted 5,858,376 6,082,777\nCOFFEE HOLDING CO., INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYEARS ENDED OCTOBER 31, 2017 AND 2016 2017 2016 OPERATING ACTIVITIES: Net income $ 732,840 $ 2,350,042 Adjustments to reconcile net income to net cash provided by operating activities: Depreciation and amortization 762,043 587,572 Unrealized loss (gain) on commodities 345,584 (618,557 ) Loss on equity method investments 955 973 Deferred rent 9,163 9,161 Deferred income taxes (183,975 ) 991,275 Changes in operating assets and liabilities: Accounts receivable 661,008 (2,465,513 ) Inventories (917,376 ) (143,907 ) Prepaid expenses and other current assets (25,688 ) (279,254 ) Prepaid green coffee 264,227 184,875 Prepaid and refundable income taxes 9,163 952,600 Accounts payable and accrued expenses (258,827 ) (30,860 ) Deposits and other assets 77,220 68,331 Income taxes payable 296 1,050 Net cash provided by operating activities 1,476,633 1,607,788 INVESTING ACTIVITIES: Purchase of business net of cash acquired (2,893,275 ) (819,564 ) Purchases of machinery and equipment (679,921 ) (963,435 ) Net cash used in investing activities (3,573,196 ) (1,782,999 ) FINANCING ACTIVITIES: Line of credit 1,449,152 1,404,254 Purchase of treasury stock (254,920 ) (1,754,878 ) Payment of dividend - (100,000 ) Net cash provided by (used in) financing activities 1,194,232 (450,624 ) NET DECREASE IN CASH (902,331 ) (625,835 ) CASH, BEGINNING OF PERIOD 3,227,981 3,853,816 CASH, END OF PERIOD $ 2,325,650 $ 3,227,981\nCOFFEE HOLDING CO., INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYEARS ENDED OCTOBER 31, 2017 AND 2016 2017 2016 SUPPLEMENTAL DISCLOSURE OF CASH FLOW DATA: Interest paid $ 261,485 $ 181,007 Income taxes paid $ 391,933 $ 34,183 SUPPLEMENTAL DISCLOSURE OF NON-CASH INVESTING AND FINANCING ACTIVITIES: On June 29, 2016 Coffee Holding Co., Inc. acquired certain assets of Coffee Kinetics, LLC: Fair value of assets acquired $ 1,091,612 Less: liabilities assumed (72,044 ) Net assets acquired: 1,019,568 Common stock, par value $.001 per share, 38,364 shares 39 Additional paid-in capital 199,965 Non-cash payment 200,004 Net cash paid $ 819,564 SUPPLEMENTAL DISCLOSURE OF NON-CASH INVESTING AND FINANCING ACTIVITIES: On February 23, 2017 Coffee Holding Co., Inc. acquired the assets of Comfort Foods, Inc.: Accounts receivable $ 584,918 Inventory 1,116,906 Equipment 229,597 Prepaid expenses 32,681 Customer lists 170,000 Other intangible assets 971,124 Goodwill 388,378 Other asset 26,551 Less: liabilities 626,880 Net cash paid $ 2,893,275\nSource:Coffee Holding Co., Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/34c69c26-5937-489c-96f1-928fb37d5233"], "published": "2018-01-30T00:35:00.000+02:00", "crawled": "2018-01-30T03:55:02.000+02:00", "highlightTitle": ""}