{"organizations": [], "uuid": "3b11f6dc62bb50621b06bb37f630210df09f6bc7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-insight-global-promotes-bert-bean-to-ceo-glenn-johnson-to-remain-as-executive-chairman.html", "country": "US", "domain_rank": 767, "title": "Insight Global Promotes Bert Bean to CEO; Glenn Johnson to Remain as Executive Chairman", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-20T03:24:00.000+02:00", "replies_count": 0, "uuid": "3b11f6dc62bb50621b06bb37f630210df09f6bc7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/19/pr-newswire-insight-global-promotes-bert-bean-to-ceo-glenn-johnson-to-remain-as-executive-chairman.html", "ord_in_thread": 0, "title": "Insight Global Promotes Bert Bean to CEO; Glenn Johnson to Remain as Executive Chairman", "locations": [], "entities": {"persons": [{"name": "glenn johnson", "sentiment": "negative"}, {"name": "johnson", "sentiment": "none"}, {"name": "bert bean", "sentiment": "none"}], "locations": [{"name": "atlanta", "sentiment": "none"}, {"name": "orlando", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "insight global", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA, Insight Global, a staffing and services company, has promoted Bert Bean from President to CEO. After 17 years as Founder and CEO, Glenn Johnson will remain as Executive Chairman.\nBean started with Insight Global in 2005 as a Recruiter and has since worked his way up within the company, exemplifying Insight Global's \"promote from within\" culture. Johnson announced the promotion at Insight Global's 2018 National Sales Conference in Orlando on January 13th.\n\"Having started as a Recruiter thirteen years ago with this company, I have the utmost confidence in the way we develop our people,\" said Bert Bean, CEO. \"Over the next few years, we will generate tons of opportunities for our people to become leaders, at the office, regional and divisional levels, because of our \"promote only from within\" model. This will help us continue to scale all seven of our divisions, with our ultimate goal of becoming the industry leader for staffing and professional services in the United States. I'm honored to be able to lead this company.\"\nFor the past two years, Insight Global has been working to establish a strong infrastructure to keep up with the company's rapid growth. Bean started assuming CEO responsibilities a few months ago in preparation for Johnson's companywide announcement last weekend.\n\"Bert Bean is absolutely the right person for the job,\" Glenn Johnson, Executive Chairman. \"Bert and I have worked closely, and he has been preparing for this opportunity for the past several years. I couldn't think of anyone better to lead Insight Global into the future.\"\nAbout Insight Global\nInsight Global is a national staffing and services company that specializes in sourcing information technology, accounting, finance, and engineering professionals, and delivering service-based solutions to Fortune 1000 clients. Insight Global completes more than 33,000 placements annually in short-term, long-term, contract-to-hire, and direct placement positions through our network of more than 43 regional offices across the U.S. and Canada. The company has been ranked one of the fastest growing staffing firms for the past 10 consecutive years, and named the 3rd largest IT staffing firm in America by Staffing Industry Analysts for three consecutive years. We offer unmatched customer service by developing an in-depth understanding of client needs, providing qualified professionals, and tailoring managed services solutions for large projects, which allows clients to focus on expanding their business and achieving their goals.\nPublic Relations Contact\nStephanie Bathke\npr@insightglobal.net\n404-257-7900\n with multimedia: releases/insight-global-promotes-bert-bean-to-ceo-glenn-johnson-to-remain-as-executive-chairman-300585477.html\nSOURCE Insight Global", "external_links": ["http://www.prnewswire.com/news-releases/insight-global-promotes-bert-bean-to-ceo-glenn-johnson-to-remain-as-executive-chairman-300585477.html"], "published": "2018-01-20T03:24:00.000+02:00", "crawled": "2018-01-20T02:59:46.015+02:00", "highlightTitle": ""}