{"organizations": [], "uuid": "9c181dea5e125e422e7756a1dbfb92d41970e148", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/19/104955743-GettyImages-906692040.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/19/lindsey-graham-rips-white-house-for-trumps-change-on-immigration-deal.html", "country": "US", "domain_rank": 767, "title": "Lindsey Graham rips White House for Trump's change on immigration deal", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T19:48:00.000+02:00", "replies_count": 0, "uuid": "9c181dea5e125e422e7756a1dbfb92d41970e148"}, "author": "Jacob Pramuk", "url": "https://www.cnbc.com/2018/01/19/lindsey-graham-rips-white-house-for-trumps-change-on-immigration-deal.html", "ord_in_thread": 0, "title": "Lindsey Graham rips White House for Trump's change on immigration deal", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "lindsey graham", "sentiment": "negative"}, {"name": "graham", "sentiment": "none"}, {"name": "dick durbin", "sentiment": "none"}, {"name": "miller", "sentiment": "none"}, {"name": "stephen miller", "sentiment": "none"}], "locations": [{"name": "white house", "sentiment": "none"}, {"name": "d-ill.", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "msnbc", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Sen. Lindsey Graham saw a distinct change in President Donald Trump 's views on immigration legislation last week — and he pinned it on one White House aide in particular on Friday.\nOn Jan. 9, Trump told lawmakers to seek a bipartisan solution on immigration and signaled that he would sign whatever they put in front of him. Two days later, he flatly rejected a plan brought to him by Graham, Sen. Dick Durbin, D-Ill., and others, helping to set back talks on avoiding a government shutdown that will happen at midnight if Congress cannot reach a deal.\nGraham, who said he will not support a temporary funding bill passed by the House when the Senate takes it up Friday, sees Trump policy advisor Stephen Miller as part of the problem.\n\"The Stephen Miller approach to immigration has no viability. Tuesday, the president was in a good place. He was the president of all of us,\" Graham told MSNBC on Friday. \"He spoke compassionately about immigration, tough on security, wanted bipartisanship. Two days later, there was a major change.\"\n\"I think the change comes about from people like Mr. Miller. Mr. Miller is well known in the Senate for having views that are outside the mainstream,\" he added.\nSome senators thought the bipartisan proposal presented to Trump met the president's immigration demands. It would have protected hundreds of thousands of young undocumented immigrants while boosting border security measures and reforming extended family migration and the visa \"lottery\" system.\nIt also would have given the immigrants shielded by the Deferred Action for Childhood Arrivals program, which Trump ended, an eventual pathway to citizenship.\nGraham suggested that Miller, an immigration hardliner, rejected the outlines of the bipartisan deal. He also said that the approach of his colleague Sen. Tom Cotton, R-Ark., \"has no viability\" in bipartisan talks.\nGraham told MSNBC that voting for the House bill, which would keep the government funded through Feb. 16, would extend \"chaos.\"\nThe senator's negotiations with his colleagues appeared to be ongoing. As Graham spoke to MSNBC, he got a cell phone call from Durbin.\n\"This is Durbin,\" Graham said, momentarily stepping away from the camera. \"Dick, can I call you right back?\"", "external_links": [], "published": "2018-01-19T19:48:00.000+02:00", "crawled": "2018-01-19T20:04:53.024+02:00", "highlightTitle": ""}