{"organizations": [], "uuid": "290a17a131e6f90932532ba4febcc333e289e3d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-absolutely-acquisition-of-3d-couriers.html", "country": "US", "domain_rank": 767, "title": "Absolutely: Acquisition of 3D Couriers", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.012, "site_type": "news", "published": "2018-01-23T10:00:00.000+02:00", "replies_count": 0, "uuid": "290a17a131e6f90932532ba4febcc333e289e3d9"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-absolutely-acquisition-of-3d-couriers.html", "ord_in_thread": 0, "title": "Absolutely: Acquisition of 3D Couriers", "locations": [], "entities": {"persons": [], "locations": [{"name": "london", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "fitzrovia", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON--(BUSINESS WIRE)-- Absolutely (the “Company”), one of the UK’s longest established courier companies, is pleased to announce the acquisition of 3D Couriers (“3D”) for an undisclosed sum. 3D is a specialist courier company operating from Fitzrovia, London, offering same-day, next-day & international delivery services. This transaction is in line with the Company’s growth strategy and follows the acquisition of MayDH in May 2017.\n3D was established in 2003 and currently has an annual turnover of c.£2m. A London-based same-day delivery focused courier brand with international delivery capabilities, their range of delivery vehicles include push bikes, motor bikes, cargo bikes and vans. 3D is dedicated to the highest standards of customer service, professionalism and the latest in courier technology - key values that echo the Absolutely brand. Further, the range of services and expertise of 3D will also complement the services and expertise offered by Absolutely and enhance the market position of the enlarged group.\nAbsolutely will acquire 3D’s corporate accounts and fleet of vehicles. The business will continue to operate under its existing 3D brand in the short-term with the same team of experienced professionals to ensure a seamless transition. The management team of 3D will remain with the business following acquisition.\nJeremy Thompson, Managing Director of Absolutely says:\n“We are delighted to have acquired 3D Couriers and look forward to welcoming their experienced team into the business. The clear dedication to exceptional customer service shown by 3D Couriers directly correlates with our own daily working ethos at Absolutely. The well-known same-day delivery expertise of the 3D team will be an important additional asset for Absolutely to further enhance our proposition for our clients. The transaction precisely aligns with our stated ambition to expand by carefully chosen complementary acquisitions over the coming years. This acquisition represents a fantastic addition to the business.”\nDoug Hutchinson, Managing Director of 3D Couriers says:\n“Absolutely is a long-established and well-managed business and was an obvious choice for 3D due to the clear synergies between our organisations. I look forward to ensuring a smooth transition for our staff and clients over the coming weeks and I’m very excited to be joining the Absolutely team.”\n- END -\nAbout Absolutely\nAbsolutely is a family run business with a heritage stretching back to 1865. Across its courier operations, the Company employs c.100 people from 3 London locations. Absolutely now comprises over 250 couriers and more than 5000 corporate accounts ranging from well-known fashion brands to law firms.\nThe Company provides the following services:\nSame day delivery Next day delivery International delivery\nFurther details on Absolutely can be found on: www.askabsolutely.com\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180122006443/en/\nFor further information, please contact:\nBuchanan\nAlex Brown/ Catriona Flint/ Henry Wilson\nTel: +44 (0)207 466 5000\nAbsolutely@buchanan.uk.com\nSource: Absolutely", "external_links": ["http://www.businesswire.com/news/home/20180122006443/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.askabsolutely.com&esheet=51746992&newsitemid=20180122006443&lan=en-US&anchor=www.askabsolutely.com&index=1&md5=15cbc2c3566afb464959f33744a77b67"], "published": "2018-01-23T10:00:00.000+02:00", "crawled": "2018-01-23T11:58:23.005+02:00", "highlightTitle": ""}