{"organizations": [], "uuid": "da5a4a2236cd64383142861f8e41ff44f3f3b22c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-FZ721_vw1206_ZG_20171206164240.jpg", "site_section": "http://feeds.marketwatch.com/marketwatch/topstories/", "section_title": "MarketWatch.com - Top Stories", "url": "https://www.wsj.com/articles/volkswagen-supplier-to-face-criminal-case-in-emissions-fraud/", "country": "US", "domain_rank": 387, "title": "The Wall Street Journal: Volkswagen supplier to face criminal case in emissions fraud", "performance_score": 0, "site": "wsj.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T14:39:00.000+02:00", "replies_count": 0, "uuid": "da5a4a2236cd64383142861f8e41ff44f3f3b22c"}, "author": "", "url": "https://www.wsj.com/articles/volkswagen-supplier-to-face-criminal-case-in-emissions-fraud/", "ord_in_thread": 0, "title": "The Wall Street Journal: Volkswagen supplier to face criminal case in emissions fraud", "locations": [], "entities": {"persons": [{"name": "obama", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "aruna viswanatha mike spector", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}], "organizations": [{"name": "wall street journal", "sentiment": "negative"}, {"name": "volkswagen", "sentiment": "negative"}, {"name": "vw", "sentiment": "none"}, {"name": "justice department", "sentiment": "none"}, {"name": "volkswagen ag", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "iav gmbh", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Published: Jan 31, 2018 7:39 a.m. ET Share \nIAV allegedly aided auto maker’s conspiracy to rig diesel-powered vehicles with illegal software Reuters The criminal case is the latest in an unprecedented government crackdown on automotive companies for emissions violations that began during the Obama administration and has continued under Trump. \nBy Aruna Viswanatha Mike Spector \nA supplier for Volkswagen AG VLKAY, -1.92% is in discussions with the U.S. Justice Department to resolve an impending criminal case arising from its alleged participation in the German auto giant’s emissions cheating, according to people familiar with the matter, as federal prosecutors maintain pressure on automotive companies for environmental violations. \nIAV GmbH, an engineering company based in Berlin, is expected in the coming months to face allegations that it aided Volkswagen in the auto maker’s nearly decadelong conspiracy to rig diesel-powered vehicles with illegal software that allowed them to dupe U.S. government emissions tests and then pollute far beyond legal limits on the road, the people said. \nRead: VW suspends exec over diesel tests on monkeys \nThe supplier, half-owned by Volkswagen and with U.S. operations in Northville, Mich., is currently negotiating a settlement with federal prosecutors and has argued it has limited resources to address any potential financial penalties as part of the case, they said. \nIAV and Volkswagen declined to comment. A Justice Department spokeswoman said in a statement: “While we cannot confirm or deny the existence of an investigation, the Justice Department is committed to holding both corporations and individuals accountable to the rule of law, and to protecting U.S. consumers and the environment.” \nRead: Volkswagen to invest $3.3 billion in North America \nVolkswagen, which last year pleaded guilty to criminal charges in the emissions fraud, has agreed to pay penalties eclipsing $20 billion in the U.S. to settle legal cases with federal prosecutors, regulators, state attorneys general and customers. The total includes a $2.8 billion criminal penalty. Volkswagen’s final legal tab in the U.S. will depend on how many customers ultimately accept the auto maker’s offers to repurchase tainted vehicles. Volkswagen earlier this week suspended its chief lobbyist in the wake of revelations the company had conducted experiments on animals and humans to disprove links between diesel fumes and respiratory illnesses. ", "external_links": [], "published": "2018-01-31T14:39:00.000+02:00", "crawled": "2018-01-31T14:49:58.022+02:00", "highlightTitle": ""}