{"organizations": [], "uuid": "b469bae035367db556fc0dfb5ec4b6adab6eb253", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223293370&w=1200&r=LYNXMPEE0I0GV", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-eu-balkans/serbia-on-course-for-eu-by-2025-top-eu-official-says-idUSKBN1F80V8", "country": "US", "domain_rank": 408, "title": "Serbia on course for EU by 2025, top EU official says", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T17:36:00.000+02:00", "replies_count": 0, "uuid": "b469bae035367db556fc0dfb5ec4b6adab6eb253"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-eu-balkans/serbia-on-course-for-eu-by-2025-top-eu-official-says-idUSKBN1F80V8", "ord_in_thread": 0, "title": "Serbia on course for EU by 2025, top EU official says", "locations": [], "entities": {"persons": [{"name": "johannes hahn", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "serbia", "sentiment": "none"}, {"name": "montenegro", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "bosnia", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "western balkans", "sentiment": "none"}, {"name": "kosovo", "sentiment": "none"}, {"name": "macedonia", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "berlin wall", "sentiment": "none"}, {"name": "albania", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "european uni", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BRUSSELS (Reuters) - Serbia and Montenegro are likely be the next countries to join the European Union, possibly by 2025, the bloc’s official in charge of membership bids said in an interview.\nThe European Union is launching a diplomatic effort to accelerate steps to bring six countries in the Western Balkans into the EU fold after years of stop-start progress.\n“It is time to finish the work of 1989,” European Commissioner Johannes Hahn told Reuters, referring to the EU’s eastward expansion after the fall of the Berlin Wall.\n“We have set 2025 as an indicative date for Serbia and Montenegro, which is realistic but also very ambitious.”\nAlbania, Bosnia, Kosovo, Macedonia, Montenegro and Serbia all hope to join the European Union but have seen their membership chances fade in recent years as the bloc’s politicians, faced with rising eurosceptism at home, the 2009-2013 eurozone crisis and Britain’s vote to leave the bloc, appeared to lose interest.\nBut rising Russian influence, a migration crisis that straddles the region, Turkey’s drift toward authoritarian rule and a desire to strengthen European integration after Britain leaves in 2019 have presented the Balkans with an opportunity.\n“Either we export stability to the region or we import instability,” Hahn said, arguing that the EU’s accession process was the best way to fight corruption, organized crime and the threat of authoritarianism in the region.\nSerbia is seen as the lynchpin and the EU hopes Belgrade’s influence in the Balkans could help others reform.\nHahn is set to visit Serbia in February after publishing the Commission’s official Balkan strategy on Feb. 6, followed by Commission President Jean-Claude Juncker, who is expected to visit all six countries in a gesture of support.\nHahn will also travel to Washington next month to meet U.S. State Department officials to outline the EU’s Balkan push.\nWith neighboring Bulgaria holding the EU’s rotating presidency from January to June, European Union leaders will hold a special Balkan summit in Sofia in May. Britain is also set to host another top-level Balkan gathering in July.\n“WAKE-UP CALL”\nIn another sign of momentum, Macedonia could be offered an invitation to join the U.S.-led NATO military alliance if it can resolve a dispute with Greece over the former Yugoslav republic’s name, NATO diplomats say.\nHahn said he was confident the issue could eventually be resolved following United Nations talks this month. NATO Secretary-General Jens Stoltenberg, in a visit to Macedonia on Wednesday, also said he saw hope for resolving the name issue.\nObstacles to meeting EU membership terms abound, however.\nThe six Balkan countries’ banking systems and judiciaries are weak, and incomes in the region are 30 percent of those in the euro zone, according to the International Monetary Fund.\nThe region is scarred by the ethnic conflicts that followed the breakup of Yugoslavia in the 1990s.\nBosnia remains deeply divided. Serbia does not recognize the independence of Kosovo, its former province, and accuses it of seeking war with Belgrade. Montenegro was mired in political crisis for much of 2017.\nThe EU’s strategy rests on Serbia and Kosovo reaching a “normalization of relations” by the end of 2019, according to a draft version of the bloc’s Balkan plan seen by Reuters.\nHahn conceded that the killing of Kosovo Serb leader Oliver Ivanovic on Tuesday showed the instability of the region.\n“I hope this is a wake-up call to responsible politicians. I ask for statesmanship to understand that only cooperation, reconciliation is the only way forward,” he said.\nReporting by Robin Emmott; editing by Andrew Roche\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T17:36:00.000+02:00", "crawled": "2018-01-19T12:06:52.016+02:00", "highlightTitle": ""}