{"organizations": [], "uuid": "f82e3f6dd2cd22d843faedf5fa0e5b82df38fe66", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220252562&w=1200&r=LYNXMPEE070OO", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-usa-drilling/u-s-offers-drillers-nearly-all-offshore-waters-but-focus-is-on-eastern-gulf-idUSKBN1EX129", "country": "US", "domain_rank": 408, "title": "U.S. offers drillers nearly all offshore waters, but focus is on eastern Gulf", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T14:00:00.000+02:00", "replies_count": 0, "uuid": "f82e3f6dd2cd22d843faedf5fa0e5b82df38fe66"}, "author": "", "url": "https://www.reuters.com/article/us-usa-drilling/u-s-offers-drillers-nearly-all-offshore-waters-but-focus-is-on-eastern-gulf-idUSKBN1EX129", "ord_in_thread": 0, "title": "U.S. offers drillers nearly all offshore waters, but focus is on eastern Gulf", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "ernest scheyder", "sentiment": "none"}, {"name": "valerie volcovici", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "pacific", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "gulf of mexico", "sentiment": "none"}, {"name": "gulf", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "atlantic", "sentiment": "none"}], "organizations": [{"name": "mexic", "sentiment": "none"}, {"name": "pentagon", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "interior department", "sentiment": "none"}, {"name": "defense department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 12:13 PM / Updated 8 hours ago U.S. offers drillers nearly all offshore waters, but focus is on eastern Gulf Ernest Scheyder , Valerie Volcovici 5 Min Read \nHOUSTON/WASHINGTON (Reuters) - President Donald Trump’s administration has proposed opening up nearly all of America’s offshore waters to oil and gas drilling, but the industry says it is mainly interested in one part of it, now cordoned off by the Pentagon: the eastern Gulf of Mexico. \nThe industry’s focus on an area located near a sprawling network of existing platforms, pipes and ports could ease the path to new reserves, and assuage the drilling opponents near other places offered under the Interior Department’s proposed drilling plan issued last week, like California’s Pacific, the Atlantic and Arctic. \nBut accessing it would likely require the consent of the U.S. military. The eastern Gulf has been formally off-limits to drilling since 2006 due mainly to the Defense Department’s concerns oil development would interfere with extensive military testing and training exercises in the area. \n“The eastern Gulf of Mexico could be very attractive to industry because of the proximity to existing infrastructure in the central and western Gulf of Mexico,” the National Ocean Industries Association, which represents the offshore oil and gas industry, said in a statement. \n“Investing in the eastern Gulf could yield results - new jobs, new oil and gas production and increased energy security - quicker than investing in other offshore areas.” \nThe American Petroleum Institute and the Independent Petroleum Association of America have also expressed an interest in the eastern Gulf on behalf of its members, and big driller Royal Dutch Shell Plc ( RDSa.L ) told Reuters in October that “we have appetite and we are interested” in the eastern Gulf. \nTrump’s Interior Department has set up an “interagency working group” with the Defense Department to negotiate the issue, according to a Defense Department letter seen by Reuters. \nIn the letter, sent by Deputy Secretary of Defense Patrick Shanahan to Interior Secretary Ryan Zinke in September, Shanahan says the Pentagon “supports the development of national domestic energy resources in concert with enabling military operations, training and testing.” \nDefense Department spokeswoman Major Carla Gleason said collaboration with Interior on the issue was “a priority.” \nMajor offshore producers such as Exxon Mobil Corp ( XOM.N ), BP Plc ( BP.L ), Anadarko Petroleum Corp ( APC.N ) and ConocoPhillips ( COP.N ) declined to comment. \nShell welcomed the expanded offshore prospects the Trump administration plans to make available, but has not committed to any new activity, said spokesman Curtis Smith. \nA Chevron ( CVX.N ) spokeswoman, Veronica Flores-Paniagua, said the company is happy with Trump’s move and wants to continue to explore parts of Gulf, and also to better understand the geology of the Atlantic Seaboard. WEAK AUCTIONS \nOther regions offered in the proposed five-year drilling plan unveiled by Trump’s Interior Department last week are unlikely to see much interest, given the ample and relatively cheap opportunities to drill from shale plays on land. \nThe Arctic is remote and expensive, Pacific states such as California have vowed to block drilling, and other areas also harbor deep opposition from politicians, environmental groups and business interests worried about spills. \nSajjad Alam, an analyst focusing on oil and gas in Moody’s corporate finance group, said the high costs and difficulties in many of the areas offered for lease under the plan are likely to keep them low on an oil company’s priority list. \nRecent leasing statistics in the Gulf of Mexico already show soft demand for acreage from the oil industry. \nThe amount of money per acre that oil companies spent in the Gulf in 2017 was about a third what they spent in 2013 when oil prices were higher, according to a Reuters review of government data. Energy firms bid for less than 1 percent of total U.S. acreage in 2017, compared with 4.5 percent in 2013. \nBut for oil companies, the option of exploring new areas is nice to have, and one they might exploit if oil prices rise. \n“We’d like an opportunity to look at all of the areas (including the Eastern Seaboard and Alaska),” said Tracy Krohn, the chief executive of W&T Offshore Inc ( WTI.N ), which currently produces oil in the Gulf of Mexico. \n“I don’t know that we would exclude any areas.” \nThe API said some of its members could be interested in looking at parts of the mid- and southern-Atlantic too, because of successful wells drilled in similar geology off Brazil, Africa and Canada. \n“It would make sense to go out there and run seismic and do some exploratory drilling down the road,” said Erik Milito, API’s director of upstream operations. Additional reporting by Liz Hampton, Nichola Groom, Timothy Gardner, and Gary McWilliams; Writing by Richard Valdmanis; Editing by Simon Webb and Lisa Shumaker", "external_links": [], "published": "2018-01-08T14:00:00.000+02:00", "crawled": "2018-01-08T14:19:26.000+02:00", "highlightTitle": ""}