{"organizations": [], "uuid": "c72c4527fa308a82e4e97bb5de857279a9bb5a80", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-digi-international-acquires-accelerated-concepts-inc.html", "country": "US", "domain_rank": 767, "title": "Digi International Acquires Accelerated Concepts, Inc.", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T00:05:00.000+02:00", "replies_count": 0, "uuid": "c72c4527fa308a82e4e97bb5de857279a9bb5a80"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-digi-international-acquires-accelerated-concepts-inc.html", "ord_in_thread": 0, "title": "Digi International Acquires Accelerated Concepts, Inc.", "locations": [], "entities": {"persons": [], "locations": [{"name": "minn.", "sentiment": "none"}, {"name": "minnetonka", "sentiment": "none"}], "organizations": [{"name": "digi international acquires accelerated concepts, inc", "sentiment": "neutral"}, {"name": "digi international", "sentiment": "none"}, {"name": "accelerated concepts, inc.", "sentiment": "none"}, {"name": "digi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Cellular LTE and Networking Solutions Provider Significantly Extends Market Reach and Technology Base of Digi's IoT Product and Services Business\nMINNETONKA, Minn., Jan. 22, 2018 /PRNewswire/ -- Digi International®, (NASDAQ: DGII), ( www.digi.com ), a leading global provider of Internet of Things (IoT) connectivity products and services today announced that it has acquired Accelerated Concepts, Inc., a provider of secure, enterprise-grade, cellular (LTE) networking equipment for primary and backup connectivity applications. Accelerated has demonstrated strong top line growth with a five year CAGR of more than 25 percent. Digi acquired Accelerated for upfront cash of approximately $17 million with a potential for future earn-out consideration based on top line performance. The transaction is expected to be accretive for Digi.\nFounded in 2006, Accelerated provides cellular business continuity solutions to OEM and commercial customers. Accelerated's suite of secure, compact and affordable LTE routers and network appliances are easy to install and provide network managers with primary failover and out-of-band management solutions, while its AcceleratedView™ device management software provides customers with a centralized portal to provision, manage and upgrade devices remotely. The company is headquartered in Tampa, Florida, with offices in Chicago, Illinois, and Australia.\nThe acquisition of Accelerated significantly enhances Digi's existing cellular product lines and immediately extends the company's market reach with a line of commercial routers and network appliance products. These products provide a strong complement to Digi's industrial, M2M cellular routers and network server product lines to give customers the right product choice for their applications. Accelerated will continue to maintain its existing office locations with employees becoming part of the Digi team.\n\"The combination of our companies gives us a unique product mix, technology portfolio, and service capability in the IoT and enterprise connectivity marketplace,\" said Ron Konezny, President and CEO of Digi International. \"Accelerated successfully uses the same ease-of-use and fast time-to-market modular architecture design principles as Digi, as well as enjoying strong and deep relationships with key customers. We are excited for our combined go-to-market and engineering teams to grow our cellular business.\"\n\"The Digi and Accelerated teams employ the same values of customer-centric service and product definition and we are excited to work together,\" said Accelerated CEO Tom Butts. \"The combined breadth of our product lines provides our customers and partners with exceptional choice.\"\nFor more information, visit Digi.com .\nAbout Digi International\nDigi International (NASDAQ: DGII) is a leading global provider of business and mission-critical Internet of Things (IoT) and M2M products and services. We help our customers create next-generation connected products and deploy and manage critical communications infrastructures in demanding environments with high levels of security, relentless reliability and bulletproof performance. Founded in 1985, we've helped our customers connect over 100 million things, and growing. For more information, visit Digi's website at www.digi.com , or call 877-912-3444 (U.S.) or 952-912-3444 (International).\nAbout Accelerated Concepts, Inc.\nAccelerated is an enterprise-grade provider of cellular (LTE) networking equipment for primary or backup networking applications. Providing the backbone for failover, as well as M2M and IoT solutions, Accelerated delivers cellular business continuity and internet access to areas with limited broadband availability. Since the creation of its flagship product in 2006, Accelerated continues to innovate its product line to better meet the needs of customers ranging from retail to manufacturing in today's increasingly connected world.\nForward-Looking Statement\nThis press release contains forward-looking statements that are based on management's current expectations and assumptions. These statements often can be identified by the use of forward-looking terminology such as \"anticipate,\" \"believe,\" \"estimate,\" \"may,\" \"will,\" \"expect,\" \"plan,\" \"project,\" \"should,\" or \"continue\" or the negative thereof or other variations thereon or similar terminology. Among other items, these statements relate to expectations about the future business performance of the business purchased in the above described acquisition as well as future actions, operations and performance of Digi following such acquisition. Such statements are not guarantees of future performance and involve certain risks, uncertainties and assumptions, including risks related to whether our business will perform as anticipated, our ability to integrate the acquired business effectively, the potential growth or entrance in the marketplace of competitors, some of whom may have significantly more resources than us, whether the intended target market for the products of the acquired business will adopt our offerings, whether we will be able to sell the products of the acquired business effectively into the marketplace, whether we will be able to leverage the product development and engineering resources of the acquired business effectively, rapid changes in technologies that may displace products and services we intend to sell, delays in product development efforts, uncertainty in user acceptance of our products and services, the ability to maintain key customer and vendor relationships of the acquired company, the ability to integrate our products and services with those of other parties in a commercially accepted manner, potential liabilities that can arise if any of our products have design or manufacturing defects, our ability to defend or settle satisfactorily any litigation, uncertainty in global economic conditions and economic conditions within particular regions of the world which could negatively affect product demand and the financial solvency of customers and suppliers, the impact of natural disasters and other events beyond our control that could negatively impact our supply chain and customers, our ability to attract and retain important employees, potential unintended consequences associated with restructuring or other similar business initiatives that may impact our ability to retain important employees and our ability to execute on the business to achieve the anticipated benefits and synergies associated with the transaction. These and other risks, uncertainties and assumptions identified from time to time in our filings with the United States Securities and Exchange Commission, including without limitation, our annual report on Form 10-K for the year ended September 30, 2017 and subsequent quarterly reports on Form 10-Q and other filings, could cause the company's future results to differ materially from those expressed in any forward-looking statements made by us or on our behalf. Many of such factors are beyond our ability to control or predict. These forward-looking statements speak only as of the date for which they are made. We disclaim any intent or obligation to update any forward-looking statements, whether as a result of new information, future events or otherwise.\nMedia Contact:\nJoseph Rigoli\nLEWIS\nOffice: +1 781-418-2400\nDigi@teamlewis.com\nInvestor Contact:\nMike Goergen\nSenior Vice President, Chief Financial Officer and Treasurer\nDigi International\n952-912-3737\nmike.goergen@digi.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/digi-international-acquires-accelerated-concepts-inc-300586116.html\nSOURCE Digi International", "external_links": ["http://www.digi.com/", "http://www.prnewswire.com/news-releases/digi-international-acquires-accelerated-concepts-inc-300586116.html", "https://accelerated.com/", "https://www.digi.com/pr/accelerated"], "published": "2018-01-23T00:05:00.000+02:00", "crawled": "2018-01-23T02:18:17.018+02:00", "highlightTitle": ""}