{"organizations": [], "uuid": "28a6e1f0f766b7384e10cef45df66c508ea29ce7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/usa-trade-tariffs-solar/trump-deals-blow-to-solar-makers-industry-to-focus-on-growth-away-from-u-s-idUSL8N1PI08F", "country": "US", "domain_rank": 408, "title": "Trump deals blow to solar makers, industry to focus on growth away from U.S.", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T07:02:00.000+02:00", "replies_count": 0, "uuid": "28a6e1f0f766b7384e10cef45df66c508ea29ce7"}, "author": "", "url": "https://www.reuters.com/article/usa-trade-tariffs-solar/trump-deals-blow-to-solar-makers-industry-to-focus-on-growth-away-from-u-s-idUSL8N1PI08F", "ord_in_thread": 0, "title": "Trump deals blow to solar makers, industry to focus on growth away from U.S.", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "henning gloystein", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "u.s. reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 5:06 AM / Updated an hour ago Trump deals blow to solar makers, industry to focus on growth away from U.S. Reuters Staff \n* U.S. introduces import tariff on solar equipment imports \n* Decision is a “shock to Asian suppliers” - Wood Mackenzie \n* Governments in Asia threaten reaction to U.S. protectionism \n* Solar industry will look elsewhere for growth \nBy Henning Gloystein \nSINGAPORE, Jan 23 (Reuters) - U.S. President Donald Trump’s decision on Monday to slap tariffs on solar power equipment imports will pull investments in the technology out of the United States and into Asia and other regions, as the industry tries to make up for the lost opportunity in America, industry sources said on Tuesday. \nTrump approved a 30 percent tariff on solar cell and module imports that will drop to 15 percent in four years. Up to 2.5 gigawatt (GW) of unassembled solar cell imports are allowed tariff-free in each year. \nThe decision will likely curb surging growth in U.S. solar power capacity, the world’s fourth-largest after China, Japan and Germany. Globally, solar capacity has soared to almost 400 GW last year from under 10 GW in 2007, according to the International Renewable Energy Administration. \nChina is the world’s biggest builder of solar photo-voltaic cells and the tariffs will damage Asian companies the most. The U.S. government argued that its domestic manufacturers could not compete with what it said were artificially lower-priced Asian panels. \n“The duty barrier will shock Asian suppliers in the near-term,” said Frank Yu, Asia-Pacific power and renewables principal at energy consultancy Wood Mackenzie. \nWood Mackenzie said the tariffs are projected to reduce U.S. solar installation growth by 10 to 15 percent over the next five years. \nChinese solar manufacturers including unlisted Jinko Solar and Trina Solar, the country’s two biggest solar builders, could bear the brunt of the tariff. U.S.-listed shares of Yingli Green Energy Holding Co, one of China’s top 10 solar builders, slipped 0.5 percent on Monday. \nJack Feng, a vice president at Trina Solar, said panel makers would “expand their territory to a broader range in the globe,”, including Europe, China, Indonesia and India, to make up for the lack of U.S. access. \n“The U.S. decision will certainly affect Chinese solar panel makers,” he said, although it was no surprise given Trump’s previous statements. \nTrump vowed as president to dismantle free trade pacts that he said harmed U.S. workers, with a particular emphasis on what he called bad trade deals with countries including China. \nChina’s Ministry of Commerce on Tuesday expressed strong dissatisfaction regarding the solar tariffs, adding the decision further deteriorates the global trade environment. \nThe South Korean government said it would “actively respond to U.S. trade protectionism” to protect its own national interests, including exercising its rights under the World Trade Organization. \n“It is true that U.S. solar imports have increased, but the main reason of the increase is due to growing U.S. domestic demand for solar products,” South Korea’s Trade Minister Kim Hyun-chong said on Tuesday. LOOKING ELSEWHERE \nThere is still uncertainty on when the tariffs will be implemented and how the 2.5 GW of tariff-free imports will be administered or whether there will be exemptions for some countries. \nShares of U.S. panel maker SunPower climbed 0.8 percent on Monday and shares of electric car maker Tesla , which also produces solar panels, gained 1.5 percent on the day. But, analysts warned, the benefit is not clear-cut. \n“The overwhelming majority of the 260,000 solar jobs in the U.S. depend on the cheaper imported products,” Height Securities said in a note. \nMorgan Stanley warned of supply chain disruptions in the solar sector because of the tariffs and the risk the protectionist stance “could challenge investors’ perception whether the U.S. will adhere to current free trade policies.” \nUnderscoring the interconnected nature of the global solar panel industry, one of the lead complainants in the tariff decision, Suniva Inc, is majority-owned by Hong Kong-listed Shunfeng International Clean Energy Ltd. Reporting by Henning Gloystein in SINGAPORE; Additional reporting by Jumin Park and Jane Chung in SEOUL and Muyu Xu in BEIJING; Writing by Henning Gloystein; Editing by Christian Schmollinger", "external_links": [], "published": "2018-01-23T07:02:00.000+02:00", "crawled": "2018-01-23T07:20:46.015+02:00", "highlightTitle": ""}