{"organizations": [], "uuid": "75a85d4ade55c4407b2a1a6fe1e11b4caedaad7f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/12/18/104904769-RTX3O1LQ-_Donald-Trump_.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/02/on-trumps-plate-congress-midterm-elections-north-korea.html", "country": "US", "domain_rank": 767, "title": "On Trump’s plate: Congress, midterm elections, North Korea", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-02T15:30:00.000+02:00", "replies_count": 0, "uuid": "75a85d4ade55c4407b2a1a6fe1e11b4caedaad7f"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/02/on-trumps-plate-congress-midterm-elections-north-korea.html", "ord_in_thread": 0, "title": "On Trump’s plate: Congress, midterm elections, North Korea", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "ri", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "kevin lamarque", "sentiment": "negative"}, {"name": "mitch mcconnell", "sentiment": "none"}, {"name": "kim jong un", "sentiment": "none"}, {"name": "khawaja asif", "sentiment": "none"}], "locations": [{"name": "north korea", "sentiment": "none"}, {"name": "mississippi", "sentiment": "none"}, {"name": "pakistan", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "kentucky", "sentiment": "none"}, {"name": "jackson", "sentiment": "none"}, {"name": "islamabad", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "congress", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Kevin Lamarque | Reuters President Donald Trump steps from Air Force One for a visit to the Civil Rights Museum in Jackson, Mississippi, December 9, 2017. President Donald Trump has returned from an end-of-year holiday to face fresh legislative challenges, midterm elections, and threats abroad.\nThe president began the second year of his presidency with confrontational tweets targeting Iran and Pakistan . He slammed Islamabad on Monday for \"lies & deceit,\" saying the country had played U.S. leaders for \"fools,\" by not doing enough to control militants.\nPakistani officials, including Foreign Minister Khawaja Asif, responded on Twitter that the country would make clear \"the difference between facts and fiction.\"\nMeanwhile, North Korean leader Kim Jong Un said Monday the United States should be aware that his country's nuclear forces are now a reality , not a future threat. To that, Trump only said: \"We'll see.\"\nThe president is hoping for more legislative achievements after his pre-Christmas success on taxes. He plans to host Senate Majority Leader Mitch McConnell of Kentucky and House Speaker Paul Ryan of Wisconsin at Camp David next weekend to map out the 2018 legislative agenda.\nRepublicans are eager to make progress before attention shifts to the midterm elections. The GOP wants to hold House and Senate majorities in 2018, but must contend with Trump's historic unpopularity and some recent Democratic wins.\nThe president concluded 2017 with his first major legislative achievement — a law to cut taxes, beginning this year, for corporations and individuals at an estimated cost of $1.5 trillion added to the national debt over 10 years. The tax overhaul also will end the requirement, in 2019, that all Americans buy health insurance or pay a fine. That's a key component of the Obama-era health law that Republicans have been unable to repeal; other features of the law remain intact.\nThe White House has said Trump will come forward with his long-awaited infrastructure plan in January. Trump has also said he wants to overhaul welfare and recently predicted Democrats and Republicans will \"eventually come together\" to develop a new health-care plan.\nRyan has talked about overhauling Medicaid and Medicare, and other safety-net programs, but McConnell has signaled an unwillingness to go that route unless there's Democratic support for any changes. Republicans will have just a 51-49 Senate majority — well shy of the 60 votes needed to pass most bills — giving leverage to Democrats.\nCongress also has to deal with a backlog from 2017. It must agree on a spending bill by Jan. 19 to avert a partial government shutdown .\nLawmakers also have unfinished business on additional aid to for hurricane victims, lifting the debt ceiling, extending a children's health insurance program and extending protections for immigrants brought to the U.S. illegally as children. Trump has said he wants money for a border wall in exchange for protecting those immigrants.\nTrump spent his last day in Florida as he spent most other days — visiting his golf course and tweeting.\nOn Pakistan, he said: \"The United States has foolishly given Pakistan more than 33 billion dollars in aid over the last 15 years, and they have given us nothing but lies & deceit, thinking of our leaders as fools. They give safe haven to the terrorists we hunt in Afghanistan, with little help. No more!\"\nTrump tweet 1\nIt was not immediately clear why the president decided to comment on Pakistan. The U.S. has long accused Islamabad of allowing militants to operate relatively freely in Pakistan's border regions to carry out operations in neighboring Afghanistan. In August, the United States said it would hold up $255 million in military assistance for Pakistan until it cracks down on extremists threatening Afghanistan.\nOn Iran, Trump kept up his drumbeat in support of widespread anti-government protests there. He tweeted Monday that Iran is \"failing at every level\" and it is \"TIME FOR CHANGE.\"\nTrump tweet 2\nWhile some Iranians have shared Trump's tweets, many distrust him as he's refused to re-certify the nuclear deal that eased sanctions on the country and because his travel bans have blocked Iranians from getting U.S. visas.", "external_links": ["https://twitter.com/realDonaldTrump/status/947810806430826496", "https://twitter.com/realDonaldTrump/status/947802588174577664"], "published": "2018-01-02T15:30:00.000+02:00", "crawled": "2018-01-02T15:33:43.002+02:00", "highlightTitle": ""}