{"organizations": [], "uuid": "ffafee8958d275d051fe932faf94324adf6bc93d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221135123&w=1200&r=LYNXMPEE0A0Z9", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-olympics-2018-figs-hanyu/popular-hanyu-hopes-to-be-bright-as-button-in-korea-idUSKBN1F01NX", "country": "US", "domain_rank": 408, "title": "Popular Hanyu hopes to be bright as Button in Korea", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T15:16:00.000+02:00", "replies_count": 0, "uuid": "ffafee8958d275d051fe932faf94324adf6bc93d"}, "author": "", "url": "https://www.reuters.com/article/us-olympics-2018-figs-hanyu/popular-hanyu-hopes-to-be-bright-as-button-in-korea-idUSKBN1F01NX", "ord_in_thread": 0, "title": "Popular Hanyu hopes to be bright as Button in Korea", "locations": [], "entities": {"persons": [{"name": "hanyu", "sentiment": "negative"}, {"name": "winnie-the-pooh", "sentiment": "none"}, {"name": "yuzuru hanyu", "sentiment": "none"}, {"name": "dick button", "sentiment": "none"}, {"name": "yuriko kikuchi", "sentiment": "none"}, {"name": "anne frank", "sentiment": "none"}, {"name": "elizabeth ii", "sentiment": "none"}, {"name": "elaine", "sentiment": "none"}], "locations": [{"name": "korea", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "pyeongchang", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}, {"name": "min read  tokyo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TOKYO (Reuters) - Defending Olympic champion Yuzuru Hanyu will take to the ice in Pyeongchang aiming to duplicate a feat that was last achieved more than six decades ago should he go on to claim back-to-back titles in men’s figure skating.\nWhen American Dick Button became the last skater to defend his title in 1952, it was the same year that Elizabeth II was crowned Queen of England and “Anne Frank: Diary of a Young Girl” was first published in the United States.\nAnd as Hanyu performs, thousands will cheer him on from around the world, none more fervently than his Japanese fans, who will be desperately hoping that a November ankle injury that kept him off the ice for weeks does not hamper his chances.\nHis core supporters travel far and wide to wave Japanese flags, scream “Yuzu” when he appears on the rink, and shower him with Winnie-the-Pooh stuffed animals at the end of his routines.\n“His skating is great, very clean,” said Yuriko Kikuchi, 37, who traveled 259 km (161 miles) from Tokyo to the central city of Nagoya for December’s Grand Prix Final, even though he withdrew due to injury. “He’s very handsome.”\nDevotees of the 23-year-old have set up multiple social media sites dedicated to all things “Yuzu”.\nThey bombarded the forums with anguished tweets the day he injured himself in a training fall late last year, and then with prayers for his recovery from an ankle complaint that has turned out to be more complicated than initially diagnosed.\n“I am sorry so many people are worried on my behalf,” Hanyu said in a statement.\nKikuchi and friend Minako Ishizaki, 44, who talked over each other about their idol, were typical of the skater’s most devoted fans, said Hirotaka Matsuoka, a professor of sports marketing at Waseda University.\n“If you look at Hanyu ... his fans tend to be women, and a lot of them are middle-aged, in their 40s and so on,” he said. “It’s almost as if they want to protect him, as if it’s a certain kind of natural instinct.”\nFILE PHOTO: Figure Skating - ISU World Championships 2017 - Men's Free Skating - Helsinki, Finland - April 1, 2017 - Yuzuru Hanyu of Japan competes. REUTERS/Grigory Dukor/File Photo SHRINE VISITS Equipped with free time and a disposable income, those women are also some of his most devoted traveling fans, especially as tickets for home events sell out so quickly that international meets represent the best chance of seeing their hero.\nBut in the internet age, Hanyu’s appeal crosses all ages and nationalities. He’s particularly popular in the rest of Asia, even countries like Vietnam where winter sports are virtually unknown.\nA shrine in Japan’s ancient capital of Kyoto has seen roughly a thousand visitors a day since Hanyu set his free program to music from “Onmyoji” two years ago, due to links to the main character from that movie.\nAfter his injury, fans flooded the shrine to write wishes for his recovery on wooden tablets hung around the grounds, in line with a Japanese custom that this will make them come true.\nHanyu appears popular with other skaters as well.\n“He’s such an athlete... determined, passionate,” U.S. Olympian Jason Brown told Reuters after December’s Grand Prix Final.\n“He has this fire in his eye when he gets on the ice, like he is going to rock this. It’s amazing to see as an athlete and it’s very inspiring.”\nHowever, two-time U.S. Olympian Johnny Weir said Hanyu’s injury had come as a surprise to the skating community.\n“You can see him practice, he is so free when he is skating, and he just lets his body fly,” Weir told Reuters in a phone interview.\n“Yuzuru, I think, of all the people I’ve seen skate, falls the most awkwardly. But then he always stands up. That’s why we were shocked.”\nReporting by Elaine Lies; Editing by John O'Brien\n ", "external_links": [], "published": "2018-01-11T15:16:00.000+02:00", "crawled": "2018-01-11T15:32:58.002+02:00", "highlightTitle": ""}