{"organizations": [], "uuid": "1e31ed23e25ca13cba5911262051fec83cc1b637", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-markets/global-markets-world-shares-advance-but-u-s-banking-shares-lag-idUSL8N1PC4TY", "country": "US", "domain_rank": 408, "title": "GLOBAL MARKETS-World shares advance but U.S. banking shares lag", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T00:02:00.000+02:00", "replies_count": 0, "uuid": "1e31ed23e25ca13cba5911262051fec83cc1b637"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-markets/global-markets-world-shares-advance-but-u-s-banking-shares-lag-idUSL8N1PC4TY", "ord_in_thread": 0, "title": "GLOBAL MARKETS-World shares advance but U.S. banking shares lag", "locations": [], "entities": {"persons": [{"name": "rick meckler", "sentiment": "none"}, {"name": "chuck mikolajczak", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "bank of america", "sentiment": "none"}, {"name": "ibm", "sentiment": "none"}, {"name": "barclays", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* European shares fall 0.2 pct as trading updates disappoint\n* Resource shares lead losses in Asia as oil dips\n* Dollar weak, euro near 3-year high vs dollar (Updates with U.S. market open, changes byline, dateline; previous LONDON)\nBy Chuck Mikolajczak\nNEW YORK, Jan 17 (Reuters) - World shares inched higher on Wednesday, with Wall Street advancing as technology shares rebounded from declines in the prior session, while commodity prices were muted for a second straight session.\nIn the U.S. equity market, tech shares led the advance, including IBM, which surged 2.3 percent to $167.62 after Barclays upgraded the stock two notches to “overweight” ahead of its quarterly results on Thursday. The S&P technology sector gained 0.61 percent.\nGains were capped however, by a dip in financial shares, off 0.23 percent. Goldman Sachs lost 2.96 percent and Bank of America fell 2.72 after their quarterly results included charges related to the new federal tax law.\n“It’s very confusing to look at earnings right now because of the tax change charges,” said Rick Meckler, president of hedge fund LibertyView Capital Management LLC in Jersey City, New Jersey.\n“Investors are trying to figure out what normalized earnings are in a sort of a new environment for them where interest rates are higher, under changing regulations and the new tax code.”\nU.S. corporate earnings are expected to be solid, with growth for the quarter is forecast at 11.9 percent, according to Thomson Reuters data through Tuesday morning.\nThe Dow Jones Industrial Average rose 112.77 points, or 0.44 percent, to 25,905.63, the S&P 500 gained 8.5 points, or 0.31 percent, to 2,784.92 and the Nasdaq Composite added 22.68 points, or 0.31 percent, to 7,246.36.\nThe pan-European FTSEurofirst 300 index lost 0.24 percent and MSCI’s gauge of stocks across the globe gained 0.11 percent.\nEquities in Europe were lower, as declines in luxury fashion brand Burberry and educational publishing company Pearson weighed, following sales and earnings updates.\nThe U.S. dollar was higher versus a basket of currencies in the wake of as stronger-than-forecast data on domestic industrial output in December that supported the notion of a steady U.S. economic expansion.\nThe dollar index rose 0.23 percent, with the euro down 0.16 percent to $1.2239.\nThe higher dollar helped keep commodity prices subdued, as oil prices remained below the $70 a barrel mark hit last week but remained underpinned by tightening supply and strong global demand, while metals such as copper and nickel fell.\nU.S. crude rose 0.11 percent to $63.80 per barrel and Brent was last at $69.24, up 0.13 percent on the day.\nCopper lost 0.68 percent to $7,030.00 a tonne.\nWorld shares have rallied at the start of 2018 on optimism for continued strong global growth and improving corporate earnings, with many analysts expecting the bull run in equities to lengthen.\nThe U.S. yield curve flattened to a decade-low spread between 5-year and 30-year yields and two-year Treasury yields hit a nine-year high on Wednesday on expectations the Federal Reserve will continue to tighten monetary policy this year.\nTwo-year yields, which are the maturity most sensitive to Fed interest rate hikes, have been rising as robust economic data has affirmed the FOMC’s hawkish sentiment.\nBenchmark 10-year notes last fell 1/32 in price to yield 2.5463 percent, from 2.544 percent late on Tuesday.\nAdditional reporting by Sruthi Shankar; Editing by Bernadette Baum\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T00:02:00.000+02:00", "crawled": "2018-01-18T01:05:33.017+02:00", "highlightTitle": ""}