{"organizations": [], "uuid": "1420433060a8f7c7707627a02d9b8c278dec8714", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220738936&w=1200&r=LYNXMPEE090A8", "site_section": "http://feeds.reuters.com/reuters/topNews/", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-usa-court-election/u-s-supreme-court-considers-legality-of-ohio-voter-purging-idUSKBN1EZ0FK", "country": "US", "domain_rank": 408, "title": "U.S. Supreme Court considers legality of Ohio voter purging", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T08:02:00.000+02:00", "replies_count": 0, "uuid": "1420433060a8f7c7707627a02d9b8c278dec8714"}, "author": "", "url": "https://www.reuters.com/article/us-usa-court-election/u-s-supreme-court-considers-legality-of-ohio-voter-purging-idUSKBN1EZ0FK", "ord_in_thread": 0, "title": "U.S. Supreme Court considers legality of Ohio voter purging", "locations": [], "entities": {"persons": [{"name": "andrew chung", "sentiment": "none"}], "locations": [{"name": "ohio", "sentiment": "none"}, {"name": "oregon", "sentiment": "none"}, {"name": "west virginia", "sentiment": "none"}, {"name": "montana", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "oklahoma", "sentiment": "none"}, {"name": "georgia", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}], "organizations": [{"name": "u.s. supreme court", "sentiment": "negative"}, {"name": "supreme court", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - Conservative U.S. Supreme Court justices were joined by liberal Stephen Breyer on Wednesday in signaling sympathy toward Ohio’s policy of purging infrequent voters from registration rolls -- a practice critics say disenfranchises thousands of people -- in a pivotal voting rights case.\nThe nine justices heard about an hour of arguments in Republican-governed Ohio’s appeal of a lower court ruling that found that the policy violated a federal law aimed at making it easier for Americans to register to vote. The 1993 National Voter Registration Act bars states from striking registered voters “by reason of the person’s failure to vote.”\nIndicating he potentially could join the court’s conservatives in a ruling upholding Ohio’s policy as lawful, Breyer noted that a state needs tools to clean up its voter rolls by eliminating people who have died or moved.\n“What are they supposed to do?” he asked Paul Smith, the lawyer representing plaintiffs who challenged the policy and argued that voting should not be a “use it or lose it” right.\nOther liberal justices including Sonia Sotomayor asked questions indicating skepticism toward Ohio’s policy. The court has a 5-4 conservative majority.\n“The reason they’re purging them is they want to protect the voter roll,” said Justice Anthony Kennedy, a conservative who often casts the deciding vote in close decisions.\n“What we’re talking about are the best tools ... to implement that purpose,” Kennedy added.\nOhio is one of seven states, along with Georgia, Montana, Oklahoma, Oregon, Pennsylvania and West Virginia, that erase infrequent voters from registration lists, according to the plaintiffs. They called Ohio’s policy the most aggressive.\nRegistered voters in Ohio who do not vote for two years are sent registration confirmation notices. If they do not respond and do not vote over the subsequent four years, they are purged.\nThe Supreme Court’s ruling, due by the end of June, could affect the ability to vote for thousands of people ahead of November’s congressional elections. The outcome is particularly important for so-called battleground states like Ohio that often have an outsized influence in presidential elections.\nThe arguments zeroed in on whether a state could send a registration confirmation notice based merely on a person’s failure to vote, which the plaintiffs argued is barred by federal law.\nConservative Justices John Roberts and Samuel Alito suggested that a person’s failure to vote could be used as evidence for possible removal from the registration list. “It’s not the ground for removal in and of itself,” Alito said.\n‘RIGHT NOT TO VOTE’\nActivists rally outside the U.S. Supreme Court ahead of arguments in a key voting rights case involving a challenge to the OhioÕs policy of purging infrequent voters from voter registration rolls, in Washington, U.S., January 10, 2018. REUTERS/Lawrence Hurley Sotomayor said the policy could further disenfranchise people who find it more difficult to vote, including minorities and the homeless.\nShe suggested it was unreasonable to use non-voting as a trigger for the voter-purge process, saying, “People have a right not to vote if they choose.”\nThe plaintiffs, represented by liberal advocacy group Demos and the American Civil Liberties Union, said purging has become a powerful tool for voter suppression.\nDemocrats have accused Republicans of taking steps at the state level, including laws requiring certain types of government-issued identification, intended to suppress the vote of minorities, poor people and others who generally favor Democratic candidates.\nA 2016 Reuters analysis found roughly twice the rate of voter purging in Democratic-leaning neighborhoods in Ohio’s three largest counties as in Republican-leaning neighborhoods.\nSotomayor noted that President Donald Trump’s administration had switched sides in the case to support Ohio, breaking with a position held by previous Republican and Democratic administrations.\n“Seems quite unusual that your office would change its position so dramatically,” Sotomayor told U.S. Solicitor General Noel Francisco.\nFrancisco, arguing for the administration, replied that a separate 2002 law clarified the 1993 voter registration statute and that Ohio’s policy is legal.\nSmith, arguing for the plaintiffs, said the notices the state sends out are typically thrown out by the recipient -- 70 percent are not returned, according to one estimate -- which can lead to a large number of people targeted for removal who should not be.\n“I confess to doing that sometimes,” Breyer said of putting mailings in the trash.\nVoting rights has become an important theme for the Supreme Court. In two other cases, it is examining whether electoral districts drawn by Republican lawmakers in Wisconsin and Democratic lawmakers in Maryland were devised to entrench the majority party in power in a manner that violated voters’ constitutional rights. That practice is called partisan gerrymandering.\nThe plaintiffs in the Ohio case include Larry Harmon, a software engineer and U.S. Navy veteran who was blocked from voting in a 2015 marijuana initiative, and an advocacy group for homeless people.\nOhio’s policy would have barred more than 7,500 voters from casting a ballot in the November 2016 election had the Cincinnati-based 6th U.S. Circuit Court of Appeals not ruled against the state.\nReporting by Andrew Chung; Additional reporting by Lawrence Hurley; Editing by Will Dunham\n ", "external_links": [], "published": "2018-01-10T08:02:00.000+02:00", "crawled": "2018-01-10T08:10:56.000+02:00", "highlightTitle": ""}