{"organizations": [], "uuid": "c889f4e47f4a3fa58c8eb6e47a19ee2a98b59cdd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180108.html", "section_title": "Archive News &amp; Video for Monday, 08 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-euro-rally-loses-steam-dollar-firms-slightly-vs-yen-idUSL4N1P403Z", "country": "US", "domain_rank": 408, "title": "FOREX-Euro rally loses steam, dollar firms slightly vs yen", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.009, "site_type": "news", "published": "2018-01-09T08:54:00.000+02:00", "replies_count": 0, "uuid": "c889f4e47f4a3fa58c8eb6e47a19ee2a98b59cdd"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-euro-rally-loses-steam-dollar-firms-slightly-vs-yen-idUSL4N1P403Z", "ord_in_thread": 0, "title": "FOREX-Euro rally loses steam, dollar firms slightly vs yen", "locations": [], "entities": {"persons": [{"name": "shinichiro kadota", "sentiment": "none"}, {"name": "hideyuki sano", "sentiment": "none"}], "locations": [{"name": "tokyo", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "fx", "sentiment": "none"}, {"name": "fed", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Euro below $1.20 on profit-taking after record long positions\n* Dollar still hampered by doubts over Fed rate hike scenario\nBy Hideyuki Sano\nTOKYO, Jan 9 (Reuters) - The euro languished on Tuesday after slipping from last week’s high as investors were cautious after a months-long rally, while the dollar firmed against the yen though a lack of catalysts tempered its momentum.\nThe euro traded at $1.1968, having slipped 0.5 percent on Monday, its largest daily drop since late October.\nAnalysts said a correction was inevitable for the common currency after its rally over the past couple months to near its 2017 peak of $1.2092, thanks to signs of acceleration in the euro zone economy.\nSpeculators’ net long position in the euro/dollar futures in Chicago reached a record high last week, data from U.S. financial watchdog showed on Friday, pointing to potential for profit-taking.\n“The euro is going through a consolidation after it had reached high levels above $1.2. Friday’s euro zone inflation data was somewhat weaker than expected,” said Shinichiro Kadota, senior FX and rates strategist at Barclays.\n“Going forward, the market’s outlook depends more on U.S. factors, such as whether the Fed raises interest rates three times or more, and also the impact of the tax reform,” he said.\nWhile many Federal Reserve officials have said they expect three rate hikes this year, markets are not fully convinced as inflation remains tame despite very tight labour market conditions.\nIndeed, Atlanta Fed President Raphael Bostic, a voter on interest rate policy this year, said on Monday that the Fed may only need to raise interest rates two times in 2018 given weak price pressures.\nSuch doubts have held the dollar index down near its lowest levels since 2015 during the past few months.\nThe index stood at 92.345, after having fallen to 91.751 last week, not far from its 2-3/4-year low of 91.011 touched last September and way below its 2017 high of 102.26.\nAgainst the low-yielding yen, the dollar fetched 113.15 yen , having risen to 113.40 yen on Monday, its highest level in about a half month, spurred by upbeat risk sentiment.\nIts December high of 113.75 is seen as the next target level but many traders believe more catalysts are needed for a test of the 114 handle.\nAn immediate market focus include the talks planned later in the day between North and South Korea, their first formal contact in two years, for signs of any reduction in tensions on the Korean peninsula.\nEditing by Shri Navaratnam\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-09T08:54:00.000+02:00", "crawled": "2018-01-09T16:53:32.002+02:00", "highlightTitle": ""}