{"organizations": [], "uuid": "52e8c1a161797ac3e1aaca016f81c503799fda85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/17/business-wire-next-generation-ai-company-graphen-expands-leadership-team.html", "country": "US", "domain_rank": 767, "title": "Next-Generation AI Company Graphen Expands Leadership Team", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T16:00:00.000+02:00", "replies_count": 0, "uuid": "52e8c1a161797ac3e1aaca016f81c503799fda85"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/17/business-wire-next-generation-ai-company-graphen-expands-leadership-team.html", "ord_in_thread": 0, "title": "Next-Generation AI Company Graphen Expands Leadership Team", "locations": [], "entities": {"persons": [{"name": "graphen", "sentiment": "none"}, {"name": "tseng", "sentiment": "none"}, {"name": "terence lim", "sentiment": "none"}, {"name": "oscar tseng", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}, {"name": "graphen asia", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "asia pacific", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "taiwan", "sentiment": "none"}, {"name": "taipei", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}], "organizations": [{"name": "graphen, inc.", "sentiment": "neutral"}, {"name": "yahoo", "sentiment": "none"}, {"name": "digital media and marketing automation", "sentiment": "none"}, {"name": "eastern media group", "sentiment": "none"}, {"name": "far eastern retail group", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}, {"name": "svp", "sentiment": "none"}, {"name": "yahoo global media", "sentiment": "none"}, {"name": "cto", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK--(BUSINESS WIRE)-- Graphen, Inc., a startup building next-generation AI platforms inspired by full brain functionality and generating novel industry solutions, today announced an expansion of its leadership team. Mr. Oscar Tseng, a seasoned technology industry executive, joined the company as the General Manager of Graphen Asia, based in Taiwan. Dr. Terence Lim, a former Managing Director at Goldman Sachs, is joining Graphen as a Distinguished Research Scientist at the global headquarters in New York.\nOscar Tseng has 23 years of software leadership experience in Silicon Valley, Taipei, Hong Kong, Beijing, Shanghai, Singapore and Seoul. He was the SVP of Technology at Far Eastern Retail Group, driving Smart Retail. Before that, Mr. Tseng was the CTO of Eastern Media Group, leading development of E-commerce, Digital Media and Marketing Automation products, managing over 250 staff. He was a Sr. Director of Product and Engineering at Yahoo, managing Asia Pacific teams and contributed to the construction of Yahoo Global Media and Video Platforms that serve hundreds of millions of users. Mr. Tseng worked in Silicon Valley for over 13 years building internet searches for business intelligence and enterprise applications including online catalogue, procurement, supply chain and database systems. Mr. Tseng holds a B.S. from National Taiwan University, an M.S. from Stanford University (both in Computer Science) and an M.B.A. from Santa Clara University. He brings deep knowledge and rich leadership insights to help Graphen be better positioned for expansion in Asia.\nTerence Lim previously worked at the Goldman Sachs headquarters for 12 years and held positions including Managing Director, Quantitative Investment Strategies and Senior Portfolio Manager in global market-neutral and emerging-market quantitative equities. He was a Visiting Assistant Professor at Dartmouth College, teaching M.B.A. courses on Quantitative Analysis of Financial Markets, and was a Manager at Koeneman Capital Management developing codes to automate quantitative investment analysis. Dr. Lim was the Manager of Standards and Measurement at the Committee Encouraging Corporate Philanthropy, a member of the MIT Sloan School of Management, Finance Group Advisory Board and a member of the American Institute of Certified Public Accountants, Investments Committee. He holds a Ph.D. in Finance from MIT, an M.S. in Computer Science and Machine Learning from Columbia University, an M.S. in Electrical Engineering from Stanford University and a dual B.S. in Engineering and Economics from UPenn Wharton School. With his extensive experience in finance and machine intelligence, he will lead advanced research at Graphen for AI investment solutions.\n“We are excited to have these two leaders join Graphen. Oscar brings a strong history of building and managing cross-culture teams in product engineering and supporting hundreds of millions of worldwide customers. Terence has an exceptional track record in the finance industry and AI, particularly in Investment Strategy, modern Machine Learning and advanced Big Data technologies. They will play key roles in helping us achieve our goals of advancing fundamental Artificial Intelligence science and technologies, ensuring Graphen’s state-of-the-art work meets world-class expectations,” says Dr. Ching-Yung Lin, Founder and CEO of Graphen, Inc., Fellow of IEEE and Adjunct Professor of Columbia University. “I look forward to working with both Oscar and Terrence as we continue our mission to understand intelligence and create solutions that impact real life.”\nAbout Graphen\nGraphen builds next-generation artificial intelligence platforms based on network graphs to mimic full brain functionality and create novel industry solutions. Headquartered in the heart of Midtown Manhattan, the company is currently focused on finance and health care. Graphen's three main offerings are the Ardi AI platform, the Anita AI trader and the Adam AI robot. They are built upon advanced R&D of Graphen technologies in Linked Big Data, Advanced Visualization, Autonomous Learning, Cognitive Feeling, Machine Reasoning, Strategic Thinking, Human Understanding and Prediction. Graphen strives to make innovative AI solutions available to its clients and aims to solve real-life challenges and make a difference in the world. Current solutions include core-banking-monitoring, cognitive cybersecurity, non-performing-loan prediction, anti-money-laundering, market intelligence, predictive maintenance, etc. Learn more at www.graphen.ai .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180117005423/en/\nGraphen, Inc.\nUS :\nElaine Tapia, +1 212-221-0092\nelan@graphen.ai\nor\nChina :\nShuang Yu, +86 132 4874 8969\nshuangyu@graphen.ai\nor\nTaiwan :\nEagle Chu, +886 70-1010-3775\neaglechu@graphen.ai\nor\nHK :\nEdward Shen, +852 5392 6568\nedshen@graphen.ai\nSource: Graphen, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180117005423/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.graphen.ai&esheet=51744329&newsitemid=20180117005423&lan=en-US&anchor=www.graphen.ai&index=1&md5=fdb8fab51e76f3ee160ddc7c71845bcc"], "published": "2018-01-17T16:00:00.000+02:00", "crawled": "2018-01-17T16:48:46.002+02:00", "highlightTitle": ""}