{"organizations": [], "uuid": "4dc3d9433e2244f0b97b2ffbe7440168771abfca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221345943&w=1200&r=LYNXMPEE0B076", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-germany-politics/twenty-one-hours-and-counting-german-coalition-talks-drag-on-idUKKBN1F10EN", "country": "US", "domain_rank": 408, "title": "Twenty-one hours and counting: German coalition talks drag on", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T07:27:00.000+02:00", "replies_count": 0, "uuid": "4dc3d9433e2244f0b97b2ffbe7440168771abfca"}, "author": "", "url": "https://uk.reuters.com/article/uk-germany-politics/twenty-one-hours-and-counting-german-coalition-talks-drag-on-idUKKBN1F10EN", "ord_in_thread": 0, "title": "Twenty-one hours and counting: German coalition talks drag on", "locations": [], "entities": {"persons": [{"name": "angela merkel", "sentiment": "none"}, {"name": "merkel", "sentiment": "none"}, {"name": "stephan mayer", "sentiment": "none"}, {"name": "holger hansen", "sentiment": "none"}, {"name": "andreas rinke", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "bild", "sentiment": "none"}, {"name": "spd", "sentiment": "none"}, {"name": "min read  berlin", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "social democrats", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 5:28 AM / Updated 27 minutes ago German Social Democratic leaders beg members to back deal with Merkel Holger Hansen , Andreas Rinke 6 Min Read \nBERLIN (Reuters) - German Social Democratic (SPD) leaders appealed to party members on Friday to swallow their doubts and endorse an overnight deal to renew a “grand coalition” with Chancellor Angela Merkel’s conservatives for another four years. \nThe deal eased months of uncertainty that has undermined Germany’s role as the European Union’s pivotal power as the bloc confronts major challenges including Brexit, euro zone reform and immigration, and raised questions about Merkel’s future. \n“The world will not wait for us,” a weary-looking Merkel said on Friday morning after 25 hours of talks, which yielded a deal opening the way to formal negotiations on the details. \nBut some in the wary SPD rank-and-file said the deal lacked sufficient concessions to the centre-left party, which after four years of sometimes awkward coalition with Merkel suffered its worst election result last September since 1933. \nChristian Democratic lawmakers greeted their leader with a round of applause when she outlined the deal, which pledged closer cooperation with France to strengthen the euro zone and a crackdown on arms sales to countries in conflict zones. \nBut SPD leaders will have a harder time convincing members to approve the deal at a Jan. 21 party congress and again in a postal vote at the conclusion of formal coalition negotiations. \n“The SPD got its way in many areas,” senior SPD parliamentarian Hubertus Heil told public broadcaster RBB in what is likely to be the first of many such entreaties to rank-and-file over the coming week. \nSPD chairman Martin Schulz was addressing them when, standing alongside Merkel, he told reporters that the outline deal would preserve and strengthen Germany’s welfare state for future generations. \n“From the kindergarten to the school, to the university and the workplace and then on into old age and care homes, we want to strengthen respect, opportunity and solidarity, and bring these systems up to date,” he said. \nThe parties agreed to spend more on the EU - a long way short of Schulz’s ambition to create a “United States of Europe” by 2025, and the SPD’s plan to create parity between private and public healthcare was also missing from the deal. \nPledges to spend more in poorer regions and allow up to 1,000 family members each month to join refugees already living in Germany also seemed designed to placate SPD members sceptical of the benefits of governing with Merkel anew. \nBut ominously, a senior member of the SPD’s own negotiating team abstained in the vote to endorse the deal, and the party’s Berlin branch also said promises on social housing and home ownership were inadequate. \n“The real hurdle ... (is) when the SPD rank and file will have to vote on approval,” said Josef Joffe, publisher of German weekly Die Zeit. “The mood of the party faithful is heavily skewed against another grand coalition.” Acting German Chancellor Angela Merkel, leader of the Christian Social Union in Bavaria (CSU) Horst Seehofer and Social Democratic Party (SPD) leader Martin Schulz arrive for a press conference after exploratory talks about forming a new coalition government at the SPD headquarters in Berlin, Germany, January 12, 2018. REUTERS/Fabrizio Bensch \nMerkel, in power for 12 years, appeared to acknowledge that the document fell short of SPD expectations in some areas, telling reporters: “The coalition negotiations probably won’t be easier than the exploratory talks.” \nShe said she hoped to wind up formal talks by mid-February to give time to consult the SPD membership on the final deal. ECONOMIC STRENGTH \nGermany is unfamiliar with the long negotiations that mark coalition building in many neighbouring countries. The dominance of the SPD and the conservatives long ensured smooth government transition. But elections last September saw the rise of the right-wing Alternative for Germany, which upset the arithmetic. Slideshow (10 Images) \nA weakened Merkel turned to the SPD after the collapse in November of talks on a three-way coalition of the conservatives, environmentalist Greens and pro-business Free Democrats. \nAs Europe’s largest economy and pre-eminent mover and shaker, Germany is crucial to the region’s fortunes. Berlin’s partners eagerly await a new government to help drive forward Brexit talks, euro zone reform and EU diplomatic initiatives. \nFrance, which is pressing for a common euro zone budget to deflect external economic shocks, described the agreement as “important for the stability and future of Franco-German relations, but especially Europe”. \nOn the domestic front, the proposals reflected the strength of the economy. They foresaw tax relief for citizens of 10 billion euros over the three years to 2021 as well as extra spending on home-building, education and research. \nThe Finance Ministry said Germany had posted a budget surplus of 5.3 billion euros last year, adding the next government would have 45 billion euros’ worth of financial “wiggle room” in the legislative period to 2021. \nOfficials said the surplus would be fed into a refugee reserve fund. Over a million migrants, many fleeing conflict in the Middle East, have come to Germany since mid-2015. \nOn foreign policy, the document proposed limits on arms exports and an immediate end to arms sales to countries involved in the Yemen conflict - a move apparently targeted at Saudi Arabia, a major buyer of German weaponry. \nThey would also pause EU accession talks with Turkey, which has come under strong criticism in western Europe over President Tayyip Erdogan’s security crackdown including widespread arrests since an attempted military coup in 2016. \nThe euro climbed to a three-year high after Friday’s news of the breakthrough in the talks. In early London trading, the euro rallied 0.7 percent against the dollar to hit its highest levels since January 2015 at $1.212. Reporting by Holger Hansen and Andreas Rinke; Writing by Thomas Escritt; Editing by Mark Heinrich", "external_links": [], "published": "2018-01-12T07:27:00.000+02:00", "crawled": "2018-01-12T07:41:34.002+02:00", "highlightTitle": ""}