{"organizations": [], "uuid": "0cb469c54bfdc97287ca45c54d28bb4450cf335d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-mei-pharma-announces-fda-clearance-of-investigational-new-drug-application-for-cdk-inhibitor-voruciclib.html", "country": "US", "domain_rank": 767, "title": "MEI Pharma Announces FDA Clearance of Investigational New Drug Application for CDK Inhibitor Voruciclib", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.963, "site_type": "news", "published": "2018-01-08T17:00:00.000+02:00", "replies_count": 0, "uuid": "0cb469c54bfdc97287ca45c54d28bb4450cf335d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-mei-pharma-announces-fda-clearance-of-investigational-new-drug-application-for-cdk-inhibitor-voruciclib.html", "ord_in_thread": 0, "title": "MEI Pharma Announces FDA Clearance of Investigational New Drug Application for CDK Inhibitor Voruciclib", "locations": [], "entities": {"persons": [{"name": "daniel p. gold", "sentiment": "none"}], "locations": [{"name": "san diego", "sentiment": "none"}], "organizations": [{"name": "fda", "sentiment": "negative"}, {"name": "mei pharma, inc.", "sentiment": "neutral"}, {"name": "u.s. food and drug administration", "sentiment": "none"}, {"name": "mei pharma", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO, Jan. 8, 2018 /PRNewswire/ -- MEI Pharma, Inc. (Nasdaq: MEIP), an oncology company focused on the clinical development of novel therapies for cancer, today announced that the U.S. Food and Drug Administration (FDA) has cleared the company's Investigational New Drug Application (IND) for voruciclib, an orally available Cyclin Dependent Kinase 9 (CDK9) inhibitor, for patients with relapsed/refractory B-cell malignancies. Under this IND, MEI Pharma plans to initiate a Phase 1 study designed to determine the safety, tolerability, pharmacokinetics, pharmacodynamics, and preliminary clinical activity of voruciclib in patients with B-cell malignancies.\n\"Inhibiting the function of certain CDK family members has shown significant clinical activity in breast cancer. Voruciclib inhibits CDK9 which controls expression of MCL-1, a known mechanism of resistance to apoptosis. Therefore, voruciclib alone or in combination with a BCL-2 inhibitor such as venetoclax offers a potential novel approach for treatment of B-cell malignancies,\" said Daniel P. Gold, Ph.D., President and Chief Executive Officer of MEI Pharma. \"With the FDA clearance of our IND, we look forward to advancing voruciclib through the clinic in the second quarter of 2018 to demonstrate its clinical and commercial value.\"\nAbout Voruciclib\nVoruciclib (formerly P1446A; ME-522) has been tested in more than 70 patients in multiple solid tumor Phase 1 studies and has been associated with side effects consistent with other drugs in its class, including nausea, vomiting and diarrhea. In pre-clinical studies, voruciclib alone induces cell death in multiple patient-derived chronic lymphocytic leukemia (CLL) samples 1 . In additional pre-clinical studies, voruciclib shows dose-dependent suppression of MCL-1 at concentrations achievable with doses that appeared to be generally well tolerated in the Phase 1 studies 2 . Studies have shown that MCL-1 is an established resistance mechanism to the B-cell lymphoma 2 (BCL-2) inhibitor venetoclax (marketed as Venclexta™) 3 .\nAbout MEI Pharma\nMEI Pharma, Inc. (Nasdaq: MEIP) is a San Diego-based oncology company focused on the clinical development of novel therapies for cancer. The Company's portfolio of drug candidates includes pracinostat, an oral HDAC inhibitor that is partnered with Helsinn Healthcare, SA. Pracinostat has been granted Breakthrough Therapy Designation from the U.S. Food and Drug Administration for use in combination with azacitidine for the treatment of patients with newly diagnosed acute myeloid leukemia (AML) who are unfit for intensive chemotherapy. Pracinostat is also being developed in combination with azacitidine in patients with high and very high-risk myelodysplastic syndrome (MDS). MEI Pharma's clinical development pipeline also includes ME-401, a highly differentiated oral PI3K delta inhibitor currently in a Phase Ib study in patients with relapsed/refractory CLL or follicular lymphoma, and voruciclib, an oral, selective CDK inhibitor shown to suppress MCL1, a known mechanism of resistance to BCL2 inhibitors. The Company is also developing ME-344, a novel mitochondrial inhibitor currently in an investigator-sponsored study in combination with bevacizumab for the treatment of HER2-negative breast cancer. Pracinostat, ME-401, voruciclib and ME-344 are investigational agents and are not approved for use in the U.S. For more information, please visit www.meipharma.com .\nUnder U.S. law, a new drug cannot be marketed until it has been investigated in clinical studies and approved by the FDA as being safe and effective for the intended use. Statements included in this press release that are not historical in nature are \"forward-looking statements\" within the meaning of the \"safe harbor\" provisions of the Private Securities Litigation Reform Act of 1995. You should be aware that our actual results could differ materially from those contained in the forward-looking statements, which are based on management's current expectations and are subject to a number of risks and uncertainties, including, but not limited to, our failure to successfully commercialize our product candidates; costs and delays in the development and/or FDA approval, or the failure to obtain such approval, of our product candidates; uncertainties or differences in interpretation in clinical trial results; our inability to maintain or enter into, and the risks resulting from our dependence upon, collaboration or contractual arrangements necessary for the development, manufacture, commercialization, marketing, sales and distribution of any products; competitive factors; our inability to protect our patents or proprietary rights and obtain necessary rights to third party patents and intellectual property to operate our business; our inability to operate our business without infringing the patents and proprietary rights of others; general economic conditions; the failure of any products to gain market acceptance; our inability to obtain any additional required financing; technological changes; government regulation; changes in industry practice; and one-time events. We do not intend to update any of these factors or to publicly announce the results of any revisions to these\n1 PLoS One. 2015 Nov 25;10(11):e0143685\n2 Scientific Reports. 2017 Dec 21;7:(1):18007\n3 Blood. 2016 Jun 23;127(25):3192-201\nView original content with multimedia: http://www.prnewswire.com/news-releases/mei-pharma-announces-fda-clearance-of-investigational-new-drug-application-for-cdk-inhibitor-voruciclib-300578549.html\nSOURCE MEI Pharma, Inc.", "external_links": ["http://www.meipharma.com/", "http://www.prnewswire.com/news-releases/mei-pharma-announces-fda-clearance-of-investigational-new-drug-application-for-cdk-inhibitor-voruciclib-300578549.html"], "published": "2018-01-08T17:00:00.000+02:00", "crawled": "2018-01-08T19:03:37.008+02:00", "highlightTitle": ""}