{"organizations": [], "uuid": "d038ca11cd2b63d7f1a8238e76014a7be52c49bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180117.html", "section_title": "Archive News &amp; Video for Wednesday, 17 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/easteurope-markets/cee-markets-leu-in-focus-on-fears-that-president-might-reject-pm-candidate-idUSL8N1PC2AR", "country": "US", "domain_rank": 408, "title": "CEE MARKETS-Leu in focus on fears that president might reject PM candidate", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T18:47:00.000+02:00", "replies_count": 0, "uuid": "d038ca11cd2b63d7f1a8238e76014a7be52c49bd"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/easteurope-markets/cee-markets-leu-in-focus-on-fears-that-president-might-reject-pm-candidate-idUSL8N1PC2AR", "ord_in_thread": 0, "title": "CEE MARKETS-Leu in focus on fears that president might reject PM candidate", "locations": [], "entities": {"persons": [{"name": "mihai tudose", "sentiment": "none"}, {"name": "sandor peto", "sentiment": "none"}, {"name": "klaus iohannis", "sentiment": "none"}, {"name": "viorica dancila", "sentiment": "none"}], "locations": [{"name": "romania", "sentiment": "none"}, {"name": "budapest", "sentiment": "none"}], "organizations": [{"name": "social democrat party", "sentiment": "none"}, {"name": "psd", "sentiment": "none"}, {"name": "ing", "sentiment": "none"}, {"name": "european parliament", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Leu approached record low on fears of political crisis * Romanian president seen deciding PM candidate Wedsnesday * Czech govt resigns, crown trades steady By Sandor Peto BUDAPEST, Jan 17 (Reuters) - The leu edged down towards a record low again on Wednesday over concerns that the move by Romania's ruling Social Democrat Party (PSD) to sack its second prime minister since an election 13 months ago may lead to a crisis. The leu had approached the record low, set on Dec 29 at 4.68 against the euro, after Mihai Tudose was dismissed as prime minister on Monday. Pressure on Romanian assets eased as the party moved quickly to find a replacement. But now it is up to President Klaus Iohannis, a bitter critic of the government, to accepts or reject European Parliament lawmaker Viorica Dancila. \"There is a material risk that the president would ask PSD for a different nomination for PM (prime minister),\" ING analysts said in a note. \"The market will keep a close eye on the political developments for direction,\" they said. The leu dipped 0.05 percent to 4.658 against the euro by 0911 GMT, off Tuesday's lows of 4.6604. On Tuesday, the currency got support from Romanian central bank Deputy Governor Liviu Voinea who said it was very close to the level suggested by economic fundamentals. The Czech crown, after testing its strongest levels since 2013 on Tuesday, traded steady at 25.44, even though the minority government of Andrej Babis resigned on Wednesday after losing a confidence vote in parliament on Tuesday. Political developments rarely influence the markets of the fast-growing and stable Czech economy. The government will stay in power in a caretaker capacity. Babis must cut a deal with the opposition if he wants to prevent an early election. Czech central banker Vojtech Benda had buoyed the local currency, saying on Tuesday that inflation trends can allow faster interest rate rises. The government is expected to sell the bonds offered at its auctions on Monday, even though the amount was doubled early this week. \"But incoming supply in next months (is) likely to force the bidders to be careful in overpaying today,\" Komercni Banka said in a note. Polish central banker Grazyna Ancyparowicz told Radio Wnet that interest rates in Poland would most likely be close to current level throughout 2018. December Polish corporate sector wage figures due at 1300 GMT are seen showing continuing robust growth, but that is not expected to change the central bank's stance. A report by the Puls Biznesu daily that the government was working on launching a cryptocurrency, was unlikely to upset zloty markets. \"We are clearly set to see more of this in future, but there is a clear difference between all the virtual currencies out there and something that is regulated and tied to the official currency,\" said Simon Quijano-Evans, strategist of Legal & General Investment Management. CEE SNAPSHOT AT MARKETS 1011 CET CURRENCI ES Latest Previous Daily Change bid close change in 2018 Czech <EURCZK= 25.4400 25.4450 +0.02% +0.40% crown > Hungary <EURHUF= 309.1500 308.7800 -0.12% +0.57% forint > Polish <EURPLN= 4.1710 4.1709 -0.00% +0.13% zloty > Romanian <EURRON= 4.6580 4.6556 -0.05% +0.47% leu > Croatian <EURHRK= 7.4200 7.4225 +0.03% +0.14% kuna > Serbian <EURRSD= 118.3000 118.4000 +0.08% +0.17% dinar > Note: calculated from 1800 CET daily change Latest Previous Daily Change close change in 2018 Prague 1111.79 1114.920 -0.28% +3.12% 0 Budapest 39619.97 39684.16 -0.16% +0.62% Warsaw 2594.44 2591.10 +0.13% +5.41% Bucharest 8249.14 8233.13 +0.19% +6.39% Ljubljana <.SBITOP 823.76 822.05 +0.21% +2.16% > Zagreb 1879.86 1879.60 +0.01% +2.01% Belgrade <.BELEX1 771.77 774.65 -0.37% +1.58% 5> Sofia 712.41 715.40 -0.42% +5.16% BONDS Yield Yield Spread Daily (bid) change vs Bund change in Czech spread Republic 2-year <CZ2YT=R 0.7040 0.0720 +128bps +7bps R> 5-year <CZ5YT=R 1.0070 0.0220 +114bps +3bps R> 10-year <CZ10YT= 1.7610 0.0200 +121bps +3bps RR> Poland 2-year <PL2YT=R 1.5980 0.0060 +217bps +1bps R> 5-year <PL5YT=R 2.6110 0.0140 +274bps +2bps R> 10-year <PL10YT= 3.2980 0.0220 +274bps +3bps RR> FORWARD RATE AGREEMEN T 3x6 6x9 9x12 3M interban k Czech Rep 1.04 1.21 1.36 0.76 <PRIBOR= > Hungary 0.11 0.18 0.25 0.02 Poland 1.75 1.78 1.86 1.72 Note: FRA are for ask prices Quote: s", "external_links": [], "published": "2018-01-17T18:47:00.000+02:00", "crawled": "2018-01-18T16:13:28.005+02:00", "highlightTitle": ""}