{"organizations": [], "uuid": "33991e95f76013248785c13786f5a270d1cce42d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-medicine-man-technologies-expects-strong-revenue-growth-to-close-out-fy-2017-and-moving-forward-into-fy-2018.html", "country": "US", "domain_rank": 767, "title": "Medicine Man Technologies Expects Strong Revenue Growth to Close out FY 2017 and Moving Forward into FY 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-31T17:00:00.000+02:00", "replies_count": 0, "uuid": "33991e95f76013248785c13786f5a270d1cce42d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/globe-newswire-medicine-man-technologies-expects-strong-revenue-growth-to-close-out-fy-2017-and-moving-forward-into-fy-2018.html", "ord_in_thread": 0, "title": "Medicine Man Technologies Expects Strong Revenue Growth to Close out FY 2017 and Moving Forward into FY 2018", "locations": [], "entities": {"persons": [{"name": "man technolo", "sentiment": "negative"}, {"name": "roper", "sentiment": "none"}, {"name": "brett roper", "sentiment": "none"}], "locations": [{"name": "denver", "sentiment": "none"}, {"name": "co", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "denver consulting", "sentiment": "none"}, {"name": "gies inc.", "sentiment": "none"}, {"name": "pono publications", "sentiment": "none"}, {"name": "medicine man technologies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Denver, CO, Jan. 31, 2018 (GLOBE NEWSWIRE) --\nDENVER, CO, January 31, 2018 --- Medicine Man Technologies Inc. (OTCQB: MDCL), one of the United States' leading cannabis branding and consulting companies announced today that it expects revenues for FY 2017 to increase significantly over those reported in FY 2016.\nBrett Roper, Medicine Man Technologies’ Chief Executive Officer announced today, “As we begin to close the books on fiscal year 2017 we expect to achieve revenues of approximately $3.6M, representing a 470% increase over those recorded in fiscal year 2016. We also expect that net of stock compensation and one-time costs related to our recent acquisitions of Success Nutrients, Pono Publications, and the Denver Consulting group to be operationally cash flow neutral in 2017.”\nMr. Roper continued, “We have seen the first Cultivation MAX revenue share generation from our partners in Nevada achieve just over $200,000 in billings related to fourth quarter of 2017 performance. One of those partners in Nevada just experienced a four plus pound per light harvest in terms of dried cured flower in their first Cultivation Max cycle, more than doubling their prior performance. We expect the revenue sharing aspects of this newly developed service offering to increase dramatically as we have multiple new clients coming online in Canada, California, Ohio, Michigan, and other locations in 2018.”\nJonathan Sandburg, Medicine Man Technologies’ Chief Financial Officer stated, “We are also pleased announce that as of year-end 2017, we have retired all of our convertible debt and have been able to raise the additional capital we currently feel will be needed to expand our operations as well as invest in new team members and our GMP initiatives related to our standard operating procedures and facility designs moving forward into 2018. This investment should allow us to meet the growing demand for our services both here in the US as well as internationally.”\nIn conclusion Mr. Joshua Haupt, Medicine Man Technologies’ newly promoted Chief Revenue Officer stated, “I am very excited by the quality of our ever-increasing client base and expect all of our revenue channels to experience strong growth in 2018. Our unique and proprietary combination of cultivation methodology and nutrients allow our clients to achieve an incredible combination of quality and cost efficiency that should allow them to remain at the top of their Cannabis business game regardless of the state or country they operate in.”\nAbout Medicine Man Technologies, Inc.\nEstablished in March 2014, the Company secured its first client/licensee in April 2014. To date, the Company has provided guidance for several clients that have successfully secured licenses to operate cannabis businesses within their state. The Company currently has 71 active clients in California, Oregon, Colorado, Nevada, Illinois, Michigan, Arkansas, Pennsylvania, Florida, Ohio, Maryland, Massachusetts, Puerto Rico, Australia, Canada, Germany, and South Africa. We continue to focus on working with clients to 1) utilize its experience, technology, and training to help secure a license in states with newly emerging regulations, 2) deploy the Company's highly effective variable capacity constant harvest cultivation practices through its deployment of Cultivation MAX, and eliminate the liability of single grower dependence, 3) avoid the costly mistakes generally made in start-up, 4) stay engaged with an ever expanding team of licensees and partners, all focused on quality and safety that will “share” the ever-improving experience and knowledge of the network, and 5) continuing the expansion of its Brands Warehouse concept.\nSafe Harbor Statement\nThis press release may contain forward looking statements which are based on current expectations, forecasts, and assumptions that involve risks and uncertainties that could cause actual outcomes and results to differ materially from those anticipated or expected, including statements related to the amount and timing of expected revenues and any payment of dividends on our common and preferred stock, statements related to our financial performance, expected income, distributions, and future growth for upcoming quarterly and annual periods. These risks and uncertainties are further defined in filings and reports by the Company with the U.S. Securities and Exchange Commission (SEC). Actual results and the timing of certain events could differ materially from those projected in or contemplated by the forward-looking statements due to a number of factors detailed from time to time in our filings with the Securities and Exchange Commission. Among other matters, the Medicine Man Technologies may not be able to sustain growth or achieve profitability based upon many factors including, but not limited to, general stock market conditions. Reference is hereby made to cautionary statements set forth in the Company's most recent SEC filings. We have incurred and will continue to incur significant expenses in our expansion of our existing and new service lines, noting there is no assurance that we will generate enough revenues to offset those costs in both the near and long term. Additional service offerings may expose us to additional legal and regulatory costs and unknown exposure(s) based upon the various geopolitical locations where we will be providing services, the impact of which cannot be predicted at this time.\nContact Information: KCSA Strategic Communications MDCL@kcsa.com or visit us at www.medicinemantechnologies.com\nSource:Medicine Man Technologies, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/aa6b23a6-0de6-4739-883e-4344e2101fac"], "published": "2018-01-31T17:00:00.000+02:00", "crawled": "2018-01-31T18:36:11.000+02:00", "highlightTitle": ""}