{"organizations": [], "uuid": "62a7376b61593302d6d6ded2d70e4871f2c94568", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/12/gettyimages-462450770.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/17/facebook-twitter-disney-frenemies/", "country": "US", "domain_rank": 1196, "title": "Facebook and Twitter Have Growing Conflicts with Disney | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.064, "site_type": "news", "published": "2018-01-17T11:21:00.000+02:00", "replies_count": 0, "uuid": "62a7376b61593302d6d6ded2d70e4871f2c94568"}, "author": "Adam Lashinsky", "url": "http://fortune.com/2018/01/17/facebook-twitter-disney-frenemies/", "ord_in_thread": 0, "title": "Facebook and Twitter Have Growing Conflicts with Disney | Fortune", "locations": [], "entities": {"persons": [{"name": "disney", "sentiment": "none"}, {"name": "steve jobs", "sentiment": "none"}, {"name": "jack dorsey", "sentiment": "none"}, {"name": "sheryl sandberg", "sentiment": "none"}, {"name": "reuter", "sentiment": "none"}, {"name": "eric schmidt", "sentiment": "none"}, {"name": "adam lashinsky", "sentiment": "none"}], "locations": [{"name": "anaheim", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "silicon valley", "sentiment": "none"}], "organizations": [{"name": "disney | fortune disney facebook", "sentiment": "negative"}, {"name": "disney", "sentiment": "negative"}, {"name": "facebook", "sentiment": "negative"}, {"name": "google", "sentiment": "none"}, {"name": "apple", "sentiment": "none"}, {"name": "disney parks", "sentiment": "none"}, {"name": "fortune", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Disney Facebook and Twitter: Disney's Latest Frenemies Disneyland Resort celebrates its 60th anniversary with a preview of its three new nighttime spectaculars, \"Disneyland Forever\", \"Paint The Night\" and \"World of Color - Celebrate\" on Jan. 28, 2015 in Anaheim, California. Disney Parks via Getty Images By Adam Lashinsky 9:21 AM EST \nThis article first appeared in Data Sheet, Fortune’s daily newsletter on the top tech news. Sign up here . \nI’ve been intrigued by the analysis around Sheryl Sandberg and Jack Dorsey standing down from the Disney board. With Disney (dis) a video streamer and Facebook (fb) and Twitter (twtr) each an entertainment rights buyer, the tech execs had to part ways with the media conglomerate. \nIt got me thinking about the quaint Silicon Valley concept of “frenemies,” companies that compete and cooperate simultaneously. \nThe best example I recall of board-director awkwardness was then Google CEO Eric Schmidt’s service on the Apple board—right up until the moment Steve Jobs got it into his head that Google’s Android was copying Apple’s iOS mobile software. Reuters Breakingviews, whose quick, smart, funny takes on the day’s news I adore, neatly reviews that history . (BV neglects a weirder element of the story, that Bill Campbell, a pal to Steve Jobs and an Apple (aapl) board member until after Jobs died, remained an advisor to Schmidt and other Google (googl) executives long after Schmidt left the Apple board. That probably says more about Campbell, who died in 2016 , than Apple or Google. I still miss him dearly.) \nIn fact, the frenemication (yes, I made that up) of Silicon Valley is one of its greatest attributes. Apple bought chips from Samsung for years—and kept right on buying them once Samsung became a credible smartphone competitor. This relationship abides because the two need each other. Apple needs Samsung’s chips, and Samsung needs Apple’s business. \nOf course, for every happy outcome there’s a bitter enmity for which new words aren’t necessary. Google was an Uber investor but now considers the ride-hailing outfit a mortal threat. Google partnered with Yahoo—until it didn’t. And so it goes. Disney, Twitter, and Facebook undoubtedly will find ways to work together even as they battle each other mightily. \n*** \nIf you’re interested in going deeper on the issue of Facebook abandoning the news industry, I highly recommend this essay by the French media observer Frederic Filloux. I wrote my column yesterday before reading Filloux’s thoughts, only to find he and I see matters similarly. My favorite line of his: “Dealing with media companies is especially complicated. Three constant features characterize publishers: a deep sense of entitlement (“We are the news, you owe this and that to us”), a lack of technical competence (they expect FB to come up with ready-to-use products), and, in Europe, a propensity to call on Daddy (the government) and Mommy (Brussels) when things go awry.” Filloux echoes a point I tried making. Yes, Facebook did more than its fair share to serious damage the media industry. But publishers need to ask themselves why they naively expected otherwise. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-17T11:21:00.000+02:00", "crawled": "2018-01-17T18:31:08.010+02:00", "highlightTitle": ""}