{"organizations": [], "uuid": "7d4fd17510e35b87bd7fc1a5534cda72cc59963f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/luxury-suite-ballgame.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/13/tax-bill-recreation-deductions/", "country": "US", "domain_rank": 1196, "title": "New Tax Laws Will Make It Costlier to Take Clients to Ballgames | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.125, "site_type": "news", "published": "2018-01-13T16:50:00.000+02:00", "replies_count": 0, "uuid": "7d4fd17510e35b87bd7fc1a5534cda72cc59963f"}, "author": "Bloomberg", "url": "http://fortune.com/2018/01/13/tax-bill-recreation-deductions/", "ord_in_thread": 0, "title": "New Tax Laws Will Make It Costlier to Take Clients to Ballgames | Fortune", "locations": [], "entities": {"persons": [{"name": "gabe sou", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "charles capetanakis", "sentiment": "none"}], "locations": [{"name": "portland", "sentiment": "none"}, {"name": "new york jets", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Taking Clients to Ballgames Will Cost You More Under New Tax Laws An empty luxury box suite Gabe Souza—Portland Press Herald/Getty Images By Bloomberg 2:50 PM EST \nBusinesses — especially smaller firms — may scale back on treating clients to major league baseball games, golf outings and the like after Congress and President Donald Trump ended a tax break for such entertainment. \nThe tax overhaul that Trump signed Dec. 22 eliminated a 50 percent deduction for business-related expenses for “entertainment, amusement or recreation.” Suddenly, luxury boxes at stadiums and arenas — along with theater and concert tickets — will be more costly for firms that use them to woo clients. \nBusinesses that use the entertainment deduction extensively — including law, investment, accounting and lobbying firms — will have to gauge the effects on their bottom lines. Smaller businesses will be less able to absorb the cost. \n“I am a long-time, long-suffering season-ticket holder to the New York Jets, so a lot of time, I take clients,” said Charles Capetanakis, a lawyer and certified public accountant at Davidoff Hutcher & Citron LLP, a mid-sized law firm in New York. Eliminating the deduction “is really going to hurt the small businesses that need to promote their business by entertaining clients.” \nThe loss of the entertainment deduction is a kind of counterpoint to the Republican Congress’s sweeping tax cuts for businesses. The overhaul slashed the corporate rate to 21 percent from 35 percent. It also created a new 20 percent deduction for many partnerships, limited liability companies, sole proprietorships and other “pass-through” businesses, whose owners pay individual tax rates on the income they earn. \nOne impact from the loss of the entertainment-expense deduction may be “smaller spends” on professional sports tickets, said Robert Delgado, the principal-in-charge of the compensation and benefits group of the Washington national tax practice at KPMG LLP. But the degree of any reduction “remains to be seen,” said Ed Sturm, a managing director at Deloitte Tax LLP, who heads the tax practice’s meals, travel and entertainment service areas. \n“Each company will have to decide for itself whether the higher after-tax cost of these expenses makes good business sense,” Sturm said. \nSome have already begun grappling with that decision. \nThe loss of the entertainment expenses “is painful,” said Washington lobbyist Ryan Ellis, who specializes in tax issues. But there’s still a bright side. Congress didn’t touch another break: Businesses still have a 50 percent deduction for clients’ meals — whether catered or at a restaurant. \nAsked how K Street lobbyists in Washington would entertain clients going forward, Ellis said: “At restaurants.” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-13T16:50:00.000+02:00", "crawled": "2018-01-13T21:51:50.060+02:00", "highlightTitle": ""}