{"organizations": [], "uuid": "19fc912765446ce2e8a0ec0bc708416ebac5621e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/03/31/104377184-RTX32YQF.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/trump-signs-bill-to-end-government-shutdown.html", "country": "US", "domain_rank": 767, "title": "Trump signs bill to end government shutdown", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.169, "site_type": "news", "published": "2018-01-23T03:59:00.000+02:00", "replies_count": 0, "uuid": "19fc912765446ce2e8a0ec0bc708416ebac5621e"}, "author": "Christina Wilkie", "url": "https://www.cnbc.com/2018/01/22/trump-signs-bill-to-end-government-shutdown.html", "ord_in_thread": 0, "title": "Trump signs bill to end government shutdown", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "negotiati", "sentiment": "none"}, {"name": "carlos barria", "sentiment": "none"}], "locations": [], "organizations": [{"name": "reuters donald trump", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "President Donald Trump has signed into law a bill that ends the government shutdown, and provides congressional negotiators with additional time to hammer out an immigration reform package capable of passing both the House and Senate.\nHundreds of thousands of federal employees are expected to return to work on Tuesday morning, after spending the day Monday on furlough.\nThe bill funds the government for 17 days, and it funds the popular CHIP children's insurance program for six years. It does not include a permanent fix for the Obama-era DACA program, which Senate Democrats had originally demanded.\nNegotiations over the bill took place almost entirely in the Senate, where on Friday night, Majority Leader Mitch McConnell had been unable to reach the 60 vote threshold required to keep the government open.\nBut on Monday morning, the first official day of government employee furloughs, McConnell said he intends to bring DACA and other immigration issues up for debate before Feb. 8. Later, Senate Minority Leader Chuck Schumer confirmed an agreement to reopen the government and tackle immigration within three weeks.\nTrump had been largely absent from negotiations for the past three days, speaking to congressional Republicans by phone, but refusing to speak with Democrats.\nFollowing an initial Senate vote on Monday, the president issued a statement saying he was \"pleased that Democrats in Congress have come to their senses.\"\nTrump also pledged, \"once the Government is funded, my administration will work toward solving the problem of very unfair illegal immigration. We will make a long-term deal on immigration if, and only if, it is good for our country.\"\nHow such a deal might be structured, so as to have a chance of passing the Republican controlled House, is fast becoming the thorniest question in Washington D.C.", "external_links": [], "published": "2018-01-23T03:59:00.000+02:00", "crawled": "2018-01-23T04:08:59.010+02:00", "highlightTitle": ""}