{"organizations": [], "uuid": "4d3ec33b0eb2a2ddaaf0a2a4835c1112e34a4a5a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180118&t=2&i=1222871582&w=1200&r=LYNXMPEE0H004", "site_section": "https://www.reuters.com/politics", "section_title": "Politics &amp; Political News | Reuters", "url": "https://www.reuters.com/article/us-germany-politics-plan/top-spd-politician-no-plan-b-if-party-rejects-talks-with-merkel-idUSKBN1F7005", "country": "US", "domain_rank": 408, "title": "German conservatives urge SPD to approve further coalition talks", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T08:06:00.000+02:00", "replies_count": 0, "uuid": "4d3ec33b0eb2a2ddaaf0a2a4835c1112e34a4a5a"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-germany-politics-plan/top-spd-politician-no-plan-b-if-party-rejects-talks-with-merkel-idUSKBN1F7005", "ord_in_thread": 0, "title": "German conservatives urge SPD to approve further coalition talks", "locations": [], "entities": {"persons": [{"name": "horst seehofer", "sentiment": "negative"}, {"name": "angela merkel", "sentiment": "negative"}, {"name": "merkel", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "bonn", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "spd", "sentiment": "negative"}, {"name": "bild", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BERLIN (Reuters) - Chancellor Angela Merkel’s top Bavarian ally, Horst Seehofer, has told the center-left Social Democrats (SPD) they will plunge Germany into political crisis if at Sunday’s specially convened party meeting they vote against further coalition talks.\nNearly four months after elections, Merkel has still not managed to form a government. The uncertainty has eroded her public standing after 12 years as the dominant leader of Europe, and she is now counting on the SPD, her coalition partner from 2013 to 2017, to once again agree to a tie-up.\nMany in the party are reluctant, having hoped to reinvent themselves in opposition after a poor election showing and unsatisfied with a coalition blueprint hammered out in exploratory talks between the party leadership and the conservatives.\nAt an extraordinary party congress in Bonn on Sunday, delegates will vote on whether the party should embark on fully fledged coalition talks. All SPD party members will get to vote on a final coalition deal, if there is one.\nAsked in an interview by the mass-selling daily Bild what would happen if delegates to Sunday’s SPD party congress rejected a re-run of a ‘grand coalition’ with the conservatives, Seehofer said: “That would be a political disaster for our country.”\nShould they reject further talks, Seehofer said there could be new elections followed by yet more difficult coalition negotiations once again.\n“I can only appeal to everybody to get their act together and enable the formation of a government. Anything else would be disastrous for Germany.”\n“NO PLAN B”\nThe SPD’s parliamentary leader, Andrea Nahles, said she was optimistic the delegates would endorse formal talks with Merkel’s conservatives about a new coalition government.\n“I have no ‘Plan B,'” Nahles said in Thursday editions of newspapers published by the Funke Mediengruppe chain, when asked what would happen if the vote failed.\nNahles estimated that a third of delegates to Sunday’s meeting were still undecided, but said she was convinced a majority of delegates would vote to begin coalition talks.\nNahles said she and other SPD negotiators had hammered out a what she considered a good blueprint with the conservatives, including plans to boost pensions, phase out a solidarity tax imposed to help poorer eastern states, and avert an upper limit on migration.\n“We are seeking approval for coalition talks, and we can do that with good reason,” Nahles told the newspaper group. “I‘m convinced that we reached a good result in exploratory talks to very specifically improve the lives of citizens.”\nThe SPD’s youth and left wings oppose coalition talks, arguing that another tie-up with conservatives would further weaken the party, which had suffered its worst post-war election result in September.\nA Forsa poll published on Thursday showed the SPD slipping to 18 percent, below the 20.5 percent it achieved in September’s election. Support for Merkel’s CDU/CSU bloc rose to 34 percent, slightly above its election result of 32.9 percent.\nNahles, a former labor minister, conceded that her party had not won all its demands in the negotiations, including a call for a universal citizen’s health insurance, but said many other important party projects were now within reach.\n“We stand before a difficult fork in the road: Do we want to turn this (agreement) into new policies for the people of our country, or do we want new elections?” she asked.\nSPD leader Martin Schulz and Michael Groschek, the party leader in the western state of North Rhine-Westphalia (NRW), which accounts for about a quarter of the delegates to Sunday’s vote, on Wednesday both forecast a positive outcome.\nSchulz, seeking to assuage critics’ concerns, told reporters that some areas such as healthcare and rental caps could be added during formal coalition talks, and highlighted the fact that negotiators had agreed to review the deal after two years.\nRefusal by SPD delegates to hold further talks could lead to new elections or a minority government for the first time in Germany’s post-war era.\nAdditional reporting by Andrea Shalal; Editing by Richard Chang and Raissa Kasolowsky\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T08:06:00.000+02:00", "crawled": "2018-01-18T12:36:16.000+02:00", "highlightTitle": ""}