{"organizations": [], "uuid": "639855224f8ff706f95318862eb61195968b7055", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-908620830.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/22/government-shutdown-democrats-immigration/", "country": "US", "domain_rank": 1196, "title": "Donald Trump Signs Bill Ending Shutdown as Democrats Relent | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.624, "site_type": "news", "published": "2018-01-23T23:54:00.000+02:00", "replies_count": 0, "uuid": "639855224f8ff706f95318862eb61195968b7055"}, "author": "The Associated Press", "url": "http://fortune.com/2018/01/22/government-shutdown-democrats-immigration/", "ord_in_thread": 0, "title": "Donald Trump Signs Bill Ending Shutdown as Democrats Relent | Fortune", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "jabin botsford", "sentiment": "none"}], "locations": [{"name": "washin", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "dc", "sentiment": "none"}], "organizations": [{"name": "senate", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Shutdown Is Over After Democrats Reluctantly Relent President Trump at the White House in Washington, DC on Jan. 19, 2018. Jabin Botsford—The Washington Post/Getty Images By The Associated Press 9:54 PM EST \nPresident Donald Trump signed a bill reopening the government late Monday, ending a 69-hour display of partisan dysfunction after Democrats reluctantly voted to temporarily pay for resumed operations. They relented in return for Republican assurances that the Senate will soon take up the plight of young immigrant “dreamers” and other contentious issues. \nThe vote set the stage for hundreds of thousands of federal workers to return on Tuesday, cutting short what could have become a messy and costly impasse. The House approved the measure shortly thereafter, and President Donald Trump later signed it behind closed doors at the White House. \nBut by relenting, the Democrats prompted a backlash from immigration activists and liberal base supporters who wanted them to fight longer and harder for legislation to protect from deportation the 700,000 or so younger immigrants who were brought to the country as children and now are here illegally. \nDemocrats climbed onboard after two days of negotiations that ended with new assurances from Senate Majority Leader Mitch McConnell that the Senate would consider immigration proposals in the coming weeks. But there were deep divides in the Democratic caucus over strategy, as red-state lawmakers fighting for their survival broke with progressives looking to satisfy liberals’ and immigrants’ demands. \nUnder the agreement, Democrats provided enough votes to pass the stopgap spending measure keeping the government open until Feb. 8. In return, McConnell agreed to resume negotiations over the future of the dreamers, border security, military spending and other budget debates. If those talks don’t yield a deal in the next three weeks, the Republican promised to allow the Senate to debate an immigration proposal — even if it’s one crafted by a bipartisan group and does not have the backing of the leadership and the White House, lawmakers said. McConnell had previously said he would bring a deal to a vote only if President Donald Trump supported it. \nSixty votes were needed to end the Democrats’ filibuster, and the party’s senators provided 33 of the 81 the measure got. Eighteen senators, including members of both parties, were opposed. Hours later the Senate passed the final bill by the same 81-18 vote, sending it to the House, which quickly voted its approval and sent the measure on to President Donald Trump. \nWhite House press secretary Sarah Sanders predicted that operations would return to normal by Tuesday morning. \nFor more on the Government Shutdown, watch Fortune’s video: \nThe plan is far from what many activists and Democrats hoped when they decided to use the budget deadline as leverage. It doesn’t tie the immigration vote to another piece of legislation, a tactic often used to build momentum. It also doesn’t address support for an immigration plan in the House, where opposition to extending the protections for the dreamers is far stronger. \nThe short-term spending measure means both sides may wind up in a shutdown stalemate again in three weeks. \nSenate Democratic leader Chuck Schumer lent his backing to the agreement during a speech on the chamber’s floor. “Now there is a real pathway to get a bill on the floor and through the Senate,” he said of legislation to halt any deportation efforts aimed at the younger immigrants. \nThe White House downplayed McConnell’s commitment, and said Democrats caved under pressure. “They blinked,” principal deputy press secretary Raj Shah told CNN. In a statement, Trump said he’s open to immigration deal only if it is “good for our country.” \nImmigration activists and other groups harshly criticized the deal reached by the Democratic leadership. \nCristina Jimenez, executive director of United We Dream, said the members of the group are “outraged.” She added that senators who voted Monday in favor of the deal “are not resisting Trump, they are enablers.” \nOther groups such as the American Civil Liberties Union expressed disappointment and shared similar criticism. \nA block of liberal Democrats — some of them 2020 presidential hopefuls — stuck to their opposition. Sens. Elizabeth Warren of Massachusetts, Dianne Feinstein of California, Kirsten Gillibrand of New York and Cory Booker of New Jersey voted no, as did Independent Bernie Sanders of Vermont. \nFeinstein said she wasn’t persuaded by McConnell’s assurances and did not know how a proposal to protect the more than 700,000 younger immigrants would fare in the House. \nDemocratic Sen. Jon Tester of Montana voted no on the procedural motion to re-open the government — the only no vote among 10 incumbent Democrats facing re-election this year in states won by Trump in 2016. Tester said in a statement that the 17-day budget did not include any funding for community health centers that are important to his rural state, nor did the deal include additional resources for border security. \nThe short-term funding measure includes a six-year reauthorization of the children’s health insurance program, which provides coverage for millions of young people in families with modest incomes. It also includes $31 billion in tax cuts, including a delay in implementing a tax on medical devices. \nThe votes came as most government offices cut back drastically or even closed on Monday, as the major effects of the shutdown were first being felt with the beginning of the workweek. \nRepublicans have appeared increasingly confident that Democrats would bear the brunt of criticism for the shutdown. The White House and GOP leaders said they would not negotiate with Democrats on immigration until the government was reopened, and White House officials boasted that Trump didn’t reach out to any Democratic lawmakers during the shutdown. \nIn fact, Trump, who regularly disrupted negotiations in recent weeks, had been a relatively subdued player in the weekend debate. On Monday, he accused Democrats of prioritizing services and security for noncitizens over U.S. citizens. “Not good,” his first tweet said. In a second tweet, he said, “Democrats have shut down our government in the interests of their far left base. They don’t want to do it but are powerless!” \nTrump’s first tweet appeared to undercut comments by his legislative affairs director, Marc Short, who told CNN that the immigrants in question are law-abiding and “productive to our society.” Short said the administration wants to “find a pathway for them” to stay in the U.S. \nAlthough the Democrats initially dug in on a demand for an immigration deal, they had shifted to blaming the shutdown on the incompetence of Republicans and Trump. The Democrats seemed sensitive to being seen by voters as willing to tie up government operations to protect immigrants in the U.S. illegally. \nIn an impassioned closed-door meeting, Schumer told his members that McConnell’s pledge was the best deal they were going to get. \nOn the Senate floor, No. 2 Senate GOP leader John Cornyn of Texas said that for shutting down the government, the Democrats “got nothing.” He added that even though McConnell promised to take up the immigration bill by February, “he was going to do that anyway.” \nWhile lawmakers feuded, signs of the shutdown were evident at national parks and in some federal agencies. Social Security and most other safety-net programs were unaffected by the lapse in federal spending authority. Critical government functions continued, with uniformed service members, health inspectors and law enforcement officers set to work without pay. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-23T23:54:00.000+02:00", "crawled": "2018-01-23T05:15:21.020+02:00", "highlightTitle": ""}