{"organizations": [], "uuid": "c2889e2faa66739c02be1dc1d28aae55ffb44497", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/10/01/101076898-180143070r.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/neiman-marcus-to-replace-karen-katz-with-new-ceo-report.html", "country": "US", "domain_rank": 767, "title": "Neiman Marcus to replace Karen Katz with new CEO: Report", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.075, "site_type": "news", "published": "2018-01-04T18:25:00.000+02:00", "replies_count": 0, "uuid": "c2889e2faa66739c02be1dc1d28aae55ffb44497"}, "author": "Getty Images", "url": "https://www.cnbc.com/2018/01/04/neiman-marcus-to-replace-karen-katz-with-new-ceo-report.html", "ord_in_thread": 0, "title": "Neiman Marcus to replace Karen Katz with new CEO: Report", "locations": [], "entities": {"persons": [{"name": "karen katz", "sentiment": "negative"}, {"name": "neiman marcus", "sentiment": "negative"}], "locations": [], "organizations": [{"name": "wall street journal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Neiman Marcus to replace Karen Katz with new CEO: Report Luxury retailer Neiman Marcus is preparing to appoint a new a chief executive. Karen Katz, who has served as chief executive since 2010, will be replaced by an outsider, but she will retain her board seat, Wall Street Journal reported. Published 5 Hours Ago SHARES Getty Images \nLuxury retailer Neiman Marcus is preparing to appoint a new a chief executive, the Wall Street Journal reported on Thursday, citing people familiar with the situation. \nKaren Katz, who has served as chief executive since 2010, is stepping aside and will be replaced by an outsider, but she will retain her board seat, the people told the financial newspaper. \nThe company has been hunting for a new leader for some time, some of the people told the Wall Street Journal. Several current CEOs spurned Neiman Marcus' approaches about taking its top spot, the paper reported. \nNeiman Marcus was not immediately available for comment. \nThe up-market chain has been struggling with a nearly $5 billion debt load mainly due to its leveraged buyout in 2013, when Ares and Canadian public pension fund CPPIB acquired it from other private equity firms. \nSeeking ways to cut debt, the retailer in March last year had explored options to change its capital structure or sell itself, but three months later abandoned that plan as its debt pile made any acquisition hard to structure. \nAt the time, the company had been in talks with Canadian retailer Hudson Bay Company for a full or partial sale, but those talks subsequently fell apart due to Neiman Marcus' high debt load. Related Securities", "external_links": [], "published": "2018-01-04T18:25:00.000+02:00", "crawled": "2018-01-04T18:25:45.127+02:00", "highlightTitle": ""}