{"organizations": [], "uuid": "fd64efdca8c35173a80564175235f749cf1855da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/12/globe-newswire-broadstone-net-lease-inc-announces-record-acquisition-and-capital-markets-activity-in-2017.html", "country": "US", "domain_rank": 767, "title": "Broadstone Net Lease, Inc. Announces Record Acquisition and Capital Markets Activity in 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-12T23:06:00.000+02:00", "replies_count": 0, "uuid": "fd64efdca8c35173a80564175235f749cf1855da"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/12/globe-newswire-broadstone-net-lease-inc-announces-record-acquisition-and-capital-markets-activity-in-2017.html", "ord_in_thread": 0, "title": "Broadstone Net Lease, Inc. Announces Record Acquisition and Capital Markets Activity in 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "rochester", "sentiment": "none"}], "organizations": [{"name": "broadstone net lease, inc.", "sentiment": "neutral"}, {"name": "broadstone net lease, inc", "sentiment": "neutral"}, {"name": "bnl", "sentiment": "none"}, {"name": "broadstone real estate", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ROCHESTER, N.Y., Jan. 12, 2018 (GLOBE NEWSWIRE) -- Broadstone Net Lease, Inc. (“BNL”), a privately offered real estate investment trust (“REIT”) managed by Broadstone Real Estate, LLC (“Broadstone”), continued to grow its nationwide portfolio of freestanding, single-tenant, net leased commercial properties. Today, BNL announced strong fourth-quarter and full-year acquisition activity. In aggregate for 2017, BNL acquired 125 properties via 29 distinct transactions for $683.6 million. In the fourth quarter alone, BNL acquired 54 properties for $331.6 million. The REIT also completed strategic dispositions in 2017 of 13 properties, realizing $66.5 million in proceeds, as BNL selectively pruned certain assets to optimize the portfolio. At December 31, 2017, BNL owned 528 properties in 40 states, with a total market value of more than $2.8 billion.\nBNL’s 2017 acquisitions were funded through a combination of cash from operations, proceeds from the issuance of unsecured debt obligations, and proceeds from the issuance of common stock.\nIn 2017, the REIT had significant debt capital markets activity, including three key events. In April, BNL closed on the issuance of $150 million of private placement senior unsecured notes (“Senior Notes”) at a rate of 4.84% per annum with a 10-year maturity. The REIT strategically used this channel of long-term, fixed rate debt capital to help mitigate interest rate risk, lengthen its maturity profile, and diversify its sources of debt capital. In June, BNL, together with its operating company, Broadstone Net Lease, LLC, closed an $800 million unsecured credit facility with a syndicate of leading real estate lenders. The credit facility includes an accordion feature that can increase the facility up to a total of $1.0 billion, and enables continued growth for BNL with a strengthened balance sheet, and attractive borrowing capability in line with the operating company’s investment grade credit rating. In November, the $800 million credit facility was expanded to $880 million of available borrowing capacity, with the addition of two new lenders. The newly expanded $880 million credit facility, together with the REIT’s existing $325 million term loan agreement, provides BNL with a combined $1.2 billion in committed capital from its syndicate of commercial bank lenders.\nIn addition, BNL raised $303.3 million in equity capital in 2017, including $53.7 million during the fourth quarter, on a non-commission basis. The equity was sourced via direct investors and wealth managers. At year-end, the REIT had 2,600+ shareholders.\n“ BNL enjoyed a record-breaking year for acquisitions and dispositions in 2017, and continued to grow and upgrade its portfolio of diversified, commercial, net leased assets. These activities were made possible by our ability to effectively access debt and equity capital due to strong relationships with our shareholders and debt financing partners,” said Chris Czarnecki, Chief Executive Officer of BNL. “ We anticipate that 2018 will bring continued growth for the REIT, as we maintain focus on accretive investments, carefully managing our leverage profile, and strengthening our real estate portfolio in an effort to maximize shareholder returns.”\nAbout Broadstone Net Lease:\nBNL invests in freestanding, single-tenant, triple-net leased commercial properties located throughout the United States, primarily via sale & leaseback, lease assumption, and UPREIT transactions. UPREIT transactions, (where “UPREIT” stands for Umbrella Partnership REIT), provide a tax deferred exit strategy for owners of real estate who might otherwise recognize a significant taxable gain in a cash sale of a highly appreciated property with a low tax basis. With a diversified portfolio of 528 medical, industrial and retail properties in 40 states, the REIT targets individual or portfolio acquisitions within the $10 to $200+ million range.\nThere are currently more than 2,600 shareholders in BNL, which is externally managed by Broadstone Real Estate, LLC. BNL remains open for new investment by accredited investors on a monthly basis, with a minimum direct investment of $500,000. Shares are offered directly by BNL via private placement. Please see certain important disclosures regarding BNL at broadstone.com/disclosures .\nAccredited investors are invited to download an investor kit: broadstone.com/J18\nForward Looking Statements\nThis press release contains forward-looking statements under the federal securities laws. Forward-looking statements are statements that are not descriptions of historical facts and include statements regarding management’s intentions, beliefs, expectations, plans or predictions of the future. Because such statements include risks, uncertainties and contingencies, actual results may differ materially from those expressed or implied by such forward-looking statements. For additional disclosure regarding these and other risks faced by the company, see the disclosures contained in our public filings with the Securities and Exchange Commission. The company undertakes no obligation to publicly release the results of any revisions to these forward-looking statements that may be made to reflect events or circumstances after the date these statements were made.\nMedia Contact:\nEmma Bliss\nSenior Associate, Marketing\nemma.bliss@broadstone.com\n585.287.6479\nSource:Broadstone Real Estate", "external_links": ["https://www.globenewswire.com/Tracker?data=DCEDRtwMof73dkSzM57kVrSH9fk2pnRt4FT6vbo5YZ1Q0eFIGTwjWdjtCYJiIh5V8h1Y1FX1gMVyxZPm3ltyZRigJc9yVpa8j7dvuyn3FDA=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/32a2d91a-11ea-499e-9979-40eefb24b5bb/en", "https://www.globenewswire.com/Tracker?data=0VaCEJaqFOYNwO3_Iz6t7SiylyLNN307WrmtqQG8dJ2CYk2TJzypngo7XpR8M4A9kNZORxVrblygIuNoynq00g==", "https://www.globenewswire.com/Tracker?data=0VaCEJaqFOYNwO3_Iz6t7RNDdQBdva1S8emlPXfLb8uOO216t4h3uFgmU-ncy9AT_01cevt_y4jDTZO7Zgosw99YCwtpUPQqncgD-xdfrHXzv_w3CHY_hqao-1KC1rti"], "published": "2018-01-12T23:06:00.000+02:00", "crawled": "2018-01-13T01:17:57.029+02:00", "highlightTitle": ""}