{"organizations": [], "uuid": "a49b4d505d9634724af966bc30dcec186ff2c8f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/12/gettyimages-633005148.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/09/cryptocurrency-ripple-xrp-lawsuit/", "country": "US", "domain_rank": 1196, "title": "Ripple, R3 Lawsuit Heats Up: $12 Billion Now at Stake | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.839, "site_type": "news", "published": "2018-01-09T02:00:00.000+02:00", "replies_count": 0, "uuid": "a49b4d505d9634724af966bc30dcec186ff2c8f2"}, "author": "Jeff John Roberts", "url": "http://fortune.com/2018/01/09/cryptocurrency-ripple-xrp-lawsuit/", "ord_in_thread": 0, "title": "Ripple, R3 Lawsuit Heats Up: $12 Billion Now at Stake | Fortune", "locations": [], "entities": {"persons": [{"name": "chris larsen", "sentiment": "negative"}, {"name": "jeff john roberts", "sentiment": "negative"}, {"name": "larsen", "sentiment": "none"}, {"name": "david rutter", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Jeff John Roberts January 9, 2018 \nIn the summer of 2016, Ripple’s former CEO Chris Larsen made a fateful decision: he signed a deal with a bank consortium R3, that included an option for its partner to buy 5 billion units of its currency for less than a penny. \nToday, amidst a boom that made Ripple the world’s second most valuable cryptocurrency after bitcoin, that option contract is worth at least $12 billion and the two sides are locked in a bitter court-fight that could shape the future of global banking. \nIn the latest twist in the legal battle, Ripple filed a counterclaim in New York state court that accuses R3 of signing the deal in bad faith, and using the partnership to steal its expertise in order to develop a competing product. \nThe new filing, which includes emails from R3 CEO David Rutter, comes at a time of intense interest in Ripple’s currency—known as XRP—by speculators, who pushed it to highs of around $3.50 last week. The rise of XRP, which now trading around $2.50, has also made Larsen one of the richest men in the world. \nThe option contract represents nearly 10% of the approximately 55 billion XRP (out of a total supply of 100 billion) currently controlled by Ripple. This puts the stakes of the dispute on par with other epic early-days battles such as the one between Facebook’s Mark Zuckerberg and the Winkelvoss twins. \nIn its counter-claim against R3, Ripple says it should not have to honor the options contract—in part because its partner failed to uphold its end of the bargain, failing to “assist Ripple sign up a single bank.” It also says the contract is invalid because CEO David Rutter knew financial heavy-weights Goldman Sachs , J.P. Morgan , and Morgan Stanley were pulling out of R3, but failed to inform Ripple. Here is a key paragraph: \nRather, R3 had misrepresented its resources and current ability to perform solely to induce Ripple into executing the Agreements. For example, although R3 represented to Ripple that it would have access to its large consortium of leading banks, R3 knew and had reason to know that several key banks that would be instrumental to Ripple’s success would soon be departing from its consortium. \nThe Ripple claim, which seeks an unspecified amount of damages, also accuses R3 of “unclean hands” and using the partnership to acquire insights into its business without providing the promised assistance. Ripple quotes an email from Rutter to the company’s current CEO Brad Garlinghouse to allege R3 was not invested in the partnership: \nBrad I really like you guys and I have been clear about that. Love to see you win the payments space and even better I would love to be involved in that journey. BUT I am personally being crushed by a ridiculously complicated funding round[.]” the email allegedly reads. A later Rutter email reportedly states he had “no idea what’s going on with XRP. \nIn its own complaint, R3 claims a decision by Ripple last June to terminate the option was unjustified, and says its real motive was because the option was suddenly “in the money.” \nBoth Ripple and R3 declined to comment from this story, but sources familiar with the litigation, who agreed to speak on the condition of anonymity, said the sides have not explored settlement talks but are staking the outcome on the court’s decision. A question of good faith \nThe outcome of the court fight in New York, which comes after procedural skirmishes in California and Delaware, is hard to predict. According to a contract law expert, the matter is likely to turn on whether R3’s failure to inform Ripple about the departure of partners like Goldman Sachs amounts to a “material breach.” \n“If [R3’s] only duty was to provide assistance, and it breached this duty in a significant way (the latter qualification is important since this duty could be breached in trivial ways), for example by doing nothing when it could have done something, then the breach looks material to me,” said Stephen Smith, a law professor at McGill University, in an email to Fortune . \nSmith added that the outcome may also turn on how the New York judge applies general contract law rules requiring parties to act in good faith. \nIn a broader context, the dispute between R3 and Ripple is part of a disruption in the world of global banking that involves financial institutions turning to the technology known as blockchain to transfer money and record settlements. \nBig banks are increasingly betting that blockchain software, which underpins bitcoin and creates an immutable record of transactions, will provide a cheaper and faster alternative to legacy money transfer systems. \nR3 is betting that banks will opt for its version of blockchain software, known as Corda, though it has encountered headwinds as initial partners like Goldman have dropped their support. \nRipple, meanwhile, has had a recent run of success as it persuaded more than 100 banks to use its blockchain tools. Nonetheless, the company is also facing questions over the value of its homemade XRP currency, which skeptics say will never—contrary to Ripple’s assertions —be integral to bank transfers, and is instead simply the source of a speculative bubble. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-09T02:00:00.000+02:00", "crawled": "2018-01-10T02:34:38.039+02:00", "highlightTitle": ""}