{"organizations": [], "uuid": "1077af3829cf02c4f26ac1ab015617d598f23925", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.topix.com/rss/wire/world/europe", "section_title": "", "url": "https://www.reuters.com/article/easteurope-markets/cee-markets-leu-jumps-as-romanian-central-bank-hikes-rates-idUSL8N1P347L", "country": "US", "domain_rank": 408, "title": "Cee Markets-Leu jumps as Romanian central bank hikes rates", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T18:29:00.000+02:00", "replies_count": 0, "uuid": "1077af3829cf02c4f26ac1ab015617d598f23925"}, "author": "", "url": "https://www.reuters.com/article/easteurope-markets/cee-markets-leu-jumps-as-romanian-central-bank-hikes-rates-idUSL8N1P347L", "ord_in_thread": 0, "title": "Cee Markets-Leu jumps as Romanian central bank hikes rates", "locations": [], "entities": {"persons": [{"name": "cee markets-leu", "sentiment": "negative"}, {"name": "sandor peto", "sentiment": "none"}, {"name": "luiza ilie budapest/bucharest", "sentiment": "none"}], "locations": [{"name": "romania", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "cnb", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "nbr", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 8, 2018 / 3:13 PM / Updated an hour ago CEE MARKETS-Leu jumps as Romanian central bank hikes rates Reuters Staff 7 Min Read \n* Romanian central bank raises rates, surprising some analysts * Romanian government bond yields mostly rise * Zloty eases, central bank unlikely to encourage rate hike bets (Recasts with Romanian central bank interest rate hike) By Sandor Peto and Luiza Ilie BUDAPEST/BUCHAREST, Jan 8 (Reuters) - The leu firmed and Romanian government bond yields rose as the country's central bank (NBR) delivered its first benchmark interest rate hike in a decade on Monday to fight inflation. The quarter percentage point hike to 2 percent made the NBR the second central bank among those of the European Union's eastern nations to start to lift rates from record low levels, after two hikes by the Czech central bank (CNB) since August. While the CNB has the lowest inflation target in the region at 2 percent, markets have been gripped by overheating concerns in Romania where a surge in wages has helped the economy to grow by a stellar annual 8.8 percent in the third quarter of 2017. Between August and November, Romania's annual inflation rate surged two percentage points to 3.2 percent. In a Reuters poll, five analysts had expected the bank to hold fire, while four projected a quarter point hike. Some Romanian government debt prices eased, with 3-year papers bid at a yield of 3.45 percent, up 13 basis points according to Reuters data. The leu jumped more than a third of a percent against the euro past 4.62 after the decision. It gave up almost all of the gains to trade at 4.6335 at 1418 GMT, after NBR Governor Mugur Isarescu said the bank would consider the 5-6 percentage point range for leu moves as sustainable. The Polish central bank (NBP) is unlikely to follow the Czech and Romanian central bank rate hikes any time soon, after Polish figures for December showed lower-than-expected inflation. It is unlikely to encourage expectations for interest rate hikes at its meeting on Wednesday, and that could weigh on the zloty which hit six-and-a-half-year highs against the euro last week. It eased 0.3 percent to 4.1672 by 1418 GMT. The region's currencies generally started the year strengthening, lifted by a rise in risk appetite in global markets and the prospect of healthy economic growth in Central Europe. \"The zloty will probably not be helped by comments after the MPC (central bank) meeting,\" ING analysts said in a note, adding that a correction could weaken the zloty to 4.2 in the next couple of weeks, even though a big easing is unlikely. Erste analysts said in a note that they did not expect anything new from the NBP, and the zloty could stay flat. CEE SNAPSHOT AT MARKETS 1518 CET CURRENCI ES Latest Previous Daily Change bid close change in 2018 Czech <EURCZK= 25.5380 25.5485 +0.04% +0.02% crown > Hungary <EURHUF= 308.9000 308.5050 -0.13% +0.65% forint > Polish <EURPLN= 4.1672 4.1552 -0.29% +0.22% zloty > Romanian <EURRON= 4.6335 4.6367 +0.07% +1.00% leu > Croatian <EURHRK= 7.4400 7.4375 -0.03% -0.13% kuna > Serbian <EURRSD= 118.4500 118.7400 +0.24% +0.04% dinar > Note: calculated from 1800 CET daily change Latest Previous Daily Change close change in 2018 Prague 1107.45 1105.320 +0.19% +2.72% 0 Budapest 40052.37 39995.16 +0.14% +1.71% Warsaw 2536.35 2529.55 +0.27% +3.05% Bucharest 7953.17 7985.82 -0.41% +2.57% Ljubljana <.SBITOP 807.89 802.25 +0.70% +0.19% > Zagreb 1862.71 1849.71 +0.70% +1.08% Belgrade <.BELEX1 767.70 753.03 +1.95% +1.04% 5> Sofia 687.68 692.24 -0.66% +1.51% BONDS Yield Yield Spread Daily (bid) change vs Bund change in Czech spread Republic 2-year <CZ2YT=R 0.6980 0.0870 +132bps +10bps R> 5-year <CZ5YT=R 0.9410 0.0460 +117bps +7bps R> 10-year <CZ10YT= 1.7050 0.0580 +129bps +9bps RR> Poland 2-year <PL2YT=R 1.6130 0.0060 +224bps +2bps R> 5-year <PL5YT=R 2.4990 0.0040 +273bps +2bps R> 10-year <PL10YT= 3.2280 0.0040 +282bps +3bps RR> FORWARD RATE AGREEMEN T 3x6 6x9 9x12 3M interban k Czech Rep 1.05 1.22 1.36 0.00 <PRIBOR= > Hungary 0.07 0.10 0.15 0.03 Poland 1.75 1.78 1.87 1.72 Note: FRA are for ask prices quotes", "external_links": [], "published": "2018-01-08T18:29:00.000+02:00", "crawled": "2018-01-08T18:36:14.006+02:00", "highlightTitle": ""}