{"organizations": [], "uuid": "03b39ff973171e0bdfc67bbed4447e48bf495ac2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/05/globe-newswire-greenfield-farms-food-inc-announces-signing-of-asset-purchase-agreementacompany-also-spins-out-prior-business-to-now-focus.html", "country": "US", "domain_rank": 767, "title": "Greenfield Farms Food Inc. Announces Signing of Asset Purchase Agreement; Company also Spins Out prior business, to now focus on the automotive technology sector", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T19:44:00.000+02:00", "replies_count": 0, "uuid": "03b39ff973171e0bdfc67bbed4447e48bf495ac2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/05/globe-newswire-greenfield-farms-food-inc-announces-signing-of-asset-purchase-agreementacompany-also-spins-out-prior-business-to-now-focus.html", "ord_in_thread": 0, "title": "Greenfield Farms Food Inc. Announces Signing of Asset Purchase Agreement; Company also Spins Out prior business, to now focus on the automotive technology sector", "locations": [], "entities": {"persons": [{"name": "carmela", "sentiment": "none"}, {"name": "jason koo", "sentiment": "none"}, {"name": "koo", "sentiment": "none"}], "locations": [{"name": "dallas", "sentiment": "none"}, {"name": "ngen", "sentiment": "none"}], "organizations": [{"name": "announces signing of asset purchase agreement; company", "sentiment": "neutral"}, {"name": "greenfield farms food inc", "sentiment": "neutral"}, {"name": "greenfield farms food, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "ngen", "sentiment": "none"}, {"name": "ngen technologiesusa, corp.", "sentiment": "none"}, {"name": "carmela's pizzeria co, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS, Jan. 05, 2018 (GLOBE NEWSWIRE) -- Greenfield Farms Food, Inc. (\"GRAS\" or the \"Company\") (OTC PINK:GRAS) today announced that it has closed the Asset Purchase Agreement and has acquired certain assets of Ngen TechnologiesUSA, Corp. (\"Ngen\"). The assets acquired center around Ngen's automotive technologies business. Pursuant to the Agreement, the Company issued in the aggregate 1,000 shares of its Series E Preferred Stock that is convertible, on a post conversion basis, into 85% of the issued and outstanding common stock of the Company.\nJason Koo, CEO stated, \"I am very excited to have acquired the automotive technology business that Ngen has developed. The Company has now divested Carmela's Pizzeria Co, Inc. (\"Carmela's\") including all of Carmela's liabilities as well as approximately $193,000 of convertible debt.\" Koo continued, \"We are looking forward to continue to restructure the Company not only to meet our public filing requirements, but as importantly to work with our customers and vendors, with the goal of bringing meaningful value to all our shareholders.\"\nDr. Koo, also stated, \"My team is laser focused about producing and delivering our state of the art automotive technology products to the marketplace. We are excited to have the automotive technology business as the centerpiece of Greenfield Farms. We look forward to keeping our shareholders informed as developments occur in the business.\"\nAbout Greenfield Farms Food, Inc.\nGreenfield Farms Food, Inc. is a publicly-traded nominally capitalized company that recently acquired assets related to the automotive technology business. The Company designs, develops and manufactures state of the art automotive technologies including our muffler/silencer systems that relieves the back-pressure issue of trucks and automobiles allowing the engine and transmission to perform at maximum efficiency which increases fuel mileage while extending engine and transmission life.\nSafe Harbor for Forward-looking Statements\nThis news release may contain forward-looking statements that are made pursuant to the \"safe harbor\" provisions of the Private Securities Litigation Reform Act of 1995. While these statements are made to convey to the public the company's progress, business opportunities and growth prospects, they are based on management's current beliefs and assumptions as to future events. However, since the company's operations and business prospects are always subject to risk and uncertainties, the forward-looking events and circumstances discussed in this news release might not occur, and actual results could differ materially from those described, anticipated or implied. For a more complete discussion of such risks and uncertainties, please refer to the company's filings with the Securities and Exchange Commission.\nFor more information call Edward Carter at 980-348-8825\nSource: Greenfield Farms Food, Inc.", "external_links": [], "published": "2018-01-05T19:44:00.000+02:00", "crawled": "2018-01-05T20:12:43.000+02:00", "highlightTitle": ""}