{"organizations": [], "uuid": "ada6da6b1993c86ec966a1e5febfb90282bb20f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/24/104965352-GettyImages-126553936_1.1910x1000.jpg", "site_section": "http://feeds.feedburner.com/IsraelNews-GoogleNews", "section_title": "israel news - Google News", "url": "https://www.cnbc.com/2018/01/24/the-biggest-threat-to-lebanon-is-israel-prime-minister-hariri-says.html", "country": "US", "domain_rank": 767, "title": "The biggest threat to Lebanon is Israel, Prime Minister Hariri says - CNBC", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T21:51:00.000+02:00", "replies_count": 0, "uuid": "ada6da6b1993c86ec966a1e5febfb90282bb20f7"}, "author": "", "url": "https://www.cnbc.com/2018/01/24/the-biggest-threat-to-lebanon-is-israel-prime-minister-hariri-says.html", "ord_in_thread": 0, "title": "The biggest threat to Lebanon is Israel, Prime Minister Hariri says - CNBC", "locations": [], "entities": {"persons": [{"name": "hariri", "sentiment": "negative"}, {"name": "isr", "sentiment": "negative"}, {"name": "saad hariri", "sentiment": "none"}], "locations": [{"name": "lebanon", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "palestine", "sentiment": "none"}], "organizations": [{"name": "cnbc davos", "sentiment": "negative"}, {"name": "world economic forum", "sentiment": "none"}, {"name": "hezbollah", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The biggest threat to Lebanon's stability is Israel, Lebanese Prime Minister Saad Hariri told an audience at the World Economic Forum in Davos Wednesday.\n\"The only threat I see is Israel taking some kind of action against Lebanon, out of a miscalculation,\" Hariri said.\n\"And this is the real threat, I believe. I think the other issues are challenges, yes ... But when Israel decides to launch a war against Lebanon, this is something that is unexplainable.\"\nThe prime minister spoke in reference to the 2006 Lebanon War, during which Israel launched an offensive against the country in response to cross-border rocket attacks from Shia militant group Hezbollah, now the most powerful party in Lebanon's government.\nMark Hannaford Israel. Army post on the border with South Lebanon. \"Look at the history — how many times Israel launched wars on Lebanon?,\" the prime minister asked. \"How many wars? In 2006, Israel launched a war saying it would get rid of Hezbollah. And where are we now?\"\nIsrael 'doesn't want peace' with Palestine \"And the problem is not only Lebanon. Look at Palestine,\" Hariri went on. \"If you want peace, you have to accept the other. Talk to the other and accept that they have rights.\"\n\"The only way this is going to be resolved is for Israel to make peace with the Palestinians. How long do we have to hear about the Palestinian conflict?\"\n\"I believe that (the) current administration in Israel does not want peace, full stop.\"\nHariri was clear in expressing his frustration with the historically internecine Israeli-Palestinian conflict, though he added, \"We have seen people in Israel that wanted peace.\"\nOn President Donald Trump 's decision to name Jerusalem the Israeli capital , a move widely condemned around the world, Hariri said, \"Our position on Jerusalem is very clear.\"\n\"If the U.S. decides Jerusalem is the capital of Israel, that does not mean that Jerusalem is the capital of Israel. Because the whole world is saying Jerusalem is not the capital of Israel.\"\nThe Trump administration's move in December was a sharp reversal of decades of official U.S. policy, which left the status of Jerusalem up to negotiations between Israeli and Palestinian leadership. It triggered protests in several countries , as well as violent demonstrations in parts of the Middle East.\nStill, Hariri felt Trump has good intentions for the region. Asked if he thought the U.S. wants peace, he replied, \"Of course they do. And I believe that President Trump wants peace. But he is trying a different way maybe, which I don't understand.\"\nshow chapters What is Davos? 12:34 AM ET Tue, 23 Jan 2018 | 03:12", "external_links": [], "published": "2018-01-24T21:51:00.000+02:00", "crawled": "2018-01-24T22:56:09.006+02:00", "highlightTitle": ""}