{"organizations": [], "uuid": "62de0ea6f45bbfc45e08f81ba233f76599b885af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000336/device/rss", "section_title": "Janet Yellen", "url": "https://www.cnbc.com/2018/01/29/reuters-america-us-stocks-wall-st-slips-at-open-apple-weighs.html", "country": "US", "domain_rank": 767, "title": "US STOCKS-Wall St slips at open, Apple weighs", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T17:01:00.000+02:00", "replies_count": 0, "uuid": "62de0ea6f45bbfc45e08f81ba233f76599b885af"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/29/reuters-america-us-stocks-wall-st-slips-at-open-apple-weighs.html", "ord_in_thread": 0, "title": "US STOCKS-Wall St slips at open, Apple weighs", "locations": [], "entities": {"persons": [{"name": "peter cardillo", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "first standard financial", "sentiment": "none"}, {"name": "pfizer", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "nikkei", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "lockheed martin", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Apple drops on reports of slowing iPhone X production\n* Dr Pepper Snapple soars on deal to merge with Keurig\n* Lockheed Martin higher after upbeat 2018 earnings forecast\n* Indexes down: Dow 0.06 pct, S&P 0.12 pct, Nasdaq 0.17 pct\n* Indexes coming off their best four-week run since 2016 (Updates to open)\nJan 29 (Reuters) - Wall Street eased on Monday from record levels hit last week, weighed down by a drop in Apple shares after a report said it would maker fewer iPhone Xs.\nApple fell 1.42 percent in early trading after the Nikkei reported the company will halve its iPhone X production target for the first quarter to around 20 million units.\nThe report added to growing concerns around weak sales of the $999 phone ahead of Apple reporting it quarterly results on Thursday.\nBesides Apple, heavyweights Alphabet, Facebook , Microsoft and Amazon are also set to report results this week, as are Dow components Pfizer and DowDuPont.\n\"The upcoming results should provide further evidence of a strong earnings season under way,\" Peter Cardillo, chief market economist at First Standard Financial in New York, wrote in a client note.\n\"Investors' confidence remains strong and it is likely to strengthen. However, the amount of money being poured into stocks is one more reason to be more cautious than ever.\"\nFourth-quarter earnings growth for the S&P 500 is now estimated at 13.2 percent, according to Thomson Reuters data, up from 12 percent at the start of the year.\nAt 9:40 a.m. ET (1440 GMT), the Dow Jones Industrial Average was down 14.74 points, or 0.06 percent, at 26,601.97, the S&P 500 was down 3.62 points, or 0.12 percent, at 2,869.25.\nThe Nasdaq Composite was down 12.48 points, or 0.17 percent, at 7,493.29.\nThe three major U.S. indexes are coming off their best four-week run since 2016, propelled by strong earnings and economic data.\nU.S. Treasury yields were at multi-year highs, extending gains from last week on the back of strong economic data and as investors braced for major central banks to step back from ultra-easy monetary policies.\nWhile the Federal Reserve is not expected to lower interest rates at its two-day meeting that starts Tuesday, outgoing Chair Janet Yellen's last statement will be scrutinized for clues on the future path of rate hikes.\nOn Monday, nine of the 11 major S&P sectors were lower, with the telecommunications index's 1.6 percent fall leading the decliners.\nAT&T Verizon and Sprint were down between 1.1 percent and 1.6 percent on reports that President Donald Trump's national security team is looking at options such as a government-built super-fast 5G wireless network.\nLockheed Martin rose 2.3 percent after the weapons supplier forecast higher 2018 earnings.\nDr Pepper Snapple Group soared 24.6 percent after K-cup maker Keurig Green Mountain said it will buy the soda maker.\nAvon Products was up 4.3 percent after a group of its shareholders asked the cosmetics maker to explore strategic alternatives, including a possible sale.\nDeclining issues outnumbered advancers on the NYSE by 2,011 to 731. On the Nasdaq, 1,531 issues fell and 1,002 advanced. (Reporting by Tanya Agrawal; Editing by Savio D'Souza)", "external_links": [], "published": "2018-01-29T17:01:00.000+02:00", "crawled": "2018-01-29T19:39:48.014+02:00", "highlightTitle": ""}