{"organizations": [], "uuid": "a4afc2635524ab632404c7cc3ff47a73f3091e94", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-teekay-offshore-partners-announces-public-offering-of-series-e-preferred-units.html", "country": "US", "domain_rank": 767, "title": "Teekay Offshore Partners Announces Public Offering of Series E Preferred Units", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-16T17:45:00.000+02:00", "replies_count": 0, "uuid": "a4afc2635524ab632404c7cc3ff47a73f3091e94"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-teekay-offshore-partners-announces-public-offering-of-series-e-preferred-units.html", "ord_in_thread": 0, "title": "Teekay Offshore Partners Announces Public Offering of Series E Preferred Units", "locations": [], "entities": {"persons": [], "locations": [{"name": "bermuda", "sentiment": "none"}, {"name": "east coast", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "north sea", "sentiment": "none"}], "organizations": [{"name": "teekay offshore", "sentiment": "negative"}, {"name": "teekay offshore partners announces public offering of series e preferred units hamilton", "sentiment": "negative"}, {"name": "teekay offshore partners l.p.", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HAMILTON, Bermuda, Jan. 16, 2018 (GLOBE NEWSWIRE) -- Teekay Offshore Partners L.P. ( Teekay Offshore or the Partnership ) (NYSE:TOO) announced today that it plans to offer in a public offering Series E Fixed-to-Floating Rate Cumulative Redeemable Perpetual Preferred Units ( Series E Preferred Units ), representing limited partner interests in the Partnership. Teekay Offshore expects to grant the underwriters for the offering a 30-day option to purchase additional Series E Preferred Units. The Partnership expects to use the net proceeds from the public offering for general partnership purposes, which may include funding installment payments on newbuildings and conversion projects and debt repayments.\nTeekay Offshore Partners L.P. is an international provider of marine transportation, oil production, storage, long-distance towing and offshore installation and maintenance and safety services to the oil industry, primarily focusing on oil production-related activities of its customers and operating in offshore oil regions of the North Sea, Brazil and the East Coast of Canada. Teekay Offshore is structured as a publicly-traded master limited partnership ( MLP ), comprised of 63 offshore assets (including newbuildings), which includes floating production, storage and offloading ( FPSO ) units, shuttle tankers, floating storage and offtake ( FSO ) units, a unit for maintenance and safety ( UMS ), long-distance towing and offshore installation vessels and conventional tankers.\nThe joint book-running managers for this offering are Morgan Stanley & Co. LLC, UBS Securities LLC, J.P. Morgan Securities LLC and Stifel, Nicolaus & Company, Incorporated.\nWhen available, copies of the prospectus supplement and accompanying base prospectus related to this offering may be obtained from Morgan Stanley & Co. LLC, 180 Varick Street, 2nd Floor, New York, NY 10014, Attn: Prospectus Department, telephone (866) 718-1649; UBS Securities LLC, 1285 Avenue of the Americas, New York, NY 10019, Attn: Prospectus Department, telephone (888) 827-7275; J.P. Morgan Securities LLC, 383 Madison Avenue, New York, New York 10179, Attention: Investment Grade Syndicate Desk – 3rd floor, telephone: (212) 834-4533; or Stifel, Nicolaus & Company, Incorporated, 1 South Street, 15th Floor, Baltimore, MD 21202, Attn: Prospectus Department, telephone (855) 300-7136.\nThis news release does not constitute an offer to sell or a solicitation of an offer to buy the securities described herein, nor shall there be any sale of these securities in any state or jurisdiction in which such an offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction. The Series E Preferred Units will be offered and sold pursuant to an effective registration statement on Form F-3, filed with the Securities and Exchange Commission (SEC).\nThe statements in this press release that are not historical facts may be forward-looking statements. These forward-looking statements involve risks and uncertainties that could cause the outcome to be materially different. These risks and uncertainties include, but are not limited to, those discussed in Teekay Offshore’s public filings with the SEC. Teekay Offshore undertakes no obligation to revise or update any forward looking statements, unless required to do so under the securities laws.\nFor Investor Relations\nenquiries contact:\nRyan Hamilton\nTel: +1 (604) 609-2963\nSource:Teekay Offshore Partners L.P.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/d6ddfcc6-85b1-4030-aa95-8ffb172178de"], "published": "2018-01-16T17:45:00.000+02:00", "crawled": "2018-01-16T18:33:30.029+02:00", "highlightTitle": ""}