{"organizations": [], "uuid": "7d4c1ffd7dd280ffa260ba8f76f73724656ce77d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-shore-community-bank-announces-2017-net-income-and-declares-quarterly-cash-dividend.html", "country": "US", "domain_rank": 767, "title": "Shore Community Bank Announces 2017 Net Income And Declares Quarterly Cash Dividend", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T00:21:00.000+02:00", "replies_count": 0, "uuid": "7d4c1ffd7dd280ffa260ba8f76f73724656ce77d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-shore-community-bank-announces-2017-net-income-and-declares-quarterly-cash-dividend.html", "ord_in_thread": 0, "title": "Shore Community Bank Announces 2017 Net Income And Declares Quarterly Cash Dividend", "locations": [], "entities": {"persons": [], "locations": [{"name": "n.j.", "sentiment": "none"}], "organizations": [{"name": "shore community bank", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TOMS RIVER, N.J., Shore Community Bank (OTC Pink: SHRC) today reported net income of $163,388, or $0.05 per diluted share, for the fourth quarter of 2017 compared to net income of $485,114, or $0.16 per diluted share, for the fourth quarter of 2016. Net income for the year ended December 31, 2017 was $2,067,788, or $0.66 per diluted share, compared to $1,726,381, or $0.56 per diluted share, for the year ended December 31, 2016.\nAs a result of the enactment of the Tax Cuts and Jobs Act on December 22, 2017, a charge to tax provision was recorded due to the adjustment of deferred tax assets in the amount of $486,873 in the fourth quarter of 2017 resulting in an increase to income tax expense. This noncash one-time charge decreased the fourth quarter and year-to-date earnings per diluted share by $0.16 based on the fourth quarter and annual average shares outstanding.\nThe Board of Directors also announced a quarterly cash dividend of $0.075 per share. The dividend will be paid on February 20, 2018 to all shareholders of record on February 06, 2018.\nCommenting on the results, Robert T. English, President and Chief Executive Officer stated, \"Excluding the increase in income tax expense associated with the deferred tax assets adjustment, diluted earnings per share for 2017 were a record high $0.82. Net income has reached record highs for 3 consecutive years. Loan growth for the year was slightly over 11 percent and comparable to growth achieved in 2016. With signs of a strengthening economy, brought on by the recently enacted tax legislation and the continued expectation of reduced regulation, it appears the economy in 2018 will remain in growth mode and will provide us with the opportunity to continue our prudent loan growth strategy.\" Mr. English further stated, \"We have reached a new milestone in the fourth quarter of 2017 with the payment of the first cash dividend in our 20 year history. The reaction from our shareholders has been very positive and the Board is pleased to declare a quarterly dividend for the first quarter of 2018.\"\nTotal assets, at December 31, 2017, increased 2.4 percent and totaled $271.1 million, compared to $264.7 million at December 31, 2016 while total loans increased 11.2 percent and finished the year at $202.9 million compared to $182.5 million at December 31, 2016. Total deposits increased 2.0 percent to $242.1 million at December 31, 2017, compared to $237.3 million at year-end 2016.\nNon-performing assets, which includes other real estate owned (OREO) totaled $3.7 million at December 31, 2017 and included $2.8 million in non-performing loans and $0.9 million in OREO, compared to a total of $2.2 million at year end 2016 which included $0.3 million in non-performing loans and $1.9 million in OREO. Total non-performing assets at December 31, 2017, as a percentage of total assets, were 1.36 percent compared to 0.84 percent at December 31, 2016.\nThe provision for loan losses totaled $85,000 for the quarter ended December 31, 2017. No provision for loan losses was recorded in the fourth quarter 2016. Net loan recoveries in the fourth quarter of 2017 totaled $4,802 compared to net charge-offs of $25,159 in the fourth quarter of 2016. For the twelve months ended December 31, 2017, the provision for loan losses totaled $245,000 compared to $155,000 for the full year 2016. The Bank reported net loan charge-offs of $146,877 for the year ended December 31, 2017, compared to net loan recoveries of $21,711 for the year ended December 31, 2016.\nThe allowance for loan losses as a percentage of period end loans was 1.43 percent at December 31, 2017 compared to 1.54 percent at December 31, 2016.\nBook value per share at December 31, 2017, after the deferred tax assets adjustment, was $9.04 compared to $8.66 at December 31, 2016 based on 3.1 million shares outstanding in each period.\nShore Community Bank is traded on the OTC Pink under the symbol \"SHRC.\"\nShore Community Bank operates five banking offices located in Toms River, Jackson and Manahawkin, New Jersey. The Bank was founded in 1997 by a group of local business leaders with the objective of returning community based banking to the Toms River, Ocean County, New Jersey area.\nInformation in this release relating to Shore Community Bank's future prospects which are forward-looking statements involve risks and uncertainties that could cause actual results to differ materially, including, but not limited to, the following: (1) operating, legal and regulatory risks, such as continued levels of loan quality and origination volume, continued relationships with major customers and technological changes; (2) economic, political and competitive forces affecting our banking business, such as changes in economic conditions, especially in our market area, interest rate fluctuations, competitive product and pricing pressures within our market, personal and corporate bankruptcies, monetary policy and inflation; (3) our ability to grow internally or through acquisitions; and (4) the risk that management's analyses of these risks and forces could be incorrect and/or that the strategies developed to address them could be unsuccessful. Forward-looking statements may be identified by the use of words such as \"expect,\" \"believe,\" \"anticipate,\" \"estimate,\" \"forecast,\" \"intend,\" \"will,\" \"may\" or other similar words and expressions. Forward-looking statements speak only as of the date they are made. Shore Community Bank assumes no obligation to update the forward-looking information in this announcement, except as required under applicable law.\n releases/shore-community-bank-announces-2017-net-income-and-declares-quarterly-cash-dividend-300588577.html\nSOURCE Shore Community Bank", "external_links": ["http://www.prnewswire.com/news-releases/shore-community-bank-announces-2017-net-income-and-declares-quarterly-cash-dividend-300588577.html"], "published": "2018-01-26T00:21:00.000+02:00", "crawled": "2018-01-26T01:23:58.017+02:00", "highlightTitle": ""}