{"organizations": [], "uuid": "d56c5d9a1f62242516dc290d0386e576e95b427f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/7", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-pareteum-expects-q4-2017-revenue-to-exceed-expectations.html", "country": "US", "domain_rank": 767, "title": "Pareteum Expects Q4 2017 Revenue to Exceed Expectations", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T16:00:00.000+02:00", "replies_count": 0, "uuid": "d56c5d9a1f62242516dc290d0386e576e95b427f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-pareteum-expects-q4-2017-revenue-to-exceed-expectations.html", "ord_in_thread": 0, "title": "Pareteum Expects Q4 2017 Revenue to Exceed Expectations", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "pareteum corporation", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}, {"name": "cloud communications platform", "sentiment": "none"}, {"name": "company's managed services and global cloud", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 8, 2018 /PRNewswire/ -- Pareteum Corporation (NYSE American: TEUM), the rapidly growing Cloud Communications Platform company, today announced that the Company expects to report revenues that will exceed consensus analyst expectations of $3.75 million for the fourth quarter ended December 31, 2017.\nFourth quarter 2017 revenue represents sequential quarterly growth of at least 10% over the $3.5 million reported in the third quarter of 2017. The Company's fourth quarter and year end 2017 earnings results and conference call are expected to be held on or before March 30, 2018.\nDuring the second half of 2017, the Company's 36-month Contractual Revenue Backlog increased from $60,000,000 at the end of the second quarter to $147,000,000 at the end of the fourth quarter. This contractual backlog is generated by each of the Company's Managed Services and Global Cloud customers who have entered into multi-year Software-as-a-Service agreements with Pareteum. These customer agreements consist of guaranteed minimum monthly recurring fees, as well as contractually scheduled subscriber and connections expansion, with their resulting monthly recurring revenue.\n\"Our TEUM ended the 2017 year with a very strong fourth quarter as demonstrated by the acceleration in our 36-month Contractual Revenue Backlog. This key performance indicator is directly correlated to our financial and operating results and reflects the traction our services and solutions are gaining in the marketplace. We continue to solve customer problems by presenting solutions that yield significant operational efficiencies and expense savings, creating faster revenue, while opening new sources of revenue, such as Blockchain and mobile payment solutions, that would have previously required multiple vendors and complex system integrations,\" stated Hal Turner, Executive Chairman and Principal Executive Officer of Pareteum.\nAbout Pareteum Corporation\nThe mission of Pareteum Corporation (NYSE American: TEUM) is to connect \"every person and everything\". Organizations use Pareteum to energize their growth and profitability through cloud communication services and complete turnkey solutions featuring relevant content, applications, and connectivity worldwide. By harnessing the value of communications, Pareteum serves retail, enterprise and IoT customers. Pareteum currently has offices in New York, Sao Paulo, Madrid, Barcelona, Bahrain and the Netherlands. For more information please visit: www.pareteum.com .\nForward Looking Statements:\nCertain statements contained herein constitute \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements may include, without limitation, statements with respect to Pareteum's plans and objectives, projections, expectations and intentions. These forward-looking statements are based on current expectations, estimates and projections about Pareteum's industry, management's beliefs and certain assumptions made by management. Readers are cautioned that any such forward-looking statements are not guarantees of future performance and are subject to certain risks, uncertainties and assumptions that are difficult to predict. Because such statements involve risks and uncertainties, the actual results and performance of Pareteum may differ materially from the results expressed or implied by such forward-looking statements. Given these uncertainties, readers are cautioned not to place undue reliance on such forward-looking statements. Unless otherwise required by law, Pareteum also disclaims any obligation to update its view of any such risks or uncertainties or to announce publicly the result of any revisions to the forward-looking statements made here. Additional information concerning certain risks and uncertainties that could cause actual results to differ materially from those projected or suggested in Pareteum's filings with the Securities and Exchange Commission, copies of which are available from the SEC or may be obtained upon request from Pareteum Corporation.\nContractual Revenue Backlog Definition:\nContractual revenue backlog is measured on a forward looking 36 month snapshot view monthly, and, is generated by each of the Company's Managed Services, Global Mobility Cloud, and Application Exchange & Developer's Platform customers. The Pareteum multi-year Software-as-a-Service agreements include service establishment and implementation fees, guaranteed minimum monthly recurring fees, as well as contractually scheduled subscribers, in some cases including subscriber usage, during the term of the agreement, and, their resulting monthly recurring revenue. There can be no assurances that we reach the total revenue backlog. The revenue backlog assumes timing of revenue recognition that may vary from actual results.\nPareteum Investor Relations Contact:\nTed O'Donnell\nChief Financial Officer\n(212) 984-1096\nInvestorRelations@pareteum.com\nHayden IR\n917-658-7878\nView original content with multimedia: http://www.prnewswire.com/news-releases/pareteum-expects-q4-2017-revenue-to-exceed-expectations-300578772.html\nSOURCE Pareteum Corporation", "external_links": ["http://r20.rs6.net/tn.jsp?f=001BHrTHzD-oaL_lGvlCVMYhVeEYRT3KslElHHkyBRxzIu03tvRKxVno8J_S9Vjnn-6bwCY5EuhbmhO9cKTdwRl6BgMc15AFdhrFrjmgtRj0UHX8bH5VboGun224wVLIeVbgG2_ZItPaVe0B4YoQ-nmZA==&c=NaFFZoZuuNmgDWYHdKbVEJJW_QUvLGrv58En0yOtZqr_9qWEPIctdg==&ch=VVO-r4NvXtN34brtSWK9PVE2vieX-iTIje6wFN05V9worp72_PdMYQ==", "http://www.prnewswire.com/news-releases/pareteum-expects-q4-2017-revenue-to-exceed-expectations-300578772.html"], "published": "2018-01-08T16:00:00.000+02:00", "crawled": "2018-01-08T17:08:56.014+02:00", "highlightTitle": ""}