{"organizations": [], "uuid": "6ecfac7d03bc5fb82e7feeab8199aea4a0768200", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/07/12/104582021-GettyImages-813297058-janet-yellen.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/29/fed-chair-janet-yellens-final-meeting-may-bring-out-the-hawk-in-her.html", "country": "US", "domain_rank": 767, "title": "Fed Chair Janet Yellen's final meeting may bring out the hawk in her", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.031, "site_type": "news", "published": "2018-01-30T01:41:00.000+02:00", "replies_count": 0, "uuid": "6ecfac7d03bc5fb82e7feeab8199aea4a0768200"}, "author": "Patti Domm", "url": "https://www.cnbc.com/2018/01/29/fed-chair-janet-yellens-final-meeting-may-bring-out-the-hawk-in-her.html", "ord_in_thread": 0, "title": "Fed Chair Janet Yellen's final meeting may bring out the hawk in her", "locations": [], "entities": {"persons": [{"name": "janet yellen", "sentiment": "negative"}, {"name": "jerome powell", "sentiment": "none"}, {"name": "yellen", "sentiment": "none"}, {"name": "jim watson", "sentiment": "none"}], "locations": [{"name": "capitol hill", "sentiment": "none"}, {"name": "washington, dc", "sentiment": "none"}], "organizations": [{"name": "federal open market committee", "sentiment": "none"}, {"name": "getty images federal reserve board", "sentiment": "none"}, {"name": "fed", "sentiment": "none"}, {"name": "house financial services committee", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Market Insider Fed Chair Janet Yellen's final meeting may bring out the hawk in her Fed Chair Janet Yellen presides over her last meeting Tuesday and Wednesday. She could end the meeting with a more hawkish-sounding statement to reflect an improved economy and rising inflation expectations. Yellen, known as a dove during her tenure, started the Fed back on a rate-hiking path in 2015 after her predecessor took interest rates to zero during the financial crisis in 2008. She also began the process of reducing the Fed's $4 trillion balance sheet. The Fed is expected to continue on the same path Yellen set once Jerome Powell takes over. CNBC.com Jim Watson | AFP | Getty Images Federal Reserve Board Chairwoman Janet Yellen testifies before the House Financial Services Committee on Capitol Hill in Washington, DC, on July 12, 2017. \nThe Federal Reserve may sound a bit more hawkish as Fed Chair Janet Yellen's tenure comes to an end. \nYellen's final meeting as chair of the Federal Open Market Committee begins Tuesday and ends with its statement Wednesday at 2 p.m. Yellen's final day at the Fed is Friday. \n\"They're not going to raise rates this time around. They do want to at least confirm the market's expectations for a March rate hike,\" said Tom Simons, chief money market economist at Jefferies. \nYellen leaves the Federal Reserve after four years as chair, and in that time she began the slow process toward normalizing interest rates and shrinking the Fed's balance sheet. Viewed through most of her tenure as a dove, Yellen began the process of reversing extreme crisis-level policy. She had previously served as vice chair to her predecessor, Ben Bernanke, and was president of the San Francisco Fed prior to that. \nThe Fed is not expected to take any rate action this week, and the market has been primed for a March hike, as well as two others later in the year. That fits with the Fed's forecast for three interest rate increases this year. But that could change under the incoming chair, Jerome Powell, when forecasts and projections are released after the March meeting. Powell has been a Federal Reserve governor. \nEconomists expect few changes in the FOMC statement Wednesday, but the changes Fed officials could make might be significant for market expectations. \n\"I think if they were to put anything that was perceived as dovish into the statement they would be reducing that [March rate hike] probability. It's going to be a more bullish commentary about the economy and maybe include something on rising inflation expectations,\" said Simons. \nTo really sound hawkish, the Fed may need more proof. show chapters 4:37 PM ET Wed, 13 Dec 2017 | 04:40 \n\"I think they have to acknowledge strength of economy which has risks of more inflation than expected. They need more data to be explicitly hawkish,\" according to Diane Swonk, chief economist at Grant Thornton. Swonk, in an email, said the Fed should increasingly sound hawkish at upcoming meetings. \nJ.P. Morgan economists expect the Fed to describe the economy in an upbeat way and remove language from the statement that talked about post-hurricane disruptions. There is a risk that the Fed could add a hawkish addition to the statement by adding that \"easy financial conditions\" are supporting the growth picture. However, on inflation, they think it's less likely the Fed will make a change. \n\"The safe course would be to repeat the last statement that headline and core inflation on a 12-month basis declined earlier this year and remain below 2 percent. A less likely hawkish risk scenario is to note that inflation has picked up some in recent months, but continues to run below 2 percent,\" wrote J.P. Morgan chief U.S. economist Michael Feroli. \nThe bond market has already been signaling i t expects the Fed to sound more hawkish, and it is also reacting to the potential for other central banks to get more aggressive. Simons said the signs of inflation are building even though the Fed's preferred inflation measure, the PCE deflator, shows just a 1.5 percent annual rate. \n\"Commodities prices are rising,\" said Simons. He said Treasury Inflation Protection Securities also show inflation expectations at a four-year high. The prices in manufacturing and services sector data are high. \"I think there are signs of inflation rising.\" \nTreasurys sold off Monday, in part because Dutch central bank president Klaas Knot said the European Central Bank should end its asset-buying program, which it just recently cut in half. U.S. yields jumped with German bunds, and the 10-year Treasury yield temporarily reached a four-year high of 2.72 percent. There was also market chatter that the Fed could move more quickly than expected, based on potential inflation. \n\"Yellen leaves on a high note by making this meeting, as the Fed is further shrinking its balance sheet, with little to no ripple in financial markets,\" notes Swonk. \"She has navigated the crisis to the beginning of the end of crisis era policies. That is an extraordinary accomplishment given her short tenure.\" \nPowell, who is seen as supporting policy similar to Yellen's , is expected to continue the slow normalization process. \"The message of the Fed will be a steady easing up on the accelerator,\" said Swonk. WATCH: Yellen on her time at the Fed show chapters", "external_links": [], "published": "2018-01-30T01:41:00.000+02:00", "crawled": "2018-01-30T01:41:02.002+02:00", "highlightTitle": ""}