{"organizations": [], "uuid": "f4bf8ec40e7816b8d65b05c6c6317492e414c0fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/22/104959477-GettyImages-529084864.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/22/biotechs-20-billion-merger-monday-sparks-hope-for-more-deals.html", "country": "US", "domain_rank": 767, "title": "Biotech's $20 billion Merger Monday sparks hope for more deals", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.075, "site_type": "news", "published": "2018-01-22T20:59:00.000+02:00", "replies_count": 0, "uuid": "f4bf8ec40e7816b8d65b05c6c6317492e414c0fb"}, "author": "Meg Tirrell", "url": "https://www.cnbc.com/2018/01/22/biotechs-20-billion-merger-monday-sparks-hope-for-more-deals.html", "ord_in_thread": 0, "title": "Biotech's $20 billion Merger Monday sparks hope for more deals", "locations": [], "entities": {"persons": [{"name": "michael yee", "sentiment": "none"}, {"name": "olivier brandicourt", "sentiment": "none"}, {"name": "bioverativ", "sentiment": "none"}, {"name": "vincent isore", "sentiment": "none"}], "locations": [], "organizations": [{"name": "modern medicine biotech", "sentiment": "negative"}, {"name": "juno therapeutics", "sentiment": "none"}, {"name": "celgene", "sentiment": "none"}, {"name": "jefferies", "sentiment": "none"}, {"name": "biogen", "sentiment": "none"}, {"name": "sanofi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Modern Medicine Biotech's $20 billion Merger Monday sparks hope for more deals There were only 12 public deals in the biotech sector last year, for a total value of $50 billion. Three weeks into 2018, deal activity is already almost halfway to 2017's tally. A pickup in M&A activity is always a bull thesis for biotech investors. 3 Hours Ago | 02:10 \nThree weeks into 2018, deal activity in the biotech sector is already almost halfway to what it was in 2017, at least in terms of size. \nIn the early hours of Monday morning, French drug giant Sanofi said it would buy hemophilia drugmaker Bioverativ , a Biogen spinout that is less than a year old, for $11.6 billion. Hours later, cancer drugmaker Celgene announced a deal for its partner, Juno Therapeutics, for $9 billion. \nA pickup in M&A activity is always a bull thesis for biotech investors, especially after what Jefferies analyst Michael Yee called \"a relatively lackluster year for biopharma M&A\" in 2017. \nThere were only 12 public deals last year, for a total value of $50 billion, Yee wrote in a research note last week — and a large portion of that was made up of J&J's $30 billion purchase of Swiss biotech Actelion. \nSo: will deals, as biotech investors perennially hope, beget more deals? Biotech investors seem to think so, boosting the IBB biotech ETF by more than 2 percent Monday, and the XBI (in which both Bioverativ and Juno are among the heaviest-weighted stocks) by 3.5 percent. Cue the matchmaking. Who has the most cash? \nGilead , Amgen , Pfizer , Merck and Johnson & Johnson top out the list of biggest cash holders, according to Baird Research. The list breaks out overseas holdings versus cash in the U.S. — seen as important in light of the tax overhaul giving U.S. companies cheaper access to their overseas cash piles. \nThough Gilead acquired Kite Pharma last year for $11.9 billion, in the year's other major biotech deal, it's still got $41 billion, Baird points out, as does Amgen. Pfizer's cash, by Baird's tally, totals $24 billion, though the pharma giant has signaled it has much greater spending power than that. \nAs for targets? Today's deals fall neatly into the pattern of preferred biotech buys in recent years: companies that make medicines for cancer and rare diseases. \nRBC Capital Markets surveyed investors in December. Their top takeout picks: Clovis (cancer), Sage (neuroscience), Puma Biotechnology (cancer), Bluebird (rare diseases and cancer), and AveXis (rare diseases).", "external_links": [], "published": "2018-01-22T20:59:00.000+02:00", "crawled": "2018-01-22T20:59:19.010+02:00", "highlightTitle": ""}