{"organizations": [], "uuid": "b7e0614c6b02fba843b6c93ecc78a7a9ba82d365", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-essity-year-end-report-2017.html", "country": "US", "domain_rank": 767, "title": "Essity: Year-end Report 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T14:28:00.000+02:00", "replies_count": 0, "uuid": "b7e0614c6b02fba843b6c93ecc78a7a9ba82d365"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-essity-year-end-report-2017.html", "ord_in_thread": 0, "title": "Essity: Year-end Report 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "stockholm", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "bsn", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "STOCKHOLM, Jan. 25, 2018 /PRNewswire/ --\nJANUARY 1 – DECEMBER 31, 2017\n(compared with the corresponding period a year ago)\nNet sales increased 8.0% to SEK 109,265m (101,238) Operating profit before amortization of acquisition-related intangible assets (EBITA) rose 34% to SEK 12,550m (9,347) Adjusted operating profit before amortization of acquisition-related intangible assets (EBITA) rose 12% to SEK 13,405m (11,992) Adjusted EBITA margin increased 0.5 percentage points to 12.3% (11.8) Adjusted profit before tax rose 6% to SEK 11,663m (10,998) The US tax reform resulted in a positive non-recurring tax effect of SEK 550m for the fourth quarter and full-year 2017. The tax effect did not have any impact on cash flow. Profit for the period increased 107% to SEK 8,785m (4,242) Earnings per share increased 114% to SEK 11.56 (5.41[1]) Adjusted earnings per share increased 46% to SEK 13.09 (8.99[1]) Cash flow from current operations increased 2% to SEK 8,745m (8,563) The Board of Directors proposes a dividend of SEK 5.75 per share The acquisition of BSN medical was consolidated as of April 3, 2017. Since the acquisition date, BSN medical has impacted consolidated net sales by SEK 6,301m and adjusted EBITA by SEK 1,150m\n[1]Indicative earnings per share on the assumption that the number of issued shares in Essity as of December 31, 2016 corresponded to the number of issued shares in Essity on December 31, 2017 (702.3 million).\nSUMMARY OF THE FULL YEAR AND FOURTH QUARTER OF 2017\nThe Group's net sales for 2017 increased 8.0% compared with the preceding year. Organic sales increased 1.2%. The Group's adjusted EBITA for full-year 2017 rose 12%. Excluding currency translation effects and the acquisition of BSN medical, adjusted EBITA increased 1%. The Group's adjusted EBITA margin rose 0.5 percentage points to 12.3%. The adjusted return on capital employed was 14.9%.\nThe Board of Directors proposes a dividend of SEK 5.75 per share.\nThe Group's net sales for the fourth quarter of 2017 increased 7.1% compared with the corresponding period a year ago. Organic sales increased 1.8%, of which volume accounted for 0.8% and price/mix for 1.0%. In emerging markets, which represented 35% of net sales, organic sales rose 5.9%, while in mature markets organic sales declined 0.3%. Organic sales were negatively impacted by lower market growth due to such factors as price pressure and as a consequence of Essity's decision to discontinue certain underperforming market positions and contracts as part of the company's focus on profitable growth for increased value creation. During the quarter, five innovations were launched that strengthened Essity's customer and consumer offering.\nThe Group's adjusted EBITA in the fourth quarter of 2017 increased 13% compared with the corresponding period a year ago. Excluding currency translation effects and the acquisition of BSN medical, adjusted EBITA rose 3%. The increase was mainly the result of a better price/mix, higher volumes, cost savings and other measures to improve profitability. Higher raw material costs had a negative impact of SEK 713m. The Group's adjusted EBITA margin increased 0.7 percentage points to 12.6%. The adjusted return on capital employed was 14.4%.\nFor the fourth quarter of 2017, the acquired company BSN medical's organic sales rose by 2.4%. The adjusted EBITA margin for the acquired company was 18.4% and was negatively impacted by approximately 0.5 percentage points as a result of integration costs.\nFUTURE REPORTS\nEssity's 2017 Annual and Sustainability Report is scheduled for publication during the week beginning March 19, 2018.\nIn 2018, interim reports will be published on April 27, July 19 and October 26.\nANNUAL GENERAL MEETING\nThe Annual General Meeting for Essity will be held on April 12, 2018 at 15:00 CET at the Stockholm Waterfront Congress Centre in Stockholm, Sweden.\nINVITATION TO PRESS CONFERENCE ON YEAR-END REPORT 2017\nMedia and analysts are invited to a press conference, where this year-end report will be presented by Magnus Groth, President and CEO.\nTime: 13:00 CET, Thursday, January 25, 2018\nLocation: Essity's headquarters, Waterfront Building, Klarabergsviadukten 63, Stockholm, Sweden\nThe presentation will be webcast at www.essity.com . To participate, call: +44 (0) 145-254-10-03, +1 646-741-21-20 or +46-8-566-194-45. Specify \"Essity\" or conference ID no. 8239169.\nEssity Aktiebolag (publ)\nMagnus Groth\nPresident and CEO\nFor further information, please contact:\nFredrik Rystedt\nCFO and Executive Vice President\n+46-8-788-51-31\nJohan Karlsson\nVice President Investor Relations\nGroup Function Communications\n+46-8-788-51-30\nJoséphine Edwall-Björklund\nSenior Vice President\nGroup Function Communications\n+46-8-788-52-34\nMedia Relations\nGroup Function Communications\n+46-8-788-52-20\nNB:\nThis information is such information that Essity Aktiebolag (publ) is obligated to make public pursuant to the EU Market Abuse Regulation. This report has been prepared in both Swedish and English versions. In case of variations in the content between the two versions, the Swedish version shall govern. The information was submitted for publication, through the agency of the contact person set out below, at 12:00 noon CET on January 25, 2018. This interim report has not been reviewed by the company's auditors.\nKarl Stoltz\nMedia Relations Manager\n+46-8-788-51-55\nThis information was brought to you by Cision http://news.cision.com\nhttp://news.cision.com/essity/r/year-end-report-2017,c2438166\nThe following files are available for download:\nhttp://mb.cision.com/Main/15798/2438166/782134.pdf\nThe full report (PDF)\nView original content: http://www.prnewswire.com/news-releases/essity-year-end-report-2017-300588140.html\nSOURCE Essity", "external_links": ["http://news.cision.com/", "http://news.cision.com/essity/r/year-end-report-2017,c2438166", "http://www.prnewswire.com/news-releases/essity-year-end-report-2017-300588140.html", "http://www.essity.com/", "http://mb.cision.com/Main/15798/2438166/782134.pdf"], "published": "2018-01-25T14:28:00.000+02:00", "crawled": "2018-01-25T14:20:27.000+02:00", "highlightTitle": ""}