{"organizations": [], "uuid": "fae40cc9383ab16dccd083718406b8081e77e184", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180110.html", "section_title": "Archive News &amp; Video for Wednesday, 10 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/interserve-outlook/update-1-uks-interserve-sees-higher-2018-profit-outlook-on-lower-costs-idUSL4N1P52IX", "country": "US", "domain_rank": 408, "title": "UPDATE 2-UK's Interserve sees higher 2018 profit outlook on lower costs", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T15:41:00.000+02:00", "replies_count": 0, "uuid": "fae40cc9383ab16dccd083718406b8081e77e184"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/interserve-outlook/update-1-uks-interserve-sees-higher-2018-profit-outlook-on-lower-costs-idUSL4N1P52IX", "ord_in_thread": 0, "title": "UPDATE 2-UK's Interserve sees higher 2018 profit outlook on lower costs", "locations": [], "entities": {"persons": [{"name": "interserve", "sentiment": "none"}], "locations": [], "organizations": [{"name": "interserve", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "liberum", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds analyst’s comment, background, share movement)\nJan 10 (Reuters) - British construction and services company Interserve, which issued multiple profit warnings last year, on Wednesday forecast better-than-expected operating profit for 2018, sending its shares up as much as 20 percent.\nThe company, which exited the energy from waste business in 2016 after escalating costs, said it was making good progress with a three-year plan focused on boosting efficiency and improving its company-wide procurement processes.\nInterserve said it expects to save costs of at least 40 million pounds ($54.09 million) to 50 million pounds by 2020 from its efforts, with 2018 estimated to be 15 million pounds.\nThe company is reviewing its contract portfolio and non-trading balance sheet items, and said discussions with lenders over longer-term funding were progressing.\nAnalysts at Liberum said the company has too much debt but that it is manageable, adding that they expect the banks to be “forgiving”. The brokerage raised the price target on the stock to 180 pence from 150 pence.\nInterserve said it expects net debt to peak in the first half of 2018 due to costs and ongoing refinancing activity. It expects net debt at year-end 2017 to be about 513 million pounds.\nMany companies trying to generate energy from waste have been forced to make expensive design changes, escalating costs, and Interserve had to raise provisions to wind up loss-making contracts.\nIn other areas of construction and support services, groups such as Mitie, Capita and Carillion have also been hit over the past year by rising labour expenses and unplanned changes that have pushed up costs.\nA failure by some clients to renew or commission new contracts as they grapple with Brexit uncertainty has compounded the problem, prompting warnings from Interserve and its peers.\nCarillion said last week it will meet creditors on Wednesday as it seeks a financial rescue plan.\nInterserve shares were up 17 percent at 116.1 pence at 8:30 a.m. GMT.\n$1 = 0.7395 pounds Reporting by Arathy S Nair in Bengaluru; Editing by Bernard Orr\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-10T15:41:00.000+02:00", "crawled": "2018-01-11T12:26:38.025+02:00", "highlightTitle": ""}