{"organizations": [], "uuid": "d6571adfcc24632e7df94f7eb6970f4c24ff7e08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224006914&w=1200&r=LYNXMPEE0L033", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-tennis-ausopen-keys/tennis-american-keys-storms-into-last-eight-at-melbourne-park-idUSKBN1FB04Z", "country": "US", "domain_rank": 408, "title": "Tennis: American Keys storms into last eight at Melbourne Park", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T03:33:00.000+02:00", "replies_count": 0, "uuid": "d6571adfcc24632e7df94f7eb6970f4c24ff7e08"}, "author": "", "url": "https://www.reuters.com/article/us-tennis-ausopen-keys/tennis-american-keys-storms-into-last-eight-at-melbourne-park-idUSKBN1FB04Z", "ord_in_thread": 0, "title": "Tennis: American Keys storms into last eight at Melbourne Park", "locations": [], "entities": {"persons": [{"name": "angelique kerber", "sentiment": "none"}, {"name": "hsieh su-wei", "sentiment": "none"}, {"name": "rod laver arena", "sentiment": "none"}, {"name": "greg stutchbury", "sentiment": "none"}, {"name": "nick mulvenney", "sentiment": "none"}, {"name": "caroline garcia", "sentiment": "none"}], "locations": [{"name": "melbourne", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}, {"name": "taiwan", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}], "organizations": [{"name": "melbourne park reuters", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MELBOURNE (Reuters) - Madison Keys blew French eighth seed Caroline Garcia off the court 6-3 6-2 in a 68-minute display of power tennis to reach the quarter-finals of the Australian Open for the second time on Monday.\nThe 22-year-old, the sole surviving American in the women’s draw, gave up her first service game but rallied impressively to reach the last eight without giving up a set.\nThe 17th seed said her victory had been built on the back of learning when to go for her shots.\n”I‘m feeling really good,“ Keys told reporters. ”I feel like I‘m playing just solid, consistent tennis. I don’t think I played unbelievable. I just played really solid and smart.\n“I wasn’t going for unbelievable shots and things like that. I just was waiting for the right ball. Then trusting that I was going to make the right decision when I finally had the opportunity to go for it.”\nKeys sent down six aces and 20 winners in the opening set on Rod Laver Arena and maintained the onslaught to win the first four games of the second.\nA losing finalist at the U.S. Open last year and a semi-finalist in Melbourne in 2015, Keys wobbled a bit with the finishing line in sight.\nTennis - Australian Open - Rod Laver Arena, Melbourne, Australia, January 22, 2018. Caroline Garcia of France in action during her match against Madison Keys of the U.S. REUTERS/Issei Kato Garcia broke back for 4-2 but Keys was charged with confidence and rattled off the last two games, securing victory by getting down low to dig out a sublime crosscourt forehand winner.\nKeys feels the patience she displayed against Garcia will be even more important in her next match when she faces 2016 champion Angelique Kerber, the mobile German who she has beaten just once in seven meetings.\nSlideshow (5 Images) ”She’s always tough to play,“ Keys said. ”For me, it’s having to play aggressive but also consistently aggressive, because I know she’s going to make three more balls than other girls may be able to get to.\n“So it’s not feeling rushed and that I have to go for something crazy big on the first one and just really work the point.”\nHappy to back in the mix at a grand slam again, Keys said the humiliating 6-3 6-0 loss to compatriot Sloane Stephens in the Flushing Meadows final had taken some time to get over.\n”Pretty much the week to 10 days after was really tough,“ she said. ”I mean, my sleep schedule was totally messed up. I was just really tired from all the late, emotional matches that I had.\n“And then to have such a great two weeks and then have it end the way that it did, it was really devastating for me, so it definitely took some time to get over.”\nReporting by Nick Mulvenney in Sydney; Editing by John O'Brien\n ", "external_links": [], "published": "2018-01-22T03:33:00.000+02:00", "crawled": "2018-01-22T03:39:45.023+02:00", "highlightTitle": ""}