{"organizations": [], "uuid": "7c17728cdf90d033ba704dc82c9590f4076e431a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 8}, "facebook": {"likes": 72, "shares": 72, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/times-up-initiative.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/02/times-up-campaign-hollywood-revolutionary/", "country": "US", "domain_rank": 1196, "title": "Time's Up: Hollywood's Anti-Harassment Plan Is Revolutionary | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.969, "site_type": "news", "published": "2018-01-02T02:00:00.000+02:00", "replies_count": 0, "uuid": "7c17728cdf90d033ba704dc82c9590f4076e431a"}, "author": "Claire Zillman", "url": "http://fortune.com/2018/01/02/times-up-campaign-hollywood-revolutionary/", "ord_in_thread": 0, "title": "Time's Up: Hollywood's Anti-Harassment Plan Is Revolutionary | Fortune", "locations": [], "entities": {"persons": [{"name": "claire zillman", "sentiment": "negative"}, {"name": "america ferrera", "sentiment": "none"}, {"name": "reese witherspoon", "sentiment": "none"}, {"name": "eva longoria", "sentiment": "none"}, {"name": "shonda rhimes", "sentiment": "none"}], "locations": [{"name": "hollywood", "sentiment": "none"}], "organizations": [{"name": "hollywood", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Claire Zillman January 2, 2018 \nTime’s Up, the anti-harassment action plan unveiled by some of Hollywood’s most powerful women on Monday, stands out for a variety of reasons: the big names behind it (Reese Witherspoon, America Ferrera, Shonda Rhimes, Eva Longoria ), the big bucks backing it (its legal defense fund is $13 million), and its wide-reaching ambitions. Its agenda so far is a check-list of lofty goals made for the #MeToo moment: legal defense of sexual misconduct victims, new legislation to penalize companies with persistent harassment problems, a push for gender parity at Hollywood studios and talent agencies, and a show of solidarity—by way of black dresses—at the Golden Globes. \nBut arguably its most revolutionary aspect is its most basic: who it will serve. The initiative’s efforts are not reserved for the privileged few. \nWomen in Hollywood, relying on their public platform, are using the project to advocate for their own rights as well as for those of women in lower-profile lines of work, in part, by financially supporting their legal battles. \n“From movie sets to farm fields to boardrooms alike, we envision nationwide leadership that reflects the world in which we live,” Time’s Up’s website says . It helps answer some of the criticism that the #MeToo movement has focused too narrowly on women whose alleged abusers are powerful men, while overlooking the victims of the un-famous. \n“If this group of women can’t fight for a model for other women who don’t have as much power and privilege, then who can?” Rhimes told The New York Times . \nTime’s Up’s leaderless, all-encompassing approach suits the sweeping, industry-agnostic nature of the sexual harassment epidemic. Yet it’s unique since it comes at a time when initiatives aimed at bettering the working lives of women have not only lacked universality, but have effectively siloed women into two classes, haves and have-nots . \nThe most glaring example came in 2015, when Netflix introduced a shiny, new parental leave policy that gave new parents up to a year off. The policy—while generous by any measure—only applied to salaried employees in Netflix’s streaming business , creating tiers of employees at the company as it exempted hundreds of workers in other divisions. \nNetflix later upgraded the benefits of those left out of the initial parental leave policy , but not enough to match the perks enjoyed by salaried streaming employees. \nEver since Netflix was skewered for its original approach, some companies have been explicit in applying new benefits packages to all workers, regardless of their employment status. \nIn January 2016, Hilton introduced a new paid leave policy that applied to its hourly staff. Later in the year, yogurt company Chobani said it would offer a new paid family leave program to its 2,000 workers, including those on the factory floor. And in December 2016, Ikea rolled out a new program that treated salaried and hourly employees identically . \nEven with companies introducing their own policies more equitably, the benefits apply—of course—only to employees of such firms; the haves in this scenario, with everyone else becoming have-nots . That’s one of many downsides of the United States’ system of handling of such benefits at the employer level, rather than at the federal level, like all other industrialized economies. \nBut even outside the corporate sphere, there’s been criticism that pro-women efforts—especially those in the Trump era—have carved out classes. Organizers of the Women’s March on Washington last January were blasted for ignoring women of color and there was concern that only well-off women could afford to participate in the “Day Without a Woman” strike last March . \nConceiving of a initiative that appeals to all interested women is—clearly—no easy task. But Time’s Up, an unprecedented effort for an unprecedented time, seems especially dedicated to pulling it off. \n“We just reached this conclusion in our heads that, damn it, everything is possible,” Rhimes told the Times . “Why shouldn’t it be?” SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-02T02:00:00.000+02:00", "crawled": "2018-01-03T04:35:15.009+02:00", "highlightTitle": ""}