{"organizations": [], "uuid": "b431c459d415033b01c5e24c2b18495f896feed8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-cfn-media-exclusive-ceo-interview-ehave-connect-and-the-medical-marijuana-industry.html", "country": "US", "domain_rank": 767, "title": "CFN Media Exclusive CEO Interview: Ehave Connect and the Medical Marijuana Industry", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T17:00:00.000+02:00", "replies_count": 0, "uuid": "b431c459d415033b01c5e24c2b18495f896feed8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/globe-newswire-cfn-media-exclusive-ceo-interview-ehave-connect-and-the-medical-marijuana-industry.html", "ord_in_thread": 0, "title": "CFN Media Exclusive CEO Interview: Ehave Connect and the Medical Marijuana Industry", "locations": [], "entities": {"persons": [{"name": "ehave", "sentiment": "none"}, {"name": "prateek dwivedi", "sentiment": "none"}, {"name": "dwivedi", "sentiment": "none"}], "locations": [{"name": "seattle", "sentiment": "none"}, {"name": "wa", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}], "organizations": [{"name": "medical marijuana industry", "sentiment": "negative"}, {"name": "cfn", "sentiment": "negative"}, {"name": "cfn media group", "sentiment": "negative"}, {"name": "ehave inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SEATTLE, WA, Jan. 09, 2018 (GLOBE NEWSWIRE) -- CFN Media Group (\"CannabisFN\"), the leading creative agency and media network dedicated to legal cannabis, announces publication of an exclusive CEO interview and article discussing Ehave Inc. (OTCQB: EHVVF) and its proprietary patient management platform, currently in use in both the medical marijuana and mental health industries.\nIn the interview, CEO Prateek Dwivedi discusses the features and benefits of Ehave Connect, the company’s comprehensive software solution. Mr. Dwivedi also talks about the company’s partnership with MedReleaf, a major producer of medical marijuana in Canada, as well as Ehave’s plans for further penetration of the medical marijuana market.\nNew Concussions Assessment Tool\nEhave is focused on empowering the mental healthcare community with a next-generation of data-rich tools designed to improve patient management, diagnosis, and treatment. With between 1.6 million and 3.8 million sports-related concussions each year, mild traumatic brain injury represents a major problem in both amateur and professional sports. It’s estimated that up to half of concussions go unreported where they can cause lasting damage.\nThe company recently launched a new baseline concussion assessment tool on its Ehave Connect platform. The test records baseline concussion symptoms using validated cognitive assessments and, via the Ehave Core Platform, provides extensive information about the athlete’s history with concussions upon repeat assessment following acute injury. The goal is to track treatment progress and help guide return-to-sport strategies.\n“Mild traumatic brain injury, or concussion, is the most common type of traumatic brain injury and is part of the target group of mental and cognitive conditions that Ehave is currently focused on,” said Ehave CEO Prateek Dwivedi in a press release announcing the launch of the new tool. “Initially, we plan to focus marketing of our baseline concussion test on school boards and amateur sports leagues where the need is the greatest.”\nCannabinoid Treatment Options\nThe cannabis industry has demonstrated the potential to treat many mental disorders, including mild traumatic brain injury and post-traumatic stress disorder. On February 3, 2017 the company entered into an agreement with MedReleaf , a Canadian licensed producer of medical cannabis, to study the therapeutic uses of cannabis using the Ehave Connect platform. The digital intake patient platform launched in November and has already seen some early success.\n“Separately, Ehave is currently exploring Ehave Connect to manage treatment plans and track patient outcomes as part of a clinical trial to evaluate medical cannabis’ potential ability to provide relief to persons suffering from post-traumatic stress disorder,” said Mr. Dwivedi. “This use of our platform may be extended to mTBI, where early research has indicated the potential utility of cannabinoids in the treatment of both acute and chronic traumatic brain injury.”\nThe long-term goal is to collect clinical data to create a data-rich network of patient information that has the potential to validate and legitimize the medical cannabis segment of the health care industry. Without these gold standard clinical data points, the industry has struggled to gain acceptance among mainstream doctors, even after the drug has been legalized throughout Canada and in many U.S. states.\nLooking Ahead\nEhave Inc. (OTCQB: EHVVF) represents a compelling opportunity in the mental health care and cannabis industries. Over the coming years, management plans to form strategic alliances with additional licensed producers of medical cannabis and publishers of psychological assessments, as well as cultivate relationships with pharmaceutical and insurance companies that could be instrumental in deploying its technologies.\n“As we ramp up our capabilities in artificial intelligence and machine learning, we begin to demonstrate the true capabilities of the Ehave platform,” said CEO Prateek Dwivedi in a recent press release. “Our platform goes beyond our best-in-class data management system to provide mental health practitioners with supplemental diagnosis data based on scoring results of multiple gold standard psychological assessments.”\nPlease follow the link to see the interview and read the full article: http://www.cannabisfn.com/cfn-exclusive-ceo-interview-ehave-connect-medical-marijuana-industry/\nFor more information, visit the company’s website at www.ehave.com .\nAbout CFN Media\nCFN Media (CannabisFN) is the leading creative agency and media network dedicated to legal cannabis. We help marijuana businesses attract investors, customers (B2B, B2C), capital, and media visibility. Private and public marijuana companies and brands in the US and Canada rely on CFN Media to grow and succeed.\nLearn how to become a CFN Media client company, brand or entrepreneur: http://www.cannabisfn.com/featuredcompany\nDownload the CFN Media iOS mobile app to access the world of cannabis from the palm of your hand: https://itunes.apple.com/us/app/cannabisfn/id988009247?ls=1&mt=8\nOr visit our homepage and enter your mobile number under the Apple App Store logo to receive a download link text on your iPhone: http://www.cannabisfn.com\nDisclaimer:\nExcept for the historical information presented herein, matters discussed in this release contain forward-looking statements that are subject to certain risks and uncertainties that could cause actual results to differ materially from any future results, performance or achievements expressed or implied by such statements. Emerging Growth LLC, which owns CFN Media and CannabisFN.com , is not registered with any financial or securities regulatory authority, and does not provide nor claims to provide investment advice or recommendations to readers of this release. Emerging Growth LLC may from time to time have a position in the securities mentioned herein and may increase or decrease such positions without notice. For making specific investment decisions, readers should seek their own advice. Emerging Growth LLC may be compensated for its services in the form of cash-based compensation or equity securities in the companies it writes about, or a combination of the two. For full disclosure please visit: http://www.cannabisfn.com/legal-disclaimer/\nContact CFN Media Frank Lane 206-369-7050 flane@cannabisfn.com\nSource: CFN Media", "external_links": ["https://itunes.apple.com/us/app/cannabisfn/id988009247?ls=1&mt=8", "http://www.cannabisfn.com/legal-disclaimer/", "https://www.globenewswire.com/Tracker?data=Py8edJSXCxHtFXy0Lb9eZdxG_I9LfwOfjhTkpm1RoZ9colrH5HfLESVV-RHrZUhHt4vtJoe7GRyye7Ol8q5AcFo2hvGB9qA_jO6hABYvZ3g=", "https://www.globenewswire.com/Tracker?data=IHi-qjC_ta5ERwWKEtwFrPVIssIZU8dg3SVd524yR9WPpYH3OC6yzI2fnOCnVzQFLD5ts_SDxcKXD9yFXx3QCucJIlpxl4wfM81rPr-3Px08u5sBkJbfJSUTqB9WqiUWyHK8zkuoAr5d2Me17FemuHkjBll3TCB0dgypyl6T0Hz7KD3h6ouEklOMLN1XJ6CkR3iytVvqjEhiotKrDXMU14W9AkGwYEzEsbKUu_j6oVKqVlEoWHkcEVAyXcWWoNakSHTiIkmHXZHuTM1ZAormV9O0joAFJs9Xigi6L4xbCK4=", "http://www.cannabisfn.com/cfn-exclusive-ceo-interview-ehave-connect-medical-marijuana-industry/", "https://www.globenewswire.com/Tracker?data=IHi-qjC_ta5ERwWKEtwFrPVIssIZU8dg3SVd524yR9W0g6w73tTkE1P5y01QWftCGFV_nPQ9xBPhfsrxK0ba7c3TcikgPcXi9aoDFNp8ou9l2giafwSdflixUApTeZ6N", "https://www.globenewswire.com/Tracker?data=IHi-qjC_ta5ERwWKEtwFrPVIssIZU8dg3SVd524yR9Va8MfD-TWcbIQi4f0LS2OS7tF1-_xnw3wY_W4ah-uP8pyDX37uDLHmnrFdyb-dk948oi9AxJFsJ8wYhKK4B2xJ", "http://www.cannabisfn.com/featuredcompany", "https://www.globenewswire.com/Tracker?data=IHi-qjC_ta5ERwWKEtwFrPVIssIZU8dg3SVd524yR9UOc7T6htjqW2lHJTH-nXIwK9w8ptPiXluxLWhVZKVJHBwTgz8ZweWmyvXHA3T_yaQ=", "https://www.globenewswire.com/Tracker?data=gBmcSEHPuH0OK-k1m_9OU9D7RBzj5Vr_ZDBQf1txVtGA7phP8roPGBh9EF5rFjwb0_KOqeQu1gGL-IPPQk98mg==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/e55ff390-fb28-44ce-ba6d-810bc1cdafd3", "https://www.globenewswire.com/Tracker?data=qWAQmz0uGyUWVroB2cUkAHK4arIF6JEt-SgrzlAhUVb7GHeFw14svAtk0LObN9msTU8Cv6uUrUgQOfV31C5Y6A==", "https://www.globenewswire.com/Tracker?data=Py8edJSXCxHtFXy0Lb9eZUY0V1EpQbBirChFujWTWdDLmGnUNnN-nS5j6ZhSUN_eb_v0HAsUtL-LJoIHdrVYmQ==", "https://www.globenewswire.com/Tracker?data=jsxHwz0k9U6DiHG8aciekVNOGsOd5nmmDv55oCcf2NcFDLYUW2z2UahnmegGwu2vYtwQZeoSZSgs4pv3q_QHmDx5cCNGAQLLPYah9YuYiTZTse3vBswz1SFxiHIs_Za6QW5NVBys8wDymAjdU9QYDqhDWApLQhfscQDsU9ISmaA=", "https://www.globenewswire.com/Tracker?data=ZKEMql2ctpoGt2_Ns8UkPyduUossQnS5qIPUMGXu7ieT3PoqN4rvvLff_ULxJ-PGpx-nI2e9xY0mLXv0uhC_coJYa3OC_bkGUsGdJLrSosPZPYRgWR4JvSrL3O7KaoSo"], "published": "2018-01-09T17:00:00.000+02:00", "crawled": "2018-01-09T19:03:41.001+02:00", "highlightTitle": ""}