{"organizations": [], "uuid": "65c88bdf19a323269667624624b7665495336e9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180115&t=2&i=1222197307&w=1200&r=LYNXMPEE0E18T", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-airbus-orders-iran/iran-jetliner-deal-could-take-longer-to-complete-airbus-says-idUSKBN1F42B1", "country": "US", "domain_rank": 408, "title": "Iran jetliner deal could take longer to complete, Airbus says", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-15T19:22:00.000+02:00", "replies_count": 0, "uuid": "65c88bdf19a323269667624624b7665495336e9c"}, "author": "", "url": "https://www.reuters.com/article/us-airbus-orders-iran/iran-jetliner-deal-could-take-longer-to-complete-airbus-says-idUSKBN1F42B1", "ord_in_thread": 0, "title": "Iran jetliner deal could take longer to complete, Airbus says", "locations": [], "entities": {"persons": [{"name": "john leahy", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "tim hepher", "sentiment": "none"}], "locations": [{"name": "iran", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "airbus", "sentiment": "negative"}, {"name": "boeing", "sentiment": "none"}, {"name": "min read  paris", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "PARIS (Reuters) - The sales chief of European planemaker Airbus predicted Iran would take delivery of dozens of European jets it has ordered under a nuclear sanctions deal with major powers, but warned the transactions could take longer to complete than planned.\nU.S. President Donald Trump, who has strongly criticized the 2015 deal to lift a raft of sanctions in return for restrictions on Iran’s nuclear activities, urged European allies on Friday to help fix “disastrous flaws” in the pact or face a U.S. exit.\nEuropean planemaker Airbus and its U.S. rival Boeing have agreed to sell a combined total of 180 jets to renew the aging fleet of state carrier IranAir, but depend on U.S. support for the deal because of the number of U.S. parts in all their jets.\n“I think those deals will get fulfilled, maybe not on the original schedule,” Airbus sales chief John Leahy told Reuters in an interview, referring to the company’s agreement to sell 100 planes to IranAir.\n“We have to arrange financing; they have to understand about making pre-delivery payments,” he added.\nSo far IranAir has taken delivery of three Airbus jets and a handful of turboprops built by its Franco-Italian affiliate ATR.\nBankers say further business with Iran has been held up by the reluctance of Western financial institutions to deal with Tehran because of concerns that the nuclear deal could unravel or that they could fall foul of ongoing U.S. financial controls.\nPosting the vast majority of the 100 sales to Iran as firm orders allowed Airbus to beat Boeing in their annual race for new business in 2016. Airbus again won more orders in 2017.\nUNCERTAINTY Airbus has secured a batch of export licenses from the U.S. Treasury that expire around the start of the next decade, meaning it would need renewed permission to complete its planned deliveries to Iran, which are scheduled to stretch beyond 2020.\nThe number of deliveries covered by those existing licenses would shrink if schedules were delayed, industry sources say.\nDiplomats say the process of obtaining or renewing licenses has become slower amid uncertainty over U.S. policy on Iran.\nLeahy, who is due to retire later this month, indicated Airbus would be cautious about building jets for Iran without receiving deposit payments. Industry sources say Boeing has also held off building jets until it receives downpayments.\n“You have got to make pre-delivery payments where aircraft get into production, so we are doing it on perhaps a lower basis than we thought, but we still believe that it will work out,” Leahy said.\nIndustry sources say Iran has been forced by the lack of financing to pay cash via its central bank for the airplanes it has received already, and deals may be worked out allowing these payments to double as deposits for future aircraft deliveries.\nAirbus declined to comment on Trump’s latest declaration on Iran, but said it “continues to work with IranAir and the Iranian authorities on the execution of the purchase agreement signed last year in full compliance with the (nuclear deal) and other regulations”.\nBoeing, which has sold 80 planes to IranAir and committed to sell 30 more to another Iranian airline, Aseman Airlines, said it continued to follow the U.S. government’s lead. So far it has not included any of the Iranian sales in the way it accounts for unfilled orders.\n“We are aware of last Friday’s announcement and we are reviewing it to determine any impact it may have on our interactions with Iran’s commercial airlines,” a spokesman said.\n“As the government provides us details and guidance, we will adjust our activities if required.”\nAdditional reporting by Alexander Cornwell; Editing by Gareth Jones\n ", "external_links": [], "published": "2018-01-15T19:22:00.000+02:00", "crawled": "2018-01-15T19:38:45.033+02:00", "highlightTitle": ""}