{"organizations": [], "uuid": "629409dc053d43e6393a330e08cbf637226f51f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/12/apple-iphone-x-demand.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/18/apple-investment-goldman-loss-airbus-a380-ceo-daily-for-january-18-2018/", "country": "US", "domain_rank": 1196, "title": "Apple U.S. Investment, Airbus A380 Order: CEO Daily for January 18, 2018 | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.044, "site_type": "news", "published": "2018-01-18T02:00:00.000+02:00", "replies_count": 0, "uuid": "629409dc053d43e6393a330e08cbf637226f51f3"}, "author": "Alan Murray", "url": "http://fortune.com/2018/01/18/apple-investment-goldman-loss-airbus-a380-ceo-daily-for-january-18-2018/", "ord_in_thread": 0, "title": "Apple U.S. Investment, Airbus A380 Order: CEO Daily for January 18, 2018 | Fortune", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "john leahy", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "emirates", "sentiment": "none"}], "organizations": [{"name": "goldman sachs", "sentiment": "negative"}, {"name": "airbus", "sentiment": "negative"}, {"name": "apple u.s. investment", "sentiment": "negative"}, {"name": "fortune top news", "sentiment": "negative"}, {"name": "rescue  airbus", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Top News \nNo Pain, No Gain \nEarly on in Donald Trump’s presidency, investors deemed Goldman Sachs to be among the biggest winners . But those gains aren’t completely painlessly. On Wednesday, the banking giant recorded its first quarterly loss since 2011 due, in part, to a one-time $4.4 billion charge stemming from the tax bill Trump signed into law last month. Fortune \nFlying to the Rescue \nAirbus warned, just days ago, that production of its double-decker A380 may end without a new big order. “We are still talking to Emirates but quite honestly they are the only one that has the ability in the marketplace to take a minimum of six a year for a period of eight to 10 years,” Airbus’s top salesperson, John Leahy, said at the time. Emirates flew to the rescue today, ordering 20 of the planes in a $16 billion deal, with a retained option for 16 more. Fortune \nChina Goes Boom \nChina’s economy grew 6.8% in the fourth quarter of 2017, faster than expected, according to official data out today. It was spurred by a rebound in the industrial sector, a resilient property market and strong export growth. For all of 2017, the world’s second-largest economy grew 6.9% year-over-year, beating the government’s target of 6.5% and marking the first annual acceleration for the economy since 2010. Reuters \nA Second Look \nAfter facing pressure from U.K. lawmakers who were unsatisfied with its initial probe, Facebook is expanding its investigation into possible Russian interference ahead of the 2016 Brexit vote. The social network—along with Twitter—previously said it unearthed minimal use of its platform in Brexit as compared to the Russian misinformation campaign before the U.S. presidential election. In a letter to lawmakers on Wednesday, Facebook vowed to have a second look. Bloomberg Around the Water Cooler \nGrit Is the New MBA \nThe latest buzzword among hiring managers? Grit. In an effort to find job candidates whose accomplishments fall outside conventional rubrics, employers are placing added value on life experiences and personal qualities, like courage, resilience, and creative problem-solving. Ellen McGirt dives into the trend in Fortune’ s latest issue. Fortune \nA Tight Turnaround \nTwo years after the emissions scandal threatened to destroy Volkswagen, the German automaker is more profitable than before. Plus, it has a $25 billion plan for electric cars. The Financial Times examines what went so right with the company’s restructuring. Financial Times \nH&M’s Damage Control \nEarlier this month, H&M was slammed for advertising a black child model in a hoodie that read, “Coolest Monkey in the Jungle,” with celebrities and pundits panning the Swedish retailer as racist. H&M has now announced a new diversity manager, citing the hiring as proof that its commitment to inclusiveness is genuine. Fortune \nWhere Kmart Is King \nAs Kmart parent Sears Holdings continues to shutter stores and grapple with poor sales, a 100,000 square-foot Kmart in Guam is the chain’s unicorn. It is by far the retailer’s busiest, thanks to the island’s isolation and its proximity to Asia, which makes it a retail mecca for tourists seeking an authentic American shopping experience. Wall Street Journal \n\nThis edition of CEO Daily was edited by Claire Zillman . Find previous editions here , and sign up for other Fortune newsletters here . SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-18T02:00:00.000+02:00", "crawled": "2018-01-19T13:42:53.004+02:00", "highlightTitle": ""}