{"organizations": [], "uuid": "3822fff1bd2975217f2a20be04f6bf85f0a94b2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-israel-palestinians-un/israel-accuses-u-n-rights-forum-of-bias-over-palestinians-idUKKBN1FC15H", "country": "US", "domain_rank": 408, "title": "Israel accuses U.N. rights forum of bias over Palestinians", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T12:29:00.000+02:00", "replies_count": 0, "uuid": "3822fff1bd2975217f2a20be04f6bf85f0a94b2d"}, "author": "", "url": "https://uk.reuters.com/article/uk-israel-palestinians-un/israel-accuses-u-n-rights-forum-of-bias-over-palestinians-idUKKBN1FC15H", "ord_in_thread": 0, "title": "Israel accuses U.N. rights forum of bias over Palestinians", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "stephanie nebehay", "sentiment": "none"}, {"name": "aviva raz shechter", "sentiment": "none"}, {"name": "shechter", "sentiment": "none"}], "locations": [{"name": "israel", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "jerusalem", "sentiment": "none"}, {"name": "geneva", "sentiment": "none"}], "organizations": [{"name": "u.n.", "sentiment": "negative"}, {"name": "min read  geneva", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "human rights council", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 10:34 AM / Updated 27 minutes ago Israel accuses U.N. rights forum of bias over Palestinians Stephanie Nebehay 3 Min Read \nGENEVA (Reuters) - Israel accused the United Nations on Tuesday of continuous discrimination against it over its treatment of Palestinians and called for reforms of its human rights body. \nThe Human Rights Council’s regular examination of Israel’s record, the first since 2013, comes after U.S. President Donald Trump recognised Jerusalem last month as the capital of Israel, angering Palestinians, Middle East leaders and world powers. \nAviva Raz Shechter, Israel’s ambassador to the U.N. in Geneva, told the Human Rights Council that her country had always stood up for human rights and democratic values. \n“It has done so while facing serious threats to its security, and while needing to integrate diverse communities and religious groups,” Shechter told the Geneva forum. \nThe Council has taken a strong position against Israel’s occupation of territory seized in the 1967 Middle East war, its treatment of Palestinians there, and its building of Jewish settlements. \nIsrael withdrew soldiers and settlers from Gaza in 2005. Most countries consider the settlements, in areas of the West Bank and Jerusalem the Palestinians see as part of an eventual independent state, illegal, but Israel disputes this and continues their expansion. \nAn “unparalleled number of one-sided biased and political resolutions adopted regularly by the automatic majority of its members testify not only to the unfair treatment of the State of Israel, but also to the deficiencies of the Council itself and its agenda,” Schechter said. \n“...this theatre of the absurd cannot go on forever.” \nWashington says the Council is stacked with opponents of Israel and U.S. ambassador Niki Haley told the Council last June that it was reviewing its participation given what it sees as its “chronic anti-Israel bias”. \nIsrael considered its relations with the Palestinians to be “of the highest priority” and it would continue to seek a lasting solution that would enable the two peoples to live side by side in peace and security, she said. \nJordan’s diplomat Akram Harahsheh, speaking first in the three-hour debate, condemned what he said were “attempts to prejudge the identity of occupied Jerusalem” and called on Israel to withdraw from all territories occupied since 1967. Reporting by Stephanie Nebehay; editing by Ralph Boulton", "external_links": [], "published": "2018-01-23T12:29:00.000+02:00", "crawled": "2018-01-23T13:03:10.041+02:00", "highlightTitle": ""}