{"organizations": [], "uuid": "d0058e85ad51904d71cdc3b845a80d73619b75ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-zions-bancorporation-reports-fourth-quarter-financial-results.html", "country": "US", "domain_rank": 767, "title": "Zions Bancorporation Reports Fourth Quarter Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-01-23T00:30:00.000+02:00", "replies_count": 0, "uuid": "d0058e85ad51904d71cdc3b845a80d73619b75ea"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/pr-newswire-zions-bancorporation-reports-fourth-quarter-financial-results.html", "ord_in_thread": 0, "title": "Zions Bancorporation Reports Fourth Quarter Financial Results", "locations": [], "entities": {"persons": [{"name": "harris h. simmons", "sentiment": "none"}], "locations": [{"name": "salt lake city", "sentiment": "none"}], "organizations": [{"name": "zions bancorporation", "sentiment": "negative"}, {"name": "zions bancorporation reports fourth quarter financial results", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SALT LAKE CITY, Jan. 22, 2018 /PRNewswire/ -- Zions Bancorporation (NASDAQ: ZION) (\"Zions\" or \"the Company\") today reported net earnings applicable to common shareholders for the fourth quarter of 2017 of $114 million, or $0.54 per diluted common share, compared with net earnings applicable to common shareholders of $152 million, or $0.72 per diluted common share, for the third quarter of 2017 and net earnings applicable to common shareholders of $125 million, or $0.60 per diluted common share, for the fourth quarter of 2016.\nHarris H. Simmons, Chairman and CEO, commented, \"We are pleased with the results of both the quarter and the year. Fourth quarter earnings per share increased to $0.80, a 33% increase over the prior-year period, when adjusted for both the deferred tax asset revaluation and the larger charitable contribution expense, which were directly related to the passage of tax reform legislation. When adjusted for these items, the efficiency ratio improved materially to 59.8%, and the return on tangible common equity rose to 10.9%, up from 8.4% in the year-ago period.\" Mr. Simmons continued, \"We were pleased with loan growth over the year-ago period, which increased at a rate roughly double that of large domestic commercial banks. We've also seen strong improvement in credit quality, with classified loans and other measures of quality at their best levels in a number of years.\"\nMr. Simmons concluded, \"We are pleased to have achieved each of the financial goals we established in mid-2015, and we remain focused on building a culture of continuous improvement and operational excellence that will allow us to continue to produce profitable growth in the years ahead.\"\nFor the full version of the Company's 2017 fourth quarter earnings release, including financial tables, please visit zionsbancorporation.com .\nSupplemental Presentation and Conference Call\nZions has posted a supplemental presentation to its website, which will be used to discuss these fourth quarter results at 5:30 p.m. ET this afternoon (January 22, 2018). Media representatives, analysts, investors, and the public are invited to join this discussion by calling 253-237-1247 (domestic and international) and entering the passcode 5750193, or via on-demand webcast. A link to the webcast will be available on the Zions Bancorporation website at zionsbancorporation.com . The webcast of the conference call will also be archived and available for 30 days.\n2018 Investor Day\nOn March 1, 2018, Zions expects to host an investor day, including presentations from various members of Zions Bancorporation and affiliate managers. The event is expected to begin at 8:00 a.m. MST. Please contact Zions' investor relations for further details by emailing investor@zionsbancorp.com or calling 801-844-7637, extension 2.\nAbout Zions Bancorporation\nZions Bancorporation is one of the nation's premier financial services companies with total assets exceeding $65 billion. Zions operates under local management teams and distinct brands in 11 western states: Arizona, California, Colorado, Idaho, Nevada, New Mexico, Oregon, Texas, Utah, Washington and Wyoming. The company is a national leader in Small Business Administration lending and public finance advisory services. In addition, Zions is included in the S&P 500 and NASDAQ Financial 100 indices. Investor information and links to local banking brands can be accessed at zionsbancorporation.com .\nForward-Looking Information\nThis earnings release includes forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended, or the Exchange Act. Statements in the earnings release that are based on other than historical information or that express Zions Bancorporation's expectations regarding future events or determinations are forward-looking within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements reflect, among other things, our current expectations, all of which are subject to known and unknown risks, uncertainties and other factors that may cause our actual results, performance or achievements, market trends, industry results or regulatory outcomes to differ materially from those expressed or implied by such forward-looking statements.\nWithout limiting the foregoing, the words \"anticipates,\" \"believes,\" \"can,\" \"continue,\" \"could,\" \"estimates,\" \"expects,\" \"intends,\" \"may,\" \"might,\" \"plans,\" \"projects,\" \"should,\" \"would,\" \"targets,\" \"will\" and the negative thereof and similar words and expressions are intended to identify forward-looking statements. Forward-looking statements by their nature address matters that are, to different degrees, uncertain, such as statements about future financial and operating results, the potential timing or consummation of the proposed transaction described in the presentation and receipt of regulatory approvals or determinations, or the anticipated benefits thereof, including, without limitation, future financial and operating results. Actual results and outcomes may differ materially from those presented, either expressed or implied, in the presentation. Important risk factors that may cause such material differences include, but are not limited to, the actual amount and duration of declines in the price of oil and gas; Zions' ability to meet efficiency and noninterest expense goals; the rate of change of interest sensitive assets and liabilities relative to changes in benchmark interest rates; risks and uncertainties related to the ability to obtain shareholder and regulatory approvals or determinations, or the possibility that such approvals or determinations may be delayed; the imposition by regulators of conditions or requirements that are not favorable to Zions; the ability of Zions Bancorporation to achieve anticipated benefits from the consolidation and regulatory determinations; and legislative, regulatory and economic developments that may diminish or eliminate the anticipated benefits of the consolidation. These risks, as well as other factors, are discussed in Zions Bancorporation's most recent Annual Report on Form 10-K and Quarterly Report on Form 10-Q, filed with the Securities and Exchange Commission (SEC) and available at the SEC's Internet site ( https://www.sec.gov/ ), and other risks associated with the proposed transaction will be more fully discussed in the proxy statement that will be filed with the Securities and Exchange Commission in connection with the proposed transaction. ( http://www.sec.gov ).\nExcept as required by law, Zions Bancorporation specifically disclaims any obligation to update any factors or to publicly announce the result of revisions to any of the forward-looking statements included herein to reflect future events or developments.\nView original content: http://www.prnewswire.com/news-releases/zions-bancorporation-reports-fourth-quarter-financial-results-300586130.html\nSOURCE Zions Bancorporation", "external_links": ["https://www.sec.gov/", "http://www.sec.gov/", "http://www.prnewswire.com/news-releases/zions-bancorporation-reports-fourth-quarter-financial-results-300586130.html", "http://zionsbancorporation.com/"], "published": "2018-01-23T00:30:00.000+02:00", "crawled": "2018-01-23T02:15:42.018+02:00", "highlightTitle": ""}