{"organizations": [], "uuid": "368619346c2582c4b46866e877bd22c148ebf5d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224158815&w=1200&r=LYNXMPEE0L18S", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-britain-eu-lawmaking-explainer/explainer-britains-lords-sharpen-knives-for-eu-exit-laws-but-can-they-block-brexit-idUSKBN1FB1Q7", "country": "US", "domain_rank": 408, "title": "Explainer: Britain's Lords sharpen knives for EU exit laws, but can they block Brexit?", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T15:32:00.000+02:00", "replies_count": 0, "uuid": "368619346c2582c4b46866e877bd22c148ebf5d7"}, "author": "", "url": "https://www.reuters.com/article/us-britain-eu-lawmaking-explainer/explainer-britains-lords-sharpen-knives-for-eu-exit-laws-but-can-they-block-brexit-idUSKBN1FB1Q7", "ord_in_thread": 0, "title": "Explainer: Britain's Lords sharpen knives for EU exit laws, but can they block Brexit?", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "william james", "sentiment": "none"}, {"name": "bill", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "house of commons", "sentiment": "none"}, {"name": "house of lords", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 22, 2018 / 1:33 PM / Updated 37 minutes ago Explainer: Britain's Lords sharpen knives for EU exit laws, but can they block Brexit? William James 6 Min Read \nLONDON (Reuters) - Legislation to end Britain’s European Union membership begins months of debate in the upper house of parliament this month and is likely to be given a rough ride by largely pro-EU lawmakers. \nThe European Union (Withdrawal) Bill repeals the 1972 law that made Britain a member, and transfers EU laws into British ones. It was approved by 324 to 295 in the lower House of Commons on Jan. 17 and begins its journey through the House of Lords on Jan. 30. It is expected to take until the summer for it to become law. \nPrime Minister Theresa May’s Conservative Party does not have a majority in the unelected House of Lords, raising fears among Brexit supporters that the 2016 referendum decision to leave the EU could be thwarted. \nBut, although May’s government is expected to suffer defeats on some parts of the bill, lords are not expected to block Brexit outright, or indeed influence the final shape of the future relationship between Britain and the EU. \nHere’s why: \n1. What does the House of Lords do? \nThe House of Lords is a mix of political appointees, members who inherited their positions, and non-political experts on a range of topics. Members are referred to as ‘peers’. \nTheir primary functions are to hold government to account, revise and improve legislation, and consider public policy. \nThe Lords is secondary to the directly elected House of Commons in setting policy, and any changes it makes to legislation can be overruled. \nAs such, it would be extremely unusual for the Lords to agree an outright block on such a major policy as Brexit, particularly one backed by a referendum. The two main parties observe a convention that the Lords should not block policies in the manifesto of the ruling party. \n2. Why the fuss? \nShort of blocking Brexit, the Lords can change how Britain enacts its EU exit by adding caveats and restricting the government’s powers. It could also inflict politically embarrassing defeats on the government. \nMay’s Conservatives have 248 representatives in the 794-member chamber. The next two biggest parties, Labour and the Liberal Democrats, have 197 and 100. The rest do not follow party voting instructions. \nThis means the government is outnumbered and must pacify opponents or win over non-political peers, known as crossbenchers, to defeat attempts to change the legislation. \nGiven the anti-Brexit leaning of many peers, and concerns in that the legislation gives ministers unconstitutional powers, the government is expected to suffer several defeats on aspects of the bill. \n3. What could change? \nObjections raised in the Lords will be either political or constitutional. FILE PHOTO: Members of the House of Lords listen to Britain's Queen Elizabeth deliver the Queen's Speech, during the State Opening of Parliament in central London, on May 18, 2016. REUTERS/Justin Tallis/Pool/File Photo \nPolitically, the Liberal Democrats are expected to fight for a second referendum to approve the terms of any exit deal and for Britain to remain in the EU’s single market. Without Labour’s backing, which it does not currently have, these attempts are likely to fail. \nLabour wants to ensure the legislation protects EU-derived workers’ rights and incorporates the EU’s Charter of Fundamental Rights. This position is likely to command enough support to either force the government to make concessions or face defeat. \nThere is expected to be widespread opposition, even among some Conservative peers, to the government’s attempt to fix the date of Brexit in law as March 29, 2019. The move is widely seen as unnecessarily binding and may be cut from the final draft. \nConstitutional objections are similarly likely to give the government a headache. Several crossbench legal experts in the Lords have expressed concerns about the way the government proposes to transfer EU law into British law. They say the bill gives ministers powers that are too sweeping. \nThere is also concern about how the government wants to redistribute legal powers reclaimed from Brussels to devolved administrations in Scotland, Wales and Northern Ireland. \nLabour, the Liberal Democrats and the crossbenchers will likely join forces on these issues. \n4. What does it mean for Brexit? \nPolitically, a series of defeats for May’s party would embolden critics of her leadership, but as long as the legislation isn’t blocked outright the Lords is an unlikely trigger for a move against her. \nBarring a major change of policy from the Labour Party, the legislation enacting Brexit will eventually pass. \nBut, changes made in the Lords could mean there are additional checks and balances on the transfer of EU laws. \nThe government has agreed to extra scrutiny by parliament, but says the timetable is tight. \nChanges regarding the protection of human rights and workers’ rights will be resisted, but the government may need to make further concessions. \n5. Who should we watch? \nMARTIN CALLANAN - May’s Brexit man in the Lords. Former MEP and a Brexit campaigner, Callanan will lead the legislation through the house. \nANDREW ADONIS - An outspoken Labour minister-turned-peer who wants to stop Brexit. A fierce critic of the government, Adonis is expected to be the rallying point for peers who want to derail the exit legislation. However, he does not set policy for Labour and is unlikely to be backed by the party. \nIGOR JUDGE and DAVID PANNICK - Two crossbenchers with legal backgrounds who will lead on constitutional issues. Both have expressed concern about technical elements of the bill and the powers it creates. They will influence crossbench floating voters. \nANGELA SMITH - Labour’s leader in the Lords. Any attempt to defeat the government will likely need Labour endorsement. If Smith and her ministers don’t back a proposed change by instructing Labour peers to vote for it, the amendment will likely fail. Reporting by William James; editing by Giles Elgood", "external_links": [], "published": "2018-01-22T15:32:00.000+02:00", "crawled": "2018-01-22T15:50:13.006+02:00", "highlightTitle": ""}