{"organizations": [], "uuid": "20f86c4c219291d22492cfdf80dd8f4dda1eabaa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/france-benelux-markets/french-and-benelux-stocks-factors-to-watch-on-jan-10-idUSL8N1P465S", "country": "US", "domain_rank": 408, "title": "French and Benelux stocks-Factors to watch on Jan 10", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T07:51:00.000+02:00", "replies_count": 0, "uuid": "20f86c4c219291d22492cfdf80dd8f4dda1eabaa"}, "author": "", "url": "https://www.reuters.com/article/france-benelux-markets/french-and-benelux-stocks-factors-to-watch-on-jan-10-idUSL8N1P465S", "ord_in_thread": 0, "title": "French and Benelux stocks-Factors to watch on Jan 10", "locations": [], "entities": {"persons": [{"name": "emmanuel macron", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "france", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "neutral"}, {"name": "airbus", "sentiment": "none"}, {"name": "airbus", "sentiment": "none"}, {"name": "boeing co", "sentiment": "none"}, {"name": "china aerospace science and technology corporation", "sentiment": "none"}, {"name": "adp  boeing co", "sentiment": "none"}, {"name": "dassault systemes  dassault systemes", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 10 (Reuters) - Below are company-related news and stories from French and Benelux media which could have an impact on the region’s markets or individual stocks.\nFrench CAC futures were flat at 0705 GMT.\nAIRBUS: The Chinese order for 184 Airbus A320 aircraft that French President Emmanuel Macron said would be finalised soon are new purchases that have not yet been publicly announced, a French presidency official said on Wednesday.\nBoeing Co said on Tuesday it delivered an industry-record 763 jetliners in 2017, likely beating European rival Airbus SE to retain the title of world’s biggest plane maker.\nAIR FRANCE / ADP Boeing Co said on Tuesday it expects the number of passengers carried by worldwide airlines to increase 5.5 percent to 6 percent this year, faster than historic levels of about 5 percent, but slower than the growth logged in 2017.\nDASSAULT SYSTEMES Dassault Systemes said on Tuesday it had signed a strategic cooperation agreement with China Aerospace Science and Technology Corporation.\nDERICHEBOURG CFER, financial holding of the Derichebourg family announced on Tuesday the launch of a disposal of up to 16,387,878 shares, representing 10% of Derichebourg share capital, by way of an accelerated bookbuilt private placement.\nGECI INTERNATIONAL Geci International said on Tuesday it had signed a strategic cooperation agreement with Triplecyber in the domain of cybersecurity.\nINGENICO Ingenico announced on Tuesday it partnered with Navya to equip their autonomous taxis.\nINTERPARFUMS: France’s Interparfums raised on Wednesday its 2017 revenue guidance after a strong end to the year and a better-than-expected response to its men’s fragrance Coach.\nJCDECAUX JCDecaux said on Tuesday it had won a new 15-year contract with the city of Berlin for back-lit and digital advertising street furniture.\nORANGE Orange said on Tuesday it issued a 12-year 1.375% 1 billion euro ($1.19 billion) bond.\nPSA: Groupe PSA has tied up with India’s Tata Consultancy Services on smart cars, the Economic Times reported.\nRENAULT: The Renault-Nissan-Mitsubishi alliance said it is setting up a venture capital fund that plans to invest as much as $1 billion over five years, the latest move by major carmakers as they seek to adapt to rapid industry change by investing in startups.\nSAFRAN The contracts for the sale of engines produced by CFM, a JV between Safran and General Electric, signed on Tuesday in China represent “several billions”, said a source at the French presidency without specifying if the number was in dollars or euros.\nVIVARTE: French online shoe and fashion retailer Spartoo has entered exclusive negotiations to buy rival shoe brand Andre from debt-laden clothing retailer Vivarte, the company said on Tuesday.\nPan-European market data: European Equities speed guide FTSE Eurotop 300 index DJ STOXX index Top 10 STOXX sectors Top 10 EUROSTOXX sectors Top 10 Eurotop 300 sectors Top 25 European pct gainers Top 25 European pct losers Main stock markets: Dow Jones Wall Street report Nikkei 225 Tokyo report FTSE 100 London report Xetra DAX Frankfurt items CAC-40 Paris items World Indices Reuters survey of world bourse outlook European Asset Allocation Reuters News at a glance: Top News Equities Main oil report Main currency report ($1 = 0.8380 euros)\n ", "external_links": [], "published": "2018-01-10T07:51:00.000+02:00", "crawled": "2018-01-10T08:01:35.000+02:00", "highlightTitle": ""}