{"organizations": [], "uuid": "b6671e9ae36c99a81b52d1297c0864714c82516f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/12/gettyimages-633005148.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/05/ripple-ceo-brad-garlinghouse-cryptocurrency-xrp/", "country": "US", "domain_rank": 1196, "title": "Ripple CEO Brad Garlinghouse Lambasts Cryptocurrency Critics | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T02:00:00.000+02:00", "replies_count": 0, "uuid": "b6671e9ae36c99a81b52d1297c0864714c82516f"}, "author": "Jeff John Roberts", "url": "http://fortune.com/2018/01/05/ripple-ceo-brad-garlinghouse-cryptocurrency-xrp/", "ord_in_thread": 0, "title": "Ripple CEO Brad Garlinghouse Lambasts Cryptocurrency Critics | Fortune", "locations": [], "entities": {"persons": [{"name": "brad garlinghouse", "sentiment": "negative"}, {"name": "jeff john roberts", "sentiment": "none"}, {"name": "popper", "sentiment": "none"}, {"name": "david paul morris", "sentiment": "none"}, {"name": "nate popper", "sentiment": "none"}], "locations": [], "organizations": [{"name": "labs inc", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ripple CEO Fires Back at Cryptocurrency Critics Brad Garlinghouse, chief executive officer of Ripple Labs Inc. David Paul Morris—Bloomberg via Getty Images By Jeff John Roberts January 5, 2018 \nA simmering feud over Ripple, which in recent days has become the second most valuable digital currency after bitcoin, boiled over Thursday evening in bitter Twitter exchange involving the company’s CEO Brad Garlinghouse. \nThe fight erupted after Nate Popper, a New York Times journalist and author of a popular book on bitcoin, suggested that Ripple’s currency (technically known as XRP) is simply a tool for speculation and has little purpose in the real world. \nPopper backed this up by claiming that bankers are not using XRP—a damning assertion, if true, since Ripple contends banks are embracing its currency as part of a larger shift away from the legacy money transfer system known as SWIFT. Here’s what Popper said: Over the last day I’ve asked several people close to banks if banks are indeed planning to begin using Ripple’s token, XRP, in a serious way, which is what investors seem to assume when they buy in at the current XRP prices. This is a sampling of what I heard back: pic.twitter.com/zbfMqg4TpD \n— Nathaniel Popper (@nathanielpopper) January 5, 2018 \nGarlinghouse pounced in response, claiming that Popper had his facts wrong and listing a series of alleged rebuttals from others in the banking industry. He also accused Popper of journalistic malpractice by failing to speak to available sources who would allegedly have disproved his assertions: Over the last few months I’ve spoken with ACTUAL banks and payment providers. They are indeed planning to use xRapid (our XRP liquidity product) in a serious way. This is a sampling of what I heard: pic.twitter.com/y3TN8YRC34 \n— Brad Garlinghouse (@bgarlinghouse) January 5, 2018 then why did you tweet this without doing the 2 interviews we arranged for you!!? You have those names. \nI don’t think you want to hear validation for XRP. The @NYTimes should be above spreading anonymous FUD. Do those calls and update your story. \n— Brad Garlinghouse (@bgarlinghouse) January 5, 2018 \n[ Update: Popper replied on Friday , explaining he had not initially been able to reach the Ripple sources but has since done so]. \nUnsurprisingly, the rough-and-tumble world of crypto Twitter quickly piled on with a series of taunts and schoolyards GIFs aimed at Popper from Ripple partisans: NY times @nytimes : Hey Nathan, did you research and follow up with those leads for your @Ripple article, it's due in an hour \nNathan @nathanielpopper : Yeah for sure, calling them now pic.twitter.com/youuy8Gmdh \n— Lord Crypto (@Lord_of_Crypto) January 5, 2018 \nMeanwhile, Ripple’s product manager for XRP also shot back at Popper, claiming that the company is about more than its blockchain software, which banks are using to record transactions: Do you think I left #Bitcoin and joined @Ripple to build bank software? Think again. $XRP https://t.co/v9fwoTcOi6 \n— Warren Paul Anderson (@warpaul) January 5, 2018 \nNot everyone sided with Ripple, though. A Twitter user in Canada responded by asking Garlinghouse to provide evidence, using the public blockchain ledger where XRP transactions are recorded, that banks are indeed using the currency. Where are these transactions on your ledger? Can you point us to a single bank transaction on XRP? A URL is all we need. \nOr are you going to continue to make forward looking statements while retail investors buy your unregistered security product? \n— Moe 🇨🇦 (@moeadham) January 5, 2018 \nThe brouhaha on Twitter comes at a time of intense interest in Ripple and XRP, which has soared exponentially in recent weeks and made the company’s co-founders one of the world’s richest men . \nThe controversy over XRP may also stem in part from a lack of familiarity, including among some in the cryptocurrency world, about the company and its products. \nUnlike digital currencies like bitcoin and Ethereum, Ripple’s XRPs are not mined by a decentralized network of computers, but were instead created in a single 100 billion batch by the company—a situation that has long engendered mistrust and contempt from longtime bitcoin backers. \nCurrently, there are around 40 billion XRP in circulation while Ripple has placed most of the rest in escrow and is releasing them in slow increments. \nIn an interview with Fortune last October , Garlinghouse said Ripple has provided some XRPs to hedge funds at a discount in order to increase overall liquidity in the currency. Meanwhile, the company has also licensed its blockchain technology to credit card giant American Express (axp) . \nAs for its relationship with banks—more than a hundred of which have signed on to use Ripple’s software products—it remains unclear to what extent these partnerships will involve the use of XRP. \nGarlinghouse argues that XRP will be an integral part of the money transfer and market making process, while skeptics question whether the use of XRP is a superfluous and unnecessary step. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-05T02:00:00.000+02:00", "crawled": "2018-01-06T05:00:37.017+02:00", "highlightTitle": ""}