{"organizations": [], "uuid": "375aedc06df380013401e6c107721564524480f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/26/cnbc-interview-with-irelands-finance-minister-paschal-donohoe-from-the-world-economic-forum-2018.html", "country": "US", "domain_rank": 767, "title": "CNBC Interview with Ireland’s Finance Minister, Paschal Donohoe from the World Economic Forum 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T11:05:00.000+02:00", "replies_count": 0, "uuid": "375aedc06df380013401e6c107721564524480f7"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/26/cnbc-interview-with-irelands-finance-minister-paschal-donohoe-from-the-world-economic-forum-2018.html", "ord_in_thread": 0, "title": "CNBC Interview with Ireland’s Finance Minister, Paschal Donohoe from the World Economic Forum 2018", "locations": [], "entities": {"persons": [{"name": "paschal donohoe", "sentiment": "negative"}, {"name": "pierre moscovici", "sentiment": "negative"}, {"name": "davos", "sentiment": "none"}, {"name": "steve sedgwick", "sentiment": "none"}, {"name": "geoff cutmore", "sentiment": "none"}], "locations": [{"name": "ireland", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "cnbc interview", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "negative"}, {"name": "financial affairs", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Following are excerpts from a CNBC interview with Pierre Moscovici, EU Commissioner for Economic and Financial Affairs and CNBC's Steve Sedgwick and Geoff Cutmore from the World Economic Forum 2018.\nSS: Wouldn't it be nice if we could find someone, who's in a senior position, who's never done Davos before, who can just say what he really thinks of it?\nGC: Yeah.\nPD: Yes-,\nSS: Paschal Donohoe is that person!\nPD: [Laughter].\nSS: Finance Minister of Ireland. Your first Davos?\nPD: It is indeed.\nSS: Well, congratulations.\nPD: Yes, so-, having a very good, a very positive week.\nSS: Well, that's-, that was my question. Are you cynical about Davos? Or does it actually mean something?\nPD: No, I think-, well, what it offers governments and companies is the opportunity to meet many investors, and colleagues, very productively and very quickly.\nSS: Mm.\nPD: So, for that alone, I think it's been a very, very useful week. I am struck by the tone that is here, there is a tone that is generally upbeat, there's a tone that believes that many of the political difficulties, particularly, of last year, perhaps have allayed within Europe, and that is reflated in to the tone that people have, as they look forward to the future.\nSS: Mm. For me, Ireland sums up a lot of the thematic here. Because you were called, from the outside, a poster boy of recovery. You got your debt to GDD down aggressively, you got your unemployment down aggressively, as well. Your NTMA is just cock-a-hoop, at actually getting, you know, 1% money, rather than 14% ten-year yield at the peak of the crisis. But-, but-, from the outside everything looked great, but then the Taoiseach, Mr. Kenny, lost an election, pretty much, or lost his majority, because Ireland didn't feel it. Because there were water taxes. The Irish people just did not feel the recovery as well. So, you know, your government, and Mr. Varadkar's government, as well, has a different task, doesn't it?\nPD: Yes, I think that's a very-, very fair analysis of what actually happened within our own country, and I think it is reflective of many of the challenges, now, that Europe faces, in that there was a topline recovery in the numbers. You know, we could talk about what was happening with the deficit, we could talk about what was happening with debt. But, of course, we all know that a crisis can feed through, with horrific speed, to people's daily lives, but any kind of a recovery or change takes so much longer. And what we are seeing happening now in Ireland is we're gradually seeing an improvement, in terms of the growth is now spread across our entire country, across more parts of our economy. But, that being said, we still have so much more we need to do. We have to ensure that the changing economy makes a big difference to people's lives, we have to ensure that we have stable foundations for the future, and then, politicians of the center, like myself, have to really get the fact that a recovery in the economy isn't the same thing as a healed society, and we have to understand the gap, and rise to that challenge. And, you know, Professor Stiglitz, who I debated with yesterday on a number of different matters, you know, wrote a book called Globalization and its Discontents-,\nSS: I've read it myself.\nPD: And maybe, you know, the discontent bit, we have to reflect a lot more on-,\nSS: Mm. Yes.\nPD: And see how we respond back to that, which we're trying to do.\nSS: The only problem for Joe is, he wrote it 20 years before Piketty, and I think he's a bit peeved that Piketty gets all the credit-,\n[Laughter].\nPD: I-, I did say to him, I said, 'Are you more happy or less happy that many of your prophecies came true?'\n[Laughter].\nGC: Can I just move you quickly on to Brexit, and the benefits, or otherwise, for Ireland here? Because the-, the Chancellor, yesterday, I thought, made a pretty clear case that they are on their game, as far as the financial services regulation is concerned, and without a deal on that, there is no broader deal with Brussels. And I think Brussels is also starting to become aware of what the potential risks are. But all of this means, doesn't it, that Ireland doesn't get that Brexit bump, the windfall of bankers moving their jobs to Dublin?\nPD: Well, we've already received and seen an increased investment and employment moving in to financial services in Ireland. We have seen, for example, very significant addition-,\nGC: Mm. But not in the numbers you were hoping for.\nPD: We were always very clear that any benefit that would come from it would happen in a gradual way. I think it was unrealistic and inaccurate to claim we were going to see banks closing down, leaving the city of London, we've seen companies like JP Morgan, like Bank of America, make very big and positive decisions about Dublin. So, we are seeing a-, a positive change, as a result of that, but this is all in the broader context that Brexit will be a challenge for Ireland. You know, we've made the decision to already change our growth forecast for the future, so we're now looking and aiming to deliver growth of approximately 3% across the coming years, and we've downgraded that to take account of the fact of what we think Brexit could create, so we can plan for a more sustainable policy base for our country for the coming years.\nGC: Mm.\nSS: I was just going to say, on the Brexit, how do you think it's going? I think, from a British point of view, and let's say I'm politically agnostic on this one, as well, I think it's going pretty badly, as well. I don't think we've resolved the border issue, even though people say they have, because I don't think the jurisdiction of the EU within Northern Ireland, and hence what's going on across the Irish Sea, has been successfully resolved-,\nPD: We-, I believe, and would contend very differently, that the progress that was made in phase one of the negotiations, in relation to an agreement about how to prevent the development of a hard border, particularly in light of different contingencies and events-,\nSS: Right.\nPD: Was a really important agreement. We know, and we expect, the UK will honor it, I believe they're approaching this with very good faith, in terms of how to do it-,\nSS: Paschal, I don't see how this works. You either have EU rules, that work across the border, and, again, no one wants to see a return to the hard border, we all remember the bad times, as well-,\nPD: Yes.\nSS: Or, they stop at the Irish Sea, or the British say, 'Actually, no, we have no EU legislation, or regulation, within the United Kingdom.' I don't understand that that's been resolved-,\nPD: Indeed, and that kind of complexity will be at the heart of the negotiation, as we move-,\nSS: So it hasn't been agreed yet, has it, Paschal.\nPD: In to the phase two, and the key principle that was recognized in that text was the principle of alignment of regulations, if a number of different developments were to take place. So, what we have said is that, when, and if, the EU and the UK reach an agreement, in relation to the future of trade, that could form a framework for dealing with many of the difficulties that you're right to raise. But we've also said that, if that doesn't happen, the UK have recognized the role of alignment of standards with the Customs Union and the Single Market, to ensure we can have the kind of movement on our island that is critical, to ensuring a hard border does not return.\nGC: Just very briefly, before we let you go, we must bring up the issue of tax. We saw the Taoiseach in the European Parliament, pushing back a little bit at the criticism that you've received from the French, and others, for your current tax rate. Given that Mr. Macron came here, and actually started talking a lot about cutting taxes in France, do you think the mood music might actually be shifting here, and, god forbid, there might even be room to reduce taxes even further in Ireland?\nPD: Well, competitiveness is not just a prerogative of larger countries. Small, open economies are entitled to take\nchoices to ensure we're competitive, and create jobs, we've 2 million people that work in Ireland, and corporate tax certainty is part of our competitive proposition, but not all of it, but it's a very, very important part.\nGC: Mm.\nPD: In terms of future changes in Irish corporate tax policy, there will be no change in the rate. It's 12.5%, it will neither go up, nor go down. We have a flat, stable rate, which is low across a very large base of economic activity, and we will continue to protect and maintain that while making the changes that we know-, we know need to be made.\nGC: This sounds like a pre-prepared statement, if you don't mind me saying so. Do you think Donald Trump has changed the conversation around tax in Europe?\nPD: Well, it has the virtue of being a pre-prepared statement, because I believe it, and it is at the core of how we handle and create a positive international environment in Ireland with investors and employers. To directly answer your second question, do I believe the mood is changing regarding corporate tax globally? The answer to that question is yes. You have to look at what President Trump has done. You have to look at the stated intentions of the UK. You have to look at what President Macron said, earlier on in the week. But, amidst that kind of change, what we are very clear on is that certainty regarding our rate is a core part of our proposition, and we are now phasing out the Double-Irish, and we eliminated stateless companies from our tax code in 2013, and we have brought in mandatory disclosure of information regarding tax planning in our jurisdiction, and we're one of the first countries now to have exchange of information between the tax authorities across the European Union-,\nGC: Paschal-,\nPD: So, we'll make those changes, while maintaining the rate.\nGC: Minister, thank you so much for being with us.\nPD: Thanks for having me on.\nSS: Paschal, nice to meet you, sir.\nPD: You too. Thanks very much.\nGC: Paschal Donohoe, the Finance Minister of Ireland, and we look forward to-, to meeting up again next time.\nPD: I look forward to that, too.\nENDS", "external_links": [], "published": "2018-01-26T11:05:00.000+02:00", "crawled": "2018-01-26T12:37:33.013+02:00", "highlightTitle": ""}