{"organizations": [], "uuid": "f8ae2900cc4b83894514a909ce99d31bd64f9f4a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 7}, "facebook": {"likes": 27, "shares": 27, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/04/26/104428382-GettyImages-481182593.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/11/us-producer-price-index-dec-2017.html", "country": "US", "domain_rank": 767, "title": "US producer prices fall for first time in nearly 1½ years", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.023, "site_type": "news", "published": "2018-01-11T15:30:00.000+02:00", "replies_count": 0, "uuid": "f8ae2900cc4b83894514a909ce99d31bd64f9f4a"}, "author": "Ty Wright", "url": "https://www.cnbc.com/2018/01/11/us-producer-price-index-dec-2017.html", "ord_in_thread": 0, "title": "US producer prices fall for first time in nearly 1½ years", "locations": [], "entities": {"persons": [{"name": "ty wright", "sentiment": "negative"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "lima", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "labor department", "sentiment": "none"}, {"name": "ppi", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "ford motor co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "US producer prices fall for first time in nearly 1½ years Published 5 Hours Ago SHARES Ty Wright | Bloomberg | Getty Images An employee works on the assembly line installing parts on the Duratech 35 V6 engine at the Ford Motor Co. Engine Plant in Lima, Ohio. \nU.S. producer prices fell for the first time in nearly 1-1/2 years in December amid declining costs for services. \nThe Labor Department said on Thursday its producer price index for final demand slipped 0.1 percent last month. That was the first drop in the PPI since August 2016 and followed two straight monthly increases of 0.4 percent. \nIn the 12 months through December, the PPI rose 2.6 percent after accelerating 3.1 percent in November. Economists polled by Reuters had forecast the PPI rising 0.2 percent last month and increasing 3.0 percent from a year ago. \nThe PPI increased 2.6 percent in 2017 after advancing 1.7 percent in 2016. A key gauge of underlying producer price pressures that excludes food, energy and trade services edged up 0.1 percent last month. \nThe so-called core PPI increased 0.4 percent in November. It rose 2.3 percent in the 12 months through December. The core PPI increased 2.4 percent in the 12 months through November. It gained 2.3 percent in 2017 after rising 1.8 percent in 2016. \nComing on the heels of a report on Wednesday showing a sharp moderation in import prices in December, the weak PPI report might temper expectations that inflation will accelerate this year even though its correlation with consumer prices has weakened. \nEconomists are hoping that a tightening labor market and recent weakness in the dollar will lift inflation towards the Federal Reserve's 2 percent target this year. \nThe U.S. central bank's preferred inflation measure, the personal consumption expenditures (PCE) price index excluding food and energy, has undershot its target since May 2012. The greenback lost 7 percent of its value against the currencies of the United States' main trading partners last year. \nThe Fed raised interest rates three times in 2017. Although the central bank has forecast three rate hikes for this year, it will depend on the inflation outlook. There are concerns among some Fed officials that the factors that held down inflation early last year could become more persistent. \nLast month, the price of services fell 0.2 percent after rising for nine straight months. That reflected a 10.7 percent drop in margin for automotive fuels and lubricants retailing. \nWholesale food prices fell 0.7 percent, the biggest drop since May, after increasing 0.3 percent in November. Energy prices were unchanged last month after jumping 4.6 percent in November. \nThe cost of healthcare services increased 0.2 percent last month after being unchanged in November. Those costs feed into the core PCE price index.", "external_links": [], "published": "2018-01-11T15:30:00.000+02:00", "crawled": "2018-01-11T15:47:32.027+02:00", "highlightTitle": ""}