{"organizations": [], "uuid": "4bcf5e5fc3206c337cc30c500a675ce94e467fa1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/05/10/104460792-GettyImages-594749018.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/12/what-terrell-owens-learned-from-making-and-losing-80-million.html", "country": "US", "domain_rank": 767, "title": "What Terrell Owens learned from making and losing $80 million", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.02, "site_type": "news", "published": "2018-01-13T18:31:00.000+02:00", "replies_count": 0, "uuid": "4bcf5e5fc3206c337cc30c500a675ce94e467fa1"}, "author": "Jonathan Blumberg", "url": "https://www.cnbc.com/2018/01/12/what-terrell-owens-learned-from-making-and-losing-80-million.html", "ord_in_thread": 0, "title": "What Terrell Owens learned from making and losing $80 million", "locations": [], "entities": {"persons": [{"name": "terrell owens", "sentiment": "negative"}, {"name": "owens", "sentiment": "none"}], "locations": [], "organizations": [{"name": "hall of fame", "sentiment": "none"}, {"name": "nfl", "sentiment": "none"}, {"name": "sports illustrated", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Terrell Owens may be best remembered for his controversial antics. His 15-season career in the NFL was characterized by spats with teammates and unrestrained showmanship .\nBut Owens was also immensely talented. Throughout his career he scored 156 touchdowns, which is the fifth most all-time of any NFL player and which makes him a strong contender for entry into the Hall of Fame one day. He has recently been snubbed because of his controversies .\nHis talent, however, was formally recognized by the five teams he played for. Throughout his career, he earned an estimated $80 million .\nAnd, in a 2012 interview, he told GQ that almost all of that was gone .\nshow chapters 3 strategies for success from the NFL's first female coach Jen Welter 9:25 AM ET Mon, 30 Oct 2017 | 01:07 Owens recently sat down with NerdWallet to discuss his financial struggle in detail to help current players avoid making the same mistakes. Despite the fact that NFL players make an average of $1.9 million a year, 15 percent declare bankruptcy, while Sports Illustrated estimates that 78 percent end up coming close and/or experience significant financial stress.\nOwens' insights boil down to a few key points, and they're valuable for anyone looking to become more financially secure, not just pro athletes.\nFirst off, don't overdo it. \"My advice to any fan or athlete out there: Just don't live beyond your means,\" says Owens. \"At that time I got sucked into wanting to be like everybody else, the guys with the Mercedes and all the flashy cars and the jewelry. I think those are some of the most idiotic purchases I think players can do, especially when they don't have that money in the bank account to really pay for that stuff.\"\nshow chapters This simple plan helped an ex-NFL star pivot to become an investor 9:20 AM ET Mon, 25 Sept 2017 | 01:17 Second, don't trust just anyone with your money, including financial advisers, because not everyone is looking out for your best interest. If you do get help, make sure to stay in the loop and understand what's happening.\n\"The best thing to do is ask questions before it's too late,\" says Owens.\nAs GQ reports , \"[Owens] says his financial advisers... put him in a series of risky, highly leveraged ventures that he didn't discover until autumn 2010, when he finally demanded a full accounting.\"\nAnd finally, Owens tells NerdWallet , sometimes splurging on a big purchase is okay.\nThe wide receiver collected a total of $150,000 in fines for \"excessive\" celebration after his touchdowns. Most infamously, as a San Francisco 49er back in 2000, he posed with his arms spread wide while standing on the star in the middle of the Dallas Cowboys' stadium, which is directly under the hole in the roof through which it is rumored among zealous fans that \" God looks down to watch his team play .\" He actually did it twice.\nAsked if he regrets that lost $150,000, he responds: \"It was worth it. That's the least of my worries.\"\nLike this story? Like CNBC Make It on Facebook !\nDon't miss: NFL star Kirk Cousins earns $24 million a year and spends summers in his parents' basement\nshow chapters From an NFL star to a techie: Patrick Willis opens up about his new life 10:57 AM ET Fri, 9 Sept 2016 | 01:44", "external_links": [], "published": "2018-01-13T18:31:00.000+02:00", "crawled": "2018-01-13T18:42:16.019+02:00", "highlightTitle": ""}