{"organizations": [], "uuid": "188e0ab12bf5b73d503182106be060daece11dd8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180109&t=2&i=1220603863&w=1200&r=LYNXMPEE0819C", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-healthcare-conference-deals/u-s-pharma-executives-expect-deals-to-pick-up-after-tax-overhaul-idUSKBN1EY28E", "country": "US", "domain_rank": 408, "title": "U.S. pharma execs expect deals to pick up after tax overhaul", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T20:14:00.000+02:00", "replies_count": 0, "uuid": "188e0ab12bf5b73d503182106be060daece11dd8"}, "author": "", "url": "https://www.reuters.com/article/us-healthcare-conference-deals/u-s-pharma-executives-expect-deals-to-pick-up-after-tax-overhaul-idUSKBN1EY28E", "ord_in_thread": 0, "title": "U.S. pharma execs expect deals to pick up after tax overhaul", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "brent saunders", "sentiment": "none"}, {"name": "caroline humer", "sentiment": "none"}, {"name": "carl o'donnell", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "celgene corp", "sentiment": "none"}, {"name": "allergan inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO (Reuters) - The Trump administration’s tax overhaul should accelerate major acquisitions by drugmakers in 2018 after a slow year for deals in 2017, according to senior executives from some of the largest pharmaceutical manufacturers.\nThe $1.5-trillion bill, which U.S. President Donald Trump signed into law in December, lowers the income tax rate for U.S. companies to 21 percent from 35 percent, encourages them to repatriate cash, and modifies numerous deductions.\nBrent Saunders, chief executive officer of Allergan Inc, expects tax reform to finally clear the decks for big industry consolidation. Such moves will likely materialize over months as companies study the new bill and devise appropriate strategies.\nIn the first half of the year, he expects to see more oncology deals like the one Celgene Corp announced on Sunday, a smaller acquisition of cancer drug developer Impact Biomedicines.\nBigger, transformative deals - like the ones where large-cap pharmaceutical companies consolidate with rivals and biotechnology players - will likely take longer, bankers said.\n“I think the industry ultimately consolidates,” Saunders said in an interview at the J.P. Morgan Healthcare Conference in San Francisco. “I have a sense, though, in terms of a bigger wave of (mergers), it will either happen in the back half of 2018 or in 2019.”\nThe U.S. pharmaceutical industry has been consolidating for years even without tax reform. Large companies like Merck & Co Inc, Bristol-Myers Squibb Co and Johnson & Johnson regularly buy or do licensing deals with small companies to help maintain a continuous pipeline of new medicines.\nBut large-scale deals – like Merck’s $41.1-billion acquisition of Schering Plough in 2009, or Pfizer Inc’s $68-billion purchase of Wyeth – have dried up.\nIn early 2016, the Obama administration introduced rules that would punish companies for so-called inversion deals, in which a U.S.-based acquirer bought a smaller firm overseas and moved the combined corporate headquarters abroad to benefit from lower tax rates. The move scuttled Pfizer Inc’s proposed $160-billion purchase of Dublin-based Allergan.\nSaunders said Allergan would only begin to look at smaller deals in the second half of the year as the company, known for its Botox anti-wrinkle treatment, as it is currently focused on cost cutting.\nBRINGING BACK THE CASH Saunders’ comments echo those of healthcare industry bankers, who say that uncertainty around the tax bill, drug pricing and Republican efforts to repeal Obamacare had cooled merger activity in 2017.\nBrent Saunders, chief executive officer of drug maker Allergan Inc, poses for a photo after an interview at the J.P. Morgan Healthcare Conference in San Francisco, California, U.S., January 8, 2018. Picture taken on January 8, 2018. REUTERS/Caroline Humer Now that the tax law is in place, these bankers say, it should provide a catalyst to drugmaker deals by allowing them to repatriate billions of dollars in foreign profits held abroad, and by making it easier to agree on a value for their acquisition targets since they have a better idea of the company’s tax rate.\nSeveral drugmakers have already announced plans to bring overseas cash into the United States, including Amgen Inc and Bristol-Myers, incurring some short-term charges.\nHorizon Pharma CEO Tim Walbert said that when larger companies benefit from that repatriation of cash, they are likely to lift the whole market.\n“To the extent that you see acceleration of large cap deals ... that will bring more confidence in the sector and allow for more strategic opportunities for everyone,” Walbert said.\nJan 8, 2018; Atlanta, GA, USA; President Donald Trump walks onto the field before the 2018 CFP national championship college football game between the Georgia Bulldogs and the Alabama Crimson Tide at Mercedes-Benz Stadium. Mandatory Credit: Jason Getz-USA TODAY Sports Horizon does not have substantial money parked overseas, and expects to continue its current strategy of small- and medium-sized acquisitions for drugs treating rare diseases, its primary focus.\nDEALS TRENDED LOWER Drug industry deals have been trending lower for the past two years. Thomson Reuters data shows that in 2017, there were $52 billion worth of pharma and biotech deals, less than 25 percent of 2015’s $212 billion in deals and down from 2016’s $54 billion.\nJohnson & Johnson Chief Financial Officer Dominic Caruso said during a conference session that one reason deals were not getting done was that companies needed to borrow money in the United States, and because it was difficult to structure a deal with low enough taxes.\nAnd Eli Lilly & Co CEO Dave Ricks said that among the uses for cash it repatriates - it has $10 billion overseas - would be more business development including the small, early-stage mergers and acquisitions that are typical of the Indianapolis-based drugmaker.\nMerck said that tax reform could spur large deals among companies that are focused on general cost savings. However, that is not Merck’s deal focus: CFO Robert Davis said the company will continue to seek smaller acquisitions to enhance its portfolio of medicines.\n“That being said, getting access now to foreign cash, in a way where you don’t have to worry about the location of the cash will improve our flexibility,” he said.\n“We’re not planning a large one-time repatriation. We will repatriate in a normal course as we see what the needs are for the business.”\nReporting by Caroline Humer and Carl O'Donnell; Editing by Nick Zieminski\n ", "external_links": [], "published": "2018-01-09T20:14:00.000+02:00", "crawled": "2018-01-09T20:30:33.008+02:00", "highlightTitle": ""}