{"organizations": [], "uuid": "ff700cdc3a2c36498fe45b80babd704442e3bfc0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180119&t=2&i=1223196349&w=1200&r=LYNXMPEE0I023", "site_section": "https://www.reuters.com/finance/bonds", "section_title": "Bonds News | Reuters.com", "url": "https://www.reuters.com/article/uk-global-forex/dollar-wallows-near-three-year-trough-fears-of-government-shutdown-add-to-woes-idUSKBN1F804S", "country": "US", "domain_rank": 408, "title": "Dollar near three-year low, heading for worst run since 2015", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T09:24:00.000+02:00", "replies_count": 0, "uuid": "ff700cdc3a2c36498fe45b80babd704442e3bfc0"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/uk-global-forex/dollar-wallows-near-three-year-trough-fears-of-government-shutdown-add-to-woes-idUSKBN1F804S", "ord_in_thread": 0, "title": "Dollar near three-year low, heading for worst run since 2015", "locations": [], "entities": {"persons": [{"name": "viraj p", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "senate", "sentiment": "none"}, {"name": "ing", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "house of representatives", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - The dollar laboured near a three-year low against a basket of currencies on Friday, heading for a fifth week of falls that would be its longest losing streak since May 2015.\nThe U.S. currency slipped to its lowest since December 2014 this week, with investors selling on the view that other central banks will join the Federal Reserve in looking to raise ultra-low interest rates adopted to combat the 2008 global financial crisis and subsequent recessions.\nThe dollar index stayed close to those levels on Friday, with fears of a potential U.S. government shutdown also weighing. It was 0.3 percent on the day at 90.243, just off Thursday’s low of 90.113. It has lost about 2 percent so far in 2018.\nThe U.S. House of Representatives passed a bill on Thursday to fund government operations through to Feb. 16 and avoid agency shutdowns this weekend when existing allocations expire. The bill has yet to be approved by the Senate, where it faces an uncertain future.\n“Odds of a U.S. government shutdown have risen sharply in the past 24 hours,” said ING currency strategist Viraj Patel.\n“While we would expect such noise to keep the dollar on the back foot, any fundamental fallout at this stage would seem premature – not least as history tends to show that some sort of conciliatory approach to keep the government functioning in the long-run will ultimately prevail within Congress.”\nThe prospect of Senate approval has been complicated by President Donald Trump saying that an extension of funding for the children’s health insurance programme, a Democratic priority, should not be included.\nThe euro edged up 0.3 percent to $1.2276, near a three-year high of $1.2323 struck on Wednesday. Having advanced more than half a percent this week, the common currency could post a fifth consecutive week of gains.\nThe dollar slipped by half a percent to 110.60 yen, with its rebound from Wednesday’s four-month low of 110.19 already fading despite a rise in U.S. debt yields.\nA tiny reduction in the Bank of Japan’s bond buying this month was enough to spark speculation about possible modification of policy, even though many market players think any move will be many months away.\n“Markets are increasingly sensitive to the prospect of a less-dovish BOJ, which is putting pressure on dollar/yen,” analysts at UBS Wealth Management said in a note, adding that they will be looking to the BOJ’s policy meeting next week to gain more clarity on the central bank’ stance.\n“For now, we do not think the BOJ has any urgency to shift its yield curve control regime,” they added.\nAnother underlying factor behind the dollar’s weakness has been global investors, including sovereign wealth funds and central banks, diversifying their holdings by switching more funds into other currencies.\nReporting by Jemima Kelly; Additional reporting by Hideyuki Sano in Tokyo; Editing by David Goodman\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T09:24:00.000+02:00", "crawled": "2018-01-19T14:17:22.001+02:00", "highlightTitle": ""}