{"organizations": [], "uuid": "a0036cfa3b6fbd2813194102c2b6447a8e884752", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/business-wire-floor-decor-holdings-inc-announces-preliminary-fourth-quarter-and-fiscal-2017-financial-results-ahead-of-participation-at.html", "country": "US", "domain_rank": 767, "title": "Floor & Decor Holdings, Inc. Announces Preliminary Fourth Quarter and Fiscal 2017 Financial Results Ahead of Participation at the ICR Conference", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T14:45:00.000+02:00", "replies_count": 0, "uuid": "a0036cfa3b6fbd2813194102c2b6447a8e884752"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/business-wire-floor-decor-holdings-inc-announces-preliminary-fourth-quarter-and-fiscal-2017-financial-results-ahead-of-participation-at.html", "ord_in_thread": 0, "title": "Floor & Decor Holdings, Inc. Announces Preliminary Fourth Quarter and Fiscal 2017 Financial Results Ahead of Participation at the ICR Conference", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "floor & decor holdings, inc", "sentiment": "neutral"}, {"name": "nyse", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA--(BUSINESS WIRE)-- Floor & Decor Holdings, Inc. (NYSE: FND) (“We,” the “Company,” or “Floor & Decor”) today announced preliminary financial results for the fourth quarter and fiscal 2017.\nThe following are the Company’s preliminary estimates as of and for the thirteen weeks ended December 28, 2017:\nComparable store sales growth is estimated to be approximately 24.4%, compared to 14.0% for the thirteen weeks ended December 29, 2016. The Company’s net sales are estimated to be approximately $387 million to $389 million, representing an increase of 39.2% to 39.9% compared to $278 million for the thirteen weeks ended December 29, 2016. The Company’s diluted earnings per share (“EPS”) is estimated to be approximately $0.43 to $0.44, representing an increase of 126.3% to 131.6% compared to $0.19 for the thirteen weeks ended December 29, 2016. Adjusted diluted EPS * is estimated to be in the range of $0.17 to $0.18, representing an increase of 54.5% to 63.6% compared to $0.11 for the thirteen weeks ended December 29, 2016. Adjusted diluted EPS is a non-GAAP financial measure. See below for a reconciliation of adjusted diluted EPS.\nTom Taylor, Chief Executive Officer, stated, “We’re very pleased with the momentum of our business, which accelerated in the fourth quarter. Comparable store sales gains in the mid-teens across much of the country, combined with post-hurricane demand primarily in Houston, led to our estimated 24.4% comparable same store sales increase. As a result, 2017 will represent our ninth consecutive year of double-digit comparable store sales growth, averaging 15% per year. We successfully opened three stores during the fourth quarter of 2017, continuing our 20% new unit growth strategy per year and our new stores continue to deliver very strong performance. We are fortunate to have great teams serving their communities well.”\nMr. Taylor continued, “While we do not expect this fourth quarter same store sales growth rate to continue at this pace throughout 2018 in part because of post-hurricane demand, we remain highly confident in the long-term momentum that is building as the Floor & Decor brand and experience becomes more known among pro customers and consumers. We enter 2018 in a strong position and remain committed to the same strategies and continued investments in our business that have made us successful for almost two decades, which we believe should result in continued long-term earnings per share growth of approximately 25% for the foreseeable future. We look forward to discussing our fourth quarter results and 2018 outlook in more detail on our year-end earnings call.”\n* Non-GAAP financial measures. Please see “Non-GAAP Financial Measures” and “Reconciliation of GAAP to Non-GAAP Financial Measures” below for more information. See “Comparable Store Sales” below for information on how the Company calculates its comparable store sales growth.\nUpcoming Investor Conference Participation\nThe Company will be participating in the ICR Conference, held at the JW Marriott Orlando Grande Lakes in Orlando, Florida. The Company is scheduled to host a fireside chat on Monday, January 8, 2018 at 2:00 p.m. Eastern Time. A live audio webcast of the Company’s fireside chat will be available online at ir.flooranddecor.com .\nA recorded replay of the event can be accessed online following the presentation at ir.flooranddecor.com . The replay will be available until January 16, 2018.\nPreliminary Financial Results as of and for the Thirteen Weeks Ended December 28, 2017\nThese preliminary financial results are based upon the Company’s current estimates and subject to completion of financial and operating closing procedures as of and for the thirteen weeks ended December 28, 2017.\nThe Company has provided ranges, rather than specific amounts, for certain financial results, primarily because the Company’s financial closing procedures as of and for the thirteen weeks ended December 28, 2017 are not yet complete. As a result, the Company’s actual results may vary materially from the estimated preliminary results included herein. Accordingly, you should not place undue reliance on these estimates. See “Forward-Looking Statements” below and “Risk Factors,” “Management’s Discussion and Analysis of Financial Condition and Results of Operations” and “Special Note Regarding Forward-Looking Statements” in the Company’s Prospectus, dated and filed with the Securities and Exchange Commission on November 15, 2017 (the “Prospectus”) for additional information regarding factors that could result in differences between the preliminary estimated ranges of certain financial results presented below and the financial results the Company will ultimately report as of and for the thirteen weeks ended December 28, 2017. The summary information below is not a comprehensive statement of the Company’s financial results for this period.\nThe preliminary estimated unaudited financial results included in this release have been prepared by, and are the responsibility of, the Company’s management. The Company’s independent registered public accounting firm, Ernst & Young LLP, has not audited, reviewed, compiled or performed any procedures with respect to the preliminary financial results. Accordingly, Ernst & Young LLP does not express an opinion or any other form of assurance with respect thereto. These estimates should not be viewed as a substitute for interim financial statements prepared in accordance with accounting principles generally accepted in the United States (‘‘GAAP’’). In addition, these estimates as of and for the thirteen weeks ended December 28, 2017 are not necessarily indicative of the results to be achieved for any future period.\nThe Company’s preliminary estimated unaudited financial results for the thirteen weeks ended December 28, 2017 and our previously provided guidance for the same period is set forth in the tables below:\nFourth Quarter and Fiscal 2017 - Preliminary Results\n(In millions, except EPS, percentages and store count)\nPrior Guidance Thirteen Weeks Thirteen Weeks Ended 12/28/17 Ended 12/28/17 Net sales $387 - $389 $362 - $370 Comparable store sales growth Approximately 24.4% 17.0% to 19.0% GAAP diluted EPS $0.43 - $0.44 $0.15 - $0.16 Adjusted diluted EPS $0.17 - $0.18 $0.14 - $0.16 Diluted weighted average shares outstanding 104.2 104.6 Warehouse format store count 83 83 New warehouse format stores 3 3\nPrior Guidance Twelve Months Twelve Months Ended 12/28/17 Ended 12/28/17 Net sales $1,382 - $1,384 $1,357 - $1,365 Comparable store sales growth Approximately 16.6% 14.5% to 15.0% GAAP diluted EPS $1.00 - $1.01 $0.70 - $0.72 Adjusted diluted EPS $0.67 - $0.68 $0.64 - $0.65 Adjusted diluted weighted average shares outstanding 103.0 103.1 Warehouse format store count 83 83 New warehouse format stores 14 14 The above guidance includes certain non-GAAP financial measures (namely adjusted diluted weighted average shares outstanding and adjusted diluted EPS). Please see “Non-GAAP Financial Measures” and “Reconciliation of GAAP to Non-GAAP Financial Measures” below for more information. Unless indicated otherwise, the informa", "external_links": ["http://www.businesswire.com/news/home/20180108005547/en/"], "published": "2018-01-08T14:45:00.000+02:00", "crawled": "2018-01-08T15:34:24.001+02:00", "highlightTitle": ""}