{"organizations": [], "uuid": "6f17e9fe07f21f8c0a938f89ee4cc8cf9758f4d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/Reuters/UKBusinessNews?format=xml", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-china-fidelity-funds/fidelity-international-eyes-mutual-pension-fund-business-in-china-idUKKBN1F71N8", "country": "US", "domain_rank": 408, "title": "Fidelity International eyes mutual, pension fund business in China", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T14:54:00.000+02:00", "replies_count": 0, "uuid": "6f17e9fe07f21f8c0a938f89ee4cc8cf9758f4d9"}, "author": "", "url": "https://uk.reuters.com/article/uk-china-fidelity-funds/fidelity-international-eyes-mutual-pension-fund-business-in-china-idUKKBN1F71N8", "ord_in_thread": 0, "title": "Fidelity International eyes mutual, pension fund business in China", "locations": [], "entities": {"persons": [{"name": "daisy ho", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "fidelity international", "sentiment": "negative"}, {"name": "min read  shanghai", "sentiment": "none"}, {"name": "fidelity", "sentiment": "none"}, {"name": "china reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 12:54 PM / Updated 7 minutes ago Fidelity International eyes mutual, pension fund business in China   \nSHANGHAI (Reuters) - Fidelity International, which launched three private funds in China in the past eight months, said on Thursday it would explore opportunities in the Chinese mutual and pension fund market. \nFidelity was the first global asset manager to be awarded China’s private fund management licence a year ago, as the country gradually opens up its $2.2 trillion (1.59 trillion pounds) fund industry to global asset managers. Other managers have followed suit. \nFidelity said it aimed to launch a larger variety of funds in China in the next two to three years. It has launched one equity fund and two fixed-income funds so far. \n“China is a market of high strategic importance to us,” Daisy Ho, the managing director for Asia excluding Japan, told a news conference in Shanghai. \n“Any development in opening up China’s capital markets, whether it’s about the mutual, private or pension fund market, we’re hugely interested,” she said. \nOther foreign asset managers with private fund management licences in China include UBS Asset Management, Man Group ( EMG.L ) and Aberdeen Standard. \nShanghai-based fund consultancy Z-Ben Advisors said foreign entrants needed patience and strategic vision to make money in China’s increasingly competitive private fund market, which is expected to more than double to $1 trillion yuan by 2020. \nIn the mutual fund market, Beijing said in November it would allow foreign control of joint ventures. A foreign ownership cap of 49 percent will be lifted to 51 percent, pending detailed rules, and three years after that, ownership restrictions would be scrapped completely. \n“What was already viewed as a rather complex set of choices is now more so,” said Z-Ben Advisors Managing Director Peter Alexander, who said China’s mutual fund market would climb to $12 trillion yuan in the next decade from $1.8 trillion now. \nFidelity, which has set up a wholly-owned subsidiary in China, would stick to its global strategy of not forming joint ventures in local markets, China Country Head Jackson Lee said. \nHe said Fidelity’s newly-launched equity fund would benefit from the company’s existing on-the-ground research capabilities and years of experience investing in China’s yuan-denominated shares. \nFidelity International has been investing in China’s capital markets for 20 years via the country’s quota-based inbound investment schemes. Reporting by Samuel Shen and John Ruwitch; Editing by Edmund Blair", "external_links": [], "published": "2018-01-18T14:54:00.000+02:00", "crawled": "2018-01-18T15:13:39.003+02:00", "highlightTitle": ""}