{"organizations": [], "uuid": "75c336b3f8c2bf3421f6cd6a00181394286efc33", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224722928&w=1200&r=LYNXMPEE0N0FV", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-ukraine-privatbank-insight/ukraine-money-go-round-how-1-7-billion-in-bank-loans-ended-up-offshore-idUSKBN1FD0G5", "country": "US", "domain_rank": 408, "title": "INSIGHT-Ukraine money-go-round: how $1.7 bln in bank loans ended up offshore", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T08:00:00.000+02:00", "replies_count": 0, "uuid": "75c336b3f8c2bf3421f6cd6a00181394286efc33"}, "author": "", "url": "https://www.reuters.com/article/us-ukraine-privatbank-insight/ukraine-money-go-round-how-1-7-billion-in-bank-loans-ended-up-offshore-idUSKBN1FD0G5", "ord_in_thread": 0, "title": "INSIGHT-Ukraine money-go-round: how $1.7 bln in bank loans ended up offshore", "locations": [], "entities": {"persons": [{"name": "natalia zinets", "sentiment": "none"}, {"name": "dasha afanasieva", "sentiment": "none"}], "locations": [{"name": "ukraine", "sentiment": "none"}, {"name": "cyprus", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "privatbank", "sentiment": "none"}, {"name": "trade point agro limited", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "trade point agro", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ARTSYZ, Ukraine/LONDON (Reuters) - When Ukrainian company Profit signed a $48.5 million deal with a British firm in 2014, it became part of what prosecutors in Ukraine say was a potentially criminal scheme that moved $1.7 billion from the country’s biggest lender to offshore accounts.\nWith a loan it had raised from PrivatBank in east Ukraine, Profit paid Trade Point Agro Limited in London on Aug. 18, 2014 for 24,250 tonnes of polyethylene terephthalate, a polymer used in fabrics and plastic containers, according to a legal complaint Profit filed in November 2014 to try to recover the funds.\nFor a graphic on Ukraine money-go-round, click tmsnrt.rs/2DsSXIE\nBut Trade Point Agro failed to deliver the goods and deposited the money in PrivatBank’s Cyprus branch, according to prosecutors. When a Ukrainian court ruled against Trade Point Agro and ordered it to repay Profit, Trade Point Agro did not appeal against the ruling but did not pay the money back.\nThe deal between Profit and Trade Point Agro is part of a pre-trial investigation that is still under way into whether officials at PrivatBank illegally took money from the lender through shady loan practices involving dozens of companies.\nFinance Minister Oleksandr Danylyuk regards the case as a “litmus test” for the effectiveness of the battle against corruption, success in which is vital for Ukraine to receive international credits.\nIn the pre-trial investigation, prosecutors are trying to identify anyone at PrivatBank who might have committed a crime. They say in court filings that from May to September, 2014, unnamed PrivatBank officials moved money out of the bank to companies such as Trade Point Agro which they believe look “fictitious”.\nPrivatBank, which was nationalized in December 2016, and Ukraine’s anti-corruption bureau are also investigating whether the bank illegally provided loans to companies linked to two wealthy tycoons who owned the bank before the state takeover.\nNo one has been charged with wrongdoing. London’s High Court ordered some worldwide assets of Ihor Kolomoisky and Gennadiy Bogolyubov, PrivatBank’s former main shareholders, to be frozen last month.\nPrivatBank, now controlled by the state, said the court order was granted on the basis of detailed evidence to the court that they extracted almost $2 billion from PrivatBank through dishonest transactions.\n“NO EASY ANSWER”\nKolomoisky and Bogolyubov deny wrongdoing, say the loans were repaid and that the bank was solvent at the time of the nationalization, which Kolomoisky is challenging in court, saying it was not insolvent and the state takeover was politically motivated.\nAn investigation commissioned by the central bank in 2017 found that PrivatBank had for at least a decade been used for money-laundering and shady deals where 95 percent of corporate loans went to companies related to the former owners. Kolomoisky dismissed the findings, made public this month, as “nonsense”.\nGeneral Prosecutor Yuriy Lutsenko said in December there was “no easy legal answer” to the question of whether Kolomoisky and PrivatBank stole money, and that Kolomoisky believes he agreed to the nationalization under duress.\n“Who is responsible for the stolen money? Kolomoisky’s answer: nobody stole money,” Lutsenko said.\nTrade Point Agro and Profit did not respond to requests for comment.\nConsultancy Gabara Strategies, acting on behalf of Kolomoisky and Bogolyubov, PrivatBank’s two main former shareholders, said: “Loans to the companies referred to did not result in a loss of USD 1.7 billion, or indeed any loss, to PrivatBank.”\n“The loans were repaid and PrivatBank at all times held adequate collateral for those loans,” it said in a statement, describing any suggestion to the contrary as “unsubstantiated and groundless”.\nAsked to explain how the loans were repaid, representatives of Kolomoisky and Bogolyubov did not provide any details.\nHALLMARKS OF SHELL COMPANIES At the time of PrivatBank’s nationalization, the central bank says the lender had a $5.6-billion hole in its balance sheet caused by shady lending practices, with almost all of its corporate loans made to related parties.\nIn an effort to determine what happened to loans made by PrivatBank, Reuters reviewed court documents related to legal proceedings launched by Profit and other companies to recoup funds they say they were cheated out of, and court documents from the prosecutors.\nFILE PHOTO: Igor Kolomoisky, billionaire and governor of the Dnipropetrovsk region, speaks during an interview in Dnipropetrovsk, Ukraine May 24, 2014. REUTERS/Valentyn Ogirenko/File Photo Reuters also reviewed state property registries and company documents, visited the addresses listed for some of the firms that received loans from PrivatBank and inspected some of the physical collateral later used to underpin the loans.\nReuters found some of the firms that were granted loans or received payment for goods they did not deliver bear some of the hallmarks of shell companies. Correspondents visited the addresses where nine of the companies in London and Ukraine are listed but found none at these locations.\nReuters has also seen a copy of a central bank assessment in 2016 of part of PrivatBank’s collateral that has not been made public. The assessment valued the collateral, which included physical assets, at $3.5 million compared to PrivatBank’s own assessment of $91 million.\nThe central bank says this suggests the value of physical assets used as collateral for loans was artificially inflated by PrivatBank officials to give the impression the $1.7 billion of loans were insured against default.\nThe collateral included a Soviet-era petroleum storage depot in Artsyz, 600 km (373 miles) south of the Ukrainian capital Kiev, which was valued at more than $12 million by PrivatBank but considered worthless by the central bank, according to the central bank’s assessment seen by Reuters.\nA Reuters reporter who visited the depot found sheep grazing there and was told by Artsyz Mayor Volodymyr Mikhov: “It has not operated for at least 10 to 15 years.”\nDeputy Central Bank Governor Kateryna Rozhkova says over 400 legal cases connected to the nationalization have been launched by the former shareholders and parties related to them against the central bank, PrivatBank and the finance ministry.\nShe said this pointed to unwillingness by the former shareholders to restructure and pay off the debt as promised, and was designed to “destabilize” the efforts of PrivatBank, the central bank and the finance ministry to recover the loans.\nThe statement to Reuters on behalf of PrivatBank’s two main former shareholders said that by October 2016 the bank was performing well and implementing a plan agreed with the central bank, but the central bank “tore up the agreed plan and engineered an ‘insolvency’ event, which allowed the Government to nationalize the bank for political reasons.”\nRozhkova denied nationalizing PrivatBank was a conspiracy.\nRETURN TO SENDER From May 28 to Sept. 1, 2014, 42 companies registered in the Dnipropetrovsk region of eastern Ukraine transferred $1.7 billion to three firms registered in Britain and three in the British Virgin Islands, according to claims submitted by the 42 companies to the region’s commercial court.\nAll 42 borrowed money from PrivatBank, whose headquarters is in the city of Dnipro, to pay in advance for goods ranging from manganese ore and fuel oil to cranes and mechanical diggers.\nNone of the six firms delivered the goods and all deposited the money they received with the Cyprus branch of PrivatBank, according to the statements filed by the Ukrainian companies in court cases in which they are seeking back the money they paid.\nA Reuters correspondent who visited the addresses listed in London for the three British-registered companies -- Trade Point Agro, Teamtrend Limited and Collyer Limited -- found no sign of them there.\nTwo of the London-listed companies, Trade Point Agro and Teamtrend, used to have a common director, while Teamtrend and Collyer have common company secretaries and directors. Letters to the firms requesting comment went unanswered.\nReuters also sent two letters to each of the three firms registered in the British Virgin Islands -- Rossyn, Milbert Ventures and Ukrtransitservice. They also went unanswered.\nThe deal between Trade Point Agro and Profit was typical of those outlined in the filings to the Dnipropetrovsk Regional Commercial Court.\nTrade Point Agro pulled out of the contract two months after signing it, saying it would no longer deliver the goods on the agreed terms, and agreed to pay the money back by Nov. 4 but failed to do so, the Dnipropetrovsk court’s records show.\nAlthough the records also show the court ruled on Dec. 8, 2014 in favor of Profit’s $48.5-million claim against Trade Point Agro, prosecutors say the money has never been paid back.\nA Reuters correspondent was unable to contact Profit using the information provided in the state register of business and could not find Profit at the address where it is registered -- with three other firms that received loans from PrivatBank -- in Vozyednania Street in Dnipro.\nReuters also sent requests for comment to the registered addresses of all 42 companies by courier but all the letters were returned.\nTwenty-six of the 42 firms registered in Ukraine share the same registered address with one or more companies involved in court cases, company documents show.\nAdditional reporting by Alessandra Prentice in Dnipro, Writing by Matthias Williams, Editing by Timothy Heritage\n ", "external_links": [], "published": "2018-01-24T08:00:00.000+02:00", "crawled": "2018-01-24T09:20:19.035+02:00", "highlightTitle": ""}