{"organizations": [], "uuid": "5b3a5d36eac358ca901eb9d86fdc2dd222270361", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/8", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-mercantile-bank-corporation-increases-regular-cash-dividend.html", "country": "US", "domain_rank": 767, "title": "Mercantile Bank Corporation Increases Regular Cash Dividend", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-16T14:00:00.000+02:00", "replies_count": 0, "uuid": "5b3a5d36eac358ca901eb9d86fdc2dd222270361"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-mercantile-bank-corporation-increases-regular-cash-dividend.html", "ord_in_thread": 0, "title": "Mercantile Bank Corporation Increases Regular Cash Dividend", "locations": [], "entities": {"persons": [{"name": "robert b. kaminski", "sentiment": "none"}], "locations": [{"name": "mich.", "sentiment": "none"}, {"name": "mercantile", "sentiment": "none"}], "organizations": [{"name": "mercantile bank corporation", "sentiment": "negative"}, {"name": "about mercantile bank corporation based", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GRAND RAPIDS, Mich., Jan. 16, 2018 /PRNewswire/ -- Mercantile Bank Corporation (NASDAQ: MBWM) (\"Mercantile\") announced today that on January 11, 2018, its Board of Directors declared a regular quarterly cash dividend of $0.22 per common share, payable on March 21, 2018, to holders of record as of March 9, 2018. The $0.22 cash dividend represents an increase of approximately 16 percent from the $0.19 regular cash dividend paid during the fourth quarter of 2017.\n\"We are very pleased that our ongoing financial strength has positioned us to reward shareholders with an increased quarterly cash dividend,\" said Robert B. Kaminski, Jr., President and Chief Executive Officer of Mercantile. \"The higher dividend reflects our desire to maintain the cash dividend payout between 35 percent and 40 percent of net income, exhibiting our commitment to provide a meaningful cash return to shareholders, and the confidence of our Board of Directors and executive management team in Mercantile's ability to produce strong operating results in future periods.\"\nAbout Mercantile Bank Corporation\nBased in Grand Rapids, Michigan, Mercantile Bank Corporation is the bank holding company for Mercantile Bank of Michigan. Mercantile provides banking services to businesses, individuals and governmental units, and differentiates itself on the basis of service quality and the expertise of its banking staff. Mercantile has assets of approximately $3.2 billion and operates 49 banking offices. Mercantile Bank Corporation's common stock is listed on the NASDAQ Global Select Market under the symbol \"MBWM.\"\nForward-Looking Statements\nThis news release contains comments or information that constitute forward-looking statements (within the meaning of the Private Securities Litigation Reform Act of 1995) that are based on current expectations that involve a number of risks and uncertainties. Actual results may differ materially from the results expressed in forward-looking statements. Factors that might cause such a difference include changes in interest rates and interest rate relationships; demand for products and services; the degree of competition by traditional and nontraditional competitors; changes in banking regulation or actions by bank regulators; changes in tax laws; changes in prices, levies, and assessments; the impact of technological advances; governmental and regulatory policy changes; the outcomes of contingencies; trends in customer behavior as well as their ability to repay loans; changes in local real estate values; changes in the national and local economies; and other factors, including risk factors, disclosed from time to time in filings made by Mercantile with the Securities and Exchange Commission. Mercantile undertakes no obligation to update or clarify forward-looking statements, whether as a result of new information, future events or otherwise.\nView original content: http://www.prnewswire.com/news-releases/mercantile-bank-corporation-increases-regular-cash-dividend-300582645.html\nSOURCE Mercantile Bank Corporation", "external_links": ["http://www.prnewswire.com/news-releases/mercantile-bank-corporation-increases-regular-cash-dividend-300582645.html"], "published": "2018-01-16T14:00:00.000+02:00", "crawled": "2018-01-16T16:41:19.018+02:00", "highlightTitle": ""}