{"organizations": [], "uuid": "e05e11d47f2d9744ce4892e6a1c068f8cf8f1b15", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/business-wire-rockwell-collins-shareowners-vote-overwhelmingly-in-favor-of-acquisition-by-utc.html", "country": "US", "domain_rank": 767, "title": "Rockwell Collins' Shareowners Vote Overwhelmingly in Favor of Acquisition by UTC", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T17:52:00.000+02:00", "replies_count": 0, "uuid": "e05e11d47f2d9744ce4892e6a1c068f8cf8f1b15"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/business-wire-rockwell-collins-shareowners-vote-overwhelmingly-in-favor-of-acquisition-by-utc.html", "ord_in_thread": 0, "title": "Rockwell Collins' Shareowners Vote Overwhelmingly in Favor of Acquisition by UTC", "locations": [], "entities": {"persons": [{"name": "kelly ortberg", "sentiment": "none"}], "locations": [{"name": "iowa", "sentiment": "none"}, {"name": "utc cedar rapids", "sentiment": "none"}], "organizations": [{"name": "rockwell collins", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "rockwell collins, inc.", "sentiment": "neutral"}, {"name": "united technologies corp.", "sentiment": "none"}, {"name": "collins aerospace", "sentiment": "none"}, {"name": "united technologies", "sentiment": "none"}, {"name": "utc aerospace systems", "sentiment": "none"}, {"name": "collins aerospace systems", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CEDAR RAPIDS, Iowa--(BUSINESS WIRE)-- Rockwell Collins, Inc. (NYSE: COL) (“Rockwell Collins”) announced that today its shareowners overwhelmingly approved the proposed acquisition of Rockwell Collins by United Technologies Corp. (NYSE:UTX) (“UTC”). More than 96 percent of all votes cast, representing more than 72 percent of all shares of common stock outstanding on the record date for the special meeting, were in favor of the transaction.\nUpon satisfaction of required regulatory and other customary closing conditions, Rockwell Collins will be combined with UTC Aerospace Systems to create a new United Technologies business called Collins Aerospace Systems. The proposed transaction is expected to close by the third quarter of 2018.\n“Shareowners have made clear their support for this acquisition, bringing it one step closer to reality,” said Kelly Ortberg, Rockwell Collins’ Chairman, President and CEO. “As Collins Aerospace, we’ll be a stronger company, with attractive aerospace product and service portfolios, and ultimately, better positioned for long-term success.”\nA full description of the proposed transaction is included in the proxy statement for the special meeting available through the Securities and Exchange Commission website at www.sec.gov or on the Investor Relations section of www.rockwellcollins.com .\nAbout United Technologies\nUnited Technologies Corp., based in Farmington, Connecticut, provides high technology products and services to the building and aerospace industries. By combining a passion for science with precision engineering, the company is creating smart, sustainable solutions the world needs.\nAbout Rockwell Collins\nRockwell Collins (NYSE: COL) is a leader in aviation and high-integrity solutions for commercial and military customers around the world. Every day we help pilots safely and reliably navigate to the far corners of the earth; keep warfighters aware and informed in battle; deliver millions of messages for airlines and airports; and help passengers stay connected and comfortable throughout their journey. As experts in flight deck avionics, cabin electronics, cabin interiors, information management, mission communications, and simulation and training, we offer a comprehensive portfolio of products and services that can transform our customers’ futures. To find out more, please visit www.rockwellcollins.com .\nAdditional Information\nIn connection with the proposed transaction, United Technologies has filed a registration statement on Form S-4 (File No. 333-220883), which includes a prospectus of United Technologies and a proxy statement of Rockwell Collins (the \"proxy statement/prospectus\"), and each party will file other documents regarding the proposed transaction with the SEC. The proxy statement/prospectus was declared effective by the SEC and was mailed to Rockwell Collins shareowners. INVESTORS AND SECURITY HOLDERS ARE URGED TO READ THE PROXY STATEMENT/PROSPECTUS (INCLUDING ALL AMENDMENTS AND SUPPLEMENTS FILED THERETO) AND OTHER RELEVANT DOCUMENTS FILED WITH THE SEC WHEN THEY BECOME AVAILABLE, BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION. Investors and security holders may obtain the proxy statement/prospectus free of charge from the SEC's website or from United Technologies or Rockwell Collins. The documents filed by United Technologies with the SEC may be obtained free of charge at United Technologies' website at www.utc.com or at the SEC's website at www.sec.gov . These documents may also be obtained free of charge from United Technologies by requesting them by mail at UTC Corporate Secretary, 10 Farm Springs Road, Farmington, CT, 06032, by telephone at 1-860-728-7870 or by email at corpsec@corphq.utc.com . The documents filed by Rockwell Collins with the SEC may be obtained free of charge at Rockwell Collins' website at www.rockwellcollins.com or at the SEC's website at www.sec.gov . These documents may also be obtained free of charge from Rockwell Collins by requesting them by mail at Investor Relations, 400 Collins Road NE, Cedar Rapids, Iowa 52498, or by telephone at 1-319-295-7575.\nNo Offer or Solicitation\nThis communication shall not constitute an offer to sell or the solicitation of an offer to buy any securities, nor shall there be any sale of securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction. No offering of securities shall be made except by means of a prospectus meeting the requirements of Section 10 of the U.S. Securities Act of 1933, as amended.\nSafe Harbor Statement\nThis press release contains statements, including statements regarding the proposed acquisition of Rockwell Collins by United Technologies, that are forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995. Actual results may differ materially from those projected as a result of certain risks and uncertainties, including but not limited to: the ability of Rockwell Collins and United Technologies to receive the required regulatory approvals for the proposed acquisition of Rockwell Collins by United Technologies (and the risk that such approvals may result in the imposition of conditions that could adversely affect the combined company or the expected benefits of the transaction) and to satisfy the other conditions to the closing of the transaction on a timely basis or at all; the occurrence of events that may give rise to a right of one or both of the parties to terminate the merger agreement; negative effects of the announcement or the consummation of the transaction on the market price of United Technologies' and/or Rockwell Collins' common stock and/or on their respective businesses, financial conditions, results of operations and financial performance; risks relating to the value of the United Technologies' shares to be issued in the transaction, significant transaction costs and/or unknown liabilities; the possibility that the anticipated benefits from the proposed transaction cannot be realized in full or at all or may take longer to realize than expected; risks associated with third party contracts containing consent and/or other provisions that may be triggered by the proposed transaction; risks associated with transaction-related litigation; the possibility that costs or difficulties related to the integration of Rockwell Collins' operations with those of United Technologies will be greater than expected; the outcome of legally required consultation with employees, their works councils or other employee representatives; and the ability of Rockwell Collins and the combined company to retain and hire key personnel. There can be no assurance that the proposed acquisition or any other transaction described above will in fact be consummated in the manner described or at all. For additional information on identifying factors that may cause actual results to vary materially from those stated in forward-looking statements, see the reports of United Technologies and Rockwell Collins on Forms 10-K, 10-Q and 8-K filed with or furnished to the SEC from time to time. These forward-looking statements are made o", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51741592&newsitemid=20180111005639&lan=en-US&anchor=www.sec.gov&index=1&md5=5bfcfb9f087cfce73c1703d007504df8", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rockwellcollins.com&esheet=51741592&newsitemid=20180111005639&lan=en-US&anchor=www.rockwellcollins.com&index=3&md5=76bfcdd2e1a2b6c60abee41d853d92b5", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rockwellcollins.com&esheet=51741592&newsitemid=20180111005639&lan=en-US&anchor=www.rockwellcollins.com&index=6&md5=f0c17af5f993a7778082393c6fdd867e", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51741592&newsitemid=20180111005639&lan=en-US&anchor=www.sec.gov&index=7&md5=cf1fc4bd567db305d52e6b4f7c0d80f8", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51741592&newsitemid=20180111005639&lan=en-US&anchor=www.sec.gov&index=5&md5=270c09d1463b23e965404e4e8642907a", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rockwellcollins.com&esheet=51741592&newsitemid=20180111005639&lan=en-US&anchor=www.rockwellcollins.com&index=2&md5=b725cf97b61d64620e2e47cd327b8e92", "http://www.businesswire.com/news/home/20180111005639/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.utc.com&esheet=51741592&newsitemid=20180111005639&lan=en-US&anchor=www.utc.com&index=4&md5=86d66949bad6a8e763263b325ce623c0"], "published": "2018-01-11T17:52:00.000+02:00", "crawled": "2018-01-11T18:54:22.010+02:00", "highlightTitle": ""}