{"organizations": [], "uuid": "f5ddca4417c94d5c5d005f473cd7b8745bcc2f01", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 11, "shares": 11, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-jordan-israel-diplomacy/jordan-says-israel-apologizes-for-killing-of-two-jordanians-in-embassy-incident-government-spokesman-idUSKBN1F72PQ", "country": "US", "domain_rank": 408, "title": "Jordan says Israel apologizes for killing of two Jordanians in embassy incident: government spokesman", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T20:43:00.000+02:00", "replies_count": 0, "uuid": "f5ddca4417c94d5c5d005f473cd7b8745bcc2f01"}, "author": "", "url": "https://www.reuters.com/article/us-jordan-israel-diplomacy/jordan-says-israel-apologizes-for-killing-of-two-jordanians-in-embassy-incident-government-spokesman-idUSKBN1F72PQ", "ord_in_thread": 0, "title": "Jordan says Israel apologizes for killing of two Jordanians in embassy incident: government spokesman", "locations": [], "entities": {"persons": [{"name": "jordan", "sentiment": "negative"}, {"name": "suleiman al-khalidi", "sentiment": "none"}, {"name": "mohammad al momani", "sentiment": "none"}, {"name": "petra", "sentiment": "none"}, {"name": "hugh lawson", "sentiment": "none"}], "locations": [{"name": "israel", "sentiment": "none"}, {"name": "jordan", "sentiment": "none"}, {"name": "amman", "sentiment": "none"}, {"name": "amman", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "foreign ministry", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 18, 2018 / 6:43 PM / in 17 minutes Jordan says Israel apologizes for deaths of two Jordanians at embassy Suleiman Al-Khalidi 3 Min Read \nAMMAN (Reuters) - Jordan said on Thursday that Israel had formally apologized for the deaths of two of its citizens killed by an Israeli security guard last July in an incident that soured ties and led to the closure of the Israeli embassy in Amman, state media said. \nGovernment spokesman Mohammad al Momani was quoted by state news agency Petra as saying the Israeli foreign ministry had sent a memorandum expressing “deep regrets and apologies” over the incident at the embassy and pledging to take legal action in the case. \nJordan had said it would not allow Israel to reopen its embassy in Amman until it launched legal proceedings against the security guard. \nThe Israeli prime minister’s office said on Thursday that the embassy in Amman would resume full operations immediately. \nThe handling of the shooting had tested ties between Israel and Jordan, one of only two Arab states that has a peace treaty with Israel. The two have a long history of close security ties. \nThe embassy was closed shortly after Israel hastily repatriated the guard under diplomatic immunity to prevent Jordanian authorities interrogating him and taking any legal action against him. The Israeli ambassador and embassy staff were pulled out. \nJordan maintained that even if the guard had diplomatic immunity that did not mean he could not be punished. FILE PHOTO: Protestors chant slogans during a demonstration near the Israeli embassy in Amman, Jordan July 28, 2017. The banner reads, \"Resist don't submit\". REUTERS/Muhammad Hamed/File Photo \nIsrael has now pledged to “implement and follow up legal measures” in the case and also take action in the shooting of an unarmed Jordanian judge by an Israeli soldier in an incident in 2014, Momani said. \nIsrael would pay compensation to the three families, he said. \nIsrael said at the time the armed guard opened fire after being attacked and lightly wounded by the workman, who was delivering furniture at his home within the embassy compound, and acted in self-defense in what Israeli officials called a “terrorist attack”. \nIsrael then said it was highly unlikely it would prosecute the security guard. \nJordanian officials have treated the shooting as a criminal case and say the two unarmed Jordanians - the other was a bystander - were killed in cold blood by the armed guard. Related Coverage Israel's Jordan embassy to resume full operations: Israeli PM's office \nThe government statement said the Israeli government had met all of Jordan’s demands for the return of the ambassador and the reopening of the embassy. \nMany Jordanians, in a country where the peace treaty with Israel is unpopular and pro-Palestinian sentiment widespread, were outraged that the guard was allowed to leave and staged protests calling on the authorities to scrap the 1994 peace treaty. \nA televised welcome home for the guard and a hero’s embrace from Israeli Prime Minister Benjamin Netanyahu had enraged King Abdullah. In a rare outburst, he accused Netanyahu of using the incident as a “political show” saying it was “provocative on all fronts”. Reporting by Suleiman Al-Khalidi; Editing by Richard Balmforth", "external_links": [], "published": "2018-01-18T20:43:00.000+02:00", "crawled": "2018-01-18T20:56:56.025+02:00", "highlightTitle": ""}