{"organizations": [], "uuid": "4a095ce7520d2ab4867dc87be37d8a5954642fbb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221153447&w=1200&r=LYNXMPEE0A172", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/us-trade-nafta-canada/chances-of-u-s-leaving-nafta-must-be-taken-seriously-canada-idUKKBN1F01Y1", "country": "US", "domain_rank": 408, "title": "Canada talks tough on trade as endgame on NAFTA talks nears", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T00:52:00.000+02:00", "replies_count": 0, "uuid": "4a095ce7520d2ab4867dc87be37d8a5954642fbb"}, "author": "", "url": "https://uk.reuters.com/article/us-trade-nafta-canada/chances-of-u-s-leaving-nafta-must-be-taken-seriously-canada-idUKKBN1F01Y1", "ord_in_thread": 0, "title": "Canada talks tough on trade as endgame on NAFTA talks nears", "locations": [], "entities": {"persons": [{"name": "david ljunggren", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}, {"name": "ontario", "sentiment": "none"}, {"name": "mexico city", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "nafta", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "world trade organization", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 2:34 PM / Updated 20 minutes ago Canada talks tough on trade as endgame on NAFTA talks nears David Ljunggren 4 Min Read \nLONDON, Ontario (Reuters) - Canada is talking tough with the United States, stressing its determination to push back against what it says are unfair trade practices ahead of crucial talks to revamp the tri-nation North American Free Trade Agreement. FILE PHOTO: Flags are pictured during the fifth round of NAFTA talks involving the United States, Mexico and Canada, in Mexico City, Mexico, November 19, 2017. REUTERS/Edgard Garrido/File Photo \nU.S., Canadian and Mexican officials meet this month for the sixth and penultimate round of talks to update NAFTA, which President Donald Trump has threatened to abandon unless major changes are made. \nThe talks start on Jan. 23, just weeks after Canada launched a wide-ranging complaint against the United States at the World Trade Organization, potentially complicating NAFTA negotiations. The complaint challenges Washington’s use of anti-dumping and anti-subsidy duties. \n“Our American colleagues ... understand when you stand strong,” Trade Minister Francois-Philippe Champagne told reporters. “You get respect when people see you are firm.” \nCanada has so far largely shunned confrontation with Washington, stressing instead the merits of NAFTA and free trade as Canadian Prime Minister Justin Trudeau makes efforts to forge closer ties with Trump. \nBut Trump’s more isolationist approach has put strains on the bilateral trading relationship between the two countries, the second largest of its kind in the world. \nCanada is riled about duties on lumber and planemaker Bombardier Inc, which is based in the politically important province of Quebec, where Trudeau’s Liberals are looking to build up support. \n“Strategically, standing up to the Americans plays well at home,” said Toronto trade lawyer Mark Warner. \n“The Canadians are getting tougher ... they’ve been more aggressive in their response, in their threats, than perhaps people have realized,” he said in a phone interview. \nCanadian cabinet ministers have been fanning out across the United States for 18 months, spreading an upbeat message about the benefits of trade. FILE PHOTO: Canada's Foreign Minister Chrystia Freeland takes part in a news conference with U.S. Secretary of State Rex Tillerson (not shown) on Parliament Hill in Ottawa, Ontario, Canada, December 19, 2017. REUTERS/Blair Gable \nBut when Public Safety Minister Ralph Goodale went to Kentucky last week, he gave a speech in which he warned the Americans against “tanking the whole relationship”. \nCanadian government sources told Reuters on Wednesday they were increasingly convinced the United States plans to announce it intends to pull out of NAFTA, sending markets lower. \nOn Thursday though, Trump told the Wall Street Journal he would be “a little bit flexible” on his threat to withdraw from NAFTA because Mexico is facing a presidential election this year. STUCK IN NEUTRAL \nCanadian companies and industries that would be most acutely impacted by the pact’s demise are largely stuck in neutral given the uncertainty of what might replace it, analysts and executives have said. \nCanada and Mexico are unhappy about U.S. demands to establish rules of origin for NAFTA goods that would set minimum levels of U.S. content for autos, a sunset clause that would terminate the deal if it is not renegotiated every five years and ending the so-called Chapter 19 dispute mechanism. \nCanadian foreign minister Chrystia Freeland said on Thursday the U.S. threat to quit NAFTA has to be taken seriously. Still, she said it was “absolutely possible to have a positive outcome” in Montreal if all three sides showed good will. \n“When it comes to the more unconventional U.S. proposals, we have been doing some creative thinking,” she said. \n“We have some new ideas,” she added. One person familiar with government thinking said some of the ideas related to auto content. \nLaura Dawson, director of the Washington-based Woodrow Wilson’s Canada Institute, said there were sharp limits to Ottawa’s influence. \n“There’s nothing that Canada could do, short of setting fire to the White House again, that would change the trajectory of whatever it is that Donald Trump is going to do,” she said in reference to an 1812 war. Reporting by David Ljunggren; Editing by Chizu Nomiyama, Andrea Ricci and Susan Thomas", "external_links": [], "published": "2018-01-12T00:52:00.000+02:00", "crawled": "2018-01-12T01:02:01.004+02:00", "highlightTitle": ""}