{"organizations": [], "uuid": "5bf8d60d0cef7f1f4285b9c795bbf33f581fec32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220687185&w=1200&r=LYNXMPEE0901F", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-global-oil/oil-prices-hit-highest-since-2014-but-analysts-warn-of-overheated-market-idUSKBN1EZ03D", "country": "US", "domain_rank": 408, "title": "Oil prices hit highest since 2014, but analysts warn of overheated market", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T03:17:00.000+02:00", "replies_count": 0, "uuid": "5bf8d60d0cef7f1f4285b9c795bbf33f581fec32"}, "author": "", "url": "https://www.reuters.com/article/us-global-oil/oil-prices-hit-highest-since-2014-but-analysts-warn-of-overheated-market-idUSKBN1EZ03D", "ord_in_thread": 0, "title": "Oil prices hit highest since 2014, but analysts warn of overheated market", "locations": [], "entities": {"persons": [{"name": "henning gloystein", "sentiment": "none"}, {"name": "william o‘loughlin", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "min read  singapore", "sentiment": "none"}, {"name": "opec", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 1:18 AM / Updated 41 minutes ago U.S. crude inventory fall buoys oil, worries about rally persist David Gaffen 3 Min Read \nNEW YORK (Reuters) - Crude oil prices rose but backed away from three-year highs on Wednesday after U.S. government data showed an increase in fuel inventories and a falloff in refining activity. \nU.S. crude inventories fell 4.9 million barrels last week, more than the 3.9-million decline forecast, but bigger-than-expected builds in gasoline and fuel stocks offset that drawdown, the Energy Information Administration reported. [EIA/S] \nThe market was also bolstered modestly by data showing a sharp decline in U.S. production last week that analysts say could have been the result of extreme cold temperatures across the United States to start the year. \n“The lower draw in crude oil stocks, combined with the strong builds in product stocks is bearish news for prices. But market participants could also use the sharp drop in production as an excuse to buy,” said Carsten Fritsch, oil analyst at Commerzbank AG in Frankfurt, Germany. \nU.S. West Texas Intermediate (WTI) crude futures were at $63.33 a barrel, up 37 cents, at 12:55 p.m. EST (1755 GMT). Earlier in the session, prices hit $63.67, their highest since Dec. 9, 2014. \nBrent crude futures were at $68.96 a barrel, 14 cents above their last close. The global benchmark earlier hit $69.37, its highest since May 2015. \nA broad, global market rally, including stocks, has also been fueling investment into crude oil futures. [MKTS/GLOB] A gas station attendant pumps fuel into a customer's car at PetroChina's petrol station in Beijing, China, March 21, 2016. REUTERS/Kim Kyung-Hoon \nThe oil market has been buoyant in the last several weeks, with U.S. crude futures at highs not seen since late 2014, and Brent crude less than $1 per barrel away from a milestone that would, too, be a high point since that same time. \nOil prices have risen more than 13 percent since early December, and there are indications of overheating. Analysts warned that the market is ignoring U.S. production increases at its peril. \nThe rally has brought out some concerns that the market could overheat, especially as U.S. production is expected to rise to new records later in the year. \nOn Tuesday, the EIA boosted its expectations for production in coming months, and now sees overall production at record highs, surpassing 11 million barrels per day (bpd) by 2019. \nU.S. crude oil production is expected to hit 10 million bpd next month, leaving only Russia and Saudi Arabia at higher levels. \nMembers of the Organization of the Petroleum Exporting Countries fear current price gains could prompt U.S. shale oil companies to flood the market. OPEC, along with non-members including Russia, cut supply by 1.8 million bpd in a late 2016 agreement that has been extended through the end of this year. \nThe cuts were aimed at reducing a global supply overhang that had dogged oil markets since 2014. Additional reporting by Libby George in London and Henning Gloystein and Roslan Khasawneh in Singapore; editing by Marguerita Choy and David Evans", "external_links": [], "published": "2018-01-10T03:17:00.000+02:00", "crawled": "2018-01-10T03:44:31.011+02:00", "highlightTitle": ""}