{"organizations": [], "uuid": "a0bfb92d8ffc8cba71c624ec05517433a3786a5b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-john-hancock-retirement-plan-services-promotes-mark-sheytanian-to-divisional-vice-president-of-strategic-relationship.html", "country": "US", "domain_rank": 767, "title": "John Hancock Retirement Plan Services Promotes Mark Sheytanian to Divisional Vice President of Strategic Relationship Management for Taft-Hartley Practice", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T18:00:00.000+02:00", "replies_count": 0, "uuid": "a0bfb92d8ffc8cba71c624ec05517433a3786a5b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-john-hancock-retirement-plan-services-promotes-mark-sheytanian-to-divisional-vice-president-of-strategic-relationship.html", "ord_in_thread": 0, "title": "John Hancock Retirement Plan Services Promotes Mark Sheytanian to Divisional Vice President of Strategic Relationship Management for Taft-Hartley Practice", "locations": [], "entities": {"persons": [{"name": "mark she", "sentiment": "neutral"}, {"name": "francolini", "sentiment": "none"}, {"name": "mark", "sentiment": "none"}, {"name": "hancock", "sentiment": "none"}, {"name": "sheytanian", "sentiment": "none"}, {"name": "nick mcparland", "sentiment": "none"}, {"name": "scott francolini", "sentiment": "none"}], "locations": [{"name": "boston", "sentiment": "none"}], "organizations": [{"name": "john hancock retirement plan services", "sentiment": "neutral"}, {"name": "strategic relationship management", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOSTON, Jan. 4, 2018 /PRNewswire/ -- John Hancock Retirement Plan Services (JHRPS) promoted Mark Sheytanian to divisional vice president of Strategic Relationship Management within JHRPS' Taft-Hartley practice. In this role, he is responsible for the Taft-Hartley relationship management team, and reports to Scott Francolini, senior vice president, Strategic Relationship Management, JHRPS. The appointment is effective immediately. Sheytanian succeeds Nick McParland, who was recently promoted to national sales manager for Hancock's Mid/Large/Taft-Hartley markets.\nSheytanian joined JHRPS in 1996 and most recently served as director and strategic relationship manager with the Taft-Hartley Practice, in which he was responsible for managing the overall relationships of Taft-Hartley plans, and ensuring a high level of customer satisfaction for the various fund offices, trustees, investment consultants, and other professionals who work with each plan's board.\n\"This is a great opportunity for Mark, and the right thing for the team, our clients and partners in this segment,\" said Francolini. \"Mark's tenure and experience in the Taft-Hartley marketplace gives him a deep understanding of the unique needs of each stakeholder, and his proven ability to work with all parties involved with these programs will serve him well.\"\nSheytanian received a Bachelor of Science in Political Science from Merrimack College and holds a certificate in Pension Administration and Employee Benefits from Bentley College. He also maintains FINRA Series 6 and 63 registrations and holds a Massachusetts Insurance Producer License\nJohn Hancock offers a Taft-Hartley retirement practice of dedicated, experienced retirement professionals – relationship managers, ERISA consultants, strategic communications consultants and investment services consultants – focused solely on union clients. The team works closely with consultants and trustees to help design and maintain retirement programs that make retirement planning relevant and engaging to members at different career stages.\nJohn Hancock's Taft-Hartley practice team manages more than 92 union plans, $17 billion in assets, and 376,000 participants.\nAbout John Hancock Retirement Plan Services\nJohn Hancock is a leader in the retirement plan services marketplace, servicing more than 57,000 plans and helping more than 2.7 million participants, making it one of the largest full-service providers of 401(k) plans across all plan sizes.\nAbout John Hancock and Manulife\nJohn Hancock is a division of Manulife Financial Corporation, a leading international financial services group that helps people achieve their dreams and aspirations by putting customers' needs first and providing the right advice and solutions. We operate primarily as John Hancock in the United States, and Manulife elsewhere. We provide financial advice, insurance and wealth and asset management solutions for individuals, groups and institutions. Assets under management and administration by Manulife and its subsidiaries were over $1 trillion (US$806 billion) as of September 30, 2017. Manulife Financial Corporation trades as MFC on the TSX, NYSE, and PSE, and under 945 on the SEHK. Manulife can be found at manulife.com .\nOne of the largest life insurers in the United States, John Hancock supports approximately 10 million Americans with a broad range of financial products, including life insurance , annuities , investments, 401(k) plans , and college savings plans . We also offer advice through Signator, a network of independent financial advisors. Additional information about John Hancock may be found at johnhancock.com .\nPR-2018-01\nView original content: http://www.prnewswire.com/news-releases/john-hancock-retirement-plan-services-promotes-mark-sheytanian-to-divisional-vice-president-of-strategic-relationship-management-for-taft-hartley-practice-300577549.html\nSOURCE John Hancock Retirement Plan Services", "external_links": ["http://www.jhinvestments.com/", "http://www.johnhancock.com/", "http://www.prnewswire.com/news-releases/john-hancock-retirement-plan-services-promotes-mark-sheytanian-to-divisional-vice-president-of-strategic-relationship-management-for-taft-hartley-practice-300577549.html", "http://manulife.com/", "http://www.johnhancock.com/products/college-savings.html", "https://www.jhannuities.com/Marketing/default.aspx", "http://www.johnhancock.com/products/401k.html", "http://www.johnhancock.com/products/life-insurance.html"], "published": "2018-01-04T18:00:00.000+02:00", "crawled": "2018-01-04T19:22:32.024+02:00", "highlightTitle": ""}