{"organizations": [], "uuid": "4d2c3b17c68e995e723f972b915ded442510fc05", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-sohu-com-reports-fourth-quarter-and-fiscal-year-2017-unaudited-financial-result.html", "country": "US", "domain_rank": 767, "title": "Sohu.com Reports Fourth Quarter And Fiscal Year 2017 Unaudited Financial Result", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T09:15:00.000+02:00", "replies_count": 0, "uuid": "4d2c3b17c68e995e723f972b915ded442510fc05"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/pr-newswire-sohu-com-reports-fourth-quarter-and-fiscal-year-2017-unaudited-financial-result.html", "ord_in_thread": 0, "title": "Sohu.com Reports Fourth Quarter And Fiscal Year 2017 Unaudited Financial Result", "locations": [], "entities": {"persons": [{"name": "charles zhang", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "sohu", "sentiment": "none"}], "organizations": [{"name": "sohu.com inc.", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING, Jan. 29, 2018 /PRNewswire/ -- Sohu.com Inc. (NASDAQ: SOHU), China's leading online media, video, search and gaming business group, today reported unaudited financial results for the fourth quarter and fiscal year ended December 31, 2017.\nFourth Q uarter Highlights\nTotal revenues were US$510 million 1 , up 24% year-over-year and down 1% quarter-over-quarter. Brand advertising revenues were US$72 million, down 27% year-over-year and 4% quarter-over-quarter. Search and search related advertising revenues were US$247 million, up 62% year-over-year and 10% quarter-over-quarter. Online game revenues were US$109 million, up 15% year-over-year and down 17% quarter-over-quarter.\nFiscal Year 2017 Highlights\nTotal revenues were US$1.86 billion, up 13% compared with 2016. Brand advertising revenues were US$314 million, down 30% compared with 2016. Search and search related advertising revenues were US$801 million, up 34% compared with 2016. Online game revenues were US$450 million, up 14% compared with 2016.\nDr. Charles Zhang, Chairman and CEO of Sohu.com Inc., commented, \"We ended 2017 with an eventful quarter. After fourteen years of great effort, our search subsidiary Sogou finally completed a successful U.S. IPO in November. The IPO has strengthened Sogou's brand and balance sheet and should help us to further expand our market share in China's search industry while developing advanced AI capabilities. For Sohu Media Portal, we have built a stronger product development team and seen encouraging user metrics of Sohu News App. For Sohu Video, 2017 was a transformative year when we shifted our focus to original content and began to significantly cut spending on traditional TV programs. The initiative should generate meaningful cost savings and narrow the losses in our video business in 2018. On the online game side, in 2017 Changyou benefited from the launch of the mobile game Legacy TLBB and achieved solid year-over-year growth in revenue and adjusted net profit. At the same time, the business has not stopped its efforts in developing multiple new mobile games and diversifying its game portfolio.\"\n1 On a constant currency (non-GAAP) basis, if the exchange rate in the fourth quarter of 2017 had been the same as it was in the fourth quarter of 2016, or RMB6.83=US$1.00, US$ total revenues in the fourth quarter of 2017 would have been US$493 million, or US$17 million less than GAAP total revenues, and up 20% year-over-year.\nFourth Quarter Financial Results\nRevenues\nTotal revenues for the fourth quarter of 2017 were US$510 million, up 24% year-over-year and down 1% quarter-over-quarter.\nTotal online advertising revenues, which include revenues from the brand advertising and search and search-related advertising businesses, for the fourth quarter of 2017 were US$319 million, up 27% year-over-year and 6% quarter-over-quarter.\nBrand advertising revenues for the fourth quarter of 2017 totaled US$72 million, down 27% year-over-year and 4% quarter-over-quarter. The year-over-year decrease was mainly due to decreases in video and real estate advertising revenues. The quarter-over-quarter decrease was mainly due to a decrease in video advertising revenues.\nSearch and search-related advertising revenues for the fourth quarter of 2017 were US$247 million, up 62% year-over-year and 10% quarter-over-quarter. The increases were mainly due to healthy traffic growth and improved monetization on the mobile end.\nOnline game revenues for the fourth quarter of 2017 were US$109 million, up 15% year-over-year and down 17% quarter-over-quarter. The year-over-year increase was due to the revenue contribution of Legacy TLBB Mobile. The quarter-over-quarter decrease was due to decreasing revenues of our existing games, including Legacy TLBB Mobile.\nGross Margin\nBoth GAAP and non-GAAP 2 gross margin was 46% for the fourth quarter of 2017, compared with 44% in the fourth quarter of 2016 and 49% in the third quarter of 2017.\nBoth GAAP and non-GAAP gross margin for the online advertising business for the fourth quarter of 2017 was 37%, compared with 33% in the fourth quarter of 2016 and 36% in the third quarter of 2017.\nGAAP gross margin for the brand advertising business in the fourth quarter of 2017 was -16%, compared with 9% in the fourth quarter of 2016 and -1% in the third quarter of 2017. Non-GAAP gross margin for the brand advertising business was -17%, compared with 9% in the fourth quarter of 2016 and -1% in the third quarter of 2017. The year-over-year decrease was mainly due to a decrease in revenues of the video and media portal businesses. The quarter-over-quarter decrease was mainly due to increased video content cost. In the fourth quarter of 2017, the Company recognized impairment charges of approximately US$26 million in video content cost as a result of softer-than-expected video advertising sales.\nBoth GAAP and non-GAAP gross margin for the search and search-related advertising business in the fourth quarter of 2017 was 52%, compared with 48% in the fourth quarter of 2016 and 49% in the third quarter of 2017. The increases were mainly a result of slower growth in costs relative to search and search-related advertising revenues.\nBoth GAAP and non-GAAP gross margin for online games in the fourth quarter of 2017 was 84%, compared with 78% in the fourth quarter of 2016 and 87% in the third quarter of 2017. The year-over-year increase in gross margin was due to Legacy TLBB Mobile, which was launched in the second quarter of 2017 and has a high gross margin as revenue is recognized on a net basis after revenue-sharing with the third-party licensee operator.\n2 Non-GAAP results exclude share-based compensation expense, non-cash tax benefits from excess tax deductions related to share-based awards, impairment loss recognized with respect to available-for-sale securities of an investee that is unrelated to the Company's current business operations, income/expense from the adjustment of contingent consideration previously recorded for acquisitions, dividend and deemed dividend to non-controlling preferred shareholders of Sogou, and a one-time income tax expense, offset by a one-time reduction in liability for deferred U.S. income tax, as a result of the U.S. Tax Reform. Explanation of the Company's non-GAAP financial measures and related reconciliations to GAAP financial measures are included in the accompanying \"Non-GAAP Disclosure\" and \"Reconciliations of Non-GAAP Results of Operation Measures to the Nearest Comparable GAAP Measures.\"\nOperating Expenses\nFor the fourth quarter of 2017, GAAP operating expenses totaled US$275 million, up 19% year-over-year and down 18% quarter-over-quarter. Non-GAAP operating expenses were US$255 million, up 12% year-over-year and down 22% quarter-over-quarter. The year-over-year increase was mainly due to increases in personnel expenses and share-based compensation expense due to a higher market price for the Company's common stock as of December 31, 2017. The quarter-over-quarter change was mainly due to an impairment charge related to Changyou's MoboTap business recognized in the third quarter of 2017.\nOperating Loss\nGAAP operating loss for the fourth quarter of 2017 was US$41 million, compared with an operating loss of US$52 million in the fourth quarter of 2016 and an operating loss of US$81 million in the third quarter of 2017.\nNon-GAAP operating loss for the fourth quarter of 2017 was US$22 million, compared with an operating loss of US$49 million in the fourth quarter of 2016 and an operating loss of US$75 million in the third quarter of 2017.\nIncome Tax Expense\nGAAP income tax expense was US$234 million for the fourth quarter of 2017, compared with income tax expense of US$6 million in the fourth quarter of 2016 and income tax expense of US$16 million in the third quarter of 2017. Income tax expense includes a one-time charge of US$219 million, which represents management's estimate of the amount of U.S. corporate income tax based on the deemed repatriation to the United States of accumulated Sohu earnings mandated by the new U.S. income tax law that went into effect on December 22, 2017 (the \"U.S. Tax Reform\"), offset by a reduction of US$4 million in liability for deferred U.S. income tax as a result of the U.S. Tax Reform. Excluding the one-time charge and one-time reduction, non-GAAP income tax expense for the fourth quarter was US$19 million. The one-time charge for deemed repatriation will be payable by Sohu over an eight-year period commencing April 2019. The actual impact of the U.S. Tax Reform on Sohu may differ from management's estimates, and management may update its judgments based on its review of future regulations or guidance issued by the U.S. Department of the Treasury, and specific actions Sohu may take in the future.\nNet Loss\nBefore deducting the share of net income pertaining to non-controlling interest, GAAP net loss for the fourth quarter of 2017 was US$270 million, compared with a net loss of US$37 million in the fourth quarter of 2016 and net loss of US$102 million in the third quarter of 2017. Before deducting the share of net income pertaining to non-controlling interest, non-GAAP net loss for the fourth quarter of 2017 was US$36 million, compared with a net loss of US$34 million in the fourth quarter of 2016 and net loss of US$90 million in the third quarter of 2017.\nGAAP net loss attributable to Sohu.com Inc. for the fourth quarter of 2017 was US$295 million, or US$7.57 loss per fully-diluted share, compared with a net loss of US$66 million in the fourth quarter of 2016 and net loss of US$104 million in the third quarter of 2017. Non-GAAP net loss attributable to Sohu.com Inc. for the fourth quarter of 2017 was US$78 million, or US$2.01 loss per fully-diluted share, compared with a net loss of US$69 million in the fourth quarter of 2016 and net loss of US$93 million in the third quarter of 2017.\nLiquidity\nAs of December 31, 2017, cash and cash equivalents and short-term investments held by the Sohu Group, minus short-term bank loans, were US$2.12 billion, compared with US$1.30 billion as of December 31, 2016. The cash and cash equivalents and short-term investments balance as of the end of 2017 includes net proceeds of approximately US$622 million from the U.S. IPO of Sogou completed in November 2017.\nFiscal Year 201 7 Financial Results\nRevenues\nTotal revenues for 2017 were US$1.86 billion, up 13% compared with 2016.\nTotal online advertising revenues, which include revenues from the brand advertising and search and search-related advertising businesses, for 2017 were US$1.12 billion, up 7% compared with 2016.\nBrand advertising revenues for 2017 were US$314 million, down 30% compared with 2016. The decrease was mainly due to declines in video and real estate advertising revenues.\nSearch and search-related advertising revenues for 2017 were US$801 million, up 34% compared with 2016. The increase was mainly attributable to healthy traffic growth and improved monetization on the mobile end.\nOnline game revenues for 2017 were US$450 million, up 14% compared with 2016. The increase was mainly due to the revenue contribution of Legacy TLBB Mobile.\nGross Margin\nBoth GAAP and non-GAAP gross margin was 44% for 2017, compared with 48% in 2016.\nBoth GAAP and non-GAAP gross margin for the online advertising business for 2017 was 30%, compared with 37% in 2016.\nBoth GAAP and non-GAAP gross margin for the brand advertising business for 2017 was -16%, compared with 17% in 2016. The decrease was mainly attributable to the decrease in revenues.\nGAAP gross margin for the search and search-related advertising business for 2017 was 48%, compared with 51% in 2016. Non-GAAP gross margin for the search and search-related advertising business for 2017 was 49%, compared with 51% in 2016. The decreases were mainly due to higher traffic acquisition cost as a percentage of search and search-related advertising revenues.\nBoth GAAP and non-GAAP gross margin for online games for 2017 was 86%, compared with 76% in 2016. The increase in gross margin was mainly due to the impact of Legacy TLBB Mobile, a mobile game launched in mid- 2017 that has a relatively high margin.\nOperating Expenses\nFor 2017, GAAP operating expenses totaled US$1.03 billion, up 14% compared with 2016. Non-GAAP operating expenses were US$990 million, up 11% compared with 2016. The increases were primarily due to an increase in personnel expenses and share-based compensation expense due to a higher market price for the Company's common stock as of December 31, 2017 and certain impairment charges recognized in 2017.\nOperating Loss\nGAAP operating loss for 2017 was US$209 million, compared with an operating loss of US$117 million in 2016.\nNon-GAAP operating loss for 2017 was US$164 million, compared with an operating loss of US$98 million in 2016.\nIncome Tax Expense\nGAAP income tax expense for 2017 was US$273 million, compared with income tax expense of US$21 million in 2016. Income tax expense includes a one-time charge of US$219 million in the fourth quarter of 2017, which represents management's estimate of the amount of U.S. corporate income tax based on the deemed repatriation to the United States of accumulated Sohu earnings mandated by the U.S. Tax Reform, offset by a reduction of US$4 million in liability for deferred U.S. income tax as a result of the U.S. Tax Reform. Excluding the one-time charge and one-time reduction, non-GAAP income tax expense for 2017 was US$58 million. The one-time charge for deemed repatriation will be payable by Sohu over an eight-year period commencing April 2019. The actual impact of the U.S. Tax Reform on Sohu may differ from management's estimates, and management may update its judgments based on its review of future regulations or guidance issued by the U.S. Department of the Treasury, and specific actions Sohu may take in the future.\nNet Loss\nBefore deducting the share of net income pertaining to non-controlling interest, GAAP net loss for 2017 was US$470 million, compared with net loss of US$115 million in 2016. Before deducting the share of net income pertaining to non-controlling interest, non-GAAP net loss for 2017 was US$204 million, compared with net loss of US$96 million in 2016.\nGAAP net loss attributable to Sohu.com Inc. for 2017 was US$556 million, or US$14.30 loss per fully-diluted share, compared with a net loss of US$226 million in 2016. Non-GAAP net loss attributable to Sohu.com Inc. for 2017 was US$310 million, or US$7.99 loss per fully-diluted share, compared with a net loss of US$219 million in 2016.\nOther Development\nOn January 27, 2018, the Company promoted acting Chief Financial Officer Joanna Lv to permanent CFO with immediate effect. Joanna has held the position of acting CFO since June 2016, prior to which she was a senior finance director. She joined Sohu in 2000.\nBusiness Outlook\nFor the first quarter of 2018, Sohu estimates:\nTotal revenues to be between US$410 million and US$435 million. Brand advertising revenues to be between US$55 million and US$60 million; this implies an annual decrease of 26% to 32% and a sequential decrease of 16% to 23%. Sogou revenues to be between US$218 million and US$228 million; this implies an annual increase of 35% to 41% and a sequential decrease of 18% to 22%. Online game revenues to be between US$90 million and US$100 million; this implies an annual increase of 5% to 17% and a sequential decrease of 9% to 18%. Before deducting the share of non-GAAP net income pertaining to non-controlling interest, non-GAAP net loss to be between US$45 million and US$55 million. Assuming no new grants of share-based awards and that the market price of our shares is unchanged; we estimate that compensation expense relating to share-based awards will be around US$6 million. Including the impact of these share-based awards, GAAP net loss before non-controlling interest to be between US$51 million and US$61 million . Non-GAAP net loss attributable to Sohu.com Inc. to be between US$65 million and US$75 million, and non-GAAP loss per fully-diluted share to be between US$1.65 and US$1.90. Including the impact of the aforementioned share-based awards, and netting off approximately US$3 million of Sohu's economic interests in Changyou and Sogou, GAAP net loss attributable to Sohu.com Inc. to be between US$68 million and US$78 million, and GAAP loss per fully-diluted share to be between US$1.75 and US$2.00.\nFor the first quarter 2018 guidance, the Company has adopted a presumed exchange rate of RMB6.60=US$1.00, as compared with the actual exchange rate of approximately RMB6.88=US$1.00 for the first quarter of 2017, and RMB6.61=US$1.00 for the fourth quarter of 2017.\nNon-GAAP Disclosure\nTo supplement the unaudited consolidated financial statements presented in accordance with accounting principles generally accepted in the United States of America (\"GAAP\"), Sohu's management uses non-GAAP measures of gross profit, operating profit, net income, net income attributable to Sohu.com Inc. and diluted net income attributable to Sohu.com Inc. per share, which are adjusted from results based on GAAP to exclude the impact of the share-based awards, which consist mainly of share-based compensation expenses and non-cash tax benefits from excess tax deductions related to share-based awards, impairment loss recognized with respect to available-for-sale securities of an investee that is unrelated to the Company's current business operations, income/expense from the adjustment of contingent consideration previously recorded for acquisitions, dividend and deemed dividend to non-controlling preferred shareholders, and a one-time income tax expense, offset by a one-time reduction in liability for deferred U.S. income tax, as a result of the U.S. Tax Reform. These measures should be considered in addition to results prepared in accordance with GAAP, but should not be considered a substitute for, or superior to, GAAP results.\nSohu's management believes excluding share-based compensation expense, impairment loss recognized with respect to available-for-sale securities of an investee that is unrelated to the Company's current business operations, non-cash tax benefits from excess tax deductions related to share-based awards, income/expense from the adjustment of contingent consideration previously recorded for acquisitions, dividend and deemed dividend to non-controlling preferred shareholders, and net one-time tax expense as a result of the U.S. Tax Reform from its non-GAAP financial measure is useful for itself and investors. Further, the impact of share-based compensation expense and impairment loss recognized with respect to available-for-sale securities of an investee that is unrelated to the Company's current business operations, non-cash tax benefits from excess tax deductions related to share-based awards, income/expense from the adjustment of contingent consideration previously recorded for acquisitions, dividend and deemed dividend to non-controlling preferred shareholders, and net one-time tax expense as a result of the U.S. Tax Reform cannot be anticipated by management and business line leaders and these expenses were not built into the annual budgets and quarterly forecasts, which have been the basis for information Sohu provides to analysts and investors as guidance for future operating performance. As the impact of share-based compensation expense and impairment loss recognized with respect to available-for-sale securities of an investee that is unrelated to the Company's current business operations, non-cash tax benefits from excess tax deductions related to share-based awards, income/expense from the adjustment of contingent consideration previously recorded for acquisitions, and dividend and deemed dividend to non-controlling preferred shareholders does not involve subsequent cash outflow or is reflected in the cash flows at the equity transaction level, Sohu does not factor this impact in when evaluating and approving expenditures or when determining the allocation of its resources to its business segments. As a result, in general, the monthly financial results for internal reporting and any performance measures for commissions and bonuses are based on non-GAAP financial measures that exclude share-based compensation expense and impairment loss recognized with respect to available-for-sale securities of an investee that is unrelated to the Company's current business operations, non-cash tax benefits from excess tax deductions related to share-based awards, income/expense from the adjustment of contingent consideration previously recorded for acquisitions, and dividend and deemed dividend to non-controlling preferred shareholders, and also excluded the net one-time tax expense as a result of U.S. Tax Reform.\nThe non-GAAP financial measures are provided to enhance investors' overall understanding of Sohu's current financial performance and prospects for the future. A limitation of using non-GAAP gross profit, operating profit, net income, net income attributable to Sohu.com Inc. and diluted net income attributable to Sohu.com Inc. per share, excluding share-based compensation expense, non-cash tax benefits from excess tax deductions related to share-based awards, income/expense from the adjustment of contingent consideration previously recorded for acquisitions, dividend, and deemed dividend to non-controlling preferred shareholders is that the impact of share-based awards and non-cash tax benefits from excess tax deductions related to share-based awards has been and will continue to be a significant recurring expense in Sohu's business for the foreseeable future, income/expense from the adjustment of contingent consideration previously recorded for acquisitions may recur in the future, and dividend and deemed dividend to non-controlling preferred shareholders may recur when Sohu and its affiliates enter into equity transactions. In order to mitigate these limitations Sohu has provided specific information regarding the GAAP amounts excluded from each non-GAAP measure. The accompanying tables include details on the reconciliation between the GAAP financial measures that are most directly comparable to the non-GAAP financial measures that have been presented.\nNotes to Financial Information\nFinancial information in this press release other than the information indicated as being non-GAAP is derived from Sohu's unaudited interim financial statements prepared in accordance with GAAP.\nSafe Harbor Statement\nThis announcement contains forward-looking statements. It is currently expected that the Business Outlook will not be updated until release of Sohu's next quarterly earnings announcement; however, Sohu reserves right to update its Business Outlook at any time for any reason. Statements that are not historical facts, including statements about Sohu's beliefs and expectations, are forward-looking statements. These statements are based on current plans, estimates and projections, and therefore you should not place undue reliance on them. Forward-looking statements involve inherent risks and uncertainties. We caution you that a number of important factors could cause actual results to differ materially from those contained in any forward-looking statement. Potential risks and uncertainties include, but are not limited to, instability in global financial and credit markets and its potential impact on the Chinese economy; exchange rate fluctuations, including their potential impact on the Chinese economy and on Sohu's reported US dollar results; recent slow-downs in the growth of the Chinese economy; the uncertain regulatory landscape in the People's Republic of China; fluctuations in Sohu's quarterly operating results; Sohu's current and projected future losses due to increased spending by Sohu for video content; the possibilities that Sohu will be unable to recoup its investment in video content and that Changyou will be unable to develop a series of successful games for mobile platforms or successfully monetize mobile games it develops or acquires; Sohu's reliance on online advertising sales, online games and mobile services for its revenues; and the impact of the U.S. Tax Reform. Further information regarding these and other risks is included in Sohu's annual report on Form 10-K for the year ended December 31, 2016 and quarterly report on Form 10-Q for the quarter ended September 30, 2017.\nConference Call and Webcast\nSohu's management team will host a conference call at 8:30 a.m. U.S. Eastern Time, January 29, 2018 (9:30 p.m. Beijing/Hong Kong time, January 29, 2018) following the quarterly results announcement.\nThe dial-in details for the live conference call are:\nUS Toll-Free:\n+1-866-519-4004\nInternational:\n+65-6713-5090\nHong Kong:\n+852-3018-6771\nChina Mainland\n+86-800-819-0121 / +86-400-620-8038\nPasscode:\nSOHU\nPlease dial in 10 minutes before the call is scheduled to begin and provide the passcode to join the call.\nA telephone replay of the call will be available after the conclusion of the conference call at 11:30 a.m. Eastern Time on January 29 through February 5, 2018. The dial-in details for the telephone replay are:\nInternational:\n+1-646-254-3697\nPasscode:\n8285538\nThe live Webcast and archive of the conference call will be available on the Investor Relations section of Sohu's Website at http://investors.sohu.com/ .\nAbout Sohu.com\nSohu.com Inc. (NASDAQ: SOHU) is China's premier online brand and indispensable to the daily life of millions of Chinese, providing a network of Web properties and community based/Web 2.0 products which offer the vast Sohu user community a broad array of choices regarding information, entertainment and communication. Sohu has built one of the most comprehensive matrices of Chinese language web properties and proprietary search engines, consisting of the mass portal and leading online media destination www.sohu.com ; the interactive search engine www.sogou.com ; the developer and operator of online games www.changyou.com/en/ and the leading online video Website tv.sohu.com .\nSohu's corporate services consist of online brand advertising on Sohu's matrix of websites as well as bid listing and home page on its in-house developed search directory and engine. Sohu also provides multiple news and information services on mobile platforms, including Sohu News App and the mobile news portal m.sohu.com . Sohu's online game subsidiary, Changyou.com (NASDAQ: CYOU) develops and operates a diverse portfolio of PC and mobile games, such as Tian Long Ba Bu (\"TLBB\"), one of the most popular PC games in China. Changyou also owns and operates the 17173.com Website, a leading game information portal in China. Sohu's online search subsidiary Sogou (NYSE: SOGO) has grown to become the second largest search engine by mobile queries in China. It also owns and operates Sogou Input Method, the largest Chinese language input software. Sohu.com, established by Dr. Charles Zhang, one of China's internet pioneers, is in its twenty-second year of operation.\nFor investor and media inquiries, please contact:\nIn China:\nMr. Eric Yuan\nSohu.com Inc.\nTel:\n+86 (10) 6272-6593\nE-mail:\nir@contact.sohu.com\nIn the United States\nMs. Linda Bergkamp\nChristensen\nTel:\n+1 (480) 614-3004\nE-mail:\nlbergkamp@christensenir.com\nSOHU.COM INC.\nCONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS\n(UNAUDITED, IN THOUSANDS EXCEPT PER SHARE AMOUNTS)\nThree Months Ended\nTwelve Months Ended\nDec. 31 , 20 17\nSep. 30 , 20 17\nDec. 31 , 20 16\nDec . 3 1, 2017\nDec . 3 1 , 201 6\nRevenues:\nOnline advertising\nBrand advertising\n$\n71,751\n$\n74,832\n$\n98,695\n$\n314,066\n$\n447,956\nSearch and search-related advertising\n247,054\n225,363\n152,500\n801,199\n597,133\nSubtotal\n318,805\n300,195\n251,195\n1,115,265\n1,045,089\nOnline games\n109,383\n132,427\n95,400\n449,533\n395,709\nOthers\n81,442\n83,439\n65,164\n296,164\n209,633\nTotal revenues\n509,630\n516,061\n411,759\n1,860,962\n1,650,431\nCost of revenues:\nOnline advertising\nBrand advertising (includes stock-based c\nompensation expense of $-1,034, $278, $-91,\n$-415 and $163, respectively)\n82,932\n75,733\n89,658\n363,592\n371,085\nSearch and search-related (includes stock-based\ncompensation expense of $535, $0, $168, $540\nand $172, respectively)\n118,683\n115,422\n79,611\n412,904\n290,158\nSubtotal\n201,615\n191,155\n169,269\n776,496\n661,243\nOnline games (includes stock-based compensation\nexpense of $1, $4, $-5, $73 and $31, respectively)\n17,097\n17,560\n20,936\n62,775\n96,168\nOthers\n56,987\n53,679\n41,606\n195,895\n102,389\nTotal cost of revenues\n275,699\n262,394\n231,811\n1,035,166\n859,800\nGross profit\n233,931\n253,667\n179,948\n825,796\n790,631\nOperating expenses:\nProduct development (includes stock-based\ncompensation expense of $14,048, $2,247, $3,383,\n$23,547 and $9,184, respectively)\n122,767\n105,162\n91,499\n412,173\n353,144\nSales and marketing (includes stock-based\ncompensation expense of $3,976, $344, $1,467,\n$5,915 and $2,394, respectively)\n116,179\n111,935\n116,183\n413,045\n434,780\nGeneral and administrative (includes stock-based\ncompensation expense of $1,486, $3,682, $-1,949,\n$15,816 and $7,176, respectively)\n35,829\n31,038\n23,914\n122,874\n119,841\nGoodwill impairment and impairment of intangibles via\nacquisitions of businesses\n-\n86,882\n-\n86,882\n-\nTotal operating expenses\n274,775\n335,017\n231,596\n1,034,974\n907,765\nOperating loss\n(40,844)\n(81,350)\n(51,648)\n(209,178)\n(117,134)\nOther income /(expense)\n4,321\n(5,068)\n6,258\n6,658\n(10,713)\nInterest income\n7,357\n6,497\n5,051\n24,138\n22,499\nInterest expense\n(2,567)\n(1,141)\n(205)\n(4,088)\n(1,356)\nExchange difference\n(4,059)\n(5,032)\n9,257\n(14,385)\n12,803\nLoss before income tax expense\n(35,792)\n(86,094)\n(31,287)\n(196,855)\n(93,901)\nIncome tax expense\n233,785\n15,927\n5,800\n273,148\n21,072\nNet loss\n(269,577)\n(102,021)\n(37,087)\n(470,003)\n(114,973)\nLess: Net income attributable to the noncontrolling i\nnterest shareholders\n24,558\n1,939\n28,810\n84,523\n109,048\nNet loss attributable to Sohu.com Inc.\n(294,135)\n(103,960)\n(65,897)\n(554,526)\n(224,021)\nBasic net loss per share attributable to Sohu.com Inc.\n$\n(7.56)\n$\n(2.67)\n$\n(1.70)\n$\n(14.27)\n$\n(5.79)\nShares used in computing basic net loss per share\nattributable to Sohu.com Inc.\n38,888\n38,877\n38,739\n38,858\n38,706\nDiluted net loss per share attributable to Sohu.com Inc.\n$\n(7.57)\n$\n(2.67)\n$\n(1.71)\n$\n(14.30)\n$\n(5.83)\nShares used in computing diluted net loss per share a\nttributable to Sohu.com Inc.\n38,888\n38,877\n38,739\n38,858\n38,706\nSOHU.COM INC.\nCONDENSED CONSOLIDATED BALANCE SHEETS\n(UNAUDITED, IN THOUSANDS)\nAs of Dec. 31, 2017\nAs of Dec. 31, 2016\nASSETS\nCurrent assets:\nCash and cash equivalents\n$\n1,366,115\n$\n1,050,957\nRestricted cash\n1,908\n-\nShort-term investments\n818,934\n247,926\nAccounts receivable, net\n250,468\n189,167\nPrepaid and other current assets\n192,676\n260,133\nAssets held for sale (a)\n-\n103,079\nTotal current assets\n2,630,101\n1,851,262\nLong-term investments\n90,145\n74,273\nFixed assets, net\n529,717\n503,631\nGoodwill (a)\n71,565\n68,290\nIntangible assets, net\n23,060\n32,131\nRestricted time deposits\n271\n269\nPrepaid non-current assets\n4,211\n4,734\nOther assets\n40,169\n29,100\nTotal assets\n$\n3,389,239\n$\n2,563,690\nLIABILITIES\nCurrent liabilities:\nAccounts payable\n$\n288,394\n$\n193,209\nAccrued liabilities\n343,106\n324,876\nReceipts in advance and deferred revenue\n127,758\n118,951\nAccrued salary and benefits\n102,087\n92,475\nTaxes payable\n96,541\n40,014\nShort-term bank loans\n61,216\n-\nOther short-term liabilities\n136,300\n159,315\nLiabilities held for sale (a)\n-\n3,902\nTotal current liabilities\n$\n1,155,402\n$\n932,742\nLong-term accounts payable\n1,157\n744\nLong-term Bank Loans\n122,433\n-\nLong-term tax liabilities\n293,010\n72,409\nTotal long-term liabilities\n$\n416,600\n$\n73,153\nTotal liabilities\n$\n1,572,002\n$\n1,005,895\nSHAREHOLDERS' EQUITY:\nSohu.com Inc. shareholders' equity\n750,634\n993,580\nNoncontrolling Interest\n1,066,603\n564,215\nTotal shareholders' equity\n$\n1,817,237\n$\n1,557,795\nTotal liabilities and shareholders' equity\n$\n3,389,239\n$\n2,563,690\nNote:\n(a) In the third quarter of 2016, Changyou's management had an intention to divest Changyou's\ninterest in MoboTap. Therefore, the assets and liabilities of MoboTap were recognized as assets-held-for-sale\nand liabilities-held-for-sale, respectively, in Changyou's financial statements for the third and fourth quarters of 2016. In the first quarter of 2017, due to the suspension of negotiations with the potential buyers of MoboTap, Changyou's management determined that the disposal was unlikely to be completed within one year. As a result, the assets-held-for-sale and liabilities-held-for-sale related to MoboTap have been reclassified as assets and liabilities in Changyou's balance sheet since March 31, 2017. In the third quarter of 2017, Changyou recognized impairment charges related to the MoboTap business.\nSOHU.COM INC.\nRECONCILIATIONS OF NON-GAAP RESULTS OF OPERATION MEASURES TO THE NEAREST COMPARABLE GAAP MEASURES\n(UNAUDITED, IN THOUSANDS EXCEPT PER SHARE AMOUNTS)\nThree Months Ended Dec. 31 , 2017\nThree Months Ended Sep. 30 , 2017\nThree Months Ended Dec. 31 , 2016\nGAAP\nNon-GAAP\nAdjustments [3]\nNon-GAAP\nGAAP\nNon-GAAP\nAdjustments\nNon-GAAP\nGAAP\nNon-GAAP\nAdjustments\nNon-GAAP\n(1,034)\n(a)\n278\n(a)\n(91)\n(a)\nBrand advertising gross profit\n$\n(11,181)\n$\n(1,034)\n$\n(12,215)\n$\n(901)\n$\n278\n$\n(623)\n$\n9,037\n$\n(91)\n$\n8,946\nBrand advertising gross margin\n-16%\n-17%\n-1%\n-1%\n9%\n9%\n535\n(a)\n-\n(a)\n168\n(a)\nSearch and search-related\nadvertising gross profit\n$\n128,371\n$\n535\n$\n128,906\n$\n109,941\n$\n-\n$\n109,941\n$\n72,889\n$\n168\n$\n73,057\nSearch and search-related\nadvertising gross margin\n52%\n52%\n49%\n49%\n48%\n48%\n(499)\n(a)\n278\n(a)\n77\n(a)\nOnline advertising gross profit\n$\n117,190\n$\n(499)\n$\n116,691\n$\n109,040\n$\n278\n$\n109,318\n$\n81,926\n$\n77\n$\n82,003\nOnline advertising gross margin\n37%\n37%\n36%\n36%\n33%\n33%\n1\n(a)\n4\n(a)\n(5)\n(a)\nOnline games gross profit\n$\n92,286\n$\n1\n$\n92,287\n$\n114,867\n$\n4\n$\n114,871\n$\n74,464\n$\n(5)\n$\n74,459\nOnline games gross margin\n84%\n84%\n87%\n87%\n78%\n78%\nOthers gross profit\n$\n24,455\n$\n-\n(a) $\n24,455\n$\n29,760\n$\n-\n(a) $\n29,760\n$\n23,558\n$\n-\n(a) $\n23,558\nOthers gross margin\n30%\n30%\n36%\n36%\n36%\n36%\n(498)\n(a)\n282\n(a)\n72\n(a)\nGross profit\n$\n233,931\n$\n(498)\n$\n233,433\n$\n253,667\n$\n282\n$\n253,949\n$\n179,948\n$\n72\n$\n180,020\nGross margin\n46%\n46%\n49%\n49%\n44%\n44%\nOperating expenses\n$\n274,775\n$\n(19,510)\n(a) $\n255,265\n$\n335,017\n$\n(6,273)\n(a) $\n328,744\n$\n231,596\n$\n(2,901)\n(a) $\n228,695\n19,012\n(a)\n6,555\n(a)\n2,973\n(a)\nOperating loss\n$\n(40,844)\n$\n19,012\n$\n(21,832)\n$\n(81,350)\n$\n6,555\n$\n(74,795)\n$\n(51,648)\n$\n2,973\n$\n(48,675)\nOperating margin\n-8%\n-4%\n-16%\n-14%\n-13%\n-12%\nIncome tax expense\n$\n(233,785)\n$\n214,819\n$\n(18,966)\n$\n15,927\n$\n-\n$\n15,927\n$\n5,800\n$\n-\n$\n5,800\n233,831\n(a)\n12,309\n(a)\n2,973\n(a)\nNet loss before non-controlling interest\n$\n(269,577)\n$\n233,831\n$\n(35,746)\n$\n(102,021)\n$\n12,309\n$\n(89,712)\n$\n(37,087)\n$\n2,973\n$\n(34,114)\n19,012\n(a)\n6,555\n(a)\n2,973\n(a)\n(17,545)\n(b)\n(1,017)\n(b)\n(6,051)\n(b)\n-\n5,754\n(c)\n-\n214,819\n(d)\n-\n-\nNet loss attributable to\nSohu.com Inc. for diluted net\nloss per share\n$\n(294,543)\n$\n216,286\n(78,257)\n$\n(103,960)\n$\n11,292\n$\n(92,668)\n$\n(66,411)\n$\n(3,078)\n$\n(69,489)\nDiluted net loss per share\nattributable to Sohu.com Inc.\n$\n(7.57)\n(2.01)\n$\n(2.67)\n$\n(2.38)\n$\n(1.71)\n$\n(1.79)\nShares used in computing\ndiluted net loss per share\nattributable to Sohu.com Inc.\n38,888\n38,888\n38,877\n38,877\n38,739\n38,739\nNote:\n(a) To eliminate the impact of share-based awards as measured using the fair value method.\n(b) To adjust Sohu's economic interests in Changyou and Sogou attributable to the above non-GAAP adjustments.\n(c) To adjust impairment loss of available-for-sale securities of an investee that is unrelated to the Company's current business operations\n(d) To adjust for one-time effect of the U.S. Tax Reform.\n3 Above Non-GAAP adjustment does not have impact on income tax expense.\nSOHU.COM INC.\nRECONCILIATIONS OF NON-GAAP RESULTS OF OPERATION MEASURES TO THE NEAREST COMPARABLE GAAP MEASURES\n(UNAUDITED, IN THOUSANDS EXCEPT PER SHARE AMOUNTS)\nTwelve Months Ended Dec. 31 , 201 7\nTwelve Months Ended Dec. 31 , 201 6\nGAAP\nNon-GAAP\nAdjustments [4]\nNon-GAAP\nGAAP\nNon-GAAP\nAdjustments\nNon-GAAP\n(415)\n(a)\n163\n(a)\nBrand advertising gross profit\n$\n(49,526)\n$\n(415)\n$\n(49,941)\n$\n76,871\n$\n163\n$\n77,034\nBrand advertising gross margin\n-16%\n-16%\n17%\n17%\n540\n(a)\n172\n(a)\nSearch and search-related\nadvertising gross profit\n$\n388,295\n$\n540\n$\n388,835\n$\n306,975\n$\n172\n$\n307,147\nSearch and search-related\nadvertising gross margin\n48%\n49%\n51%\n51%\n125\n(a)\n335\n(a)\nOnline advertising gross profit\n$\n338,769\n$\n125\n$\n338,894\n$\n383,846\n$\n335\n$\n384,181\nOnline advertising gross margin\n30%\n30%\n37%\n37%\n73\n(a)\n31\n(a)\nOnline games gross profit\n$\n386,758\n$\n73\n$\n386,831\n$\n299,541\n$\n31\n$\n299,572\nOnline games gross margin\n86%\n86%\n76%\n76%\nOthers gross profit\n$\n100,269\n$\n-\n(a)$\n100,269\n$\n107,244\n$\n-\n(a)$\n107,244\nOthers gross margin\n34%\n34%\n51%\n51%\n198\n(a)\n366\n(a)\nGross profit\n$\n825,796\n$\n198\n$\n825,994\n$\n790,631\n$\n366\n$\n790,997\nGross margin\n44%\n44%\n48%\n48%\nOperating expenses\n$\n1,034,974\n$\n(45,278)\n(a)$\n989,696\n$\n907,765\n$\n(18,754)\n(a)$\n889,011\n45,476\n(a)\n19,120\n(a)\nOperating loss\n$\n(209,178)\n$\n45,476\n$\n(163,702)\n$\n(117,134)\n$\n19,120\n$\n(98,014)\nOperating margin\n-11%\n-9%\n-7%\n-6%\nIncome tax expense\n$\n(273,148)\n$\n214,819\n$\n(58,329)\n$\n21,072\n$\n-\n$\n21,072\n45,476\n(a)\n19,118\n(a)\n5754\n(c)\n-\n(c)\n214,819\n(d)\n-\nNet loss before\nnon-controlling interest\n$\n(470,003)\n$\n266,049\n$\n(203,954)\n$\n(114,973)\n$\n19,118\n$\n(95,855)\n45,476\n(a)\n19,118\n(a)\n(20,624)\n(b)\n(12,260)\n(b)\n5754\n(c)\n-\n214,819\n(d)\n-\nNet loss attributable to\nSohu.com Inc for diluted net\nloss per share\n$\n(555,791)\n$\n245,425\n$\n(310,366)\n$\n(225,660)\n$\n6,858\n$\n(218,802)\nDiluted net loss per share\nattributable to Sohu.com Inc.\n$\n(14.30)\n$\n(7.99)\n$\n(5.83)\n$\n(5.65)\nShares used in computing\ndiluted net loss per share\nattributable to Sohu.com Inc.\n38,858\n38,858\n38,706\n38,706\nNote:\n(a) To eliminate the impact of share-based awards as measured using the fair value method.\n(b) To adjust Sohu's economic interests in Changyou and Sogou attributable to the above non-GAAP adjustments.\n(c) To adjust impairment loss of available-for-sale securities of an investee that is unrelated to the Company's current business operations.\n(d) To adjust for the one-time effect of the U.S. Tax Reform.\n4 Above Non-GAAP adjustment does not have impact on income tax expense\nView original content: http://www.prnewswire.com/news-releases/sohucom-reports-fourth-quarter-and-fiscal-year-2017-unaudited-financial-result-300589320.html\nSOURCE Sohu.com", "external_links": ["http://www.changyou.com/en/", "http://www.prnewswire.com/news-releases/sohucom-reports-fourth-quarter-and-fiscal-year-2017-unaudited-financial-result-300589320.html", "http://investors.sohu.com/"], "published": "2018-01-29T09:15:00.000+02:00", "crawled": "2018-01-29T10:27:56.012+02:00", "highlightTitle": ""}