{"organizations": [], "uuid": "c40c9aa89b149a8a2f49fe98b0db14e456f1a1ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 27}, "facebook": {"likes": 43, "shares": 43, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/gettyimages-614357234.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/31/bitcoin-cryptocurrency-zcash-buy-invest/", "country": "US", "domain_rank": 1196, "title": "Bitcoin Giant Grayscale: Zcash Crypto Could Hit $60K in 2025 | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.579, "site_type": "news", "published": "2018-01-31T12:31:00.000+02:00", "replies_count": 0, "uuid": "c40c9aa89b149a8a2f49fe98b0db14e456f1a1ad"}, "author": "Robert Hackett", "url": "http://fortune.com/2018/01/31/bitcoin-cryptocurrency-zcash-buy-invest/", "ord_in_thread": 0, "title": "Bitcoin Giant Grayscale: Zcash Crypto Could Hit $60K in 2025 | Fortune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Robert Hackett 10:31 AM EST \nIn a market as berserk as the one for cryptocurrencies, every gambler wants to know which horses are worth betting on. \nIn the fall Grayscale Investments , an asset manager and subsidiary of Digital Currency Group, one of the biggest cryptocurrency-focused venture capital firms, added a third fund of virtual coins to its portfolio of offerings: the privacy-focused digital money Zcash . Now the company is releasing its investment thesis —a document that explains the reasoning behind its selection—to the masses. \nThe author, Matthew Beck, an associate at Grayscale, uses some financial modeling to project that one Zcash token could be worth more than $60,000 in 2025, up from just under $400 today. That’s roughly a 150-fold increase. \nBut this hypothetical scenario comes with a major caveat. Beck is assuming that Zcash comes to represent 10% of all offshore wealth by that time—a huge and by no means qualified “if.” \nIf Zcash comes to represent 1% of all offshore wealth by 2025, the price per coin could reach more than $6,000, Beck writes. \nThe author hedges, however, in blaring all caps, that “THE FUTURE ZEC PRICES SHOWN ARE PURELY HYPOTHETICAL AND SPECIFICALLY ASSUME THAT ZEC PRICES WILL INCREASE…NO REPRESENTATION IS BEING MADE THAT ANY RESULTS WILL OR ARE LIKELY TO ACHIEVE PRICES SIMILAR TO THOSE SHOWN.” \nFortune profiled the team behind Zcash in its “Investor’s Guide” issue at the end of last year. (You can read that story here .) \nGrayscale sponsors several cryptocurrency investment trusts, or funds that give shareholders stakes in pools of digital assets. In addition to Zcash, Grayscale oversees funds for Bitcoin , the original cryptocurrency, and Ethereum Classic , a spinoff from the second-highest valued blockchain network Ethereum . The company benefits from investors piling onto the cryptocurrency market mania. \nFor investors looking to get their hands on what may prove to be the next hot cryptocurrency investment (or not), sorting through the security, regulatory, and vetting challenges can be daunting. With its funds, Grayscale aims to provide access to certain crypto assets—many of which have soared to spectacular, speculative heights in recent months—to wealthy individuals (that is, accredited investors, or people who have made $200,000 annually for the two most recent years or who have a net worth exceeding $1 million). \nGrayscale previewed its new paper, which lays out the company’s “latest conviction investment opportunity” in Zcash, with Fortune . Here are three reasons the company provides in support of its dizzying appraisal. 1. Similar to Bitcoin \nGrayscale’s first reason for getting behind Zcash is that it doesn’t try to reinvent the wheel. The paper praises Zcash for “preserving what Bitcoin got right.” That includes various aspects of the economic model (limited supply, disinflationary), which seem to make Zcash a potential store of value, like gold, as well as the technology (decentralization, immutable record-keeping), which helped Bitcoin achieve its place at the top of the cryptokingdom with a price exceeding $10,000 at press time. \nGrayscale describes Zcash’s attributes as “similar to precious metals, BTC [Bitcoin], and ETC [Ethereum Classic], making it an inflation hedge over long-term investment horizons.” ( Fortune detailed this argument—the analogy between cryptocurrencies and gold—in depth for a January cover story .) \nBut anyone can clone Bitcoin—it’s as simple as copying the codebase and hosting an ICO, or initial coin offering. The differences between Zcash and Bitcoin (and other cryptocurrencies) are where the analysis gets more interesting. 2. Privacy \nZcash has pioneered a cutting-edge privacy technology, called “zk-SNARKs,” which enables everyone on the Zcash network to verify financial transactions as legitimate even where portions of the blockchain, or the shared record of Zcash payments, remain encrypted, thus masking details such as origin, destination, and sum exchanged from view. Grayscale suggests that this innovation improves upon the Bitcoin blockchain which, in contrast, leaves all those data visible. “We think of ZEC as the first globally accessible ‘offshore’ investment opportunity, or a Swiss bank account in your pocket, so to speak,” Grayscale says. \nIn other words, the cryptocurrency has added privacy assurances similar to those traditionally afforded in foreign jurisdictions like Switzerland. In fact, Grayscale says Zcash can be considered an improvement on Swiss banking, since the network is more accessible to less wealthy individuals and is decentralized. With Zcash, “there is no single point of failure. Investors are not bound to the success or failure of a single entity, political regime, or economy”—as they are in Switzerland. This is the major argument in support of Grayscale’s eye-popping $60,000 hypothetical price projection. 3. Fungibility \nAn added benefit of Zcash’s optional privacy is that it enables any Zcash token to be traded like any other Zcash token. So-called private transactions allow users to obscure the details of their payments and therefore help prevent anyone from discriminating between coins based on their history. This property, known as fungibility, is “necessary in order for [a currency] to become a liquid medium of exchange,” Beck says. \nThis is how traditional cash works; no one should know where past dollars were spent. “Since the absence of knowledge about the source or prior use of ZEC is generally accepted as a feature of the Zcash Network, the costs of accepting all ZEC are the same,” Beck writes. Bitcoin, on the other hand, forever records the provenance of its coins, thereby opening up the possibility for discrimination. \nGrayscale includes other reasons for betting on Zcash: the expertise of the team behind it, its partnership with J.P. Morgan Chase (jpm) , and the potential for Zcash to be used in global trade. \nThere are, of course, reasons to steer clear of cryptocurrencies aside from the vertiginous price swings: security risks, market adoption uncertainties, unsettled regulations. But investors with an appetite for risk may want in anyway. \nOne investor, Linda Xie, founder of Scalar Capital, a cryptocurrency hedge fund, and alum of the Bitcoin exchange Coinbase , tells Fortune , “I’m bullish on Zcash.” \n“Privacy is one of the most undervalued and misunderstood features of cryptocurrencies,” she adds. \nGet Data Sheet , Fortune’s technology newsletter. \nGrayscale seems to agree. “ZEC could become the dominant digital currency for privatized wealth storage and transactions,” Beck writes in his paper. “On the other hand, BTC may continue to be the dominant peer-to-peer digital currency, but will likely require users to sacrifice more privacy as it gains mainstream adoption and regulatory acceptance around the world.” \nGrayscale says it plans to provide a public quotation on the share prices for its Zcash Investment Trust by the end of 2018. The company has plans to create five new cryptocurrency funds (four single asset-specific and one basket) by the end of the first quarter of the year. SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-31T12:31:00.000+02:00", "crawled": "2018-01-31T18:50:15.022+02:00", "highlightTitle": ""}