{"organizations": [], "uuid": "53e341499160c9adda5419f4e8211b2d533913e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "", "section_title": "", "url": "https://www.reuters.com/article/us-usa-holidayshopping/u-s-holiday-sales-set-to-break-records-in-surprise-boon-to-retail-idUSKBN1EK1BG", "country": "US", "domain_rank": 408, "title": "U.S. holiday sales set to break records", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.081, "site_type": "news", "published": "2017-12-26T02:14:00.000+02:00", "replies_count": 0, "uuid": "53e341499160c9adda5419f4e8211b2d533913e2"}, "author": "", "url": "https://www.reuters.com/article/us-usa-holidayshopping/u-s-holiday-sales-set-to-break-records-in-surprise-boon-to-retail-idUSKBN1EK1BG", "ord_in_thread": 0, "title": "U.S. holiday sales set to break records", "locations": [], "entities": {"persons": [{"name": "shelley kohan", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "mastercard inc.", "sentiment": "none"}, {"name": "amazon.com inc.", "sentiment": "none"}, {"name": "amzn", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Economic Insight Markets \nThe U.S. holiday shopping season is on track to break sales records on the back of surging consumer confidence and increased use of mobile devices, presenting an unexpected boon for retailers and the delivery companies they rely on. \nThe holiday shopping season, a crucial period for retailers that can account for up to 40 percent of annual sales, brought record-breaking online and in-store spending this year of more than $800 billion, according to MasterCard Inc.'s ( MA ) analytics arm. Read relevant legal disclosures \nStakes are particularly high this year for traditional retailers that have invested heavily in technology and free delivery and returns, determined to stay relevant in a market increasingly dominated by Amazon.com Inc. ( AMZN ). \n\"It has been an extremely positive holiday season in terms of sales both for brick-and-mortar and for online businesses,\" said Shelley Kohan, a Retail Fellow at analytics firm RetailNext. \nPreliminary numbers show total holiday sales will exceed RetailNext's initial forecast of a 3.8 percent increase from last year. \"All the economic indicators were very strong, and so I think consumers were more willing to open up their wallets and purses and spend more,\" Kohan added. \nRetailNext and most other analytics firms and industry groups — including Adobe Analytics and the National Retail Federation — are due to publish holiday sales data in January. \nMastercard Inc. said on Tuesday that a late-season rally had driven an 18.1 percent rise in online sales. Department store chain Macy's Inc. ( M ) and Target Corp. ( TGT ) both noted increased activity during that time. \nTarget spokesman Joshua Thomas told Reuters that during the week before Christmas the company had seen a marked increase in shoppers picking up online orders in stores, while Macy's spokeswoman Blair Rosenberg said last-minute shoppers boosted fragrance sales during that period. \nThe S&P retail index ( .RLX ) was flat on Wednesday. \nRising consumer confidence gave an unexpected boost to retailers during this holiday shopping season. Santa's little helpers \nPackage delivery companies that handle returns for retailers have benefited from booming delivery volumes in recent years, but also have had to invest billions of dollars to upgrade and expand their networks to cope as e-commerce purchases surge to new heights. \nDelivering individual packages to shoppers — and picking up returns — is a lower margin business for delivery companies, which make more when they deliver in bulk to businesses. \nUnited Parcel Service Inc. ( UPS ), the world's largest package delivery company, said on Wednesday it was on track to return a record number of packages this holiday, having handled more than 1 million returns to retailers daily in December. \nThat pace is expected to continue into early January, UPS said, and would likely peak at 1.4 million on Jan. 3, which would be a fifth consecutive annual record, up 8 percent from this year. \nRival FedEx Corp. ( FDX ) said it experienced another record-breaking peak shipping season, but declined to provide specifics. The company's Chief Marketing Officer Rajesh Subramaniam told analysts last week about 15 percent of all goods purchased online are returned, with apparel running at about 30 percent. \nUPS has worked for years to increase its ability to forecast customer shipping demands to handle major package volume spikes ahead of the holidays. It has also raised shipping rates and added 2018 peak-season surcharges. \nThe returns delivered in 2017 are part of the 750 million packages UPS said it expects to deliver globally during the peak shipping season from the U.S. Thanksgiving holiday through New Year's Eve. That is an increase of nearly 40 million over the previous year. \nUPS and FedEx shares both ended up slightly on Wednesday. For more news you can use to help guide your financial life, visit our Insights page . © Reuters 2018. All rights reserved. Republication or redistribution of Reuters content, including by caching, framing or similar means, is expressly prohibited without the prior written consent of Reuters. Reuters and the Reuters sphere logo are registered trademarks and trademarks of the Reuters group of companies around the world. Votes are submitted voluntarily by individuals and reflect their own opinion of the article's helpfulness. A percentage value for helpfulness will display once a sufficient number of votes have been submitted. Send to (Separate multiple e-mail addresses with commas) Please enter a valid e-mail address Your E-Mail Address Please enter a valid e-mail address Message (Optional) Important legal information about the e-mail you will be sending. By using this service, you agree to input your real e-mail address and only send it to people you know. It is a violation of law in some jurisdictions to falsely identify yourself in an e-mail. All information you provide will be used by Fidelity solely for the purpose of sending the e-mail on your behalf.The subject line of the e-mail you send will be \"Fidelity.com: \" Your e-mail has been sent. ", "external_links": [], "published": "2017-12-26T02:14:00.000+02:00", "crawled": "2018-01-03T08:05:29.110+02:00", "highlightTitle": ""}