{"organizations": [], "uuid": "17c152320855808f147ad662cced40f54589835d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-nuvasive-announces-preliminary-unaudited-full-year-2017-revenue-results-and-preliminary-2018-outlook.html", "country": "US", "domain_rank": 767, "title": "NuVasive Announces Preliminary Unaudited Full Year 2017 Revenue Results And Preliminary 2018 Outlook", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-08T16:30:00.000+02:00", "replies_count": 0, "uuid": "17c152320855808f147ad662cced40f54589835d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-nuvasive-announces-preliminary-unaudited-full-year-2017-revenue-results-and-preliminary-2018-outlook.html", "ord_in_thread": 0, "title": "NuVasive Announces Preliminary Unaudited Full Year 2017 Revenue Results And Preliminary 2018 Outlook", "locations": [], "entities": {"persons": [], "locations": [{"name": "san diego", "sentiment": "none"}, {"name": "puerto rico", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "nuva", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO, Jan. 8, 2018 /PRNewswire/ -- NuVasive, Inc. (NASDAQ: NUVA), the leader in spine technology innovation, focused on transforming spine surgery with minimally disruptive, procedurally-integrated solutions, today announced preliminary unaudited revenue results for the fourth quarter and full year 2017. The Company expects fourth quarter 2017 revenue to be approximately $272 million and full year 2017 revenue to be approximately $1,030 million and in line with the guidance provided on Oct 24, 2017.\nNuVasive preliminary revenue results for full year 2017 reflect approximately 7% growth on a reported and constant currency basis, compared to revenue of $962 million for 2016. When NuVasive updated its full year 2017 financial guidance on Oct. 24 to reflect third-quarter 2017 results, the Company assumed international revenue growth of over 20 percent, a lingering impact of Hurricane Maria in Puerto Rico in the fourth quarter and softer U.S. procedural volumes continuing into the fourth quarter. Those assumptions have remained unchanged.\nThe Company will report full year 2017 financial results and provide its full financial outlook for 2018 during its earnings announcement planned for mid-February.\n\"NuVasive launched a record number of new technologies in 2017 and accelerated growth across the globe delivering more than a 20 percent sales increase outside the United States for the fifth sequential quarter,\" said Gregory T. Lucier, chairman and chief executive officer of NuVasive. \"What's impressive is this success has occurred in a year when the overall U.S. spine market has softened. Whether through game-changing product introductions or strategic acquisitions, we intend to deliver the most innovative and comprehensive spine solutions to our customers so they can best serve their patients. We will continue this momentum in 2018.\"\n2018 Preliminary Outlook\nThe Company's preliminary outlook for 2018 includes full year revenue growth in the mid-single digits over 2017 revenue results, at least 100 basis points of expansion in non-GAAP operating margin, adjusted EBITDA now in a range of approximately $290 to $300 million, and a substantial tax savings resulting from the tax reform legislation passed late in 2017.\nWhen the Company provides its full financial outlook for 2018, it will include the expected financial impact of the Company's acquisition of SafePassage. In Dec. 2017, NuVasive announced it had entered into an agreement to acquire SafePassage to bolster its NuVasive Clinical Services™ business and solidify its leadership position as the largest provider of outsourced intraoperative neuromonitoring (IONM) services. This joining of forces will strengthen the NuVasive IONM business line with more than 550 neurophysiologists and oversight physicians in the U.S.—allowing for the delivery of services to over 1,000 customers and 3,000 surgeons. The acquisition of SafePassage remains on track and is anticipated to close in Jan. 2018, subject to customary closing conditions.\nThe Company will also provide additional commentary on the expected impact of U.S. tax reform. NuVasive expects to realize substantial tax savings as a result of the recent passage of the tax bill, An Act to provide for reconciliation pursuant to titles II and V of the concurrent resolution on the budget for fiscal year 2018, which provides for a reduction of the U.S. corporate tax rate from 35 percent to approximately 21 percent. The legislation is poised to significantly reduce the future corporate tax rate for NuVasive, which prior to the enactment of the tax overhaul was expected to be approximately 33 percent on a non-GAAP basis in 2018.\nAbout NuVasive\nNuVasive, Inc. (NASDAQ: NUVA) is the leader in spine technology innovation, focused on transforming spine surgery and beyond with minimally disruptive, procedurally-integrated solutions designed to deliver reproducible and clinically-proven surgical outcomes. The Company's portfolio includes access instruments, implantable hardware, biologics, software systems for surgical planning, navigation and imaging solutions, magnetically adjustable implant systems for spine and orthopedics, and intraoperative monitoring service offerings. With $962 million in revenues (2016), NuVasive has an approximate 2,300 person workforce in more than 40 countries serving surgeons, hospitals and patients. For more information, please visit www.nuvasive.com .\nForward-Looking Statements\nNuVasive cautions you that statements included in this news release that are not a description of historical facts are forward-looking statements that involve risks, uncertainties, assumptions and other factors which, if they do not materialize or prove correct, could cause NuVasive's results to differ materially from historical results or those expressed or implied by such forward-looking statements. Forward-looking statements include, but are not limited to, statements regarding the Company's expected revenue results for the fourth quarter and full year 2017, financial projections and goals for 2018, the timing of the anticipated acquisition of SafePassage, including the potential benefits of the acquisition, and the anticipated impact of the new tax law. The forward-looking statements contained herein are based on the current expectations and assumptions of NuVasive and not on historical facts. The Company's expectations for fourth quarter and full year 2017 revenue results are preliminary and unaudited and are subject to adjustment in the ongoing review and audit procedures by the Company's external auditors. The following important factors, among others, could cause actual results to differ materially from those set forth in the forward-looking statements: the completion of the audit of the Company's 2017 financial results, including the risk of adjustment to its preliminary fourth quarter and full year revenue results; the satisfaction of conditions to closing the agreement to acquire SafePassage, including the risk that any required conditions are not satisfied, are delayed or are subject to unanticipated conditions that could adversely affect the combined company or the expected benefits of the acquisition; the risk that NuVasive's estimates and projections related to financial and operating goals for 2018 and future tax and financial and operating results may turn out to be inaccurate because of the preliminary nature of the Company's forecasts; the risk of further adjustment to future financial expectations; unanticipated difficulty in selling products, generating revenue or producing expected profitability; and those other risks and uncertainties more fully described in the Company's news releases and periodic filings with the Securities and Exchange Commission. NuVasive's public filings with the Securities and Exchange Commission are available at www.sec.gov . NuVasive assumes no obligation to update any forward-looking statement to reflect events or circumstances arising after the date on which it was made.\nView original content with multimedia: http://www.prnewswire.com/news-releases/nuvasive-announces-preliminary-unaudited-full-year-2017-revenue-results-and-preliminary-2018-outlook-300578782.html\nSOURCE NuVasive, Inc.", "external_links": ["http://www.nuvasive.com/", "http://www.prnewswire.com/news-releases/nuvasive-announces-preliminary-unaudited-full-year-2017-revenue-results-and-preliminary-2018-outlook-300578782.html", "http://www.sec.gov/"], "published": "2018-01-08T16:30:00.000+02:00", "crawled": "2018-01-08T19:38:18.000+02:00", "highlightTitle": ""}