{"organizations": [], "uuid": "2063f0cacda88a2911e8c1941511d65e31bac3ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-teamhealth-acquires-x32-healthcare-and-appoints-jody-crane-md-mba-chief-clinical-officer-for-emergency-medicine.html", "country": "US", "domain_rank": 767, "title": "TeamHealth Acquires X32 Healthcare Appoints Jody Crane, MD, MBA, Chief Clinical Officer for Emergency Medicine", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-04T18:57:00.000+02:00", "replies_count": 0, "uuid": "2063f0cacda88a2911e8c1941511d65e31bac3ff"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-teamhealth-acquires-x32-healthcare-and-appoints-jody-crane-md-mba-chief-clinical-officer-for-emergency-medicine.html", "ord_in_thread": 0, "title": "TeamHealth Acquires X32 Healthcare Appoints Jody Crane, MD, MBA, Chief Clinical Officer for Emergency Medicine", "locations": [], "entities": {"persons": [{"name": "jody crane", "sentiment": "negative"}, {"name": "teamhealth", "sentiment": "none"}, {"name": "crane", "sentiment": "none"}, {"name": "joseph t. \"jody\" crane", "sentiment": "none"}], "locations": [{"name": "tenn.", "sentiment": "none"}, {"name": "knoxville", "sentiment": "none"}], "organizations": [{"name": "x32 healthcare", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KNOXVILLE, Tenn., Jan. 4, 2018 /PRNewswire/ -- TeamHealth, a leading clinician services organization, announced the acquisition of X32 Healthcare. X32 Healthcare, a leading emergency department performance improvement consulting practice, offers innovative and proven business concepts for healthcare facilities and systems that support patient-focused strategies while improving throughput, quality care delivery and patient experience. X32 also provides robust educational courses, expert-driven consulting programs and best-in-class analytical tools. Additionally, TeamHealth announced the appointment of Joseph T. \"Jody\" Crane, MD, MBA, principal and owner of X32 Healthcare, as the company's chief clinical officer of emergency medicine. In this role, Dr. Crane will support clinical quality and safety for the company's emergency medicine service line, performance improvement and innovation initiatives, leadership development programs, performance analytics and workforce development.\n\"Dr. Crane is a well-known industry thought leader in the field of emergency department operations, and he will bring immense value to our team as we continue to invest in best-in-class resources to help drive clinical quality and safety, performance improvement and leadership development to better serve patients, clinicians and client partners,\" said Michael A. Wiechart, executive vice president and chief operating officer of TeamHealth. \"The addition of X32 to TeamHealth's strong performance improvement resources will further strengthen our clinical education opportunities and enhance operational excellence through comprehensive, evidence-based analytics.\"\n\"I am thrilled to join TeamHealth in the new role of chief clinical officer of emergency medicine and to bring X32's performance analytics and lean healthcare concepts to the organization to advance patient care,\" said Dr. Crane. \"As a physician-lead organization, TeamHealth has a nearly 40-year history of delivering excellent care to patients and building solid relationships with client partners. Aligning X32's suite of performance tools and consulting resources with TeamHealth's long-standing commitment to quality and safety, we will continue to enhance the patient experience by delivering value-added and innovative solutions to the nearly 800 acute facilities TeamHealth serves.\"\nDr. Crane received his undergraduate degree from the University of Virginia and medical degree from Medical College of Virginia. He is currently a board-certified practicing emergency physician. Considered one of the leading experts in emergency department operations in the U.S., Dr. Crane has taught and led healthcare and emergency department improvement efforts with hundreds of organizations in a wide variety of settings on six continents. Dr. Crane began his career at Mary Washington Healthcare from 2000 to 2012, where he served as director of operations for his emergency medicine physician group, senior medical director for Stafford Hospital and a member of the Mary Washington Healthcare Board of Trustees. In 2012, Dr. Crane was recruited to work for the Mid-Atlantic Permanente Medical Group as associate regional medical director with oversight of acute care services, telemedicine, innovation and Medicare/Medicaid for Virginia, Maryland and Washington, D.C. In December 2014, Dr. Crane took the position of chief clinical officer for the emergency medicine division of Sheridan Healthcare. Dr. Crane graduated from the Physician Executive MBA Program in 2004 at the University of Tennessee, where he remains on faculty teaching healthcare operations and leadership. Dr. Crane is also an emergency medicine faculty member for The Institute for Healthcare Improvement and serves as an advisor for the National Institute for Health Research's Collaboration for Leadership in Applied Health Research and Care in Northwest London. He is also a faculty member of the American College of Emergency Physicians ED Directors' Academy. He has served as principal and owner of X32 Healthcare since 2008.\nTo learn more about X32 Healthcare, visit https://www.x32healthcare.com/ .\nAbout TeamHealth\nAt TeamHealth , our purpose is to perfect our physicians' ability to practice medicine, every day, in everything we do. Through our more than 20,000 affiliated physicians and advanced practice clinicians, TeamHealth offers outsourced emergency medicine, hospital medicine, critical care, anesthesiology, orthopedic hospitalist, acute care surgery, obstetrics and gynecology hospitalist, ambulatory care, post-acute care and medical call center solutions to more than 3,200 acute and post-acute facilities and physician groups nationwide. Our philosophy is as simple as our goal is singular: we believe better experiences for physicians lead to better outcomes—for patients, hospital partners and physicians alike. Join our team ; we value and empower clinicians. Partner with us ; we deliver on our promises. Learn more at www.teamhealth.com .\nThe term \"TeamHealth\" as used throughout this release includes Team Health Holdings, Inc., its subsidiaries, affiliates, affiliated medical groups and providers, all of which are part of the TeamHealth organization. \"Providers\" are physicians, advanced practice clinicians and other healthcare providers who are employed by or contract with subsidiaries or affiliated entities of Team Health Holdings, Inc. All such providers exercise independent clinical judgment when providing patient care. Team Health Holdings, Inc., does not have any employees, does not contract with providers and does not practice medicine.\nView original content with multimedia: http://www.prnewswire.com/news-releases/teamhealth-acquires-x32-healthcare-and-appoints-jody-crane-md-mba-chief-clinical-officer-for-emergency-medicine-300577687.html\nSOURCE TeamHealth", "external_links": ["http://www.prnewswire.com/news-releases/teamhealth-acquires-x32-healthcare-and-appoints-jody-crane-md-mba-chief-clinical-officer-for-emergency-medicine-300577687.html", "https://www.x32healthcare.com/", "http://www.teamhealth.com/", "https://www.teamhealth.com/", "https://www.teamhealth.com/join-teamhealth", "https://www.teamhealth.com/what-we-do"], "published": "2018-01-04T18:57:00.000+02:00", "crawled": "2018-01-04T19:22:19.001+02:00", "highlightTitle": ""}