{"organizations": [], "uuid": "da1e2dd5bddda84d73210ef4eaa463bdf6dfffa6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/southkorea-forex/update-2-s-korea-govt-suspected-of-buying-dollar-as-won-shoots-to-3-yr-high-idUSL4N1P31JG", "country": "US", "domain_rank": 408, "title": "REFILE-UPDATE 2-S.Korea govt suspected of buying dollar as won shoots to 3-yr high", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.026, "site_type": "news", "published": "2018-01-08T17:00:00.000+02:00", "replies_count": 0, "uuid": "da1e2dd5bddda84d73210ef4eaa463bdf6dfffa6"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/southkorea-forex/update-2-s-korea-govt-suspected-of-buying-dollar-as-won-shoots-to-3-yr-high-idUSL4N1P31JG", "ord_in_thread": 0, "title": "REFILE-UPDATE 2-S.Korea govt suspected of buying dollar as won shoots to 3-yr high", "locations": [], "entities": {"persons": [{"name": "dahee kim", "sentiment": "none"}, {"name": "kyoungho lee", "sentiment": "none"}], "locations": [{"name": "korea", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "u.s. treasury", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Refiles to amend 6th paragraph to clarify the three criteria the U.S. Treasury uses for labelling a country a currency manipulator)\n* S.Korea fx officials suspected to have bought $1.5 bln on Monday\n* The won hit the 1,050 mark in its early trade\n* Buying won’t mean US may label S.Korea a manipulator - analysts\nBy Dahee Kim and KyoungHo Lee\nSEOUL, Jan 8 (Reuters) - South Korean foreign exchange authorities were suspected of buying dollars in the market on Monday, two currency traders told Reuters, as the won strengthened to a more than three-year intraday high.\nThe two foreign exchange traders, who declined to be named, said the government was suspected of buying U.S. dollars around the 1,050 won mark.\n“The foreign exchange authorities probably took actions to show that they will not allow the won to rise beyond the 1,050 level,” one trader told Reuters.\nThe local currency touched as high as 1,058.8 against the greenback in early trade on Monday, its highest intraday level since October 2014. The won then sharply extended losses to 1,069.9, while ending its trade at 1,066.\nA finance ministry spokeswoman declined to comment on the government’s suspected dollar buying.\nSouth Korea is on the U.S. Treasury’s list of countries to be monitored to see if they are manipulating their currencies. They can be labelled manipulators if they have a large current account surplus overall, or a large bilateral trade surplus with the U.S. or make heavy one-sided intervention in their currency market.\nIn October, the Treasury’s semiannual report kept South Korea on its monitoring list, along with China, Japan, Germany and Switzerland.\nSeveral foreign exchange dealers in Seoul said they believed the amount of dollars authorities bought on Monday was about $1.5 billion.\nBut Monday’s dollar buying will not increase the chance the U.S. labels South Korea a currency manipulator, analysts said.\n“Being designated as a currency manipulator is not solely decided by just one occasion like today,” said Jung Sung-yoon, a foreign exchange analyst at Hyundai Futures.\n“Today’s smoothing operation seems one of the most powerful one, but it’s still not enough for South Korea to be designated as a currency manipulator as there weren’t such actions throughout last year,” he added.\nDuring 2017, the won was Asia’s top gainer against the dollar, with a rise of 12.8 percent.\nA senior Korean foreign exchange official who did not want to be named said the won’s sharp rise in recent weeks was due to dollar weakness.\n“We will take decisive actions in case the won’s one-sided movement gets excessive aside from the broad weakness in the dollar,” the official said.\nAnalysts say the won’s sharp retreat on Monday pointed to smoothing operations by the government.\n“The won couldn’t have reversed its gains that sharply if it were not for the government’s dollar-buying,” said Ha Keon-hyeong, a foreign exchange analyst at Shinhan Investment Corp.\n“The won’s pace of gains is much faster than that of other currencies and the government seems to be trying to adjust the speed while leaving the currency movement market-oriented,” he added.\nThe finance ministry participates in currency markets through the central bank, which orders agent banks to buy or sell dollars.\nReporting by Kyungho Lee, Dahee Kim, Shinhyoung Lee; Editing by Sam Holmes and Richard Borsuk\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-08T17:00:00.000+02:00", "crawled": "2018-01-08T14:08:52.015+02:00", "highlightTitle": ""}