{"organizations": [], "uuid": "c92b39e5906db1641f042f11f5c0f83d85da3adc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/business-wire-imperva-appoints-david-gee-as-chief-marketing-officer.html", "country": "US", "domain_rank": 767, "title": "Imperva Appoints David Gee as Chief Marketing Officer", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T15:00:00.000+02:00", "replies_count": 0, "uuid": "c92b39e5906db1641f042f11f5c0f83d85da3adc"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/business-wire-imperva-appoints-david-gee-as-chief-marketing-officer.html", "ord_in_thread": 0, "title": "Imperva Appoints David Gee as Chief Marketing Officer", "locations": [], "entities": {"persons": [{"name": "david gee", "sentiment": "negative"}, {"name": "zuora", "sentiment": "negative"}, {"name": "imperva", "sentiment": "none"}, {"name": "gee", "sentiment": "none"}, {"name": "chris hylen", "sentiment": "none"}, {"name": "david", "sentiment": "none"}], "locations": [{"name": "res", "sentiment": "none"}, {"name": "imperva", "sentiment": "none"}, {"name": "zuora", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "infoblox cmo", "sentiment": "negative"}, {"name": "cmo", "sentiment": "none"}, {"name": "imperva, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Former Zuora and Infoblox CMO With a Successful Track Record of Scaling Growth Companies\nREDWOOD SHORES, Calif.--(BUSINESS WIRE)-- Imperva, Inc. (NASDAQ:IMPV), a leading cybersecurity company that delivers best-in-class solutions to protect data and applications – wherever they reside – on premises, in the cloud, and across hybrid environments, today announced the appointment of David Gee as the company’s chief marketing officer (CMO), effective January 22, 2018.\n“David joins Imperva at an exciting time as we sharpen our focus to elevate our global brand, customer messaging and go-to-market efforts,” said Chris Hylen, president and chief executive officer of Imperva. “His proven track record of driving worldwide marketing strategies, developing world-class teams and generating revenue for a broad range of technology companies will be instrumental in executing the company’s profitable growth strategy.”\nMr. Gee has more than 20 years of sales and marketing leadership experience in technology. Most recently, he served as CMO of Zuora, a privately held SaaS provider of subscription order-to-cash solutions. Prior to that, he served as CMO and EVP of Marketing at Infoblox when they were a privately held company and was a member of the leadership team that took the company public. Mr. Gee also held a number of senior marketing positions across different business groups at Hewlett-Packard for nine years. Earlier in his career, Mr. Gee also held senior marketing and operational roles at Yahoo!, Sun Microsystems and IBM. He earned his B.S. in Management Science and Marketing from Lancaster University, and his MBA from Georgetown University.\n“I’m incredibly excited to join Imperva and capitalize on its leading reputation for helping customers protect their most precious assets – their data and applications,” said Mr. Gee. “I look forward to working with the team, and helping to drive profitable growth for the business.”\nAs CMO, Mr. Gee will report directly to Mr. Hylen and will oversee Imperva’s corporate marketing, demand generation, product marketing, customer and content marketing, pricing, and marketing operations.\nDisclosure of non-stockholder approved employment inducement grants made in reliance on NASDAQ rules: In connection with the appointment of Mr. Gee as Imperva’s new chief marketing officer, the compensation committee of Imperva’s board of directors approved an award to Mr. Gee of an aggregate of 75,000 restricted stock units (RSUs) to be granted pursuant to the Imperva, Inc. 2015 Equity Inducement Plan, as amended, which is a non-stockholder approved plan. Mr. Gee’s RSUs will be in two separate awards. The first award will cover 25,000 RSUs that vest at the rate of 25% of the shares on February 15, 2019, and then 6.25% of the shares quarterly thereafter, subject to his continued provision of services to Imperva. The second award will be subject to performance criteria for 2018 and will be eligible for 25,000 shares at target performance and will be eligible for a total of 50,000 shares at maximum performance, in each case subject to time-based vesting at a rate of 12.5% of the shares on February 15, 2019, and then 12.5% of the shares quarterly thereafter, subject to his continued provision of services to Imperva. The RSUs are being granted as an inducement material to Mr. Gee’s employment in accordance with NASDAQ Listing Rule 5635(c)(4).\nCautionary Statement Regarding Forward Looking Statements\nThis press release contains “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are not historical facts but instead represent only Imperva’s belief regarding future events, many of which, by their nature, are inherently uncertain and outside Imperva’s control, such as the company’s belief about future growth, and expectations regarding Mr. Gee’s contributions to the company. Except for Imperva’s ongoing obligation to disclose material information as required by federal securities laws, Imperva is not under any obligation (and expressly disclaims any obligation) to update or alter any projections, goals, assumptions, or other statements, whether written or oral, that may be made from time to time, whether as a result of new information, future events or otherwise. Factors that could cause actual results to differ, possibly materially, from such forward-looking statements include the factors set forth in Imperva’s filings with the United States Securities and Exchange Commission.\nAbout Imperva\nImperva® (NASDAQ: IMPV) is a leading cybersecurity company that delivers best-in-class solutions to protect data and applications – wherever they reside - on premises, in the cloud, and across hybrid environments. The company’s SecureSphere, CounterBreach, Incapsula and Camouflage product lines enable organizations to discover assets and risks, protect information wherever it lives – on premises, in the cloud, and across hybrid environments – and comply with regulations. The Imperva Defense Center, a research team comprised of some of the world’s leading experts in data and application security, continually enhances Imperva products with up-to-the-minute threat intelligence, and publishes reports that provide insight and guidance on the latest threats and how to mitigate them. Imperva is headquartered in Redwood Shores, California. Learn more: www.imperva.com , our blog , on Twitter .\n© 2018 Imperva, Inc. All rights reserved. Imperva, the Imperva logo, CounterBreach, Incapsula, SecureSphere, ThreatRadar, and Camouflage along with its design are trademarks of Imperva, Inc. and its subsidiaries.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180111005020/en/\nInvestor Relations\nSeth Potter, 646-277-1230\nIR@imperva.com\nSeth.Potter@icrinc.com\nSource: Imperva, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180111005020/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fblog.imperva.com%2F%3Futm_medium%3Dpr%26utm_source%3Dreferral_pr%26utm_campaign%3D2017_press_releases&esheet=51740575&newsitemid=20180111005020&lan=en-US&anchor=blog&index=2&md5=c4de3a6694ee1153e52d3793323ff2cd", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2FImperva&esheet=51740575&newsitemid=20180111005020&lan=en-US&anchor=Twitter&index=3&md5=41164fb0b009f66fd0b0f0e822e2828c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.imperva.com&esheet=51740575&newsitemid=20180111005020&lan=en-US&anchor=www.imperva.com&index=1&md5=42822ebdae66bfa51ff06d9c5fec21b8"], "published": "2018-01-11T15:00:00.000+02:00", "crawled": "2018-01-11T15:00:41.011+02:00", "highlightTitle": ""}