{"organizations": [], "uuid": "39d2e97215cbe67230025b5919a19e7cf17ca3e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-XC237_truck0_SOC_20180121122403.jpg", "site_section": "https://www.wsj.com/europe", "section_title": "The Wall Street Journal &amp; Breaking News, Business, Financial and Economic News, World News and Video", "url": "https://www.wsj.com/articles/todays-top-supply-chain-and-logistics-news-from-wsj-1516622123", "country": "US", "domain_rank": 387, "title": "Today’s Top Supply Chain and Logistics News From - WSJ", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T14:55:00.000+02:00", "replies_count": 0, "uuid": "39d2e97215cbe67230025b5919a19e7cf17ca3e5"}, "author": "Paul Page", "url": "https://www.wsj.com/articles/todays-top-supply-chain-and-logistics-news-from-wsj-1516622123", "ord_in_thread": 0, "title": "Today’s Top Supply Chain and Logistics News From - WSJ", "locations": [], "entities": {"persons": [{"name": "jennifer smith", "sentiment": "none"}, {"name": "brian baskin", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "logistics news from - wsj", "sentiment": "negative"}, {"name": "wsj logistics report", "sentiment": "none"}, {"name": "dat solutions", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Sign up: With one click, get this newsletter delivered to your inbox .\nTrucking companies are coping with a question they haven’t faced in years: How much will it cost them to handle all the freight demand coming their way? U.S. truckers are seeing the strongest push for shipping capacity in years and raising rates at a fast pace, but WSJ Logistics Report’s Brian Baskin and Jennifer Smith write that it’s an open question whether the companies or their drivers will reap the windfall. Shippers already are paying premium rates. DAT Solutions say spot-market pricing has been growing at a double-digit pace, and contract prices are on a steep upward curve as customers try to lock in trucks in a strong economy. That should translate into bigger profits as trucking companies report fourth-quarter results over the coming weeks. Trucking company-costs are also surging, however, as companies look to bring in drivers and step up their orders for big rigs to handle the loads. With the U.S. labor market tight, hiring drivers has never been more expensive, but freight volumes show it’s also more urgent than ever.\nUpheaval in the health care field is pushing some providers to take much greater control of their supply chains. Four major U.S. hospital systems are planning to launch a nonprofit company to produce generic drugs, the WSJ’s Melanie Evans reports, looking to fix a market that’s seen soaring prices and shortages of supply. The action by the nonprofit systems is the latest sign of changes in a medical world that’s seen consolidation among hospital groups and moves to blur lines between insurance companies and drug providers. The four hospital systems say they would likely contract with existing manufacturers to ensure a steadier flow of medications they say have been sole-sourced, expensive and in short supply. The plan would further wipe away lines between customers and suppliers, and could trigger more changes if more hospitals band together to make their own medical supplies and even bring drug wholesalers and independent distributors into their networks.\nThe White House is pushing China to center stage in its push to extend President Donald Trump’s “America First” trade policy. The decision marks something of a pivot after a first year defined by tangles with allies from North America to Europe and Asia, and the WSJ’s Jacob M. Schlesinger writes that it comes as the White House faces imminent decision deadlines on several trade complaints involving Chinese producers . Tensions involving China’s major role in U.S. trade have simmered mostly in the background over the past year as the administration has sought to reset trade pacts in North America and with South Korea. The U.S. complaints over China’s exports involving steel, aluminum and solar panels come as Beijing increasingly is focused on trade to project its influence. Broad efforts such as the Belt and Road initiative and the expansion of China’s maritime industry will continue even as the U.S. looks to shift the balance of bilateral trade.\nGOVERNMENT & REGULATION Photo: Bloomberg News The heart of a Chinese shipping business allegedly helping North Korea evade trade sanctions hardly looks like the center of a global conspiracy. U.S. authorities say obscure operators based in depressed shipbuilding towns like Linhai in eastern China handled trade in violation of United Nations restrictions . The WSJ’s James T. Areddy and Chun Han Wong write that residents there used to pool money to buy ships to get a piece of the export boom driven by nearby factories. Now, cargo vessels cargo vessels abandoned in mid-construction sit on riverbanks, evidence of financial stress among Chinese shipowners who expanded tonnage at a rapid pace before they were knocked back by the global downturn in commodities prices. The U.S. alleges that six Chinese-owned or managed ships helped North Korea sidestep United Nations sanctions by hauling illicit cargo to Russia and Vietnam or making ship-to-ship transfers at sea. The six ships are workhorses that appear to be owned and managed by small groups unconnected with China’s large and mostly state-owned shipping networks.\nQUOTABLE\n‘ You’re probably going to get a lot of freight…but at the same time hiring drivers is going to be really hard. ’\n—Ravi Shanker, an analyst with Morgan Stanley.\nNumber of the Day 6.2% Year-over-year increase in December in the Cass Information Systems index for U.S. truckload transport costs to shippers.\nIN OTHER NEWS Customs and Border Protection and the Transportation Security Administration were among U.S. agencies still working as the federal government shut down over a spending impasse. (WSJ)\nA Quebec jury acquitted three men of criminal negligence in the 2013 oil train derailment that killed 47 people . (WSJ)\nA measure of U.S. consumer sentiment declined in January for the third-straight month. (WSJ)\nCanadian manufacturing shipments soared in November to a record high . (WSJ)\nArcher Daniels Midland Co. is moving to take over Bunge Ltd. , setting up a possible bidding war with Glencore PLC over the agriculture powerhouse . (WSJ)\nCoca-Cola Co. wants to collect and recycle the equivalent of all the packaging it puts out into the world by 2030. (WSJ)\nThe Trump administration says allowing China to join the World Trade Organization in 2001 was a mistake . (Financial Times)\nHong Kong-based footwear giant Yue Yuen Industrial Holdings, a supplier to Nike Inc. and Adidas AG , expects to raise $860 million in a privatization plan . (South China Morning Post)\nGrowing demand in Asia is pushing up prices for wool . (Sourcing Journal)\nCanadian Pacific Railway Ltd.’s fourth-quarter revenue rose 5% on strong gains in metals, energy and intermodal shipments . (Globe and Mail)\nKansas City Southern ’s fourth-quarter operating profit rose 8.1% on strong revenue and commodity-carload growth . (Reuters)\nContainer shipping lines are growing more pessimistic that demand will remain strong after next month’s Lunar New Year holiday. (The Loadstar)\nLord & Taylor is laying off 200 distribution center workers in Eastern Pennsylvania as the retailer reconfigures its e-commerce fulfillment . (Scranton Times-Tribune)\nWal-Mart Stores Inc. plans to begin shipping from its 2.5 million-square-foot Mobile, Ala., distribution center in June. (Birmingham News)\nDrivers at an XPO Logistics Inc. facility in Albany, N.Y., rejected Teamsters union representation . (DC Velocity)\nGroups representing large rail shippers are pressing the Trump administration to fill vacant positions at the Surface Transportation Board. (Logistics Management)\nJapan’s Kawasaki Heavy Industries is the front-runner in a $4 billion deal to build subway cars for New York City. (Nikkei Asian Review)\nFirefighters rescued a worker inside a cargo ship at the Port of Houston who was knocked unconscious when a shipment of molasses started to ferment . (KTRK)\nABOUT US Paul Page is deputy editor of WSJ Logistics Report. Follow him at @PaulPage , and follow the entire WSJ Logistics Report team: @brianjbaskin , @jensmithWSJ and @EEPhillips_WSJ . Follow the WSJ Logistics Report on Twitter at @WSJLogistics .\nWrite to Paul Page at paul.page@wsj.com", "external_links": ["http://www.scmp.com/business/companies/article/2129907/nike-footwear-supplier-yue-yuen-make-hk67b-retail-arms", "https://sourcingjournalonline.com/wool-prices-rise-sneakers-give-fiber-unexpected-boost/", "http://www.al.com/news/mobile/index.ssf/2018/01/walmart_reveals_more_detail_on.html", "https://twitter.com/WSJLogistics?lang=en", "https://www.ft.com/content/edb346ec-fd3a-11e7-9b32-d7d59aace167", "http://abc13.com/worker-knocked-out-by-fermented-molasses-in-cargo-ship/2964213/", "http://www.dcvelocity.com/articles/20180119-xpo-drivers-in-albany-ny-reject-teamsters-representation/", "https://www.theglobeandmail.com/report-on-business/cp-rails-quarterly-profit-more-than-doubles-on-gains-from-us-tax-code/article37660263/", "http://www.logisticsmgmt.com/article/rail_customer_coalition_calls_on_white_house_to_fill_open_stb_positions", "https://asia.nikkei.com/Business/Companies/Kawasaki-Heavy-poised-to-win-massive-order-for-NYC-subway-cars", "https://twitter.com/EEPhillips_WSJ?lang=en", "http://thetimes-tribune.com/news/business/lord-taylor-lays-off-202-workers-1.2292317", "https://www.reuters.com/article/us-kc-southern-results/nafta-future-clouds-kansas-city-southern-earnings-beat-idUSKBN1F81HD", "https://twitter.com/PaulPage", "https://theloadstar.co.uk/asia-europe-box-carriers-pessimistic-post-chinese-new-year-demand/", "https://twitter.com/jensmithWSJ", "https://twitter.com/brianjbaskin?lang=en"], "published": "2018-01-22T14:55:00.000+02:00", "crawled": "2018-01-23T01:39:03.008+02:00", "highlightTitle": ""}