{"organizations": [], "uuid": "6cca954284a55b6990d10e619389725172ec018c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/emerging-markets-latam/emerging-markets-brazil-markets-extend-rally-as-lula-conviction-upheld-idUSL2N1PL1U3", "country": "US", "domain_rank": 408, "title": "EMERGING MARKETS-Brazil markets extend rally as Lula conviction upheld", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T00:46:00.000+02:00", "replies_count": 0, "uuid": "6cca954284a55b6990d10e619389725172ec018c"}, "author": "", "url": "https://www.reuters.com/article/emerging-markets-latam/emerging-markets-brazil-markets-extend-rally-as-lula-conviction-upheld-idUSL2N1PL1U3", "ord_in_thread": 0, "title": "EMERGING MARKETS-Brazil markets extend rally as Lula conviction upheld", "locations": [], "entities": {"persons": [{"name": "lula", "sentiment": "negative"}, {"name": "michel temer", "sentiment": "none"}, {"name": "bruno federowski", "sentiment": "none"}, {"name": "luiz inácio lula da silva", "sentiment": "none"}], "locations": [{"name": "brasilia", "sentiment": "none"}, {"name": "brazil", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Updates prices, adds details on Mexico) By Bruno Federowski BRASILIA, Jan 26 (Reuters) - Brazilian markets extended a rally on Friday as traders bet leftist former President Luiz Inácio Lula da Silva would be barred from running in this year's election after an appeals court upheld his conviction for corruption. The Brazilian real closed up 0.6 percent, a gain of 1.91 percent during the week. The benchmark Bovespa stock index hit an all-time high of 85,530.84, rising 2.21 percent, and making for a gain of more than 5 percent this week. Lula, who is leading opinion polls and has vowed to undo some of President Michel Temer's austerity efforts, could now be ineligible to stand for election under Brazil's \"clean record\" law, which bans political candidates whose convictions have been upheld by an appellate court. Lula still has options. An electoral court must make a final ruling on his candidacy and would only do so once he registers. The court's decision on Wednesday \"reduces the risk of unorthodox policymaking and opens up space for candidates that support market-friendly reforms,\" Magliano brokerage analyst Carlos Soares Rodrigues said. Blue-chips, including shares of banks and state-controlled oil company Petróleo Brasileiro SA, lifted Brazil's benchmark index, but miner Vale SA's stock tracked iron ore prices lower. Mexico's S&P/BMV IPC stock index closed up 0.57 percent at its highest level since the start of September, despite a marked drop in shares of broadcaster Grupo Televisa . After Televisa revealed \"some material weaknesses\" in its internal controls of financial information, the stock at one point fell by more than 10 percent, before paring those losses to close down 2.1 percent at 76.48 pesos. The Chilean peso fell nearly 0.5 percent as rising on-warrant copper stocks weighed on prices of the industrial metal. But the Mexican peso rose 0.65 percent, tracking global weakness in the U.S. dollar. The dollar fell against a basket of currencies on Friday as senior U.S. officials' comments this week in favor of a weak greenback reverberated through currency markets. After U.S. President Donald Trump said on Thursday he ultimately wanted the dollar to be strong, the currency pared some losses, but it was on track for its biggest monthly drop since March 2016. Key Latin American stock indexes and currencies at 2220 GMT: Stock indexes daily % YTD % change change Latest MSCI Emerging Markets 1273.07 0.76 9.89 MSCI LatAm 3241.47 1.23 14.61 Brazil Bovespa 85530.84 2.21 11.95 Mexico IPC 51065.49 0.57 3.47 Chile IPSA 5855.67 0.76 5.23 Chile IGPA 29413.50 0.67 5.12 Argentina MerVal 35126.22 -0.04 16.83 Venezuela IBC 3662.12 27.01 189.92 Currencies daily % YTD % change change Latest Brazil real 3.1201 0.60 6.19 Mexico peso 18.489 0.65 6.54 Chile peso 601.40 -0.47 2.20 Colombia peso 2814 -0.85 5.97 Peru sol 3.215 -0.16 3.58 Argentina peso (interbank) 19.5625 0.11 -4.92 Argentina peso (parallel) 19.93 -0.10 -3.51 (Reporting by Bruno Federowski; Editing by Lisa Von Ahn and Tom Brown)\n ", "external_links": [], "published": "2018-01-27T00:46:00.000+02:00", "crawled": "2018-01-27T01:03:49.044+02:00", "highlightTitle": ""}