{"organizations": [], "uuid": "f7d3dd81183ab6142ddda996da2fd5b2ffce43ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180122&t=2&i=1224029243&w=1200&r=LYNXMPEE0L06A", "site_section": "https://www.reuters.com/breakingviews", "section_title": "Breakingviews | Reuters", "url": "https://www.reuters.com/article/us-davos-meeting-breakingviews/breakingviews-xi-jinping-offers-a-lesson-on-the-davos-discount-idUSKBN1FB0A0", "country": "US", "domain_rank": 408, "title": "Xi Jinping offers a lesson on the “Davos discount”", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.225, "site_type": "news", "published": "2018-01-22T11:21:00.000+02:00", "replies_count": 0, "uuid": "f7d3dd81183ab6142ddda996da2fd5b2ffce43ad"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-davos-meeting-breakingviews/breakingviews-xi-jinping-offers-a-lesson-on-the-davos-discount-idUSKBN1FB0A0", "ord_in_thread": 0, "title": "Xi Jinping offers a lesson on the “Davos discount”", "locations": [], "entities": {"persons": [{"name": "xi jinping", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "new zealand", "sentiment": "none"}, {"name": "beijing", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON Chinese President Xi Jinping’s speech a year ago to the elites gathered in Davos was hailed as a new era in global leadership. Yet little changed in the following months. With U.S. President Donald Trump attending this year, it’s worth remembering that promises to the crowd at the annual World Economic Forum shindig in the Swiss ski resort are often less than they seem.\nXi offered a robust defense of globalization. He warned that protectionism would be “like locking oneself in a dark room,” a sharp contrast with the “America First” policies of the then U.S. president-elect. As the United States seemed set to retreat, pundits praised the Chinese leader for taking up the mantle of global leadership.\nIf anything, however, China’s foreign policy over the past year has been marked by a backlash abroad. A series of scandals in Australia and New Zealand involving allegations of Chinese influence-peddling have sparked intense debates about the extent of Beijing’s reach into politics, the media and education. Talk of China’s “sharp power” – efforts to cajole or pressure democratic countries – is seeping into Western media and policy circles. Several countries, the United States included, are mulling steps to further restrict Chinese donations or investment on security grounds.\nSuch concerns underscore a very non-Davosian skepticism about China’s intentions abroad. What’s more, they suggest that despite Xi’s rhetoric about globalism, Beijing’s focus remains essentially inward-looking. Allegations of pilfering industrial secrets or pushing foreign politicians to support China’s territorial claims may occur abroad, but they are ultimately intended to shore up the ruling Communist Party back home.\nNor has Beijing made unambiguous progress to open the Chinese economy. Officials announced steps to allow greater foreign competition in the financial sector, but it remains to be seen how the rules will be implemented. The past year also brought stiff new regulations on tech companies and a tighter political grip on the overseas activities of PRC conglomerates such as Anbang, Dalian Wanda and HNA.\nIn short, Xi focused in large part on what the Alpine gathering wanted to hear, even if actual policy was set elsewhere. As the likes of Trump and Narendra Modi, India’s prime minister, take the stage this year, savvy investors and executives should apply a healthy “Davos discount” to their pronouncements.\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["https://twitter.com/breakingviews", "https://www.breakingviews.com/trial"], "published": "2018-01-22T11:21:00.000+02:00", "crawled": "2018-01-22T05:55:56.015+02:00", "highlightTitle": ""}