{"organizations": [], "uuid": "9a33756cffea43f1bfb915ef014604f7dd96eeae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-biohitech-global-partners-with-kinderhook-industries-to-create-a-next-generation-environmental-services-platform-company.html", "country": "US", "domain_rank": 767, "title": "BioHiTech Global Partners with Kinderhook Industries to Create a \"Next Generation\" Environmental Services Platform Company", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.207, "site_type": "news", "published": "2018-01-30T16:31:00.000+02:00", "replies_count": 0, "uuid": "9a33756cffea43f1bfb915ef014604f7dd96eeae"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-biohitech-global-partners-with-kinderhook-industries-to-create-a-next-generation-environmental-services-platform-company.html", "ord_in_thread": 0, "title": "BioHiTech Global Partners with Kinderhook Industries to Create a \"Next Generation\" Environmental Services Platform Company", "locations": [], "entities": {"persons": [{"name": "biohitech", "sentiment": "none"}], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "chestnut ridge", "sentiment": "none"}, {"name": "southern new jersey", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}], "organizations": [{"name": "kinderhook industries", "sentiment": "negative"}, {"name": "biohitech global partners", "sentiment": "negative"}, {"name": "environmental services platform company", "sentiment": "negative"}, {"name": "biohitech global, inc.", "sentiment": "neutral"}, {"name": "gold medal group", "sentiment": "none"}, {"name": "biohitech", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "kinderhook", "sentiment": "none"}, {"name": "gold medal services", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHESTNUT RIDGE, N.Y., Jan. 30, 2018 /PRNewswire/ -- BioHiTech Global, Inc. (\"BioHiTech\" or the \"Company\") (OTCQB: BHTG), a green technology company that develops and deploys cost effective, innovative and disruptive waste management technologies, partners with Kinderhook Industries, LLC (\"Kinderhook\"), a private investment firm that manages over $2 billion of committed capital, to create a \"next generation\" environmental services platform company.\nThrough a series of transactions, the two companies completed the acquisition of Gold Medal Services, LLC, a market leader in municipal, commercial, and industrial solid waste collection in the Philadelphia and Southern New Jersey markets as a wholly owned subsidiary of Gold Medal Group, LLC (\"Gold Medal\"), a newly formed company majority owned by Kinderhook. BioHiTech acquired a 9.2% interest in Gold Medal in exchange for 500,000 shares of common stock. The Company also has an option to acquire an additional $5M interest in Gold Medal over the next 12 months. BioHiTech also entered into a management services agreement, with Gold Medal to provide executive oversight of its operations for fees of $750,000 per year, leveraging the significant experience and proven leadership skills of BioHiTech's management team in the waste service industry. Together, the companies intend to lead a revolutionary transformation of Gold Medal from a traditional waste disposal company to a technology driven, vertically integrated, sustainable waste services provider.\n\"I am pleased to partner with Cor Carruthers, Rob Michalik, and the visionary private equity team at Kinderhook,\" stated Frank E. Celli, Chief Executive Officer of BioHiTech Global. \"Their extensive experience in environmental services and emerging technologies, coupled with their significant financial resources, make them a valuable partner for BioHiTech as we begin to utilize our proprietary technology to set a new standard for sustainable and cost-effective waste disposal in the United States.\"\nBioHiTech sees its investment in Gold Medal and ongoing management services agreement benefiting the Company in several key areas. Gold Medal's footprint of over 6,000 commercial and industrial customer locations in Southern New Jersey and the Philadelphia marketplace, including numerous food waste generators, provides an attractive distribution platform for BioHiTech's on-site Digesters while its municipal waste collection business can offer a significant source of future feedstock for the Company's planned HEBioT facilities. Gold Medal also provides a platform, in one of the most attractive markets in the United States, for Kinderhook and BioHiTech to build a much larger vertically integrated waste services company through organic growth and opportunistic acquisition.\n\"We are excited to partner with Frank and BioHiTech as we look to increase our financial presence in this industry,\" stated Corwynne Carruthers, Managing Director of Kinderhook Industries. \"By marrying BioHiTech's cost effective technology and management experience with Gold Medal's business, we believe we have created a platform company with the opportunity to expand on our initial investment and create a best in class, sustainable environmental services company throughout the Mid-Atlantic States.\"\nFor a more detailed description of the transaction, please review our current report on Form 8-K filed today with the Securities and Exchange Commission.\nAbout Kinderhook Industries\nKinderhook Industries, LLC is a private investment firm that manages over $2.0 billion of committed capital. They have made in excess of 170 investments and follow-on acquisitions since inception. Kinderhook's investment philosophy is predicated on matching unique, growth-oriented investment opportunities with exceptional financial expertise and our proprietary network of operating partners. Their focus is on middle market businesses with defensible niche market positioning in the healthcare services, environmental / business services and automotive / light manufacturing sectors. They have a track record of successfully and consistently building industry leaders. In addition, Kinderhook is a licensed Small Business Investment Company (SBIC) with the U.S. Small Business Administration. For more information, please visit: www.kinderhook.com\nAbout Gold Medal\nGold Medal Environmental, headquartered in Deptford, New Jersey, is a waste and recycling services company servicing Pennsylvania, New Jersey and Delaware. Gold Medal offers a complete range of integrated services to thousands of customers in the region. The company serves residential, institutional, commercial and industrial locations. Gold Medal offers superior collection, recycling, disposal and dumpster rental services 24 hours a day and seven days a week. For more information, please visit: www.goldmedal.net\nAbout BioHiTech Global\nBioHiTech Global, Inc. (OTCQB: BHTG), the \"Company\" headquartered in Chestnut Ridge NY, develops and deploys innovative and disruptive waste management technologies. The combined offerings of the Company offer our customers a full suite of technology based disposal options capable of having a significant impact on waste generation while providing a true zero landfill environment. With options for both on and off site biological treatment of waste, BioHiTech Global is a leader in zero waste solutions for businesses and municipalities. For more information, please visit www.biohitech.com .\nForward Looking Statements\nStatements in this document contain certain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934, as amended. These statements are based on many assumptions and estimates and are not guarantees of future performance. These statements may involve known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of BioHiTech Global, Inc. to be materially different from future results, performance or achievements expressed or implied by such forward-looking statements. BioHiTech Global, Inc. assumes no obligation to publicly update or revise these forward-looking statements for any reason, or to update the reasons actual results could differ materially from those anticipated in these forward-looking statements, even if new information becomes available in the future. Our actual results may differ materially from the results anticipated in these forward-looking statements due to a variety of factors, including, without limitation those set forth as \"Risk Factors\" in our filings with the Securities and Exchange Commission (\"SEC\"). There may be other factors not mentioned above or included in the BioHiTech's SEC filings that may cause actual results to differ materially from those projected in any forward-looking statement. BioHiTech Global, Inc. assumes no obligation to update any forward-looking statements as a result of new information, future events or developments, except as required by securities laws.\nCompany Contact:\nBioHiTech Global, Inc.\nLisa Giovannielli\nDirector, Corporate Communications\nDirect: 845-262-1081\nlgiovannielli@biohitech.com\nwww.biohitech.com\nView original content with multimedia: http://www.prnewswire.com/news-releases/biohitech-global-partners-with-kinderhook-industries-to-create-a-next-generation-environmental-services-platform-company-300589947.html\nSOURCE BioHiTech Global, Inc.", "external_links": ["http://www.biohitechglobal.com/", "http://www.prnewswire.com/news-releases/biohitech-global-partners-with-kinderhook-industries-to-create-a-next-generation-environmental-services-platform-company-300589947.html", "http://www.goldmedal.net/", "http://www.kinderhook.com/"], "published": "2018-01-30T16:31:00.000+02:00", "crawled": "2018-01-30T17:38:11.004+02:00", "highlightTitle": ""}