{"organizations": [], "uuid": "852efc5a40137d5deb0ad6aff974df80cef91307", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180103&t=2&i=1219126049&w=1200&r=LYNXMPEE0215R", "site_section": "http://feeds.reuters.com/reuters/UKScienceNews", "section_title": "Reuters: Science News", "url": "https://uk.reuters.com/article/us-science-genome/alaskan-sunrise-girl-sheds-light-on-how-humans-populated-americas-idUKKBN1ES1NH", "country": "US", "domain_rank": 408, "title": "Alaskan 'sunrise' girl sheds light on how humans populated Americas", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T21:38:00.000+02:00", "replies_count": 0, "uuid": "852efc5a40137d5deb0ad6aff974df80cef91307"}, "author": "", "url": "https://uk.reuters.com/article/us-science-genome/alaskan-sunrise-girl-sheds-light-on-how-humans-populated-americas-idUKKBN1ES1NH", "ord_in_thread": 0, "title": "Alaskan 'sunrise' girl sheds light on how humans populated Americas", "locations": [], "entities": {"persons": [{"name": "ben potter/handout", "sentiment": "none"}, {"name": "eric s. carlson", "sentiment": "none"}], "locations": [{"name": "americas", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "siberia", "sentiment": "none"}, {"name": "alaska", "sentiment": "none"}, {"name": "upward sun river", "sentiment": "none"}, {"name": "bering strait", "sentiment": "none"}], "organizations": [{"name": "americas will dunham", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 3, 2018 / 7:36 PM / Updated 2 hours ago Alaskan 'sunrise' girl sheds light on how humans populated Americas Will Dunham 3 Min Read \nWASHINGTON (Reuters) - Ancient DNA extracted from the skull of a six-week-old baby girl whose 11,500-year-old remains were unearthed in a burial pit in central Alaska is helping scientists resolve long-standing controversies about how humans first populated the Americas. An illustration released January 3, 2018 depicts the Upward Sun River base camp site in central Alaska, where the 11,500-year-old remains of a 6-week-old girl were discovered in 2013. The girl's genome shows she belonged to a previously unknown population or early Native Americans and shed light on the timing and nature of the first migration of people into the Americas during the last Ice Age. Eric S. Carlson and Ben Potter/Handout via REUTERS \nScientists said on Wednesday a study of her genome indicated there was just a single wave of migration into the Americas across a land bridge, now submerged, that spanned the Bering Strait and connected Siberia to Alaska during the Ice Age. \nThe infant -- named “sunrise girl-child” (Xach‘itee‘aanenh T‘eede Gaay) using the local indigenous language -- belonged to a previously unknown Native American population that descended from those intrepid migrants, the researchers added. \n“The study provides the first direct genomic evidence that all Native American ancestry can be traced back to the same source population during the last Ice Age,” University of Alaska Fairbanks archaeologist Ben Potter said. \nThe remains of the infant -- part of a hunter-gatherer culture that hunted bison, elk, hare, squirrels and birds and caught salmon -- were unearthed in 2013 at a prehistoric encampment in Alaska’s Tanana River Valley about 50 miles (80 km) southeast of Fairbanks. \nOur species first arose in Africa roughly 300,000 years ago, and later spread around the world. The researchers studied the baby’s genome and genetic data covering other populations to unravel how and when the Americas were first populated. Scientists work on the excavation site of the 11,500-year-old remains of two infant girls at the Upward Sun River in Alaska's Tanana River Valley about 50 miles (80 km) southeast of Fairbanks, Alaska, U.S, in an undated photo released January 3, 2018. Ben Potter/Handout via REUTERS \nA single ancestral Native American group split from East Asians about 36,000 year ago and thousands of years later crossed the land bridge, they said. This founding group diverged into two lineages about 20,000 years ago. \nThe first lineage trekked south of the huge ice caps that covered much of North America between 20,000 and 15,000 years ago, spreading throughout North and South America and becoming the ancestors of today’s Native Americans. Scientists work at the Upward Sun River discovery site in Alaska's Tanana River Valley about 50 miles (80 km) southeast of Fairbanks, Alaska, U.S, in an undated photo released January 3, 2018. Ben Potter/Handout via REUTERS \nThe second was the newly identified population called Ancient Beringians who included the infant. They eventually disappeared, perhaps absorbed into another population that later inhabited Alaska. \nSome scientists previously hypothesized about multiple migratory waves over the land bridge as recent as 14,000 years ago. \nThe girl was found alongside remains of an even-younger female infant, possibly a first cousin, whose genome the researchers could not sequence. Both were covered in red ochre and surrounded by decorated antler tools. \n“Even the one that got sequenced was a huge challenge due to poor DNA preservation,” said Eske Willerslev, director of the University of Copenhagen’s Centre for GeoGenetics. \nThe research was published in the journal Nature. Reporting by Will Dunham; Editing by Sandra Maler", "external_links": [], "published": "2018-01-03T21:38:00.000+02:00", "crawled": "2018-01-04T00:12:14.011+02:00", "highlightTitle": ""}