{"organizations": [], "uuid": "e0e6ad5167e311adac85ca92f545488f5215556b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/emerging-markets/emerging-markets-dollar-commodities-weigh-on-stocks-turkeys-lira-jitters-idUSL8N1PC2AH", "country": "US", "domain_rank": 408, "title": "EMERGING MARKETS-Dollar, commodities weigh on stocks, Turkey's lira jitters", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T12:37:00.000+02:00", "replies_count": 0, "uuid": "e0e6ad5167e311adac85ca92f545488f5215556b"}, "author": "", "url": "https://www.reuters.com/article/emerging-markets/emerging-markets-dollar-commodities-weigh-on-stocks-turkeys-lira-jitters-idUSL8N1PC2AH", "ord_in_thread": 0, "title": "EMERGING MARKETS-Dollar, commodities weigh on stocks, Turkey's lira jitters", "locations": [], "entities": {"persons": [{"name": "karin strohecker", "sentiment": "none"}], "locations": [{"name": "turkey", "sentiment": "none"}, {"name": "south korea", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "qatar", "sentiment": "none"}, {"name": "kuwait", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "msci", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 10:38 AM / Updated 4 minutes ago EMERGING MARKETS-Dollar, commodities weigh on stocks, Turkey's lira jitters Karin Strohecker 3 Min Read \nLONDON, Jan 17 (Reuters) - A stronger dollar and weaker commodity prices knocked emerging stocks off their near-decade highs and weighed on currencies, with Turkey’s lira on track for its worst week since early November on flaring geopolitical tensions. \nMSCI’s emerging market benchmark edged 0.1 percent lower after the benchmark had hit the highest level since May 2008 on Tuesday, though individual bourses performed very mixed. \nHeavyweight South Korea and some China mainland bourses eased 0.2 percent, while stocks in oil exporters Russia , Qatar and Kuwait slipped some 0.6 percent. \nThe falls came after the dollar index strengthened 0.25 percent, rebounding from a three-year low hit, while Brent crude futures extended the previous day’s falls, pulling further away from the $70 per barrel mark. \nCurrencies also came under pressure, with Turkey’s lira nursing some of the biggest losses. The lira weakened as much as 0.9 percent in early morning trade with investors’ jittery over flaring geopolitical tensions after the U.S.-led coalition said on Sunday it would help to build a new Syrian border force, drawing an angry response from Ankara. \nTurkey has warned in recent days of an imminent military operation in Syria’s Afrin region - one of three autonomous cantons under the control of Kurdish forces and their allies. \nThe latest flare up adds to the strain on Turkey, which relies heavily on external financing, is already under pressure from sluggish growth and double-digit inflation. Turkish stocks extended losses for a second day. \n“In 2018, we expect a visible slowdown in growth and some easing in inflation and interest rates,” Akin Tuzun at VTB Capital wrote in a note to clients. \n“However, it could well be a risky landing on thin ice amid significant global macro and geopolitical risks.” \nSouth Africa’s rand and Russia’s rouble both weakened 0.2 percent. The exception to the rule was China’s yuan, which strengthened after the central bank set its firmest midpoint in more than two years. \nPolitical uncertainties weighed on eastern European currencies. \nThe Romanian leu edged a touch lower, extending falls for a third day, following the resignation of Prime Minister Mihai Tudose on Monday as markets await on whether the replacement candidate will be accepted by the country’s president. \nThe Czech crown weakened slightly after a minority government led by Prime Minister Andrej Babis agreed to resign after losing a vote of no confidence. \nFor GRAPHIC on emerging market FX performance 2017, see tmsnrt.rs/2e7eoml For GRAPHIC on MSCI emerging index performance 2017, see tmsnrt.rs/2dZbdP5 \nFor CENTRAL EUROPE market report, see \nFor TURKISH market report, see \nFor RUSSIAN market report, see) (Reporting by Karin Strohecker; Editing by Matthew Mpoke Bigg)", "external_links": [], "published": "2018-01-17T12:37:00.000+02:00", "crawled": "2018-01-17T12:51:22.003+02:00", "highlightTitle": ""}