{"organizations": [], "uuid": "0ff07a4305e7798dc8cc6ec0102bde0033b59420", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/15/104946322-GettyImages-511842388.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/15/mars-cmo-now-is-a-challenging-and-disruptive-time-to-be-a-marketer.html", "country": "US", "domain_rank": 767, "title": "Mars CMO: now is a challenging and disruptive time to be a marketer", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.983, "site_type": "news", "published": "2018-01-15T12:59:00.000+02:00", "replies_count": 0, "uuid": "0ff07a4305e7798dc8cc6ec0102bde0033b59420"}, "author": "Lucy Handley", "url": "https://www.cnbc.com/2018/01/15/mars-cmo-now-is-a-challenging-and-disruptive-time-to-be-a-marketer.html", "ord_in_thread": 0, "title": "Mars CMO: now is a challenging and disruptive time to be a marketer", "locations": [], "entities": {"persons": [{"name": "joumanna bercetche", "sentiment": "none"}, {"name": "andrew clarke", "sentiment": "none"}], "locations": [{"name": "mars", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Marketers are currently experiencing one of their toughest environments ever because of the multiple options for communicating with consumers, according to the chief marketing and customer officer at candy and petcare business Mars.\nSpeaking to CNBC's \"Marketing Media Money\" show, Andrew Clarke said that reaching mass audiences was a challenge and a focus for Mars, the manufacturer of brands such as M&Ms, Snickers and Skittles, as well as pet foods Pedigree and Whiskas.\n\"How we really evolve our marketing mix with our agency partners in creative, in media, in public relations, how we use design in new and different ways, and how all this is underpinned by data and evidence-based (marketing) is really where we try and take marketing and that's very exciting,\" he told CNBC's Joumanna Bercetche.\n\"So it's probably never been a more challenging and disruptive time to be a marketer, but at the same time I would say, never a more exciting time to really lean into this disruption and drive growth in new and different ways,\" he added.\nWhiskas dry cat food Mars is privately-owned and makes almost $35 billion in sales. It is the world's largest confectionery company, with 12.8 percent of the global market, ahead of Mondelez which has 12.4 percent, according to research company Euromonitor. It works with the Ehrenberg-Bass Institute for Marketing Science to understand what makes people buy its products and where it should invest media money.\n\"This is very much working out what really drives brand behavior (and) buying behavior, really putting science and data behind that. So we can combine the best of our creative with the best of research and science to have our 'laws of growth,' our growth philosophy, to work out where we invest our dollars,\" Clarke told CNBC.\nDigital transformation is a focus for Mars, which hired Sandeep Dadlani as chief digital officer and George Corbin as chief digital demand officer in June 2017. Corbin reports to Clarke to help to convert people online into buyers.\n\"That's the great thing about marketing. It impacts the whole enterprise, (it's) not just about our marketing function. What we do as marketers really is about the growth strategy for the whole of our businesses … And therefore what we do in digital has an implication across the whole business as well,\" Clarke said.", "external_links": [], "published": "2018-01-15T12:59:00.000+02:00", "crawled": "2018-01-15T12:59:48.001+02:00", "highlightTitle": ""}