{"organizations": [], "uuid": "83d996e8649e7c58e1d11d004046222db82d1f70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-reliam-rounds-out-executive-team-following-significant-capital-investment.html", "country": "US", "domain_rank": 767, "title": "Reliam Rounds Out Executive Team Following Significant Capital Investment", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-30T18:00:00.000+02:00", "replies_count": 0, "uuid": "83d996e8649e7c58e1d11d004046222db82d1f70"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/globe-newswire-reliam-rounds-out-executive-team-following-significant-capital-investment.html", "ord_in_thread": 0, "title": "Reliam Rounds Out Executive Team Following Significant Capital Investment", "locations": [], "entities": {"persons": [{"name": "reliam", "sentiment": "none"}, {"name": "art elizarov", "sentiment": "none"}, {"name": "lacour", "sentiment": "none"}, {"name": "mark medina", "sentiment": "none"}, {"name": "jonathan lacour", "sentiment": "none"}, {"name": "john varner", "sentiment": "none"}], "locations": [{"name": "los angeles", "sentiment": "none"}, {"name": "great hill partners", "sentiment": "none"}], "organizations": [{"name": "reliam rounds out executive team following significant capital investment", "sentiment": "negative"}, {"name": "reliam llc", "sentiment": "negative"}, {"name": "amazon web services", "sentiment": "none"}, {"name": "reliam", "sentiment": "none"}, {"name": "vp digital marketing", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "dreamhost", "sentiment": "none"}, {"name": "cto", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES, Jan. 30, 2018 (GLOBE NEWSWIRE) -- Reliam LLC (Reliam), a consulting and managed services provider for public cloud platforms including Amazon Web Services (AWS) and Microsoft Azure, today announced a series of key additions to the company’s leadership. The expanded management team includes Jonathan LaCour joining Reliam as Chief Technology Officer, John Varner as Chief Financial Officer, Art Elizarov as Chief Administrative Officer, and Mark Medina as VP Digital Marketing. The moves come following Reliam successfully raising substantial funding from Great Hill Partners , and will support the cloud service provider’s continued momentum following a triple-digit percentage increase in 2017 year-over-year revenue growth.\nLaCour assumes the CTO role after holding several technical leadership positions at DreamHost, one of the largest hosting and cloud platform providers. Responsibilities for the cloud industry veteran at Reliam will involve guiding the development of the Reliam platform and its intellectual property, including evaluating and selecting the software used. LaCour will also be tasked with business development initiatives, engaging with Reliam partners, and will regularly lend expertise on current cloud trends and best practices at industry conferences and Reliam events.\nVarner joins Reliam following more than six years at New Dream Network, where he served as SVP Finance. As CFO at Reliam, Varner will play an integral role in the company’s financial strategy, planning, and acquisitions, with a focus on setting and achieving long-term revenue growth goals.\nElizarov comes to Reliam from Gimbal, the mobile advertising and data solutions provider, where he served as Chief Operating Officer. As Reliam’s new Chief Administrative Officer, Elizarov leads the execution of organizational strategy and planning, the integration of acquisitions, and will shape the hiring, learning strategy, and development of Reliam’s corporate culture as it expands.\nMedina brings nearly two decades of marketing and product management experience to his role as Reliam’s VP Digital Marketing. Having served as Director of Digital Marketing at Media Temple and most recently Product Director at DreamHost, Medina’s responsibilities include leading digital marketing content and strategy as Reliam strengthens its position in the managed cloud services marketplace.\n“I couldn’t be more pleased to introduce the talented and accomplished individuals that we’ve assembled through our recent executive leadership hires,” said Simon Anderson, CEO, Reliam. “This is certainly an exciting time for Reliam, as entire industries flock to the cloud and as our managed services and consulting ensure enterprises take full advantage of all that public cloud platforms can provide. It’s beyond any doubt that Jonathan, John, Art, and Mark will each add enormous contributions to Reliam’s future growth and success.”\nAbout Reliam\nReliam is a trusted consulting and managed services provider for public cloud platforms, including Amazon Web Services and Microsoft Azure. Businesses across industries depend on Reliam to expertly and securely architect, migrate, manage, and optimize their cloud environments. A certified partner of both AWS and Azure and backed by 16 years of experience, Reliam enables customers to focus on business and product development – and not on actively managing cloud infrastructure. Because of its proven cloud optimization strategies, Reliam consistently reduces customers’ IT spend while maintaining industry-leading SLAs.\nContact: Kyle Peterson kyle@clementpeterson.com\nSource: Reliam", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/13d8c57a-733d-4d6a-92d3-531095ba3b11", "https://www.globenewswire.com/Tracker?data=giGUgTpKgKvSd0hQtxRavjBecM3VgMBJZ8Ffmi2NGgk6A_aUEfRLHnjOBYsCWywY2Nya_twnMGwHuhNHnrKsQr6ahgNDYSlGekjK-BmyROs=", "https://www.globenewswire.com/Tracker?data=eBVsEtq203qlzpc1VPf-mq9ZKLdTlDwE9CJT0RKQwWgd0ooYQx9P9hSi8GK5h-21LzPBybqKnhABBfTDN19ydg==", "https://www.globenewswire.com/Tracker?data=HA8ulpYoLJCpiOTzDC4yvsR2MGp7YcF-1WdBWoZoR-6xFU9wJDvB2f_gfZ8U96f1HBgjP90TXT7hk26bVseypyUi0WRCCAosUA-_rIVvi5jpPyhbi9Qi6QUi6XSO6R_DnNrlchwcQUTXrETFtpVTTDXG6ETgW6watNPgnZMRy_E="], "published": "2018-01-30T18:00:00.000+02:00", "crawled": "2018-01-30T18:32:24.023+02:00", "highlightTitle": ""}