{"organizations": [], "uuid": "68a83e170ab7d844230a08a99d32ef85565b7b9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-ormat-technologies-inc-to-host-conference-call-announcing-fourth-quarter-and-year-end-2017-financial-results.html", "country": "US", "domain_rank": 767, "title": "Ormat Technologies, Inc. to Host Conference Call Announcing Fourth Quarter and Year-End 2017 Financial Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T18:04:00.000+02:00", "replies_count": 0, "uuid": "68a83e170ab7d844230a08a99d32ef85565b7b9c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-ormat-technologies-inc-to-host-conference-call-announcing-fourth-quarter-and-year-end-2017-financial-results.html", "ord_in_thread": 0, "title": "Ormat Technologies, Inc. to Host Conference Call Announcing Fourth Quarter and Year-End 2017 Financial Results", "locations": [], "entities": {"persons": [], "locations": [{"name": "nev.", "sentiment": "none"}, {"name": "canada", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "ormat technologies inc.", "sentiment": "negative"}, {"name": "ormat technologies, inc.", "sentiment": "neutral"}, {"name": "ormat technologies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "RENO, Nev., Jan. 29, 2018 (GLOBE NEWSWIRE) -- Ormat Technologies Inc. (NYSE:ORA) announced today that it plans to announce its fourth quarter and year-end 2017 financial results in a press release that will be issued on Thursday, February 22, 2018, before the market opens. The Company has scheduled a conference call to discuss the results at 10 a.m. EST on Thursday, February 22, 2018.\nTo participate, please dial 1-877-511-6790 approximately 10 minutes prior to the scheduled start of the call. If calling from Canada, please dial 1-855-669-9657. If calling outside of the United States and Canada, please dial 1-412-902-4141. Please request the “Ormat Technologies, Inc. call” when prompted by the conference call operator. The conference call will also be webcast live from the Investor Relations section of the Company's website.\nA replay will be available one hour after the end of the conference call. To access the replay, please dial 1-877-344-7529, or from outside of the United States 1-412-317-0088 and use the replay conference ID number 10116087. The webcast will also be archived on the Investor Relations section of the Company's website.\nAbout Ormat Technologies\nWith over five decades of experience, Ormat Technologies, Inc. is a leading geothermal company and the only vertically integrated company engaged in geothermal and recovered energy generation (REG), with the objective of becoming a leading global provider of renewable energy. The company owns, operates, designs, manufactures and sells geothermal and REG power plants primarily based on the Ormat Energy Converter – a power generation unit that converts low-, medium- and high-temperature heat into electricity. With 73 U.S. patents, Ormat’s power solutions have been refined and perfected under the most grueling environmental conditions. Ormat has 530 employees in the United States and 720 overseas. Ormat’s flexible, modular solutions for geothermal power and REG are ideal for the vast range of resource characteristics. The company has engineered, manufactured and constructed power plants, which it currently owns or has installed to utilities and developers worldwide, totaling over 2,200 MW of gross capacity. Ormat is the largest US-based geothermal operator with its current 800 MW generating portfolio spread globally in the U.S., Guatemala, Guadeloupe, Honduras, Indonesia and Kenya. Ormat also intends to expand its operations and provide energy management and energy storage solutions, by leveraging its core capabilities and global presence.\nOrmat’s Safe Harbor Statement\nInformation provided in this press release may contain statements relating to current expectations, estimates, forecasts and projections about future events that are \"forward-looking statements\" as defined in the Private Securities Litigation Reform Act of 1995. These forward-looking statements generally relate to Ormat's plans, objectives and expectations for future operations and are based upon its management's current estimates and projections of future results or trends. Actual future results may differ materially from those projected as a result of certain risks and uncertainties. For a discussion of such risks and uncertainties, see \"Risk Factors\" as described in Ormat Technologies, Inc.'s Annual Report on Form 10-K filed with the Securities and Exchange Commission on March 1, 2017.\nThese forward-looking statements are made only as of the date hereof, and we undertake no obligation to update or revise the forward-looking statements, whether as a result of new information, future events or otherwise.\nOrmat Technologies Contact:\nSmadar Lavi\nVP Corporate Finance and Investor Relations\n775-356-9029 (ext. 65726)\nslavi@ormat.com Investor Relations Agency Contact:\nRob Fink\nHayden - IR\n646-415-8972\nrob@haydenir.com\nSource:Ormat Technologies, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/f79ca51e-cd19-47a0-a929-f3e475467c73", "https://www.globenewswire.com/Tracker?data=CXXs_etSVUZX1Bg1uB-MoWM-b4GFh0j55KtMW3uI25p-V8vhmbuEbKU7Fcfk8_xrJDyvlU1Skc6S1c9homWyTIzwl532r0KLJFd9ji-xDPWGdi2U8OECYeFnz-YWC2Fz", "https://www.globenewswire.com/Tracker?data=CXXs_etSVUZX1Bg1uB-MoWM-b4GFh0j55KtMW3uI25qYmgbzgGaFv1f48SgQKa1eMQMEoP7h6xp4DGvlDQgN5hFZmgthftNeTCO4sWKSY6WCB4QYaf9qApuH3c1Vq8Lk"], "published": "2018-01-29T18:04:00.000+02:00", "crawled": "2018-01-29T19:28:30.037+02:00", "highlightTitle": ""}