{"organizations": [], "uuid": "d054e8a63db04896469bb4b62c02434969d34ab1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-flywire-expands-global-payments-platform-with-the-addition-of-onplanu-and-onplan-health.html", "country": "US", "domain_rank": 767, "title": "Flywire Expands Global Payments Platform with the Addition of OnPlanU and OnPlan Health", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.997, "site_type": "news", "published": "2018-01-18T16:00:00.000+02:00", "replies_count": 0, "uuid": "d054e8a63db04896469bb4b62c02434969d34ab1"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-flywire-expands-global-payments-platform-with-the-addition-of-onplanu-and-onplan-health.html", "ord_in_thread": 0, "title": "Flywire Expands Global Payments Platform with the Addition of OnPlanU and OnPlan Health", "locations": [], "entities": {"persons": [{"name": "david king", "sentiment": "none"}, {"name": "flywire", "sentiment": "none"}, {"name": "john talaga", "sentiment": "none"}, {"name": "talaga", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "onplan health boston", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}, {"name": "flywire", "sentiment": "none"}], "organizations": [{"name": "onplan holdings llc", "sentiment": "none"}, {"name": "onplan health", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BOSTON, CHICAGO and LONDON, Jan. 18, 2018 (GLOBE NEWSWIRE) -- Flywire , a provider of global payment and receivables solutions for education, healthcare, and business, today announced the acquisition of OnPlan Holdings LLC, the parent company of OnPlanU and OnPlan Health . With the deal, Flywire becomes the first in the industry to offer an end-to-end solution with capabilities including invoicing, secure payment processing, consumer engagement, recurring payments, automated payment plans, payment tracking, reconciliation, and past due payments.\nOnPlan co-founders, CEO John Talaga and CTO David King, will both join the Flywire leadership team and maintain stakes in the business going forward. Talaga will head up Flywire’s healthcare segment, and King will lead the company’s education and healthcare-focused product and development teams. Current OnPlan employees will also join the Flywire team, based in OnPlan’s existing headquarters outside Chicago.\nIn addition to considerable domain expertise and product capabilities, OnPlan gives Flywire the ability to support the full spectrum of its clients’ payment and receivables needs – both domestic and international. Clients will be able to take advantage of a fully integrated solution, while also having access to its extensive partner ecosystem in the US.\n“Adding OnPlan’s technology to Flywire’s one-of-a-kind global payment and receivables platform further accelerates the trajectory for this company,” said Matt Harris, managing director, Bain Capital and Flywire board member. “Both firms share a culture that is all about how to make life better for their clients. That, combined with their complementary capabilities make this a perfect fit and will add tremendous value for their customers.”\n“We’ve had the opportunity to collaborate with Flywire on multiple occasions, at the request of several of our mutual clients,” said Talaga. “We’re solving distinct, but related problems, both taking cost and friction out of the payment and receivables process. While we complement their platform in several important ways, Flywire offers OnPlan tremendous scale with supportive and engaged investors, capital for growth, access to new markets, and a global customer support infrastructure. Joining Flywire gives us the opportunity to make a much greater impact for our current and future clients.”\nOnPlan’s vertical-specific solutions address key revenue lifecycle management needs in healthcare and higher ed. OnPlan Health is a web portal and payment solution that offers providers a simple, automated way to settle balances for patients with high out-of-pocket costs. Healthcare providers can accelerate receivables, prevent overdue balances and reduce costs by tailoring payment offers to patients, and providing more flexible ways to pay. OnPlanU is a student billing and payment solution that enables colleges and universities to automate account setup and payments in advance, and engage with students and parents to setup tailored payment schedules. It makes payments easier and provides students with more choice while also automating manual reconciliation processes for staff.\nSince coming to market in 2011, Flywire has established its platform as the preferred solution for global payments and receivables processing for education institutions and healthcare providers. In 2017, the company entered the commercial segment, serving international businesses in a variety of market segments including automotive, travel, luxury goods, publishing, import/ export, professional services, and technology.\n“The addition of OnPlan solidifies our market leadership position by enabling us to go deeper to address specific client needs in education and healthcare, and giving our clients the ability to manage all payments and receivables from a single platform,” said Mike Massaro, CEO of Flywire. “Our clients have been pushing us for this, and the OnPlan team brings a tremendous amount of technical capability and domain expertise to address it. In a short period of time, they have built a very strong product and we are excited to bring it to our global client base.”\nAbout Flywire\nFlywire is a leading provider of global payment and receivables solutions, connecting over 1,400 businesses and institutions with their customers on six continents. The company processes billions in payments per year from 220 countries and territories, via bank transfer, credit card and e-wallet solutions, in over 120 different local currencies. Flywire’s scalable platform provides currency conversion at exchange rates that can offer significant savings when compared to home-market banks and credit card providers. The company also supports its clients with end-to-end customer support including multilingual servicing via phone, email, and chat, as well as 24/7 online payment tracking. Flywire is headquartered in Boston, MA with operations in London and Manchester, UK; Shanghai, China; Tokyo, Japan; Singapore; Sydney, Australia; and Valencia, Spain. For more information, visit www.Flywire.com .\nMedia Contact: Tim Walsh +1 617.512.1641 timw@walshgroupmarketing.com\nSource: Flywire", "external_links": ["https://www.globenewswire.com/Tracker?data=rLnl7B2AX3IKCgYMDThxsW2KHzgRk04lLedtsOkd_kVrXr3WrQzZJmTvYHsPn0gFs6jZ4AvEkDACmcA7bmJSSA==", "https://www.globenewswire.com/Tracker?data=A1gjpMNvfPAAnxaaOxNc4KN5s7XZ-mAhK-7MOo-aaFOhdDTF4l1GoHKNerXadNGAs2nbUMQHsLbniXhBbtfaSQ==", "https://www.globenewswire.com/Tracker?data=rLnl7B2AX3IKCgYMDThxsUtNW_t8LvotiSAn6ByGOp1eYhdkX8AOIcZHlaSrluVk", "https://www.globenewswire.com/Tracker?data=T9i_zsBzbhUJ0OeQmj_jD39vSbbh1yzQCaA8slYuEHspW2vh44L8Ws6__3NlulRptbPmoWRAh2Dw93Wb-tNHyw==", "https://www.globenewswire.com/Tracker?data=L6SoAwquomvvh_Bo6Qvtam_aMLRWziHLgdiFcMt5fb-cqyy2WoDFLDFOMzHyQjJ2FSs7XggCjcpG6tsae7_MYA==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/e13d2037-74d2-4832-8aa0-00449f6ed793", "https://www.globenewswire.com/Tracker?data=rLnl7B2AX3IKCgYMDThxsU0-uWs5i82-ivpv1z59Qp81-CPhVNZLgF_gn11sczoxgjVosMkGYta3Wr7hQwUPow==", "https://www.globenewswire.com/Tracker?data=rLnl7B2AX3IKCgYMDThxscOB8rxWOjSmKr85CoLWWVoVE6we5bIWGTUm41jZwC2l"], "published": "2018-01-18T16:00:00.000+02:00", "crawled": "2018-01-18T16:29:48.000+02:00", "highlightTitle": ""}