{"organizations": [], "uuid": "17f9208ec7e87456e938dae47cca373b14d2e784", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/01/20/103319276-20160120-3158-1936.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/03/microsoft-google-respond-to-intel-chip-vulnerability.html", "country": "US", "domain_rank": 767, "title": "Microsoft, Google respond to Intel chip vulnerability", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-04T00:58:00.000+02:00", "replies_count": 0, "uuid": "17f9208ec7e87456e938dae47cca373b14d2e784"}, "author": "Jordan Novet", "url": "https://www.cnbc.com/2018/01/03/microsoft-google-respond-to-intel-chip-vulnerability.html", "ord_in_thread": 0, "title": "Microsoft, Google respond to Intel chip vulnerability", "locations": [], "entities": {"persons": [{"name": "satya nadella", "sentiment": "neutral"}, {"name": "david a. grogan", "sentiment": "neutral"}, {"name": "krzanich", "sentiment": "none"}, {"name": "mic", "sentiment": "none"}, {"name": "brian krzanich", "sentiment": "none"}, {"name": "jann horn", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "neutral"}, {"name": "google", "sentiment": "neutral"}, {"name": "microsoft", "sentiment": "neutral"}, {"name": "intel", "sentiment": "neutral"}, {"name": "amd", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Microsoft, Amazon, and Google said they are working on updates to cloud services and other products to prevent exploitation of chip-level security vulnerabilities.\nThe vulnerabilities, which were publicly disclosed by the Register on Tuesday, could allow a hacker to steal information stored in the memory of a wide range of computer chips running on personal devices, like computers, as well as servers in data centers, including those used to run cloud computing services. It could allow a hacker to steal information stored in the memory of the chip itself, including things such as passwords and cached files. It could also pave the way for attackers to weaken other security features.\nOne of the vulnerabilities, dubbed Meltdown , is known to affect Intel chips. Another, Spectre, could affect chips from many vendors. Indeed, Arm said that some processors based on its technology are affected.\n\"We're aware of this industry-wide issue and have been working closely with chip manufacturers to develop and test mitigations to protect our customers,\" a Microsoft spokesperson told CNBC in an email. \"We are in the process of deploying mitigations to cloud services and have also released security updates to protect Windows customers against vulnerabilities affecting supported hardware chips from Intel, Arm, and AMD.\"\nIn addition to patching its cloud services and current and older versions of Windows for servers and desktops, Microsoft has updated its Edge and Internet Explorer browsers.\nGoogle was the company to first alert Intel to the vulnerability, Intel CEO Brian Krzanich said on CNBC earlier on Wednesday.\nSubsequently Google released some details about the issues but said a full report is still to come. A new site discussing the Meltdown and Spectre vulnerabilities credits Google's Jann Horn and third-party researchers with discovering them.\nGoogle said it has updated its public cloud service to prevent attacks related to Meltdown and Spectre. \"We used our VM Live Migration technology to perform the updates with no user impact, no forced maintenance windows and no required restarts,\" Google engineering vice president Ben Treynor Sloss wrote in a blog post . But customers will still need to update the operating systems they use on the Google cloud.\nGoogle has also been busy checking on consumer services. Exploitation is \"difficult and limited\" for most Android devices, and the latest version of Chrome OS is patched, Google said.\nAmazon told customers of its Amazon Web Services cloud service that the vulnerability \"has existed for more than 20 years in modern processor architectures like Intel, AMD, and ARM across servers, desktops, and mobile devices.\" It said that it's already protected nearly all AWS instances, although customers will still have to patch the operating systems they use.\nIn the CNBC interview Krzanich said he was not aware of exploits of the issue, and Microsoft has not gotten any indication that the vulnerabilities \"had been used to attack our customers,\" the spokesperson said.\nAside from security concerns, the Register and some individuals suggested that patches to operating systems could result in performance slowdowns. But in a statement on Wednesday, Intel said that \"any performance impacts are workload-dependent, and, for the average computer user, should not be significant and will be mitigated over time.\"\nMicrosoft told customers of its Azure public cloud in a blog post that they \"should not see a noticeable performance impact.\"\nLinux distribution vendor Red Hat is working on making product updates available to customers. \"Red Hat is taking a proactive position that favors security over performance, while allowing users the flexibility to assess their own environment and make appropriate tradeoffs through selectively enabling and disabling the various mitigations,\" the company said on a website devoted to the vulnerabilities.\nSome Red Hat patches are live, and more will be coming in the next few days, a spokesperson told CNBC in an email.\nshow chapters Intel CEO: We're working to patch security issue 16 Hours Ago | 03:17", "external_links": [], "published": "2018-01-04T00:58:00.000+02:00", "crawled": "2018-01-04T00:59:06.053+02:00", "highlightTitle": ""}