{"organizations": [], "uuid": "c985dcef9b040fb8fa5e329fed6b18275490e060", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000551/device/rss", "section_title": "California", "url": "https://www.cnbc.com/2018/01/18/reuters-america-apple-says-it-will-decide-new-campus-site-without-an-auction.html", "country": "US", "domain_rank": 767, "title": "Apple says it will decide new campus site without an auction", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T23:48:00.000+02:00", "replies_count": 0, "uuid": "c985dcef9b040fb8fa5e329fed6b18275490e060"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/18/reuters-america-apple-says-it-will-decide-new-campus-site-without-an-auction.html", "ord_in_thread": 0, "title": "Apple says it will decide new campus site without an auction", "locations": [], "entities": {"persons": [{"name": "tim cook", "sentiment": "none"}, {"name": "cook", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "cupertino", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "california", "sentiment": "none"}, {"name": "austin", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "apple inc", "sentiment": "negative"}, {"name": "abc news", "sentiment": "none"}, {"name": "amazon.com inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 18 (Reuters) - Apple Inc said on Thursday that it will not hold a bidding process when it chooses the site for a planned new U.S. campus, marking a stark difference from the public contest that Amazon.com Inc has held for its second headquarters.\nAn Apple spokesman confirmed that the company does not plan to hold a bidding process for the new campus, after Apple chief executive Tim Cook said on Wednesday that he did not want \"an \"auction kind of process.\"\nApple's new campus is unlikely to be located in California, where the tech company's headquarters are housed at its sleek \"spaceship\" Apple Park campus in Cupertino, or in Texas, where it has facilities in Austin that house customer service and some computer assembly operations, said Cook in an interview with ABC News on Wednesday.\n\"We've narrowed the list a lot,\" Cook said of potential sites. \"We wanted to narrow it so we prevent this auction kind of process that we want to stay out of.\"\nApple announced plans for a new site on Wednesday, along with a 5-year, $30 billion U.S. spending plan that will generate 20,000 jobs and an expected payment of $38 billion in taxes on its foreign profits.\nThe company said it plans to announce the location of the site later this year.\nCities across the country have expressed an interest in hosting the new campus. Chicago Mayor Rahm Emanuel told reporters on Wednesday at a city hall press conference: \"We're going to go compete and we're going to put our best foot forward.\"\nApple's decision stands in contrast to Amazon, which has held a highly publicized process to select a second headquarters that the e-commerce giant says will generate as many as 50,000 jobs.\nOn Thursday, Amazon narrowed its list of applicants to 20 cities, including Canada's Toronto and smaller cities such as Raleigh, North Carolina and Columbus, Ohio. (Reporting by Stephen Nellis in San Francisco, Additional reporting by Karen Pierog in Chicago, Editing by Rosalba O'Brien)", "external_links": [], "published": "2018-01-18T23:48:00.000+02:00", "crawled": "2018-01-20T19:03:28.011+02:00", "highlightTitle": ""}