{"organizations": [], "uuid": "77a9146935eaa86be708e5462cda4133902133ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-climatechange-norway/norways-arctic-oil-plan-does-not-violate-constitution-court-idUSKBN1ET1KW", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Norway's Arctic oil plan does not violate constitution-court", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T16:02:00.000+02:00", "replies_count": 0, "uuid": "77a9146935eaa86be708e5462cda4133902133ca"}, "author": "", "url": "https://www.reuters.com/article/us-climatechange-norway/norways-arctic-oil-plan-does-not-violate-constitution-court-idUSKBN1ET1KW", "ord_in_thread": 0, "title": "UPDATE 1-Norway's Arctic oil plan does not violate constitution-court", "locations": [], "entities": {"persons": [], "locations": [{"name": "norway", "sentiment": "none"}, {"name": "oslo", "sentiment": "none"}, {"name": "arctic", "sentiment": "none"}, {"name": "western europe", "sentiment": "none"}], "organizations": [{"name": "min read  oslo", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "greenpeace", "sentiment": "none"}, {"name": "statoil", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "chevron", "sentiment": "none"}, {"name": "ministry of petroleum and energy", "sentiment": "none"}, {"name": "nature and youth group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 4, 2018 / 2:07 PM / Updated 2 hours ago Norway's government wins Arctic oil lawsuit, greens lose Alister Doyle , Terje Solsvik 3 Min Read \nOSLO (Reuters) - An Oslo court approved Norway’s plans for more oil exploration in the Arctic on Thursday, dismissing a lawsuit by environmentalists who had said it violated people’s right to a healthy environment. \nThe case, brought by Greenpeace and the Nature and Youth Group, had argued that a 2015 oil licensing round in the Arctic that gave awards to Statoil, Chevron and others was unconstitutional. \n“The environmental organizations’ argument that the plan violates the Constitution’s Article 112 has not succeeded,” Oslo district court ruled. “The state, represented by the Ministry of Petroleum and Energy, is exonerated.” \nThe court ordered the environmental groups to pay the state’s legal costs of 580,000 Norwegian crowns ($71,687). It was not immediately known if they would appeal against the ruling. \nNorway is Western Europe’s largest producer and exporter of oil and gas and plans to keep pumping for decades despite its support for the 2015 Paris climate accord, which aims to end the fossil fuel era this century. \nWhile Norway’s output from the Arctic remains small, the region is believed to hold the greatest potential for new discoveries that could gradually replace production from rapidly maturing North Sea and Norwegian Sea fields. \nThe government’s lawyers had argued that the case was a publicity stunt that would cost jobs if it was successful. \nThe court said that any production from future Arctic fields would not start for 10-15 years, by which time a new management plan for the northern region would almost certainly be in place. \nAnd it said government and parliament had taken proper account of how the ice in the Arctic region was retreating because of global warming. Environmentalists say a cold year could bring ice back to the region. \nThe legal action was part of an emerging branch of law worldwide in which plaintiffs invoke a nation’s founding principles in a bid to bring about policy change to limit global warming. \nDuring the hearing in late 2017, the government said it was inappropriate to invoke the constitution rather than focus on taxes and regulations to control greenhouse gases. \nThe Norwegian oil industry lobby group welcomed the decision. \n“We’ve previously said that this is a matter of politics, and politics should be made in parliament, not in the court,” said Tommy Hansen, a spokesman for the Norwegian Oil and Gas Association. \nAmong firms winning stakes in 10 licenses awarded in Norway’s 23rd round of awards were Lukoil, ConocoPhillips, Lundin, Aker BP, OMV, Centrica, Idemitsu and others. \n($1 = 8.0907 Norwegian crowns)", "external_links": [], "published": "2018-01-04T16:02:00.000+02:00", "crawled": "2018-01-04T16:22:50.011+02:00", "highlightTitle": ""}