{"organizations": [], "uuid": "d180ce248c01008e78fb70bf0325a8df33ed4f60", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-russia-congress/kremlin-says-absence-of-syrian-opposition-will-not-hinder-sochi-congress-idUSKBN1FI0ZR", "country": "US", "domain_rank": 408, "title": "Kremlin says absence of Syrian opposition will not hinder Sochi congress", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T12:07:00.000+02:00", "replies_count": 0, "uuid": "d180ce248c01008e78fb70bf0325a8df33ed4f60"}, "author": "", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-russia-congress/kremlin-says-absence-of-syrian-opposition-will-not-hinder-sochi-congress-idUSKBN1FI0ZR", "ord_in_thread": 0, "title": "Kremlin says absence of Syrian opposition will not hinder Sochi congress", "locations": [], "entities": {"persons": [{"name": "polina devitt", "sentiment": "none"}, {"name": "polina ivanova", "sentiment": "none"}, {"name": "dmitry peskov", "sentiment": "none"}], "locations": [{"name": "sochi", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "russian black sea", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}], "organizations": [{"name": "kremlin", "sentiment": "negative"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MOSCOW/BEIRUT (Reuters) - The Kremlin shrugged off a Syrian opposition decision to boycott a peace conference in Russia this week, saying on Monday the event would go ahead regardless and make a meaningful contribution to a political solution.\nRussia is hosting what it has called a Syrian Congress of National Dialogue in the Black Sea resort of Sochi on Tuesday that it hopes will launch negotiations on drafting a new constitution for Syria after almost seven years of civil war.\nBut Western powers and some Arab states believe Sochi is an attempt to create a separate peace process that would undermine U.N. efforts to broker a peace deal while laying the groundwork for a solution more suitable to Syrian President Bashar al-Assad and his allies, Russia and Iran.\nA spokesman for the Syrian opposition said on Saturday it would not attend the Russian event, dismissing the gathering as an attempt by Moscow to sideline the U.N.-backed peace process.\nThe decision was a setback for Moscow, which is keen to cast itself and President Vladimir Putin as an important Middle East peace broker after its military helped turn the tide of the conflict in Syria in Assad’s favor.\nKremlin spokesman Dmitry Peskov said on a conference call with reporters: “The fact that some representatives of the processes currently taking place in Syria are not participating is unlikely to stop this congress from going ahead and is unlikely to seriously undermine the importance of the congress.”\nIMMEDIATE BREAKTHROUGHS IMPROBABLE “Everyone recognizes that immediate breakthroughs in the Syrian peace process are unlikely to be possible. The only thing that is possible is patient, incremental, detailed work that can move us forward. In this sense, the Congress will be a very important, meaningful step on this road.”\nSeparately, Putin’s Syria envoy Alexander Lavrentiev told the TASS news agency that Moscow regretted the opposition leadership’s decision to stay away, but said he hoped “common sense” would prevail and they would change their minds.\nHe said some members of other opposition factions would attend and that “all strata” of Syrian society would be represented.\nLavrentiev told TASS he expected the conference to focus on selecting the members of a commission to draft a new Syrian constitution and for delegates to appeal for help to rebuild Syria.\nFresh elections and the country’s name are also expected to be discussed.\nThe opposition says the event is a waste of time, however.\nGeorge Sabra, a prominent figure in the Syrian political opposition, told Reuters by phone:\n“(Sochi) is a project to serve Russian policy. The Russians are trying, through this congress, to find a place for themselves in the Syrian political space after putting their heavy hand on Syrian land.”\nTop Syrian Kurdish politician Hediye Yusuf, an architect of Kurdish-led autonomy plans for northern Syria, also predicted on social media that the event would yield little of import.\nRelated Coverage France, Britain shun Sochi meeting on Syria, want U.N. process Russian military calls for direct talks in Syria's eastern Ghouta: RIA “Sochi will not bring results if the parties that are present on the ground are not there,” wrote Yusuf.\nRussia, together with Turkey and Iran, was already presiding over a separate track of peace talks in Kazakhstan distinct from U.N.-backed Geneva talks, and the Sochi event was meant to kick start a peace process mired in disagreement.\nMoscow says its own peacemaking efforts are meant to complement, not compete with U.N. attempts.\nRussia says some 1,600 Syrian delegates have been invited to take part in the congress when it opens on Tuesday.\nAdditional reporting by Maria Tsvetkova in Sochi; Editing by Ralph Boulton\n ", "external_links": [], "published": "2018-01-29T12:07:00.000+02:00", "crawled": "2018-01-29T12:16:36.035+02:00", "highlightTitle": ""}