{"organizations": [], "uuid": "55d7da65fab1e3edd3cc36507badf73a14d6ca84", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 12}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/12/27/104188261-GettyImages-630309348r.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/20398120/device/rss/rss.html", "section_title": "Trader Talk with Bob Pisani", "url": "https://www.cnbc.com/2018/01/09/a-surge-in-investor-demand-confronts-the-buyback-effect.html", "country": "US", "domain_rank": 767, "title": "A surge in investor demand confronts the 'buyback effect'", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T14:02:00.000+02:00", "replies_count": 0, "uuid": "55d7da65fab1e3edd3cc36507badf73a14d6ca84"}, "author": "", "url": "https://www.cnbc.com/2018/01/09/a-surge-in-investor-demand-confronts-the-buyback-effect.html", "ord_in_thread": 0, "title": "A surge in investor demand confronts the 'buyback effect'", "locations": [], "entities": {"persons": [{"name": "bob pisani", "sentiment": "negative"}, {"name": "jim cramer", "sentiment": "none"}, {"name": "eduardo munoz alvarez", "sentiment": "none"}], "locations": [], "organizations": [{"name": "s&p", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "We all know why the stock market is at new highs: It's a combination of the expanding global economy, record earnings and low rates.\nThat's the conventional narrative, and it certainly makes sense. But as earnings season begins in earnest on Friday, and with stocks at historic highs and interest in the markets increasing, many investors are wondering if there is enough stock to go around.\nCall it \"the buyback effect.\" Companies have been aggressively buying back stock for years, and investors are starting to notice the shortage.\nMy colleague Jim Cramer is one of them: \"We don't have enough shares to go around,\" he said a couple of weeks ago on CNBC's \" Mad Money .\" \"There's just not enough supply, not enough stock to meet the demand from buyers who had to radically switch their orientation to deal with a much more positive backdrop.\"\nCramer cited a shortage of stock in high-demand companies like Amazon and Walmart , in particular.\nHe repeated that assertion Monday: \"We do not have enough machinery and cyclical companies. That's a big part of this [stock market run-up],\" he said on CNBC.\nHe has a point. In 2006, the S&P 500 represented some 307 billion shares of stock. After the 2008-09 financial crisis, that number shot up by 10 percent, to 332 billion by 2010, as many companies issued new stock to deal with the effects of the financial crisis.\nForemost among these issuers were financial companies, which nearly doubled the amount of their shares outstanding from 2008 to 2010. Bank of America's shares outstanding more than doubled, from 4.5 billion in 2008 to 10 billion at the start of 2010. J.P. Morgan went from 3.4 billion to 4.1 billion at the start of 2010. Wells Fargo went from 3.3 billion to 5.2 billion by the end of 2010.\nBut soon after that, buybacks became all the rage, even if many of the biggest banks were restricted from buying back stock. Beginning in 2011, the S&P share count dropped back to 303 billion and has remained around that level since, with 306 billion at the end of 2017.\nOf course, during all this time, companies were issuing new options to their executives, then turning around and buying back stock.\nThe effect of all this activity is a wash: The number of shares is the same today as in 2006, but the prices have doubled. The average S&P 500 stock in 2006 was priced at roughly $50; at the end of 2017, it was $107.\nPrices doubling, with the same amount of shares, means demand is much higher.\nCramer isn't alone in attributing part of the rally to buybacks. Howard Silverblatt at S&P Global has also noticed that shares outstanding are the same as a decade ago: \"Considering all the new household wealth, and all the money that is going into the market, they don't have more places to put it,\" he told me. \"They don't have more shares to buy. We are getting more demand, but the supply isn't increasing.\"\nThus, buybacks have contributed to the higher prices: \"It's a double whammy: Companies have been reducing supply and adding upward pressure on prices by themselves buying back their own stock.\"\nHe concludes, \"If shares are the same, and you have increased demand, prices will go up.\"\nAnd it may get worse. Companies are expected to announce more share buybacks this earnings season in the wake of the tax cuts and companies bringing profits made overseas back home.", "external_links": [], "published": "2018-01-09T14:02:00.000+02:00", "crawled": "2018-01-09T14:16:29.086+02:00", "highlightTitle": ""}