{"organizations": [], "uuid": "090ed5fdb7054fe0fbc1837c45299d3c3525f0c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-richard-salmen-cfpa-takes-the-helm-of-cfp-boards-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Richard Salmen, CFP® Takes the Helm of CFP Board's Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T18:11:00.000+02:00", "replies_count": 0, "uuid": "090ed5fdb7054fe0fbc1837c45299d3c3525f0c3"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/10/pr-newswire-richard-salmen-cfpa-takes-the-helm-of-cfp-boards-board-of-directors.html", "ord_in_thread": 0, "title": "Richard Salmen, CFP® Takes the Helm of CFP Board's Board of Directors", "locations": [], "entities": {"persons": [{"name": "richard salmen", "sentiment": "negative"}, {"name": "salmen", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "cfp", "sentiment": "negative"}, {"name": "cfp board", "sentiment": "negative"}, {"name": "board of directors for certified financial planner board of standards, inc.", "sentiment": "none"}, {"name": "financial planning association", "sentiment": "none"}, {"name": "national association of personal financial advisors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON, Jan. 10, 2018 /PRNewswire-USNewswire/ -- Richard Salmen, CFP® – a former air traffic controller with 25 years of financial planning experience – is now the 2018 Chair of the Board of Directors for Certified Financial Planner Board of Standards, Inc. (CFP Board). In this leadership position, he takes the helm of the professional body that certifies more than 80,000 financial planning professionals in the United States.\n\"This year promises to be significant for our profession and for the CFP® mark as we finalize the proposed revised Code of Ethics and Standards of Professional Conduct,\" said Salmen. \"This major undertaking and other important initiatives demonstrate our commitment to benefit the public through competent and ethical financial planning provided by CFP® professionals.\"\nSalmen has served on CFP Board's Board of Directors since 2015. He was the president of the Financial Planning Association® (FPA®) in 2009, at the height of the sub-prime mortgage financial crisis. Along with the chairs of CFP Board and the National Association of Personal Financial Advisors, he helped to form the Financial Planning Coalition , which advocated for public policy that protected investors and advanced the financial planning profession.\nOn January 1 of this year, Salmen joined Family Investment Center as President to spearhead expanded financial planning services at the firm's suburban office located outside of Kansas City, Mo. Most recently, Salmen was interim Chief Executive Officer of Northern Financial Advisors, Inc. Prior to that, he was an owner of GTrust Financial Partners (later sold to BOK Financial), overseeing the firm's financial planning practice.\nSalmen learned early on in life that ability combined with discipline are key elements to success. He enlisted in the U.S. Army in 1984 and went to college on a three-year Army ROTC scholarship the following year. He earned his Bachelor's Degree from the University of Nebraska at Kearney and an MBA from the University of Kansas.\nSalmen also served on active duty in the U.S. Army and as a Captain in the U.S. Army Reserve, where he played a pivotal role in building a new type of brigade focused on helping soldiers become more tactically trained for battle. For nearly 25 years, Salmen was also an air traffic controller in Kansas until his retirement in 2013. He continues to enjoy taking to the skies as a private pilot.\n\"Richard is a recognized leader in the financial planning profession and he is a strong advocate for CFP® certification,\" said CFP Board CEO Kevin R. Keller, CAE. \"I look forward to continuing to work with him as he leads the Board of Directors this year.\"\nABOUT CFP BOARD\nThe mission of Certified Financial Planner Board of Standards, Inc. is to benefit the public by granting the CFP ® certification and upholding it as the recognized standard of excellence for competent and ethical personal financial planning. The Board of Directors, in furthering CFP Board's mission, acts on behalf of the public, CFP ® professionals and other stakeholders. CFP Board owns the certification marks CFP ® , CERTIFIED FINANCIAL PLANNER™, CFP ® (with plaque design) and CFP ® (with flame design) in the U.S., which it awards to individuals who successfully complete CFP Board's initial and ongoing certification requirements. CFP Board currently authorizes more than 80,000 individuals to use these marks in the U.S.\nView original content: http://www.prnewswire.com/news-releases/richard-salmen-cfp-takes-the-helm-of-cfp-boards-board-of-directors-300580751.html\nSOURCE Certified Financial Planner Board of Standards, Inc.", "external_links": ["http://financialplanningcoalition.com/", "http://www.prnewswire.com/news-releases/richard-salmen-cfp-takes-the-helm-of-cfp-boards-board-of-directors-300580751.html"], "published": "2018-01-10T18:11:00.000+02:00", "crawled": "2018-01-10T18:40:52.055+02:00", "highlightTitle": ""}