{"organizations": [], "uuid": "ecc4636a5434affa5312786d8e3180135d76025f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/subjects/middle-east", "section_title": "Middle East Insight", "url": "https://www.reuters.com/article/us-germany-energy-gasgrids/european-gas-market-can-cope-with-groningen-cuts-industry-official-idUSKBN1FD2GI", "country": "US", "domain_rank": 408, "title": "European gas market can cope with Groningen cuts: industry official", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.009, "site_type": "news", "published": "2018-01-25T01:10:00.000+02:00", "replies_count": 0, "uuid": "ecc4636a5434affa5312786d8e3180135d76025f"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-germany-energy-gasgrids/european-gas-market-can-cope-with-groningen-cuts-industry-official-idUSKBN1FD2GI", "ord_in_thread": 0, "title": "European gas market can cope with Groningen cuts: industry official", "locations": [], "entities": {"persons": [{"name": "stephan kamphues", "sentiment": "none"}, {"name": "kamphues", "sentiment": "none"}], "locations": [{"name": "berlin", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "germany", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "groningen", "sentiment": "negative"}, {"name": "gte", "sentiment": "none"}, {"name": "european network of transmission system operators", "sentiment": "none"}, {"name": "vier gas transport", "sentiment": "none"}, {"name": "open grid europe", "sentiment": "none"}, {"name": "gas transport europe", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "BERLIN (Reuters) - European gas networks can cope with further production cuts at the Dutch Groningen field as the government seeks to limit earthquake risks, a leading pipeline company and gas industry official said in an interview on Wednesday.\nThe Dutch government said last week that output at the major European field, which used to provide 53 billion cubic meters (bcm) per year in its heyday, must be cut further after a 10 percent reduction to 21.6 bcm in the year to Sept. 30, 2018 to avoid seismic risks.\n“The European gas system has leeway and can handle further declines in Dutch production,” said Stephan Kamphues, board spokesman of Vier Gas Transport, the sole owner of Open Grid Europe (OGE), Germany’s 12,000 km (7,500 mile) gas pipeline.\n“There is no supply problem,” Kamphues, who also serves as president of the European Network of Transmission System Operators (ENTSOG) and industry association Gas Transport Europe (GTE), told Reuters.\nThe worries around Groningen underpin Europe’s gas prices but with an abundance of gas the developments have not posed a real threat to security of supply.\nKamphues said that the crisis put pressure on the market, as Europe’s indigenous supplies are in long-term decline.\nBut big investments had ensured that north-south and east-west routes for pipeline gas were in place while liquefied natural gas (LNG) arriving by ship would create further competition.\n“The vision is once the Netherlands have left (as producer), the market will decide on the origin of gas,” he said.\nMeanwhile, main pipeline gas supplier Russia has just posted record exports to Europe once again.\nIn 2013, Groningen accounted for two-thirds of Dutch production and met around 10 percent of European Union demand.\nGermany aside, it delivers varying volumes to France, Belgium, Britain and Italy, countries that were equipped to absorb alternatives, Kamphues said.\nOGE has speeded up investments in network expansions, revamps and conversion measures to adjust for lost Dutch gas quality specifications, spending 533 million euros ($660 million) in 2017 under regulators’ watch.\nIt is due to invest between 400 and 500 million euros each year between 2017 and 2021, reaching a total of 2.2 billion euros.\nTwo years ago, the company had envisaged spending only 3 billion euros over 10 years.\n“We’re in a greater hurry than we thought,” he said.\nOGE is owned by Australia’s Macquarie, British Columbia Investment Management Corp, Munich Re’s MEAG and an Abu Dhabi investment fund.\nEditing by Adrian Croft\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-25T01:10:00.000+02:00", "crawled": "2018-01-24T21:28:32.004+02:00", "highlightTitle": ""}