{"organizations": [], "uuid": "f6af4f8908e1517dded55253d342f0426905c5d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226602069&w=1200&r=LYNXMPEE0T0UP", "site_section": "http://feeds.reuters.com/reuters/businessNews", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-fabercastell-future/pencil-maker-faber-castell-sharpens-up-for-digital-age-idUSKBN1FJ1QX", "country": "US", "domain_rank": 408, "title": "Pencil-maker Faber-Castell sharpens up for digital age", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T15:07:00.000+02:00", "replies_count": 0, "uuid": "f6af4f8908e1517dded55253d342f0426905c5d1"}, "author": "", "url": "https://www.reuters.com/article/us-fabercastell-future/pencil-maker-faber-castell-sharpens-up-for-digital-age-idUSKBN1FJ1QX", "ord_in_thread": 0, "title": "Pencil-maker Faber-Castell sharpens up for digital age", "locations": [], "entities": {"persons": [{"name": "daniel rogger", "sentiment": "none"}], "locations": [{"name": "germany", "sentiment": "none"}], "organizations": [{"name": "faber-castell", "sentiment": "negative"}, {"name": "douglas busvine", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NUREMBERG, Germany (Reuters) - If the digital revolution is going to consign anything to the dustbin of history, you might think the humble pencil would be a leading contender.\nHowever, with such pastimes as doodling and coloring being touted as stressbusters to escape the daily grind and the relentless lure of smartphones, German pencil-maker Faber-Castell is thriving 256 years after it was founded.\n“We see that people with all the digital devices around go back to a more manual way of expressing themselves,” Daniel Rogger, chief executive of the family owned firm, told Reuters.\n“It’s like a counter-trend to digitalization in terms of product usage and of course that’s something that we love to see.”\nThe fashion for adult coloring, where people have books of different themes and patterns to complete, like children, lifted Faber-Castell to record sales of 667 million euros in 2016/2017.\nWhile that fad has now ebbed, new trends such as “bullet journals” - a combination of writing to-do lists and artistic doodling - will keep sales stable in 2017/2018, Rogger said.\nFaber-Castell is even seeking to turn the online world to its advantage by setting up a digital gallery.\nWood-cased coloured pencils are pictured in a shop at Faber-Castell manufacturer in Stein near Nuremberg, Germany January 16, 2018. Picture taken January 16, 2018. REUTERS/Michaela Rehle It launched the platform last year in Brazil – one of its biggest markets – where artists can share their work and creative ideas.\nIt is also setting up fine art academies in Japan and Lebanon modeled on the one in Stein, outside Nuremberg, where Faber-Castell makes 150 million colored pencils a year.\nA larger factory in Brazil produces more than 2 billion each year. Laid end to end, its annual production would go round the world 10 times.\nSlideshow (15 Images) The company has been in the same family for nine generations, and over that time it has faced repeated threats to its existence.\nThe castle overlooking its factory was commandeered by the Nazis and, after World War Two, requisitioned by the Americans to house journalists covering the Nuremberg war crimes trials.\nAnd, in a case of what today might be called digital disruption, the invention of electronic calculator in the 1970s destroyed Faber-Castell’s sideline making slide rules virtually overnight.\nLast year Faber-Castell appointed Rogger as its first chief executive from outside the family. For him the digital era and social media presents an opportunity.\n“It enables us to get very close to our customers, to our consumers, to interact, to get direct feedback on our products, on trends,” said Rogger, a 49-year-old Swiss with a background in the luxury watch industry.\nReporting by Douglas Busvine; Editing by Alison Williams\n ", "external_links": [], "published": "2018-01-30T15:07:00.000+02:00", "crawled": "2018-01-30T15:16:45.013+02:00", "highlightTitle": ""}