{"organizations": [], "uuid": "a82f19cdc796f232a65a2ec94d8cf01668a035aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225263834&w=1200&r=LYNXMPEE0O1LW", "site_section": "http://feeds.reuters.com/reuters/technologyNews\r", "section_title": "Reuters: Technology News", "url": "https://www.reuters.com/article/us-viacom-cbs-m-a-exclusive/exclusive-viacom-cbs-ceos-have-discussed-potential-merger-sources-idUSKBN1FE2XT", "country": "US", "domain_rank": 408, "title": "Exclusive: Viacom, CBS CEOs have discussed potential merger - sources", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T22:39:00.000+02:00", "replies_count": 0, "uuid": "a82f19cdc796f232a65a2ec94d8cf01668a035aa"}, "author": "", "url": "https://www.reuters.com/article/us-viacom-cbs-m-a-exclusive/exclusive-viacom-cbs-ceos-have-discussed-potential-merger-sources-idUSKBN1FE2XT", "ord_in_thread": 0, "title": "Exclusive: Viacom, CBS CEOs have discussed potential merger - sources", "locations": [], "entities": {"persons": [{"name": "leslie moonves", "sentiment": "none"}, {"name": "bob bakish", "sentiment": "none"}, {"name": "jessica toonkel", "sentiment": "none"}, {"name": "moonves", "sentiment": "none"}, {"name": "edi", "sentiment": "none"}, {"name": "shari redstone", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "viacom", "sentiment": "negative"}, {"name": "cbs", "sentiment": "negative"}, {"name": "viacom inc", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "cbs corp", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - Viacom Inc ( VIAB.O ) Chief Executive Bob Bakish and CBS Corp ( CBS.N ) CEO Leslie Moonves have had an exploratory discussion about merging the two companies, sources familiar with the situation told Reuters on Thursday.\nThe discussion signifies a potential first step toward a recombination of CBS and Viacom. The boards of both companies have regularly scheduled meetings in the next couple of weeks and are expected to discuss the potential merger, the sources said.\nThe discussion, which took place earlier this month, was preliminary and no decisions have been made, but signals that Moonves, who has had reservations about a potential deal between the companies, could be more open to the idea.\nThe sources wished to remain anonymous because they are not permitted to speak to the media. Viacom and CBS declined to comment. A spokeswoman for Shari Redstone did not immediately return calls for comment.\nViacom shares were last up 1.8 percent in afternoon trade. CBS shares were up 0.5 percent.\nShari Redstone and Sumner Redstone, her ailing 94-year-old father, together control both CBS and Viacom through their privately owned movie theater company, National Amusements Inc.\nFILE PHOTO: A woman exits the Viacom Inc. headquarters in New York, U.S. on April 30, 2013. REUTERS/Lucas Jackson/File Photo The Redstones failed in an attempt to merge the companies in 2016, due to concerns by CBS’ directors and Moonves over the financial sense for CBS shareholders and governance issues.\nHowever, Shari Redstone has continued to discuss with executives at both companies her desire to merge the two, which has gained steam since Walt Disney Co ( DIS.N ) announced in December it would acquire a majority of Twenty-First Century Fox Inc’s ( FOXA.O ) assets, sources have told Reuters.\nA combined CBS, which owns cable networks including Showtime as well as the CBS TV Network and CBS TV Studios, and Viacom, whose businesses include Paramount Pictures, Nickelodeon and MTV, would have more negotiating leverage with cable and satellite companies.\nBakish is expected to have a senior role at the combined company if a merger does go through, sources said.\nSince he took over Viacom in late 2016, Bakish, 54, has improved relations with distributors, found financing for Paramount Pictures after Chinese investors dropped out and shuffled programming.\nEven so, Viacom’s stock has been trading around $33 a share, below the $35 to $38.80 range it was trading at when it and CBS explored a merger in late 2016.\nReporting By Jessica Toonkel in New York; Editing by Meredith Mazzilli\n ", "external_links": [], "published": "2018-01-25T22:39:00.000+02:00", "crawled": "2018-01-25T22:48:33.049+02:00", "highlightTitle": ""}