{"organizations": [], "uuid": "58d06ab4ad6ddd88e50d58601bad8c27f09b0e8a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/places/africa", "section_title": "Reuters.com | Africa", "url": "https://www.reuters.com/article/us-africa-worm-food/crop-munching-pest-in-africa-raises-hunger-threat-idUSKBN1FF2D1", "country": "US", "domain_rank": 408, "title": "Crop munching pest in Africa raises hunger threat", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.997, "site_type": "news", "published": "2018-01-27T01:43:00.000+02:00", "replies_count": 0, "uuid": "58d06ab4ad6ddd88e50d58601bad8c27f09b0e8a"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-africa-worm-food/crop-munching-pest-in-africa-raises-hunger-threat-idUSKBN1FF2D1", "ord_in_thread": 0, "title": "Crop munching pest in Africa raises hunger threat", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ROME (Thomson Reuters Foundation) - A crop munching worm that can fly up to 100 km (60 miles) at night is spreading rapidly across Africa, threatening food production and the livelihoods of millions of farmers already struggling with conflicts and drought, experts said on Friday.\nThe larvae form of fall armyworm prefers maize, but can feed on more than 80 plant species including rice, sorghum, millet, sugarcane, vegetable crops and cotton, said the United Nations’ Food and Agricultural Organization (FAO).\n“There are roughly 35 million hectares of maize planted per year in Africa and if (the worm is) not in all those maize fields now, it will be very soon in the next planting season or so,” said Allan Hruska, principal technical coordinator at FAO.\nThe fields are tended by some 30 million smallholder farmers who depend on maize for food and income, Hruska said.\n“Fall armyworm poses a great challenge to the survival of agriculture in Africa,” with potential to put hundreds of millions at risk of hunger, Mark Green, head of the U.S. Agency for International Development told the Thomson Reuters Foundation in a statement.\nThe invasive species, native to tropical and subtropical regions of the Americas, was first detected in Central and Western Africa in early 2016.\nIt has now spread to virtually all of sub-Saharan Africa, according to an FAO map seen by the Thomson Reuters Foundation. The female moth can lay up to 1,000 eggs in her lifetime.\nIn December, Malawi declared 20 out of 28 districts disaster areas after an outbreak of fall armyworm. In Zimbabwe, fall armyworm destroyed 20 percent of the country’s maize crop last season, according to government figures, at a time when the country was recovering from devastating drought.\nLosses in Africa could range from 8 to 20 million tonnes in just 12 maize-producing countries alone if the pest is not controlled, and could be more severe in areas already suffering drought and conflict, said Ken Wilson, professor of evolutionary ecology at Lancaster University in England.\nDrought-affected plants are less able to resist the pests while conflict may prevent farmers from accessing much-needed help, he said.\nFarmers in America use genetically modified plants and advanced pesticides to control the pests, but these options may be too expensive, and harm the environment and crops.\n“(The farmers) can get pesticides from the government this year, but what happens next year, or the year after that?” said Wafaa El Khoury, technical specialist at the International Fund for Agricultural Development (IFAD) in Rome.\nMixing crops and encouraging natural predators may be more effective, from the experience of smallholder farmers in the Americas, said FAO’s Hruska.\nBut Wilson said fall armyworm’s presence in Africa is irreversible. “It’s here to stay and we need to develop strategies on how best to manage this pest long-term,” he said.\nReporting By Thin Lei Win, Editing by Ros Russell; Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, corruption and climate change. Visit www.trust.org\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-27T01:43:00.000+02:00", "crawled": "2018-01-27T00:10:38.005+02:00", "highlightTitle": ""}