{"organizations": [], "uuid": "8bc7953124fc95a427d72171ada28fa139f7525b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/business-wire-icx-media-adds-depth-with-executive-additions-of-digital-media-and-technology-veteran-d-scott-bowen-as-its-president-coo-and.html", "country": "US", "domain_rank": 767, "title": "ICX Media Adds Depth With Executive Additions of Digital Media and Technology Veteran D. Scott Bowen as its President & COO and Former Digitas and TIME, Inc. CEO Laura Lang to its Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T08:01:00.000+02:00", "replies_count": 0, "uuid": "8bc7953124fc95a427d72171ada28fa139f7525b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/business-wire-icx-media-adds-depth-with-executive-additions-of-digital-media-and-technology-veteran-d-scott-bowen-as-its-president-coo-and.html", "ord_in_thread": 0, "title": "ICX Media Adds Depth With Executive Additions of Digital Media and Technology Veteran D. Scott Bowen as its President & COO and Former Digitas and TIME, Inc. CEO Laura Lang to its Board of Directors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON--(BUSINESS WIRE)-- After raising nearly $10 million in funding over the past 24 months, ICX Media, Inc., a video intelligence service and creative exchange, today announced additions to its Executive team and Board of Directors. The growing company named digital media and technology executive D. Scott Bowen as its new President and Chief Operating Officer. ICX Media also announced that Laura Lang , current Founder and Managing Director of Narragansett Ventures and former Chief Executive Officer of both TIME Inc. and Digitas has joined its Board of Directors.\nBuilt with next-generation data intelligence at is core, ICX Media provides powerful storytelling tools to marketers, media firms and video creators, enabling them to make decisions about content creation, partnerships, audiences and distribution with confidence. ICX Media brings together more than 850,000 diverse video creators with precise, real-time audience and performance insights, allowing enterprises to quickly generate high-quality, cost-efficient, branded video content efficiently and at scale. ICX Media launched its offering for independent video creators in late 2016 and launched its solution for brands and media companies in 2017. The company announced a $6.6 million Series A financing, led by a group of top venture investors, in October 2017.\n“The addition of Scott and Laura will be instrumental in ICX Media’s continued growth and development as we lead the evolution of the way marketers, media firms and content owners create and share more engaging and results-driven videos with their audiences,” said Michael Avon, Founder and CEO of ICX Media. “Laura’s deep industry insights and experience in strategically guiding global media brands and marketing agencies in today’s media landscape will greatly benefit ICX Media, the hundreds of thousands of creators we have in our network and the large and small brands we partner with. I am thrilled to have someone with Laura’s stature and experience in both marketing and media join our board as we move into the next phase of growth at ICX Media.”\n“With an impressive breadth of experience in content management, digital marketing and small and large business ventures, I’m certain Scott will help take ICX Media to the next level,” continued Avon. “The need for a true analytics-driven technology partner in this rapidly-changing environment provides us the perfect opportunity to bolster our go-to-market efforts. Scott is an ideal addition to our executive team as we manage our next stage of growth and the needs of our vast, global audience of creative minds.”\nAs a pioneer in digital integrated marketing and media, Lang brings extensive experience in digital disruption and transformation to one of the digital media industry’s fastest-growing technology companies. Lang officially joined the board in the fall of 2017.\n“I have been seeking an opportunity to further engage with a company in the video content creation ecosystem for quite some time,” said Laura Lang. “Today’s media-savvy consumers are turning to social media and streaming services more frequently, driving unprecedented demand for engaging and transformative video content from brands. ICX Media’s breakthrough technology and diverse creator community expertly bridges that gap, making data-inspired storytelling now possible. I am looking forward to working with the board and company leadership to take the organization’s successes to new heights.”\nBowen is an experienced technology executive and entrepreneur with a track record of building successful businesses and whose domain expertise sits at the intersection of digital media and marketing, data analytics and the cloud. He joins ICX Media from Vistaprint, a $1.3B e-commerce brand of Cimpress (NASDAQ: CMPR), where he served as Vice President and General Manager of its SaaS-oriented Digital Services division. Previously, Scott was a senior executive with OpenText Corporation (NASDAQ: OTEX), a $2.3B global leader in Enterprise Information Management (EIM), where he held roles including Senior Vice President, Cloud Services and President, Digital Media Group. Prior to that, Scott was Co-Founder, President and COO of Artesia Technologies, a venture-backed pioneer and early leader in the Digital Asset Management (DAM) market that was acquired by OpenText in 2004. Bowen will report to Chairman and CEO Michael Avon while taking on the responsibility of leading ICX Media’s go-to-market strategy and overseeing sales, business development, marketing and operations for the business.\n“I am looking forward to joining Mike and the entire team to help position ICX Media as a leader in the digital media marketplace,” said Bowen. “Over the next year, we will further develop our digital business and brand strategy to ensure that our vast creator network, corporate brands and media companies have the right tools to make confident decisions about their marketing and creative strategies. I am eager to bring my unique perspective on growing and scaling technology businesses to such a disruptive company that is serving the rapidly-changing media ecosystem.”\nAbout ICX Media, Inc.\nICX Media is revolutionizing the digital media market by enabling data-inspired storytelling; transforming the way video is created, distributed, and monetized. ICX Media’s proprietary smart platform harnesses breakthrough artificial intelligence and adaptive learning technologies to help brands, media companies and content creators create and share more impactful, engaging videos with data-backed confidence. The ICX Media community connects more than 850,000 independent creators with brands, media and entertainment companies to make turnkey talent sourcing, scalable video production, accelerated audience creation and cost-effective distribution now possible. ICX Media believes everyone has a meaningful story to share. Now everyone can.\nPERMALINK\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180108006797/en/\nfor ICX Media, Inc.\nKathy Grannis Allen, 202-821-7513\nKathy@salientmg.com\nSource: ICX Media, Inc.", "external_links": ["http://www.businesswire.com/news/home/20180108006797/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ficxmedia.com%2Fimg%2F2017-01-08-release.pdf&esheet=51739864&newsitemid=20180108006797&lan=en-US&anchor=PERMALINK&index=3&md5=c9df58ea61194d92ffd4f1ef503e980b", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ficxmedia.com%2Fboard%2Fbowen%2F&esheet=51739864&newsitemid=20180108006797&lan=en-US&anchor=D.+Scott+Bowen&index=1&md5=33f7554d2b7abbc65865efa96fba0fe0", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ficxmedia.com%2Fboard%2Flang%2F&esheet=51739864&newsitemid=20180108006797&lan=en-US&anchor=Laura+Lang&index=2&md5=16510b817d096231e059d0014c7cc2ee"], "published": "2018-01-09T08:01:00.000+02:00", "crawled": "2018-01-09T10:39:31.011+02:00", "highlightTitle": ""}