{"organizations": [], "uuid": "511f0ccbf32dd6d2eda79efaf1a03a2cd6f46d94", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.goldreview.com/?feed=linkfeed", "section_title": "Gold Review » Gold Review", "url": "https://uk.reuters.com/article/global-precious/precious-gold-firm-on-weaker-dollar-trade-war-concerns-idUKL4N1PJ1PJ", "country": "US", "domain_rank": 408, "title": "Gold inches up on weaker dollar, trade war concerns", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T16:14:00.000+02:00", "replies_count": 0, "uuid": "511f0ccbf32dd6d2eda79efaf1a03a2cd6f46d94"}, "author": "cmullen", "url": "https://uk.reuters.com/article/global-precious/precious-gold-firm-on-weaker-dollar-trade-war-concerns-idUKL4N1PJ1PJ", "ord_in_thread": 0, "title": "Gold inches up on weaker dollar, trade war concerns", "locations": [], "entities": {"persons": [{"name": "stephen innes", "sentiment": "none"}, {"name": "nithin thomasprasad jan", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "technicals", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "oanda", "sentiment": "none"}, {"name": "apac", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 24, 2018 / 5:30 AM / Updated 7 hours ago PRECIOUS-Gold inches up on weaker dollar, trade war concerns Reuters Staff 3 Min Read * U.S. dollar touches fresh 3-year low * Spot gold biased to rise towards $1,357.54/oz -Technicals * Asian stocks up 5 pct-10 pct since start of year (Recasts lede and header, updates prices) By Nithin ThomasPrasad Jan 24 (Reuters) - Gold prices edged up on Wednesday, drifting near a four-month high hit last week, as the U.S. dollar sank to a fresh three-year low, while worries about potential trade wars led to some risk-aversion trade as well. Spot gold was up 0.1 percent at $1,342.30 per ounce at 0715 GMT, while U.S. gold futures for February delivery rose 0.4 percent to $1,342.30 per ounce. \"Gold could move higher as we are still in the early stages of a broader USD sell-off, with all eyes focused on 110 USD-JPY,\" said Stephen Innes, APAC head of trading at OANDA. The dollar touched a four-month low against the yen on simmering concerns that the U.S. currency's yield advantage will start to erode as major central banks head toward unwinding their massive stimulus. Against the yen , the dollar fell below the 110 threshold for the first time in four months. The dollar index fell to its lowest since Dec. 31, 2014, on a fresh burst of speculative selling. A weaker dollar makes bullion more attractive for holders of other currencies. \"Global investors are also concerned about potential trade wars... which is stirring up some risk-aversion trade, so that, in turn, is supporting gold,\" said Richard Xu, a fund manager at China's biggest gold exchange-traded fund, HuaAn Gold. On Tuesday, U.S. President Donald Trump imposed import tariffs on washing machines and solar panels, putting a cloud over global trade at a time when its revival has fuelled hopes for a stronger world economy. \"I think gold prices will continue to trend higher along with other commodities, so $1,400 (an ounce) is our near-term target,\" Xu said. Markets also expect an U.S. interest rate hike in March. Gold is highly sensitive to rising U.S. interest rates, as these increase the opportunity cost of holding non-yielding bullion while boosting the greenback. Meanwhile, recent strong gains in equities weighed on the precious metal. Most Asian stock indexes are up anywhere from 5 to 10 percent since the start of the year with many at all-time highs. Spot gold is biased to break a resistance at $1,341 per ounce and rise towards the Sept. 8, 2017 high of $1,357.54, according to Reuters technical analyst Wang Tao. In other precious metals, silver was nearly flat at $17.05 per ounce after touching a 3-1/2-week low of $16.73 in the previous session. Platinum fell 0.2 percent to $1,004.25 per ounce, while palladium 0.1 percent to $1,093.15 per ounce. (Reporting by Nithin Prasad in Bengaluru; editing by Richard Pullin and Subhranshu Sahu)", "external_links": [], "published": "2018-01-24T16:14:00.000+02:00", "crawled": "2018-01-24T16:33:23.001+02:00", "highlightTitle": ""}