{"organizations": [], "uuid": "4153bf8c5bfbfb80a598afdfdc0cac98650a15d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 34}, "facebook": {"likes": 145, "shares": 145, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226207541&w=1200&r=LYNXMPEE0S0D4", "site_section": "http://feeds.reuters.com/reuters/businessNews\r", "section_title": "Reuters: Business News", "url": "https://www.reuters.com/article/us-canada-oil-shale-insight/why-canada-is-the-next-frontier-for-shale-oil-idUSKBN1FI0G7", "country": "US", "domain_rank": 408, "title": "Why Canada is the next frontier for shale oil", "performance_score": 1, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T08:10:00.000+02:00", "replies_count": 0, "uuid": "4153bf8c5bfbfb80a598afdfdc0cac98650a15d6"}, "author": "", "url": "https://www.reuters.com/article/us-canada-oil-shale-insight/why-canada-is-the-next-frontier-for-shale-oil-idUSKBN1FI0G7", "ord_in_thread": 0, "title": "Why Canada is the next frontier for shale oil", "locations": [], "entities": {"persons": [{"name": "nia william", "sentiment": "negative"}, {"name": "montney", "sentiment": "none"}, {"name": "duvernay", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}, {"name": "argentina", "sentiment": "none"}, {"name": "calgary", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "alberta", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CALGARY, Alberta (Reuters) - The revolution in U.S. shale oil has battered Canada’s energy industry in recent years, ending two decades of rapid expansion and job creation in the nation’s vast oil sands.\nNow Canada is looking to its own shale fields to repair the economic damage.\nCanadian producers and global oil majors are increasingly exploring the Duvernay and Montney formations, which they say could rival the most prolific U.S. shale fields.\nCanada is the first country outside the United States to see large-scale development of shale resources, which already account for 8 percent of total Canadian oil output. China, Russia and Argentina also have ample shale reserves but have yet to overcome the obstacles to full commercial development.\nCanada, by contrast, offers many of the same advantages that allowed oil firms to launch the shale revolution in the United States: numerous private energy firms with appetite for risk; deep capital markets; infrastructure to transport oil; low population in regions that contain shale reserves; and plentiful water to pump into shale wells.\nTogether, the Duvernay and Montney formations in Canada hold marketable resources estimated at 500 trillion cubic feet of natural gas, 20 billion barrels of natural gas liquids and 4.5 billion barrels of oil, according to the National Energy Board, a Canadian regulator.\n“The Montney is thought to have about half the recoverable resources of the whole oil sands region, so it’s formidable,” Marty Proctor, chief executive of Calgary-based Seven Generations Energy, told Reuters in an interview.\nCanada’s shale output stands at about 335,000 bpd, according to energy consultants Wood Mackenzie, which forecasts output should grow to 420,000 bpd in a decade. The pace of output growth could quicken and the estimated size of the resources could rise as activity picks up and knowledge of the fields improves, according to the Canadian Association of Petroleum Producers.\nSeven Generations and Encana Corp, also based in Calgary, are among leading producers developing the two regions. Global majors including Royal Dutch Shell and ConocoPhillips - who pulled back from the oil sands last year - are also developing Canadian shale assets.\nChevron Corp announced its first ever Canadian shale development in the Duvernay in November. Spokesman Leif Sollid called it one of the most promising shale opportunities in North America. ConocoPhillips sees potential for the Montney to deliver significant production and cash flow to the company, executive vice president of production drilling and projects Al Hirshberg said in November.\nShell will invest more money this year in the Duvernay than any other shale field except the Permian Basin in West Texas, the most productive U.S. shale play, spokesman Cameron Yost said.\n“We may learn something in the Permian that becomes applicable in the Montney, and vice versa,” Yost said.\nThe oil sands boom dates back two decades, when improved technology, rising crude prices and fears of global oil shortages sparked a rush to develop the world’s third-largest reserves. But in the last five years, much of that investment has migrated south as U.S. shale firms pioneered new drilling techniques and flooded global oil markets with cheaper-to-produce crude.\nThe oil sands currently account for two-thirds of Canada’s 4.2 million barrels per day of crude. They will continue to contribute heavily to Canada’s energy output because oil sands projects, once built, produce for decades.\nBut the era of oil sands mega-projects will likely end with Suncor Energy’s 190,000 barrel-per-day Fort Hills mining project, which started producing this month.\nFILE PHOTO: Four rigs drill at the Super Pad in Seven Generations Energy's Kakwa River Project in northwest Alberta, Canada in a photo provided January 19, 2018. Seven Generations Energy Ltd/Handout via REUTERS Canadian energy officials are now counting on shale, also known as “tight” oil, to lure new investment.\n“Increasingly we are going to see light tight oil and liquids-rich natural gas forming a key part of Alberta’s energy future,” said Margaret McCuaig-Boyd, energy minister for the province where the oil sands and much of the nation’s shale reserves are located.\nA FUTURE IN FRACKING Oil sands development drove Alberta’s economic growth at a rate of 5.5 percent annually between 2010 and 2014, about twice the national rate. But the oil price crash in 2014 sent the region into a recession and has since prompted producers to scrap at least $32 billion in planned projects.\nOil sands capital spending fell for a third straight year in 2017 while other oil and gas investment rose 40 percent from 2016 to about C$31 billion, according to the Canadian Association of Petroleum Producers. Spending outside the oil sands is expected to grow again this year to C$33 billion, nearly three times the amount predicted for oil sands investment.\nSlideshow (3 Images) Hydraulic fracturing of shale oil and gas can yield quicker returns on smaller investments than extracting tar-like bitumen from the oil sands. Shale production is also less carbon-intensive, addressing a major concern among international investors reluctant to finance what environmental groups deride as the “tar sands”.\n“The last decade has been dominated by conversations about the oil sands, and people have maybe missed the opportunities” in shale fields, Encana Chief Executive Doug Suttles told a conference in British Columbia in November. “All these things have a much lower carbon footprint than the average barrel refined today.”\n‘ABSOLUTELY HUGE’ POTENTIAL\nThe Duvernay in central Alberta is a shale play, while the Montney, straddling northern Alberta and British Columbia, is technically a formation of siltstone, a more porous rock. Drilling and extraction techniques are the same, however, and many in the industry use the term shale for both.\nDrillers face challenges in both fields because of their distance from key markets, but the high potential of their reserves is unquestioned.\nThe Duvernay is comparable to the Eagle Ford shale field in South Texas. The Montney is unique, with its enormous gas resources and extremely thick rock formation containing several different levels at which oil and gas can be drilled, said Mike Johnson, technical leader of hydrocarbon resources for the National Energy Board.\nWeak prices in an oversupplied natural gas market have hampered development, along with added costs of shipping from the far-flung fields and limited capacity on pipelines. That makes it harder to compete with producers in shale gas plays such as the Marcellus in the northeastern United States.\nMeanwhile, proposed Canadian liquefied natural gas export terminals on the west coast, which were expected to provide a huge source of demand, have been canceled or stalled due to weak prices.\nSuch obstacles, however, have not stopped producers from staking claims in the region. Last year, Alberta oil and gas land sale prices reached levels not seen since 2014 because of a rush to buy land in the Duvernay East Shale Basin.\n“The potential is absolutely huge,” said Mark Salkeld, president of the Petroleum Services Association of Canada. “The only thing holding us back is access to market and the cost.”\nAdditional reporting by Ernest Scheyder in Houston; Editing by Simon Webb and Brian Thevenot\n ", "external_links": [], "published": "2018-01-29T08:10:00.000+02:00", "crawled": "2018-01-29T09:04:31.003+02:00", "highlightTitle": ""}