{"organizations": [], "uuid": "c4d0c13eabe5e20304e40661415dbade6b34c911", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/29/104973402-Rebecca_Wei.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/28/switching-careers-rebecca-wei-quit-her-job-broke-the-glass-ceiling.html", "country": "US", "domain_rank": 767, "title": "Switching careers: Rebecca Wei quit her job, broke the glass ceiling", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-30T09:56:00.000+02:00", "replies_count": 0, "uuid": "c4d0c13eabe5e20304e40661415dbade6b34c911"}, "author": "Karen Gilchrist", "url": "https://www.cnbc.com/2018/01/28/switching-careers-rebecca-wei-quit-her-job-broke-the-glass-ceiling.html", "ord_in_thread": 0, "title": "Switching careers: Rebecca Wei quit her job, broke the glass ceiling", "locations": [], "entities": {"persons": [{"name": "christie", "sentiment": "negative"}, {"name": "rebecca wei", "sentiment": "negative"}, {"name": "wei", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "ubs warburg dillon read", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Rebecca Wei was 27 when she decided to quit her job in Shanghai and change careers.\nIt was a bold move. It was the late 1990s, the Asian financial crisis was in full swing, and China was feeling the pinch: Quitting her job meant leaving secure employment and taking a gamble on the economic recovery.\nTwenty years on, she's a top executive at one of the world's most recognized companies.\n\"I was the last class in China who was just given a job,\" Wei told CNBC Make It . Just years earlier, the country's jobs market had been buoyant, and upon graduation Wei had secured a respectable job at investment bank UBS Warburg Dillon Read.\nBut, a few years in, she realized it wasn't enough and had to get out.\n\"I found it didn't fit and I just had to change,\" explained Wei.\n\"That was unheard of at that time and I suppose I was quite courageous: China was very closed back then,\" explained Wei, referring to the state's tight controls on private enterprise.\nThough Wei described the move as \"very painful,\" resulting in criticism from her family, her only regret is that she didn't take the plunge sooner.\n\"If I know I'm successful at something, I like to move on.\" -Rebecca Wei, president at Christie's Asia \"I stayed three years too long in that first job. I stayed for five years when I should have left after two,\" Wei said.\n\"If I know I'm successful at something, I like to move on. I don't want to stay in my comfort zone, I want to challenge myself. As a human being you only really have a few years for your career, so it's important to keep moving.\"\nIt's a philosophy that has governed Wei's entire career. Now president for Asia at auction house Christie's, Wei left her UBS job to study for an MBA. From there, she spent a decade at McKinsey & Company, where she became the first female partner to be elected to their Greater China office.\n\"You have to ask yourself: 'Do I still feel passionate about what I'm doing?'\" -Rebecca Wei, president at Christie's Asia That move \"started the ball rolling\" for other women leaders at the company, Wei said, but it also meant she had to set herself a new challenge.\n\"At the age of 40 I just said I need a change. You have to ask yourself: 'Do I still feel passionate about what I'm doing?' If I see my passion diminishing I will move.\"\nWei decided to shift industries, joining the auction world.\nShe admitted that she is still learning, but her colleagues and clients recognize her passion for a challenge and her willingness to learn. As a manager, that is also something she looks for in employees.\n\"Don't be afraid to try something new,\" Wei said. But, she warned against flippancy.\n\"Don't be a grasshopper: Give a job at least two years. When I look at CVs, I check to see how long a person has stayed in each role. If you appear to be frequently changing your mind, something is wrong.\"", "external_links": [], "published": "2018-01-30T09:56:00.000+02:00", "crawled": "2018-01-30T09:56:04.000+02:00", "highlightTitle": ""}