{"organizations": [], "uuid": "e035365bb0196be53fcef50e2ba868213c973476", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226178379&w=1200&r=LYNXMPEE0S071", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-australia-defence/australia-to-spend-3-1-billion-to-increase-stake-in-global-arms-exports-idUKKBN1FI09U", "country": "US", "domain_rank": 408, "title": "Australia to spend $3.1 billion to increase stake in global arms exports", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T05:31:00.000+02:00", "replies_count": 0, "uuid": "e035365bb0196be53fcef50e2ba868213c973476"}, "author": "", "url": "https://uk.reuters.com/article/uk-australia-defence/australia-to-spend-3-1-billion-to-increase-stake-in-global-arms-exports-idUKKBN1FI09U", "ord_in_thread": 0, "title": "Australia to spend $3.1 billion to increase stake in global arms exports", "locations": [], "entities": {"persons": [{"name": "turnbull", "sentiment": "none"}, {"name": "christopher pyne", "sentiment": "none"}, {"name": "colin packham", "sentiment": "none"}, {"name": "malcolm turnbull", "sentiment": "none"}], "locations": [{"name": "australia", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 3:33 AM / Updated 2 hours ago Australia to spend $3.1 billion to increase stake in global arms exports Colin Packham 3 Min Read \nSYDNEY (Reuters) - Prime Minister Malcolm Turnbull said on Monday Australian military equipment manufacturers will be offered government-backed loans as part of a A$3.8 billion ($3.1 billion) package to become one of the world’s top 10 defence exporters. \nAustralia said in 2016 it would boost defence spending by A$30 billion by 2021, purchasing frigates, armoured personnel carriers, strike fighter jets, drones and a fleet of new submarines - many of which would be built at home. \nThe defence industry has struggled to obtain finance from traditional lenders that have been unwilling to fund the arms industry, so Australia has created a A$3.8 billion loan scheme for companies seeking finance to export military equipment. \n“Australia is around the 20th largest exporter. Given the size of our defence budget we should be higher up the scale than that,” Turnbull told reporters in Sydney. \n“The goal is to get into the top 10,” he said. \nChristopher Pyne, the minister for the defence industry, said Australia would target sales to the United States, Canada, Britain and New Zealand. \nAustralia’s annual defence budget was worth A$34.6 billion this year. EA-18G Growlers from Number 6 Squadron arrive at Nellis Air Force Base, Nevada, for Exercise Red Flag 18-1 at Nellis Air Force Base, Nevada, U.S., January 24, 2018. Picture taken January 24, 2018. Australian Defence Force/Handout via REUTERS \nThe scheme is also meant to arrest a slide in Australia’s manufacturing sector and provide some support for its economy, which has been hampered by record-low wage growth. \nAustralia saw a record number of jobs created in 2017 but its manufacturing sector has shrunk significantly following the end of domestic car manufacturing. \nEmployment in manufacturing peaked in mid-1989 at roughly 1.17 million, or 15 percent of the entire workforce. That shrank to 877,000, or 7 percent, late last year. EA-18G Growlers from Number 6 Squadron arrive at Nellis Air Force Base, Nevada, for Exercise Red Flag 18-1 at Nellis Air Force Base, Nevada, U.S., January 24, 2018. Picture taken January 24, 2018. Australian Defence Force/Handout via REUTERS \nAustralia has seen a wave of new jobs but companies are not keen on paying employees more, leaving wage growth near record lows in an unwelcome drag on consumer spending and inflation. \nAustralia’s expansion plans come amid increased global demand for military hardware, led by China and Middle East nations, prompting criticism of Canberra from aid agencies who argue Australia could make human rights violations worse if weapons were sold to the wrong buyers. \nAnalysts said Australia would need to significantly expand sales beyond its traditional partners to have any chance of fulfilling its ambition. \n“There are possibilities, but I doubt U.S. interest especially will go beyond niche capabilities,” said Euan Graham, director of the international security program at Australian think tank the Lowy Institute. \n($1 = 1.2372 Australian dollars)", "external_links": [], "published": "2018-01-29T05:31:00.000+02:00", "crawled": "2018-01-29T07:01:35.027+02:00", "highlightTitle": ""}