{"organizations": [], "uuid": "1c146bc079260a7e99070cbc71b811ddf8d2e9bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-all-metro-health-care-rebrands-as-simplura-health-group.html", "country": "US", "domain_rank": 767, "title": "All Metro Health Care Rebrands as Simplura Health Group", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-01-23T17:00:00.000+02:00", "replies_count": 0, "uuid": "1c146bc079260a7e99070cbc71b811ddf8d2e9bd"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/pr-newswire-all-metro-health-care-rebrands-as-simplura-health-group.html", "ord_in_thread": 0, "title": "All Metro Health Care Rebrands as Simplura Health Group", "locations": [], "entities": {"persons": [{"name": "simplura", "sentiment": "none"}], "locations": [{"name": "n.y.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "massachusetts", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "pennsylvania", "sentiment": "none"}], "organizations": [{"name": "simplura health group", "sentiment": "neutral"}, {"name": "all metro health care", "sentiment": "neutral"}, {"name": "metro health care rebrands", "sentiment": "neutral"}, {"name": "one equity partners", "sentiment": "none"}, {"name": "all metro healthcare", "sentiment": "none"}, {"name": "independence healthcare corp.", "sentiment": "none"}, {"name": "freedom home care", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "VALLEY STREAM, N.Y., Jan. 23, 2018 /PRNewswire/ -- The parent company of All Metro Health Care, a leading provider of home care services to patients in New York, Pennsylvania, Massachusetts, New Jersey and Florida, today announced that it has changed its name to Simplura Health Group (\"Simplura\"), and launched its new website at www.simplura.com . The rebranding reflects the high-quality collaborative care Simplura's team members and partner organizations are known for providing to their clients. Simplura is a portfolio company of One Equity Partners, which acquired a controlling interest in the business in February 2016.\nSimplura, which is derived from Latin for \"Better Together,\" recognizes the deep engagement and shared identity that is common across the family of home care companies that make up Simplura Health Group. These include All Metro Healthcare, founded in 1955 and currently operating in New York, New Jersey and Florida, CareGivers America in Pennsylvania, as well as Multicultural Home Care, Independence Healthcare Corp., and Freedom Home Care in Massachusetts.\n\"While our various brands are valued in their individual markets, coming together as one team with a shared purpose and set of values under the Simplura brand is extremely important as we continue to grow and add great providers across the country,\" said David Middleton, President and CEO of Simplura Health Group. \"Our new name is a constant reminder of our collective dedication to sharing and applying best practices to ensure continual delivery of high quality health and support services that meet the unique needs of our clients.\"\nSimplura's 11,000 team members provide customized care services to aging seniors and other clients who reside at home, including meal preparation assistance, light housekeeping, nursing and transportation.\n\"We're proud to belong to Simplura and are already seeing the benefits of being part of an organization focused on improving quality of life and supporting our partners in the healthcare community, such as the managed care plans, Medicaid and other organizations that work closely with us and our home care clients,\" said Mia Haney, President of CareGivers America.\n\"Dave's vision to become one of the largest and most trusted home care companies in North America was a significant factor in our decision to invest in the business,\" said Greg Belinfanti, Senior Managing Director of One Equity Partners and Chairman of Simplura. \"Establishing the Simplura brand is a testament to the tremendous achievements that the team has made in a very short time frame, and the clear intention to continue strategic growth while maintaining a focus on quality care.\"\nAbout Simplura Health Care\nSimplura Health Group's origins go back to 1955 when the founding organization – All Metro Health Care – began providing services in Long Island, NY. Since then All Metro expanded across the state of New York and acquired operations in New Jersey and Florida to become one of the largest and most respected home care companies in the country. In 2015 All Metro purchased CareGivers America in Pennsylvania; in 2016 All Metro purchased Multicultural Home Care, along with its Freedom Home Care private pay line of business, in Massachusetts and in 2017 All Metro purchased Independence Healthcare, also in Massachusetts. All of these companies are leading providers of home care services in their respective markets, supporting their clients with basic services such as providing a home maker to assist with meal preparation and light housekeeping for a few hours a day or a home health aide to provide assistance with activities of daily living to complex home nursing services provided around the clock by Registered Nurses.\nAbout One Equity Partners\nOne Equity Partners is a middle-market private equity firm focused on the industrial, healthcare, and technology sectors in North America and Europe. The firm builds market-leading companies by identifying and executing transformative business combinations. One Equity is a trusted partner with a differentiated investment process, a broad and senior team, and an established track record generating long-term value for its partners. Since 2001, the firm has completed more than 150 transactions worldwide. One Equity, founded in 2001, spun out of JP Morgan in 2015. The firm has offices in New York, Chicago, and Frankfurt. For more information, please visit www.oneequity.com .\nView original content: http://www.prnewswire.com/news-releases/all-metro-health-care-rebrands-as-simplura-health-group-300586599.html\nSOURCE Simplura Health Group", "external_links": ["http://www.oneequity.com/", "http://www.simplura.com/", "http://www.prnewswire.com/news-releases/all-metro-health-care-rebrands-as-simplura-health-group-300586599.html"], "published": "2018-01-23T17:00:00.000+02:00", "crawled": "2018-01-23T17:48:00.077+02:00", "highlightTitle": ""}