{"organizations": [], "uuid": "a60a0506b039381cf68c990428b58157db26386c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 3, "shares": 3, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2018/01/tsdpaof_ec084-1.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/19/freeform-party-of-five-reboot-immigration-deportation/", "country": "US", "domain_rank": 1196, "title": "Freeform 'Party of Five' Reboot Has a Deportation Storyline | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.197, "site_type": "news", "published": "2018-01-19T02:00:00.000+02:00", "replies_count": 0, "uuid": "a60a0506b039381cf68c990428b58157db26386c"}, "author": "Tom Huddleston Jr.", "url": "http://fortune.com/2018/01/19/freeform-party-of-five-reboot-immigration-deportation/", "ord_in_thread": 0, "title": "Freeform 'Party of Five' Reboot Has a Deportation Storyline | Fortune", "locations": [], "entities": {"persons": [{"name": "tom huddleston jr", "sentiment": "negative"}, {"name": "matthew fox", "sentiment": "none"}, {"name": "amy lippman", "sentiment": "none"}, {"name": "chris keyser", "sentiment": "none"}, {"name": "neve campbell", "sentiment": "none"}, {"name": "scott wolf", "sentiment": "none"}, {"name": "fox", "sentiment": "none"}, {"name": "lacey chabert", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "mexico", "sentiment": "none"}], "organizations": [{"name": "freeform 'party of five", "sentiment": "neutral"}, {"name": "walt disney-owned", "sentiment": "none"}, {"name": "party of five", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Tom Huddleston Jr. January 19, 2018 \nTelevision networks, seemingly drunk on nostalgia, have been rebooting old TV shows left and right lately. But news of the latest decades-old TV series to be resuscitated comes with an extremely topical, and divisive, twist: an immigration reform storyline. \nFreeform, the Walt Disney-owned cable network, said this week that it is reviving the popular mid-90s Fox family dramedy Party of Five that starred Neve Campbell, Lacey Chabert, Matthew Fox, and Scott Wolf as four of five siblings orphaned by the death of their parents in a car accident. The reboot, which brings back original show creators Chris Keyser and Amy Lippman, will feature a new cast of hispanic siblings with the major change being that their characters will have recently been left to take care of themselves “after their parents are suddenly deported back to Mexico,” Freeform said in a press release. \nImmigration reform has obviously become a major source of debate in the U.S., with the current administration’s crackdown resulting in an uptick in arrests of illegal immigrants in 2017 (though the number of deportations actually fell last year). That political climate has meant no short supply of stories in the media of undocumented parents being deported from the U.S. while their American-born children often stay behind. \nGet Data Sheet , Fortune’s technology newsletter. \nThe reboot could be an interesting gamble from Disney and Freeform, which seem to be using the loose premise of the original TV series as a bet on the nostalgia factor with viewers while also incorporating a hot-button issue as a major plot twist to stir up additional interest. That’s not necessarily the path taken by other recent TV reboots, such as Netflix’s Fuller House (a reboot of the 1990s sitcom Full House ) or NBC’s revived version of the sitcom Will & Grace , which feature those shows’ original cast-members in the same roles viewers already know, with the only major alteration being the passing of time. \nWhile Freeform has not announced any casting news for the new version of Party of Five , it does not sound as if viewers should expect to see any of the show’s original cast popping up in their previous roles. The original series aired on Fox for six seasons between 1994 and 2000, and it served as a launching pad for the careers of stars like Campbell ( Scream ), Fox ( Lost ), and Jennifer Love Hewitt ( I Know What You Did Last Summer ). SPONSORED FINANCIAL CONTENT ", "external_links": [], "published": "2018-01-19T02:00:00.000+02:00", "crawled": "2018-01-20T17:54:49.017+02:00", "highlightTitle": ""}