{"organizations": [], "uuid": "2c2bfc4bc3c37ee73cd02ab120b9202e63d34a36", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/britain-stocks-factors/update-1-uk-stocks-factors-to-watch-on-jan-9-idUSL4N1P42RE", "country": "US", "domain_rank": 408, "title": "UPDATE 1-UK Stocks-Factors to watch on Jan 9", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T09:48:00.000+02:00", "replies_count": 0, "uuid": "2c2bfc4bc3c37ee73cd02ab120b9202e63d34a36"}, "author": "", "url": "https://www.reuters.com/article/britain-stocks-factors/update-1-uk-stocks-factors-to-watch-on-jan-9-idUSL4N1P42RE", "ord_in_thread": 0, "title": "UPDATE 1-UK Stocks-Factors to watch on Jan 9", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds futures, company news items)\nJan 9 (Reuters) - Britain’s FTSE 100 index is seen opening up 11 points, according to financial bookmakers, with futures up 0.22 percent on Tuesday ahead of the cash market open.\n* PERSIMMON: Britain’s second-biggest housebuilder Persimmon said 2017 profits will be slightly ahead of expectations as its revenue rose 9 percent to 3.42 billion pounds ($4.64 billion) after it built more homes.\n* HASTINGS: British insurer Hastings Group Holdings Plc said its Chief Executive Gary Hoffman would take over as non-executive chairman in May and promoted Toby van der Meer, managing director of its UK trading subsidiary, as its next CEO.\n* BATS: British American Tobacco said on Tuesday that new U.S tax rules would boost its earnings per share by 6 percent in 2018, all other things being equal, supporting its commitment to high-single digit earnings growth.\n* MORRISONS: Morrisons, Britain’s No. 4 supermarket group, beat forecasts for underlying sales in the key Christmas period, with the rate of growth picking-up from the previous quarter.\n* STOCK SPIRITS: Vodka maker Stock Spirits Group Plc said trading in 2017 was slightly ahead of its expectations, led by a recovery in its key market Poland.\n* MAJESTIC WINE: British wine retailer Majestic Wine Plc said underlying sales in the Christmas season grew 4.1 percent and added it was on track to meet full-year expectations.\n* SHIRE: Shire ditched its revenue target of $20 billion by 2020 on Monday due to increased generic competition and new drugs from rivals, saying it would split its rare disease and hyperactivity medicines businesses to boost performance.\n* PSA JOBS: Peugeot-maker PSA will cut a further 250 jobs at its Vauxhall car plant in the north of England, reducing the workforce by a third as part of efforts to make the plant more efficient by reducing its output to one shift.\n* SHELL: Seventeen men have been arrested and millions of dollars in cash seized as part of an investigation into a suspected oil theft at Shell’s biggest refinery, Singapore police said on Tuesday.\n* UK RETAIL: Inflation-squeezed British shoppers cut back on almost everything other than food in the last three months of 2017, leading to the biggest fall in non-grocery spending since 2009, industry figures showed on Tuesday.\n* UK JOBS: British companies hired permanent staff last month at the fastest rate since August, pushing up starting salaries, recruiters said on Tuesday.\n* OIL: U.S. oil prices hit their highest since 2015 again on Tuesday as speculators bet on further price rises amid OPEC-led production cuts and a dip in American drilling activity, though some warned the rally could run out of steam.\n* The UK blue chip index closed 0.4 percent lower at 7,696.51 on Monday, as small-cap Mothercare sank by a third after a profit warning, while software firm Micro Focus dropped nearly 17 percent after cutting guidance.\n* For more on the factors affecting European stocks, please click on: cpurl://apps.cp./cms/?pageId=livemarkets\nTODAY‘S UK PAPERS\n> Financial Times\n> Other business headlines Multimedia versions of Reuters Top News are now available for: * 3000 Xtra : visit topnews.session.rservices.com * For Top News : topnews.reuters.com (Reporting by Radhika Rukmangadhan in Bengaluru)\n ", "external_links": [], "published": "2018-01-09T09:48:00.000+02:00", "crawled": "2018-01-09T10:04:47.025+02:00", "highlightTitle": ""}