{"organizations": [], "uuid": "07e9fa15bb4491ac7e6fef21b077264c1bb70da6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-bressler-amery-ross-promotes-five-attorneys-to-principal-and-one-to-counsel.html", "country": "US", "domain_rank": 767, "title": "Bressler, Amery & Ross Promotes Five Attorneys to Principal and One to Counsel", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.979, "site_type": "news", "published": "2018-01-04T19:08:00.000+02:00", "replies_count": 0, "uuid": "07e9fa15bb4491ac7e6fef21b077264c1bb70da6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/04/pr-newswire-bressler-amery-ross-promotes-five-attorneys-to-principal-and-one-to-counsel.html", "ord_in_thread": 0, "title": "Bressler, Amery & Ross Promotes Five Attorneys to Principal and One to Counsel", "locations": [], "entities": {"persons": [{"name": "bressler", "sentiment": "negative"}, {"name": "preston martin", "sentiment": "none"}, {"name": "everest", "sentiment": "none"}, {"name": "matthew i. penfield", "sentiment": "none"}, {"name": "joel m. everest", "sentiment": "none"}, {"name": "logan m. fisher", "sentiment": "none"}, {"name": "emily j. bordens", "sentiment": "none"}, {"name": "david i. hantman", "sentiment": "none"}], "locations": [{"name": "n.j.", "sentiment": "none"}, {"name": "florham park", "sentiment": "none"}, {"name": "p.c.", "sentiment": "none"}, {"name": "alabama", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}], "organizations": [{"name": "amery & ross promotes five attorneys", "sentiment": "negative"}, {"name": "bressler, amery & ross", "sentiment": "neutral"}, {"name": "university of alabama", "sentiment": "none"}, {"name": "university of alabama school of law", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "FLORHAM PARK, N.J., Jan. 4, 2018 /PRNewswire/ -- The law firm of Bressler, Amery & Ross, P.C. today announced the promotions of Joel M. Everest, Logan M. Fisher, David I. Hantman, Preston Martin and Matthew I. Penfield to principal and Emily J. Bordens to counsel.\nThe promotions are effective January 1, 2018.\nJoel M. Everest joined the firm in February 2014. His practice focuses on securities litigation, with a special focus in the defense of brokerage firms and financial institutions against claims asserted by customers in state and federal court and in arbitration proceedings throughout the country. Mr. Everest earned his J.D. from the University of Alabama School of Law in 2009 and his B.A. from the University of Alabama in 2006. He is admitted to practice in Alabama and Florida and is based out of Bressler's Alabama office.\nLogan M. Fisher joined the firm in August 2009. His practice is primarily devoted to representing broker-dealers and financial advisors in securities litigation. He also represents individual entrepreneurs and business organizations in connection with the formation of corporate entities and other corporate matters. Mr. Fisher earned his J.D. from Duquesne University School of Law in 2009 and his B.B.A. from Temple University in 2006. He is admitted to practice in New Jersey and New York and is based out of Bressler's New Jersey office.\nDavid I. Hantman joined the firm in September 2007 and was promoted to Counsel in January 2017. His primary area of practice is securities litigation and arbitration. He represents broker-dealers and registered representatives in these forums, as well as in investigations and regulatory enforcement actions and plays a central role in leading the firm's expungement practice. Mr. Hantman has also been instrumental in defending funds against such investor claims as misrepresentation, fraud and unsuitability. Prior to Bressler he served as a risk mitigation consultant and as a consultant in the hedge fund industry, providing operational support and consulting services to hedge funds and fund of funds. Mr. Hantman earned his J.D. from New York Law School in 2007 and his B.S. from Cornell University, School of Industrial and Labor Relations in 2000. He is admitted to practice in New Jersey and New York and is based out of Bressler's New York office.\nPreston Martin joined the firm in February 2014. His practice focuses primarily on the defense of brokerage firms and financial institutions against claims asserted by their customers and former employees in court and arbitration proceedings across the United States. He also has an estate planning practice, which includes the preparation of wills, trusts, and other estate planning documents. Mr. Martin earned his J.D. from the University of Georgia School of Law in 2009 and his B.B.A. from the University of Georgia in 2006. He is admitted to practice in Alabama and Georgia and is based out of Bressler's Alabama office.\nMatthew I. Penfield joined the firm in February 2014. His practice focuses on Labor & Employment, Litigation and Immigration. Mr. Penfield earned his J.D. from Cumberland School of Law in 2009 and his B.A. from Birmingham-Southern College in 1992. He is admitted to practice in Alabama and is based out of Bressler's Alabama office.\nEmily J. Bordens joined the firm in February 2009. Her primary areas of practice include Labor and Employment and Litigation. Ms. Bordens earned her J.D. from New England School of Law in 2006 and her B.A. from Rutgers College, Rutgers University in 2000. She is admitted to practice in New Jersey and New York and is based out of Bressler's New Jersey office.\nAbout Bressler, Amery & Ross, P.C.\nBressler, Amery & Ross, P.C. is a leading full-service law firm that represents Fortune 500 corporations, midsize and small privately held companies, brokerage firms, banks, franchises, insurers and non-profits. The firm also represents emerging companies, high-net-worth individuals and families. The firm's main practices include securities, insurance, employment, and business litigation, including dispute resolution and tax. An NLJ350 firm and NJLJ Top 20 firm, Bressler has more than 175 attorneys in Florham Park, NJ; New York, NY; Birmingham, AL; Ft. Lauderdale, FL and Miami FL; and Washington, DC. For more information, visit www.bressler.com .\nContact:\nAndrew Blum, AJB Communications\n917-783-1680, ajbcomms@gmail.com\nView original content: http://www.prnewswire.com/news-releases/bressler-amery--ross-promotes-five-attorneys-to-principal-and-one-to-counsel-300577692.html\nSOURCE Bressler, Amery & Ross, P.C.", "external_links": ["http://www.bressler.com/attorneys/penfield-matthew", "http://www.bressler.com/attorneys/martin-preston", "http://www.prnewswire.com/news-releases/bressler-amery--ross-promotes-five-attorneys-to-principal-and-one-to-counsel-300577692.html", "http://www.bressler.com/attorneys/bordens-emily-j", "http://www.bressler.com/", "http://www.bressler.com/attorneys/everest-joel", "http://www.bressler.com/attorneys/fisher-logan-s", "http://www.bressler.com/attorneys/hantman-david-i"], "published": "2018-01-04T19:08:00.000+02:00", "crawled": "2018-01-04T20:33:33.023+02:00", "highlightTitle": ""}