{"organizations": [], "uuid": "72260396148ca2ccda52596d285980869e472f6e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-usa-turkey-zarrab/turkish-banker-loses-second-bid-for-mistrial-in-u-s-sanctions-case-idUKKBN1ES00F", "country": "US", "domain_rank": 408, "title": "Turkish banker loses second bid for mistrial in U.S. sanctions case", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-03T02:19:00.000+02:00", "replies_count": 0, "uuid": "72260396148ca2ccda52596d285980869e472f6e"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-turkey-zarrab/turkish-banker-loses-second-bid-for-mistrial-in-u-s-sanctions-case-idUKKBN1ES00F", "ord_in_thread": 0, "title": "Turkish banker loses second bid for mistrial in U.S. sanctions case", "locations": [], "entities": {"persons": [{"name": "brendan pierson", "sentiment": "none"}, {"name": "mehmet hakan atilla", "sentiment": "none"}, {"name": "atilla", "sentiment": "none"}, {"name": "richard berman", "sentiment": "none"}, {"name": "berman", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "halkbank", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": " 20 AM / Updated 38 minutes ago Turkish banker loses second bid for mistrial in U.S. sanctions case Brendan Pierson 3 Min Read \nNEW YORK (Reuters) - A U.S. judge on Tuesday refused to order a mistrial in the case of Mehmet Hakan Atilla, an executive at Turkey’s majority state-owned Halkbank who is charged with helping Iran evade U.S. sanctions. \nU.S. District Judge Richard Berman in Manhattan federal court rejected arguments by Atilla’s lawyers that the trial was tainted when prosecutors asked Atilla, during a Dec. 19 cross-examination, whether he remembered that a report by a Turkish expert had concluded he violated sanctions. \nAtilla’s lawyers objected before Atilla could answer, saying the question involved hearsay and “grossly mischaracterized” the Turkish expert’s conclusion. Berman told the jury to disregard it. \nAtilla’s lawyers moved for a mistrial on Dec. 20. [nL1N1OK16L] \nBerman said on Tuesday that his instruction to the jury was enough to prevent any unfairness to Atilla, adding that a mistrial was an “extreme” outcome that should be avoided whenever possible. Berman had already denied another motion by Atilla for a mistrial earlier in the case. \nA lawyer for Atilla could not immediately be reached for comment. \nJurors are expected to come to court on Wednesday for their fourth day of deliberations in the case, which has strained diplomatic relations between the United States and Turkey. \nAt the centre of the three-week trial was testimony from Turkish-Iranian gold trader Reza Zarrab, who pleaded guilty to charges of violating sanctions and testified for U.S. prosecutors. \nZarrab testified that Atilla helped design fraudulent gold and food transactions that allowed Iran to spend its oil and gas revenues abroad, including through U.S. financial institutions, defying U.S. sanctions. [nL1N1O11KW] \nZarrab also implicated Turkish officials in the scheme, including President Tayyip Erdogan. [nL1N1O013F] \nAttempts to reach Erdogan’s spokesman for comment on the allegations at the trial have been unsuccessful. Erdogan has publicly dismissed the case as a politically motivated attack on his government. \nAtilla has denied all of the charges against him. \nHalkbank has denied taking part in any illegal transactions. \nThe first request for a mistrial came after jurors heard testimony from Huseyin Korkmaz, a former Turkish police officer who said he led an investigation that included Atilla and fled Turkey in fear of retaliation. Atilla’s lawyers said the testimony unfairly associated their client with political violence. [nL1N1OD2JL] \nU.S. prosecutors charged nine people in the criminal case, though only Zarrab, 34, and Atilla, 47, were arrested by U.S. authorities. Reporting By Brendan Pierson in New York; Editing by Toni Reinhold", "external_links": [], "published": "2018-01-03T02:19:00.000+02:00", "crawled": "2018-01-03T03:04:11.004+02:00", "highlightTitle": ""}