{"organizations": [], "uuid": "61850582519846fd19c673027f0407e49c1e5a54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180130.html", "section_title": "Archive News &amp; Video for Tuesday, 30 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/usa-stocks/us-stocks-wall-street-stumbles-as-bond-yields-rise-health-stocks-fall-idUSL2N1PP2MM", "country": "US", "domain_rank": 408, "title": "US STOCKS-Wall Street stumbles as bond yields rise, health stocks fall", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T06:08:00.000+02:00", "replies_count": 0, "uuid": "61850582519846fd19c673027f0407e49c1e5a54"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/usa-stocks/us-stocks-wall-street-stumbles-as-bond-yields-rise-health-stocks-fall-idUSL2N1PP2MM", "ord_in_thread": 0, "title": "US STOCKS-Wall Street stumbles as bond yields rise, health stocks fall", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "jonathan mackay", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "stephen culp", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "berkshire", "sentiment": "none"}, {"name": "schroders", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "jpmorgan", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Dow posts biggest two-day drop since Sept 2016\n* Rising bond yields drag on stocks as Trump speech approaches\n* Health stocks sink as Amazon, JPMorgan, Berkshire team up\n* VIX closes at highest since August 2017\n* Indexes down: Dow 1.4 pct, S&P 1.1 pct, Nasdaq 0.9 pct (Updates to market close)\nBy Stephen Culp\nJan 30 (Reuters) - U.S. stocks fell for a second straight day on Tuesday, with the Dow registering its biggest two-day drop since September 2016, pressured by healthcare stocks and rising bond yields.\nThe Dow also had its biggest daily percentage decline since May 2017 and the day’s 1.37-percent fall was the second-biggest single-day drop since the election of Donald Trump, slated to give his first State of the Union speech later Tuesday.\nU.S. Treasury yields climbed to multi-year highs after the start of the Federal Reserve’s two-day meeting, which could shed light on the central bank’s economic and rate hike outlook.\n“Investors are catching up to the fact that rates have risen,” said Jonathan Mackay, investment strategist at Schroders in New York. “The market’s finally catching up.”\nThe selloff set traders in the options market fretting about a near-term shock to equities and the Cboe Volatility Index , the most widely followed barometer of expected near-term stock market gyrations, closed up 0.95 points at 14.79, its highest close since Aug. 17.\nHealthcare stocks pulled the major indexes lower on news that Amazon.com Inc, Berkshire Hathaway Inc and JPMorgan Chase & Co will jointly form a healthcare company to help control costs for their U.S. employees.\nThe S&P 500 Healthcare index was the day’s biggest loser among the 11 major sectors, dropping by 2.13 percent.\nThe Dow Jones Industrial Average fell 362.59 points, or 1.37 percent, to 26,076.89, the S&P 500 lost 31.1 points, or 1.09 percent, to 2,822.43 and the Nasdaq Composite dropped 64.02 points, or 0.86 percent, to 7,402.48.\n“Investors are getting a bit worried about inflation which has led some people to believe that the Fed might be more aggressive when it comes to raising rates,” said Robert Pavlik, chief investment strategist at SlateStone Wealth.\nMetLife Inc fell 8.6 percent and was the day’s biggest daily percentage decliner in the S&P 500 after news the U.S. Securities and Exchange Commission was investigating the insurer’s failure to pay some workers’ pensions.\nUnitedHealth Group Inc was the biggest drag on the Dow, falling 4.3 percent. Pfizer Inc was down 3.1 percent despite its better-than-expected earnings and upbeat 2018 guidance.\nHarley-Davidson Inc closed down 8.0 percent after announcing it would close a Kansas City plant in the face of declining shipments.\nApple Inc declined for a second day, falling 0.6 percent on news that the U.S. Department of Justice and the Securities and Exchange Commission are investigating the company’s disclosure that it slowed older iPhones with flagging batteries.\nEarnings so far have been stronger than expected. S&P 500 earnings growth is now forecast at 13.2 percent, up from 12 percent a month ago. Among companies that have reported so far, 80 percent are exceeding analysts’ expectations, according to Thomson Reuters data.\nInvestors will likely scrutinize Trump’s first State of the Union address for clues on trade policy and infrastructure spending. Declining issues outnumbered advancing ones on the NYSE by a 4.17-to-1 ratio; on Nasdaq, a 2.98-to-1 ratio favored decliners.\nThe S&P 500 posted 17 new 52-week highs and four new lows; the Nasdaq Composite recorded 41 new highs and 43 new lows.\nVolume so far on U.S. exchanges was 8.1 billion shares, compared with the 7.1 billion average for the full session over the last 20 trading days. (Reporting by Stephen Culp; additional reporting by Saqib Iqbal Ahmed and Tanya Agrawal; Editing by Lisa Shumaker)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-31T06:08:00.000+02:00", "crawled": "2018-01-31T16:20:20.000+02:00", "highlightTitle": ""}