{"organizations": [], "uuid": "c42396c0c0a0bd23533387e3d2425ca1bb7a477b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKTennisNews/", "section_title": "Reuters: Tennis News", "url": "https://uk.reuters.com/article/sports-news-schedule-at-1400-gmt/reuters-sports-schedule-at-0001-gmt-on-tuesday-idUKL4N1OV05U", "country": "US", "domain_rank": 408, "title": "Reuters Sports Schedule at 1400 GMT on Tuesday", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T16:00:00.000+02:00", "replies_count": 0, "uuid": "c42396c0c0a0bd23533387e3d2425ca1bb7a477b"}, "author": "", "url": "https://uk.reuters.com/article/sports-news-schedule-at-1400-gmt/reuters-sports-schedule-at-0001-gmt-on-tuesday-idUKL4N1OV05U", "ord_in_thread": 0, "title": "Reuters Sports Schedule at 1400 GMT on Tuesday", "locations": [], "entities": {"persons": [{"name": "nic", "sentiment": "none"}], "locations": [{"name": "watford", "sentiment": "none"}, {"name": "swansea  london", "sentiment": "none"}, {"name": "manchester city", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "swansea", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}, {"name": "sydney  sydney", "sentiment": "none"}], "organizations": [{"name": "reuters sports schedule", "sentiment": "negative"}, {"name": "tottenham hotspur", "sentiment": "none"}, {"name": "soccer  premier league", "sentiment": "none"}, {"name": "southampton", "sentiment": "none"}, {"name": "watford", "sentiment": "none"}, {"name": "tottenham hotspur  west ham united", "sentiment": "none"}, {"name": "crystal palace  swansea city", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "manchester united", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "west bromwich albion  manchester city", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2, 2018 / 12:09 AM / Updated 31 minutes ago Reuters Sports Schedule at 1400 GMT on Tuesday Reuters Staff \nReuters sports schedule at 1400 GMT on Tuesday: SOCCER \nPremier League (1945 unless stated) \nSouthampton v Crystal Palace \nSwansea City v Tottenham Hotspur \nWest Ham United v West Bromwich Albion \nManchester City v Watford (2000) \nLeaders Manchester City host Watford, Spurs visit Swansea \nLONDON - Runaway Premier League leaders Manchester city welcome mid-table Watford as they look to reclaim a 15-point advantage over second-placed Manchester United, while top-four chasing Tottenham Hotspur visit bottom side Swansea city. (SOCCER-ENGLAND/ (PIX), expect by 2200 GMT/5 PM ET, 500 words) \nWe will have reports on each game and sidebars on merit. CRICKET \nEngland desperate for consolation Ashes win in Sydney \nSYDNEY - With the Ashes returned and the series already beyond them, England will be desperate to back up an encouraging performance in Melbourne and secure a consolation victory over Australia in the fifth and final test in Sydney this week. (CRICKET-ASHES/, moved, by Nick Mulvenney) \nIndia tour of South Africa \nSouth Africa coach Gibson faces media \nCAPE TOWN - South Africa coach Ottis Gibson talks to the media before the start of the three-test series against top ranked India. (CRICKET-TEST-ZAF-IND/GIBSON, expect by 1600 GMT/11 AM ET, by Mark Gleeson, 300 words) \nCAPE TOWN - Preview of and Factbox for the three-test series between South Africa and India, the top two teams in the ICC Test Rankings. (CRICKET-TEST-ZAF-IND/PREVIEW (FACTBOX), moved, by Mark Gleeson) TENNIS \nBrisbane International \nBriton Konta pushed to the brink again in Brisbane \nBritain’s Johanna Konta was pushed to the brink for the second time in as many rounds before advancing to the quarter-finals while world number two Garbine Muguruza of Spain succumbed to leg cramps in her opening clash at the Brisbane International on Tuesday. (TENNIS-BRISBANE/WOMEN (PIX), moved) \nEdmund battles past Shapovalov in Brisbane opener \nKyle Edmund was taken the distance before he outlasted talented Canadian teenager Denis Shapovalov in the opening round of the Brisbane International on Tuesday. (TENNIS-BRISBANE/MEN (PIX, TV), moved) \nHopman Cup \nJapan face U.S., Russia take on Swiss \nPERTH - Japan face the United States in the day session before Russia take on Switzerland in the evening on day four of the Hopman Cup. (TENNIS-HOPMAN/, 300 words) \nATP - Qatar Open \nSecond-seeded Spaniard Pable Barreno Busta takes on Croatian Borna Coric while third-seed Tomas Berdych faces German Jan-Lennard Struff on the second day of the ATP’s World Tour 250 event kicks off in Doha, Qatar. (TENNIS-DOHA/MEN, expect from 1000 GMT/5 AM ET, 200 words) \nWTA International - Auckland Classic \nWozniacki races to victory in Auckland Classic opener \nCaroline Wozniacki capped 2017 with the biggest win of her career when she claimed a maiden WTA Finals triumph in October and the Dane has carried that momentum into the new season with a ruthless display to kick off her Auckland Classic campaign.(TENNIS-AUCKLAND/WOMEN, moved) \nShenzhen Open \nSharapova forced to dig deep by Riske in Shenzhen Open \nSHENZHEN - Maria Sharapova was made to work hard for a victory at the Shenzhen Open, coming from behind to beat unseeded American Alison Riske 4-6 6-3 6-2 in the second round on Tuesday. (TENNIS-SHENZHEN/, moved) WINTER OLYMPICS \nOver the next two weeks we will be moving a series of features and previews ahead of the Feb. 9-25 Winter Olympics in Pyeongchang, South Korea. ALPINE SKIING \nSpeed merchants still kings of the hill \nLONDON - Olympic downhills have a special allure, with the fastest and bravest Alpine skiers going full tilt for gold and a place in history. (OLYMPICS-2018-ALPS/BLUERIBAND (PIX), moved, by Alan Baldwin, 738 words) \nFaster, lighter, springier: the quest for the perfect ski \nALTENMARKT - It is not just American hopes that will be riding on the performance of Mikaela Shiffrin when the world’s number one woman alpine skier takes to the slopes at the Winter Olympics in South Korea next month. (OLYMPICS-2018-ALPS/TECH (PIX), moved, by Leonhard Foeger and Mark Trevelyan, 804 words) \nThe Swiss mountain man who sets the ultimate test \nIt’s the ninth time he’s designed the Olympic downhill ski course, but Bernhard Russi will still feel his nerves tauten when racing gets under way in South Korea next month. (OLYMPICS-2018-ALPS/DESIGN (PIX), moved, by Mark Trevelyan, 861 words) \nSnow chance? Outsiders compete against the odds \nLONDON - Most of the top Alpine skiers have grown up on snow, which is something of a disadvantage for those whose countries see little of the stuff. (OLYMPICS-2018-ALPS/LEVEL (PIX), moved, by Alan Baldwin, 763 words) ICE HOCKEY \nWithout NHL players, Team USA hockey looks to Europe \nNEW YORK - Team USA unveils its Olympic ice hockey roster with no NHL players for the first time in 24 years but it will not see a return to rosters filled with amateur collegians such as the 1980 ‘Miracle on Ice’ team that won gold in Lake Placid. Most of the team will be Americans from smaller leagues in Europe and retired NHLers, with only a handful from college ranks. (OLYMPICS-2018-ICEH/USA, moved, by Dan Burns, 500 words) (Europe desk editor: Christian Radnedge)", "external_links": [], "published": "2018-01-02T16:00:00.000+02:00", "crawled": "2018-01-02T16:34:16.009+02:00", "highlightTitle": ""}