{"organizations": [], "uuid": "2e16a6e807a38024fac2ef2d13b0c260ba615244", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-millennial-esports-completes-purchase-of-controlling-interest-in-eden-games.html", "country": "US", "domain_rank": 767, "title": "Millennial Esports Completes Purchase of Controlling Interest in Eden Games", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.178, "site_type": "news", "published": "2018-01-16T17:04:00.000+02:00", "replies_count": 0, "uuid": "2e16a6e807a38024fac2ef2d13b0c260ba615244"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/globe-newswire-millennial-esports-completes-purchase-of-controlling-interest-in-eden-games.html", "ord_in_thread": 0, "title": "Millennial Esports Completes Purchase of Controlling Interest in Eden Games", "locations": [], "entities": {"persons": [{"name": "eden", "sentiment": "none"}], "locations": [{"name": "toronto", "sentiment": "none"}], "organizations": [{"name": "esports completes purchase of controlling interest", "sentiment": "negative"}, {"name": "esports corp.", "sentiment": "negative"}, {"name": "eden games", "sentiment": "none"}, {"name": "gear.club", "sentiment": "none"}, {"name": "global blockchain corp.", "sentiment": "none"}, {"name": "esports", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TORONTO, Jan. 16, 2018 (GLOBE NEWSWIRE) -- Millennial Esports Corp. (\"Millennial Esports\" or the \"Company\") (TSX-V:GAME) announced on Monday that it has completed the purchase of a controlling interest in French video game publisher, Eden Games. As a result of the Company’s largest investment, all Eden Games properties, including the wildly popular mobile racing game Gear.Club, are now part of Millennial’s intellectual property assets. The Company also announced that it has received a commitment from industry pioneer Global Blockchain Corp. to invest $5 million into Millennial Esports’ blockchain initiative.\nThe purchase of Eden adds another dimension to the integrated Esports ecosystem Millennial Esports is building, while also providing the Company with an immediate ongoing stream of revenue generated by Gear.Club, which has been downloaded more than 6.5 million times. With the investment in Eden Games, Millennial Esports is now amongst the few revenue-generating Esports companies with assets in events, research and analytics, facilities, intellectual property, and mobile and console game publishing capabilities.\n“Eden’s incorporation into Millennial Esports will provide an instant revenue stream,” said Millennial Esports CEO, Alex Igelman. “We are focused on diversifying both our industry and global footprint, and this is another big step for us to cover all key, profitable elements of the gaming and Esports sectors.“\nSimultaneously to finalizing its investment in Eden Games, Millennial Esports received investment and commitments totalling $7 million from Global Blockchain, an investment company that provides investors access to a mixture of assets in the blockchain space, strategically chosen to balance stability and growth. Under the terms of the agreement, Global Blockchain Corp. will immediately invest $2 million into Millennial Esports, while committing a further $5 million to become lead investor in Millennial Esports’ previously announced blockchain initiative.\n“Adding not only investment, but also expertise, from a leading blockchain-focused investment company like Global Blockchain will be key to the success and integration of Millennial Esports’ blockchain initiative and assets,” said Igelman. “With a management team comprised of blockchain pioneers who are widely respected within the investment industry, we are honoured to have Global Blockchain as our partner.”\nGlobal Blockchain’s management team consists of industry leaders - including founders and early adopters of blockchain projects - with insights and experience going as far back as the beginning of the blockchain. Focusing on opportunities to capitalize on the growth of the blockchain ecosystem, between holdings in existing technologies, and holdings in technologies that do not yet exist, Global Blockchain is geared to maximize potential in a sector where new potential is being discovered on a regular basis.\n“The blockchain initiative that Millennial Esports is working on is very exciting and is one of the biggest motivating factors behind our investment,” said Global Blockchain CEO, Rik Willard. “Millennial Esports is perfectly positioned to benefit from blockchain technology with access to the more than 20 million viewers of its O’Gaming platform and the almost 7 million users of Eden Games’ Gear.Club. That is an immediate potential user base of almost 30 million people.”\nEden Games recently released Gear.Club Unlimited, a console version for the Nintendo Switch, which has sold more than 10 million units worldwide. Plans are in the pipeline for PlayStation and Xbox versions, while the mobile version of Gear.Club continues to grow at a significant pace. Eden’s acquisition adds to the market leading expertise of Millennial Esports company IDEAS+CARS in the Esports racing vertical. Millennial Esports can now offer full service integrated solutions to gamers, brands, and partners in the exploding Esports racing market.\n“With a management team second to none in Esports, Millennial Esports will give Eden the firepower we need to deliver some huge live projects and plans in the coming months and years,” said Eden Games CEO, David Nadal. “To work with Darren Cox on Esports racing properties has already been fantastic, while smashing our sales expectations on our Nintendo Switch game shows that our 5-year strategy with Millennial Esports is progressing in the right direction.”\n“Eden’s move into mobile games was well timed and allows Millennial Esports to deliver some very strong commercial properties going forward. I am excited to announce big news for Eden and Millennial Esports in the coming weeks - our pipeline of activity is significant,” agreed Millennial Esports CMO, Darren Cox. “Combined with the investment of Global Blockchain and the incredible potential of our blockchain initiative, 2018 promises to be a very exciting year for Millennial Esports and our shareholders.”\nIdeas + Cars\nFurther to its acquisition of IDEAS+CARS Ltd. on July 27, 2017 and the engagement of Darren Cox as the Chief Market Officer of Millennial Esports and the Managing Director of Millennial Esports Europe, Millennial Esports has agreed to issue 415,116 common shares to Darren Cox at a deemed price of $0.86 per common share. The completion of this transaction is subject to the approval of the TSX Venture Exchange.\nMillennial Esports Corp.:\nMillennial Esports provides turnkey global solutions that cover gaming technology and studios, event management, research and analytics, content production, and broadcasting.\nMillennialEsports.gg is the premier operator of tournaments and building communities by and for gamers. IDEAS+CARS , based out of Motorsport Valley, UK, provides industry leading knowledge and intellectual property in the burgeoning and increasingly lucrative Esports racing genre. Eden Games is part of Millennial’s offering in motor sports and Esports racing. The innovative French video game publisher took the mobile gaming world by storm with the release of Gear.Club, an immensely popular racing game that has been downloaded more than 6.5 million times. Gear.Club Unlimited was recently made available as the first realistic racing game on the Nintendo Switch. O’Gaming TV , based in Paris and a part of Alt Tab Productions, is an Esports video content production and events company, and a major player in live French-language esports streaming. thE Arena at Neonopolis is Las Vegas’s first permanent Esports venue. The 15,000 square foot state-of-the-art facility accommodates more than 1000 people in comfort and provides technical services including facilities, expertise, and manpower for clients such as EA, Amazon, and Microsoft. Stream Hatchet, operating out of Barcelona, Spain, offers complete Esports data analytics solutions. The company focuses on providing actionable intelligence in a format that is easy to understand at a glance.\nMedia Contacts:\nGavin Davidson\nMillennial Esports\n705.446.6630\ngavin.davidson@millennialesports.com\nSharie Johnson\nPR Insiders\n702-604-3091\nsharie@prinsidersfirm.com\nInvestor Contact:\nManish Grigo\nMillennial Esports\n416.569.3292\nmanish.grigo@millennialesports.com\nSource: Millennial Esports Corp.", "external_links": ["https://www.globenewswire.com/Tracker?data=tXCAL50-23mw_cLPgulFsbWAShZzpLHk1FVsbvMFNba9mGnImmc_SSdqis3u3oHuCVN7lDm2_zklpPjtc7ujKxGwWWJD6IYqJdJKaj8Ref0=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/6f822984-7464-4712-9d37-5135ac07161c", "https://www.globenewswire.com/Tracker?data=fj-skFhf1e9Esut-wLhu89h9OpRB3gTosLnRqsq0gl4McLCXtPtggkUskV1FxocnHRGk_s-QilezygoCxKN4bQADI4AvQ2yald46GQG5Vd1zzHClJEiisqynYaSykgz7Aeuk66vFbtEmh_GwrcXkMg==", "https://www.globenewswire.com/Tracker?data=EVVnzjA6ZA6YNb2XGxaycTuEYtESOpzx7DSrz8fFR5likunQOpOtIKlaKQwbBKcz8azKDVApU1D6XGBsneh16FgWnrD-UuM4gXmVAkxO637ekiIppYtQvznIrpsXVccm692-oRSjIIV8KHcyUpSW8w=="], "published": "2018-01-16T17:04:00.000+02:00", "crawled": "2018-01-16T18:21:52.013+02:00", "highlightTitle": ""}