{"organizations": [], "uuid": "b0f260503b3a14c0e0715e6f6f539244a9997bd9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180102&t=2&i=1218789846&w=1200&r=LYNXMPEE010EL", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-bulgaria-politics/bulgarias-president-vetoes-anti-corruption-law-idUSKBN1ER0S9", "country": "US", "domain_rank": 408, "title": "Bulgaria's president vetoes anti-corruption law", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-02T13:22:00.000+02:00", "replies_count": 0, "uuid": "b0f260503b3a14c0e0715e6f6f539244a9997bd9"}, "author": "", "url": "https://www.reuters.com/article/us-bulgaria-politics/bulgarias-president-vetoes-anti-corruption-law-idUSKBN1ER0S9", "ord_in_thread": 0, "title": "Bulgaria's president vetoes anti-corruption law", "locations": [], "entities": {"persons": [{"name": "radev", "sentiment": "none"}, {"name": "rumen radev", "sentiment": "none"}], "locations": [{"name": "bulgaria", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "balkan", "sentiment": "none"}, {"name": "sofia", "sentiment": "none"}, {"name": "black sea", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "transparency international", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SOFIA (Reuters) - President Rumen Radev on Tuesday vetoed anti-graft legislation passed by Bulgaria’s parliament, saying the bill failed to offer the means to effectively investigate corruption networks.\nRadev acted only a day after Bulgaria, the European Union’s poorest country, assumed the six-month, rotating presidency of the bloc for the first time since it joined the EU in 2007.\nBulgaria has made scant progress towards stamping out graft and organized crime, and the European Commission, the EU’s executive, has repeatedly rebuked the Black Sea country for failing to prosecute and sentence allegedly corrupt officials.\nAccording to Transparency International, Bulgaria is the EU’s most corrupt country.\nThe legislation, approved by parliament on Dec. 20, entailed the creation of a special anti-graft unit meant to investigate persons occupying high public office as well as assets and conflicts of interest.\nBut analysts said the unit’s objectivity could be limited by the fact its management would be appointed by parliament under the legislation, and it therefore might not be truly independent and could by used by those in power to persecute opponents.\n“I believe that the adopted law not only does not create an adequate legal basis for tackling corruption but will even make it difficult to fight it,” Radev, who was elected in November 2016, said in a statement.\n“No doubt, the president has strong arguments (to veto the law),” political analyst Petar Cholakov said.\nSome analysts, however, expect parliament to overturn Radev’s veto.\nKornelia Ninova, leader of the main opposition Socialist Party, endorsed Radev’s veto saying it gave “a golden chance” for the government and its majority in parliament to produce effective anti-corruption legislation.\n“If we do not tackle corruption, we cannot solve any of the other problems - poverty, health, education, demography,” Ninova said. Officials from the ruling center-right coalition had no immediate comment on Radev’s move.\nThe new law also focuses on improving control and accountability of law-enforcement agencies, and the government in Sofia is hoping Bulgaria will be able to change opinions and remove its tarnished image during its EU presidency.\nCorruption has deterred foreign investment since communism collapsed in Bulgaria in 1989, and the EU has kept Sofia as well as neighboring Romania - for the same rule-of-law failings - outside its Schengen zone of passport-free travel.\nReporting by Angel Krasimirov; editing by Mark Heinrich\n ", "external_links": [], "published": "2018-01-02T13:22:00.000+02:00", "crawled": "2018-01-02T13:35:09.000+02:00", "highlightTitle": ""}