{"organizations": [], "uuid": "78ebabc3e6bbfd93e8a630f08a5960673eb112b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/business-wire-sagenet-expands-with-acquisition-of-atlanta-based-aware-software.html", "country": "US", "domain_rank": 767, "title": "SageNet Expands with Acquisition of Atlanta-Based Aware Software", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T17:00:00.000+02:00", "replies_count": 0, "uuid": "78ebabc3e6bbfd93e8a630f08a5960673eb112b2"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/business-wire-sagenet-expands-with-acquisition-of-atlanta-based-aware-software.html", "ord_in_thread": 0, "title": "SageNet Expands with Acquisition of Atlanta-Based Aware Software", "locations": [], "entities": {"persons": [{"name": "sagenet", "sentiment": "none"}, {"name": "daryl woodard", "sentiment": "none"}], "locations": [{"name": "okla.", "sentiment": "none"}, {"name": "tulsa", "sentiment": "none"}], "organizations": [{"name": "sagenet", "sentiment": "none"}, {"name": "wandering wifi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TULSA, Okla.--(BUSINESS WIRE)-- SageNet, a leading managed services and cybersecurity solutions provider, today announced it has acquired Atlanta-based Aware Software, formerly known as Wandering WiFi.\nFounded in 2003 as Wandering WiFi, the $23+ million company provides managed wireless infrastructure solutions, security and support across the hospitality, retail, restaurant, grocery, enterprise, healthcare and education industries.\nAccording to SageNet officials, the acquisition represents a unique opportunity for SageNet and Aware to combine their respective strengths to deliver the industry’s most robust portfolio of managed network solutions.\n“This is a great addition for SageNet and allows us to greatly enhance our Wi-Fi services and support to customers,” said Daryl Woodard, SageNet CEO. “Aware Software is recognized as a world-class leader in the engineering and large-scale installation of Wi-Fi networks in places like airports and hotels. With this acquisition, SageNet can now deliver an even broader set of complementary wireless network capabilities to our existing and future customers – everything from design, engineering and installation to best-in-class security and network management.”\nWandering WiFi re-branded as Aware Software in 2016 to reflect the company’s innovative approach to managing the ever-expanding field of Internet of Things (IoT) devices. Aware Software has developed a ground-breaking software platform and is currently hosting pilot programs with several national retailers and health organizations.\n“This acquisition of Aware Software is an outstanding addition to the SageNet portfolio,” said Brad Wise, SageNet President. “There is great synergy between our two companies – in focus, in culture and in vision. As part of our five-year strategy to be IOT-focused and help our customers manage and protect their next-gen devices, we want to be developing the capabilities our customers need now, and in the future. Acquiring companies like Aware that are recognized in the industry for their culture of innovation and their emphasis on customer service allows us to accelerate our progress in fulfilling our mission.”\nThe acquisition of Aware Software is the latest in a series of transitional moves SageNet has made recently. Over the last 24 months, the company has acquired a cybersecurity practice, greatly expanded its U.S.-based Security Operations Centers (SOCs) and Network Operations Centers (NOCs), opened a National Logistics Center, and substantially increased its presence in the growing Digital Signage sector.\nThis aggressive strategy of acquisitions and strategic expansion has positioned SageNet for the future and reinforced the company’s capabilities in the rapidly growing fields of cybersecurity, Wi-Fi and IoT, providing customers the tools and technology needed in a changing business landscape.\n“This brings together two companies that share an ideal set of skills, technology and expertise,” said Alan Dabbiere, chairman of Aware Software and former CEO of AirWatch. “As the number of connected devices continues to proliferate, and as Aware and SageNet expand into reporting and analytics, the combined company is ideally positioned to play an important role in the rapidly growing IOT and Analytics of Things (AoT) markets.”\nTerms for the deal were not disclosed. The companies will continue to operate under their respective brand names until the integration of the two companies is completed.\nFor more information about SageNet, visit www.sagenet.com , or call 866-480-2263.\nAbout SageNet\nSageNet designs, implements, manages and protects fast, secure and reliable networks that empower organizations to achieve their core business objectives.\nSageNet’s integrated network infrastructure, dedicated personnel and innovative products and services suite have set the standard for Managed Network Services and Cybersecurity Solutions. Combining longstanding traditions of industry leadership, innovation and a passionate commitment to customer support, SageNet manages communications at more than 160,000 locations. The company’s customer base represents many of the nation’s leading retail, healthcare, financial and energy companies, as well as public utilities, state lotteries and government agencies.\nToday’s SageNet offers a uniquely broad and deep understanding of local and wide area network technologies and leading-edge cybersecurity solutions, all backed by a nationwide field service organization and three 24/7 U.S.-based Network and Security Operations Centers.\nHeadquartered in Tulsa, SageNet also has regional offices in Washington, D.C., Atlanta, Chicago and Philadelphia.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180123005626/en/\nPropeller Communications\nBarrett Waller, 918-284-0796\nor\nSageNet\nRosemary Blum, 703-245-6415\nSource: SageNet", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sagenet.com&esheet=51747339&newsitemid=20180123005626&lan=en-US&anchor=www.sagenet.com&index=1&md5=8954a5f72e90988fc80fe07bb9f92f73", "http://www.businesswire.com/news/home/20180123005626/en/"], "published": "2018-01-23T17:00:00.000+02:00", "crawled": "2018-01-23T17:49:16.009+02:00", "highlightTitle": ""}