{"organizations": [], "uuid": "ce8934518e7cb5c08f85970d8dd512d9c344ba41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-infracap-mlp-etf-nyse-amza-declares-quarterly-dividend.html", "country": "US", "domain_rank": 767, "title": "InfraCap MLP ETF (NYSE: AMZA) Declares Quarterly Dividend", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T00:30:00.000+02:00", "replies_count": 0, "uuid": "ce8934518e7cb5c08f85970d8dd512d9c344ba41"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/globe-newswire-infracap-mlp-etf-nyse-amza-declares-quarterly-dividend.html", "ord_in_thread": 0, "title": "InfraCap MLP ETF (NYSE: AMZA) Declares Quarterly Dividend", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}], "organizations": [{"name": "nyse", "sentiment": "negative"}, {"name": "amza", "sentiment": "negative"}, {"name": "ica", "sentiment": "none"}, {"name": "llc infrastructure capital advisors", "sentiment": "none"}, {"name": "infrastructure capital advisors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 03, 2018 (GLOBE NEWSWIRE) -- The InfraCap MLP ETF (NYSE:AMZA) has declared a quarterly dividend of $0.52 ($2.08 per share on an annualized basis). The dividend will be paid January 12, 2018 to shareholders of record as of the close of business January 4, 2018.\nAMZA Cash Distribution:\nEx-Date: Thursday, January 4 th Record Date: Friday, January 5 th Payable Date: Friday, January 12 th\nInfrastructure Capital Advisors expects to declare future dividends on a quarterly basis. Dividends are planned, but not guaranteed, for the months of January, April, July, and October of each year. The next dividend is scheduled to occur in April 2018.\nABOUT INFRASTRUCTURE CAPITAL ADVISORS, LLC\nInfrastructure Capital Advisors, LLC (ICA) is an SEC-registered investment advisor that manages exchange traded funds and a series of hedge funds. The firm was formed in 2012 and is based in New York City. ICA seeks total-return opportunities in key infrastructure sectors, including energy, real estate, transportation, industrials and utilities. It often identifies opportunities in entities that are not taxed at the entity level, such as master limited partnerships (\"MLPs\") and real estate investment trusts (\"REITs\"). It also looks for opportunities in credit and related securities, such as preferred stocks. Current income is a primary objective in most, but not all, of the company's investing activities. The focus is generally on asset-intensive companies that generate and distribute substantial streams of free cash flow. For more information, please visit www.infracapfunds.com .\nDISCLOSURE\nFund Risks\nExchange Traded Funds: The value of an ETF may be more volatile than the underlying portfolio of securities the ETF is designed to track. The costs of owning the ETF may exceed the cost of investing directly in the underlying securities.\nMLP Interest Rates: As yield-based investments, MLPs carry interest rate risk and may underperform in rising interest rate environments. Additionally, when investors have heightened fears about the economy, the risk spread between MLPs and competing investment options can widen, which may have an adverse effect on the stock price of MLPs. Rising interest rates may increase the potential cost of MLPs financing projects or cost of operations, and may affect the demand for MLP investments, either of which may result in lower performance by or distributions from the Fund’s MLP investments.\nIndustry/Sector Concentration: A fund that focuses its investments in a particular industry or sector will be more sensitive to conditions that affect that industry or sector than a non-concentrated fund.\nShort Sales: The fund may engage in short sales, and may experience a loss if the price of a borrowed security increases before the date on which the fund replaces the security.\nLeverage: When a fund leverages its portfolio, the value of its shares may be more volatile and all other risks may be compounded.\nDerivatives: Investments in derivatives such as futures, options, forwards, and swaps may increase volatility or cause a loss greater than the principal investment.\nMLPs: Investments in Master Limited Partnerships may be adversely impacted by tax law changes, regulation, or factors affecting underlying assets.\nNo Guarantee: There is no guarantee that the portfolio will meet its objective.\nYou should consider the fund’s investment objectives, risks, and charges and expenses carefully before investing. Contact ETF Distributors LLC at 1-888-383-4184 or visit www.infracapmlp.com to obtain a prospectus which contains this and other information about the fund. The prospectus should be read carefully before investing.\nVirtus ETF Advisers, LLC serves as the investment advisor and Infrastructure Capital Advisors, LLC serves as the sub-advisor to the Fund.\nThe Fund is distributed by ETF Distributors LLC, an affiliate of Virtus ETF Advisers, LLC.\nContacts:\nFund Information:\nETF Distributors LLC\nPhone: 212-593-4383 or 1-888-383-4184 (toll free)\nEmail: info@etfis.com\nMedia:\nHaley Rosa\nGREGORY FCA\nPhone: 610-228-2805\nEmail: haley@gregoryfca.com\nSource: InfraCap MLP ETF", "external_links": ["https://www.globenewswire.com/Tracker?data=v56LrUe_zclrgYEpnFwy-hPwfiw3RStrjk-bXeZsbRY8gBZNrsM7uKqTF31PUpS7BvIMzMTgmzKx_ZU0h6BMZTDR0SEkjZYiuh0AQX5gWdo=", "https://www.globenewswire.com/Tracker?data=v56LrUe_zclrgYEpnFwy-j0ZZCxtVqyTnYSavdJzjbzM3DRVTbEFBpe3SaZsCG4G0y6Zf0I7wWGm163ZFkZA14yH1yqsAQ4Ulr5XWeK0eKI=", "https://www.globenewswire.com/Tracker?data=A2PGgXV7AFNykOOe__6QinMELo_NmtYy7i5CIgg8qrDrdMradFIuDFTR84TgaABxcq1iyVMhcEJUAJXTMDYmcfFkYzXevy6BlbnU7mcm5Kw=", "https://www.globenewswire.com/NewsRoom/AttachmentNg/fb4db237-00b2-4d66-b662-69f4eb4905d8", "https://www.globenewswire.com/Tracker?data=Wh2H3BuzVp12_SzkHAUSWQ95coaNKGtVlsQgvfW8qlG13Iwdd-v592xkhElOo1lBbozhbuFZmKw0k9nHGMCiXg=="], "published": "2018-01-04T00:30:00.000+02:00", "crawled": "2018-01-04T00:26:17.026+02:00", "highlightTitle": ""}