{"organizations": [], "uuid": "edcaa9041ae68089f9613db98bac194d75fc5cc7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 10}, "facebook": {"likes": 12, "shares": 12, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2013/03/01/100512160-airport-delay-sign-getty.1910x1000.jpg", "site_section": "https://www.cnbc.com/world/?region=world", "section_title": "CNBC International – World Business News Leader", "url": "https://www.cnbc.com/2018/01/09/the-worlds-most-punctual-airlines-and-airports-in-2017-revealed.html", "country": "US", "domain_rank": 767, "title": "The world’s most punctual airlines and airports in 2017 revealed", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.043, "site_type": "news", "published": "2018-01-09T15:09:00.000+02:00", "replies_count": 0, "uuid": "edcaa9041ae68089f9613db98bac194d75fc5cc7"}, "author": "David Reid", "url": "https://www.cnbc.com/2018/01/09/the-worlds-most-punctual-airlines-and-airports-in-2017-revealed.html", "ord_in_thread": 0, "title": "The world’s most punctual airlines and airports in 2017 revealed", "locations": [], "entities": {"persons": [], "locations": [{"name": "middle east", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "riga", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}], "organizations": [{"name": "all nippon airways", "sentiment": "none"}, {"name": "oag", "sentiment": "none"}, {"name": "hong kong airlines", "sentiment": "none"}, {"name": "otp", "sentiment": "none"}, {"name": "japan airlines", "sentiment": "none"}, {"name": "hawaiian airlines", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Is there much in life more frustrating than delayed travel plans? Armed with a bit of research, trips made using the right airline and select airports could increase the chance that flyers arrive at their destination on time.\nAfter trawling through 57 million flight records from 2017, U.K. travel analyst firm OAG published Tuesday its list of the best ranked punctual airports and carriers in the world.\nThe measure of on-time performance (OTP) it ranks are those flights that arrive or depart inside 15 minutes of their scheduled times.\nAcross 2017, the most punctual airline was Latvian flag carrier airBaltic, which achieved OTP on 90.01 percent of its flights. The carrier is headquartered in Riga and flies to destinations in Europe, the U.S. and the Middle East.\nHong Kong Airlines came second, with 88.83 percent punctuality, while in third place was Hawaiian Airlines, which took the title of most punctual North American airline.\nAmong the world's top 20 airlines, described in the report as \"mega airlines,\" Japan Airlines came top, followed by fellow Japanese carrier All Nippon Airways.\nIn third place of the biggest carriers was Delta Airlines , which achieved 82.76 percent OTP across 2017, according to the analysis.\nSource: Boeing A Delta Airlines Boeing 747 in flight. The laggard among the major carriers was Air China, which managed to arrive or depart within 15 minutes of scheduled time on just 60.14 percent of its flights.\nJapan's strong showing across its airlines was, unsurprisingly, reflected in the efficient performance of its airports.\nIn the mega-size category, those airports that served more than 30 million departing passengers in 2017, Tokyo Haneda came top with 86.75 percent of flights arriving and departing with 16 minutes of the advertised schedule.\nAnd in the category of global airports that serve between 10 and 20 million departing passengers each year, Osaka International came top and Sapporo Okadama third for hitting on-time performance. Salt Lake City International in Utah managed to achieve second place with an 86.01 percent OTP.\nIn the middle category, described as major airports that serve between 20 and 30 million departing passengers, Minneapolis-St Paul International came top with 85.73 of flights operating on time.", "external_links": [], "published": "2018-01-09T15:09:00.000+02:00", "crawled": "2018-01-09T15:21:08.030+02:00", "highlightTitle": ""}