{"organizations": [], "uuid": "4168deec91030678f126459c33c39461dd22e444", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220788890&w=1200&r=LYNXMPEE090IQ", "site_section": "http://feeds.reuters.com/reuters/domesticNews/", "section_title": "Reuters: U.S.", "url": "https://www.reuters.com/article/us-california-mudslides/death-toll-in-california-mudslides-expected-to-rise-idUSKBN1EZ0YS", "country": "US", "domain_rank": 408, "title": "Death toll in California mudslides expected to rise", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T12:27:00.000+02:00", "replies_count": 0, "uuid": "4168deec91030678f126459c33c39461dd22e444"}, "author": "", "url": "https://www.reuters.com/article/us-california-mudslides/death-toll-in-california-mudslides-expected-to-rise-idUSKBN1EZ0YS", "ord_in_thread": 0, "title": "Death toll in California mudslides expected to rise", "locations": [], "entities": {"persons": [{"name": "alex dobuzinskis", "sentiment": "none"}, {"name": "barbara sheriff bill brown", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "santa barbara county", "sentiment": "none"}, {"name": "montecito", "sentiment": "none"}, {"name": "carpenteria", "sentiment": "none"}, {"name": "santa barbara", "sentiment": "none"}], "organizations": [{"name": "min read  los angeles", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SANTA BARBARA, Calif. (Reuters) - Rescue crews with dogs and scanners dug through waist-deep mud in an affluent stretch of Southern California’s coast on Wednesday, hunting for up to two dozen people missing after mudslides swept through the coastal community and killed at least 15.\nThe mudslides in Santa Barbara County resulted from a downpour on Tuesday that damaged historic hotels and surrounded homes with debris, including those of celebrities such as Oprah Winfrey. Sandwiched between the Pacific Ocean and the sprawling Los Padres National Forest, the area draws the wealthy and the well-known with its natural beauty and proximity to sprawling Los Angeles.\nBut the verdant hillsides that once gave their estates a sense of seclusion were largely denuded by last month’s historic wildfires. That set the stage for the massive slides that sent boulders crashing into homes, turned highways into raging rivers and shredded cars into nearly unrecognizable tangles of metal.\nOne resident of the county’s Toro Canyon described being awakened before dawn Wednesday when his home began shaking and he heard sounds like those of a freight train and snapping wood.\n“What they were was a bunch of trees that were being snapped by the mud and boulders and debris that were sliding down Toro Canyon,” said Jonathan Reichlen, 45, who owns an urban landscaping company.\n“I just kind of waited it out because I did not want to go down to Toro Canyon while ... the mudslide was actually going on,” Reichlen said in a phone interview.\nHe said he had emergency food supplies and water but no hot food.\n“I‘m actually trying to find routes out of Toro Canyon. They’ve all been blocked,” he said. “I‘m talking with officials, and there a couple little side streets that may open up so I can go out and get a beer and (a) meal.”\nBetween 12 and 24 people who were believed to be in the area of Montecito, near Santa Barbara, at the time of the slides remained unaccounted for, said Chris Elms, a spokesman for state firefighters. About 500 law enforcement officers and firefighters combed mud-covered neighborhoods, using dogs, helicopters and thermal imaging equipment.\n“We are still very much in active search-and-rescue mode,” Elms said in a phone interview, warning that the current death toll of 15 confirmed fatalities could rise. “That’s a fear. We are still very hopeful that we will locate people alive.”\nMore rescuers headed out into the field on Wednesday to replace those who had worked through the night.\nFires smoldered in the wreckage of some houses pounded by the slides.\nFamily members inspect the inside of a home covered in mud following the mudslides in Montecito, California, U.S., in this photo provided by the Santa Barbara County Fire Department, January 10, 2018. Mike Eliason/Santa Barbara County Fire Department/Handout via REUTERS At the Peppers Estate historic mansion in Montecito, staff members were struggling to get by without gas or electricity, owner David Sullins said by telephone.\n“No one can leave the house, they (the authorities) don’t even want you to leave your own property, for security,” Sullins said.\nOfficials have ordered residents in a large swath of Montecito to stay in their homes so that rescuers can better go about their work.\nSanta Barbara County initially ordered 7,000 residents to evacuate and urged another 23,000 to do so voluntarily, but only 10 to 15 percent complied with mandatory orders, said Amber Anderson, a spokeswoman for the county fire department.\nSlideshow (11 Images) About 300 people were stranded in a canyon. Local rescue crews were using helicopters to airlift them out, officials said.\nREAGAN‘S PLAYGROUND\nThe area has long attracted California’s elite; former President Ronald Reagan and pop star Michael Jackson both owned ranches in the hills near Santa Barbara.\nThe mudslides closed several historic hotels, including The Four Seasons Biltmore, which had just reopened on Monday after repairing wildfire damage. The courtyard of the 90-year-old Montecito Inn, built by silent movie actor Charlie Chaplin, was filled with a thick crust of debris driven by the slides.\nThe disaster followed a violent rainstorm that dropped as much as 6 inches (15 cm) of precipitation in pockets northwest of Los Angeles, soaking ground that was left vulnerable after much of its vegetation burned last month.\nMedia mogul Oprah Winfrey posted videos on Instagram showing her wading through nearly knee-deep mud on her Montecito property and later inspecting the damage.\n“There used to be a fence right here. That’s my neighbor’s house. Devastated,” Winfrey said as she stood, surrounded by debris.\nThe number of fatalities surpassed the death toll from a California mudslide on Jan. 10, 2005, when 10 people were killed as a hillside gave way in the town of La Conchita, less than 20 miles (30 km) south of the latest disaster.\nLast month’s wildfires, including the Thomas Fire, which became the largest in California history, not only burned away grass and shrubs that held soil in place, but also baked a waxy layer into the earth that prevents water from sinking deeply into the ground.\nAdditional reporting by Alex Dobuzinskis in Los Angeles, Sharon Bernstein in Sacramento, Gina Cherelus and Peter Szekely in New York, Rich McKay in Atlanta and Brendan O'Brien in Milwaukee; Writing by Scott Malone; Editing by Jonathan Oatis and Chris Reese\n ", "external_links": [], "published": "2018-01-10T12:27:00.000+02:00", "crawled": "2018-01-10T12:36:34.044+02:00", "highlightTitle": ""}