{"organizations": [], "uuid": "e5a3d929e82ec56403f0aece9168ed0a80fa653a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/23/cnbc-interview-with-majid-jafar-crescent-petroleum-ceo-from-the-world-economic-forum-2018.html", "country": "US", "domain_rank": 767, "title": "CNBC Interview with Majid Jafar, Crescent Petroleum CEO, from the World Economic Forum 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T13:04:00.000+02:00", "replies_count": 0, "uuid": "e5a3d929e82ec56403f0aece9168ed0a80fa653a"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/23/cnbc-interview-with-majid-jafar-crescent-petroleum-ceo-from-the-world-economic-forum-2018.html", "ord_in_thread": 0, "title": "CNBC Interview with Majid Jafar, Crescent Petroleum CEO, from the World Economic Forum 2018", "locations": [], "entities": {"persons": [{"name": "majid jafar", "sentiment": "negative"}, {"name": "hadley gamble", "sentiment": "none"}, {"name": "steve sedgwick", "sentiment": "none"}, {"name": "rex tillerson", "sentiment": "none"}, {"name": "hadley", "sentiment": "none"}, {"name": "hariri", "sentiment": "none"}], "locations": [{"name": "middle east", "sentiment": "none"}, {"name": "davos", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}], "organizations": [{"name": "cnbc interview", "sentiment": "negative"}, {"name": "cnbc", "sentiment": "negative"}, {"name": "crescent petroleum", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Following are excerpts from a CNBC interview with Majid Jafar, CEO of Crescent Petroleum and CNBC's Hadley Gamble and Steve Sedgwick from the World Economic Forum 2018.\nSS: Well, we've been mentioning her all morning, so why don't we just say that Hadley has now joined us on set-,\nHG: [Laughter].\nSS: Very good, as well, looking forward to your Hariri interview, that's going to be fascinating, as well-,\nHG: As am I-,\nSS: And you're going to lead us off in our next one, as well, with Majid Jafar, who is the CEO of Crescent Petroleum, of course, which is one of the largest private oil and gas companies in the Middle East, one of the oldest, as well, isn't it? Nice to see you.\nMJ: Thank you, good to be here.\nSS: Hadley, take it away.\nHG: Well, I want to talk about, first of all, Iraq, because we've got the Prime Minister of Iraq coming to Davos, they say they need over $100 billion in investment, to get that country back on its feet, and the interesting question, of course, is going to be oil and gas infrastructure. Rex Tillerson is even going to the region. A lot of conferences in the coming months, particularly in February, about how to rebuild this country, you know, there have been a lot of tensions in the Middle East, what's going to happen next? But, obviously, people are very interested in putting their money back in to Iraq. What are we going to see there?\nMJ: So, I think the big change in Iraq over the last year is the end of the war against ISIS, and it ended successfully, and the whole crisis over Kurdistan independence seems to have been resolved. The Prime Minister met with the Regional Prime Minister, who's also coming to Davos, in the last three days, and they seem to have resolved key issues over border control and oil revenues. So, what needs to happen now is this massive reconstruction agenda for the areas that have been liberated. Half of Mosul was destroyed, the west of Iraq, the Sunni areas, the concern is, if the international community takes its eye off the ball, ignores rebuilding these areas, you could see something, god forbid, even worse than ISIS, reemerge in the years to come. So, $100 billion is the estimated reconstruction needs. We, as a group, we've already invested over $2.5 billion in Iraq, over the last decade, half of that in the oil and gas sector, in the Kurdistan region, but also in the power sector, power stations in the center of the country, and in the port management, container terminal and logistics, near Basra, in the south.\nHG: So, some optimism around Iraq, of course, certainly in Egypt, we understand, of course, that they're still not paying the full amount, I know, certainly with your business, in terms of the gas, but the question, of course, going forward, is going to be in terms of the geopolitical tensions, how much that's going to impact the price of oil. And when I spoke with the UAE's Oil Minister, who's now the President of OPEC, he basically told me that he wasn't that worried about it. Is that realistic?\nMJ: So, I think you're seeing, you know, unprecedented coordination, not just from within OPEC, but with non-OPEC, and that seems to be continuing. We just heard that the Russians may even invest in the Aramco IPO, that's just come out within the last hour, from here. So, I actually, I think, said here, last year, $60 over that year. We're almost $70. We could be up to $80, but the concern is, a shock like Venezuela, one country, with a major outage of production, could see a shock to prices, and, over the next few years, because of the huge underinvestment we had over the last few years, the concern is, as global growth continues, and the balance happens in the market, you could see a shock upwards on oil prices. For the Middle East, the agenda is very much reconstruction, in these areas that are post-conflict, like Iraq, and then reform in countries like the GCC , particularly with the national oil companies. Aramco getting ready for IPO, ADNOC really cutting costs, and already IPOed one of its subsidiaries. So, that's very much the theme, across the region, and here at Davos.\nSS: I admire your optimism in Iraq, and you're backing it up with money, as well, but when you were saying that things are sorted out politically with the Kurds and that, I thought to myself, 'Well, which Kurds?' Because, as we know, they're very split, amongst themselves. And then I thought, 'Well, then there's the Turkish influence, as well.' And then I thought, 'Now, well, another problem for Iraq, potentially, and Baghdad, is the Iranian influence, as well.' So, I see many, many factors, which could-, and I'm sorry to be the pessimist-,\nHG: [Laughter].\nSS: But I'm just trying to counter your optimism, as well. I see many factors that could actually drag Iraq back down again. Am I wrong to worry about those?\nMJ: Sure, there are those risks. But there are elections in May, both at the federal level, and at the regional level, they have just been reaffirmed by the Supreme Court. There are political opposition in both, but there are also governments that are actually in charge, the regional government in Erbil, and the federal government in Baghdad. And there's now a dialogue between them. So, in terms of our operations, we're in our tenth year of continuous production, sometimes I have to not watch the bad news, and focus on what's actually happening on the ground-,\nSS: Sure.\nMJ: Which is often a more positive-,\nSS: Yeah.\nMJ: Picture.\nSS: And it was extraordinary, how Baghdad took control of some of those fields again. It-, many of us who were watching, you and I, at the time, were very surprised by the lack of conflict. And that's a good thing, though, lack of conflict.\nMJ: This issue of independence movements, I mean, we saw it in Catalonia, and Kurdistan, and Scotland, and others. I think now there's been a resolution of the issue. Iraq will remain one state, but also respecting the-, the constitutional rights that Kurdistan Region has, in the Iraqi Constitution.\nSS: Nice to see you. Always a pleasure-,\nMJ: Good to see you.\nSS: And well done getting that oil price call right, as well [laughter].\nMJ: [Laughter]. I should have put some money on it.\nGC: What is-, what is your forecast for this year?\nMJ: Well, I-, as I-,\nGC: Since you got it right last time.\nMJ: As I said, I think we could edge up towards $80-,\nSS: Oh-,\nMJ: But then-, but then keep an eye on-, on any shocks from any one major producer.\nSS: What's that noise I can hear? Is that-, it's a tap running. Is it a shale tap? I think it-, I think it's on full tilt at $80-, [Laughter].\nGC: I'm not sure, I thought it was wishful thinking-,\nSS: Ah, okay.\n[Laughter].\nGC: But there you go.\nSS: Majid, nice to see you, sir-,\nMJ: Good to see you.\nSS: Majid Jafar, CEO of-, of Crescent Petroleum. And Hadley, we're going to see a lot more of you, of course, over the next day or so. In fact, we're going to work with you a little bit later on today, with another interview we're going to be doing, which I will tell viewers about later.\nENDS", "external_links": [], "published": "2018-01-23T13:04:00.000+02:00", "crawled": "2018-01-23T14:29:20.069+02:00", "highlightTitle": ""}