{"organizations": [], "uuid": "0bef93644f7fa39b219248646c3ffd100f983d70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/17/reuters-america-update-1-oil-up-on-threats-of-rebel-attacks-in-nigeria-falling-us-crude-stocks.html", "country": "US", "domain_rank": 767, "title": "UPDATE 1-Oil up on threats of rebel attacks in Nigeria, falling US crude stocks", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T05:09:00.000+02:00", "replies_count": 0, "uuid": "0bef93644f7fa39b219248646c3ffd100f983d70"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/17/reuters-america-update-1-oil-up-on-threats-of-rebel-attacks-in-nigeria-falling-us-crude-stocks.html", "ord_in_thread": 0, "title": "UPDATE 1-Oil up on threats of rebel attacks in Nigeria, falling US crude stocks", "locations": [], "entities": {"persons": [], "locations": [{"name": "nigeria", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "singapore", "sentiment": "none"}], "organizations": [{"name": "delta avengers", "sentiment": "negative"}, {"name": "niger delta avengers", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "stocks@\n* Nigeria's Delta Avengers threaten oil sector attacks\n* US crude stocks down by 5.1 mln at 411.5 mln -API\n* But gasoline, distillate stocks rise (Adds Nigeria threat, comment, updates prices)\nSINGAPORE, Jan 18 (Reuters) - Oil prices rose on Thursday on a reported decline in U.S. crude inventories, and as rebels in Nigeria threatened to attack the country's petroleum infrastructure.\nHowever, prices stayed below recent three-year highs as fuel supplies remain ample and as refineries scaled back operations.\nBrent crude futures were at $69.56 at 0255 GMT, up 18 cents, or 0.3 percent, from their last close. On Monday, they hit their highest since December, 2014 at $70.37 a barrel.\nU.S. West Texas Intermediate (WTI) crude futures were at $64.25 a barrel, up 28 cents, or 0.4 percent, from their last settlement. WTI marked a December-2014 peak of $64.89 a barrel on Tuesday.\nTraders said prices had been pushed up after reports that Nigeria's militant group Niger Delta Avengers threatened to launch attacks on the country's oil sector in the next few days.\nMarkets were also supported by a drop in available crude inventories.\n\"Prices ... rallied on the back of noticeable de-stocking of crude inventories,\" said Fawad Razaqzada, market analyst at future brokerage Forex.com .\nU.S. crude inventories fell by 5.1 million barrels in the week ended Jan. 12 to 411.5 million, according to the American Petroleum Institute on Wednesday.\nThe tighter supplies come on the back of supply cuts by the Organization of the Petroleum Exporting Countries (OPEC) and Russia, who started to withhold production in January last year. The cuts are set to last through 2018.\nDespite this, analysts warned that the recent oil price rally, which has lifted crude by around 14 percent since early December, may be about to run out of steam.\n\"The upside is now limited for oil prices ... U.S. oil producers will ramp up production in the coming months ... U.S. shale oil output will increase by a good 111,000 barrels per day (bpd) next month to 10 million bpd, and ... will rise to about 11 million bpd by the end of next year. This would put the U.S. on par with Saudi Arabia and Russia's output,\" Razaqzada said.\nThe API data also showed a well supplied fuel product market, which could mean lower crude demand going forward.\nU.S. refinery crude runs fell by 420,000 bpd and refined product stocks rose, implying a well supplied market.\nGasoline stocks rose by 1.8 million barrels while distillate fuels stockpiles, which include diesel and heating oil, climbed by 609,000 barrels, the API data showed.\nOfficial U.S. oil inventory and production data is due on Thursday from the Energy Information Administration (EIA).\n(Reporting by Henning Gloystein; Editing by Joseph Radford and Richard Pullin)", "external_links": [], "published": "2018-01-18T05:09:00.000+02:00", "crawled": "2018-01-19T09:12:52.050+02:00", "highlightTitle": ""}