{"organizations": [], "uuid": "8171bf866e8721a2c2c0f057bc9db4e5376a8639", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000398/device/rss", "section_title": "Barack Obama", "url": "https://www.cnbc.com/2018/01/30/the-associated-press-trump-puts-twitter-aside-as-he-prepares-for-big-speech.html", "country": "US", "domain_rank": 767, "title": "Trump puts Twitter aside as he prepares for big speech", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T08:27:00.000+02:00", "replies_count": 0, "uuid": "8171bf866e8721a2c2c0f057bc9db4e5376a8639"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/30/the-associated-press-trump-puts-twitter-aside-as-he-prepares-for-big-speech.html", "ord_in_thread": 0, "title": "Trump puts Twitter aside as he prepares for big speech", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — President Donald Trump will herald a robust economy and push for bipartisan congressional action on immigration in Tuesday night's State of the Union address, as he seeks to rally a deeply divided nation and boost his own sagging standing with Americans.\nThe speech marks the ceremonial kickoff of Trump's second year in office and is traditionally a president's biggest platform to speak to the nation. However, Trump has redefined presidential communications with his high-octane, filter-free Twitter account and there's no guarantee that the carefully crafted speech will resonate beyond his next tweet.\nTrump was quiet Tuesday on Twitter, and the White House sought to focus attention on his big speech to Congress and millions of Americans watching at home.\nWhile stocks have been falling this week, the economy has been strong and White House officials are hopeful the president can use the prime-time address to take credit. Though the trajectory of lower unemployment and higher growth began under his predecessor, Trump argues that the tax overhaul he signed into law late last year has boosted business confidence and will lead companies to reinvest in the United States.\nConsidering the strength of the economy, Trump will step before lawmakers Tuesday night in a remarkably weak position. His approval rating has hovered in the 30s for much of his presidency and at the close of 2017, just 3 in 10 Americans said the United States was heading in the right direction, according to a poll by The Associated Press-NORC Center for Public Affairs Research. In the same survey, 67 percent of Americans said the country was more divided because of Trump.\nIt's unlikely Trump will be able to rely on a robust legislative agenda to reverse those numbers in 2018. Congress has struggled with the basic function of funding the government, prompting a brief government shutdown earlier this month that was resolved only with a short-term fix that pushed the spending deadline to Feb. 8.\nAgainst the backdrop of the spending fight, Republicans and Democrats are also wrestling with the future of some 700,000 young immigrants living in the United States illegally. Trump has vowed to protect the so-called Dreamers from deportation, but is also calling for changes to legal immigration that are controversial with both parties.\n\"We're going to get something done, we hope bipartisan,\" Trump told reporters Monday, before giving his speech a practice run-through in the White House map room. \"The Republicans really don't have the votes to get it done in any other way. So it has to be bipartisan.\"\nThough Democrats are eager to reach a resolution for the young immigrants, the party is hardly in the mood to compromise with Trump ahead of the midterm elections. Lawmakers see Trump's unpopularity as a key to their success in November, and are eager to mobilize Democratic voters itching to deliver the president and his party a defeat at the ballot box.\nTrump also is expected to use the speech to talk about the fate of the controversial U.S. detention center at Guantanamo Bay, Cuba, according to a senior administration official who was not authorized to publicly discuss details of the speech and spoke on condition of anonymity. Trump, who vowed during his campaign to load Guantanamo up with \"bad dudes,\" has long been expected to rescind President Barack Obama's 2009 order to close the prison and issue his own stating his administration's policy to keep it open.\nSeeking to set the tone for their election-year strategy, party leaders have tapped Massachusetts Rep. Joe Kennedy, the grandson of Robert F. Kennedy, to deliver a post-speech rebuttal aimed at casting Democrats, not Trump, as champions of the middle class.\nDemocrats are also looking to make their mark in other ways. A handful of lawmakers are planning to boycott the president's remarks. And several Democratic women plan to wear black to protest sexual harassment, an issue that has tarnished several lawmakers in both parties. Trump himself has been accused of assault or harassment by more than a dozen women, accusations he has denied. The Wall Street Journal reported this month that the president's lawyer arranged a payment to a porn star, Stormy Daniels, to prevent her from talking about her alleged encounter with the future president.\nFirst lady Melania Trump, who has largely stayed out of the spotlight following those allegations, will attend Tuesday's address, according to the White House. She'll be joined in the audience by several guests whose stories amplify the president's agenda, including an Ohio welder who the White House says will benefit from the new tax law and the parents of two Long Island teenagers who were believed to have been killed by MS-13 gang members.\nAP Writer Deb Riechmann contributed to this report.\nFollow Julie Pace at http://twitter.com/jpaceDC", "external_links": [], "published": "2018-01-30T08:27:00.000+02:00", "crawled": "2018-01-30T20:04:35.008+02:00", "highlightTitle": ""}