{"organizations": [], "uuid": "d3ed80ac045a1017bd1948092aab4953524dbe56", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/bulgaria-eurozone/solid-growth-fiscal-prudence-needed-for-bulgaria-eurozone-entry-cen-banker-idUSL8N1PP31O", "country": "US", "domain_rank": 408, "title": "Solid growth, fiscal prudence needed for Bulgaria eurozone entry-cen banker", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T12:48:00.000+02:00", "replies_count": 0, "uuid": "d3ed80ac045a1017bd1948092aab4953524dbe56"}, "author": "", "url": "https://www.reuters.com/article/bulgaria-eurozone/solid-growth-fiscal-prudence-needed-for-bulgaria-eurozone-entry-cen-banker-idUSL8N1PP31O", "ord_in_thread": 0, "title": "Solid growth, fiscal prudence needed for Bulgaria eurozone entry-cen banker", "locations": [], "entities": {"persons": [{"name": "dimitar radev", "sentiment": "none"}], "locations": [{"name": "bulgaria", "sentiment": "none"}, {"name": "balkan", "sentiment": "none"}, {"name": "sofia", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "sofia", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "central bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 10:48 AM / in 40 minutes Solid growth, fiscal prudence needed for Bulgaria eurozone entry-cen banker Reuters Staff 3 Min Read \nSOFIA, Jan 30 (Reuters) - Bulgaria needs to maintain strong economic growth and fiscal prudence for a relatively long time in order to adopt the euro, Central Bank Governor Dimitar Radev said on Tuesday. \nThe Balkan country, which holds the rotating EU presidency, plans to file its application to enter the ERM-2, the two-year obligatory precursor to the euro, by the end of June. \nSofia’s push towards the euro is part of its plans to deepen its integration in the core of the bloc and avoid being left on the periphery as member states discuss a multi-speed Europe. \nSofia has had its lev currency pegged to the euro in the past two decades, and meets the formal criteria for adopting the single currency, producing fiscal surpluses, keeping inflation at bay and having one of the lowest public debt in the EU. \nBut critics say the EU’s poorest member state needs to better align its economy to richer Western peers and prove it can crack down on corruption before it can adopt the euro. \nThe small and open economy has been growing by over 3.5 percent a year in the past three years and is expected to grow over four percent this year, according to the central bank. \nSpeaking at a financial forum, Radev said the country did not need elaborate economic strategies on its path to the euro zone. \n“The recipe in our case is quite simple,” he said. “We need to continue to maintain that outpacing economic growth, we need to do it for a relatively long period of time while maintaining disciplined management of the public finances.” \nRadev said the Bulgarian banking sector was well capitalised and very liquid and working to decrease the bad loans that have dropped below 11 percent of all loans compared to 17 percent in 2014. \nSpeaking at the same forum, Finance Minister Vladislav Goranov reiterated that the government was making serious efforts to convince the ECB and the euro zone countries that Sofia belonged to “the club of the disciplined and rich European countries from the European centre”. (Reporting by Tsvetelia Tsolova, Editing by William Maclean)", "external_links": [], "published": "2018-01-30T12:48:00.000+02:00", "crawled": "2018-01-30T13:17:01.001+02:00", "highlightTitle": ""}