{"organizations": [], "uuid": "476904fed3e9e29c81f05614b13ef4746082cce8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000846/device/rss", "section_title": "Oil", "url": "https://www.cnbc.com/2018/01/30/reuters-america-update-9-oil-falls-a-second-day-on-stock-market-sell-off-u-s-output.html", "country": "US", "domain_rank": 767, "title": "UPDATE 9-Oil falls a second day on stock market sell-off, U.S. output", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T22:48:00.000+02:00", "replies_count": 0, "uuid": "476904fed3e9e29c81f05614b13ef4746082cce8"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/30/reuters-america-update-9-oil-falls-a-second-day-on-stock-market-sell-off-u-s-output.html", "ord_in_thread": 0, "title": "UPDATE 9-Oil falls a second day on stock market sell-off, U.S. output", "locations": [], "entities": {"persons": [{"name": "brian larose", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}], "organizations": [{"name": "wti", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "u.s. west texas intermediate", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Brent down 0.6 pct, WTI falls 1.6 pct\n* Oil prices still on track for fifth straight monthly gain\n* U.S. oil output soon expected to exceed 10 mln bpd\n* U.S. crude stocks forecast to see first build in 11 weeks -poll\n* Coming Up: API U.S. oil stock data at 4:30 p.m. EST (2130 GMT) (New throughout, updates prices, market activity, analyst comments to settlement and changes headline)\nHOUSTON, Jan 30 (Reuters) - Oil prices slid for a second day on Tuesday, driven by ongoing evidence of rising U.S. crude output, while wary investors sold off stocks, bonds and commodities.\nBrent crude futures for March delivery settled down 44 cents, or 0.6 percent, at $69.02 a barrel after touching a session low of $68.40.\nU.S. West Texas Intermediate futures fell $1.06, or 1.6 percent, to close at $64.50 a barrel.\n\"I'm inclined to see this as a pause on the upside. Technical fundamentals right now are saying wait for more information and move to a more neutral stance and wait and see what happens here,\" said Brian LaRose, technical analyst at United-ICAP\nU.S. blue-chip stocks opened under pressure, weighed down by a jump in government bond yields and an earlier rise in the dollar.\nU.S. stocks fell for a second straight day, with the Dow Jones Industrial Average tumbling as much as 352 points, the steepest intraday point drop since May 17, hammered by a rise in bond yields and a decline in healthcare companies.\n\"There are some concerns that when you get a pull-back in the stock market it may be killing the bullish argument that the economy is strong,\" said Phil Flynn, analyst at Price Futures Group in Chicago.\nWith oil's negative correlation to the dollar reaching its strongest in a month, even continued signs of robust demand for crude were not enough to ward off profit taking following last week's rise to three-year highs.\nOil's inverse relationship to the dollar, whereby a stronger currency makes it more expensive for non-U.S. investors to buy dollar-denominated assets, has reasserted itself this week.\nKeeping WTI prices under pressure were expectations that U.S. crude inventories last week rose for the first time in 11 weeks, according to a preliminary poll by Reuters on Monday.\nIndustry group the American Petroleum Institute will issue its data on stocks on at 4:30 p.m. EST, followed by official figures from the U.S. Energy Department on Wednesday morning.\nU.S. production is already on par with that of Saudi Arabia, the biggest producer in the Organization of the Petroleum Exporting Countries (OPEC). Only Russia produces more, averaging 10.98 million barrels per day (bpd) in 2017.\n(Additional reporting by Amanda Cooper in London and Henning Gloystein in Singapore; Editing by Marguerita Choy)", "external_links": [], "published": "2018-01-30T22:48:00.000+02:00", "crawled": "2018-01-31T00:34:23.015+02:00", "highlightTitle": ""}