{"organizations": [], "uuid": "e998e2d9f12651552b7faad909e87dddb879c3a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180101&t=2&i=1218513316&w=1200&r=LYNXMPEE000LV", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-cricket-ashes-anderson/ball-tampering-claims-ridiculous-says-anderson-idUKKBN1EQ0O9", "country": "US", "domain_rank": 408, "title": "Ball tampering claims 'ridiculous' says Anderson", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-01T04:50:00.000+02:00", "replies_count": 0, "uuid": "e998e2d9f12651552b7faad909e87dddb879c3a1"}, "author": "", "url": "https://uk.reuters.com/article/uk-cricket-ashes-anderson/ball-tampering-claims-ridiculous-says-anderson-idUKKBN1EQ0O9", "ord_in_thread": 0, "title": "Ball tampering claims 'ridiculous' says Anderson", "locations": [], "entities": {"persons": [{"name": "anderson", "sentiment": "negative"}, {"name": "anderson reu", "sentiment": "negative"}, {"name": "james anderson", "sentiment": "none"}, {"name": "trevor bayliss", "sentiment": "none"}], "locations": [{"name": "england", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "melbourne", "sentiment": "none"}], "organizations": [{"name": "mcg", "sentiment": "none"}, {"name": "telegraph", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 1, 2018 / 2:52 AM / Updated 11 hours ago Ball tampering claims 'ridiculous' says Anderson Reuters Staff 3 Min Read \nSYDNEY (Reuters) - England pace bowler James Anderson has described as “ridiculous” accusations that he was involved in tampering with the ball during the drawn fourth Ashes test against Australia in Melbourne last week. Cricket - Ashes test match - Australia v England - MCG, Melbourne, Australia, December 30, 2017. England's James Anderson catches the ball before bowling during the fifth day of the fourth Ashes cricket test match. REUTERS/David Gray \nThe 35-year-old was shown on television appearing to try to scuff up the ball with his thumbnail on the fourth day on Friday and local commentators seized on the footage as the match meandered to a draw. \nEngland coach Trevor Bayliss, however, labelled the accusations as ‘Pommie bashing’ while Anderson scoffed at the suggestions. \n”It escalated quite quickly, didn’t it?“ Anderson said in comments published by Britain’s The Telegraph newspaper. ”Ridiculous, but what we’ve come to expect. \n”(I was) getting dirt off the ball. They’d watered the square so the footholes on the old wickets had mud. \n“We went to the umpires to make sure they were happy with it.” \nAnderson’s comments echoed those of Bayliss, who said the umpires had told him on Saturday the accusations were a ‘beat-up’. \nBoth sides had been warned by the umpires during the match about deliberately throwing the new ball into the ground to scuff it up in a desperate attempt to exert some assistance from a drop-in pitch that offered both sides little help. \nAustralia had already regained the Ashes before the Melbourne game after they took a 3-0 lead in the five match series following victory by an innings and 41 runs in Perth. \nIn Melbourne, however, England dominated for much of the match, led by Alastair Cook’s unbeaten 244 and were thwarted by rain that washed out much of the fourth day’s play. \nAnderson, undoubtedly on his last Ashes tour of Australia, said his side were looking ahead to try to grab a face-saving victory in the fifth test in Sydney, which starts on Thursday. \n“We have played well at times in all four tests,” Anderson said. \n”It would be nice if we can carry that on and have one last push at Sydney and try to get a win. \n“It would mean a lot to the lads and all the English support we’ve had over here. You see them just non-stop and it means a lot to us that sort of support.” Reporting by Greg Stutchbury in Wellington; Editing by Andrew Both", "external_links": [], "published": "2018-01-01T04:50:00.000+02:00", "crawled": "2018-01-01T08:15:24.002+02:00", "highlightTitle": ""}