{"organizations": [], "uuid": "3a456d030faf00b84dcbe8b09dab5fcd9e2012f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/09/business-wire-alaska-communications-adopts-tax-benefits-preservation-plan-to-protect-tax-assets.html", "country": "US", "domain_rank": 767, "title": "Alaska Communications Adopts Tax Benefits Preservation Plan to Protect Tax Assets", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T16:55:00.000+02:00", "replies_count": 0, "uuid": "3a456d030faf00b84dcbe8b09dab5fcd9e2012f8"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/09/business-wire-alaska-communications-adopts-tax-benefits-preservation-plan-to-protect-tax-assets.html", "ord_in_thread": 0, "title": "Alaska Communications Adopts Tax Benefits Preservation Plan to Protect Tax Assets", "locations": [], "entities": {"persons": [], "locations": [{"name": "anchorage", "sentiment": "none"}, {"name": "alaska", "sentiment": "none"}], "organizations": [{"name": "alaska communications", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Stockholders to Vote on Tax Benefits Preservation Plan at 2018 Annual Meeting\nANCHORAGE, Alaska--(BUSINESS WIRE)-- Alaska Communications (NASDAQ: ALSK) today announced that its Board of Directors has approved the adoption of a tax benefits preservation plan (or “the plan”) in the form of a Section 382 Rights Agreement designed to protect and preserve the long-term value of certain tax assets primarily associated with net operating loss carryforwards. Alaska Communications intends to submit the tax benefits preservation plan, which is similar to tax benefits preservation plans adopted by many other public companies with significant tax assets, for stockholder ratification at its 2018 Annual Meeting of Stockholders.\nAs of December 31, 2016, Alaska Communications had approximately $67.5 million of (pre-tax) federal net operating loss carryforwards or NOLs that could potentially be utilized in certain circumstances to offset Alaska Communications’ future taxable income and reduce its federal income tax liability. Additional information with respect to Alaska Communications’ NOLs is contained in Alaska Communications’ Annual Report on Form 10-K for the fiscal year ended December 31, 2016 which Alaska Communications filed with the Securities and Exchange Commission on March 16, 2017.\nSection 382 of the Internal Revenue Code imposes limitations on the future use of a company’s NOLs if it undergoes an “ownership change.” Alaska Communications’ ability to benefit from its tax assets would be substantially limited by Section 382 if an “ownership change” occurred. A company experiences an “ownership change” for tax purposes if the percentage of stock owned by one or a group of its 5% stockholders (as defined for tax purposes) increases by more than 50 percentage points over a rolling three-year period over the lowest percentage of stock of such corporation owned by such stockholders at any time during that period. While Alaska Communications periodically monitors its NOLs and currently believes that an ownership change that would materially impair the value of its NOLs has not occurred, the complexity of Section 382’s provisions and the limited knowledge any public company has about the ownership of its publicly traded stock make it difficult to determine whether an ownership change has in fact occurred.\nTo protect Alaska Communications’ NOLs from being limited or permanently lost under Section 382, the tax benefits preservation plan is intended to deter any person or group from acquiring beneficial ownership of 4.99% or more of Alaska Communications’ outstanding common stock without the approval of the Board and, thereby, reduce the likelihood of an unintended “ownership change.” There is no assurance, however, that the tax benefits preservation plan will prevent Alaska Communications from experiencing an “ownership change.”\nPursuant to the tax benefits preservation plan, one preferred stock purchase right will be issued for each share of Alaska Communications’ common stock held by stockholders of record on January 19, 2018. Under the tax benefits preservation plan, the rights will become exercisable only if a person or group acquires beneficial ownership of 4.99% or more of Alaska Communications’ common stock without the approval of the Board. A person or group who acquires, without the approval of the Board, beneficial ownership (as defined in the tax benefits preservation plan) of 4.99% or more of Alaska Communications’ outstanding common stock (including any ownership interest held by that person's “affiliates” and “associates” as defined under the tax benefits preservation plan) could be subject to significant dilution. Stockholders who beneficially owned 4.99% or more of Alaska Communications’ outstanding common stock prior to the first public announcement by Alaska Communications of the plan will not trigger any penalties under the tax benefits preservation plan so long as they do not acquire beneficial ownership of any additional shares of common stock (other than pursuant to a stock split, reverse stock split, stock dividend, reclassification or similar transaction effected by Alaska Communications) at a time when they still beneficially own 4.99% or more of such common stock. The Board also retains the sole discretion to exempt any person or group from the consequences imposed by the plan.\nThe preferred stock purchase rights and the tax benefits preservation plan will expire no later than January 8, 2021. The preferred stock purchase rights and the tax benefits preservation plan may also expire on an earlier date upon the occurrence of other events, including a determination by Alaska Communications’ Board that (i) the tax benefits preservation plan is no longer necessary or desirable for the preservation of Alaska Communications’ tax attributes, or (ii) no tax attributes may be carried forward (with such expiration occurring as of the beginning of the applicable taxable year).\nThe issuance of the preferred stock purchase rights pursuant to the tax benefits preservation plan will not affect Alaska Communications’ reported earnings per share and such issuance should not be taxable to Alaska Communications or its stockholders.\nAdditional information with respect to the tax benefits preservation plan will be contained in the related Current Report on Form 8-K and Registration Statement on Form 8-A that Alaska Communications is filing with the Securities and Exchange Commission. Copies of these documents can be obtained, when available, at the SEC's internet website at www.sec.gov .\nMorgan, Lewis & Bockius LLP is serving as Alaska Communications’ legal advisor.\nAbout Alaska Communications Systems\nAlaska Communications (NASDAQ: ALSK) is the leading provider of advanced broadband and managed IT services for businesses and consumers in Alaska. The company operates a highly reliable, advanced statewide data network with the latest technology and the most diverse undersea fiber optic system connecting Alaska to the contiguous U.S. For more information, visit www.alaskacommunications.com or www.alsk.com .\nSafe Harbor\nThis press release contains “forward-looking statements” as defined under the U.S. federal securities laws, including the Private Securities Litigation Reform Act of 1995, and is subject to the safe harbors created by such laws. Forward-looking statements contained in this press release may relate to, but are not limited to, statements regarding our future taxable income, our ability to utilize and realize the value of our net operating loss carryforwards and how they could be substantially limited if we experienced an ownership change as defined in Section 382 of the Internal Revenue Code and whether the tax benefits preservation plan will reduce the likelihood of such an unintended ownership change from occurring. Such forward-looking statements are based on current expectations that involve a number of known and unknown risks, uncertainties and other factors which may cause actual events to be materially different from those expressed or implied by such forward-looking statements. Information on factors that may impact these forward-looking ", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.alsk.com&esheet=51740097&newsitemid=20180109005602&lan=en-US&anchor=www.alsk.com&index=3&md5=76853406187505a5fb3e6052ec5ef278", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.alsk.com&esheet=51740097&newsitemid=20180109005602&lan=en-US&anchor=www.alsk.com&index=5&md5=c98176cfd339c134f28b04ea18501534", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.alaskacommunications.com&esheet=51740097&newsitemid=20180109005602&lan=en-US&anchor=www.alaskacommunications.com&index=2&md5=a3b1ee44a127058530613b704f5ac5c1", "http://www.businesswire.com/news/home/20180109005602/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51740097&newsitemid=20180109005602&lan=en-US&anchor=www.sec.gov&index=1&md5=44ee5dc57ed780c6a01e55eb7e4cc47c", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51740097&newsitemid=20180109005602&lan=en-US&anchor=www.sec.gov&index=4&md5=8a2d80a105b2b8074e7989f3467189c0"], "published": "2018-01-09T16:55:00.000+02:00", "crawled": "2018-01-09T18:51:17.011+02:00", "highlightTitle": ""}