{"organizations": [], "uuid": "485dd36d9e2455bd58725d4f0a1750b34cd4925a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/britain-stocks/ftse-100-heads-for-muted-month-end-as-outsourcers-feel-capitas-pain-idUSL8N1PQ2P5", "country": "US", "domain_rank": 408, "title": "FTSE 100 heads for muted month-end as outsourcers feel Capita's pain", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T12:39:00.000+02:00", "replies_count": 0, "uuid": "485dd36d9e2455bd58725d4f0a1750b34cd4925a"}, "author": "", "url": "https://www.reuters.com/article/britain-stocks/ftse-100-heads-for-muted-month-end-as-outsourcers-feel-capitas-pain-idUSL8N1PQ2P5", "ord_in_thread": 0, "title": "FTSE 100 heads for muted month-end as outsourcers feel Capita's pain", "locations": [], "entities": {"persons": [{"name": "babcock", "sentiment": "none"}, {"name": "kit rees", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "sse", "sentiment": "none"}, {"name": "capita", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "serco", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 31, 2018 / 10:39 AM / in 30 minutes FTSE 100 heads for muted month-end as outsourcers feel Capita's pain Reuters Staff \n* FTSE 100 flat, mid caps down 0.2 pct \n* Capita slumps after profit warning, dividend suspension \n* SSE rises after raising FY profit outlook \n* FTSE set for monthly decline \nBy Kit Rees \nLONDON, Jan 31 (Reuters) - Moves on the UK’s top share index were subdued on Wednesday as the large caps headed towards a slight decline for the month, while shares in outsourcer Capita tanked after issuing a profit warning. \nThe blue chip FTSE 100 index was flat in percentage terms at 7,587.20 points by 0948 GMT, while mid caps retreated 0.2 percent. \nEarnings updates were the main focus of trading, with a slump in mid cap Capita’s shares the standout move. \nOutsourcer Capita tumbled more than 44 percent, on track for its biggest ever one-day loss, after the company issued a profit warning, suspended its dividend and announced a rights issue. \nPeers Babcock and Serco both fell 2.6 percent and 4.2 percent respectively. \nIt has been a difficult month for the sector following the collapse of Carillion when banks pulled the plug on a business swamped by debt and pensions liabilities. \n“It’s another tale of woe from the sector,” Laith Khalaf, senior analyst at Hargreaves Lansdown, said. \n“A bit like Carillion, Capita’s problems have been pretty long-running ... the company is in a state of turmoil and the new CEO has come in and set out a plan to get it into a state of recovery,” Khalaf said, adding that the adverse market reaction wasn’t surprising. \nElsewhere, shares in utility SSE were among the top gainers on the FTSE 100, rising 1.6 percent after the electricity and gas supplier raised its full-year profit outlook thanks to a rise in production from its renewable energy plants. \nPaddy Power Betfair was also among the biggest risers, up 1.1 percent on the back of an upgrade from broker Investec to “buy” from “hold” and a price target raise from HSBC. \nBritish housebuilders brought up the rear, however, with shares in Persimmon, Berkeley Group and Taylor Wimpey all down more than 1.5 percent. The falls followed a media report saying that the government could rescind planning permission on unused land. \nOn the day, declines among cyclical sectors such as energy, materials and financials weighed. These sectors, which are more sensitive to the economic cycle, saw a strong start to the year as investors bet on a global boom lifting equities, but have since succumbed to some profit-taking. \nThe FTSE 100 was on track to post a decline of more than 1 percent for the first month of 2018, thanks to heavy losses for firms such as Micro Focus, which dropped after results earlier in the month, and Shire, which cut its 2020 outlook. Reporting by Kit Rees", "external_links": [], "published": "2018-01-31T12:39:00.000+02:00", "crawled": "2018-01-31T13:05:26.007+02:00", "highlightTitle": ""}