{"organizations": [], "uuid": "17c3c446028e49c2308a20b3639d4bc5791b1bf0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180118.html", "section_title": "Archive News &amp; Video for Thursday, 18 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/defaults-survey/lpc-global-defaults-spreads-to-rise-amid-central-bank-concerns-poll-idUSL1N1PC1XJ", "country": "US", "domain_rank": 408, "title": "LPC: Global defaults, spreads to rise amid central bank concerns-poll", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T21:04:00.000+02:00", "replies_count": 0, "uuid": "17c3c446028e49c2308a20b3639d4bc5791b1bf0"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/defaults-survey/lpc-global-defaults-spreads-to-rise-amid-central-bank-concerns-poll-idUSL1N1PC1XJ", "ord_in_thread": 0, "title": "LPC: Global defaults, spreads to rise amid central bank concerns-poll", "locations": [], "entities": {"persons": [{"name": "som-lok leung", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "fed", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "iacpm", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "international association of credit portfolio managers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan 18 (Reuters) - Corporate debt defaults and credit spreads will accelerate globally, as central banks become less accommodative and boost interest rates, according to an International Association of Credit Portfolio Managers (IACPM) quarterly survey.\nCentral banks have kept interest rates and defaults at record lows for almost a decade, the group said in a statement, but economic improvement and signs of emerging inflation pressures will turn the tide.\n“Interest rates and credit defaults can only go in one direction from here,” Som-lok Leung, IACPM’s executive director, said in the statement.\n“When central banks stop injecting liquidity into the financial markets, rates and defaults will go up. They have nowhere else to go.”\nIn the United States, the Federal Reserve is expecting to raise rates three times this year, the same as it did last year. The first of those expected hikes will be in March and June, according to a Reuters poll of Wall Street banks.\nTwo-year Treasury yields, the note maturity most sensitive to interest rates hikes by the Fed, hit a nine-year high on Wednesday.\nIACPM’s 12-month Credit Default Outlook Index improved to negative 30.3 in the fourth quarter of 2017 from negative 36.3 the prior quarter.\nNegative numbers, however, remain across all regions, indicating expected credit erosion with wider spreads and increased defaults.\nThe least negative outlook is in Europe, where the central bank remains accommodative.\nThe view on Europe’s corporate defaults “reflects the ongoing quantitative easing program as the European Central Bank continues to pump liquidity into Europe’s financial system,” IACPM said in the statement.\nWhile the default outlook index scores are negative 26.5 for North America, negative 42.1 for Asia and negative 29.4 for Australia, Europe is relatively neutral at negative 8.8 for the next 12 months.\nThe group’s credit spread outlook deteriorated in the latest survey, dragged down by concerns about how the US tax system overhaul signed into law in December 2017 will impact highly indebted companies.\n“Tax reform will clearly benefit much of the corporate sector but we could see wider spreads in US high yield markets, if the deductibility of interest payments is significantly limited,” said Leung.\nIACPM’s 3-month Credit Spread Outlook Index eroded to a negative 22.0 reading from negative 18.8 the prior quarter. It is the most negative reading since negative 27.3 in the fourth quarter of 2016.\nIACPM is an association of more than 90 financial institutions located in more than 20 countries. (Reporting By Lynn Adler; Editing By Michelle Sierra)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-18T21:04:00.000+02:00", "crawled": "2018-01-19T12:17:51.068+02:00", "highlightTitle": ""}