{"organizations": [], "uuid": "bc4ff33150f3f85303da660c07a6cabbde5324d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-chunghwa-telecom-reports-un-audited-consolidated-operating-results-for-the-fourth-quarter-and-full-year-of-2017.html", "country": "US", "domain_rank": 767, "title": "Chunghwa Telecom Reports Un-Audited Consolidated Operating Results for the Fourth Quarter and Full Year of 2017", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T12:43:00.000+02:00", "replies_count": 0, "uuid": "bc4ff33150f3f85303da660c07a6cabbde5324d6"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-chunghwa-telecom-reports-un-audited-consolidated-operating-results-for-the-fourth-quarter-and-full-year-of-2017.html", "ord_in_thread": 0, "title": "Chunghwa Telecom Reports Un-Audited Consolidated Operating Results for the Fourth Quarter and Full Year of 2017", "locations": [], "entities": {"persons": [], "locations": [{"name": "taipei", "sentiment": "none"}, {"name": "taiwan", "sentiment": "none"}], "organizations": [{"name": "chunghwa telecom reports un-audited consolidated operating results", "sentiment": "negative"}, {"name": "chunghwa telecom co., ltd.", "sentiment": "neutral"}, {"name": "chunghwa", "sentiment": "none"}, {"name": "vas", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TAIPEI, Taiwan, Jan. 31, 2018 /PRNewswire/ -- Chunghwa Telecom Co., Ltd. (TAIEX: 2412, NYSE: CHT) (\"Chunghwa\" or \"the Company\") today reported its un-audited operating results for the fourth quarter and full year of 2017. All figures were prepared in accordance with Taiwan-International Financial Reporting Standards (\"T-IFRSs\") on a consolidated basis.\n(Comparisons throughout the press release, unless otherwise stated, are made with regard to the prior year period.)\nFourth Quarter 2017 Financial Highlights\nTotal revenue increased by 4.4% to NT$60.92 billion Mobile communications revenue increased by 2.1% to NT$28.97 billion Mobile value-added services (VAS) revenue increased by 4.2% to NT$10.91 billion, with mobile Internet revenue, the largest contributor to VAS revenue, increasing by 5.1% Mobile voice revenue decreased by 13.9% to NT$ 7.66 billion Smart device sales revenue increased by 14.3% to NT$9.97 billion Internet revenue increased by 2.4% to NT$7.75 billion Domestic fixed communications revenue increased by 10.9% to NT$19.62 billion International fixed communications revenue decreased by 0.3% to NT$3.55 billion Total operating costs and expenses increased by 5.2% to NT$50.40 billion Net income attributable to stockholders of the parent increased by 11.7% to NT$8.67 billion Basic earnings per share (EPS) was NT$1.12\nFull Year 2017 Financial Highlights\nTotal revenue decreased by 1.1% to NT$227.55 billion Mobile communications revenue decreased by 1.3% to NT$109.38 billion Mobile VAS revenue increased by 4.2% to NT$43.22 billion Mobile voice revenue decreased by 12.6% to NT$32.60 billion Smart device sales revenue increased by 4.4% to NT$32.20 billion Internet revenue increased by 3.6% to NT$28.93 billion Application VAS revenue increased by 5.9% to NT$5.44 billion Domestic fixed communications revenue decreased by 1.9% to NT$71.16 billion International fixed communications revenue decreased by 8.9% to NT$13.55 billion Total operating costs and expenses decreased by 0.4% to NT$180.73 billion Net income attributable to stockholders of the parent decreased by 3.0% to NT$38.86 billion Basic EPS was NT$5.01\nMr. Yu Cheng, Chairman and CEO of Chunghwa Telecom, stated, \"We are pleased to report another quarter of solid financial and operating performance, rounding out a strong 2017, during which our full year income from operation, net income and EBITDA exceeded guidance. Our solid market leading position is underscored by a 36.6% market share in mobile subscribers and a 37.2% market share in mobile revenue. At the same time, we maintained the lowest churn rate and the lowest decline of mobile service revenue among our peers despite an increasingly competitive landscape.\"\n\"We are also pleased with solid progress in our other segments. The number of users signing up for, or upgrading to, connection speeds of 100Mbps or higher grew by 9.5% year over year to 1.28 million in the fourth quarter as a result of broadband subscribers consistently migrating to our higher-speed, higher-value fiber services. Furthermore, our IPTV subscribers exceeded 1.6 million in the fourth quarter of 2017, representing a 20.3% increase year over year, driving a 15.7% year-over-year growth in IPTV revenue, which was also helped by the healthy growth of SVOD subscribers.\n\"Going forward, we remain focused on margin expansion and will continue to guide mobile subscribers toward higher-end plans and encourage our broadband subscribers to migrate to higher-speed services. We are confident in our ability to carry our strong growth momentum into 2018 and, with our competitive advantages in network infrastructure, IDC, and CDN, we will be able to further consolidate our market leading position.\" Mr. Cheng concluded.\nRevenue\nChunghwa Telecom's total revenues for the fourth quarter of 2017 increased by 4.4% to NT$60.92 billion, which was comprised of 47.6% mobile, 12.7% internet, 32.2% domestic fixed, 5.8% international fixed, and 1.7% from other businesses.\nMobile communications revenue for the fourth quarter of 2017 increased by 2.1% to NT$28.97 billion. This was mainly due to the continued growth in mobile VAS revenue and smart device sales, which partially offset decrease of mobile voice revenue. The decline of mobile voice revenue was due to increased market competition and VoIP substitution.\nInternet business revenue for the fourth quarter of 2017 increased by 2.4% year over year to NT$7.75 billion. The increase was primarily attributable to higher Data Communication revenue and revenue from services provided to the government.\nDomestic fixed revenue for the fourth quarter of 2017 increased by 10.9% year over year to NT$19.62 billion, primarily reflected by the increase of ICT project revenue, which offset the decrease of local and DLD service revenue that represented 6.9% and 7.7% decrease respectively due to increased mobile and VoIP substitution. Broadband access revenue also decreased by 2.5% to NT$4.63 billion as a result of intense market competition.\nInternational fixed revenue decreased by 0.3% to NT$3.55 billion, mainly due to the decline of international long distance revenue, which resulted from increased market competition.\nTotal revenue for the full year of 2017 decreased by 1.1% year over year to NT$227.55 billion, which was comprised of 48.1% mobile, 12.7% Internet, 31.3% domestic fixed, 5.9% international fixed, and 2.0% other.\nOperating Costs and Expenses\nTotal operating costs and expenses for the fourth quarter of 2017 increased by 5.2% year over year to NT$50.40 billion.\nTotal operating costs and expenses for 2017 decreased by 0.4% year over year to NT$180.73 billion, which was mainly due to lower interconnection expenses and depreciation, but partially offset by the increase in ICT project costs and cost of goods sold.\nOperating Income and Net Income\nIncome from operations for the fourth quarter of 2017 increased by 5.1% to NT$10.46 billion. The operating margin was 17.2%, compared to 17.1% in the same period of 2016. Net income attributable to stockholders of the parent increased by 11.7% to NT$8.67 billion. Basic earnings per share was NT$1.12.\nIncome from operations for 2017 decreased by 2.9% to NT$46.73 billion. The operation margin was 20.5%, compared to 20.9% for 2016. Net income attributable to stockholders of the parent decreased by 3.0% to NT$38.86 billion. Basic earnings per share was NT$5.01.\nCash Flow and EBITDA\nCash flow from operating activities for the fourth quarter of 2017 decreased by 20.8% to NT$25.09 billion. As of December 31 st , 2017, the Company had cash and cash equivalents of NT$28.89 billion, representing a 7.1% year-over-year decrease.\nEBITDA for the fourth quarter of 2017 increased by 2.0% to NT$18.45 billion, and EBITDA margin was 30.3%, compared to 31.0% in the same period of 2016. EBITDA for 2017 decreased by 2.4% to NT$78.63 billion, and EBITDA margin was 34.6%, compared to 35.0% for 2016.\nCapital Expenditure (\"Capex\")\nTotal Capex for the fourth quarter of 2017 decreased by 7.1% to NT$10.42 billion, which was comprised of 46.1% domestic fixed communications, 37.0% mobile communications, 11.8% internet, 2.8% international fixed communications, and 2.3% from others.\nBusiness and Operational Highlights\nBroadband/HiNet\nThe Company continued to execute its strategy of encouraging FTTx migration. As of December 31 st , 2017, the number of FTTx subscribers reached 3.55 million, accounting for 79.5% of the Company's total broadband users. Moreover, the number of subscribers signing up for speeds of 100Mbps or higher increased by 9.5% to over 1.28 million. HiNet broadband subscribers decreased by 0.7% year over year, totaling 3.73 million as of December 31 st , 2017.\nMobile\nAs of December 31 st , 2017, Chunghwa had 10.45 million mobile subscribers, representing a 3.1% year-over-year decrease. However, the Company's mobile Internet subscribers increased by 7.2% year over year to 7.35 million. As of December 31 st , 2017, the company accumulated 7.99 million 4G subscribers.\nFixed-line\nThe Company maintained its leading position in the fixed-line market, with a total of 10.69 million subscribers as of December 31 st , 2017.\n(in NT$ billion)\n2017\n2016\nYoY%\n4Q17\nJan.-Dec.\n4Q17\nJan.-Dec.\n4Q17\nJan.-Dec.\nRevenue\n60.92\n227.55\n58.33\n229.99\n4.4\n-1.1\nOperating costs and expenses\n50.40\n180.73\n47.91\n181.39\n5.2\n-0.4\nOther income and expense (Note 1)\n-0.06\n-0.09\n-0.46\n-0.49\n87.6\n81.5\nOperating income\n10.46\n46.73\n9.96\n48.11\n5.1\n-2.9\nNet income attributable to stockholders of the parent\n8.67\n38.86\n7.76\n40.07\n11.7\n-3.0\nEBITDA\n18.45\n78.63\n18.09\n80.58\n2.0\n-2.4\nEPS(NT$)\n1.12\n5.01\n1.00\n5.16\n11.7\n-3.0\nNote 1: \"Other income and expenses\" includes gains (losses) on disposal of property, plant and equipment (PP&E) and investment property, and impairment loss on PP&E and investment property.\nNote 2: The calculation of growth rates is based on NT$ thousand.\n2018 Guidance\nFor 2018, the Company expects total revenue to increase by 1.7~2.4%, to NT$231.47~NT$232.97 billion as compared to the un-audited consolidated total revenue of 2017. Operating costs and expenses are expected to increase by 0.7%~1.9%, to NT$182.07~NT$184.24 billion as compared to the prior year. Income from operations is expected to increase by 0.9%~8.8% to NT$47.17~NT$50.84 billion, year over year. Income before income tax and net income attributable to stockholders of the parent are expected to be NT$48.11~NT$51.89 billion and NT$37.25~NT$40.31billion, respectively. Basic earnings per share is expected to be NT$4.80~NT$5.20. Capex for the acquisition of property, plant and equipment in 2018 is expected to increase by NT$6.05 billion to NT$33.06 billion as compared to the prior year.\n(NT$ billion except EPS)\n2018(E)\n2017\n(un-audited)\nchange\nYoY\n(%)\nRevenue\n231.47~232.97\n227.55\n3.92~5.42\n1.7%~2.4%\nOperating Costs and Expenses\n182.07~184.24\n180.73\n1.34~3.51\n0.7%~1.9%\nOther Income and Expense\n(0.06)\n(0.09)\n0.03\n32.40%\nIncome from Operations\n47.17~50.84\n46.73\n0.44~4.11\n0.9%~8.8%\nNon-operating Income\n0.94~1.05\n1.30\n(0.36)~(0.25)\n(26.8%)~(19.2%)\nIncome before Income Tax\n48.11~51.89\n48.03\n0.08~3.86\n0.2%~8.0%\nNet Income Attributable to Stockholders of The Parent\n37.25~40.31\n38.86\n(1.61)~1.45\n(4.1%)~3.7%\nEPS(NT$)\n4.80~5.20\n5.01\n(0.21)~0.19\n(4.1%)~3.7%\nEBITDA\n79.11~82.79\n78.63\n0.48~4.16\n0.6%~5.3%\nEBITDA Margin\n34.2%~35.5%\n34.6%\n(0.4%)~0.9%\nAcquisition of Material Assets\n33.15\n27.01\n6.14\n22.8%\nAcquisition of Property,\nPlant and Equipment\n33.06\n27.01\n6.05\n22.4%\nOthers\n0.09\n0\n0.09\n100.0%\nDisposal of Material Assets\n3.07\n0.28\n2.79\n1003.7%\nFinancial Statements\nFinancial statements and additional operational data can be found on the Company's website at http://www.cht.com.tw/en/ir/stockit-earningsit.html .\nNOTE CONCERNING FORWARD-LOOKING STATEMENTS\nThis press release contains forward-looking statements. These statements constitute \"forward-looking\" statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, and as defined in the U.S. Private Securities Litigation Reform Act of 1995. These forward-looking statements can be identified by terminology such as \"will,\" \"expects,\" \"anticipates,\" \"future,\" \"intends,\" \"plans,\" \"believes,\" \"estimates\" and similar statements. Statements that are not historical facts, including statements about Chunghwa's beliefs and expectations, are forward-looking statements. Forward-looking statements involve inherent risks and uncertainties that could cause actual results to differ materially from the forward-looking statements. A number of important factors could cause actual results to differ materially from those contained in any forward-looking statement. Investors are cautioned that actual events and results could differ materially from those statements as a result of a number of factors including, but not limited to the risks outlined in Chunghwa's filings with the U.S. Securities and Exchange Commission on Forms F-1, F-3, 6-K and 20-F, in each case as amended. The forward-looking statements in this press release reflect the current belief of Chunghwa as of the date of this press release and Chunghwa undertakes no obligation to update these forward-looking statements for events or circumstances that occur subsequent to such date, except as required under applicable law.\nThis press release is not an offer of securities for sale in the United States. Securities may not be offered or sold in the United States absent registration or an exemption from registration. Any public offering of securities to be made in the United States will be made by means of a prospectus that may be obtained from the issuer or selling security holder and that will contain detailed information about the company and management, as well as financial statements.\nNON-GAAP FINANCIAL MEASURES\nTo supplement the Company's consolidated financial statements presented in accordance with International Financial Reporting Standards pursuant to the requirements of the Financial Supervisory Commission, or T-IFRSs, Chunghwa Telecom also provides EBITDA, which is a \"non-GAAP financial measure\". EBITDA is defined as consolidated net income (loss) excluding (i) depreciation and amortization, (ii) total net comprehensive financing cost (which is comprised of net interest expense, exchange gain or loss, monetary position gain or loss and other financing costs and derivative transactions), (iii) other income, net, (iv) income tax, (v) (income) loss from discontinued operations.\nIn managing the Company's business, Chunghwa Telecom relies on EBITDA as a means of assessing its operating performance because it excludes the effect of (i) depreciation and amortization, which represents a non-cash charge to earnings, (ii) certain financing costs, which are significantly affected by external factors, including interest rates, foreign currency exchange rates and inflation rates, which have little or no bearing on the Company's operating performance, (iii) income tax (iv) other expenses or income not related to the operation of the business.\nC AUTIONS ON USE OF NON-GAAP FINANCIAL MEASURES\nIn addition to the consolidated financial results prepared under T-IFRSs, Chunghwa Telecom also provide non-GAAP financial measures, including \"EBITDA\". The Company believes that the non-GAAP financial measures provide investors with another method for assessing its operating results in a manner that is focused on the performance of its ongoing operations.\nChunghwa Telecom's management believes investors will benefit from greater transparency in referring to these non-GAAP financial measures when assessing the Company's operating results, as well as when forecasting and analyzing future periods. However, the Company recognizes that:\nthese non-GAAP financial measures are limited in their usefulness and should be considered only as a supplement to the Company's T-IFRSs financial measures; these non-GAAP financial measures should not be considered in isolation from, or as a substitute for, the Company's T-IFRSs financial measures; these non-GAAP financial measures should not be considered to be superior to the Company's T-IFRSs financial measures; and these non-GAAP financial measures were not prepared in accordance with T-IFRSs and investors should not assume that the non-GAAP financial measures presented in this earnings release were prepared under a comprehensive set of rules or principle.\nFurther, these non-GAAP financial measures may be unique to Chunghwa Telecom, as they may be different from non-GAAP financial measures used by other companies. As such, this presentation of non-GAAP financial measures may not enhance the comparability of the Company's results to the results of other companies. Readers are cautioned not to view non-GAAP results as a substitute for results under T-IFRSs, or as being comparable to results reported or forecasted by other companies.\nAbout Chunghwa Telecom\nChunghwa Telecom (TAIEX 2412, NYSE: CHT) is Taiwan's largest integrated telecommunications services company that provides fixed-line, mobile, broadband, and internet services. The Company also provides information and communication technology services to corporate customers and is expanding its cloud computing services. In recent years, Chunghwa has been actively involved in corporate social responsibility and has won domestic and international awards and recognition. For more information, please visit the Company's website at http://www.cht.com.tw .\nContact: Fu-fu Shen\nPhone: +886 2 2344 5488\nEmail: chtir@cht.com.tw\nView original content: http://www.prnewswire.com/news-releases/chunghwa-telecom-reports-un-audited-consolidated-operating-results-for-the-fourth-quarter-and-full-year-of-2017-300590983.html\nSOURCE Chunghwa Telecom Co., Ltd.", "external_links": ["http://www.prnewswire.com/news-releases/chunghwa-telecom-reports-un-audited-consolidated-operating-results-for-the-fourth-quarter-and-full-year-of-2017-300590983.html", "http://www.cht.com.tw/en/ir/stockit-earningsit.html", "http://www.cht.com.tw/"], "published": "2018-01-31T12:43:00.000+02:00", "crawled": "2018-01-31T13:04:13.012+02:00", "highlightTitle": ""}