{"organizations": [], "uuid": "f96fc81cc8f73a60ef34f48b57f4c0b59d3702da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-stephen-ho-announced-as-the-new-president-and-chair-of-board-of-governors-of-the-pacific-telecommunications-council.html", "country": "US", "domain_rank": 767, "title": "Stephen Ho announced as the new President and Chair of Board of Governors of The Pacific Telecommunications Council", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T22:00:00.000+02:00", "replies_count": 0, "uuid": "f96fc81cc8f73a60ef34f48b57f4c0b59d3702da"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/22/globe-newswire-stephen-ho-announced-as-the-new-president-and-chair-of-board-of-governors-of-the-pacific-telecommunications-council.html", "ord_in_thread": 0, "title": "Stephen Ho announced as the new President and Chair of Board of Governors of The Pacific Telecommunications Council", "locations": [], "entities": {"persons": [{"name": "stephen ho", "sentiment": "negative"}, {"name": "anthony rossabi", "sentiment": "none"}, {"name": "timothy j. logue", "sentiment": "none"}, {"name": "brian tellam", "sentiment": "none"}, {"name": "gregg daffner", "sentiment": "none"}, {"name": "bruce drake", "sentiment": "none"}], "locations": [{"name": "honolulu", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}, {"name": "belcarra", "sentiment": "none"}, {"name": "pacific rim", "sentiment": "none"}, {"name": "hong kong sar china", "sentiment": "none"}, {"name": "british columbia canada", "sentiment": "none"}, {"name": "thales alenia space north america", "sentiment": "none"}], "organizations": [{"name": "chair of board of governors of the pacific telecommunications council", "sentiment": "negative"}, {"name": "board of governors chair and executive", "sentiment": "none"}, {"name": "partner of cornerstone capital partners", "sentiment": "none"}, {"name": "board of governors", "sentiment": "none"}, {"name": "ptc", "sentiment": "none"}, {"name": "citic telecom international cpc limited", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HONOLULU, Jan. 22, 2018 (GLOBE NEWSWIRE) -- The Board of Governors of The Pacific Telecommunications Council (“PTC”) today announced the appointment of Stephen Ho as the new President and Chair of the Board of Governors. Stephen Ho, the CEO of CITIC Telecom International CPC Limited, will serve his third term as President and Chair leading PTC, the global non-profit membership organization promoting the advancement of information and communication technologies (ICT) in the Pacific Rim.\nAlso elected on the Board of Governors are Vice Presidents Timothy J. Logue, Senior Director, Marketing & Sales, Thales Alenia Space North America; Bruce Drake, Councilor for the Village of Belcarra in British Columbia Canada; and Brian Tellam, Partner of Cornerstone Capital Partners. Gregg Daffner, Chief Executive Officer of GapSat, Hong Kong SAR China, will serve as Secretary.\nAnthony Rossabi, former PTC President and Board of Governors Chair and Executive Vice President & Chief Revenue Officer, TierPoint, USA, will serve as Treasurer of the organization.\n“Stephen Ho has been unfailingly supportive of PTC’s vision, mandate and actions. His third term provides us with continuity and forward thinking, and his intimate knowledge of our Membership is invaluable,” comments Sharon Nakama, CEO of the Pacific Telecommunications Council. “I am excited that as Treasurer, Tony Rossabi will continue to oversee the financial performance of PTC. I want to thank him for his service as President. We achieved tremendous growth in the past two years, welcoming numerous new Members, expanding our reach across emerging ICT segments and transforming our organization for decades to come.”\n“I am very honored and excited to be elected as President of PTC. With the support and advice of a seasoned team including the Board of Governors, Advisory Council and the Secretariat, we shall execute the PTC’s vision and mission to the best of our ability for our members and community,” adds Stephen Ho.\nAdditionally, PTC announced the elected officers of its Advisory Council. Mohamed Elagazy, President and CEO, CPS Services, Inc., was elected as Chair of the Advisory Council Chair.\n“On PTC’s 40th anniversary, I am honored to join the leadership of such exceptional organization as the Chairman of the Advisory Committee. Year after year, the PTC’s positive impact on the ICT sector can be felt all over the world. I am looking forward to working with the Board and the executive team on the strategic plans to continue advancing our vision for an ever brighter future,“ added Mohamed Elagazy, President and CEO, CPS Services.\nTom Cooper, Professor, Visual & Media Arts, Emerson College, and Keith Shaw, Vice President, Business Development EMEA, Equinix, Netherlands were also elected Vice-Chairs of the Advisory Council.\nAbout the Pacific Telecommunications Council\nRecognized as PTC, the Pacific Telecommunications Council is the global non-profit membership organization promoting the advancement of information and communication technologies (ICT) in the Pacific Rim, the most dynamic geography of the world, spanning over 40 nations. PTC enables its members to conduct trade in facilities, technologies, and services and to use the power of information and communication technologies (ICT) to improve the quality of life in the Asia-Pacific region. PTC is recognized for many of its initiatives, including the PTC Conference, the Pacific Rim’s premier ICT event where 7,000+ members and industry attendees gather annually in Honolulu, Hawaii.\nMedia Contact\nAnamarcia Lacayo\nCommunications Officer\nPacific Telecommunications Council\n+1.808.941.3789 | e-mail: anamarcia@ptc.org\nSource:PTC Conference", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/88257e9b-39c5-4f0f-b20c-af7184bde5d2"], "published": "2018-01-22T22:00:00.000+02:00", "crawled": "2018-01-22T23:21:43.032+02:00", "highlightTitle": ""}