{"organizations": [], "uuid": "54e7696a7c86c00aee771595b7fdec8454af0190", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224873656&w=1200&r=LYNXMPEE0N1R4", "site_section": "http://feeds.reuters.com/reuters/scienceNews/", "section_title": "Reuters: Science News", "url": "https://www.reuters.com/article/us-science-cloning-monkeys/chinese-scientists-break-key-barrier-by-cloning-monkeys-idUSKBN1FD2FF", "country": "US", "domain_rank": 408, "title": "Chinese scientists break key barrier by cloning monkeys", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T19:15:00.000+02:00", "replies_count": 0, "uuid": "54e7696a7c86c00aee771595b7fdec8454af0190"}, "author": "", "url": "https://www.reuters.com/article/us-science-cloning-monkeys/chinese-scientists-break-key-barrier-by-cloning-monkeys-idUSKBN1FD2FF", "ord_in_thread": 0, "title": "Chinese scientists break key barrier by cloning monkeys", "locations": [], "entities": {"persons": [{"name": "hirschler", "sentiment": "none"}, {"name": "hua hua", "sentiment": "none"}, {"name": "zhong zhong", "sentiment": "none"}], "locations": [{"name": "shanghai", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "scnt", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "chinese academy of sciences institute of neuroscience", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Chinese scientists have cloned monkeys using the same technique that produced Dolly the sheep two decades ago, breaking a technical barrier that could open the door to copying humans.\nZhong Zhong and Hua Hua, two identical long-tailed macaques, were born eight and six weeks ago, making them the first primates -- the order of mammals that includes monkeys, apes and humans -- to be cloned from a non-embryonic cell.\nIt was achieved through a process called somatic cell nuclear transfer (SCNT), which involves transferring the nucleus of a cell, which includes its DNA, into an egg which has had its nucleus removed.\nResearchers at the Chinese Academy of Sciences Institute of Neuroscience in Shanghai said their work should be a boon to medical research by making it possible to study diseases in populations of genetically uniform monkeys.\nBut it also brings the feasibility of cloning to the doorstep of our own species.\n“Humans are primates. So (for) the cloning of primate species, including humans, the technical barrier is now broken,” Muming Poo, who helped supervise the program at the institute, told reporters in a conference call.\n“The reason ... we broke this barrier is to produce animal models that are useful for medicine, for human health. There is no intention to apply this method to humans.”\nGenetically identical animals are useful in research because confounding factors caused by genetic variability in non-cloned animals can complicate experiments. They could be used to test new drugs for a range of diseases before clinical use.\nThe two newborns are now being bottle fed and are growing normally. The researchers said they expect more macaque clones to be born over the coming months.\nZhong Zhong and Hua Hua, two cloned long tailed macaque monkeys are seen at the Non-Primate facility at the Chinese Academy of Sciences in Shanghai, China January 10, 2018. Picture taken January 10, 2018. Qiang Sun and Mu-ming Poo, Chinese Academy of Sciences handout from Cell/ via REUTERS Since Dolly - cloning’s poster child - was born in Scotland in 1996, scientists have successfully used SCNT to clone more than 20 other species, including cows, pigs, dogs, rabbits, rats and mice.\nSimilar work in primates, however, had always failed, leading some experts to wonder if primates were resistant.\nThe new research, published on Wednesday in the journal Cell, shows that is not the case. The Chinese team succeeded, after many attempts, by using modulators to switch on or off certain genes that were inhibiting embryo development.\nSlideshow (5 Images) Even so, their success rate was extremely low and the technique worked only when nuclei were transferred from foetal cells, rather than adult ones, as was the case with Dolly. In all, it took 127 eggs to produce two live macaque births.\n“It remains a very inefficient and hazardous procedure,” said Robin Lovell-Badge, a cloning expert at the Francis Crick Institute in London, who was not involved in the Chinese work.\n“The work in this paper is not a stepping-stone to establishing methods for obtaining live born human clones. This clearly remains a very foolish thing to attempt.”\nThe research underscores China’s increasingly important role at the cutting-edge of biosciences, where its scientists have at times pushed ethical boundaries.\nThree years ago, for example, researchers at Sun Yat-sen University in Guangzhou caused a furor when they reported carrying out the first experiment to edit the DNA of human embryos, although similar work has now been done in the United States.\nScientists at the Shanghai institute said they followed international guidelines for animal research set by the U.S. National Institutes of Health, but called for a debate on what should or should not be acceptable practice in primate cloning.\nReporting by Ben Hirschler; Editing by Peter Graff\n ", "external_links": [], "published": "2018-01-24T19:15:00.000+02:00", "crawled": "2018-01-24T19:38:48.008+02:00", "highlightTitle": ""}