{"organizations": [], "uuid": "e233b5cebfafe7064f6b3627df0ec6765efb6bf0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180119.html", "section_title": "Archive News &amp; Video for Friday, 19 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/games-commonwealth-shooting/games-shooters-up-in-arms-over-birmingham-2022-exclusion-idUSL3N1PE3KB", "country": "US", "domain_rank": 408, "title": "Games-Shooters up in arms over Birmingham 2022 exclusion", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T20:03:00.000+02:00", "replies_count": 0, "uuid": "e233b5cebfafe7064f6b3627df0ec6765efb6bf0"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/games-commonwealth-shooting/games-shooters-up-in-arms-over-birmingham-2022-exclusion-idUSL3N1PE3KB", "ord_in_thread": 0, "title": "Games-Shooters up in arms over Birmingham 2022 exclusion", "locations": [], "entities": {"persons": [{"name": "david grevemberg", "sentiment": "none"}, {"name": "grevemberg", "sentiment": "none"}, {"name": "ed", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "durban", "sentiment": "none"}, {"name": "south africa", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "shooting times", "sentiment": "none"}, {"name": "cgf", "sentiment": "none"}, {"name": "glasgow games", "sentiment": "none"}, {"name": "commonwealth games federation", "sentiment": "none"}, {"name": "issf", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON, Jan 19 (Reuters) - Shooters are up in arms over a decision not to include their Olympic sport in the 2022 Birmingham Commonwealth Games programme.\nCommonwealth Games Federation (CGF) chief executive David Grevemberg confirmed on Friday that shooting, classified as an optional sport, would not feature.\nThe British city was chosen last December, replacing Durban in South Africa which was stripped of the event because it failed to meet promises made.\n“We know they (Birmingham organisers) considered all optional sports carefully, but a final decision was reached,” Grevemberg wrote in an open letter to the editor of Britain’s Shooting Times.\n“The CGF has awarded the Games supporting these plans and consequently shooting will not feature at the 2022 Commonwealth Games.”\nGrevemberg, an American former wrestler who was chief executive of the 2014 Glasgow Games, recognised that would be disappointing for those who practised and followed the sport.\nHe said the CGF president would meet shooting’s world governing body, the ISSF, to discuss future plans.\nIt will be the first time since Edinburgh 1970 that shooting, which became an optional sport for host cities after 2014, has not featured at a Commonwealth Games.\nEngland will have a squad of 20 shooters at the 2018 Games on Australia’s Gold Coast, including double gold medallist Steve Scott. The country has won 168 shooting medals at past Games.\nScott, who won bronze at the 2016 Rio de Janeiro Olympics, told the Shooting Times website (www.shootinguk.co.uk) that Birmingham’s decision was a “big blow”.\n“Obviously we’ve still got the Olympic Games and all the other world events we try to achieve in,” he added.\n“But everyone who has tried to get to the Commonwealth Games this year and didn’t, and has more than the ability to win a medal in 2022, are not going to have that opportunity to do so.”\nMore than 27,000 people had signed a Shooting Times petition asking Grevemberg to ensure the sport was included.\nThe National Shooting Centre at Bisley in southern England hosted events for Manchester 2002 but Birmingham has said it wants a compact Games using existing venues chosen on accessibility.\nDespite that, the track cycling events are set to be held in London.\nThe Birmingham decision has also gone down badly in India, whose first individual Olympic gold medal was won in shooting by Abhinav Bindra at Beijing in 2008. Shooting has provided more than a quarter of India’s total Commonwealth Games medals. (Reporting by Alan Baldwin, editing by Toby Davis)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-19T20:03:00.000+02:00", "crawled": "2018-01-20T17:29:35.011+02:00", "highlightTitle": ""}