{"organizations": [], "uuid": "f29d4d60e47358f5aba8621a5ae100b7dd4799e4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/11/104940825-GettyImages-901184830.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/19836768/device/rss/rss.html", "section_title": "Energy", "url": "https://www.cnbc.com/2018/01/12/why-challenges-lie-ahead-for-the-bond-between-hydropower-and-water.html", "country": "US", "domain_rank": 767, "title": "Why challenges lie ahead for the bond between hydropower and water", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T10:46:00.000+02:00", "replies_count": 0, "uuid": "f29d4d60e47358f5aba8621a5ae100b7dd4799e4"}, "author": "Anmar Frangoul", "url": "https://www.cnbc.com/2018/01/12/why-challenges-lie-ahead-for-the-bond-between-hydropower-and-water.html", "ord_in_thread": 0, "title": "Why challenges lie ahead for the bond between hydropower and water", "locations": [], "entities": {"persons": [{"name": "andy eaton", "sentiment": "none"}, {"name": "juliano portela", "sentiment": "none"}, {"name": "gilkes", "sentiment": "none"}], "locations": [{"name": "brazil", "sentiment": "none"}, {"name": "paraguay", "sentiment": "none"}], "organizations": [{"name": "sustainable energy", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "international energy agency", "sentiment": "none"}, {"name": "itaipu binacional", "sentiment": "none"}, {"name": "itaipu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Hydropower is the biggest source of renewable electricity in the world and is responsible for producing roughly 17 percent of the planet's electricity, according to the International Energy Agency.\nThe scale of some hydropower projects , such as the Itaipu facility situated between Brazil and Paraguay, is vast. Since operations began in 1984, the site has generated over 2.4 billion megawatt hours of energy.\n\"Our generating units are 700 megawatts each,\" Juliano Portela, an engineer at Itaipu Binacional, told CNBC's Sustainable Energy last year. \"We have 20 generating units installed, which comprises a total of 14,000 megawatts.\"\nIn terms of their longevity, hydropower facilities can be built to stand the test of time. As well as speaking to those working at Itaipu, \"Sustainable Energy\" also heard from Gilkes, a British business that specializes in the development of hydropower projects.\nAndy Eaton, its international hydro sales manager, said that some machines had been running for more than 100 years. Little tweaks are required now and then.\n\"Recently, we've carried out some upgrading work… of some equipment on a tea estate in Kenya, where they have five machines of ours dating back to the 1920s,\" he said. \"We haven't really carried out too much mechanically on the turbines, it's just an upgrade on the electrical side of the equipment where over a period of time the software, etcetera, has changed.\"\nIt goes without saying that water is crucial to hydropower, as it is to a huge number of other things that make the world go round.\nLooking at the bigger picture, it's clear that there are challenges ahead.\n\"Future water scarcity is going to mean that we're going to have to move water further distances, move water from afar to… where it's needed,\" Kala Vairavamoorthy, executive director of the International Water Association, told CNBC's \"Sustainable Energy\".\n\"That's going to require more energy because water is heavy,\" he said. \"If you couple that with our interest in low carbon energy, many of those technologies are going to require quite a lot of water, so this 'water-energy nexus' comes into play.\" Broadly speaking, the water energy nexus can refer to the relationship and interdependency between water and energy.\n\"If you… wrap all of this into the economic transformation that's taking place in developing countries, most of that economic transformation is going to require lots of water and lots of energy,\" Vairavamoorthy said, adding that he was hopeful that challenges could be navigated thanks to \"great innovations\" taking place in technology.", "external_links": [], "published": "2018-01-12T10:46:00.000+02:00", "crawled": "2018-01-12T12:40:04.003+02:00", "highlightTitle": ""}