{"organizations": [], "uuid": "6c2dfc3e2432535fa387f3fd5f396839cd2a1626", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 4, "shares": 4, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180125&t=2&i=1225178438&w=1200&r=LYNXMPEE0O15N", "site_section": "http://feeds.reuters.com/Reuters/UKWorldNews?format=xml", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-cameroon-separatists-refugees/at-least-43000-cameroonian-refugees-flee-to-nigeria-local-aid-officials-idUKKBN1FE246", "country": "US", "domain_rank": 408, "title": "At least 43,000 Cameroonian refugees flee to Nigeria - local aid officials", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T16:50:00.000+02:00", "replies_count": 0, "uuid": "6c2dfc3e2432535fa387f3fd5f396839cd2a1626"}, "author": "", "url": "https://uk.reuters.com/article/uk-cameroon-separatists-refugees/at-least-43000-cameroonian-refugees-flee-to-nigeria-local-aid-officials-idUKKBN1FE246", "ord_in_thread": 0, "title": "At least 43,000 Cameroonian refugees flee to Nigeria - local aid officials", "locations": [], "entities": {"persons": [{"name": "john inaku", "sentiment": "none"}, {"name": "emmanuel shior", "sentiment": "none"}, {"name": "paul biya", "sentiment": "none"}], "locations": [{"name": "nigeria", "sentiment": "none"}, {"name": "onitsha", "sentiment": "none"}, {"name": "cameroon", "sentiment": "none"}, {"name": "ambazonia", "sentiment": "none"}, {"name": "cross river", "sentiment": "none"}], "organizations": [{"name": "sema", "sentiment": "none"}, {"name": "state emergency management agency", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 25, 2018 / 2:52 PM / Updated 14 minutes ago At least 43,000 Cameroonian refugees flee to Nigeria - local aid officials Anamesere Igboeroteonwu 3 Min Read \nONITSHA, Nigeria (Reuters) - More than 43,000 Cameroonians have fled as refugees to Nigeria to escape a crackdown by the government on Anglophone separatists, local aid officials said on Thursday. \nThe figure is almost three times as high as that given by the United Nations and Nigerian officials two weeks ago. \nCameroon is a majority French-speaking country but two southwestern regions bordering Nigeria are Anglophone. Last October, separatists declared independence for a state they want to create called Ambazonia, sparking a military crackdown by the government of President Paul Biya. \nIn Nigeria’s Cross River state, which borders southwest Cameroon, more than 33,000 Cameroonians have taken refuge from violence, John Inaku, director general of the State Emergency Management Agency (SEMA), told Reuters by phone. \nIn neighbouring Benue state, there are 10,216 refugees, said Emmanuel Shior, director general of the regional SEMA. \nEarlier this month, the UN refugee agency had said more than 8,000 refugees were in Cross River state. \nExplaining the disparity, Inaku told Reuters the UN agency was only registering people in Cross River coming in through conventional routes. FILE PHOTO: Cameroon's President Paul Biya is seen at the 72nd United Nations General Assembly at U.N. headquarters in New York City, U.S. September 22, 2017. REUTERS/Stephanie Keith \n“This is a war situation and refugees are trooping in by the minute through the bush paths, rivers and every other unconventional routes open to them,” he said. \n“During our advocacy to our border communities we told them to allow the refugees in and not be hostile to them so our communities have been receiving them warmly and accommodating them. These are very remote areas, hard to reach without good roads,” Inaku said. \nInaku said community facilities were becoming overstretched and so people were getting hostile towards the refugees, who were in “deplorable condition”, hungry and in need of medicine. \nThe Benue SEMA director general said the agency had also had difficulty counting refugees because they were in remote areas. \nEarly on Thursday, gunmen crossed from Nigeria to attack a border post in Cameroon’s southwest, security force witnesses said, with the incident likely to further damage relations between the neighbours. \nThe separatists pose the biggest challenge yet to the 35-year rule of Biya, who will seek re-election this year. The conflict is also fuelling tensions between Nigeria and Cameroon. \nCameroonian military officials and pro-government media accuse Nigeria of sheltering the insurgents, who since last year have waged a guerrilla campaign to establish an independent homeland for Cameroon’s English-speaking minority. Reporting by Anamesere Igboeroteonwu; Writing by Paul Carsten; Editing by Matthew Mpoke Bigg", "external_links": [], "published": "2018-01-25T16:50:00.000+02:00", "crawled": "2018-01-25T17:07:10.010+02:00", "highlightTitle": ""}