{"organizations": [], "uuid": "9c03aaa9ecabcabd9b141ed69a65535a49dfd521", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/sportsNews", "section_title": "Reuters: Sports News", "url": "https://www.reuters.com/article/us-russia-worldcup-hotels/russia-names-and-shames-hotels-jacking-up-prices-for-world-cup-idUSKBN1FC28U", "country": "US", "domain_rank": 408, "title": "Russia names and shames hotels jacking up prices for World Cup", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T18:22:00.000+02:00", "replies_count": 0, "uuid": "9c03aaa9ecabcabd9b141ed69a65535a49dfd521"}, "author": "", "url": "https://www.reuters.com/article/us-russia-worldcup-hotels/russia-names-and-shames-hotels-jacking-up-prices-for-world-cup-idUSKBN1FC28U", "ord_in_thread": 0, "title": "Russia names and shames hotels jacking up prices for World Cup", "locations": [], "entities": {"persons": [{"name": "kazan", "sentiment": "none"}], "locations": [{"name": "russia", "sentiment": "none"}, {"name": "st petersburg", "sentiment": "none"}, {"name": "belgium", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "kaliningrad", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}], "organizations": [{"name": "federal agency for tourism", "sentiment": "none"}, {"name": "booking.com", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 4:26 PM / Updated 10 minutes ago Russia names and shames hotels jacking up prices for World Cup Reuters Staff 3 Min Read \nMOSCOW (Reuters) - Russia’s Federal Agency for Tourism on Tuesday published a list of hotels that have increased their room prices by as much as 5,000 percent for this year’s soccer World Cup. \nIt said prices at 41 hotels in six regions where World Cup matches will be played in June and July have in many cases significantly increased on their websites or through online travel booking for the period covering the tournament. \nRussia will host the World Cup from June 14 to July 15 in 12 venues spread across 11 cities including Moscow, St Petersburg, Kazan and Sochi, and is expecting a large influx of visitors. \nThe Agora hotel in Kaliningrad, the Russian exclave that will host four group stage matches, including England’s match against Belgium on June 28, should normally charge no more than 2,400 roubles ($42.49) per night, the agency said. \nBut during the World Cup, prices on online travel agent Booking.com have been listed as 129,200 roubles ($2,287.17) - a more than 5,000 percent increase on regular prices. \n“Maybe there was an error in the system. The management is sorting it out,” Svetlana Ovchinnikova, the administrator of the Agora hotel, told Reuters. “As the administrator, I can tell you... we have not received that kind of money.” \nSome of the establishments on the list include members of large hotel chains, including Hampton by Hilton and Kempinski. \nThe agency found that the price for a standard room on the website of the Hampton by Hilton Volgograd Profsoyuznaya was up nine percent. \n“This information does not correspond to reality,” the general manager of the Hampton by Hilton Volgograd Profsoyuznaya, Ineza Malikova, told Reuters. \nThe room prices at Kempinsky Grand Hotel Gelendzhik, in the Black Sea resort city of the same name, were up four percent on the hotel’s website for the period covering the tournament. Prices for rooms at the hotel on Booking.com were 30 percent higher than usual, the agency said. \n“The hotel has immediately taken measures to identify and eliminate the reasons (for this situation),” the Kempinsky Grand Hotel Gelendzhik said in a statement sent to Reuters. \n“It has been established that as a result of technical malfunctions in the online systems on which the hotel was presented, the prices did not correspond to the norm.” Editing by Mark Heinrich", "external_links": [], "published": "2018-01-23T18:22:00.000+02:00", "crawled": "2018-01-23T18:38:05.014+02:00", "highlightTitle": ""}