{"organizations": [], "uuid": "5b2c96f7ba247563bb9a4c20793f7987784d8bb6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-dollar-up-for-second-day-as-firmer-yields-support-idUSL4N1PP36F", "country": "US", "domain_rank": 408, "title": "FOREX-Dollar up for second day as firmer yields support", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T16:42:00.000+02:00", "replies_count": 0, "uuid": "5b2c96f7ba247563bb9a4c20793f7987784d8bb6"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-dollar-up-for-second-day-as-firmer-yields-support-idUSL4N1PP36F", "ord_in_thread": 0, "title": "FOREX-Dollar up for second day as firmer yields support", "locations": [], "entities": {"persons": [{"name": "saikat chatterjee", "sentiment": "neutral"}, {"name": "viraj patel", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "neutral"}, {"name": "ing", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Graphic: World FX rates in 2017 tmsnrt.rs/2egbfVh\nBy Saikat Chatterjee\nLONDON, Jan 30 (Reuters) - The dollar climbed for a second consecutive day on Tuesday as investors took profits into a recent drop in the greenback in the backdrop of firmer bond yields and a central bank policy decision due this week.\nDespite the dollar’s bounce, the currency is set for its biggest monthly decline since July 2017 as the combination of strong global growth and slow inflation encouraged investors to add bearish bets.\nBut a spike in global bond yields, with ten-year U.S. bond yields pushing well above 2.70 percent, its highest since April 2014, prompted some investors to cut some short positions.\n“We are seeing a consolidation of the dollar’s losses and there is a whiff of nervousness among dollar bears out there,” said Viraj Patel, an FX strategist at ING in London.\nThe dollar rose 0.3 percent against a basket of six major currencies to 89.60, having pulled up from a low of around 88.43 set last week, its weakest level since December 2014.\nAnalysts said a renewed rise in U.S. bond yields this week lent some support to the dollar. The U.S. 10-year Treasury yield reached a peak of 2.733 percent in Asian trading on Tuesday, the highest since April 2014, and last stood at 2.712 percent.\nThe euro eased 0.3 percent to $1.2373, edging away from a three-year high of $1.2538 touched last week.\n“There is a pause in the dollar’s weakness, at least for now,” said Teppei Ino, an analyst for Bank of Tokyo-Mitsubishi UFJ in Singapore.\nMarket participants are probably waiting for Trump’s State of the Union speech, due later on Tuesday, for anything further he might have to say about the dollar, Ino said.\nTreasury Secretary Steven Mnuchin gave U.S. currency bears a major boost last week with a tacit endorsement of a weak dollar. Trump later tried to row back from those comments, saying he ultimately wants the dollar to be strong.\nTrump said on Monday he will address his proposed immigration overhaul in his State of the Union speech as well as his efforts to lower trade barriers around the world for American exports.\nThe dollar’s gain also comes at a time when risk sentiment is at the back foot with Asian stocks falling and European stocks stumbling in opening trades.\nSterling, a currency highly correlated to risk-on sentiment, fell below the $1.40 line for the first time in a week. It is now down more than 2.5 percent from a peak above $1.43 hit last week.\nFor Reuters Live Markets blog on European and UK stock markets see reuters://realtime/verb=Open/url=http://emea1.apps.cp.extranet.thomsonreuters.biz/cms/?pageId=livemarkets (Reporting by Saikat Chatterjee; Additional reporting by Masayuki Kitano; Editing by Louise Heavens)\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": ["http://emea1.apps.cp.extranet.thomsonreuters.biz/cms/?pageId=livemarkets", "http://tmsnrt.rs/2egbfVh", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-30T16:42:00.000+02:00", "crawled": "2018-01-30T16:40:12.021+02:00", "highlightTitle": ""}