{"organizations": [], "uuid": "25a08f7ecbe42c5a96d5552b7b4873cc512e280b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-long-blockchain-corp-appoints-two-new-members-to-its-board-of-directors.html", "country": "US", "domain_rank": 767, "title": "Long Blockchain Corp. Appoints Two New Members to its Board of Directors", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-02T16:00:00.000+02:00", "replies_count": 0, "uuid": "25a08f7ecbe42c5a96d5552b7b4873cc512e280b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-long-blockchain-corp-appoints-two-new-members-to-its-board-of-directors.html", "ord_in_thread": 0, "title": "Long Blockchain Corp. Appoints Two New Members to its Board of Directors", "locations": [], "entities": {"persons": [{"name": "malik", "sentiment": "none"}, {"name": "shamyl malik", "sentiment": "none"}, {"name": "philip thomas", "sentiment": "none"}, {"name": "som ghosh", "sentiment": "none"}, {"name": "ghosh", "sentiment": "none"}, {"name": "shamyl", "sentiment": "none"}], "locations": [{"name": "farmingdale", "sentiment": "none"}, {"name": "ny", "sentiment": "none"}], "organizations": [{"name": "long blockchain corp", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}, {"name": "board", "sentiment": "none"}, {"name": "long blockchain corp.", "sentiment": "none"}, {"name": "voltaire capital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "- New Members are Nominees of Lender in Recently Announced Convertible Debt Facility -\n- Board Additions Bring Experience in Financial Technology -\nFarmingdale, NY, Jan. 02, 2018 (GLOBE NEWSWIRE) -- Long Blockchain Corp. (NasdaqCM: LTEA) (the “Company”) today announced the appointment of Shamyl Malik, Global Head of Trading at Voltaire Capital, and Som Ghosh, a technology entrepreneur with experience in blockchain technology, to its Board of Directors (the “Board”). These appointments are nominees of the lender in the Company’s recently announced convertible debt facility and are consistent with the Company’s previously announced plan to shift its primary corporate focus towards blockchain technology. Both Mr. Malik and Mr. Ghosh are deemed to be independent directors under the Nasdaq listing rules.\nPhilip Thomas, Chief Executive Officer of the Company, commented, “We are thrilled to have Shamyl and Som join the Board during this exciting period of growth and evolution. They bring a wealth of experience and knowledge in the financial technology sector, and we are confident that they will help to shape the future of the Company as it pivots into blockchain technology.”\nMr. Malik has been involved in the financial technology sector for over the past decade. He currently serves as Global Head of Trading at Voltaire Capital, a leading liquidity provider in the foreign exchange market. Prior to joining Voltaire Capital, he served as Head of FX Electronic Trading at Morgan Stanley and Head of Electronic Market Making for Emerging Markets and Precious Metals in the Capital Markets Division at Citibank. Mr. Malik began his investment banking career at Lehman Brothers, working in both New York and London across various derivative trading roles in fixed income, commodities and currencies. While completing his Doctor of Philosophy degree in Econometrics at the University of Oxford, Mr. Malik also performed economic research at the International Monetary Fund and The World Bank in Washington D.C.\nMr. Malik added, “I have a strong appreciation of the technology landscape that the Company is shifting towards, having worked throughout my career with financial technology and its applications in the global financial markets. This is an exciting time to be developing blockchain technology and I look forward to helping the Company build a world-class organization.”\nMr. Ghosh is a blockchain technology entrepreneur with over eleven years of experience in technology and computing, with its applications in investment banking, health and wellness, asset management, algorithmic trading and cryptocurrency. He was previously the co-founder and Chief Technology Officer of London-based health-tech start-up Earthmiles. Prior to that, Mr. Ghosh worked in quantitative trading and structuring roles at Deutsche Bank, UBS and Societe Generale in Hong Kong and London. He holds both a Bachelor’s degree and a Master’s degree in Chemical Engineering from Indian Institute of Technology, Kharagpur. Mr. Ghosh is a regular speaker at the London Python and London Django Conferences.\nMr. Ghosh commented, “I first began working with blockchain technology once I fully appreciated its ability to revolutionize every facet of our lives, creating a more secure and stable transfer of information around the globe. The Company has a fantastic opportunity ahead of itself, as the industry is only in the early stages of tapping into the full potential of blockchain technology.”\nAbout Long Blockchain Corp.\nLong Blockchain Corp. (formerly Long Island Iced Tea Corp.) is focused on developing and investing in globally scalable blockchain technology solutions. It is dedicated to becoming a significant participant in the evolution of blockchain technology that creates long term value for its shareholders and the global community by investing in and developing businesses that are “on-chain”. Blockchain technology is fundamentally changing the way people and businesses transact, and the Company will strive to be at the forefront of this dynamic industry, actively pursuing opportunities. Its wholly-owned subsidiary Long Island Brand Beverages, LLC operates in the non-alcohol ready-to-drink segment of the beverage industry under its flagship brand ‘The Original Long Island Brand Iced Tea ® ’.\nForward Looking Statements\nThis press release includes statements of the Company’s expectations, intentions, plans and beliefs that constitute \"forward looking statements\" within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934 and are intended to come within the safe harbor protection provided by those sections. These statements, which involve risks and uncertainties, relate to the discussion of the Company’s business strategies and its expectations concerning future operations, margins, sales, new products and brands, potential joint ventures, potential acquisitions, expenses, profitability, liquidity and capital resources and to analyses and other information that are based on forecasts of future results and estimates of amounts not yet determinable. These statements include any statement that does not directly relate to a historical or current fact. You can also identify these and other forward-looking statements by the use of such words as \"may,\" \"will,\" \"should,\" \"expects,\" \"intends,\" \"plans,\" \"anticipates,\" \"believes,\" \"thinks,\" \"estimates,\" \"seeks,\" \"predicts,\" \"could,\" \"projects,\" \"potential\" and other similar terms and phrases, including references to assumptions. These forward looking statements are made based on expectations and beliefs concerning future events affecting the Company and are subject to uncertainties, risks and factors relating to its operations and business environments, all of which are difficult to predict and many of which are beyond its control, that could cause its actual results to differ materially from those matters expressed or implied by these forward looking statements. These risks include the Company’s history of losses and expectation of further losses, its ability to expand its operations into blockchain technologies, its ability to develop or acquire new brands, the success of its marketing activities, the effect of competition in its industry and economic and political conditions generally, including the current economic environment and markets. More information about these and other factors are described in the reports the Company files with the Securities and Exchange Commission, including but not limited to the discussions contained under the caption “Risk Factors.” When considering these forward looking statements, you should keep in mind the cautionary statements in this press release and the reports the Company files with the Securities and Exchange Commission. New risks and uncertainties arise from time to time, and the Company cannot predict those events or how they may affect it. The Company assumes no obligation to update any forward looking statements after the date of this press release as a result of new information, future events or developments, except as required by the federal securities laws.\nContacts: For Investors Philip Thomas Long Blockchain Corp. 1-855-542-2832\nSource:Long Blockchain Corp.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/8d9bf334-5562-4dce-90a7-5da4646fa658"], "published": "2018-01-02T16:00:00.000+02:00", "crawled": "2018-01-02T16:30:34.072+02:00", "highlightTitle": ""}