{"organizations": [], "uuid": "67e1fc34b36bb0c32e933e5e1e9b515f74021808", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/10/104938607-GettyImages-849542038.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/10/trump-lawyer-im-suing-buzzfeed-over-dossier-claims.html", "country": "US", "domain_rank": 767, "title": "Trump lawyer: I'm suing BuzzFeed over dossier claims", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T19:36:00.000+02:00", "replies_count": 0, "uuid": "67e1fc34b36bb0c32e933e5e1e9b515f74021808"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/10/trump-lawyer-im-suing-buzzfeed-over-dossier-claims.html", "ord_in_thread": 0, "title": "Trump lawyer: I'm suing BuzzFeed over dossier claims", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "michael cohen", "sentiment": "negative"}, {"name": "cohen", "sentiment": "none"}], "locations": [{"name": "twitter", "sentiment": "none"}], "organizations": [{"name": "congress", "sentiment": "none"}, {"name": "fusion gps", "sentiment": "none"}, {"name": "trump organization could", "sentiment": "none"}, {"name": "bloomberg news", "sentiment": "none"}, {"name": "fbi", "sentiment": "none"}, {"name": "daca bloomberg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Declaring \"enough is enough,\" President Trump's personal attorney Michael Cohen said Tuesday he is suing BuzzFeed for defamation, accusing the popular news site of \"lie-filled\" allegations surrounding presidential aides and Russian agents.\nCohen also said via Twitter that he is suing the private investigative firm Fusion GPS, which compiled a dossier of claims that say, among other things, that Cohen and Trump had ties with shadowy Russian characters. BuzzFeed published the dossier, which was commissioned in 2016 by Trump's opponents.\nNeither lawsuit could be immediately verified as having been filed in federal or state court.\n\"It will be proven that I had no involvement in this Russian collusion conspiracy,\" Cohen said in an interview with Bloomberg News on Tuesday. \"My name was included only because of my proximity to the president.\"\nRead more:\nDossier author was told FBI had a source inside Trump Organization\nCould pork make a comeback? Trump and Congress consider reviving earmarks\nFederal judge temporarily blocks Trump's decision to end DACA\nBloomberg said Cohen provided the complaint and a confirmation email from the court system that he had filed the suit, but it could not immediately be independently confirmed that the suit had been filed.\nTwo influential members of the Senate Judiciary committee have recommended that the Department of Justice open a criminal investigation of Christopher Steele, the former British spy who wrote the explosive dossier.\nSteele's work was commissioned by Fusion GPS, on behalf of the Clinton campaign and the Democratic National Committee. Steele, who is based in London, drew upon a range of sources, including figures linked to Russian intelligence, to compile the dossier.\nIt is based on raw intelligence gathered by Steele on a wide-range of issues involving Trump from allegations of shady financial deals with Russians to salacious allegations from a Trump visit to Moscow.\nCohen claims that the dossier contained \"false and defamatory\" allegations that resulted in \"harm to his personal and professional reputation, current business interests, and the impairment of business opportunities,\" ABC News reported.\nFusion GPS, co-founded by former Wall Street Journal reporter Glenn Simpson, \"recklessly placed [the dossier] beyond their control and allowed it to fall into the hands of media devoted to breaking news on the hottest subject of the day: the Trump candidacy,\" ABC Quote: d from one of the lawsuits.\nABC Quote: d from a New York state complaint, which names BuzzFeed's top editor Ben Smith as well as Ken Bensinger, Miriam Elder and Mark Schoofs. ABC said Cohen claims \"even though Defendant BuzzFeed expressly acknowledged the unverified (and potentially unverifiable) nature of the dossier's allegations, defendant BuzzFeed published the un-redacted dossier and the Article anyway — without attempting to determine the veracity of these reports with Plaintiff himself.\"\nBuzzFeed defended its reporting late Tuesday.\n\"The dossier is, and continues to be, the subject of active investigations by Congress and intelligence agencies. It was presented to two successive presidents, and has been described in detail by news outlets around the world. Its interest to the public is obvious,\" BuzzFeed spokesman Matt Mittenthal said via Twitter. \"We look forward to defending the free press and our First Amendment rights in court.\"\nA lawyer for Fusion GPS could not be reached for comment.\nCohen has forcefully and repeatedly denied any knowledge of any such operation.\n\"I want to be very clear,\" Cohen told ABC News. \"I have never been to Prague or the Czech Republic, and I have never engaged with, been paid by, paid for, or communicated with anyone representing the Russian Federation or anyone else to hack anyone or any organization or disseminate false news reports or interfere in any way with this election.\"", "external_links": ["https://www.usatoday.com/story/news/politics/2018/01/09/could-pork-make-comeback-trump-and-congress-consider-reviving-earmarks/1018877001/", "https://www.usatoday.com/story/news/politics/2018/01/09/federal-judge-blocks-trump-daca/1019530001/", "https://www.usatoday.com/story/news/politics/2018/01/09/dossier-author-told-fbi-had-source-inside-trump-organization/1017938001/"], "published": "2018-01-10T19:36:00.000+02:00", "crawled": "2018-01-10T19:00:47.004+02:00", "highlightTitle": ""}