{"organizations": [], "uuid": "955ce40d2f1e424720746e753db0b5f739d5c9c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180130&t=2&i=1226496550&w=1200&r=LYNXMPEE0T07O", "site_section": "http://feeds.reuters.com/reuters/worldNews/", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-afghanistan-usa-oversight/pentagon-blocks-release-of-key-data-on-afghan-war-watchdog-idUSKBN1FJ0GZ", "country": "US", "domain_rank": 408, "title": "Pentagon blocks release of key data on Afghan war: watchdog", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T07:11:00.000+02:00", "replies_count": 0, "uuid": "955ce40d2f1e424720746e753db0b5f739d5c9c1"}, "author": "", "url": "https://www.reuters.com/article/us-afghanistan-usa-oversight/pentagon-blocks-release-of-key-data-on-afghan-war-watchdog-idUSKBN1FJ0GZ", "ord_in_thread": 0, "title": "Pentagon blocks release of key data on Afghan war: watchdog", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - The Pentagon has restricted the release of critical information on the progress being made in the war in Afghanistan, a move that will limit transparency, the U.S. government’s top watchdog on Afghanistan said on Monday.\nFor years, the Special Inspector General for Afghanistan Reconstruction, or SIGAR, has published a quarterly report that includes unclassified data on the amount of territory controlled or influenced by the Taliban and the government.\nIn a report published late on Monday, SIGAR said, however, it was told not to release that information. The military also classified, for the first time since 2009, the actual and authorized total troop numbers and attrition rate for the Afghan National Defense and Security Forces, or ANDSF.\n“The implication is that I think the average American who reads our reports or reads your press accounts of it, has no meaningful ability to analyze how his money or her money is being spent on Afghanistan,” John Sopko, who leads the independent watchdog office, told Reuters in an interview.\nThe Pentagon sought to deflect blame for the decision, the latest move to limit the amount of publicly available information about the 16-year-old war in Afghanistan - America’s longest.\nIt said in a statement that the Department of Defense did not tell SIGAR to withhold the data, but rather it was the NATO-led Resolute Support coalition that made the determination.\nIt added that the Pentagon did not have the authority to overrule the classification made by Resolute Support, which is led by U.S. General John Nicholson.\n“The Department continues to work with SIGAR, U.S. Forces-Afghanistan, and NATO Resolute Support to resolve concerns about restrictions on information that was previously unclassified,” Lieutenant Colonel Michael Andrews said.\nFormer officials and experts said that regardless of who restricted the information, it was particularly worrying because Afghan and U.S. officials had publicly set a benchmark it would now be difficult to measure.\nThe top U.S. general in Afghanistan set a goal in November of driving back Taliban insurgents enough to control at least 80 percent of the country within two years.\nIn its most recent report, SIGAR said that 43 percent of Afghanistan’s districts were either under Taliban control or being contested.\nSopko said people would to jump to the conclusion that information was being withheld because progress was not being made, which may not be the case.\nA similar accusation was made during the Vietnam War, which later proved true.\n“In essence, you can ask me almost any question and I will have to say, it is classified or non-releasable, I mean you go down the list, it is just amazing,” Sopko said.\nHe added that the Department of Defense did not give him any reasons for the move.\nRECENT ATTACKS The move by the Pentagon comes amid a spate of violence in Afghanistan over the past nine days that is putting a new, more aggressive strategy under the spotlight.\nAn ambulance bomb in the city center killed more than 100 people, just over a week after an attack on the Hotel Intercontinental, also in Kabul, killed more than 20, including four U.S. citizens.\nPresident Donald Trump has committed an additional 3,000 U.S. troops to Afghanistan in recent weeks, bringing the total number of American troops in Afghanistan to about 14,000.\nMichael Kugelman, with the Woodrow Wilson Center, said it made little sense to block the information.\n“It’s not fair to the American people, to American troops and I would think it’s pretty hard to justify doing something like this,” Kugelman said.\nIt is not the first time data has been withheld on the Afghan war.\nLast year, U.S. forces in Afghanistan restricted the amount of data it provided on the ANDSF, including casualties, personnel strength and attrition rates - data that has now been completely withheld.\nThe U.S. military said at the time the data belonged to the Afghan government, which did not want it released.\nA former U.S. official, speaking on condition of anonymity, said there was pressure on the U.S. military to achieve success that could create a risk about not being fully open with the facts.\n“We’re going in a direction of hiding facts and shading and shaping facts in reaction to a lot of pressure to show fast results,” the former official said.\nReporting by Idrees Ali; Editing by Mary Milliken and Peter Cooney\n ", "external_links": [], "published": "2018-01-30T07:11:00.000+02:00", "crawled": "2018-01-30T07:23:08.011+02:00", "highlightTitle": ""}