{"organizations": [], "uuid": "204bf07f524f47a90ab86d6ef321eda1b3b46637", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180108.html", "section_title": "Archive News &amp; Video for Monday, 08 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-dollar-index-hits-one-week-high-as-euro-falters-idUSL8N1P34HG", "country": "US", "domain_rank": 408, "title": "FOREX-Dollar index hits one-week high as euro falters", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.021, "site_type": "news", "published": "2018-01-09T00:28:00.000+02:00", "replies_count": 0, "uuid": "204bf07f524f47a90ab86d6ef321eda1b3b46637"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-dollar-index-hits-one-week-high-as-euro-falters-idUSL8N1P34HG", "ord_in_thread": 0, "title": "FOREX-Dollar index hits one-week high as euro falters", "locations": [], "entities": {"persons": [{"name": "brad bechtel", "sentiment": "none"}, {"name": "saqib iqbal ahmed", "sentiment": "none"}], "locations": [{"name": "south korea", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "jefferies", "sentiment": "none"}, {"name": "european central bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "bechtel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Euro falls as investors take profits\n* Bitcoin drops as South Korea reviews accounts (Updates prices and market activity to U.S. market open; new byline, changes dateline; previous LONDON)\nBy Saqib Iqbal Ahmed\nNEW YORK, Jan 8 (Reuters) - The dollar hit a more than one-week high against a basket of other major currencies on Monday, helped by a pullback in the euro as investors took profits after the common currency’s recent rally.\nThe dollar index, which measures the greenback against six rival currencies, was up 0.37 percent at 92.287.\nThe euro slipped 0.47 percent to $1.1972. It had hit a nearly four-month high of $1.2089 on Thursday.\n“The euro got a little bit over its skies when it traded over $1.20,” said Brad Bechtel, managing director FX at Jefferies in New York.\n“The market is very stretched on the position,” Bechtel said. “It’s a little bit of profit-taking and some healthy correction going on the euro’s side, which is driving some of the dollar trades.”\nThe euro, which has rallied in recent weeks on expectations for a shift in European Central Bank monetary policy this year, suffered a little after a cooler-than-expected reading of the euro zone’s December consumer price index on Friday.\nLackluster inflation pressure in Europe has been accompanied by a strengthening economic recovery across the continent and solid economic growth in China and the United States, fueling risk appetite.\nThe dollar index, which fell to a more than three-month low early last week, has found some support after generally solid U.S. economic data last week.\nThe dollar has too many tailwinds for a meaningful correction, said Bechtel, who cited a tightening Federal Reserve, tax-driven dollar repatriation flows and strength in the U.S. economy.\nSterling was little changed against the dollar. While investors eyed a reshuffling of Britain’s cabinet, most said that barring any major surprises, the changes would be unlikely to move the pound significantly.\nThe Canadian dollar weakened against its U.S. counterpart, pulling back from Friday’s three-month high following a Bank of Canada business outlook report.\nCanadian companies remain optimistic about future sales despite some moderation from highs, and signs of capacity pressures and labor shortages have picked up, the Bank of Canada said on Monday.\nBitcoin briefly fell below $14,000 after South Korea’s financial regulator said it and other agencies were inspecting six local banks that offer digital currency accounts to institutions.\nBitcoin, the world’s biggest virtual currency by market value, was down 10.01 percent at $14,510.1 on the Luxembourg-based Bitstamp exchange after dropping to $13,900. (Reporting by Saqib Iqbal Ahmed; Editing by Lisa Von Ahn)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-09T00:28:00.000+02:00", "crawled": "2018-01-09T16:59:42.104+02:00", "highlightTitle": ""}