{"organizations": [], "uuid": "031b6db326e057d0b449d32e16180e221f365235", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-blockchain-market-projected-to-show-strong-growth.html", "country": "US", "domain_rank": 767, "title": "Blockchain Market Projected to Show Strong Growth", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-24T17:00:00.000+02:00", "replies_count": 0, "uuid": "031b6db326e057d0b449d32e16180e221f365235"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-blockchain-market-projected-to-show-strong-growth.html", "ord_in_thread": 0, "title": "Blockchain Market Projected to Show Strong Growth", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "tapinator", "sentiment": "none"}], "organizations": [{"name": "global arena holding, inc.", "sentiment": "none"}, {"name": "gahc", "sentiment": "none"}, {"name": "accenture plc", "sentiment": "none"}, {"name": "microsoft", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "netscribes inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, January 24, 2018 /PRNewswire/ --\nIncreasing interests in the blockchain technology continues to drive the cryptocurrency and blockchain market. According to a recent report from Netscribes Inc., the global blockchain technology market is expected to grow at a compound annual growth rate (CAGR) of 42.8%, to reach USD 13.96 billion by 2022. Blockchain technology is being increasingly used in the financial sector. More Companies start to offer blockchain applications in secure payments, maintain customer identities, settle cross-border payments, etc. Blockchain technology is also employed in the healthcare sector, supply chain management, energy, media, informatics, etc. SinglePoint, Inc. (OTC: SING), Global Arena Holding, Inc. (OTC: GAHC), AppSwarm, Inc. (OTC: SWRM), Tapinator, Inc. (OTC: TAPM)\nThe number of companies that are interested in the blockchain technology increased rapidly in the recent years. According to Reuters, the tech giant Microsoft Crop and Accenture Plc recently announced partnership to build a digital ID network using blockchain technology during the second summit of ID2020. Dakota Gruener, executive director at ID2020, said in an interview, \"What ID2020 is truly focused on is bringing together an alliance of stakeholders to ensure the technology that is being developed is responsive to the needs of individuals.\"\nSinglePoint, Inc. (OTC: SING) yesterday announced, \"a letter of intent (\"LOI\") to acquire 100% of Bitcoin Beyond, a premier platform that enables retail merchants to accept bitcoin payments using their existing web-enabled point-of-sale device. This acquisition, priced at $1 million all stock, is expected to provide SinglePoint with a full end-to-end purchasing experience that provides merchants and bitcoin users unprecedented capabilities.\nBitcoin Beyond was created to address growing demand for fast and reliable electronic payment processing for the cannabis industry. As the industry exists today, many merchants face extensive physical cash management issues that require expensive and risky on-site safes, armed guards, armored cars, and physical cash transfers. Bitcoin Beyond stands to overcome these challenges, functioning as a general-purpose point-of-sale system that processes dollar-denominated payments using bitcoin. It can be operated from any web-enabled terminal available at checkout, from a cell phone to a tablet, to a full PC.\n\"We are thrilled with this opportunity. Acquiring Bitcoin Beyond put us ahead of what we believe merchants have access to now. This platform has by far the easiest user interface we have seen in the market, and we are confident merchants will be quick to adopt this solution as it stands as the sole alternative to traditional options offered to the cannabis industry,\" states SinglePoint President Wil Ralston.\nThe Bitcoin Beyond System was designed using 14 years of expertise in creating payment processing and online wallet solutions. It is built on a widely used technology stack, with security best practices and private merchant data is stored encrypted at rest. Because of this industry-leading technology, Bitcoin Beyond can be easily used and integrated with existing frameworks to add a simple means of payment with bitcoin, as well as other cryptocurrencies, such as Weed Coin, in the future. SinglePoint has an early investment in Weed Coin which has currently increased 8x in value.\nBitcoin Beyond furthers SinglePoints' Bitcoin payments solution which the company recently signed Kevin Harrington to evangelize and consult on. Last week the company started production of the commercial spot and is now in editing and post-production. SinglePoint has engaged a media specialist to start the process of getting the commercial aired on major national news networks to drive consumer sign ups and awareness for the service.\nSinglePoint has plans to acquire additional companies in the space and again broaden its footprint in the quickly emerging blockchain space. The company is currently in negotiations to acquire another blockchain centric company in an effort to deploy its technology to major established markets.\"\nGlobal Arena Holding, Inc. (OTC: GAHC) is a holding and technology development company. The company is focused on acquiring technologies, patents and companies having the ability to leverage the blockchain crypto technology. GAHC incorporated GAHI Acquisition Corp. to be the merger subsidiary for the acquisition of Blockchain Technologies Corporation (\"BTC\"). Currently, GAHC and BTC have entered into an acquisition arrangement where BTC will merge with GAHI Acquisition Corp. BTC is a technology company which leverages the underlying crypto technology of Bitcoin [Blockchain], acting as a seed accelerator. BTC currently features a number of innovative startups utilizing the Blockchain and operating within the crypto technology field.\nAppSwarm, Inc. (OTC: SWRM) announced earlier this month the beta launch of its new Bitcoin tracking app 'BitChart'. BitChart is an interactive way to visualize the bitcoin price index through your smartphone. Ron Brewer, CEO of AppSwarm, Inc. commented, \"We are very excited about the beta launch of our new BitChart app, and think going forward we have the potential to build a unique investors hub for crypto investors, while also helping bring some additional transparency to this rapidly growing market. Through our years of mobile development of games and different business applications, we look forward to adding a number of new features to our BitChart app through the rest of 2018, and will be providing updates on this in the very near future.\"\nTapinator, Inc. (OTCQB: TAPM) announced earlier this month that it is sponsoring and will speak on a panel at leading blockchain conference, ETH Denver on February 17th. The panel will focus on the intersection of blockchain & gaming and the Company will announce it first blockchain product, which will be released by Tapinator's subsidiary, Revolution Blockchain , in Q2 of this year. \"We are very excited to attend and present at one of the industry's top blockchain conferences. We believe that gaming is one of the most exciting verticals for blockchain technology and we look forward to sharing more information about our first product on February 17th,\" commented Ilya Nikolayev, CEO of Tapinator.\nSubscribe Now! Watch us report from LIVE https://www.youtube.com/FinancialBuzzMedia\nFollow us on Twitter for real time Financial News Updates: https://twitter.com/financialbuzz\nFollow and talk to us on Instagram: https://www.instagram.com/financialbuzz\nFacebook Like Us to receive live feeds: https://www.facebook.com/Financialbuzz/\nAbout FinancialBuzz.com\nFinancialBuzz.com , a leading financial news informational web portal designed to provide the latest trends in Market News, Investing News, Personal Finance, Politics, Entertainment, in-depth broadcasts on Stock News, Market Analysis and Company Interviews. A pioneer in the financially driven digital space, video production and integration of social media, FinancialBuzz.com creates 100% unique original content. FinancialBuzz.com also provides financial news PR dissemination, branding, marketing and advertising for third parties for corporate news and original content through our unique media platform that includes Newswire Delivery, Digital Advertising, Social Media Relations, Video Production, Broadcasting, and Financial Publications.\nPlease Note: FinancialBuzz.com is not a financial advisory or advisor, investment advisor or broker-dealer and do not undertake any activities that would require such registration. The information provided on http://www.FinancialBuzz.com (the 'Site') is either original financial news or paid advertisements provided [exclusively] by our affiliates (sponsored content), FinancialBuzz.com , a financial news media and marketing firm enters into media buys or service agreements with the companies which are the subject to the articles posted on the Site or other editorials for advertising such companies. We are not an independent news media provider and therefore do not represent or warrant that the information posted on the Site is accurate, unbiased or complete. FinancialBuzz.com receives fees for producing and presenting high quality and sophisticated content on FinancialBuzz.com along with other financial news PR media services. FinancialBuzz.com does not offer any personal opinions, recommendations or bias commentary as we purely incorporate public market information along with financial and corporate news. FinancialBuzz.com only aggregates or regurgitates financial or corporate news through our unique financial newswire and media platform. For singlepoint inc. financial news dissemination and PR services, FinancialBuzz.com has been compensated five thousand dollars for financial news dissemination and PR services by the company. Our fees may be either a flat cash sum or negotiated number of securities of the companies featured on this editorial or site, or a combination thereof. The securities are commonly paid in segments, of which a portion is received upon engagement and the balance is paid on or near the conclusion of the engagement. FinancialBuzz.com will always disclose any compensation in securities or cash payments for financial news PR advertising. FinancialBuzz.com does not undertake to update any of the information on the editorial or Site or continue to post information about any companies the information contained herein is not intended to be used as the basis for investment decisions and should not be considered as investment advice or a recommendation. The information contained herein is not an offer or solicitation to buy, hold or sell any security. FinancialBuzz.com , members and affiliates are not responsible for any gains or losses that result from the opinions expressed on this editorial or Site, company profiles, quotations or in other materials or presentations that it publishes electronically or in print. Investors accept full responsibility for any and all of their investment decisions based on their own independent research and evaluation of their own investment goals, risk tolerance, and financial condition. FinancialBuzz.com . By accessing this editorial and website and any pages thereof, you agree to be bound by the Terms of Use and Privacy Policy, as may be amended from time to time. None of the content issued by FinancialBuzz.com constitutes a recommendation for any investor to purchase, hold or sell any particular security, pursue a particular investment strategy or that any security is suitable for any investor. This publication is provided by FinancialBuzz.com . Each investor is solely responsible for determining whether a particular security or investment strategy is suitable based on their objectives, other securities holdings, financial situation needs, and tax status. You agree to consult with your investment advisor, tax and legal consultant before making any investment decisions. We make no representations as to the completeness, accuracy or timeless of the material provided. All materials are subject to change without notice. Information is obtained from sources believed to be reliable, but its accuracy and completeness are not guaranteed. For our full disclaimer, disclosure and Terms of Use, please visit: http://www.financialbuzz.com .\nFor further information:\ninfo@financialbuzz.com\n+1-877-601-1879\nUrl: http://www.FinancialBuzz.com\nSOURCE FinancialBuzz.com", "external_links": ["https://www.facebook.com/Financialbuzz/", "https://ethdenver.com/", "https://www.instagram.com/financialbuzz", "https://www.youtube.com/FinancialBuzzMedia", "http://www.revolutionblockchain.com/", "https://twitter.com/financialbuzz"], "published": "2018-01-24T17:00:00.000+02:00", "crawled": "2018-01-24T16:54:04.002+02:00", "highlightTitle": ""}