{"organizations": [], "uuid": "544af32fbf06d5b535c6fd869f2858b923e7f47b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180106&t=2&i=1219858145&w=1200&r=LYNXMPEE050EX", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-mci-bur/aguero-double-keeps-citys-quadruple-hopes-alive-idUKKBN1EV0KN", "country": "US", "domain_rank": 408, "title": "Aguero double keeps City's quadruple hopes alive", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-06T18:58:00.000+02:00", "replies_count": 0, "uuid": "544af32fbf06d5b535c6fd869f2858b923e7f47b"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-mci-bur/aguero-double-keeps-citys-quadruple-hopes-alive-idUKKBN1EV0KN", "ord_in_thread": 0, "title": "Aguero double keeps City's quadruple hopes alive", "locations": [], "entities": {"persons": [{"name": "aguero", "sentiment": "negative"}, {"name": "john stones", "sentiment": "none"}, {"name": "sergio aguero", "sentiment": "none"}, {"name": "ashley barnes", "sentiment": "none"}, {"name": "bernardo silva", "sentiment": "none"}, {"name": "leroy sane", "sentiment": "none"}, {"name": "sean dyche", "sentiment": "none"}, {"name": "pep guardiola", "sentiment": "none"}, {"name": "simon evans", "sentiment": "none"}, {"name": "nick pope", "sentiment": "none"}], "locations": [{"name": "manchester", "sentiment": "none"}, {"name": "etihad stadium", "sentiment": "none"}, {"name": "manchester city", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "city", "sentiment": "negative"}, {"name": "champions league", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}, {"name": "burnley", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 6, 2018 / 5:01 PM / Updated 18 minutes ago Aguero double keeps Man City quadruple hopes alive Simon Evans 3 Min Read \nMANCHESTER, England (Reuters) - Manchester City kept alive their chances of winning four trophies this season, coming back from a goal down to beat Burnley 4-1 in the FA Cup third round on Saturday with two goals from Sergio Aguero. Soccer Football - FA Cup Third Round - Manchester City vs Burnley - Etihad Stadium, Manchester, Britain - January 6, 2018 Manchester City's Sergio Aguero scores their second goal as Burnley's Nick Pope attempts to save REUTERS/Phil Noble \nThe runaway Premier League leaders, who are also in the last 16 of the Champions League and the English League Cup semi-finals, fielded a strong side but struggled initially to impose their will on Sean Dyche’s side. \nThey ran away with the game in the second half, however, showing the attacking flair that makes talk of a quadruple more than mere speculation. \nBurnley, seventh in the Premier League, grabbed a 25th- minute lead when City defender John Stones mis-kicked a Sam Vokes knockdown and Ashley Barnes and the striker burst goalwards before blasting the ball past Claudio Bravo. \nDisciplined defending from the Clarets frustrated City who were able to create little in the first half but a lapse in concentration 11 minutes after the break allowed Pep Guardiola’s side back into the game. \nIlkay Gundogan took a quick free kick to Aguero, catching the Burnley defence off-guard and the Argentine gleefully fired past Nick Pope. Soccer Football - FA Cup Third Round - Manchester City vs Burnley - Etihad Stadium, Manchester, Britain - January 6, 2018 Manchester City's Sergio Aguero celebrates scoring their second goal REUTERS/Phil Noble \nTwo minutes later and the same combination put City ahead when Aguero played a neat one-two with the German, collecting his clever back-heel and rounding Pope before slotting into the empty net. \n“Both of Sergio Aguero’s goals were amazing, there were clever and quick and I am happy with both of his goals,” Guardiola told reporters. Slideshow (4 Images) \n“It’s an honour for me to have Aguero under my command. The quality he has is amazing and we need him to score a lot of goals. Aguero is the kind of player that in a matter of seconds can score two goals. He is an essential player for us,” added the Spaniard. \nThe gulf in quality became increasingly evident and Leroy Sane made it 3-1 in the 71st minute, collecting a David Silva through ball, evading Ben Mee and driving into the bottom corner. \nGuardiola brought on Kevin De Bruyne and he created the fourth goal with a sweeping pass out wide towards Sane which prompted Pope to race out of his area. Fatally, the Burnley keeper hesitated, allowing Sane to waltz past him and set up Bernardo Silva for a simple finish. \n“It is about that constant concentration and focus,” said Dyche, reflecting on the two goals in two minutes and what his team need to learn. \n“You can’t let teams score again so quickly, it’s about sticking in there and keeping that focus”. Reporting by Simon Evans,; Editing by Ed Osmond", "external_links": [], "published": "2018-01-06T18:58:00.000+02:00", "crawled": "2018-01-06T19:16:33.002+02:00", "highlightTitle": ""}