{"organizations": [], "uuid": "9f95ade313c7510dbb7325bd800a38859b8e1f61", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/27/pr-newswire-shareholder-alert-pomerantz-law-firm-reminds-shareholders-with-losses-on-their-investment-in-ekso-bionics-holdings-inc-of.html", "country": "US", "domain_rank": 767, "title": "SHAREHOLDER ALERT: Pomerantz Law Firm Reminds Shareholders with Losses on their Investment in Ekso Bionics Holdings, Inc. of Class Action Lawsuit and Upcoming Deadline - EKSO", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-27T16:00:00.000+02:00", "replies_count": 0, "uuid": "9f95ade313c7510dbb7325bd800a38859b8e1f61"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/27/pr-newswire-shareholder-alert-pomerantz-law-firm-reminds-shareholders-with-losses-on-their-investment-in-ekso-bionics-holdings-inc-of.html", "ord_in_thread": 0, "title": "SHAREHOLDER ALERT: Pomerantz Law Firm Reminds Shareholders with Losses on their Investment in Ekso Bionics Holdings, Inc. of Class Action Lawsuit and Upcoming Deadline - EKSO", "locations": [], "entities": {"persons": [], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "united states district court", "sentiment": "none"}], "organizations": [{"name": "ekso bionics holdings, inc.", "sentiment": "neutral"}, {"name": "pomerantz llp", "sentiment": "neutral"}, {"name": "northern district of california", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, Jan. 27, 2018 /PRNewswire/ -- Pomerantz LLP announces that a class action lawsuit has been filed against EKSO Bionics Holdings, Inc. (\"Ekso\" or the \"Company\") (NASDAQ: EKSO) and certain of its officers. The class action, filed in United States District Court, for the Northern District of California, and docketed under 18-cv-00212, is on behalf of a class consisting of investors who purchased or otherwise acquired the securities of Ekso between March 15, 2017 and December 27, 2017, both dates inclusive (the \"Class Period\"). Plaintiff seeks to recover compensable damages caused by Defendants' violations of the federal securities laws and to pursue remedies under Sections 10(b) and 20(a) of the Securities Exchange Act of 1934 (the \"Exchange Act\") and Rule 10b-5 promulgated thereunder.\nIf you are a shareholder who purchased Ekso securities between March 15, 2017, and December 27, 2017, both dates inclusive, you have until March 5, 2018, to ask the Court to appoint you as Lead Plaintiff for the class. A copy of the Complaint can be obtained at www.pomerantzlaw.com . To discuss this action, contact Robert S. Willoughby at rswilloughby@pomlaw.com or 888.476.6529 (or 888.4-POMLAW), toll-free, Ext. 9980. Those who inquire by e-mail are encouraged to include their mailing address, telephone number, and quantity of shares purchased.\n[Click here to join this class action]\nEkso Bionics Holdings, Inc. designs, develops, and sells exoskeletons for use in the healthcare, industrial, military, and consumer markets in North America, Europe, the Middle East, and Africa. The Company operates through Medical Devices, Industrial Sales, and Engineering Services segments. It primarily offers Ekso GT, a bionic suit that provides the ability to stand and walk over ground to individuals with spinal cord injuries, hemiplegia, and lower limb paralysis or weakness.\nThe Complaint alleges that throughout the Class Period, Defendants made materially false and misleading statements regarding the Company's business, operational and compliance policies. Specifically, Defendants made false and/or misleading statements and/or failed to disclose that: (i) Ekso had a material weakness in its internal control over financial reporting; (ii) accordingly, Ekso's disclosure controls and procedures were not effective; and (iii) as a result of the foregoing, Ekso's public statements were materially false and misleading at all relevant times.\nOn December 14, 2017, Ekso filed a current report on Form 8-K with the SEC, advising investors that \"the Company's internal control over financial reporting as of December 31, 2016, should no longer be relied upon and that a material weakness in the Company's internal control over financial reporting existed as of such date.\" Specifically, Ekso stated that its announcement was due to a reevaluation of the Company's information technology (\"IT\") controls by OUM & Co. LLP (\"OUM\"), the Company's auditor. Ekso stated that it intended \"to amend our Annual Report on Form 10-K for the fiscal year ended December 31, 2016 and our Quarterly Reports on Form 10-Q for the periods ended March 31, 2017, June 30, 2017 and September 30, 2017 to reflect the conclusion by management that there was a material weakness in internal control over financial reporting and that our disclosure controls and procedures were not effective as of the end of the periods covered by these reports.\" On this news, Ekso's share price fell $0.15, or 6.17%, to close at $2.28 on December 15, 2017.\nOn December 27, 2017, post-market, Ekso filed an amended annual report for 2016 and amended quarterly reports for the first three quarters of 2017 on Form 10-Q. On this news, Ekso's share price fell $0.34, or over 13%, to close at $2.23 on December 28, 2017.\nThe Pomerantz Firm, with offices in New York, Chicago, Los Angeles, and Paris, is acknowledged as one of the premier firms in the areas of corporate, securities, and antitrust class litigation. Founded by the late Abraham L. Pomerantz, known as the dean of the class action bar, the Pomerantz Firm pioneered the field of securities class actions. Today, more than 80 years later, the Pomerantz Firm continues in the tradition he established, fighting for the rights of the victims of securities fraud, breaches of fiduciary duty, and corporate misconduct. The Firm has recovered numerous multimillion-dollar damages awards on behalf of class members. See www.pomerantzlaw.com .\nCONTACT:\nRobert S. Willoughby\nPomerantz LLP\nrswilloughby@pomlaw.com\n888.476.6529 Ext. 9980\nView original content: http://www.prnewswire.com/news-releases/shareholder-alert-pomerantz-law-firm-reminds-shareholders-with-losses-on-their-investment-in-ekso-bionics-holdings-inc-of-class-action-lawsuit-and-upcoming-deadline--ekso-300588954.html\nSOURCE Pomerantz LLP", "external_links": ["http://www.pomerantzlaw.com/", "https://form.jotformpro.com/pomerantzllp2/ekso", "http://www.prnewswire.com/news-releases/shareholder-alert-pomerantz-law-firm-reminds-shareholders-with-losses-on-their-investment-in-ekso-bionics-holdings-inc-of-class-action-lawsuit-and-upcoming-deadline--ekso-300588954.html"], "published": "2018-01-27T16:00:00.000+02:00", "crawled": "2018-01-27T20:13:35.000+02:00", "highlightTitle": ""}