{"organizations": [], "uuid": "bd0ff212ddb4ab44011df37f58bf60ea73f64b76", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/finance/markets", "section_title": "Markets &amp; Finance News | Reuters.com", "url": "https://www.reuters.com/article/global-forex/forex-euro-hits-four-month-high-as-dollar-begins-year-on-back-foot-idUSL8N1OX13D", "country": "US", "domain_rank": 408, "title": "FOREX-Euro hits four-month high as dollar begins year on back foot", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.984, "site_type": "news", "published": "2018-01-02T20:39:00.000+02:00", "replies_count": 0, "uuid": "bd0ff212ddb4ab44011df37f58bf60ea73f64b76"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/global-forex/forex-euro-hits-four-month-high-as-dollar-begins-year-on-back-foot-idUSL8N1OX13D", "ord_in_thread": 0, "title": "FOREX-Euro hits four-month high as dollar begins year on back foot", "locations": [], "entities": {"persons": [{"name": "tommy wilkes", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "european central bank", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Euro’s 2-1/2 peak against dollar within sights\n* Commodity currencies rally again\n* MiFID II introduction weighs on volumes\n* Graphic: World FX rates in 2017 tmsnrt.rs/2egbfVh (Adds details, Quote: )\nBy Tommy Wilkes\nLONDON, Jan 2 (Reuters) - The euro traded close to its highest level in three years against a broadly weaker dollar on Tuesday, the first trading day of 2018, on optimism over a brightening economic picture in the euro zone.\nIt finished 2017 with its best year against the dollar since 2003 as European economies strengthened and expectations the European Central Bank will wind down its monetary stimulus grew, boosting demand for the single currency.\nThe euro started the year by adding to those gains, and climbing as much as 0.6 percent to a four-month high of $1.2081, within sights of the $1.2092 it hit in September, the highest since early 2015.\nThe single currency was also higher against the Japanese yen at 135.64, reaching levels not seen since late 2015.\nEuro zone manufacturers ended 2017 by ramping up activity at the fastest pace in more than two decades, a survey showed on Tuesday, and rising demand suggests they will start the new year on a high.\n“It’s a combination of dollar weakness and euro strength. The euro strength is underpinned by some hawkish comments from the ECB’s Coeure,” said Commerzbank currency strategist Thu Lan Nguyen in Frankfurt, referring to comments made by the European Central Bank’s Benoit Coeure\nCoeure said on the weekend he saw a “reasonable chance” the bank’s bond purchases would not be extended beyond September.\nNguyen said the euro was approaching levels where the ECB might start to signal some discomfort with its rise.\nThe euro gained as the dollar was broadly weak. The dollar’s index against a basket of six major currencies slipped to 91.75, its weakest level since September.\nFor the whole of 2017, the dollar index slid more than 9.8 percent, the greenback’s worst annual performance since 2003.\nAlvin Tan, an FX strategist at Societe Generale in London, said the end of a dollar funding squeeze typical of December and a rally in commodity prices, had reduced demand for dollars since the holiday season, but that the euro was also gaining because of the better economic performance of its member states.\n“Fundamentally, what is helping the euro is the brightening economic outlook in the euro area. The momentum should continue,” he said.\nTan said Societe Generale forecasts the euro will strengthen to $1.25 by the middle of the year.\nSome foreign exchange strategists said traders were wary of taking on big positions ahead of the introduction on Wednesday of the wide-ranging EU financial markets directive known as MiFID II, which is aimed at making European markets more transparent and providing better value for investors.\nFor Reuters Live Markets blog on European and UK stock markets see reuters://realtime/verb=Open/url=http://emea1.apps.cp.extranet.thomsonreuters.biz/cms/?pageId=livemarkets (Additional reporting by Jemima Kelly; Editing by Catherine Evans)\n ", "external_links": ["http://emea1.apps.cp.extranet.thomsonreuters.biz/cms/?pageId=livemarkets", "http://tmsnrt.rs/2egbfVh", "http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-02T20:39:00.000+02:00", "crawled": "2018-01-03T06:36:56.007+02:00", "highlightTitle": ""}