{"organizations": [], "uuid": "76e5c3debcaa86e85b16d5c7f3fd71f6fd066fd6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180108&t=2&i=1220330004&w=1200&r=LYNXMPEE0719D", "site_section": "http://feeds.reuters.com/reuters/INbusinessNews", "section_title": "Reuters: Money News", "url": "https://in.reuters.com/article/wto-energy-india-usa/india-rejects-u-s-solar-claim-at-wto-explores-new-defence-idINKBN1EX20S", "country": "US", "domain_rank": 408, "title": "India rejects U.S. solar claim at WTO, explores new defence", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T20:22:00.000+02:00", "replies_count": 0, "uuid": "76e5c3debcaa86e85b16d5c7f3fd71f6fd066fd6"}, "author": "", "url": "https://in.reuters.com/article/wto-energy-india-usa/india-rejects-u-s-solar-claim-at-wto-explores-new-defence-idINKBN1EX20S", "ord_in_thread": 0, "title": "India rejects U.S. solar claim at WTO, explores new defence", "locations": [], "entities": {"persons": [{"name": "tom miles", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "gujarat", "sentiment": "none"}, {"name": "patan", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "charanka", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "wto", "sentiment": "negative"}, {"name": "min read  geneva", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "world trade organization", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "GENEVA (Reuters) - India hit back on Monday at Washington’s latest legal assault on its solar power policies at the World Trade Organization, rejecting a U.S. legal claim and exploring possible new protection of India’s own solar industry.\nWorkers install photovoltaic solar panels at the Gujarat solar park under construction in Charanka village in Patan district of Gujarat, April 14, 2012. REUTERS/Amit Dave/Files Last month the United States triggered a new round of litigation at the WTO, arguing that India had failed to abide by a ruling that it had illegally discriminated against foreign suppliers of solar cells and modules.\nIn a statement published by the WTO on Monday, India said it had changed its rules to conform with the ruling and that a U.S. claim for punitive trade sanctions was groundless.\n“India underscores that the United States’ request is not a valid request,” the Indian statement said.\nIt said Washington had skipped legal steps, failed to follow the correct WTO procedure, and omitted to mention any specific level of trade sanctions that it proposed to level on India, leaving India “severely prejudiced”.\nIndia would be vindicated if the proper process was followed, it said.\n“In view of the above, India strongly objects to the U.S. request of 19 December 2017,” it said.\nRenewable energy has become an area of severe trade friction as major economies compete to dominate a sector that is expected to thrive as reliance on coal and oil dwindles.\nIndia unveiled its national solar programme in 2011, seeking to ease chronic energy shortages in Asia’s third-largest economy without creating pollution.\nBut the United States complained to the WTO in 2013, saying U.S. solar exports to India had fallen by 90 percent. The WTO judges agreed that India had broken the trade rules by requiring solar power developers to use Indian-made cells and modules.\nIn a separate move that could protect its solar industry from global competitors, not only U.S. rivals, India told the WTO last week that it was considering the case for imposing temporary emergency tariffs on solar cells, modules and panels, after a petition from the domestic industry.\nSo-called safeguard tariffs are permitted by the WTO if there is evidence of serious harm, or threat of serious harm, to a country’s production from a sudden, unforeseen surge in imports.\nIndia said the market share of imports had increased from 86 percent in 2014-15 to 90 percent in 2017-18, with growing losses for Indian producers and a fourfold rise in inventory levels.\nThat amounted to prima facie evidence of serious injury to Indian firms, India said in the WTO filing.\nReporting by Tom Miles\n ", "external_links": [], "published": "2018-01-08T20:22:00.000+02:00", "crawled": "2018-01-08T20:45:53.018+02:00", "highlightTitle": ""}