{"organizations": [], "uuid": "3fcf38de8b24113ea8dc4c7e1c4ee1bbd4001def", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-melinta-therapeutics-appoints-lisa-defrancesco-as-senior-vice-president-of-investor-relations.html", "country": "US", "domain_rank": 767, "title": "Melinta Therapeutics Appoints Lisa DeFrancesco as Senior Vice President of Investor Relations", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.133, "site_type": "news", "published": "2018-01-02T15:00:00.000+02:00", "replies_count": 0, "uuid": "3fcf38de8b24113ea8dc4c7e1c4ee1bbd4001def"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/02/globe-newswire-melinta-therapeutics-appoints-lisa-defrancesco-as-senior-vice-president-of-investor-relations.html", "ord_in_thread": 0, "title": "Melinta Therapeutics Appoints Lisa DeFrancesco as Senior Vice President of Investor Relations", "locations": [], "entities": {"persons": [{"name": "lisa defrancesco", "sentiment": "negative"}, {"name": "dan wechsler", "sentiment": "none"}, {"name": "defrancesco", "sentiment": "none"}, {"name": "melinta", "sentiment": "none"}, {"name": "lisa", "sentiment": "none"}], "locations": [{"name": "conn.", "sentiment": "none"}, {"name": "melinta", "sentiment": "none"}], "organizations": [{"name": "melinta therapeutics", "sentiment": "negative"}, {"name": "melinta therapeutics, inc.", "sentiment": "neutral"}, {"name": "allergan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "NEW HAVEN, Conn., Jan. 02, 2018 (GLOBE NEWSWIRE) -- Melinta Therapeutics, Inc. (NASDAQ:MLNT), a commercial-stage company discovering, developing, and commercializing novel antibiotics to treat serious bacterial infections, today announced the appointment of Lisa DeFrancesco as senior vice president of investor relations (IR) reporting to Dan Wechsler, president and chief executive officer.\nDeFrancesco is a seasoned healthcare industry executive, with 18 years of experience in investor relations, finance and communications. She joins Melinta from Allergan where she served most recently as vice president of IR.\n“We are thrilled to have Lisa join our expanding executive leadership team as Melinta continues to grow and evolve as a world-leading antibiotics company,” stated Dan Wechsler, president and chief executive officer. “Her deep experience integrating IR, corporate finance, sell-side equity research, communications and proven track record in investor relations, will help us to capitalize on the many opportunities that lie ahead as we build a bigger, better Melinta, focused on delivering value to all of our stakeholders.”\nDeFrancesco’s appointment follows the planned departure of John Bluth, executive vice president of investor relations and corporate communications, who left Melinta at the end of December.\n“John has served as the head of investor relations for both Cempra and Melinta over multiple years and has been indispensable during the integration of the two companies’ assets,” stated Mr. Wechsler. “The management team, board of directors and I would like to thank John for his dedication to his roles at Cempra and its merger with Melinta, and wish him well in his next endeavor.”\nAbout Melinta Therapeutics\nMelinta Therapeutics, Inc. is dedicated to saving lives threatened by the global public health crisis of bacterial infections, through the development and commercialization of novel antibiotics that provide new and better therapeutic solutions. Melinta’s lead product is Baxdela, an antibiotic approved by the U.S. FDA for use in the treatment of acute bacterial skin and skin structure infections (ABSSSI). Melinta also has an extensive pipeline of preclinical and clinical stage products representing many important classes of antibiotics, each targeted at a different segment of the anti-infective market. Together, this pipeline provides Melinta with the unique ability to provide providers and patients with a range of solutions that can meet the tremendous need for novel antibiotics treating serious infections. Visit www.melinta.com for more information.\nCautionary Note Regarding Forward-Looking Statements\nCertain statements in this communication constitute “ ” within the meaning of Section 27A of the Securities Act and Section 21E of the Securities Exchange Act and are usually identified by the use of words such as “anticipates,” “believes,” “estimates,” “expects,” “intends,” “may,” “plans,” “projects,” “seeks,” “should,” “will,” and variations of such words or similar expressions. We intend these to be covered by the safe harbor provisions for contained in Section 27A of the Securities Act and Section 21E of the Securities Exchange Act and are making this statement for purposes of complying with those safe harbor provisions. These reflect our current views about our plans, intentions, expectations, strategies and prospects, which are based on the information currently available to us and on assumptions we have made. Although we believe that our plans, intentions, expectations, strategies and prospects as reflected in or suggested by those are reasonable, we can give no assurance that the plans, intentions, expectations or strategies will be attained or achieved. Furthermore, actual results may differ materially from those described in the and will be affected by a variety of risks and factors that are beyond our control.\nRisks and uncertainties for Melinta include, but are not limited to: inability to complete its proposed transactions, acquiring the capital stock of certain subsidiaries of The Medicines Company and certain other assets related to The Medicines Company’s infectious disease business unit; liquidity and trading market for shares prior to and following the consummation of the proposed transactions; costs and potential litigation associated with the proposed transactions; failure or delay in obtaining required approvals by governmental or quasi-governmental entity necessary to consummate the proposed transactions; failure to satisfy other conditions to the closing of the proposed transactions; risks related to the costs, timing and regulatory review of the Company’s studies and clinical trials, including its ability to address the issues identified by the FDA in the complete response letter relating to Melinta’s new drug applications for solithromycin for community acquired bacterial pneumonia; uncertainties in obtaining successful clinical results for product candidates and unexpected costs that may result therefrom; inability or the delay in obtaining required regulatory approvals for product candidates, which may result in unexpected cost expenditures; failure to realize any value of certain product candidates developed and being developed, in light of inherent risks and difficulties involved in successfully bringing product candidates to market; inability to develop new product candidates and support existing products; inability to commercialize and launch any product candidate that receives regulatory approval, including Baxdela; the Company’s anticipated capital expenditures, its estimates regarding its capital requirements and its need for future capital; uncertainties of cash flows and inability to meet working capital needs; cost reductions that may not result in anticipated level of cost savings or cost reductions prior to or after the consummation of the proposed transactions; the approval by the FDA and EMA and any other similar foreign regulatory authorities of other competing or superior products brought to market; risks resulting from unforeseen side effects; risk that the market for the Company’s products may not be as large as expected; inability to obtain, maintain and enforce patents and other intellectual property rights or the unexpected costs associated with such enforcement or litigation; inability to obtain and maintain commercial manufacturing arrangements with third party manufacturers or establish commercial scale manufacturing capabilities; loss of or diminished demand from one or more key customers or distributors; unexpected cost increases and pricing pressures; the possibility of economic recession and its negative impact on customers, vendors or suppliers; and risks associated with the possible failure to realize certain benefits of the proposed transactions, including future financial, tax, accounting treatment, and operating results. Many of these factors that will determine actual results are beyond Melinta’s ability to control or predict.\nOther risks and uncertainties are more fully described in our Annual Report on Form 10-K for the year ended December 31, 2016, as amen", "external_links": ["https://www.globenewswire.com/Tracker?data=GseB_v0A8bcRRkOhfhisPkJY4aetUpnA_e5TMxK4U9zX0mbvK-_s2KSbPcjiAcvURCjdoEPOa1tJahaKmVke4Q==", "https://www.globenewswire.com/NewsRoom/AttachmentNg/75a520e1-5630-40c2-b392-52128192f827"], "published": "2018-01-02T15:00:00.000+02:00", "crawled": "2018-01-02T16:56:15.014+02:00", "highlightTitle": ""}