{"organizations": [], "uuid": "4b72a8b13c583dc2a1db5dbc97c0c9df3d463957", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-hmn-financial-inc-announces-fourth-quarter-results.html", "country": "US", "domain_rank": 767, "title": "HMN Financial, Inc. Announces Fourth Quarter Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T07:30:00.000+02:00", "replies_count": 0, "uuid": "4b72a8b13c583dc2a1db5dbc97c0c9df3d463957"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-hmn-financial-inc-announces-fourth-quarter-results.html", "ord_in_thread": 0, "title": "HMN Financial, Inc. Announces Fourth Quarter Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": [{"name": "hmn financial, inc", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fourth Quarter Highlights\nNet income of $0.4 million, down $1.3 million from $1.7 million for fourth quarter of 2016 Diluted earnings per share of $0.08, down $0.27 from $0.35 for fourth quarter of 2016 Income tax expense of $1.6 million, up $0.6 million from $1.0 million in the fourth quarter of 2016 Interest income yield enhancements decreased $0.6 million in fourth quarter of 2017 compared to fourth quarter of 2016\nAnnual Highlights\nNet income of $4.4 million, down $2.0 million from $6.4 million for 2016 Diluted earnings per share of $0.90, down $0.44 from $1.34 for 2016 Income tax expense of $4.4 million, up $0.3 million from $4.1 million in 2016 Interest income yield enhancements decreased $2.1 million in 2017 compared to 2016 Total assets of $723 million, up $41 million from $682 million at December 31, 2016\nNet Income Summary Three Months Ended Year Ended December 31, December 31, (Dollars in thousands, except per share amounts) 2017 2016 2017 2016 Net income $ 387 1,684 $ 4,404 6,350 Diluted earnings per share 0.08 0.35 0.90 1.34 Return on average assets (annualized) 0.21 % 0.99 % 0.63 % 0.96 % Return on average equity (annualized) 1.88 % 8.93 % 5.52 % 8.71 % Book value per share $ 17.97 16.91 $ 17.97 16.91 ROCHESTER, Minn., Jan. 29, 2018 (GLOBE NEWSWIRE) -- HMN Financial, Inc. (HMN or the Company) (NASDAQ:HMNF), the $723 million holding company for Home Federal Savings Bank (the Bank), today reported net income of $0.4 million for the fourth quarter of 2017, a decrease of $1.3 million compared to net income of $1.7 million for the fourth quarter of 2016. Diluted earnings per share for the fourth quarter of 2017 was $0.08, a decrease of $0.27 from the diluted earnings per share of $0.35 for the fourth quarter of 2016. The decrease in net income for the fourth quarter of 2017 is due primarily to a $0.6 million increase in income tax expense. The increase is due primarily to the $1.1 million decrease in the Company’s net deferred tax asset as result of the reduction in the corporate federal tax rate in connection with the enactment of the Tax Cuts and Jobs Act on December 22, 2017. Net income also decreased because of a $0.2 million decrease in the gain on sales of loans due to a decrease in mortgage loan activity. The loan loss provision also increased $0.5 million due to increased reserves established on certain commercial loans between the periods.\nPresident’s Statement\n“The decrease in the corporate federal tax rate had a negative effect on net income in the fourth quarter of 2017 due to the write down of our deferred tax asset,” said Bradley Krehbiel, President and Chief Executive Officer of HMN. “Even though the corporate income tax rate change negatively impacted the fourth quarter results, we look forward to the positive impact of the lower federal tax rate on our earnings in future periods.”\nFourth Quarter Results\nNet Interest Income\nNet interest income was $6.3 million for the fourth quarter of 2017, the same as for the fourth quarter of 2016. Interest income was $6.8 million for the fourth quarter of 2017, an increase of $0.1 million, or 0.8%, from $6.7 million for the same period in 2016. Interest income increased $0.6 million because of an increase in the average interest-earning assets and a change in the composition of the average interest-earning assets held, which resulted in a 9 basis point increase in the average yields earned between the periods. While the average interest-earning assets increased $45.8 million between the periods, the average interest-earning assets held in higher yielding loans increased $39.4 million and the amount of average interest-earning assets held in lower yielding cash and investments increased $6.4 million between the periods. The increase in the average outstanding loans between the periods was primarily the result of an increase in the commercial loan portfolio which occurred because of an increase in loan originations and a reduction in loan payoffs between the periods. The increase in interest income as a result of these items was entirely offset by a decrease in interest income as a result of recognizing a lower amount of yield enhancements between the periods. Interest income decreased $0.6 million due to a decrease in the amount of yield enhancements recognized from loan prepayment penalties, yield adjustments on purchased loans, and the interest payments received on non-accruing and previously charged off commercial real estate loans. This resulted in a 35 basis point decrease in the average yield between the periods. It is anticipated that the yield enhancements relating to these items will be lower in subsequent periods as the pool of non-accruing and purchased loans continues to decline. The average yield earned on interest-earning assets was 3.89% for the fourth quarter of 2017, a decrease of 26 basis points from 4.15% for the fourth quarter of 2016. The decrease in the average yield earned on interest-earning assets is primarily related to the decrease in yield adjustments recognized between the periods on previously charged off commercial real estate loans.\nInterest expense was $0.4 million for the fourth quarter of 2017, the same as for the fourth quarter of 2016. The average interest rate paid on non-interest and interest-bearing liabilities was 0.27% for the fourth quarter of 2017, a decrease of 1 basis point from the fourth quarter of 2016. The average non-interest and interest-bearing liabilities increased $37.8 million between the periods, the average amount held in lower rate checking, savings, and money market accounts increased $17.3 million, the average amount held in higher rate premium money market accounts increased $21.4 million, and the average amount held in higher rate borrowings and certificates of deposit decreased $0.5 million between the periods. Net interest margin (net interest income divided by average interest-earning assets) for the fourth quarter of 2017 was 3.64%, a decrease of 25 basis points, compared to 3.89% for the fourth quarter of 2016. The decrease in the net interest margin is primarily related to the decrease in yield adjustments recognized between the periods on previously charged off commercial real estate loans.\nA summary of the Company’s net interest margin for the three month periods ended December 31, 2017 and 2016 is as follows:\nFor the three-month period ended December 31, 2017 December 31, 2016 (Dollars in thousands) Average\nOutstanding\nBalance Interest\nEarned/\nPaid Yield/\nRate Average\nOutstanding\nBalance Interest\nEarned/\nPaid Yield/\nRate Interest-earning assets: Securities available for sale $ 76,154 310 1.62 % $ 76,912 281 1.45 % Loans held for sale 2,030 25 4.89 2,783 27 3.86 Mortgage loans, net 114,808 1,182 4.08 108,133 1,072 3.94 Commercial loans, net 393,823 4,257 4.29 360,355 4,406 4.86 Consumer loans, net 73,964 913 4.90 73,969 900 4.84 Cash equivalents 28,045 76 1.08 20,908 23 0.44 Federal Home Loan Bank stock 818 4 1.94 806 2 0.86 Total interest-earning assets $ 689,642 6,767 3.89 $ 643,866 6,711 4.15 Interest-bearing liabilities: NOW accounts $ 86,327 11 0.05 $ 89,864 14 0.06 Savings accounts 75,335 15 0.08 72,896 15 0.08 Money market accounts 192,399 171 0.35 170,475 99 0.23 Certificates 110,884 238 0.85 101,889 147 0.57 Advances and other borrowings 0 0 0.00 9,511 145 6.05 Total interest-bearing liabilities $ 464,945 $ 444,635 Non-interest checking 162,275 144,626 Other non-interest bearing deposits 1,037 1,206 Total interest-bearing liabilities and non-interest\nbearing deposits\n$ 628,257 435 0.27\n$ 590,467 420 0.28 Net interest income 6,332 6,291 Net interest rate spread 3.62 % 3.87 % Net interest margin 3.64 % 3.89 % Provision for Loan Losses\nThe provision for loan losses was $0.1 million for the fourth quarter of 2017, an increase of $0.5 million compared to ($0.4) million for the fourth quarter of 2016. The provision for loan losses increased between the periods primarily because of the increase in the reserves required on certain commercial loans due to deterioration of their credit quality in the fourth quarter of 2017. Total non-performing assets were $3.8 million at December 31, 2017, an increase of $0.1 million from September 30, 2017. Non-performing loans decreased $0.1 million and foreclosed and repossessed assets increased $0.2 million during the fourth quarter of 2017.\nA reconciliation of the allowance for loan losses for the fourth quarters of 2017 and 2016 is summarized as follows:\n(Dollars in thousands) 2017 2016 Balance at September 30, $ 9,277 $ 10,306 Provision 59 (374 ) Charge offs: Commercial (10 ) (80 ) Commercial real estate (50 ) 0 Consumer (25 ) (79 ) Recoveries 60 130 Balance at December 31, $ 9,311 $ 9,903 Allocated to: General allowance $ 8,238 $ 8,915 Specific allowance 1,073 988 $ 9,311 $ 9,903 The following table summarizes the amounts and categories of non-performing assets in the Bank’s portfolio and loan delinquency information as of the end of the two most recently completed quarters and December 31, 2017.\nDecember 31, September 30, December 31, (Dollars in thousands) 2017 2017 2016 Non‑Performing Loans: Single family $ 949 $ 800 $ 916 Commercial real estate 1,364 1,666 1,384 Consumer 553 545 630 Commercial 278 297 343 Total 3,144 3,308 3,273 Foreclosed and Repossessed Assets: Commercial real estate 627 414 611 Consumer 0 1 16 Total non‑performing assets $ 3,771 $ 3,723 $ 3,900 Total as a percentage of total assets 0.52 % 0.52 % 0.57 % Total non‑performing loans $ 3,144 $ 3,308 $ 3,273 Total as a percentage of total loans receivable, net 0.54 % 0.57 % 0.59 % Allowance for loan losses to non-performing loans 296.11 % 280.45 % 302.56 % Delinquency Data: Delinquencies (1) 30+ days $ 1,789 $ 2,070 $ 917 90+ days 0 0 0 Delinquencies as a percentage of loan and lease portfolio (1) 30+ days 0.30 % 0.35 % 0.16 % 90+ days 0.00 % 0.00 % 0.00 % (1) Excludes non-accrual loans.\nNon-Interest Income and Expense\nNon-interest income was $2.0 million for the fourth quarter of 2017, a decrease of $0.2 million, or 10.8%, from $2.2 million for the same period of 2016. The decrease in non-interest income is primarily related to the $0.2 million decrease in the gain on sales of loans due to a decrease in single family loan originations and sales between the periods. Fees and service charges decreased slightly between the periods due to a decrease in overdraft fees. Other non-interest income decreased slightly because of a decrease in the sales of uninsured investment products between the periods.\nNon-interest expense was $6.2 million for the fourth quarter of 2017, the same as the fourth quarter of 2016. Compensation expense decreased $0.1 million between the periods due primarily to a decrease in incentives earned because of the decrease in loan volume and a decrease in the number of employees between the periods. Occupancy and equipment expense decreased $0.1 million because of decrease in the non-capitalized software purchased between the periods. Professional services expense decreased $0.1 million between the periods primarily because of a decrease in legal expenses. These decreases in non-interest expenses were entirely offset by other increases in non-interest expense including a $0.2 million decrease in the gains on real estate owned because there were fewer sales in the fourth quarter of 2017 when compared to the same period of 2016. Other non-interest expense increased $0.1 due primarily to an increase in advertising expenses between the periods.\nIncome tax expense was $1.6 million for the fourth quarter of 2017, an increase of $0.6 million from $1.0 million for the fourth quarter of 2016. The increase in income tax expense between the periods is due primarily to the $1.1 million decrease in the Company’s net deferred tax asset as result of the reduction in the corporate federal tax rate in connection with the enactment of the Tax Cuts and Jobs Act on December 22, 2017.\nReturn on Assets and Equity\nReturn on average assets (annualized) for the fourth quarter of 2017 was 0.21%, compared to 0.99% for the fourth quarter of 2016. Return on average equity (annualized) was 1.88% for the fourth quarter of 2017, compared to 8.93% for the same period of 2016. Book value per share at December 31, 2017 was $17.97, compared to $16.91 at December 31, 2016.\nAnnual Results\nNet Income\nNet income was $4.4 million for 2017, a decrease of $2.0 million, or 30.6%, compared to net income of $6.4 million for 2016. Diluted earnings per share for the year ended December 31, 2017 was $0.90, a decrease of $0.44 per share compared to diluted earnings per share of $1.34 for the year ended December 31, 2016. The decrease in net income for 2017 is due primarily to a $0.3 million increase in income tax expense. The increase in income tax expense is due primarily to the $1.1 million decrease in the Company’s net deferred tax asset as result of the reduction in the corporate federal tax rate in connection with the enactment of the Tax Cuts and Jobs Act on December 22, 2017. Net income also decreased $0.5 million due to a decrease in the gain on sales of loans because of a decrease in mortgage loans activity, $0.5 million due to a decrease in the gains on real estate owned because of fewer sales, $0.4 million due to an increase in other non-interest expenses primarily related to advertising expenses, $0.2 million because of an increase in compensation and benefits, and $0.1 million due to an increase in the loan loss provision between the periods. These decreases in net income were partially offset by an increase in net interest income of $0.1 million between the periods as a result of an increase in the average interest-earning assets and a change in the composition of the average interest-earning assets held between the periods.\nNet Interest Income\nNet interest income was $25.9 million for 2017, an increase of $0.1 million, or 0.5%, from $25.8 million for the same period of 2016. Interest income was $27.7 million for 2017, an increase of $0.4 million, or 1.2%, from $27.3 million for the same period of 2016. Interest income increased $2.4 million because of an increase in the average interest-earning assets and a change in the composition of the average interest-earning assets held, which resulted in a 6 basis point increase in the average yields earned between the periods. While the average interest-earning assets increased $43.2 million between the periods, the average interest-earning assets held in higher yielding loans increased $58.8 million and the amount of average interest-earning assets held in lower yielding cash and investments decreased $15.6 million between the periods. The increase in the average outstanding loans between the periods was primarily the result of an increase in the commercial loan portfolio, which occurred because of an increase in loan originations and a reduction in loan payoffs between the periods. The increase in interest income as a result of these items was partially offset by a decrease in interest income as a result of recognizing a lower amount of yield enhancements between the periods. Interest income decreased $2.1 million due to a decrease in the amount of yield enhancements recognized from loan prepayment penalties, yield adjustments on purchased loans, and the interest payments received on non-accruing and previously charged off commercial real estate loans. This resulted in a 29 basis point decrease in the average yield between the periods. It is anticipated that the yield enhancements relating to these items will be lower in subsequent periods as the pool of non-accruing and purchased loans continues to decline. The average yield earned on interest-earning assets was 4.13% for 2017, a decrease of 23 basis points from 4.36% for 2016. The decrease in the average yield earned on interest-earning assets is primarily related to the decrease in yield enhancements recognized between the periods.\nInterest expense was $1.8 million for 2017, an increase of $0.2 million, or 12.8%, compared to $1.6 million for 2016. The average interest rate paid on non-interest and interest-bearing liabilities was 0.29% for 2017, an increase of 1 basis point from 0.28% for 2016. The average rate paid increased between the periods due to an increase in the rates paid on certain money market and certificate of deposit accounts that was partially offset by a decrease in the interest paid on other borrowings due to a decrease in the average borrowings outstanding between the periods. The average non-interest and interest-bearing liabilities increased $34.6 million between the periods, the average amount held in lower rate checking, savings, and money market accounts increased $10.4 million, the average amount held in higher rate premium money market accounts increased $22.5 million, and the average amount held in higher rate borrowings and certificates of deposit increased $1.7 million between the periods. Net interest margin (net interest income divided by average interest-earning assets) for 2017 was 3.86%, a decrease of 25 basis points, compared to 4.11% for 2016. The decrease in the net interest margin is primarily related to the decrease in yield enhancements recognized between the periods.\nA summary of the Company’s net interest margin for 2017 and 2016 is as follows:\nFor the twelve-month period ended December 31, 2017 December 31, 2016 (Dollars in thousands) Average\nOutstanding\nBalance Interest\nEarned/\nPaid Yield/\nRate Average\nOutstanding\nBalance Interest\nEarned/\nPaid Yield/\nRate Interest-earning assets: Securities available for sale $ 76,559 1,160 1.52 % $ 86,159 1,347 1.56 % Loans held for sale 1,905 94 4.93 3,046 126 4.14 Mortgage loans, net 113,733 4,592 4.04 103,040 4,272 4.15 Commercial loans, net 386,716 18,142 4.69 339,521 18,036 5.31 Consumer loans, net 73,445 3,540 4.82 71,413 3,466 4.85 Cash equivalents 17,214 140 0.81 23,337 96 0.41 Federal Home Loan Bank stock 874 12 1.37 770 6 0.78 Total interest-earning assets $ 670,446 27,680 4.13 $ 627,286 27,349 4.36 Interest-bearing liabilities: NOW accounts $ 87,416 77 0.09 $ 85,440 50 0.06 Savings accounts 76,592 63 0.08 71,728 62 0.09 Money market accounts 179,675 560 0.31 164,522 366 0.22 Certificates 106,006 770 0.73 100,942 524 0.52 Advances and other borrowings 6,335 327 5.16 9,374 591 6.30 Total interest-bearing liabilities $ 456,024 $ 432,006 Non-interest checking 156,149 145,450 Other non-interest bearing deposits 1,279 1,434 Total interest-bearing liabilities and non-interest\nbearing deposits\n$ 613,452 1,797 0.29\n$ 578,890 1,593 0.28 Net interest income 25,883 25,756 Net interest rate spread 3.84 % 4.08 % Net interest margin 3.86 % 4.11 % Provision for Loan Losses\nThe provision for loan losses was ($0.5) million for the year ended December 31, 2017, an increase of $0.1 million, from ($0.6) million for the year ended December 31, 2016. The provision for loan losses increased between the periods primarily because of the increase in the reserves required on certain commercial loans due to a deterioration of their credit quality between the periods. Total non-performing assets were $3.8 million at December 31, 2017, a decrease of $0.1 million, or 3.3%, from $3.9 million at December 31, 2016. Non-performing loans decreased $0.1 million and foreclosed and repossessed assets were the same between the periods.\nA reconciliation of the allowance for loan losses for 2017 and 2016 is summarized as follows:\n(in thousands) 2017 2016 Balance beginning of period $ 9,903 $ 9,709 Provision (523 ) (645 ) Charge offs: Commercial (311 ) (180 ) Commercial real estate (50 ) (67 ) Consumer (288 ) (108 ) Single family mortgage (6 ) (66 ) Recoveries 586 1,260 Balance at December 31, $ 9,311 $ 9,903 Non-Interest Income and Expense\nNon-interest income was $7.7 million for the year ended December 31, 2017, a decrease of $0.5 million, or 6.7%, from $8.2 million for the year ended December 31, 2016. The decrease in non-interest income is primarily related to the $0.5 million decrease in the gain on sales of loans due to a decrease in single family loan originations and sales between the periods. Fees and service charges decreased $0.1 million between the periods due primarily to a decrease in overdraft fees. Other non-interest income decreased $0.1 million primarily because of a decrease in the revenue earned on the sale of uninsured investment products between the periods. These decreases in non-interest income were partially offset by a $0.1 million increase in loan servicing fees earned between the periods.\nNon-interest expense was $25.3 million for the year ended December 31, 2017, an increase of $1.2 million, or 4.7%, from $24.1 million for the year ended December 31, 2016. Gains on real estate owned decreased $0.5 million between the periods due to fewer sales in 2017 when compared to 2016. Other non-interest expense increased $0.4 million primarily due to an increase in advertising expense between the periods. Compensation expense increased $0.2 million between the periods due to normal annual salary increases between the periods. Occupancy and equipment expense increased slightly because of increased software and equipment expenses. Professional services expense increased slightly primarily due to an increase in legal expenses between the periods. These increases in non-interest expense were partially offset by a $0.1 million decrease in data processing expense due to a decrease in debit card costs between the periods.\nIncome tax expense was $4.4 million for the year ended December 31, 2017, an increase of $0.3 million, from $4.1 million for the year ended December 31, 2016. The increase in income tax expense is due primarily to the $1.1 million decrease in the Company’s net deferred tax asset as result of the reduction in the corporate federal tax rate in connection with the enactment of the Tax Cuts and Jobs Act on December 22, 2017.\nReturn on Assets and Equity\nReturn on average assets (annualized) for 2017 was 0.63%, compared to 0.96% for 2016. Return on average equity (annualized) was 5.52% for 2017, compared to 8.71% for 2016. Book value per share at December 31, 2017 was $17.97, compared to $16.91 at December 31, 2016.\nGeneral Information\nHMN Financial, Inc. and the Bank are headquartered in Rochester, Minnesota. Home Federal Savings Bank operates twelve full service offices in Minnesota located in Albert Lea, Austin, Eagan, Kasson (2), LaCrescent, Rochester (4), Spring Valley and Winona and one full service office in Marshalltown, Iowa. The Bank also operates two loan origination offices in Minnesota located in Sartell and Owatonna, and one loan origination office in Delafield, Wisconsin.\nSafe Harbor Statement\nThis press release may contain forward-looking statements within the meaning of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These statements are often identified by such forward-looking terminology as “expect,” “intend,” “look,” “believe,” “anticipate,” “estimate,” “project,” “seek,” “may,” “will,” “would,” “could,” “should,” “trend,” “target,” and “goal” or similar statements or variations of such terms and include, but are not limited to, those relating to growing our core deposit relationships and loan balances, enhancing the financial performance of our core banking operations, maintaining credit quality, reducing non-performing assets, and generating improved financial results (including profitability); the extent of the positive impact of the lower federal tax rates on future earnings; the adequacy and amount of available liquidity and capital resources to the Bank; the Company’s liquidity and capital requirements; our expectations for core capital and our strategies and potential strategies for maintenance thereof; improvements in loan production; changes in the size of the Bank’s loan portfolio; the amount of the Bank’s non-performing assets and the appropriateness of the allowance therefor; anticipated future levels of the provision for loan losses; future losses on non-performing assets; the amount and composition of interest-earning assets; the amount of yield enhancements relating to non-accruing and purchased loans; the amount and composition of non-interest and interest-bearing liabilities; the availability of alternate funding sources; the payment of dividends by HMN; the future outlook for the Company; the amount of deposits that will be withdrawn from checking and money market accounts and how the withdrawn deposits will be replaced; the projected changes in net interest income based on rate shocks; the range that interest rates may fluctuate over the next twelve months; the net market risk of interest rate shocks; the future outlook for the issuer of the trust preferred securities held by the Bank; the ability of the Bank to pay dividends to HMN; the ability to remain well capitalized; and compliance by the Bank with regulatory standards generally (including the Bank’s status as “well-capitalized”) and other supervisory directives or requirements to which the Company or the Bank are or may become expressly subject, specifically, and possible responses of the Office of the Comptroller of the Currency (OCC), Board of Governors of the Federal Reserve System (FRB), the Bank, and the Company to any failure to comply with any such regulatory standard, directive or requirement.\nA number of factors could cause actual results to differ materially from the Company’s assumptions and expectations. These include but are not limited to the adequacy and marketability of real estate and other collateral securing loans to borrowers; federal and state regulation and enforcement; possible legislative and regulatory changes, including additional changes to regulatory capital rules; the ability of the Bank to comply with other applicable regulatory capital requirements; enforcement activity of the OCC and FRB in the event of our non-compliance with any applicable regulatory standard or requirement; adverse economic, business and competitive developments such as shrinking interest margins, reduced collateral values, deposit outflows, changes in credit or other risks posed by the Company’s loan and investment portfolios; changes in costs associated with alternate funding sources, including changes in collateral advance rates and policies of the FHLB; technological, computer-related or operational difficulties; results of litigation; reduced demand for financial services and loan products; changes in accounting policies and guidelines, or monetary and fiscal policies of the federal government or tax laws; international economic developments; the Company’s access to and adverse changes in securities markets; the market for credit related assets; the future operating results, financial condition, cash flow requirements and capital spending priorities of the Company and the Bank; the availability of internal and, as required, external sources of funding; our ability to attract and retain employees; or other significant uncertainties. Additional factors that may cause actual results to differ from the Company’s assumptions and expectations include those set forth in the Company’s most recent filing on Forms 10-K and 10-Q with the Securities and Exchange Commission. All forward-looking statements are qualified by, and should be considered in conjunction with, such cautionary statements. For additional discussion of the risks and uncertainties applicable to the Company, see the “Risk Factors” sections of the Company’s Annual Report on Form 10-K for the year ended December 31, 2016 and Part II, Item 1A of its subsequently filed quarterly reports on Form 10-Q.\nAll statements in this press release, including forward-looking statements, speak only as of the date they are made, and we undertake no duty to update any of the forward-looking statements after the date of this press release.\n(Three pages of selected consolidated financial information are included with this release.)\nHMN FINANCIAL, INC. AND SUBSIDIARIES Consolidated Balance Sheets December 31, December 31, (Dollars in thousands) 2017 2016 (unaudited) Assets Cash and cash equivalents $ 37,564 27,561 Securities available for sale: Mortgage-backed and related securities (amortized cost $5,148 and $993) 5,068 1,005 Other marketable securities (amortized cost $73,653 and $78,846) 72,404 77,472 77,472 78,477 Loans held for sale 1,837 2,009 Loans receivable, net 585,931 551,171 Accrued interest receivable 2,344 2,626 Real estate, net 627 611 Federal Home Loan Bank stock, at cost 817 770 Mortgage servicing rights, net 1,724 1,604 Premises and equipment, net 8,226 8,223 Goodwill 802 802 Core deposit intangible 355 454 Prepaid expenses and other assets 1,314 1,768 Deferred tax asset, net 3,672 5,947 Total assets $ 722,685 682,023 Liabilities and Stockholders’ Equity Deposits $ 635,601 592,811 Other borrowings 0 7,000 Accrued interest payable 146 236 Customer escrows 1,147 1,011 Accrued expenses and other liabilities 4,973 5,046 Total liabilities 641,867 606,104 Commitments and contingencies Stockholders’ equity: Serial-preferred stock: ($.01 par value) authorized 500,000 shares; issued shares 0 0 0 Common stock ($.01 par value): authorized 16,000,000; issued shares 9,128,662 91 91 Additional paid-in capital 50,623 50,566 Retained earnings, subject to certain restrictions 91,448 86,886 Accumulated other comprehensive loss (957 ) (820 ) Unearned employee stock ownership plan shares (2,030 ) (2,223 ) Treasury stock, at cost 4,631,124 and 4,639,739 shares (58,357 ) (58,581 ) Total stockholders’ equity 80,818 75,919 Total liabilities and stockholders’ equity $ 722,685 682,023\nHMN FINANCIAL, INC. AND SUBSIDIARIES Consolidated Statements of Comprehensive Income Three Months Ended\nDecember 31, 2017 2016 Year Ended\nDecember 31,\n2017 2016\n(Dollars in thousands, except per share data) (unaudited) (unaudited) (unaudited) Interest income: Loans receivable $ 6,377 6,405 26,368 25,900 Securities available for sale: Mortgage-backed and related 28 10 57 58 Other marketable 282 271 1,103 1,289 Cash equivalents 76 23 140 96 Other 4 2 12 6 Total interest income 6,767 6,711 27,680 27,349 Interest expense: Deposits 435 275 1,470 1,002 Advances and other borrowings 0 145 327 591 Total interest expense 435 420 1,797 1,593 Net interest income 6,332 6,291 25,883 25,756 Provision for loan losses 59 (374 ) (523 ) (645 ) Net interest income after provision for loan losses 6,273 6,665 26,406 26,401 Non-interest income: Fees and service charges 837 874 3,354 3,427 Loan servicing fees 296 296 1,202 1,108 Gain on sales of loans 610 770 2,138 2,618 Other 216 257 960 1,048 Total non-interest income 1,959 2,197 7,654 8,201 Non-interest expense: Compensation and benefits 3,641 3,748 15,007 14,764 Gains on real estate owned 0 (161 ) (72 ) (596 ) Occupancy and equipment 953 1,047 4,068 4,041 Data processing 311 308 1,106 1,161 Professional services 302 386 1,285 1,257 Other 1,002 877 3,860 3,503 Total non-interest expense 6,209 6,205 25,254 24,130 Income before income tax expense 2,023 2,657 8,806 10,472 Income tax expense 1,636 973 4,402 4,122 Net income 387 1,684 4,404 6,350 Other comprehensive loss, net of tax (494 ) (737 ) (137 ) (606 ) Comprehensive income (loss) available to common\nshareholders $\n(107\n)\n947\n4,267\n5,744 Basic earnings per share $ 0.09 0.40 1.04 1.52 Diluted earnings per share $ 0.08 0.35 0.90 1.34\nHMN FINANCIAL, INC. AND SUBSIDIARIES Selected Consolidated Financial Information (unaudited)\nSelected Financial Data: Three Months Ended\nDecember 31,\n2017 2016 Year Ended\nDecember 31,\n2017 2016 (Dollars in thousands, except per share data) I. OPERATING DATA: Interest income $ 6,767 6,711 27,680 27,349 Interest expense 435 420 1,797 1,593 Net interest income 6,332 6,291 25,883 25,756 II. AVERAGE BALANCES: Assets (1) 716,465 674,792 697,589 658,407 Loans receivable, net. 582,595 542,457 573,894 513,974 Mortgage-backed and related securities (1) 76,154 76,912 76,559 86,159 Interest-earning assets (1) 689,642 643,866 670,446 627,286 Interest-bearing liabilities 628,257 590,467 613,452 578,890 Equity (1) 81,936 75,016 79,767 72,869 III. PERFORMANCE RATIOS: (1) Return on average assets (annualized) 0.21 % 0.99 % 0.63 % 0.96 % Interest rate spread information: Average during period 3.62 3.87 3.84 4.08 End of period 3.97 3.87 3.97 3.87 Net interest margin 3.64 3.89 3.86 4.11 Ratio of operating expense to average total assets (annualized) 3.44 3.66 3.62 3.66 Return on average common equity (annualized) 1.88 8.93 5.52 8.71 Efficiency 74.88 73.10 75.30 71.06 December 31, December 31,\n2017 2016\nIV. EMPLOYEE DATA:\nNumber of full time equivalent employees 187\n200 V. ASSET QUALITY: Total non-performing assets $ 3,771 3,900 Non-performing assets to total assets 0.52 % 0.57 % Non-performing loans to total loans receivable, net 0.54 % 0.59 % Allowance for loan losses $ 9,311 9,903 Allowance for loan losses to total assets 1.29 % 1.45 % Allowance for loan losses to total loans\nreceivable, net 1.59\n1.80 Allowance for loan losses to non-performing loans 296.11 VI. BOOK VALUE PER COMMON SHARE: Book value per common share $ 17.97 16.91 Year Ended Year Ended Dec 31, 2017 Dec 31, 2016 VII. CAPITAL RATIOS: Stockholders’ equity to total assets, at end of period 11.18 % 11.13 % Average stockholders’ equity to average assets (1) . 11.43 11.07 Ratio of average interest-earning assets to average interest-bearing liabilities (1) 109.29 108.36 Home Federal Savings Bank regulatory capital ratios: Common equity tier 1 capital ratio 12.45 13.42 Tier 1 capital leverage ratio 10.68 11.55 Tier 1 capital ratio 12.45 13.42 Risk-based capital 13.71 14.68 Average balances were calculated based upon amortized cost without the market value impact of ASC 320.\nCONTACT:\nBradley Krehbiel\nChief Executive Officer, President\nHMN Financial, Inc. (507) 252-7169\nSource:HMN Financial, Inc.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/a457a82f-5940-447d-87f9-f77a4f030b5d"], "published": "2018-01-30T07:30:00.000+02:00", "crawled": "2018-01-30T08:21:47.036+02:00", "highlightTitle": ""}