{"organizations": [], "uuid": "c1fe018fe58978786383a710a64c11f93e2ed200", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-grace-announces-release-date-for-fourth-quarter-and-full-year-2017-results.html", "country": "US", "domain_rank": 767, "title": "Grace Announces Release Date for Fourth Quarter and Full Year 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-18T16:30:00.000+02:00", "replies_count": 0, "uuid": "c1fe018fe58978786383a710a64c11f93e2ed200"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/18/globe-newswire-grace-announces-release-date-for-fourth-quarter-and-full-year-2017-results.html", "ord_in_thread": 0, "title": "Grace Announces Release Date for Fourth Quarter and Full Year 2017 Results", "locations": [], "entities": {"persons": [{"name": "fred festa", "sentiment": "none"}, {"name": "tom blaser", "sentiment": "none"}], "locations": [{"name": "md.", "sentiment": "none"}, {"name": "columbia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "gra", "sentiment": "negative"}, {"name": "w. r. grace & co.", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "hudson la force", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "COLUMBIA, Md., W. R. Grace & Co. (NYSE:GRA) will release its fourth quarter and full year 2017 financial results at 6:00 a.m. ET on Thursday, February 8, 2018. A company-hosted conference call and webcast will follow at 9:00 a.m. ET that day.\nDuring the call, Fred Festa, Chairman and Chief Executive Officer; Hudson La Force, President and Chief Operating Officer; and Tom Blaser, Senior Vice President and Chief Financial Officer, will discuss fourth quarter results and provide the company’s 2018 financial outlook. A question and answer session with analysts will follow the prepared remarks.\nAccess to the live webcast and the accompanying slides will be available through the Investor section of the company’s website, http://investor.grace.com/ . You also may listen by dialing +1 844.515.9173 (U.S.) or +1 574.990.9421 (International). The participant passcode is 4885105. Investors are advised to dial into the call at least 10 minutes early in order to register.\nAn audio replay will be available for one week after 1:00 p.m. ET on February 8. The replay will be accessible by dialing +1 855.859.2056 (U.S.) or +1 404.537.3406 (International) and entering the participant passcode 4885105.\nAbout Grace\nBuilt on talent, technology, and trust, Grace is a leading global supplier of catalysts and engineered materials. The company’s two industry-leading business segments—Catalysts Technologies and Materials Technologies—provide innovative products, technologies, and services that enhance the products and processes of our customers around the world. With approximately 3,700 employees, Grace operates and/or sells to customers in over 60 countries. More information about Grace is available at grace.com .\nForward-Looking Statements\nThis announcement contains forward-looking statements, that is, information related to future, not past, events. Such statements generally include the words “believes,” “plans,” “intends,” “targets,” “will,” “expects,” “suggests,” “anticipates,” “outlook,” “continues,” or similar expressions. Forward-looking statements include, without limitation, expected financial positions; results of operations; cash flows; financing plans; business strategy; operating plans; capital and other expenditures; competitive positions; growth opportunities; benefits from new technology and cost reduction initiatives; and markets for securities. For these statements, Grace claims the protections of the safe harbor for forward-looking statements contained in Section 27A of the Securities Act and Section 21E of the Exchange Act. Like other businesses, Grace is subject to risks and uncertainties that could cause its actual results to differ materially from its projections or that could cause other forward-looking statements to prove incorrect. Factors that could cause actual results to differ materially from those contained in the forward-looking statements include, without limitation: risks related to foreign operations, especially in emerging regions; the cost and availability of raw materials, energy and transportation; the effectiveness of its research and development and growth investments; acquisitions and divestitures of assets and businesses; developments affecting Grace’s outstanding indebtedness; developments affecting Grace's funded and unfunded pension obligations; its legal and environmental proceedings; environmental compliance costs; uncertainties related to Grace’s ability to realize the anticipated benefits of the separation transaction; the inability to establish or maintain certain business relationships and to retain key personnel; natural disasters such as storms and floods; changes in tax laws and regulations; and those additional factors set forth in Grace's most recent Annual Report on Form 10-K, quarterly report on Form 10-Q and current reports on Form 8-K, which have been filed with the Securities and Exchange Commission and are readily available on the Internet at www.sec.gov . Reported results should not be considered as indications of future performance. Readers are cautioned not to place undue reliance on Grace's projections and forward-looking statements, which speak only as of the dates those projections and statements are made. Grace undertakes no obligation to release publicly any revision to the projections and forward-looking statements contained in this announcement, or to update them to reflect events or circumstances occurring after the date of this announcement.\nMedia Relations\nRich Badmington\nT +1 410.531.4370\nrich.badmington@grace.com\nInvestor Relations\nTania Almond\nT +1 410.531.4590\ntania.almond@grace.com\nSource:W. R. Grace & Co.", "external_links": ["https://www.globenewswire.com/NewsRoom/AttachmentNg/fa7f9ded-444e-489d-9a18-cc1253ec81b8", "http://investor.grace.com/"], "published": "2018-01-18T16:30:00.000+02:00", "crawled": "2018-01-18T16:33:03.000+02:00", "highlightTitle": ""}