{"organizations": [], "uuid": "14b6fd2cca59dac9bff1a5f2a8933871566d226b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-idw-media-holdings-reports-fourth-quarter-and-fiscal-year-2017-results.html", "country": "US", "domain_rank": 767, "title": "IDW Media Holdings Reports Fourth Quarter and Fiscal Year 2017 Results", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T04:35:00.000+02:00", "replies_count": 0, "uuid": "14b6fd2cca59dac9bff1a5f2a8933871566d226b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/29/globe-newswire-idw-media-holdings-reports-fourth-quarter-and-fiscal-year-2017-results.html", "ord_in_thread": 0, "title": "IDW Media Holdings Reports Fourth Quarter and Fiscal Year 2017 Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "STAMFORD, Conn. and SAN DIEGO, Jan. 29, 2018 (GLOBE NEWSWIRE) -- IDW Media Holdings, Inc . “IDWM” (OTCQX:IDWM) (the “Company”), an integrated media company, announced today its results for the fourth quarter and fiscal year ended October 31, 2017.\nOVERVIEW\nFY-17 was a transformational year for the Company in executing its strategy of monetizing IDW Publishing’s extensive library of creative content through the production of television programming. The Company owns or co-owns the rights to over 150 brands and has been investing in IDW Entertainment to produce television programs based primarily on the Company’s proprietary content, as well as third party content. With the success of the Company’s initial programs, which have received critical and consumer acclaim, and the media industry recognition of the broad audience and attractive target demographics of the Company’s proprietary library, the momentum for IDW Entertainment has increased significantly. The Company expects to produce multiple additional programs to significantly accelerate the growth of IDW Entertainment in FY-18 and beyond. At the same time, the Company has invested in strengthening its IDW Publishing division, including transitioning its distribution to a new partnership with Random House. While this transition, coupled with industry dynamics, led to a decline in IDW Publishing revenue in FY-17, the IDW Publishing division is well-positioned to return to growth in FY-18, while continuing to feed more proprietary content to fuel the accelerating growth of IDW Entertainment.\nFiscal Fourth Quarter and Fiscal Year End 2017 Financial Highlights:\nRevenue of $20.0 million for Q4-17 compared to $23.6 million for the year ago period (-15.4%) and $16.7 million in Q3-17 (+19.6%). Revenue of $60.4 million for FY-17 compared to $65.3 million for the previous year. The year over year decline in revenue and the sequential quarterly increase in revenue are discussed below for each segment of the Company. Gross profit margin for the Company of 40.8% for Q4-17 compared to 42.1% for Q4-16 and 46.2% for Q3-17. Gross profit margin for the Company of 44.9% for FY-17 compared to 47.2% for the previous year. The year over year decline was principally due to increasing printing costs at IDW Publishing, reduced revenue at CTM Media Group (where almost all direct costs are fixed costs), and a change in revenue mix in which a higher percentage of the total revenue were from relatively lower margin offerings, partially offset by an increase in gross margin at IDW Entertainment. Net income for the Company of $0.7 million for Q4-17 compared to $2.0 million for Q4-16 and $0.1 million for Q3-17. Net loss for the Company of $0.8 million for FY-17 compared to Net income of $3.7 million for the previous year. The decline in net income from the prior year was principally due to declines in revenue and gross profit margin, as well as an increase in SG&A expenses at IDW Entertainment associated with the launch of new programs. Additionally, we saw increases of $0.7 million in Q4-17 and $2.6 million for FY-17 compared to the prior year periods of non-cash compensation expense associated with the grant of stock to employees beginning in Q1-17. The sequential improvement in quarterly net income was principally due to the increased revenue discussed above. Cash Balance for the Company of $9.2 million at year end was $3.0 million higher than at the previous year end primarily due to the cash raised in the capital stock offering in Q3-17, and $8.0 million lower than $17.2 million at the end of Q3-17. The decline during Q4-17 was primarily due to investments in television productions to support the anticipated future growth of the IDW Entertainment business. The investment in production assets is reflected in the increased balances of Accounts Receivable and Inventory of IDW Entertainment, which the Company expects to convert to revenue beginning in FY-18. IDW Entertainment Revenue of $7.6 million for Q4-17 compared to $8.3 million for Q4-16 and $5.2 million for Q3-17. IDW Entertainment Revenue of $16.2 million for FY-17 compared to $16.0 million for the previous year. The decrease in revenue from the prior year quarter and increase from the prior year was principally due to timing of delivery of episodes of television properties that are being produced. As further described in this release, IDW Entertainment is positioned for significant future growth with programs at various stages of development and production. IDW Publishing Revenue of $6.8 million for Q4-17 compared to $9.4 million for Q4-16 and $5.4 million for Q3-17. IDW Publishing Revenue of $24.5 million for FY-17 compared to $27.9 million for the previous year. IDW Publishing’s revenue in FY-17 was impacted by a cyclically slow period in the comic book speciality market, compounded by temporary disruption related to the transition in distributors to Random House. With the move to Random House complete and with the planned release of major titles, including Star Wars Adventures, Sonic the Hedgehog , and Star Trek: Discovery, as well as new games, including Atari: Centipede , Sonic the Hedgehog, and Nickelodeon Splat Attack!, we anticipate continued sequential growth in IDW Publishing, which includes IDW Games. CTM Media Group Revenue of $5.6 million for Q4-17 compared to $5.9 million for Q4-16 and $6.1 million for Q3-17. CTM Media Group Revenue of $19.7 million for FY-17 compared to $21.4 million for the previous year. The year over year decline is attributable to the loss of certain locations and customers including due to cyclical factors impacting the Broadway industry. The sequential decrease is primarily attributable to seasonal factors. We expect CTM to increase revenue in FY-18 via introduction of new products, creating new partnerships and a rebranding initiative.\nSignificant Highlights and Milestones:\nIDW Entertainment is now poised for significant growth. With the success of IDW Entertainment’s initial programs, the media industry has recognized both the value of IDW Publishing’s extensive library of proprietary content and IDW Entertainment’s capabilities to produce world-class programming. Season two of the critically-acclaimed series Wynonna Earp premiered on SYFY channel in the U.S.; Viacom in the U.K. and Australia; and Netflix worldwide, and the fan favorite series was renewed by SYFY for season three, which went into production on January 15, 2018. IDW Entertainment entered into a partnership with Hulu to produce IDW Publishing’s critically-acclaimed, multiple award-winning and internationally recognized franchise Locke & Key. Production has been completed on the pilot episode by an all-star creative team, including writer Joe Hill, director Andy Muschietti (Stephen King’s IT , Mama ) with Carlton Cuse ( Lost , Bates Motel , The Strain , Jack Ryan ) serving as showrunner. IDW Entertainment is creating a world-class production for Locke & Key that will entertain fans globally. Season two of Dirk Gently premiered on BBC America in the U.S. and season one premiered globally, outside of the U.S., on Netflix. While BBC America recently announced that the series will not be renewed for a third season, the production of Dirk Gently, which was based on third party content, helped to establish IDW Entertainment’s reputation as a producer of high-quality television programming. IDW Entertainment began development on Jonathan Kellerman’s bestselling book property, Alex Delaware , as a scripted series for multiple platforms with Barry O’Brien ( CSI: Miami , Castle ) on board as writer and showrunner. The Alex Delaware franchise consists of 32 titles, selling over 40 million copies, making it the longest running contemporary crime series with millions of fans worldwide. IDW Entertainment anticipates an increase in production and has six new series in active development based on titles from IDW Publishing, including V-Wars, October Faction, Lore, Winter World, Life Undead and Chicacabra, with additional properties in the pipeline for FY-18 and beyond. IDW Entertainment also expects to expand into digital platforms via the Company’s recently established IDW Digital Studio.\nIDW Publishing had a relatively soft year in FY-17 due to industry-wide slowness in the comic book market, and the short-term disruption from the Company’s transition to Random House as its new book-market distributor. IDW Publishing will seek to maximize the benefits of that major change in FY-18. Importantly, IDW Publishing’s growing library continues to supply proprietary, high-quality content for IDW Entertainment and is well positioned to fuel the accelerated growth of IDW Entertainment. IDW Publishing added Star Wars to its powerful line-up of kids’ properties, with the first titles hitting at the end of the year. A full line-up for FY-18 includes graphic novel film adaptations, a monthly on-going series, and special one-shots and tie-in events. IDW Publishing added the classic popular title, Sonic the Hedgehog, to its publishing portfolio, with a major launch announced for April 2018. Sonic , a beloved videogame title for more than 25 years, is one of the most successful kid’s properties in the comic book market. IDW Publishing’s October launch of Black Crown , an adult-oriented, creator-driven imprint, has already built buzz and will provide an eclectic slate of titles, which will further build an already impressive line-up of proprieties available for entertainment development. IDW Publishing’s games division, IDW Games, is focused on long-term development and is adding a breadth of titles for 2018, including Sonic The Hedgehog , Nickelodeon classic characters, Dragon Ball Z , and additional mass-market titles with wide appeal. IDW Publishing’s Top Shelf imprint found continued success with new titles such as Surfside Girls , aimed squarely at the growing YA girls’ market. And in 2018, IDW Publishing will release one of the most anticipated titles among comic book fans--Alan Moore’s final series of The League of Extraordinary Gentlemen. IDW Publishing’s push into international markets continues with licensing into more territories and with a greater variety of publishers than ever before.\nManagement: Commenting on the results, Ted Adams, CEO stated: “2017 was truly a transformational year for IDWM as we position the company for major growth at IDW Entertainment, while developing products that can cut across our various platforms. We have successfully proven out our model of creating high-quality television programming based on IDW Publishing’s proprietary content, as well as third party content. We have been investing in this program over the past few years, and we are now well-positioned to capitalize on that investment as the media industry is recognizing the quality of our content and our capabilities to produce outstanding programming. We believe this positions us well for accelerating growth in IDW Entertainment in the years ahead.\nIDW Publishing is poised both to return to growth in FY-18 and to feed more high quality, proprietary content for IDW Entertainment. Our new publishing distribution agreement with Random House, brings a plethora of opportunity as well as operational efficiencies, which should be realized in FY-18. While IDW Publishing experienced a decline in revenue in FY-17, primarily due to market weakness throughout the industry, our publishing business is much stronger now with both the Random House partnership and a more robust line-up of upcoming titles, including a new licensing agreement with Disney on a new line of Star Wars comic books developed for young readers. This was validated with the release of our first title, produced in collaboration with Lucasfilm, Star Wars Adventures Volume I: Heroes of the Galaxy , and is expected to support new growth of publishing revenue throughout 2018. We also welcome the addition of the iconic Sonic the Hedgehog to our publishing portfolio and look forward to acquiring other established properties and creating new intellectual properties, all of which should contribute to growth in FY-18 and beyond.”\nForward Looking Statements:\nAll statements above that are not purely about historical facts, including, but not limited to, those in which we use the words “believe,” “anticipate,” “expect,” “plan,” “intend,” “estimate,” “target” and similar expressions, are forward-looking statements. While these forward-looking statements represent our current judgment of what may happen in the future, actual results may differ materially from the results expressed or implied by these statements due to numerous important factors. Our public disclosures provide information on certain of such statements and risks, and should be consulted along with this release. To the extent permitted under applicable law, we assume no obligation to update any forward-looking statements.\nAbout IDW Media Holdings\nIDW Media Holdings, Inc. (OTCQX:IDWM) is an integrated media company, with three divisions, the award-winning IDW Publishing, which includes IDW Games and Top Shelf Productions, IDW Entertainment, and CTM Media Group.\nThe financial statements below have been derived from the Company’s financial statements at the dates shown, but do not include all of the information and footnotes required by U.S. GAAP for complete financial statements. For further information, please refer to the Company’s annual report for the fiscal years ended October 31, 2017 and 2016 which we anticipate filing with the OTC Markets Group within a week of this release.\nIDW MEDIA HOLDINGS, INC.\nCONSOLIDATED BALANCE SHEETS\n(in thousands) October 31,\n2017 October 31,\n2016 Assets Current assets: Cash and cash equivalents $ 9,154 $ 6,203 Trade accounts receivable, net 14,630 11,592 Inventory – print and production costs 29,354 13,652 Prepaid expenses 2,292 1,738 Note receivable – current portion - 310 Total current assets 55,430 33,495 Property and equipment, net 3,479 3,394 Non-current assets Trade accounts receivable – non-current portion 3,078 2,478 Deferred taxes 10,391 10,413 Intangible Assets, net 1,164 1,539 Goodwill 2,272 2,227 Other assets 416 392 Total non-current assets 17,321 17,049 Total assets $ 76,230 $ 53,938 Liabilities and stockholders’ equity Current liabilities: Trade accounts payable 2,809 $ 2,412 Accrued expenses 9,880 8,730 Deferred revenue 4,677 1,809 Bank loans payable – current portion 5,409 426 Income taxes payable 249 1,037 Capital lease obligations – current portion 397 365 Other current liabilities 162 421 Total current liabilities 23,583 15,200 Non-current liabilities Accrued liabilities – non-current 1,602 470 Capital lease obligations – long term portion 923 807 Bank loans payable – long term portion 649 749 Total non-current liabilities 3,174 2,026 Total liabilities 26,757 17,226 Commitments and contingencies - - Stockholders’ equity: Preferred stock, $.01 par value; authorized shares – 500; no shares issued at October 31,\n2017 and October 31, 2016 - - Class B common stock, $0.01 par value; authorized shares – 12,000; 6,085 shares and\n5,553 shares issued and outstanding at October 31, 2017 and October 31, 2016,\nrespectively 61 56 Class C common stock, $0.01 par value; authorized shares – 2,500; 545 shares issued and outstanding at October 31,\n2017 and October 31, 2016 5 5 Additional paid-in capital 66,694 53,208 Accumulated other comprehensive loss (183 ) (250 ) Accumulated deficit (15,908 ) (15,111 ) Treasury stock, at cost, consisting of 519 shares of Class B common stock at October 31, 2017 and October 31, 2016 (1,196 ) (1,196 ) Total stockholders' equity 49,473 36,712 Total liabilities and stockholders’ equity $ 76,230 $ 53,938 IDW MEDIA HOLDINGS, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nThree Months Ended\nOctober 31, (unaudited)\nFiscal Years Ended\nOctober 31, (in thousands, except per share data) 2017 2016 2017\n2016 Revenues $ 19,982 $ 23,632 $ 60,360 $ 65,267 Costs and expenses: Direct cost of revenues 11,835 13,691 33,250 34,444 Selling, general and administrative (i) 6,520 6,116 26,501 22,727 Depreciation and amortization 426 401 1,585 1,538 Bad debt expense - 196 22 318 Total costs and expenses 18,781 20,404 61,358 59,027 Income (loss) from operations 1,201 3,228 (998 ) 6,240 Interest expense, net (52 ) (18 ) (155 ) (75 ) Other (expense) income, net 72 (1 ) 74 (23 ) Income (loss) before income taxes 1,221 3,209 (1,079 ) 6,142 (Provision for) benefit from income taxes (477 ) (1,244 ) 282 (2,473 ) Net income (loss) $ 744 $ 1,965 $ (797 ) $ 3,669 Basic and diluted income (loss) per share (see notes 1 and 3): Net income (loss) per share $ .12 $ 0.35 $ (.14 ) $ 0.74 Weighted-average number of shares used in the calculation of\nbasic and diluted income per share: 6,110 5,579 5,842 4,976 Dividend declared per common share: $ 0.00 $ 0.00 $ 0.00 $ 0.163 Interest Expense $ 59 $ 21 $ 169 $ 86 (i) Stock-based compensation included in selling, general and\nadministrative expenses $ 774 $ 99 $ 2,940 $ 388 IDW Media Holdings, Inc. EBITDA and Adjusted EBITDA\nIn addition to disclosing financial results that are determined in accordance with generally accepted accounting principles in the United States of America (GAAP), the Company is also disclosing for the three months and fiscal year ended October 31, 2017 and 2016, the Company’s consolidated [EBITDA and Adjusted EBITDA, which are non-GAAP measures. Generally, a non-GAAP financial measure is a numerical measure of a company’s performance, financial position, or cash flows that either excludes or includes amounts that are not normally excluded or included in the most directly comparable measure calculated and presented in accordance with GAAP.\nThe Company’s measure of EBITDA consists of net income before depreciation, amortization, provision for or benefit from income taxes, and net interest expense or interest income. Adjusted EBITDA makes further adjustments to EBITDA to reflect the elimination of certain income statement items including non-cash compensation, and expenses that we consider to be not indicative of the performance of ongoing operations.\nThese additions and subtractions are non-cash and/or non-routine items in the relevant fiscal 2017 and fiscal 2016 periods.\nManagement believes that the Company’s EBITDA and Adjusted EBITDA measures provide useful information to both management and investors by excluding certain expenses and non-routine gains and losses that may not be indicative of the Company’s core operating results. Management uses EBITDA and Adjusted EBITDA, among other measures, as a relevant indicator of core operational strengths in its financial and operational decision making. In addition, management uses EBITDA and Adjusted EBITDA to evaluate operating performance in relation to its competitors. Disclosure of these financial measures may be useful to investors in evaluating performance and allows for greater transparency to the underlying supplemental information used by management in its financial and operational decision-making. In addition, management believes such measures are commonly used by readers of financial information in assessing performance, therefore the inclusion of comparative numbers provides consistency in financial reporting at this time.\nManagement refers to EBITDA and Adjusted EBITDA to facilitate internal and external comparisons to historical operating results, in making operating decisions, for budget and planning purposes, and to form the basis upon which management is compensated for the Company’s business segments.\nWhile depreciation and amortization are considered operating costs under GAAP, these expenses primarily represent the non-cash current period allocation of costs associated with long-lived assets acquired or constructed in prior periods. The Company’s operating results exclusive of depreciation and amortization charges are useful indicators of its current performance.\nInterest is excluded from operating income to arrive at EBITDA as this expense reflects the cost of debt financing and its exclusion may provide users of the financial information with a useful indication of the Company’s operations. Income taxes are excluded in arriving at EBITDA as they reflect costs based on taxable income where computations and rates vary by the jurisdictions in which the Company does business and provides a different measure to evaluate operations and may be useful in evaluating operational performance.\nNon-cash compensation is also considered an operating expense under GAAP and represents expenses that do not utilize the Company’s cash resources and are useful in evaluating the Company’s current performance.\nEBITDA and Adjusted EBITDA should be considered in addition to, not as a substitute for, or superior to, income (loss) from operations, cash flow from operating activities, net income, and other liquidity and financial performance prepared in accordance with GAAP. In addition, the Company’s measurements of EBITDA and Adjusted EBITDA may not be comparable to similarly titled measures reported by other companies.\nFollowing are reconciliations of EBITDA and Adjusted EBITDA to Net Income (Loss), which is the most directly comparable GAAP measure.\nReconciliation of Consolidated Net Income (Loss) to\nConsolidated EBITDA and Consolidated Adjusted EBITDA\n(Unaudited)\nThree Months Ended\nOctober 31, Fiscal Year Ended\nOctober 31, (in thousands) 2017 2016 2017 2016 Net income (loss) 744 1,965 (797 ) 3,669 Depreciation and amortization 426 401 1,585 1,538 Provision for (benefit from) income taxes 477 1,244 (282 ) 2,473 Interest expense, net 52 18 155 75 EBITDA 1,699 3,628 661 7,755 Non-cash compensation 774 99 2,940 388 Adjusted EBITDA\n2,473\n3,727 3,601 8,143 Contact:\nLes Rozner\nlrozner@idwmediaholdings.com\n(203) 716-8376\nSource:IDW Media Holdings", "external_links": ["https://www.globenewswire.com/Tracker?data=w_9UNs3EeY7Tyt3CUht7njklauf4nY_ZDT9iG9svCtyxzsXOmjuqlVlEE96v20uqB8BCLXSxhwjMnot7o1-Q4dFgfyBkN8HJKdce_zLQgOwG6-cX2RIhZm3P6lkuD6xp", "https://www.globenewswire.com/NewsRoom/AttachmentNg/1e8ff27a-d2c8-43d4-9ef5-76080b4fa519"], "published": "2018-01-30T04:35:00.000+02:00", "crawled": "2018-01-30T07:09:47.307+02:00", "highlightTitle": ""}