{"organizations": [], "uuid": "8609f02bdfcce9b7c9a2905cee657b88f772d88e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/08/31/104684097-GettyImages-175137759.1910x1000.jpg", "site_section": "https://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp;amp; Analysis", "url": "https://www.cnbc.com/2018/01/17/10-job-search-tips-for-landing-your-dream-role-in-2018.html", "country": "US", "domain_rank": 767, "title": "10 tips for landing your dream job in 2018", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T20:14:00.000+02:00", "replies_count": 0, "uuid": "8609f02bdfcce9b7c9a2905cee657b88f772d88e"}, "author": "Courtney Connley", "url": "https://www.cnbc.com/2018/01/17/10-job-search-tips-for-landing-your-dream-role-in-2018.html", "ord_in_thread": 0, "title": "10 tips for landing your dream job in 2018", "locations": [], "entities": {"persons": [{"name": "dobroski", "sentiment": "none"}, {"name": "scott dobroski", "sentiment": "none"}, {"name": "glassdoor", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hero Images/Getty Images SHARES \nWhether you're a recent college graduate or a seasoned employee, looking for a new job can be stressful. \nWhile there are hundreds of online job postings that you can apply to, it's difficult to find the right position that fits your lifestyle and needs. To help, job search platform Glassdoor has launched a new online class, \" How to Get a Job: A Step-by-Step Guide ,\" in order to help professionals narrow their search and land the job that's perfect for them. \nRelying on advice from experts on everything from how to look for a job to landing an interview and and following-up with hiring managers, Glassdoor has compiled the top tips job seekers should follow to secure their dream position in 2018. Russ Rohde/Getty Images 1. Identify your skill sets \nMany people start their job search by looking at the job titles that sound most fitting to their career goals. While this method may prove to be successful for some, Glassdoor career expert Scott Dobroski suggests job seekers look at the required skills of a position instead. By doing this, Dobroski says employees will be able to identify the skill sets they already possess and the jobs that best match their experiences. \nAlso, since job titles are constantly changing, Dobroski says focusing on the required skills of a position can open your search up to job titles that you didn't even know matched your expertise. 2. Utilize online resources and company websites \nThanks to the internet, looking for a job today goes far beyond asking a friend and searching for an opening in the newspaper. Now, companies use their website to advertise job openings, and job search platforms can also help you identify opportunities. Use these sites to not only search for a specific position, but to also look for \"similar jobs\" or \"suggested jobs\" that may pique your interest. 3. Narrow down your search to the best options \nRather than apply to any and every opening you see, it's best to narrow down your search and only apply to the positions that sound most fitting to your skill sets and career goals. To go a step further in ensuring that a job is right for you, do a little bit of background research on the company to get a sense of its values and why employees do or don't like working there. Also, dig into your own network to see if you're connected to someone who has experience at the company and who can share their perspective on working there. \nCarolyn Thompson, executive recruiter and managing principal at Merito Group says connecting with someone at the company can also be an extra way for you to get your foot in the door. \n\"Companies always give preferential treatment to employee referrals,\" she tells CNBC Make It . \"If you don't know someone there, then volunteering at a company's local charity event can also be a great way to meet people.\" show chapters 1:14 PM ET Fri, 24 Feb 2017 | 01:02 4. Save the best job listings for future reference \nEven after you've submitted your application for a job, you should still copy and paste or print the job listing for future reference. With many employers removing a position once they've received enough applicants, Dobroski says saving a job description can help you prepare for an interview when you want to look back on the qualifications needed. 5. Customize your resume to match each position you apply to \nEven if you're looking at jobs that are all within the same industry, it's still important to tailor your resume so that it matches each specific job you apply to. By doing so, you give yourself a competitive edge over the resumes that hiring managers know are used for any and every job. 6. Don't restate your resume in your cover letter \nAccording to Glassdoor, your cover letter should not read like an extra copy of your resume. Instead, it should provide hiring managers with more background information about who you are and why you are a right fit for the position and the company. It should also include a call to action like, \"I look forward to connecting to discuss next steps,\" so the employer knows just how interested you are in moving forward with the position. \nIf a job application doesn't specifically ask for a cover letter, it never hurts to send one anyway. It can be the determining factor that sets you apart from the rest of the competition. show chapters ", "external_links": ["https://www.glassdoor.com/blog/new-year-new-job-guide/", "http://www.meritogroup.com/", "https://www.facebook.com/CNBCMakeIt/"], "published": "2018-01-17T20:14:00.000+02:00", "crawled": "2018-01-17T19:28:28.009+02:00", "highlightTitle": ""}