{"organizations": [], "uuid": "8a461a8572c6464e8cba956683e2ea17e052555a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 12, "shares": 12, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180111&t=2&i=1221080673&w=1200&r=LYNXMPEE0A0K2", "site_section": "http://feeds.reuters.com/reuters/healthNews\r", "section_title": "Reuters: Health News", "url": "https://www.reuters.com/article/us-france-babymilk-recall/french-retailers-sold-lactalis-baby-milk-after-salmonella-recall-idUSKBN1F00Y7", "country": "US", "domain_rank": 408, "title": "French retailers sold Lactalis baby milk after salmonella recall", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T11:15:00.000+02:00", "replies_count": 0, "uuid": "8a461a8572c6464e8cba956683e2ea17e052555a"}, "author": "", "url": "https://www.reuters.com/article/us-france-babymilk-recall/french-retailers-sold-lactalis-baby-milk-after-salmonella-recall-idUSKBN1F00Y7", "ord_in_thread": 0, "title": "French retailers sold Lactalis baby milk after salmonella recall", "locations": [], "entities": {"persons": [{"name": "picot", "sentiment": "none"}, {"name": "thierry desouches", "sentiment": "none"}, {"name": "milumel", "sentiment": "none"}, {"name": "leclerc", "sentiment": "none"}], "locations": [{"name": "france", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "carrefour", "sentiment": "none"}, {"name": "systeme u", "sentiment": "none"}, {"name": "bfm tv", "sentiment": "none"}, {"name": "dgccrf", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "auchan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 9:19 AM / Updated 2 hours ago France blames Lactalis, retailers in deepening baby food scare Richard Lough , Dominique Vidalon 5 Min Read \nPARIS (Reuters) - France, seeking to limit reputational damage to its agri-business industry, threatened on Thursday to impose sanctions after the country’s big supermarkets said recalled baby foods made by Lactalis had still found their way onto shop shelves. \nThe admissions by Carrefour ( CARR.PA ), Leclerc, Auchan and Systeme U deepened a salmonella health scare that began in early December when France’s consumer protection agency ordered the halt to sales and a global recall of products from a factory in northwest France. Three dozen children have fallen ill. \nThe botched recall is particularly embarrassing for the government after President Emmanuel Macron pushed food exports during a state visit to China this week. \nEconomy Minister Bruno Le Maire laid the blame squarely on Lactalis, one of the world’s largest dairy groups, and the retailers as he tried to stem the fallout from the scandal. \n“There has been unacceptable behavior, which should be punished,” he told a news conference. \nIn a sign of how seriously France is taking the issue, Macron weighed in from Italy, also promising punishment for those responsible. \nSalmonella infections can be life-threatening, particularly for young children, and the recall risks damaging Lactalis in China, a fast-growing market for baby food and dairy products where consumers are highly sensitive after melamine-tainted baby milk led to the deaths of six children in 2008. \nThat health scare caused distrust in locally produced infant formula and benefited foreign suppliers such as Nestle NESN.N, Danone ( DANO.PA ) and Lactalis. \nPrivately-held Lactalis, which has annual sales of around 17 billion euros ($20 billion), addressed the salmonella contamination by halting operations at the factory where it started, and on Thursday announced the temporary layoff of 250 workers. \nThe recall affected goods carrying the Picot, Milumel and Taranis brands destined for French and overseas markets and France’s consumer protection agency DGCCRF has begun an investigation and carried out 2,500 checks so far. A further 2,500 checks will be carried out from next week. GLOBAL RECALL \nLe Maire said initial checks showed recalled products had remained on sale at 91 sites in France, but there were no indications so far that potentially contaminated products had been exported. Slideshow (5 Images) \nJust back from a three-day official visit to China with Macron, Le Maire said he had discussed the recall with his counterparts in Beijing, adding: “The best response is transparency”. \nLe Maire said the DGCCRF was forced to issue a Dec. 10 recall because Lactalis was too slow to take action. \n“The state took over from a company which failed in its actions,” he said. \nLactalis rejected criticism of its response, saying it had collaborated closely with the authorities. \n“Our group has since the beginning behaved like a responsible company and of course it will continue to do so,” Michel Nalet, Lactalis’ head of communication, told reporters. \nLe Maire has summoned Lactalis for talks on Friday. \nThe DGCCRF issued a first recall on Dec. 10 after Lactalis discovered salmonella contamination at its Craon factory, halting the sale of several baby food products made there. \nLactalis announced an extension to the recall less than two weeks later, confirming that contamination occurred at Craon during work in the first half of the year. \nThe recall included products aimed for export to some 30 countries, including to China, and overall represented more than 12 million baby food tins in what Nalet said was the biggest recall Lactalis had ever experienced. \nIn a statement on Thursday, Carrefour said it had sold 434 products at risk of contamination since the Dec. 21 recall, but that another 95,000 had been successfully removed from shelves. \nLeclerc, France’s biggest food retailer, said this week it had sold 984 products involved in the recall. \n“We made mistakes, as did all the big distribution companies,” Systeme U spokesman Thierry Desouches told BFM TV, adding the recall had been complex. \nA French judicial investigation was launched in December and consumer protection association UFC-Que Choisir said it had filed a lawsuit against Lactalis for alleged fraud. Reporting by Richard Lough and Dominique Vidalon; Additional reporting by Sybille de la Hamaide, Gus Trompiz and Myriam Rivet; Editing by Alexander Smith, Hugh Lawson and Mark Potter", "external_links": [], "published": "2018-01-11T11:15:00.000+02:00", "crawled": "2018-01-11T13:23:27.007+02:00", "highlightTitle": ""}