{"organizations": [], "uuid": "f0ed1e657e73ee66b874ccd38309d2be894c656b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-insite-software-names-tim-sobocinski-to-top-sales-position.html", "country": "US", "domain_rank": 767, "title": "Insite Software Names Tim Sobocinski to Top Sales Position", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T16:10:00.000+02:00", "replies_count": 0, "uuid": "f0ed1e657e73ee66b874ccd38309d2be894c656b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/pr-newswire-insite-software-names-tim-sobocinski-to-top-sales-position.html", "ord_in_thread": 0, "title": "Insite Software Names Tim Sobocinski to Top Sales Position", "locations": [], "entities": {"persons": [{"name": "tim sobocinski", "sentiment": "negative"}, {"name": "steve shaffer", "sentiment": "none"}, {"name": "sobocinski", "sentiment": "none"}], "locations": [{"name": "minneapolis", "sentiment": "none"}], "organizations": [{"name": "insite software", "sentiment": "negative"}, {"name": "insite", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MINNEAPOLIS, Jan. 11, 2018 /PRNewswire/ -- Representatives at Insite Software, a leading B2B commerce platform, announced the company has hired Tim Sobocinski as Vice President of Sales and Business Development. Sobocinski will leverage more than a decade of sales leadership expertise in B2B, SaaS organizations to help grow Insite's customer base and drive revenue.\n\"We made incredible progress in 2017 introducing new capabilities for our solutions, and optimizing our internal sales and business development engine,\" said Steve Shaffer, CEO of Insite Software. \"Tim has the experience and knowledge to help take Insite to the next level. He's also a great fit for our culture, someone who believes that being a coach and mentor are fundamental practices to driving the best results possible.\"\nIn his new role Sobocinski will be responsible for managing Insite's account executive and business development teams, as well as overseeing the company's channel sales program. He will work closely with the rest of the executive team to collaborate with other functional areas of the organization including existing product, engineering and marketing teams.\n\"There is no bigger opportunity within B2B today than eCommerce, and Insite Software is well positioned as the leader in the industry,\" said Sobocinski. \"I'm excited to help drive value for Insite's existing customers and to grow the company's manufacturing and distribution customer base. It really is an honor to join such a talented team of professionals with such a strong track record.\"\nPrior to joining Insite Software Sobocinski held the position of Vice President, Strategic Accounts for a leading cloud-based CPQ software company. He has also held executive sales positions for other prominent B2B technology organizations. Sobocinski is a Minnesota native and a graduate of the University of St. Thomas.\nAbout Insite Software – Built for B2B, Insite Software is a leading commerce platform that unifies e-commerce, sales channels, content and data to create superior B2B buyer experiences. Leading global manufacturers, wholesalers and distributors rely on Insite to engage with buyers and sellers via B2B sites with portals for customers, sales, partners and dealers. Insite's revolutionary technology integrates with leading ERP, CRM and web content management systems. Cloud deployment is fully managed by the Insite Software team, and eliminates costly upgrades. For more information, visit Insite Software at insitesoft.com .\nTalk to us on Twitter , circle us on Google+ and get to know our company on LinkedIn and Facebook. For B2B commerce best practices and tips, read our blog.\nView original content with multimedia: http://www.prnewswire.com/news-releases/insite-software-names-tim-sobocinski-to-top-sales-position-300581200.html\nSOURCE Insite Software", "external_links": ["https://www.linkedin.com/company/insite-software", "https://plus.google.com/+InsitesofteCommerce/about", "http://www.prnewswire.com/news-releases/insite-software-names-tim-sobocinski-to-top-sales-position-300581200.html", "http://www.insitesoft.com/", "https://www.facebook.com/InsiteSoft/", "http://www.insitesoft.com/blog/", "https://twitter.com/insitesoftware"], "published": "2018-01-11T16:10:00.000+02:00", "crawled": "2018-01-11T19:37:05.047+02:00", "highlightTitle": ""}