{"organizations": [], "uuid": "ffbb191f159ae9c0ade2ecd1137ade0a17e11467", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-bond-brand-loyalty-names-jason-chomik-vice-president-technology.html", "country": "US", "domain_rank": 767, "title": "Bond Brand Loyalty names Jason Chomik Vice President, Technology", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-31T19:30:00.000+02:00", "replies_count": 0, "uuid": "ffbb191f159ae9c0ade2ecd1137ade0a17e11467"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/31/pr-newswire-bond-brand-loyalty-names-jason-chomik-vice-president-technology.html", "ord_in_thread": 0, "title": "Bond Brand Loyalty names Jason Chomik Vice President, Technology", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Appointment addresses need for rapid and agile change to meet evolving market demand.\nTORONTO, NEW YORK and LONDON, Jan. 31, 2018 /PRNewswire/ - Bond Brand Loyalty, a leading customer engagement agency, announced today that Jason Chomik has joined Bond as Vice President of Technology.\nA recognized industry leader, Bond continues to grow globally to meet the rapid and increasing demand from various markets and clients to change how they engage with their customers. The adoption and integration of technology to satisfy this tremendous driver is critical, and Bond is meeting this need through continued investments in their class leading proprietary platforms and the development of a growing roster of strategic partnerships.\nJason brings with him extensive know-how for structuring, developing, and managing high-performing IT and business teams, and has proven to be invaluable in the implementation of agile methodologies across multiple organizations. The addition of Jason's skill set further demonstrates Bond's commitment to continued innovation and a customer-centric strategy.\n\"This is a critical role for Bond, and I'm thrilled to have Jason join the team to lead the vision and strategic direction for all technical aspects of our business,\" said Bob Macdonald, President and CEO. \"He will evolve our digital development and infrastructure, ensuring that Bond continues its focus on advancing innovation and delivering results for our clients globally.\"\n\"Joining the Bond family affords me the exciting opportunity to utilize my retail, financial, and loyalty industry expertise and passion to create superior customer experiences through technology—something that Bond does exceptionally well,\" said Jason.\nJason comes to Bond from a leading U.K.-based technology business that develops enterprise solutions for global retail brands. His most recent experience includes the custom development of a new loyalty platform for one of North America's largest retailers. He has also worked alongside some of the largest banks and payments processors to strategize, build, and deploy many of the payment innovations we use today, including PayPass, EMV (chip cards), and mobile payments.\nAbout Bond Brand Loyalty\nBond Brand Loyalty is a global customer engagement agency that specializes in building brand loyalty for the world's most influential and valuable brands. Our mission is to make marketing more rewarding for customers, richer and more resilient for brands, and to deliver profitable business outcomes for our clients. We build measurable, authentic, and long-lasting relationships through a combination of services that includes loyalty solutions, customer experience, marketing research, customer analytics, live brand experiences, and proprietary technology platforms. Visit our website , follow us on LinkedIn and Twitter , or contact us at 1-844-277-2663.\nSOURCE Bond Brand Loyalty", "external_links": ["https://www.linkedin.com/company/954303/", "https://twitter.com/createabond", "http://www.bondbrandloyalty.com/"], "published": "2018-01-31T19:30:00.000+02:00", "crawled": "2018-01-31T20:34:39.012+02:00", "highlightTitle": ""}