{"organizations": [], "uuid": "be0bb08e1f24929409e9a6f45d0198547f01178f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-world-renowned-immunologist-professor-eric-vivier-joins-innate-pharma-as-chief-scientific-officer.html", "country": "US", "domain_rank": 767, "title": "WORLD RENOWNED IMMUNOLOGIST, PROFESSOR ERIC VIVIER, JOINS INNATE PHARMA AS CHIEF SCIENTIFIC OFFICER", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T09:01:00.000+02:00", "replies_count": 0, "uuid": "be0bb08e1f24929409e9a6f45d0198547f01178f"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/globe-newswire-world-renowned-immunologist-professor-eric-vivier-joins-innate-pharma-as-chief-scientific-officer.html", "ord_in_thread": 0, "title": "WORLD RENOWNED IMMUNOLOGIST, PROFESSOR ERIC VIVIER, JOINS INNATE PHARMA AS CHIEF SCIENTIFIC OFFICER", "locations": [], "entities": {"persons": [{"name": "eric vivier", "sentiment": "negative"}], "locations": [{"name": "france", "sentiment": "none"}], "organizations": [{"name": "iph", "sentiment": "none"}, {"name": "marseille public hospitals", "sentiment": "none"}, {"name": "innate pharma sa", "sentiment": "none"}, {"name": "euronext", "sentiment": "none"}, {"name": "company", "sentiment": "none"}, {"name": "aix-marseille university", "sentiment": "none"}, {"name": "marseille", "sentiment": "none"}, {"name": "marseille immunopole", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WORLD RENOWNED IMMUNOLOGIST, PROFESSOR ERIC VIVIER, JOINS INNATE PHARMA AS CHIEF SCIENTIFIC OFFICER\nMarseille, France, January 8, 2018\nInnate Pharma SA (the \"Company\" - Euronext Paris: FR0010331421 - IPH) today announces that Professor Eric Vivier has joined the Company as Chief Scientific Officer (CSO) and Senior Vice President.\nEric Vivier is currently Professor of Immunology at Aix-Marseille University and the Marseille Public Hospitals. He is an international leading authority in the field of immunology. In particular, his research was instrumental in identifying the mechanisms underlying the development and function of Natural Killer (NK) cells as well as in the discovery of innate lymphocyte cells (ILCs). He is the author of more than 300 publications in immunology and ranks among the world's most cited researchers [*] . He is also one of the founders of Marseille Immunopole, an immunology cluster that integrates fundamental research, therapeutic innovation and industrial development to accelerate the rise of immunotherapy and to make these innovative therapies more easily accessible for patients.\nIn his new role, Professor Vivier will lead Innate Pharma Research Laboratories, which gathers four departments and focuses on target discovery, exploration of mechanism of action, translational research and drug-candidate development. Innate Pharma Research Laboratories relies on the expertise of the Company's highly experienced researchers and engineers, and its cutting-edge technology platforms. It will also lead the development of collaborations between fundamental, translational and clinical research, particularly working with the Marseille Immunopole ecosystem.\nMondher Mahjoubi, Chairman of the Executive Board and Chief Executive Officer, commented: \"We are very pleased to welcome Professor Vivier, who brings to Innate Pharma world-renowned expertise in immunology with a focus on effector cell function in cancer, a strategic focus for our company. His appointment as Chief Scientific Officer will allow us to step up innovation in our R&D operation and will support us as we take our proprietary first-in-class antibodies closer towards commercialization.\"\nProfessor Vivier said: \"Innate's R&D organization has always been driven by high quality research, which has contributed significantly to recent developments in our understanding of the role played by the innate immune system in fighting cancer. I believe that the Company's pipeline is at a pivotal point in its development, and I am excited by the prospect of working with the team to accelerate this.\" He added:\n\"Joining Innate Pharma is a natural step for me as being both part of academia and industry is now becoming a standard to deliver biomedical innovation. It is also consistent with the translational approach which is becoming increasingly central in the fight against cancer.\"\nA picture of Professor Vivier can be downloaded here.\nAbout Professor Eric Vivier\nEric Vivier is a Doctor of Veterinary Medicine (DVM) from the Ecole Nationale Vétérinaire de Maisons-Alfort and holds a PhD in Immunology from the Paris University (Paris XI). After completing his post-doctoral fellowship at Harvard Medical School (Dana Faber Cancer Institute), Pr. Vivier joined the Center of Immunology at Marseille-Luminy (CIML) in 1993, becoming its director in 2008 until 2017. He has twice been laureate of the prestigious European Research Council (ERC) advanced grants.\nDuring his career, Pr. Vivier has been a visiting professor at The Scripps Research Institute, The Rockefeller University, and The Walter and Elisa Hall Institute. He is a member of the French National Academy of Medicine and of the Institut Universitaire de France. He is on the board of numerous committees and has been awarded several prices and honors, including the European Federation of Immunological Society award and the Grand Prix Charles Oberling in Oncology. He is also Chevalier de la Légion d'Honneur.\nRead his full biography\nAbout Innate Pharma:\nInnate Pharma S.A. is a clinical-stage biotechnology company dedicated to improving cancer treatment and clinical outcomes for patients through first-in-class therapeutic antibodies that harness the innate immunity.\nInnate Pharma specializes in immuno-oncology, a new therapeutic field that is changing cancer treatment by mobilizing the power of the body's immune system to recognize and kill cancer cells.\nThe Company's broad pipeline includes four first-in-class clinical stage antibodies as well as preclinical candidates and technologies that have the potential to address a broad range of cancer indications with high unmet medical needs.\nInnate Pharma has pioneered the discovery and development of checkpoint inhibitors, with a unique expertise and understanding of Natural Killer cell biology. This innovative approach has resulted in major alliances with leaders in the biopharmaceutical industry including AstraZeneca, Bristol-Myers Squibb, Novo Nordisk A/S and Sanofi. Innate Pharma is building the foundations to become a fully-integrated biopharmaceutical company.\nBased in Marseille, France, Innate Pharma has more than 180 employees and is listed on Euronext Paris.\nLearn more about Innate Pharma at www.innate-pharma.com\nInformation about Innate Pharma shares:\nISIN code\nTicker code\nLEI FR0010331421\nIPH\n9695002Y8420ZB8HJE29 Disclaimer:\nThis press release contains certain . Although the company believes its expectations are based on reasonable assumptions, these are subject to numerous risks and uncertainties, which could cause actual results from those anticipated. For a discussion of risks and uncertainties which could cause the company's actual results, financial condition, performance or achievements to differ from those contained in the , please refer to the Risk Factors (\"Facteurs de Risque\") section of the Document de Reference prospectus filed with the AMF, which is available on the AMF website ( http://www.amf-france.org ) or on Innate Pharma's website.\nThis press release and the information contained herein do not constitute an offer to sell or a solicitation of an offer to buy or subscribe to shares in Innate Pharma in any country.\nFor additional information, please contact:\nInvestors\nInnate Pharma\nDr Markus Metzger / Jérôme Marino\nInvestor relations\nTel.: +33 (0)4 30 30 30 30\ninvestors@innate-pharma.com\nInternational Media\nConsilium Strategic Communications\nMary-Jane Elliott / Jessica Hodgson\nTel.: +44 (0)20 3709 5700\nInnatePharma@consilium-comms.com French Media\nATCG Press\nMarie Puvieux\nMob: +33 (0)6 10 54 36 72\npresse@atcg-partners.com\n[*] https://clarivate.com/hcr/\nAttachments:\nhttp://www.globenewswire.com/NewsRoom/AttachmentNg/c156bef5-c830-450e-b0dd-c50cee5b7ee5\nSource: INNATE PHARMA", "external_links": ["https://www.globenewswire.com/Tracker?data=RY4T4G_CnJZTVe2yosCHpjK4PkkAGXR-FV4JNPvhdc9ACJ6GokodBrWjbS1lkG-AAoKL9fNhcWYzp4m9JybX-zkDsUqphr0Ib1YJWLg56jk=", "https://www.globenewswire.com/Tracker?data=oXAQzh8pJbhLkdOAZTkWxw34HUr8xfgF7Da24u7WQ9B3BWlhqRRo4HeioWl_dpkopQhElYZTcatLwg1-SWXlssNQhB13gV0mYXW9jKHrasE=", "https://www.globenewswire.com/Tracker?data=7mxnScsrhJYp9Cw7HZ_F7OtkSH-PQJ4Sl9L5hOTunvpnVgx5mzCxLEpuSgWmaJYbmuAFu1jqg5qAAAt1MViwltLiGyhEYIUIRNvwK0WHQg373anl6oBjOiQKSF6T1FG45AZBMxYekcKb9fhQJyRH4JJYgzCYRbnp8_kAbMh7wvly9iFMPEVoISdjsYClMU7A-H4L0wExDuPQgt59AkPWMw==", "https://clarivate.com/hcr/", "http://www.globenewswire.com/NewsRoom/AttachmentNg/c156bef5-c830-450e-b0dd-c50cee5b7ee5", "https://www.globenewswire.com/Tracker?data=f2Bz1iLO1VylRo8Wk0r7PGNjruUH4Tes3t1Ran9Gu4SBWgbkbM5nyFOuCGyNWVoI3Pp4F0ss-LNDdyh8SbqXLzD_DDliXtCLLsJv3oXVe_8=", "https://www.globenewswire.com/Tracker?data=a_Vd9W30WYoXujNbf7YRjaU1d4-IcZe_iqpPeVO41TpnLTyST3M7EeWCEwsX-TKQwz5FHPlsdpNwYL4PPjq1fOZJbBRNpQj_jxglqunopnxO3zAJ1EWl9bvK5dtUu7IT", "https://www.globenewswire.com/Tracker?data=RY4T4G_CnJZTVe2yosCHpnyj1q4M4sEBHnG0ig1Y-D0_PgW6Uq93qqP5-r-H5_6NXSX4eDd2qlA3fwtyibSB6_MaCBmDsIBdxczsvsTkjYI0OqcrlEMn14rPDu723pfo947RV7rSVRkodOCeOQtY5X1EzEUVpkvzRtMpI_S2SnncNDsfG-d1UNnrryt7iI3iY4uc-jJODEnwi-ms159IaDBfUzaY77OvxtGDBW6fHDB0PPgm9LOUn9-ulSX-UGwgMibbLh8z-qhbA8jW5u3lbA=="], "published": "2018-01-08T09:01:00.000+02:00", "crawled": "2018-01-08T09:35:06.000+02:00", "highlightTitle": ""}