{"organizations": [], "uuid": "aefa9af150b0afae71e3c97098ecb9954b66a087", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-darden-restaurants-increases-fiscal-2018-financial-outlook.html", "country": "US", "domain_rank": 767, "title": "Darden Restaurants Increases Fiscal 2018 Financial Outlook", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-08T15:00:00.000+02:00", "replies_count": 0, "uuid": "aefa9af150b0afae71e3c97098ecb9954b66a087"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/08/pr-newswire-darden-restaurants-increases-fiscal-2018-financial-outlook.html", "ord_in_thread": 0, "title": "Darden Restaurants Increases Fiscal 2018 Financial Outlook", "locations": [], "entities": {"persons": [{"name": "darden", "sentiment": "negative"}], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "financial outlook orlando", "sentiment": "none"}], "organizations": [{"name": "dri", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "darden restaurants, inc.", "sentiment": "neutral"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "ORLANDO, Fla., Jan. 8, 2018 /PRNewswire/ -- Darden Restaurants, Inc., (NYSE: DRI) today increased its outlook for adjusted diluted net earnings per share from continuing operations* for fiscal 2018 to $4.70 - $4.78, including plans to make an investment of approximately $20 million in its workforce during fiscal 2018.\nThe Company also announced the fiscal 2018 anticipated financial impacts of H.R. 1, originally known as the Tax Cuts and Jobs Act (Tax Act) enacted on December 22, 2017. During the Company's fiscal third quarter ending February 25, 2018, the Company will be required to revalue its deferred tax assets and deferred tax liabilities to account for the future impact of lower corporate tax rates on these deferred amounts. Based upon preliminary analysis, the Company estimates that it will record non-cash net tax benefits of approximately $70 million, or approximately $0.56 per diluted share, related to the revaluation of these deferred tax items.\nAdditionally, and excluding the deferred tax revaluation benefit mentioned above, the Company estimates that the impact of the lower corporate tax rates under the Tax Act will reduce its fiscal 2018 effective tax rate by 600 basis points. Separately, the Company announced that the anticipated resolution of other tax matters, unrelated to the Tax Act, will reduce its effective tax rate by an additional 100 basis points, resulting in an effective tax rate of approximately 18% for fiscal 2018. The actual impacts of the Tax Act on fiscal 2018 financial results may differ from these estimates due to many factors, including changes in interpretations of the Tax Act, the accuracy of the Company's assumptions and additional actions it may take as a result of the Tax Act.\n\"One of the best investments we can make is in our people,\" said CEO Gene Lee. \"During the remainder of fiscal 2018, we will invest approximately $20 million in initiatives directly benefitting our workforce. This investment will strengthen one of our most important competitive advantages – a results-oriented culture – as we continue to improve on the guest experience, and position Darden and our brands for long-term success.\"\nUpdated Fiscal 2018 Financial Outlook\nBased on the tax items previously mentioned, and net of investments, Darden provided an updated effective tax rate estimate and increased its outlook for adjusted diluted net earnings per share from continuing operations* for fiscal 2018.\nCurrent (01/08/18)\nPrior (12/19/17)\nSame-restaurant sales growth\nApprox. 2%\nApprox. 2%\nNew restaurant openings\nApprox. 40\nApprox. 40\nTotal sales growth\nApprox. 13%\nApprox. 13%\nEffective tax rate\nApprox. 18%\nApprox. 25%\nAdjusted diluted net earnings per share from continuing operations*\n$4.70 to $4.78\n$4.45 to $4.53\nDiluted average common shares outstanding for the year\nApprox. 126M\nApprox. 126M\n* See \"Non-GAAP Information\" below for more details\nAbout Darden\nDarden is a restaurant company featuring a portfolio of differentiated brands that include Olive Garden, LongHorn Steakhouse, Cheddar's Scratch Kitchen, Yard House, The Capital Grille, Seasons 52, Bahama Breeze and Eddie V's. Our people equal our success, and we are proud to employ more than 175,000 team members in over 1,700 restaurants. Together, we create memorable experiences for 380 million guests each year in communities across North America. For more information, please visit www.darden.com .\nInformation about\nForward-looking statements in this communication regarding our expected earnings performance and all other statements that are not historical facts, including without limitation statements concerning our future economic performance, are made under the Safe Harbor provisions of the Private Securities Litigation Reform Act of 1995. Any speak only as of the date on which such statements are first made, and we undertake no obligation to update such statements to reflect events or circumstances arising after such date. We wish to caution investors not to place undue reliance on any such . By their nature, involve risks and uncertainties that could cause actual results to materially differ from those anticipated in the statements. The most significant of these uncertainties are described in Darden's Form 10-K, Form 10-Q and Form 8-K reports. These risks and uncertainties include the ability to successfully integrate Cheddar's Scratch Kitchen operations into our business, technology failures including failure to maintain a secure cyber network, food safety and food-borne illness concerns, litigation, unfavorable publicity, risks relating to potential changes in interpretations of or issuance of new regulations pursuant to the Tax Act, risks relating to public policy changes and federal, state and local regulation of our business, long-term and non-cancelable property leases, labor and insurance costs, failure to execute a business continuity plan following a disaster, health concerns including food-related pandemics or virus outbreaks, intense competition, failure to drive profitable sales growth, a lack of availability of suitable locations for new restaurants, higher-than-anticipated costs to open, close, relocate or remodel restaurants, an inability or failure to manage the accelerated impact of social media, a failure to execute innovative marketing tactics, a failure to develop and recruit effective leaders, a failure to address cost pressures, shortages or interruptions in the delivery of food and other products and services, adverse weather conditions and natural disasters, volatility in the market value of derivatives, economic factors specific to the restaurant industry and general macroeconomic factors including interest rates, disruptions in the financial markets, risks of doing business with franchisees, licensees and vendors in foreign markets, failure to protect our intellectual property, impairment in the carrying value of our goodwill or other intangible assets, failure of our internal controls over financial reporting and other factors and uncertainties discussed from time to time in reports filed by Darden with the Securities and Exchange Commission.\nNon-GAAP Information\nThe information in this press release includes financial information determined by methods other than in accordance with U.S. generally accepted accounting principles (\"GAAP\"), such as adjusted diluted net earnings per share from continuing operations. The Company's management uses these non-GAAP measures in its analysis of the Company's performance. The Company believes that the presentation of certain non-GAAP measures provides useful supplemental information that is essential to a proper understanding of the operating results of the Company's businesses. These non-GAAP disclosures should not be viewed as a substitute for operating results determined in accordance with GAAP, nor are they necessarily comparable to non-GAAP performance measures that may be presented by other companies. Reconciliations of these non-GAAP measures are included in this release.\nReconciliation of Fiscal 2018 Reported to Adjusted Earnings Outlook\nCurrent (01/08/18)\nPrior (12/19/17)\nReported diluted net earnings per share from continuing ope", "external_links": ["http://www.prnewswire.com/news-releases/darden-restaurants-increases-fiscal-2018-financial-outlook-300578454.html", "http://www.darden.com/"], "published": "2018-01-08T15:00:00.000+02:00", "crawled": "2018-01-08T15:18:43.011+02:00", "highlightTitle": ""}