{"organizations": [], "uuid": "3bb731d70f4765cf179ddcb3bb162c73d172ff5e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180126&t=2&i=1225353359&w=1200&r=LYNXMPEE0P05T", "site_section": "http://feeds.reuters.com/reuters/INtechnologyNews\r", "section_title": "Reuters: Technology News", "url": "https://in.reuters.com/article/usa-trump-russia-socialmedia/facebook-russian-agents-created-129-u-s-election-events-idINKBN1FF0BG", "country": "US", "domain_rank": 408, "title": "Facebook: Russian agents created 129 U.S. election events", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-26T05:20:00.000+02:00", "replies_count": 0, "uuid": "3bb731d70f4765cf179ddcb3bb162c73d172ff5e"}, "author": "", "url": "https://in.reuters.com/article/usa-trump-russia-socialmedia/facebook-russian-agents-created-129-u-s-election-events-idINKBN1FF0BG", "ord_in_thread": 0, "title": "Facebook: Russian agents created 129 U.S. election events", "locations": [], "entities": {"persons": [{"name": "dustin vol", "sentiment": "negative"}, {"name": "david ingram", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "negative"}, {"name": "congress", "sentiment": "none"}, {"name": "facebook inc", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "min read  washington/san francisco", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 26, 2018 / 3:24 AM / Updated 10 hours ago Facebook: Russian agents created 129 U.S. election events Dustin Volz , David Ingram 4 Min Read \nWASHINGTON/SAN FRANCISCO (Reuters) - Facebook Inc said Russian agents created 129 events on the social media network during the 2016 U.S. election campaign, according to testimony to Congress, shedding more light on Russia’s purported disinformation drive aimed at voters. \nFacebook, in a written statement to U.S. lawmakers released on Thursday and dated Jan. 8, said that 338,300 different Facebook accounts viewed the events and that 62,500 marked that they would attend. The company said it did not have data about which of the events took place. \nFacebook, the world’s largest social media network, said in September only that Russians had created “several promoted events.” \nCopies of the event pages that have surfaced since then show that at least some of them were political rallies centered on divisive subjects, such as immigration. Russia denies the conclusions of U.S. intelligence agencies that it tried to meddle in American democracy. \nFacebook delivered the details to Congress this month in response to written questions from the U.S. Senate Intelligence Committee. \nFacebook said that it had found “overlap” between the online marketing done in 2016 by Russian agents and by President Donald Trump’s campaign and called it “insignificant.” The company said it was not in a position to either substantiate or disprove allegations of collusion between the two camps. \nTrump denies any collusion and has described investigations by congressional panels and a special counsel as a witch hunt. \nFacebook has previously said some 126 million Americans may have seen Russian-backed political content on Facebook over a two-year period, and that 16 million may have been exposed to Russian information on Instagram. \nFacebook, Twitter Inc and Alphabet Inc’s Google testified about misuse of their services before three congressional committees in October and November. \nAlso in its written response to follow up questions, Facebook said that last year it removed Moscow-based Kaspersky Lab from its list of free anti-virus offerings to users who go to the social media site from a computer that may be infected with malicious code. \nFacebook said it no longer provided Kaspersky Lab as a recommended anti-virus option but that it was “unable to easily reconstruct how many Facebook users downloaded Kaspersky software.” \nKaspersky Lab has repeatedly denied allegations by U.S. security officials that its software could enable Russian espionage, a fear that led to the U.S. government last year to ban the use of its products in federal computer networks. \nA Kaspersky spokeswoman did not immediately respond to a request for comment on the testimony. \nFacebook said it was also in the process of “phasing out internal use of a different Kaspersky antivirus product” that does not transmit data back to Kaspersky Lab. It did not name the product. \nIn separate written responses, Google said Kaspersky Lab had not been approved for use in its corporate systems and that a review had not found any installation of its products. Twitter also said it did not use Kaspersky Lab. \nFacebook also said it would take “significant steps” in the coming weeks to notify users of an online tool it released last month that allows them to check whether they have followed or liked Facebook pages or Instagram accounts associated with the Internet Research Agency, a suspected Russian troll farm. Reporting by Dustin Volz in washington and David Ingram; in San Francisco; Editing by Grant McCool", "external_links": [], "published": "2018-01-26T05:20:00.000+02:00", "crawled": "2018-01-26T06:00:29.013+02:00", "highlightTitle": ""}