{"organizations": [], "uuid": "20aa015a1d2130db67aed91eed4da64cb3d4155a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-athletics-bubka/athletics-bubka-wary-of-changes-that-may-put-athletes-at-risk-idUKKBN1FC0WY", "country": "US", "domain_rank": 408, "title": "Athletics - Bubka wary of changes that may put athletes at risk", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T11:05:00.000+02:00", "replies_count": 0, "uuid": "20aa015a1d2130db67aed91eed4da64cb3d4155a"}, "author": "", "url": "https://uk.reuters.com/article/uk-athletics-bubka/athletics-bubka-wary-of-changes-that-may-put-athletes-at-risk-idUKKBN1FC0WY", "ord_in_thread": 0, "title": "Athletics - Bubka wary of changes that may put athletes at risk", "locations": [], "entities": {"persons": [{"name": "bubka", "sentiment": "negative"}, {"name": "sudipto ganguly", "sentiment": "none"}, {"name": "seb coe", "sentiment": "none"}, {"name": "sergey bubka", "sentiment": "none"}], "locations": [{"name": "mumbai", "sentiment": "none"}, {"name": "seoul", "sentiment": "none"}], "organizations": [{"name": "athletics", "sentiment": "negative"}, {"name": "international association of athletics federations", "sentiment": "none"}, {"name": "international olympic committee", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "iaaf", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 9:09 AM / Updated 4 minutes ago Athletics - Bubka wary of changes that may put athletes at risk Sudipto Ganguly 4 Min Read \nMUMBAI (Reuters) - Pole vault must evolve if it is to remain relevant as individual sports look for new ways to attract fans but any changes introduced should not be at the expense of athlete safety, former great Sergey Bubka has told Reuters. \nAthletics has been hit hard over the past few years due to corruption and doping scandals and International Association of Athletics Federations (IAAF) President Seb Coe has said the sport’s governing body was prepared to embrace radical changes to appeal to the next generation. \nThe 54-year-old Bubka, who won pole vault gold at the 1988 Seoul Olympics and is a member of the executive board of the International Olympic Committee, said change is essential for track and field events to remain attractive. \n”It’s very important today to be progressive,“ said Bubka, who is also a senior vice president of the IAAF. ”But it’s most important that the crowd love it and enjoy it. \n“Competition between different sports is so big, for that we look for some changes, some innovations, for some improvements and some new ideas in our sport.” \nBubka, who was in the city as the ambassador for the Tata Mumbai Marathon, said strong competition was vital for drawing crowds to the stadiums. \nThe IAAF approved technical changes last year including a reduction in the amount of time given to each athlete for an attempt from 60 seconds to 30 in a bid to make the sport more television friendly. \nThe changes have not gone down well with some athletes, with London Olympic gold medallist Renaud Lavillenie, who broke Bubka’s long-standing world record, a strong critic. \n“I am actually fighting against them, because it is one of the worst ideas I have ever seen,” Lavillenie said last year. “The thing is, just one minute is actually just enough... it’s just not safe. Pole vault is a dangerous event.” \nBubka agreed with the need to proceed with caution. \n“I think we should be careful with this,” said the Ukrainian, who won six consecutive world athletics titles and four world indoor titles and set a total of 35 world records. \n”This is where we put athletes in danger, put athletes in trouble. Thirty seconds for preparation, specially for outdoor competitions when there can be wind, there can rain, there can be cold, ... this will create some difficulties for the athletes. \n“I can understand that officials are trying to reduce the length of competition but we can try to find other solutions. Referees and judges can be possibly quicker. For the athletes we have to ensure to give them excellent conditions.” \nAthletics has been left to ponder an uncertain future following the retirement of sprint king Usain Bolt of Jamaica last year but Bubka said the sport had always faced the same problem over the years. \n”Usain Bolt was an outstanding athlete,“ Bubka added. ”But in our history we have always had some great, great champions. \n”It’s nice to see what Usain achieved but he retired and that’s life. I am confident with all the work, all the programs over the world it will bring new stars, new champions. \n”There will be another generation. It’s really pleasing to see that Usain is involved in giving back to the sport and in promoting it. \n“I am very confident about the future of athletics.” Editing by Peter Rutherford", "external_links": [], "published": "2018-01-23T11:05:00.000+02:00", "crawled": "2018-01-23T11:29:38.000+02:00", "highlightTitle": ""}