{"organizations": [], "uuid": "22fe024b0e827d4700a8c7b41aa40e37530282ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2016/03/28/103500297-GettyImages-451846939.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100003114/device/rss/rss.html", "section_title": "Top News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/05/how-i-finally-got-job-interviews-at-my-dream-companies.html", "country": "US", "domain_rank": 767, "title": "How I finally got job interviews at my dream companies", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T19:08:00.000+02:00", "replies_count": 0, "uuid": "22fe024b0e827d4700a8c7b41aa40e37530282ea"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/05/how-i-finally-got-job-interviews-at-my-dream-companies.html", "ord_in_thread": 0, "title": "How I finally got job interviews at my dream companies", "locations": [], "entities": {"persons": [{"name": "glassdoor", "sentiment": "none"}], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In 2013, I was ready for a career change .\nWell, to even say I had a career is generous. It'd had been four years since I graduated college with an Econ degree and I was jumping between one random thing to another to pay the rent. I was stuck. Amongst other things, this included trying to sell ebooks and pants (yes, like real pants) online. I had learned to make basic iPhone apps, but it was immediately clear I wasn't going to be coming up with the next app idea that was going to go viral.\nI set a goal for myself to get a job at a top-tier tech company to jumpstart my career.\nMore from Glassdoor: \n8 reasons why you didn't make it past the first interview \nWhat your references should say about you\nHow to make your career change dream into reality \nA series of setbacks I spent days perfecting my resume , but couldn't get an interview. Naturally, I assumed that meant I had to work on it more. I agonized over every word and drove myself crazy with formatting. I finally perfected it, and every time I applied to a job posting, I was filled with hope. This is going to be the job that gets me into tech , I thought . \nBut I wasn't getting interviews. Even when I was applying through referrals , I wouldn't hear back. Eventually, it hit me: I was applying to the wrong roles.\nshow chapters Suzy Welch: The surprising career advice Jeff Bezos gave me      8:56 AM ET Tue, 7 Nov 2017 | 01:46 I was going after software engineering and product manager roles at brand-name tech companies with limited programming and no product experience. No wonder I was getting rejected left and right — I was applying to roles I aspired to one day have, but in reality, my background and skills didn't meet the needs for those positions. At least, not yet. I had to change my approach.\nInstead of thinking about what I wanted, I thought about it from the company's perspective: What needs do they have that I can fill right now? \nLook for stepping stones This approach is especially helpful if you're transitioning into tech from a different industry, non-traditional background or just don't have the relevant experiences for the role you want.\nSince I didn't have the background or experience to get interviews for my aspirational roles, I started looking for positions that would be stepping stones toward them. I looked for roles that would give me relevant experiences for my next job — I was thinking two roles ahead.\nBefore applying to my aspirational role, I wanted to make sure I had two things. First, experience working at a brand-name tech company. Second, a role that gave me an understanding of how end-users used products. I knew those experiences would help prepare me for the job I would apply to next.\nWith that in mind, I honed in my job search on technical customer support roles. I wanted an end-user facing role where I could leverage the technical skills I built up learning how to make simple iPhone apps earlier in the year.\nshow chapters Suzy Welch: This rarely used tactic will help you get ahead      8:56 AM ET Tue, 24 Oct 2017 | 01:36 My big break Once I started to apply for those roles, I was getting interviews, not rejections, left and right.\nI had my sights set on the Forward Deployed Engineer role at Palantir and what later became the Product Specialist role at Dropbox . These two roles hit the criteria for the experiences I wanted to gain for future roles. Just as important, I had the background and skills that these roles needed now .\nAfter going through onsite interviews at both companies, I eventually joined Dropbox as a Product Specialist (then called Embedded User Operations Engineer). I was able to immediately contribute in my first role at Dropbox and in one year, I transferred to the Partnerships team. A year after that, I successfully went through the internal interview process to become a Product Manager, my aspirational role.\nWhere you are now is not where you are going to be By recommending stepping-stone roles, I'm not telling you to sell yourself short — I'm telling you to invest in your future. When you're trying to break into tech, for example, focus on getting into a tech company first, then transitioning into your aspirational role.\nEveryone's situation is different, so by all means, if you'd like, go after your aspirational role right away. But if you're not even getting interviews, you may want to take a step back and consider if you're applying for the right roles.\nLike this story? Like CNBC Make It on Facebook \nDon't miss: Suzy Welch: The 5 biggest interview killers to make sure you avoid \nThis article originally appeared on Glassdoor. \nshow chapters How to avoid the 5 biggest interview killers      8:56 AM ET Tue, 26 Dec 2017 | 01:56", "external_links": [], "published": "2018-01-05T19:08:00.000+02:00", "crawled": "2018-01-05T20:53:32.053+02:00", "highlightTitle": ""}