{"organizations": [], "uuid": "a520510897aad72346a779cb86d575d2c2261a28", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/global-metals/metals-shanghai-copper-dips-as-china-imports-slow-in-dec-idUSL4N1P72ON", "country": "US", "domain_rank": 408, "title": "METALS-Shanghai copper dips as China imports slow in Dec", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T09:26:00.000+02:00", "replies_count": 0, "uuid": "a520510897aad72346a779cb86d575d2c2261a28"}, "author": "", "url": "https://www.reuters.com/article/global-metals/metals-shanghai-copper-dips-as-china-imports-slow-in-dec-idUSL4N1P72ON", "ord_in_thread": 0, "title": "METALS-Shanghai copper dips as China imports slow in Dec", "locations": [], "entities": {"persons": [{"name": "james regan", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "sydney", "sentiment": "none"}], "organizations": [{"name": "shanghai futures exchange", "sentiment": "none"}, {"name": "london metal exchange", "sentiment": "none"}, {"name": "capital economics", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 7:31 AM / in 37 minutes METALS-Shanghai copper dips as China imports slow in Dec Reuters Staff \n(Updates prices) \nBy James Regan \nSYDNEY, Jan 12 (Reuters) - Chinese copper futures eased on Friday after data showed a sharp decline in the country’s imports of the red metal in December. \nChina’s unwrought copper imports fell 4.3 percent in December from a month earlier, according to Chinese customs data. \nBut commodities traders said the decline was softened as imports still stood at the second-highest level in 2017 as winter restrictions on domestic production kept demand for metal from overseas buoyant. \n* SHFE: The most-traded copper contract on the Shanghai Futures Exchange retreated 0.51 percent to 54,800 yuan ($8,464.63)a tonne. \n* COPPER: Three-month copper on the London Metal Exchange was up 0.26 percent to $7,159.75 a tonne by 0700 GMT, reversing losses from the previous session. \n* COPPER DROP FORECAST: Capital Economics said it expects copper to retreat as the year progresses, averaging just $6,800 a tonne in the first quarter and $6,250 in the second quarter. \n* CHINA ALUMINIUM IMPORTS: China’s exports of unwrought aluminium and aluminium products rose for a second straight month in December, by 15.8 percent from November to 440,000 tonnes. That is also up 12.8 percent from the same month a year earlier. \nExports are now back to July levels after plummeting for four straight months before November’s rebound. \n* CHINA: Tongling Nonferrous Metals Group, one of China’s top copper smelters, will suspend production at its Jinguan Copper unit for three days from Friday for repairs, a source familiar with the matter said. \n* NEW GRASBERG PLAN: Indonesia hopes to finalise contract talks with Freeport McMoRan Inc over the Grasberg copper mine by June, although divestment issues are still unresolved, a mining ministry official said on Thursday. \n* NICKEL: ShFE Nickel closed 1.76 percent down, while LME nickel recovered from an overnight selloff to trade 0.4 percent firmer at $12,675 a tonne. \n* LME DEPARTURE: Paul MacGregor, head of sales at the London Metal Exchange, left his position earlier this month and has not yet been replaced, an LME spokesperson said, declining to give any further detail. \n* OTHER METALS: The rest of the ShFE base metals complex ended weaker, with the exception of zinc, which was showing modest gains in step with overnight gains that saw three-month metal trade near decade highs. LME zinc was 0.44 percent higher at $3,401 a tonne. PRICES", "external_links": [], "published": "2018-01-12T09:26:00.000+02:00", "crawled": "2018-01-12T10:16:11.027+02:00", "highlightTitle": ""}