{"organizations": [], "uuid": "1fcea189a21a584baecf795740426cca6005ea15", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-congress/rocky-start-for-syria-talks-in-russia-as-some-delegates-refuse-to-leave-airport-idUSKBN1FJ0WJ", "country": "US", "domain_rank": 408, "title": "Rocky start for Syria talks in Russia as some delegates refuse to leave airport", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-30T10:01:00.000+02:00", "replies_count": 0, "uuid": "1fcea189a21a584baecf795740426cca6005ea15"}, "author": "", "url": "https://www.reuters.com/article/us-mideast-crisis-syria-congress/rocky-start-for-syria-talks-in-russia-as-some-delegates-refuse-to-leave-airport-idUSKBN1FJ0WJ", "ord_in_thread": 0, "title": "Rocky start for Syria talks in Russia as some delegates refuse to leave airport", "locations": [], "entities": {"persons": [{"name": "assad", "sentiment": "none"}, {"name": "bashar al-assad", "sentiment": "none"}], "locations": [{"name": "syria", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "black sea", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "sochi", "sentiment": "none"}], "organizations": [{"name": "congress of national dialogue", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 30, 2018 / 8:02 AM / in 5 minutes Rocky Syria talks in Russia end, ignore key opposition demands Kinda Makieh , Maria Tsvetkova 5 Min Read \nSOCHI, Russia (Reuters) - A Syrian peace conference in Russia ended on Tuesday with a statement calling for democratic elections, but ignoring key opposition demands after a day marred by squabbles and heckling of the Russian foreign minister. \nThe participants also agreed to set up a committee to rewrite the Syrian constitution at the conference, which much of the opposition said aimed to serve the interests of President Bashar al-Assad and his close ally, Moscow. \nA final statement said Syrians must decide their future through elections, but did not say whether Syrian refugees would be allowed to take part, something sought by Assad’s opponents and Western states. Syrians had the “exclusive right” to pick their political system free of foreign intervention, it added. \nIt also urged the preservation of security forces without calling for their reform, another demand of the opposition. \n“This conference is tailor-made for Assad and his terrorist regime,” said Mustafa Sejari, a senior official in a Free Syrian Army (FSA) rebel group that operates in northern Syria. “The Sochi statement does not concern us and is not even a subject of discussion.” \nRussia hosted what it called a Syrian Congress of National Dialogue in the Black Sea resort of Sochi. After helping turn the tide of the war in Syria in Assad’s favor, Moscow has cast itself as a Middle East peace broker. \nThe event was boycotted, however, by the leadership of the Syrian opposition, while powers such as the United States, Britain and France stayed away because of what they said was the Syrian government’s refusal to properly engage. \nWestern countries support a separate United Nations-mediated peace process, which has so far failed to yield progress toward ending a war that is entering its eighth year. The latest round of those talks took place last week in Vienna. \n“We don’t need a new process, we don’t need any competitive process,” U.N. Syria envoy Staffan de Mistura, who attended the Sochi conference, told reporters in New York by phone on Monday. \nHe said the constitutional committee agreed in Sochi “will become a reality in Geneva,” where most of the U.N.-led Syria peace talks have been held. De Mistura also said he would decide the criteria for committee members and select about 50 people - from government, opposition and independent groups. \nRussian Foreign Minister Sergei Lavrov helped open the Sochi conference on Tuesday by reading out a statement from President Vladimir Putin saying the conditions were ripe for Syria to turn “a tragic page” in its history. \nBut some delegates stood up and began heckling him, accusing Moscow of killing civilians in Syria with its air strikes. Participants attend a session of the Syrian Congress of National Dialogue in the Black Sea resort of Sochi, Russia January 30, 2018. REUTERS/Sergei Karpukhin \nThe incident was broadcast on Russian state TV where two security guards were shown approaching one man in the audience indicating that he should sit down. \nOther delegates shouted out their support for Russia. FLAG ROW \nIn a further setback, one group of delegates, which included members of the armed opposition who had flown in from Turkey, refused to leave Sochi airport until Syrian government flags and emblems - which they said were offensive - had been removed. Slideshow (6 Images) \nAhmed Tomah, the head of the delegation, said his group had boycotted the congress and would fly back to Turkey because of the flag row and what he called broken promises to end the bombardment of civilians. \n“We were surprised that none of the promises that were given had been kept, the ferocious bombing of civilians had not stopped. Nor were the flags and banners of the regime removed,” he said in a video recorded at the airport. \nArtyom Kozhin, a senior diplomat at the Russian Foreign Ministry, acknowledged there had been some complications. \n“Some problems have arisen with a group of the armed opposition that has come from Turkey which has made its participation dependent on additional demands,” he wrote on social media. \nLavrov had spoken by phone twice to his Turkish counterpart and been told that the problem would be resolved, said Kozhin. \nTurkish and Iranian government delegations also attended the congress. \nVitaly Naumkin, a Russian expert on the Middle East who serves as an adviser to de Mistura, told reporters the problems encountered by organizers had not tarnished the event. \n“Nothing awful happened,” said Naumkin. “Nobody is fighting anyone else. Nobody is killing anyone. These were standard working moments.” Additional reporting by Tom Perry and Dahlia Nehme in Beirut, Tulay Karadeniz in Ankara, Tom Miles in Geneva, Michelle Nichols at the United Nations and Suleiman Al-Khalidi in Amman; writing by Andrew Osborn; editing by Peter Graff, Gareth Jones and G Crosse", "external_links": [], "published": "2018-01-30T10:01:00.000+02:00", "crawled": "2018-01-30T10:17:50.035+02:00", "highlightTitle": ""}