{"organizations": [], "uuid": "0d42f3ab5b8013afdad260e9d7c869dc2136187e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-brennan-investment-group-acquires-86-acre-ohare-infill-site.html", "country": "US", "domain_rank": 767, "title": "Brennan Investment Group Acquires 86 Acre O'Hare Infill Site", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.999, "site_type": "news", "published": "2018-01-25T14:30:00.000+02:00", "replies_count": 0, "uuid": "0d42f3ab5b8013afdad260e9d7c869dc2136187e"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/pr-newswire-brennan-investment-group-acquires-86-acre-ohare-infill-site.html", "ord_in_thread": 0, "title": "Brennan Investment Group Acquires 86 Acre O'Hare Infill Site", "locations": [], "entities": {"persons": [{"name": "brennan investm", "sentiment": "negative"}, {"name": "michael brennan", "sentiment": "none"}, {"name": "brennan", "sentiment": "none"}], "locations": [{"name": "chicago", "sentiment": "none"}, {"name": "elk grove technology park", "sentiment": "none"}, {"name": "o'hare", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "south", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "oakton boulevard", "sentiment": "none"}, {"name": "east", "sentiment": "none"}, {"name": "king street", "sentiment": "none"}], "organizations": [{"name": "brennan investment group acquires", "sentiment": "negative"}, {"name": "greenfield partners", "sentiment": "none"}, {"name": "brennan investment group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO, Jan. 25, 2018 /PRNewswire/ -- In a complex assemblage involving 10 parcels, Brennan Investment Group acquired and simultaneously announced its intention to commence construction of the Elk Grove Technology Park, dedicated to users in the emerging areas of e-commerce, digital manufacturing, and data centers. Brennan and Greenfield Partners formed a joint venture to acquire, construct, and lease the largest unimproved land site in the O'Hare marketplace.\nThe approximate boundaries of the 85.76-acre site are Higgins Roads on the North, Lively Road on the East, Oakton Boulevard on the South, and King Street on the West.\n\"America is experiencing an Industrial Renaissance that is having profound effects on retail, manufacturing, and distribution,\" stated Michael Brennan, Chairman and Managing Principal at Brennan Investment Group. \"Industrial users that invest significantly in technology are facing an acute shortage of modern facilities that are strategically located and aesthetically pleasing.\" Brennan will initiate development by constructing an amenity rich infrastructure with ponds, water features, sculptures, bike paths, and pedestrian walkways.\nIndustrial occupancy in the O'Hare market- Chicago's top industrial submarket- is above 97%, with the Class A market virtually 99% leased. \"O'Hare's current and historical occupancy numbers reflect the powerful economic engine that O'Hare has always been,\" said Brad O'Halloran, Managing Principal of Brennan Investment Group. \"Future state and municipal infrastructure spending in, and around O'Hare, will ensure its continuing economic contribution to Chicago and the Midwest.\"\nCBRE was selected to be the exclusive leasing agent for the project, Mike Sedjo, Jack Brennan, and John Hamilton will lead the industrial efforts; Todd Bateman, North American practice leader for CBRE's Data Center Solutions team, will coordinate data center leasing.\n\"We've assembled a great marketing team to represent a world class project in Chicago's best submarket,\" said Kevin Brennan, Brennan's Managing Principal for Chicago and the Midwest. \"We are excited to have the privilege of serving a new generation of industrial customers in the Elk Grove Technology Park.\"\nTo learn more, visit: https://www.elkgrovetechnologypark.com/\nAbout Brennan Investment Group\nBrennan Investment Group, a Chicago-based private real estate investment firm, acquires, develops, and operates industrial properties in select major metropolitan markets throughout the United States. Since 2010, Brennan Investment Group has acquired over $3 billion in industrial real estate. The company's current portfolio spans 27 states and encompasses over 35 million square feet.\nBrennan Investment Group co-invests with private and institutional capital to achieve outstanding risk-adjusted returns. The firm's management team is among the most accomplished in its industry, having invested in over 4,000 properties covering more than 60 cities throughout the United States, Canada and Europe.\nFor more information on Brennan Investment Group, go to brennanllc.com .\nAbout Greenfield Partners\nGreenfield Partners is a private equity real estate firm headquartered in Westport, CT with $3.3 billion in gross assets under management. Over its 20-year history, Greenfield has invested over $5 billion in equity across multiple investment types including 25 MM SF of industrial, 6.6 MM SF of air cargo assets, 27 MM SF of office, 41 hotels, and 7,500 multifamily units.\nFor more information, please visit www.greenfieldpartners.com .\nContact: Sarah Brennan, sbrennan@brennanllc.com .\nView original content with multimedia: http://www.prnewswire.com/news-releases/brennan-investment-group-acquires-86-acre-ohare-infill-site-300587910.html\nSOURCE Brennan Investment Group", "external_links": ["https://www.elkgrovetechnologypark.com/", "http://www.prnewswire.com/news-releases/brennan-investment-group-acquires-86-acre-ohare-infill-site-300587910.html", "http://www.greenfieldpartners.com/", "http://brennanllc.com/"], "published": "2018-01-25T14:30:00.000+02:00", "crawled": "2018-01-25T14:20:50.016+02:00", "highlightTitle": ""}