{"organizations": [], "uuid": "dbc72ce34c08712f3cd6d8c4f8751c92031bf77d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews\r", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/global-metals/metals-lme-copper-gains-as-u-s-dollars-rise-slows-idUSL4N1P42IX", "country": "US", "domain_rank": 408, "title": "METALS-LME copper gains as U.S. dollar's rise slows", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-09T09:33:00.000+02:00", "replies_count": 0, "uuid": "dbc72ce34c08712f3cd6d8c4f8751c92031bf77d"}, "author": "", "url": "https://www.reuters.com/article/global-metals/metals-lme-copper-gains-as-u-s-dollars-rise-slows-idUSL4N1P42IX", "ord_in_thread": 0, "title": "METALS-LME copper gains as U.S. dollar's rise slows", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " 36 AM / Updated 5 minutes ago METALS-LME copper gains as U.S. dollar's rise slows Reuters Staff \n(Updates prices) \nBy UJames Regan \nSYDNEY, Jan 9 (Reuters) - London copper prices firmed on Tuesday as the U.S. dollar lost steam, while Shanghai copper recovered from a drop in the previous session to trade marginally higher. \nLondon copper hit a two-week low overnight, weighed down by a stronger dollar, which encouraged sellers in the benchmark U.S. dollar-denominated contract. \n* LONDON COPPER: Three-month copper on the London Metal Exchange was up 0.5 percent at $7,160 a tonne by 0700 GMT, after closing almost unchanged in the previous session. Prices topped out at $7,312.50 a tonne on Dec. 28, the highest since January, 2014. \n* SHANGHAI COPPER: The most-traded copper contract on the Shanghai Futures Exchange ended 0.75-percent higher at 55,010 yuan ($8,458.91) a tonne. It dropped 0.9 percent on Monday. \n* CHINA RESTRICTS: As China tightens restrictions on imports of foreign waste, Chinese metal recyclers and even smelters like Jiangxi Copper Co are increasingly looking to use Southeast Asian countries as an alternative location for the processing of copper scrap. \n* QATAR: An affiliate of Qatari conglomerate Aamal Co plans to build three factories to produce copper wire, aluminium bars and drums for cables, projects that could make the country more self-reliant in the face of an embargo by other Arab states. \n* FOREX: The yen jumped on Tuesday after the Bank of Japan trimmed its buying of long-dated Japanese government bonds in market operations, helping to stoke speculation about a future exit from its massive stimulus policy. The yen rose about 0.4 percent to 112.62 yen to the dollar, bouncing back further from its two-week low of 113.40 per dollar touched on Monday. \n* OTHER METALS: ShFE nickel ended up 1.38 percent, while LME nickel was 0.67-percent firmer at $12,615. ShFE zinc closed up 1.4 percent. LME zinc was 0.4 percent-higher at $3,399.50, its strongest since 2007. Concerns over dwindling stockpiles MZN-STOCKS and a market deficit were driving the gains. \n* ZINC BANG: Zinc has started the new year with a bang, hitting a fresh 10-year high of $3,380 per tonne in the first week of trading on the LME. PRICES", "external_links": [], "published": "2018-01-09T09:33:00.000+02:00", "crawled": "2018-01-09T09:47:54.013+02:00", "highlightTitle": ""}