{"organizations": [], "uuid": "6ce804787bdd8a38b3d48d70eec5aa3e2c57de3b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/business-wire-mevion-receives-510k-clearance-for-hyperscan-pencil-beam-scanning.html", "country": "US", "domain_rank": 767, "title": "Mevion Receives 510(k) Clearance for HYPERSCAN Pencil Beam Scanning", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 1.0, "site_type": "news", "published": "2018-01-03T17:00:00.000+02:00", "replies_count": 0, "uuid": "6ce804787bdd8a38b3d48d70eec5aa3e2c57de3b"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/business-wire-mevion-receives-510k-clearance-for-hyperscan-pencil-beam-scanning.html", "ord_in_thread": 0, "title": "Mevion Receives 510(k) Clearance for HYPERSCAN Pencil Beam Scanning", "locations": [], "entities": {"persons": [{"name": "joseph jachinowski", "sentiment": "none"}], "locations": [{"name": "mass.", "sentiment": "none"}, {"name": "littleton", "sentiment": "none"}], "organizations": [{"name": "mevion medical systems", "sentiment": "negative"}, {"name": "pbs", "sentiment": "none"}, {"name": "georgetown university hospital", "sentiment": "none"}, {"name": "medstar georgetown university hospital", "sentiment": "none"}, {"name": "hyperscan pencil beam scanning", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LITTLETON, Mass.--(BUSINESS WIRE)-- Mevion Medical Systems has received FDA 510(k) clearance for the MEVION S250i Proton Therapy System ® including HYPERSCAN™ pencil beam scanning (PBS) technology. HYPERSCAN PBS introduces novel energy layer switching and automated collimation systems. These advantages enable the S250i™ system to deliver faster, sharper, and more robust PBS proton radiation treatments.\nThis press release features multimedia. View the full release here: http://www.businesswire.com/news/home/20180103005398/en/\nThe MEVION S250i Proton Therapy System with HYPERSCAN Pencil Beam Scanning is shown here, fully installed at MedStar Georgetown University Hospital. Georgetown University Hospital will be the first hospital in the world to deliver proton therapy using HYPERSCAN technology. (Photo: Business Wire)\n“The S250i system represents the next generation of intensity modulated proton therapy (IMPT) delivered in the most compact proton therapy platform,” said Joseph Jachinowski, CEO of Mevion Medical Systems. “We are proud that the MEVION S250i system now has received both FDA clearance and CE mark. This is a very important milestone in our efforts to make precision proton therapy available to more patients in the fight against cancer.”\nNext Generation Intensity Modulated Proton Therapy (IMPT)\nThe MEVION S250i™ system is a compact proton therapy system capable of delivering conformal radiation therapy treatments using HYPERSCAN pencil beam scanning technology. The design of HYPERSCAN PBS technology overcomes clinical challenges that were previously faced by first generation PBS systems.\nPencil beam scanning systems shape the delivered radiation dose by “painting” tumors spot-by-spot and layer-by-layer with sub-atomic particles. Prior to HYPERSCAN PBS, scanning proton systems struggled with delivery speed. Long delivery times can undermine the high precision of the treatment due to the target tumor shifting under normal organ motion such as breathing.\nHYPERSCAN PBS uses a compact beam delivery path reducing delivery times to less than 5 seconds for some fields. This “hyper-fast” treatment delivery reduces treatment errors due to the sensitivity to motion that current PBS technologies face when treating tumors affected by organ motion.\nIn addition, HYPERSCAN PBS utilizes, the Adaptive Aperture™ proton multi-leaf collimator (pMLC). This technology uses a robotically controlled collimation system, capable of trimming the edges of the beam at every layer of delivery. This capability delivers up to a three times sharper drop off in radiation at the delivery field edge. This improves sparing of healthy tissue and limits unnecessary radiation to sensitive locations.\nWorld’s First HYPERSCAN PBS Installation\nMedStar Georgetown University Hospital in Washington, D.C. will be the first hospital in the world to offer this latest generation of HYPERSCAN PBS once final onsite testing is completed this month.\n“We are excited to be not only the first and only proton therapy system in the Washington, D.C. area, but also the first in the world to offer these advanced proton therapy treatment capabilities to our patients and community. Currently, patients who seek proton therapy need to leave the metropolitan D.C. area, which can be a significant burden on families,” said Brian T. Collins, MD, clinical director of MedStar Georgetown Proton Therapy Center. “We will now be delivering advanced proton therapy, fully integrated into our broad set of comprehensive cancer care offerings. This is critical to the patients we serve.”\nBuilt on Leading Compact Proton Therapy Technology\nThe MEVION S250i system is based on Mevion’s high efficiency, low financial risk S250™ Series platform. The core technology of the S250 Series is the world’s only gantry mounted superconducting synchrocyclotron. This compact, fully integrated platform has years of successful clinical experience and proven financial viability.\nWhile proton therapy has clear dosimetric advantages, the costs of early systems has been a significant barrier to adoption. The MEVION S250i reduces this barrier through lower capital costs, reduced operating costs, and increased treatment throughput. Mevion customers have achieved the fastest per-room patient ramp-up in the history of proton therapy. Demonstrating that compact proton therapy is a viable option for any size cancer center is core to Mevion’s mission of making proton therapy accessible to as many patients as possible.\nAbout Mevion Medical Systems®\nMevion Medical Systems, Inc. is a leading provider of proton therapy systems for use in radiation treatment for cancer patients. Mevion is based in Littleton, Massachusetts, with a presence in the Europe, Japan and China. For more information, please visit www.mevion.com .\nFollow Mevion on Twitter: https://twitter.com/mevionmedical\nConnect with Mevion on LinkedIn: https://www.linkedin.com/company/mevion-medical-systems\nLPR180103\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180103005398/en/\nMevion\nMelanie Benton, 978-540-1551\nmbenton@mevion.com\nSource: Mevion Medical Systems", "external_links": ["https://www.linkedin.com/company/mevion-medical-systems", "http://www.businesswire.com/news/home/20180103005398/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.medstargeorgetown.org%2Four-services%2Fcancer-care%2Ftreatments%2Fproton-beam-therapy%2F%23q%3D&esheet=51736958&newsitemid=20180103005398&lan=en-US&anchor=MedStar+Georgetown+University+Hospital&index=2&md5=a984ec267d7fb241df742c4b962910a5", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.mevion.com&esheet=51736958&newsitemid=20180103005398&lan=en-US&anchor=www.mevion.com&index=3&md5=999bffd0657cbc6069c6d05bca7d213e", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2Fmevionmedical&esheet=51736958&newsitemid=20180103005398&lan=en-US&anchor=https%3A%2F%2Ftwitter.com%2Fmevionmedical&index=4&md5=9ef218b28430101e048cc1102a98a335", "https://twitter.com/mevionmedical", "http://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Fmevion-medical-systems&esheet=51736958&newsitemid=20180103005398&lan=en-US&anchor=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Fmevion-medical-systems&index=5&md5=cf16b51d0d620401efead6648850b8fb", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.mevion.com%2Fproducts%2Fmevion-s250i-hyperscan-adaptive-aperturetm&esheet=51736958&newsitemid=20180103005398&lan=en-US&anchor=MEVION+S250i+Proton+Therapy+System&index=1&md5=800043e3e76ca9e4f5b523fc335f2597"], "published": "2018-01-03T17:00:00.000+02:00", "crawled": "2018-01-03T16:31:14.010+02:00", "highlightTitle": ""}