{"organizations": [], "uuid": "dde2361e85253bd711b2d13d6637379cea94ec61", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180104&t=2&i=1219178778&w=1200&r=LYNXMPEE03008", "site_section": "http://www.topix.com/rss/wire/world/europe", "section_title": "", "url": "https://www.reuters.com/article/uk-britain-eu-blair/tony-blair-warns-british-voters-time-is-running-out-to-stop-brexit-folly-idUSKBN1ET00F", "country": "US", "domain_rank": 408, "title": "Tony Blair warns British voters: time is running out to stop Brexit folly", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-04T02:20:00.000+02:00", "replies_count": 0, "uuid": "dde2361e85253bd711b2d13d6637379cea94ec61"}, "author": "", "url": "https://www.reuters.com/article/uk-britain-eu-blair/tony-blair-warns-british-voters-time-is-running-out-to-stop-brexit-folly-idUSKBN1ET00F", "ord_in_thread": 0, "title": "Tony Blair warns British voters: time is running out to stop Brexit folly", "locations": [], "entities": {"persons": [{"name": "tony blair", "sentiment": "negative"}, {"name": "blair", "sentiment": "none"}, {"name": "guy faulconbridge", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "LONDON (Reuters) - Former British Prime Minister Tony Blair on Thursday warned voters that time was running out to reverse Brexit, a folly he said would torpedo Britain’s remaining clout and be regretted for generations to come.\nMore than a year and a half since the 2016 Brexit vote, the United Kingdom remains deeply divided over the planned EU exit that Prime Minister Theresa May says will take place on March 29, 2019.\nBoth opponents and supporters of Brexit agree that the divorce is Britain’s most significant geopolitical move since World War Two, though they cast vastly different futures for the $2.5 trillion UK economy and its relation with the world’s biggest trading bloc.\nBlair, Labour prime minister from 1997 to 2007, said Britain would be poorer, weaker and warned that May had solved none of the problems over Northern Ireland’s post-Brexit status.\n“We are making an error the contemporary world cannot understand and the generations of the future will not forgive,” Blair said in an article published on his website on Thursday.\n“2018 will be the last chance to secure a say on whether the new relationship proposed with Europe is better than the existing one,” Blair, 64, said.\nLeaving the European Union was once far-fetched: just over 15 years ago, British leaders such as Blair were arguing about when to join the euro, and talk of an EU exit was the reserve of sceptics on the fringes of both major parties.\nBut the turmoil of the euro zone crisis, fears in Britain about immigration and a series of miscalculations by former Prime Minister David Cameron prompted the United Kingdom to vote 52 to 48 percent for Brexit in a June 2016 referendum.\nBlair has repeatedly called for reversing Brexit, echoing other opponents of Brexit such as French President Emmanuel Macron and billionaire investor George Soros, who have suggested that Britain could still change its mind.\nSo far, opinion polls show little sign of a change of heart and it is unclear how Brexit could be stopped if both major political parties officially support the divorce.\nHalf of Britons support a second vote on whether to leave the European Union and a majority think the government may be paying too much money to the EU to open the way to trade talks, according to an opinion poll published last month.\nSupporters of Brexit dismissed Blair and said he was undermining both the British negotiation and the will of the people.\n“Blair and his elitist gang are damaging our negotiating strength, thus damaging our national interest by their continuing efforts to undermine democracy,” said Richard Tice, who helped found one of the two Leave campaign groups.\n“History will not forgive them,” Tice told Reuters.\nBlair is unpopular in Britain for his decision to back then-U.S. President George W. Bush’s 2003 invasion of Iraq and the justification he used for going into a war that cost the deaths of 150,000 Iraqi civilians and 179 British soldiers.\nBut he has become increasingly outspoken about Brexit.\nHe implored his Labour Party, which is now led by socialist Jeremy Corbyn, to join the fight to stop Brexit.\n“Make Brexit the Tory Brexit. Make them own it 100 percent,” Blair said. “If Labour continues to go along with Brexit and insists on leaving the Single Market, the handmaiden of Brexit will have been the timidity of Labour.”\nEditing by Robin Pomeroy\nOur Standards: The Thomson Reuters Trust Principles.", "external_links": [], "published": "2018-01-04T02:20:00.000+02:00", "crawled": "2018-01-04T02:26:07.007+02:00", "highlightTitle": ""}