{"organizations": [], "uuid": "0012e9f22d5029e4ecb796a7c182441c7790253d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027/page/5", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/11/business-wire-quotewizard-acquires-bantam-connect-insurance-awarm-calla-transfer-innovator.html", "country": "US", "domain_rank": 767, "title": "QuoteWizard Acquires Bantam Connect, Insurance “Warm Call” Transfer Innovator", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-11T16:01:00.000+02:00", "replies_count": 0, "uuid": "0012e9f22d5029e4ecb796a7c182441c7790253d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/11/business-wire-quotewizard-acquires-bantam-connect-insurance-awarm-calla-transfer-innovator.html", "ord_in_thread": 0, "title": "QuoteWizard Acquires Bantam Connect, Insurance “Warm Call” Transfer Innovator", "locations": [], "entities": {"persons": [{"name": "bantam", "sentiment": "none"}], "locations": [{"name": "rancho cordova", "sentiment": "none"}, {"name": "cho cordova", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}, {"name": "ca", "sentiment": "none"}], "organizations": [{"name": "quotewizard acquires bantam connect", "sentiment": "negative"}, {"name": "bantam connect", "sentiment": "none"}, {"name": "bantam", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Deal enhances Quote: Wizard's consumer acquisition solutions for top carrier customers\nSEATTLE & RANCHO CORDOVA, Calif.--(BUSINESS WIRE)-- Quote: Wizard, the nation’s largest privately held insurance comparison marketplace, today announced that it has acquired Bantam Connect (“Bantam”), a pioneer in providing the insurance industry with warm call transfers. Bantam’s innovative lead generation technology connects calls from ready-to-purchase insurance consumers directly to carriers, providing warm call transfer consumer acquisition services.\nThe addition of Bantam allows Quote: Wizard to grow and enhance the technological potential of its calls service, diversify its product offerings, and increase its customer traffic acquisition capabilities. As part of the acquisition, Quote: Wizard will retain all of Bantam’s management team and ongoing call center operations located in Rancho Cordova, CA. The transaction is effective immediately and all of Bantam’s approximately 30 employees have become Quote: Wizard employees, with plans for the profitable operation to continue growing under the Quote: Wizard brand.\nAs the largest privately-held insurance comparison marketplace in the industry, Quote: Wizard has helped nearly 40 million consumers in their quest for their ideal insurance policy since 2006.\nBantam offers integrated warm call transfers, inbound call programs and real-time insurance leads for several insurance segments. Bantam’s call center provides 100% contact rates for its call transfer clients, allowing carriers and agents to seamlessly connect with customers. Bantam’s filtering options allow clients to precisely target the leads they seek, based on specific criteria such as type of insurance, location, coverage levels, and more.\n“We’re excited to incorporate Bantam’s capabilities and team into our company,” said Quote: Wizard founder and CEO Scott Peyree. “This acquisition is key to our goal of providing top quality warm call transfers and inbound calls to our insurance partners. Combining Bantam’s Call Products with our Lead and Click offerings, we are now the only company in our industry offering a full suite of top quality, end-to-end customer acquisition solutions to our clients. Our consumers now will receive even more comparison choices when using our insurance shopping services. We plan on leveraging Bantam’s industry-leading technology to reach our goal of being the leading online destination for Americans looking for insurance.”\n“Joining forces with a thriving company such as Quote: Wizard is a fantastic opportunity for us to scale our calls operation at a rate that neither entity could have achieved on their own,” said Brad Cooper, CEO of Bantam. “Combining with Quote: Wizard will allow us to quickly expand and refine our warm call transfer capabilities for a larger audience.”\nThe acquisition builds on Quote: Wizard’s status as the fastest-growing consumer destination website in the U.S. for online insurance shoppers.\nAbout Bantam Connect:\nBased out of Rancho Cordova, California, Bantam Connect ( bantamconnect.com ) has quickly established itself as an industry leader in insurance lead generation and warm call transfers since 2016. The company serves consumers looking to save money on auto, home, health, and life insurance. The company specializes in warm call transfers, allowing consumers to instantly connect with insurance providers.\nAbout Quote: Wizard:\nQuote: Wizard ( Quote: wizard.com ) is an insurance comparison marketplace for consumers looking to save on insurance. Quote: Wizard provides consumers with direct access to thousands of qualified agents in all 50 states, as well as major carriers, who offer personalized Quote: s and the opportunity to save up to 40% on auto, home, and health insurance. Agents and carriers, in turn, benefit from millions of highly qualified leads, calls and traffic to their sites. Based in Seattle, WA, Quote: Wizard was founded in 2006.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180111005299/en/\nFor Quote: Wizard\nMark S. Peterson, 206-390-0204\nMark(at) pointerpr.com\nSource: Quote: Wizard", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fbantamconnect.com&esheet=51741612&newsitemid=20180111005299&lan=en-US&anchor=bantamconnect.com&index=1&md5=653eda3f0c8e148cb9cbf764906da4b3", "http://www.businesswire.com/news/home/20180111005299/en/", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.quotewizard.com%2F&esheet=51741612&newsitemid=20180111005299&lan=en-US&anchor=quotewizard.com&index=2&md5=eefc0490d3ec5e8ccbab8003ab58f725"], "published": "2018-01-11T16:01:00.000+02:00", "crawled": "2018-01-11T19:34:55.017+02:00", "highlightTitle": ""}