{"organizations": [], "uuid": "73f4981516566641e49483c7f7a9983609a9c113", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/25/business-wire-mediwarea-acquires-medtrandirecta.html", "country": "US", "domain_rank": 767, "title": "Mediware® Acquires MEDTranDirect™", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-25T17:35:00.000+02:00", "replies_count": 0, "uuid": "73f4981516566641e49483c7f7a9983609a9c113"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/25/business-wire-mediwarea-acquires-medtrandirecta.html", "ord_in_thread": 0, "title": "Mediware® Acquires MEDTranDirect™", "locations": [], "entities": {"persons": [{"name": "mediwar", "sentiment": "negative"}, {"name": "bill miller", "sentiment": "none"}], "locations": [{"name": "kan.", "sentiment": "none"}, {"name": "lenexa", "sentiment": "none"}, {"name": "mediware", "sentiment": "none"}], "organizations": [{"name": "tpg capital", "sentiment": "none"}, {"name": "medicare", "sentiment": "none"}, {"name": "mediware information systems, inc.", "sentiment": "none"}, {"name": "medtrandirect, inc.", "sentiment": "none"}, {"name": "mediware", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Transaction adds complementary revenue cycle and claims processing capabilities that enhance Mediware’s position as software leader in the healthcare and human services markets\nFurther demonstrates Mediware’s commitment to improving the efficiency of patient care\nLENEXA, Kan.--(BUSINESS WIRE)-- Mediware Information Systems, Inc., a portfolio company of TPG Capital, announced today it has acquired MEDTranDirect, Inc., a leader in software solutions for healthcare revenue cycle management and an approved network service vendor for Medicare. The transaction complements the revenue cycle management and Medicare claims capabilities in Mediware’s leading home care market solution, Kinnser Software®, while simultaneously leveraging Mediware’s heritage of supporting data-driven clinical excellence and improving efficiencies in administrative workflow.\n\"At Mediware, we are transforming and empowering data-driven decision-making across the continuum of care to help providers determine the most cost-effective paths to improving patient outcomes,” said Bill Miller, CEO of Mediware. “With the addition of MEDTranDirect to our portfolio, we are extending our software’s capability to help home care customers support, sustain, and grow their businesses by overcoming the increasing challenges of Medicare reimbursement and revenue flow. MEDTranDirect has a proven track record in this market, and we're proud to welcome them to the Mediware family.\"\nEstablished in 1986, MEDTranDirect serves several hundred customers, including providers in the home health, hospice, skilled nursing facility, rehabilitation and rural hospital markets. MEDTranDirect streamlines the submission and processing of providers’ claims to Medicare, Medicaid, and commercial payers, and supports eligibility and remittance transactions, thereby accelerating revenue cycles and improving cash flow. In addition, it is approved to use the Medicare Limited Data Set files to develop analytics solutions for the home health and hospice markets.\n“Mediware shares our mission and commitment to helping providers deliver the best possible care to patients,” said Kalon Mitchell, founder and president of MEDTranDirect. “By combining our efforts, we can continue providing our customers with software that keeps their businesses running smoothly, while also enhancing services, thanks to Mediware’s greater resources and expanded customer support. We are enthusiastic about working with the Mediware team to continue developing innovative claims technologies to make our current and new customers more successful.”\nMEDTranDirect’s capabilities will eventually integrate with other Mediware software products that collectively provide customers with comprehensive software solutions across the entire care continuum – including home health, hospice, rehabilitation, home infusion, medication management, blood management, and more.\nAbout Mediware\nMediware is a leading supplier of software for healthcare and human service providers and payers. Core Mediware solutions include blood management technologies for hospitals and blood centers; cell therapy solutions for cord blood banks, cancer treatment centers, and research facilities; medication management solutions for hospitals, behavioral health facilities, infusion and specialty pharmacy providers; and rehabilitation therapy and respiratory care solutions. For more information about Mediware products and services, visit our website at www.mediware.com .\nAbout MEDTranDirect\nMEDTranDirect provides SaaS technology solutions for processing and managing HIPAA compliant healthcare transactions such as eligibility, claims and remittances. MEDTranDirect was one of the first approved network services vendors (NSVs), allowing direct access to Medicare’s payments systems, and serves clients in the home health, hospice, skilled nursing, rehab and rural hospital markets. For more information about MEDTranDirect products and services, visit our website at www.medtrandirect.com .\nAbout TPG\nTPG is a leading global alternative asset firm founded in 1992 with more than $73 billion of assets under management and offices in Austin, Beijing, Boston, Dallas, Fort Worth, Hong Kong, Houston, London, Luxembourg, Melbourne, Moscow, Mumbai, New York, San Francisco, Seoul, and Singapore. TPG’s investment platforms are across a wide range of asset classes, including private equity, growth venture, real estate, credit, and public equity. TPG aims to build dynamic products and options for its investors while also instituting discipline and operational excellence across the investment strategy and performance of its portfolio. For more information, visit www.tpg.com .\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180125005424/en/\nMediware\nChip Schneider, 512.879.3135 x15107\nchip.schneider@kinnser.com\nor\nEdelman\nJennifer Stroud, 415-780-2553\njennifer.stroud@edelman.com\nSource: Mediware Information Systems, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.medtrandirect.com&esheet=51748732&newsitemid=20180125005424&lan=en-US&anchor=www.medtrandirect.com&index=2&md5=919ba3801fe97314fc7379f604a357c8", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.mediware.com&esheet=51748732&newsitemid=20180125005424&lan=en-US&anchor=www.mediware.com&index=1&md5=a9cfb7dffedb0d383dbfb40d97be7078", "http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.tpg.com&esheet=51748732&newsitemid=20180125005424&lan=en-US&anchor=www.tpg.com&index=3&md5=37e639a9d74d4ba3bdb10ee7a9e592b8", "http://www.businesswire.com/news/home/20180125005424/en/"], "published": "2018-01-25T17:35:00.000+02:00", "crawled": "2018-01-25T18:17:42.004+02:00", "highlightTitle": ""}