{"organizations": [], "uuid": "3006dc7946fe65fdfc7bbd187ccf8d09c3c8145c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180105&t=2&i=1219700968&w=1200&r=LYNXMPEE0419D", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/us-twitter-trump/twitter-again-says-it-will-not-remove-world-leaders-like-trump-idUSKBN1EU23K", "country": "US", "domain_rank": 408, "title": "Twitter again says it will not remove world leaders like Trump", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-05T23:57:00.000+02:00", "replies_count": 0, "uuid": "3006dc7946fe65fdfc7bbd187ccf8d09c3c8145c"}, "author": "", "url": "https://www.reuters.com/article/us-twitter-trump/twitter-again-says-it-will-not-remove-world-leaders-like-trump-idUSKBN1EU23K", "ord_in_thread": 0, "title": "Twitter again says it will not remove world leaders like Trump", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "david ingram", "sentiment": "none"}, {"name": "jonathan oatis", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}], "organizations": [{"name": "twitter", "sentiment": "negative"}, {"name": "reuters", "sentiment": "none"}, {"name": "twitter inc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO (Reuters) - Twitter Inc on Friday reiterated its stance that accounts belonging to world leaders have special status on the social media network, pushing back against users who have called on the company to banish U.S. President Donald Trump.\n“Blocking a world leader from Twitter or removing their controversial Tweets would hide important information people should be able to see and debate,” Twitter said in a post on a corporate blog.\nTwitter had already said in September that “newsworthiness” and whether a tweet is “of public interest” are among the factors it considers before removing an account or a tweet.\nThe debate over Trump’s tweeting, though, raged anew after Trump said from his @realDonaldTrump account on Tuesday that he had a “much bigger” and “more powerful” nuclear button than North Korean leader Kim Jong Un.\nCritics said that tweet and Trump’s continued presence on the network endanger the world and violate Twitter’s ban on threats of violence. Some users protested at Twitter’s San Francisco headquarters on Wednesday.\nFILE PHOTO: A man reads tweets on his phone in front of a displayed Twitter logo in Bordeaux, southwestern France, March 10, 2016. REUTERS/Regis Duvignau/Illustration/File Photo Twitter responded in its blog post that even if it did block a world leader, doing so would not silence that leader.\nThe company said that it does review tweets by world leaders and enforces its rules accordingly, leaving open the possibility that it could take down some material posted by them.\n“No one person’s account drives Twitter’s growth, or influences these decisions,” the company added. “We work hard to remain unbiased with the public interest in mind.”\nThe White House did not immediately respond to a request for comment on Twitter’s statement.\nSome Twitter users expressed support for the company’s decision, while others complained of a double standard.\n“If I tweeted half of what Trump has since he entered office, I’d be permanently banned from this platform,” a Twitter user wrote from the account @michaelranaii.\nReporting by David Ingram in San Francisco; Additional reporting by Steve Holland in Washington; Editing by Jonathan Oatis\n ", "external_links": [], "published": "2018-01-05T23:57:00.000+02:00", "crawled": "2018-01-06T00:08:52.007+02:00", "highlightTitle": ""}