{"organizations": [], "uuid": "782153ff06fe295decf86a35b61d91aa2e043bad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/22/104959611-GettyImages-905323654-haiti.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100370673/device/rss/rss.html", "section_title": "Commentary", "url": "https://www.cnbc.com/2018/01/23/a-norwegian-immigrant-is-not-better-than-a-haitian-for-the-economy-commentary.html", "country": "US", "domain_rank": 767, "title": "A Norwegian immigrant is not better than a Haitian for the economy--commentary", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T16:00:00.000+02:00", "replies_count": 0, "uuid": "782153ff06fe295decf86a35b61d91aa2e043bad"}, "author": "cnbc.com", "url": "https://www.cnbc.com/2018/01/23/a-norwegian-immigrant-is-not-better-than-a-haitian-for-the-economy-commentary.html", "ord_in_thread": 0, "title": "A Norwegian immigrant is not better than a Haitian for the economy--commentary", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}], "locations": [{"name": "haiti", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "el salvador", "sentiment": "none"}, {"name": "norway", "sentiment": "none"}, {"name": "america", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Trump administration on January 18 remove d Haiti from the list of countries eligible for the H2A and H2B temporary visas for low-skilled workers.\nIt is unlikely that this decision, which was based on a longer policy process, was directly linked to President Trump's recent racist comments questioning why the U.S. accepts immigrants from countries like Haiti, El Salvador and African nations and why we don't bring in more from Norway.\nNevertheless, it is consistent with a strategy of restricting opportunities for legal migration, especially for less skilled applicants.\nTo the extent that President Trump's comments and policy moves reflect a focus on reducing the number of low-skilled immigrants, they also rest on bad economics. This approach is wrongheaded. U.S. labor immigration policy should focus on the current and future needs of the American economy, and should be informed by a systematic examination of the data.\nDesigning a policy that responds to these needs is what would put America and its economic interests first.\nThere is clear economic evidence that migrant workers fill important gaps in the U.S. labor market across the skills spectrum . One area where migrants provide critical contributions is in U.S. agricultural production.\nA 2013 study showed that at the height of the Great Recession in North Carolina, unemployment reached 12 percent. But among a half a million unemployed American workers in the state, only 250 applied for 6,500 open agricultural jobs. The temporary Mexican agricultural workers hired for these positions filled a true labor gap and added value to the U.S. economy-a far cry from \"stealing jobs\" from native workers.\nAn existing shortage of nurses is worsening, with a deficit of 1.2 million nurses expected by 2022. Currently 15 percent of nurses are foreign-born; a visa introduced specifically to address the shortage expired in 2009.\nAnd as the population grays, labor needs will only continue to increase .\nThe growing need for workers at many points along the skills spectrum can't be filled by Norway or other highly developed countries that President Trump might consider more \"desirable\" because of the size and nature of U.S. labor needs. We need people to bus tables at restaurants, care for children, and fill high-tech jobs. Even the most dramatic policy changes wouldn't attract enough workers.\nAnd while Norwegian immigrants undoubtedly contribute to the U.S. economy, their numbers are small and decreasing, from 63,000 in 1980 to 23,000 in 2016, because they have little incentive to leave. Norway is ranked as the globe's happiest and most developed country.\nAn immigration policy that generates greater economic benefits and aligns with our values puts America first-while also delivering gains to our partners. With well-designed policies, migration can achieve a 'triple-win', benefiting destination countries, origin countries, and migrants alike.\nAfter the catastrophic 2010 earthquake, Haitians were made eligible for H2A visas to work on US farms. An evaluation of the program found that each Haitian worker added $4000 to the US economy per month . These temporary migrants also earned 15 times what they could have back in Haiti, and sent the majority of their earnings home as remittances.\nBased on Thursday's move, Haiti can no longer be a partner in this mutually-beneficial program. Haiti is the poorest country in the Western Hemisphere; allowing temporary, regulated migration both fills major U.S. labor gaps and helps achieve important development goals. We don't have to choose between being a generous, humanitarian nation and our own economic development. Indeed, studies of refugees resettled in America on the basis of humanitarian need show that they bring fiscal and economic benefits to their new communities.\nAs a businessman who employed temporary foreign workers, President Trump should have an understanding of the contributions immigrants make to the U.S. labor market. For example, he is looking for a big win in a new infrastructure bill.\nMaking it a reality would require thousands of construction workers at a time when a recent national survey found that 50 percent of construction firms struggle to fill all open job categories.\nRather than trying to limit immigrants from specific countries (and even worse, suffer the economic harms of removing them from our borders), President Trump should work with Congress to craft a solution that is aligned with American values and economic interests.\nCommentary by Cindy Huang, a senior policy fellow at the Center for Global Development and Hannah Postel, a leading researcher on international migration and development .\nFor more insight from CNBC contributors, follow @CNBCopinion on Twitter.", "external_links": [], "published": "2018-01-23T16:00:00.000+02:00", "crawled": "2018-01-23T16:16:01.004+02:00", "highlightTitle": ""}