{"organizations": [], "uuid": "aceb5c01a0765fb184b43883a4b0c58585bdcdf3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224614461&w=1200&r=LYNXMPEE0M1VH", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-grigas-davos-gas-commentary/commentary-a-tale-of-a-tanker-russian-gas-sanctions-and-energy-politics-idUSKBN1FC2WK", "country": "US", "domain_rank": 408, "title": "Commentary: A tale of a tanker, Russian gas, sanctions and energy politics", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T06:37:00.000+02:00", "replies_count": 0, "uuid": "aceb5c01a0765fb184b43883a4b0c58585bdcdf3"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-grigas-davos-gas-commentary/commentary-a-tale-of-a-tanker-russian-gas-sanctions-and-energy-politics-idUSKBN1FC2WK", "ord_in_thread": 0, "title": "Commentary: A tale of a tanker, Russian gas, sanctions and energy politics", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "neutral"}, {"name": "gaselys", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "davos", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "boston", "sentiment": "none"}], "organizations": [{"name": "world economic forum", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "After months of President Donald Trump’s promises to bring about a new era of American “energy dominance,” largely based on booming oil and natural gas production, it was surprising to learn that the United States will continue importing liquefied natural gas this winter. Even more surprising: that the country could import its first Russian LNG produced by Yamal LNG, a facility subject to U.S. financial sanctions.\nThe cargo at the heart of the controversy is carried by Gaselys, a tanker that was approaching Boston Tuesday after various delays and an unusually circuitous course generated intense speculation among energy analysts. While panelists at the World Economic Forum’s Davos meeting were discussing the implications of the new era in energy politics, the Gaselys’ much-watched route was a real-life lesson in the changing face of energy markets, the intensifying U.S.-Russian competition for global gas sales and the question of whether the United States is really on its way to achieving Trump’s goal of becoming a net exporter of energy.\nIn recent years, the cards appeared to be stacked in Washington’s favor. Thanks to the shale boom, which unlocked production of “unconventional” gas and oil, the United States emerged in 2011 as the world’s leading producer of natural gas. In 2016, American energy company Cheniere launched LNG exports across the globe, from Asia to Latin America to Europe. The golden age of American gas had finally arrived.\nThis was good news for Washington’s allies in Eastern Europe, many of whom had long been dependent on natural gas imports from their regional nemesis, Russia. Last summer saw a historic and symbolic milestone as two energy-vulnerable countries on Europe’s frontier, Poland and Lithuania, received their first American LNG shipments. At the Vilnius Energy Forum in November, the mood was jubilant, and Lithuanian energy minister Žygimantas Vaičiūnas stressed to me the hopes for closer relations with Washington: “We hope that this historic breakthrough will turn into consistent cooperation, which will move the two countries closer through a concrete and practical agenda.”\nMeanwhile, the world’s largest gas exporter, Russia, continued to seek its own wins as competition for European gas markets intensified. Gas giant Gazprom signed a 10-year contract to supply piped gas to Croatia last fall, apparently trying to reduce demand for additional gas imports right as the European Union earmarked 101.40 million euro ($121 million) for the country to build its own LNG terminal, in a bid to reduce the region’s dependence on Russian gas.\nRussia is also trying to boost its own LNG exports and enter the global markets. Despite its status as the world’s leading natural gas exporter, Russia has been behind with its LNG export capacity. But this December, Russia’s second LNG plant, Yamal LNG, launched its first exports. News that Siberian gas from Yamal LNG was to arrive in Boston via the United Kingdom broke in early January, serving as the perfect Orthodox Christmas present for Russian President Vladimir Putin.\nA screengrab shows the route taken by the Gaselys LNG tanker from Europe to the United States, January 23, 2018. REUTERS/Eikon Since then, the LNG cargo and its circuitous route to Boston have generated considerable speculation among industry analysts. In late December, Sovcomflot, the Russian state-owned shipping company, delivered gas from Siberia’s Yamal LNG to a terminal on Britain’s Isle of Grain. The British media worried about the arrival of “sanctioned Russian gas” but, as it happened, the LNG cargo was to remain in Britain only briefly, never leaving its storage tank.\nTwo days later, a French tanker, Gaselys, arrived at Grain to pick up a cargo of stored LNG. The North American unit of French energy company Engie SA had purchased the cargo from Malaysia’s Petroliam Nasional Bhd. Eventually, Thomson Reuters shipping data showed the Gaselys vessel making its way to the Everett LNG import terminal near Boston – but only after many twists and unexplained turns. First Gaselys stopped at the tip of Spain then it passed through the Canary Islands. Then, on Jan. 19, after traveling halfway across the Atlantic, the vessel made a U-turn towards Spain in what was explained as a “weather delay” before again resuming its course towards Boston.\nThe LNG tanker \"Clean Ocean\" is pictured during the first U.S. delivery of liquefied natural gas to LNG terminal in Swinoujscie, Poland June 8, 2017. Agencja Gazata/Cezary Aszkielowicz via REUTERS While the Everett terminal on occasion relies on foreign LNG imports, specifically from Trinidad and Tobago, this delivery of Russian LNG is unprecedented. The cargo is even more controversial because the controlling share of Yamal LNG is owned by Russia’s Novatek, which has been under U.S. financial sanctions since 2014 due to Russia’s annexation of Crimea and the war in eastern Ukraine.\nThe story of the Gaselys cargo reflects the realities of the globalizing natural gas market. This globalization has been driven by the American boom in gas production and exports, which injected greater volumes and greater liquidity into the market. It also stems from the growth of the LNG trade, which by its very nature is global, as opposed to traditional natural gas exports, which rely on long-term contracts and regional land-based pipelines.\nWith this globalization, LNG supplies from one part of the world can increasingly be shipped to another to meet seasonal or longer-term fluctuations in demand. (In this case, the frigid temperatures that hit the U.S. East Coast in recent weeks pushed the domestic natural gas demand to record highs.) Thus it is feasible that Russian LNG could make its way to the United States in the future.\nTo mitigate the high natural gas prices faced by New England and to reduce the need to rely on foreign LNG, Washington and the private sector would be wiser to invest in gas pipeline and storage infrastructure, connecting producing and exporting regions such as the Gulf of Mexico and Appalachia with importing regions such as those of the Northeast.\nWith gas markets experiencing increasing interconnectivity and globalization, the new geopolitics of natural gas have arrived. These changes are upsetting the half-century-long status quo of gas trade driven primarily by piped gas exports from Russia to European states. New routes, new suppliers and re-exporters, and new trade partners are emerging. As the United States is slowly finding its new calling as an energy superpower, the conundrums of this cold winter should only encourage Washington to stick to its energy strategy but also be aware that LNG from sanctioned projects could make it to the United States via the globalizing gas market.\nAbout the Author Agnia Grigas is the author of The New Geopolitics of Natural Gas Harvard UP, 2017 and a Senior Fellow at the Atlantic Council. @AgniaGrigas.\nThe views expressed in this article are not those of Reuters News.", "external_links": [], "published": "2018-01-24T06:37:00.000+02:00", "crawled": "2018-01-24T04:30:31.000+02:00", "highlightTitle": ""}