{"organizations": [], "uuid": "c050848d29971d05f9d1178ead327253b3b75414", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180112&t=2&i=1221436420&w=1200&r=LYNXMPEE0B0TJ", "site_section": "https://www.reuters.com/subjects/euro-zone", "section_title": "Euro Zone | Reuters.com", "url": "https://www.reuters.com/article/us-bulgaria-eurozone-juncker/bulgaria-converging-with-euro-zone-but-still-not-enough-juncker-idUSKBN1F11AU", "country": "US", "domain_rank": 408, "title": "Bulgaria converging with euro zone, but still not enough -Juncker", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T19:53:00.000+02:00", "replies_count": 0, "uuid": "c050848d29971d05f9d1178ead327253b3b75414"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-bulgaria-eurozone-juncker/bulgaria-converging-with-euro-zone-but-still-not-enough-juncker-idUSKBN1F11AU", "ord_in_thread": 0, "title": "Bulgaria converging with euro zone, but still not enough -Juncker", "locations": [], "entities": {"persons": [{"name": "juncker", "sentiment": "negative"}, {"name": "jean-claude juncker", "sentiment": "none"}], "locations": [{"name": "sofia", "sentiment": "none"}, {"name": "bulgaria", "sentiment": "none"}, {"name": "balkan", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "european commission", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 12, 2018 / 11:53 AM / Updated 4 hours ago Bulgaria converging with euro zone, but still not enough -Juncker Reuters Staff 3 Min Read \nSOFIA (Reuters) - Bulgaria, which wants to adopt the euro currency, has made genuine progress in bringing its economy closer to those of euro zone countries but has still some work to do, the head of the European Commission said on Friday. \nThe Balkan country remains the poorest EU member state and needs to work to uproot widespread graft and further reform its small economy to align its low living standards to those of wealthier EU peers. \nSpeaking at a ceremony starting Bulgaria’s six-month presidency of the European Union, Jean-Claude Juncker praised Bulgaria’s strong public finances and said all countries that meet the criteria should be able to adopt the euro. \n“I did not say that Bulgaria will be automatically the next member of the euro zone but it is heading in the right direction because ... Unemployment is falling, the budgetary situation in strong, so when it comes to genuine convergence, Bulgaria has achieved progress,” Juncker said. \n“It is not quite enough yet and our Bulgarian friends are aware of this, but when it comes to real convergence there has been genuine progress,” he said. European Commission President Jean-Claude Juncker shows a diagram during a news conference at a ceremony starting Bulgaria's six-month presidency of the European Union in Sofia, Bulgaria, January 12, 2018. REUTERS/Stoyan Nenov \nBulgaria’s gross domestic product per capita, when calculated under power purchasing parity, is at 49 percent of the EU average, well below euro zone member states and many blame that level on corruption that scares away investors. \nBulgarian Prime Minister Boyko Borissov reiterated Sofia meets all the formal criteria for adopting the single currency and said he expected the country to be allowed into the ERM-2 mechanism - the two year obligatory precursor to the euro. Slideshow (2 Images) \n“All we had to do as homework, we have done it. Besides we are in a currency board regime with huge fiscal reserves so that two levs are one euro,” the centre-right leader said. \n“As Mr Juncker said, for the euro zone’s ”waiting room“ we are ready and we hope that soon this will be a fact,” Borissov said, adding that member states should also allow Bulgaria and neighboring Romania into the EU’s passport-free Schengen area. \nBulgarian officials said on Thursday they wanted to file a formal application in the middle of this year to lock their currency into ERM-2. \n“I am sure that Bulgaria will, or should, join the ERM-2 as rapidly as possible,” Juncker said. Reporting By Alastair Macdonald, writing by Jan Strupczewski; editing by Francesco Guarascio and Gareth Jones", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-12T19:53:00.000+02:00", "crawled": "2018-01-12T18:18:38.010+02:00", "highlightTitle": ""}