{"organizations": [], "uuid": "7656e617c47a60c8c8235009a662b2dd5cc6e137", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "https://www.reuters.com/legal", "section_title": "Legal News | Reuters", "url": "https://www.reuters.com/article/legal-us-otc-sec/if-scotus-finds-sec-alj-appointments-unconstitutional-what-happens-to-tainted-cases-idUSKBN1F52M5", "country": "US", "domain_rank": 408, "title": "If SCOTUS finds SEC ALJ appointments unconstitutional, what happens to tainted cases?", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-17T04:25:00.000+02:00", "replies_count": 0, "uuid": "7656e617c47a60c8c8235009a662b2dd5cc6e137"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/legal-us-otc-sec/if-scotus-finds-sec-alj-appointments-unconstitutional-what-happens-to-tainted-cases-idUSKBN1F52M5", "ord_in_thread": 0, "title": "If SCOTUS finds SEC ALJ appointments unconstitutional, what happens to tainted cases?", "locations": [], "entities": {"persons": [{"name": "lucia", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "dodd-frank", "sentiment": "none"}], "organizations": [{"name": "scotus", "sentiment": "negative"}, {"name": "sec alj", "sentiment": "negative"}, {"name": "lucia v. securities and exchange commission", "sentiment": "negative"}, {"name": "reuters", "sentiment": "negative"}, {"name": "u.s. supreme court", "sentiment": "negative"}, {"name": "sec", "sentiment": "none"}, {"name": "justice department", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "(Reuters) - The U.S. Supreme Court agreed Friday to hear Lucia v. Securities and Exchange Commission, in which the justices will decide whether the SEC’s bureaucratic hiring process for its administrative law judges violates the U.S. Constitution’s Appointments Clause . The government isn’t putting up much of a fight on that question. The Justice Department’s response to the Lucia petition at the Supreme Court acknowledged that SEC ALJs wield enough authority to qualify, for Appointments Clause purposes, as officers of the U.S., not mere employees whose hiring need not meet constitutional standards. With Lucia and the government in agreement, the Supreme Court is expected to name an amicus lawyer to argue the contrary position.\nThe SEC has brought hundreds of enforcement actions before administrative law judges in the past several years, since the Dodd-Frank financial reform act gave the agency leeway to choose administrative proceedings, in which the SEC sets the rules of evidence, over suits in federal court, where defendants have more robust due process rights. So assuming that the Supreme Court ends up agreeing with both Lucia and the Justice Department that the presiding ALJs were unconstitutionally appointed, what happens to defendants found liable in administrative proceedings?\nThat issue is not specifically before the Supreme Court, which was presented only with the question of whether the Appointments Clause covers SEC ALJs. But Mark Perry of Gibson Dunn & Crutcher , who represents onetime radio host and financial advisor Raymond Lucia, told me he will argue in a merits briefing that the Supreme Court should determine an appropriate remedy if it concludes ALJs were unconstitutionally appointed, rather than leaving lower courts to figure out what to do.\n“The remedy flows from the violation,” said Perry, who argued in certiorari briefing that the SEC must either dismiss or retry Lucia if the ALJ who oversaw his case was improperly appointed. “It’s a matter of law and fairness.”\nThe SEC attempted to cure constitutional problems in ongoing proceedings on Nov. 30, a day after the Justice Department submitted its Supreme Court brief conceding SEC ALJs are subject to the Appointments Clause. The commission issued an announcement that it had “ratified its prior appointment” of its ALJs. By doing so, it said, “the commission has resolved any concerns that administrative proceedings presided over by its ALJs violate the Appointment Clause.”\nGibson Dunn’s reply brief in the Lucia case – and a Jan. 5 brief by a defendant in an ongoing SEC administrative proceeding – argue that the SEC’s post hoc ratification doesn’t actually solve the appointment problem because the hiring process it purports to ratify was unconstitutional. “The ‘ratification’ of an unconstitutional procedure is itself a nullity,” the Lucia reply brief said.\nWinston & Strawn and Boies Schiller Flexner agreed in a brief for RD Legal Funding, a litigation funder facing SEC fraud allegations. “The commission’s effort to retroactively convert what it has admitted was a constitutionally infirm delegation of hiring authority into a constitutionally permissable appointment process would not be a ratification of the commission’s prior acts but rather a mischaracterization of those acts,” RD argued. “A ratification can confirm that an apple is an apple but it cannot transform an apple into an orange.”\nAfter issuing its ratification order, the SEC commissioners called for administrative law judges to reconsider the records of administrative proceedings they presided over to determine whether to stand by their previous actions. Defendants in the proceedings were also given a chance to respond to the ratification order. I went through the dockets of several dozen cases and found many proposed orders in which the SEC’s enforcement division submitted proposed orders calling on ALJs to ratify and affirm their previous holdings. I did not see any responses from defendants – although that doesn’t mean defendants didn’t submit filings because RD’s brief wasn’t on the docket of its case.\nI emailed the SEC and the Justice Department to ask if they agreed with Gibson Dunn that the Supreme Court should decide the implications of unconstitutional ALJ appointments in the Lucia case. SEC and DOJ representatives declined to comment.\n ", "external_links": ["https://www.sec.gov/news/press-release/2017-215", "http://thomsonreuters.com/en/about-us/trust-principles.html", "https://www.supremecourt.gov/orders/courtorders/011218zr_3d9g.pdf"], "published": "2018-01-17T04:25:00.000+02:00", "crawled": "2018-01-16T23:20:13.006+02:00", "highlightTitle": ""}