{"organizations": [], "uuid": "7fc5225904914187d4687557a181105b2d13e727", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180128&t=2&i=1226064934&w=1200&r=LYNXMPEE0R0PR", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-italy/mertens-brace-puts-napoli-top-inter-extend-winless-run-idUKKBN1FH0SV", "country": "US", "domain_rank": 408, "title": "Mertens brace puts Napoli top, Inter extend winless run", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-28T19:03:00.000+02:00", "replies_count": 0, "uuid": "7fc5225904914187d4687557a181105b2d13e727"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-italy/mertens-brace-puts-napoli-top-inter-extend-winless-run-idUKKBN1FH0SV", "ord_in_thread": 0, "title": "Mertens brace puts Napoli top, Inter extend winless run", "locations": [], "entities": {"persons": [{"name": "mertens", "sentiment": "negative"}, {"name": "ibrahima mbaye", "sentiment": "none"}, {"name": "luca rigoni", "sentiment": "none"}, {"name": "rodrigo palacio", "sentiment": "none"}], "locations": [{"name": "turin", "sentiment": "none"}, {"name": "napoli", "sentiment": "none"}, {"name": "crotone", "sentiment": "none"}], "organizations": [{"name": "inter", "sentiment": "negative"}, {"name": "mertens", "sentiment": "negative"}, {"name": "napoli", "sentiment": "negative"}, {"name": "juventus", "sentiment": "none"}, {"name": "min read  milan", "sentiment": "none"}, {"name": "bologna", "sentiment": "none"}, {"name": "udinese", "sentiment": "none"}, {"name": "cagliari", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "chievo", "sentiment": "none"}, {"name": "inter milan", "sentiment": "none"}, {"name": "genoa", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 28, 2018 / 5:07 PM / Updated 26 minutes ago Mertens brace puts Napoli top, Inter extend winless run Reuters Staff 3 Min Read \nMILAN (Reuters) - A brace from Dries Mertens took Napoli straight back to the top of Serie A with a 3-1 win over Bologna on Sunday while Inter Milan conceded a last-minute goal at SPAL to extend their winless run to nine games. \nThe video replay system (VAR) denied Crotone a last-minute winner at home to 10-man Cagliari, the game ending 1-1, and a bizarre miss by Genoa forward Luca Rigoni cost his team a point at home to Udinese as they lost 1-0. \nNapoli, briefly dislodged by Juventus who played on Saturday and won 2-0 at Chievo, now lead with 57 points from 22 games, one ahead of the Turin side. \nNapoli were stunned when Rodrigo Palacio took advantage of dreadful marking to give Bologna the lead after 25 seconds but they were gifted an equaliser by Ibrahima Mbaye who turned an attempted clearance into his own goal. \nThe hosts were then awarded a soft penalty which Mertens converted in the 37th minute but there no questions about the Belgian’s second goal in the 59th when he cut inside a defender and curled an exquisite effort into the net. \nInter, leaders in early December, slipped further behind after a game in which both goals were scored by their opponents. Soccer Football - Serie A - Napoli vs Bologna - Stadio San Paolo, Naples, Italy - January 28, 2018 Napoli's Dries Mertens scores their second goal from a penalty REUTERS/Ciro De Luca \nSPAL’s Francesco Vicari turned Joao Cancelo’s cross into his own net to gift Inter the lead and the visitors were on the verge of their first win in all competitions since Dec. 3 until Alberto Paloschi’s diving header levelled the scores. \nThe VAR system was used three times at Crotone, firstly to award the hosts a penalty which was converted by Marcello Trotta in the 29th minute and then to confirm a red card for Cagliari’s Fabio Pisacane for a late tackle. Slideshow (4 Images) \nLuca Cigarini levelled for the Sardinians with the last kick of the first half and they held out until the final minute when Federico Ceccherini headed in for Crotone but the referee changed his mind and disallowed the goal after consulting the pitchside monitor. \nValon Behrami’s second-half goal gave Udinese a 1-0 win at Genoa although they had to cling on after Samir was sent off shortly afterwards -- the referee changing the card from yellow to red after checking with the VAR. \nGenoa should have equalised in the 88th minute when Adel Taarabt’s cross found Rigoni who only had to tap the ball in at the far post but instead contrived to clear it off the line. \nFiorentina’s season took a turn for the worse with a 4-1 home defeat by next-to-bottom Verona and Torino thumped bottom club Benevento 3-0 in the other afternoon game. Writing by Brian Homewood in Berne; Editing by Clare Fallon", "external_links": [], "published": "2018-01-28T19:03:00.000+02:00", "crawled": "2018-01-28T19:38:40.004+02:00", "highlightTitle": ""}