{"organizations": [], "uuid": "cb65b199281050b1de9ba1ef410badfb571a2206", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180121&t=2&i=1223859739&w=1200&r=LYNXMPEE0K0EI", "site_section": "http://feeds.reuters.com/reuters/topNews?format=xml", "section_title": "Reuters: Top News", "url": "https://www.reuters.com/article/us-usa-israel-pence-jerusalem/why-is-jerusalem-so-central-to-pences-middle-east-visit-idUSKBN1FA0JL", "country": "US", "domain_rank": 408, "title": "Why is Jerusalem so central to Pence's Middle East visit?", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-21T14:20:00.000+02:00", "replies_count": 0, "uuid": "cb65b199281050b1de9ba1ef410badfb571a2206"}, "author": "", "url": "https://www.reuters.com/article/us-usa-israel-pence-jerusalem/why-is-jerusalem-so-central-to-pences-middle-east-visit-idUSKBN1FA0JL", "ord_in_thread": 0, "title": "Why is Jerusalem so central to Pence's Middle East visit?", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "middle east", "sentiment": "none"}, {"name": "jerusalem", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "egypt", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "israel", "sentiment": "none"}, {"name": "jordan", "sentiment": "none"}], "organizations": [{"name": "christian", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "JERUSALEM (Reuters) - U.S. Vice President Mike Pence’s planned trip to Israel on Sunday has been overshadowed by President Donald Trump’s announcement last month that the United States recognizes Jerusalem as the capital of Israel, and will start the process of moving its embassy there.\nPence, an evangelical Christian, plans to meet Israeli leaders and to visit the Western Wall, the Israeli parliament and a Holocaust remembrance center in Jerusalem during the two-day visit, after stops in Egypt and Jordan.\nPence, however, is not scheduled to meet any Palestinian leaders, who declined to see him.\nThe trip was originally planned for December but was postponed after protests from Arab political and religious leaders - Muslim and Christian – about Trump’s Jerusalem decision, which broke with decades of U.S. policy and drew widespread criticism from America’s allies.\nWHY DID TRUMP RECOGNIZE JERUSALEM AS ISRAEL‘S CAPITAL, AND ANNOUNCE THE EMBASSY WILL BE MOVED THERE?\nThere has long been pressure from pro-Israel politicians in Washington to move the U.S. embassy from Tel Aviv to Jerusalem, and Trump made it a promise of his 2016 election campaign.\nPence and David Friedman, the ambassador to Israel appointed by Trump, are thought to have pushed hard for both recognition and embassy relocation. It is a decision that was popular with many conservative and evangelical Christians who voted for Trump and Pence. Many of them support political recognition of Israel’s claim to the city.\nWHY DOES JERUSALEM PLAY SUCH AN IMPORTANT ROLE IN THE MIDDLE EAST CONFLICT?\nReligion, politics and history.\nJerusalem is a city that is sacred to Judaism, Christianity and Islam, and each religion has sites of great significance there. Jerusalem has been fought over for millennia by its inhabitants, and by regional powers and invaders including the Egyptians, Babylonians, Romans, early Muslim rulers, Crusaders, Ottomans, the British Empire, and by the modern states of Israel and its Arab neighbors.\nIsrael’s government regards Jerusalem as the eternal and indivisible capital of the country, although that is not recognized internationally. Palestinians feel equally strongly, saying that East Jerusalem must be the capital of a future Palestinian state. The city even has different names. Jews call it Jerusalem, or Yerushalayim, and Arabs call it Al-Quds, which means “The Holy”.\nBut the city’s significance goes further.\nAt the heart of Jerusalem’s Old City is the hill known to Jews across the world as Har ha-Bayit, or Temple Mount, and to Muslims internationally as al-Haram al-Sharif, or The Noble Sanctuary. It was home to the Jewish temples of antiquity but all that remains of them above ground is a restraining wall for the foundations built by Herod the Great. Known as the Western Wall, this is a sacred place of prayer for Jews.\nWithin yards of the wall, and overlooking it, are two Muslim holy places, the Dome of the Rock and the Al-Aqsa Mosque, which was built in the 8th century. Muslims regard the site as the third holiest in Islam, after Mecca and Medina. The city is also an important pilgrimage site for Christians, who revere it as the place where they believe that Jesus Christ preached, died and was resurrected.\nAn employee of the King David Hotel raises the U.S. flag on the roof, ahead of the U.S. Vice President Mike Pence visit in Jerusalem January 21, 2018. REUTERS/Ronen Zvulun WHAT IS THE CITY‘S MODERN HISTORY AND STATUS?\nIn 1947, the United Nations General Assembly decided that the then British-ruled Palestine should be partitioned into an Arab state and a Jewish state. But it recognized that Jerusalem had special status and proposed international rule for the city, along with nearby Bethlehem, as a ‘corpus separatum’ to be administered by the United Nations.\nThat never happened. When British rule ended in 1948, Jordanian forces occupied the Old City and Arab East Jerusalem. Israel captured East Jerusalem from Jordan in the 1967 Middle East war and annexed it in a move not recognized internationally.\nIn 1980 the Israeli parliament passed a law declaring the “complete and united” city of Jerusalem to be the capital of Israel. But the United Nations regards East Jerusalem as occupied, and the city’s status as disputed until resolved by negotiations between Israel and the Palestinians. The King of Jordan retains a role in ensuring the upkeep of the Muslim holy places.\nSlideshow (9 Images) DOES ANY OTHER COUNTRY HAVE AN EMBASSY IN JERUSALEM? Other countries have had embassies in Jerusalem in the past, but moved them out of the city some years ago. In December Guatemala’s president, Jimmy Morales, said that his country will move its embassy from Tel Aviv. Israel’s prime minister, Benjamin Netanyahu, said several countries were considering following the U.S. lead, but he declined to identify them.\nAlso in December, 128 countries voted in a non-binding U.N. General Assembly resolution calling on the U.S. to drop its recognition of Jerusalem as Israel’s capital. Nine voted against, 35 abstained and 21 did not cast a vote.\nWHAT IS LIKELY TO HAPPEN NEXT? HAS JERUSALEM BEEN A FLASHPOINT BEFORE?\nThe timeframe of the U.S. embassy move is unclear, with different predictions from Israeli and U.S. officials about how soon it could happen. Since the announcement there has been tension, with Palestinian protests in Jerusalem, Gaza and the West Bank. At least 18 Palestinians and one Israeli have been killed since Trump’s Dec. 6 announcement.\nAlthough the clashes between Palestinian protesters and Israeli forces have not been on the scale of the first and second Palestinian intifadas in 1987-1993 and 2000-2005, violence has erupted before over matters of sovereignty and religion.\nIn 1969 an Australian Messianic Christian tried to burn down the Al-Aqsa Mosque. He failed, but caused damage. So charged was the Middle East’s political climate - just two years after the Six Day War - that there was fury across the Arab world.\nIn 2000, the Israeli politician Ariel Sharon, then opposition leader, led a group of Israeli lawmakers onto the Temple Mount/al-Haram al-Sharif complex. Palestinians protested, and there were violent clashes that quickly escalated into the second Palestinian uprising, also known as the Al-Aqsa Intifada.\nDeadly confrontations also took place last July after Israel installed metal detectors at the entrance to the complex following the killing of two Israeli policemen there by Arab-Israeli gunmen.\nArab leaders across the Middle East have warned that a unilateral American move could lead to turmoil, and hamper U.S. efforts to restart long-stalled Israeli-Palestinian peace talks.\nReporting by Stephen Farrell; Editing by Matthew Mpoke Bigg\n ", "external_links": [], "published": "2018-01-21T14:20:00.000+02:00", "crawled": "2018-01-21T14:28:42.009+02:00", "highlightTitle": ""}