{"organizations": [], "uuid": "bd283c2867e7c82c0a4bb2d1494a020e15ca2f2c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/4", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-olin-to-pursue-registered-debt-offering.html", "country": "US", "domain_rank": 767, "title": "Olin To Pursue Registered Debt Offering", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.005, "site_type": "news", "published": "2018-01-16T15:18:00.000+02:00", "replies_count": 0, "uuid": "bd283c2867e7c82c0a4bb2d1494a020e15ca2f2c"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/16/pr-newswire-olin-to-pursue-registered-debt-offering.html", "ord_in_thread": 0, "title": "Olin To Pursue Registered Debt Offering", "locations": [], "entities": {"persons": [{"name": "olin", "sentiment": "none"}], "locations": [{"name": "clayton", "sentiment": "none"}, {"name": "mo.", "sentiment": "none"}, {"name": "usa", "sentiment": "none"}], "organizations": [{"name": "oln", "sentiment": "negative"}, {"name": "olin corporation", "sentiment": "negative"}, {"name": "nyse", "sentiment": "negative"}, {"name": "citigroup global markets inc.", "sentiment": "none"}, {"name": "usa) inc.", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "scotia capital", "sentiment": "none"}, {"name": "smbc nikko securities america, inc.", "sentiment": "none"}, {"name": "mufg securities americas inc.", "sentiment": "none"}, {"name": "td securities", "sentiment": "none"}, {"name": "deutsche bank securities inc.", "sentiment": "none"}, {"name": "securities and exchange commission", "sentiment": "none"}, {"name": "sec", "sentiment": "none"}, {"name": "pnc capital markets llc", "sentiment": "none"}, {"name": "wells fargo securities llc", "sentiment": "none"}, {"name": "merrill lynch, pierce, fenner & smith incorporated", "sentiment": "none"}, {"name": "j.p. morgan securities llc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CLAYTON, Mo., Jan. 16, 2018 /PRNewswire/ -- Olin Corporation (NYSE: OLN) announced today that it intends to commence an offering of $500 million aggregate principal amount of Senior Notes due 2030 (the \"Senior Notes\"), subject to market and other conditions. The Senior Notes will be sold pursuant to Olin's shelf registration statement and the base prospectus on file with the Securities and Exchange Commission (\"SEC\"). The underwriters for the transaction are Citigroup Global Markets Inc., J.P. Morgan Securities LLC, Wells Fargo Securities LLC, Merrill Lynch, Pierce, Fenner & Smith Incorporated, PNC Capital Markets LLC, SMBC Nikko Securities America, Inc., Scotia Capital (USA) Inc., MUFG Securities Americas Inc., Deutsche Bank Securities Inc. and TD Securities (USA) LLC. Olin expects to use the net proceeds of the offering, together with cash on hand, to prepay in part the term loans outstanding under Olin's existing term loan credit facility, which is scheduled to mature in 2022.\nOlin has filed a registration statement on Form S-3 (including a prospectus) with the SEC for the offering to which this communication relates. Before you invest, you should read the prospectus in that registration statement and the prospectus supplement thereto and the other documents that Olin has filed or will file with the SEC for more complete information about Olin and this offering. The offering will be made only pursuant to the terms of the relevant prospectus supplement (including the prospectus). These documents will be available at no charge by visiting EDGAR on the SEC website at www.sec.gov . Alternatively, these documents will be made available upon request to any underwriter participating in the offering. Interested parties may obtain a prospectus and the related prospectus supplement from Citigroup Global Markets Inc. by contacting Citigroup Global Markets Inc., c/o Broadridge Financial Services, 1155 Long Island Avenue, Edgewood, NY 11717 or by calling toll free at 1-800-831-9146.\nThis press release does not constitute an offer to sell or a solicitation of an offer to buy, nor shall there be any sale of the Senior Notes in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction.\nCOMPANY DESCRIPTION\nOlin Corporation is a leading vertically-integrated global manufacturer and distributor of chemical products and a leading U.S. manufacturer of ammunition. The chemical products produced include chlorine and caustic soda, vinyls, epoxies, chlorinated organics, bleach and hydrochloric acid. Winchester's principal manufacturing facilities produce and distribute sporting ammunition, law enforcement ammunition, reloading components, small caliber military ammunition and components, and industrial cartridges.\nCAUTIONARY STATEMENT ABOUT FORWARD-LOOKING STATEMENTS\nThis release includes forward-looking statements, including relating to the offering of Senior Notes. These statements relate to analyses and other information that are based on management's beliefs, certain assumptions made by management, forecasts of future results, and current expectations, estimates and projections, including about the markets and economy in which we and our various segments operate. The statements contained in this release that are not statements of historical fact may include forward-looking statements that involve a number of risks and uncertainties.\nWe have used the words \"anticipate\", \"intend\", \"expect\" and variations of such words and similar expressions in this release to identify such forward-looking statements. These statements are not guarantees of future performance and involve certain risks, uncertainties and assumptions, which are difficult to predict and many of which are beyond our control. Therefore, actual outcomes and results may differ materially from those matters expressed or implied in such forward-looking statements. We undertake no obligation to update publicly any forward-looking statements, whether as a result of future events, new information or otherwise.\nYou should consider these forward-looking statements in light of risk factors discussed in the Prospectus Supplement to be filed with the SEC and those in our annual report on Form 10-K for the year ended December 31, 2016, and subsequent periodic filings made with the SEC. All of our forward-looking statements should be considered in light of these factors. In addition, other risks and uncertainties not presently known to us or that we consider immaterial could affect the accuracy of our forward-looking statements.\n2018-01\nView original content: http://www.prnewswire.com/news-releases/olin-to-pursue-registered-debt-offering-300583061.html\nSOURCE Olin Corporation", "external_links": ["http://www.prnewswire.com/news-releases/olin-to-pursue-registered-debt-offering-300583061.html"], "published": "2018-01-16T15:18:00.000+02:00", "crawled": "2018-01-16T16:16:40.009+02:00", "highlightTitle": ""}