{"organizations": [], "uuid": "6b8e6c07963ebeec4e01dd772b0de2e05322ad55", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/04/104928527-Close_up_of_computer_generated_images.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/08/japanese-scientists-use-artificial-intelligence-to-decode-thoughts.html", "country": "US", "domain_rank": 767, "title": "Japanese scientists use artificial intelligence to decode thoughts", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.014, "site_type": "news", "published": "2018-01-08T18:21:00.000+02:00", "replies_count": 0, "uuid": "6b8e6c07963ebeec4e01dd772b0de2e05322ad55"}, "author": "Catherine Clifford", "url": "https://www.cnbc.com/2018/01/08/japanese-scientists-use-artificial-intelligence-to-decode-thoughts.html", "ord_in_thread": 0, "title": "Japanese scientists use artificial intelligence to decode thoughts", "locations": [], "entities": {"persons": [{"name": "tomoyasu horikawa", "sentiment": "none"}, {"name": "guohua shen", "sentiment": "none"}, {"name": "yukiyasu kamitani", "sentiment": "none"}, {"name": "kei majima", "sentiment": "none"}], "locations": [{"name": "kyoto", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}], "organizations": [{"name": "kyoto university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Imagine a reality where computers can visualize what you are thinking.\nSound far out? It's now closer to becoming a reality thanks to four scientists at Kyoto University in Kyoto, Japan. In late December, Guohua Shen, Tomoyasu Horikawa, Kei Majima and Yukiyasu Kamitani released the results of their recent research on using artificial intelligence to decode thoughts on the scientific platform, BioRxiv .\nMachine learning has previously been used to study brain scans (MRIs, or magnetic resonance imaging) and generate visualizations of what a person is thinking when referring to simple, binary images like black and white letters or simple geographic shapes (as shown in Figure 2 here ).\nBut the scientists from Kyoto developed new techniques of \"decoding\" thoughts using deep neural networks (artificial intelligence). The new technique allows the scientists to decode more sophisticated \"hierarchical\" images, which have multiple layers of color and structure, like a picture of a bird or a man wearing a cowboy hat, for example.\nDeep image reconstruction: Natural images (seen images), GIF version\n\"We have been studying methods to reconstruct or recreate an image a person is seeing just by looking at the person's brain activity,\" Kamitani, one of the scientists, tells CNBC Make It . \"Our previous method was to assume that an image consists of pixels or simple shapes. But it's known that our brain processes visual information hierarchically extracting different levels of features or components of different complexities.\"\nAnd the new AI research allows computers to detect objects, not just binary pixels. \"These neural networks or AI model can be used as a proxy for the hierarchical structure of the human brain,\" Kamitani says.\nDeep image reconstruction: Visual imagery, GIF version\nFor the research, over the course of 10 months, three subjects were shown natural images (like photographs of a bird or a person), artificial geometric shapes and alphabetical letters for varying lengths of time.\nIn some instances, brain activity was measured while a subject was looking at one of 25 images. In other cases, it was logged afterward, when subjects were asked to think of the image they were previously shown.\nOnce the brain activity was scanned, a computer reverse-engineered (or \"decoded\") the information to generate visualizations of a subjects' thoughts.\nThe flowchart, embedded below, is made by the research team at the Kamitani Lab at Kyoto University and breaks down the science of how a visualization is \"decoded.\"\nThe two charts embedded below show the results the computer reconstructed for subjects whose activity was logged while they were looking at natural images and images of letters.\nAs for the subjects' whose brain waves were measured based on remembering the images, the scientists had another breakthrough.\n\"Unlike previous methods, we were able to reconstruct visual imagery a person produced by just thinking of some remembered images,\" Kamitani says.\nAs seen in the chart embedded below, when decoding brain signals resulting from a subject remembering images, the AI system had a harder time reconstructing. That's because it's more difficult for a human to remember an image of a cheetah or a fish exactly as it was seen.\n\"The brain is less activated\" in that scenario, Kamitani explains to CNBC Make It .\nAs the accuracy of the technology continues to improve, the potential applications are mind-boggling. The visualization technology would allow you to draw pictures or make art simply by imagining something; your dreams could be visualized by a computer; the hallucinations of psychiatric patients could be visualized aiding in their care; and brain-machine interfaces may one day allow communication with imagery or thoughts, Kamitani tells CNBC Make It.\nWhile the idea of computers reading your brain may sound positively Jetson-esque, the Japanese researchers aren't alone in their futuristic work to connect the brain with computing power.\nFor example, former GoogleX-er Mary Lou Jepsen is working to build a hat that will make telepathy possible within the decade , and entrepreneur Bryan Johnson is working to build computer chips to implant in the brain to improve neurological functions.\nshow chapters This former GoogleX'er is developing a technology that will make telepathy possible in 8 years 12:06 PM ET Fri, 7 July 2017 | 01:37 See also:\nThis former Google[X] exec is building a high-tech hat that she says will make telepathy possible in 8 years\nAhead of Elon Musk, this self-made millionaire already launched a company to merge your brain with computers\nGoogle billionaire Eric Schmidt: People want dish-washing robots to clean up the kitchen more than any other kind\nshow chapters This CEO wants to put a computer chip in your brain 10:35 AM ET Wed, 12 April 2017 | 01:15 Like this story? Like CNBC Make It on Facebook .", "external_links": [], "published": "2018-01-08T18:21:00.000+02:00", "crawled": "2018-01-08T18:21:35.035+02:00", "highlightTitle": ""}