{"organizations": [], "uuid": "c7ed499c5c5e203323589bd0fde57518c4d7a013", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20180117&t=2&i=1222575320&w=1200&r=LYNXMPEE0G018", "site_section": "http://feeds.feedburner.com/Reuters/UKWorldNews", "section_title": "Reuters: World News", "url": "https://uk.reuters.com/article/uk-usa-attacks/chelsea-bomber-tried-to-radicalise-fellow-inmates-u-s-prosecutors-say-idUKKBN1F602P", "country": "US", "domain_rank": 408, "title": "'Chelsea bomber' tried to radicalise fellow inmates, U.S. prosecutors say", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-17T02:30:00.000+02:00", "replies_count": 0, "uuid": "c7ed499c5c5e203323589bd0fde57518c4d7a013"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-attacks/chelsea-bomber-tried-to-radicalise-fellow-inmates-u-s-prosecutors-say-idUKKBN1F602P", "ord_in_thread": 0, "title": "'Chelsea bomber' tried to radicalise fellow inmates, U.S. prosecutors say", "locations": [], "entities": {"persons": [{"name": "brendan pierson", "sentiment": "none"}, {"name": "elizabeth", "sentiment": "none"}, {"name": "ahmad khan rahimi", "sentiment": "none"}, {"name": "rahimi", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "chelsea", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}], "organizations": [{"name": "chelsea", "sentiment": "negative"}, {"name": "union county superior court", "sentiment": "none"}, {"name": "islamic state", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 17, 2018 / 12:32 AM / Updated 16 minutes ago 'Chelsea bomber' tried to radicalise fellow inmates, U.S. prosecutors say Brendan Pierson 3 Min Read \nNEW YORK (Reuters) - The New Jersey man found guilty last year of planting two homemade bombs in Manhattan’s Chelsea neighbourhood, one of which wounded 30 people, has tried to radicalise fellow inmates with Islamic State and al Qaeda propaganda, U.S. prosecutors said on Tuesday. FILE PHOTO: Ahmad Khan Rahimi, an Afghan-born U.S. citizen accused of planting bombs in New York and New Jersey, appears in Union County Superior Court for a hearing in Elizabeth, New Jersey, U.S. May 15, 2017. REUTERS/Mike Segar/File Photo \nAhmad Khan Rahimi, 29, faces a mandatory life sentence under federal law after being convicted in October of eight counts, including using a weapon of mass destruction and bombing a public place. His sentencing is scheduled for Feb. 13. \nProsecutors said in a filing in Manhattan federal court that since his conviction, Rahimi had distributed “terrorist propaganda” to other inmates at Manhattan’s Metropolitan Correctional Center. \nThe materials included issues of Islamic State’s “Inspire” magazine and speeches by former al Qaeda leaders Anwar al-Awlaki and Osama bin Laden, prosecutors said. \nPrison staff found an address book containing the names of other inmates charged with terrorism offences among Rahimi’s belongings, prosecutors said. \nThose other inmates include Sajmir Alimehmeti, who is charged with trying to help an undercover law enforcement officer travel to Syria to join Islamic State; Muhanad Mahmoud Al Farekh, who was convicted in September of helping al Qaeda plan a car bomb attack on a U.S. military base in Afghanistan; and Maalik Alim Jones, who pleaded guilty in September to conspiring to support the Islamist militant group al Shabaab in Somalia, according to prosecutors. \nRahimi also wrote a letter to an “associate” in Germany in explaining his decision not speak at his trial, in which he said that his prosecutor, judge, jury and his own lawyer were all “kaffirs,” or unbelievers, prosecutors said. \n“Their hands are already drenched with Muslim Blood and how will they understand our struggle,” Rahimi wrote, according to prosecutors. \n“The defendant’s communications while incarcerated further demonstrate that, far from appreciating the depravity of his actions, he is proud of what he did, scornful of the American justice system and as dedicated as ever to his terrorist ideology,” prosecutors said, citing the mandatory minimum sentence. \nRahimi was represented at trial by lawyers at the Federal Defenders of New York, a public defender organisation. The group withdrew from the case earlier this month, saying it could not continue to represent Rahimi because it represented some of inmates he is accused of trying to radicalize, creating a conflict of interest. \nXavier Donaldson, Rahimi’s current lawyer, did not immediately respond to a request for comment on Tuesday. Reporting by Brendan Pierson in New York; Editing by Peter Cooney", "external_links": [], "published": "2018-01-17T02:30:00.000+02:00", "crawled": "2018-01-17T02:52:09.014+02:00", "highlightTitle": ""}