{"organizations": [], "uuid": "28aeef6e7f3eab2ff78baf6c80922db5b0c103c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20180124&t=2&i=1224721570&w=1200&r=LYNXMPEE0N0EC", "site_section": "http://feeds.reuters.com/reuters/worldNews", "section_title": "Reuters: World News", "url": "https://www.reuters.com/article/us-somalia-defections-exclusive/exclusive-somalia-lures-defectors-in-new-push-against-insurgents-idUSKBN1FD0KO", "country": "US", "domain_rank": 408, "title": "Exclusive: Somalia lures defectors in new push against insurgents", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T09:08:00.000+02:00", "replies_count": 0, "uuid": "28aeef6e7f3eab2ff78baf6c80922db5b0c103c2"}, "author": "", "url": "https://www.reuters.com/article/us-somalia-defections-exclusive/exclusive-somalia-lures-defectors-in-new-push-against-insurgents-idUSKBN1FD0KO", "ord_in_thread": 0, "title": "Exclusive: Somalia lures defectors in new push against insurgents", "locations": [], "entities": {"persons": [{"name": "nasteh", "sentiment": "none"}, {"name": "katharine houreld", "sentiment": "none"}, {"name": "sha", "sentiment": "none"}], "locations": [{"name": "somalia", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MOGADISHU (Reuters) - As an undercover operative for Somalia’s al Shabaab militia, Nasteh spied on the insurgent group’s senior commanders to ensure their loyalty and planned bombings and assassinations in government-controlled territory.\nBut late last year, the government officials he once hunted became his handlers after the 26-year-old joined a slowly growing stream of defectors to the U.N.-backed Somali administration.\nA Western-backed push by Somali officials to encourage al Shabaab defections has lured commanders, the former head of intelligence and a major regional warlord, security officials and defectors told Reuters, offering a rare window into secretive efforts to undermine the al Qaeda-linked insurgency from within.\nSenior defectors provide operational intelligence - such as how al Shabaab makes armored vehicle bombs - and insights into its leadership.\nMost importantly, the government says, those defectors sow suspicion among al Shabaab’s leaders and encourage further defections by contacting former comrades.\nThe message: defectors are welcomed, not punished. One former commander relocated abroad with his family; another now holds a senior position in the security services. Many have simply returned home, Somali officials say.\nOthers, like Nasteh, are becoming intelligence assets after saying they are disillusioned with the Islamist insurgency, accusing it of un-Islamic practices.\n“They were killing clerics,” he told Reuters during an interview via video link from a safe house, naming three Islamic scholars he said were killed by the movement. “They were killing without consultation, it was just the guys at the top deciding.”\nThe amnesty has angered some Somalis, who say those who commit crimes should be punished. Critics say the government has failed to penetrate the insurgency’s core - the top three defectors had all fallen out of favor with Shabaab’s inner circle.\nThe stakes are high: al Shabaab, which wants to overthrow the Somali government and impose Islamic law, has killed hundreds of civilians across East Africa and thousands of Somalis in a decade-long insurgency.\nThe full effect of the defections is unclear, although al Shabaab was needled into denouncing one former top commander, Mukhtar Robow Abu Mansur, as an apostate after he publicly urged his clansmen to fight the insurgency. Robow joined the government in August.\nGovernment officials say only negotiation can end Somalia’s 26-year-old civil war - especially given the ragged state of the military.\n“Those [defectors] who have been rehabilitated can be ambassadors back to their communities,” said Abdirahman Osman, a former minister of information who is now Mogadishu’s mayor. “We know military pressure helps, but it is not the end game.”\nTHE PROCESS Defections start with a phone call - from an al Shabaab fighter to his soldier cousin, or a former student to his teacher. Somalia’s clan relationships mean everyone knows someone on the other side.\n“Their only request usually is not to go to jail. Most don’t need to be resettled or sent anywhere,” said one Somali who helped bring over defectors and asked not to be named.\nThe Shabaab member is passed to someone working with the government - often known to them personally - and told he’ll be welcomed if he rejects the insurgency, renounces violence, and accepts the Somali government. Clan elders act as guarantors.\nThe defector then plans his escape, which can take months. Al Shabaab has tried to prevent defections by requiring senior members to get travel passes, two defectors told Reuters, forcing some to take circuitous routes through the bush.\n“I didn’t tell my wife ... I didn’t eat. I barely slept. I left all my books, threw away all my SIM cards that they knew,” said a former district level head of education, describing his week-long escape by motorbike.\nDeserting is irrevocable, Somali officials say, because Shabaab jails or executes defectors. So far, they say, none of the 45 mid- and high-level defectors have reneged on their agreement. Twenty-two of those came across since January 2017.\nFILE PHOTO: New recruits of Somalia's al-Qaeda linked al Shabaab militia march during a passing out parade at a military training base in Afgoye, west of Mogadishu, Somalia February 17, 2011. REUTERS/Feisal Omar/File Photo Al Shabaab told Reuters the defections were exaggerated and more than 50 soldiers – including senior commanders - had surrendered to the insurgency in the past three months.\n“The apostate Somali regime often resorts to fabricated reports in a desperate attempt manipulate public opinion and hide its mounting security failures in the capital and the endemic corruption hampering all its institutions,” said Sheikh Abdiasis Abu Musab, the insurgency’s military operations spokesman.\n“As for the so-called deserters, most of them were already working as spies for the apostate regime. Once their cover was blown, they fled (al Shabaab) territories for fear of being executed ... Others were successfully apprehended before they could flee and were put to trial.”\nOsman said the claim that 50 soldiers had surrendered was “rubbish”.\nThe defectors are varied. Some come from the insurgency’s proselytising wing; others are military commanders, or from logistics, medical, intelligence, tax collection and judiciary functions. Once the defector reaches government territory, he will be debriefed by Somali intelligence, which can take weeks.\nRedacted debriefs shown to Reuters included details of how al Shabaab welds armor plates inside the cabs of vehicle bombs to prevent soldiers stopping them by shooting the driver. The suicide bomber enters through the roof and tinted windows hide the metal plates.\nSlideshow (2 Images) Other details included a preference for renting houses with floorboards rather than cement floors so weapons could be hidden; the numbers and makeup of assassination teams; and widespread recriminations among fighters over an Oct. 14 bombing that killed more than 500 civilians in Mogadishu\nNasteh said his main work for Shabaab’s Amniyat secret police was spying on leaders to stop them violating rules by skimming money or favoring their clan, and planning assassinations in government territory.\n“You study a person - his home, his work, his associates, his routes. If he’s not accessible using a pistol, or a landmine, then you use a car bomb,” said the slender, softly-spoken young man.\nWHAT NEXT? The government’s push to help defectors in a more organized way began in 2014 after splits in the insurgents prompted top Islamist Hassan Dahir Aweys to come across. He remains under house arrest since he hasn’t renounced violence.\nClose behind was Zakariya Ahmed Ismail Hersi, the ex-intelligence chief who once had a $3 million U.S. bounty on his head, and Mohamed Said Atom, the militants’ former head in the northern region of Puntland. Mukhtar Robow Abu Mansur came last August.\nSomalia has no law granting amnesty for defections, but there is a cabinet-level policy that all regional states accept.\nMany defectors are working alongside the government they once fought. Hersi is deputy head of intelligence at the National Intelligence and Security Agency. Atom was relocated to Qatar. Robow, his militia intact, is exhorting Somalis to fight al Shabaab. All came across after losing favor with al Shabaab.\n“A lot of these guys have got blood on their hands all the way up to the elbows,” said a Western adviser. “But they can rise to a very high level (in government).”\nHarmonie Toros, senior lecturer at the University of Kent, said the government needs a political strategy.\n“The strength is that it (defections) demonstrates to a certain degree that there are senior members of al Shabaab who are not crazy radicals, that we can talk to,” she said. “The risk is if you pull all the moderates out, you only leave the ideologues.”\nScholars and Somalis say the government must show its strength, not just the other side’s weakness. That’s hard with a tiny budget, constant infighting and massive corruption, but there has been progress.\nA Somali involved in helping defectors said his country’s political instability was the biggest challenge, but at least they were helping destabilize the other side.\n“The government and insurgency can both be heading downwards,” he said, making a dipping motion with his hands. “But people will still come across if they feel the insurgency is going down faster.”\nAdditional reporting by Feisal Omar in Mogadishu; editing by Giles Elgood\n ", "external_links": [], "published": "2018-01-24T09:08:00.000+02:00", "crawled": "2018-01-24T09:17:00.037+02:00", "highlightTitle": ""}