{"organizations": [], "uuid": "00eac3865e33dfe9c67ed98831e5be75fa206254", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180107&t=2&i=1220041593&w=1200&r=LYNXMPEE060HP", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews", "section_title": "Reuters: Sports News", "url": "https://uk.reuters.com/article/uk-soccer-england-npt-lee/leeds-suffer-shock-cup-exit-at-newport-idUKKBN1EW0LH", "country": "US", "domain_rank": 408, "title": "Leeds suffer shock Cup exit at Newport", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-07T16:38:00.000+02:00", "replies_count": 0, "uuid": "00eac3865e33dfe9c67ed98831e5be75fa206254"}, "author": "", "url": "https://uk.reuters.com/article/uk-soccer-england-npt-lee/leeds-suffer-shock-cup-exit-at-newport-idUKKBN1EW0LH", "ord_in_thread": 0, "title": "Leeds suffer shock Cup exit at Newport", "locations": [], "entities": {"persons": [{"name": "mccoulsky", "sentiment": "none"}, {"name": "reuters/rebecca naden", "sentiment": "none"}, {"name": "conor shaughnessy", "sentiment": "none"}, {"name": "samuel saiz", "sentiment": "none"}, {"name": "shawn mccoulsky", "sentiment": "none"}, {"name": "gaetano berardi", "sentiment": "none"}], "locations": [{"name": "newport", "sentiment": "none"}, {"name": "newport county", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "rodney parade", "sentiment": "none"}], "organizations": [{"name": "newport reuters", "sentiment": "negative"}, {"name": "newport", "sentiment": "negative"}, {"name": "leeds", "sentiment": "negative"}, {"name": "leeds united - rodney parade", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "leeds united", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 7, 2018 / 2:43 PM / Updated 5 hours ago Leeds suffer shock Cup exit at Newport Reuters Staff 3 Min Read \n(Reuters) - Fourth-tier Newport County stunned former winners Leeds United with a last-gasp 2-1 victory in the FA Cup third round to spark a joyous pitch invasion at their Rodney Parade ground on Sunday. Soccer Football - FA Cup Third Round - Newport County AFC vs Leeds United - Rodney Parade, Newport, Britain - January 7, 2018 Newport County's Shawn McCoulsky scores their second goal REUTERS/Rebecca Naden \nThe Welsh club seemed to have earned themselves a well-deserved replay as the clock ticked into the 90th minute but substitute Shawn McCoulsky’s header sparked wild celebrations. \nLeeds, sixth in the second tier Championship and 53 places higher up the ladder, went ahead through Gaetano Berardi’s ninth-minute strike and appeared to be heading through until Conor Shaughnessy’s own goal 15 minutes from fulltime. \nAfter McCoulsky’s headed winner, Leeds’s day went from bad to worse as they had Samuel Saiz sent off in stoppage time. \n“This is much better, beating Championship teams like Leeds. I don’t want to be winning relegation battles, I want to be winning FA Cup ties and climbing the table,” Newport manager Michael Flynn said. \n“It was an outstanding header. He (McCoulsky) has 11 goals for us this season and he has been superb for us. He was hungry and wanted it and I am delighted.” Soccer Football - FA Cup Third Round - Newport County AFC vs Leeds United - Rodney Parade, Newport, Britain - January 7, 2018 Newport County's Mickey Demetriou celebrates while Leeds United's Hadi Sacko looks on after the match REUTERS/Rebecca Naden \nLeeds made nine changes to their lineup but took the lead when Berardi’s 30-metre low shot took a crucial deflection off his team mate Pierre-Michel Lasogga to leave Newport keeper Joe Day wrong-footed. \nNewport pushed for an equaliser but needed a slice of luck to draw level when Frank Nouble’s cross deflected off of team mate Padraig Amond and then Shaughnessy on its way onto the net. Slideshow (4 Images) \nThe best was yet to come though for the hosts though as McCoulsky, on as a 69th-minute substitute, rammed in a late header from a corner. \n“It is a brilliant feeling. The gaffer told me to come on and affect the game as much as I can,” he said. \n“I can’t remember most of it, it was a blur to be honest. It is definitely one of my best goals, to knock Leeds out of the FA Cup is what dreams are made of.” \nIt is the second season in succession Leeds have suffered a humiliating exit in the Cup after losing to minor league Sutton United in the fourth round last time. Reporting by Martyn Herman; Editing by Toby Davis", "external_links": [], "published": "2018-01-07T16:38:00.000+02:00", "crawled": "2018-01-07T17:03:15.016+02:00", "highlightTitle": ""}