{"organizations": [], "uuid": "ae9d0b6a8e26bbe2210c9746619c54e781e46200", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220832537&w=1200&r=LYNXMPEE090TO", "site_section": "https://www.reuters.com/", "section_title": "Business &amp; Financial News, U.S &amp; International Breaking News | Reuters", "url": "https://www.reuters.com/article/us-usa-economy-inflation/u-s-import-prices-post-smallest-gain-in-five-months-idUSKBN1EZ1LX", "country": "US", "domain_rank": 408, "title": "U.S. import prices post smallest gain in five months", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T21:40:00.000+02:00", "replies_count": 0, "uuid": "ae9d0b6a8e26bbe2210c9746619c54e781e46200"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/us-usa-economy-inflation/u-s-import-prices-post-smallest-gain-in-five-months-idUSKBN1EZ1LX", "ord_in_thread": 0, "title": "U.S. import prices post smallest gain in five months", "locations": [], "entities": {"persons": [], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "decembe", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "labor department", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (Reuters) - U.S. import prices recorded their smallest increase in five months in December and underlying imported price pressures were muted amid declining costs for food and consumer goods. \nThe slowdown in import price growth came despite a weak dollar, which could temper expectations that inflation will pick up this year and keep the Federal Reserve on a path of gradual interest rate increases. \n“Fed officials are desperate for more inflation and will take it from any quarter,” said Chris Rupkey, chief economist at MUFG in New York. “Today’s import price data will worry the Fed doves even more about too-low inflation.” \nThe Labor Department said on Wednesday import prices edged up 0.1 percent last month after accelerating 0.8 percent in November. That was the smallest gain since July and was well below economists’ expectations for a 0.5 percent increase. \nIn the 12 months through December, prices increased 3.0 percent, slowing from November’s 3.3 percent jump. The dollar lost 7 percent of its value against the currencies of the United States’ main trading partners last year. \nProducer and consumer price reports on Thursday and Friday could offer fresh clues on the near-term inflation outlook. \nThe Fed’s preferred inflation measure, the personal consumption expenditures (PCE) price index excluding food and energy, has undershot the U.S. central bank’s 2 percent target since May 2012. The Fed raised interest rates three times in 2017 and has forecast three rate hikes this year. \nU.S. financial markets were little moved by the data as investors digested a report from Bloomberg News that Chinese officials have recommended the country slow down or halt its purchases of U.S. securities. China is the largest foreign holder of U.S. government debt. \nThe yield on the benchmark 10-year U.S. Treasury note jumped to a 10-month high, while the dollar fell against a basket of currencies. Stocks on Wall Street were trading lower. \nLast month, prices for imported petroleum rose 2.0 percent after surging 8.1 percent in November. Import prices excluding petroleum fell 0.2 percent, reversing a 0.2 percent gain in November. Import prices excluding petroleum rose 1.3 percent in the 12 months through December. \n“Our expectation for the dollar to decline further, along with another year of decent global growth, should lead non-fuel import prices to press higher this year,” said Sarah House, an economist at Wells Fargo Securities in Charlotte, North Carolina. “That said, with goods accounting for only a quarter of core CPI, the lift to more closely watched measures of consumer price inflation should be modest.” \nWHOLESALE INVENTORIES REBOUND Imported capital goods prices were unchanged in December while the cost of food declined 0.7 percent. \nThe price of goods imported from China fell 0.1 percent in December after advancing 0.3 percent the prior month. Prices for imports from China dropped 0.2 percent in 2017 and have not recorded a calendar-year increase since 2011. \nThe cost of goods imported from Canada and Mexico was unchanged in December after rising 2.3 percent and 0.1 percent respectively in November. \nThe Labor Department also reported that export prices slipped 0.1 percent in December, declining for the first time since June, as agricultural prices fell for a second straight month. Export prices rose 0.5 percent in November. \nThey increased 2.6 percent year-on-year after rising 3.1 percent in November. \nIn a separate report on Wednesday, the Commerce Department said wholesale inventories rebounded 0.8 percent in November, instead of 0.7 percent as estimated last month. That followed a 0.4 percent drop in October. \nThe component of wholesale inventories that goes into the calculation of gross domestic product - wholesale stocks excluding autos - also rose 0.8 percent in November, suggesting inventories could be a small drag on GDP in the fourth quarter. \nInventory investment contributed almost eight-tenths of a percentage point to the economy’s 3.2 percent annualized growth pace in the third quarter. The Atlanta Fed raised its fourth-quarter GDP growth estimate by one-tenth of a percentage point to a 2.8 percent rate after the wholesale inventory data. \nSales at wholesalers shot up 1.5 percent in November after increasing 0.8 percent in October. At November’s sales pace it would take wholesalers 1.24 months to clear shelves, the fewest since November 2014, down from 1.25 months in October. \nReporting By Lucia Mutikani; Editing by Andrea Ricci\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html"], "published": "2018-01-10T21:40:00.000+02:00", "crawled": "2018-01-10T15:51:19.022+02:00", "highlightTitle": ""}