{"organizations": [], "uuid": "a594be618d67fd587aa4c53867f568636f68696b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://www.reuters.com/resources/archive/us/20180112.html", "section_title": "Archive News &amp; Video for Friday, 12 Jan 2018 | Reuters.com", "url": "https://www.reuters.com/article/easteurope-markets/cee-markets-currencies-firm-on-dollar-selling-hungarian-bonds-firm-idUSL8N1P722U", "country": "US", "domain_rank": 408, "title": "CEE MARKETS-Currencies firm on dollar selling, Hungarian bonds firm", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-12T18:21:00.000+02:00", "replies_count": 0, "uuid": "a594be618d67fd587aa4c53867f568636f68696b"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/easteurope-markets/cee-markets-currencies-firm-on-dollar-selling-hungarian-bonds-firm-idUSL8N1P722U", "ord_in_thread": 0, "title": "CEE MARKETS-Currencies firm on dollar selling, Hungarian bonds firm", "locations": [], "entities": {"persons": [{"name": "sandor peto", "sentiment": "none"}], "locations": [{"name": "budapest", "sentiment": "none"}, {"name": "hungary", "sentiment": "none"}], "organizations": [{"name": "european central bank", "sentiment": "none"}, {"name": "ecb", "sentiment": "none"}, {"name": "nbh", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "* Dollar plunge vs euro triggers currency buying in CEE * Hungarian bonds firm, Dec inflation was below forecasts * Hungarian central bank seen keeping long-term yields low By Sandor Peto BUDAPEST, Jan 12 (Reuters) - Central European currencies firmed on Friday as global dollar selling accelerated after reports that German parties reached a breakthrough in coalition talks. The euro jumped against the dollar as the news added fuel to a rally driven by expectations that the European Central Bank could taper its massive monetary stimulus. Such expectations have a two-pronged effect on Central European assets which have been indirectly helped by the ECB's asset buying and low interest rates. Less stimulus could mean less buying force, but rising ECB rates could nudge the region's central banks towards tighter policy. The forint eased a bit in early trade against the euro after Hungary's December annual inflation came in at 2.1 percent, below analysts' 2.3 percent forecast and the 3 percent midpoint of the Hungarian central bank's (NBH) target range. But it firmed when the euro jumped to a 3-year high versus the dollar. The forint traded at 308.63 versus the euro at 0918 GMT. \"We saw a big wave in dollar selling,\" one Budapest-based trader said. The zloty and the leu gained 0.1 percent, and the dinar 0.3 percent, moving in the same direction even though monetary policies diverge in the region. Romania's central bank (NBR) delivered its first rate hike in a decade on Monday, Poland reaffirmed its loose monetary policy stance, and Serbia kept the region's highest benchmark rate on hold. The NBH, which Citigroup said in a note was \"the most dovish central bank in the world\", is expected to loosen policy further, launching a new interest rate swap facility on Jan. 18. \"The first IRS auction will be an important guidance of how much premium the NBH is willing to give to keep the flattening pressure in the curve,\" it said. Hungarian government bonds took little notice to swings in global yields this week. Long-term yields continued to drop on Friday, shedding one basis point, with 10-year papers trading at 1.94 percent. Poland's corresponding yield also retreated following a rise on Thursday, dropping two basis points to 3.32 percent. Romania's 10-year yield was bid at 4.32 percent, up one basis point. The country's annual inflation ticked up to 3.3 percent in December as expected, and could rise above the NBR's 1.5-3.5 percent target range soon. A failure by the bank to push it back by late 2018 \"would be a game changer from the perspective of the current (financial) forecasts in the market,\" Erste analyst Eugen Sinca said in a note. CEE SNAPSHOT AT MARKETS 1018 CET CURRENCI ES Latest Previous Daily Change bid close change in 2018 Czech <EURCZK= 25.5250 25.5220 -0.01% +0.07% crown > Hungary <EURHUF= 308.6300 308.7500 +0.04% +0.74% forint > Polish <EURPLN= 4.1660 4.1700 +0.10% +0.25% zloty > Romanian <EURRON= 4.6372 4.6400 +0.06% +0.92% leu > Croatian <EURHRK= 7.4560 7.4645 +0.11% -0.34% kuna > Serbian <EURRSD= 118.4100 118.7500 +0.29% +0.08% dinar > Note: calculated from 1800 CET daily change Latest Previous Daily Change close change in 2018 Prague 1107.69 1107.680 +0.00% +2.74% 0 Budapest 39788.59 39772.75 +0.04% +1.04% Warsaw 2543.32 2534.56 +0.35% +3.34% Bucharest 8223.56 8167.91 +0.68% +6.06% Ljubljana <.SBITOP 822.51 819.74 +0.34% +2.00% > Zagreb 1861.60 1858.08 +0.19% +1.02% Belgrade <.BELEX1 770.52 767.80 +0.35% +1.41% 5> Sofia 710.04 702.78 +1.03% +4.81% BONDS Yield Yield Spread Daily (bid) change vs Bund change in Czech spread Republic 2-year <CZ2YT=R 0.6240 0.0990 +118bps +10bps R> 5-year <CZ5YT=R 0.9990 0.0520 +109bps +3bps R> 10-year <CZ10YT= 1.7270 0.0520 +121bps +6bps RR> Poland 2-year <PL2YT=R 1.6350 0.0090 +220bps +1bps R> 5-year <PL5YT=R 2.6180 0.0030 +271bps -2bps R> 10-year <PL10YT= 3.3440 -0.0020 +282bps +0bps RR> FORWARD RATE AGREEMEN T 3x6 6x9 9x12 3M interban k Czech Rep 1.04 1.22 1.35 0.76 <PRIBOR= > Hungary 0.09 0.10 0.21 0.02 Poland 1.76 1.79 1.87 1.72 Note: FRA are for ask prices Quote: s", "external_links": [], "published": "2018-01-12T18:21:00.000+02:00", "crawled": "2018-01-13T14:48:46.046+02:00", "highlightTitle": ""}