{"organizations": [], "uuid": "08b832c3d6f628003acac0f85193488ea970e149", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180110&t=2&i=1220894421&w=1200&r=LYNXMPEE091AK", "site_section": "http://feeds.reuters.com/reuters/UKBusinessNews/", "section_title": "Reuters: Business News", "url": "https://uk.reuters.com/article/uk-usa-bonds-china/china-may-be-mulling-treasuries-slowdown-but-options-limited-idUKKBN1EZ2D2", "country": "US", "domain_rank": 408, "title": "China may be mulling Treasuries slowdown, but options limited", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T20:11:00.000+02:00", "replies_count": 0, "uuid": "08b832c3d6f628003acac0f85193488ea970e149"}, "author": "", "url": "https://uk.reuters.com/article/uk-usa-bonds-china/china-may-be-mulling-treasuries-slowdown-but-options-limited-idUKKBN1EZ2D2", "ord_in_thread": 0, "title": "China may be mulling Treasuries slowdown, but options limited", "locations": [], "entities": {"persons": [{"name": "david lawder", "sentiment": "none"}, {"name": "dhara ranasinghe", "sentiment": "none"}], "locations": [{"name": "china", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}], "organizations": [{"name": "treasuries", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "bloomberg news", "sentiment": "none"}, {"name": "u.s. treasury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 10, 2018 / 6:00 PM / Updated 4 minutes ago China may be mulling Treasuries slowdown, but options limited Dhara Ranasinghe , David Lawder 5 Min Read \nLONDON/WASHINGTON (Reuters) - Chinese officials reviewing the country’s vast foreign exchange holdings have recommended slowing or halting purchases of U.S. Treasury bonds amid a less attractive market for them and rising U.S.-China trade tensions, Bloomberg News reported on Wednesday. FILE PHOTO: A man walks past an advertisement promoting China's renminbi (RMB) or yuan, U.S. dollar and Euro exchange services at foreign exchange store in Hong Kong, China, August 13, 2015. REUTERS/Tyrone Siu \nThe report sent U.S. Treasury yields to 10-month highs and sent the dollar lower. Economists cautioned, however, that China would not be able to make large changes to the composition of its reserves as it needs them to manage its renminbi exchange rate. \nChina has the world’s biggest currency reserves, approximately $3 trillion, and is the biggest foreign holder of U.S. government debt, with $1.19 trillion in Treasuries as of October 2017, according to data from the Treasury Department. \nGRAPHIC-U.S. Treasuries top foreign holders - reut.rs/2DjHnk0 \nGRAPHIC-Chinese ownership of U.S. Treasuries - reut.rs/2COP5Bl \nThe Bloomberg report, which cited people familiar with the matter without identifying their seniority or input into the report, quoted the sources as saying the market for U.S. government bonds is becoming less attractive relative to other assets. They also cited trade tensions with the United States as a reason to slow Treasury purchases, the report said. \nBloomberg said the Chinese officials did not specify why trade tensions would cause a cutback in Treasuries purchases. \nU.S. Treasury Undersecretary David Malpass, speaking to reporters in Brussels, dismissed any concerns about China’s demand for U.S. Treasuries. \n“The U.S. Treasury market is a deep, robust market within the world and so we are confident that our economy, with the economy strengthening, that it will remain a deep, robust market,” Malpass said when asked to comment on the report. \nMalpass, who heads international affairs for Treasury, also reiterated his concerns about China’s emphasis on its state-owned enterprises and government subsidies that distort capital allocation. LITTLE ROOM TO MANOEUVRE \nChina’s State Administration of Foreign Exchange did not immediately respond to a faxed request for comment on the Bloomberg report. The People’s Bank of China could also not be reached for comment outside business hours. \nMajor government bond yields extended earlier gains after the report. The yield on 10-year U.S. Treasury US10YT=RR hit a 10-month high of 2.59 percent in European trade and was up 4 basis points on the day. That pushed the dollar to a six-week low against the Japanese yen. \nWall Street’s major indexes fell, stalling the rally that marked the start of 2018. \nBut some economists noted that China had already eased Treasury holdings and would not be able to more aggressively reduce holdings without hurting its portfolio, given its need for stable and liquid dollar assets. \n“There aren’t many places you can stick that money,” said Paul Ashworth, economist at Capital Economics in Toronto. \nChina uses its holdings of foreign currency bonds to keep its currency at the rate where it wants it, and given this desire for stability, there might not be much room for manoeuvre on the composition of its reserves. \nBut Ashworth noted that the move could serve as a warning that China could quickly shift U.S. borrowing costs higher if the Trump administration started a trade war with Beijing. \nThe administration is considering several new tariff moves in the coming weeks, including broad restrictions on steel and aluminium imports and punitive actions against China arising from an investigation into Beijing’s intellectual property practices. \nThe report comes amid increasing nervousness about bond weakness after the Bank of Japan said on Tuesday it will trim its purchases of Japanese government bonds, raising speculation it will reduce its monetary stimulus this year. \n“People were already jittery about Treasuries,” said Aaron Kohli, an interest rate strategist at BMO Capital Markets in New York, noting the Chinese news is “piling on.” Reporting by Dhara Ranasinghe, Tommy Wilkes, Saikat Chatterjee, Ritvik Carvalho in London; Karen Brettell and Saqib Ahmed in New York; David Lawder, Jason Lange and David Chance in Washington and Jan Strupczewski in Brussels; Writing by Frances Kerry; Editing by Sujata Rao and Nick Zieminski", "external_links": [], "published": "2018-01-10T20:11:00.000+02:00", "crawled": "2018-01-10T20:23:06.013+02:00", "highlightTitle": ""}