{"organizations": [], "uuid": "49ad0bb7a19b60d25ddf567bb669d8a8c933c225", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 2}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "in.reuters.com", "main_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20180129&t=2&i=1226223866&w=1200&r=LYNXMPEE0S0GA", "site_section": "http://feeds.reuters.com/reuters/INtopNews\r", "section_title": "Reuters: Top News", "url": "https://in.reuters.com/article/india-economic-survey-report-budget/india-sees-growth-picking-up-in-coming-fiscal-year-newsrise-idINKBN1FI0IL", "country": "US", "domain_rank": 408, "title": "Economic Survey: Government sees growth of 7-7.5 percent in 2018/19 fiscal year", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-29T09:27:00.000+02:00", "replies_count": 0, "uuid": "49ad0bb7a19b60d25ddf567bb669d8a8c933c225"}, "author": "", "url": "https://in.reuters.com/article/india-economic-survey-report-budget/india-sees-growth-picking-up-in-coming-fiscal-year-newsrise-idINKBN1FI0IL", "ord_in_thread": 0, "title": "Economic Survey: Government sees growth of 7-7.5 percent in 2018/19 fiscal year", "locations": [], "entities": {"persons": [{"name": "arun jaitley", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}], "organizations": [{"name": "reuters staff", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 29, 2018 / 6:44 AM / Updated 9 hours ago Economic Survey: India expects to regain pole position as fastest-growing major economy Neha Dasgupta , Rupam Jain , Mayank Bhardwaj 5 Min Read \nNEW DELHI (Reuters) - India on Monday forecast its economic growth would accelerate to 7 to 7.5 percent in the 2018/19 fiscal year, to once again become the world’s fastest-growing major economy. \nThe government’s economic survey, presented to parliament on Monday, went on to say that though the plan has been to reduce the fiscal deficit from an estimated 3.2 percent this year to 3.0 percent in 2018/19, a pause in the move toward a lower deficit could be merited in order to give the economy momentum. \nPrime Minister Narendra Modi’s nationalist government is gearing up for a general election in 2019, and speaking to reporters after the survey’s release, the finance ministry’s chief economic adviser alluded to political considerations for possibly letting the deficit target slip. \n“The cycle calls for ambitious consolidation but the political cycle calls for maybe more modest consolidation so it has to be a balance between the two,” Arvind Subramaniam said. \nThe survey, an annual report on the health of the economy, was released ahead of the government’s budget statement, due to be presented by Finance Minister Arun Jaitley on Thursday. \n“A series of major reforms undertaken over the past year will allow real GDP growth to reach 6.75 percent this fiscal (year) and will rise to 7.0 to 7.5 percent in 2018/19, thereby reinstating India as the world’s fastest growing major economy,” the survey said. \nA senior official at China’s National Development and Reform Commission (NDRC) wrote in the Beijing daily on Monday that India’s main economic rival in Asia was likely to see growth slow to 6.5-6.8 percent this year. \nFuelled by stronger private investment and exports, the recovery forecast for India’s growth rate comes after the country posted its slowest growth in three years in 2017/18. \nThe slowdown was partly a consequence of the chaotic rollout of a nationwide goods and service tax (GST) last year and a shock move to take high value currency notes out of circulation in late 2016. \nThe budget is expected to step up funding of rural development programmes and help small businesses as Prime Minister Narendra Modi’s nationalist government heads into a national election in 2019. Workers make pipes used for drilling, at a factory in an industrial area in Mumbai, India January 29, 2018. REUTERS/Danish Siddiqui \n“GDP growth might be at the lower end of the range, but broadly the estimates are in line with our expectations,” said Suvodeep Rakshit, senior economist at Kotak Institutional Equities in Mumbai. \n“The government will likely focus on rural and urban infrastructure, housing, agriculture as well as bit on the capital expenditure front with a judicious mix of budgetary and extra budgetary expenditure,” Rakshit added. \nThe survey cautioned that persistently high oil prices remained a key risk for a country that relies on imports for much of its fuel needs. SHARES RISE Slideshow (2 Images) \nThe survey echoes the International Monetary Fund’s view that India will regain the title of being the world’s fastest growing major economy in the coming fiscal year. The IMF last week predicted India would grow 7.4 percent in fiscal 2019. \nThe government also warned that climate change could pare back annual agricultural incomes in India by 15 percent to 25 percent with unirrigated lands being harder hit by rising temperatures and declines in rainfall. \nAlready farm incomes have fallen because of the rising cost of production while crop prices have not risen, presenting a potential risk to Modi’s Bharatiya Janata Party (BJP) in the upcoming election after it barely won re-election in his home state of Gujarat last month. \nIndian shares touched record highs on the projected acceleration in growth in 2018/19, but bonds fell in response to the survey’s suggestion that some fiscal slippage could be warranted. \nThe benchmark 10-year bond yields were up 4 basis points to 7.52 percent from its previous close. \nThe BSE Sensex ended 0.65 percent higher after earlier climbing as much as 1.09 percent to an all-time high of 36,443.98. \nThe broader NSE Nifty end 0.55 percent higher at 11,130.40, after rising as much as 0.92 percent to a record high of 11,171.55. Additional reporting by Delhi and Mumbai bureaux; Writing by Euan Rocha and Sanjeev Miglani; Editing by Simon Cameron-Moore", "external_links": [], "published": "2018-01-29T09:27:00.000+02:00", "crawled": "2018-01-29T09:41:34.007+02:00", "highlightTitle": ""}