{"organizations": [], "uuid": "6cdfcf924fa28c2a47e2b700c750a86f7d1fc5bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/19/104954587-GettyImages-906484798.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/100727362/device/rss/rss.html", "section_title": "World News &amp; Analysis", "url": "https://www.cnbc.com/2018/01/19/italian-election-this-is-the-secret-to-berlusconi-popularity.html", "country": "US", "domain_rank": 767, "title": "Italian election: this is the secret to Berlusconi's popularity", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-19T08:45:00.000+02:00", "replies_count": 0, "uuid": "6cdfcf924fa28c2a47e2b700c750a86f7d1fc5bf"}, "author": "Silvia Amaro", "url": "https://www.cnbc.com/2018/01/19/italian-election-this-is-the-secret-to-berlusconi-popularity.html", "ord_in_thread": 0, "title": "Italian election: this is the secret to Berlusconi's popularity", "locations": [], "entities": {"persons": [{"name": "silvio berlusconi", "sentiment": "negative"}, {"name": "berlusconi", "sentiment": "negative"}, {"name": "francesco filia", "sentiment": "none"}], "locations": [{"name": "italy", "sentiment": "none"}], "organizations": [{"name": "cnbc", "sentiment": "none"}, {"name": "fasanara capital", "sentiment": "none"}, {"name": "ac milan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Silvio Berlusconi has been prime minister of Italy three times.\nDespite a series of sex scandals and tax fraud convictions, the 81-year-old media mogul is once again at the center stage of Italian politics and could have a pivotal role in the upcoming general election.\nCNBC asked analysts what's the secret of Berlusconi's popularity.\n\"The key point about Silvio Berlusconi, in my opinion, is the continued ability to differentiate himself clearly from competitors in Italian politics, despite being himself a politician for almost three decades and one with a debatable track record,\" Francesco Filia, chief executive officer at Fasanara Capital, told CNBC via email.\nBerlusconi was appointed prime minister in 1994, 2001 and 2008. With a degree in law, his professional life started very much as a businessman. Prior to becoming prime minister, he founded a real estate firm, launched TV networks, bought department stores and even a soccer club — AC Milan.\n\"As a self-made man, a great salesperson, a man of business and a billionaire, he has no match in the political landscape in Italy,\" Filia said, highlighting that this is not to express any political opinion, but rather to address what the roots of his traction might be.\nshow chapters Berlusconi definitely has a chance in the Italian election: Fasanara Capital 5:59 AM ET Wed, 17 Jan 2018 | 02:34 The first investigations into tax fraud began during his second-term as a prime minister. However, Berlusconi ended up convicted of tax fraud only later, in October 2012.\nIn 2011, while serving his third mandate, reports that Berlusconi was being investigated for having sex with an underage girl spread and he faced trial in the same year. Later in 2011, at the height of the financial crisis in the euro zone, Berlusconi resigned from office after parliament approved an austerity budget.\n\"With memories of the sovereign debt crisis, Berlusconi's legal troubles and his sex scandals having somewhat faded, the former prime minister is now seeking to play the role of elder statesman,\" Peter Ceretti, analyst at the Economist Intelligence Unit (EIU), told CNBC via email.\nGabriel Bouys | AFP | Getty Images This front pages of Italian newspapers after Italy's top court upheld a jail sentence against Berlusconi. \"He calibrates his message to different audiences, knowing when he can tell an off-color joke, and when it is better to discuss policy. His age even seems to be an asset, as more than 40 percent of the Italian electorate is 55 or older, and more than a quarter is 65 or older,\" Ceretti said.\nA poll released on January 10 showed Berlusconi with 25 percent of voters' confidence — slightly above the levels registered in the two previous months. His rival and fellow former prime minister, Matteo Renzi, also received a 25 percent voter confidence rating. However, both polled far below the current caretaker prime minister, Paolo Gentiloni, as the politician that Italians trust the most, with 35 percent of support. But the latter is not running for office.\n\"In spite of having been prime minister three different times, somehow, to a lot of Italians angry about politics he looks like an outsider who failed on his grand plans for Italy because of a backlash from the political establishment. In a way, his 'rocambolesque' relationship with EU authorities and Ms Merkel in the past also helps his case with Italian voters, as most of the country is skeptical of the EU,\" Filia said.\n\"A cardinal rule of covering Italian politics is to never count Silvio out.\" -Peter Ceretti, Analyst at the EIU Berlusconi's party Forza Italia sits below the populist Five Star Movement and the Democratic Party led by Renzi in current opinion polls. However, Berlusconi has joined forces with other right-wing parties ahead of the March 4 election , which puts him in a good position to overcome Renzi and potentially the Five Star Movement.\nSome analysts have predicted a victory for Berlusconi's coalition, albeit without an outright majority. This means that he would have an important role in negotiating with other parties to form a stable government.\n\"Most analysts have wrongly predicted his political demise at some point or another since 1994,\" Ceretti said. \"A cardinal rule of covering Italian politics is to never count Silvio out.\"", "external_links": [], "published": "2018-01-19T08:45:00.000+02:00", "crawled": "2018-01-19T09:09:02.055+02:00", "highlightTitle": ""}