{"organizations": [], "uuid": "098b122ab244534c96d4554cb18f13e3ad8f4352", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fortune.com", "main_image": "https://fortunedotcom.files.wordpress.com/2017/01/fortune-logo.jpg", "site_section": "", "section_title": "", "url": "http://fortune.com/2018/01/10/brainstorm-health-daily-01-10-18/", "country": "US", "domain_rank": 1196, "title": "Brainstorm Health: Cows and MERS, JPMorgan Updates, Cigarette Smoking | Fortune", "performance_score": 0, "site": "fortune.com", "participants_count": 0, "title_full": "", "spam_score": 0.996, "site_type": "news", "published": "2018-01-11T17:13:00.000+02:00", "replies_count": 0, "uuid": "098b122ab244534c96d4554cb18f13e3ad8f4352"}, "author": "Sy Mukherjee", "url": "http://fortune.com/2018/01/10/brainstorm-health-daily-01-10-18/", "ord_in_thread": 0, "title": "Brainstorm Health: Cows and MERS, JPMorgan Updates, Cigarette Smoking | Fortune", "locations": [], "entities": {"persons": [], "locations": [{"name": "saudi arabia", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "jpmorgan updates", "sentiment": "negative"}, {"name": "cdc", "sentiment": "none"}, {"name": "lancet infectious diseases", "sentiment": "none"}, {"name": "centers for disease control", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "3:13 PM EST \nHello and happy hump day, readers! This is Sy. \nAnimals are critical to scientific discovery. They serve as the (somewhat literal) guinea pigs for human drug development and product testing. And U.S. scientists are now saying that yet another major medical breakthrough may be facilitated by our fauna fellows—specifically, antibodies grown in genetically modified cows that protect against the deadly Middle East Respiratory Syndrome, aka MERS virus . \nMERS is a condition that mainly afflicts people in Saudi Arabia and causes severe respiratory illness. That includes (often fatal) fever, cough, and shortness of breath , according to the Centers for Disease Control (CDC). The first major outbreak was reported just six years ago, so there have basically been no treatments developed for it yet. With a relatively small and isolated patient population, MERS has a staggering 35% fatality rate. \nBut one avenue that may hold promise for fighting the virus may lay in… Cows. In a new paper published in the journal Lancet Infectious Diseases , researchers say that cows with certain strands of human DNA spliced into their genome were able to generate antibodies, called SAB-301, that could help protect against MERS and safe for humans. \n“This is the first study to show the safety and immune effects of a potential treatment for MERS,” said the study’s co-lead, John Beigel, according to Reuters . “The data from our study suggest that SAB-301 is safe, and further research into the treatment is warranted.” \nCows are far from our only mammalian relatives that serve a critical medical research need. There’s plenty of credit to go around for mice , rats, and of course , pigs, too. \nRead on for the day’s news. Sy Mukherjee @the_sy_guy DIGITAL HEALTH \nGene therapy specialist Bluebird to seek 3 drug approvals by 2019’s end. In new news out of the JPMorgan Healthcare conference: Bluebird Bio is staking out an ambitious drug approval timeline: 3 new treatments cleared by the FDA by the end of next year. The company specializes in gene therapy (including for rare inherited blood disorders) and is also working with biotech giant Celgene on a new kind of blood cancer treatment that re-engineers patients’ immune cells to fight cancer (the first-ever therapies in this space, from Novartis and Gilead/Kite Pharma, were approved in 2017). ( Reuters ) INDICATIONS \nThe importance of a “p-value.” Clinical trial failures are a near-necessity in the life sciences field—especially when it involves a bold R&D model like that of Roivant Sciences, the umbrella company established by the young hedge funder-turned-biotech entrepreneur Vivek Ramaswamy . I’ve written about the firm, and Ramaswamy, multiple times, including an extended roundtable piece on how he was able to sway respected biopharma veterans with decades of experience to join his improbable mission of picking up potentially promising drugs ditched by other drug makers and pushing them past the FDA finish line. But one Roivant company in particular, the Alzheimer’s and neurological disease-focused Axovant (and headed by biotech pro David Hung), has had a rough go with clinical trial failures as of late. And it certainly didn’t help itself this week when the company incorrectly stated that the “p-value”—very roughly put, a measure of how significant a study’s findings are statistically—for one of its clinical endpoints on an experimental drug was far better than it actually was. Hung has now said this was a transcription error the firm takes responsibility for; but it was quite an error. Axovant originally reported a p-value of 0.011; the actual one was 0.531. In plain English: The latter is way, way, way worse. THE BIG PICTURE \nThe danger of even one cigarette. We know that cigarettes are bad in bulk, or even in relative moderation. But what if just one cigarette smoking experiment could lead to devastating health outcomes? That’s exactly what a new study by British researchers suggests. To be clear: The research is survey-based, so you should take it with a grain or two of salt. But the findings indicate that smoking just one cigarette, at least in the short term, could cause more than 60% of users to become daily users. REQUIRED READING ", "external_links": [], "published": "2018-01-11T17:13:00.000+02:00", "crawled": "2018-01-11T01:55:18.015+02:00", "highlightTitle": ""}