{"organizations": [], "uuid": "fe80237ca64943f92be314600bd33da3ac0a61af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/01/04/104927719-GettyImages-901091170.1910x1000.jpg", "site_section": "", "section_title": "", "url": "https://www.cnbc.com/2018/01/04/turkey-says-us-conviction-of-banker-is-unprecedented-interference.html", "country": "US", "domain_rank": 767, "title": "Turkey says US conviction of banker is 'unprecedented interference'", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "", "spam_score": 0.199, "site_type": "news", "published": "2018-01-04T13:12:00.000+02:00", "replies_count": 0, "uuid": "fe80237ca64943f92be314600bd33da3ac0a61af"}, "author": "Altan Gocher", "url": "https://www.cnbc.com/2018/01/04/turkey-says-us-conviction-of-banker-is-unprecedented-interference.html", "ord_in_thread": 0, "title": "Turkey says US conviction of banker is 'unprecedented interference'", "locations": [], "entities": {"persons": [{"name": "mehmet hakan atilla", "sentiment": "none"}, {"name": "altan gocher", "sentiment": "none"}, {"name": "atilla", "sentiment": "none"}, {"name": "sozcu", "sentiment": "none"}], "locations": [{"name": "turkey", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "iran", "sentiment": "none"}, {"name": "ankara", "sentiment": "none"}, {"name": "halkbank", "sentiment": "none"}], "organizations": [{"name": "mins ago reuters", "sentiment": "none"}, {"name": "nato", "sentiment": "none"}, {"name": "halk bank", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Turkey said on Thursday a U.S. jury's decision to convict a Turkish banker for helping Iran evade sanctions was an unprecedented interference in its internal affairs, and dismissed the court case as a political plot. \nThe court decision, which capped a trial that had already strained diplomatic relations between the two countries, is likely to further aggravate tension between the NATO allies. \nAltan Gocher | NurPhoto | Getty Images A photo taken in Ankara, Turkey on January 4, 2017 shows Sozcu, a Turkish opposition daily newspaper, appearing with a headline on its front page that reads 'Atilla was convicted on 5 of 6 counts' after a New York jury convicted Mehmet Hakan Atilla, former deputy manager of the Turkish Halk Bank, on 5 of 6 counts on January 3 of taking part in a billion-dollar scheme to evade American sanctions against Iran that strained relations between the U.S. and Turkey. The case has infuriated President Tayyip Erdogan and his ministers, some of whom accuse U.S. court officials of ties to a cleric blamed for a 2016 coup attempt. Some of the testimony at the trial implicated senior officials including Erdogan. \nMehmet Hakan Atilla, an executive at Turkey's majority state-owned Halkbank, was convicted on five of six counts in a Manhattan federal court on Wednesday, including bank fraud and conspiracy to violate U.S. sanctions law. \n\"It is an unjust and unfortunate development that Halkbank Deputy General Manager Mehmet Hakan Atilla was found guilty,\" Turkey's foreign ministry said in a statement. \n\"The U.S. court, in a process carried out by relying on so-called 'evidence', which is fake and open to political exploitation, ... made an unprecedented interference in Turkey's internal affairs.\" \nErdogan, who has yet to comment on the decision, has previously dismissed the trial as a politically motivated attack on his government, and attempted to use the case to tap into anti-American sentiment among nationalist supporters. \nAnkara has not, however, threatened to take concrete measures. \n'Political Plot' The U.S. case against Atilla was based on the testimony of the wealthy Turkish-Iranian gold trader Reza Zarrab, who cooperated with U.S. prosecutors and pleaded guilty to charges of leading a scheme to evade U.S. sanctions against Iran.\nDiego Cupolo | NurPhoto | Getty Images People pass in front of a HalkBank branch in central Ankara, Turkey, on 23 Oct. 2017. In his testimony, Zarrab implicated top Turkish politicians, including Erdogan. Zarrab said Erdogan, who has governed Turkey for nearly 15 years, personally authorised two Turkish banks to join the scheme when he was prime minister. \n\"The Zarrab court case is a political plot\", Deputy Prime Minister Bekir Bozdag tweeted on Thursday. \nIn a statement, Halkbank said Atilla had the right to appeal against the decision and said it had not been a party to the U.S. case and noted there had been no financial or administrative decision taken against it by the court. \nHalkbank has denied any wrongdoing and said that its transactions were in line with local and international regulations. Halkbank shares were up 2 percent at 11.14 lira in Istanbul, after earlier advancing as much as 4 percent.", "external_links": [], "published": "2018-01-04T13:12:00.000+02:00", "crawled": "2018-01-04T13:37:40.000+02:00", "highlightTitle": ""}