{"organizations": [], "uuid": "b9089b88d5217032563b2bdcc76823d0c9c327bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20180123&t=2&i=1224475652&w=1200&r=LYNXMPEE0M116", "site_section": "http://feeds.feedburner.com/Reuters/UKTopNews", "section_title": "Reuters: Top News", "url": "https://uk.reuters.com/article/uk-facebook-sandberg-privacy/facebook-to-hand-privacy-controls-to-users-ahead-of-eu-law-idUKKBN1FC1Q8", "country": "US", "domain_rank": 408, "title": "Facebook to hand privacy controls to users ahead of EU law", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-23T15:50:00.000+02:00", "replies_count": 0, "uuid": "b9089b88d5217032563b2bdcc76823d0c9c327bf"}, "author": "", "url": "https://uk.reuters.com/article/uk-facebook-sandberg-privacy/facebook-to-hand-privacy-controls-to-users-ahead-of-eu-law-idUKKBN1FC1Q8", "ord_in_thread": 0, "title": "Facebook to hand privacy controls to users ahead of EU law", "locations": [], "entities": {"persons": [{"name": "sheryl sandberg", "sentiment": "none"}, {"name": "julia fioretti", "sentiment": "none"}, {"name": "sandberg", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "facebook", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}, {"name": "general data protection regulation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 23, 2018 / 1:26 PM / Updated 3 hours ago Facebook to hand privacy controls to users ahead of EU law Julia Fioretti 3 Min Read \nBRUSSELS (Reuters) - Facebook ( FB.O ) will make it easier for its more than 2 billion users to manage their own data in response to a tough new European Union law that comes into force in May, the social network’s Chief Operating Officer Sheryl Sandberg said. \n“We’re rolling out a new privacy centre globally that will put the core privacy settings for Facebook in one place and make it much easier for people to manage their data,” Sandberg said at a Facebook event in Brussels on Tuesday. \nThe General Data Protection Regulation (GDPR) is the biggest overhaul of personal data privacy rules since the birth of the internet and aims to give Europeans more control over their information and how companies use it. \nCompanies found to be in breach of the law face a maximum penalty of 4 percent of global annual turnover or 20 million euros (17.57 million pounds), whichever is greater. \n“Our apps have long been focused on giving people transparency and control and this gives us a very good foundation to meet all the requirements of the GDPR and to spur us on to continue investing in products and in educational tools to protect privacy,” Sandberg said. \nIndustries collecting large amount of customer data - from technology companies to insurers and banks - will be affected. Slideshow (6 Images) \nFacebook’s use of customer data and tracking of people’s online activities has already come under investigation from several EU data protection authorities. CLICK TO MAKE MONEY \nSandberg said Facebook had not done enough to stop the abuse of its platform and would double the number of people working on safety and security to 20,000 by the end of the year. \nThe EU has put Internet companies on notice that it will legislate if they do not do a better job self-policing their services for extremist propaganda, hate speech and other abuses. \nFacebook - which has been criticised for failing to stop Russian-based operatives using its platform to meddle in the 2016 U.S. presidential elections - is focusing on disrupting the economic incentives to spread fake news, Sandberg said. \nMoscow denies any interference in the U.S. election. \n“People write these headlines to get clicks to make money,” she said. “So if we can prevent people from being part of our ad networks, prevent people from advertising and take away the financial incentive, that is one of the strongest things we can do against false news, and we are very focused on this.” Reporting by Julia Fioretti; editing by Alexander Smith", "external_links": [], "published": "2018-01-23T15:50:00.000+02:00", "crawled": "2018-01-23T23:36:01.005+02:00", "highlightTitle": ""}