{"organizations": [], "uuid": "a68f38a9b7b4a800c7930e07bc1703254009b863", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/BN-WX498_NISSAN_SOC_20180109153720.jpg", "site_section": "http://www.wsj.com/xml/rss/3_7014.xml", "section_title": "WSJ.com: US Business", "url": "https://www.wsj.com/articles/renault-nissan-starts-up-billion-dollar-venture-fund-for-car-technology-1515535200", "country": "US", "domain_rank": 387, "title": "Renault-Nissan Starts Up Billion-Dollar Venture Fund for Car Technology", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-10T01:21:00.000+02:00", "replies_count": 0, "uuid": "a68f38a9b7b4a800c7930e07bc1703254009b863"}, "author": "Tim Higgins", "url": "https://www.wsj.com/articles/renault-nissan-starts-up-billion-dollar-venture-fund-for-car-technology-1515535200", "ord_in_thread": 0, "title": "Renault-Nissan Starts Up Billion-Dollar Venture Fund for Car Technology", "locations": [], "entities": {"persons": [{"name": "ghosn", "sentiment": "none"}, {"name": "carlos ghosn", "sentiment": "none"}], "locations": [{"name": "las vegas", "sentiment": "none"}], "organizations": [{"name": "renault-nissan-mitsubishi alliance", "sentiment": "negative"}, {"name": "mitsubishi motors corp.", "sentiment": "none"}, {"name": "renault sa", "sentiment": "none"}, {"name": "renault-nissan", "sentiment": "none"}, {"name": "nissan motor co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS LAS VEGAS—The Renault-Nissan-Mitsubishi Alliance is creating one of the largest venture-capital funds dedicated to automotive technologies, escalating an already feverish pursuit by global auto makers to reinvent personal transportation.\nThe company said it will commit $200 million annually over five years—for a total of $1 billion—to invest in a variety of startup technologies, including battery and self-driving vehicle advances. The new corporate venture fund is part of a push by Renault-Nissan Chief Executive Carlos Ghosn to speed development of technologies that the alliance’s three auto makers don’t have in-house. \nThe message to tech startups, Mr. Ghosn said at an event tied to the CES show happening here: “Please come see us.”\nThe spending comes on top of the 8.5 billion euros ($10.1 billion) annually that Renault SA, RNO -1.31% Nissan Motor Co. NSANY 0.49% and Mitsubishi Motors Corp. invest together in research and development.\n“We will be a success if we really bring into the company the new technology for the car of the future that will [take] too long and also [be] too expensive to develop within our R&D,” said Francois Dossa, who is leading the new fund called Alliance Ventures. “The main driver is to be fast.”\nHe plans to have teams in Silicon Valley, Paris, Japan and China looking for early- to late-stage startups. Mr. Dossa’s deputy is Christian Noske, who came from the corporate venture arm of BMW AG .\nMr. Dossa said the Alliance Ventures fund has already invested in Ionic Materials Inc., a Woburn, Mass., startup working to develop solid-state batteries, a technology that holds the promise of packing more range into smaller-size batteries.\nAlliance Ventures joins a growing stable of auto makers looking to invest in the next hot startup.\nIn July, the Toyota Research Institute announced the creation of a $100 million investing arm called Toyota AI Ventures to help finance early-stage startups in the area of artificial intelligence. The Silicon Valley subsidiary of Toyota Motor Corp. is part of the Japanese auto maker’s efforts to develop autonomous vehicles.\nCorporations generally have had mixed success wading into the risky business of venture capital, which typically involves taking minority stakes in fledgling companies with unproven technology.\nVenture funds can give companies insight into the latest technological developments and flag possible acquisition targets. But these funds tend to struggle financially, since most startups fail and corporations usually invest strategically, not for pure financial gain. And founders of startups are sometimes reluctant to take money from a strategic investor out of concern the business becomes perceived as too much aligned with the corporation.\nMr. Dossa said his fund aims to address concerns about working with corporate funds by moving quickly on investment decisions, keeping investment agreements, known as term sheets, simple, and by not requiring exclusivity. “We intend to create real partners,” he said.\nInvestors around the world have poured money into automotive technology as programs by Alphabet Inc.’s Waymo self-driving unit and Tesla Inc. have gained attention and stoked new enthusiasm for autonomous vehicles and electric cars.\nGeneral Motors Co. acquired a San Francisco startup called Cruise Automation in a deal potentially valued at more than $1 billion to jump-start its autonomous effort. Aptiv PLC, an automotive-technology company that was spun out of parts marker Delphi last year, acquired autonomous-vehicle software startup NuTonomy for $450 million in October. \nWrite to Tim Higgins at Tim.Higgins@WSJ.com", "external_links": [], "published": "2018-01-10T01:21:00.000+02:00", "crawled": "2018-01-10T04:21:45.006+02:00", "highlightTitle": ""}