{"organizations": [], "uuid": "85769cb3255eb08834ada99c4f423751b179e760", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "//sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/cnbc_logo.gif", "site_section": "http://www.cnbc.com/id/10000027", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/03/business-wire-u-s-legal-support-acquires-court-reporting-training-program.html", "country": "US", "domain_rank": 767, "title": "U.S. Legal Support Acquires Court Reporting Training Program", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.008, "site_type": "news", "published": "2018-01-03T21:25:00.000+02:00", "replies_count": 0, "uuid": "85769cb3255eb08834ada99c4f423751b179e760"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/03/business-wire-u-s-legal-support-acquires-court-reporting-training-program.html", "ord_in_thread": 0, "title": "U.S. Legal Support Acquires Court Reporting Training Program", "locations": [], "entities": {"persons": [{"name": "jim connor", "sentiment": "none"}, {"name": "stenotrain", "sentiment": "none"}, {"name": "connor", "sentiment": "none"}], "locations": [{"name": "houston", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "u.s. legal support acquires court reporting training program", "sentiment": "negative"}, {"name": "crr", "sentiment": "none"}, {"name": "rpr", "sentiment": "none"}, {"name": "u.s. legal support, inc.", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "HOUSTON--(BUSINESS WIRE)-- The court reporting industry is experiencing a crisis nationwide. Increased demand for professional court reporters, significant retirement rates and low enrollment rates have led industry experts to predict an immediate, critical shortage of more than 5,500 reporters nationwide.\nU.S. Legal Support, Inc., the nation’s leading provider of litigation support services including court reporters, record retrieval and trial services, is committed to resolving this crisis. As part of its commitment, U.S. Legal Support proudly announces its acquisition of online court reporting program, Stenotrain.\nIn the August 2017 article “Court Reporter Shortage: What This Means for the Industry and for Reporters”, Jim Connor, RPR, CRR shares: “Court reporting schools across the nation have reported a steady decrease in enrollment over the last two decades. The schools attribute this trend to low-awareness and the push toward four-year degree programs.”\n“Low awareness among young prospects contributes greatly to the current court reporter shortage,\" Connor continues.\n\"To help overcome this, the industry would benefit greatly by making itself more visible. If court reporting firms, seasoned reporters and schools more effectively advocate for the benefits of this career path, perhaps awareness and interest will begin to spread. Court reporting can be a fulfilling, lucrative career, and with the current shortage, opportunities for young professionals are boundless.”\nWith this strategic acquisition, U.S. Legal Support is heeding the call.\nJennifer Gaul will spearhead this program in her role as U.S. Legal Support’s Senior Vice President, Court Reporter Relations. Jennifer’s passion for court reporting and commitment to the profession’s continual improvement is deeply rooted in more than 20 years of experience. In her current role, she focuses on reporter training, education, recruiting and development across the United States.\nThis acquisition is the next step in U.S. Legal Support’s continuing commitment to lead the charge in identifying solutions to the court reporting profession’s ever-growing shortage.\nAbout U.S. Legal Support\nU.S. Legal Support, Inc. founded in 1996 is a privately held company with over 75 offices located across the United States. As one of the leading providers of litigation services, we are the only litigation support company that provides court reporting, record retrieval, eDiscovery and trial services to major corporations and law firms nationwide.\nFor more information visit: www.uslegalsupport.com\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180103006009/en/\nU.S. Legal Support, Inc.\nJenny Stone, 800-993-4464\nExecutive Assistant\njstone@uslegalsupport.com\nSource: U.S. Legal Support, Inc.", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.uslegalsupport.com&esheet=51737445&newsitemid=20180103006009&lan=en-US&anchor=www.uslegalsupport.com&index=1&md5=1bd1f03b9428e10f96b8b4e5c628f2c1", "http://www.businesswire.com/news/home/20180103006009/en/"], "published": "2018-01-03T21:25:00.000+02:00", "crawled": "2018-01-03T22:45:01.002+02:00", "highlightTitle": ""}