{"organizations": [], "uuid": "dd16b8eea5bdbdb8fdb6f6f96bf44847df0f4570", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/3", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-c-o-r-r-e-c-t-i-o-n--fidelity-national-financial-inc.html", "country": "US", "domain_rank": 767, "title": "/C O R R E C T I O N -- Fidelity National Financial, Inc./", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-01-31T00:49:00.000+02:00", "replies_count": 0, "uuid": "dd16b8eea5bdbdb8fdb6f6f96bf44847df0f4570"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/pr-newswire-c-o-r-r-e-c-t-i-o-n--fidelity-national-financial-inc.html", "ord_in_thread": 0, "title": "/C O R R E C T I O N -- Fidelity National Financial, Inc./", "locations": [], "entities": {"persons": [], "locations": [{"name": "fla.", "sentiment": "none"}, {"name": "jacksonville", "sentiment": "none"}], "organizations": [{"name": "fidelity national financial, inc", "sentiment": "neutral"}, {"name": "fidelity national financial, inc.", "sentiment": "neutral"}, {"name": "nyse", "sentiment": "none"}, {"name": "fnf", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "In the news release, Fidelity National Financial, Inc. Announces Quarterly Cash Dividend of $0.27, issued 30-Jan-2018 by Fidelity National Financial, Inc. over PR Newswire, we are advised by the company that the headline and first paragraph, first sentence, have been updated to reflect the $0.30 quarterly cash dividend and 11% increase rather than a $0.27 quarterly cash dividend as originally issued inadvertently. The complete, corrected release follows:\nFidelity National Financial, Inc. Announces 11% Increase in Quarterly Cash Dividend to $0.30\nJACKSONVILLE, Fla., Jan. 30, 2018 /PRNewswire/ -- Fidelity National Financial, Inc. (NYSE: FNF) today announced that its Board of Directors has declared an increased quarterly cash dividend of $0.30 per share, an 11% increase from the previous quarterly cash dividend of $0.27. The dividend will be payable March 30, 2018, to stockholders of record as of March 16, 2018.\nAbout Fidelity National Financial, Inc.\nFidelity National Financial, Inc. is a leading provider of title insurance and transaction services to the real estate and mortgage industries. FNF is the nation's largest title insurance company through its title insurance underwriters - Fidelity National Title, Chicago Title, Commonwealth Land Title, Alamo Title and National Title of New York - that collectively issue more title insurance policies than any other title company in the United States. More information about FNF can be found at www.fnf.com .\nForward-Looking Statements\nThis press release contains forward-looking statements that involve a number of risks and uncertainties. Statements that are not historical facts, including statements regarding our expectations, hopes, intentions or strategies regarding the future are forward-looking statements. Forward-looking statements are based on management's beliefs, as well as assumptions made by, and information currently available to, management. Because such statements are based on expectations as to future financial and operating results and are not statements of fact, actual results may differ materially from those projected. We undertake no obligation to update any forward-looking statements, whether as a result of new information, future events or otherwise. The risks and uncertainties which forward-looking statements are subject to include, but are not limited to: changes in general economic, business and political conditions, including changes in the financial markets; weakness or adverse changes in the level of real estate activity, which may be caused by, among other things, high or increasing interest rates, a limited supply of mortgage funding or a weak U. S. economy; our potential inability to find suitable acquisition candidates, acquisitions in lines of business that will not necessarily be limited to our traditional areas of focus, or difficulties in integrating acquisitions; our dependence on distributions from our title insurance underwriters as a main source of cash flow; significant competition that our operating subsidiaries face; compliance with extensive government regulation of our operating subsidiaries; and other risks detailed in the \"Statement Regarding Forward-Looking Information,\" \"Risk Factors\" and other sections of the Company's Form 10-K and other filings with the Securities and Exchange Commission.\nFNF - D\nView original content: http://www.prnewswire.com/news-releases/fidelity-national-financial-inc-announces-quarterly-cash-dividend-of-027-300590675.html\nSOURCE Fidelity National Financial, Inc.", "external_links": ["http://www.prnewswire.com/news-releases/fidelity-national-financial-inc-announces-quarterly-cash-dividend-of-027-300590675.html", "http://www.fnf.com/"], "published": "2018-01-31T00:49:00.000+02:00", "crawled": "2018-01-31T02:12:56.004+02:00", "highlightTitle": ""}