{"organizations": [], "uuid": "df9a720d41f6c33829f4fe7590cafc455bd7f0a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKBankingFinancial", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/greece-media/six-media-groups-submit-bids-for-greek-tv-licences-idUSL8N1P62ZG", "country": "US", "domain_rank": 408, "title": "Six media groups submit bids for Greek TV licences", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-11T17:09:00.000+02:00", "replies_count": 0, "uuid": "df9a720d41f6c33829f4fe7590cafc455bd7f0a5"}, "author": "", "url": "https://www.reuters.com/article/greece-media/six-media-groups-submit-bids-for-greek-tv-licences-idUSL8N1P62ZG", "ord_in_thread": 0, "title": "Six media groups submit bids for Greek TV licences", "locations": [], "entities": {"persons": [{"name": "alexis tsipras", "sentiment": "none"}], "locations": [{"name": "greece", "sentiment": "none"}, {"name": "athens", "sentiment": "none"}], "organizations": [{"name": "greek tv", "sentiment": "negative"}, {"name": "council of state", "sentiment": "none"}, {"name": "ncrt", "sentiment": "none"}, {"name": "reuters staff", "sentiment": "none"}, {"name": "national council for radio and television", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 11, 2018 / 3:10 PM / Updated 44 minutes ago Six media groups submit bids for Greek TV licences Reuters Staff 3 Min Read \nATHENS, Jan 11 (Reuters) - Six media groups have applied to get TV licenses in Greece in the latest effort by government to shake up what it sees as a debt-ridden, unregulated broadcasting sector. \nIf all are successful, it would be mean a reduction from eight, but still a larger number than the government originally wanted. \nLicensing Greece’s television broadcasters has been an major objective of Prime Minister Alexis Tsipras’s left-led government, which has called them “vampires” living on borrowed funds that they cannot repay. \nIn 2016 a licence auction, held by the government amid protests, cut the number of nationwide broadcasters to four. But it was ruled unconstitutional by Greece’s top administrative court, the Council of State. \nIt was annulled mainly because it was not overseen by the independent regulator, the National Council for Radio and Television (NCRT). \nLast year, the NCRT invited media groups to express again interest for seven 10-year licenses, at a starting price of 35 million euros. \n“Six applications were submitted to the NCRT,” the council said on its website. \nAccording to the tender announcement, if the final bidders were fewer than seven then each would be automatically granted a license -- provided they qualify. Any unallocated licenses would be re-tendered. \nThe six tenderers were SKAI TV, STAR channel, Alpha, Antenna, E TV and the newly-founded Tileoptiki Elliniki. They have already submitted a bid bond of 3.5 million euros. \nGreek state-owned broadcaster ERT already has a de facto licence. \nThe applications will be unsealed on Monday and reviewed by the NCRT which will then announce a list of which tenderers qualify. Bidders have the right to object against NRCT’s list. The process could take months to be concluded. \nPrivate radio stations and TV channels emerged in Greece only in the late 1980s, after decades of state media control. \nThe previous auction, Greece’s first ever, was overseen by Tsipras’s closest aide State Minister Nikos Pappas and its annulment was seen as a blow to the government. \n“If there is political will and readiness by the institutions and the regulatory authorities everything is possible,” Pappas told reporters on Thursday. (Reporting by Renee Maltezou Editing by Jeremy Gaunt.)", "external_links": [], "published": "2018-01-11T17:09:00.000+02:00", "crawled": "2018-01-11T17:46:59.021+02:00", "highlightTitle": ""}