{"organizations": [], "uuid": "7fb020f118a0b5f9094bfd0217efe6cc1487556a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/companyNews", "section_title": "Reuters: Company News", "url": "https://www.reuters.com/article/india-morningcall/morning-news-call-india-january-24-idUSL4N1PJ15P", "country": "US", "domain_rank": 408, "title": "Morning News Call - India, January 24", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "", "spam_score": 0.088, "site_type": "news", "published": "2018-01-24T11:37:00.000+02:00", "replies_count": 0, "uuid": "7fb020f118a0b5f9094bfd0217efe6cc1487556a"}, "author": "Reuters Editorial", "url": "https://www.reuters.com/article/india-morningcall/morning-news-call-india-january-24-idUSL4N1PJ15P", "ord_in_thread": 0, "title": "Morning News Call - India, January 24", "locations": [], "entities": {"persons": [{"name": "bhargav dasgupta", "sentiment": "none"}, {"name": "ashok gajapati raju", "sentiment": "none"}, {"name": "jianwen liao", "sentiment": "none"}, {"name": "ashok kumar", "sentiment": "none"}, {"name": "nitin gadkari", "sentiment": "none"}], "locations": [{"name": "india", "sentiment": "none"}, {"name": "new delhi", "sentiment": "none"}, {"name": "mumbai", "sentiment": "none"}], "organizations": [{"name": "opd", "sentiment": "none"}, {"name": "pnb housing finance", "sentiment": "none"}, {"name": "bank of baroda ceo p.s. jayakumar", "sentiment": "none"}, {"name": "rcs udan", "sentiment": "none"}, {"name": "icici lombard general insurance", "sentiment": "none"}, {"name": "interglobe aviation", "sentiment": "none"}, {"name": "bank of baroda", "sentiment": "none"}, {"name": "ist", "sentiment": "none"}, {"name": "united spirits", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "To access the newsletter, click on the link: here If you would like to receive this newsletter via email, please register at: here FACTORS TO WATCH 8:15 am: PNB Housing Finance post-earnings analyst conference call in Mumbai. 11:00 am: Bank of Baroda CEO P.S. Jayakumar and Bank of Baroda Executive Director Ashok Kumar at launch of 5x rewards credit cards in Mumbai. 11:30 am: ICICI Lombard General Insurance MD & CEO Bhargav Dasgupta at launch of OPD solution in New Delhi. 12:00 pm: United Spirits post-earnings analyst conference call in Mumbai. 3:00 pm: Idea Cellular post-earnings analyst conference call in Mumbai. 4:00 pm: Aviation Minister Ashok Gajapati Raju to brief media about second round of bidding under RCS UDAN in New Delhi. 4:30 pm: Transport Minister Nitin Gadkari at Rural and Farm Resurgence event in New Delhi. 5:00 pm: InterGlobe Aviation Q3 earnings conference call in Mumbai. GMF:LIVECHAT-DAVOS. Dr. Jianwen Liao Chief Strategic Officer, JD.Com talks to us at 01:30 pm IST about the company’s strategic plans for the future. To join the conversation, click on the link: here INDIA TOP NEWS • Indian PM Modi defends globalization at Davos summit Indian Prime Minister Narendra Modi mounted a defense of globalization at the World Economic Forum on Tuesday, urging joint action on climate change and economic cooperation, in a speech some delegates took as a swipe at U.S. President Donald Trump's America First agenda. • Budget airline AirAsia to add around 30 jets this year amid strong demand - CEO Budget airline group AirAsia AIRA.KL plans to add around 30 jets to its airline affiliates across Asia this year due to strong demand growth across the region, Chief Executive Tony Fernandes said on Tuesday. • ONGC raises $2.38 billion from banks to buy refinery stake India's top explorer Oil and Natural Gas Corp (ONGC) has secured a $2.83 billion loan from three banks to part fund its $5.8 billion acquisition of state-refiner Hindustan Petroleum Corp, ONGC said on Tuesday. • India police to investigate NTPC, MMTC, others over coal imports India's federal investigator will probe top state-run utility NTPC and state-owned company MMTC, over whether they were involved in a scheme to import inferior quality coal from Indonesia and pass it off as superior grade. • United Spirits Q3 profit down 9 percent, misses estimates United Spirits, India's largest liquor company, posted about 9 percent fall in third-quarter profit on Tuesday and missed estimates, hurt by higher marketing investment. GLOBAL TOP NEWS • Job creator, or job killer? Trump angers solar installers with panel tariff U.S. President Donald Trump signed into law a steep tariff on imported solar panels on Tuesday, a move billed as a way to protect American jobs but which the solar industry said would lead to thousands of layoffs and raise consumer prices. • Japan's record exports to Asia raise hopes for Q4 growth Japan's exports grew for a 13th straight month in December, led by record demand from China and Asia as a whole, raising the prospects for vigorous economic growth in the fourth quarter. • Trump Cabinet member Sessions interviewed in U.S. Russia probe U.S. Attorney General Jeff Sessions was questioned last week by the special counsel's office investigating potential collusion between Russia and President Donald Trump's 2016 presidential campaign, the U.S. Justice Department said on Tuesday. LOCAL MARKETS OUTLOOK (As reported by NewsRise) • The SGX Nifty Futures were trading at 11,060.50, trading down 0.23 pct from its previous close. • The Indian rupee will likely trade steady-to-higher against the dollar in early session, on weak greenback demand amid renewed speculation that the European Central Bank may consider tightening at its policy meeting that ends tomorrow. • Indian government bonds are likely to trade largely unchanged as investors await supply of notes through auctions today and tomorrow. The yield on the 7.17 pct bond maturing in 2028 is likely to trade in a 7.23 pct-7.28 pct band today. GLOBAL MARKETS • U.S. stocks advanced on Tuesday, as strong results from Netflix helped lift the S&P and Nasdaq Composite, but the Dow Industrials were hemmed in by declines in Johnson & Johnson and Procter & Gamble. • Asian shares markets took a time out as investors were left breathless at the breakneck pace of recent gains, while a fresh burst of speculative selling took the U.S. dollar to three-year lows. • The dollar touched a four-month low against the yen, pressured by simmering concerns that the U.S. currency's yield advantage will start to erode as major central banks head toward unwinding their massive stimulus. • U.S. Treasury debt yields weakened on Tuesday in quiet trading, moving in tandem with Japanese government bond yields, after the Bank of Japan kept interest rate targets unchanged and its top official quashed speculation of a move away from an easy monetary policy. • Oil prices fell, weighed down by data that showed an increase in U.S. crude oil and gasoline inventories. • Gold prices held steady, drifting around four-month highs hit last week, as the U.S. dollar fell to fresh three-year lows. CLOSE FII INVESTMENTS EQUITIES DEBT PNDF spot 63.82/63.85 January 23 $192.78mln $99.73mln 10-yr bond yield 7.41 pct Month-to-date $1.23bln $977.60mln Year-to-date $1.23bln $977.60mln For additional data: India govt bond market volumes Stock market reports Non-deliverable forwards data Corporate debt stories [IN CORPD] Local market closing/intraday levels [IN SNAPSHOT] Monthly inflows [INFLOWS RTRS TABLE IN] ($1 = 63.75 Indian rupees) (Compiled by Nishit Kunal in Bengaluru)\n ", "external_links": ["http://thomsonreuters.com/en/about-us/trust-principles.html", "https://forms.thomsonreuters.com/india-morning/", "http://share.thomsonreuters.com/assets/newsletters/Indiamorning/MNC_IN_01242018.pdf", "https://forms.thomsonreuters.com/communities/"], "published": "2018-01-24T11:37:00.000+02:00", "crawled": "2018-01-24T06:39:42.022+02:00", "highlightTitle": ""}