{"organizations": [], "uuid": "158dd799fd333a94908f00707a76ad75c04fb03f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "http://feeds.reuters.com/reuters/UKbankingFinancial/", "section_title": "Reuters: Financial Services and Real Estate", "url": "https://www.reuters.com/article/us-metrovacesa-ipo/metrovacesa-plans-flotation-valuing-company-at-up-to-2-95-billion-euros-idUSKBN1FB12D", "country": "US", "domain_rank": 408, "title": "UPDATE 1-Metrovacesa plans flotation valuing company at up to 2.95 bln euros", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-22T11:49:00.000+02:00", "replies_count": 0, "uuid": "158dd799fd333a94908f00707a76ad75c04fb03f"}, "author": "", "url": "https://www.reuters.com/article/us-metrovacesa-ipo/metrovacesa-plans-flotation-valuing-company-at-up-to-2-95-billion-euros-idUSKBN1FB12D", "ord_in_thread": 0, "title": "UPDATE 1-Metrovacesa plans flotation valuing company at up to 2.95 bln euros", "locations": [], "entities": {"persons": [{"name": "andrés gonzález", "sentiment": "none"}, {"name": "sonya dowsett", "sentiment": "none"}], "locations": [{"name": "catalonia", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "madrid", "sentiment": "none"}, {"name": "spain", "sentiment": "none"}], "organizations": [{"name": "metrovacesa", "sentiment": "negative"}, {"name": "barcelona", "sentiment": "none"}, {"name": "reuters", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MADRID (Reuters) - Spanish builder Metrovacesa said it planned a February initial public offering at a price valuing the company at up to 2.95 billion euros ($3.6 bln), providing a test for investor appetite after a political crisis threatened to split the country.\nThe residential developer, which was taken over by creditors during the country’s property crash, said it would float on Spanish stock exchanges including Madrid and Barcelona at a price range of 18 to 19.5 euros a share on Feb. 5.\nMetrovacesa, whose main shareholders are Spanish banks Santander ( SAN.MC ) and BBVA ( BBVA.MC ), said the flotation was aimed at widening its shareholder base to ease access to capital markets and financing for projects.\nMetrovacesa has significant exposure to Catalonia and its IPO is seen as a gauge of investor appetite for Spain after a separatist drive in the northeastern region spooked the business community and led to thousands of companies moving their registered headquarters away from Catalonia.\nMetrovacesa’s flotation will be the first stock market listing in Spain since the central government fired the Catalan administration and took direct control of the region in an attempt to derail the independence movement.\nHousebuilder Aedas ( AEDAS.MC ) wobbled on its market debut at the height of the crisis on Oct. 20.\nMetrovacesa has a greater exposure to Catalonia than Aedas with nearly a fifth of assets located in the region. However, Spain is one of the euro zone’s fastest-growing economies and investor sentiment has bounced back after the Catalan secession drive knocked confidence.\nFitch upgraded its rating on Spain to ‘A-’ on Friday and the premium investors demand to hold Spanish bonds over their German equivalents fell to its lowest level in nearly eight years.Residential construction is thriving in Spain with foreign investment pouring into projects a decade after a property bubble burst and led to an international bailout of the country’s banks that were exposed to developers’ bad loans.\nMetrovacesa’s final offering price is expected to be determined on, or around, Feb. 1 following the completion of the book-building process which started on Monday.\nIt will offer up to 39 million shares, or 25.8 percent of its capital, with the over-allotment option taking this up to just under 30 percent.\nBBVA, Santander, Deutsche Bank and Morgan Stanley are the joint global coordinators and joint bookrunners for the offer.\nGoldman Sachs and Societe Generale are additional joint bookrunners, the company said in its statement.\nAdditional reporting by Robert Hetz; Editing by Paul Day and Susan Fenton\n ", "external_links": [], "published": "2018-01-22T11:49:00.000+02:00", "crawled": "2018-01-22T12:21:43.036+02:00", "highlightTitle": ""}