{"organizations": [], "uuid": "0162a8eab4cac2156e2d519abf192866ee0f0c62", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/2", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-ssc-names-rishi-khanna-as-managing-director-of-alternative-assets-technology.html", "country": "US", "domain_rank": 767, "title": "SS&C Names Rishi Khanna as Managing Director of Alternative Assets Technology", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-01-24T17:00:00.000+02:00", "replies_count": 0, "uuid": "0162a8eab4cac2156e2d519abf192866ee0f0c62"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/24/pr-newswire-ssc-names-rishi-khanna-as-managing-director-of-alternative-assets-technology.html", "ord_in_thread": 0, "title": "SS&C Names Rishi Khanna as Managing Director of Alternative Assets Technology", "locations": [], "entities": {"persons": [{"name": "rishi khanna", "sentiment": "negative"}, {"name": "rahul kanwar", "sentiment": "none"}, {"name": "rishi", "sentiment": "none"}, {"name": "khanna", "sentiment": "none"}], "locations": [{"name": "windsor", "sentiment": "none"}, {"name": "conn.", "sentiment": "none"}], "organizations": [{"name": "ss&c", "sentiment": "negative"}, {"name": "ss&c technologies holdings, inc.", "sentiment": "neutral"}, {"name": "gerson lehrman group", "sentiment": "none"}, {"name": "tnr solution", "sentiment": "none"}, {"name": "novus", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WINDSOR, Conn., Jan. 24, 2018 /PRNewswire/ -- SS&C Technologies Holdings, Inc. (Nasdaq: SSNC), a global provider of financial services software and software-enabled services, today announced the hiring of Rishi Khanna as Managing Director for SS&C GlobeOp. A seasoned executive with expertise in portfolio management and financial services technology, Mr. Khanna will oversee the alternative assets technology business and report to Rahul Kanwar, Executive Vice President.\nMr. Khanna most recently served as Co-Founder and President of Novus, a leading portfolio intelligence platform for institutional asset allocators and investment managers. Prior to co-founding Novus, Rishi was responsible for the development of the technology and product platforms for Gerson Lehrman Group. In his new role, Mr. Khanna is responsible for overseeing the product organizations which deliver SS&C's leading cloud-based alternative asset solutions including TNR Solution, Total Return, and AdvisorWare. He will focus on building the next generation products to provide clients with innovative solutions that drive efficiency and improved performance.\n\"I am excited to join the global management team at SS&C where I look forward to pushing and supporting its leading alternative asset management business forward,\" said Rishi Khanna. \"Having recently served as co-founder of my own technology company, I am eager to bring the skills that I have gained, and the expertise I have developed, to continue SS&C's progression as the largest provider of technology and fund administration services.\"\nMr. Khanna will join Joe Patellaro, Managing Director, Global Head of Private Equity at SS&C, at the Private Equity International CFOs and COOs Forum 2018. Together they will present some SS&C's current capabilities and share their vision for the future of Private Equity technology and services on the Technology Spotlight panel today, January 24 at 2:40 p.m. EST.\n\"Rishi has a proven track record of developing product platforms for an array of alternative asset management firms,\" said Rahul Kanwar, Executive Vice President, SS&C Technologies. \"He is an experienced operator, entrepreneur, and product strategist and will be responsible for delivering our alternative asset customers with market leading innovation\".\"\nMr. Khanna holds a BS in Computer Science from Cornell University.\nAbout SS&C Technologies\nSS&C is a global provider of investment and financial software-enabled services and software for the global financial services industry. Founded in 1986, SS&C is headquartered in Windsor, Connecticut and has offices around the world. Some 11,000 financial services organizations, from the world's largest institutions to local firms, manage and account for their investments using SS&C's products and services.\nAdditional information about SS&C (Nasdaq: SSNC) is available at www.ssctech.com . Follow SS&C on Twitter, Linkedin and Facebook.\nView original content with multimedia: http://www.prnewswire.com/news-releases/ssc-names-rishi-khanna-as-managing-director-of-alternative-assets-technology-300587310.html\nSOURCE SS&C", "external_links": ["http://www.ssctech.com/", "http://www.prnewswire.com/news-releases/ssc-names-rishi-khanna-as-managing-director-of-alternative-assets-technology-300587310.html"], "published": "2018-01-24T17:00:00.000+02:00", "crawled": "2018-01-24T16:54:30.003+02:00", "highlightTitle": ""}