{"organizations": [], "uuid": "3fc2285352e4fdf387c0aa6b00967263fbedfc71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "", "site_section": "http://www.cnbc.com/id/10000027/page/6", "section_title": "Press Releases - CNBC", "url": "http://www.cnbc.com/2018/01/30/business-wire-cerus-announces-public-offering-of-common-stock.html", "country": "US", "domain_rank": 767, "title": "Cerus Announces Public Offering of Common Stock", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "", "spam_score": 0.176, "site_type": "news", "published": "2018-01-31T00:13:00.000+02:00", "replies_count": 0, "uuid": "3fc2285352e4fdf387c0aa6b00967263fbedfc71"}, "author": "cnbc.com", "url": "http://www.cnbc.com/2018/01/30/business-wire-cerus-announces-public-offering-of-common-stock.html", "ord_in_thread": 0, "title": "Cerus Announces Public Offering of Common Stock", "locations": [], "entities": {"persons": [], "locations": [{"name": "common stock concord", "sentiment": "none"}, {"name": "calif.", "sentiment": "none"}], "organizations": [{"name": "cerus corporation", "sentiment": "negative"}, {"name": "cerus", "sentiment": "negative"}, {"name": "securities and exchange commission", "sentiment": "none"}, {"name": "sec", "sentiment": "none"}, {"name": "llc", "sentiment": "none"}, {"name": "btig", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "CONCORD, Calif.--(BUSINESS WIRE)-- Cerus Corporation (NASDAQ: CERS) today announced that it has commenced a registered underwritten public offering of $50.0 million of its common stock. In addition, Cerus has granted the underwriter a 30-day option to purchase up to an additional $7.5 million of its common stock. All of the shares to be sold in the offering are to be sold by Cerus.\nBTIG, LLC is acting as sole book-running manager for the offering.\nA shelf registration statement on Form S-3 relating to the public offering of the shares of common stock described above was declared effective by the Securities and Exchange Commission (the “SEC”) on January 8, 2018. Before you invest, you should read the prospectus in the registration statement and related preliminary prospectus supplement that Cerus will file with the SEC for more complete information about Cerus and this offering. An electronic copy of the preliminary prospectus supplement and accompanying prospectus relating to the offering will be available on the website of the SEC at www.sec.gov . Copies of the final prospectus supplement and the accompanying prospectus relating to the offering may be obtained, when available, by contacting BTIG, LLC, at 825 Third Avenue, 6th Floor, New York, NY, 10022, or by telephone at (212) 593-7555 or by e-mail at equitycapitalmarkets@btig.com .\nThis press release shall not constitute an offer to sell or the solicitation of an offer to buy these securities, nor shall there be any sale of these securities in any state or other jurisdiction in which such offer, solicitation or sale would be unlawful prior to the registration or qualification under the securities laws of any such state or other jurisdiction.\nABOUT CERUS\nCerus Corporation is a biomedical products company focused in the field of blood transfusion safety. Cerus currently markets and sells the INTERCEPT Blood System for both platelets and plasma in the United States, Europe, the Commonwealth of Independent States, the Middle East and selected countries in other regions around the world. The INTERCEPT Red Blood Cell system is in clinical development.\nINTERCEPT and the INTERCEPT Blood System are trademarks of Cerus Corporation.\nForward-Looking Statements\nThis press release contains Any statements contained in this press release that are not statements of historical fact may be deemed to be , including, without limitation, statements relating to Cerus’ public offering. These are based upon Cerus’ current expectations. Actual results could differ materially from these as a result of certain factors, including, without limitation, risks related to market conditions and the satisfaction of customary closing conditions related to the proposed public offering, risks related to the application of the net proceeds from the proposed public offering, risks associated with the uncertain research and product development process, and other risks detailed in Cerus' filings with the SEC, including in Cerus' quarterly report on Form 10-Q September 30, 2017, filed with the SEC on November 3, 2017 and in the preliminary prospectus supplement related to the proposed offering filed with the SEC on January 30, 2018. You are cautioned not to place undue reliance on these , which speak only as of the date of this press release. Cerus does not undertake any obligation to update any as a result of new information, future events, changed assumptions or otherwise.\nView source version on businesswire.com : http://www.businesswire.com/news/home/20180130006379/en/\nCerus Corporation\nTim Lee, 925-288-6137\nInvestor Relations Director\nSource: Cerus Corporation", "external_links": ["http://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=51751101&newsitemid=20180130006379&lan=en-US&anchor=www.sec.gov&index=1&md5=ea9641141d72043c7b93d953e0c0d884", "http://www.businesswire.com/news/home/20180130006379/en/"], "published": "2018-01-31T00:13:00.000+02:00", "crawled": "2018-01-31T03:09:39.008+02:00", "highlightTitle": ""}